{
    "case_title": "Tan Shwu Leng v Singapore Airlines Limited and Another",
    "ncitation": "[2001] SGHC 51",
    "coram": "Woo Bih Li JC",
    "sections": {
        "MS TANS APPEAL TO THE COURT OF APPEAL": "17.    I will deal with Ms Tans appeal first. It is against\n\nthat part of my order:(a)    in respect of pre-trial earnings,(b)    in respect of loss of future earnings,(c)    in respect of costs from the date of the Offer to the\n\n  date of the decision by AR Tan.18.    In other words, Ms Tan has not appealed against my decision\n\nin respect of pain and suffering or in respect of her claim for medical and transport expenses.",
        "Loss of Pre-Trial Earnings": "19.    As regards Ms Tans appeal to the Court of Appeal in\n\nrespect of pre-trial earnings, Ms Tan is claiming that the $91,302.12 deducted by AR Tan as work\n\nexpenses should be added back entirely or partially to her pre-trial earnings.20.    Ms Tan had been claiming various allowances which she would\n\nhave earned as a cabin crew but for the injury.21.    However AR Tan had decided that expenses which Ms Tan would\n\nhave incurred in earning the lost income had to be deducted relying onLim Poh Choo v Camden\n\n& Islington Area Health Authority[1980] AC 174 at 191. Such expenses would be for, inter\n\nalia, meals and transport while Ms Tan was not in Singapore, had she still been a cabin crew.22.    Before me, Mr Ramakrishnan argued that such a deduction\n\nshould not have been made.23.    As a matter of law, he relied onLim Poh Chooscase\n\n(cited above) andDews v National Coal Board[1988] 1 AC 1.24.    However,Lim Poh Chooscase did not assist Mr\n\nRamakrishnan. It is authority for the principle that expenses incurred in earning income may be\n\ndeducted from damages to be awarded to avoid over-compensating a plaintiff. While expenses which Ms\n\nTan would have incurred are not literally spent to earn the income, they had to be deducted to\n\navoid over-compensating Ms Tan.25.    The case ofDewsalso did not assist Mr\n\nRamakrishnan. The passage he cited, at p 13 states:One is, however, left with the fact that wherever a man lives he is likely\n\n  to incur some travelling expenses to work which will be saved during his period of incapacity, and\n\n  they are strictly expenses necessarily incurred for the purpose of earning his living. It would,\n\n  however, be intolerable in every personal injury action to have an inquiry into travelling\n\n  expenses to determine that part necessarily attributable to a chosen life-style. I know of no case\n\n  in which travelling expenses to work have been deducted from a weekly wage, and although the point\n\n  does not fall for decision, I do not encourage any insurer or employer to seek to do so.26.    However, the passage goes on to say:I can, however, envisage a case where travelling expenses loom as so large\n\n  an element in the damage that further consideration of the question would be justified as, for\n\n  example, in the case of a wealthy man who commuted daily by helicopter from the Channel Islands of\n\n  London. I have only touched on the question of travelling expenses to show that in the field of\n\n  damages for personal injury principles must sometimes yield to common sense, and to acknowledge\n\n  the force of Mr. Alexanders submission that the calculation of loss in personal injury cases\n\n  should be kept simple as a matter of policy, particularly where the sums involved do not justify\n\n  the costs likely to be incurred by elaborate investigations.27.    Therefore, usually the travelling expenses of a plaintiff\n\nare too small to be inquired into.28.    However the situation before me was different. Ms Tan was\n\nclaiming allowances which she would have earned if she had not been injured but, at the same time,\n\nshe would have incurred various expenses if she had not been injured.29.    Mr Ramakrishnan also cited another passage fromDewsat p 14:In respect of this part of his earnings the object of which is to provide\n\n  income available for current expenditure the tortfeasor is, subject to sums necessarily spent to\n\n  earn the income, entitled to no credit for expenditure saved as a result of the injury; the\n\n  principle that it is no concern of the tortfeasor how the plaintiff chooses to spend his income\n\n  applies.30.    In my view, this passage did not assist him and, on the\n\ncontrary, supported the Defendants position. It reflected the same principle asLim Poh Chooscase.31.    Mr Ramakrishnan also cited the following passage from the\n\njudgment of Selvam JC, as he then was, inBalasubramaniam s/o Rajoo a minor suing by his father v\n\nSingapore Airlines Limited and another(apparently unreported) which said:Laundry and incentive allowance were given only for full attendance.\n\n  However, there was no suggestion that the plaintiff was prone to absenteeism. Accordingly it\n\n  should be included in the salary.32.    It was clear from the passage cited that it was in respect\n\nof different facts.33.    Furthermore, Ms Tan had conceded in her evidence that any\n\ndamages for loss of earnings should take into account expenses normally incurred whilst flying (see\n\nNE of 31 July 2000 at p 6D).34.    On this point, evidence had been given by one Peter Chong,\n\nAssistant Manager (Check/Training), Crew Performance Department, for SIA, that cabin crew spend\n\nabout 40% of their (entire) monthly allowances on such expenses.35.    The $91,302.12 deducted by AR Tan represents the 40%\n\ndeduction in the assessment of loss of pre-trial earnings.36.    Mr Ramakrishnan then argued that the 40% deduction should\n\nnot apply to the Inflight Allowance as it was more of an incentive allowance and not a reimbursement\n\nfor expenses to be incurred. He also pointed out that Mr Tehs Closing Submission at p 13 para 43\n\nadmitted that it should be excluded. Following this line of argument, he also argued that the 40%\n\ndeduction should not apply to Turnaround Allowance.37.    Mr Ramakrishnan also argued that a deduction of 40% was\n\nexcessive because:(a)    Crew meals are provided on most flights;(b)    Options to have meals consumed outside crews hotel,\n\n  eg. eateries in Chinatown, fast food outlets and take aways and etc would result in lower costs\n\n  than dining via room-service or in-house restaurants and cafeteria and crews hotels during\n\n  overseas layover;(c)    Options for laundry done at home instead of sending to a\n\n  launderette;(d)    Option to travel by bus and MRT to get to and from the\n\n  airport instead of relying on taxi for turnaround flights.38.    In addition, he also argued that Ms Tan would have incurred\n\ntransport and meal expenses while grounded which she need not have incurred while flying. The\n\nsuggestion was that there was some overlap if a deduction was already being made for similar type of\n\nexpenses she would have incurred overseas while flying.39.    Mr Teh argued that the 40% deduction should be deducted\n\nfrom all allowances as that was Mr Chongs unchallenged evidence. Mr Chong had not said that a\n\ndistinction had to be made between on the one hand, allowances for transport, uniform and meal and\n\non the other hand, inlight allowance and any other allowance. Mr Teh also submitted that his Closing\n\nSubmission for SIA at p 13 para 43 had erred in so far as it had suggested that the 40% deduction\n\nshould not apply to the Inflight Allowance.40.    Mr Ashok Kumar for Airbus Industrie adopted Mr Tehs\n\narguments.41.    During arguments before me, Mr Ramakrishnan suggested that\n\nhe did challenge Mr Chong on his evidence about the 40% deduction. He referred to the second set of\n\nnotes of evidence at p 91 at C to D which states:Q: Overnight and meal allowances. Agree that some crew spend all of it and\n\n  others do not?A: No first-hand knowledge. It is certainly possible.Q: And some crew would eat at cheaper restaurants and others at more expensive\n\n  restaurants?A: That is possible.42.    I was of the view that these questions did not amount to a\n\nchallenge to the figure of 40% from Mr Chongs evidence and the answers also did not contradict\n\nthe 40% figure.43.    In any event, Mr Ramakrishnan eventually accepted that he\n\nhad not challenged the 40% figure.44.    Ultimately, no other figure was suggested by Mr\n\nRamakrishnan to Mr Chong as the appropriate percentage to be deducted. Neither did Ms Tan in her\n\nevidence suggest any such figure. However, in the appeal before me, Mr Ramakrishnan suggested a 10%\n\ndeduction instead of 40%. This submission came too late.45.    In the circumstances, I had to allow the 40% deduction,\n\namounting to $91,302.12, to remain in respect of the loss of pre-trial earnings. The 40% deduction\n\nalso applies to the loss of future earnings and AR Tan has taken this into account.",
        "Loss of Future Earnings": "46.    As for loss of future earnings, I would refer to paras 11\n\nto 14 and 28 to 32 of AR Tans Grounds:11. As for loss of future earnings, which counsel for the Plaintiff labelled\n\n  as \"loss of future earning capacity\" in his closing submissions, it was argued that the\n\n  Plaintiff was entitled to a sum of $1,086,495.00 comprising the following elements.(i)\"Loss of earning capacity\" based on a multiplicand of $5,739.00\n\n          per month and a multiplier of 15 years, less the $900.00 per month which the Plaintiff\n\n          might earn if she left the 1stDefendants and took up alternative employment($5,739.00 x 12 x 15)  ($900.00 x 12 x 15) = $871,020.00(ii)13thmonth Annual Wage Supplement (\"AWS\"), taking a\n\n          basic salary of $2,970.00 per month$2,970.00 x 15 = $44,550.00(iii)Yearly bonus pegged at 3.5 times the basic monthly salary of $2,970.00 per\n\n          month(3.5 x $2,970.00) x 15 = $155,925.00(iv)Gratuity for female cabin crew pursuant to cl 23 of the 1998 agreement\n\n          between the 1stDefendants and its staff union as to terms of employment\n\n          (\"1998 Collective Agreement\")$15,000.0012.    The multiplicand of $5,739.00 in item (i) was derived by\n\n  calculating the average basic pay of a LSS, a CSS [Chief Stewardess] and an in-flight supervisor\n\n  (\"IFS\"), which is the next rank in the cabin crew hierarchy after the post of CSS.\n\n  Counsel for the Plaintiff explained that this approach had been taken to reflect the Plaintiffs\n\n  chances of promotion in the future. Given the Plaintiffs excellent track record with the 1stDefendants, counsel argued, but for the accident, she could and would have been promoted first to\n\n  the post of CSS and then to IFS.13.    In this respect, the Plaintiffs position was\n\n  diametrically opposed to that taken by the 1stDefendants. Testifying on behalf of the\n\n  1stDefendants, Mr Peter Chong stated that even if the Plaintiff had not been injured\n\n  on 25 November 1994, she would probably still be at the rank of LSS currently and was likely to\n\n  remain at that position for some time to come. He explained that this was because the Plaintiffs\n\n  performance appraisal fell within the middle of the range of appraisal scores given to other FSSes\n\n  who had been promoted to LSSes at around the same time as the Plaintiff. Furthermore, compared to\n\n  those of her fellow LSSes who had been promoted to CSSes in 1995, the Plaintiffs performance\n\n  appraisal score was ranked the 10thlowest. This indicated that the Plaintiff was not\n\n  an outstanding candidate for promotion. Mr Chong also drew attention to the higher attrition rate\n\n  in general amongst female cabin crew as compared to male cabin crew. In his view, the Plaintiff\n\n  might have left the 1stDefendants employment for, inter alia, personal reasons\n\n  prior to being promoted to CSS even if she had not been injured. Mr Chong further pointed out that\n\n  in any event, there had been a surplus of CSSes since 1998 in light of the 1stDefendants decision to change the cabin crew composition for all types of aircraft apart from\n\n  the Airbus A310. This change consisted of placing IFSes in charge of these aircraft in lieu of\n\n  CSSes, thus reducing the need for CSSes within the organisation. According to Mr Chong, the\n\n  combination of these factors made it unlikely that the Plaintiff would have been promoted to CSS.14.    In his closing submissions, counsel for the Plaintiff\n\n  contended that the above evidence of Mr Chong was unreliable for several reasons. First, Mr Chongs\n\n  conclusion on the Plaintiffs promotion prospects, in terms of her performance appraisal score,\n\n  was based only on her job performance. Other relevant factors such as the Plaintiffs\n\n  educational qualifications, her years of work experience, and her good disciplinary and attendance\n\n  record had not been taken into account, which Mr Chong conceded in cross-examination he ought to\n\n  have done. Counsel pointed out that the difference between the Plaintiffs performance appraisal\n\n  score of 18 and that of the successful candidates in the 1995 promotion exercise (score of 24) was\n\n  only six points, which difference might have been bridged if these other factors had been\n\n  considered. Second, it was argued that Mr Chongs omission to take relevant factors apart from\n\n  job performance into account amounted to a deliberate suppression of evidence. Third, counsel\n\n  submitted that Mr Chong had \"deviously\" introduced into his affidavit of\n\n  evidence-in-chief figures and graphs which did not form part of the Agreed Bundle of Documents.\n\n  This allegation appeared to be targeted at exhibit \"PC-1A\" of Mr Chongs affidavit,\n\n  which is a table setting out the attrition rates for the 1stDefendants cabin crew\n\n  from February 1999 to March 2000. The attrition figures had initially been set out in exhibit\n\n  \"PC-1\", but a fresh table (exhibit PC-1A) was substituted in its place with the courts\n\n  leave subsequently after Mr Chong alerted the parties of a calculation error which he had made in\n\n  preparing exhibit PC-1..28.    In terms of calculating the quantum to be awarded to the\n\n  Plaintiff, I did not think that the approach canvassed by counsel for the Plaintiff ( 11, supra)\n\n  would reflect accurately the loss in income which the Plaintiff is likely to suffer in future as a\n\n  result of her injury. I was of the view, instead, that the award for loss of future earnings\n\n  should be divided into two different time frames, namely (i) the period from the present date up\n\n  to the end of her current contract with the 1stDefendants (5 October 2001); and (ii)\n\n  the five-year period thereafter from 6 October 2001 to 5 October 2006.29.    As I highlighted above ( 27, supra), the Plaintiff is\n\n  still employed by the 1stDefendants presently. Notwithstanding her unfitness to\n\n  perform cabin crew duties and the strain which this Suit must have had on her working relationship\n\n  with the 1stDefendants, I thought it more likely than not that the 1stDefendants would retain the Plaintiff in its employment till the end of her current contract,\n\n  which expires on 5 October 2001. Since the Plaintiff would continue to receive her basic pay and\n\n  CPF contributions for this period, her loss in income would be limited to the allowances which she\n\n  would have earned had she been able to continue with her cabin crew duties. Taking a putative\n\n  gross monthly salary of $5,185.00 ( 17, supra) and deducting the Plaintiffs basic pay and CPF\n\n  contributions which come up to $1,889.20 per month ($1,718.37 + $171.83), the Plaintiff would be\n\n  receiving $3,294.80 in allowances at present, if not for her injury. Of these allowances,\n\n  approximately 40% would be spent on work-related expenses ( 20, supra). Thus, the Plaintiffs\n\n  loss in income from the present date up to 5 October 2001 (rounding off this period of 12 months)\n\n  would be $23,722.56 ([60% x $3,924.80] x 12 months).30.    As for the period from 6 October 2001 onwards, I thought\n\n  it unlikely that the 1stDefendants would renew the Plaintiffs contract for a\n\n  further five-year term given her unfitness for cabin crew duties. If the Plaintiff had not been\n\n  injured however, given her good service record, the 1stDefendants would most probably\n\n  have extended her contract for a fourth five-year term. This would also have been her final\n\n  contractual extension in light of cl 21(5)(d) of the 1998 Collective Agreement, which provided\n\n  that a LSS should be employed on fixed term contracts consisting of four five-year contracts.\n\n  Thus, even if the accident had not occurred, the Plaintiff would have had to leave the 1stDefendants employment by 5 October 2006 at the very latest.31.    In reaching the above conclusion, I discounted the\n\n  possibility that the Plaintiff might have been promoted to CSS  with the corollary guarantee of\n\n  alternative ground employment after the end of her fourth five-year contract if she so opted (cl\n\n  21(7) of the 1998 Collective Agreement)  if she had not been injured. This was because her\n\n  prospects of promotion were fraught with uncertainties. As Mr Peter Chongs evidence revealed,\n\n  whether or not a cabin crew employee is promoted to a particular rank depends heavily on first,\n\n  whether there are vacancies for that rank, and second, whether the 1stDefendants\n\n  decide to hold a promotion exercise. Mr Chong pointed out that it is not inevitable that a\n\n  promotion exercise for a particular rank will be held if there is a shortage of cabin crew of that\n\n  rank. For instance, a change in the business climate or the crew composition on flights might\n\n  obviate the need for a promotion exercise for a particular rank even though there is or is likely\n\n  to be a shortfall in cabin crew of that rank. In the case of CSSes, the first Defendants had\n\n  decided not to elevate any of its employees to this rank with effect from 1998 due to the change\n\n  in the cabin crew composition for its aircraft ( 13, supra). In light of this, I thought it\n\n  unlikely that the Plaintiff would be made a CSS in the future. As for whether the Plaintiff would\n\n  be a CSS by now if she had not been injured in November 1994, I thought this to likewise be\n\n  unlikely. Mr Chong had indicated that the Plaintiffs performance vis--vis the other\n\n  successful candidates in the 1995 exercise for promotion to the rank of CSS was not outstanding\n\n  ( 13, supra). Admittedly, his conclusion was reached without the benefit of other relevant\n\n  factors such as the Plaintiffs educational qualifications, work experience, and good\n\n  disciplinary record. I did not, however, regard this omission as detracting from the weight to be\n\n  placed on his evidence since a candidates job performance is the most important factor in the\n\n  service record component of the 1stDefendants promotion process. Besides, even if\n\n  the other factors had been taken into account, it is questionable if they would have improved the\n\n  Plaintiffs performance appraisal vis--vis that of the other candidates significantly, since\n\n  the Plaintiff was relatively junior in terms of her length of service with the 1stDefendants, and since most of the other candidates were likely to have had education and\n\n  disciplinary records comparable to hers. For these reasons, I did not think it likely that the\n\n  Plaintiff would be either a CSS by now or promoted to that rank in future if she had not been\n\n  injured. I thus assessed her loss of future earnings on the basis that she would continue to\n\n  remain at her current position of LSS until 5 October 2006.32.    I should add at this point that I found the submissions\n\n  of counsel for the Plaintiff on Mr Chongs unreliability as a witness entirely devoid of merit.\n\n  On the contrary, from the manner in which he gave evidence, I found Mr Chong to be a honest and\n\n  truthful witness who did not shy away from admitting he had made mistakes in reaching the\n\n  conclusion stated in his affidavit of evidence-in-chief when these errors were pointed out to him\n\n  in cross-examination. There was also no question of his deliberately withholding evidence from the\n\n  court or deviously introducing new evidence at the eleventh hour in the form of exhibit PC-1A of\n\n  his affidavit. I allowed that exhibit to be substituted in lieu of exhibit PC-1 as I was satisfied\n\n  that Mr Chong had made a genuine arithmetic error in working out the figures stated in the latter\n\n  exhibit.47.    Ms Tan had suggested in her affidavit that the multiplier\n\nshould be 12 years. However during cross-examination, she said her lawyer would be in a better\n\nposition to deal with this point.48.    In closing submissions before AR Tan, Mr Ramakrishnan had\n\nsubmitted that the multiplier should be 15 years based on a retirement age of up to 67 under the\n\nRetirement Age Act. He referred to a number of authorities but mainly to two.49.    One of the cases he relied on wasLai Wee Lian v\n\nSingapore Bus Services (1978) Ltd[1984] 1 MLJ 325.50.    However the facts there were different. In that case, the\n\nplaintiff had sustained serious injuries when she was thrown off a bus, to the extent that her\n\nmental powers had been greatly reduced and at most she could do simple work on a part-time basis.\n\nThe Privy Council in that case considered the plaintiffs age of 23 at the time of the accident\n\nand the retirement age of 55 and then took into account the uncertainties of human life and the fact\n\nthat the plaintiff would be paid her damages as a lump sum. In these circumstances, the Privy\n\nCouncil was of the view that a multiplier of 15 years was appropriate.51.    Another case cited by Mr Ramakrishnan wasBalasubramaniam\n\ns/o Rajoo, which was cited earlier for a different aspect of Ms Tans claim (see para 31\n\nabove). There, a multiplier of 16 years was used by the court. However this was also a case where\n\nthe mental powers of the plaintiff had been affected.52.    In Ms Tans case, there was no such suggestion. She can\n\ncarry on working up to age 55 or 60 or beyond. Even without the injury, she might or might not have\n\ncontinued working with SIA as a cabin crew up to the expiry of the last of the five year terms\n\nmentioned by AR Tan in her Grounds. It was much less likely that she would have continued working as\n\na cabin crew after the last of these terms.53.    In these circumstances, I was of the view that AR Tan was\n\ncorrect in using a multiplier based on the expiry of the last of the five year terms and not based\n\non when Ms Tan would retire.54.    The next main argument by Mr Ramakrishnan on loss of future\n\nearnings was that Ms Tan might have been promoted to the post of Chief Stewardess (CSS) and\n\nthen Inflight Supervisor (IFS). Ms Tan had made a claim based on the average pay of an LSS,\n\nCSS and IFS. She said this was based on her having an equal chance of being promoted to CSS and then\n\nto Inflight Supervisor.55.    On the other hand, Mr Chong did not think she would have\n\nbeen promoted to CSS and then to IFS for the reasons mentioned by AR Tans Grounds.56.    Counsel for the Defendants also argued that there were so\n\nmany uncertainties in Ms Tans claim on this item (see the Grounds of AR Tan).57.    While it is true that there were many uncertainties in\n\nrespect of Ms Tans claim that she would have been promoted, the fact is that she has lost the\n\nopportunity to be considered for promotion if a promotion exercise were to be conducted.58.    However, a claim for loss of opportunity would have to be\n\npresented differently, ie. as a percentage of the pay of a CSS and an even smaller percentage of the\n\npay of an IFS to reflect the loss of opportunity.59.    Ms Tans claim was not presented on this basis and there\n\nwas no evidence as to what a fair percentage to represent the loss of opportunity should be.60.    Furthermore, Ms Tan is to be paid her damages in a lump\n\nsum. This factor was not taken into account in determining the multiplier.61.    In the circumstances, I decided not to grant her any sum\n\nfor the loss of opportunity.62.    As regards Ms Tans appeal against my decision on costs,\n\nI will deal with that later below together with the Defendants appeal against my decision on\n\ncosts.",
        "THE DEFENDANTS APPEAL TO THE COURT OF APPEAL": "63.    The Defendants appeal is against that part of my order:(a)    which adds $14,700 to the sum awarded by AR Tan for loss\n\n  of pre-trial earnings,(b)    in respect of my consequential order on costs.",
        "The $14,700": "64.    The $14,700 was a sum deducted by AR Tan in respect of loss\n\nof pre-trial earnings for Ms Tans failure to mitigate her damages.65.    I refer to paras 22 to 25 of AR Tans Grounds regarding\n\nthis:22. Fourth, I was of the view that a deduction had to be made from the\n\n  Plaintiffs lost (sic) pre-trial income to reflect her failure to mitigate her loss\n\n  arising from the accident.23. During cross-examination, the Plaintiff stated that after the 1stDefendants informed her in February 1997 that she was unfit to resume her cabin crew duties, she\n\n  made some attempts to seek a cabin crew position with other airlines. She did not, however, pursue\n\n  her inquiries beyond the preliminary stage as she thought it unlikely that other airlines would\n\n  employ her given the condition of her hand and she \"did not think [she] could bear the\n\n  rejection if [she] were to go on\". As for alternative non-cabin crew employment, the\n\n  Plaintiff testified that she did not make any attempts to look for such jobs as the remuneration\n\n  from these jobs was likely to be less than what she was receiving in 1997 as a grounded LSS. She\n\n  subsequently conceded, however, that there might be some non-cabin crew positions which were more\n\n  well-paid than her current post as a grounded LSS vis--vis her salary both in 1997 and at\n\n  present.24.    In light of the Plaintiffs evidence, counsel for both\n\n  Defendants submitted that she had failed to mitigate the loss which she suffered pursuant to the\n\n  Defendants wrong. It was argued that once she realised the 1stDefendants would not\n\n  re-deploy her on flights again, the Plaintiff could and should have taken reasonable steps to\n\n  minimise her loss in income by seeking alternative employment either with other airlines or\n\n  outside the airline industry. Counsel suggested that the Plaintiff could, for instance, have\n\n  resumed a job in the banking industry where she previously worked before joining the 1stDefendants, or pursued career opportunities in the hotel, advertising or service industry.25.    I was of the view that the Plaintiff did not act\n\n  unreasonably in not seeking alternative employment immediately after the 1stDefendants\n\n  informed her in February 1997 that she was unfit to work on board flights, given the uncertain\n\n  economic climate then and the financial crisis which was soon to hit the Southeast Asian region.\n\n  Even after economic conditions improved in late 1998/early 1999, the Plaintiff could not be\n\n  faulted for failing to seek employment with other airlines as the residual weakness in her left\n\n  hand made it highly unlikely that she would be able to secure any other cabin crew position. The\n\n  Plaintiff should, however, have tried to look for an alternativenon-cabin crewjob\n\n  [emphasis added] from that time onwards. Given the Plaintiffs good service record with the 1stDefendants, attractive personality, and commendable grades in the Malaysian equivalent of the GCE\n\n  \"O\" and \"A\" levesl, I was of the view that she could have obtained non-cabin\n\n  crew employment, for instance as a secretary, which would have ameliorated the loss in allowances\n\n  which she suffered after she was taken off cabin crew duties. To reflect this failure to mitigate\n\n  her loss, a deduction of $700.00 per month for the period from January 1999 onwards  i.e. a\n\n  total of $14,700.00 ($700.00 x 21 months)  ought to be made from the lost earnings to be\n\n  awarded to the Plaintiff.66.    In cross-examination, it was put to Ms Tan that as regards\n\nalternative non-cabin crew employment she did not make sufficient effort to reduce any loss which\n\nshe said she had suffered as a result of her injury. She agreed (NE of 31 July 2000 at p 7 at C).67.    In my view this was merely an agreement by Ms Tan that she\n\ndid not really try to seek alternative non-cabin crew employment. She did not concede that she had\n\nacted unreasonably in failing to seek alternative non-cabin crew employment.68.    I was of the view that Ms Tan had not acted unreasonably in\n\nfailing to seek alternative employment in a different industry when she was still employed by SIA\n\nand earning a decent salary.69.    Moreover, SIA might have had fringe benefits which other\n\nindustries might not have eg. their staff might only have to pay a small percentage for air fares on\n\nits flights.70.    Secondly, while there might be some non-cabin crew\n\npositions which were more well-paid than Ms Tans current position as a grounded LSS, there was\n\ninsufficient evidence to persuade me that she would have been likely to obtain alternative\n\nemployment at a higher salary.71.    Thirdly, the deduction of a sum of $700 per month (x 21\n\nmonths = $14,700) to reflect the alleged failure to mitigate on Ms Tans part was without basis.72.    I should mention that during re-examination, Ms Tan had\n\nmade a concession. At NE 61 at B to D (of the notes of evidence on 31 July 2000 onwards), her\n\nevidence was:Q: What would be the salary that you would draw as a clerk or receptionist?A: In Singapore?Q: Yes.A: Not very well-versed with job market in Singapore. Probably $950 to $1,000\n\n  per month.Q: Would you agree to deduction of this amount from the future earnings\n\n  allowances by the Court:A: Yes.73.    This concession was made in respect of future earnings and\n\nnot pre-trial earnings and applied by AR Tan to the former only. Furthermore it was made in the\n\ncontext that some time in the future she might leave SIA and obtain alternative employment.74.    Even then I was puzzled as to why the concession was made\n\nbecause Ms Tan did not say that the $950 or $1,000 per month was additional income over and above\n\nher basic salary as a grounded LSS. However, as the concession was not withdrawn, I need not say any\n\nmore thereon except that her concession is not to be considered in the context of pre-trial\n\nearnings.75.    In the circumstances, I decided that the $14,700 deduction\n\nshould not have been made and added this sum back to the amount to be awarded to Ms Tan for loss of\n\npre-trial earnings.76.    I had also added back $2,736.31 being excessive income tax\n\ndeducted by AR Tan in her computation of loss of pre-trial earnings (see para 10(b) above). However,\n\nthere is no appeal by the Defendants or Ms Tan in respect of the $2,736.31.",
        "Costs": "77.    The Defendants were not so much concerned with the $14,700\n\nadded back as the effect it would have on the issue of costs. With the $14,700 added back, the total\n\namount payable to Ms Tan turned out to be slightly more than the Offer (see paras 12 and 13 above).\n\nThis put the Defendants claim for indemnity costs (from the date of the Offer) in jeopardy.78.    However, both the Defendants Counsel still argued before\n\nme that Ms Tan should be ordered to pay their costs on an indemnity basis under O 22A r 9(3) of the\n\nRules of Court.79.    Order 22A r 9(3) states:(3) Where an offer to settle made by a defendant(a)    is not withdrawn and has not expired before the\n\n    disposal of the claim in respect of which the offer to settle is made; and(b)    is not accepted by the plaintiff, and the plaintiff\n\n    obtains judgment not more favourable than the terms of the offer to settle,the plaintiff is entitled to costs on the standard basis to the date the offer\n\n  was served and the defendant is entitled to costs on the indemnity basis from that date, unless\n\n  the Court orders otherwise.80.    They argued that, in substance, Ms Tan had not got more\n\nthan what had been offered and accordingly she should have to pay the costs of both Defendants on an\n\nindemnity basis from the date of the Offer.81.    On the other hand, Mr Ramakrishnan argued that a sum of\n\n$162,920.18 which Ms Tan had been receiving based on her current job should be also taken into\n\naccount in determining costs. He said that with this figure, Ms Tan would be receiving about\n\n$460,000 (without even taking into account the sums which I had added back) and this was well in\n\nexcess of the Offer.82.    I did not agree. The $162,920.18 was not part of Ms Tans\n\nclaim as she was receiving it anyway. She was claiming more and the question before me was how much\n\nmore she should receive.83.    Mr Ramakrishnans other argument was that with the two\n\nsums which I had added back, the total figure to be paid to Ms Tan was still more than $350,000. It\n\ndid not matter that it was slightly more. So long as it was not less favourable than the Offer, the\n\nDefendants were not entitled to rely on O 22A r 9(3) to claim indemnity costs.84.    Furthermore, he argued that I should make the usual order\n\non costs following the event ie. that the Defendants continue to pay Ms Tan the costs from the date\n\nof the Offer on a standard basis.85.    The Defendants relied onThe Birmingham and District\n\nLand Company Limited v The London and North-Western Railway Company[1887] 57 L.T. (theBirminghamcase) andRoache v News Group Newspapers Ltd[1992] Times Law Reports 23 Nov.1992.86.    As regards theBirminghamcase, the Defendants\n\nreferred to p 187 of the report where Kekewich J said:That leaves me the only question about costs. The rule which I have always\n\n  adopted, and intend to adopt until corrected by a higher authority, is, that an offer made after\n\n  litigation commenced must, if it is to have any effect to avoid costs by an unsuccessful party,\n\n  amount in substance to an offer of everything which the court eventually hold the successful party\n\n  entitled to.87.    However, this was a general statement referring to the\n\navoidance of having to pay costs. It did not deal with a rule which allowed the court not only to\n\nlet the offeror avoid paying costs but to order the offeree to pay costs and that on an indemnity\n\nbasis.88.    As for theRoachecase, the Defendants referred to\n\nthe principle summarised in the Times ie:Where a plaintiff in a libel action was awarded the same sum as the\n\n  defendants had paid into court before the trial, and had obtained an injunction against\n\n  re-publication, for the purposes of costs it was the defendants who were in substance the\n\n  successful parties since the claim for injunctive relief had not been a significant factor in the\n\n  plaintiffs prosecution of his claim.Accordingly, the plaintiff would be ordered to pay the defendants costs\n\n  after the date of their payment into court.89.    The Defendants also referred to the following passage in\n\nthe Times report:The judge had to look closely at the facts of the particular case before him\n\n  and ask: Who, as a matter of substance and reality, had won? Had the plaintiff won anything of\n\n  value or anything he could not have won without fighting the action through to a finish? Had the\n\n  defendant substantially denied the plaintiff the prize which the plaintiff fought the action to\n\n  win?90.    On the other hand, Mr Ramakrishnan referred to the\n\nfollowing two passages, in the Times report:The second principle was that where a plaintiff claimed a financial remedy\n\n  in debt or damages and the defendant paid into court a sum not accepted by the plaintiff which was\n\n  equal to or greater than the sum recovered by the plaintiff in the action the plaintiff ordinarily\n\n  was ordered to pay the defendants costs from the date of the payment in.In the ordinary way the plaintiffs failure in the present case to recover\n\n  more than the sum paid into court would have led to an order that he pay the defendants costs\n\n  from the date of payment in.91.    He reinforced his argument by pointing out the Defendants\n\nhad not offered a sum equal to or greater than what Ms Tan had recovered.92.    I was of the view that the facts in theRoachecase\n\nwere different from those before me. There, the plaintiff had obtained the same sum as the\n\ndefendants had paid into court and the question was whether the injunction he had also obtained was\n\nsufficient to make him the successful party for the purpose of costs. The Court of Appeal decided in\n\nthe negative.93.    I was also of the view that the Defendants argument on\n\nthe application of O 22A r 9(3) was without merit.94.    First, if it was open to the Defendants to argue that they\n\ncould still rely on O 22 r 9(3) notwithstanding that Ms Tan was awarded slightly more, then it would\n\nhave been equally open to Ms Tan to argue that O 22 r 9(3) should not apply if she had been awarded\n\nslightly less than $350,000. This would not be correct.95.    Secondly, the Defendants were effectively asking the court\n\nto ignore the excess awarded, for the purpose of O 22 r 9(3), on the basis that it was only slightly\n\nmore. I was of the view that to do so would open the Pandoras box. For example, how much of the\n\nexcess should be ignored, $1,000 or $10,000 or should it be in percentage terms like 1% or 2% of the\n\nOffer?96.    Thirdly, bearing in mind the severe consequences of O 22A r\n\n9(3), I was of the view that it was incumbent on the Defendants to ensure that the Offer comes\n\nwithin the scope of the rule. The Offer must be more favourable ie. more in terms of dollar value\n\nthan what has been awarded before the Defendants can rely on O 22A r 9(3).97.    I was of the view that this was the correct conclusion\n\nbecause there is another rule on costs ie. O 22A r 12 which allows me to still take into account the\n\nOffer even though the Offer is for a sum less than that eventually awarded.98.    Order 22A r 12 states:Discretion of Court (O.22A, r.12).12. Without prejudice to Rules 9 and 10, the Court, in exercising its\n\n  discretion with respect to costs, may take into account any offer to settle, the date the offer\n\n  was made, the terms of the offer and the extent to which the plaintiffs judgment is more\n\n  favourable than the terms of the offer to settle.99.    In other words, it did not follow that just because the\n\nOffer had failed to come within O 22A r 9(3), Ms Tan was entitled to be awarded costs on a standard\n\nbasis.100.    I took into account:(a)    the date of the Offer and its terms,(b)    the fact that the sum awarded to Ms Tan under my decision\n\n  was, as at the date of the Offer, around $2,000 more whereas she had claimed a total of about $1.1\n\n  million in her affidavit ie. about $750,000 more.101.    The amount awarded to Ms Tan did not justify four and a\n\nhalf days of assessment before AR Tan. On the other hand, she did receive more than the Offer.102.    In the circumstances, I awarded Ms Tan $1,000 as fixed\n\ncosts from the date of the Offer to the date of AR Tans decision. It is this aspect of my order\n\non costs for which Ms Tan is appealing to the Court of Appeal.103.    As for the costs before the date of the Offer, I saw no\n\nreason why it should be confined to costs on liability only. If, as at the date of the Offer, no\n\nwork had yet been done by Ms Tans solicitors on the issue of quantum, then, she would not be\n\nentitled to claim such costs. However, I was of the view that it was wrong to make a pre-emptive\n\norder which would have denied her solicitors the opportunity of trying to establish that they had\n\ndone work on the issue of quantum as at that date.104.    Accordingly, I awarded Ms Tan costs prior to the date of\n\nthe Offer on a standard basis, such costs to include getting up on quantum in addition to liability.105.    As for costs of the appeal before me, Ms Tan had succeeded\n\nonly partially and had lost on the major items. However the partial success was sufficient to turn\n\naround AR Tans order on costs from the date of the Offer such that Ms Tan no longer had to pay\n\nthe Defendants costs on an indemnity basis from the date of the Offer. That would have been quite\n\nsubstantial.106.    In the circumstances, I decided that Ms Tan should be\n\nentitled to some costs for the appeal before me but fixed it at $5,000.Woo Bih LiJudicial CommissionerCopyright © Government of Singapore."
    }
}