{
    "case_title": "Bajumi Wahab and Others v Afro-Asia Shipping Company (Private) Limited and Others",
    "ncitation": "[2001] SGHC 91",
    "coram": "Choo Han Teck JC",
    "sections": {
        "Working Capital": "22. I have calculated the working capital simply by taking the average of the\n\nfigures used by Dr. Wijesekera (Mr. Fernandez did not provide any figures) as being the fairest in\n\nthe circumstances, and in the absence of hard evidence.Residual Value23. Dr. Wijesekara valued the trees at US$3 each in his assessment of the\n\nresidual value. Thus, on the assumption of 2.6m tress, he worked out the residual value as between\n\nUS$7 to US$8 million. After consultation with my assessors, I am of the view that this is grossly\n\nexcessive. Although Dr. Wijesekara may have adopted a \"recognised formula\" as Mr. Wong\n\nsubmitted, but formulae are only feasibly applied if realistic figures are used. In this regard, I\n\nam of the view that the residual value per tree shall be calculated as between US$0.50 to US$0.60\n\nfor 400 hectares of trees.",
        "Discount Factor": "24. This is by far the most significant factor. The discrepancy between Dr.\n\nWijesekeras 10% and Mr. Fernandezs 20% accounts for a large proportion of the difference in\n\nvaluation. Mr. Fernandez applied a discount rate of 10% to 15% in his valuations of Malaysian\n\nplantations, but in his view, the financial and economic factors in Indonesia differ from the case\n\nof plantations elsewhere. Each plantation must be assessed on its own. In his study, Mr. Fernandez\n\nreported that a discount rate of 23% had been used in an Indonesian plantation. He had discussions\n\nwith other ASEAN (Association of South East Asian Nations) based plantation valuation experts in\n\nwhich the general opinion was that a discount rate of 20% to 25% is fair so far as Indonesian\n\nplantations are concerned. I note Mr. Wongs objection and criticism especially when the other\n\nexperts are not available for cross-examination. However, it is accepted that an expert is entitled\n\nto take into account what would otherwise be hearsay evidence because the nature of an experts\n\nfunction necessarily prohibits any restraint on his research and methodology. In the end, it is the\n\ntestifying expert who must stand by his final report and be cross-examined on it. There is virtually\n\nnothing in substance to support a discount rate of 10% in respect of a plantation in Indonesia. I am\n\nmore inclined towards Mr. Fernandezs assessment but 20% may just be on the extreme end. I will,\n\ntherefore, adjust the rate down to 17%. This discount is arrived at after taking into account the\n\npotential of developing the estate into a world class plantation. This assumption has been made on\n\nlargely speculative factors such as the future production, costs, and revenue. The discount must\n\nalso reflect not only the track record but known uncertainties and circumstances, and the assumption\n\nof marginal impact on prices. The subjectivity of applying the discount rate may itself be a cause\n\nof concern to the potential investor, and that is something that cannot be ignored. I am of the view\n\nthat Dr. Wijesekeras rate was much too conservative while Mr. Fernandezs was just a little too\n\nextravagant.Size Of plantation25. Ordinarily, the size of a plantation is purely a question of fact and is\n\nanswered easily enough. In this case, some confusion arose because there was no evidence of a proper\n\nsurvey, and furthermore, some indirect and unsubstantiated evidence as to the possibility of\n\nadditional hectares being acquired. I accept the evidence of the Izin Lokasi letters issued by the\n\nIndonesian government in determining the size of the plantation land. The size so determined is\n\nabout 10,450 hectares.Fair Value26. Having regard to all the above, I come to the finding that the fair value of\n\nthe plantation to be US$17.54 million, of which it must be noted that 40% belongs to the Company and\n\n10% to Mr. Tan Choo Suan.Costs27. I will hear the parties on the question of costs at a later date if parties\n\nare unable to agree costs between themselves.APPENDIX I(Revenue)PriceYear1.50419961.12819970.81919980.7319990.81520000.8620010.90420020.94820030.94820040.99220051.0472006  20091.1022010  2020APPENDIX II(Average Yield Per Hectare of Planted Area)PriceYear19961181997298199847919997182000838200197120029722003956200489420059062006924200796820081020200911572010128820111430201215682013170120141773201518182016182520171847201818512019185620201864",
        "Choo Han Teck": "Judicial CommissionerCopyright © Government of Singapore."
    }
}