{
    "case_title": "Christina Au Mei Yin and Another v Adela Lo Sook Ling",
    "ncitation": "[2001] SGHC 314",
    "coram": "Judith Prakash J",
    "sections": {
        "(i) The defendant and her children": "18. The defendant stated that in 1969 the disputed strip was already fenced off\n\nfrom No. 24 and formed part of the compound of No. 26. The fence had been erected by Reckitt &\n\nColman prior to her occupation and they had also maintained the fence. Neither the defendant nor her\n\nhusband had carried out any maintenance of the fence at any time.19. The defendant asserted that from 1970 onwards she and her children had always\n\ntreated the disputed strip as if it belonged to them. It formed part of a rustic garden which was\n\nmaintained at No. 26 throughout her residence there. A short while after she moved in, the defendant\n\nand her late husband planted and maintained a hedge which ran alongside part of the existing fence\n\nseparating the two properties. A portion of this hedge was grown on this disputed strip. According\n\nto the defendant, this portion could be seen in a photograph (AL3) which was taken in the mid\n\n1970s. The hedge was subsequently removed without affecting the fence.20. The defendant said that her husband and she had planted trees in their\n\ngarden. Some Australian palms and slow growing red ceiling palms were grown on the disputed strip\n\nalongside the stretch of the fence. They also planted a Belimbing tree on the disputed strip. In\n\naddition they retained and maintained other trees that were growing on the disputed strip in 1970.\n\nOne such tree was a huge wild cherry tree. This tree was cut down by the defendant around 1991.21. As part of the rustic nature of the garden, the defendant and her husband\n\nobtained several rocks and boulders which were placed on the disputed strip in the 1970s as part of\n\nthe landscape.22. The defendant stated emphatically that the position of the fence separating\n\nNo. 26 from No. 24 had never been shifted throughout her 30 years occupation of No. 26. She compared\n\nthe photograph taken in the 1970s (AL3) with a current photograph to demonstrate that certain rocks\n\nhad all along been placed in the same position on the disputed strip. The 1970s photograph showed a\n\nstone lantern next to the rocks. In the current photograph, only the rocks appeared. The defendant\n\nwas asked about this during cross-examination and she asserted that only the lantern had been\n\nremoved but that the rocks remained in the same place. She was not able to remember when the removal\n\nhad taken place.23. The defendants daughter, Ms Teo, testified that she had lived continuously\n\nat No. 26 from around June 1970 until 1981 when she left Singapore to study in Britain. From 1981 to\n\n1986, she returned to Singapore each year during her vacation and stayed at No. 26 whilst she was\n\nhere. On completion of her studies, she returned to live at No. 26 until 1989 when she married and\n\nmoved out.24. Ms Teo stated that there had been a fence separating No. 26 and No. 24 ever\n\nsince she first visited No. 26 in late 1969. This fence completely blocked any direct access to the\n\ndisputed strip from No. 24. The disputed strip had always formed part of the compound of No. 24.\n\nThroughout the 30 year period from 1970, her family and she had always treated the disputed strip as\n\nif it belonged to them. It was in continuous use by her family during that period and formed part of\n\nthe rustic garden. Throughout the time she lived there, there were always plants and trees growing\n\non the disputed strip. Ms Teo recalled the hedge and trees that had been planted on the disputed\n\nstrip. She remembered too that there were trees that were already growing there in 1970. One such\n\ntree was a huge wild cherry tree which had been cut down by her mother about ten years previously.\n\nSometime in the 1970s, her parents had placed some rocks and boulders on the disputed strip as part\n\nof their rustic garden.25. Ms Teo stated that the present position of the fence separating the two\n\nproperties corresponded exactly to the position of the fence which was existing at the time she\n\nmoved into No. 26 in 1970. To substantiate this contention she carried out the same comparison\n\nbetween photographs of the hedge and the rocks as her mother had done.26. The defendants son, Dr Teo, gave similar evidence. He lived at No. 26 from\n\nJune 1970 until 1987 when he moved into a university hostel. He lived there again from April 1988 to\n\nApril 1990 when he left Singapore on an overseas posting. He moved back to live with his mother in\n\n1998 and remained there until November 2000.27. Much of Dr Teos affidavit evidence was couched in language identical to\n\nthat used in his sisters affidavit. He also had some evidence of his own like the three reasons\n\nhe gave for remembering that the position of the fence had not shifted throughout the time he lived\n\nat No. 26. These were:(1) in the mid 1970s, his family owned some poultry which were kept in a fenced\n\n  up area on the disputed strip which bordered on the hedge. One or two of the birds would\n\n  occasionally escape through the fence and he would have to climb over the fence into No. 24 to\n\n  retrieve the birds;(2) one evening in the late 1970s, Dr Teo went out of the house to investigate\n\n  why his family dog had been barking continuously and came face to face with an intruder. This\n\n  intruder took a jump over the fence into No. 24 using the white bench shown in photograph AL3, as\n\n  a step to launch himself over the fence;(3) Dr Teo remembered an altercation with one Andrew Turner, the son of one of\n\n  the general managers of Reckitt & Colman, and that he had talked to Andrew over the fence in\n\n  order to resolve the argument.This additional evidence did not, in my view, take the defendants case any\n\nfurther since what it established was the existence of a fence (a fact not in dispute) and not the\n\nlocation of the fence.28. In cross-examination, the defendant came across as a person who was strongly\n\nattached to the disputed strip. She considered it to be, indisputably, her property and was\n\nresentful that what she called a ridiculous case had come up and made her sit in the witness\n\nbox in order to answer silly questions. She did not agree that the disputed strip did not fall\n\nwithin the description of No. 24 as contained in the certificate of title which had been issued for\n\nNo. 24. She was next asked whether she agreed that the disputed strip fell within the certificate of\n\ntitle held by the plaintiffs and her answer was that she did not know. When she was asked whether\n\nshe agreed that the disputed strip fell on the plaintiffs side of the boundary line, her answer\n\nwas an emphatic no. The defendants lack of objectivity was revealed in these responses.29. The defendant gave evidence about the wooden fence erected by the then\n\noccupiers of No. 24. Her evidence was that this wooden fence was erected in the 1980s. The wooden\n\nfence is not shown in the 1983 survey which resulted in CP 16587 and it was put to the defendant\n\nthat therefore the fence must have been erected after that survey. The defendant refused to\n\nacknowledge this, insisting that the surveyor may have missed the fence.30. Another difficulty with the defendants evidence was her statement that the\n\ncherry tree was well over 20 feet in height in 1970. Her daughter, Ms Teo, supported this testimony\n\nby stating that when she moved in as a child, the cherry tree had been huge to her. The\n\nevidence of Professor Rao, the botanist, was that the stump of the cherry tree showed that it had\n\nbeen about 20 years old when it was cut down. According to the defendant, the tree had been cut down\n\nin about 1991. Taking these two facts together would mean that the cherry tree was either not yet in\n\nexistence in 1970 or if it was that it was very young and not yet at a height that would allow it to\n\nbe described as huge even from the perspective of an eight year old child. This was one aspect\n\nat least, on which the memories of the defendant and her daughter were not reliable.31. Ms Teo, while asserting that the fence did not move, admitted in court that\n\nif it had been moved a foot or two while she was away from Singapore, she would not necessarily have\n\nnoticed the difference in its location on her return. She also acknowledged that she and her mother\n\nand brother had discussed what could arise in the course of the case although she stated that no\n\nwitness stated what they could themselves not remember. This does not mean that she and Dr Teo were\n\nnot influenced at all by the assertions of the defendant as to the position. It was significant that\n\ntheir evidence generally ran along the same lines as their mothers although Ms Teo was a more\n\nobjective and reasonable witness than the defendant.32. The defendant relied on the photograph AL3 showing the position of the four\n\nrocks. This photograph does not, however, show the location of the stone lantern and the four rocks\n\nin relation to the boundary line. The defendants evidence was that the four rocks remained in\n\ntheir original positions throughout and were not moved. It was only the stone lantern that had been\n\nremoved sometime after the photograph was taken. Whilst Ms Teo supported her mother by saying that\n\nthe boulders were still in place, she was not able to give the reason why the lantern had been moved\n\nnor did she know when the lantern and the boulders had parted company.33. The defendant stated she and the husband had planted the hedge alongside the\n\nfence in the 1970s. The hedge was about 10-15 feet long (the entire length of the fence was over 60\n\nfeet) and when it was removed in about 1991, it was about four and a half feet high. The hedge is\n\nshown in the photograph AL3 and, according to the defendant, the positioning of the various features\n\nin the garden if one were looking towards the fence would be rocks, palm trees, the hedge and then\n\nthe fence. The hedge therefore blocked a clear view of the fence. It was suggested to the defendant\n\nin the course of cross-examination that at the time the wooden fence was built on No. 24, the fence\n\ncould have been moved. She disagreed. It was also suggested that as long as the hedge was up, she\n\ncould not state with certainty the location of the fence behind the hedge. The defendant disagreed\n\nwith this suggestion as well. It should be noted that the area of greatest encroachment was behind\n\nthe hedge and that the defendant had also testified that she had not inspected the fence, save for\n\nnoticing one rusting fence pole. Work in the garden was done by gardeners.",
        "(ii) Professor Rao Nagaraja Adisheshappa": "34. The defendant also relied on the age of various plants growing along the\n\ndisputed strip. She called Professor Rao to support her case on this point. Professor Rao was a\n\nprofessor of botany at the National University of Singapore from 1959 until his retirement in 1992.35. In his report, Professor Rao stated that there were 14 clusters of Macarthur\n\npalms growing on the disputed strip right alongside part of the fence separating the two properties.\n\nHe said most of these clusters had either been cut or disturbed and showed different degrees of\n\ndamage. Of the various clusters, only one cluster was intact with a full set of young and mature\n\nstems. He further stated that the Macarthur palm is of the group of palms called Arecoideae which\n\nhave middle growth rates. If the palms are not damaged or disturbed they grow approximately 10 to 12\n\ninches per year. In this case, many of the stems in the intact cluster were more than three times\n\nthe height of the wooden fence behind them. Professor Rao had been informed by the defendant that\n\nthe wooden fence was around seven feet high. This meant that many of the stems in the cluster were\n\nover 21 feet tall. As such it was the professors opinion that the cluster was well over 20 years\n\nold.36. Professor Rao also noted a Belimbing tree growing on the disputed strip.\n\nAccording to him, the Belimbing is a slow growing tree species and has a maximum height of around 15\n\nto 20 feet. It takes around 10 to 12 years to reach this height. After a Belimbing tree reaches its\n\nmaximum height, it starts to increase in girth. The Belimbing tree on the disputed strip was nearly\n\nthree times the height of the wooden fence. In Professor Raos opinion the tree has already\n\nreached its maximum height and has split into two stems each having a girth of 19.5 inches. He\n\nthinks that the stems of the Belimbing tree would have taken at least ten years from the time the\n\ntree reached its present height to increase their girth to the present size. As such, he estimated\n\nthe present age of the Belimbing tree to be about 20 years. This would mean that it was planted some\n\ntime in the 1980s. If the tree were exactly 20 years old, then it would have been planted in 1981 ie\n\nbefore CP 16587 and its location, if proved, would be some indication that the disputed strip was\n\nthen part of the defendants compound. Professor Raos assessment of its age is, however, only\n\nan estimate.37. As for the tree described as a wild cherry tree by the defendant, Professor\n\nRao said it was more correctly identified as a salam tree, a tree that bears small red fruit\n\nresembling cherries. Professor Rao measured the diameter of the stump of the tree and based on this\n\ndiameter and the fact that the tree had produced two or three buttresses before it was cut down, it\n\nwas his opinion that it was 20 years old before it was cut down. I have commented on the effect of\n\nthis evidence on the defendants case in  31 above.38. In court, Professor Rao clarified that the Macarthur palms could grow 15 feet\n\nin four years in good conditions. He stated that light and moisture were very critical factors in\n\nthe growth rate. Since Singapore sees lots of sunlight and lots of rain, I agree with the suggestion\n\nof counsel for the plaintiffs that the present height of the Macarthur palms on the disputed strip\n\ncannot establish that these palms are in fact 20 years old as alleged by the defendant. They could\n\nhave been planted ten years ago and still have reached their present heights by now. Secondly, 13\n\nclumps along the fence line were cut, disturbed or showed different degrees of damage. This might\n\nindicate that the fence line had been moved.",
        "(iii) Mr Tang Tuck Kim": "39. The defendants expert witness was Mr Tang Tuck Kim, a registered surveyor\n\nwho has been in the profession since 1971. At the start of his career, Mr Tang spent a year in the\n\nSurvey Department and five years as a surveyor in the Registry of Land Titles and Deeds. In 1976, he\n\nwent out into private practice and from 1987 onwards he has been the principal surveyor in his own\n\nfirm.40. Mr Tang had seen CP 16587. He testified that the notations on the plan\n\nindicate that CP 16587 was based on a survey of No. 24 which was conducted in December 1983 (the\n\nSurvey). In Mr Tangs experience, the purpose of such certified plans is to accurately depict\n\nthe boundary lines of a property. He stated that certified plans are not intended to accurately\n\ndepict non-permanent features such as fences, walls and drains as they do not relate to the\n\nascertainment of the boundary lines of a property.41. Mr Tang considered that his opinion on the purpose of the certified plans\n\nissued by the Survey Department was in accordance with that departments responses to queries made\n\nby the defendants solicitors on the purpose of the Survey. He stated that it was clear from the\n\nresponse that the purpose of the Survey was merely to verify and refix the boundary marks of No. 24\n\nand not to ascertain the locations of other non-permanent features present on the property such as\n\nfences, walls and drains.42. The results of the Survey were recorded in the Survey Department Field Book\n\nNo. 22696 (the Field Book). Mr Tang saw the complete Field Book and, based on his examination\n\nof it, he made the following points:(1) the field data measurements and diagrams contained in the Field Book Pages\n\n  all relate to the measurement of the boundaries of 24 Leedon Road. They do not relate to the\n\n  location of the mesh wire fence surrounding 24 Leedon Road, the concrete drain network or the\n\n  wall;(2) all the 6 Field Book Pages contain notations confirming that the data on\n\n  these pages had been separately computed and checked by two individuals from the Survey Department\n\n  (the Computer and the Checker respectively) other than the surveyor who recorded the\n\n  data;(3) however, the Plan Page (page 6 of the Field Book, the only page that\n\n  features the fence surrounding 24 Leedon Road) itself conspicuously lacks any confirmation that\n\n  the data on that page had been computed or checked by anyone from the Survey Department. This is\n\n  again in accordance with the Survey Departments position that the Survey Department is not\n\n  concerned with the locations of the non-permanent features that do not relate to the boundary\n\n  lines of a property.43. The Plan Page contained a plan of No. 24 showing both the boundaries and the\n\nfences of that property. Mr Tang stated that the drawing of the fence on the Page Plan apparently\n\nshows that that extreme ends of the fence separating No. 24 from No. 26 are slightly off-set from\n\nthe corresponding ends of the actual common boundary between the two properties. According to the\n\ndrawing, the extreme front end of the fence encroaches into No. 26 by about 0.4 metres while the\n\nextreme back end of the fence encroaches into No. 24 by about 0.10 metres. The Plan Page also\n\nreveals that in relation to the fence running along the front of No. 24 the surveyor had taken\n\nseveral measurements at intervals along that stretch in addition to the extreme ends of the fence to\n\ndetermine the amount of off-set of the fence from boundary line. By contrast, insofar as the fence\n\nseparating No. 24 from No. 26 was concerned, the Plan Page merely contains two measurements at the\n\nextreme ends of the fence and does not record any other measurements on the fence between No. 24 and\n\nNo. 26.44. Mr Tang considered it clear, based on the above, that the surveyor who\n\nconducted the Survey in December 1983, merely measured and recorded the location of the extreme ends\n\nof the mesh wire fence separating No. 24 from No. 26 and, in the course of preparing the drawing of\n\nthe fence separating the two properties, the surveyor made an assumption that the fence line was\n\nstraight without actually taking measurements to confirm this assumption. Following this erroneous\n\nassumption, the surveyor accordingly drew a straight line connecting the extreme ends of the fence\n\nseparating the two properties. Based on the Field Book, Mr Tang averred that there was no material\n\nto support the surveyors assumption that the fence line was straight and not curved.45. The above was the nub of Mr Tangs report. He continued that his\n\nconclusions were in line with the fact that the curvature of the present fence into No. 24 is not\n\nreadily apparent from a visual inspection of the fence line. Indeed due to the length of the fence,\n\nthe sloping nature of the terrain, the amount of vegetation presently growing along the fence line\n\nand the fact that the front and the back portions of the fence are not inter-visible, the present\n\nfence line appears straight. Mr Tang also opined that the surveyors error with respect to the\n\nfence line would not have been discovered since it was not the practice of the Survey Department to\n\ncheck the accuracy of the drawings of non-permanent features such as the fence.46. There were some difficulties with Mr Tangs evidence. He admitted in court\n\nthat the preparation of his report in its final form as it was presented to the court was done by\n\nthe defendants solicitors in consultation with him. Further, the choice of words in the report\n\nwas partly his and partly that of the solicitors, thus casting in some doubt the extent to which his\n\nobservations and opinions were his own put forward without any suggestions from others. Although his\n\nnormal practice was to issue his reports under his own letterhead, that had not been done in this\n\ncase because he had been preparing an affidavit. He had therefore gone straight to the preparation\n\nof an affidavit.47. Mr Tang also appeared to be putting forward a case rather than only giving\n\nevidence. In his report, he referred to a stone marker about two feet high located on the disputed\n\nstrip right by the present fence line. The side of the stone marker facing No. 26 is engraved with\n\nthe letters STB. On the basis of correspondence between Singapore Telecommunications Ltd and\n\nthe defendants solicitors, Mr Tang believed that the marker was placed on the disputed strip by\n\nthe then Singapore Telephone Board and that by 1974, such markers were no longer laid. Based on the\n\nway the stone marker had been placed on the disputed strip with its inscribed side facing No. 26 and\n\nthe information given by Singapore Telecommunications Ltd, Mr Tang opined that it was clear that by\n\n1974 the fence separating the two properties must have been behind the stone marker it in its\n\npresent location.48. When Mr Tang was cross-examined on this point, however, it turned out that\n\nthe above opinion was pure speculation. He stated that the STB marker marked the position where the\n\ntelephone cable is buried and when asked to agree that the marker could be near the boundary or far\n\nfrom it his reply was that the marker could be anywhere. He was then asked whether he agreed that\n\nthe side of marker inscribed with STB could face in any direction. Mr Tang disagreed on the\n\nbasis that, logically, when anyone erected a sign he would want to put it at a position where it was\n\nvisible. He agreed, however, that if there was no fence near the marker, then it could be seen from\n\nany direction. He also confirmed that he had not checked with anyone to find out whether there had\n\nbeen any prescribed facings for such STB markers. He also had no idea whether the marker was placed\n\nin a direction which was transverse to the cable or parallel to it or whether it was located at\n\njunctions of cables or could be located at any part of a cable. It was obvious that Mr Tang knew\n\nnothing about the significance of such markers and that he was trying to make a case from the facing\n\nof the marker when it was not clear whether that facing had any significance. As far as visibility\n\nof the marker was concerned, being two feet high it would in any case have been clearly visible from\n\na distance. It is noteworthy that the idea of including a section on the marker in his report did\n\nnot originate from Mr Tang. Its inclusion was in response to a request from the defendants\n\nsolicitors that he comment on the marker.49. Another difficulty related to Mr Tangs assertion as recounted in  40\n\nabove, that the Survey Department is not interested in non-permanent features. He was shown rule\n\n47(1) of The Land Surveyors Rules 1976. This reads:(1) Measurements shall be made to determine, with sufficient precision for\n\n  the purpose of plotting them accurately at the scale of the final plan, the position of such\n\n  natural and artificial features and of limits of cultivation along and adjacent to boundaries,\n\n  which may affect title.Thereafter, he backtracked from his previous assertion. The relevant portion of\n\nthe evidence reads:Q Agree that it has been consistent surveying practice in Singapore to draw\n\n  in fences by measuring the offset against the boundary line.A Yes, if the fence is short and inter-visible from end to end and is straight.\n\n  If fence is not straight they would have to survey more points.Q Agree that the surveyor in this field or the field assistant would in general\n\n  know this.A Yes.Q In fact, this is an extract of the Land Surveyors Rules, plaintiffs\n\n  authorities tab 5, at pg 376. Rule 47(1)[Reads]. Agree that surveyors who are doing a\n\n  title survey would be very careful about fence lines.A Yes as long as it affects the title boundaries.Q \"Along and adjacent to boundaries which may affect title\". That is\n\n  exactly the problem we have in this case.A Yes.50. It would be recalled that in his report Mr Tang had stated that the Plan Page\n\nshowed there was a 0.4 metre encroachment of the extreme front end of the fence into No. 26.\n\nCross-examination showed his reading of the Plan to be incorrect and careless. The relevant portion\n\nof the evidence reads:Q So why say in your report that there was encroachment of 0.4m?A This 0.4 metres I took it from the Field Book.Q But it doesnt measure the encroachment.A Yes it does measure the encroachment.Q Is the encroachment 0.4m?A It depends on whether the offset is parallel to the boundary or at right\n\n  angles to the road. If its parallel then its 0.4 metres. If its right angle then it would\n\n  be very close to the boundary.Q In this case looking at the plan is it parallel or right angle?A Theres no indication so I gave the worse scenario which is parallel.Q DBA129, the plan. You can see the .40 there. I am told by Anthony Lim\n\n  that when the number is upright like this its a right angle offset.A Yes. Its a right angle offset[Witness says this after scrutinising\n\n  bigger version of the plan].Q If we go back to last sentence of para 22 of your report, when you say extreme\n\n  front end  encroaches into 26 Leedon Road by about 0.40 metres is wrong.A Agree but in my earlier sentence I said slightly offset so encroachment\n\n  is very minor whether 0.4 or 0.1.",
        "(iv) Madam Au and Mr Wong Tuck Kheong": "51. The plaintiffs, as recent purchasers of No. 24, could not themselves give\n\nevidence of the position of the fence during the material period. Nor were they able to call anyone\n\nelse to give such evidence. The first plaintiff, Madam Au, gave evidence only of events that had\n\noccurred after her purchase of No. 24. She mentioned a visit to the defendant in October 2000 when\n\nshe had made an offer to redo the defendants patio, give her a rock waterfall and landscape her\n\ngarden in return for what Madam Au considered to be rightfully hers, ie the disputed strip. The\n\ndefendant refused and suggested that instead the plaintiffs take more of her back garden and leave\n\nher patio and front area alone. Mdm Au also mentioned that the defendant seemed surprised when she\n\nwas told that there was an encroachment onto No. 24. She had not expected the actual boundary line\n\nto come so close to No. 26.52. The other witness of fact called by the plaintiffs was Mr Wong Tuck Kheong, a\n\nland survey technician. Mr Wong made a statutory declaration in which he stated that he had been a\n\nland surveyor for 15 years. In 1999, he was the technical director and a shareholder of Acemap\n\nSurvey Services Pte Ltd. Some time in August 1999, that company was engaged by a firm of architects\n\nto conduct a topographic survey of No. 24.53. A field survey, using a field survey instrument known as Sokkia Total\n\nStation for survey distance and bearing, was carried out by one Haris Bin Ripin, a field surveyor\n\nin the employ of Acemap Survey Services Pte Ltd. Based on the field data collected, a plan was\n\nprepared. This plan, the result of feeding the data into the computer, showed a crooked boundary\n\nline between No. 26 and No. 24 where a mesh wire fence and a wooden fence were sitting.54. In Mr Wongs experience, boundary lines were seldom crooked. Therefore he\n\nreturned to the property at No. 24 with Haris to check on the crooked boundary line. As part of the\n\ncheck, he climbed over the wire mesh fence into No. 26. In paragraph 3 of his statutory declaration,\n\nhe described his findings as follows:When I climbed over the mesh wire fence somewhere near to the swimming pool,\n\n  I noticed that there was another damaged mesh wire fence (metallic in colour and rusty) amongst\n\n  the dense vegetation that was at the area of the crooked boundary line was(sic). However,\n\n  the metallic mesh wire fence was standing in part and broken in part. At the broken parts there\n\n  were footings for a fence still on the ground. I surveyed this fence and I was able to ascertain\n\n  that the boundary line was where the damaged fence was.Attached to Mr Wongs statutory declaration was the final topographic plan\n\nproduced by his company after the completion of his investigation. That plan showed both the\n\nexisting fence which encroached onto No. 24 and a wire mesh fence running along the boundary line.55. Mr Wongs statutory declaration was made in January 2001. On 22 May 2001,\n\njust before he appeared in court to testify, Mr Wong filed a clarification statement. In this, he\n\nreferred to paragraph 3 of his statutory declaration and corrected what he had said there by making\n\nthe following statement:1. When I said that \"I noticed that there was another damaged mesh wire\n\n  fence (metallic in colour and rusty) amongst the dense vegetation that was at the area of the\n\n  crooked boundary line was. However, the metallic mesh wire fence was standing in part and broken\n\n  in part. At the broken part there was footings for a fence still on the ground.\"2. I wish to state that there was no mesh wire fence standing on the footings.\n\n  The footings were concrete debris found on the site. There were remnants of the mesh wire fence,\n\n  one to two centimetres, stuck on what appeared to me as footings for a fence. The concrete on\n\n  which the traces of mesh wire fence that were found were(sic)also sparsely spread out.3. The fence plotted on the topographic plan was derived by joining all this\n\n  debris of the footings surveyed.56. Mr Wong testified that there was dense vegetation on the defendants side\n\nof the fence in August 1999, unlike the present situation. He also stated that he saw concrete\n\ndebris with fencing at four points and that he marked what he considered to be the prior fence by\n\njoining these points. Under cross-examination, he stated that he could not now remember the points\n\nand that he did not mark them at that time as he did not know the elevation of the points and did\n\nnot realise that a legal dispute would ensue. Mr Wong was preparing a topographic map and therefore\n\nin respect of each point marked on the map the elevation of the same had to be indicated.57. Under cross-examination, Mr Wong was asked when he had realised that there\n\nwas an error in relation to a statement of fact in his statutory declaration. His reply was he had\n\nrealised it that same morning when he met the plaintiffs lawyer and had been asked questions on\n\nthe height of the existing fence. He then realised that he had to make an amendment as the statutory\n\ndeclaration was misleading to a person who was not a surveyor. He asserted that he had requested\n\nthat the amendment be made.58. Mr Wong was asked why he had climbed over the fence onto No. 26. His reply\n\nwas that he had not gone on to No. 26 as he believed that the land that he stepped on belonged to\n\nNo. 24. He had climbed over the fence in order to try to trace the fence which belonged to the\n\nplaintiffs which was close to the boundary. In Mr Wongs view, the situation on the ground was\n\nvery rare in that a crooked fence had been found on site. His purpose was to try to look for a fence\n\nthat was near the boundary. In doing so, he had acted on his own initiative. He said It was only\n\nmy instinct on the plan that I decided to verify on site.59. The following portion of Mr Wongs evidence under cross-examination is\n\nparticularly important. It reads:Q Is it your evidence that in August 1999 when you climbed over the mesh\n\n  wire fence there were actually 2 fences visible to you running close to the boundary to No. 26.A No. Only the bottom fence was surveyed and the wooden fence line was\n\n  surveyed.Q Your plan seems to indicate that there is a fence on the boundary. How do you\n\n  explain that?A This fence line was only surveyed on the day my man and I climbed over the\n\n  fence.Q Is it your evidence that there was another fence in August 1999 exactly where\n\n  the real boundary is situated?A It is some concrete debris of a fence with some wire meshes which appear to\n\n  be a damaged fence.Q Is there anything on the plan to indicate that was what you meant to\n\n  symbolise rather than an actual fence running along the boundary.A The description of the fence can be indicated if the architect or the client\n\n  requests for a clarification. For a topographic survey as all the symbols for the fence have been\n\n  programmed into the computer software I believe that my draughtsman have left out the description\n\n  for this part of the fence.Q Point out to me where along this plan were the coloured debris. Mark it\n\n  yellow.A After 2 years its difficult for me to mark it. During that time I did not\n\n  have a clear sketch of every point that was surveyed. There were only 4 points along the fence and\n\n  all these points were dug up from the ground which was covered with grass. I cannot give you a\n\n  position now.Q Is it your evidence that along the actual common boundary between 24 and 26\n\n  there was thick vegetation.A Yes in form of tall grass and some trees which were not indicated in my\n\n  drawing.Q Put that there was actually no vegetation, no trees, no tall grass at all\n\n  material times along the actual common boundary.A Disagree. I was there.In re-examination, Mr Wong clarified that when he plotted the four old fence\n\npoints on the ground, at the time he surveyed those points, he did not know where the boundary line\n\nwas on the ground. He only knew that the line he drew joining the four points was in fact along the\n\nboundary when, once back in the office, he entered the four points into the computer and it plotted\n\nthe line based on data from CP 16587.",
        "(v) Mr Anthony Lim": "60. Mr Anthony Lim is a registered land surveyor. He was called by the plaintiffs\n\nas an expert witness to support the correctness of CP 16587. Mr Lim commenced working life as a\n\ntechnical assistant in the Survey Department in 1963. He remained there till 1970 when he joined the\n\nJurong Town Corporation as a principal surveyor. In 1971, Mr Lim became a registered surveyor. After\n\nleaving the Jurong Town Corporation in 1979, he continued as a surveyor in private practice.61. Mr Lim presented a short report on the common boundary between No. 24 and No.\n\n26. His firm had carried out a topographical survey at No. 24 in July 2000 and he stated that the\n\nobject of his report was to ascertain, from the results of his firms topographical survey and\n\nsearches made of the Survey Departments records, whether there was a fence running along the said\n\ncommon boundary. The result of the topographical survey had shown that there was a wooden fence\n\ndividing the compounds between the two houses as at July 2000. At that time, there was no fencing\n\nalong the common boundary itself.62. The report went on to discuss the search undertaken of the Survey Department\n\nrecords. It stated that Field Book 22696 at page 4 was a field recording by Chief Surveyors Field\n\nAssistant Mr Lee Siah Hing who surveyed the site on 1 December 1983 (I note here that the reference\n\nto page 4 was a typographical error and that the actual page referred to was page 6, the same page\n\nthat Mr Tang referred to as the Plan Page). The Plan Page showed a wire mesh fence existed along the\n\nsaid common boundary. The field recording was drawn onto a plan which was duly certified by the\n\nChief Surveyor on 4 April 1984 as CP 16587. From the documentary evidence provided at the Survey\n\nDepartment, Mr Lim concluded that there was in fact a mesh wire fence running along the said common\n\nboundary on 1 December 1983.63. Mr Lim underwent a fairly long cross-examination. He stated that at the time\n\nhe prepared the report, he was not aware of Mr Wongs topographical survey. Nor was he aware of it\n\nwhen he prepared his affidavit. Mr Wongs survey had only been shown to Mr Lim about a month\n\nbefore the hearing.64. Mr Lim was shown a letter from the Survey Department dated 9 May 2001. This\n\nwas a response to queries raised by Messrs Rajah & Tann, the defendants solicitors. It was\n\npointed out to Mr Lim that by paragraph 2(4), the Survey Department had stated:Field observations in Field Book No. 22696 pages 3,5,7 and 9, and diagram\n\n  pages 8 and 10 were checked by staff of the Survey Department. Field Book No. 22696 page 6 was not\n\n  checked as it was a recording of the field details that were not permanent features, such as\n\n  fences, wall, edge of metalled roads, coping of concrete drains, etc. in relation to the lot\n\n  boundaries.65. When asked whether he agreed with that statement, Mr Lim replied that he did\n\nnot fully agree with it. He then clarified that he did agree with what the Survey Department had\n\nsaid but did not agree with the defendants lawyers understanding of what had been stated. He\n\nexplained that the Survey Department had said that the Plan Page had not been checked as it recorded\n\nnon-permanent features. What Mr Lim understood that statement to mean was that the positions of\n\nfencing and non-permanent features were merely recorded in the diagram page of the Field Book and\n\nthe dimensions were taken and recorded by the offset method. The Survey Department had estimated the\n\nboundary. The boundary was checked and ascertained to be correct. Then the position of the fencing\n\nwas measured off from the boundary. When the Survey Department said that it had not been checked,\n\nwhat it had meant (according to Mr Lims own experience as a surveyor) was that there was no\n\nmathematical check in respect of the survey of the fencing.66. Mr Lim elaborated that as far as checking was concerned, when the surveyor Mr\n\nLee had completed his job, he would have passed it to his supervisor, a district surveyor, who would\n\nhave visited him on site to oversee the job and ensure that it was correctly done. Once the Plan\n\nPage had been scrutinised and checked by the district surveyor, at the time of the preparation of\n\nthe certified plan, this page would have been vetted and checked by the survey draughtsman, the\n\ndraughtsmans checker and the chief draughtsman who would have evaluated and assessed whether the\n\ninformation collected by the field assistant were acceptable and had been checked. These persons\n\nwould carry out the checking from the records available in the Field Book. I asked Mr Lim how the\n\ncheckers would have known whether the information in the Field Book was true or false and his reply\n\nwas that a surveyor who undertakes jobs under the Land Surveyors Act (Cap 216) is expected to be\n\ntruthful at all times. Mr Lim then agreed with me that the system was that the Survey Department\n\nrelied on the surveyor having done things accurately.67. Mr Lim was asked whether there was any evidence at all in any of the records\n\nin the Field Book of anyone other than Mr Lee having computed or checked Mr Lees calculations or\n\ndrawings insofar as the non-permanent features were concerned. His reply was that there were no such\n\nrecords. The measurements taken to establish the boundaries required mathematical checks which had\n\nin fact been undertaken and were reflected in the Field Book. On the other hand, the Plan Page was a\n\nsurvey of physical features measured off the correct boundary as established by the boundary\n\nmeasurements. The system in the Survey Department was such that there was no means of doing a\n\nmathematical check of such a simple survey. Mr Lim explained that since the Plan Page did not\n\nrequire a mathematical check, it would not be signed off by checkers although the information on the\n\nPlan Page would have been evaluated by the district surveyor, the draughtsman, the draughtsman\n\nchecker and the chief draughtsman. Mr Lim further explained that the district surveyor would have\n\nhad the opportunity of viewing the features on site and the three draughtsmen would use their\n\njudgment, based on their experience, to gauge whether the physical features as recorded were correct\n\nor not.68. Mr Lim was questioned as to the basis on which he said that checks had been\n\nmade on the relevant plan. It was suggested to him that he was in no position to confirm that\n\ninsofar as the Plan Page was concerned, that any checks were carried out at the relevant time. Mr\n\nLim strongly disputed that suggestion. The basis of his response was that he had been a field\n\nassistant in the Survey Department. Thereafter, he had been a draughtsman and had become the chief\n\ndraughtsman of the Survey Department for several years. From his practice then and the practice of\n\nthe Survey Department as he knew it, all these checks were required to be done. It was put to him\n\nthat as far as this specific plan was concerned, he had no basis to conclude that the normal\n\nprocedures were complied with. Mr Lims reply was that looking at this plan itself, in the usual\n\ncourse of events, it would have gone through the procedure he had referred to.69. In response to questions put by the defendants counsel, Mr Lim agreed that\n\ninsofar as the fence then separating the two properties was concerned, it appeared that the\n\nsurveyor, Mr Lee, had only taken measurements at the two extreme ends to establish their position in\n\nrelation to the boundary. He also agreed that Mr Lee did not appear to have taken any further\n\nmeasurements along the boundary in relation to the position of the fence. In view of that, Mr Lim\n\nwas asked how the surveyor could have joined the two extreme ends of the fence.70. To answer the question, Mr Lim referred the court to the topographical plan\n\nprepared by his firm in July 2000 (PBA 48) and another plan drawn by Mr Lee and appearing at page 10\n\nof the Field Book (DBA 133). He stated that looking at these two plans together, he was of the\n\nconsidered view that the surveyor did not make any assumption when he drew a straight line between\n\nthe two end points of the fence. Looking at DBA 133, the two end points were near the circles drawn\n\non the plan and numbered 6 and 24 (the significance of these numbered circles is that they marked\n\nstations on the land from which Mr Lee would have conducted his survey). Mr Lim admitted that\n\nstations 6 and 24 were not inter-visible. From the plan it was clear, however, that in addition Mr\n\nLee had occupied the position numbered 19 in DBA 133. This station was somewhere close to the\n\nswimming pool on No. 24 and from there Mr Lee would have been able to see the two end points 6 and\n\n24 very clearly. It would therefore have been clear to him that the fence between no. 6 and no. 24\n\nwas a straight line. Mr Lim admitted that Mr Lee had not taken any measurements of the fence in\n\nrelation to the boundary from station no. 19 but he asserted that if Mr Lee had physically stationed\n\nhimself at stations 6, 24 and 19, he would have had a good perspective view that the fence was\n\nstraight. It was put to Mr Lim that this was a hypothesis of his since there were no physical\n\nrecords of Mr Lee having done any such thing. Mr Lim did not agree. He thought that it was quite\n\nclear that Mr Lee would have stood at each of the three stations and then he would have been able to\n\nsee that the fence was a straight line.71. Mr Lim was asked how, by looking at DBA 133, he knew that Mr Lee had actually\n\nstood at the three points. The reply was that the fact that each figure had a circle around it\n\nindicated that those figures represented the stations from which Mr Lee had conducted his survey. At\n\nstations 6 and 24 he had established the position of the fencing in relation to the boundary with\n\ncertainty. The only thing lacking there was that because the two stations were not inter-visible, he\n\ncould not see whether the fence was curved or straight. But if he went up to station 19, he would be\n\nable to see both stations 6 and 24 and would be able to tell if the fence was straight. For that\n\nreason, Mr Lim did not agree with Mr Tangs statement that there was an assumption by Mr Lee that\n\nthe fence was straight.Findings72. I start with the presumption that CP 16587 is accurate. The defendant has\n\nsought to rebut that presumption. Her evidence must be balanced against the evidence that supports\n\nthe accuracy of the plan.73. The first thing to be borne in mind is that CP 16587 was prepared because\n\nReckitt & Colman had asked the Survey Department to carry out a verification survey of No. 24\n\n(described in their letter as lot 187-133 Mukim 4) and to re-fix boundary marks that were out of\n\nposition and lost. At the time this survey was carried out r 42(2) and 47(1) of the Land Surveyors\n\nRules 1976 required evidence to be obtained to determine the cause of differences between the survey\n\nplan and the ground and to measure and plot artificial features which may affect title. Thus, as Mr\n\nTang confirmed during cross-examination, a surveyor who carried out a title survey would be very\n\ncareful about fence lines affecting the title boundaries. He agreed also that the problem in the\n\npresent case was about an artificial feature (ie a fence) that was along and adjacent to a boundary\n\nand which may affect title.74. CP 16587 itself showed the wire mesh fence in question to be along the\n\nboundary line. The plaintiffs submitted that the fence was put into the plan because it was not an\n\nancillary detail but because it was a feature that was related to the boundary of No. 24. This\n\nsubmission was supported by the evidence. Mr Tang agreed that the portion of the fence between No.\n\n24 and No. 26 was too close to the boundary line to be plotted separately and that there were other\n\nparts of the boundary of No. 24 where the fence line was plotted separately. Further, within the\n\nplan itself, it is clear that the surveyor, Mr Lee, took pains to draw in the fence in relation to\n\nthe boundary line by giving measurements by which it was offset from the boundary.75. CP 16587 is the plan of No. 24 which is cited in the certificate of title\n\nrelating to that property. It is therefore the plan that anyone dealing with the property would be\n\nreferred to and would rely on in connection with the boundaries of the property. Mr Tang admitted as\n\nmuch. Further, the evidence elicited from Mr Lim under cross-examination showed the pains which the\n\nSurvey Department took to ensure the accuracy of CP 16587. As he stated, the data collected by Mr\n\nLee, the surveyor, would have been checked and cross-checked at three levels before the certified\n\nplan CP 16587 was prepared and issued. These three levels of checking would have been in addition to\n\nthe on-site checks made by the district surveyor. Mr Lim explained that the calculation for the\n\nfences would not be checked because the fences are marked but offset against the boundaries. The\n\ndistrict surveyor provided the on-site supervision and the office staff checked the work product. Mr\n\nTang agreed that drawing details by offsetting rather than by further calculation is perfectly\n\nacceptable survey practice.76. The accuracy of the plan was attacked on the basis of the proposition that\n\nthe surveyor had assumed that the fence line was straight when it was actually curved. Mr Tang\n\nrelied on the absence of any measurements to the fence from station 19 and the fact that stations 6\n\nand 24 are not inter-visible to bolster his belief that the drawing of the fence line resulted from\n\nassumption rather than observation. Whilst this belief might have been a sincere belief on Mr Tangs\n\npart, Mr Tangs objectivity in coming to this conclusion is in some doubt. As may have been\n\nrealised from the account I gave of his evidence above, I was not particularly impressed with the\n\nquality of Mr Tangs evidence. The cross-examination showed that in some respects he was\n\nattempting to make a case for the defendant. Additionally, although a surveyor of many years\n\nstanding, he did not have the depth of experience with the workings of the Survey Department that Mr\n\nLim had.77. On the other hand, Mr Lims evidence as to why the attack on CP 16587 was\n\npurely speculative was coherent and detailed and based on the common practice of surveyors which was\n\nreflected in the details entered in the various pages of the Field Book. It should be noted that in\n\nthe course of cross-examination, counsel for the defendant appears to have conceded that the\n\nsurveyor did occupy a position at station 19 since he put it to Mr Lim that while Mr Lee in the\n\ncourse of his survey occupied a position at station 19, there was no evidence in the Field Book that\n\nMr Lee had made any measurements from that position in relation to the positioning of the fence and\n\nthe boundary. While agreeing with this, Mr Lims position was that once one stood at station 19\n\nany curvature of the fence would have been abundantly obvious. Mr Lim also explained convincingly,\n\nto my mind, why the details of the fence line on the plan would have been correct notwithstanding\n\nthat they were not checked by calculation in the same way as the boundary line.78. In addition to Mr Lims account of how Mr Lee would have carried out the\n\nsurvey, there is the evidence of the Field Book that Mr Lee was on site at No. 24 between 25\n\nNovember 1983 and 1 December 1983. The plan at page 10 of the Field Book shows that he was all over\n\nthe site and occupied nine stations either within or close to the boundaries of No. 24. It seems\n\nunlikely to me that over that period of time and considering the fact that he had to walk all over\n\nthe site to get to the various stations, Mr Lee would not have noticed that the fence between No. 24\n\nand No. 26 was curved, if it had been curved at that time. As pointed out to Mr Tang and as\n\nacknowledged by him, CP 16587 showed where the fence line ran along the boundary and where the fence\n\nline diverged from the boundary. This is some indication of the attention that Mr Lee paid to the\n\nfence lines.79. Mr Lims opinion was also supported by the evidence given by Mr Wong. Mr\n\nLim had not been aware of Mr Wongs findings or map at the time he issued his report and therefore\n\ncould not have been influenced by the same. Mr Wongs evidence was of the existence of concrete\n\ndebris with wire mesh remnants at four points on the site and that he had marked the previous fence\n\nby joining these points. It was not till he returned to the office that he found out that the fence\n\ndrawn in this way coincided with the boundary between No. 24 and No. 26. Mr Wongs evidence was\n\nnot shaken in cross-examination. It was to his credit that he modified his original statement by\n\nmaking it clear that he had not found the fence still standing but simply concrete debris with small\n\nremnants of fencing. He saw dense vegetation at a place it no longer exists. The significance of\n\nthis is that thick vegetation would have retained moisture which would have contributed to the decay\n\nof the old fence and/or its remains.80. At the time Mr Wong had gone on site to check the situation, he was not aware\n\nof the adverse possession claim (in fact it had not yet been made) and had taken the trouble to\n\nconduct his own physical survey because he was troubled by the findings of his subordinate. He had\n\ntherefore wanted to check out the position. I find Mr Wong to be a credible witness.81. The plaintiffs sought also to rely on certain building drawings to support CP\n\n16587. These drawings were prepared by architects on behalf of the defendant and her husband at\n\nvarious dates when they wanted to carry out renovation work on No. 26. Of these, drawings prepared\n\nin 1970 and 1982 show a straight boundary line and a straight fence line coinciding with the\n\nboundary line. Thus, the plaintiffs say, the changes in the fence line must have taken place after\n\n1982. The defendant submits that these drawings do not prove anything as they were not topographic\n\nsurveys. The plaintiffs reply is that the architects who drew up the plans would have known what\n\nwas around them, the contractor would have known what was around them and the defendant would have\n\nknown what was around the proposed improvements. I find it difficult to make the inference from the\n\nplans that the plaintiffs wish me to make as there was no evidence as to the basis on which these\n\nplans were drawn up. I do not know whether to draw them the architects had to go on site or whether\n\nthey simply took the dimensions and details of the site from existing plans filed with the Building\n\nDepartment. In the absence of evidence establishing that, at the least, a site inspection had to be\n\nmade before the plans were prepared, I do not think that the fact that they show the fence line to\n\nbe straight assists the plaintiffs.82. The other evidence relates to the physical features found on the disputed\n\nstrip. One of these related to the drainage. There is a drain located on No. 24 which runs along the\n\npresent fence line separating the two properties instead of along the actual boundary line. There is\n\nalso a drain on No. 26 which runs from No. 26 straight through the boundary line and onto the\n\ndisputed strip. The drain located on No. 26 empties directly into the drain located on No. 24. The\n\ndefendant says that the point to note is that the two drains meet at the present fence line and that\n\nthe drainage system would have been constructed in this manner only if the disputed strip formed\n\npart of the compound of No. 26.83. I do not agree. The defendants own evidence was that at a time previous to\n\nher occupation of No. 26 there were no fences between the four houses owned by Optorg. At that\n\nstage, the drains must have already been in existence because drainage is an essential feature of\n\nany detached house. The evidence was that drains are constructed to follow the terrain rather than\n\nboundary lines. These drains must have been constructed as they were for convenience and to follow\n\nthe terrain and the absence of any fencing would have facilitated the manner in which the drains\n\nwere constructed. Mr Tangs evidence was that where the terrain allows the drain to be built along\n\nthe boundary line, it is normally built that way and that the terrain of the two properties would\n\nhave permitted such a construction. The fact that the drains were not constructed to follow the\n\nboundary line cannot mean that the disputed strip was within the compound of No. 26. All it probably\n\nmeans is that the persons who constructed the drains were not aware exactly where the boundary line\n\nran and therefore did not construct the drain along it.84. The defendant also relies on the facing of the STB stone marker. The\n\nsubmission made was that the fact that the inscribed side of the stone marker had been placed facing\n\nNo. 26 shows that at least by 1974, the fence separating the two properties must have run behind the\n\nstone marker. This submission was not, however, supported by any evidence. Mr Tangs evidence\n\nwhich was intended to support the point turned out to be pure speculation as I have pointed out\n\nabove. Further, since there was no evidence when the marker was erected, it could very well have\n\nbeen put up at the point of time when there was no fence between No. 24 and No. 26. In that case the\n\nfacing of the marker would not have signified anything about the fence.85. The defendant submitted that the wooden fence built by the owners of No. 24\n\nestablished that by the early 1980s, the existing fencing separating the two properties was already\n\nin its present position. This submission relied on Dr Teos evidence that the wooden fence was\n\nbuilt in the early to mid 1980s and the photographs that showed that the wooden fence runs alongside\n\npart of the existing fence. The defendant ignored, however, the fact that both CP 16587 and the Plan\n\nPage of the Field Book do not show the existence of the wooden fence. If the wooden fence had been\n\nin existence in December 1983, then it would have been an artificial feature running alongside a\n\nboundary which might affect title and thus probably would have been indicated on the Plan Page at\n\nleast if not on the completed survey plan. The defendants expert witness gave no evidence to\n\nexplain how such a notable feature could have been overlooked by the surveyor. Since no such\n\nindication exists it is, in my view, unlikely that the wooden fence was there in December 1983. It\n\nmust have been built thereafter. The erection of that fence in 1984 or 1985 is also consistent with\n\nDr Teos evidence since he did not give an exact date but an estimation of a time range between\n\nthe early and mid 1980s.86. The next point relates to the location of the fence and the rocks. The\n\nphotograph AL-3 was, according to the evidence, taken in the mid 1970s. It shows a hedge and a fence\n\nrunning behind the rocks in the foreground. The defendant said those rocks were placed on the\n\ndisputed strip in the 1970s. The submission made was that a comparison of photograph AL-3 and the\n\nphotograph at DB76 (a current photograph) clearly shows that the present fence line occupies the\n\nsame position as the hedge behind the rocks used to. The comparison also shows that the positions of\n\nthe rocks relative to each other are exactly the same. Additionally, a survey of the encroachment\n\ncarried out on behalf of the defendant by a firm called Messrs Lee Bon Haw confirms that the actual\n\nboundary line runs in front of the rocks shown in the two photographs. The defendant submitted that\n\nthe fence line had therefore been in the same position since the middle to late 1970s.87. The difficulty with the above submission is that it relies heavily on the map\n\n(DB32) prepared by Messrs Lee Bon Haw to establish the location of the rocks on the disputed strip.\n\nIn my view, the photographs by themselves cannot do this because it is not possible to tell from the\n\nphotographs where the boundary line on the ground is. Unfortunately for the defendant, she did not\n\ncall the surveyor from Messrs Lee Bon Haw who carried out the survey leading to the issue of DB32 in\n\nDecember 2000 to confirm its accuracy although he did file an affidavit early on in the proceedings.\n\nThe plaintiffs submitted that this omission precludes me from relying on DB32 since s 85(2) of the\n\nAct provides that maps or plans made for the purposes of any cause or other proceeding must be\n\nproved to be accurate. As the map in question was prepared for the purpose of supporting the\n\ndefendants adverse possession claim, I am constrained to accept that submission. Therefore I must\n\nhold that there is no admissible evidence that the rocks are on the disputed strip. Further,\n\nalthough the defendant testified that the rocks have never been moved it is clear from the\n\nphotograph that originally the rocks formed part of a configuration with the stone lantern. That\n\nlantern has since been removed, though when exactly it moved no one could say. It is possible that\n\neither at that time or later (for instance at the time when the hedge was cut down) that the rocks\n\nwere also moved. The defendant herself did not do the physical work in the garden and she did not\n\ncall any of the gardeners who did such work to explain exactly what had and had not happened.88. Finally, the defendant relies on the age and location of certain trees and\n\nthe stump of the salam tree. The defendants premise is that the location of the trees equates to\n\nthe location of the fence. The trees are now on the defendants side of the fence.89. Leaving the palms aside, the only evidence that the trees in question are\n\nwithin the disputed strip (as opposed to simply being within the defendants compound) is that\n\nProfessor Rao has identified, on a copy of Messrs Lee Bon Haws plan and within the area\n\ndemarcated as the disputed strip, one tree drawn on the map as the Belimbing tree and has put in a\n\ncircle on that map to denote the approximate location of the stump of the salam tree. Even accepting\n\nthat these locations are accurate, this does not mean that the Belimbing tree and the salam tree\n\nwere always within the defendants compound. The evidence in relation to the salam tree in\n\nparticular is unsatisfactory. On the basis of Professor Raos testimony, the tree stump that he\n\nsaw on the disputed strip could not have been a huge tree in the early 1970s. This means that either\n\nthe huge tree which the defendants children remember having existed in 1970 was a different tree\n\nor that there was no huge tree in 1970 and their memories of a huge tree relate to a much later\n\nperiod.90. There is no doubt that there are Macarthur palms along the defendants side\n\nof the fence line and within the disputed strip. The problem here for the defendant is that the age\n\nof those palms cannot be determined with any accuracy. The evidence that she originally deduced on\n\ntheir age became, as the plaintiffs submitted, of neutral value when Professor Rao agreed that they\n\ncould grow faster. Additionally, the defendant did say that she plants trees along the fence all the\n\ntime. In the light of this, it is difficult to draw the conclusion that it is more probable than not\n\nthat the Macarthur palms currently along the fence have been there since before December 1983. Even\n\nif they are that old, the defendant has not commented on or explained Professor Raos findings\n\nthat there were 13 cut, damaged or disturbed clumps of palms. Those findings could possibly indicate\n\ndamage inflicted when the fence was being moved.91. Having considered all of the evidence, I have come to the conclusion that the\n\ndefendant has not discharged the onus of proof upon her. I have to decide this case on the balance\n\nof probabilities and that is heavily influenced by the presumption that CP 16587 is accurate. The\n\ndefendant has not, to my mind, succeeded in rebutting that presumption. Additionally, much of the\n\nother evidence that she has adduced is either weak or equivocal. All in all, despite some evidence\n\nin her favour, she has not been able to satisfy me, on the balance of probabilities, that it is so\n\nprobable that the fence existed at its current location prior to 1 March 1982 when the 12 year\n\nlimitation period started that I should, as a prudent person, act on the supposition that it was so.\n\nAccordingly, I must find in favour of the plaintiffs.92. I therefore make the following orders:(1) that the defendant deliver to the plaintiffs within 14 days of this order,\n\n  vacant possession of the part of the land marked and shaded on the plan of a property known as No.\n\n  24 Leedon Road comprised in Certificate of Title Volume 458 Folio 139 Mukim 4 as appearing in the\n\n  affidavit of the first plaintiff;(2) that the defendant pay to the plaintiffs damages for wrongful trespass to\n\n  the part of the land in issue, to be assessed;(3) that the defendant do forthwith withdraw caveat 008787J; and(4) that the defendant pay the plaintiffs their costs of this action on the\n\n  standard basis as taxed or agreed.Sgd:JUDITH PRAKASHJUDGECopyright  Government of Singapore."
    }
}