{
    "case_title": "Momentum Creations Pte Ltd v Tan Eng Koon trading as De Angeli",
    "ncitation": "[2001] SGHC 142",
    "coram": "Woo Bih Li JC",
    "sections": {
        "FACTS AND ALLEGATIONS": "3.        The\n\nPlaintiffs Momentum Creations Pte Ltd (‘Momentum Creations’) were incorporated\n\non 18 March 1999 and are in the business of manufacturing and selling furniture. Momentum\n\nCreations is a company which is a subsidiary of Nobel Design Holdings Ltd, a public listed\n\ncompany, and has showrooms at 6 Raffles Boulevard #03-128, Marina Square, Singapore and\n\nalso at 290 Orchard Road #04-03/04, Paragon, Singapore.4.        \n\nMomentum Creations said that, since incorporation, they have been extensively advertising\n\nfor sale furniture bearing the OM mark. This is a logo in which the OM name is part of the\n\nlogo. However, the OM name is also used and referred to separately from the logo.5.        The\n\nadvertisements were placed in magazines and newspapers and were also in the form of\n\nbrochures and leaflets.6.        I\n\nused August 2000 as the cut-off date for the purpose of considering the extent of the\n\nadvertisements as that was the month which Momentum Creations said they had received\n\ncomplaints.7.        The\n\ndetails of the advertisements in magazines and newspapers as at August 2000 were:PublicationMagazines DatesCirculation(a)Home & Dcor Inspirational HomeJuly 199910,000(b)SpaceOctober / November 1999unknown(c)Home ConceptsMarch / April 200030,000(d)Home ConceptsJuly / August 200030,000Newspapers(a)The Straits Times5 August 1999(b)The Straits Times15 October 1999(c)The Straits Times18 November 1999(d)The Straits Times19 December 1999(e)The Straits Times25 February 2000(f)The Straits Times3 March 2000(g)The Straits Times7 April 2000(h)The Straits Times19 May 2000(i)The Straits Times20 May 2000(j)The Straits Times1 July 2000(k)The Straits Times21 July 2000(l)The Straits Times25 August 20008.        The\n\ndetails of the brochures and leaflets produced as at August 2000 were:Exhibit No.Number ProducedDate(a)P8 (leaflet)3,00029 June 2000(b)P9 (leaflet)7,00030 June 2000(c)P10 (brochure)-20 February 2001(d)P11 (brochure)1,00024 July 2000(e)P28 (leaflet)-In or before August 20009.        \n\nExhibits P8, P9 and P28 were the leaflets found in the folders used by the sales\n\nrepresentatives of the Defendant Mr Tan Eng Koon (NE 144 line 10 to 18). The various\n\npersons who had referred to them during conversations and in their evidence had described\n\nthese leaflets as brochures.10.        \n\nMomentum Creations also participated in furniture fairs and exhibitions.11.        \n\nAccording to Mr Lam Chee Wai, the Retail Manager of Momentum Creations, they had incurred\n\nat least $239,000 for their advertisements since 1999 up to the date of his Affidavit of\n\nEvidence-in-Chief (‘AEIC’) filed 19 February 2001. This sum was not just for the\n\ncost of the advertisements but included other expenses like photography fees and graphics.\n\nIt appeared to me that most of the expenses were incurred from March 1999 to August 2000.12.        The\n\namount spent by Momentum Creations on furniture fairs and exhibitions since 1999 up to the\n\ndate of his AEIC filed 19 February 2001 was at least $164,000. Again it appeared to me\n\nthat most of these expenses were incurred from June 1999 to August 2000.13.        On\n\n7 October 2000, Momentum Creations filed a trade-mark application in respect of the OM\n\nmark with the Intellectual Property Office of Singapore.14.        \n\nMomentum Creations also gave names to individual items of furniture which they sold under\n\nthe OM mark.15.        The\n\ncase before me involves four items of furniture which were sold by them under the\n\nfollowing names:ItemName(a)An L-shape sofa‘Case’(b)Another L-shape\n\n        sofa of a different design‘Globe’(c)A sideboard‘Catena’(d)A coffee table‘Graves’There is no application to\n\n    register these four names as part of trade-marks.16.        The\n\nadvertisements and the leaflets did not feature the same four items of furniture all the\n\ntime.17.        The\n\nDefendant Mr Tan Eng Koon has been in the furniture business since 11 March 1991 under the\n\nname of St Louis Furniture and since 1 November 1995 under the name of De Angeli i.e even\n\nbefore Momentum Creations was incorporated.18.        I\n\nwill refer to the Defendant as Mr Tan or De Angeli. I would add that the main evidence for\n\nhim came from his wife Mdm Tang Lee Lee.19.        She\n\nclaimed to be the sales manager for De Angeli and to be in charge of the day to day\n\nrunning of the business and dealings with the manufacturers and salesgirls. She also\n\nclaimed that her knowledge of the business was more extensive than Mr Tan’s.20.        Mr\n\nTan has a showroom at Block 201 Henderson Road #02-01 NTUC Income Henderson Industrial,\n\nSingapore and also at 1 Maritime Square #00-61, World Trade Centre, Singapore.21.        Mr\n\nTan also participates in furniture fairs and exhibitions.22.        \n\nAmong the items of furniture sold by De Angeli were four items which were the subject of\n\nthe action before me, i.e two L-shape sofas, a sideboard and a coffee table.23.        \n\nEach of these items was visually strikingly similar to the items sold by Momentum\n\nCreations.24.        \n\nAccording to Mr Lam, the unique features were:‘Q     \n\n    What are unique features of Case, Globe, Catena and Graves?A\n\n           ….For Globe it is 3 modular, you\n\n      can have it as one or two. The fabric is detachable. The legs are stainless steel. The\n\n      sitting cushions use high density foam. The back cushions we use fibre fill and not\n\n      cotton.For Case sofa, fabric is\n\n      detachable. The sitting cushions are high density foam. The legs are stainless steel. The\n\n      back cushions are fibre fill. There are at least 2 locks to lock the modules.For Graves, we use stainless\n\n      steel for the legs. The top uses medium density fibre board and not chip board.For Catena, we use medium density\n\n      fibre board and not chip board. There is a variety of 3 colours. The legs, the handle, the\n\n      sliding door are made of stainless steel. It is full veneer wood.’(see NE 73 line 10 to line 22)25.        On\n\nthe other hand, the evidence of Mdm Tang was that the greatest difference between the De\n\nAngeli sofa and the OM ‘Case’ sofa was in the measurement although she did not\n\nknow the measurement of the OM ‘Case’ sofa.",
        "August 2000 - Mr Raymond Cheong": "26.        Mr\n\nLam of Momentum Creations said that in August 2000 he received two complaints.27.        One\n\nwas from a Mr Raymond Cheong who said that at an exhibition held at the Singapore Expo, a\n\nDe Angeli’s sales representative had furnished him with catalogues and brochures and\n\nrepresented to him that De Angeli is the distributor of the brand of sofas known as OM.\n\nRepresentations were also made to Mr Cheong to the effect that De Angeli is a wholesaler\n\nand was able to offer sofas at much lower prices and of better quality (see Mr Lam’s\n\nAEIC at paras 13 and 14).28.        Mr\n\nCheong eventually agreed to give evidence for Momentum Creations.29.        In\n\nMr Cheong’s AEIC signed on 26 February 2001 (about five months later) he said:(a) He had come to know about OM\n\n    and their range of furniture through advertisements placed in newspaper and magazines. He\n\n    had been to the OM showroom at Marina Square. He had noticed a tag bearing the OM mark\n\n    sewn onto the upholstery of their sofas (para 3 of AEIC).(b) In August 2000, his wife and\n\n    he decided to visit a furniture exhibition at the Singapore Expo, located at 1 Expo Drive,\n\n    with the intention of looking for sofas (para 4 of AEIC).(c) De Angeli’s booth at the\n\n    exhibition was located near the entrance of the exhibition hall. It had the words ‘De\n\n    Angeli’ prominently displayed (para 6 of AEIC).(d) As they were walking by the\n\n    booth, one of De Angeli’s female sales representatives approached them. She was\n\n    carrying a plastic folder and invited them to look at their furniture (para 7 of AEIC).(e) His wife and he spotted an\n\n    L-shape sofa similar to the ‘Case’ sofa being sold by OM. The sales\n\n    representative told them the price of the sofa which was much lower than OM’s price\n\n    (para 8 of AEIC).(f) The sales representative\n\n    showed them some fabric samples, lifted up a cushion on the sofa and showed a special\n\n    lining on the sofa. Mr Cheong sat on the sofa to feel its quality (para 9 of AEIC).(g) The sales representative\n\n    opened the plastic folder which had clear plastic sleeves and flipped to a page containing\n\n    OM’s brochure. Mr Cheong examined a brochure (actually a leaflet) identical to\n\n    Exhibit P9. Mr Cheong claimed that the sales representative pointed to the\n\n    ‘Case’ sofa depicted in the leaflet and told his wife and him that that was what\n\n    they were looking at. She then showed him a newspaper cutting of OM’s advertisement\n\n    in the same plastic folder and pointed to the ‘Case’ sofa depicted in that\n\n    advertisement. The copy of the newspaper advertisement exhibited in Mr Cheong’s AEIC\n\n    was similar to the one as the leaflet (para 10 of AEIC).(h) The sales representative said\n\n    they were the sofa manufacturers for OM and explained why they could sell at a lower\n\n    price. She also showed him some invoices of sales already concluded (para 11 of AEIC).(i) Mr Cheong said that he\n\n    continued sitting on the sofa and noticed that the cushions were thinner, softer and not\n\n    as dense as the ones he had seen in the OM showroom. He also noticed that the fabric\n\n    upholstery was of an inferior quality (para 12 of AEIC).(j) He walked around the sofa to\n\n    see if it had the OM tag but could not find any (para 13 of AEIC).(k) He became doubtful as to\n\n    whether De Angeli was the sofa manufacturer for OM and asked for a namecard but none was\n\n    given to him. He asked for the address of their showroom but the sales representative\n\n    refused to tell him (para 14 of AEIC).(l) His wife was quite keen on\n\n    the sofa displayed. He told her not to rush into buying it. She agreed and they left to\n\n    look at other furniture in the exhibition (para 15 of AEIC).(m) After walking around and not\n\n    finding anything they liked, they decided to leave the exhibition. However his wife was\n\n    still keen on the L-shape sofa that they had seen. So, Mr Cheong asked her to contact\n\n    OM’s Marina showroom to check their closing time so that they could go there and\n\n    confirm whether De Angeli was indeed the manufacturer of OM sofas (para 16 of AEIC).(n) After getting the phone\n\n    number of the OM Marina showroom and contacting them to find out their closing time, his\n\n    wife and he proceeded there (paras 17 and 18 of AEIC).(o) Upon reaching the OM Marina\n\n    showroom, he spoke to a man who turned out to be the Retail Manager of Momentum Creations,\n\n    Mr Lam Chee Wai. It was at this showroom that he first met Mr Lam. He told Mr Lam what had\n\n    happened and Mr Lam was quite surprised. Mr Lam told him that De Angeli did not\n\n    manufacture OM sofas. Mr Lam asked for Mr Cheong’s contact number and Mr Cheong\n\n    provided his pager number (para 19 of AEIC).(p) Mr Cheong joined his wife in\n\n    looking at the ‘Case’ sofa displayed in the Marina showroom and both were\n\n    convinced that the one in De Angeli’s booth was of a poorer quality in material and\n\n    fabric although identical in design (para 20 of AEIC).(q) After taking some brochures,\n\n    they left the Marina showroom.30.        In\n\nthe course of the cross-examination of Mr Lam and Mr Cheong, contradictions in or between\n\ntheir evidence surfaced. I will refer to some of the unsatisfactory evidence.31.        \n\nFirst, Mr Cheong had said that it was at the Marina showroom of OM that he had first met\n\nMr Lam. This was incorrect. Mr Lam had come to know Mr Cheong previously when Mr Lam was\n\nworking in a trading company.32.        \n\nThis led Ms Foo Soon Yien, acting for De Angeli, to submit that Mr Cheong was not a\n\ngenuine customer but had been sent by Momentum Creations to check on De Angeli. I was of\n\nthe view that this was not a valid argument. First, Mr Lam revealed without hesitation\n\nthat he had come to know Mr Cheong in Mr Lam’s previous job. Secondly, if Mr Cheong\n\nhad been sent to check on De Angeli, there would have been no difficulty in getting him to\n\ngive evidence against De Angeli. As it turned out Momentum Creations managed to get an\n\naffidavit from Mr Cheong only much later. Thirdly, Mr Cheong and Mr Lam were not friends\n\nbut business acquaintances. There was no particular reason for Mr Lam to pick Mr Cheong to\n\nhelp Momentum Creations and indeed none was suggested by Ms Foo beyond the argument that\n\nMr Lam had known Mr Cheong before. Fifthly, Momentum Creations had no hesitation in using\n\nprivate investigators as I will elaborate below. If they had wanted to send someone to\n\ncheck on De Angeli, they would have sent their own employee or a private investigator\n\ninstead of an acquaintance of one of their employees.33.        A\n\nsecond illustration of unsatisfactory evidence was when Mr Cheong said in his oral\n\nevidence that he did not collect any brochures from the OM showroom on the night in\n\nquestion. He had stated to the contrary in his AEIC.34.        \n\nThirdly, Mr Lam had said that Mr Cheong had told him that Mr Cheong had requested the De\n\nAngeli’s sales representative to specifically write on the order form that De Angeli\n\nis the distributor of OM products but Mr Cheong denied telling Mr Lam this.35.        \n\nFourthly, in Mr Cheong’s AEIC, he had said that an OM newspaper advertisement was\n\nalso in the folder which De Angeli’s sales representative had shown him but this was\n\nnot mentioned in Mr Lam’s AEIC.36.        It\n\nseemed strange to me that De Angeli should include in the folder a black and white\n\nnewspaper advertisement which was identical to Exhibit P9 which was in colour.\n\nFurthermore, none of the private investigators engaged by Momentum Creations who were\n\nsubsequently also shown a folder by a sales representative of De Angeli had mentioned in\n\ntheir evidence that the folder contained an OM newspaper advertisement.37.        On\n\nthis point, I found that Momentum Creations had tried to be clever. They must have\n\nrealised that there had been no evidence that De Angeli had used their newspaper\n\nadvertisements as well and so, when Mr Cheong eventually agreed to provide an affidavit,\n\nthey slipped in this evidence. Mr Cheong probably did not check his AEIC carefully.38.        \n\nAfter having heard Mr Cheong’s evidence and seen his demeanour, I was of the view\n\nthat Mr Cheong was not so much dishonest but careless. He appeared annoyed at having to\n\ngive evidence and even more annoyed at having his evidence challenged, although he tried\n\nnot to show it. Once he had given a response, he was also not objective enough to admit\n\nthat the response was wrong or inaccurate even when this was the case.39.        \n\nHowever, although Mr Cheong was not credible on various points, I accepted his evidence on\n\nthe main point i.e that a sales representative of De Angeli had shown him an OM brochure\n\nand also represented to him and his wife that De Angeli was the manufacturer of the OM\n\nproducts. That is why he and his wife went to the OM Marina showroom the same night to\n\ncheck up on what they had been told.",
        "August 2000 – Chu Swee Seng": "40.        Mr\n\nLam said that also in August 2000, he had received a complaint from another person, one Ms\n\nChu Swee Seng, that one of De Angeli’s sales representatives had showed her OM\n\nbrochures and represented, inter alia, that De Angeli is the distributor of the OM sofas.41.        \n\nHowever, Ms Chu was not called to give evidence.",
        "21 September 2000": "42.        In\n\nany event, Mr Lam said that he decided to look into the matter. On 21 September 2000, he\n\ndecided to go to the Singapore Expo, which was holding the 2ndSingapore\n\nExhibition Home & Garden, where he knew that De Angeli had set up an exhibition booth.\n\nHe went with one Ms Teo Hui Ging who is employed by Nobel Design Holdings Ltd.43.        He\n\nasked Ms Teo to approach the sales representatives at De Angeli’s booth to find out,\n\nwithout alerting them, whether they were using the OM brochures to sell furniture.44.        Ms\n\nTeo subsequently met up with him and told him that one of De Angeli’s sales\n\nrepresentatives, one Kelly, had shown Ms Teo OM brochures and had represented that De\n\nAngeli were the manufacturers and wholesalers of OM products.45.        Mr\n\nLam said he then instructed Ms Teo to wait while he went to the booth and confronted Kelly\n\non her use of OM brochures and her representation. However, when confronted, Kelly denied\n\nboth allegations. Mr Lam then left De Angeli’s booth.46.        Ms\n\nTeo provided an AEIC and gave evidence. She corroborated Mr Lam’s evidence.47.        \n\nHowever there were some inconsistencies in her evidence. For example, during\n\ncross-examination, she initially said she did not raise the OM name or ask Kelly about OM\n\nbut later she said she did (NE 104 line 12 to 14 and NE 105 line 18 to 21).48.        She\n\nalso said that the purpose of the visit on 21 September 2000 was not to check on De Angeli\n\nwhich I found strange as, according to Mr Lam, that was the very purpose of the visit and\n\nshe must have known about it.49.        I\n\nalso accept that given that she first provided an affidavit only on 19 February 2001, she\n\ncould not have remembered accurately every aspect of her conversation with the sales\n\nrepresentative in detail.50.        Mr\n\nLam’s evidence was also inconsistent. In his AEIC (at paras 24 to 28) he said that he\n\nhad requested Ms Teo to approach De Angeli’s sales representative to check on them\n\nand Ms Teo was to call him on his mobile phone once she was done at De Angeli’s\n\nbooth. Yet in his first affidavit, filed on 29 September 2000 for an interim injunction,\n\nhe said Ms Teo (then identified as Jocelyn Teo) and he had approached the Defendant’s\n\nsales representative Kelly on that day.51.        On\n\nthe other hand, Kelly, whose full name is Chong Ching Fui, said that in September 2000,\n\nshe was only working as a salesgirl for about five months. She claimed that she did not\n\nknow about OM or Momentum Creations so she could not have said that De Angeli is the\n\nsupplier of OM sofas.52.        In\n\ncross-examination, she said she had never heard of the OM brand (NE 244 line 13/14).53.        She\n\nalso said she had never seen the OM brochures, i.e the leaflets, with the names\n\n‘Case’ and ‘Globe’ on them (NE 244 line 1 and 2).54.        \n\nThirdly, she said that she did not write the names ‘Case’ and ‘Globe’\n\non invoices for furniture sold by De Angeli (NE 241 line 21 to 242 line 3).55.        \n\nEach of these important statements by Kelly was untrue.56.        She\n\nhad written the names ‘Case’ and ‘Globe’ on invoices for similar\n\nfurniture sold by De Angeli. The earliest invoices before me which had either one of the\n\ntwo names and were signed by her were dated 16 September 2000. She must have seen the OM\n\nleaflets with the names ‘Case’ and ‘Globe’ on them as she did not\n\ndream up these names herself. Furthermore, the leaflets were in one or two folders which\n\nthe sales representatives of De Angeli were aware of (para 4 of her AEIC). She was\n\nobviously aware of the OM brand.57.        On\n\nthe material points as to whether she had shown an OM leaflet to Ms Teo and made the\n\nrepresentation alleged, I preferred the evidence of Ms Teo to Kelly’s.",
        "Investigations by private\n\ninvestigators": "58.        Mr\n\nLam then instructed solicitors to engage private investigators. Commercial Investigation\n\nwere engaged. I set out below some details of the investigations.Before Interim Injunction Order dated 29 September 2000S/NoDate\n\n      of InvestigationDate\n\n      of Written ReportName\n\n      of OperativeName\n\n      of Sales RepresentativeVenue1.23/09/200025/09/2000a)\n\n      Leslie Ho Kheng Yamb) Leo YingRosalind\n\n      (full name Ang Kim Hua)Singapore\n\n      Expo at Upper Changi Road East2.27/09/200028/09/2000a)\n\n      Chong Ban Leongb) Samantha Chiam Hwee ThengKym\n\n      (full name Lin Yee Kum)Singapore\n\n      International Convention &Exhibition Centre\n\n      (‘SICEC’)After Interlocutory Injunction\n\n      Order dated 29 September 20003.01/10/200002/10/2000a)\n\n      Leslie Ho Kheng Yamb) Leo YingRosalindSICEC4.07/10/200010/10/2000a)\n\n      Leong Chien Hngb) Chow Huar HongMs\n\n      LimDe\n\n      Angeli Showroom at Henderson5.30/11/200004/12/2000a)\n\n      Leong Chien Hngb) Chong Ban Leongc) Samantha Chiam Hwee Theng-i)\n\n      De Angeli showroom at World Trade Centreii) De Angeli showroom at\n\n      Henderson6.16/02/200016/02/2000a)\n\n      Tan Chia Huatb) Philip Tan See WeiJenny\n\n      (full name Tan Kwee Peng)i)\n\n      Singapore Expoii) Suntec City Exhibition Hall59.        \n\nEach of the investigations was video-recorded. The various conversations were in a mixture\n\nof English and Mandarin. Transcripts in English for S/No 1 to 4 and 6 were provided by the\n\nchief investigator Philip Tan See Wei who speaks both languages fluently.60.        The\n\naccuracy of the transcripts was not questioned except for one or two words which were not\n\nmaterial.61.        I\n\nwill refer to only some of the transcripts.",
        "23 September 2000": "62.        The\n\nfirst investigation was on 23 September 2000. An operative went to the same exhibition as\n\nMs Teo and Mr Lam did i.e the 2ndSingapore Home & Garden Exhibition at the\n\nSingapore Expo. The salesgirl in question was Rosalind who is identified as ‘R’\n\nin the transcript. ‘Op’ refers to an operative.63.        I\n\nset out below part of the transcript:‘R: This is manufactured by\n\n    our own factory. Some showroom sell at few thousand dollars. Like OM.(R shows Op OM’s brochures)R: They sell the same design but\n\n    the position is different. They sell at $3,400. (Points to the brochure) With the table is\n\n    $3,400, without table is $2,000 plus. This is offered at $1980 direct from our factory,\n\n    it’s from a different factory, all these frames are standard. They are from Italy.Op: Is this the same as theirs?\n\n    (Referring to OM brochure)R: Exactly the same, frame all\n\n    the same.Op: Same as which company?R: OM. Have you heard of it?Op: Where is it? Is it at Marina\n\n    2ndfloor?R: Yes, Marina.Op: Are you all from the same\n\n    company?R: No, no, not the same factory\n\n    manufacturing. Our price will be lower than theirs because we make ourselves in our\n\n    factory and sell.Op: You supply to them?R: No. They have their own\n\n    factory, because their advertisement very costly so they increase the price. We sell\n\n    direct from factory, and we have no permanent retail showroom. We sell at direct factory\n\n    prices.Op: Is this the range that they\n\n    have?R: It is similar. (Points to\n\n    Case) This is the smaller one. (Points to Globe) That is the bigger set. (Points to the\n\n    sofa in the exhibition booth) That is exactly the same one.Op: Is this Globe?R: Yah, Globe.….(Op holds the folder and flips\n\n    through it. After a while, R takes it back)R: (Points to Case) This is\n\n    $1,580.Op: $1,580 ….R: If you look at theirs, it is\n\n    $2,000 plus. Their packaging includes TV console and two coffee tables at $3,980. If you\n\n    buy package from us, it would include TV console at $2,588.….(R shows a delivery order and\n\n    points at it)R: Look, this is Case at $1,580.\n\n    But because they don’t want TV console but (points to delivery order further down)\n\n    only the coffee table and side table, we charge that at an additional $199. They reserved\n\n    it for two years.Op: Why are they exactly the\n\n    same?R: The same, because this kind of\n\n    framing is standard. We have a factory, they have a factory. We import our frame. All the\n\n    fabrics are locally made, so is theirs. We give a five years’ warranty, so you\n\n    don’t have to worry that sometimes when you sit down the cushion will become flat\n\n    because ours is supported by pocket spring, not just foam. Our upholstery is much better\n\n    than theirs because theirs below only use a white and coarse type fabric whereas we use\n\n    the same material throughout. Workmanship is very important in such things and the\n\n    customers are very shrewd, they will know. Even if we don’t talk about quality, just\n\n    by the price they will know. Theirs is $2,800, ours is $2,380. See, they sell it at $2,000\n\n    plus. (Flips to delivery order and points) Look, Globe (points at delivery order) like\n\n    this one, which is this set (points to sofa in exhibition booth) they only want it in\n\n    2001.Op: Why don’t you use the\n\n    same name?R: The frame is the same, they\n\n    are all imported frame, from the factory. This is the name of the design. The frame is the\n\n    same. We take from the same agent.Op: The price difference is very\n\n    great!R: Yah, of course, which is why\n\n    we have so many customers who reserve so long, one year, two years.Op: This one is too big.R: Or you can take Case.(Walks back to Case)….Op: So you supply to OM?R: No, we don’t. We have our\n\n    own factory and so do they. We each manufacture our own but the frame and design is the\n\n    same. But no point you going because they specialise in retail. They have to advertise and\n\n    catalogues. Their advertising fees will be $30,000 to $40,000 a month and therefore they\n\n    will not be able to sell you at a cheaper price.’",
        "27 September 2000": "64.        The\n\nnext investigation was done on 27 September 2000 at the Home Concepts Exhibition at the\n\nSingapore International Convention & Exhibition Centre where De Angeli was also an\n\nexhibitor.65.        \n\nThere, two other operatives spoke to another sales representative of De Angeli, one Kym,\n\nwhose full name is Lin Yee Kum.66.        I\n\nset out below part of the transcript:‘Op1: You all supply to OM\n\n    ah?Kym: Err this is … I do not\n\n    know how to put it to you … because this is linked to our sales department.Op1: Quality the same with\n\n    OM’s?K: Quality all the same.Op1: OM sells it at $2,000 plus\n\n    but you are selling at $1,980 … are you sure it is the same quality?K: Yes it is the same.Op2: That means if the quality is\n\n    the same, that means it comes form the same distributor?K: Yes.Op1: Oh you and OM have the same\n\n    distributors? Oh I thought that you supply to OM which is why OM’s is so expensive.K: I do not know how to put it to\n\n    you but our bosses … erm … they are linked lah. (Shows the brochure) Example\n\n    … it costs $2,000 plus but … if it is in the exhibition it costs $1,980.….Op2: (Muffled ….) Are you\n\n    sure that the quality is the same as OM’s?K: (Pointing to OM brochure) They\n\n    are exactly the same. Rest assured, we have a lot of customers, you can see it from our\n\n    many orders.’",
        "Interim Injunction Order dated 29\n\nSeptember 2000": "67.        \n\nMomentum Creations then applied on 29 September 2000 for an interim injunction to, inter\n\nalia, restrain De Angeli from using the OM leaflets and to restrain De Angeli from selling\n\nthe look-alike ‘Case’ and ‘Globe’ sofas.68.        In\n\nthe supporting affidavit of Mr Lam, he referred to the two investigation reports of the\n\ninvestigations done on 23 and 27 September 2000. At that time, the transcripts of the\n\nvideo recordings were not exhibited. Perhaps they had not been prepared yet.69.        On\n\nthe same day, an Interim Injunction Order was granted against De Angeli.70.        I\n\nneed not go into detail about the attempts to serve the relevant cause papers on Mr Tan\n\npersonally. Suffice it to say that his sales representatives were served with, inter alia,\n\nthe Interim Injunction Order on the same day i.e 29 September 2000 and he knew about it\n\nimmediately thereafter or in the night of the same day.",
        "7 October 2000": "71.        In\n\nthe third investigation on 1 October 2000, the operatives purchased a sofa from De Angeli.\n\nThe invoice No 5845 was issued by Rosalind. It stated ‘Model: Case L-shape\n\nsofa’.",
        "Responses thereafter": "72.        \n\nFour affidavits were filed for De Angeli on 10 October 2000. I need to refer to three\n\nonly.73.        In\n\npara 12 of Mr Tan’s own affidavit, he said that, ‘Neither I nor any of my sales\n\nrepresentatives have the Plaintiff’s catalogue and brochure nor have claimed the\n\nDefendant is the distributor or supplier of the Plaintiff’s brand of sofa known as OM\n\nor linked to the Plaintiff as alleged or at all’.74.        In\n\npara 5 of Ang Kim Hua’s (Rosalind’s) affidavit, she said, ‘I did not call\n\nthe Defendant’s sofas \"Case\" or \"Globe\".’75.        In\n\npara 6 of her affidavit, she said, ‘I deny stating that OM sells the same type of\n\nsofa and I deny informing anyone that OM was at Marina Square’.76.        In\n\npara 8 of her affidavit, she said, ‘… I deny pointing to a brochure depicting\n\nthe \"Case\" package of OM with the price of $3,980’.77.        In\n\npara 8 of Lin Yee Kum’s (Kym’s) affidavit, she said, ‘… I deny showing\n\nany OM brochures to any customers’.78.        As\n\nthe video recordings and transcripts showed, all of these statements on behalf of De\n\nAngeli were false. The deponents had not known that the private investigators had\n\nvideo-recorded the visits on 23 and 27 September 2000.79.        \n\nWhen they eventually realised this, Rosalind and Kym sought to explain away their false\n\nstatements by saying that they had been afraid. This begs the question. If they did not\n\nthink that they had done anything wrong and since De Angeli had the benefit of legal\n\nadvice, there was no reason for them to be afraid and lie about the use of the OM leaflets\n\nin their affidavits.80.        The\n\ntruth of the matter is that they had lied blatantly, no doubt at the behest of Mr Tan or\n\nhis wife Mdm Tang Lee Lee who must have thought that there was no evidence to catch them.\n\nThe sales representatives were of course doing as they were told.81.        As\n\nfor Mr Tan’s evidence, Mdm Tang sought to explain it away by saying that he had tried\n\nto protect Kym and Rosalind and it was on information given by them (NE 148 line 9 to 14).\n\nI did not accept this explanation. If he did not know their evidence was untrue, there was\n\nno question of trying to protect them.82.        In\n\nany event, I did not accept his feigned ignorance of the fact that OM leaflets had been\n\nused.",
        "Interim Injunction Order dated 9\n\nNovember 2000": "83.        The\n\nOrder of 29 September 2000 was subsequently replaced by another Order on 9 November 2000\n\nwhich allowed Mr Tan to sell the items of furniture in question provided notices to\n\ndisclaim any association with Momentum Creations or OM were displayed.",
        "16 February 2001": "84.        I\n\nwould add that even as late as 16 February 2001, an investigation revealed that a sales\n\nrepresentative of Mr Tan, one Jenny, whose full name is Tan Kwee Peng, was referring to a\n\nsideboard and coffee table, sold at a St Louis exhibition booth at the Singapore Expo, as\n\nOM’s design. These were the items similar to the ‘Catena’ and\n\n‘Graves’ sideboard and coffee table respectively.",
        "Did De Angeli copy the OM design\n\nof the four items of furniture?": "85.        As\n\nI have said, the main evidence for Mr Tan came from his wife Tang Lee Lee. She was the\n\nfirst witness for him.86.        She\n\nclaimed that the designs of the four items of furniture in question were not copied from\n\nMomentum Creations and that the ideas for them were obtained from a perusal of various\n\nbrochures of other furniture and/or visits to overseas trade exhibitions. Furthermore, Mr\n\nTan and her took into account market trends and customer preferences as well as feedback\n\nfrom their sales staff.87.        In\n\ncross-examination, she identified which brochures she and Mr Tan had based their designs\n\nfor the sofas on and sought to elaborate as to how they came up with the designs.88.        Mr\n\nTan, who was in court when Mdm Tang gave her evidence, naturally echoed what she had said\n\nwhen it was his turn to give evidence.89.        \n\nHowever, I noted that at no time in the AEICs of Mr Tan or Mdm Tang did they identify the\n\nspecific brochures which were supposed to be the inspirational sources for the designs or\n\nelaborate as to how they had come up with the designs.90.        \n\nSecondly, although Desmond Lee of Nikon Furniture was identified as the manufacturer or\n\ncontractor of the two sofas in question for De Angeli (see Mdm Tang’s AEIC para 7),\n\nhe was not called to give evidence for De Angeli.91.        \n\nThirdly, no drawing or sketch of the sofas was produced in evidence for Mr Tan. According\n\nto Mdm Tang, there was no drawing or sketch.92.        As\n\nfor the coffee table and sideboard in question, one Mr Teo of Tek Furniture was identified\n\nas the manufacturer or contractor of these two items (see Mdm Tang’s AEIC para 12).\n\nThe full name of the contractor is Tek Furniture Contractor (see Mdm Tang’s AEIC p\n\n391).93.        Mdm\n\nTang mentioned that usually she would describe the furniture or do a sketch of the design\n\nshe had in mind. Mr Teo would then come up with the detailed designs and the actual\n\nproducts (see Mdm Tang’s AEIC para 13). However for the coffee table or sideboard in\n\nquestion, no sketch was provided to the contractor.94.        \n\nAgain, the contractor (for the coffee table and sideboard) was not called to give evidence\n\nfor De Angeli.95.        \n\nFurthermore, for the design of the ‘Graves’ coffee table, Mr Tan said that he\n\nsaw the design in Milan and in China. He produced a brochure from Milan (Exhibit D17). He\n\nsaid twice that he had received it before 1999.96.        The\n\ntop of the front cover of that brochure has the name ‘Ravarini Castoldi &\n\nC’. More significantly the bottom states, \"Novita’ Aprile 2000\".97.        Mr\n\nTan agreed that the bottom date refers to April 2000. When the date was pointed out to\n\nhim, he refused to say that he had made a mistake. Instead he suggested that the brochure\n\nmust have been printed one year ahead.98.        I\n\ndid not accept this evidence. Even if the brochure was printed one year ahead, this would\n\nbe April 1999 but he had said that he had received it before 1999.99.        On\n\nthe part of Momentum Creations, their designer, one Adrian Chua was not called to give\n\nevidence. However, Mr Lam of Momentum Creations offered twice to show the technical\n\ndrawings (NE 10 line 20 to 22 and NE 11 line 7) but his offer was not taken up by Ms Foo.100.        It\n\nwas clear to me that De Angeli had copied the designs of the four items of furniture from\n\nthe OM range of furniture. Whether Momentum Creations had themselves copied the furniture\n\nfrom others is a separate matter.",
        "What did the OM leaflets in the\n\nfolders show?": "101.        \n\nMdm Tang said that she was the one who had prepared the folders used by the sales\n\nrepresentatives and there were two folders with the leaflets in question. The folders\n\ncontain Exhibits P8, P9 and P28 (NE 144 line 10 to 18).102.        \n\nFor Exhibit P8, she said that a customer may have left it in an exhibition booth so she\n\nkept it.103.        \n\nFor Exhibit P9 and P28, she could not remember how she had obtained the leaflets.104.        I\n\ndid not accept Mdm Tang’s evidence on Exhibit P8. She had deliberately chosen to use\n\nthis leaflet and the others, P9 and P28, to push the sales of similar furniture by De\n\nAngeli.105.        I\n\nwould give a brief description of the three leaflets.106.        \n\nExhibit P8 is a one-sided colour leaflet with the heading ‘Our Summer\n\nCollection’. The OM mark is at the top right hand of the leaflet. The OM name and\n\nshowroom addresses and other particulars are stated at the bottom of the leaflet.107.        \n\nExhibit P9 is a one-sided colour leaflet also with the heading ‘Our Summer\n\nCollection’. Like Exhibit P8, the OM mark is at the top right hand of the leaflet and\n\nthe OM name and showroom addresses and other particulars are stated at the bottom of the\n\nleaflet.108.        \n\nHowever, below the heading of Exhibit P9 are the following sentences:‘You can’t help but\n\n    love it.OMis all about enjoying a quality living environment and the best\n\n    thing in life … atbest prices!With its budget friendly,\n\n    value-for-design approach, we now offer you ourSummer Collection packages at\n\n    irresistible prices!’109.        \n\nExhibits P8 and P9 show, inter alia, the ‘Case’ sofa and ‘Catena sideboard.110.        \n\nExhibit P28 is a double-sided colour leaflet. The top right hand on the front has the OM\n\nmark.111.        On\n\nthe back, the address of the Marina showroom is stated in full but not the OM name.\n\nTherefore, if one were to look at the back of this leaflet, one would not see the OM name.112.        \n\nThe back of Exhibit P28 shows, inter alia, the ‘Globe’ sofa and ‘Graves\n\ncoffee table.113.        In\n\nthe course of Mdm Tang’s oral evidence, she said that the OM mark at the top right\n\nhand of each leaflet and the OM name and address at the bottom of Exhibits P8 and P9 were\n\nnot visible because she had either bent the top and the bottom or cut them.114.        \n\nFor Exhibit P28, her evidence was that the leaflet was placed facing downwards so that the\n\nOM logo and the address on the front could not be seen unless the leaflet was taken out\n\nand turned over. This evidence was correct and I need say no more about P28 for the time\n\nbeing.115.        As\n\nfor Exhibits P8 and P9, Mr Samuel Chacko, for Momentum Creations, was content to adopt, in\n\nhis submission, the evidence of Mdm Tang as to how she had either bent or cut the top and\n\nbottom of Exhibits P8 and P9. I was of the view that this was probably because he thought\n\nit brought the facts closer to a case which he was relying on i.eBristol\n\nConservatories Ltd v Conservatories Custom Built Ltd[1989] RPC 455.116.        Ms\n\nFoo also urged me to accept this evidence.117.        \n\nHowever, I was not prepared to accept such evidence.118.        \n\nWhen the witnesses for Momentum Creations, including the private investigators, were\n\ngiving evidence, their evidence was along the line that Exhibits P8 and P9 had been shown\n\nin their entirety by the sales representatives of De Angeli. There was no suggestion then\n\nthat the top or the bottom of either of these leaflets had been bent or cut off.119.        \n\nLikewise, Ms Foo did not so much as query or suggest to any of these witnesses that the\n\ntop or the bottom of Exhibit P8 or P9 had been bent or cut off. Indeed, her questions were\n\nalong the line that it was obvious that the leaflets P8 and P9 were OM leaflets and the\n\naddresses thereon could be seen (see NE 59 line 5 and 6, NE 95 line 1, NE 127 line 11 to\n\nNE 129 line 8).120.        \n\nFurthermore, as I have mentioned, for Exhibit P9, the OM name is also found below the\n\nheading (see para 108 above) so that even if the top and bottom of Exhibit P9 had been\n\nbent or cut off, there was still a reference to the OM name below the heading of ‘Our\n\nSummer Collection’.121.        I\n\nfound that Mdm Tang had tried to be clever. She had viewed the video recordings and must\n\nhave realised that the OM mark at the top and the OM name and address at the bottom of\n\nExhibits P8 and P9 were not visible from the video recordings. However, she forgot that\n\nthe OM name also appeared below the heading of Exhibit P9 so that her story about bending\n\nor cutting off the top and bottom did not help Mr Tan much.122.        \n\nBesides, her evidence that the top and bottom had been cut off or bent did not make sense.\n\nThe very purpose of using the OM leaflets was to show potential customers the prices of OM\n\nfurniture and to lead them to believe that De Angeli’s was of the same quality and/or\n\nfrom the same manufacturer or supplier, but yet cheaper. If the OM mark or name was not\n\nvisible, then this would defeat the purpose of using the OM leaflets in the first place.123.        \n\nEven based on her version that these leaflets were used for comparison only, the\n\ncomparison would be meaningless if the potential customers did not know whose products\n\nwere being compared with De Angeli’s.",
        "THE LAW": "Whether exclusivity is required\n\nfor a valid cause of action for passing off124.        Ms\n\nFoo submitted that in order to succeed in passing off, Momentum Creations must first\n\nestablish valuable goodwill in the names OM, ‘Case’, ‘Globe’,\n\n‘Catena’ and ‘Graves’ or that these names are so well known among the\n\npublic such that Momentum Creations has exclusive right to them.125.        \n\nShe also submitted that Momentum Creations must establish an exclusive right to the\n\nparticular design of the four items of furniture such that they can claim a monopoly of\n\nthese designs.126.        As\n\nregards Ms Foo’s point that Momentum Creations must establish an exclusive right to\n\nthe particular design of the four items, the short point is that they do not claim such a\n\nright. They accept that they do not have a proprietory right to the designs and\n\nconsequently others may copy the designs. Their claim is that De Angeli has gone beyond\n\njust copying the designs127.        As\n\nregards the requirement of exclusivity, Ms Foo relied on cases likeJarman & Platt\n\nLtd v I. Barget Ltd & Others[1977] Fleet Street Patent Law Reports 260.128.        In\n\nthat case, Megaw LJ said at p 269:‘Passing offThe first issue in the appeal is to passing off. ….Every passing-off case at common law involves two propositions, each of which must be\n\n    established by a plaintiff before he can succeed. The first proposition is that the\n\n    plaintiff has a legal right, in the nature of a monopoly: an exclusive right to a\n\n    particular name for his goods or a particular trade description or a particular\n\n    \"get-up\". In the present case the property – the reputation – claimed\n\n    by the plaintiffs was in respect of the \"get-up\" of their Louis furniture,\n\n    consisting of its appearance in shape, colour and fittings. The second proposition is that\n\n    the defendant has infringed that right, by selling goods under a name or trade description\n\n    or with a \"get-up\" which is likely to lead to confusion: which is likely to lead\n\n    buyers to buy the defendant’s goods in the belief that they are the plaintiff’s\n\n    goods.It is clear from many authorities, and it has not been challenged on behalf of the\n\n    plaintiffs in this appeal, that the question of confusion – the second proposition\n\n    – does not arise unless and until the plaintiffs have established the reputation of\n\n    the goods – the first proposition. That is something which is sometimes forgotten,\n\n    and which the defendants submit may have been forgotten, or not correctly appreciated, by\n\n    the learned judge in the represent case. That danger was emphasised by Lord Evershed M.R.\n\n    inTavener Rutledge Ltd. V. Specters Ltd.[1959] R.P.C. 355 at 362, where he said:\"I shall, I hope, be\n\n      forgiven if I say that sometimes I cannot help thinking that the additional requirement is\n\n      forgotten, and that it is regarded now as a matter of common form that if you have a case\n\n      like this you sue for copyright, trade mark, and passing off, and regard the whole thing\n\n      really as all turning on one and the same set of facts. That is not so. It was laid down\n\n      many years ago that the first necessity for a plaintiff trying to make out a case of\n\n      passing off is that he must establish that the particular get-up which he has been using\n\n      has become associated exclusively with this business: what, in brief, is called\n\n      reputation.\"’129.        \n\nHowever, exclusivity is no longer the requirement in law.130.        \n\nHence, inErven Warnink v Besloten Vennootschap & another v J. Townend & Sons\n\n(Hull) Ltd & another[1979] AC 731 (‘Warnink’), Lord Fraser said\n\nat 752 and 753:‘Before the champagne case,\n\n    successful passing off actions in England had usually, though not invariably, been at the\n\n    instance of a party who had the exclusive right to the goodwill attached to some\n\n    particular name, mark or get-up, and who complained that the defendant was invading his\n\n    right by using the name, mark or get-up to misrepresent his goods as those of the\n\n    plaintiff. The exceptions were fully considered by Danckwerts J. in the champagne case.\n\n    They were rather special cases in which by succession from a common author, or in\n\n    consequence of some particular history of events, the right to use a name or description\n\n    for their products was shared by two or more parties to the exclusion of the rest of the\n\n    world. The champagne case was the first case in England that clearly accepted the\n\n    principle that parties who did not have an exclusive right to use a particular trade name,\n\n    but who were only some members of a class consisting of all those who had a right to use\n\n    the name, were entitled to protect the name by a passing off action.’131.        \n\nThe reference to the champagne case was toJ. Bollinger v Costa Brava Wine Co. Ltd[1960] Ch 262.132.        \n\nAlso, inWarnink, Lord Diplock mentioned at p 742 five characteristics which must\n\nbe present for a valid cause of action for passing off.133.        \n\nLord Fraser also mentioned five characteristics at p 755 and 756 for a valid passing off\n\naction.134.        It\n\nis not necessary for me to set out the five characteristics as enunciated by each of these\n\ntwo Law Lords. Suffice it for me to say that exclusivity is not one of the\n\ncharacteristics.",
        "The requirements for a passing\n\noff cause of action": "135.        InTessensohn v John Robert Powers School Inc[1994] 3 SLR 308, LP Thean JA said at p\n\n315:‘More recently, Lord Oliver\n\n    stated inReckitt & Colman Products v Borden Inc, at p 880:The law of passing-off can be\n\n      summarized in one short proposition: no man may pass off his goods as those of another.\n\n      More specifically, it may be expressed in terms of the elements which the plaintiff in\n\n      such an action has to prove in order to succeed. These are three in number. First, he must\n\n      establish a goodwill or reputation attached to the goods or services which he supplies in\n\n      the mind of the purchasing public by association with the identifying ‘get-up’\n\n      (whether it consists simply of a brand name or a trade description, or the individual\n\n      features of labelling or packaging) under which his particular goods or services are\n\n      offered to the public, such that the get-up is recognized by the public as distinctive\n\n      specifically of the plaintiff’s goods or services. Second, he must demonstrate a\n\n      misrepresentation by the defendant to the public (whether or not intentional) leading or\n\n      likely to lead the public to believe that goods or services offered by him are the goods\n\n      or services of the plaintiff …. Third, he must demonstrate that he suffers, or in a\n\n      quia timet action that he is likely to suffer, damage by reason of the erroneous belief\n\n      engendered by the defendant’s misrepresentation that the source of the\n\n      defendant’s goods or services is the same as the source of those offered by the\n\n      plaintiff.These cases establish that there\n\n    are three essential elements to the tort of passing-off: (i) goodwill attached to the\n\n    plaintiff’s goods or services, (ii) a misrepresentation that the plaintiff’s\n\n    goods or services are the defendant’s, and (iii) damage to the plaintiff’s\n\n    goodwill as a result of the misrepresentation.’136.        In\n\nthe same case, Lord Jauncey also mentioned three requirements at p.890:‘In a case such as the\n\n    present where what is in issue is whether the goods of A are likely to be passed off as\n\n    those of B, a plaintiff, to succeed, must establish (1) that his goods have acquired a\n\n    particular reputation among the public, (2) that persons wishing to buy his goods are\n\n    likely to be misled into buying the goods of the defendant and (3) that he is likely to\n\n    suffer damage thereby.’",
        "Reputation or Goodwill": "137.        \n\nThe most generally accepted definition of goodwill is the one formulated by Lord\n\nMacnaghten inIRC v Muller & Co’s Margarine Ltd[1901] AC 217. It was not\n\ntoo long ago cited by Justice Prakash inFuture Enterprises Pte Ltd v Tong Seng Produce\n\nPte Ltd[1998] 1 SLR 1012(‘Future Enterprises’):‘What is goodwill? It is a\n\n    thing very easy to describe, very difficult to define. It is the benefit and advantage of\n\n    the good name, reputation and connection of a business. It is the attractive force which\n\n    brings in custom. It is the one thing which distinguishes an old established business from\n\n    a new business at its first start. The goodwill of a business must emanate from a\n\n    particular centre or source. However widely extended or diffused its influence may be,\n\n    goodwill is worth nothing unless it has power or attraction sufficient to bring customers\n\n    home to the source from which it emanates.Goodwill regarded as property has no meaning except in connection with some trade,\n\n    business, or calling. In that connection I understand the word to include whatever adds\n\n    value to a business by reason of situation, name and reputation, connection, introduction\n\n    to old customers, and agreed absence from competition, or any of these things, and there\n\n    may be others which do not occur to me. In this wide sense, goodwill is inseparable from\n\n    the business to which it adds value, and, in my opinion, exists where the business is\n\n    carried on. Such business may be carried on in one place or country or in several, and if\n\n    in several there may be several business, each having a goodwill of its own (at pp 223\n\n    – 224).138.        \n\nJustice Prakash went on to observe:‘Several important elements\n\n    of goodwill can be derived from the above passage. The first is that in order to have\n\n    goodwill there must be a business, trade or calling. This case involves the sale of goods\n\n    ie a trade and the observations I make are limited to that context. Second, goodwill is\n\n    the power of attraction which draws the customers to buy the goods. The third element is\n\n    that goodwill is territorial because it only exists where the trade exists.’139.        Ms\n\nFoo submitted that Momentum Creations did not produce a survey to establish the goodwill\n\nof OM and the names of the four items in question. Neither did they adduce evidence from\n\nthe trade that the OM brand is known as signifying their goods exclusively.140.        Ms\n\nFoo relied on the following part of the judgment inFuture Enterprisesat para 41\n\nthereof:‘Practically the only\n\n    evidence that MacCoffee was available in the local market prior to October 1995 was the\n\n    admission made by Mr. Eng that at the time he gave his artist instructions to prepare the\n\n    packaging for A MaxCoffee he was aware of the plaintiff’s product. That in itself,\n\n    however, is insufficient to show that MacCoffee as such had acquired a certain goodwill or\n\n    reputation in Singapore. Sporadic sales without any evidence of a certain level of local\n\n    consumer/vendor awareness of the brand and its availability cannot in themselves\n\n    constitute the acquisition of a reputation in Singapore.’141.        I\n\nwas of the view that this passage did not help De Angeli. It did not say that survey\n\nevidence or trade evidence was necessary to establish goodwill. Secondly, that passage\n\nmust be read in the context that, in that case, there was no evidence of any advertisement\n\nof the product for the Singapore market.142.        I\n\nwas of the view that it was not necessary for a survey to be adduced or evidence from the\n\ntrade to be adduced to establish goodwill. This was a matter of evidence and such evidence\n\ncould be adduced in various ways.143.        I\n\nwas also of the view that trading, however short, may be sufficient to establish goodwill\n\n(see the judgment of Justice Selvam inAlteco Chemical Pte Ltd v Chong Yean Wah[2000] 1 SLR 119at p 131).144.        \n\nFurthermore, actual trading is not necessary to establish goodwill (seeElectro Cad\n\nAustralia Pty Ltd & ors v Mejati RCS Sdn Bhd & Ors[1998] 3 MLJ 422).145.        In\n\nthe case before me, Momentum Creations had carried on business using the OM name from July\n\n1999, if not earlier, and then started advertising the names of the four items of\n\nfurniture. The advertisements of the OM name and of the four items were not insignificant.146.        On\n\nthe other hand, Ms Foo submitted that Mr Tan also had his own advertisements. However the\n\nevidence of the advertisements was in the form of numerous invoices from 1993 up to 14\n\nJune 1996. The invoices were addressed to St Louis Furniture. There was no evidence that\n\nthe advertisements were advertising any particular brand or that any names had been\n\nattributed to individual items of furniture.147.        \n\nAccording to Mdm Tang, Mr Tan did not place any other advertisement on his own because\n\nafter 14 June 1996, he had relied on advertisements of the landlords of the premises which\n\nhe was occupying. Likewise, for exhibitions, the organisers of such exhibitions would do\n\nthe advertising. However, again, there was no evidence that the advertisements of the\n\nlandlords or organisers were advertising any brand for Mr Tan’s furniture or any\n\nparticular names for individual items of furniture sold by him.148.        At\n\nmost, Mr Tan could claim only that he had acquired goodwill in the name St Louis Furniture\n\nwhich was irrelevant to the case before me.149.        In\n\nany event, the use of the OM leaflets by the sales representatives of De Angeli speaks for\n\nitself. On this point, I find the case ofBristol Conservatories,which Mr Chacko\n\nwas relying on, helpful.150.        In\n\nthat case, the defendants’ salesmen showed prospective customers a portfolio of\n\nphotographs of the plaintiffs’ conservatories as if they were photographs of the\n\ndefendants’ design and workmanship. Nothing in the portfolio referred to the\n\nplaintiffs.151.        \n\nRalph Gibson LJ said at p 465:‘… the goodwill was\n\n    asserted and demonstrated as the photographs were shown and was at the same moment\n\n    misappropriated by Custom built.’152.        In\n\nmy view, the fact that Mdm Tang had included the leaflets in the folders to be shown to\n\npotential customers and the fact that De Angeli’s sales representatives had used the\n\nleaflets demonstrated the goodwill in the OM name, as well as the names of the four items\n\nof furniture.153.        \n\nThe claim of Momentum Creations was stronger than that of the plaintiffs inBristol\n\nConservatoriesas here the leaflets contained the OM name and addresses.154.        In\n\naddition, Mr Lam did produce evidence of sales, Exhibit P14, by Momentum Creations of the\n\ntwo sofas in question from May to September 2000 but not for the period before or after.\n\nTaking August 2000 as the cut-off month, the sales of these two sofas for the four month\n\nperiod from May to August 2000 was $246,419 ($195,494 for 73 ‘Case’ L-shape\n\nsofas at $2,678 each and $50,925 for 15 ‘Globe’ L-shape sofas at $3,395 each).155.        I\n\nwas of the view that Momentum Creations had established goodwill in the OM name, as well\n\nas the names of the four items, even though the value of the goodwill may not be as much\n\nas they would like me to believe. That is why Mr Lam adduced evidence of sales by Momentum\n\nCreations of the two sofas for five months only i.e from May to September 2000. I inferred\n\nthat the sales for previous and subsequent months were not as good.156.        \n\nHowever, the existence of goodwill should not be confused with the value of the goodwill.157.        I\n\nwas also of the view that the goodwill in OM belonged to Momentum Creations exclusively\n\nand the goodwill in the names for the four items also belonged to Momentum Creations\n\nexclusively, but only in relation to these four items.158.        As\n\nfor Ms Foo’s argument that the Statement of Claim had alleged goodwill in the mark OM\n\nonly but not in ‘Case’, ‘Globe’, ‘Catena’ and\n\n‘Graves’, I was of the view that this was not fatal to the Plaintiffs’\n\nclaim. The four names did not exist separately from the OM mark as they were marketed\n\nunder the OM mark.",
        "Misrepresentation/Misleading": "159.        I\n\nwas also satisfied that the use of the leaflets was intended to and did misrepresent to\n\nthe public that the four items of furniture sold by De Angeli were of the same quality as\n\nthose of OM and/or that the manufacturers or suppliers of these items sold by De Angeli\n\nand OM were the same.160.        \n\nSecondly, the misrepresentation was not confined to just the showing of the leaflets but\n\nby active representations from sales representatives such as Rosalind (on 23 September\n\n2000) and Kym (on 27 September 2000).161.        \n\nAlthough Rosalind tried to be more careful in that she had said that De Angeli’s\n\nmanufacturers were not the same as OM’s, the thrust of her representation was that\n\nthe quality was the same when it was not.162.        \n\nKym’s misrepresentation, as set out in the transcript I have cited in para 66 above,\n\nwas more obvious.163.        \n\nThirdly, it will also be recalled that on 1 October 2000, Rosalind issued an invoice using\n\nthe name ‘Case’ to describe the sofa sold.164.        I\n\nwould add that there were other De Angeli invoices issued to customers, in Exhibit D14,\n\nwhich used the names ‘Case’ and ‘Globe’.165.        \n\nThe names ‘Case’, ‘Globe’, ‘Catena’ and ‘Graves’\n\nused for the four items sold by De Angeli had been taken from the names used by Momentum\n\nCreations. Indeed, none of the witnesses for De Angeli pretended that it was otherwise. To\n\nme, this was to further the misrepresentation.166.        I\n\nwas aware that I should not find Mr Tan liable if all he was guilty of was puff which is\n\nnot uncommon in such a trade. However, in my view, he had gone beyond mere puff.167.        \n\nThe evidence against Mr Tan was overwhelming. I summarise the evidence thus:(a) The evidence of Raymond\n\n    Cheong(b) The evidence of Teo Hui Ging(c) The investigations conducted\n\n    and the video recordings(d) The copying of the OM designs(e) The use of the OM leaflets(f) The use of the same names, as\n\n    for the four OM products, by sales representatives of Mr Tan and the use of some of these\n\n    names in sales invoices.The untruths from the evidence for Mr Tan also condemned him.168.        I\n\nwould also refer to some of the evidence of the sales representatives of Mr Tan which\n\nspeaks for itself.169.        At\n\nNE 234 line 14 to 17, Rosalind (Ang Kim Hua) said:‘Q Refer to your AEIC, para\n\n    6, \"Usually I do not cite names of other furniture shops …\". Do you usually\n\n    cite the names Case and Globe of the sofas you try to sell?A Yes.’170.        At\n\nNE 237 line 9 to 14, her evidence was:‘Q You said your primary\n\n    purpose for using Plaintiffs’ brochures was to point to customers that Plaintiffs\n\n    were selling similar furniture at higher price. If that is the main reason, why can’t\n\n    you simply tell the customer that Plaintiffs sell similar furniture at higher prices\n\n    instead of showing the brochures?A By using the brochures, it is\n\n    more convincing. Sometimes they are also used to show colour combination and the display\n\n    position.’171.        At\n\nNE 252 line 24 to NE 253 line 4, Kym (Lin Yee Kum) said:‘Q Refer:\"Op 1: Quality the same with\n\n    OM’s\".Why didn’t you respond to\n\n    say that I don’t know?A I was hoping the customer would\n\n    buy from me. I thought all sofas were the same.’172.        \n\nThe situation was not one of isolated instances of misrepresentation by foolish salesgirls\n\nwho did not know better, as Ms Foo would have me believe.173.        Ms\n\nFoo also pointed out that other retailers were selling furniture similar to the four\n\nitems. However, there was no evidence before me that these retailers took the steps that\n\nDe Angeli’s representatives did.174.        In\n\nthe instance of L-shape sofas, some of the retailers even used different names like\n\n‘Dandy’ or ‘Monoca’.175.        \n\nThe many cases that Ms Foo cited did not help De Angeli as each case must be considered on\n\nits particular facts.176.        \n\nHowever, I should mention two of the cases which she relied on.177.        \n\nThe first isWertheimer v Stewart, Cooper & Co[1906] Reports of Patent, Design\n\nand Trade Mark Cases Vol XXIII No 22, 481. At p 482, Kekewich J said:‘This case is a peculiar\n\n    one. The Plaintiff has invented or adopted a peculiar mode of advertisement for his goods\n\n    – an advertisement which goes beyond the ordinary objects of advertisements, because\n\n    it offers a premium to those who sell his goods, in the form of a prize, provided they\n\n    sell a certain quantity of seeds at a certain price. The Defendant is struck by the\n\n    ingenuity of this form of advertisement, and he adopts the same method, as he is entitled\n\n    to. But he goes further than that. He thinks the Plaintiff’s language so good that he\n\n    actually adopts that language. Now it cannot be too often said that the Court does not sit\n\n    to consider whether, according to any high standard of honour, things ought to be allowed\n\n    or not. The Court only sits to consider in these cases whether there has been any\n\n    deviation, from the strict path of honesty, which is reached by law – whether there\n\n    has been in any way any tampering with business or property, taking \"business\"\n\n    as a description of \"property\". Probably those who listened to this case will\n\n    not give the Defendant credit for very good taste in not only following the\n\n    Plaintiff’s method of advertisement, but in actually copying his language, and, still\n\n    further, not only copying his language, but adopting the embellishments of his language,\n\n    which are striking and have been copied to the very last particular. But unless that\n\n    injures the Plaintiff in his property it seems to me to be wholly immaterial in a Court of\n\n    law. Now, how does it injures his property. What is his property? He has no property in\n\n    the advertisement. Of course he does not claim it as copyright. He has property in his\n\n    goods; in any character by which is goods are known; in any distinguishing device or name;\n\n    and he has the right also to protect his own name. None of these things, as it seems to\n\n    me, does the Defendant at all offend against, so that the Court can, in any way, reach\n\n    him.’178.        \n\nHowever the facts in that case, which involved an application for an injunction which was\n\nrefused, were quite different from those before me. They are summarised in the headnote:‘The Plaintiff had devised a\n\n    novel but unregistered scheme of advertising the sale of his packets of garden seeds by\n\n    inserting in numerous newspapers a \"stereotyped\" combination of lengthy\n\n    letterpress surrounded by pictures of objects, any one of which he offered as a premium to\n\n    purchasers. The Defendant issued advertisements in precisely similar form, including the\n\n    pictures and the arrangement, excepting that he substituted anewname for the\n\n    seeds and a slightly different condition for earning the premium, and puthis trading\n\n    nameat the foot of the advertisements.’[Emphasis added.]179.        \n\nNext, Ms Foo relied onG. Hensher Ltd v Restawhile Ltd[1973] 1 WLR 144 where\n\nGraham J said at p 150/H:‘Now in the present case,\n\n    reviewing the evidence which was called, I do not think that the plaintiffs have\n\n    established sufficiently strongly that the shape of their articles is so well known\n\n    amongst members of the public in contrast to members of the trade as to justify me in\n\n    holding that there is likely to be confusion amongst a substantial number of such members\n\n    of the public. Chairs and settees are not normally bought by members of the public for the\n\n    reason that they are the goods of a particular manufacturer; they are bought because the\n\n    buyers like the shape, the comfort or the look, having regard also to the particular price\n\n    of the suite in question, and the choice is quite regardless of who made them.’180.        I\n\ndid not think this passage was applicable as Momentum Creations were not relying on the\n\nsimilarity of shape alone to establish passing off.181.        In\n\naddition, while I agreed that furniture is bought because the buyers like the shape, the\n\ncomfort or the look, having regard also to the price, I did not think that the name or\n\nbrand was irrelevant to such buyers.182.        At\n\nthe end of the day, Ms Foo’s submission was also telling. In p 16 of her Reply to\n\nPlaintiffs’ Written Submissions, she said,‘… The OM name and\n\n    Plaintiff’s address were not shown [on the leaflets in question] as to show them\n\n    would mean the Defendant was passing off the Defendant’s products as the\n\n    Plaintiff’s.’183.        As\n\nI have said, the OM mark and the OM name and addresses were shown on the leaflets in\n\nquestion.",
        "Damage": "184.        In\n\nmy view, there was damage to the goodwill of Momentum Creations.",
        "Summary": "185.        \n\nAccordingly, I found that the allegation of passing off had been made out and I granted\n\njudgment in the following terms:‘1. An injunction is hereby\n\n    granted to restrain the Defendant whether by himself, his agents or servants and whether\n\n    under the name of De Angeli or otherwise from:(a) Using for the sale of\n\n    furniture:(i) any of the Plaintiffs’\n\n      leaflets marked as Exhibits P8, P9 and P28 in this action,(ii) the name \"Case\" or\n\n      \"Globe\" for any L-shape sofa,(iii) the name \"Catena\"\n\n      for any sideboard,(iv) the name \"Graves\"\n\n      for any coffee table,(b) Making any representation\n\n    that the L-shape sofas, coffee tables or sideboards sold for or on behalf of the Defendant\n\n    and which are similar in design to the Plaintiffs’ \"Case\",\n\n    \"Globe\", \"Catena\" or \"Graves\" furniture are from the same\n\n    manufacturer or supplier as the Plaintiffs’ manufacturer or supplier for\n\n    \"Case\", \"Globe\", \"Catena\" or \"Graves\" furniture or\n\n    that the Defendant is in any way connected with the Plaintiffs.2. The Defendant is to account to\n\n    the Plaintiffs for profits made by the Defendant in the sale of L-shape sofas, coffee\n\n    tables and sideboards similar to the \"Case\" or \"Globe\" sofas,\n\n    \"Graves\" coffee tables or the \"Catena\" sideboards sold by the\n\n    Plaintiffs which sale is due to the use of:(a) any of the Plaintiffs’\n\n    said leaflets and/or,(b) any of the names\n\n    \"Case\" or \"Globe\" for the L-shape sofas, \"Graves\" for the\n\n    coffee tables and \"Catena\" for the sideboards and/or,(c) any representation made by\n\n    the Defendant, his agents or servants that the L-shape sofas, coffee tables or sideboards\n\n    sold for or on behalf of the Defendant and which are similar in design to the\n\n    Plaintiffs’ \"Case\", \"Globe\", \"Catena\" or\n\n    \"Graves\" furniture is from the same manufacturer or supplier as the\n\n    Plaintiffs’ or that the Defendant is in any way connected with the Plaintiffs.3. All necessary directions and\n\n    inquiry be made by a registrar of the High Court for the purpose of paragraph 2 above.4. For the purpose of paragraphs\n\n    2 and 3 above,(a) any sale by De Angeli, St\n\n    Louis Furniture or Nicoletti Furnishing shall be deemed to be a sale by the Defendant.\n\n    However, this shall not necessarily mean that every sale by the Defendant comes within\n\n    2(a), (b) or (c).(b) If any sale is made whereby\n\n    an invoice has been issued under the name of De Angeli, St Louis Furniture or Nicoletti\n\n    Furnishing and the name \"Case\", \"Globe\", \"Catena\" or\n\n    \"Graves\" is used to describe the item sold, such a sale shall be deemed to come\n\n    within paragraph 2(b) above.(c) The period of accounting\n\n    shall start from the earliest of any of the instances mentioned in paragraph 2(a), (b) and\n\n    (c), up to 7 November 2000. The starting date for the period of accounting shall, in any\n\n    event, not be later than 20 August 2000.(d) If the Defendant is unable to\n\n    produce any invoice or any sales document for any period or date, the registrar is to draw\n\n    such inferences as the registrar thinks appropriate.(e) What is required of the\n\n    inquiry is reasonable approximation and not mathematical exactness so that neither party\n\n    will have what justly belongs to the other.5. 95% of the costs of this\n\n    action is to be paid by the Defendant to the Plaintiffs.6. The registrar giving\n\n    directions and/or conducting the inquiry referred to in paragraph 3 above is to determine\n\n    the costs of the directions and inquiry.7. The interlocutory injunction\n\n    order dated 7 November 2000 is discharged.’186.        \n\nThe terms of the judgment took into account the fact that not every sale of the four items\n\nwas necessarily the result of passing off.187.        I\n\nincluded sales under St Louis Furniture in the terms because Mr Tan had used that name\n\ninterchangeably with De Angeli.188.        I\n\nalso included sales under Nicoletti Furnishing in the terms because the evidence showed\n\nthat after the first interim injunction order on 29 September 2000, Mdm Tang sold the four\n\nitems under Nicoletti Furnishing between 7 to 15 October 2000 at an exhibition. Although\n\nthis entity was set up by her, her own evidence was that she was selling the same items in\n\nquestion under this name because she thought they could not be sold under the De Angeli\n\nname in view of the first interim injunction order.189.        As\n\nfor costs, Momentum Creations was granted 95% costs because they had also relied on the\n\ncause of action known as malicious falsehood, but withdrew this claim only at submission\n\nstage.190.        \n\nThe second interlocutory injunction order dated 7 November 2000 was discharged as it was\n\nreplaced by the injunction under my judgment.Sgd:WOO BIH LIJUDICIAL COMMISSIONERSINGAPORECopyright © Government of Singapore."
    }
}