{
    "case_title": "Ganda Lumban Gaol v Mindo Lumban Gaol and Another",
    "ncitation": "[2001] SGHC 288",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "2.    The plaintiff and the defendants are members of the Batak ethnic group\n\nof Tapanuli in Indonesia and are Christians. Their father Mangara Tua Lumban Gaol died on 8\n\nSeptember 1986 while their mother Dumatiar Sitompul (Sitompul) died on 19 July 1999. The plaintiff\n\nis the youngest of the 3 siblings; all the siblings are married, with the plaintiffs sister\n\nmarrying outside the Batak clan.3.    The plaintiffs parents set up a pharmaceutical business PT Gandha\n\n(the business) in Jakarta in 1954. The business grew over the years and expanded to include several\n\noutlets as well as a factory which manufactures medicines for sale. Another company PT Indonesian\n\nDrug House (the company) was set up in Jakarta in 1955 to distribute the medicines manufactured by\n\nthe business. After the death of the plaintiffs father, Sitompul headed the business and became\n\nthe matriarch of the family. She obtained a declaration from the Indonesian courts on 5 November\n\n1986 (see AB14-19) that she and her three (3) children were the heirs of his estate. I will return\n\nto this document and its significance later.4.    The plaintiff was appointed a Komisaris of the company in 1987 and of the\n\nbusiness in 1995, a position akin to that of a controller; Sitompul was the companys President\n\nDirector (Direktor Utama). The plaintiffs sister Indiana, a trained pharmacist, is in charge of\n\nthe production of medicines in the business. The first defendant is also a Komisaris but, according\n\nto the plaintiff, he does not do any work for the business nor does he go to the office. The\n\nplaintiffs function of Komisaris is that of general manager; she runs the business and the\n\ncompany including managing the staff, supervising the financial and accounting aspects, negotiating\n\nbusiness contracts and taking care of administrative work. When Sitompul was about 70 years of age,\n\nshe stopped going to the factory and the shop outlets although she continued to make important\n\ndecisions for the business/company and to give directions. She left the day to day operations to the\n\nplaintiff.5.    Upon her death, Sitompul left a large estate which consisted of various\n\nlanded properties in Indonesia, shares in Indonesian companies, cash in bank accounts maintained\n\nwith banks in Indonesia and Singapore and of course the business and the company. It was the\n\nplaintiffs contention that Sitompul died intestate whereas the first defendant contended she left\n\na will.6.    The subject of these proceedings are three (3) Asian Currency unit accounts\n\nwhich Sitompul had opened with banks in Singapore; these are:-a joint account in her and the first defendants name with Bank of America no. 30292-01 (the\n\n    first BOA account) containing about US$400,000;a joint account in her and the plaintiffs name with Bank of America no. 30293-01 (the\n\n    second BOA account) which contained about US$200,000;a joint account in her name and the names of the plaintiff and the second defendant with\n\n    Citibank (the Citibank account) which account contained about US$1m at the material time and now\n\n    has a balance of about US$300,000.7.    According to the plaintiff, the Citibank account was opened on 30 December\n\n1997 initially in the names of Sitompul and herself only. The mandate required for withdrawal was\n\neither partys signature. Although Sitompul had informed the plaintiff that upon her death, the\n\nplaintiff could withdraw the money in the Citibank account, the latter considered the money to be\n\nthe mothers as Sitompul had put in all the monies; hence the plaintiff regarded the monies in the\n\nCitibank account as belonging to the estate of Sitompul.8.    The second defendant was added as a signatory to the Citibank account only\n\nin May 1999 when the plaintiff visited Singapore with Sitompul, Indiana and her daughter and, the\n\nsecond defendant with her brother. The purpose of the visit was for Sitompul to have a health\n\ncheck-up and, because of the political upheaval in connection with the then elections in Indonesia,\n\nthe family decided to stay in Singapore for a month until the violence in Indonesia subsided. The\n\nplaintiff was not told why Sitompul wanted to add the second defendants name to the Citibank\n\naccount. Neither did Sitompul inform the plaintiff how the monies in the accounts should be\n\ndistributed after her death.9.    In August 1999, after Sitompuls demise, the first\n\ndefendant requested the plaintiff to add his name to the Citibank account. This was after the\n\nfuneral rites according to Batak customs, had been performed for Sitompul. The first defendant\n\nclaimed that if his name was not added to the Citibank account, the bank would freeze the account\n\nonce it found out about Sitompuls death. The plaintiff then telephoned the bank but was told that\n\nthe Citibank account would not be frozen because there were surviving joint account holders namely\n\nthe plaintiff and the second defendant. The plaintiff accordingly informed the first defendant.10. Later that same evening, the plaintiff received a call from an officer of\n\nCitibank informing her that the second defendant had applied to the bank to withdraw US$600,000 from\n\nthe Citibank account. The plaintiff requested the officer to stop the withdrawal but was advised it\n\nwas not possible because the second defendant was an authorised signatory but, the officer agreed to\n\nhold back the withdrawal for two (2) days to give the plaintiff time to discuss the matter with the\n\nfirst defendant. At Citibanks request, the plaintiff sent a letter to the bank to confirm her\n\ninstructions.11. The plaintiff visited the first defendant (with a trusted family staff James\n\nPanggabean); when she asked, the first defendant gave the excuse that he requested his daughter to\n\nwithdraw monies from the Citibank account because he wanted to distribute the same to the 3 siblings\n\nas beneficiaries of Sitompuls estate; pending such distribution, he wanted to deposit the monies\n\nwith the Standard Chartered Bank (SCB) as it paid a higher interest than Citibank and with a Jakarta\n\nbank. To allay her fears, the first defendant promised the plaintiff that he would add her name to\n\nthe SCB and Jakarta bank, accounts. With the persuasion of James Panggabean, the plaintiff signed\n\ndocuments to allow the monies in the Citibank account to be transferred out. The first defendant\n\nalso procured her signature to a form to add him as a signatory to the Citibank account.12. However, the first defendant did not add the plaintiff as a signatory to the\n\nSCB or Jakarta bank, accounts - whenever she inquired, the first defendant would ask her to wait.\n\nBetween February and March 2000, the plaintiff met the first defendant several times. She questioned\n\nhim repeatedly on the distribution of Sitompuls monies. It was only then that he told her that he\n\nwould not be distributing the monies claiming that, by a Power of Attorney dated 21 August 1997 (the\n\nPA) from Sitompul, he was the sole beneficiary to her estate. However, Indonesian lawyers consulted\n\nby the plaintiff advised her that the PA had no effect upon Sitompuls demise. The plaintiff was\n\nnot aware of the existence of the PA during her mothers lifetime, Sitompul never told her there\n\nwas such a PA. The plaintiff opined that as Sitompul opened the three (3) bank accounts in Singapore\n\nafter the PA was prepared, it showed that her mother intended that the surviving account holders\n\nshould manage the respective accounts after her death, albeit for the benefit of the estate. Even if\n\nthe PA was valid, the plaintiff argued that it would not apply to Sitompuls joint bank accounts\n\nbut only to those accounts which were in her sole name. When she was shown the PA, the plaintiff\n\nvisited the office of the notary public (Soekaimi) who had witnessed the signing by Sitompul; she\n\ncould not verify the document as she was told he had passed away.13. In May 2000, the plaintiff visited Singapore intending to withdraw the monies\n\nin the second BOA account, with a view to distribution after returning to Jakarta and discussing\n\nwith the first defendant. She was told by an officer of BOA that, Indiana had objected to her\n\nwithdrawal and she was not allowed to do so. Subsequently, the plaintiff received a call from BOA\n\n(in June 2000) advising she could proceed to make the withdrawal. Accordingly, on 19 June 2000, the\n\nplaintiff flew to Singapore. However, when she visited BOA to make the withdrawal, the plaintiff was\n\ntold that the first defendant had objected to her making the withdrawal and had produced the PA to\n\nBOA.14. After leaving BOA, the plaintiff visited Citibank and instructed them to\n\nfreeze the Citibank account and not to allow any withdrawal therefrom without joint instructions\n\nfrom her and the first/second defendants. She confirmed her instructions with a letter handed to\n\nCitibank that day itself.15. In September 2000, BOAs solicitors advised her that the bank was taking\n\nout interpleader proceedings. The plaintiff was advised to and did, appoint Singapore solicitors to\n\nact for her in the interpleader summons OS 1400 of 2000 (BOAs interpleader). The three (3)\n\nclaimants named in BOA's interpleader were Indiana, the first defendant and the plaintiff\n\nrespectively. On 12 February 2001, I ordered that hearing of BOA's interpleader should only involve\n\nthe three (3) claimants. They were directed to state the nature and particulars of their claims to\n\nthe monies in the first and second BOA accounts and their claims were to be determined by the same\n\ntrial judge who hears this claim.16. The plaintiff subsequently discovered that the first defendant had\n\ntransferred monies from the Citibank account to SCB and Citibank Jakarta in the sums of\n\nUS$425,568.10 and US$256,168.85 respectively. Apparently, the Citibank Jakarta account was\n\noriginally in the names of the first and second defendants but later, the first defendant became the\n\nsole account holder.",
        "The claim": "17. In her Statement of Claim, the plaintiff averred that as the monies in the\n\nSCB and Jakarta Citibank accounts came from monies in the Citibank account, the same were held on\n\ntrust by the first and second defendants as to her share as one of the beneficiaries of the estate.\n\nShe alleged that the defendants had breached their fiduciary duties and that the first defendant had\n\nfailed to account to her for her share of the trust monies. Accordingly, the plaintiff prayed inter\n\nalia, for a declaration that the monies in the aforementioned two (2) accounts belong to the estate.\n\nShe also prayed for a declaration that the defendants hold the remaining monies in the Citibank\n\naccount on trust for her as one of the beneficiaries of the estate, to the extent of her share\n\nnamely one-third ( ).18. In the common Defence which they filed, the defendants contended that by the\n\nPA and under the applicable law, Sitompul had, upon her demise, given all and any of her monies in\n\nany bank accounts to the first defendant for his management and use as he deemed necessary - making\n\nhim the sole beneficiary of her bank accounts anywhere. The defendants admitted that the monies in\n\nthe Citibank account were contributed entirely by Sitompul and upon her death, the first defendant\n\nwas to be solely entitled to all the monies in the account; the surviving joint account holders were\n\nto operate the Citibank account according to his instructions and or surrender/utilise the monies in\n\naccordance with his instructions.19. The second defendant admitted that she had applied to withdraw monies from\n\nthe Citibank account on or about 11 August 1999 but, both defendants denied that the plaintiff is a\n\nbeneficiary to the estate or, that the first defendant had promised to distribute monies to the\n\nplaintiff or, that he had made any representations or given any assurances to her as the plaintiff\n\nalleged.20. In her Reply, the plaintiff contended that the PA in the Indonesian language\n\nwas not a Will of Sitompul and did not have the effect of making the first defendant the sole\n\nbeneficiary of any or all of her accounts in Singapore or elsewhere. The PA was merely a power of\n\nattorney and the power of management given thereunder to the first defendant lapsed upon the death\n\nof Sitompul and, did not extend to any or all of the joint bank accounts she maintained in Singapore\n\nand, which are governed by the laws of Singapore.21. Even if the applicable law is Indonesian law, the plaintiff averred that the\n\nfirst defendant is not the sole beneficiary of the estate under Indonesian law but only one of the\n\nbeneficiaries.",
        "The evidence": "22. Both parties called expert witnesses on Indonesian law, touching on the first\n\ndefendants claim that he was the sole beneficiary of Sitompuls estate. Both experts were also\n\nfrom the Batak clan. The plaintiffs expert was Thomas Edison Tampubolon (Tampubolon) who has been\n\nin legal practice since 1981 and is familiar with cases involving inheritance law as well as probate\n\nand administration. Tampubolons opinion was sought and he gave his views, on the following\n\nissues:-whether the surviving joint account holders rights to the funds remaining in the Singapore\n\n    bank accounts of Sitompul should be decided by the laws of Singapore or the laws of Indonesia;if the above issue is to be decided by Indonesian law, what would be the effect on the\n\n    surviving joint account holders right to deal with the funds remaining in the joint accounts;whether under the laws of Indonesia, the first defendant would be regarded as the sole heir to\n\n    the estate of Sitompul, to the exclusion of his two sisters, on the ground that he is the only\n\n    male in the family;whether the PA is valid and enforceable as a will and/or as a power of attorney;would the plaintiff be entitled to at least one third share ( ) in the estate of Sitompul\n\n    and consequently, to the funds in the Singapore bank accounts.23. Tampubolon answered the above issues as follows:-since the joint accounts were opened in Singapore, under Indonesians Private International\n\n    Law, the laws of Singapore would be the applicable law to decide on he question of the continued\n\n    operation of the joint accounts;even if Indonesian law applied, since the accounts were in the joint names of Sitompul and her\n\n    children or grandchildren, under the laws of Indonesia, upon her death, the surviving joint\n\n    account holders would be entitled to the balance monies in the joint accounts. If the monies\n\n    therein were contributed solely by Sitompul, then the surviving joint account holder, although\n\n    entitled to withdraw the balance, would later have to account to the beneficiaries of the estate\n\n    for such sums withdrawn when the estate is distributed;under the traditional laws of the Batak community, it is no longer the custom that the first\n\n    defendant as the only male child, would be the sole beneficiary of his mother's estate. Only in\n\n    the case of inherited wealth such as family heirlooms would the son of a Batak family be\n\n    entitled to inherit the same. The funds in the Singapore accounts did not fall within the scope\n\n    of inherited wealth;under the laws of Indonesia the PA is invalid and does not operate as a power of attorney or\n\n    as a will of Sitompul, andsince Sitompul died without leaving a will, her estate would then have to be divided amongst\n\n    her three (3) children. As such the plaintiff would be entitled to a one-third ( ) share.24. I should point out in a previous similar case which I heard (Originating\n\nSummons No. 811 of 1994), I had held that, the law applicable to joint bank accounts opened with\n\nbanks in Singapore by Indonesian nationals, is Singapore law. The Court of Appeal (in Civil Appeal\n\nNo. 28 of 1998) agreed with my views and dismissed the appeal filed by Credit Agricole Indosuez\n\n(formerly known as Banque Indosuez) against my decision.25.    Tampubolon set out the reasons for his opinion in considerable detail in\n\nhis affidavit, referring to Indonesian law and judicial pronouncements where appropriate/necessary\n\n(see exhibitT-4as well as the plaintiffs bundle of documents PB1-57). He further\n\nexplained the development of customary law and the development of inheritance law in the Batak\n\nethnic group having the patrilineal system. On issues of customary law, Tampubolon affirmed that it\n\nwas left to the parties concerned to seek settlement by submitting the issue to the traditional\n\nchief/leader. Even so, he said it was not an infrequent occurrence that the customary law applied\n\nkeeps up with the times notwithstanding that it is different from that applied by the judge if\n\nthe dispute is brought to the courts. Tampubolon pointed out in the application of the customary\n\nlaw, the traditional chief/leader stresses heavily on the efforts to reconcile the parties based on\n\nbrotherhood and peaceful principles, with the result that the settlement reached is not by law and\n\nnot based on legal certainty or principles. Such decisions or settlement are not binding and has no\n\nlegal force if either party does not comply.26.    If an amicable resolution or settlement by customary law is not reached,\n\nthe parties may request a judge to determine the dispute by submitting the same to the district\n\ncourt. The judge in arriving at his decision may determine what law is applicable to the dispute,\n\nhence determining the applicable law and at the same time ensuring that the decision is enforceable.\n\nThe customary law which is developed through judicial decisions/rulings particularly on inheritance\n\nbecomes jurisprudence. Jurisprudence has become the modernised customary law and has\n\ndeveloped to become the national law. He opined that the role of judges and jurisprudence as\n\nsources and makers of customary/unwritten law has increasingly become important. Since the 1961\n\nlandmark ruling (no. 179), it has been held that a female child has an equal right to inheritance;\n\nthis is not only applicable to Bataks but to all ethnic groups. The ruling was also applicable to\n\nwidows as before the ruling, they were not heirs of their late husbands. He said that logically, the\n\nsame ruling should apply when the mother dies  her children should be her heirs regardless of\n\ngender.27.    Tampubolon explained that Indonesians in general live in a\n\nkinship tiein which a family consists of the father, mother and their child or children, who\n\nare no longer bound to the alliance and circle of relations under the customary law, in the\n\ngeographical or sociological area where they came from. This particularly applied to families who\n\nhad left the circle of the community subject to the customary law and moved to live in major and\n\nmetropolitan cities where the effectiveness of the customary law is no longer felt in daily lives.28. The inherited wealth which comprises of lands, houses and other heirlooms\n\nleft behind in the native village would therefore be far removed from the reach of the kinship\n\ntie. The inherited wealth/hereditary property is subject to the rules of customary (adat/local)\n\nlaw whereas, the family property which is formed from a new way of life based on the kinship tie,\n\nhas a new social unit which is parental in nature.29.    Where marriage is concerned, the national law of Indonesia recognises that\n\nmen and women are equal in their rights and obligations having regard to the marital properties.\n\nJurisprudence as an important source of customary law in the matters of the Family Law and Customary\n\nInheritance law recognises the same status between men and women as marriage law does. Hence, if an\n\nissue of inheritance arises which is submitted to a court, for the sake of legal certainty,\n\nthe judge must decide the case based on jurisprudence disregarding the local customary law,\n\nessentially recognising equal rights between men and women.30. On the PA (see DB1-4), Tampubolon elaborated on why he considered the\n\ndocument invalid after Sitompuls demise. The document (as translated by the defendants) reads as\n\nfollows:The undersigned [Madam Sitompul] hereby states that:Upon my demise, I authorise my biological child [Mindo Lumban Gaol] to manage,\n\n  administer, transfer, receive and sign all my financial matters in the bank as well as utilise the\n\n  funds when necessary.Thus this Power of Attorney is truthfully made.Jakarta 2 August 1999(Signed)Soekaimi SHNotary public, JakartaNumber: 4511/L/1997I, the undersigned Soekaimi, Master of Laws, a notary public in Jakarta, hereby\n\n  state that I have read and explained the content of this declaration to:Madam Dumatair Sitompul, a private employee, residing at Jakarta Pusat, Jalan\n\n  HOS Cokroaminoto, number 58, Rukun Tetangga 006, Rukun Warga 004, Gondangdia Village, Sub-District\n\n  of Menteng, Resident identity card number 1602.3585/460719002.I, the notary public, hereby acknowledge and sign this declaration produced\n\n  before me.Tampubolon pointed out that in Indonesia, powers of attorney and Wills come under\n\nthe Indonesian Civil Code. Articles 1792, 1793 and 1781 apply to powers of attorney. The provisions\n\nas per his translations read as follows:Article 1792:Mandate (power of attorney) is a contract whereby one person, the mandator/principal,\n\n  gives to another, the mandatory/attorney in fact, a power to transact some business in his name.Article 1793:A power of attorney may be given and accepted by authentic deed or under\n\n  private signature, even by letter or orally.Article 1813:Power of attorney terminates due to the revocation by the principal of the\n\n  power of attorney, due to the notice by the principal of the discontinuance of the power of\n\n  attorney, or due to the death, put under legal control, or bankruptcy of the principal or the\n\n  attorney in fact, due to the marriage of the female principal or female attorney in fact.Consequently, when Sitompul passed away, the power of attorney to the first\n\ndefendant ceased to have any effect.31. Tampubolon tendered to court Articles 931, 932 and 944 of the Civil Code (seeP1) and said there are three (3) types of Wills therein stipulated:(i) made by and before a notary public and witnessed by two (2) persons;(ii) made by the deceased in his own handwriting with two (2) witnesses which\n\n  is then surrendered to a notary who retains it; and(iii) a secret deed made by the deceased with 4 witnesses, then sealed in an\n\n  envelope and later given to a notary.However, Batak customary law does not recognise these 3 types of Wills. The first\n\ndefendant on the other hand had referred to Articles 875 and 1792 of the Civil Code (see exhibitD5);\n\nthe translations read as follows:Article 875:A Will or Testament is a deed in which stipulates a statement of a person\n\n  concerning with what his/her wishes would be after he/she died, and it could be revoked by\n\n  him/her.Article 1792:A delegation of power is an agreement by which a person delegates a power to\n\n  other person who is authorised to execute on behalf of the donor for a certain matter.Based on the provisions of the Civil Code referred to earlier, Tampubolon was of\n\nthe view that the wording of the PA was consistent with it being a power of attorney and not a Will;\n\none looks at the contents of a document in order to determine its nature. The words in the PA'saya\n\nmemberi kuasa'means 'I authorise' whereas if it was a Will, the word used would be 'wasiat'\n\nmeaning testament. Further, the title itself'Surat Kuasa'means a power of attorney or a\n\nproxy. In any case, under Indonesian law, a notary has to authenticate a document to say whether it\n\nis or is not, a Will. In the PA, the notary Soekaimi merely signed as a witness. Further, if it was\n\nindeed a secret Will made by Sitompul, the notary should have opened the document and notified the\n\nheirs upon her death but it was not done. Had Sitompul made a Will of the other two (2) types, the\n\nnotary would or should have informed Sitompul he was authorised to make a Will and advise her on it.\n\nTampubolon pointed out that if the PA was indeed a Will, it should have been witnessed by two not\n\none person, executors should have been appointed and it would have elaborated on how Sitompul's\n\nassets were to be divided.32. A Will under Indonesian Civil Law has also to be contrasted with a 'tona'\n\nunder Batak customary law. By definition, according to the Inheritance Law of Batak Toba (exhibitD4),\n\na 'tona' under Batak custom is similar to a testament, in fact it is akin to an oral Will; it states\n\nwho shall own/is entitled to the testator's estate. To be valid a 'tona' must be made by an adult;a. who is mentally sound;b. who is able to speak clearly;c. made in the presence of close family members or 'Dalihan Natolu'.It would also be preferable if the testator made the 'tona' in the presence of\n\nhis heirs.33. Tampubolon was cross-examined at length, in the course of which he refuted\n\nthe testimony of the first defendant's expert witness (Sori Tua Hutagulung) that under Batak custom,\n\na female who marries outside the clan (as in the case of Indiana) would be considered an outcaste\n\nand would belong to her husband's clan. Neither does a married woman lose her surname or her\n\ninheritance from her parents by reason of marriage. In Sitompul's case, she remained a member of her\n\nown clan (known as 'marga') and was also a member of her husband's clan (Lumban Gaol).34. Counsel for the defendants had referred Tampubolon to extracts from research\n\nmaterial (exhibitD1) on customary Batak law arising from a project undertaken by the High\n\nCourt of Medan in 1975, on the instructions of the then Chief Justice. It is noted that the survey\n\nwas conducted on Bataks living in the Lake Toba area. The following extracts (seeD4) came\n\nfrom the research findings:Inheritance law of Lake Toba3. In Batak community, the paternal system is always used to determine the hereditary lines.4. The Batak Customary Law does not have an appropriate term for the inheritance law. Although,\n\n  in the Batak language has a term known as manean or reanteanan. But this term is only used or\n\n  applied if the person who inherits has no son.5.                                        \n\n  The heirsOnly sons are the heirsThe priority sequences order of the heirs are as follows:1.     own son2. If the son is dead, the heirs must be direct line from the hereditary of own\n\n  son;3. deviated to the brothers including his hereditary direct line;4. deviated to the family with the hereditary direct line from the same\n\n  grandfather6.                                        \n\n  DaughterA daughter is not the heirs or excluded as the heirsThe meaning of daughter shall include the own daughter, wife(s) and widow(s)7.                                        \n\n  Rights of daughterAs long as a daughter has not married yet, she has the same rights and must be\n\n  treated by the parents the same as her brothers8. If the person who inherits does not have son, but he has daughter only, the\n\n  said daughter could enjoy with the parent's inheritance before she gets married. The content of\n\n  the enjoyed right is limited up to the necessity and appropriate things for the living of the said\n\n  daughter.35. The first defendant relied on the above extract for his case, as well as on\n\nextracts from textbooksInheritance Law in Indonesia(seeD6) andPrinciples and\n\nStructure of Customary Law(D7) which gave the same view -- that a married female (of\n\nToba and Lampang) Batak clan would not be an heir of her parents' estate. Tampubolon however,\n\ndisagreed with the survey findings as well as with the authorities cited in support thereof.36. A factor which Tampubolon relied on for his differing view was the\n\ncertificate obtained by Sitompul on 5 November 1996 from the district court of Jakarta (para 3supra)\n\ndeclaring herself and her three (3) children as the heirs of Lumban Gaol. Following upon that, the\n\nchildren on 1 December 1996 (seeD1) relinquished to Sitompul their entire rights of\n\ninheritance. He opined that the two (2) certificates indicated Sitompul's wish from the outset, not\n\nto come under Batak customary law since the latter recognises neither instrument. It indicated that\n\nSitompul preferred to come under Civil Law as, she would have had no status or claim to her late\n\nhusband's estate, had Batak customary law applied. The first defendant also implicitly accepted that\n\nBatak customary law did not apply as, if it did, his two (2) sisters would have had no share to\n\nLumban Gaol's estate.37. As for the practice of 'pauseang' or making gifts in Batak custom, Tampubolon\n\nexplained this had existed for a long time (before World War II), where women who had no rights of\n\ninheritance, would ask from her parents for a rice field or such like for herself and her husband.\n\nHowever, since 1950-60s, the practice did not exist in Jakarta for the reason that the capital has\n\nno rice fields, although the practice could still continue in Sumatra. In place of 'pauseang' Batak\n\nparents nowadays would give their daughters a house.38. Questioned on the concept of 'jurisprudensi tetap' and 'jurisprudensi',\n\nTampubolon explained that the former referred to decided cases of the Supreme Court which lower\n\ncourt judges would follow. Where the decisions are only jurisprudensi, lower courts do not have to\n\nfollow the decisions but can come to a different conclusion. He felt that the precedent most\n\napplicable to this case was Ruling No. 179/K/Sip/1961 of the Indonesian Supreme Court, dated 23\n\nOctober 1961. The case concerned a dispute between members of the Karo tribe (the tribe). One Rolak\n\nSitepu (the deceased) had died leaving a piece of land but he had no sons. In accordance with the\n\ntribe's customary law, the nephews of the deceased (his brother's sons) claimed the land as his\n\nheirs. Their claim was contested by the daughters of the deceased. The piece of land had originally\n\nbeen inherited by the deceased from his own father. The nephews of the deceased contended that his\n\ndaughters only had a right to use the piece of land during their lifetime but not to inherit it. The\n\nSupreme Court held that the law applicable to the whole of Indonesia (including Karo) is that sons\n\nand daughters shall be jointly entitled to the inherited assets/properties meaning that the portion\n\nof the sons is equal to the portion of the daughter. Ruling No. 179/K/Sip/1961 had become 'jurisprudensi\n\ntetap' because there were other similar rulings (which Tampubolon referred to in his affidavit).39. As earlier mentioned (para 32), the first defendant's expert witness was Sori\n\nTua Hutagulung (Hutagulung). Under cross-examination (N/E 117), Hutagulung revealed he was told to\n\ngive an affidavit by the first defendant. His affidavit was based on information given to him by the\n\nfirst defendant (see para 3) and he was asked in general on:a. the prevailing Inheritance Law in Indonesia;b. who are the legal heirs of Sitompul;c. what is the status of the law and the right of the first defendant to the\n\nmonies in the Singapore bank accounts (in which reference was made to the PA).However, Hutagulung was not told there were court proceedings in Singapore or,\n\nthe facts of this case.40. Hutagulung's answers to the first question was as follows:a. Inheritance law is included in the Civil Law but there is no inheritance law\n\nwhich applies equally to all races in Indonesia;b. the law recognises three (3) groups of people namely: (i) European; (ii)\n\nIndigenous and (iii) Eastern (Timur Asing) each of which practise different inheritance law.c. the inheritance law applicable to group (i) is the Civil law while the other\n\ntwo groups apply their traditional inheritance law. Further, the different ethnic groups (exceeding\n\n25) in group (iii) have their own traditional inheritance law, including the Bataks.Consequently, the extracts of the Civil Code (P1andP2) referred\n\nto by Tampubolon would not be the applicable law for Sitompul's estate.41. On the second question as to who are the heirs of Sitompul, Hutagulung\n\nstated:a. the inheritance law applicable to her estate is Batak traditional inheritance\n\nlaw derived from the patrilineal system whereby the name of a certain male becomes the name of the\n\nclan or 'marga';b. marriage between males and females within the same clan are strictly forbidden\n\nas they are still from one family, they have to marry other clans;c. a female who marries is admitted to her husband's clan and her children would\n\nbelong to her husband's clan;d. married women have no right of inheritance to their parents' estates; however\n\nthey have a right to ask the heirs of their parents for a part of the legacy and if the heirs grant\n\ntheir request, what is given to the married daughters is called 'pauseang' or 'holong ate' usually\n\nin the form of houses;e. as both the plaintiff and Indiana are married, the first defendant is the sole\n\nheir of Sitompul's estate.42. As for the PA, Hutagulung opined that it was actually a last Will and\n\nTestament although titled a power of attorney because:a. it had never been handed over by Sitompul to the first defendant as her\n\nattorney; andb. the first defendant became aware of its existence only after her demise when,\n\nby coincidence he checked her personal belongings;Unless Sitompul's signature was challenged, Hutagulung stated that the document\n\nwas perfect evidence of power and the first defendant, based either on Batak traditional law or\n\n'agreement law' or 'evidence law', had the right to withdraw monies from the Singapore bank\n\naccounts.43. Hutagulung disagreed with Tampubolon's views that court rulings pertaining to\n\ndisputes from the Batak community had become jurisprudensi tetap and hence applicable to Bataks. He\n\nsaid that the judgements had to be fair and just before they can be deemed jurisprudensi tetap. As\n\nfar as he was aware, the Batak community does not follow the court rulings including Ruling No. 179\n\nand since 1976, there had been no court rulings which pertain to Batak customary law.44. I had noted that the language in Hutagulung's affidavit was not what one\n\nwould expect from any expert witness. I had also inquired why he did not mention any of the\n\nrulings/cases referred to by Tampubolon in particular Ruling No. 284 K/Sip/1975 [see P4] (which was\n\na dispute involving the Simalungun clan [another group of Bataks]) wherein the Supreme Court decided\n\nthat wives and daughters are heirs under customary law; Hutagulung's cavalier response was, that he\n\nwas not asked nor was he obliged, to do so  he had given answers to questions put to him by the\n\nfirst defendant and in any case, the rulings did not apply to Bataks. Hutagulung repeated this\n\nstance more than once, even in re-examination. All I need to say is, that his attitude did not help\n\nto improve his credibility as an expert witness.45. In cross-examination, Hutagulung revealed he had been advising the first\n\ndefendant on Batak customary law before these proceedings and, had represented the first defendant\n\nin resisting Indiana's proceedings in the Jakarta courts, including applying to strike out her\n\nclaim. He defended his role in the Indonesian proceedings by saying that he was the first\n\ndefendant's consultant in those proceedings, not his lawyer but did not elaborate on the differences\n\nif any, between the two roles (N/E 118). Apparently, his affidavit was also adapted from an opinion\n\nhe had filed on the first defendant's behalf for Indiana's claim. It was equally apparent from his\n\ncross-examination that Hutagulung was unaware of the fact that the plaintiff and Indiana worked in\n\nand ran the company/business. He agreed it would be fair if the plaintiff and her sister each had a\n\nshare ( ) of Sitompul's estate in that case. When he was recalled to the witness stand after\n\nHutagulung had testified, Tampubolon disagreed with the former's view that Batak customary law\n\nprevailed over Supreme Court Rulings such that the latter did not apply to the community; I shall\n\nreturn to this portion of his testimony later.46. In the course of their testimony, both Tampubolon and Hutagulung had touched\n\non the system of 'Dalihan Natolu'. This referred to a Batak tradition of having members of a clan or\n\nmarga come together for a family council. In this regard, the first defendant had called as his\n\nwitness one Maruli Tua Lumban Gaol (Maruli), who claimed to be a close relative of the late parents\n\nof the plaintiff/first defendant and, an elder of the clan. Maruli (DW2) asserted that during their\n\nlifetime, Sitompul and her husband used to take his advice and he represented them on many matters,\n\nespecially those touching on Batak customary law. Maruli referred to his position as chairman of the\n\nBatak Descendants Association (PARI for short) for the period 1997-2000 as another credential for\n\ngiving evidence. He claimed that PARI is the correct body with the authority and knowledge to make\n\npronouncements on the applicable Batak customary law. Maruli had testified that on 23 and 28\n\nFebruary 2000, at the request of the plaintiff and Indiana, a family council was held at the\n\nresidence of Sitompul at 58, Cokroaminoto Jakarta, for the council's decision on matters relating to\n\nthe division of her assets and property. Present were the three (3) siblings, the sisters and\n\nbrother of Sitompul, Maruli and his wife and another couple form the Lumban Gaol clan. Maruli\n\nclaimed that at this family council which was properly constituted according to Batak customary law,\n\nit was unanimously agreed that:a. the first defendant was the head of the family in place of his late parents;b. the PA found amongst the possessions of Sitompul was consistent with Batak\n\ncustomary law, represented her last Will and Testament and should be given due respect, recognition\n\nand effect;c. as the head of the family, the first defendant should exercise compassion\n\ntowards his sisters and exercise his discretion in granting some part of his inheritance to them.47. However, both the plaintiff and Tampubolon refuted Maruli's claims.\n\nTampubolon pointed out that PARI is only a clan association which renders advice or makes\n\nrecommendations where there are quarrels amongst members. The role of the association is to advice\n\non Batak traditions such as wedding and funeral ceremonies. When PARI makes recommendations on\n\nmatters of inheritance or divorce, the same are not binding on the parties in dispute and cannot be\n\nenforced. If the recommendations are not accepted, the parties involved would still have to go to\n\ncourt.48. The plaintiff on her part disputed Maruli's claim to be a close relative of\n\nher late parents, he was only from the same clan and distantly related. She further disagreed with\n\nMaruli's version of what transpired at the council meeting to which he asked to be invited, not that\n\nhe was invited by her. She pointed out (contrary to Maruli's claim) that she had not agreed that the\n\nPA was the Last Will and Testament of Sitompul; she merely agreed that it was signed by Sitompul and\n\nshe was not given the same although she and Indiana had requested the first defendant for copies of\n\nthe document. This aspect of the plaintiff's testimony was confirmed by Maruli who said he had also\n\nasked for a copy of the document but was not given one by the first defendant.49. As for the first defendant (DW3), his testimony was a re-affirmation of his\n\naffidavit, that he was the sole beneficiary to Sitompul's estate, being her only son. He testified\n\n(N/E 222) that the certificates of inheritance and renunciation referred to earlier (para 36) were\n\nneeded by Sitompul to change the bank accounts from his late father's name to her name, including\n\nthe Singapore and Jakarta bank accounts. This testimony was not in his affidavit evidence and not\n\nunexpectedly was objected to by counsel for the plaintiff, particularly when it had been put to her\n\nclient that the reason for the certificate of inheritance was to enable the mother to realise the\n\nfather's other assets.50. Cross-examined on the reason behind his application in summons in chambers\n\n(no. 1120 of 2001/T), the first defendant said he felt the Jakarta courts was the more appropriate\n\nforum to determine the plaintiff's claim. When it was pointed out to him that his stand was\n\ninconsistent with his conduct in contesting Indiana's claim in Jakarta, the first defendant offered\n\nno convincing explanation. In fact, he had applied (with Hutagulung's assistance) in April 2001 to\n\nstrike out Indiana's claim on the basis that the court lacked jurisdiction. Indiana's proceedings\n\n(see exhibitDS-2in Dara Singh's affidavit) filed in the South Jakarta courts included a\n\nclaim for a share of the monies in the BOA and Citibank accounts. Notwithstanding that his own\n\nexpert Hutagulung had agreed that the plaintiff and Indiana were entitled to a share of Sitompul's\n\nestate in view of their contributions to the family businesses, the first defendant would not admit\n\n(NE 229) that Hutagulung had agreed. He gave no credit to either sister for their work. The first\n\ndefendant went further to assert that Hutagulung's view did not reflect the law, contradicting his\n\nown expert's testimony. Questioned why he had not instructed Hutagulung to address the issues in\n\nthis case in Hutagulungs testimony, the first defendant said it was not necessary; his brief to\n\nHutagulung was merely to answer the questions he posed.51. Not unexpectedly, the first defendant corroborated Maruli's testimony on the\n\nPA being a valid last Will and Testament of Sitompul and on what transpired at the family council\n\nmeetings on 23 and 28 February 2000. Indeed, the first defendant went further to say that when he\n\ninstructed his daughter (the second defendant) to withdraw US$600,000 from the Citibank account on\n\n11 August 1999, he was carrying out Sitompul's wishes. He had intended (N/E 249) to use the\n\nwithdrawal to pay land taxes, buy land from others (including the plaintiff's present residence at\n\nJalan Suwiryo, Jakarta) and educate Indiana's children; this was in accordance with Sitompul's plans\n\nmade at the time the account was opened. This portion of the first defendant's testimony only\n\nemerged under cross-examination  in his affidavit he had only asserted that Sitompul had intended\n\nthat part of the monies would remain in Singapore for the education of his children. At other times\n\nduring his cross-examination (N/E 248 and 259), the first defendant had claimed that the withdrawal\n\nwas to enable him to settle his late mother's outstanding medical fees, pointing out that the\n\nplaintiff herself had withdrawn a sum of US$100,000 for that purpose from the first BOA account.\n\nThis explanation is patently untrue; the second defendant withdrew the sum of US$600,000 almost a\n\nmonth after Sitompul's demise; I find it incredible that Mount Elizabeth Hospital where she was\n\nwarded, would allow her to be discharged without full payment of their fees, particularly when she\n\nwas not a resident of Singapore. The first defendant shifted his stance yet again when, at another\n\nstage of his cross-examination (N/E 259), he admitted that the withdrawal from the Citibank account\n\nwas not to pay for Sitompul's expenses.52. As for the failure of the second defendant to appear to defend these\n\nproceedings, the first defendant explained away her absence by the fact that she could not leave her\n\nstudies (N/E 257).",
        "The decision": "64. Before I give the reasons for my decision, it would be useful to look at the\n\norders I made on 25 June 2001 when I awarded judgment to the plaintiff; the relevant orders are as\n\nfollows:a. upon the death of Madam Dumatiar Sitompul (Mdm DS) on 11 July 1999, the\n\n  legal title to the monies remaining in her Citibank Singapore Account as at the date of her death\n\n  (the Trust Monies) had vested in the plaintiff and/or the second defendant as the surviving joint\n\n  account holders;b. the beneficial interest in the Trust Monies belong to the estate of Mdm DS\n\n  and that the plaintiff, the first defendant and Indiana Lumban Gaol (Indiana) being the children\n\n  of Mdm DS are the three beneficiaries of her estate and each is entitled to a one third ( )\n\n  share of the Trust Monies;c. the plaintiff and/or the second defendant hold the Trust Monies on trust for\n\n  the estate of Mdm DS and for the plaintiff to the extent of her one third ( ) share therein;d. the second defendant had acted wrongfully and in breach of the trust when\n\n  she transferred part of the Trust Monies in the sums of USD$425,568.10 AND US$256,168.85 on or\n\n  about 11 August 1999 to the first defendant's and her joint accounts with Standard Chartered Bank,\n\n  Singapore and Citibank NA, Jakarta respectively;e. the first and second defendants hold the respective sums transferred to\n\n  their accounts with Standard Chartered Bank Singapore and Citibank NA, Jakarta on trust for the\n\n  estate of Mdm DS and for the plaintiff to the extent of her one third ( ) share;f. the first and second defendant are in breach of their fiduciary duties owed\n\n  to the plaintiff in refusing to distribute to the plaintiff her one third ( ) share of the\n\n  monies in the first and second defendants' accounts with Standard Chartered Bank, Singapore and\n\n  Citibank Jakarta.It is to be noted that the plaintiff only obtained declaratory relief in relation\n\nto Sitompul's estate as regards her one third ( ) share.65. I turn now to the testimony of the two (2) experts. One reason for my ruling\n\nin favour of the plaintiff was the evidence of her expert Tampubolon. He had taken great pains in\n\nhis affidavit to establish that Batak traditional law had, over the years been modified, if not\n\ntotally changed, by case-law which had become jurisprudensi tetap or what we would describe as\n\njurisprudence. Tampubolon's testimony withstood lengthy and vigorous cross-examination by counsel\n\nfor the defendants. He had obviously done considerable research on the opinions sought from him by\n\nhis instructing counsel.66. Tampubolon's testimony is to be contrasted with that of the first defendant's\n\nexpert Hutagulung, whose opinion was superficial, lacked research, was often unfounded and hence was\n\nunreliable; far worst, it could not be considered as coming from an unbiased and independent witness\n\nas he/his partner had acted (and was still acting) for the first defendant in Indiana's Jakarta\n\nproceedings. In addition, his affidavit opinion was based on what the first defendant told or rather\n\nchose to tell, him; he did not make an objective assessment based on the relevant documents of this\n\ncase, which apparently he did not even sight, nor was he told about this case (N/E117) even when he\n\naffirmed his affidavit of evidence (26 April 2001) in Jakarta. Unlike Tampubolon, Hutagulungs\n\nviews were based on what he heard, not what was decided by the highest judicial authority in\n\nIndonesia, namely the Supreme Court. Hutagulung's knowledge of Indonesian judicial rulings was at\n\nbest vague/cursory and at worst, out-dated and inaccurate. Hutagulung had opined that the first\n\ndefendant was entitled to Sitompul's entire estate notwithstanding he was aware of the 1975 Supreme\n\nCourt decision concerning Batak inheritance law which ruled that males and females are equal\n\n(N/E115). Consequently, I rejected Hutagulung's testimony.67. The first defendants testimony equally left much to be desired; he\n\nprevaricated, changed his stance and departed from his written testimony when it suited his case to\n\ndo so; he took liberties with the truth. In addition to what I have pointed out earlier (para 51),\n\none other instance I can cite in this respect was his claim (N/E 253) that the monies in the\n\nCitibank account was meant for family members. This was to overcome the omission of his name from\n\nthat account. Yet, when it came to the first BOA account (of which he was a joint account-holder),\n\nthe first defendant's stance was that the monies should all go to him as the only son. He did not\n\nimpress me as a capable person either. His taking 7-10 years to rebuild an office block in Jakarta\n\nbelonging to Sitompul would be a reflection of his poor calibre; I disbelieved his explanation that\n\nbureaucracy, not him, was the cause of the delay; he was certainly far less capable than the\n\nplaintiff.68. The first defendant was also a devious character. As was put to him during\n\ncross-examination, he was prompted to request his daughter/the second defendant to withdraw\n\nUS$600,000 from the Citibank account after he was informed by the plaintiff (upon checking with\n\nCitibank), that the account would not be frozen as he thought it would be, upon Sitompul's demise.\n\nThe withdrawal was to pre-empt the plaintiff herself from taking out the monies. He then tricked the\n\nplaintiff into signing the forms which enabled him to become a joint-holder of that account and then\n\nto transfer out the balance therefrom to SCB and Citibank, Jakarta.69. Whether it was greed (which I believe is the more likely) that prompted him\n\nto deny his two (2) sisters any share to his mothers estate or, it was his stubborn belief that\n\nhis position as Sitompuls only son and heir under Batak customary law was unassailable, the first\n\ndefendant struck me as a totally unreasonable person. I say this because of his reliance on the PA\n\nas Sitompuls Will.70. In order to rely on the PA as his late mothers Will, the first defendant\n\nwould have to accept that the Civil Code/law applied to her estate, not Batak customary law, which\n\nonly recognised a tona or oral Will, not the 3 types of Wills which exist under Indonesian\n\ncivil law. Even if the PA could be said to be a written 'tona', it was Tampubolon's testimony, when\n\nrecalled to the witness stand (N/E 192), that it was still not a valid tona under Batak customary\n\nlaw. This was because the Dalihan Natolu should be present to witness the making of the written tona\n\nto ensure it was indeed made by Sitompul prior to her death. The purpose of a Dalihan Natolu is not\n\nto approve or validate a written tona as Maruli and Hutagulung both tried to suggest was what was\n\ndone (for the PA), at the meeting on 23 February 2000. It was claimed by the first defendant that he\n\nfound the document sometime after 19 July 1999, amongst the possessions of Sitompul in her room. As\n\nthe PA was found well after her demise, how can it be considered a valid written tona when the\n\nDalihan Natolu was not present to witness its signing by her?71. The second difficulty the first defendant faced was, the alleged Will was\n\nincomplete as it did not spell out the disposition of Sitompuls entire estate, only the\n\nmanagement and utilisation of her (unidentified) bank accounts, by the first defendant. That being\n\nthe case, there was a partial intestacy of her estate if indeed the document was her Will; how were\n\nher remaining assets to be disposed off? In this regard, I need to digress and refer to the\n\ntestimony of Hutagulung (N/E 164) when he was cross-examined on this issue. He had opined that\n\nSitompul's remaining assets were to be distributed in accordance with traditional Batak customary\n\nlaw which in effect, meant that they would all go to the first defendant, according to his\n\ninterpretation. However, an analysis of his opinion would show it would give rise to a ridiculous\n\nsituation. I have no reason to doubt Tampubolon's opinion that the PA does not qualify as a valid\n\nwritten tona. That being the case, the only way to give validity to the document would be to fall\n\nback on the provisions of the Indonesian Civil Code to say it is a Will. If so, how can the first\n\ndefendant maintain that Batak customary law would apply to the distribution of the remainder of the\n\nestate? Just the language of the PA itself (original and translated) makes it clear that it could\n\nnot be anything else other than a power of attorney, which under the Indonesian Civil Code (Article\n\n1813) ceased to have any effect upon Sitompul's demise.72. It cannot be disputed that Sitompul in her lifetime was an exceptionally\n\ncapable woman, a far cry from the traditional Batak woman. She had built up into a multi-million\n\ndollar operation, the business as well as the company and in the process had attained considerable\n\nwealth. This, coupled with the fact that she applied to the Indonesian courts for a certificate of\n\ninheritance (of her husbands estate) in her as well as her children's, favour, showed that she\n\nwas not someone who believed in/relied on traditional Batak law to decide inheritance matters. My\n\nview is reinforced by the fact that she went further to obtain a certificate from her children\n\nrelinquishing their rights of inheritance to her. Consequently, her own estate should be dealt with\n\nunder the provisions of the Indonesian Civil Code.73. In contrast to the first defendant, I found the plaintiff to be forthright\n\nand candid in her testimony. There was no change in her position, either in her own oral testimony\n\nor in her cross-examination. Her version of events was more consistent with documents produced in\n\ncourt and hence, more credible.",
        "Conclusion": "74. This claim could and should have been tried based purely on Singapore law, in\n\naccordance with the contractual relationship/obligations between the two (2) Singapore banks\n\ninvolved and their customers who maintained joint accounts (with survivorship clauses), after the\n\ndemise of one of joint holders to such accounts. The first defendant chose to widen the dispute by\n\nclaiming that he was the sole beneficiary of his late mother's estate and therefore entitled to the\n\nmonies in her Singapore bank accounts and so pleaded in his Defence. Determination of the heirs of\n\nSitompul's estate should rightly have been decided by the Indonesian courts. The proper course of\n\naction should have been for the monies in the joint accounts to be paid out to the surviving\n\naccount-holders be it the plaintiff, the first and or second defendants. Thereafter the recipient(s)\n\nof the monies would have to hold the monies as trustee(s) until such time as the Indonesian courts\n\ndecide on who constituted the beneficiary or beneficiaries of Sitompul's estate and determine the\n\ndivision of the estate.75. The first defendant however chose to confuse matters by bringing the issue of\n\ndistribution of her estate before our courts, apart from his last minute volte face to stay the\n\nproceedings. Having so widen the dispute, the first defendant failed to convince me through\n\nHutagulung's testimony, that he was the only rightful heir to his late mother's estate. The rulings\n\nof the Indonesian Supreme Court on the issue made it clear that sons and daughters (married or\n\nsingle) of Batak parents enjoy equal rights of inheritance to their parents' estates.76. In accordance with the order of court made on 12 February 2001, I dealt with\n\nBOA's interpleader immediately after making the orders in this suit. The orders made were as\n\nfollows:Upon the death of Sitompul on 11 July 1999:the legal title to the monies remaining in her first BOA account now held by [the first\n\n    defendants solicitors] had vested in the first defendant as the surviving joint account\n\n    holder;the legal title to the monies remaining in her second BOA account now held by the [plaintiffs\n\n    solicitors] had vested in the plaintiff as the surviving joint account holder;the beneficial interest in the monies held by both solicitors belong to the estate of Sitompul\n\n    and [the plaintiff, the first defendant and Indiana] being the children of Sitompul are the\n\n    three (3) beneficiaries of her estate and each is entitled to one third-share in the monies;the distribution of the monies shall follow the terms of the order set out in Suit No. 780 of\n\n    2000.The first defendant has not appealed against the above orders.Sgd:LAI SIU CHIUJUDGECopyright © Government of Singapore."
    }
}