{
    "case_title": "Kian Wah Hung (Private) Limited v William Interior Design",
    "ncitation": "[2001] SGHC 332",
    "coram": "Woo Bih Li JC",
    "sections": {
        "The Law": "14.    InHau Khee Wee & anor v Chua Kian Tong & anor[1986] SLR 484the appellants had filed the Notice of Appeal in time but not the Record of\n\nAppeal.15.    Chan Sek Keong JC (as he then was) said that the factors to be\n\ntaken into account in an application for extension of time to file a Notice of Appeal are:(1) the length of the delay;(2) the reasons for the delay;(3) the chances of the appeal succeeding if time for appealing is\n\n  extended; and(4) the degree of prejudice to the would be respondent if the\n\n  application is granted.16.    I would emphasize that although these factors were stated in\n\nrelation to the question of extending time to file a Notice of Appeal, the facts in that\n\ncase were that the Notice of Appeal had been filed on time and it was the Record of Appeal\n\nthat had not been filed on time.17.    Accordingly, these factors would also apply to a situation where\n\nthe Notice of Appeal was filed on time but not the Record of Appeal, as was the case\n\nbefore me.18.    InPearson v Chen Chien Wen Edwin[1999] 1 SLR 212, the\n\nNotice of Appeal was not filed on time due to a bona fide mistake made by the\n\nappellant’s solicitors in the computation of time.19.    Chief Justice Yong Pung How, delivering the judgment of the Court\n\nof Appeal, adopted the factors stated inHau Khee Wee’scase as a framework in\n\nthe exercise of the court’s discretion to extend time.20.    Chief Justice Yong also said that when an application is made for\n\nan extension of time (to appeal out of time) the application should be on grounds\n\nsufficient to persuade the court to show sympathy and on the facts in that case, no such\n\ngrounds had been shown.21.    InVettath v Vettath[1992] 1 SLR 1, an application was\n\nmade to file a Notice of Appeal out of time. It was not filed on time due to some\n\nconfusion which arose as to which solicitor for the appellant, should file the Notice of\n\nAppeal. Chief Justice Yong reiterated what he had said inPearson’scase about\n\nsufficient grounds having to be shown to persuade the court to show sympathy to the\n\napplicant.22.    InBank of India v Rai Bahadur Singh & Anor[1993] 2 SLR 592, the Record of Appeal had been filed on time but this had not been served on time\n\ndue to an inadvertent oversight on the part of a clerk of the appellant’s solicitors.23.    Judith Prakash JC (as she then was) noted that the grounds for an\n\nextension of time must be sufficient to persuade the court to show sympathy to the\n\napplicant, citingPearson’scase.24.    As for the four factors laid down inHau Khee Wee’scase, she said, at p 597F to 598A:‘The respondents submitted that in exercising my discretion I\n\n  should take into account the factors laid down by Chan Sek Keong JC (as he then was) inHau\n\n  Khee Wee & Anor v Chua Kiang Tong & Anor. These factors are:(1) length of delay;(2) reasons for delay;(3) chances of the appeal succeeding if time for appealing is extended; and(4) the degree of prejudice to the would-be respondent if the application is granted.As is evident from the third factor expounded above, these factors are\n\n  factors to be considered when an applicant wants leave to appeal after the time limited\n\n  for appealing has expired. That is a different and more complex situation than the one I\n\n  was faced with. In that situation the judgment would have become final in favour of the\n\n  successful party and he would, in a sense, have had an accrued right which he would be\n\n  deprived of if the application were allowed.In the present case, the appellants had exercised their rights of\n\n  appeal within time. No right had accrued to the respondents in the sense used above.\n\n  Accordingly I did not consider it appropriate for me to look into the chances of the\n\n  appeal succeeding. In my view, the relevant factors for my consideration were the length\n\n  of the delay, the reasons for the delay and the prejudice, if any, which granting the\n\n  application would cause the respondents.’25.    The facts in theBank of Indiacase were not identical to\n\nthose before me. In that case, the Record of Appeal was filed on time but was not served\n\non time. However, I would add that there should be no difference in the factors applicable\n\nbetween the late filing and the late service of the Record of Appeal.26.    In the case before me, the Record of Appeal (and the\n\nAppellant’s Case) had not been filed on time. As I have said, the facts before me are\n\nsimilar to those inHau Khee Wee’scase. The decision in theBank of Indiacase appears inconsistent with that inHau Khee Wee’scase.27.    I was of the view that I should not adopt the approach in theBank\n\nof Indiacase.28.    Where a Notice of Appeal is filed and served on time but the\n\nRecord of Appeal is not filed or served on time, the appeal will be deemed to be withdrawn\n\nunder O 55D r 6(5) unless extension of time is granted.29.    Accordingly the judgment in favour of the respondent would\n\nlikewise have become final as though the Notice of Appeal had not been filed or served on\n\ntime. The respondent would have an accrued right which he would be deprived of if the\n\napplication for extension of time were to be allowed.30.    Therefore, I see no valid reason to have different applicable\n\nfactors for the late filing or service of the Notice of Appeal and the late filing or\n\nservice of the Record of Appeal.31.    InNomura Regionalisation Venture Fund Ltd v Ethical\n\nInvestments Ltd[2000] 2 SLR 686, the Notice of Appeal was filed on time but due to a\n\nmistake by a staff, it was served on the previous solicitors for the appellant rather than\n\non the solicitors for the respondent.32.    Lai Siu Chiu J decided that the factors, as enunciated inHau\n\nKhee Wee’scase, equally applied to an application to extend time to serve a\n\nnotice of appeal filed within time. This was because an appeal only comes into being where\n\nthe Notice of Appeal was both filed and served.33.    In the Court of Appeal[2000] 4 SLR 46, these same factors were\n\nupheld. In other words, there is no distinction between the filing and the service of a\n\nNotice of Appeal.34.    As for a mistake by a solicitor or his staff, Chao Hick Tin JA,\n\ndelivering the judgment of the Court of Appeal said, at para 28:‘28 We agreed with Lai Siu Chiu J that there is no absolute rule\n\n  of law which prescribes that an error on the part of a solicitor or his staff can never,\n\n  under any circumstances, be a sufficient ground to grant an extension of time to file a\n\n  notice of appeal. Having said that, we do not think it is possible to lay down any hard\n\n  and fast rules as to the circumstances under which a mistake or error on the part of the\n\n  solicitor or his staff would be held to be sufficient to persuade the court to show\n\n  sympathy to the application. It is the overall picture that emerges to the court that\n\n  would be determinative. However, a mistake, even bona fide, is only one factor in the\n\n  overall consideration. Such a mistake per se may not be sufficient to enable the court to\n\n  exercise its discretion in favour of an extension. As illustrations, and no more, we note\n\n  that two aspects which seem to have considerable bearing in the court’s consideration\n\n  inGatti v ShoosmithandPalata Investment v Burt & Sinfieldto grant\n\n  extension were (i) the fact that in each of those two cases, notice within the prescribed\n\n  time was given to the other side that an appeal would be taken and (ii) the mistake was\n\n  understandable and not gross. But this is not to say that only where such a notice was\n\n  given that a blunder by the solicitor or his staff would be viewed sympathetically. There\n\n  could well be other circumstances. Thus, if there is anything in the High Court decision\n\n  inStansfield Business International Pte Ltd v Vithya Sri Sumathis[1999] 3 SLR 239which could be read to suggest, although it did not expressly so state, that an error on\n\n  the part of a solicitor absolutely bars any relief, it is not correct. The decision inStansfield\n\n  Business Internationalto refuse an extension of time could well be justified as it\n\n  was a case of oversight simpliciter, with no other extenuating circumstances, although the\n\n  merits of the case were strong.’35.    In the case before me, the respondent was aware that an appeal\n\nwould be taken as the Notice of Appeal was filed and served on time. This, however, is\n\nonly one of the circumstances to be considered and the decision of the Court of Appeal in\n\ntheNomuracase does not mean that an extension of time will invariably be granted\n\njust because the respondent is aware that an appeal would be taken.36.    I will now come to the four factors.",
        "The length of the delay": "37.    Although the application was filed before the expiry of the\n\ndead-line to file and serve the Record of Appeal and the Appellant’s Case (‘the\n\nDocuments’), the application did not state how long Mr Chin would require to file and\n\nserve the Documents.38.    His supporting affidavit also did not disclose this.39.    In his submission, Mr Chin used the date of the hearing before\n\nme, i.e 12 September 2001 as the guide and said the length of delay was about one month.\n\nThat was not correct because there was no indication that the Documents had been prepared\n\nby then. He would still need more time to prepare them but he gave no indication to me as\n\nto how much more time he needed.40.    Accordingly, the length of the delay would be more than one\n\nmonth.",
        "The reasons for the delay": "41.    As is evident from Mr Chin’s affidavit, he had mis-read the\n\ndate on the Registrar’s Notice and hence mis-construed the dead-line by which he was\n\nrequired to file and serve the Documents.42.    It was not clear to me how much the upheavals in the continuation\n\nof his practice under a new firm from 1 July 2001 had contributed to the mis-reading of\n\nthe date on the Registrar’s notice.",
        "The chances of the appeal succeeding": "43.    Mr Chin’s affidavit was sorely lacking on this point.44.    The affidavit did not disclose:(a) the cause of action or defence(b) the subject matter of the dispute(c) the amount or value of the subject matter in dispute(d) the grounds of law and fact which he said ‘may be raised in the appeal\n\n  ….’(e) the ‘significant bearing in the area of the law of sale of goods’ that he\n\n  had alluded to.45.    I would add that even if the chances of the appeal succeeding\n\nshould not be considered, an affidavit seeking an extension of time should disclose, at\n\nthe very least, the matters I have stated in para (a) to (c) above for the court’s\n\ninformation.",
        "The degree of prejudice if the application is granted": "46.    No such prejudice was alleged by Counsel for the respondent.",
        "Order 55D rules 5(3) and (4)": "47.    I should also mention a point taken by Mr Chin during submissions\n\nbefore me, although he did not press it very much.48.    The one month time frame to file and serve the Documents under O\n\n55D r 6(1) runs from the date of service of the Registrar’s notice referred to in r\n\n5(3).49.    Under r 5(3), that Notice is to state that a copy of the Record\n\nof Proceedings is available, whereupon the prescribed fee (stated therein) is to be paid.50.    Under r 5(4), the Record of Proceedings shall consist of a\n\ncertified copy of various documents. These are:(a) the judgment or grounds of judgment or order (if any), and(b) the notes of evidence, including the affidavits of evidence in chief\n\n  (‘AEICs’) taken at the hearing of the case or matter.51.    Mr Chin said that the Record of Proceedings did not contain a\n\ncertified copy of the AEICs and this was an irregularity. As the proper procedure under r\n\n5(3) (read with r 5(4)) had not been complied with, the appellant should be granted the\n\nextension of time sought.52.    In my view, although r 5(4) states that the Record of Proceedings\n\nshall consist of a certified copy of the AEICs, the omission to include the same did not\n\nnullify the Registrar’s Notice relating thereto, see O 2 r 1(1). Indeed, Mr Chin did\n\nnot argue on the basis of nullity but irregularity.53.    The question was whether an extension of time should be granted\n\nin view of the irregularity.54.    It was not in dispute that the practice of the Registrar when\n\ngiving such a Notice is not to include a certified copy of the AEICs. This is because the\n\nparties already have a copy of the AEICs. Secondly, to include a certified copy of the\n\nAEICs, which can be voluminous, may increase the fee to be paid by an appellant.55.    Furthermore, Mr Chin did not suggest that the omission had in any\n\nway prejudiced him in the preparation of the Documents. He also accepted that he did not\n\nask for a certified copy of the AEICs from the Registrar.56.    Accordingly, the omission did not assist the applicant in seeking\n\nan extension of time.",
        "Conclusion": "57.    In the circumstances, notwithstanding that the application for an\n\nextension of time was made before 13 August 2001 and notwithstanding the candour of Mr\n\nChin in attributing the blame solely to himself, I was not persuaded to show sympathy to\n\nthe applicant.58.    While it is true that the applicant will be denied the avenue of\n\nan appeal, such an argument can never be sufficient per se to persuade a court to grant\n\nsympathy, otherwise all applications for an extension of time in relation to an appeal\n\nwill succeed. Besides, the applicant is not denied all avenues of recourse.Sgd:WOO BIH LIJUDICIAL COMMSSIONERCopyright © Government of Singapore."
    }
}