{
    "case_title": "Re Nirmal Singh s/o Fauja Singh",
    "ncitation": "[2001] SGHC 173",
    "coram": "Chao Hick Tin JA; \n      L P Thean JA; \n      Yong Pung How CJ",
    "sections": {
        "Introduction": "This was an application by the abovenamed Nirmal Singh s/o Fauja Singh (`the applicant`) to have his name replaced on the roll of advocates and solicitors of the Supreme Court of Singapore pursuant to s 102(1) of the Legal Profession Act (Cap 161, 2000 Ed) (`the LPA`). We dismissed the application and now give our reasons.",
        "Brief facts": "The applicant was admitted as an advocate and solicitor of the Supreme Court of Singapore on 8 November 1989. He began his career as a legal assistant in Assomull, Pereira & Partners, and thereafter moved on to Gurdaib, Cheong & Narmal and became partner in the latter firm from 31 July 1993.On 3 September 1993, the applicant was convicted, after a trial in the district court, of three charges of corruption under the Prevention of Corruption Act and one charge of criminal breach of trust (`CBT`) under the Penal Code. The applicant was found to have offered corruptly gratification of $5,000 to one Aziz, a police officer, as an inducement for letting off one Tan, who had engaged the applicant as defence counsel, from the police investigations into several housebreaking offences. In addition, the applicant was also found to have solicited and received corruptly $5,000 as gratification from Tan for his assistance in the scheme. In relation to the CBT charge, the applicant was found to have misappropriated a sum of $500 belonging to the firm of Assomull, Pereira & Partners, while he was employed there as a legal assistant. The applicant was sentenced to a total of 18 months` imprisonment and fined a sum of $5,000 for his offences. He paid the fine, served the term of imprisonment, and on account of his good behaviour was released on 19 October 1994.A Disciplinary Committee of the Law Society of Singapore (`the Law Society`) was subsequently appointed by the Chief Justice, upon the application of the Council of the Law Society, to investigate the applicant`s conduct pertaining to his criminal convictions. The applicant admitted to the charges against him before the Disciplinary Committee. On 30 August 1995, the Disciplinary Committee concluded its investigation and found that sufficient cause existed for disciplinary action to be taken against the applicant. Accordingly, the Law Society applied for an order requiring the applicant to show cause why he should not be dealt with under s 83(1) of the LPA.At the show cause proceedings before the court of three judges on 1 December 1995, the applicant indicated that he did not intend to show cause but wished only to raise some matters in mitigation in order that the court could determine the appropriate penalty. At the conclusion of the hearing, the court ordered that the applicant be struck off the roll of advocates and solicitors of the Supreme Court of Singapore: seeLaw Society of Singapore v Narmal Singh[1996] 2 SLR 184. After a lapse of some five years, the applicant, on 3 April 2001, filed the present application seeking an order under s 102 of the LPA that his name be replaced on the roll of advocates and solicitors.",
        "The present application": "The provisions of s 102 of the LPA are as follows:(1) The court may, if it thinks fit, at any time order the Registrar to replace on the roll the name of a solicitor whose name has been removed from, or struck off, the roll.(2) Any application that the name of a solicitor be replaced on the roll shall be by originating motion, supported by affidavit, before a court of 3 Judges of the Supreme Court of whom the Chief Justice shall be one.(3) Notice of the motion shall be served on the Society which shall -(a) appear at the hearing of the motion; and(b) place before the court a report which shall include -(i) copies of the record of any proceedings as the result of which the name of the solicitor was removed from or struck off the roll; and(ii) a statement of any facts which have occurred since the name of the solicitor was removed from or struck off the roll and which in the opinion of the Council or any member of the Council are relevant to be considered or to be investigated in connection with the application.Mr Davinder Singh for the applicant made an impassioned plea before us. He submitted that it had been eight years since the applicant ceased his legal practice, and some five years and four months since he was struck off the roll. After his release from prison, the applicant was actively engaged in various charity works, and was gainfully employed as a business development manager and subsequently, as the head of administration in a company, where he handled large sums of money in the course of his work. In addition, he was, presently, diligently studying for and pursuing as an external postgraduate degree of Master of Law at the University of London. Throughout all these years, he had steered clear of any brushes with the law. All these, counsel argued, showed that the applicant was fully repentant and rehabilitated. He had paid a three-fold price for his past misdeeds, which counsel described as follows: first, he was made to suffer the shame and stigma of his conviction, the sheer ignominy of which alone must have been extremely difficult to bear given that he had himself been a senior police inspector; second, he had had to endure the disgrace and dishonour, which his striking-off brought not only to himself but also his family, and finally, he had had to face the humiliation of his peers in his small, but extremely close-knit Sikh community. The hard lesson he learnt from his acts of folly rendered it most unlikely that the applicant would repeat his offences again. His conduct and good deeds in the past few years exemplified that he was now a changed man, one in whom honour and integrity resided. In support of this, numerous accompanying  testimonials from the applicant`s current employer, the head of his religious organisation and senior members of the Bar, attesting to his good character, trustworthiness and sense of responsibility as well as asserting their confidence in his fitness for restoration, were tendered. In counsel`s submission, it was not so much the length of time which had elapsed since an applicant had been struck off which was pertinent, but rather whether the facts showed that there was still a risk to the public and the profession, if the applicant was allowed back into practice.Ms Asanthi S Mendis, State Counsel representing the Attorney General, opposed the application on two main grounds: first, it was argued that the application was premature in that an insufficient amount of time had elapsed since the applicant was struck off the rolls; and second, that the nature of the offences for which the applicant was struck off were of such nature and gravity as to render a five-year period of disbarment inadequate. Mr Lok Vi Ming for the Law Society informed the court that there were no material facts which had occurred since the applicant was struck off the roll and that the Law Society objected to the application.",
        "The law": "The provisions of s 102 of the LPA under which this application was made are quite clear. The court may, at any time, if it thinks fit, make an order for replacement of the applicant`s name on the roll of advocates and solicitors. The application of this section has been previously considered by the court of three judges, and it is helpful to examine these cases in some depth.InRe Chan Chow Wang[1982-1983] SLR 413[1983] 2 MLJ 30, the applicant was an advocate and solicitor of Singapore and was also an advocate and solicitor of Malaya. On 22 November 1974, before the court of three judges he was struck off the roll of advocates and solicitors for champerty and fraudulent conduct in his dealings with his clients. Notwithstanding that, he continued to practise as an advocate and solicitor in Malaya until November 1979, when he was also struck off the roll of advocates and solicitors in Malaya. In 1982 he applied for his name to be replaced on the roll of advocates and solicitors. The court of three judges noted that, although it was nine years since his name had been struck off the roll, he had ceased legal practice only for a period of three and a half years. The court held that, in all the circumstances, his application was premature. In delivering the judgment of the court, Wee Chong Jin CJ made the following general observation ([1982-1983] SLR 413 at 414; [1983] 2 MLJ 30 at 30-31):In principle, sentences of exclusion from the legal profession need not be exclusive forever. On the other hand, the court has a duty to perform to the suitors of the court and the profession of the law to take care that those who are readmitted to it are persons on whose integrity and honour reliance may be placed. The court should also, in the public interest, on all the material before it be satisfied that the applicant is not likely to repeat the same offence or any other offence of a similar nature in the discharge of his professional duties before restoring him to the Roll.Next, there was the case ofRe Lim Cheng Peng[1987] SLR 486[1988] 1 MLJ 231. There, the applicant was admitted as an advocate and solicitor in 1965 and began his practice immediately. In January 1978, he ceased legal practice after  an investigation was conducted into his clients` account. He was convicted of an offence under s 409 of the Penal Code on 28 February 1981. There was some delay in the disciplinary proceedings taken against him. They were eventually brought in 1984, and on 9 April 1984 he was struck off the roll. On 17 July 1987, he applied for an order that his name be restored to the roll of advocates and solicitors. The court was somewhat troubled by the short intervening period between the date on which he was struck off the roll and the date the application was made, which was only slightly more than three years. However, having regard to the period he had ceased legal practice prior to the date on which he was struck off the roll and the delay in the disciplinary proceedings taken against him, the court, on the basis of the facts of the case, allowed the application. Wee Chong Jin CJ delivering the judgment of the court said ([1987] SLR 486 at 490; [1988] 1 MLJ 231 at 233):We are of the view that unless there are exceptional circumstances, we would say that, as a general rule, no solicitor who has been struck off the roll ought to contemplate taking out an application under s 99 of the Legal Profession Act before the expiration of five years from the date of the order of striking off.The learned Chief Justice made it a point to emphasize the special facts as follows:We would emphasize that this case turned entirely on its own special factual situation and should not be regarded as a precedent by those who might be minded to make such an application before the expiration of five years from the date of the order of striking off.Lastly, we come to the case ofRe Ram Kishan[1992] 1 SLR 529. There, the applicant, formerly an advocate and solicitor, was struck off the roll on 15 August 1983 following a finding of the Disciplinary Committee of the Law Society that he had violated the Solicitors` Accounts Rules 1967 and was also guilty of grossly improper conduct in the discharge of his professional duties. While the disciplinary proceedings were in progress, he was charged in the subordinate courts on five counts of criminal breach of trust. He pleaded guilty to one charge with the other four charges being taken into account. It appeared that the applicant`s conduct was the result of a long history of a mental disorder known as manic depressive psychosis. Since 1956, despite various treatments he had received, he suffered several lapses. Recent psychiatric reports submitted in relation to the application stated that the applicant showed no evidence then of manic depressive illness. Neither the Law Society nor the Attorney General objected to the application. Nevertheless, the court held that, having regard to his long history of mental disorder, in the interests of the public and the profession as a whole, it would be wrong to order the replacement of his name on the roll. The court approved the decisions inRe Chan Chow WangandRe Lim Cheng Peng(supra) and held that, while an application for replacement on the roll may be made under s 102 of the LPA at any time, as a general rule an application for replacement will not be entertained until the expiration of five years from the date of the striking-off order. Yong Pung How CJ said at p 533:An application for replacement on the roll may be made under the section at any time, but as a general rule no advocate and solicitor who has been struck off the roll ought to contemplate taking out an application for replacement on the roll before the expiration of five years from the date of the order of striking off. In taking out his application for  replacement, the onus will be on him to convince a court of three judges that he is still a person on whose integrity and honour reliance may be placed.At this stage, it is convenient to make an observation on the minimum time frame of five years adumbrated inRe Lim Cheng PengandRe Ram Kishan(supra). At the time when these two cases were decided, the maximum period of suspension which the court could order under s 83(1) of the LPA then in force was only two years. As such, the general rule requiring a lapse of a minimum of five years since the date of the order for striking off before an application for reinstatement should be made was appropriate, as it served to reflect the difference in gravity between a striking-off order and a suspension order. Section 83(1) of the LPA, however, has since been amended, and the amendment came into effect on 1 January 1994. Under the amended provision, the court is empowered in appropriate circumstances to order an advocate and solicitor to be suspended from practice for a period not exceeding five years. Having regard to this amendment, the general rule as to the minimum of five years is clearly no longer applicable. A significantly longer period than five years is now required to have elapsed before an application to be restored will be entertained. This is only commonsensical, since an advocate and solicitor who has been struck off the roll should not end up in substantially the same position as, or would be better off than, one who has merely been suspended from practice for the full period of five years. We are not disposed to lay down any fixed minimum time frame for bringing an application under s 102 of the LPA. Suffice it to say that under the current provisions of the LPA, a significantly longer period than five years should have elapsed before any such application will be considered.The difference in gravity between a striking-off order and an order for suspension for the full term of five years was demonstrated inLaw Society of Singapore v Dhanwant Singh[1996] 1 SLR 429. There, the respondent was convicted on three counts of abetting his clients to be excused from attending court by producing false medical certificates. In the show cause proceedings, the court had to consider whether the respondent ought to be struck off the roll or suspended from practice. The court held that a period of suspension even for the full period of five years would be neither adequate not appropriate, and that the only appropriate penalty was a striking off and this was ordered.Reverting to the present application, we agreed with the submission of Ms Mendis that clearly in this case an insufficient period of time had elapsed since the applicant was struck off the roll of advocates and solicitors. The order striking him off the roll was made on 1 December 1995 and he filed the present application on 3 April 2001. There was thus only a lapse of approximately five years and four months. It was argued on behalf of the applicant that he had ceased legal practice long before the order for striking off was made, and in total he had not practised for eight years, and that followingRe Lim Cheng Peng(supra) the period in which he had ceased legal practice before the order for striking off should be taken into account.We accepted the applicant`s statement of fact as deposed to in his affidavit that he stopped practice as from 31 July 1993. Presumably, at or about that time, the police had commenced investigations into his affairs and he was subsequently  arrested. He was charged with six counts before the district court in August 1993; he was tried and convicted on 3 September 1993, and was sentenced to a term of imprisonment for 18 months and was fined $5,000. As such, his cessation from legal practice at that time was far from voluntary and could hardly be said to have been undertaken by him in recognition of or in atonement for his mistakes. In this case, the period before the order for striking off was made could hardly be taken into account for the purpose of deciding whether or not sufficient time had elapsed for the present application.At the show cause proceedings, it was argued that a suspension would meet the ends of justice. This was expressly rejected by the court which made an order for striking off:Law Society of Singapore v Narmal Singh(supra). The court`s decision therefore meant that it had considered, as inDhanwant Singh(supra), that a suspension of full five years would be neither adequate nor appropriate. Indeed, the court held that the offences committed by the applicant were far more serious than those committed by the respondent inDhanwant Singh.We also agreed with Ms Mendis that the nature of the offences, for which he was struck off, was of such a degree of severity as did not warrant a restoration of the applicant to the roll at this point in time. The applicant was convicted of three charges under the Prevention of Corruption Act and one charge of criminal breach of trust under the Penal Code. The three charges revolved around the applicant corruptly offering gratification to one Aziz, a police officer, in order that his client, Tan, would be let off from the police investigations into his role in some housebreaking offences. At the same time, the applicant himself corruptly solicited and received gratification from the same client for his assistance in that scheme. The gravity of these offences was all the more exacerbated by the fact that the applicant himself had been a former police officer - an inspector of police at that - and that he committed these offences while acting as an advocate and solicitor for his client. What the applicant did amounted to a blatant attempt on his part, as an officer of the court, to evade the due process of the law and pervert the course of justice. That was not a case of simple dishonesty, which led to the applicant being taken off the roll. Neither could it be said that the offences, with their wide-reaching consequences, were the result of the `false steps of youth and early manhood`, given that the applicant was already 37 years old, when he committed the offences.In exercising its powers under s 102 of the LPA, the court must consider as its primary duty the protection of the interests of the public and the profession as a whole over the interests of the applicant. InRe Ram Kishan(supra), Yong Pung How CJ said at p 533:In taking out his application for replacement, the onus will be on [the applicant] to convince a court of three judges that he is still a person on whose integrity and honour reliance may be placed. In exercising its judicial discretion as to whether or not to replace the name on the roll, the court of three judges must consider as its primary duty the protection of the interests of the public and the profession as a whole over and above the interests of the applicant. The application of a person who has previously been struck off the roll for grossly improper conduct must necessarily be subjected to stricter scrutiny than that of a new entrant to the profession who has no adverse record. Unless the court is completely satisfied on all the material before it that there is no likelihood  that the applicant will repeat the same offence or any other offence of a similar nature in the discharge of his professional duties, and that he is now deserving of re-admission to an honourable profession, the court should not replace his name on the roll.In the final analysis, the question was really whether or not, on all the materials available before the court, the applicant could be said to be one who was fit to have his name restored on the roll. The court must be every bit as jealous of the honour of those admitted to the Singapore legal profession as a man is of his own reputation, for the integrity of the profession is dependant wholly on the character and virtue of its members. At the same time, we must be conscious of the ever-compelling need to protect the public from errant lawyers and the serious harm which such lawyers could inflict on the public and the reputation of the legal profession. Upon a consideration of all the facts in this case, we were not satisfied that the applicant could have been fully reformed and rehabilitated in the relatively short time span which had elapsed since he had been struck off the roll of advocates and solicitors of the Supreme Court, or that the public would be adequately protected if the applicant was allowed back into legal practice at this point in time. Accordingly, we dismissed the application with costs.Outcome:Application dismissed.Copyright © Government of Singapore."
    }
}