{
    "case_title": "Public Prosecutor v Wan Kamil bin Md Shafian and Others",
    "ncitation": "[2001] SGHC 357",
    "coram": "MPH Rubin J",
    "sections": {
        "(2) Cautioned statement of the second accused recorded by Insp David\n\nAng on 27 October 2000 at 11.40am (exh P-242)": "The deceased was not supposed to die. I did not know what\n\n  happen on that day. The deceased was behind the bushes with Rosli while Kamil was standing\n\n  behind the taxi. I sat at the taxi driver’s seat and I did not kill the deceased. I\n\n  plead for leniency. That’s all",
        "(3) Statement of the second accused recorded by SSI Zainal Abidin\n\nIsmail on 1 November 2000 at 10.00am (exh P-250)": "…2 On 8thAug 2000 at about 9.15 am, I left my Filipino\n\n  girlfriend’s home at No 25 Jln Pelepah to West Mall by bus service number 51 …3 I arrived at the coffee-shop at about 10.15am, and Wan and Rosli were\n\n  already there. We had breakfast and discussed about committing robbery that day. We did\n\n  not have a specific target but discussed on how to commit the robbery. There were general\n\n  discussion of robbing goldsmith shops, Toto booth, moneychanger shops and Cisco officers\n\n  escorting cash to ATM machines. I would like to say here that Wan had a waist pouch worn\n\n  around his waist, Rosli had a black sling bag, and another black sling bag was on the\n\n  table. Soon, when I sat with them, Rosli pushed the bag to me. I took the bag and put it\n\n  beside me. The bag was heavy and I knew it contained a revolver because of the shape when\n\n  I touched the outside of the bag. I did not take it out to look at it but Wan ever told me\n\n  that he had 2 guns. One is a pistol and the other is a revolver. I knew that the pouch\n\n  that Wan was wearing contained a pistol and I have seen it personally. He had showed it to\n\n  me the first time we met at Newton Food Centre when Rosli introduced him to me. This was\n\n  about 2 weeks ago. I did not know what were the contents in Rosli’s bag but I knew it\n\n  contained some weapons.4 In the discussion we agreed to rob a goldsmith shop but did not have\n\n  a specific place yet. We realised that we needed a getaway vehicle. We came with an idea\n\n  of stealing unattended cars with their ignition key in it. We decided that if we could not\n\n  get any unattended cars, we would go for a taxi. We intended to tie the taxi driver in a\n\n  secluded place so we would be able to use the taxi. There was no discussion about hurting\n\n  or harming the taxi driver.5 About 45 minutes later the three of us left the coffee shop and\n\n  walked along the road side and car parks near West Mall to look for unattended cars. As we\n\n  were walking along the road, we saw a police car coming out from the car park. On seeing\n\n  the police car, we panicked since we were armed. I told Wan that we should not waste time\n\n  looking for unattended cars and choose for the 2ndoption of getting a taxi and\n\n  he agreed. Just as we were standing along the roadside, I saw TIBS taxi coming towards us\n\n  and I flagged it down. The taxi stopped and all of us boarded it. I sat in front next to\n\n  the taxi driver, Wan was seated at the rear seat behind me and Rosli was seated next to\n\n  him behind the taxi driver. The taxi driver was a male Chinese in his 40’s. By then\n\n  it was about 11.15 am.6 Wan told the taxi driver in English to proceed to Chestnut Avenue and\n\n  he complied. The taxi driver drove off and he seemed to know the route to Chestnut Avenue\n\n  without Wan giving directions. When we reached Chestnut Drive, Wan the directed the driver\n\n  to proceed deeper to Chestnut Avenue. I do not know the place since it was my first time\n\n  there and Wan seemed to know the place well. We travelled past private housing and later\n\n  came to a deserted road with undergrowth along side it. We came to a road end and there is\n\n  a PUB or PWD main gate. The taxi stopped and the driver asked us where we actually wanted\n\n  to go. Wan told the driver to make a ‘U’ turn. At this time, Rosli and I were\n\n  carrying a sling bag and Wan was wearing the waist pouch that I had mentioned earlier. The\n\n  taxi driver complied and made a ‘U’ turn. About 200 metres away, just after the\n\n  bend, Wan told the driver to stop.7 The taxi stopped and I ordered him to get out by saying \"Uncle\n\n  go down\". By then the taxi driver thought we wanted to rob him. He wanted to give me\n\n  his money but I kept telling him to get out. He was in a daze and remained seated in the\n\n  driver’s seat. At that moment, I heard a cocking sound and when I turned, I saw Wan\n\n  pointing the pistol at the taxi driver. On seeing the pistol, the taxi driver got out and\n\n  I got out too and took over the wheel. By then Wan and Rosli had also got out and Rosli\n\n  held the taxi driver. Whilst seated in the driver’s seat, I turned around and saw\n\n  Rosli was forcing the taxi driver to the bushes of tall lalang on my left side of the\n\n  road. The taxi was facing Chestnut Drive. Wan was standing behind the taxi.8 I waited in the taxi and heard the taxi driver pleading from the\n\n  bushes. I could not make out what the driver was pleading about. About 7 to 8 minutes\n\n  later, Rosli came out from the bushes and boarded the taxi. I saw him holding a bayonet\n\n  that was stained with blood. He was also holding a pair of handcuffs. The bayonet that\n\n  Rosli was holding was a standard military bayonet. I know about bayonet as I was in the\n\n  army before during my national service. Wan also boarded the taxi and I drove off. Rosli\n\n  said to us that he had dropped the handcuff key and could not find it. Wan directed me the\n\n  route out of Chestnut Avenue. As I was driving, Rosli told us that the taxi driver might\n\n  have died as he had stabbed him about 5 or 6 times at his chest. I just kept quiet and so\n\n  did Wan.9 During the journey, Rosli took out a brown wallet and he told us that\n\n  he took it from the taxi driver. Wan told him to count the cash in it. Rosli counted cash\n\n  about $500 plus in $50 notes. Rosli also cleaned the bayonet and his hands in the taxi by\n\n  using a bottle of water and a piece of cloth. I asked Wan where we should go next. Wan\n\n  told me to find a place to park and directed me the route to take. Although I have a\n\n  driving licence, I seldom drive and do not know the roads well.10 I drove around for about 40 minutes and finally reached a car park.\n\n  I realised that we have reached Woodlands. I have been there before and I know that is a\n\n  shopping area with many shop houses, coffee shops and food centre. I parked the taxi and\n\n  all of us alighted. Wan and Rosli proceeded to a coffee shop nearby whilst I cleaned the\n\n  taxi when told by Wan. The reason being, we wanted to clean off our fingerprints in the\n\n  taxi. After cleaning the taxi, I called Rosli’s mobile telephone by using a public\n\n  telephone. Rosli’s mobile phone number was 97450847. He answered and I asked him\n\n  where he was and he told me to meet him at the coffee shop where I had parked the taxi. I\n\n  went to the said coffee shop and waited for them. A short while later, Rosli and Wan came.\n\n  I noticed that Wan had changed to a new black round neck t-shirt. Before that he was\n\n  wearing a blue round neck t-shirt. Wan told Rosli to dispose off the taxi driver’s\n\n  wallet and he did by throwing them separately in 2 different dustbins at the coffee shop.11 Having done so, Rosli gave me $50/- and we left the coffee shop to\n\n  the nearby food centre. We sat at the food centre and we ordered 2 bottles of\n\n  Guinness’ stout that Rosli paid them. A moment later, Rosli left us and he came back\n\n  later wearing a new white t-shirt. He wore a black round neck t-shirt before that. I do\n\n  not know why Wan and Rosli changed to new attires. As we sat drinking, Wan told Rosli that\n\n  it was not part of the plan to stab the taxi driver but since it had happened that way,\n\n  then it must be his fate. I think Wan said this to comfort Rosli because I noticed that\n\n  Rosli became quiet and looked worried.…Third Accused(1) Statement of the third accused recorded by SSgt Kamaruzaman on 15\n\nOctober 2000 at 2.55pm (exh P-243)Sometime in Dec 99, … I befriended … Wan Kamil\n\n  … We did not get in touch with each other until end of Jun or early July 2000. I met\n\n  Kamil at Choa Chu Kang MRT Station. Thereafter, we exchanged telephone no. and contact\n\n  each other. We met each other for drinking session (beer). During one of the session, my\n\n  friend, Ibrahim, joined us and I introduced him to Wan Kamil.Sometime in early Aug 2000, I together with Wan Kamil and Ibrahim met\n\n  at a coffee shop near to Bt Batok MRT Station. During the meeting, which was in the\n\n  afternoon, we decided to look for a victim to rob since the 3 of us have no money. Wan\n\n  Kamil told me that he brought along a knife and a handcuff inside a black TIMBERLAND\n\n  haversack. He then passed the haversack to me. After that, we walked around Bt Batok to\n\n  look for potential victim to rob but there was none that suit us. At this juncture all of\n\n  us agreed that we rob a taxi driver and at least we can get a couple of hundred dollars.We then flagged a taxi, a cream coloured taxi, at Bt Batok. Ibrahim sat\n\n  at the front seat while I and Wan Kamil sat at the back. Inside the taxi, Wan Kamil told\n\n  the taxi, Chinese man, to proceed to Chestnut Avenue.When we almost arrived at Chestnut Avenue, I took out the knife from\n\n  the haversack, which is a bayonet. At the same time, I saw the handcuff with the key\n\n  attached to it. Wan Kamil told me to use it. When the taxi driver stopped along Chestnut\n\n  Avenue, I pointed the bayonet on the left side of his body telling him in Malay to get out\n\n  of the taxi. He plead with me not to hurt him.When the taxi driver came out, Ibrahim took over the wheel while myself\n\n  and Wan Kamil came out of the taxi. I approached the taxi driver and handcuffed him at the\n\n  back. He plead with me not to hurt him. I did not bother and brought him to the bushes\n\n  while my two friend remained with the taxi.While at the bushes, the taxi driver fell on the ground and during this\n\n  time, I stabbed him about 4 to 5 times at the chest area. I was scared and some of the\n\n  blood splattered on my shirt. After that, I took out the handcuff and search for his\n\n  wallet. I found the wallet at his right front trousers pocket and took it with me. I did\n\n  not search his shirt pocket. I kept the bayonet and handcuff inside the haversack and\n\n  returned back to the taxi. Thereafter, all the three of us left in the taxi and Ibrahim\n\n  drove to Marsiling. At Marsiling we split the share, where I got about $200/- and the\n\n  wallet together with the coin box in the taxi, we throw it at the dustbin in Marsiling. We\n\n  went back to Bt Batok where Ibrahim alight us at West Mall Shopping Centre. He abandoned\n\n  the taxi on its own and join us. Thereafter, the three of us took the MRT home. Wan Kamil\n\n  took the haversack containing the bayonet and handcuff home.…",
        "(2) Cautioned statement of the third accused recorded by Insp David Ang\n\non 16 October 2000 at 12.05pm (exh P-241)": "… By August 2000, I was in great need for money. So I\n\n  planned to rob the taxi driver mentioned in the charge. Unfortunately, he did during the\n\n  robbery. I have no intention to kill him or to cause his death. That’s all.",
        "(3) Statement of the third accused recorded by SSI Zainal Abidin Ismail\n\non 23 October 2000 at 11.05am (exh P-256)": "…On 8 August 2000 at about 9.30 am, I was at Jurong East Central buying\n\n  a present for my nephew’s birthday. ……3 At about 11.00 am, I met Wan at the entrance of West Mall that is\n\n  facing the MRT Station . …4 About half an hour later, Ibrahim arrived and met both of us. Ibrahim\n\n  was attired in a white long sleeve shirt worn over a singlet. He was wearing a greenish\n\n  coloured slack and sports shoes. The three of us adjourned to a nearby coffee shop and we\n\n  discussed about our plan to do ‘lobang’ that day. We sat at the coffee shop and\n\n  Wan suggested robbing Cisco officers escorting cash that to be loaded to the POSB ATM\n\n  machines near the entrance of West Mall. He told us that he was a Cisco officer before and\n\n  he knew about the timing when cash is loaded to the ATM machines. Wan then unzipped the\n\n  black sports bag and took out two black sling bags. He gave one of the bags to Ibrahim and\n\n  the other to me. He told us that the bag that was with Ibrahim contained a gun and the bag\n\n  he passed to me contained a knife and a pair of handcuffs. Wan also told us that he had\n\n  another gun with him. I opened the bag and I saw a bayonet with it sheath. It was a\n\n  standard military bayonet. I know about bayonet since I had served my national service\n\n  with the SAF. Ialso saw a pair of handcuffs and a key attached to it secured by a ring in\n\n  the bag too.5 Wan discussed further on our individual role in the robbery. I was\n\n  told to go for the money whilst Ibrahim and him would shoot it out with the Cisco officers\n\n  if the need arise since they were armed with guns. Not long, the three of us walked to\n\n  West Mall.6 We sat close together and waited at the circular cemented area\n\n  opposite the entrance of West Mall. There are … ATM machines booth just next to the\n\n  entrance and we kept observing for the right moment to strike. As we sat and observed, I\n\n  noticed that there were many people around and it was not feasible to escape after the\n\n  robbery without a getaway vehicle. I brought this up to Wan and Ibrahim. I told them what\n\n  were our plans to escape from the place after the robbery. I told them that we could\n\n  simply flee on foot. With so many people around, members of public might arrest us. I\n\n  suggested getting a getaway vehicle for the robbery. After some thought, both of them\n\n  agreed to my suggestion. Ibrahim suggested stealing a vehicle first. Either Ibrahim or Wan\n\n  suggested we go to a petrol kiosk and drive away a vehicle when the owner leaves his\n\n  vehicle unattended to pay for the bills. The three of us then left to look for a nearby\n\n  petrol kiosk at the vicinity.7 As we were walking across a car-park, towards the main road from West\n\n  Mall, we saw a police car stopped and saw 3 policemen alighted. I became nervous and\n\n  signalled the rest to quickly walk away from there. We walked to the main road to take a\n\n  taxi. As we waited for a taxi, Wan suggested that it would be a good idea robbing a taxi\n\n  and ‘finish off’ the driver in order to use the taxi for the getaway vehicle in\n\n  the robbery that we planned earlier. Ibrahim and I just kept quiet when Wan suggested\n\n  about robbing a taxi and ‘finish off’ the driver. I knew and was aware what he\n\n  meant by saying that.Statement stopped at 12.30 pm for the accused to take his lunch.Statement continues at 2.05 pm8 Wan asked both of us if we know of any place quiet and secluded and I\n\n  replied that I did not know. Wan then said that we go to Chestnut Avenue since he knows\n\n  the place well. Not long after, at about noon, we saw a cream coloured taxi coming towards\n\n  us. Ibrahim flagged the taxi and it stopped. All of us boarded. I sat behind the taxi\n\n  driver with Wan beside me. Ibrahim was seated in-front next to the driver. The taxi driver\n\n  was a male Chinese in his 40s. I was still holding the sling bag containing the bayonet\n\n  and a pair of handcuffs that Wan gave me. Wan directed the taxi driver to go to Chestnut\n\n  Avenue and most of the time giving him directions to go there. I was not paying attention\n\n  the route taken to Chestnut Avenue. En-route to Chestnut Avenue, only Wan was talking to\n\n  the taxi driver in English whilst Ibrahim and I kept quiet.9 At about 10 to 15 minutes later, I saw the taxi turned into Chestnut\n\n  Avenue from Bt Timah Road. Wan directed the driver further into Chestnut Avenue and soon\n\n  after we past the private housing estate, I noticed there are thick undergrowth along the\n\n  road. It was the first time that I had been there. We came to an end of the road and there\n\n  is a gate. The taxi stopped and the driver asked us where actually we would want to\n\n  alight. Wan himself was not sure and told the driver to make a ‘U’ turn. By this\n\n  time, I noticed that the driver began to suspect that we were up to something and he was\n\n  nervous. He hit the taxi against the road kerb when making the turn. Wan directed the\n\n  driver to move on. Just a short distant after the bend, Wan told the driver to stop and he\n\n  complied. Ibrahim ordered him to get out of the taxi in English and I took out the bayonet\n\n  from my sling bag. The driver was in a daze and remained seated. I tapped the bayonet at\n\n  his left waist, ordered him out, and spoke to him in English. He just said \"I pay, I\n\n  pay\" but did not want to go out of his taxi. At this juncture, Wan took a black\n\n  coloured pistol from his sports bag and cocked it. He pointed it at the driver and ordered\n\n  him out. On seeing the pistol, the driver unfastened his seat belt and got out. I could\n\n  see that he wanted to run. I immediately got out of the taxi and held his shoulder. I told\n\n  him to keep quiet and he complied. Wan took out a pair of handcuffs from the sling back I\n\n  was carrying earlier and I handcuffed the taxi driver with his hands behind his back. Wan\n\n  got out of the taxi and Ibrahim took over the wheel whilst the engine was still running.\n\n  Wan told me to take the taxi driver to the bushes and ‘finish him off’. I held\n\n  the taxi driver by his left arm and I held the bayonet on my left hand. I pulled him into\n\n  the bushes of tall lallang along the road and he was just meekly resisting. He pleaded to\n\n  me not to harm him and said that he has a family. As I was pulling him towards the bushes,\n\n  he slipped into the drain but I managed to pull him before he could fall. I pulled him\n\n  into the tall lallang and he lost his balance. He fell onto the ground facing upwards. I\n\n  pulled him to get up since I intended to go deeper into the bushes. He told me that he\n\n  could not get up and I was unable to pull him up. One of his legs was entangled with roots\n\n  of the lallang on the ground. He was still pleading not to harm him.10 Wan was standing behind the taxi and watching me. He told me to\n\n  hurry up. By this time, I was holding the bayonet in my right hand. I used my left palm to\n\n  cover his mouth and I stabbed the taxi driver 4 to 5 times at his left chest whilst he was\n\n  lying facing up. I noticed that he was grasping for breath and became motionless soon\n\n  after. Blood was all over his white long sleeve shirt. I took out the handcuff and Wan\n\n  told me to take his wallet. I would like to say that whilst I was stabbing the deceased, a\n\n  car and a motor van past by travelling towards the road end. However, they did not stop.\n\n  Subsequently, I took the deceased’s wallet from his right trousers pocket. It was a\n\n  brown colour leather wallet. Having done so, Wan and I boarded that taxi with Ibrahim\n\n  behind the wheel and he drove off. It all happened in about 5 minutes. Wan was seated\n\n  in-front next to Ibrahim and I sat at the rear seat. I gave the deceased’s wallet to\n\n  Wan and he took out the cash found therein. Wan counted it and the amount was $700/- all\n\n  in denominations of $50/- except 5 pieces in denomination of $10/-. Wan told me to keep\n\n  the money and he kept the wallet. I then noticed my hands and shirt were stained with\n\n  blood. I used a bottle of water in the taxi and cleaned my hands and the bayonet. I then\n\n  kept the bayonet in the bag. Whilst in the taxi, I realised that the handcuff key that I\n\n  used was missing. I told Wan about this and he told me not to worry. I do not know where I\n\n  dropped it. Whilst in the taxi, I would like to say that I also took all the coins placed\n\n  in a bowl in the taxi.…",
        "(4) Statement of the third accused recorded by SSI Zainal Abidin Ismail\n\non 27 October 2000 at 4.10pm (exh P-258)": "47 I would like to amend part of my statement when I\n\n  stated that I have not seen the long barrel revolver before. Actually, about 2 days after\n\n  Wan had showed me the black coloured pistol at his house, I went to his house again. On\n\n  that day, I was at home. I called his mobile phone and asked him where he was. He told me\n\n  that he was bowling with his friends and told me to meet him later at his house. At about\n\n  2.00 pm, I went to his house. Only his maid and 2 children were at home. Wan brought me to\n\n  his children’s room. He took out the sling bag that I saw the last time he showed me\n\n  the black coloured pistol. This time, he took out and showed me a long barrel revolver. I\n\n  held it too and realised that it was a real gun. Wan had taken out the 6 rounds from the\n\n  revolver before handing it to me. He told me it was a Magnum revolver, used in the movie\n\n  ‘Dirty Harry’.",
        "(5) Further statement of the third accused recorded by SSI Zainal\n\nAbidin Ismail on 3 November 2000 at 4.50pm (exh P-259)": "54 Q11: Did you assault the taxi driver besides stabbing\n\n  him at Chestnut Avenue?55 A11: No. I only stab him with the bayonet. I do not know about other\n\n  injuries that he could have sustained. Probably these were caused when he fell into the\n\n  drain before I managed to pull him into the bushes. When he fell, his head and body might\n\n  have hit the side of the drain but I manage to puled him out.…58 Q13: Do you still maintain the fact that Wan was the person who told\n\n  you to ‘finish off’ the taxi driver?59 A13: Yes. We have no choice because we wanted his taxi. Furthermore,\n\n  there was no rope to tie the deceased.60 Q14: What about the handcuff? Can you secure him with the handcuff?61 A14: We do not want our fingerprints to be found on the handcuff\n\n  used on him in case we left him behind. In addition to this, I was in a hurry when we saw\n\n  a car drove past us at Chestnut Avenue.…",
        "(6) Further statement of the third accused recorded by SSI Zainal\n\nAbidin Ismail on 5 November 2000 at 2.40 pm (exh P-260)": "73 Q19: You are now shown a bayonet with its sheath\n\n  wrapped in newspaper. Is this the batonet that you referred to in your statement?74 A19: Yes. I confirm that this is the bayonet. I had used it to stab\n\n  the taxi driver. I can recognise it from its handle, the metal ring and the canvas strap.\n\n  I remember when I stab the deceased with it, the whole blade and the metal ring between\n\n  the blade and the handle were stained with blood. I would like to say that Wan had told me\n\n  that he had thrown away the bayonet that I had used and I am quite surprise to see it\n\n  again.…9 Following information, police searched the locker of the first\n\naccused at Cathay Bowl in a shopping centre at Chua Chu Kang and seized a bayonet wrapped\n\nin newspaper. The first accused admitted that the bayonet belonged to him. Another\n\ndevelopment was that after the arrest of the first accused, a team of CID officers led by\n\nAg Inspector David Ang also seized a long-barrelled Smith & Wesson revolver, a Colt\n\nsemi-automatic pistol, three pairs of handcuffs and a bunch of five handcuffs attached to\n\na small metal ring from the flat of the first accused. Another pair of handcuffs was\n\nseized from the second accused.10 Tests carried out by Mrs Tan Wai Fun, a scientific officer from the\n\nSingapore Health Sciences Authority (HSA) confirmed that the bayonet recovered from the\n\nlocker of the first accused had traces of bloodstains inside the covering of the handle\n\nand the analysis of the bloodstains through DNA profiling established that the blood was\n\nthat of the deceased.11 The prosecution also established through the evidence of another HSA\n\nofficer, Dr Tay Ming Kiong, that the handcuff key recovered from the scene of crime was\n\nsimilar in composition, make-up, design and dimension to the handcuff keys seized from the\n\nresidence of the first accused. The investigating officer, Insp Zainal for his part\n\naverred that the handcuff keys seized from the first accused could unlock all the\n\nhandcuffs seized.12 At the close of the prosecution’s case defence counsel did not\n\nmake any submissions. Having however considered the evidence adduced including the\n\nstatements made by the accused persons as well as forensic evidence, I was satisfied that\n\nthe prosecution had made out a case against all the accused persons which if unrebutted\n\nwould warrant their conviction. Consequently, I called on them to enter upon their\n\ndefences and explained the courses open to them. In the event all of them elected to give\n\nevidence on affirmation and their respective testimonies in their defence can be\n\nsummarised as follows.",
        "Evidence of the first accused": "13 On 8 August 2000 at or about 10.45am, the first accused met the\n\nsecond and third accused, as earlier arranged, at a coffee shop known as S-11 at Bukit\n\nBatok Central. They then planned to rob a goldsmith shop in Jurong East known as Boon Lay\n\nGems Store. The first accused had been to that shop before and had surveyed the area.\n\nDuring the discussion the second and third accused felt the need for a getaway vehicle.\n\nThe options discussed were either to steal an unattended vehicle or to seize a taxi from a\n\ntaxi driver.14 Their search to find an unattended vehicle was fruitless. Having\n\nspent 30 to 45 minutes in this enterprise in vain, the third accused commented that it was\n\ntroublesome to search for an unattended vehicle and they should not waste any further time\n\non finding an unattended vehicle. The third accused soon hailed a taxi and all of them\n\ninstantly boarded it. The first accused claimed that he was initially hesitant to board it\n\nbecause he felt that if the taxi were to be stolen, they would have to tie up the driver\n\nat a lonely spot which, in his view, was rather cumbersome as compared to stealing an\n\nunattended vehicle. He boarded the taxi, nevertheless. Once inside the taxi he told the\n\ntaxi driver to proceed to Woodlands as he was intending to abort the plan to rob the taxi\n\ndriver of his vehicle but both the second and third accused immediately gave him a look of\n\ndisapproval. He then directed the taxi driver to proceed to Chestnut Avenue.15 According to the first accused, in the original plan discussed by\n\nthem earlier, the second accused’s role was to drive the taxi, his role was that of a\n\nlookout and the third accused’s role was to take the driver to the bushes and\n\nrestrain him by handcuffing him to some trees in the bushes. There was no discussion\n\nhowever as to what should be done if the taxi driver tried to escape.16 The first accused added that their actual plan also included the\n\naspect that after they had carried out their robbery plan at the goldsmith’s shop at\n\nJurong East, they would inform the police of the whereabouts of the secluded place where\n\nthe taxi driver had been handcuffed and held.17 In the event, the taxi driver drove the taxi to Chestnut Avenue as\n\ndirected. The second accused was in the front passenger seat; the first accused was at the\n\nrear behind the second accused and the third accused just behind the driver. After the\n\ntaxi had reached the end of Chestnut Avenue where the Public Utilities Board’s Works\n\nDepot was situated, the first accused instructed the taxi driver to make a ‘U’\n\nturn. Later, just about 200 metres or so after the driver made the turn, the first accused\n\ntold the driver to stop the vehicle. The taxi driver obeyed and stopped. There were trees\n\nand bushes on both sides of the road where the taxi had stopped.18 Presently, the second accused told the taxi driver to get out of the\n\nvehicle. The first accused saw the third accused taking out a bayonet from the bag given\n\nto him earlier and tapping the taxi-driver’s shoulders. The taxi driver who looked\n\ndumbfounded, immediately uttered the words: ‘I pay, I pay’. He did not however,\n\nget out of the taxi.19 In order to make the taxi driver dismount from his vehicle, the\n\nfirst accused drew out his pistol from his waist bag. This made the taxi driver comply and\n\nleave the taxi. At about this time, the third accused opened the vehicle door to his\n\nright, got out and arrived at the driver’s door to block the driver from fleeing. The\n\nthird accused was then holding a bayonet in one hand and gripping the right arm of the\n\ntaxi driver in the other. At about this time, the second accused also got out from the\n\nfront passenger seat, swiftly crossed in front and took the vacated seat of the taxi\n\ndriver. The third accused then propelled the taxi driver towards the bushes about seven to\n\neight metres from the rear of the taxi.20 As the taxi driver was being led into the bushes by the third\n\naccused, the first accused noticed that the former had been handcuffed with hands behind.\n\nThe first accused could not see what was happening inside the bushes except for the fact\n\nthat he saw both the third accused and the taxi driver jump over a drain which ran along\n\nthe bush edge. The first accused then re-entered the taxi and sat inside. Moments later he\n\nsaw an oncoming motor car and at about this time he also heard a voice crying out in pain.\n\nHe immediately wound down the window – the first accused demonstrated the winding\n\ndown motion by making circular movements with his hand and shouted to the third accused\n\n‘Cepat sikit Li’ (‘Hurry up Rosli’).21 A minute or two later, the third accused re-emerged from the bushes\n\ncarrying in his hands the blood-stained bayonet and a pair of handcuffs. The third accused\n\ntold the first and second accused that he had stabbed the taxi driver.22 Both the first and second accused kept quiet. The first accused was\n\ntaken aback by the unexpected turn of events. He was shocked. He did not expect the\n\nstabbing of the taxi driver. It was not in their scheme of things.23 The first accused immediately told the second accused to leave the\n\narea and directed him to go to Woodlands. On the way to Woodlands, the third accused\n\ninformed them that he had pocketed the wallet of the taxi driver.24 The first accused admitted that the bayonet used by the third\n\naccused on that day was given to the latter by the first accused. He said that in order\n\nfor them to carry out their robbery plan, he had prepared three bags: the bag prepared and\n\ngiven to the third accused contained a bayonet, a pair of handcuffs, a ski-mask and a pair\n\nof gloves; the bag prepared and given to the second accused contained a long-barrelled\n\nSmith & Wesson revolver, a pair of handcuffs and a ski mask; and the first accused had\n\nwith him a pair of handcuffs, a ski mask, a pair of gloves, a hammer and a pistol.25 During the journey from Chestnut Avenue to Woodlands, the third\n\naccused told him that he had taken the taxi driver’s wallet which contained about\n\n$500. The third accused then passed that wallet to the first accused for him to have a\n\nlook. There was no cash inside the wallet except for some personal items of the taxi\n\ndriver such as the taxi driver’s automated teller machine (ATM) card and his National\n\nRegistration Identity Card. During the journey, the first accused also observed the third\n\naccused cleaning the bayonet with a piece of cloth and water from a bottle that were found\n\ninside the taxi. The third accused also told them that he had stabbed the taxi driver five\n\nto six times and that the taxi driver was still alive when he left him.26 The first accused was perturbed over what had transpired at Chestnut\n\nAvenue. He decided to cancel all robbery plans for that day but did not convey this\n\nthought to anyone.27 On the way to Woodlands, they stopped by at Marsiling with a view to\n\npurchasing some T-shirts. They could not find any shops at Marsiling selling T-shirts so\n\nthey drove to Woodlands. There the first accused bought a new T-shirt changed into it and\n\nthrew away the one he was wearing at a public toilet. The third accused suggested to the\n\nothers that they consume Guinness Stout to take his mind off the killing that had taken\n\nplace and so they did. The third accused paid for the drinks and gave the first accused\n\n$20.28 Soon, they left Woodlands for Jurong East where they had earlier\n\nintended to rob a goldsmith’s shop. Although the first accused was not intending to\n\ncommit any robbery after the incident at Chestnut Avenue, he nonetheless, accompanied the\n\nothers to survey the goldsmith’s shop at Jurong East whilst the other two went for\n\ntheir haircut. Later, he told the third accused that there was a closed circuit television\n\ncamera at the goldsmith’s shop, the place was crowded and therefore it was not\n\nadvisable to proceed with the robbery plan. They then, abandoned the plan. The first\n\naccused claimed that the stabbing of the taxi driver was still on his mind and he\n\ntherefore, decided to abort the plans for that day. The first accused then asked the\n\nsecond accused to drive all of them to West Mall at Bukit Batok to take the MRT home.\n\nThere, the first accused collected the bags of weapons from the other two and took a taxi\n\nhome. Before all of them parted company, the third accused distributed to each $120. When\n\nhe reached home, he washed the bayonet and took his shower. As he was not feeling too\n\ngood, he threw one of the bayonets, a pair of handcuffs, his trousers and a T-shirt into\n\nthe dustbin chute.29 In sum, his defence was that there was no plan either by him or by\n\nany of his companions on that day to stab the taxi driver. He also denied an averment by\n\nthe third accused that the first accused threatened the third accused by pointing the\n\npistol in the direction of the third accused uttering the words ‘finish him\n\noff’, when the third accused and the taxi driver were inside the bushes.",
        "Evidence of the second accused": "30 The second accused first met the third accused when the latter used\n\nto frequent his mother’s coffee stall at Telok Blangah Crescent. Later, the first\n\naccused was introduced to the second accused by the third accused. The third accused had\n\ntold the second accused that the first accused had a job which required the second accused\n\nto drive a vehicle. The second accused exhibited an interest in the offer made.\n\nConsequently, the third accused arranged for the second accused to meet the first accused\n\nat the Newton Hawker Centre one night. This was about two weeks before 8 August 2000. When\n\nboth the second and third accused were walking from Far East Plaza to Newton Hawker Centre\n\nto meet the first accused, the third accused mentioned to the second accused that the job\n\nthe second accused was required to do was something illegal and not normal.31 At the meeting at Newton Hawker Centre, the first accused talked\n\nabout robbery and told the second accused that he would be required to drive a Cabstar van\n\nof CISCO officers escorting cash for delivery to ATM machines. The first accused also\n\nmentioned goldsmith shops, money changers and Toto booths as the other targets. The second\n\naccused was not impressed. He told the first accused that it was not easy to commit\n\nrobbery with knives. Upon hearing this, the first accused placed a bullet on the palm of\n\nthe second accused. The second accused was still sceptical and wryly commented that anyone\n\ncould make a locket from a bullet.32 Later that night, when all of them were at a pub, the first accused\n\nshowed the second accused a pistol to further convince him. The pistol was shown to him\n\nagain whilst the first and second accused were in the toilet of the pub. The first accused\n\nalso told the second accused on this occasion that he had another firearm at home. They\n\nparted company after the first accused informed the second accused that they would meet\n\nagain.33 On 7 August 2000, the third accused contacted the second accused and\n\ntold him to meet him at the S-11 coffee shop at West Mall between 9.30 and 10.00am the\n\nnext day. When the second accused arrived at the appointed place, he found the first and\n\nthird accused seated at a table. He saw two bags on the table. The third accused instantly\n\nslid a bag to the second accused without saying anything. The second accused touched the\n\nbag passed to him and felt the shape of a revolver. The first accused told them that the\n\nrobbery target that day was a goldsmith’s shop. They all then decided to secure a\n\ngetaway car. Two options were floated: the first was to look around for vehicles left\n\nunattended at petrol filling stations or by people buying Toto tickets and the next option\n\nwas to get hold of a taxi, tie up the driver in a quiet place and use that taxi. The\n\nseized vehicle was to be driven by the second accused.34 They then left their meeting place and went around scouting for an\n\nunattended vehicle. The search was in vain. Moreover, after they came across a police\n\nvehicle nearby, they decided to abandon their plan to spirit an unattended vehicle. Soon,\n\nthe second accused flagged down a taxi driven by the victim and all three boarded it. The\n\nfirst accused instructed the taxi driver to proceed to Chestnut Avenue.35 The second accused added that when all of them discussed the second\n\noption at the S-11 coffee shop, the plan was to tie up the taxi driver in a quiet place\n\nand use the taxi. No decision was however, made as to who would tie up the taxi driver or\n\nwho would be the lookout. His role had already been determined, that was, to drive the\n\nvehicle.36 When all of them boarded the taxi the second accused occupied the\n\nfront passenger seat. The first accused took his seat at the rear behind the second\n\naccused and the third accused behind the taxi driver.37 The second accused denied the first accused’s claim that the\n\nlatter initially instructed the taxi driver to go to Woodlands. According to him, the\n\nfirst accused was the one who directed the taxi driver to proceed to Chestnut Avenue. The\n\nsecond accused did not know at that time where Chestnut Avenue was.38 In the event, the taxi reached the end of Chestnut Avenue. There the\n\nfirst accused told the taxi driver to make a ‘U’ turn. About some distance away\n\nfrom where the taxi made the ‘U’ turn, still at Chestnut Avenue, the first\n\naccused asked the taxi driver to stop. The second accused did not know why the first\n\naccused had asked the taxi driver to stop. All the same, the second accused said to the\n\ntaxi driver: ‘Uncle, go down.’ The taxi driver did not budge. Suddenly the first\n\naccused took out his pistol, cocked it and pointed it close to the face of the taxi\n\ndriver.39 The taxi driver offered to give them the money he had with him. The\n\noffer was declined and the first accused ordered the taxi driver to get out. As soon as\n\nthe taxi driver got out of the taxi, the second accused swiftly exited from his seat,\n\ncrossed the vehicle in front and occupied the driver’s seat.40 The first and third accused were then close to the taxi driver. The\n\nthird accused was holding him. As the second accused was about to adjust the rear view\n\nmirror of the vehicle, he happened to turn back and observed that the third accused and\n\nthe taxi driver close to the bushes. The first accused was somewhere behind the taxi\n\nholding his pistol in his right hand. The second accused saw nothing else.41 The second accused then started playing with the gear of the vehicle\n\nand adjusted the seat. He also opened the bag which was given to him at the S-11 coffee\n\nshop earlier, took out the revolver inside and looked at it. Just about this time, there\n\nwas a motor vehicle approaching them from the opposite direction and was heading towards\n\nthe PUB Waterworks situated at the end of Chestnut Avenue. After the vehicle had passed\n\nthe taxi he was in, the first and the third accused were seen returning to the taxi, the\n\nfirst accused seated himself in front and the third accused behind.42 When the third accused re-entered the taxi the second accused\n\nnoticed that he was holding a handcuff and the bayonet. At this point of his testimony,\n\nthe second accused was asked to clarify a segment in his statement to the police (P-244,\n\npara 2 at page 237 of the PI notes) where he had stated: ‘I saw Rosli and Wan pulling\n\nthe taxi driver to bushes.’ as against his present testimony in court. The second\n\naccused declared that he did not actually see both of them pulling the taxi driver and\n\ngoing into the bushes (see pages 812 to 818 of the NE).43 The second accused observed that the bayonet the third accused was\n\nholding was stained with blood. A little later, the third accused, after mentioning that\n\nhe had dropped the handcuff key, told the others that he had stabbed the taxi driver five\n\nor six times and that the latter may die. The second accused thought to himself then that\n\nthey hadn’t even started to commit the planned robbery yet they had already committed\n\na murder (page 822 of the NE).44 The first accused told the third accused not to worry about the\n\nhandcuff key. The third accused also told the others that he had taken the wallet of the\n\nvictim and that it contained about $500 to $600. Presently, the second accused was\n\ndirected by the first accused to drive on and the second accused complied with the\n\ndirection. The first accused directed him along Chestnut Avenue through Marsiling and\n\nthence to Woodlands. On the way, the first accused also showed the second accused how to\n\nuse the revolver which had been given to him earlier.45 Once they were at Woodlands, as directed by the first accused, the\n\nsecond accused cleaned the taxi to remove the fingerprints left inside. The second accused\n\nsaid that the claim of the first accused that the latter called out to the second accused\n\nto hurry up whilst being seated inside the vehicle was not true.46 The rest of the account narrated by the second accused was by and\n\nlarge similar to that of the first accused except perhaps in relation to some minor\n\naspects. At Woodlands despite the three of them combing the area, no particular target was\n\nfound appropriate for the robbery. There, the first and the third accused had a change of\n\nclothes. Later, all of them left for Jurong East. At Jurong East, once again the first\n\naccused instructed the second accused to clean the taxi of fingerprints. After cleaning\n\nthe taxi and parking it close by, when the second accused arrived near a goldsmith’s\n\nshop, the first accused told him that he was aborting the robbery plan as there were\n\nsurveillance cameras in that shop.47 Later, the second and third accused had a haircut at Jurong East.\n\nSoon, they left Jurong East for West Mall. There again, the second accused was told to\n\nclean the taxi thoroughly of the fingerprints. The second accused parked the taxi in a\n\nmulti-storey car park nearby and did the cleaning. Subsequently, all of them decided to\n\nwatch a movie and once it was over the second accused handed over to the third accused the\n\nbag of weapons which was provided to him earlier. He then left the place. The second\n\naccused confirmed that he received altogether $120 from the monies found in the wallet of\n\nthe deceased driver: $50 whilst they were in Woodlands and $70 just about the time he was\n\nleaving West Mall for home.48 In essence, the defence of the second accused was that his role on\n\nthat day was only to act as a driver of the getaway vehicle in the planned robbery and he\n\nwould not have used and did not have the intention to use the firearm in his possession to\n\ncause injury to anyone. He never intended to cause any physical injury to the taxi driver.\n\nThe plan of that day was only to tie up the taxi driver and relieve him of his taxi and\n\nnothing more.",
        "Evidence of the third accused": "49 The third accused who was a forklift driver first met the first\n\naccused sometime at the end of June or early July 2000 at Chua Chu Kang MRT Station.\n\nSubsequently they met for drinks on three occasions. The third accused also visited the\n\nhouse of the first accused for the first time in July 2000.50 On that occasion the first accused showed him two toy gun lighters\n\nand a while later, the first accused showed him a Colt 45 pistol and a short sword. The\n\nthird accused was shocked on seeing them. The first accused told him at that stage:\n\n‘this thing’ referring to the firearm ‘can make money’ (page 1047 of\n\nthe NE). The third accused responded to that by saying: ‘Are you a mad pig or\n\nwhat?’ The first accused retorted: ‘You have tatoos on your body, why should you\n\nbe afraid?’ The first accused informed the third accused that he had obtained the\n\npistol from Thailand.51 The first accused further took out a magazine with bullets and\n\nrequested the third accused to hold it in his hands to convince him that the objects were\n\ngenuine. The first accused also cocked the pistol and demonstrated the use of the pistol.52 There was a second visit by the third accused to the first\n\naccused’s house two days after his first visit. This time, the third accused was\n\nshown a revolver. The first accused told him that the Colt 45 was for his use whereas the\n\nthird accused could use the revolver if he were to accompany him to commit robbery. The\n\nrevolver shown to him was one of the weapons produced at the trial ie, the Smith &\n\nWesson long barrelled revolver.53 The third accused met the first accused again about two or three\n\ndays later at a coffee shop at Jurong East. The first accused in fact wanted the third\n\naccused to accompany him to survey Boon Lay Gems Pte Ltd, a goldsmith shop at Jurong East\n\nwith a view to committing robbery.54 The third accused was not prepared to join in the robbery. He\n\nexplained to the first accused that it would be difficult to run away from the scene as\n\nthere was no getaway vehicle. He reasoned that if one were to rob a jewellery shop, the\n\nloot was bound to be heavy and without a getaway vehicle it would be difficult to carry\n\nit. The first accused did not persist in his plans that day although he had brought with\n\nhim two bags – one Adidas sports bag and another Timberland sling bag. These were\n\nproduced at the trial and shown to be containing weapons.55 The third accused had become acquainted with the second accused\n\nsince about 1999. He used to go to the coffee shop where the latter worked. Later, both of\n\nthem became drinking companions. The third accused claimed that two or three days after he\n\nhad been out with the first accused at Jurong East, the first accused telephoned the third\n\naccused and asked him whether he was ready to commit robbery. The third accused did not\n\nrespond and remained silent. The first accused then remarked that the third accused should\n\nthink carefully before anything happened to him. The third accused construed those words\n\nas a threat. He became apprehensive since the first accused abruptly put down the receiver\n\nof the telephone after those remarks.56 Two days later, the first accused called the third accused again and\n\ninquired where the latter was. The third accused replied that he was at home. Soon, the\n\nfirst accused appeared at his doorstep. The third accused was frightened by this sudden\n\nappearance. Eventually, both of them repaired to a coffee shop where the third accused\n\nasked the first accused whether he had made a decision to join the first accused in his\n\nplans to commit robbery. This time too, the third accused remained silent.57 The first accused asked the third accused whether he knew any person\n\nwith driving skills, in great need of money and would be interested in joining them. The\n\nthird accused thought of the second accused as the latter’s coffee shop had been\n\nclosed for refurbishment. The third accused mentioned the second accused to the first\n\naccused. In the event, the third accused contacted the second accused and told him that\n\nthere was work to be done and the work involved driving. Subsequently, arrangements were\n\nmade by the third accused to introduce the second accused to the first accused.58 Not long after the three of them met at Newton Hawker Centre for an\n\nintroductory meeting. On the day, when the third and the second accused were on their way\n\nto Newton Hawker Centre, the third accused already told the second accused that the work\n\ncut out for him entailed going against the law, that the first accused possessed a pistol\n\nand was planning to commit robbery (page 1065 of the NE).59 At the meeting at the Newton Hawker Centre, the first accused asked\n\nthe second accused that if the latter were to be given an opportunity would he take it.\n\nThe second accused’s response was: ‘If you want to commit this by using knife or\n\nparang, you might as well forget it.’ (page 1067 of the NE). To convince the second\n\naccused that the first accused meant business, the latter held the hand of the second\n\naccused and gave him something which the third accused could not see. The second accused\n\nimmediately intoned that: ‘this thing anybody could have … and make [it] into a\n\nlocket.’ The purported reply of the first accused was that it was for real: ‘I\n\ntruly have it.’ (page 1068 of the NE).60 They then went on to discuss possible targets including CISCO cash\n\ndelivery vehicles, jewellery shops, money changers and even illegal bookies at the turf\n\nclub. When the first accused mentioned that they would be able to rake in about S$5\n\nmillion from their operation, the third accused agreed to join in the enterprise. The\n\nthird accused was aware that the first accused was a former CISCO officer. Later, they\n\nleft the Newton Hawker Centre to a pub called Kamasutra for drinks.61 The third accused met the first accused again a week before 8 August\n\n2000 at a coffee shop. The first accused again mentioned the subject of robbery. On this\n\noccasion, the first accused told the third accused that he had just taken a look at a Toto\n\nbooth at Yew Tee MRT Station as one of their targets. The third accused warned him\n\nimmediately that there were many people at the Toto booth and worse still, the booth was\n\nlocated inside the supermarket. Nothing eventful transpired and both of them left the area\n\nthereafter.62 The next occasion they met was on 8 August 2000. The previous night\n\nthe first accused telephoned the third accused and told him to be at West Mall at 10.00am.\n\nand also to inform the second accused to be there. The first accused’s message was\n\nthat he was going to ‘make a lobang’, meaning that he wanted to commit robbery.\n\nThe third accused got in touch with the second accused and told him to be at West Mall at\n\nthe appointed time. The third accused did not however tell the second accused the purpose\n\nof the meeting.63 On the morning of 8 August 2000, after being reminded of the\n\nappointment by the first accused, the third accused met the latter at the entrance of West\n\nMall. The second accused had yet to arrive. The first accused in the meantime took the\n\nthird accused to a cash-on-line booth where the Cabstar van was likely to be parked, a\n\njewellery shop and a moneychanger at the West Mall, telling him that those were the\n\npossible targets. They then sauntered around and eventually seated themselves at the S-11\n\ncoffee shop where they awaited the arrival of the second accused.64 Whilst waiting for the second accused, the first accused opened the\n\nAdidas sports bag that was with with him and took out two sling bags from it. He indicated\n\nthat one of the two bags was for the second accused and the other for the third accused.\n\nThe first accused told him that the bag meant for the third accused contained a bayonet\n\nand a pair of handcuffs, a ski-cap and a pair of gloves. The third accused then opened the\n\nbag to look at its contents.65 About 20 to 30 minutes later, the second accused arrived. The third\n\naccused then pushed the bag which was meant for the second accused towards him. The first\n\naccused then talked about the targets he had shown the third accused earlier. The first\n\naccused also mentioned the target at Jurong East which the first and the third accused had\n\nsurveyed previously. The first accused intimated to the other two that the target for that\n\nday would be the CISCO Cabstar van or the jewellery shop at Jurong East.66 Then their discussion turned towards their escape plan. They all\n\nagreed to secure a getaway vehicle. The second accused suggested stealing an unattended\n\nvehicle from a petrol kiosk, failing which they would hail a taxi and dispossess the\n\ndriver.67 Their search for an unattended vehicle was unsuccessful. Further,\n\nwhen they observed a passing police vehicle they started to panic. At this juncture, the\n\nthird accused noticed that the first and second accused were engaged in a brief\n\nconversation after which the second accused was seen crossing the road and stopping a\n\ntaxi. It was then the first accused told the third accused: ‘Li, you have to finish\n\nthe taxi driver.’ (page 1090 of the NE). The third accused was confused by this\n\nremark. He was wondering whether the first accused was joking or serious. But he did not\n\nseek any clarification from the first accused and remained silent.68 In the event, all of them boarded the taxi. The first accused gave\n\ndirections to the taxi driver to take them to Chestnut Avenue. When they arrived at the\n\nend of Chestnut Avenue, there was a bit of confusion. Presently, the first accused told\n\nthe taxi driver to make a ‘U’ turn. About 200 metres from where the taxi driver\n\nmade the ‘U’ turn, the first accused asked the taxi driver to stop. The second\n\naccused said something to the taxi driver at this stage but the third accused could not\n\nquite make out what it was. At that juncture, the third accused took out the bayonet from\n\nhis bag, unsheathed it and tapped the taxi driver’s left waist in order to make the\n\ntaxi driver get out of the taxi. The taxi driver did not leave the taxi. Instead he said:\n\n‘I pay, I pay.’ Suddenly, the first accused drew out his pistol, cocked it,\n\npointed it at the taxi driver and ordered him to get out.69 In the meantime, the first accused also nudged the third accused\n\nwith his knee, signalling the third accused to get down and prevent the taxi driver from\n\nescaping. The scared taxi driver unfastened his seat belt and alighted from his taxi. The\n\nthird accused was frightened by the developments. He felt that it was unnecessary for the\n\nfirst accused to point the pistol at the taxi driver for after all the third accused had\n\nalready taken out his bayonet.70 The third accused quickly came out of the taxi and held on to the\n\ntaxi driver whilst the second accused came out of the vehicle and occupied the\n\ndriver’s seat. The first accused handed a pair of handcuffs to the third accused and\n\nasked him to handcuff the taxi driver. He also instructed the third accused to take the\n\ntaxi driver into the bushes.71 The third accused followed the instructions and led the taxi driver\n\ninto the bushes about two metres away from the rear of the taxi whilst the first accused\n\nstood on the road holding the pistol in his hand. When the third accused led the taxi\n\ndriver into the bushes, his intention was to tie him up although the first accused did not\n\nprovide him with any rope for that purpose. He thought of handcuffing the taxi driver to a\n\ntree (pages 1102 to 1103 of the NE).72 As the third accused was propelling the taxi driver into the\n\nthicket, the taxi driver tripped and fell into a ditch. The first accused came to the\n\nassistance of the third accused to help pull the taxi driver out of the ditch so that the\n\nthird accused could take him farther into the bushes with the taxi driver. Whilst in the\n\nbushes, the taxi driver tripped and fell again. The third accused asked him to get up. The\n\ntaxi driver replied that he could not get up. Since the third accused could not raise the\n\nfallen taxi driver by himself, he thought of asking the first accused for help.73 The third accused instantly turned around and asked the first\n\naccused to assist him in raising the taxi driver. Instead of coming to his assistance, the\n\nfirst accused pointed his pistol at the third accused and told him to finish the taxi\n\ndriver off (pages 1107 and 1108 of the NE).74 The third accused did not know what to do. He was wondering why the\n\nfirst accused had asked him to kill the taxi driver. He looked at the first accused’s\n\nface. The first accused looked serious. The third accused was afraid that the first\n\naccused would shoot him if he did not comply. In that state of fear, he covered the mouth\n\nof the taxi driver and stabbed him five to six times in the region of his chest.75 At that moment, a motor car passed by. Presently, the first accused,\n\nafter concealing his pistol, shouted to the third accused to be quick and to retrieve the\n\nwallet of the taxi driver. The third accused thereafter pulled out the taxi driver’s\n\nwallet from his front trouser pocket and also removed the handcuffs from the taxi driver.\n\nAnother vehicle passed by whilst he was doing this.76 The taxi driver was motionless when the third accused re-emerged\n\nfrom the bushes. Once outside, he asked the first accused: ‘How is that this thing\n\ncan happen this way?’ (page 1112 of the NE). The first accused’s explanation was\n\nthat the taxi driver had seen his firearm. The third accused asked him why he had taken\n\nout his firearm in the first instance. The answer was that it was because the taxi driver\n\ndid not want to come out of the taxi when asked. The first accused also commented that it\n\nwas the taxi driver’s fate. The third accused was at that stage somewhat fearful of\n\nthe first accused since the latter did not appear to be normal.77 After both of them had re-boarded the taxi, the first accused\n\ninstructed the second accused to drive to Woodlands. During the journey, the third accused\n\nhanded the wallet of the taxi driver to the first accused. After counting the money\n\ninside, the first accused returned all the cash to the third accused whilst retaining the\n\nwallet. The first accused then gave him a bottle of water which was inside the taxi and\n\nasked the third accused to wash the bayonet as well as the third accused’s hands. He\n\ntold the first accused that he had lost the key to the handcuff. The third accused then\n\nannounced to the other two that he had stabbed the taxi driver four to five times and it\n\nwas possible that the taxi driver had ‘gone’ (page 1118 of the NE).78 The third accused claimed that there was altogether $700 in cash in\n\nthe wallet of the taxi driver. Initially, he retained the money but later he gave the\n\nothers $200 each and used the balance to pay for the food and drinks they had consumed\n\nthat day.79 At Woodlands, the first accused instructed the second accused to\n\nclean the taxi of fingerprints. All three later went to survey several money changers\n\nbefore having some Guinness Stout. There was further discussion concerning robbery\n\ntargets. The third accused claimed that he felt confused at that stage and remained quiet\n\nwhen the first accused asked him why the third accused had stabbed the taxi driver. The\n\nthird accused and the first accused had also changed their shirts.80 All three subsequently went to Jurong East. There the first and the\n\nthird accused went to look at the jewellery shops which they had observed earlier on\n\nwhilst the second accused went to rid the taxi of fingerprints. However, they later\n\naborted their plans to rob the jewellery shop as it was noticed that the shop had been\n\nfitted with a closed circuit television camera. The first accused then asked the second\n\nand third accused to have their haircut at a barber shop so that it would not be possible\n\nfor anyone to identify them. Soon they proceeded to a movie theatre to watch a film.\n\nThereafter the second and the third accused returned the bags containing the weapons to\n\nthe first accused and departed for their respective destinations.81 In the main, the testimony of the third accused appeared to be that,\n\nif not for the first accused pointing the pistol at him and instructing him to finish off\n\nthe fallen taxi driver, he would not have stabbed him as he did. His intention at all\n\nrelevant times was merely to restrain the taxi driver by handcuffing him to a tree in the\n\nthicket.",
        "Closing speeches": "82 Substantial and lengthy addresses were made both by the defence and\n\nthe prosecution at the close of the case. Suffice it if I highlighted only the salients in\n\nthe said submissions.",
        "The first accused": "83 As regards the first accused, his counsel submitted that he had no\n\nintention to harm the taxi driver in any way; that intention belonged to the third accused\n\nalone and at any rate the prosecution had failed to prove the requisite ingredients of s\n\n34 (common intention provision) of the Penal Code which formed part of the charge. Insofar\n\nas is material, paras 3, 19, 20 and 68 of counsel’s submission read as follows:Paras 3, 19, 20 and 68 of the submission:3. The Prosecution sought to adduce evidence that:-(1) the three accused persons had a common intention to rob the\n\n    deceased; and/or(2) the three accused persons had a common intention to rob the\n\n    deceased of his taxi; and(3) Rosli murdered the taxi driver in furtherance of that common\n\n    intention.19. From the above it is submitted that there is preponderance of\n\n  evidence that(a) the common intention of the three accused persons was to steal a\n\n    taxi from the taxi driver;(b) there was a common intention to ‘tie-up’ i.e. immobilise\n\n    the taxi driver while the taxi was to be used in a robbery(c) there was no common intention nor discussion to hurt the taxi\n\n    driver(d) Wan had the intention to inform the Police of the whereabouts of\n\n    the taxi driver after the execution of the intended robbery.20. It is further submitted that there was no intention to physically\n\n  harm the taxi driver other than to tie him up. If ever there was any intention to harm the\n\n  taxi driver in any way, that intention was contemplated by and belonged to Rosli, and\n\n  Rosli alone.68. It is humbly submitted that there is a reasonable doubt as to\n\n  whether the necessary ingredients of Section 34 have been satisfied as regards Wan. As\n\n  such we humbly pray that Wan be acquitted.84 Counsel for the first accused suggested that the offence committed\n\nby the first accused on the day in question was only that of robbery of the taxi and if at\n\nall, he could be punished only under ss 392, 394 or 397 of the Penal Code and nothing\n\nelse.",
        "The second accused": "85 The arguments advanced on behalf of the second accused was that the\n\nsecond accused did not share nor did he have the common intention ascribed to him by the\n\nprosecution. Counsel argued that the second accused’s role was to act as a getaway\n\ndriver in the robbery planned for that day and the killing of the taxi driver was never in\n\nthe equation. It was further submitted that he did not know that the third accused was\n\narmed with a bayonet nor was he aware of any plan to cause hurt to the taxi driver; the\n\nplan was merely to tie up the taxi driver in a secluded place, take his taxi and use it as\n\nan escape vehicle after the proposed robbery planned at Jurong East.86 In this connection, the following segments of counsel’s\n\nsubmission are relevant:Paras 8, 9, 19, 25, 32, 33 and 34 of the submission:8. The Second Accused denies that he intended the death of the\n\n  victim, or realised that either the First Accused or the Third Accused would cause his\n\n  death. The Second Accused denies that he knew about the presence of the bayonet or\n\n  realised it would be used in committing robbery of the taxi or to stab the deceased.9. The Second Accused gave evidence that although he joined with the\n\n  First Accused and the Third Accused to commit robbery of the taxi, his role was only to\n\n  drive the getaway vehicle.19. The Second Accused told the deceased to leave the taxi with the\n\n  words \"Uncle, go down\", very polite words, devoid of aggression. It is\n\n  submitted that the words used convey and confirm the Second Accused’s thoughts that\n\n  the deceased was to be safely tied up only, and not hurt or harmed.25. The Second Accused was surprised because so far as he knew the\n\n  deceased was not supposed to die. Had he realised that eventuality he would not even have\n\n  flagged down the taxi along Bukit Batok West Avenue 6.32. The common intention was the pre-arranged plan of the First\n\n  Accused, the Second Accused and the Third Accused to rob the deceased of his taxi.33. Here, the criminal act was the murder by stabbing with a bayonet,\n\n  of the deceased by the Third Accused. For section 34 to apply, it is incumbent for the\n\n  Prosecution to prove that the Third Accused’s intention which was to be imputed to\n\n  the Second Accused (and the First Accused) must not be inconsistent with the carrying out\n\n  of the common intention.34. But for common intention to apply, it is necessary to prove that\n\n  the accused had knowledge of all the essential elements to constitute common intention.\n\n  Here, the Second Accused testified that he did not know that the Third Accused carried or\n\n  was armed with a bayonet. He only became aware of the existence of the bayonet after the\n\n  Third Accused had used it to commit the murder of the deceased:PP v Lee\n\n  Chin Guan[1992] 1 SLR 320at page 327 B-D.35. The testimony of the Second Accused of his absence of the knowledge\n\n  of the bayonet is supported by his Police statements. There is no mention of the bayonet\n\n  in P244 (his oral statement to Senior Staff Sergeant Kamaruzaman). In his long-statement\n\n  P250, the Second Accused gave a detailed account of events. At paragraph 3 thereof (page\n\n  369 of the PI notes) he frankly admitted knowledge of 2 guns : he frankly admitted he knew\n\n  the slingbag given to him at the \"S-11\" restaurant contained a revolver, and\n\n  that the First Accused wore a waist pouch with the pistol. Of the Third Accused’s\n\n  slingbag the Second Accused said :\"I did not know what were the contents in Rosli’s bag but I\n\n    knew it contained some weapons.\"45. The Second Accused did not see what the Third Accused did to the\n\n  deceased in the bushes, nor could he have seen anything from his position in the\n\n  driver’s seat of the taxi, there being vegetation of some height standing between the\n\n  Third Accused/the deceased and the Second Accused.50. Participation in the criminal act is necessary for an accused to be\n\n  liable under section 34 of the Penal Code: PP v Geraldine Andrew[1998] 3 SLR 736. The\n\n  Second Accused cannot be said to have participated in the criminal act if he did not know\n\n  about the presence of the knife before it was used to stab the deceased.51. It is humbly submitted that the Prosecution has failed to prove the\n\n  common intention in respect of the Second Accused and therefore he must be acquitted.",
        "The third accused": "87 The mainstay of counsel’s submission on behalf of the third\n\naccused was that the third accused would not have stabbed the deceased taxi driver if not\n\nfor the sudden intimidating instructions from the first accused to finish off the taxi\n\ndriver whilst a pistol was being pointed at the third accused. His plan, his counsel\n\nsubmitted, was merely to take the taxi driver into the secondary jungle and tie him up.\n\nBut since no rope was made available to him, his intention was to handcuff him to a tree.\n\nCounsel invited the court to accept the evidence of the third accused in court as the\n\ntruth. Counsel however made it explicit that the General Exception defence contemplated\n\nunder s 94 of the Penal Code in relation to acts which a person was compelled to do by\n\nthreats did not apply and was not available to the third accused. Counsel’s arguments\n\ninsofar as material are reproduced below:Paras 18 to 31 and 48 of the submission:18. When the vehicle stopped, Ibrahim told the taxi driver to\n\n  get out from the vehicle. The taxi driver did not. Rosli then tapped the taxi\n\n  driver’s left waist with the bayonet but he refused to come out of the taxi. Instead,\n\n  the taxi driver said \"I pay, I pay\". At this juncture, Wan took out his pistol.\n\n  Rosli watched as Wan cocked the pistol and pointed it at the taxi driver. Wan told the\n\n  taxi driver to get out of the taxi, whilst pointing the pistol at the head of the taxi\n\n  driver. Rosli was not sure from where Wan took out the pistol.19. The taxi driver appeared frightened by this and unfastened his seat\n\n  belt. The taxi driver got out of the taxi.20. Rosli did not expect Wan to use his revolver in that manner. Rosli\n\n  himself was frightened. When the taxi driver alighted from the taxi, Wan used his right\n\n  knee to nudge Rosli’s left knee. Rosli understood this to mean that Rosli was to get\n\n  out of the taxi to restrain the taxi driver. Rosli came out of the taxi and Wan then told\n\n  Rosli to hold on to the taxi driver so that the taxi driver would not run away. Rosli\n\n  approached the driver and Wan told the taxi driver not to run. At this time, Ibrahim had\n\n  already occupied the taxi driver’s seat.21. Rosli held the unsheathed bayonet in his left hand. Wan then handed\n\n  Rosli a pair of handcuffs. Wan instructed Rosli to handcuff the taxi driver which Rosli\n\n  did. Rosli’s evidence was that there was only a plan to tie-up the taxi driver. Wan\n\n  then instructed Rosli to take the taxi driver inside the bushes that was along the side of\n\n  the Chestnut Avenue. Rosli complied with Wan’s instructions as he thought that he was\n\n  to tie-up the taxi driver. Rosli then took the taxi driver to the bushes. Wan did not\n\n  offer any rope or string to tie-up the taxi driver.22. On his own accord, Rosli thought of handcuffing the taxi driver to\n\n  a tree. Rosli lead the taxi driver to the bushes. Rosli saw Wan holding the pistol before\n\n  he crossed the drain that ran along the side of the road.23. While Rosli was crossing the drain, the taxi driver slipped and\n\n  fell into it. As Rosli was pulling the taxi driver from the drain, Wan came towards them\n\n  and assisted Rosli to pull the taxi driver out from the drain.24. Rosli and the taxi driver then proceeded for about 2 to 3 metres\n\n  into the bushes. Wan was at that time between  to 1 metre away from the kerb.25. As Rosli pulled the taxi driver into the bushes, the taxi driver\n\n  fell again. Rosli told him to get up but the taxi driver replied that he could not. Rosli\n\n  decided to ask Wan to help raise the taxi driver as he could not raise him alone.26. As Rosli turned around and called for Wan’s assistance, Wan\n\n  pointed the pistol at Rosli. Wan then told Rosli to \"finish him\". Rosli\n\n  understood Wan to mean that Rosli should \"kill the taxi driver\". Rosli did not\n\n  know what to do and looked at Wan’s face. Wan looked serious and Rosli saw that the\n\n  pistol was now being aimed at Rosli. Rosli was afraid and believed that Wan would shoot\n\n  him.27. In this state of fear, Rosli covered the taxi driver’s mouth\n\n  with his left hand. Rosli again turned to look at Wan. Wan then gestured with his pistol.\n\n  Rosli understood that gesture to mean that Rosli was to \"finish off the taxi\n\n  driver\". Rosli then stabbed the taxi driver 5 or 6 times.28. Rosli believed that he would have been shot by Wan if he did not\n\n  follow Wan instructions to kill the taxi driver. Rosli could only remember that he had\n\n  stabbed the taxi driver in the chest region, as he was not looking at the taxi driver at\n\n  that time. Rosli’s evidence was that he was looking at Wan who was pointing the\n\n  pistol at him. A car passed by and Wan put down his pistol so that the passing car could\n\n  not see what was happening.29. Rosli neither hit, punch nor kick the taxi driver. Wan shouted at\n\n  Rosli to take the wallet from the taxi driver. Rosli followed his instructions and as\n\n  Rosli was taking off the handcuff, a green van passed by. Rosli squatted down. Rosli\n\n  noticed that the taxi driver was already motionless.30. Rosli gave evidence that Wan did not stick to the agreed plan which\n\n  was to tie-up the taxi driver and to use the stolen taxi as a getaway vehicle.31. Rosli insisted that it was never his intention to kill the taxi\n\n  driver.48. Rosli asks that this Court accept his oral testimony in Court as\n\n  the truth. To a question from this Court, Rosli answered:\"I want everyone to know the truth\".",
        "Prosecution": "88 The final speech by the learned DPP was comprehensive and detailed.\n\nIn the main, the learned DPP after making extensive references to the testimonies of all\n\nthree accused urged the court not to give any credence to their repeated claims that their\n\nscheme on that day was merely to tie up the taxi driver and speed off with the stolen taxi\n\nto their main criminal enterprise at Jurong East. The learned DPP urged the court to hold\n\nthat these men would not have - given the fact they were equipped with ski-masks to cover\n\ntheir faces during the proposed armed robbery - allowed the taxi driver who had seen their\n\nfaces in daylight to be around to identify them later. The learned DPP submitted that in\n\nthe circumstances of this case, the irresistible inference was that the killing of the\n\ntaxi driver by the third accused was indeed part of the common intention. Insofar as is\n\nrelevant the following segments of the prosecution submission require reproduction:Paras 100, 102, 103, 104, 105, 106, 127, 128, 137, 138, 139, 140,\n\n  141, 142, 179, 180, 181, 185, 186, 187, 205, 206, 216, 217, 221, 223, 224, 225, 226, 234\n\n  of the submission:100. The three of them set out on 8 Aug 00 on a highly\n\n  dangerous mission: to rob a goldsmith’s shop which was likely to be guarded by CISCO\n\n  officers. They were armed to the teeth and violence was expected. They were out to commit\n\n  2 robberies: the robbery of the taxi-driver of his taxi and then the robbery of the\n\n  goldsmith’s shop. The 1staccused, had, at great risk to himself, smuggled\n\n  a Colt automatic pistol, a Smith & Wesson revolver, and a bayonet, through the\n\n  Woodlands checkpoint as he needed them for the grand robbery he had in mind. He provided\n\n  the weapons to the 2ndand 3rdaccused for their use and they\n\n  readily agreed to it.102. From the evidence adduced, it is clear that all 3 persons had a\n\n  great fear of being identified. This will be dealt with in greater detail later. At this\n\n  stage, the prosecution would emphasise the following:102.1. The taxi-driver had seen the faces of all 3 accused persons.102.2. The taxi-driver had seen the 1staccused brandishing\n\n    a pistol (according to the 3rdaccused, when the 3rdaccused asked\n\n    the 1staccused why the taxi-driver had to die, the 1staccused\n\n    replied that it was because the taxi-driver had seen his firearm)102.3 While the 3rdaccused was in the bushes at Chestnut\n\n    Avenue, 2 vehicles had passed by (with no evidence as to whether the motorists saw their\n\n    faces).102.4 Their subsequent conduct after the killing:i The 3rdaccused removed the handcuffs from the deceased\n\n      after stabbing the taxi-driver as he was afraid that fingerprints may have been left on\n\n      the handcuffs.ii The 1stand 3rdaccused changing T-shirts\n\n      after the killing.iii The 2ndaccused and the 3rdaccused going for\n\n      haircuts after the killing.iv The constant cleaning of the taxi to remove fingerprintsv The plan to use ski-caps when committing the robbery of CISCO\n\n      officers or of the goldsmith’s shop.103. Given the fact that the three accused persons were so afraid of\n\n  being recognised by the motorists that drove by Chestnut Avenue even though there is no\n\n  certainty that the motorists had seen their faces, they must have been positively\n\n  terrified of the fact that the taxi-driver had seen their faces and could identify them.\n\n  If they were afraid of being identified by a passing motorist, they would have been more\n\n  afraid of being picked out at an identification parade by the taxi-driver. The 3rdaccused had only one obvious choice when he led the taxi-driver to the bushes: to finish\n\n  him off.The 1staccused Wan Kamil104. The 1staccused is clearly culpable under section\n\n  34 of the Penal Code for the following reasons:104.1. He had supplied the weapons. In particular, he gave the 2ndaccused a Smith & Wesson revolver and the 3rdaccused a bayonet. He must\n\n    have anticipated that they would be used, otherwise, why did he procure them from Thailand\n\n    and why did he provide them to the other 2 accused persons: see Neoh Bean Chye’s\n\n    case, where the 1staccused provided the 2ndaccused with the\n\n    revolver used in the shooting.104.2. He was the one who chose Chestnut Avenue as the scene for the\n\n    robbery.104.3. He told the 3rdaccused to ‘habis khan’\n\n    or ‘finish off’ the deceased before even boarding the taxi.104.4. He stood guard along the road, holding his pistol to provide\n\n    cover for the 3rdaccused before returning to the taxi.104.5. He gave orders to the 2ndaccused to clean the taxi\n\n    so that they would not leave fingerprints in it.105. The prosecution submits that the account given by the 1staccused vis--vis how they were going to execute the 2ndoption (of robbing a\n\n  taxi-driver of his taxi) is inherently incredible. The 2ndoption would entail:105.1 robbing the taxi-driver of his taxi;105.2. tying the taxi-driver to a suitable tree;105.3. leaving the scene;105.4. staging the robbery at the Boon Lay Gem Store successfully; and105.5. alerting the police to rescue the taxi-driver.106. This sounds comical and ludicrous and cannot be taken seriously by\n\n  this Court.2nd accused127. His defence is two-fold:127.1. That he had no part in the killing and that he did not know that\n\n    the 3rdaccused had intended to kill the driver-driver.127.2. That his role in the robbery of the taxi-driver was that of a\n\n    driver and he had remained in the driver’s seat when the taxi was parked along\n\n    Chestnut Avenue, waiting for the 3rdaccused to return to the taxi.128. The 2ndaccused has attempted to distance himself from\n\n  the killing of the taxi-driver by selectively highlighting certain factors that are\n\n  apparently favourable to him such as the fact that he remained in the taxi when the\n\n  killing occurred. However, it is clear from the caselaw that the totality of the\n\n  circumstances must be taken into consideration when assessing whether the 2ndaccused has the requisite intention. When the evidence is assessedin toto, it\n\n  becomes clear that the 2ndaccused, as the driver, remained in the taxi in\n\n  order to make a quick getaway after the 3rdaccused had dealt with the\n\n  taxi-driver.Further Evidence from the 2ndaccused’s own\n\n  statements:137. The second accused, in his handwritten statement recorded\n\n  on 15 Oct 00 (exhibit P244) at the 2ndparagraph states:\"Isawthe 3rdaccused and Wanpullingthe taxi-driver to the bushes after handcuffing him.\" (emphasis added)138. The 2ndaccused, in his statement recorded on 1 Nov 00\n\n  (exhibit P250 at page 370) at paragraph 7, stated:\"Whilst seated in the driver’s seat, Iturned around and\n\n    sawthe 3rdaccused wasforcingthe taxi-driver to the bushes of\n\n    tall lalang on my left side of the road …\" (emphasis added)139. The 2ndaccused, in his evidence in court denied ever\n\n  seeing this but he could not give any good or reasonable explanation why he mentioned this\n\n  in his statement. His explanation that he was subsequently informed of this still does not\n\n  explain why he said he ‘saw’ the 3rdaccused forcing the taxi-driver\n\n  into the bushes not once but twice. During his evidence in chief, he was asked by his own\n\n  Counsel:Q: Why did you say that you did?A: I do not know why I said.140. There was no reason for the recorder to be putting words in the 2ndaccused’s mouth and forcing him to agree to it. For example, SSgt Karmaruzam, who\n\n  recorded the statement from the 2ndaccused on 15 Oct 00 (P244) also recorded a\n\n  statement from the 3rdaccused on the same day. In the 3rdaccused’s statement (exhibit P243 page 234), it is stated that:\"I did not bother and brought him to the bushes …\"(emphasis added)141. The significance of this is that if SSgt Kamaruzam was simply\n\n  putting words into the 3rdaccused’s mouth and forcing the accused to\n\n  agree to it, he would have, for the 3rdaccused’s statement, inserted the\n\n  word ‘forced’ instead of the word ‘brought’.142. Given that the second accused has failed to give an explanation\n\n  why he said those words in his statements, the only inference is that he did in fact say\n\n  those words to the recorder as that waswhat actually happened.Amazing failure of the 2ndaccused to notice the 3rdaccused brandishing a bayonet.179. One of the most incredible aspects of the 2ndaccused’s evidence was his failure to notice the 3rdaccused’s\n\n  bayonet when he brandished it in the close confines of the taxi and also outside the taxi.\n\n  The undisputed evidence is that the 2ndaccused, seated at the front passenger\n\n  seat, was trying to order the taxi-driver out of the taxi. When the taxi-driver refused to\n\n  get out, the 3rdaccused took out his bayonet and tapped the taxi-driver on his\n\n  left waist with it several times. The 2ndaccused, despite being mere\n\n  centimetres away from the bayonet, claimed that he did not see the bayonet!180. Even after the 3rdaccused had got out of the car and\n\n  held onto the taxi-driver to bring him to the bushes, the 2ndaccused said he\n\n  noticed the 3rdaccused but failed to see his bayonet. In his police\n\n  statements, the 2ndaccused said that he saw the 3rdaccused\n\n  ‘pulling’ and ‘forcing’ the taxi-driver but in court, he changed his\n\n  evidence on this aspect. Bearing in mind what he said in his police statement that the 3rdaccused’s bag contained weapons, it is clear that the 2ndaccused’s\n\n  evidence in Court cannot be believed.181. It is submitted that the 2ndaccused is lying to\n\n  downplay his role and to portray himself as the least culpable of the three of them, in\n\n  that he played no part in the killing. That may well be so on the facts but in law, he is\n\n  still caught by section 34.185. At this juncture, it should be highlighted that the 2ndaccused did in fact admit that he did contemplate that in the robbery of a\n\n  goldsmith’s shop that was to take place after they robbed the taxi-driver, the 1staccused might use firearms if there was resistance.186. What was the qualitative difference between robbing a taxi-driver\n\n  and a goldsmith’s shop that prevented the contemplation of the use of weapons in the\n\n  former? It is submitted that there is none. If the accused persons were prepared to use\n\n  weapons to carry out the robbery of a goldsmith’s shop, it is submitted that they\n\n  must have been equally prepared to use weapons to rob the taxi-driver since obtaining a\n\n  getaway car was an essential prerequisite to the success of the robbery of the\n\n  goldsmith’s shop. It is also reasonable to expect that the taxi-driver, like any\n\n  victim of crime, would resist and that would easily provoke the use of the weapons.187. As such, any defence that the weapons were supposed to have been\n\n  used only in the subsequent robbery and not for the robbery of the taxi-driver should be\n\n  rejected outright. Such a submission would be unsustainable in law.Liability of the 2ndaccused under s.302 r/w s.34205. It is submitted that the second accused is guilty of an\n\n  offence under s.302 r/w s.34 of the Penal Code as:205.1. there was a common intention to commit armed robbery of a\n\n    taxi-driver of his taxi;205.2. the 2ndaccused has satisfied the requirement of\n\n    ‘presence’ and ‘participation’ by:i. flagging down the taxi and boarding it together with the other 2\n\n      accused;ii shortly later, at Chestnut Avenue, instructing the taxi-drive to get\n\n      out of the taxi; andiii by waiting in the taxi as a getaway car driver while the\n\n      taxi-driver was led to the buses by the 3rdaccused;205.3. the killing of the taxi-driver was in furtherance of the common\n\n    intention to commit robbery.206. Furthermore, there was never, at any stage, any objection by the 2ndaccused to the plan and he also did not withdraw from the plan to commit armed robbery.216. The main objective of this exercise was to obtain the taxi as a\n\n  getaway car. In addition, to make sure that the taxi could be used as a getaway car, they\n\n  had to prevent the taxi-driver from raising the alarm. Otherwise, they would obviously not\n\n  be able to use the taxi as the police would be hot on their heels.217. Even if they had initially intended to tie up the taxi-driver,\n\n  such plans are not cast in stone and there may be a change in plans. A simple analogy\n\n  would be the case of a robber armed with a gun together with his unarmed accomplice. Both\n\n  may claim that there was no intention to use the gun, but if the robber armed with the gun\n\n  encounters resistance and shoots and kills the person offering resistance, it clearly\n\n  cannot lie in the mouth of the accomplice to say there was ‘no plan’ to use the\n\n  gun.221. The defence of the 2nd accused seems to be that he did not know\n\n  what happened in the bushes and he was under the impression that the taxi-driver was to be\n\n  tied up and not to be killed. In law, even if this Court believes him, such a defence\n\n  failsin limine. Supposing, after the taxi-driver refused to get out of the taxi on\n\n  the first order by the 2ndaccused and the 3rdaccused had stabbed\n\n  the taxi-driver while all of them were still in the taxi, would the 1stand 2ndaccused not be caught by section 34 of the Penal Code? Alternatively, suppose the 1staccused had shot the taxi-driver inside the taxi after cocking the pistol (because the\n\n  taxi-driver had refused to obey the commands of the 2ndand 3rdaccused to get out of the taxi). Would the 2ndand 3rdaccused not\n\n  be caught by section 34? Of course they would in both instances, because it is clear that\n\n  the killing was in furtherance of the common intention to commit robbery.223. The 3rdaccused’s actions clearly satisfy both themens reaandactus reaselements under section 300(a), (b) or (c) of the\n\n  Penal Code. He has admitted both in court and in his statements that he stabbed the\n\n  taxi-driver with the bayonet in the chest region between 4-5 times. Each of the stab\n\n  wounds was in itself sufficient to cause the death of the taxi-driver.224. The 3rdaccused had unsheathed the bayonet and led the\n\n  handcuffed and defenceless taxi-driver into the bushes like a lamb to the slaughterhouse.\n\n  The poor taxi-driver had pleaded for his life continuously, on at least 3 occasions:a) When the accused persons tried to force him out of the taxi, he\n\n    pleaded with them by offering them money and saying ‘I pay, I pay’;b) When he was pulled by the 3rdaccused into the bushes of\n\n    tall lallang along the road meekly resisting, he had ‘pleaded to me not to harm\n\n    him and said that he has a family’. [the 3rdaccused’s statement,\n\n    P256, paragraph 9 at page 382]; andc) After he had fallen on the ground with one of his legs entangled\n\n    with roots of the lallang on the ground, he ‘was still pleading not to harm him’.\n\n    (P256, same paragraph)Yet, the 3rdaccused ignored the futile pleas of the\n\n  taxi-driver and even told him to shut up. Just before the stabbing, he had covered the\n\n  taxi-driver’s mouth to prevent him from pleading further. Under cross-examination by\n\n  the prosecution, the 3rdaccused testified that ‘The taxi-driver keep\n\n  talking to me not to do anything andagain and again, so I close his mouth to prevent\n\n  him from talking’. He then went on to kill the taxi-driver 4 times over.225. After the stabbing, the 3rdaccused went further and\n\n  took the dead taxi-driver’s wallet from the trousers pocket and even had the presence\n\n  of mind to remove the handcuffs as he was afraid that his fingerprints would be left on\n\n  them. He then emerged from the bushes with the bloodstained bayonet and handcuffs.\n\n  Together with the 1staccused, they proceeded to the taxi where the 2ndaccused was waiting at the wheel, ready to make the getaway from the scene of crime. The 3rdaccused then announced to the others that he had stabbed the taxi-driver and that he\n\n  thought the taxi-driver had died.226. In light of his conduct and the extreme cruelty that he displayed\n\n  to the taxi-driver moments before his death, the statement made by him to the police under\n\n  the provisions of section 122(6) of the CPC that \"… I have no intention to kill\n\n  him or to cause his death\" is ludicrous.234. It is respectfully submitted that the prosecution has proven\n\n  beyond a reasonable doubt that the three accused persons committed the offence in\n\n  circumstances which amount to murder under section 302 read with section 34 of the Penal\n\n  Code. We urge this Honourable Court to convict all three accused persons as charged.",
        "Conclusion": "89 The primary facts that (a) the three accused tricked the taxi driver\n\nto take them to a desolate spot along Chestnut Avenue; (b) there in that place, one\n\namongst them namely the third accused stabbed him several times; and (c) the hapless\n\nvictim died as a result of the wounds suffered by him were not in dispute. What was put in\n\nissue was in relation to their common intention. The charge of murder on which they were\n\nbeing tried necessarily hinged on a finding by the court whether such a common intention\n\ncould be attributed to all three of them. In this, reference must first be made to s 34 of\n\nthe Penal Code which was an integral ingredient of the charge. The section reads:When a criminal act is done by several persons, in furtherance of the\n\n  common intention of all, each of such persons is liable for that act in the same manner as\n\n  if the act were done by him alone.90 This section, as stated by the learned authors of Ratanlal (see\n\nRatanlal and Dhirajlal’s Law of Crimes, 23rdEdn, Vol 1, page 85) lays\n\ndown a principle of joint liability in the doing of a criminal act. The essence of that\n\nliability is to be found in the existence of common intention animating the accused\n\nleading to the doing of a criminal act in furtherance of such intention (Mahbub Shah\n\nv Emperor(1945) 47 Bom LR 941). It deals with the doing of separate acts, similar\n\nor diverse, by several persons; if all are done in furtherance of common intention, each\n\nperson is liable for the result of them all as if he had done them himself; ‘that\n\nact’ and ‘the act’ in the latter part of the section must include the whole\n\naction covered by a ‘criminal act’ in the first part, because they refer to it (Barendra\n\nKumar Ghoshv EmperorAIR 1925 PC 1).91 The most celebrated exposition on this subject which is frequently\n\nquoted and oft-repeated is contained in the advice of Sir Madhavan Nair inMahbub\n\nShah(supra) at page 943. It reads:Attention has already been drawn to the words of the section. As it\n\n  originally stood, the section was in the following terms :-\"When a criminal act is done by several persons, each of such\n\n    persons is liable for that act in the same manner as if the act was done by him\n\n    alone.\"In 1870, it was amended by the insertion of the words \"in\n\n  furtherance of the common intention of all\" after the word \"persons\" and\n\n  before the word \"each\" so as to make the object of the section clear. Section 34\n\n  lays down a principle of joint liability in the doing of a criminal act. The section does\n\n  not say \"the common intentions of all\" nor does it say \"an intention common\n\n  to all.\" Under the section, the essence of that liability is to be found in the\n\n  existence of a common intention animating the accused leading to the doing of a criminal\n\n  act in furtherance of such intention. To invoke the aid of s. 34 successfully, it must be\n\n  shown that the criminal act complained against was done by one of the accused persons in\n\n  the furtherance of the common intention of all; if this is shown, then liability for the\n\n  crime may be imposed on any one of the persons in the same manner as if the act were done\n\n  by him alone. This being the principle, it is clear to their Lordships that common\n\n  intention within the meaning of the section implies a pre-arranged plan, and to convict\n\n  the accused of an offence applying the section it should be proved that the criminal act\n\n  was done in concert pursuant to the pre-arranged plan. As has been often observed, it is\n\n  difficult if not impossible to procure direct evidence to prove the intention of an\n\n  individual; in most cases it has to be inferred from his act or conduct or other relevant\n\n  circumstances of the case.92 The subject came up for discussion in another Indian case ofBashir\n\nv State of Allahabad(1953) AIR All 668 at 671 where the court (per Desai J)\n\nobserved:(13) What is meant by \"common intention\" is the\n\n  \"community of purpose\" or \"common design\" or \"common\n\n  intent\". Section 34 lays down a principle of Common Law and it has been pointed out\n\n  by Lord Sumner in the case ofBarendra Kumar Ghosh v EmperorAIR 1925 PC 1\n\n  (C) (ubi supra), at page 8 that the Indian Penal Code must not be assumed to have sought\n\n  to introduce differences from the prior law and it must not be suppposed that, because it\n\n  ceases to use the terms \"principal in the first degree\" and \"principal in\n\n  the second degree\" it does not intend to provide for the ideas which those terms,\n\n  however imperfectly expressed. Therefore it will not be wrong to interpret the words\n\n  \"common intention\" to mean \"community of purpose\", \"common\n\n  design\" or \"common enterprise\" which are the words used in the English\n\n  Common Law. In – ‘Mahboob Shah (sic) v. Emperor’, AIR 1945 PC 118 (D),\n\n  \"common intention\" was held to imply a \"pre-arranged plan\". This does\n\n  not mean either that there should be confabulation, discussion and agreement in writing or\n\n  by word, nor that the plan should be arranged for a considerable time before the doing of\n\n  the criminal act. The Judicial Committee in the ‘case of Mahboob Shah (sic)\n\n  (D)’, did not lay down that a certain interval should elapse between the formation of\n\n  a pre-arranged plan and the doing of the criminal act and did not negative the formation\n\n  of a pre-arranged plan just a moment before the doing of the criminal act. …93 Another principle to be borne in mind is that before any accused can\n\nbe convicted of an offence read with s 34, the court must arrive at a finding as to which\n\nof the accused took what part, if any, in furtherance of the common intention. A\n\nconviction without such a finding would be illegal (seeFazoo Khan v Jatoo KhanAIR (1931) Cal 643)94 The law as to common intention came up for discussion before the\n\nSingapore Court of Criminal Appeal on several occasions. InMimi Wong & Anor v\n\nPublic Prosecutor[1972] 2 MLJ 75as well as inPublic Prosecutor v Neoh\n\nBean Chye & Anor[1975] 1 MLJ 3, the Court of Criminal Appeal affirmed the\n\nprinciples articulated inMahbub Shahas well asBarendra Kumar Ghosh.95 InMimi Wong, Wee Chong Jin CJ delivering the opinion\n\nof the appellate court, rejected a contention by the second accused (who did not inflict\n\nthe fatal blow but played a role in throwing toilet cleansing liquid into the eyes of the\n\nvictim just as the first accused was about to stab the victim) that s 34 could only be\n\napplied if the common intention of the persons accused of an offence was to commit the\n\noffence with which they were charged, and said:… The Privy Council inMahboob Shah(sic)v.\n\n  Emperorsaid this of section 34:\"Section 34 lays down a principle of joint liability in the doing\n\n  of a criminal act. The section does not say ‘the common intentions of all’ nor\n\n  does it say ‘an intention common to all’. Under the section, the essence of that\n\n  liability is to be found in the existence of a common intention animating the accused\n\n  leading to the doing of a criminal act in furtherance of such intention. To invoke the aid\n\n  of section 34 successfully, it must be shown that the criminal act complained against was\n\n  done by one of the accused persons in the furtherance of the common intention of all. If\n\n  this is shown, then liability for the crime may be imposed on any one of the persons in\n\n  the same manner as if the act were done by him alone\".In an earlier case,Barendra Kumar Ghoshv.Emperorthe\n\n  Privy Council said:\"Section 34 deals with the doing of separate acts, similar or\n\n  diverse, by several persons; if all are done in furtherance of a common intention, each\n\n  person is liable for the result of them all, as if he had done them himself, for\n\n  ‘that act’ and ‘the act’ in the latter part of the section must\n\n  include the whole action covered by ‘a criminal act’ in the first part because\n\n  they refer to it:…In other words, ‘a criminal act’ means that unity of criminal\n\n  behaviour, which results in something for which an individual would be punishable if it\n\n  were done by himself alone, that is a criminal offence.\"It is clear from the Privy Council’s interpretation of the words\n\n  \"criminal act\" that it is the result of a criminal act which is a criminal\n\n  offence. It then remains, in any particular case, to find out the actual offence\n\n  constituted by the \"criminal act.\" If the nature of the offence depends on a\n\n  particular intention the intention of the actual doer of the criminal act has to be\n\n  considered. What this intention is will decide the offence committed by him and then\n\n  section 34 applies to make the others vicariously or collectively liable for the same\n\n  offence. The intention that is an ingredient of the offence constituted by the criminal\n\n  act is the intention of the actual doer and must be distinguished from the common\n\n  intention of the doer and his confederates. It may be identical with the common intention\n\n  or it may not. Where it is not identical with the common intention, it must nevertheless\n\n  be consistent with the carrying out of the common intention, otherwise the criminal act\n\n  done by the actual doer wold not be in furtherance of the common intention. …96 InNeoh Bean Chye, the facts as could be gathered from\n\nthe headnotes of the case were as follows.97 The first accused Neoh, and the second accused Lim, were jointly\n\ntried for murder in furtherance of a common intetnion. Lim carried a loaded revolver and\n\nboth accused entered a ‘wine shop’ in order to rob the proprietor. When the\n\nproprietor was about to close the shop, they attempted to rob him, but when he resisted,\n\nLim shot him and both accused ran out. When Neoh was arrested and charged with the murder\n\nof the proprietor, he made a cautioned statement to the police and another statement to a\n\nmagistrate. When Lim was arrested and charged some months later, he also made a cautioned\n\nstatement to the police. The accused were separately represented by counsel at the trial.\n\nThe second accused Lim contended (a) that a separate trial was desirable as Neoh had\n\nblamed him for the proprietor’s death in his earlier statements and he would\n\ntherefore be prejudiced and embarassed in his defence; (b) that his own statement to a\n\npolice inspector was inadmissible because Neoh’s cautioned statement had not been\n\nfurnished to him before his own statement was taken from him, but only some time\n\nafterwards and accordingly there had been a breach of rule 9 of Schedule E of the Criminal\n\nProcedure Code; and (c) that his gun had gone off accidentally during a struggle with the\n\ndeceased proprietor. The first accused Neoh contended (a) that there was no case to answer\n\nat the end of the prosecution case as there was no evidence of a common intention to cause\n\nthe death of the proprietor; and (b) that the proprietor’s death was in any event\n\naccidental.98 Counsel for Neoh referred to the court the headnotes ofR v\n\nVincent Banka & Anor[1936] V MLJ 66, a decision by the Straits Settlements\n\nCourt of Criminal Appeal, and argued that Neoh could not be found guilty of murder unless\n\nthe prosecution proved that there was common intention on the part of both accused to\n\ncommit murder. InVincent Banka, the headnotes said that ‘[before] a\n\njury can find an accused person guilty of murder by reason of the provisions of s 34 of\n\nthe Penal Code, they must be satisfied on the evidence thatthere existed between the\n\nparticipants a common intention to not only rob but also to kill the deceased.\n\n[Emphasis added]99 Choor Singh J who tried the case together with D’Cotta J in the\n\nfirst instance, gave short shrift to the foregoing argument. In rejecting it, he observed:In our judgment the head note of the report of the decision inRexv.Vincent Banka and anotherdoes not contain a correct statement of the law. In a\n\n  criminal prosecution where section 34 of the Penal Code is invoked, it is not incumbent on\n\n  the prosecution to prove that there existed between the participants a common intention to\n\n  commit the crime actually committed. For section 34 to apply it is sufficient if the\n\n  prosecution prove that there was in existence a common intention between all the persons\n\n  who committed the criminal act and that the act which constituted the offence charged was\n\n  done in furtherance of that common intention. This is clear from the decisions of the\n\n  Privy Council inBarendra Kumar Ghoshv.Emperor, andMahboob Shah(sic)\n\n  v.Emperor, and also from the recent decision of the Court of Criminal Appeal of\n\n  Singapore inMimi Wong and anotherv.Public Prosecutor.100 The Court of Criminal Appeal upheld the decision of the High Court\n\nand Wee Chong Jin CJ delivering the judgment of the appeal court said that the trial\n\njudges were plainly justified in finding the appellant guilty of murder under s 302 read\n\nwith section 34 of the Penal Code.101 Both inMimi WongandNeoh Bean Chye,\n\nthe Singapore Courts have unambiguously approved the principles enunciated inBarendra\n\nKumar Ghosh. An important segment in the judgment of the Singapore Court of\n\nCriminal Appeal inMimi Wongmaking reference toBarendra Kumar Ghoshhighlights the principle that ‘s 34 deals with the doing of separate acts, similar\n\nor diverse, by several persons; if all are done in furtherance of a common intention, each\n\nperson is liable for the result of them all, as if had done them himself, for ‘that\n\nact’ and the ‘act’ in the latter part of the section must include the whole\n\naction covered by a ‘criminal act’ in the first part, because they refer to it’\n\n(seeMimi Wong(supra) at page 79C-D, left column andBarendra\n\nKumar GhoshAIR 1925 PC 1).102 The learning on the common intention provisions of the Penal Code\n\nis legion. I need however refer to a few other decisions of the Singapore Court of Appeal.103 InLim Heng Soon & Anor v Public Prosecutor[1970] 1 MLJ 166at 170E-I, (right column) the Federal Court, Criminal Appeal from\n\nSingapore (per Wee Chong Jin CJ) approved a direction given by the trial judge to the jury\n\nin relation to common intention in the following terms:…every person who participatesin the commission of the\n\n  criminal actwould be liableas if he [had] committed the act all by himself,irrespective\n\n  of the fact he had only played a small rolein the commission of the act. [Emphasis\n\n  added]104 InToo Yin Sheong v Public Prosecutor[1999] 1 SLR 682, the Court of Appeal at page 693-I re-affirmed what was stated by Wee Chong Jin CJ inLim\n\nHeng Soon(supra). InShaiful Edham bin Adam & Anor v Public\n\nProsecutor(Criminal Appeal No 13 of 1998 at para 61) the Court of Appeal\n\nemphasised the aspect that passive participation by one accused would suffice to satisfy\n\nthe requirements of s 34 of the Penal Code. InToo Yin Sheongthe Court of\n\nAppeal also re-affirmed (see p 694, para 37) what was stated by Mookerjee J inKing-\n\nEmperor v Barendra Kumar Ghos[e](sic)(AIR 1924 Cal 257 at 280), as\n\nfollows:It is the expectation of aid, in case it is necessary to thecompletion of the crime and the belief that his associate is near and\n\n  ready to render it, which encourage and embolden the chief perpetrator, and incite him to\n\n  accomplish the act. By the countenance and assistance which the accomplice thus renders,\n\n  he participates in the commission of the offence.It is therefore sufficient to hold a party as principal, if it is made\n\n  to appear that he acted with another in pursuance of a common design; that he operated at\n\n  one and the same time for fulfilment of the same pre-concerted end, and was so situated as\n\n  to be able to furnish aid to his associates with a view to insure success in the\n\n  accomplishment of the common enterprise.105 InPublic Prosecutor v Gerardine Andrew[1998] 3 SLR 736, the Court of Appeal re-affirmed what was stated by the Privy Council inBarendra\n\nKumar Ghoshthat before a person could be made liable under s 34, there had to be\n\nphysical presence at the actual commission of the offence. However, physical presence did\n\nnot require the offender to be at the exact spot where the crime was committed. It would\n\nbe useful at this stage to refer to what Yong Pung How CJ observed at page 752 of the\n\ndecision. He said:36 The question whether an accused person must be physically present at\n\n  the actual commission of the offence is therefore answered in the affirmative. The next\n\n  question which arises for this appeal is whether Gerardine was physically present for the\n\n  purposes of s 34 when the stabbing took place. The requirement here is physical presence\n\n  at the actual commission of the offence, not physical presence at the immediate site when\n\n  the commision of the offence occurred. InBarendra Kumar Ghosh v EmperorAIR 1925\n\n  PC 1, a post-master was shot and killed inside a post office. The accused said that he was\n\n  outside the post-office at the time of the shooting.Lord Sumner in delivering the\n\n  judgment of the court observed at p 6, ‘Even if the appellant did nothing as he stood\n\n  outside the door, it is to be remembered that in crimes as in other things \"they also\n\n  serve who only stand and wait’ \". It was also noted by Bose J inShreekantiah\n\n  Ramayya Munipalli v State of BombayAIR 1955 SC 287 that an accused need not be\n\n  present in the actual room. He can, for instance, stand guard by a gate outside ready to\n\n  warn his companions about any approach of danger or wait in a car on a nearby road ready\n\n  to facilitate their escape. What is crucial is that he must be physically present at the\n\n  scene of the occurrence and must actually participate in the commission of the offence in\n\n  some way or other at the time the crime is actually committed. …[Emphasis added]106 So much for an overview of the law and reasoning relating to s 34\n\nof the Penal Code. Returning to the contentions before the court, it is proposed to deal\n\nwith the role and actions of thethird accusedfirst for he was the one who led the\n\ntaxi driver into the bushes and stabbed him several times and caused his death.",
        "Third accused": "107 The third accused had admitted both in his statements and in court\n\nthat he was the man who plunged the bayonet a number of times into the chest of his\n\nhandcuffed quarry. It was clear from his statements (in particular para 9 of exh P-256,\n\npage 382 of the PI notes) that despite the pleas and entreaties of the taxi driver not to\n\ncause him harm and his further doleful declaration that he had a family, the third accused\n\nstill mercilessly stabbed the victim.108 Forensic evidence on which there was no dispute had further\n\nconclusively established that each stab wound inflicted on the taxi driver was by itself\n\nsufficient to cause his death.109 Section 300 of the Penal Code insofar as relevant reads:300. Except in the cases hereinafter excepted culpable homicide is\n\n  murder –(a) if the act by which the death is caused is done with the intention\n\n    of causing death;(b) if it is done with the intention of causing such bodily injury as\n\n    the offender knows to be likely to cause the death of the person to whom the harm is\n\n    caused;(c) if it is done with the intention of causing bodily injury to any\n\n    person, and the bodily injury intended to be inflicted is sufficient in the ordinary\n\n    course of nature to cause death; or(d) if the person committing the act knows that it is so imminently\n\n    dangerous that it must in all probability cause death, or such bodily injury as is likely\n\n    to cause death, and commits such act without any excuse for incurring the risk of causing\n\n    death, or such injury as aforesaid.110 In my view, the first accused’s acts in stabbing a completely\n\nhelpless and beseeching victim fell in all fours with either limb (a), (b) or (c) of s\n\n300. The actions of the accused clearly in my mind satisfied both themens reaandactus\n\nreuselements in the said section. The accused’s perfunctory explanation in his s\n\n122(6) statement that he had no intention to kill the taxi driver or cause his death was\n\nfound by me to be void of any substance.111 In the course of his testimony, the third accused obliquely\n\nattempted to raise the defence of duress. He claimed that whilst he was looking to the\n\nfirst accused for assistance to help lift the taxi driver who tripped and fell in the\n\nbushes, the first accused raised his pistol, pointed it at the third accused and in a\n\nmanner commanded him to ‘finish off’ the taxi driver. He implied that if not for\n\nsuch a life-threatening sign from the first accused, he would not have stabbed the taxi\n\ndriver for at all times his intention was merely to tie up the taxi driver and at that\n\ntime to handcuff him to a tree in the thicket.112 In my determination, if his claim that he stabbed the victim\n\nbecause of a vile threat by the first accused, this would have most certainly featured in\n\nhis statements. Further, if what he did was indeed upon threat of violence to his life, he\n\nwould not have, in my view, gone about searching for the victim’s wallet and\n\nrecovering it from the victim’s trouser pocket, after he had stabbed him. Still\n\nfurther, his reaction when he re-entered the taxi would be one of disgust, frustration and\n\nrevulsion and not one of quietitude and silence. In my finding, his story that he\n\ncommitted the act under threat and duress did not appear to have any semblance of truth.113 In any event, the defence of duress which the third accused was\n\ntrying to set up was no defence to the charge of murder. Section 94 of the Penal Code\n\nprovides:94. Except murder and offences against the State punishable with death,\n\n  nothing is an offence which is done by a person who is compelled to do it by threats,\n\n  which, at the time of doing it, reasonably cause the apprehension that instant death to\n\n  that person will otherwise be the consequence:Provided that the person doing the act did not of his own accord, or\n\n  from a reasonable apprehension of harm to himself short of instant death, place himself in\n\n  the situation by which he became subject to such constraint.Explanation1. – A person who, of his own accord, or by\n\n  reason of a threat being beaten, joins gang-robbers knowing their character, is not\n\n  entitled to the benefit of this exception on the ground of his having been compelled by\n\n  his associates to do anything that is an offence by law.Explanation 2. – A person seized by gang-robbers, and forced by\n\n  threat of instant death to do a thing which is an offence by law – for example, a\n\n  smith compelled to take his tools and to force the door of a house for the gang-robbers to\n\n  enter and plunder it – is entitled to the benefit of this exception.114 InKillikyatara Bomma & Others v Emperor(1913)\n\n14 Cr L J 207 (Madras), the Madras High Court held that a person who by threat of death\n\nwas induced to do an act in order to facilitate the commission of a murder, could not\n\nclaim the benefit of s 94 of the Penal Code.115 It would not be necessary for me to delve further into the law of\n\nduress for in my view I found the claim of the first accused that he stabbed the victim\n\nfour to five times in his chest because of an impending danger to his life or person to be\n\nnothing but a hoax, conceived belatedly to escape the consequences of his mindless and\n\ncruel deeds. He was found by me to be spinning tales and distorting facts as to what made\n\nhim commit the heinous acts admitted to have been committed by him.116 He claimed that he was an unwilling entrant to the robbery scheme.\n\nHe said that when the first accused tried to get him involved with his robbery plans, he\n\ninitially remained silent but he caved in only after a chillingly veiled intimidation as\n\nto what could befall the third accused if he did not join in the robbery plan and the\n\nmention of a possible booty of about 5 million dollars dangled by the first accused.117 The third accused’s account that he never entertained any\n\nthought to cause any bodily injury to the taxi driver was in my view an improbable story.\n\nIf he, as he said, was a reluctant recruit to the robbery scheme and that the plan as\n\nrespects the taxi driver was merely to tie him up in the bushes, would he not have halted\n\nin his tracks and either rebuked or counseled the first accused, when the latter\n\nreportedly surprised him with an inexplicable and cruel instruction to finish off the taxi\n\ndriver, a few moments before he and the first accused were about to board the taxi hailed\n\nby the second accused that day. In my view, he was trying to distance himself from the\n\nhorrible and mindless crime committed by him.118 In my determination, the suggestion by the third accused that he\n\nhad little choice but to finish off the fallen driver because there was an imminent threat\n\nof harm to his life from the first accused, was a belated fabrication concocted to evade\n\nthe consequences of his mindless and cruel deed committed by him on 8 August 2000.",
        "First accused": "119 Let me next deal with the defence of the first accused. The first\n\naccused’s defence was one of denial. He claimed that the killing of the taxi driver\n\nwas never in the scheme of things. He said that their plan when they opted to seize a taxi\n\nfrom its driver was merely to restrain him in a secluded spot; use the taxi and once the\n\nrobbery was over, inform the police of the whereabouts of the taxi driver. He further\n\naverred that initially he was unwilling to go to Chestnut Avenue but gave directions to\n\nproceed there only when he encountered some cold and disapproving looks from his\n\ncompanions.120 He denied ever having mentioned to the third accused to finish off\n\nthe taxi driver either before they boarded the taxi or whilst at Chestnut Avenue. He\n\nclaimed that he was totally unaware of what in fact the third accused did to the taxi\n\ndriver inside the bushes. He claimed that he was seated inside the taxi and only when he\n\nsaw an oncoming car, he wound down the window of the taxi and shouted to the third accused\n\nto hurry up. He heard some crying voices from inside the bushes and a little later learnt\n\nfrom the third accused that the taxi driver had been stabbed.121 Notwithstanding the aspect that the account narrated by the first\n\naccused that the third accused threatened him with the pistol when instructing him to\n\nfinish off the taxi driver lacked substantiation, I still found the story of the first\n\naccused that he was in fact inside the taxi when the third accused hurt the taxi driver in\n\nthe bushes, to be unworthy of belief. The first accused’s evidence in this regard, in\n\nexamination-in-chief, was at variance with what he had said in cross-examination. In\n\nexamination-in-chief his evidence was that after the third accused and the taxi driver had\n\ngone into the bushes after jumping over a drain, he went and sat inside the taxi. He then\n\nsaw an oncoming car. Then he heard a sound ‘crying in pain’. He then shouted to\n\nthe third accused to hurry up. But during cross-examination, his story was different. He\n\nsaid when cross-examined that whilst he was standing next to the taxi, he saw an oncoming\n\ncar. He then went and sat inside the taxi. He wound the window down (he demonstrated to\n\ncourt how he wound down the windows by using his hands and showing a rotating movement)\n\nand shouted to the third accused to hurry up. He then heard the cry of pain from the\n\nbushes after he had shouted.122 Although the details as to sequence can blur from one’s memory\n\nafter a few months, the lack of consistency was not the only feature to belie his claims.\n\nThe taxi in question, the court was shown with reference to the photographs produced, did\n\nnot have a manual handle to lower the windows. The taxi in fact was proven to have power\n\nwindows.123 In my evaluation, the first accused was endeavouring in vain to\n\ndistance himself from the murder committed by the third accused. He did not want to admit\n\nthat he was either standing guard, rendering assistance or watching the third accused\n\nmercilessly stabbing the victim for obvious reasons. His claim that he was inside the taxi\n\nwhen the cruel felling of the taxi driver was being carried out by the third accused was\n\nalso dashed by the evidence of the second accused who said that the first accused was some\n\ndistance behind the taxi for sometime and that both the first accused and the third\n\naccused re-entered the taxi at about the same time – albeit the first accused stepped\n\ninto the taxi first - before they left Chestnut Avenue for Woodlands. In my finding, the\n\nfirst accused was deliberately being untruthful as regards his location when the third\n\naccused stabbed the taxi driver.124 The other aspect I must mention is in regard to his claim that he\n\nwas reluctant initially to take the taxi driver to Chestnut Avenue. He claimed that he was\n\nin a way bulldozed into it by the cold and disapproving looks of the other two. This story\n\nagain was found by me to be an improbable one. First of all, this claim went against his\n\nown claim that the plan was to take the taxi driver to a secluded spot to tie him up. If\n\nso, what difference would it have made to the other two whether the taxi-driver was taken\n\nto Woodlands or Chestnut Avenue to be tied up. Why would the others give a displeased look\n\nwhen the first accused mentioned Woodlands and withdraw their disapproval when he changed\n\nthe direction to Chestnut Avenue, when it was common ground the other two were not at all\n\nfamiliar with the Chestnut Avenue area?125 In fact, if the first accused’s claim was true, why did it not\n\nfeature in his lengthy voluntary statements. Its absence in those statements led me to\n\nconclude that the claim by the first accused was also an untruth.126 As can be gathered from his own testimony, the first accused was\n\nthe architect of the entire evil enterprise planned for the 8 August 2000. He was the\n\nmaster-mind and purveyor of the deadly weapons. In order to commit robberies, that too in\n\npublic places and in broad daylight, he had taken pains to secure firearms from Thailand.\n\nHe was the one who had pre-packed the bags of weapons and caused them to be handed over to\n\nthe other two hoods. He was prepared and geared to confront even the armed CISCO details\n\nand for which purpose he enlisted the help of the second accused to be the getaway driver.\n\nYet he tried to portray himself to the court as a person of care, concern and extreme\n\npublic-spiritedness and wanted the court to believe that he would have called the police\n\nto inform them of the whereabouts of the restrained taxi driver once they had completed\n\nthe robbery planned for that day. In my finding, his explanations were nothing but\n\nuntruths and as submitted by the prosecution, made out to escape liability for his\n\ncowardly acts.127 More would be said in relation to the defence of the first accused\n\nafter the defence raised by the second accused had been dealt with.",
        "Second accused": "128 The defence of the second accused was that he had no part in the\n\nkilling of the taxi driver; he did not know that the third accused intended to kill the\n\nvictim; he did not know that the third accused was armed with a bayonet or knife; and his\n\nrole in the robbery of the taxi driver was to act as a driver of the vehicle and nothing\n\nmore.129 He claimed that he was paying very little attention to what the\n\nfirst and the third accused did after both of them left the taxi with the driver. His\n\nstory was that whilst he was in the driver’s seat he could only recall seeing, that\n\ntoo for a fleeting few moments, the third accused taking the taxi driver into the bushes\n\nwhilst the first accused was standing some distance away (about 14 to 15 ft) from the rear\n\nof the taxi with pistol in his hand and apart from that nothing significant happened until\n\nthe first and third accused re-entered the taxi (see page 907 of the NE). He was\n\nremarkably evasive about what he heard when the third accused and the taxi driver were\n\ninside the bush (see page 988 to 989 of the NE).130 There was, in my evaluation, a clear attempt on his part to\n\ndissociate himself from the harm done to the taxi driver. He wanted the court to believe\n\nthat he was somewhat a greenhorn who would never entertain even a thought of shooting\n\nanyone with his firearm even during the robbery planned to be carried out in Jurong East.\n\nHe seemed to suggest that his firearm was just a showpiece and in the event of any fracas,\n\nhe would simply take to his heels (page 928 of the NE). I found him to be entirely\n\nunpersuasive.131 He was also found by me to be prevaricating on numerous occasions\n\nin the course of his testimony. His statements to the police admitted in evidence as being\n\nmade voluntarily plainly contradicted his evidence in court, as could be seen from the\n\nfollowing.132 The second accused in his handwritten statement recorded on 15\n\nOctober 2000 (exh P-244) at para 2:Isawthe third accused and Wanpullingthe taxi-driver\n\n  to the bushes after handcuffing him. [Emphasis added]133 Later, the second accused in his statement recorded on 1 November\n\n2000 (exh P-250 at page 370) at para 7 stated:Whilst seated in the driver’s seat, Iturned around and sawthe third accused wasforcingthe taxi-driver to the bushes of tall lalang on my\n\n  left side of the road … [Emphasis added]134 However, the second accused in his evidence in court denied ever\n\nseeing such incidents and could not come up with any reasonable explanation as to why he\n\nmentioned such matters in his statements.135 The following segment as appears at pages 812 to 814 of his\n\ntestimony would illustrate an attempt on his part at prevarication:His Honour: The only point I want you to clarify in this statement is\n\n  this. You look at this statement, somewhere in the middle, (reads), \"I asked the taxi\n\n  driver to get out and the taxi. When he alighted I took over the driver seat.\" Can\n\n  you see it?Witness: Yes.His Honour: After that you said, \"I saw Rosli and Wan pulling the\n\n  taxi driver to the bushes.\"Witness: Yes.His Honour: Is that correct?Witness: Yes.His Honour: You saw both of them pulling the taxi-driver?Witness: No, this is after the incident, then I know they actually go\n\n  into the bushes.His Honour: Just a moment.Witness: It’s actually after the incident, then I know that they\n\n  actually go into the bushes.His Honour: I don’t understand you?Witness: It’s because they told me after the incident happened\n\n  that what is actually happening. Then I know that it’s exactly that they are going\n\n  into the bushes.His Honour: No, here you say, \"I saw Rosli and Wan pulling the\n\n  taxi driver to the bushes.\" You say, \"I saw Rosli and Wan pulling the taxi\n\n  driver to the bushes.\"Witness: Yah.His Honour: Did you see?Witness: I only see what they are standing there, but I didn’t\n\n  actually see they go into the bushes, your Honour.His Honour: No, did you see both of them pulling the taxi driver?Witness: No, your Honour.His Honour: Then you say, \"Rosli brought the taxi driver inside\n\n  the bushes and Wan just stood outside.\"Witness: Yes.His Honour: Is it right?Witness: Yes, it’s right, is that---that is what I really what I\n\n  saw and the first sentence is what I really heard what they are doing.Mr Lee: OK.Q You said in your statement, \"I saw Rosli and Wan pulling the\n\n  taxi driver to the bushes after handcuffing him.\"A Yes.Q Now, can you clarify one more time. In the sentence I just read, you\n\n  said, \"I saw Rosli and Wan\"?A Maybe I say the wrong word, but it’s actually after the whole\n\n  story then I make this statement---then I just give a rough statement.Q You said after the incident you learnt this, that Rosli and Wan\n\n  pulled the taxi driver into the bushes?A Yes.Q Where did you learn this from?A After somebody conversation after the incident.Q Conversation with who?A With Rosli.Q Anyone else?A No.Q And what did Rosli tell you.A He said actually Wan needs to help him when the taxi driver fall.Q You said Rosli told you, Wan helped Rosli when the taxi driver was\n\n  falling?A Yes.Q Did you learn what was Wan helping him about.A He told me that the driver fall to the drain.Q And what happened?136 One other aspect that attracted the attention of the court was his\n\nclaim that all of them that day intended to rob the taxi driver only of his taxi and use\n\nit for the purpose of the planned robbery later at Jurong East. However in his handwritten\n\nstatement (exh P-244), the second accused had this to say:In Aug 2000, I went toJurong East coffee shop(corrected by the\n\n  2ndaccused at the trial to read as the S11 coffee shop at Bukit Batok) to meet\n\n  Rosli and Wan. During the meeting, we thought of committing robbery since we do not (sic)\n\n  have income. Initially, weagreed to rob individual but if we fail we intend (sic) to\n\n  rob [a] taxi driver… [Emphasis added].137 From the foregoing admission, it could be clearly deduced that\n\nthere was also a plan on that day by all of them even to rob an individual. Consequently,\n\nthe claim by the second accused as well as the others that their intention was only to rob\n\nthe taxi driver of his taxi, tie him up in a deserted spot and use his taxi and that the\n\nretrieval of the taxi driver’s wallet was just an afterthought by the third accused\n\nand was not part of the plan, was found by me to be yet another lie. In my finding, the\n\nsecond accused was there not only to act as a passive driver but also to play out whatever\n\nrole required of him in the commission of every offence to be carried out for that day. In\n\nmy determination, the second accused’s claim that he was an unwitting knave who never\n\nentertained any thought of harm or hurt anyone, let alone the taxi driver, was not worthy\n\nof any credit.138 Another incredible facet in the testimony of the second accused was\n\nhis total ignorance about the third accused’s bayonet although the third accused\n\nbrandished it in the close confines of the taxi as well as outside the taxi. The\n\nundisputed evidence was that the second accused who was seated at the front passenger seat\n\nwas trying to order the taxi-driver out of the taxi and when the taxi driver declined to\n\ndismount, the third accused took out his bayonet and tapped the taxi driver on his left\n\nwaist or shoulder with it. Yet the second accused, albeit being only inches away from the\n\ntaxi driver as well as from the menacing bayonet, did not see the bayonet himself.139 Even after the third accused had alighted from the vehicle and held\n\nonto the taxi driver to lead him into the bushes, the second accused claimed that he was\n\nnot aware of the third accused’s bayonet. In his police statements, the second\n\naccused said that he saw the third accused ‘pulling’ and ‘forcing’ the\n\ntaxi driver but in court he changed his evidence on this aspect. In my finding he was not\n\nstating the truth in court. In any event there was an admission on his part in one of his\n\nstatements (exh P-250, para 3) that he knew that the bag carried by the second accused\n\ncontained weapons.140 In my finding, the second accused’s claim that he was just a\n\npawn in the grand game plan of the other two, was void of substance.141 Having set out my findings and evaluations on the roles played by\n\nthe three accused persons in the offence, let me now return to the issue of common\n\nintention. The law as pronounced inBarendra Kumar Ghoshand approved inNeoh\n\nBean Chye(supra) is well settled in that ‘s 34 deals with the doing\n\nof separate acts, similar or diverse by several persons; if all are done in furtherance of\n\na common intention, each person is liable for the result of them all, …’142 The Singapore Court of Appeal re-affirmed inToo Yin Sheongthat for s 34, every person who participates in the commission of that criminal act would\n\nbe liable as if he had committed that act all by himself, irrespective of the fact that he\n\nmight have only played a small role in the commission of the act. The said case also\n\nseemed to regard the subsequent conduct of the accused persons and their lack of remorse\n\nafter the commission of the offence as an indicia to infer common intention.143 It is also now well settled that although common intention implied\n\na pre-arranged plan and acting in concert, it would however be difficult, if not\n\nimpossible to procure direct evidence to prove the intention of the individual and in most\n\ncases it had to be inferred from the act, conduct and the relevant circumstances of the\n\ncase (seeMahbub Shah,supra).144 Above all, it was also approved inToo Yin Sheongthat it was not incumbent upon the prosecution to show that the common intention of the\n\naccused was to commit the crime for which he was charged, for it was the intention of the\n\ndoer of the criminal offence charged that was in issue (see[1999] 1 SLR 692, paras 28 to\n\n30).145 Returning to the facts of the present case, the third accused was\n\nfound by me to be demonstrably wicked. He was the one who cold-bloodedly plunged the\n\ndeadly bayonet into the chest area of the luckless taxi driver. Such an action on his part\n\nis a clear proof of his intention to snuff out the life of the taxi driver. He was\n\nsquarely caught within all fours of the limbs (a), (b) and (c) of s 300 of the Penal Code.146 As regards the first accused, he was found by me to be a consummate\n\nprevaricator. A former Cisco man who guided all of them to the secluded Chestnut Avenue\n\narea and supplied the very bayonet which the third accused used to cause the death of the\n\ntaxi driver could not now be heard to say that he did not think nor know that the third\n\naccused would stab the taxi driver with that bayonet. He was in my view fully responsible,\n\nvicariously or otherwise for the dastardly act of the third accused on that day. Whilst\n\nthere was no corroboration as to his alleged utterance to the third accused to finish off\n\nthe taxi driver, in my finding he was indeed standing close to the bushes, witnessing the\n\ndaylight killing of a defenceless taxi driver.147 As respects the second accused, his protestations of innocence, in\n\nmy finding, were nothing but a conceived ploy. He was neither naive nor a serving boy as\n\nhe portrayed himself to be in court. His steeliness could be inferred from his dismissive\n\nremark at the first meeting with the first accused when he proclaimed: forget the whole\n\nthing if the robbery was going to be planned with only knives. In my finding he was in the\n\nthick of the plot to rob the taxi driver not only of his taxi but also of his monies. The\n\nfact he and his companions shared the cash taken from the taxi driver’s wallet\n\nfurther reinforced my view that he was equally a hard-hearted brigand whose object on that\n\nday was to partake not only in all aspects of whatever robberies planned but also for the\n\nensuing violence regardless of the consequences. His claim that he did not see the bayonet\n\nthe third accused was holding when he led the taxi driver into the bushes was nothing but\n\npure falsehood.148 In my determination, the three thugs who were out to enrich\n\nthemselves that day at the expense of others were not out for a light-hearted frolic but\n\nfor armed robbery regardless of victims or consequences. The fact they were prepared to\n\neven confront and deal with the armed CISCO personnel, was a clear indication of their\n\nmental make-up and that they were doubtless ready for any ensuing blood bath in their\n\nencounters that day.149 Inured to violence, consumed by greed and plainly indifferent to\n\nconsequences, these three unfeeling thugs united in a common purpose and design snuffed\n\nout the life of a chanceless victim whose misfortune was to be plying around Bukit Batok\n\nand meeting these wicked men on that fateful day. These three tried their best to pass the\n\npoisoned chalice from one to the other. Their gambit however did not succeed. The defence\n\nof each one that there was no plan to hurt the taxi driver but the intention was only to\n\nrestrain him in the bushes was rejected by me as being improbable and untrue.150 The common intention of the three accused persons to rob the taxi\n\ndriver of his taxi was not disputed by the defence. Reviewing all the evidence, in my\n\ndetermination, the compelling inference was that there was clearly a common intention by\n\nall three of them not only to rob the taxi driver of his taxi but also his monies and in\n\nthat process to put the taxi driver away for good so that he would not be around to tell\n\nthe police what happened and eventually identify them.151 In my finding, the prosecution had proven its case against all the\n\naccused beyond a reasonable doubt and that the accused persons had not established their\n\ndefence on balance of probabilities. In the circumstances, I found all three of them\n\nguilty as charged, convicted them and imposed the mandatory sentence for murder.Sgd:MPH RUBINJudgeCopyright © Government of Singapore."
    }
}