{
    "case_title": "Mopi Pte Ltd v Central Mercantile Corporation (S) Ltd",
    "ncitation": "[2001] SGHC 328",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1. This case revolved around the issue of whether it was the plaintiffs or the\n\ndefendants who were the first to use theHi-Bond(hereinafter referred to asHi-Bond)\n\ntrademark/mark. In the course of the lengthy trial (12 days) involving no less than 13 witnesses,\n\nnumerous exhibits were tendered to court by the parties as proof of the products each side sold,\n\nbearing the mark. As its name implies,Hi-Bondwas/is used on products which require high\n\nbonding qualities. These products include tapes such as masking, foam, bakery, filament, cellulose,\n\nOPP and double-sided tapes as well as glues and sealants.",
        "The background": "2. Mopi Pte Ltd (the plaintiffs) are a local company incorporated on 1 August\n\n1978; they were previously a partnership under the name Mopi Engineering, which was registered in or\n\nabout 1974; one of its founder partners was a gentleman called Dua Beng. The plaintiffs' business\n\n(according to information filed with the Registry of Companies [ROC]) is general and wholesale\n\ntrading and commission agencies; they market a wide range of tapes to industrial as well as retail,\n\nusers. The plaintiffs have an authorised capital of $2m and a paid-up capital of $447,000. The\n\nplaintiffs' managing-director Lim Yew Hin (LYH) used to be the general manager and later, a director\n\nof Central Mercantile Corporation (S) Ltd (the defendants) from October 1974 until July 1997; he\n\nsaid he resigned due to differences with the management. The defendants however contended he was\n\nsummarily dismissed.3. After leaving the defendants, LYH joined the plaintiffs; he is now their\n\nshareholder and director (with his wife Poon Choon Yoke) as well as managing-director (since early\n\n1998), taking over from Dua Beng. According to current records of the ROC, the other shareholders of\n\nthe plaintiffs are Ling Yew Teck (brother of LYH), a Malaysian company Mopi (M) Sdn Bhd, Mopi\n\nHolding Pte Ltd (MHP) and Mew Jin Seng (Mew), a good friend and former superior of LYH. MHP is the\n\nbiggest shareholder of the plaintiffs holding 337,000 shares equivalent to 75.4%. MHP is a company\n\nin which LYH and his wife are directors as well as shareholders, along with Dua Beng. Its paid-up\n\ncapital is $86,000 against an authorised capital of $100,000. Dua Beng holds 50% of the shares while\n\nLYH and his wife hold the other 50%. Based on their shareholdings in MHP, LYH and his wife would own\n\nhalf () or 168,500 shares, of MHP's interest (337,000 shares) in the plaintiffs or 37.7% thereof.\n\nDua Beng left the plaintiffs on 28 March 1998.4. The plaintiffs do not manufacture what they sell. They contract-manufacture\n\ntheir products from suppliers in the United States, Canada, Taiwan and Malaysia. One Taiwanese\n\ncompany Achem Technology Corporation has apparently been manufacturingHi-Bondtapes for the\n\nplaintiffs since 1991 (N/E 5). According to his written testimony (para 28), LYH claimed the\n\nplaintiffs' sales volume forHi-Bondproducts exceeded $5.6m between 1997-99, of which 60%\n\nwas for adhesives.5. The defendants were incorporated much earlier than the plaintiffs namely, on\n\n14 July 1969, under its former name Supremacy Industries Limited; it changed to its present name in\n\nApril 1974. They are a wholly owned subsidiary of WTK Holdings Bhd (formerly known as Samanda\n\nHoldings Bhd) a Malaysian company listed on the Kuala Lumpur Stock Exchange. At the time when LYH\n\nwas with the defendants, Mew was also a director of the defendants. Currently, the directors of the\n\ncompany are two (2) East Malaysians and Chan Yoke Mooi @ Connie Lim (Connie Lim) . Connie Lim first\n\njoined the defendants as its company secretary in 1988 and rose through the ranks to become its\n\nexecutive director in June 1997, shortly before LYH left.6. The defendants' principal activity is similar to the plaintiffs; they market\n\nand sell adhesive tapes under various trademarks includingHi-Bond, Nikko, Kawasaki, Senisui,\n\nStarandJupiteretc. They also sell sealants and packaging materials for industrial use\n\nsuch as pallet stretch film, polyprophylene straps, air bubble packs, corrugated paper and\n\nwaterproof paper. According to Connie Lim, the company averaged an annual turnover of $20m over the\n\npast five (5) years of which $12m was from packaging materials, including tapes. The defendants have\n\nan authorised capital of $10m with a paid-up capital of $4m. In terms of size and turnover, the\n\ndefendants are a far bigger company than the plaintiffs.7. Like the plaintiffs, the defendants also contract-manufacture their products\n\nfrom specialist manufacturers in Malaysia, Taiwan, Korea, Philippines, Canada, United States or\n\nItaly. Two (2) of their biggest contract-manufacturers are Malaysian companies Loytape Industries\n\nSdn Bhd (Loytape) and Central Industrial Corporation Bhd (CIC). The products contract-manufactured\n\nby Loytape for the defendants were/are OPP tapes under theHi-Bondbrand. The defendants did\n\nnot/do not contract manufacture glues or sealants. Loytape was a sister company of the defendants\n\nwhen both belonged to the Samanda/WTK group. Presently, the defendants are the sole agents in\n\nSingapore for Loytape's products including adhesive tapes marketed under theLoytapebrand.\n\nWhere they do not contract-manufacture, the defendants would buy products from third parties for\n\nsale to their own customers.",
        "The facts": "8. According to LYH, the first trademark the plaintiffs applied on its products\n\nwasHi-Bond. Later, the plaintiffs expanded their range of products to include usage ofHunterandMopitrademarks. LYH claimed that the plaintiffs' sales of glues, sealants and PTFE (pipe\n\nsealing) tapes with theHi-Bondmark was so successful that the company decided to expand its\n\nuse to other products. In the event, the plaintiffs usedHi-Bondon super-glue, silicone\n\nsealant, acrylic sealant, hydro-bloc sealant, liquid gasket, wood glue, masking tape, OPP tape,\n\ndouble-sided tissue tape, double-sided foam tape, colour hard PVC tape, filament tape and PVC\n\nprotection tape. Colour photographs of the plaintiffs' main products (not exhaustive) were exhibited\n\nin the affidavit evidence of LHY (inLYH-7) and samples of their various products were also\n\nproduced in court (as examples seeP1-16, P19, P21 and P24).9. Based on the plaintiffs' records of trademark applications, LYH said the\n\nplaintiffs had applied for registration of theHi-Bondmark as far back as 5 February 1979\n\n(see PB3) but he did not know the outcome. On 12 February 1979, the plaintiffs obtained a\n\nregistration in respect of the mark no. T79/79096B. The representation of the registered mark came\n\nwith the wordMopiagainst a diamond shape dark background as shown in figure A of the\n\nannexure herein. After 1980, the mark was changed to a simpler pictorial representation with only\n\nthe wordHi-Bondand without the wordMopi.LYH explained the change was necessitated\n\nby wholesalers who complained that the wordMopiin the mark may lead customers to buy direct\n\nfrom the plaintiffs, particularly for 20gms super-glue, thereby bypassing them. Between 1980 and\n\n1988, theHi-Bondmark was used mostly on glues. After 1990, the plaintiffs added theHi-Bondmark to masking, OPP, filament, double-sided, tissue, foam and PVC protection, tapes.10. Due to an oversight, the plaintiffs omitted to renew theMopi Hi-Bondmark under registration no. T79/79096B upon its expiry (after 10 years) on 12 February 1986. Even\n\nso, LYH asserted that the plaintiffs were the originators and proprietors of theHi-Bondmark\n\nnotwithstanding the expiry of its registration. This was to be contrasted with the defendants who\n\nfirst applied for registration of theHi-Bondmark only in 1996. Between 1987 and 1999, the\n\nplaintiffs filed no less than 15 trademark applications all relating toHi-Bond. Between 1980\n\nand 1997, the plaintiffs spent increasing amounts on advertising theHi-Bondmark in the\n\nYellow Pages and other publications.11. In the late 1970s, LYH and the sales team of the plaintiffs thought it would\n\nbe beneficial for the company to sell itsHi-Bondproducts to the defendants. With Dua Beng's\n\nagreement, the plaintiffs sold glues, sealants and PTFE tapes to the defendants to both parties'\n\nmutual advantage.12. Sometime in 1987, the defendants proposed that they contract-manufactureHi-Bondmasking and OPP tapes for the plaintiffs in Malaysia. As this would be cheaper for the\n\nplaintiffs than having the products contract-manufactured by their sources in Canada and Taiwan, the\n\nplaintiffs agreed.Hi-Bondmasking tapes were therefore manufactured by CIC while OPP tapes\n\nwere produced by Loytape. However, or so the plaintiffs claimed, it was a condition of the\n\narrangement that CIC and Loytape could only manufacture for the plaintiffs, not sell the products in\n\nSingapore either directly or through the defendants. Because of the then cordial relationship and\n\ntrust which existed between the parties, the agreement was never put into writing. The plaintiffs'\n\nversion of this event was disputed by the defendants; I shall set out their version later.13. In late 1988, the defendants faced increasingly stiff competition from other\n\nmarket players for adhesive tapes. Accordingly, after meeting with and obtaining feedback from,\n\nsales staff of the plaintiffs and defendants who soldHi-Bondproducts (which included the\n\ndefendants' sales supervisor Ling Yew Teck and their marketing manager Tan Teck Lian (Allan Tan),\n\nthe plaintiffs/Dua Beng agreed that the defendants would be allowed to use theHi-Bondmark\n\non masking tapes, on the following understanding:(i) the plaintiffs' sales staff would sell the masking tapes to hardware and\n\n  paint shops as well as to industrial outlets;(ii) the defendants' sales staff would concentrate on sales to stationery\n\n  shops, industrial outlets and paint shops not serviced by the plaintiffs;(iii) neither company would compete for the same customers/shops.(iv) the plaintiffs had the right to terminate the arrangement at any time and\n\n  the defendants would then have to stop using theHi-Bondmark.LYH produced a letter from the plaintiffs dated 18 June 1997 (addressedTo\n\nwhom it may concern) signed by Dua Beng to support this evidence. He also referred to the\n\nplaintiffs' letter dated 25 July 1997 to CIC signed by Dua Beng. However, Dua Beng gave different\n\nversions of how he came to sign the letters (2) when he testified.14. LYH further claimed that because of the then cordial relationship between the\n\nplaintiffs and the defendants, the plaintiffs/Dua Beng did not ask the defendants/him to pay any\n\nroyalties for the use of theHi-Bondmark. Neither was the arrangement evidenced in writing.\n\nTo reciprocate the plaintiffs' goodwill, the defendants allowed the former to manufacture products\n\nunder such brands asKawasaki, StarandSenisui. LYH claimed credit for devising these\n\nthree (3) trademarks as well asApollo, ClipperandNikko,for the defendants. He\n\nclaimed it was also understood that either party was entitled to source forHi-Bondproducts\n\nfrom whichever contract-manufacturer could provide the cheapest prices, with the result that\n\nsometimes the plaintiffs bought from the defendants and at other times, the position was reversed.\n\nAccording to LYH, due to the close relationship between the parties, the plaintiffs even obtained\n\ninput from the defendants when design changes were made over the years to the pictorial\n\nrepresentation of the wordHi-Bond.15. After LYH's resignation from the defendants, the close relationship between\n\nthe parties ceased. The plaintiffs wanted the defendants to stop using theHi-Bondmark and\n\nwanted CIC to stop manufacturingHi-Bondmasking tapes. LYH even telephoned Allan Tan of the\n\ndefendants in this regard. Instead of acceding to the plaintiffs' request, CIC (through its\n\nSingapore solicitors) asserted ownership of theHi-Bondmark by a letter dated 19 February\n\n2000 to the plaintiffs. LYH alleged that the defendants even copied the plaintiffs' accordion\n\npackaging for masking tapes after he left the company.16. In an earlier letter dated 3 February 2000 to the defendants' solicitors, the\n\nplaintiffs had asserted ownership of theSenisuitrademark. By their solicitors' letter dated\n\n15 August 2000 however, the defendants required the plaintiffs to cease and desist from acts of\n\npassing-off in respect ofSenisui;the plaintiffs did not comply. The defendants also\n\ndiscovered at some stage that the plaintiffs had offered for sale in their product brochure adhesive\n\ntapes bearing a mark similar to theStarbrand. Again, they wrote to the plaintiffs through\n\ntheir solicitors to cease and desist such acts of infringement; the plaintiffs did not comply.",
        "The litigation": "17. In 1999, the plaintiffs instructed their solicitors to engage private\n\ninvestigators to make trap purchases ofHi-Bondproducts from the defendants. Trap purchases\n\nof the defendants'Hi-Bondmasking and double-sided tapes were indeed made, which the\n\nplaintiffs claimed were almost identical to the plaintiffs' equivalent products (save for slight\n\ndifferences in packaging). The plaintiffs alleged this caused confusion in the market although the\n\nquality of the defendants' products was inconsistent, leading to complaints from end-users. As a\n\nconsequence, the plaintiffs had to exchange the defendants' products for their own at the\n\nplaintiffs' expense. It also led to the plaintiffs having to undercut the defendants' prices. The\n\noutcome of this was, that the plaintiffs lost many trusted customers.18. On their part, the defendants also despatched private investigators to the\n\nplaintiffs' premises on 28 June 2000 to make trap purchases ofHi-Bondadhesive tapes and\n\nsealants. On 12 July 2000, the defendants' private investigators purchasedNikkoadhesive\n\ntapes and glue from the plaintiffs' premises which were not manufactured by/for the defendants. The\n\ndefendants' private investigators made similar trap purchases from the plaintiffs ofKawasakiadhesive tapes on 20 July 2000.",
        "The pleadings": "19. In August 2000, the plaintiffs commenced these proceedings. In their\n\nstatement of claim they asserted they had acquired substantial reputation and goodwill in theHi-Bondtrademark due to the following factors:a. they had continuously and extensively used the wordsHi-Bondin the\n\n  course of their business since 1978 (originally the year was stated to be 1974) on a whole range\n\n  of products;b. they had spent substantial sums in advertising and promoting theHi-Bondbrand since 1978;c. their sales volume for the last three (3) years bearing theHi-Bondmark totalled about $5m in Singapore and $600,000 in Malaysia;d. they were the registered owner of trademark TM B/79096 in class 1 in respect\n\n  of theHi-Bondmark which had since expired but they had applied since 1979 for\n\n  registration of the mark again.20. The plaintiffs alleged in or about 1990 they contracted CIC and the\n\ndefendants to manufactureHi-Bondmasking tapes in Malaysia for delivery to the defendants\n\n(as CIC's distributor) in Singapore for supply to the plaintiffs, which arrangement was terminated\n\nin July 1991. They alleged that in or about mid-1998, they discovered that the defendants were\n\npassing off their products as the plaintiffs'Hi-Bondproducts. The plaintiffs prayed inter\n\nalia, for an injunction and an inquiry as to damages against the defendants.21. The defendants raised a multi-pronged attack in their (lengthy re-amended)\n\ndefence and counterclaim, they:-a. denied that the plaintiffs were the first users of theHi-Bondmark\n\n  and asserted the defendants are the lawful proprietors of the trademark in Singapore having used\n\n  and continued to use the same, since 1987 in respect of adhesives tapes of all kinds/uses;b. alleged the plaintiffs had wrongfully appropriated theHi-Bondmark\n\n  from the defendants and used it on adhesive tapes long after the defendants' first use, without\n\n  the defendants' knowledge or consent, due to LYH's unique situation of being employed by the\n\n  defendants before he joined the plaintiffs;c. alleged that in the 22 years he was managing-director of the defendants, LYH\n\n  directly or indirectly controlled the plaintiffs and then MHP, from 1990 onwards;d. contended that LYH well knew the defendants' ownership and profitable use of\n\n  theHi-Bondtrademark for adhesive tapes and without informing the defendants, appropriated\n\n  the mark for the plaintiffs whilst at the same time purchasingHi-Bondadhesive tapes from\n\n  the defendants;e. alleged the plaintiffs' purchases from the defendants was a pretext to show\n\n  that the plaintiffs dealt inHi-Bondadhesive tapes while at the same time procuringHi-Bondadhesives tapes from other unauthorised sources. Most of the adhesives tapes sold by the\n\n  plaintiffs prior to July 1997 were obtained from the defendants;f. alleged that when the defendants discovered his breach of fiduciary duties,\n\n  LYH's services were terminated in July 1997;g. contended that the plaintiffs' alleged registration and pending\n\n  registration, of theHi-Bondtrademark, were wrongful misappropriation of the defendants'Hi-Bondtrademark facilitated by LYH in breach of his fiduciary duties and without the knowledge of the\n\n  defendants;h. averred that subsequent to the dismissal of LYH, the defendants had filed\n\n  various applications to register not onlyHi-Bond(in classes 1, 16 and 17) but also their\n\n  other trademarks such asNikko, Star, SenisuiandKawasaki;i. pointed out that contract-manufacture by CIC ofHi-Bondadhesives\n\n  tapes for the defendants, was consistent with the defendants' proprietorship of theHi-Bondmark;j. pointed out that the plaintiffs' letter dated 25 July 1997 to CIC was never\n\n  sent to the defendants and in any case contained untruths and misrepresentations;k. averred that the plaintiffs were guilty of delay, laches and acquiescence\n\n   the defendants had manufactured and sold adhesive tapes bearing theHi-Bondmark for\n\n  over 13 years; this fact was well-known to the plaintiffs but they failed to take action, even\n\n  after LYH had joined them for 3 years.22. Not content with contesting the plaintiffs' claim, the defendants took the\n\noffensive and filed a counterclaim against the plaintiffs alleging that the latter had passed off\n\ntheir adhesive tapes as the defendants'Hi-Bondadhesive tapes. The defendants further\n\nalleged that the plaintiffs had passed off in the course of trade their adhesive tapes as that of\n\nthe defendants' which were identical to or closely resembled the marksNikko, Kawasaki, Senisui.They\n\nalleged that the plaintiffshad also infringed their registered trademarkStarin\n\nrespect of adhesive tapes by offering for sale in the course of trade, adhesive tapes bearing a mark\n\nsimilar toStar. Further, the plaintiffs had applied (on 5 November 1997) to register a\n\ntrademark identical to theStarmark, thereby manifesting an intention to infringe.\n\nConsequently, the defendants counter-claimed against the plaintiffs inter alia, for a permanent\n\ninjunction to restrain the plaintiffs from infringing/passing off adhesive tapes for those under the\n\nfour (4) trademarks abovementioned.23. In the (re-amended) Reply and Defence to the Counterclaim, the plaintiffs not\n\nonly denied they had passed off their products as those under the marksNikkoandKawasakibut went further to say they, not the defendants, were the originators and proprietors of theNikkomark for glues and, they had manufactured and soldKawasakiadhesive tapes for the past ten\n\n(10) years, with the defendants' knowledge. The plaintiffs admitted they had applied for\n\nregistration of the marksSenisuiandStarin class 16 .24. On the first day of this trial however, the court was informed that the\n\nparties had resolved amicably, part of the defendants' counterclaim. By consent, judgment was\n\nentered on 14 February 2001 for the defendants and a permanent injunction was granted against the\n\nplaintiffs, for the trademarksNikko, Kawasaki, SenisuiandStar, prohibiting the\n\nplaintiffs from passing off, manufacturing, purchasing etc adhesive tapes bearing those marks. In\n\nthe course of the trial (N/E 87), the defendants on their part conceded that they had obtained\n\nsupplies ofHi-Bondglue and sealants from the plaintiffs (after they had re-amended the\n\nDefence and Counterclaim).",
        "The evidence": "(i) the plaintiffs' case25. The key/first witness for the plaintiffs was LYH whose testimony was also\n\nlengthy, due partly to the fact that he needed to be recalled after Dua Beng had testified. The\n\nplaintiffs' version of events as set out in the preceding paras 2 to 15 was largely gleaned from the\n\nwritten testimony of LYH.26. When cross-examined, the following evidence was adduced from LYH:-a. the plaintiffs had moved several times from its first location at Upper\n\n  Serangoon Road as follows:(i) 31, Marshall Road (1980);(ii) Block 6001, Bedok Industrial Park C (1983);(iii) 80, Playfair Road #02-18 (1987);(iv) 145, Ubi Avenue 4 (1994);(v) 223, Ubi Avenue 4 (1997);b. the plaintiffs' application (signed by Dua Beng) for registration of theHi-Bondmark in 1979 (see PB3) stated their address as at 80, Playfair Road when they only moved there in\n\n  1987; the application also showed two addresses for the Registry of Trademarks (the Registry), one\n\n  at Colombo Court and the other at Tanglin Road; the Registry moved from Tanglin Road to Colombo\n\n  Court only in 1987. LYH claimed he found the application as it appeared in the plaintiffs' file\n\n  and did not notice these discrepancies;c. the plaintiffs' application to registerHi-Bondon 28 October 1987\n\n  also signed by Dua Beng again showed the above two addresses of the Registry and yet, a day later,\n\n  the Registry had written to the plaintiffs from its Colombo Court address, crossing out its\n\n  Tanglin Road address;d. he claimed that the plaintiffs never usedMopi Hi-Bondmark after\n\n  1988, yet LYH produced an invoice from Leonie Trading Company dated 9 March 1992 (AB1367) billing\n\n  the plaintiffs $100 for printing 1,000 pieces of stickers for:Mopi Hi-Bond rapid bonding adhesive Net Weight 20gms Made\n\n    in Japan;e. the plaintiffs could not produce documents to evidence sales of glues\n\n  bearingMopi Hi-Bondmark between 1979-80 because, it wastoo long ago, the plaintiffs\n\n  moved too many times(N/E 19). Neither did the plaintiffs have evidence of sales ofHi-Bondglues between 1980-88;f. the Yellow Pages advertisements of the plaintiffs showed no advertisements\n\n  forHi-Bondglue (save for super and epoxy glue) from 1980 to 1997 but LYH claimed the mark\n\n  was used on the plaintiffs' glue; he explained it was because the plaintiffs' main customers were\n\n  not consumers but factories (but no invoices were produced in support thereof);g. the plaintiffs usedHi-Bondmark on 1-2 types of sealants between\n\n  1979-88 but there were no advertisements of those sealants nor invoices of such sales (save for\n\n  exhibitP29, a supplier's invoice for silicone sealant from Commercial Supplies (Far East)\n\n  Pte Ltd dated 22 January 1988 for which counsel asked for but LYH could not produce, the original\n\n  nor could he explain why he could not);h. the plaintiffs first used theHi-Bondmark on acrylic sealants\n\n  sometime between 1981-88 but it was not advertised nor documented in invoices from suppliers or\n\n  customersi. the plaintiffs' first use ofHi-Bondmark on adhesive tapes was in\n\n  1986; between 1978-86 the plaintiffs sold other brands of those tapes (including those obtained\n\n  from the defendants); the pictorial mark had by then changed to a rectangular shape with the wordsHi-Bondinside similar to the plaintiffs' Yellow Page advertisement for 1989 (see AB808) as\n\n  shown in figure B of the annexure.j. in 1986 the plaintiffs sold masking tapes obtained from Canada and OPP tapes\n\n  produced in Taiwan, both with theHi-Bondmark; the mark was also used on PTFE tapes but,\n\n  there was no documentary evidence to support such supplies or sales;k. when the plaintiffs' file copy of PB3 was produced in court (para 9supra),\n\n  it was fairly obvious that the month had been altered from December to February 1979 by deleting\n\n  the numeral '1'in front of the '2' for the middle number '12' representing\n\n  December; this was to give the impression that the plaintiffs applied for registration of theHi-Bondmark inFebruaryinstead ofDecember1979; LYH disclaimed all knowledge of the\n\n  tampering (N/E 46);l. the currentHi-Bondmark used by the plaintiffs is that shown in\n\n  figure C of the annexure (which the parties referred to as the specialHi-Bondmark) but it\n\n  has never been used on PTFE tapes;m. it would take 1-2 years to establish a famous brand and 3-4 years to\n\n  establish a lesser known brand;n. from 1988 to 1997 (until he left the defendants), the plaintiffs bought\n\n  masking but not OPP, tapes from the defendants;o. the plaintiffs' agreement in 1987 to allow the defendants to use theHi-Bondmark was in exchange for the defendants' consent to allow the plaintiffs to use theStarmark;p. pressed who else in the defendants knew of the oral agreement in 1987, LYH\n\n  could only venture a guess that Mew and Allan Tan (the marketing manager) should be aware;q. as to why the plaintiffs consented to judgment for infringement of theStartrademark, LYH explained it was because he felt that he should stop using the defendants' brands\n\n  as the plaintiffs had decided to stop the defendants' usage of theHi -Bondmark;r. he acknowledged that the plaintiffs did not (in their Reply and Defence to\n\n  the Counterclaim) plead that they had the defendants' permission to useStarand three (3)\n\n  other trademarks on which the defendants counter-sued;s. admitted that the plaintiffs had requested an Indonesian contract\n\n  manufacturer (PT Nachindo Tape Industry) to produceHunterandClippertapes\n\n  although the plaintiffs do not own these trademarks;t. the plaintiffs were also sued by and paid $100,000 to, CIC as compensation\n\n  for infringing theApollotrademark and fined (in 1990) for counterfeitingApollomasking tapes. LYH claimed (N/E 87) that the plaintiffs bought the counterfeit tapes in the open\n\n  marketfrom a young lady(a Malaysian)who was inexperiencedand asserted the\n\n  plaintiffs did not contract-manufactureApollotapes (N/E 264) until, he was confronted\n\n  with the plaintiffs' purchase order to PT Nachindo Tape Industry dated 22 April 1999 (see SAB 916)\n\n  for 4 types ofApolloinsulating tapes; LYH then changed his evidence to say he meant the\n\n  plaintiffs did not contract-manufactureApollomasking tapes.27. Other important facts which emerged from LYH's testimony were:-a. Dua Beng allegedly left the plaintiffs under a cloud -- he had taken away\n\n  lucrative agencies for his/his relatives' companies;b. LYH was a consultant of the plaintiffs between 1979-1998, for which he was\n\n  paid a transport allowance;c. he denied drafting a letter for the plaintiffs dated 25 July 1997 (P36)\n\n  for Dua Beng's signature addressed to CIC requesting the latter to stop manufacturingHi-Bondbrand products without the plaintiffs' consent; he did not know why it was not copied to the\n\n  defendants. He explained it was not addressed to the defendants because he had a bad relationship\n\n  with Connie Lim; however, he did telephone the defendants' Allan Tan in August 1997 to request\n\n  that the defendants cease using theHi-Bondmark. Although there was no response to the\n\n  plaintiffs' letter, he did not follow-up with either CIC or the defendants and took no action\n\n  against either company because the plaintiffs were then in financial difficulties (N/E 68) and\n\n  their situation only improved in the mid-1990s;d. alleged the defendants copied the plaintiffs' product brochure (D1)\n\n  as well as the accordion packaging for masking tapes; the latter allegation was retracted under\n\n  further cross-examination;e. when he was with the defendants, he had informed the management via Mew of\n\n  his involvement with the plaintiffs; he believed he had also declared his interest to the company\n\n  secretary.28. When his attention was drawn to the fact that Dua Beng had informed the\n\nRegistry on 27 April 1989 that the plaintiffs had first used the specialHi-Bondmark only\n\nfrom January 1988, LYH explained that the reason was because the plaintiffs used a different design\n\nof theHi-Bondmark previously. He offered the same explanation when questioned on the letter\n\n(see his exhibit LYH-10) of the plaintiffs' solicitors (Tang & Tan) to the Registry dated 30\n\nNovember 1998 in regard to registration of the specialHi-Bondmark (TM07635/97) in class 16\n\nfor adhesive tapes, in which the solicitors stated that the plaintiffs' products as well as those of\n\ntheir competitors (CIC and Loytape)had been on the market for slightly less than ten (10) years\n\nand they have [sic] all been using a similar mark without causing confusion to the public. The\n\nplaintiffs had produced two (2) other letters written by Dua Beng to the Registry  in the letter\n\ndated 14 October 1997 (P34), Dua Beng had informed the Registry that the plaintiffs had been\n\npromoting products under theHi-Bondmark since 1989 but, the year1989had been\n\ncrossed out and substituted by a handwritten1979. Similarly, in Dua Beng's letter dated 5\n\nNovember 1997 (P35), where he had informed the Registry that the plaintiffs' product brochure\n\nhad been printed in 1992, the year1992had been crossed out and substituted by the wordsabout\n\n1987. Questioned, LYH denied he had made the amendments nor was he aware who had done so.29. Although he claimed to have resigned from the defendants and was not asked to\n\nleave, LYH could not explain why the defendants had inserted notices (1AB1008) in the English and\n\nChinese newspapers of 14 and 16 July 1997 respectively, to the effect that he was no longer\n\nauthorised to transact business on the defendants' behalf with immediate effect. The court's\n\nattention was also drawn to his letter dated 30 July 1997 (see 1AB1007) addressed to the executive\n\nchairman of Samanda Holdings Bhd (Samanda) wherein LYH requested payment of S$95,607.15 as bonus and\n\nsalary in lieu of leave. His request was rejected in the defendants' reply dated 27 August 1997 (see\n\n1AB1005) in the following terms:-....the Board of Directors of the Company have now decided not to accede to\n\n  your request for ex-gratia payment. We do not propose to go into the reasons as to why we have\n\n  decided not to make any payment to you, but we believe you are fully aware what these reasons are.LYH claimed (N/E 87-88) the defendants had not yet paid him despite his having\n\nleft the company for more than 3 years; he said he would commence proceedings for his claim when\n\nhe had the time and had settled everything.30. Under re-examination, LYH claimed that the reason the plaintiffs did not have\n\nevidence of the plaintiffs' use of theHi-Bondmark on glues and sealants was because the\n\nsame was with the defendants. This was to be contrasted with Connie Lim's testimony (N/E 306) where\n\nshe said that the reason the defendants could not produce evidence of the defendants' usage of theHi-Bondmarkbefore1987 and before the plaintiffs' usage was because LYH had taken away/destroyed\n\nsuch records! The defendants' accountant (Tan Poh Suan) echoed Connie Lim's testimony that she was\n\nunable to produce the bills as most of them had been thrown away (N/E 562).31. Besides LYH (whose evidence was the most crucial together with that of Dua\n\nBeng), the plaintiffs called four (4) other witnesses to support their case that they (not the\n\ndefendants) were the first to use theHi-Bondmark on adhesive and other tapes. I turn now to\n\nthe testimony of these other witnesses.32. The plaintiffs' second witness was Mew, who sits on the board of a number of\n\nMalaysian (public and private) companies, including Mopi Malaysia Sdn Bhd (Mopi Malaysia).\n\nApparently, he and LYH had been colleagues since 1974 and he was the latter's superior between\n\n1974-1991. Mew's testimony was hardly significant, touching on the peripheral issue of whether he\n\nand LYH had declared their interests in the plaintiffs when they were both working for the\n\ndefendants (which he asserted they did). Mew was the executive director/director of the defendants\n\nin 1979 and LYH reported to him. Mew recalled he had advised LYH to declare his (LYH's) interest in\n\nthe plaintiffs to the Central Securities group of companies and later to Samanda; he believed LYH\n\ndid so; he had also informed the group's chairman Tan Sri Ngan Chin Weng (the chairman) at the time.\n\nThis was confirmed by the chairman in a letter dated 10 February 2001 (see SAB926) which Mew\n\nproduced, it stated:-I wish to confirm that Mr Lim Yew Hin and Mr Mew Jin Seng had declared to me\n\n  their interests in Mopi Private Limited some times back in 1980. At the same time, I was also\n\n  aware that they are both members of the Board of Directors of Mopi Private Limted.I was the CEO of the Central Securities Group (later known as Ganda Holdings\n\n  Group) during that time. The Central Securities Group controlled the management of its member\n\n  companies, namely, Loytape Berhad (later known as Samanda Holdings Berhad), Central Industrial\n\n  Berhad, and Central Merchantile Corporation (S) Limited, and others.However, the chairman did not testify on his letter dated 10 February 2001 or at\n\nall; as such his letter has very little probative value particularly as Connie Lim asserted she had\n\nbeen informed otherwise by the chairman. Questioned why the plaintiffs did not call the chairman to\n\ntestify, Mew said it was because the chairman was old (67 years) and did not want to get involved in\n\nthe matter even though both he and LYH had requested the chairman to attend court (N/E 98).33. Mew described LYH as a trustworthy senior executive of the group and praised\n\nhis performance, crediting LYH with building up the defendants from nowhere into one of the largest\n\npackaging companies in Singapore. As a result, the defendants' profits were $2m at one time, which\n\nwas very substantial in those days. I should point out that Mew would not have had first-hand\n\nknowledge of the defendants' trade as he himself admitted he was not involved in its day-to-day\n\noperations or its sales, being the group's industrial divisions manager although he sometimes\n\nparticipated in board meetings of the defendants. Further, he was based in Kuala Lumpur and visited\n\nSingapore once a month. Indeed, it was in Mew's written testimony (para 29) that he had a vague\n\nrecollection of the contract-manufacturing arrangement between the defendants (via CIC) and the\n\nplaintiffs and, between the plaintiffs and Loytape in 1988, forHi-Bondmasking and OPP tapes\n\nrespectively. He was also not aware that the plaintiffs started manufacturing tapes only in 1986 nor\n\nindeed, what brands were used on the plaintiffs' products. His knowledge was largely based on what\n\nLYH told him. Neither could he identify theHi-Bondmark which LYH showed him (N/E 108) of\n\nthe three (3) in the list (K) produced by the defendants nor how the mark looked on the\n\nmasking tapes produced by CIC. In any event, Mew would have had no personal knowledge of events in\n\nthe plaintiffs after he left the group in 1991 and more so, after he resigned his directorship of\n\nthe defendants in 1993.34. Cross-examined, Mew clarified that by declaring his/LYH's interests in the\n\nplaintiffs to the defendants, he meant disclosing to the parent company Samanda. This was obvious\n\nfrom the form (PB 98-99) he produced, bearing the declaration he made on 31 March 1989. Indeed,\n\ncounsel for the defendants suggested that Mew's declaration was misleading as he had described the\n\nplaintiffs as an investment holding company (in which he had 10% interest) when the company was\n\ncarrying on the same business as the defendants. While he acknowledged that his secretary had made a\n\nmistake in typing the declaration, Mew contended that everyone knew what the plaintiffs did, as the\n\ncompany was no stranger to the group.35. The plaintiffs called Dua Beng (PW3) to testify. Dua Beng said he was more\n\nfamiliar with sealants than with adhesive tapes which sourcing, supply, credit lines, contacts etc\n\nwere handled by LYH. Although he was the plaintiffs' managing-director for 20 years (1978-98), Dua\n\nBeng testified that important decisions were made by LYH.36. Dua Beng said he was in charge of the plaintiffs' trade mark applications up\n\nto 1995-96 as evidenced by the various letters he wrote to the Registry (see exhibitsP30-35).\n\nQuestioned (N/E 134), Dua Beng said he did not make the handwritten amendments (para 28supra)\n\nto the dates in his letters dated 14 October (P34) and 5 November 1997 (P35). When\n\nshown the plaintiffs' application for theHi-Bondtrademark purportedly dated 5 February 1979\n\nor 5 December 1979 (PB3), Dua Beng said he did not file the application (which was also incorrect)\n\nas, the plaintiffs did not then have that particular design for theHi-Bondmark. Further, it\n\nwas not possible for the plaintiffs to have made the exact same application on 28 October 1987, as\n\nappeared in document PB7. He opined that the date in PB3 appeared to be in the handwriting of LYH.\n\nAs for the letter to CIC dated 25 July 1997 (P36), Dua Beng testified that it was drafted by\n\nLYH, contrary to the latter's denials. I note (and which Dua Beng confirmed) that T79/79096B was the\n\nplaintiffs' registration of theMopiHi-Bondtrademark under class 1  in respect of\n\nadhesives for mending broken articles and adhesive substances for industrial purposes. Similarly the\n\nplaintiffs' application in TM5045/87 (see AB1090) dated 14 October 1987 forHi-Bondmark was\n\nfor class 1. When his attention was drawn to the plaintiffs' letter dated 27 April 1989 (exhibitP32)\n\nwhich he had signed, and which stated:The date of 1stusage of the mark in respect of the goods covered by\n\n  the application was January 1988Dua Beng could not explain why the letter was not written on the plaintiffs'\n\nletterhead nor could he remember who drafted it nor where he had obtained the information stated\n\ntherein.37. Referred to the plaintiffs' Yellow Pages advertisements for 1980 (AB790), Dua\n\nBeng testified that the 1980 advertisement showed the plaintiffs' super-glue bottle with a loop\n\ncover and the wordsMopi Hi-Bondagainst a diamond-shaped background (para 9supra).\n\nThis was different from the sticker on the bottle of super-glue (P11) the plaintiffs produced\n\nin court, which contained only the wordsHi-Bond; he said the sticker onP11wasnotwhat he printed for the super-glue in 1980. Dua Beng testified thatP11was first introduced\n\ninto the market at end 1978 or early 1979 using the markMopi Hi-Bond;he could not recall\n\nwhenthewordMopiwas subsequently removed from the mark. The super-glue\n\noriginated from a Japanese company (Alteco) and when the plaintiffs' agency was terminated in\n\n1993-94, they gradually stopped selling the product packaged asP11. Dua Beng testified that\n\nalthough the Yellow Page advertisements for 1980-81 showedHi-Bond, the plaintiffs actually\n\nusedMopi Hi-Bondas the mark. As for sealants, the plaintiffs first started selling them in\n\n1984-85 under names other thanMopi Hi-BondorHi-Bond,which brandscame later\n\n(after 1988).38. BesidesP11, Dua Beng went through each of the plaintiffs' products\n\nexhibited in court, explaining when some of them were first introduced into the market and, their\n\nuses. He said the various types of glues were generally introduced in the 1980s. He recalled that\n\nthe plaintiffs' masking tape (P2) was first introduced in 1980-81 but, it was marketed under\n\ntheApollobrand; the plaintiffs first used theHi-Bondmark on masking tapes in\n\n1987-88. As for OPP tapes (P1), the plaintiffs first introduced theHi-Bondmark on\n\nthe product in 1987-88 although he was uncertain as to the format. Other adhesive tapes sold by the\n\nplaintiffs under theHi-Bondmark were introduced much later. Counsel for the defendants also\n\ntook Dua Beng through the various pictorial presentations of theHi-Bondmark in exhibitD3and their usages over the years (N/E158-164). Dua Beng confirmed there was no plainHi-Bondmark for glues before 1988.39. AlthoughHi-Bondas a word mark was the plaintiffs' idea first\n\nintroduced before October 1987, Dua Beng was not sure whether the mark belonged to the plaintiffs or\n\nthe defendants. However, he opined that it was the plaintiffs who had developedHi-Bondsealants and glues (N/E152 and 158) whilst it was the defendants who first used theHi-Bondmark on adhesive (including OPP) tapes (NE 172, 176). Further, the defendants' product brochure\n\n(exhibitD1) came out first, not the plaintiffs' (exhibitP26), as well as some of the\n\npackaging for the defendants' products, including the carton box (exhibitP18) for their\n\nmasking tapes as well as double-sided tapes (exhibitP20).40. Dua Beng's attention was drawn to the plaintiffs' letter dated 18 June 1997\n\n(PB94) which he had signed as its managing-director. He testified that it was LYH who asked him to\n\nsign the letter even though the contents were wrong (N/E 141); the letter states (with paragraphing\n\nadded for easier reference):To Whom it may concern1. In 1972, Mopi Engineering Company was founded by the late Mr Dua (Mr Dua\n\n    Beng's father), the late Mr Lim (Mr YH Lim's father), Mr Dua Beng, Mr Dua Beng and friends, Mr\n\n    Tan and Mr Han.2. Our main company activities include acting as industrial and stationery\n\n    supplier, and selling of adhesive, adhesive tapes, silicone tubings and rubber sheetsetc3. Six years later, business was expanding rapidly and the company was in\n\n    need of more funds and decided to convert the company to private limited (incorporated in 1978)\n\n    with the new shareholders (as per copy).4. The company grew from strength to strength in the adhesive business and in\n\n    promoting the adhesive tapes under the own trade nameHi-Bond. It was the famous trade\n\n    mark at that time.5. Sometime in early 1980, Mr Lim Yew Hin called me to allow Malaysia Samanda\n\n    Holding Associate, Central Industrial Corporation Bhd to manufactureHi-Bondmasking tape\n\n    which is still being done today.Dua Beng pointed out the year1972in para 1 above was incorrect, it\n\nshould be1974-75; his father did not know the father of LYH. He said para 4 was also wrong\n\nas the Registry did not approve theHi-Bondmark even though it was famous. Finally, para 5\n\nnever happened  LYH did not call him to allow CIC to manufactureHi-Bondmasking tapes.\n\nWhen he pointed out the errors in the letter to LYH, the latter told Dua Beng they were not\n\nimportant and asked him to sign which Dua Beng did; the letter was then returned to LYH. Dua Beng\n\ndid not know to whom the letter was sent and, he told no one about the errors. Although it was not\n\nhis habit to sign documents which are clearly wrong, Dua Beng explained he signed PB94 because LYH\n\nwas his superior notwithstanding he was the plaintiffs' managing-director. LYHwas the bosswhile he was in charge of the daily operations.41. Dua Beng said he had similarly signed the letter dated 25 July 1997 to CIC (P36)at the request of LYH. As in the case of PB94, he handedP36to LYH after signing and did\n\nnot know what happened thereafter. While Dua Beng agreed thatP36was correct in that the\n\nplaintiffs had used theHi-Bondmark since 1979, the mark was however not registered. He\n\ncould not understand the motive behind para 2 ofP36he was unaware of what tapes CIC\n\nwere manufacturing up to July 1997 and he did not know the relationship between CIC and the\n\ndefendants, although he was aware that a lot of the adhesive tapes were delivered directly to the\n\nplaintiffs by CIC, arranged by the defendants.42. Dua Beng had a different version from LYH, of the circumstances leading to\n\nthe meeting (called by the defendants) in 1987-88 with CIC and, the production ofHi-Bondadhesive tapes. He explained that the plaintiffs soldApollomasking tapes supplied by the\n\ndefendants at the material time. The plaintiffs' sales ofApollotapes had been reduced by\n\nmarket competition but, the defendants would not reduce their selling prices to the plaintiffs\n\nbecauseApollowas a famous brand. He testified that the defendants were then the plaintiffs'\n\nonly source of supply of adhesive tapes (N/E 178), refuting LYH's claim that the plaintiffs bought\n\nOPP tapes from Taiwan and masking tapes from Canada. At that meeting, both parties agreed that theHi-Bondmark previously used on glues and sealants, would henceforth be used on adhesive tapes which the\n\ndefendant would supply to the plaintiffs. Dua Beng could not recall who first made the suggestion\n\nnor why the brandHi-Bondwas suggested. He could not recall meeting representatives of CIC\n\nor Loytape either. However, he confirmed neither he (nor anyone else) said theHi-Bondmark\n\nbelonged to the plaintiffs let alone that the defendants could only use the mark on adhesive tapes\n\nwith the plaintiffs' permission which could be withdrawn at any time. Neither (as alleged by LYH)\n\ndid the defendants request his permission every time they wanted to use theHi-Bondmark on\n\nother tapes, over the years. Above all, there was never any arrangement whereby, in return for the\n\ndefendants' usage of theHi-Bondmark, the plaintiffs were allowed to use the marksNikko,\n\nKawasaki, SenisuiandStaron their tapes.43. The plaintiffs had initially complained that Dua Beng was evading service of\n\ntheir subpoena and had set conditions for his appearance in court; this was refuted by Dua Beng. He\n\nalso denied that the brother (Lim Yew Pin) of LYH had purchased from him 30,000 shares in the\n\nplaintiffs as a pre-condition or, that he wanted someone to buy over all his shares (100,000) in the\n\nplaintiffs, before he would testify for the company. While it was true that he had asked both LYH\n\nand Lim Yew Pin to buy over his shares, that was in December 2000-January 2001beforeLYH\n\ncontacted him to be a witness. Neither did he demand repayment of his previous loan ($40,125) to MHP\n\nas another condition for testifying for the plaintiffs.44. Contrary to what LYH had alleged, Dua Beng explained that he left the\n\nplaintiffs for health reasons (spinal and heart problems), not because he had taken away lucrative\n\nagencies. After leaving the plaintiffs, he was a part-time manager in a company for 6-9 months. Dua\n\nBeng revealed that even before LYH joined the plaintiffs in 1997, the latter had been very involved\n\nwith the company (from about 1985 onwards). LYH used to visit the plaintiffs' office everyday after\n\nthe company underwent computerisation in 1990. In fact, LYH co-signed cheques of the company with\n\nhim from 1983-84, taking over from the wife (Poon Choon Yoke). LYH also took charge of staff's\n\nsalaries, accounts, daily sales records, computerisation and anything involving adhesive tapes,\n\nincluding attending meetings.45. Recalled to the witness stand after Dua Beng had testified, LYH was\n\nquestioned by the court (N/E 266) why the plaintiffs printed the wordsUSAon the inner core\n\nof its masking, OPP and other tapes, with theHi-Bondmark. He prevaricated and asserted it\n\nwould be wrong to think it meant the product was made in the United States (it was treated as part\n\nof the trademark), notwithstanding that his justification for printingUSAon the masking\n\ntapes was because the jumbo roll came from the United States (on which there was no evidence).46. Notwithstanding that Dua Beng had identified his handwriting on the document\n\nmarked PB3 and had said that it was likely LYH amended the dates in exhibitsP34, P35and\n\nPB17 (N/E 188-189), LYH continued to maintain his innocence and denied he had doctored the\n\ndocuments, even for the dates in the letter of Tang & Tan dated 30 November 1998 (PB17), when\n\nDua Beng had already left the plaintiffs; he also denied that he had draftedP36and PB94.47. Ling Yew Teck also known as Anjoe Ling (Ling), was another of the plaintiffs'\n\nwitnesses. Being the younger brother of LYH, it came as no surprise that Ling's testimony echoed\n\nthat of the former and that he opined theHi-Bondmark belongs to the plaintiffs. This is to\n\nbe expected, given that he is the sole-proprietor of Superior Link Marketing (Superior), which\n\nimports and distributes adhesive tapes (includingHi-Bondobtained from the plaintiffs) and\n\npackaging materials. Ling PW4) left the defendants' employment in July 1997 where he was first the\n\nstore-keeper/delivery man (1979-81) and then put in charge of accounts. He was a shareholder of the\n\nplaintiffs between 1987 and 1996.48. In his written testimony (para 7), Ling had deposed that at all times, he\n\nknew that theHi-Bondmark belongs to the plaintiffs. Questioned by counsel for the\n\ndefendants, Ling justified his sweeping statement by the fact that as the defendants' delivery man,\n\nhe recalled that in 1978 the plaintiffs started selling and he delivered,Hi-Bondsuper-glue,\n\nto the defendants' suppliers. Yet Ling was unable to assist the court by identifying from the list\n\n(exhibited inD3)which design of theHi-Bondmark was used on the plaintiffs'\n\nsuper-glue, or on PTFE tapes. However, he did say that the mark first used contained the wordMopiwhich was subsequently removed. Neither could Ling recall which design of theHi-Bondmark\n\nwas used on sealants, save that the mark was first used on sealants around 1980. His answer is not\n\nsurprising given that he does not sell sealants. On the specialHi-Bondmark, Ling learnt\n\nfrom market sources that the plaintiffs used it on OPP tapes (imported from Taiwan) from around 1986\n\nbut, acknowledged that he did not buy such tapes on the defendants' behalf from the plaintiffs then.\n\nSimilarly, he heard from market sources that the plaintiffs obtainedHi-Bondmasking tapes\n\nfrom Canada in 1987. Pressed further by counsel for the defendants on these sources, Ling claimed\n\n(N/E 223) he had been told by Dua Beng. This testimony together with Ling's version of the meeting\n\nwith the defendants in 1987-88, contradicted what Dua Beng said, although it was consistent with his\n\nbrother's version.49. I do not intend to dwell further on Ling's testimony as it would serve no\n\nuseful purpose. He was not an independent witness but reiterated what LYH had said and, the same\n\ninconsistencies which arose in the course of his brother's cross-examination were repeated. To a\n\nnumber of questions he gave the stock answer:I can't recall, so long ago. Despite his\n\ndenials to the contrary, there is no doubt that Ling would have a personal interest in the outcome\n\nof this case. If the plaintiffs succeed in this action, the defendants would be prevented from using\n\ntheHi-Bondmark, all customers of the defendants would then have to obtain their supplies ofHi-Bondfrom the plaintiffs and Superior would be able to make more sales ofHi-Bondadhesive tapes. It was Ling's testimony that he does not obtain his supplies ofHi-Bondadhesive tapes from the defendants at all.50. The plaintiffs' last witness was their sales representative Ang Ah Kian (Ang)\n\nwho previously worked for the defendants (1993-98) before joining the plaintiffs in March 1999. Like\n\nLing, Ang made a positive assertion in his written testimony thatall the sales personnel in the\n\ndefendant company [including himself] knew that theHi-Bondtrade mark belongs to the\n\nplaintiff. Questioned by counsel for the defendants, Ang acknowledged that he could not tell\n\nwhich mark belongs to who as both parties soldHi-Bondmasking tapes. In the next breath\n\nhowever, he said that he knew the mark belonged to the plaintiffs because, the defendants boughtHi-Bondsilicone from the plaintiffs when he was the defendants' salesman. He said the mark waswell\n\nknownbecause the plaintiffs had very good sales ofHi-Bondmasking tapes and sealants,\n\npossibly because their prices were cheaper than the defendants'. However, he was not aware who sold\n\nmore masking tapes. He further stated (N/E 246) there wereobviouscolour (and carton box\n\npackaging) differences between the tapes supplied by the plaintiffs (P2) and those supplied\n\nby the defendants (P22). The differences however, were not apparent either to me or to\n\ncounsel for the defendants.51. Ang (PW5) had in his affidavit (para 23) deposed that there was confusion by\n\n(industrial) end-users over the source of supply ofHi-Bondmasking tapes because of the\n\ndifferences he had mentioned. He alleged there was one instance when his customer (SB Plastics)\n\nasked him to replace the defendants' masking tapes with the plaintiffs'. In cross-examination\n\nhowever, it emerged that the customer's request had nothing to do with either quality of, or\n\nconfusion over, the tapes -- SB Plastics wanted a different size from what he had supplied (18mm),\n\nso he gave them the plaintiffs' tapes in replacement because the defendants did not/do not have the\n\nrequisite 48mm size.52. As in the case of Ling, I cannot accept Ang's testimony as impartial. Not\n\nonly is he working for the plaintiffs but, he was dismissed from his previous employment with the\n\ndefendants.",
        "(ii) the defendants' case": "53. In order to throw some light on some of the unanswered questions relating to\n\nthe plaintiffs' trade mark applications, the defendants called a legal officer from the Intellectual\n\nOffice of Singapore (IPOS) which incorporates the Registry, as a witness. Anne Loo (Loo) confirmed\n\nthat the Registry was at Tanglin Road from 1979 until it moved to Colombo Court in March 1987, and\n\nthen to Plaza by the Park at Bras Basah Road in August 1990. She further confirmed that when the\n\nRegistry moved from Tanglin Road to Colombo Court, the Tanglin Road address on the printed forms was\n\ncancelled and the Colombo Court address was stamped thereon. Consequently, she found PB3 strange --\n\nit bore both the Tanglin Road and Colombo Court addresses as at 1979, when the Registry did not move\n\nto the latter location until 8 years later. Similarly, Form TM6 appearing in its format at AB1010\n\nwould not have existed as at 5 December 1979. Loo (DW1) pointed out that in any case, PB3 being a\n\ncopy of Form TM6, would not have been in the plaintiffs' possession as, the Registry retains the\n\noriginal application but does not return a copy, to an applicant. Further, the Registry's original\n\nForm TM6 would have been stamped with the date of submission and would have had the receipt number\n\nhand-written thereon for payments made. As proof, Loo produced a Form TM6 submitted by the\n\nplaintiffs on 8 May 1987 (seeD8).54. Loo produced the registry's copy (D4) ofP34,it did not have\n\nthe handwritten amendment of the year from1989to1979. Neither did the Registry's\n\noriginal (D5) ofP35have the handwritten deletion of the year1992and its\n\nreplacement by the wordsabout 1987. Loo said Tang & Tan's letter in PB17 was not in the\n\nRegistry's file, for TM7635/97. However there were similar letters (2) with the Registry bearing the\n\ndates 7 August and 2 December, 1998 (seeD6) relating to TM7635/97 and TM7636/97\n\nrespectively, save that the date1980'swas not crossed out and substituted by1990's,\n\nas appears in PB17. In relation to Form TM6 at PB7 dated 28 October 1987, Loo said she could not\n\nlocate such an application from the plaintiffs. What the Registry had was Form TM6 for TM5045/87\n\ndated 14 October 1987, as shown in AB1090.55. I found Loo's testimony most useful in helping to resolve the issue of when\n\nthe plaintiffs filed their numerous trademark applications and for what marks. Needless to say, I\n\nfound her an impartial witness notwithstanding that she was called to testify by the defendants.56. I shall refer briefly to the testimony of the other witnesses (5) called by\n\nthe defendants before I consider the testimony of their key witness, Connie Lim. I start with the\n\ntestimony of Lim Eam Hee (Lim) who is presently a consultant with Loytape. Lim (DW3) was Loytape's\n\nresearch and development (R&D) manager between 1985-1991 save for 1990 when he was also the\n\nacting production manager. Between 1991-98, Lim was the technical manager. As the technical and\n\nR&D manager, Lim was in charge of quality control of adhesive tapes. He deposed he was also\n\nrequired to do work for CIC although he was Loytape's employee as, between 1985-1998, both companies\n\nthen had the same general manager (Koay) and same management until 1998. Lim stated that both\n\ncompanies contract-manufactured adhesive types but of different types. Loytape also produces its own\n\nOPP tapes.57. Lim affirmed that it was Loytape's practice to apply the customer's\n\ntrademark(s) when it contract-manufactured adhesive tapes, based on artwork and design given by the\n\ncustomer. The company's customers included those from Australia, Hong Kong and Korea. Lim recalled\n\nthat Loytape first contract-manufacturedHi-Bondtapes for the defendants in 1987 with\n\nartwork and design provided by the defendants. Loytape also contract-manufactured for the defendants\n\nOPP tapes (1987-1991/92) and cellulose tapes (1995-97). For cellulose tapes, the design used was the\n\nspecialHi-Bondmark. Loytape also contract-manufactured (and still does)Kawasaki,\n\nSenisuiandStaradhesive tapes for the defendants. He said Loytape has never\n\ncontract-manufacturedHi-BondOPP or cellulose tapes for anyone other than the defendants,\n\nwho were one of their biggest customers. When production was completed, the defendants' tapes were\n\ndelivered to them or, in the case of large orders (for logistical or other reasons), the deliveries\n\nwould be made direct to the defendants' customers, including the plaintiffs. This fact was known to\n\nLYH as he was then the defendants' managing-director and large quantities ofHi-Bondtapes\n\nwere delivered direct to the plaintiffs, but paid for by the defendants.58. Because of the then common management of both companies under Koay, Lim\n\naffirmed that CIC was equally aware that Loytape contract-manufactured for the defendants; CIC\n\nthemselves contract-manufacturedHi-Bondmasking tapes for the defendants at the same time.\n\nLim however, said he was not aware of any arrangement between CIC and the plaintiffs to\n\ncontract-manufacture masking tapes with theHi-Bondmark. If indeed there was such an\n\narrangement, Koay would have told Lim since he was then the acting production manager. The\n\ndefendants like other customers, had arrangements with Loytape but no agreements, for\n\ncontract-manufacturing. Lim said he regarded the defendants as the owners of theHi-Bondmark;\n\nhe was not aware of anyone else claiming the mark during the time Loytape contract-manufactured OPP\n\ntapes for the defendants.59. A material witness for the defendants was Allan Tan, their senior (sales and\n\nmarketing) manager, who joined the company in 1973 as a driver-cum-sales representative, before\n\nrising through the ranks to his present position. Besides Loytape and CIC, Allan Tan (DW4) affirmed\n\nthat the defendants used overseas contract-manufacturers for production of adhesive tapes.60. Allan Tan affirmed that the defendants first used theHi-Bondmark in\n\n1987 on their OPP tapes, followed by masking tapes in 1988; thereafter the mark's usage was extended\n\nto other tapes and put on cellulose tapes in 1996. Currently, the defendants use theHi-Bondmark on double sided coated (DSCT) and masking tapes only. OPP and other tapes are sold under the\n\ndefendants' other trademarks such asNikkoandJupiter. Allan Tan described the\n\nspecialHi-Bondmark as unique; I shall now set out his version of the birth of the mark.61. Allan Tan recalled he had attended the crucial meeting between the defendants\n\nand the plaintiffs, which (according to him) was in early 1987; present were the younger brother\n\n(Ling) of and, LYH. At that time, the defendants were sellingKawasakiandApolloOPP\n\ntapes at unit prices which were less competitive than other brands. Allan Tan/his sales staff\n\nthought that if they could shorten the length, the cost of manufacturing and selling, OPP tapes\n\ncould be lower. As the defendants did not wish to cut into their existing customer base forKawasakiandApollo, they decided to market the new shorter length tapes under a new brand --Hi-Bondwas suggested by either LYH or Ling; no one said the plaintiffs owned the mark or that the\n\ndefendants were to use it under contract/licence. Neither was there any discussion/agreement that\n\nthe defendants were allowed to use theHi-Bondmark in exchange for the plaintiffs' usage ofKawasaki,\n\nSenisui, NikkoandApollobrands. As Loytape were already making OPP tapes for the\n\ndefendants, it was only natural to ask Loytape to produce the new tapes. Hence,Hi-BondOPP\n\ntapes were first contract-manufactured in 1987. The plaintiffs used the mark on sealants much later.\n\nAlthough the plaintiffs used the markMopi Hi-Bondin a diamond-shaped device on glues in the\n\n1980s, the design was very different from the specialHi-Bondmark which the defendants used\n\non adhesive tapes in 1987.62. Allan Tan recalled another meeting between the defendants and the plaintiffs\n\nin early 1988. This time the plaintiffs complained that the defendants' masking tapes under theKawasakiandApollobrands were not competitive in price. The plaintiffs were represented at the\n\nmeeting by Dua Beng and Jimmy Toh while Allan Tan, LYH and Ling represented the defendants. For the\n\nsame reasons which saw the birth ofHi-BondOPP tapes, it was decided that the defendants\n\nwould launchHi-Bondmasking tapes at a shorter length and at a cheaper price than\n\ncompetitors' brands. Again, there was no discussion about ownership of the mark or whether the\n\ndefendants would use it under licence or contract from the plaintiffs. In 1988, the defendants used\n\nthe same design of the mark on masking tapes as on the OPP tapes, namely, the specialHi-Bondmark. As in the case of the OPP tapes, no one else, including the plaintiffs, used the specialHi-Bondmark on masking tapes. However, Allan Tan could not say who first thought of the design for the\n\nmark, but he was emphatic that the mark belonged to the defendants63. Allan Tan recalled thatHi-Bondmasking tapes received a good\n\nresponse; its success prompted the defendants to contract-manufacture and sell, other tapes (7) with\n\nthe mark. Indeed, the plaintiffs were one of the defendants' biggest customers for masking (but not\n\nOPP) tapes between 1988-97. The plaintiffs started to compete with the defendants and sold identicalHi-Bondmasking tapes, after LYH left the defendants in July 1997, followed by Ling. It was\n\nnot true as LYH claimed, that the plaintiffs first used theHi-Bondmark on OPP and masking\n\ntapes in 1986; the tapes did not then exist. For the same reason, the defendants did not buyHi-Bondsealants from the plaintiffs between 1978-87. The defendants first purchased sealants (under the\n\nnameMopi Hi-Bond) from the plaintiffs in 1989-90. Earlier, the defendants bought from the\n\nplaintiffs silicone sealant under brands likeGEandDevcon. As for glues, the\n\ndefendants purchased small quantities from the plaintiffs between 1980-84; the defendants sold moreAltecosuper glue. In 1988, the super glue which the defendants bought from the plaintiffs had an entirely\n\ndifferent shape and bottle from the exhibit they produced (P11) in court and it carried the\n\nmarkMopi Hi-Bond. When shown by counsel for the plaintiffs, a cash sales invoice of the\n\ndefendants dated 11 November 1988 (AB17) which includedHi-Bondsilicone sealant, Allan Tan\n\nagreed the plaintiffs may have introduced the product earlier. However, in re-examination, he said\n\nthat the plaintiffs then did not use the specialHi-Bondmark for their sealants.64. Allan Tan alleged that between 1994-97, LYH forced the defendants to buyHi-Bonddouble-sided filament tape (DSFT) and double-sided coated tapes (DSCT) from the plaintiffs so as to\n\nbenefit the plaintiffs. The tapes were made for the plaintiffs (without the defendants' permission)\n\nby other sources and were of poor quality. As LYH was then the managing-director, the staff\n\n(including Allan Tan) had no choice but to follow his instructions. The practice stopped after LYH\n\nleft the defendants. He denied LYH had called him in August 1997 to say the defendants could no\n\nlonger use theHi-Bondmark. Allan Tan further denied the plaintiffs' pleaded case that there\n\nwas an oral agreement in 1990 by the plaintiffs to allow the defendants to use the mark. He recalled\n\nthat the defendants' product brochure (D1) was prepared for the 1991 AsiaPac exhibition in\n\nwhich the defendants participated.65. To substantiate the defendants' contention that LYH was summarily dismissed\n\nby the defendants and did not resign, Allan Tan recounted what happened on 12 July 1997. He said he\n\npicked up three (3) directors of Samanda from the airport that morning, took them to the defendants'\n\npremises and, after they had had a discussion with the defendants' chief financial officer (who was\n\nalso from Kuala Lumpur), LYH went to his room to pack his belongings and left. Allan Tan as\n\ninstructed, sent LYH home and took back the latter's company car.66. On the use of the wordsUSAon the masking tapes, Allan Tan testified\n\nthat it was done in 1990-91 (with the agreement of LYH) to meet the requirements of customers who\n\nhad more confidence in goods from the United States, even though the tapes were produced by CIC\n\nwithout any component from America. However, after LYH's departure from the company, the defendants\n\nstopped using the wordsUSA,as CIC informed them it was forbidden by Malaysia's trade\n\nlegislation.67. In cross-examination, counsel for the plaintiffs took Allan Tan through the\n\nplaintiffs' range of products exhibited in court. According to Allan Tan, some of the items were not\n\nin the market (or not sold with the marks shown on the packaging) at the time when the defendants\n\nfirst purchased glues/sealants from the plaintiffs. He identified theHi-Bondmark on the\n\nplaintiffs' (tube) silicone RTV sealant (P15) as that used on the defendants' OPP and masking\n\ntapes in 1988. Although the defendants' cash sales in 1981 (see AB1) statedHi-Bondglue,\n\nAllan Tan said the actual product contained the markMopi Hi-Bond; the cash bills were\n\nprepared by the defendants' purchasing department based on information given by the plaintiffs. In\n\nany case, the customers would not buy from the defendants if the mark wasMopias, they could\n\npurchase direct from the plaintiffs.68. Allan Tan also denied that whenever the defendants wanted to use theHi-Bondmark for contract-manufacturing, Ling would ask the plaintiffs for permission, starting with OPP\n\ntapes. Ling was then the assistant sales supervisor who reported to him and would have informed\n\nAllan Tan, if there indeed was such an arrangement. In this regard, the earliest invoice the\n\ndefendants could locate forHi-BondOPP tapes was one dated 24 October 1988 (see AB11) issued\n\nto the plaintiffs. Allan Tan recalled that other invoices for 1987 were stacked in a corner on the\n\nthird storey of the defendants' office near the emergency exit, close to his seat, and were thrown\n\naway. Hence, the fact that only invoices issued to the plaintiffs were produced in court did not\n\nmean that the defendants only sold OPP tapes to the plaintiffs between 1988-90; the defendants had\n\ninvoices issued to other customers from May 1990 onwards. Allan Tan denied counsel's suggestion that\n\nthe fact the early invoices of the defendants (for both masking and OPP tapes) were only to the\n\nplaintiffs showed that theHi-Bondmark belonged to the plaintiffs and, the defendants were\n\nthe plaintiffs' contract-manufacturers.69. Allan Tan revealed that the defendants had stopped using theHi-Bondmark on five (5) of the eight (8) types of tapes they used to sell, because of poor sales coupled\n\nwith the fact that they had alternative brands. He estimated thatHi-Bondsales totalled\n\n9-10% of the defendants' total sales. The plaintiffs also stopped buying adhesive tapes from the\n\ndefendants after LYH left. It was only recently that Allan Tan was informed by Connie Lim that the\n\nplaintiffs sold adhesive tapes under theHi-Bondmark. He was not aware prior thereto as, his\n\nsalesmen did not give him feedback from the market.70. To buttress their contention that the plaintiffs did not sell any OPP tapes\n\nwith theHi-Bondmark in 1988, the defendants (through Allan Tan) called Toh Gim Huat @ Jimmy\n\nToh (Toh) to the witness stand. Toh (DW5) worked for the plaintiffs for 18 years (1980-1998), first\n\nas a delivery man and then as a salesman. By the time he left the company, he was a sales supervisor\n\nreporting to Dua Beng. He then started his own business (Gisen Enterprise Pte Ltd) in adhesive tapes\n\nand sealants/glues includingHi-Bondsupplied by the defendants.71. It was Toh's evidence that in 1986, the plaintiffs did not sell any OPP or\n\nmasking tapes with theHi-Bondmark manufactured in Taiwan and Canada respectively; neither\n\ndid they sell the same in 1985 or 1987. Toh stated that the plaintiffs used the markMopi Hi-Bondon their super glue between 1980-88; he could not recall the plaintiffs having removed the wordMopifrom that mark in 1979 due to customers' complaints. Like the defendants' previous witnesses,\n\nToh was taken through the plaintiffs' products exhibited in court for his views on when he saw the\n\nvarious items in the market; he testified that he had first seen the plaintiffs' masking tapes (P2)\n\nin 1988 followed by OPP tapes (P1) in 1990-91. Later (in 1997), the masking tapes were made\n\nin China. The other adhesive tapes sold by the plaintiffs came later, starting with PVC surface\n\nprotective tapes (P8) in 1992-3. As for sealants, the plaintiffs soldToshibabrand\n\nbefore launchingHi-Bondsilicone (followed by acrylic) sealants in 1988.72. Toh recognised LYH and said he used to see the latter in the plaintiffs'\n\npremises every month, 2-3 times between 1980-90 and 6-7 times in 1996-97, on those occasions when\n\nToh was not out of the office. He supported Allan Tan's testimony that although the plaintiffs'\n\nsuper glue as reflected in the defendants' 1981 invoice (AB1) statedHi-Bond, the product\n\nactually carried a sticker which statedMopi Hi-Bond; he also corroborated Allan Tan's\n\nversion of the 1987 meeting between the parties. Toh maintained his evidence notwithstanding being\n\nshown the plaintiffs' Yellow Pages advertisements to the contrary by counsel for the plaintiffs; he\n\nsaid it was not true that in 1981-82 the plaintiffs removed the wordMopifrom its mark for\n\nsuper glue, as a result of complaints from customers. He pointed out that the super glue product was\n\nnot actually manufactured by the plaintiffs  he replaced theAltecostickers on the\n\nbottles withMopi Hi-Bondstickers, on the instructions of Dua Beng, who was afraidAltecowould terminate the plaintiffs' exclusive distributorship, which it did in 1993-94. Further,\n\nsales ofMopi Hi-Bondsuper glue only averaged $10,000 per annum up to 1997, as it was less\n\npopular thanAltecoand other brands. Similarly, the plaintiffs soldGEsilicone\n\nsealant in tube form withHi-Bondpackaging (see photograph markedL) in 1992-3. In\n\nthe 1980s, the plaintiffs soldApollomasking tapes. The plaintiffs started buyingHi-BondOPP tapes from the defendants in 1987, prior thereto, they boughtKawasakiandApollobrands. In 1989, the plaintiffs changed the design on their packaging to the specialHi-Bondmark but they stopped using that mark in 1995.73. My preliminary assessment of Toh as a witness is, he was not beholden to the\n\ndefendants as counsel for the plaintiffs sought to imply, nor would he benefit if the defendants\n\nsucceeded in this action. He had explained that less than 10% of his sales comprised ofHi-Bondadhesives tapes and even if the plaintiffs were restrained from sellingHi-Bondadhesive\n\ntapes in the event the defendants succeed in this action, he would still have to compete with other\n\nbrands (Supreme, MajesticandHunter) in the market.74. The defendants also asked two (2) of their customers to testify. The first\n\nwas Ong Gim Lee (Ong), a director and shareholder of Great Prospect Trading Pte Ltd (GP) which\n\nstarted off as a sole-proprietorship in 1976 and dealt with the defendants from that year onwards;\n\nGP sells packaging materials including adhesive tapes obtained from the defendants and other\n\nsuppliers. The other customer who testified was Tan Bu Ngi (Tan) whose sole-proprietorship To-Morrow\n\nElectric & Hardware Trading Company began its business relationship with the defendants in 1975.\n\nUnlike Ong (DW6), Tan (DW7) sells other goods like electrical light fittings and accessories besides\n\npackaging materials.75. Ong and Tan testified there wereHi-BondOPP tapes in 1987 andHi-Bondmasking tapes in 1988, both were sold by the defendants; in 1985 and 1986, there were noHi-BondOPP or masking tapes sold by the plaintiffs. GP does not deal in sealants but Ong recalled buying\n\nsome glue from the plaintiffs in 1997. Ong has stopped buying OPP tapes from the defendants but has\n\nincreased his purchase of their masking tapes. In Tan's case, he initially obtained supplies of\n\npackaging materials under the brandsLoytapeandApollofrom the defendants before\n\nbuying their other brands, includingHi-Bond(in 1987). Cross-examined (N/E 548), Tan said he\n\nbought adhesive tapes from the plaintiffs in the 1990s when they approached him, mainly out of\n\nfriendship as he knew LYH from the defendants but, he was unaware the products were not sourced from\n\nthe defendants; he was merely told the product was the same as the defendants'.76. I now turn my attention to Connie Lim's testimony; she was appointed a\n\ndirector of the defendants in 1993 and is their only resident director, after the demise of Yu Cheng\n\nPoh in 1989. She first joined the defendants in October 1988 as the company secretary, LYH was her\n\nsuperior; she was not involved in the day to day operations or the management. In June 1997, just\n\nbefore LYH's departure from the company, Connie Lim was made the defendants' executive director but,\n\nshe continued to discharge the duties of a company secretary. She also handled Samanda's financial\n\nmatters in Singapore until 1994, when the chairman sold his interests in the group; thereafter she\n\ntook charge of only the chairman's (personal) financial matters.77. Connie Lim contended that the defendants' annual turnover over the past five\n\n(5) years averaged about $20m of which packaging materials (including adhesive tapes) was $12m. In\n\nher written testimony, Connie Lim detailed the sources of the defendants' various products, both\n\nMalaysian and foreign. She affirmed that the defendants did not advertise theHi-Bondmark\n\nvery much over the years until after LYH's departure from the company. The defendants' total\n\nexpenditure on advertisement and promotions averaged $5,000 per year until 1997. After LYH left,\n\nadvertising expenditure increased to about $30,000 per annum. Advertisements were placed in the\n\nYellow Pages as well as in the trade publication Evergreen. Based on sales, Connie Lim averred that\n\nthe defendants had acquired substantial goodwill inHi-Bondadhesive tapes, in particular\n\nmasking tapes; over the years, the mark has become well-known as the defendants'. She accused the\n\nplaintiffs of damaging the defendants' goodwill by claiming ownership of the mark and selling\n\nadhesive tapes bearing the same mark. Although the plaintiffs used the markMopi Hi-Bondin a\n\ndiamond-shaped device on their 20gms glue in or about 1980, Connie Lim asserted that the defendants\n\nwere the first to use the specialHi-Bondmark in 1987. She alleged that the plaintiffs must\n\nhave copied the defendants' mark which present get-up is almost identical to that of the\n\ndefendants'.78. I shall not go over old ground and dwell on disputed facts and events covered\n\nby the testimony of the defendants' other witnesses as, what Connie Lim knew ofHi-Bondproducts and the mark was what she learnt from people like Allan Tan. She alleged LYH had breached\n\nhis fiduciary duties in being a shareholder and director of the plaintiffs at the material time\n\nwithout the defendant's knowledge. In this regard, Connie Lim refuted Mew's testimony and said she\n\nhad telephoned the chairman in January 2001 who denied he had been notified of the interests of LYH\n\nand Mew in the plaintiffs. When she was referred to the chairman's letter dated 10 February 2001 (at\n\nSAB 926) stating otherwise, Connie Lim ventured a guess that the chairman himself may have lied as\n\nshe only realised he too was a shareholder of Mopi Malaysia, from Mew's testimony. Counsel then\n\nshowed her an extract (SAB923) from the minutes of a 1984 meeting of the defendants' directors,\n\nwhich showed that both LYH and Mew declared their interests as directors of the plaintiffs; Connie\n\nLim countered thatneitherdeclared their interests asshareholders.79. Although she had no personal knowledge of the dismissal of LYH, Connie Lim\n\nsaid she was instructed to arrange for the press advertisements relating to his departure and, to\n\npass the resolution of the board of directors confirming acceptance of his forced resignation.\n\nApparently, an internal audit was done during a due diligence inspection conducted on the defendants\n\nfor the take-over of Samanda, in the course of which it was found that LYH had acted contrary to the\n\ndefendants' interests. Connie Lim also alleged that LYH threw away a lot of the defendants'\n\ndocuments (N/E293 and 306) including invoices for years 1987-88 and even up to 1990; she also\n\nquestioned whether the documents he did not throw away were left behind deliberately.80. I turn next to the defendants' product brochure inD1, which\n\nadvertised the range offactory productsmarketed by the company. In re-examination,\n\nConnie Lim said LYH was responsible for the printing and it could have been printed in 1991(or\n\nearlier) for the AsiaPac exhibition that year. She pointed to the fact that the defendants'\n\nparticulars printed thereon showed its cable and telex addresses both of which the defendants were\n\nstill using in the 1980s whilst the address was stated as No. 86 Tagore Lane, Singapore 2678, to\n\nwhich the defendants moved to in 1984. One of the products shown in the brochure wasApollo 88denoting the year 1988.81. I wish to digress at this stage to refer to the plaintiffs' almost identical\n\nbrochure inP26. It was claimed by LYH that the plaintiffs' brochure came out earlier than\n\nthe defendants' who copied it. I note fromP26that the plaintiffs' address is stated as No.\n\n223, Ubi Avenue 4 (Intrepid Warehouse Complex), Singapore 408813 which is the plaintiffs' current\n\naddress. According to LYH, the plaintiffs only moved there in 1997 (para 26supra). That\n\nbeing the case, coupled with the fact that the plaintiffs' address onP26shows a 6 digit\n\npostal code whereas the defendants' address onD1shows a 4 digit postal code, leads me to\n\nbelieve that the defendants' brochure must have preceded the plaintiffs'. I take judicial notice of\n\nthe fact that the 6 digit postal code for Singapore was only introduced on 1 September 199582. Connie Lim revealed she was responsible for stopping the practice (1994-97)\n\nforced upon the defendants by LYH with his brother's (Ling's) collaboration, to buyHi-Bondadhesive tapes from the plaintiffs, instead of direct from the defendants' contract-manufacturer.\n\nFurther, while he gave the plaintiffs 90 days' credit terms and good pricing on the defendants'\n\nbehalf, goods sold to the defendants by the plaintiffs were on a cash basis, without discount. Even\n\nin those instances where credit was extended by the plaintiffs, the defendants' credit period was 30\n\ndays, less than what the plaintiffs were given. She alleged that LYH used the defendants' telex\n\nfacilities to promote the plaintiffs' business. Even if the defendants billed the plaintiffs for\n\nsuch charges, she pointed out that the contacts/contracts LYH established should have been passed\n\nonto to the defendants, not the plaintiffs. She also stopped his practice of putting the wordsUSAon the inner core of the defendants' masking tapes (contract-manufactured by CIC), as she felt it\n\nwas misleading.83. Another allegation Connie Lim levelled against LYH was, that he failed to\n\nprotect the defendants' rights by not registering theHi-Bondmark on their behalf. To refute\n\nher allegation, the plaintiffs then produced documents to prove that LYH did file trademark\n\napplications but they were forNikko, Kawasaki, ApolloandSenisuinotHi-Bond,because the latter mark belonged to the plaintiffs (N/E 375) not the defendants. Apparently, the\n\napplications for the three trademarks were subsequently withdrawn due to objections from the\n\nRegistry, soit was due to no fault of[LYH] (N/E 348). TheHi-Bondapplications which\n\nLYH instructed solicitors to file on behalf of CIC were subsequently abandoned, which act came in\n\nfor further criticism from Connie Lim, apparently because they were filed in the wrong class (class\n\n1 instead of class 16/17). However, as Loytape had assigned their applications (2) for theHi-Bondmark to the defendants, the defendants did not refile the applications initiated by LYH.84. Connie Lim said the defendants learnt that the plaintiffs were selling their\n\nownHi-Bondadhesive tapes only in January 2000, when the plaintiffs attempted to register\n\ntheHi-Bondmark. On the other hand, the plaintiffs were aware that from 1987 onwards, the\n\ndefendants had manufactured and soldHi-Bondadhesive tapes. Even assuming that the\n\nplaintiffs did (through LYH) tell the defendants to stop using the mark in 1997 (which the\n\ndefendants disputed), she noted that they did nothing thereafter for 3 years, before commencing this\n\naction in August 2000.85. It was drawn to Connie Lim's attention that CIC had claimed goodwill and\n\nreputation in theHi-Bondmark (through their solicitors) in April 2000 even though they were\n\nthe defendants' contract-manufacturers. She testified she was aware of the claim and had made it\n\nclear to CIC that if they advertised the mark, the defendants would oppose it. CIC then indicated\n\n(when she spoke to their general manager Koay) they would let their application lapse, which they\n\ndid (on 11 March 2001).86. The defendants' second last witness was their accountant Tan Poh Suan (TPS)\n\nwho has been with the defendants for 14 years, reporting to LYH until 1997, after which she reported\n\nto Connie Lim. She started off with the defendants as their accounts clerk in June 1987. TPS (DW8)\n\ngave a breakdown of the defendants' sales ofHi-BondOPP and masking tapes from October 1986\n\nto December 2000, based on their sales records; she made some adjustments to the figures in her oral\n\ntestimony. TPS tendered to court (exhibitD16) the sales analyses she had prepared, based on\n\ncomputer print-outs she had made from the defendants' records. She explained there was a change in\n\nthe defendants' financial year in that it used to be 1October-30 September until\n\nDecember 1993, when it was changed to 1January-31 December. The defendants' records were\n\ncomputerised in 1987 by LYH and the administration manager.87. Cross-examined, TPS said although she was not too familiar with the\n\ndefendants' products, she remembered their OPP and masking tapes because she had come across\n\ninvoices and later, the product itself (in the course of her stock-taking) in 1987 at the\n\ndefendants' office.88. It would be appropriate at this juncture to look at the defendants' sales\n\nrecords in some detail. TPS repeated the assertion made by Allan Tan and Connie Lim that the\n\ndefendants' documents (including invoices) from 1988 and earlier (save for those relating to the\n\nplaintiffs) had been thrown away. Her analyses inD16relied on the computer records which\n\nthe defendants still maintained, from 12 years ago.89. According to TPS, the staff would feed into the computer system, information\n\nfrom invoices categorised under different products. She agreed with counsel for the plaintiffs that,\n\nif the clerk who keyed in the information made a mistake, then the computerised records would also\n\nbe inaccurate. If there was a computer shut-down, the staff would issue cash bills but subsequently,\n\nthe information therein would still be fed into the computer system.90. The categories inD16comprised inter alia of items like cellulose\n\ntape, star cellulose, hard PVC tape andother PP tapes(which were given the stock code B3).\n\nTPS said that stock code B3 comprisedHi-Bond,ManuliandNopibrands.ApolloPP tapeswere classified under stock code B2 while transparent tapes were separately\n\nclassified under stock code B4 asTransparent P.P.T. TPS then allocated 30% of the categoryother\n\nPP tapestoHi-Bondmasking tapes. She disagreed with counsel's suggestion that the\n\npercentage was arbitrary; it could not be a lower figure say of 5%; because it was impossible for a\n\nfactory to produce such a small quantity (which I accept is the case). TPS pointed out that when she\n\njoined the defendants, the brand was already in use. She also knew (from filing invoices) that the\n\ndefendants sold as much to other parties as to the plaintiffs. Counsel for the plaintiffs then\n\ninquired why some invoices issued to the plaintiffs by CIC showedHi-BondOPP tapes under\n\nstock code B2 (see AB 15-16) whilst in other invoices it was under stock code B4or both\n\n(AB12/14/22). TPS speculated that classificationother PP tapescould cover both B2 and B4.\n\nShe explained that at the time (financial year 1986-87) stock code B2 includedHi-Bondas,\n\nbothApolloandHi-BondOPP tapes were sourced from Loytape. However, she could not\n\nascertain how muchHi-Bondsales there were in the two (2) stock codes nor could she say how\n\nmuchHi-BondOPP tapes came under stock code B3. By 1990-91, the defendants had refined their\n\ncategories so that B3 was confined toHi-BondOPP tapes as,KawasakiOPP tapes were\n\ntransferred therefrom to stock code B1. The defendants classifiedHi-BondOPP transparent\n\ntapes under stock code B7 (for which their counsel conceded the defendants could produce no\n\nsupporting invoices).91. As forHi-Bondmasking tapes, TPS testified they were categorised asE3\n\n-- other masking tape, which also includedKawasakimasking tapes. When her attention was\n\ndrawn to the fact that in 1990, there was a separate classification forKawasakimasking\n\ntapes, TPS explained it was only from that year onwards that the defendants categorised it\n\nseparately as such. Thenceforth,Hi-Bondmasking tapes came under categoryE4. She\n\nacknowledged that the staff could have made a mistake and keyed inHi-Bondmasking tapes\n\nunder categoryE3. Counsel then cross-examined TPS at length on the possible inaccuracy of\n\nthe computerised records. Even if the sales information had been keyed-in incorrectly, TPS said the\n\nproblem would only be one ofwrong (not none) classification(N/E 566) as, sales ofHi-Bondmasking tapes would still be captured in some category other thanE4. I should point out that\n\ncategoryE4appeared in invoices issued by CIC to the plaintiffs, as seen in invoice 087579\n\n(at AB10) dated 19 October 1988. TPS said it was not possible forE4to cover masking tapesother\n\nthanHi-BondbecauseKawasakiandApollotapes had their own\n\nclassifications and, the defendants soldno othermasking tapes. This statement appeared to\n\nbe borne out by the 1990 invoice TPS referred to (AB 110), whereKawasakimasking tape bore\n\nthe stock codeE3whileHi-Bondmasking tape was classified asE4.92. TPS had also produced explanatory notes (D17) to reinforce her figures\n\ninD16.In the course of cross-examination however, it emerged that there may be some\n\nmistakes inD17. Consequently, TPS produced a fresh set of explanatory notes (inD18)\n\nand her earlier set was disregarded.D18was also subjected to intense scrutiny and\n\ncross-examination by counsel for the plaintiffs, again on the lack of documentary evidence to link\n\nthe print-outs to sales ofHi-Bondproducts. This omission came in for heavy criticism by the\n\nplaintiffs in their final submissions (see paras 463 to 493) who contended that the figures were\n\nunreliable. TPS agreed with counsel's suggestion that there could be mistakes in keying-in the codes\n\nfor the various products sold by the defendants. However, she disagreed that there could be mistakes\n\nin the computer records themselves. On being questioned by the court, TPS confirmed (N/E 586) that\n\nthe computer print-outs were based on invoice records.93. With the consent of the plaintiffs, the evidence of the defendants' last\n\nwitness Gan Wee Siong (DW9) was accepted without the need for cross-examination. He was the private\n\ninvestigator instructed by the defendants to make trap purchases (see para 17supra) from the\n\nplaintiffs ofHi-Bondadhesive tapes and sealants as well as ofMopisuper glue, on 28\n\nJune 2000.",
        "The findings": "114. Bearing the above legal principles in mind, I turn now to the facts of this\n\ncase. I shall first set out my findings on the evidence before I address other issues that arose in\n\nthe course of trial.(i) the evidence115. The key witnesses in this battle were LYH and Dua Beng for the plaintiffs\n\nwhile for the defendants it was Connie Lim. However, the plaintiffs' stance on Dua Beng was unusual\n\n instead of examining Dua Beng as their own witness, their counsel cross-examined him. Further,\n\nin their final submissions (paras 365 to 382) the plaintiffs sought to discredit his testimony save\n\nwhere it favoured them (para 471). Having heard his testimony and seen his demeanour however, I am\n\nof the view that Dua Beng was a truthful albeit reluctant, witness. He was reticent and did not\n\nvolunteer information readily but, when asked, he answered questions in a forthright manner. As an\n\naside, I should add that the veracity of Dua Beng in relation to what he said about termination of\n\nthe plaintiffs'Altecosuper glue distributorship was confirmed by an unexpected source,\n\nalthough his year 1993-94 was incorrect. The defendants bundle of authorities included the case\n\nofAlteco Chemical Pte Ltd v Choong Yean Wah t/a Yamayo Stationery Manufacturer[2000] 1 SLR 119. In that case, the Singapore offspring of the Japanese parent manufacturers of Alteco super\n\nglue, sued a local sole-proprietorship for passing off her glue product as Altecos 3gm super\n\nglue, by using a similar get-up of tube card packaging as the plaintiffs' special SG-12. It was the\n\nevidence in that case that the Singapore company sold their product in the special SG-12 get-up,\n\nthrough their exclusive distributor who were the plaintiffs, up until 1991. The company started\n\nmanufacturing glue in Singapore in the SG-12 get-up in January 1990 and, made its first sales in\n\nSingapore in July 1990.116. My assessment of LYH as a witness is far different from my appraisal of Dua\n\nBengs testimony. Earlier (para 51), I had commented on the testimony of his younger brother Ling;\n\nLYHs testimony was even less satisfactory  he took liberties with the truth and shifted his\n\nstance whenever it suited him to do so, prompting the court at one stage (N/E 83) to remind him he\n\nwas under oath. Based on Dua Beng's testimony as well as that of Loo (DW1), whom I had earlier\n\nindicated (para 57) was a totally impartial witness, I have no doubt that LYH was capable of and\n\nresponsible for, attempting to alter the dates in various documents to tailor them to fit the\n\nplaintiffs' case, including PB3, P17, P34, P35. Indeed, in the case of PB3, I would go further to\n\nsay that the document was created by LYH to give the false impression that the plaintiffs applied\n\nfor registration of theHi-Bondmark on 5 February 1979; that application could not have\n\nexisted even as at 5 December 1979 as the plaintiffs did not have that design of the mark yet. I\n\nstrongly believe that PB3 was created by LYH from the plaintiffs' later (and exact same) application\n\ndated 28 October 1987 (PB7) as, Loo had testified that such a TM6 form (if indeed it was submitted)\n\nwould bear the Registry's rubber stamp of the date of submission and no copy would be given to the\n\napplicant; further, the Registry's address at Colombo Court did not exist until March 1987. Again,\n\nrelying on Loo's testimony (para 56supraand N/E 259), it is my finding that the application\n\nin PB7 was never even submitted to the Registry. Such conduct, bordering on dishonesty, totally\n\ndiscredits the testimony of LYH. There is little doubt that he drafted the self-serving documents inP36and PB94.Contrary to his denials, I also believe that LYH was summarily dismissed\n\nby the defendants in July 1997 for breach of fiduciary duties. Otherwise, he could/should have sued\n\nthe defendants for wrongful dismissal.117. Although the plaintiffs in their final submissions sought to persuade the\n\ncourt otherwise (paras 211-213), I am of the view that the act (on the instructions of LYH) of\n\nputting the wordsUSAon the inner core ofHi-Bondmasking tapes sold by the\n\ndefendants and (later) the plaintiffs, was meant to deceive the public and give the (wrong)\n\nimpression that the products were manufactured in the United States instead of Malaysia and China\n\nrespectively. I do not accept the explanation (N/E 268) of LYH that the paper (jumbo pack) to make\n\nthe plaintiffs' tapes came from the States as, no supporting evidence was produced. Such conduct,\n\ncoupled with the fact that the plaintiffs were sued by CIC and fined $100,000 for infringement of\n\ntheApollotrademark and, the plaintiffs had requested Indonesian manufacturers to produceHunterandClipperbrand tapes (which trademarks they neither own nor were licensed to use), are\n\ntelling reflections of his character. I disagree with the plaintiffs' contention that Connie Lim\n\nmade wild allegations when she testified that LYH threw away a lot of the defendants' documents\n\nbefore he left the company. I believe he is quite capable of such acts and that LYH may have planned\n\nwell in advance for the plaintiffs and himself (as the major shareholder) to take away the\n\ndefendants' trademark(s). It is indeed strange that the only invoices that the defendants still had\n\nand were able to produce in court pertained to sales they made to the plaintiffs and no one else.118. Although Dua Beng was the plaintiffs' managing-director, there is no doubt\n\nthat LYH dominated him and, was the controlling force behind the company long before LYH joined the\n\nplaintiffs officially in 1997. The evidence of Toh (DW5) which I accept was, that LYH was seen in\n\nthe premises of the plaintiffs every month from 1980 onwards and with increasing frequency in later\n\nyears; this was well before he left the defendants' employment in July 1997. What would the general\n\nmanager and subsequently a director of the defendants, be doing so often in the premises of another\n\ncompany which engaged in trade similar to the defendants, if not to further the latter's business at\n\nthe expense of the former?119. As for the other witnesses of the plaintiffs, I have already observed that\n\nthe testimony of Ling (PW4) and Ang (PW5) could not be considered unbiased while Mew's (PW2)\n\ntestimony was largely hearsay, for the reasons set out in para 33.120. In contrast to the plaintiffs' witnesses, the testimony of the defendants'\n\nwitnesses was more credible and consistent with whatever documents there were. They had an\n\nindependent witness in Loo while other witnesses such as Toh (DW5) and Allan Tan spoke the truth\n\nnotwithstanding that they distribute the defendants' products and work for the defendants\n\nrespectively. I am also of the view that Lim (DW3) would have no reason to testify other than to the\n\ntruth, as he works for Loytape. Although counsel for the plaintiffs cross-examined TPS (DW8) at\n\nlength on her calculations, it was more on the basis that her figures were inaccurate due to wrong\n\nclassification of products sold by the defendants; it was not a case of the defendantsnot having\n\nsoldHi-Bondproducts at all (see para 94supra), since her computation was based\n\non the defendants' computerised records of invoices.121. As for the alleged oral agreement pertaining to the conditions imposed on\n\nthe defendants for the use of theHi-Bondmark, I am of the view that it never existed; it\n\nwas a pure concoction on the part of LYH and his brother Ling to improve the plaintiffs' case. It\n\nwas impossible to pin either of them down to a specific year let alone month, of the alleged\n\nagreement as the dates shifted from 1988 to 1990, depending on who gave evidence and in what\n\nconnection. Dua Beng (and Allan Tan) had testified that a meeting did take place in 1987-88 but, he\n\ncould not be sure who came up with the wordHi-Bondor why. Neither could Dua Beng recall he\n\nor anyone else saying that the mark belonged to the plaintiffs and, that permission to the\n\ndefendants to use the mark could be withdrawn at anytime. It was not for LYH or his brother to speak\n\nfor the plaintiffsbefore July 1997as they then worked for the defendants. I am equally\n\nsceptical that there was a telephone request from LYH to Allan Tan in August 1997 to cease using theHi-Bondmark; in any case this allegation was denied by Allan Tan. If indeed the defendants\n\nwere the plaintiffs' contract manufacturers as LYH/the plaintiffs claimed, it did not make sense for\n\nthe plaintiffs to write to CIC to stop manufacturingHi-Bondproducts, by their letter inP36(25 July 1997); the letter should have been addressed to but, was not even copied to the defendants,\n\nwho had to be faxed a copy by CIC.",
        "The submissions": "(i) the plaintiffs' submissions95. Before making my findings, it would be useful to look at the final\n\nsubmissions of the parties for their respective claim and counterclaim; I start with the plaintiffs'\n\nsubmissions. They asserted that they were the first to use (in 1979) theHi-Bondmark as,Mopi\n\nHi-Bond.As far as sealants and glues are concerned, they contended that they were the first to\n\nuse theHi-Bondmark in the Singapore market, as reflected in their Yellow Pages\n\nadvertisements (for 1980-81) and which the defendants conceded in their amended pleadings; this was\n\nalso admitted by Allan Tan (N/E 307); first usage of the mark was a crucial factor. Moreover, the\n\ndefendants' own documents showed that they obtained supplies ofHi-Bondglue from the\n\nplaintiffs in 1980. Later (October 1988 to January 1990), there were invoices of sales ofHi-BondOPP tapes from the defendants to the plaintiffs. These documents (produced by the defendants) showed\n\nthere must have been a contract-manufacturing arrangement as the plaintiffs asserted, namely that\n\nthat the defendants manufactured for them. In this regard, the plaintiffs submitted that Connie Lims\n\nexplanation that LYH had thrown away all other invoices was convenient but not plausible-that LYH would systematically destroy all invoices of the defendants save for\n\nthose issued to the plaintiffs. Further, there would be no reason for settling onHi-Bondas\n\nthe mark to be used, if such an agreement did not exist.96. The plaintiffs pointed out that the defendants had not explained why they\n\nallegedly chose theHi-Bondmark for use on adhesive tapes in 1987/88. The plaintiffs had\n\nused the mark longer too (since 1981) whereas the defendants first used it only from 1987 onwards\n\n(although this was disputed by the plaintiffs) and they did not advertise the mark before 1998 (as\n\nadmitted by Connie Lim). The plaintiffs were also the first to apply for registration of theHi-Bondmark and were proprietors (in 1979) of theMopi Hi-Bondmark. Further, the plaintiffs had\n\nabout 15 items in the market bearing the mark as against 3 for the defendants. All these factors\n\npointed to the fact that the plaintiffs were the originators of the mark.97. Although he was their witness, the plaintiffs urged the court to ignore the\n\ntestimony of Dua Beng which they contended was unreliable, as it changed in the course of\n\nexamination-in-chief, cross-examination and re-examination. Even so, the court was asked to accept\n\npart of his evidence-that the plaintiffs had used the simpleHi-Bondmark on super glues in 1982-83 as Dua Beng's testimony (confirmed by Ling) on this issue did not\n\nchange during cross-examination; the wordMopiwas dropped from the markMopi Hi-Bondshortly after the super glue was introduced into the market.98. The plaintiffs contended that it was improper of the defendants to allege\n\nthat the plaintiffs had fraudulently traded inAltecoglues (see paras 35 and 37 of the\n\ndefendants' submissions) whenit was not part of the defendants' pleaded case. In any event,\n\nthe defendants had no knowledge of the distribution terms between Alteco and the plaintiffs.\n\nAlthough Dua Beng had testified that the plaintiffs had deliberately pastedMopi Hi-Bondstickers overAltecobottled glue, there was no evidence that it was done surreptitiously\n\nwithout the consent of Alteco. In this regard the plaintiffs urged the court not to accept the\n\ntestimony of Toh (DW5) as it was preposterous to believe that the plaintiffs could have replaced the\n\nstickers due to their fear, over a span of 14 years, that Alteco would take away their\n\ndistributorship. Such conduct would also contradict the plaintiffs' intention to develop theHi-Bondbrand.99. Contrary to the defendants contention that the oral agreement between the\n\nparties in 1987/88 was a figment of their imagination (merely because their witnesses were not\n\ncertain of the date), the plaintiffs pointed out that their solicitors (Tang & Tan's) letter\n\ndated 2 December 1998 to the Registry had stated that CIC and Loytape had licences from the\n\nplaintiffs to use the mark. By then, the plaintiffs had contract-manufacturedHi-Bondtapes\n\nfrom Taiwan and Canada. What was noteworthy was the fact that the mark was never used before the\n\nmeeting. Consequently, how could it belong to the defendants as Allan Tan had asserted? Indeed, he\n\nhad admitted that it was either LYH or Ling who came up with the suggestion to useHi-Bondon\n\nthe OPP tapes the defendants produced for the plaintiffs. It was also inconceivable that Allan Tan\n\ndid not know that the plaintiffs were obtaining supplies ofHi-Bondadhesive tapes from\n\nparties other than the defendants. Neither did the defendants explain why they failed to respond to\n\nthose sales between 1987 and 2000. Their conduct was inconsistent with that of a party asserting its\n\nrights to a trademark. This was to be contrasted with the plaintiffs' conduct  since 25 July 1997\n\n(by the plaintiffs' letter to CIC inP36), the defendants were aware that the plaintiffs had\n\nobjected to the latter's use of theHi-Bondmark on any products. Hence, it was the\n\ndefendants not the plaintiffs, who were guilty of delay, laches and acquiescence. In any case, the\n\ndefendants were not prejudiced by the alleged delay of only 3 years (largely due to the Asian\n\nfinancial crisis and the change in management of the plaintiffs) as no great changes or impact\n\nhappened to the mark or trade in that interval. Mere delay is not a bar to the grant of an\n\ninjunction unless it is a bar to a legal right. The defendants' complaint that they could not obtain\n\nthe assistance of CIC for the trial was not sustainable. In any case, CIC are themselves claiming\n\nrights over theHi-Bondmark despite being only the defendants' contract manufacturers.100. The plaintiffs repeated the above submissions for theHi-Bondmasking\n\ntapes. They disagreed with the defendants' argument (relying onAnheuser-Busch Inc v Budejovicky\n\nBudvar NP[1984] FLR 413) that the plaintiffs only had sporadic and occasional sales, which did\n\nnot constitute the carrying on of a business in which there is goodwill. In his written testimony (para\n\n28), LYH had set out the figures for the plaintiffs' sales ofHi-Bondproducts; they totalled\n\n$5,665,084 for the years 1997-99 of which 60% ($3,399,050.40) comprised of adhesives. The plaintiffs\n\nalso had evidence of ordering substantial quantities ofHi-Bondproducts (including adhesive\n\ntapes) from suppliers for the same period.101. As to the credibility of the witnesses, the plaintiffs urged the court to\n\naccept that the memory of some witnesses (no particulars provided) may not be very good because of\n\nadvanced age. The witnesses were however forthcoming in their answers and admitted openly where\n\ntheir affidavit evidence was inaccurate. The plaintiffs strongly objected to the impugning of the\n\ncredit of LYH by the defendants. In particular the plaintiffs denied that LYH had doctored the\n\ndocuments; in any event, the alleged doctoring/falsification is irrelevant and not material. The\n\nplaintiffs had acted honestly throughout the trial and had given discovery of all documents in their\n\npossession, even those which had pencil markings or corrections on some of the file copies. It was\n\nto their credit that the plaintiffs did not try to remove the pencil markings.102. The defendants' witnesses on the other hand, were alleged by the plaintiffs\n\nto be forgetful, evasive, not forthcoming in their answers and, sometimes made allegations which\n\nproved to be false (referring in particular to Connie Lim). Criticisms were also levelled against\n\nAllan Tan's testimony as well as that of Toh, Ong and Tan.103. As for the Counterclaim, the plaintiffs pointed out that the defendants were\n\nnot even sure which mark they were claiming goodwill over  in para 16 of their (amended)\n\nCounterclaim, the defendants claimed goodwill over the specialHi-Bondmark (item 3 inD3).\n\nHowever, in the course of trial (N/E 370), after the plaintiffs had closed their case, their counsel\n\nsought to amend the defendants' pleadings to include goodwill over any other variation of theHi-Bondmark.104. The plaintiffs submitted that the alleged goodwill generated by the\n\ndefendants in the form of advertisements and trade was also not substantiated since, Connie Lim had\n\nadmitted (N/E 317) that there was no advertisementbefore1998 which referred to any tapes or\n\nproducts from the defendants bearing theHi-Bondmark. TPSs testimony (NE 599) that the\n\ndefendants had engaged in various promotions and advertisements of the mark (Evergreen trade\n\nmagazine, Stationery World publication. Tradelink, promotional mugs) was not substantiated. In\n\ncontrast, the plaintiffs had advertised the mark since 1980.",
        "(ii) the defendants' submissions": "105. On their part, the defendants inter alia, criticised the plaintiffs\n\nconduct of this case as though the plaintiffs had a proprietary right to the trademarkHi-Bond.The\n\ndefendants further alleged that the plaintiffs misrepresented their products as having been in\n\nexistence earlier than when they were actually introduced into the market, pointing out that some of\n\nthe plaintiffs products did not exist until May 1987 and in other cases, until July 1997. In this\n\nregard, the defendants relied on the testimony of Dua Beng and Toh. The defendants also accused the\n\nplaintiffs (in particular LYH) of doctoring or falsifying documents, again relying on Dua Bengs\n\ntestimony.106. It was also pointed out by the defendants that the plaintiffs changed their\n\nposition on two (2) material points namely, the year of the alleged oral agreement and, the year of\n\nthe alleged use of theHi-Bondmark in 1986 on OPP and masking tapes made in Taiwan and\n\nCanada respectively. In their pleadings (para 5 of the statement of claim) the plaintiffs alleged\n\nthat the oral agreement was made in or about but notbefore1990. In discovery, the\n\ndefendants gave the plaintiffs copies of invoices (AB1-1102) evidencing sales ofHi-BondOPP\n\nand masking tapes in 1988. Knowing that their allegation of an oral agreement in 1990 would not be\n\nsustainable, the plaintiffs then shifted the date of the oral agreementforward(closer to\n\n1988), in their Further and Better Particulars dated 9 January 2001. For the same reason, the\n\nplaintiffs' witnesses (LYH and his brother Ling) in their written testimony deposed that they used\n\ntheHi-Bondmark on the plaintiffs' productsbeforethe defendants' usage on OPP and\n\nmasking tapes in 1987 and 1988 respectively.107. The defendants submitted that the credibility of the plaintiffs' witnesses\n\nwas highly suspect. They singled out the plaintiffs' star witness LYH as one witness who either lied\n\nor feigned ignorance on several occasions and whose evidence on crucial issues in particular on the\n\ndoctored documents, was evasive or vague. The testimony of Mew, (PW2), Ling (PW4) and Ang (PW5) also\n\ncame in for varying degrees of criticism. Instead, the defendants urged the court to accept the\n\ntestimony of Dua Beng (PW3) as coming from someone who was a founder and managing-director of the\n\nplaintiffs, upon whom the plaintiffs relied especially for glues and sealants. He was also the man\n\nwho knew of the use of the markHi-Bond, on which products and at which point in time. The\n\ndefendants submitted that it was wrong of the plaintiffs to insinuate that Dua Beng's testimony was\n\nuntruthful because he had allegedly imposed conditions for being their witness, which allegations\n\nDua Beng had refuted .108. As the defendants neither make nor sell glues or sealants (as acknowledged\n\nby the plaintiffs' various witnesses) the plaintiffs' claim for actionable misrepresentation should\n\nbe limited to only adhesive tapes. The plaintiffs' goodwill in this regard would relate to two (2)\n\npossible periods namely, before May 1987 and after July 1997. The first period related to the time\n\nwhen the defendants first started to useHi-Bondon OPP tapes while the second period related\n\nto the time when the plaintiffs allegedly terminated the oral agreement which gave the defendants\n\nthe licence to use the mark. That would mean that until July 1997, there was no passing off because\n\nthe usage by the defendants was with the plaintiffs' consent.109. As it was/is the defendants' case that there was no such oral agreement, it\n\nmeant that the relevant date would be up to May 1997. At that juncture, the defendants question,\n\nwhat goodwill the plaintiffs could have had, since the markHi-Bondwas not then used by them\n\non any glues, sealants or adhesive tapes? Relying again on Dua Beng's testimony as well as on the\n\ninvoice dated 22 January 1988 of Commercial Supplies (Far East) Pte Ltd (P29) to the\n\nplaintiffs, the defendants asserted that the plaintiffs first usedHi-Bondon sealants in\n\n1988, by which time the defendants hadalready usedit on adhesive tapes; hence the\n\nplaintiffs had no goodwill.110. The defendants did an analysis of the plaintiffs' various products as\n\nreflected in the supplementary agreed bundle of documents(SAB1-927)and ascertained\n\nthat there was no evidence of the use of theHi-Bondmark on:(i) super glues for the period 1991-2000;(ii) wood glue before 1993 or after 1996;(iii) sealants before 1991 and after 1996;(iv) OPP tapes after 1993;(v) PTFE or DSCT tapes after 1997;(vi) PVC tapes after 1996.The defendants submitted that the sum total of the documentary evidence adduced\n\nfrom the documents in 4AB1-927 was, that the plaintiffs had no sales of glues, sealants or adhesive\n\ntapes (save for DSFT) after 1996.111. Consequently, the defendants argued, the plaintiffs had no sales between\n\n1997-2000 to prove goodwill. The defendants reinforced their submission by pointing out that the\n\nplaintiffs had only one Yellow Page advertisement for 1996 and 1997, forHi-Bondadhesives/sealants but not adhesive tapes. However, they had advertisedHunteradhesive tapes\n\nin those years. This led to the irresistible conclusion that the defendants, not the plaintiffs, own\n\ntheHi-Bondmark for adhesive tapes.",
        "The law": "112. I turn next to the law. The defendants quite rightly pointed, out that in a\n\ncommon law action for passing-off, the proprietorship in a mark has no relevance. Consequently, the\n\nplaintiffs submissions pertaining to their applications for registration of various trademarks on\n\nvarious dates, has no relevance to the issue of passing off. Neither does the fact that the\n\nplaintiffs may have attempted to register the mark first necessarily mean (as they contended) that\n\nthey were the originators of the mark. Conversely, the fact that the defendants did not attempt to\n\nregisterHi-Bondas a mark until 1996 does not necessarily mean that they do not enjoy\n\ngoodwill in the mark. The concept of passing-off can be succinctly stated in the proposition that no\n\nman may pass off his goods as those of another. What the plaintiffs must prove to succeed in an\n\naction for passing-off is the 'classical trinity' (derived from the 'Jif lemon'case ofReckitt\n\n& Colman Products Limited v Borden Inc[1990] RPC 341at p 406):(i) he must establish agoodwill or reputationattached to the goods or\n\n  services which he supplied in the mind of the purchasing public by association with their\n\n  identifying get-up;(ii) that there wasmisrepresentationby the defendant to the public\n\n  (whether or not intentional) leading or likely to lead the public to believe the goods or services\n\n  offered by him were the goods or services of the plaintiff, and(iii) that he was suffering or was likely to sufferdamageby reason of\n\n  the erroneous belief engendered by the defendant's misrepresentation.It was irrelevant whether or not the public was aware of the plaintiff's identity\n\nas the manufacturer or supplier of the goods in question, as long as they were identified with a\n\nparticular source.113. The goodwill relevant in a passing-off action was not in the mark, logo or\n\nget-up. It was the goodwill between a trader and his customers which was protected. Unlike\n\nreputation, it did not exist on its own and it attached to a business (seeCDL Hotels v Pontiac\n\nMarina Pte Ltd[1998] 2 SLR 550at p 551). Hence, the relevant date of such goodwill must be the\n\ndate when the defendants carried out the acts complained of by the plaintiffs. As for\n\nmisrepresentation, the plaintiffs must prove that the defendants passed off their goods as the\n\nplaintiffs, alternatively, that the defendants or their goods have become associated with the\n\nplaintiffs. In determining whether there had been misrepresentation in a passing-off action, it was\n\nnot necessary that there should have been any confusion occasioned by the misrepresentation,\n\nalthough confusion was of great evidential value (CDL Hotels v Pontiac Marina Pte Ltdp 551).\n\nI should point out that in the light of Angs (PW5) testimony, there was no evidence of actual\n\nconfusion at all in this case.",
        "(ii) the decision": "122. Based on the evidence adduced from Allan Tan, Lim, Toh, Ong and Tan coupled\n\nwith the figures produced in court by TPS, I find that the defendants first soldHi-Bondtapes in particular, OPP tapes in 1987, followed by masking tapes a year later.123. As for the plaintiffs, they used the markMopi Hi-Bondon super glues\n\nin 1979; however, they did not useHi-Bonditself as a mark on their products until some time\n\nin 1988. They continued their use ofMopi Hi-Bondas a mark until at least March 1992 (based\n\non the invoice at AB1367 of Leonie Trading Company for printingMopi Hi-Bondstickers). Use\n\nofHi-Bondas a mark by the plaintiffs could not have been earlier (namely after 1980 as LYH\n\nclaimed) since Dua Beng (who was in charge of trademark applications) had himself written to the\n\nRegistry in April 1989 to say that the plaintiffs had first used theHi-Bondmark in 1988.\n\nSuch contemporaneous correspondence between the plaintiffs and the Registry would surely reflect the\n\ntrue position, unlike self serving letters drafted/written by LYH after July 1997, such as PB94 (para\n\n40supra). Given my comments in para 81 above, I also find that the defendants' product\n\nbrochure (D1) preceded the plaintiffs' brochure by at least 4 years (1991) and that the\n\nlatter could not have been produced earlier than September 1995. Consequently, it is the defendants\n\nnot the plaintiffs, who had/have the goodwill in the markHi-Bondwhatever the get-up and\n\ndesign. It was the defendants who first used the specialHi-Bondmark on their adhesive\n\ntapes; the plaintiffs copied that distinctive mark for their adhesive tapes and for their (carton\n\nbox) packaging (seeP16).124. The defendants had in court and in their current pleadings (para 2 of the\n\nre- amended Defence and Counterclaim) abandoned their earlier stand that they were the first to use\n\ntheHi-Bondmark on glues and sealants. That concession accords with my finding that the\n\nplaintiffs were the first to use the mark togetherwiththe wordMopion glues and\n\nsealants but, not on adhesive or other tapes.125. I accept the defendants' submission that whatever goodwill the plaintiffs\n\nmay have enjoyed for their adhesive tapes may not have been genuine in any event  their masking\n\ntapes bore the wordsUSA(which would have deceived unsuspecting members of the public into\n\nbelieving they were buying an American product) while their earlier sales of bottledMopi Hi-Bondsuper glue containedAlteco, not their ownMopiproduct.126. Accordingly, the plaintiffs' claim is dismissed with costs to the\n\ndefendants. In the light of my finding, there is no necessity to consider whether the plaintiffs\n\nwould have been guilty of laches and acquiescence for not taking action against the defendants for\n\nthree (3) years after LYH had joined them.127. The defendants are awarded interlocutory judgement (with costs) on their\n\nCounterclaim and a permanent injunction is granted against the plaintiffs in terms of prayer 1 of\n\nthe reliefs claimed, restraining the plaintiffs inter alia, from manufacturing for sale and passing\n\noff adhesive tapes as those of the defendants under the markHi-Bond.The plaintiffs/their\n\nagents are further directed to withdraw all pending trademark applications relating to the wordHi-Bondand are prohibited from re-filing applications to register the mark in Singapore and elsewhere.\n\nIn addition, the plaintiffs are required to deliver up to the defendants (within 7 days of the\n\nrelease of this judgment) all their stocks of adhesive tapes bearing the markHi-Bondwhether\n\nheld by them or by their agents (including their distributors). The defendants are further granted\n\nan order in terms of prayer 5 (for discovery) of their reliefs claimed. There will be an inquiry for\n\ndamages pursuant to prayer 6 of the counterclaim or, at the defendants' option, an account of the\n\nprofits made by the plaintiffs arising from all acts of passing off theHi-Bondmark, with\n\nthe costs of such assessment or inquiry to be reserved to the Registrar.",
        "Offers to Settle": "128. It was drawn to my attention by counsel upon my recent inquiry, that the\n\nparties had made Offers to Settle to one another. The plaintiffs' Offer to Settle was dated 21\n\nFebruary 2001 whereas the defendants' Offer to Settle was dated 23 February 2001; both offers were\n\nrejected. As I have dismissed the plaintiffs' claim, I need only consider the defendants' Offer to\n\nSettle which was in the following terms:-1. the plaintiffs cease use of the Hi-Bond mark in any variant for adhesive\n\n  tapes and submits by way of a consent judgment to an injunction in terms of Prayer 1 of the\n\n  Amended Defence and Counterclaim dated 14 February 2001 limited to Hi-Bond;2. the plaintiffs to pay the defendants party and party costs of the action\n\n  which are to be taxed if not agreed;3. the plaintiffs withdraw all pending trade mark applications in class 16 or\n\n  17 for adhesive tapes for the Hi-Bond mark in any variant and agrees not to file any such\n\n  applications in the future for so long as the defendants use the Hi-Bond mark in any variant for\n\n  adhesive tapes;4. the plaintiffs' claim be discontinued.129. Pursuant to O 22A r 9(3) of the Rules of Court, as the defendants' Offer to Settle was no\n\nless favourable than what has been awarded to them, they are entitled to their costs against the\n\nplaintiffs (on both the claim and counterclaim) on a party to party basis up to and including 23\n\nFebruary 2001; thereafter the defendants are entitled to their costs on an indemnity basis.Sgd:LAI SIU CHIUJUDGECopyright  Government of Singapore."
    }
}