{
    "case_title": "Tan Bock Huat v Public Prosecutor",
    "ncitation": "[2001] SGHC 59",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The charge": "2 The charge, as amended by the prosecution at the close of the prosecutions\n\ncase, read:You, Tan Bock Huat, (Male/48, NRIC S0123096D) are charged that you, on a day in\n\n  March 1998, at a coffee shop along Eunos Crescent, in Singapore, together with one Tan Wah and in\n\n  the furtherance of the common intention of both of you, did corruptly offer one Chee Han Boon\n\n  Michael, a gratification of a sum of $15,000 (fifteen thousand dollars), as an inducement to\n\n  assume criminal liability for yourself for an offence under s 5(1) of the Employment of Foreign\n\n  Workers Act (Cap 91A), for the illegal employment of a total of 4 workers at a work site in Bishan\n\n  Street 13, and you have thereby committed an offence punishable under s 5(b)(i) of the Prevention\n\n  of Corruption Act (Cap 241) read with s 34 of the Penal Code (Cap 224).The offence carries a fine not exceeding $100,000 or imprisonment for a term not\n\nexceeding five years or both.",
        "The facts": "3 The largely undisputed background facts were as follows. The appellant and Tan\n\nWah (\"Tan\") were both renovation subcontractors at the material time. The appellant\n\nsubcontracted a project at Bishan using the name of Tans construction company. With Tans\n\npermission, the appellant also used the latters company letterhead for correspondence. Tan was\n\nnot involved in the day to day operations at the work site which was under the appellants\n\ncontrol.4 Tan \"lent\" the appellant twelve Thai workers for the project. They\n\nwere arrested on 19 December 1996 as they turned out to be illegal immigrants. Another five\n\nMalaysian workers were also arrested at the work site on the same day. The Malaysians were in turn\n\nreferred to the then Ministry of Labour (MOL). MOL subsequently released the five Malaysians whilst\n\nthey conducted their investigations. They returned to the site and continued to be employed there.\n\nMOLs investigations however, did not keep pace with the investigations conducted by the police in\n\nrelation to the twelve Thai workers.5 Prior to 19 December 1996, an arrangement was made between Tan and one Michael\n\nChee (\"Chee\") whereby Chee was to \"take the rap\" or to act as the \"Tua Pek\n\nKong\" and assume responsibility in the event of any charges for employment of illegal Thai\n\nworkers. From October 1996, Tan paid various sums of money to Chee amounting to $11,000. In\n\naddition, he paid Chee a further $8,000 after the arrest of the workers.6 After the arrests, Tan introduced Chee to the appellant as the \"Tua Pek\n\nKong\". Tan agreed to pay Chee about $20,000 for acting as the \"Tua Pek Kong\" with\n\nregard to the arrested workers. Initially, the appellant did not know about this payment\n\narrangement. Nevertheless he agreed to assist in the plan and briefed Chee about the nature of the\n\nwork done by the seventeen foreign workers. He also brought Chee to the site so that the five\n\nMalaysian workers could identify the latter as their boss. Tan told Chee to say that the appellant\n\nwas engaged as a foreman at the site. During the investigations, the appellant also stated that he\n\nwas their supervisor.7 Chee was subsequently charged by the police under s 57(1)(e) of the Immigration\n\nAct (Cap 133) for illegally employing the twelve Thai workers. He pleaded guilty and was sentenced\n\nto a total of fourteen months imprisonment. He completed serving his sentence in January 1998.\n\nSometime in February 1998, after Chees release from prison, MOL preferred five charges against\n\nhim in relation to the employment of the Malaysian workers. Chee then realised that the MOL charges\n\nwere still outstanding. At the same time, the appellant was charged with abetting Chee in the\n\ncommission of those offences.8 Subsequently, on a day in March 1998, Tan, Chee and the appellant had a\n\ndiscussion at a coffee shop in Eunos with the intention of resolving the outstanding MOL charges.\n\nChee agreed to accept $15,000 for being the \"Tua Pek Kong\" in respect of the charges.\n\nHowever, he later changed his mind in court and denied being the employer of the five Malaysian\n\nworkers. Further investigations were then conducted, leading to the present corruption charge\n\npreferred against the appellant.9 As a result of these further investigations, Tan was also charged with and had\n\nearlier pleaded guilty to various offences including two corruption charges relating to the illegal\n\nemployment of seventeen workers. A charge of corruptly offering Chee a sum of $15,000, in\n\nfurtherance of the common intention of Tan and the appellant, as an inducement for assuming criminal\n\nliability for the illegal employment of the five Malaysian workers, was also taken into\n\nconsideration for the purposes of sentencing. Tan was sentenced to an aggregate of twenty-six months\n\nimprisonment, which he is currently serving.",
        "The defence": "20 In court, the appellant denied that he was the employer of the five Malaysian\n\nworkers. He testified that the workers were supplied by Tan who was the actual employer of all of\n\nthem. He was merely a supervisor at the site and referred to Tan as his \"boss\". This\n\ncontradicted the earlier concession made by his counsel, who had informed the court, presumably on\n\nthe basis of instructions given by the appellant, that there was no dispute that these workers\n\n\"belonged\" to the appellant in 1996 and that Tan was aware of this.21 The appellant admitted that he did not at any time inform anyone that Tan was\n\nthe actual employer of the Malaysian workers, even after Chee resiled from \"taking the\n\nrap\" for the MOL charges. At the same time however, he admitted that he was in charge of\n\nemploying or retaining workers on Tans behalf and that Tan \"had delegated all the things to\n\n[him] at the work site with regard to these workers\". He also admitted that he had briefed Chee\n\nabout the duties of the Malaysian workers, introduced Chee to them as their boss and instructed them\n\nto inform the court that Chee was their boss.22 As regards the material meeting at a coffee shop in Eunos, the appellant did\n\nnot deny that such a meeting took place. However, he claimed that the meeting was arranged by Tan.\n\nIt was his evidence that there was no such offer of $15,000 made by him to Chee. He had overheard\n\nChee mentioning that Tan had offered him $15,000. However he did not take part in the discussion and\n\ndenied that Tan had agreed to contribute $7,500 out of goodwill for him. As the appellant had\n\nalready been charged for abetting Chee in the commission of the offences, the $15,000 was for Tans\n\nown protection only; it was not intended for Chee to assume criminal liability on behalf of the\n\nappellant. He further relied on the argument that Chee was not in a position to assume liability on\n\nhis behalf since both of them had been charged in connection with the same offence. All the\n\nappellant intended to do was to ask Tan for assistance in engaging counsel and paying legal fees.",
        "The decision of the district judge": "23 The district judge stated that there was no question that the \"Tua Pek\n\nKong\" scheme was corrupt. The only issue before the court was factual, i.e. whether the\n\nappellant was a co-offeror, together with Tan, of the $15,000 to Chee. After reviewing the evidence,\n\nthe district judge held that the appellants culpability was clear.24 The district judge accepted Tans and Chees testimony, noting that he had\n\nno reason to doubt their credibility. On the other hand, he found the appellant to be an unreliable\n\nwitness who had crafted his testimony largely with the benefit of hindsight. In his view, the\n\nappellant was the actual employer of the five Malaysian workers. The district judge concluded that\n\nit did not ultimately matter to Chee whom he was assuming liability for. Chee had agreed to be the\n\n\"Tua Pek Kong\" in any event, as long as Tan and the appellant needed someone to pretend to\n\nbe the employer of the seventeen workers.25 The appellants argument that there was no attempt made by any party to\n\nshield the appellant from the fact that he was the supervisor who assisted in the employment of the\n\nworkers at the work site was described by the district judge as a \"disingenuous\"\n\nsubmission and rejected. In his view, both Tan and the appellant agreed to pay Chee $15,000 at the\n\ncoffee shop. It was their common understanding that Chee was to undertake liability for them in\n\nrelation to the MOL charges to settle the matter once and for all. Tan and the appellant must have\n\nbelieved that Chee would be the only one assuming any liability, otherwise there would have been no\n\nreason to offer him the $15,000. In his view, the parties had no conception of the legal and\n\nprocedural distinctions and had not anticipated that the appellant could still be charged for\n\nabetting Chee. They had understood the arrangement to mean that only Chee would be solely liable.\n\nThe district judge accordingly convicted the appellant of the amended charge.",
        "The appeal against conviction": "26 Mr Yap, counsel for the appellant, sought to persuade me to overturn the\n\nconviction by relying on the following arguments:-i. that the appellant was never a party to, nor aware of, the earlier scheme\n\n  agreed between Tan and Chee whereby Chee would act as a \"fall guy\" for Tan in return of\n\n  payments;ii. that the material issue was not whether the appellant was the employer of\n\n  the five workers, but whether the appellant offered payment to Chee in exchange for him assuming\n\n  the appellants liability as an abettor;iii. that Chee was an unsatisfactory and unreliable witness who had given some\n\n  five different explanations as to how he was supposed to assume the appellants liability;iv. that Chee and Tan had given conflicting evidence on the purpose of proposed\n\n  payment i.e. whether it was for assuming liability for the appellant alone or for both Tan and the\n\n  appellant.27 The sole question which arose in this appeal was whether the district judge\n\nerred in finding that the appellant had corruptly co-offered a sum of $15,000 to Chee to assume\n\nliability under the Employment of Foreign Workers Act (Cap 91A). The issue was essentially factual,\n\nnamely, whether the appellant was a co-offeror of the gratification. As I indicated above, the\n\ndistrict judge found that the appellant was the actual employer of the five Malaysian workers, he\n\nthus had reasons to offer Chee gratification to assume his criminal liability. To that extent\n\ntherefore, this appeal is principally an appeal against the findings of fact by the district judge.28 It is established law that an appellate court will not disturb the trial judges\n\nfindings of fact unless they were clearly reached against the weight of the evidence. This\n\nreluctance is even more pronounced when the findings of fact were based on the trial judges\n\nassessment of the witnesses veracity and credibility:Tan Hung Yeoh v PP[1999] 3 SLR 93.\n\nIn the proceedings below, the district judge accepted the credibility of the prosecutions\n\nwitnesses and found the appellant to be an unreliable witness who had crafted his testimony largely\n\nwith the benefit of hindsight. His findings would not be lightly disturbed unless they were shown to\n\nbe plainly wrong.29 After carefully considering Mr Yaps written and oral arguments, I concluded\n\nthat there was no merit in the appeal. In my view, Mr Yaps contentions failed to address the crux\n\nof the evidence which had been adduced against the appellant. Even though the appellant was not\n\ninvolved in the prior agreement between Tan and Chee, he did eventually come to learn of the scheme.\n\nHe then actively participated in it by giving false statements to the authorities that Chee was the\n\nemployer of all 17 workers; briefing Chee on the duties of the Malaysian workers; and instructing\n\nthe workers to falsely identify Chee as their employer.30 As a result of this scheme, only Chee was prosecuted and convicted for\n\nemploying the twelve Thai illegal immigrants. From the outset, it was obvious that the appellant\n\nwanted Chee to assume liability in respect of the Malaysian workers. The district judge had\n\ntherefore quite rightly taken these preceding events into account in his assessment of the evidence.\n\nIn my view, the appellants conduct in the March 1998 incident clearly could not be divorced from\n\nand had to be viewed against this factual matrix.31 Critically, the appellant failed to refute Tans and Chees highly\n\nincriminating testimony that the appellant had arranged for the meeting in Eunos in March 1998 when\n\nthey discussed the resolution of the outstanding MOL charges. Both testified that, at this meeting,\n\nthe appellant agreed to contribute $7,500 towards the $15,000 to be paid to Chee in return for his\n\nassuming criminal liability for the illegal employment of the Malaysian workers. Their evidence was\n\naccepted by the district judge who quite rightly found that there was no reason to doubt their\n\ncredibility. Tan and Chee had no discernible reason for fabricating the evidence against the\n\nappellant. They had already been convicted of charges arising out of the illegal employment and the\n\ncorrupt \"Tua Pek Kong\" scheme. They had either completed serving or were in the midst of\n\nserving their sentences. In contrast, the appellant was found to be an unreliable witness.\n\nSignificantly, the appellant did not seriously challenge this crucial finding of fact in the appeal.\n\nIn the circumstances, I could see no reason to interfere with the district judges conclusions in\n\nthis regard.32 Once this finding of fact was accepted, Mr Yap faced an uphill task in\n\npersuading me that the appellant was merely an innocent bystander who had not participated in the\n\nMarch 1998 discussion. This was particularly so in light of the district judges finding that the\n\nappellant was the employer of the Malaysian workers. I was quite unable to accept the submission\n\nthat the identity of the actual employer of these workers was not a material issue. Whether or not\n\nthe appellant was the employer of the five Malaysian workers was material as this would have exposed\n\nthe appellant to criminal liability for illegal employment. Regardless of whether he was already\n\nfacing a charge of abetting the illegal employment, his concern must have been to avoid any criminal\n\nliability and prosecution. There would have been no reason for the appellant to arrange a meeting\n\ninvolving Chee, or to offer him a considerable sum of money at this stage unless he sought to gain\n\nsome benefit from this arrangement. Certainly Chee would otherwise have no reason to continue to\n\nfalsely admit to being the employer of the Malaysian workers.33 As regards the apparent inconsistencies in Chees and Tans evidence as to\n\nwhom Chee was to assume criminal liability for in return for $15,000, I fully agreed with the\n\ndistrict judges opinion that the differences were not material. Chee explained that it did not\n\nmatter to him whom he \"took the rap\" for. Since both had offered to pay him $15,000, he\n\nconsidered himself to be assuming liability on behalf of both. This was an understandable response.\n\nWhile Tan was not the employer of the five workers and would not have borne any liability for\n\nemploying them, Tan himself admitted that he had a vested interest in ensuring the resolution of the\n\nentire affair.34 I now address Mr Yaps contention that the appellant could not have made a\n\ncorrupt offer to Chee as Chee could not have assumed his liability as an abettor. This submission\n\nwas, in my view, highly contrived and artificial. The district judge found that the \"Tua Pek\n\nKong\" scheme in operation between the parties was a fairly simple and uncomplicated one. The\n\ncommon understanding between the parties was that Chee was to assume sole liability for the illegal\n\nemployment of the workers. It was patent that the parties did not envisage that the appellant could\n\nbe charged for merely being a foreman. The district judge found that it was the parties erroneous\n\nexpectation and hope that the appellant would be let off once Chee pleaded guilty to employing the\n\nworkers. Based on the evidence of the various witnesses, the district judge was quite entitled to\n\nconclude that the parties had not comprehended the legal distinctions. This inference was also\n\nconsistent with the appellants ready admission that he was the foreman and supervisor, even after\n\nhe knew that there was a \"Tua Pek Kong\" arrangement in place.35 Mr Yap next submitted that Chee could not give any satisfactory explanation as\n\nto how or in what manner he could possibly assume criminal liability for the appellant as an\n\nabettor. This was not a tenable argument. Chee understood that by pleading guilty to the charges and\n\ndescribing the appellant as his foreman, the appellant would be set free. At the time of the meeting\n\nin March 1998, he had not understood that the appellant could nonetheless be convicted of abetment\n\nof illegal employment. This understanding was common to all three parties. The fact that Chee could\n\nnot fully elucidate the precise technical reasons for this understanding was not necessarily fatal\n\nto the prosecutions case.36 Furthermore, the offer had to be viewed from the appellants perspective at\n\nthe time when he, together with Tan, offered the gratification to Chee. They had earlier succeeded\n\nin their scheme in respect of the Thai workers when only Chee was prosecuted. This was doubtlessly a\n\nsignificant consideration in their minds, including the appellants. I thus could not but agree\n\nwith the district judges inference that they had obviously not anticipated that the appellant\n\ncould still be charged with abetting Chee in illegal employment. At the very least, they would have\n\nhoped that the appellant would be let off once Chee pleaded guilty to employing the workers.37 In any case, the present charge against the appellant was made out once it was\n\nproved that: (i) the appellant had offered a gratification; (ii) as an inducement to assume criminal\n\nliability for himself; (iii) there was an objectively corrupt element in the scheme; and (iv) the\n\nappellant made the offer with a guilty knowledge: seePP v Low Tiong Choon[1998] 2 SLR 878;Chan\n\nWing Seng v PP[1997] 2 SLR 426. It was not necessary to prove further that the offeree, Chee,\n\nwould have succeeded in assuming the appellants criminal liability.38 In the final analysis, Mr Yaps submissions appeared to me to be mere\n\nspeculative attacks against the reading of certain selected portions of the evidence. The district\n\njudges findings were underpinned by his assessment of the credibility and veracity of the\n\nwitnesses. I was not persuaded that those findings were plainly wrong or against the weight of the\n\nevidence. Accordingly, I dismissed the appeal against conviction."
    }
}