{
    "case_title": "Choo Pheng Soon v Public Prosecutor",
    "ncitation": "[2001] SGHC 14",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The defence below": "According to the appellant, he first came to be acquainted with Ms Lim in late 1996, when she approached him to buy an insurance policy through her. Within a year afterwards, he learnt that Ms Lim was a part-time moneylender. He found this out from her close church friends, who informed him that she lent between $3,000 to $20,000, and charged interest at 10 to 20 per cent. He subsequently borrowed a sum of $3,000 from her on 1 June 1998. Sometime in August 1999, she visited his clinic to ask for repayment. It was then that she overheard him on the telephone talking about the rice trading venture. This got her excited, and she wanted a share of the pie. He refused, but told her that he himself would need a large sum of money for the venture. She offered to lend him the money, whereupon he told her that he would get back to her.At the end of November 1998, he contacted her and told her that he required the money. She turned up at his clinic on 3 December 1998 and asked him how much he needed. He replied, `any amount`. She offered to lend him $15,000, at a fortnightly interest of 20%. When he accepted the loan, Ms Lim asked for a document to evidence the terms of repayment of the loan. At the same time, she wanted to cover up the fact she was an illegal moneylender. As such, she had the terms of repayment dressed up as being part of a rice trading venture contract. That, said the appellant, was how the rice trading agreement was born.When the appellant subsequently had difficulty repaying the loan, Ms Lim demanded that he give her a cheque for $22,000. This sum was constituted by:[bull  ] the principal sum lent of $15,000,[bull  ] interest of $3,000 earned by Ms Lim on the $15,000,[bull  ] the $3,000 lent by Ms Lim to the appellant in June 1998 and[bull  ] $1,000 being the interest earned on the $3,000 loan.That was when he gave her the cheque for $22,000. This cheque was subsequently dishonoured. When Ms Lim confronted the appellant, he managed to persuade her to allow him to make repayment by way of instalments. She agreed. On 6 January, she drafted the agreement allowing him to make the instalment repayments (exh CPS-6 of the appellant`s affidavit). On that same day, he paid her $6,000 in cash, whereupon she signed an acknowledgement of receipt. Subsequently, he made two further cash payments of $6,000 each, and she also signed an acknowledgement of receipt for each payment. All in all, there were three acknowledgements of receipt signed by Ms Lim. However, she had kept the original documents, and given him only the photocopies.",
        "Evidence of the handwriting experts": "At the trial before the district court, experts in handwriting analysis were called by both the prosecution and the defence. The expert for the prosecution was Mr Yap Bei Sing, a scientific officer with the Department of Scientific Services.  Mr Yap`s view was that most of the words in CPS-6 (ie the purported agreement by Ms Lim to accept repayment by instalments) were produced by photocopying and cut-and-paste manipulation of Ms Lim`s handwriting in the rice trading agreement and in the termination agreement. As for the three acknowledgements of receipt purportedly signed by Ms Lim (CPS-7, CPS-8 and CPS-9), Mr Yap was of the view that these documents contained two sets of handwriting. One set had a smooth cursive quality, while the other was slow conscious writing. The parts of the writing that were smooth and cursive were again cut and pasted from various portions of the rice trading agreement and the termination agreement.Mr Yap`s conclusion that the relevant parts of CPS-6 to CPS-9 were cut and pasted was based on the fact that no two sets of handwriting by the same person could ever be identical. The similarity which the handwriting in CPS-6 to CPS-9 bore to that in the rice trading agreement and in the termination agreement could only be achieved through cut-and-paste manipulation.The handwriting expert called by the appellant was one Linda Collin James, who had then been practising document examination for nine years. In her testimony, Ms James elaborated on certain reports that had been prepared by her prior to the trial. In one of her reports, dated 21 May 2000, she commented that she could not affirmatively say whether the documents exhibited to the appellant`s affidavit were genuine or forged. However, in a subsequent report dated 8 June 2000, she criticised the findings of Mr Yap, saying that some of the words in the allegedly forged documents were, contrary to Mr Yap`s view, not entirely identical to those in the rice trading agreement or termination agreement, but were of different size. She also questioned Mr Yap`s finding that the allegedly forged documents were produced by cut-and-paste manipulation, as she was of the view that cut-and-paste manipulation could only be established by direct evidence, such as shadow lines from cut edges, and misalignment. Nevertheless, in the course of cross-examination, she agreed that it was possible, depending on the photocopying machine, for traces of cut and paste manipulation not to appear.Mr Yap`s rebuttal evidence was to the effect that the different sizing of the words referred to by Ms James was actually a result of size distortion caused by the photocopying process and not because the words were different.",
        "The district judge`s finding": "With respect to the testimonies of the handwriting experts, the District Judge accepted Mr Yap`s evidence that the questioned documents in the appellant`s affidavit were indeed produced by cut-and-paste manipulation. She also accepted Mr Yap`s evidence that these documents bore two different sets of handwriting. Even then, she concluded that Mr Yap`s evidence was not to be accorded the highest weight, as there was no direct evidence of cut-and-paste manipulation, such as shadow lines and cut edges.However, the district judge held that, even without the aid of the scientific evidence, Ms Lim was `undoubtedly a witness of truth`. In contrast, she found the appellant`s story about Ms Lim being an illegal moneylender to be unworthy of credit. She accordingly convicted the appellant of the charge and sentenced him to a two year imprisonment term.",
        "The appeal": "The provision under which the appellant was charged, s 193 of the Penal Code reads as follows:Whoever intentionally gives false evidence in any stage of a judicial proceeding, or fabricates false evidence for the purpose of being used in any stage of a judicial proceeding, shall be punished with imprisonment for a term which may extend to 7 years, and shall also be liable to fine; and whoever intentionally gives or fabricates false evidence in any other case, shall be punished with imprisonment for a term which may extend to 3 years, and shall also be liable to fine.The definition of `to fabricate false evidence` is in turn defined by s 192:Whoever causes any circumstances to exist, or makes any false entry in any book or record, or makes any document containing a false statement, intending that such circumstance, false entry, or false statement may appear in evidence in a judicial proceeding ... and that such circumstances, false entry, or false statement, so appearing in evidence, may cause any person, who in such proceeding is to form an opinion upon the evidence, to entertain an erroneous opinion touching any point material to the result of such proceeding, is said `to fabricate false evidence`.The above provisions are clear enough. If the appellant had indeed appended to his affidavit documents which he knew to be forged, with the intention that these documents be used in the civil action brought by Ms Lim against him, he would be guilty of an offence under s 193 of the Penal Code.The main crux of this appeal thus centred on whether the relevant documents (CPS-6, CPS-7, CPS-8 and CPS-9) were indeed forged. The appellant maintained that the documents were genuine, in that they were prepared and signed by Ms Lim. To support his stand, he raised essentially the same contentions as those raised in the district court below.",
        "The illegal moneylender allegation": "It is unclear why this allegation was raised by the appellant at all. Whether or not Ms Lim was an illegal moneylender was wholly irrelevant to the question of whether the documents were forged. Even if she was an illegal moneylender, that would not have absolved the appellant of criminal liability, if he had indeed forged documents with the intention of using them as evidence in a court of law. Nevertheless, the appellant`s evidence, advanced to support his claim that Ms Lim was a moneylender, was most enlightening insofar as it demonstrated the appellant`s utter lack of credibility.The appellant explained that he first came to know that Ms Lim was a moneylender from a church friend of Ms Lim`s. The church friend had alluded to Ms Lim`s moneylending activities when the appellant told this church friend that he needed some money. That being the appellant`s story, one would have expected the appellant to have some degree of acquaintance with this church friend, seeing as how he had confided in her on such a personal matter. Oddly enough, the appellant claimed that he was not well acquainted with this church friend, saying that he had only met her once. He was unable to give the court any particulars of this church friend, and was unable to even furnish her name. The  obvious deduction to be made was that this `church friend` was nothing more than a figment of the appellant`s imagination.The illegal moneylender allegation also went against other independent documents. After Ms Lim lodged her police report against the appellant, the latter gave a statement, dated 25 June 1999, to one Senior Staff Sergeant Sabil. Paragraph 7 of the statement read:So on the 3.12.1998, she [ie Ms Lim] came down to my clinic to tell me how much she should invest in the business ... She also asked me how much profit she would get out of the $15,000. I told her the profit was not fixed because the deals still have not finalized yet. She then suggested to me to give her 20% of her investment value on the completion of the deal ...Thus, by his very own statement to the police, the appellant referred to the $15,000 as an `investment` and not a `loan`, and he further described the 20% as being `profits` rather than `interest`. During cross-examination in the district court, the appellant explained that it was Sergeant Sabil who used the word `invest` and not him. The appellant further alleged that some of the sentences found in para 7 of the statement were not made by him. Nevertheless, the appellant admitted that he did read the statement after it had been prepared. He had even made many amendments to it, and had appended his signature after reading through it. During cross-examination, the appellant explained that, although he read through the statement, he did not read every sentence. This was because he had been `in a state of shock`. He further explained that the amendments were merely made to correct grammatical errors only. When asked why he focused on the grammatical errors when he should have been correcting the alleged material errors in para 7 of his statement, his reply was: `I always prefer to write good English`. I found the appellant`s explanations, which bordered on sheer flippancy, to be wholly unsatisfactory.Apart from the police statement, there was also the affidavit to which the forged documents were annexed. In it, the appellant averred that Ms Lim `entered into an agreement [with him] to invest` and he described the 20 per cent as `profits`. The district judge below had queried the appellant as to why he had described the rice trading agreement as an investment that yielded profits, instead of stating what he claimed to be the truth, ie that it was nothing more than an illegal moneylending transaction. His reply was: `I cannot offer any explanation`.Thus, while the question of whether Ms Lim was a moneylender was quite irrelevant to the charge, the evidence pertaining to this issue that was adduced in the district court only served to emphasise the unreliability of the appellant`s testimony.",
        "Circumstances surrounding the alleged repayment": "The more pertinent issue to be determined in this appeal was whether the documents in the affidavit were indeed forged. In all likelihood, they were. First and foremost, the appellant alleged that he paid Ms Lim the $18,000 in cash. This was a most unlikely story. $18,000 is by no means a small sum. One would reasonably expect that payment for such a sum should be made by way of a cheque, or by some other means which would provide a record of the transfer of  funds. It is hard to believe that the appellant would simply give Ms Lim the entire amount in cash, and rely only on a scanty acknowledgement of receipt to evidence payment.Secondly, the whole purpose of an acknowledgement of receipt is so that the person who has made payment can use the acknowledgement to evidence that payment was indeed made. Thus, as Ms Lim was the party making payment (to the sum of $15,000) under the rice trading agreement, it was she who kept the original copy of the agreement while the appellant was given a photocopy. Likewise, when the appellant allegedly made the payment of $18,000, one would have expected the appellant to keep the original copies of the acknowledgements of receipt and let Ms Lim have the photocopies. Anomalously, the appellant claimed that the reverse happened, ie it was he who was given the photocopies while Ms Lim kept the originals. It was hard to believe that the appellant would part with such a large sum of money without first asking for the original copies of the documents evidencing payment.Thirdly, the appellant offered no satisfactory explanation as to where he obtained the $18,000, which he allegedly used to make repayment to Ms Lim. He claimed that he took the money from his wife, who kept the cash at home. This again defied belief. It is a most unusual practice for anyone to stash away a sum as large as $18,000, in cash form, at home. This practice would be all the more extraordinary in the appellant`s case, where he claimed that he was in such dire need of money at the relevant time that he had no choice but to sign the rice trading agreement, despite the interest on the loan being so exorbitant.Finally, one could not help but wonder why the appellant never asked his wife for the $18,000 in the first place, instead of entering into the rice trading agreement. His explanation was that he felt uncomfortable about asking his wife for money as he had borrowed money from her before. I found this explanation to be unacceptable. He felt uncomfortable about borrowing the principal sum from his wife, but he apparently had no qualms about asking her for the principal sum plus an exorbitant interest when it was time to make repayment under the rice trading agreement.The only reasonable inference to be drawn from all the above facts was that the $18,000 was never paid by the appellant. The acknowledgements of receipt appended to the appellant`s affidavit were obviously forged, and that was the reason why the appellant could not produce the original copies. The appellant had attempted to adduce as evidence documents purportedly signed by Ms Lim, when he knew that Ms Lim did not sign those documents. This clearly amounted to a deliberate fabrication of false evidence. The charge against him had thus been made out. On this ground alone, the appeal against sentence should have been dismissed.",
        "Amendment of the charge": "The appellant had initially been charged with two separate offences:[bull  ] The first charge was that of committing forgery with intent that the document forged be used for the purpose of cheating (an offence under s 468 of the Penal Code).[bull  ] The second charge was that of making a false statement on oath to a Commissioner for Oaths (an offence under s 181 of the Penal Code).At the commencement of the trial on 26 April 2000, both charges were amalgamated on the recommendation of the district judge, so that the appellant faced a single charge, under s 193 of the Penal Code, of having fabricated false evidence. The amalgamated charge read:You ... are charged that you, sometime between 3 December 1998 and 22 March 1999, at 112 East Coast Road, Katong Mall [num ]02-05, Singapore, did intentionally fabricate false evidence for the purpose of being used in a judicial proceeding ...At the end of the trial, prior to sentencing, the district judge amended the amalgamated charge by switching the place of commission of the offence from `at 112 East Coast Road, Katong Mall [num ]02-05, Singapore`, to simply `in Singapore`. The reason for the amendment was that there was no evidence as to where the offence actually took place.Section 163(1) of the Criminal Procedure Code (Cap 68), allows the court to amend a charge at any time before judgment is given. Section 167 of the Code further states that, if the charge is altered by the court after commencement of the trial, the prosecutor and the appellant shall be allowed to recall and examine, with reference to the new or altered charge, any witness who may already have been examined. In this regard, the appellant complained that the district judge erred, in that she neither asked the appellant nor the prosecution whether they wanted to recall any witnesses after the amendment was made.I found no merit in this complaint. The district judge need not extend an invitation to the parties to recall their witnesses in relation to the amendment, because it is for the parties to apply for their witnesses to be recalled, and in this case the defence itself never bothered to make any application for witnesses to be recalled. In fact, in my view, the defence clearly never intended to recall any of its witnesses.The appellant further argued that the amendment was a convenient means by which the District Judge overlooked the prosecution`s inability to adduce evidence as to the place of commission of the offence. The short answer to that was that there never was a need, in light of the issues canvassed at trial, for the prosecution to have adduced any evidence on this point. The bone of contention throughout the trial was whether the appellant had forged the relevant documents; the question of where the forgery took place was never in issue. The amendment to the charge thus caused no prejudice to the appellant. That being the case, it did not furnish the appellant with any grounds for asking that his conviction be reversed (seeLee Ngin Kiat v PP[1993] 2 SLR 511).",
        "Affirmation before a Commissioner for Oaths": "The appellant`s affidavit was purportedly affirmed before one Ranjeet Singh, a Commissioner for Oaths. In the trial below, the appellant maintained that his  affidavit was never affirmed before Mr Ranjeet Singh. The appellant repeated this contention in the present appeal. Why the appellant raised this contention evades comprehension. Whether or not the affidavit was affirmed before a Commissioner for Oaths was wholly beside the point. Illustration (b) to s 192 of the Penal Code, which defines what constitutes fabrication of false evidence, states:`A` makes a false entry in his shop-book for the purpose of using it as corroborative evidence in a court of justice. `A` has fabricated false evidence.Hence, so long as a false document has been fabricated with the intention that it be subsequently used in court, the offence has been made out. There is no need for the affidavit containing that false document to be affirmed before a Commissioner for Oaths. This point seems obvious enough, so it was somewhat unfortunate that so much time was devoted in the trial below towards determination of the question of whether the appellant had affirmed the affidavit before Mr Ranjeet Singh.",
        "Appeal against sentence": "The fabrication of evidence that occurred took a lot of careful planning, deliberate effort and skilled craftsmanship. To make matters worse, the appellant had, in trying to wriggle his way out of trouble, cast aspersions on a host of persons. He accused Ms Lim of being an illegal moneylender. He accused Sgt Sabil of putting things into his police statement which he did not say. He accused Mr Ranjeet Singh as well as his own lawyer of preparing an affidavit which he did not affirm.To top it all off, the appellant remained unrepentant to the very end. Throughout the trial, he led the district court on a wild goose chase, with the result that much precious court time was wasted over the deliberation of wholly irrelevant matters, such as whether Ms Lim was an illegal moneylender and whether the appellant`s affidavit had been affirmed in his presence.Far from finding that the sentence was manifestly excessive, I was of the view that it was manifestly inadequate. In light of all the above aggravating factors, I exercised my discretion under s 256 of the Criminal Procedure and enhanced the sentence, replacing the imprisonment term of two years imposed by the district judge with a term of three and a half years.Outcome:Appeal dismissed.Copyright © Government of Singapore."
    }
}