{
    "case_title": "Re Jeyaretnam Joshua Benjamin",
    "ncitation": "[2001] SGHC 46",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "The bankruptcy proceedings in question resulted from Mr Jeyaretnam`s failure to pay to the petitioners damages awarded to them by the High Court for defamation. On or about 3 November 2000, the petitioners agreed to allow Mr Jeyaretnam to pay the damages in instalments. The terms of this agreement (hereinafter referred to as `the Agreement`), which set out the dates on which the instalments were due, included one which provided that if Mr Jeyaretnam failed to pay any of the said instalments on time, the petitioners were entitled, at their absolute discretion, to terminate the Agreement and to proceed with or restore their respective bankruptcy petitions, and that in such an event, Mr Jeyaretnam shall consent to a bankruptcy order being made against him.It was further agreed between the parties that in consideration of the petitioners agreeing to give Mr Jeyaretnam additional time to settle his debt on the terms of the Agreement, Mr Jeyaretnam would agree to a consent order, which was intended to embody the terms of the Agreement. Consequently, at the hearing of the bankruptcy petitions on 3 November 2000, a consent order was entered with respect to each of the bankruptcy petitions. The orders have since been extracted.-on or by 1 December 2000-$3,927.00-on or by 1 January 2001-$2,850.00-on or by 1 February 2001-$2,850.00-on or by 1 March 2001-$2,850.00-on or by 1 April 2001-$2,850.00-on or by 1 May 2001-$2,850.00-on or by 1 June 2001-$2,850.00-on or by 1 July 2001-$2,850.00-on or by 1 August 2001-$2,421.66The terms of the consent order with respect to the bankruptcy petition presently being considered are as follows:1. The debt due under this Petition in the aggregate sum of $27,721.66 and disbursements fixed at $1,077.00 shall be paid in the following manner:-(i) the sum of $2,500.00 to be paid in cash by 1.00 pm on 6 November 2000;(ii) the balance to be paid by way of the following instalments:2. All payments are to be made by cash or cheque in the debtor`s name (such cheques being made payable to Messrs Drew & Napier). All such payments are to be made through the Debtor`s solicitors, M/s G Raman & Partners and to the Creditor`s  solicitors, and the letter accompanying such payments to be marked for the attention of Mr Davinder Singh or Mr Hri Kumar. If payment is made by cheque, the cheque must bear a date on or before the due date of payment. Otherwise, it will be treated as a failure to make payment on time.3. The hearing of this Petition shall be adjourned for 1 week. In the event the Debtor pays the sum of $2,500.00 as provided in Clause 1(i) above, the Creditor`s solicitor shall inform the Court by 8 November 2000, whereupon the Petition will be withdrawn, with liberty to the Creditor to restore the same for hearing on or by 3 August 2001.4. If the Debtor fails to make any of the payments set out in Clause 1 above, the Creditor shall be entitled, at his absolute discretion, to proceed with and/or restore this Bankruptcy Petition.In that event, the debtor shall consent to a bankruptcy order being made against him.[Emphasis is added.]Mr Jeyaretnam paid the first two instalments. On 28 December 2000, his solicitor, Mr G Raman, wrote to the petitioners` solicitors to request that he be given until 16 January 2001 to pay the third instalment that was due on 1 January 2001. On 2 January 2001, the petitioners` solicitors replied, agreeing to an extension until noon on 16 January 2001 for the payment of the said instalment, subject to the terms of the Agreement and the consent order.Mr Jeyaretnam did not pay the third instalment on time. On 16 January 2001, Mr Raman wrote to the petitioners` solicitors to inform them that Mr Jeyaretnam would pay the said instalment on the following day. In their reply, the petitioners` solicitors stated their clients` position clearly in the following terms:Our clients have, as they are entitled to, terminated the instalment agreement between our respective clients. The notice of termination was faxed to you at 12.01 pm. A copy of the transmission report is enclosed.Our clients have exercised their right to proceed with the bankruptcy proceedings against your client. We have written to the Court to ask for the petitions to be restored for hearing. A copy of this letter was sent to you at 2.51 pm. A copy of the transmission report is enclosed.In the circumstances, your client`s offer to pay the 3rd instalment tomorrow is ineffective and our clients accordingly reject the same. Our clients will proceed with the bankruptcy petitions. We remind you that your client has consented to the bankruptcy order being made against him.On 19 January 2001, the restored petitions were heard. On that day, the balance owed to all the petitioners was $175,313. At the hearing, the assistant registrar ordered Mr Jeyaretnam to be made a bankrupt. Mr Jeyaretnam appealed against this decision.",
        "The appeal": "Mr Jeyaretnam asserted that it would be contrary to justice if the decision of the assistant registrar was not reversed. He submitted that the relevant questions for determination in this appeal were as follows:(a) Was there a breach sufficient to warrant the termination of the voluntary arrangement entered into and to invoke the right to proceed with the bankruptcy petition?(b) Did the voluntary arrangement assume the nature of a judgment of the court by its terms being recorded by the court and is a court exercising jurisdiction in bankruptcy bound by the order?(c) Even if the arrangement becomes an order of the court, was the court not under a duty to satisfy itself that the conditions specified under the Bankruptcy Order exist or does the mere consenting of the debtor give the court jurisdiction even if the conditions are not satisfied?(d) Have the creditors satisfied the court of the foundation for a bankruptcy order?(e) Are the creditors or their solicitors guilty of extortionate conduct in insisting on consent as a condition for accepting instalment payments and by refusing to give credit for the sum garnished by them?What Mr Jeyaretnam asserted was that the conditions required for a bankruptcy order were not satisfied when the assistant registrar made him a bankrupt and that the consent order should not have been relied upon. He also said that the court should rely on s 7 of the Bankruptcy Act (Cap 20, 2000 Ed) to overrule the decision of the assistant registrar.The main issue in a hearing as to whether or not a debtor should be made a bankrupt is whether or not the debtor is able to pay his debts. At the hearing before the assistant registrar on 19 January 2001, the petitioners` counsel made submissions with respect to the effect of the consent order. However, it is evident from the assistant registrar`s record of the proceedings that she focused her attention on whether or not Mr Jeyaretnam was able to pay the sum immediately owing to the petitioners. She specifically stated that the question before her was whether the full sum or the third instalment was due to the petitioners and invited counsel to make submissions on this question.The assistant registrar accepted, and rightly so, that after the termination by the petitioners of the Agreement following Mr Jeyaretnam`s failure to pay the third instalment on time, the petitioners were entitled to demand that Mr Jeyaretnam pay the entire sum owed to them. She then asked Mr Raman whether his client, Mr Jeyaretnam, could pay the entire sum claimed. Mr Raman was unable to say that his client was able to pay this sum. The assistant registrar then made the order to have Mr Jeyaretnam made a bankrupt as he was unable to pay his debts.At the hearing of the appeal, I pointed out to Mr Jeyaretnam that he was required to pay the petitioners the entire sum owed to them and not merely the third instalment because the instalment plan envisaged under the Agreement had been terminated following his failure to pay the third instalment on time. His response was that his breach in failing to pay the third instalment on time was not so serious as to warrant the termination of the instalment arrangement. He likened his default in meeting the deadline for the payment of the third instalment to a breach of warranty and not a breach of a condition and insisted that he had not lost the right to pay his debt in instalments. In doing so, he ignored the express terms  of the Agreement, which permitted the petitioners to terminate the arrangement if he defaulted in the payment of any instalment. He also failed to realise that it is not the role of a judge to re-write the terms of the Agreement which he had made with the petitioners in November 2000. Like the assistant registrar, I was satisfied that he was unable to pay his debts. As such, I saw no reason to overrule the decision of the assistant registrar.As it was evident that Mr Jeyaretnam was unable to pay his debts, there was really no need for the petitioners to rely on the consent order of 3 November 2000. All the same, I will refer to the effect of this order.A consent order is open to attack on grounds upon which a contract is so open. This was made clear by Lord Russell inChia Sook Lan Maria v Bank of China[1975-1977] SLR 9[1976] 1 MLJ 245, where the appellant`s attempt to have a consent order set aside on the ground of mistake was rejected. However, a consent order is binding until it is set aside. More than a century ago, inWilding v Sanderson[1897] 2 Ch 534, 543-544, Byrne J summed up the position in the following succinct terms:A consent judgment or order is meant to be the formal result and expression of an agreement already arrived at between the parties to proceedings embodied in an order of the Court. The fact of its being so expressed puts the parties in a different position from the position of those who have simply entered into an ordinary agreement. It is, of course, enforceable while it stands, and a party affected by it cannot, if he conceives he is entitled to relief from its operation, simply wait until it is sought to be enforced against him, and then raise by way of defence the matters in respect of which he desires to be relieved. He must, when once it has been completed, obey it, unless and until he can get it set aside in proceedings duly constituted for the purpose.The above decision was recently followed by Lee Seiu Kin JC inWiltopps (Asia) Ltd v Drew & Napier (sued as a firm)[2000] 3 SLR 244.Mr Jeyaretnam alleged that the consent order should not be enforced because it was extorted from him. If this is so, he should have taken steps to have the consent order set aside. In any case, this was an unsubstantiated allegation. Mr Jeyaretnam merely said as follows:My lawyer called me. I had very little time. As such, I said, \"Okay. Let us have the consent order. Let us not quibble.\"Mr Jeyaretnam`s statement certainly did not support his claim that the consent order had been obtained by extortion. Having agreed to the consent order and after having obtained some breathing space for himself as a result of the instalment plan, Mr Jeyaretnam cannot come to court to say that the consent order is not binding.While a consent order is, without more, binding, it must be noted that in the case of bankruptcy proceedings, the court has the power under s 7 of the Bankruptcy Act to review, rescind or vary any order made by it under its bankruptcy jurisdiction. The court will intervene if a consent order is used as an engine of oppression against a debtor who is not unable to pay his debts. As it was clear that Mr Jeyaretnam was unable to pay his debts, the question of rescinding  or varying the bankruptcy order made by the assistant registrar on 19 January 2001 did not arise.Outcome:Appeal dismissed.Copyright © Government of Singapore."
    }
}