{
    "case_title": "Ponggol Marina Pte Ltd v Central Provident Fund Board (Public Prosecutor)",
    "ncitation": "[2001] SGHC 225",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The relevant charges": "The two relevant charges are reproduced below:Charge in CPF Summons No 059066/2000You, Punggol Marina Pte Ltd are charged that you on or about 15 January 1997 at Singapore, did fail to pay a sum of $53.00 to the Central Provident Fund Board being a contribution in accordance with the rate of contributions payable as set out in the First Schedule in the Central Provident Fund Act (Cap 36) for the month of December 1996 in respect of your employee namely, Genghis Khan Bin Setarhan, as required by section 7(1) of the said Act within the period prescribed by Regulation 2(1) of the Central Provident Fund Regulations 1987 and thereby committed an offence under section 58(b) of the Central Provident Fund Act (Cap 36) punishable under section 61(1) of the said Act.Charge in CPF Summons No 059068/2000You, Punggol Marina Pte Ltd are charged that you on or about 15 August 1997 at Singapore, did fail to pay a sum of $60.00 to the Central Provident Fund Board being a contribution in accordance with the rate of contributions payable as set out in the First Schedule in the Central Provident Fund Act (Cap 36) for the month of July 1997 in  respect of your employee namely, Saifin Bin A Wahid, as required by section 7(1) of the said Act within the period prescribed by Regulation 2(1) of the Central Provident Fund Regulations 1987 and thereby committed an offence under section 58(b) of the Central Provident Fund Act (Cap 36) punishable under section 61(1) of the said Act.The offencesThe relevant provisions of the Central Provident Fund Act are in ss 2, 58 and 61 as follows:2 In this Act, unless the context otherwise requires -...\"wages\" means the remuneration in money, including any bonus, due or granted to a person in respect of his employment but does not include such payments as the Minister may, by notification in the Gazette, specify.58 If any person -...(b) fails to pay to the Fund within such period as may be prescribed any amount which he is liable under this Act to pay in respect of or on behalf of any employee in any month...he shall be guilty of an offence.61(1) Any person convicted of an offence under this Act for which no penalty is provided shall be liable to a fine not exceeding $2,500 and, in the case of a second or subsequent conviction, to a fine not exceeding $10,000.The factsThe appellant operates a club and marina in Ponggol. The club is rather inaccessible. It is at least a half-hour journey by foot and public bus from the nearest housing estate. Between November 1996 and July 1997, the club was under construction and had no operational canteen. It was thus difficult for the employees to purchase food. The appellant`s managing director, Mr Lai Wee Ngen, said in his conditioned statement that the rationale behind the meal allowances was the compensation of employees for the inconvenience they faced between November 1996 and July 1997.At the material time, the appellant employed Genghis Khan bin Setarhan (`Mr Genghis`) and Saifin bin A Wahid (`Mr Saifin`) as skippers. Under his employment contract, Mr Genghis was to receive a monthly salary of $1,550 and a monthly transport allowance of $150. From November 1996 to April 1997, he also received a monthly meal allowance of $130. The appellant did not make a Central Provident Fund (`CPF`) contribution in respect of the meal allowance. (It should be noted, however, that the charge in CPF Summons No 059066/2000 relates only to the meal allowance paid in December 1996.) Under his employment contract, Mr Saifin was to receive a monthly salary of $1,600. In July 1997, he also received a pro-rated meal allowance of $151.67. The appellant did not make a CPF contribution in respect of his meal allowance either.It was not disputed that the meal allowances, not having been provided for in the employment contracts, were ex gratia payments. It was also not disputed that,  if the appellant were convicted, it would be liable to contribute $53 for Mr Genghis and $60 for Mr Saifin, excluding interest. This was based on a contribution rate of 20% (as provided for in the First Schedule to the Act).",
        "The issue": "The only issue in this appeal was whether the ex gratia meal allowances paid to Mr Genghis and Mr Saifin fell within the definition of `wages` in s 2 of the Act, such that the appellant had to make an employer`s contribution to its employees` CPF accounts in respect of them. This involved a consideration of two sub-issues: one, how the definition of `wages` should be construed; and two, whether the meal allowances in question fell within this definition.",
        "The magistrate`s decision": "The magistrate delivered his grounds of decision on 21 February 2001. He set out the facts and the parties` submissions. He then considered the constituent elements of the definition of `wages` in s 2 of the Act, namely, the meaning of the phrases `remuneration` and `due or granted`. Some of this reasoning is useful and will be referred to below.The magistrate held that the meal allowances were `wages` within the meaning of s 2, for they were neither reimbursements of expenses incurred nor genuine pre-estimates of expenses which would necessarily be incurred. Moreover, they were paid regularly and augmented the employees` incomes. He thought that the following factors were irrelevant: the fact that the payments were ex gratia; the fact that every employee received the same amount; and the fact that the payments were no longer made once the canteen became operational.",
        "The appeal": "THE FIRST SUB-ISSUEHow should the definition of `wages` be construed? On the first sub-issue, the appellant submitted that the precedents were inconsistent and unclear, and urged the court to take this chance to clarify the law. Having said that, the appellant submitted that the following principles could be gleaned fromLian Soon Shipping & Trading Co v PP[1984-1985] SLR 424[1984] 2 MLJ 97andPN Electronic v PP[1984-1985] SLR 529[1985] 1 MLJ 279. The label given to the payment was not important. Rather, the crucial questions were: one, whether the payment was a reimbursement or a genuine pre-estimate of expenses necessarily incurred; and two, whether the payment augmented the employees` salary. The appellant further submitted that the following factors were not decisive: whether the payment was ex gratia; whether all employees received the same amount; and whether proof of expenditure was required.The respondent also referred toLian Soon ShippingandPN Electronicas well asHotel Biltmore v Central Provident Fund Board[1972-1974] SLR 410[1972] 2 MLJ 232. Its submission based on these cases was that the label given to the payment was not conclusive; if the payment was in the nature of a reward as opposed to a reimbursement, it fell within the definition of `wages`. The  respondent also submitted that the magistrate was correct in concluding that ex gratia payments could be `wages`.It would be useful at this juncture to set out the definition of `wages` in s 2 of the Act again:2 In this Act, unless the context otherwise requires -...\"wages\" means theremuneration in money, including any bonus,due or grantedto a person in respect of his employment but does not include such payments as the Minister may, by notification in the Gazette, specify. [Emphasis is added.]The section has been amended a number of times. In 1970, the words `including any bonus` and `or granted` were added. In 2000, the words `but does not include such payments as the Minister may, by notification in the Gazette, specify` were added.",
        "The meaning of `remuneration`": "What amounts to remuneration? InPN Electronic(supra), the court said:... I was of the opinion that the word `remuneration` in that definition means reward for services rendered by an employee to his employer but does not include any payment unconnected with services rendered.The starting point then, is that remuneration is reward for services rendered by an employee in the course of his employment.",
        "Hotel Biltmore": "(supra) shows that payments - whether by the employer or by third parties - which augment the employees` wages are also part of their remuneration:... it seems as clear as daylight that these so-called `voluntary` tips ... are utilised to augment the wages ... when - to call a spade a spade - these payments are, in substance and in fact, part of the remuneration in money due to the employee ...What does not amount to remuneration? In this context, there are two types of payments which do not amount to remuneration. The first is a reimbursement of expenses actually incurred. This was the situation inPN Electronic(supra), where the collective agreement between the company and its employees stated that the employees `may claim reimbursement of theactualtaxi-fare for the journey` (emphasis is added). This will probably require proof of the expenses incurred.The second type of payment is `genuine pre-estimates of expenses necessarily incurred by the [employees]` (Lian Soon Shipping(supra)). It would seem that some evidence that the payments were genuine pre-estimates is necessary, for the appeal in that case failed because the appellant was unable to furnish such evidence. The decision of the magistrate inLian Soon Shippingsuggests that it may be sufficient to show a `precise relationship to the expenses ... likely to be incurred by the employees`.",
        "The meaning of `due or granted`": "The magistrate considered that the ordinary meaning of the words was usually the dictionary meaning. He accepted that the most appropriate meaning of `due` in this context was `owed to someone either as a debt or because they have a right to it`. He thought that the best meaning of `grant` was `allow (a person) to have (a thing)`. He concluded that the key difference was that `due` required the existence of an obligation whereas `grant` did not. Because the payments in question were ex gratia, the present appeal was more concerned with the concept of `grant`.The next question was whether `granted` can refer to ex gratia payments other than bonuses. The magistrate reasoned that `granted` refers to `remuneration` as well, not just `bonus`. I agree. The syntax - sandwiching the phrase `including any bonus` between two commas - has the same effect as placing that phrase between brackets, such that the main clause should read `the remuneration in money due or granted to a person in respect of his employment ...`. Hence `wages` can include ex gratia payments other than bonuses, for example, meal allowances.",
        "THE SECOND SUB-ISSUE": "Were the meal allowances `wages` within the meaning of s 2? The appellant sought to fit the present facts into the framework which it had set out above, but some of its submissions on the second sub-issue did not follow from its submissions on the first sub-issue. As regards the question of whether the payment was a reimbursement or a genuine pre-estimate of expenses necessarily incurred, the appellant submitted that the average daily payment of about $4 was barely enough for both lunch and dinner, and hence this amounted to a reimbursement and a genuine pre-estimate of expenses. It was difficult to see how, if this amount was indeed inadequate for the meals, the payment could be a reimbursement or genuine pre-estimate of expenses. The appellant also contended that the payments were merely a temporary measure to compensate the employees for the inconvenience they faced. The notion of compensation involves rendering an object with a drawback more attractive; in this context, it meant increasing the employees` income to make the lack of a convenient food source less unattractive. A reimbursement of expenses does not involve any element of compensation.As for the question of whether the payment augmented the employees` salaries, the appellant submitted that, as the meal allowance amounted to less than ten per cent of an employee`s salary, it was clearly not meant to augment the employees` income. This was a non sequitur. It is true that a mischief which the Act seeks to prevent is the disguise of income as payments which do not attract contributions. Unscrupulous employers may try to reduce the amount of contributions which they have to make in respect of their employees, and naïve employees may think it more advantageous to take home a higher salary than to build up their retirement funds. However, this was not the charge levelled at the appellant. It was not said that the appellant had disguised large proportions of its employees` salaries as payments that did not attract contributions. But it does not follow that, if the payments are small compared to the employees` salaries, they  cannot serve to augment their income. The respondent submitted that the employees` incomes were actually augmented, and there was no reason to hold otherwise (see below).The appellant also stressed that all employees received the same amount, regardless of their salaries, and that the payments were ex gratia. However, it had earlier submitted that these factors were not decisive.For its part, the respondent submitted that, as the employees did not have to show proof that they had incurred expenses, the payments were not reimbursements. There was also no evidence that the payments were a genuine pre-estimate of expenses which had necessarily to be incurred. The respondent further submitted (as the magistrate had in his grounds of decision surmised) that an employee could use the meal allowance for purposes other than to pay for meals, which meant that his income had in effect been augmented. The appellant`s reply to this was that, inPN Electronic(supra), a meal allowance `was paid whether the employees ate or not. Chief Justice Wee held the allowance to be a reimbursement`. This was not true.PN Electronicin fact involved transport allowances and the court reached no such conclusion.",
        "Conclusion": "For the reasons stated above, I dismissed the appeal.Outcome:Appeal dismissed.Copyright © Government of Singapore."
    }
}