{
    "case_title": "Yugiantoro v Budiono Widodo",
    "ncitation": "[2001] SGHC 349",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Applicable legal principles": "5.    The principles applicable to the granting of a stay where\n\nthe question of forum non conveniens arises are well-known and have been considered by the Court of\n\nAppeal on numerous occasions. InOriental Insurance Co Ltd v Bhavani Stores Pte Ltd[1998] 1 SLR 253, 257, Yong Pung How CJ said:The principles governing this matter are clear and established. The approach\n\n  suggested by Lord Goff inThe Spiliada[1987] 1 Lloyds Rep 1 has since been approved and\n\n  applied by the Court of Appeal inBrinkerhoff Maritime Drilling Corp & Anor v PT Airfast\n\n  Services Indonesia and another appeal[1992] 2 SLR 776. We set out the relevant passages from\n\n  the judgment of Lord Goff:In my opinion, the burden resting on the defendant is not just to show that\n\n    England is not the natural or appropriate forum for the trial, but to establish that there is\n\n    another available forum which is clearly or distinctly more appropriate than the English forum.\n\n    In this way, proper regard is paid to the fact that jurisdiction has been founded as of right.Since the question is whether there exists some other forum which is clearly\n\n    more appropriate for the trial of the action, the court will look first to see what factors\n\n    there are which point in the direction of another forum and these will include not only\n\n    factors affecting convenience or expense (such as availability of witnesses), but also other\n\n    factors such as the law governing the relevant transaction  and the places where the parties\n\n    respectively reside or carry on business.If the court concludes at that stage that there is no other available forum\n\n    which is clearly more appropriate for the trial of the action, it will ordinarily refuse a stay.If however the court concludes at that stage that there is some other\n\n    available forum which prima facie is clearly more appropriate for the trial of the action, it\n\n    will ordinarily grant a stay unless there are circumstances by reason of which justice requires\n\n    that a stay should nevertheless not be granted.",
        "Whether Indonesia is a more appropriate forum": "6.    A defendant who seeks a stay of proceedings on the ground\n\nthat there is a more appropriate forum elsewhere has the task of satisfying the court that the other\n\nforum is a more appropriate forum.7.    In his written submissions, Mr Widodos counsel, Mr\n\nSivakumar Murugaiyan, asserted as follows:It is the Defendants case that all the connecting factors of the present\n\n  dispute lie in Indonesia and not in Singapore.(a) Both the Plaintiff and the Defendant are citizens of and are domiciled in\n\n  Indonesia.(b) Both the Plaintiff and the Defendant have assets in Indonesia.(c) All the conversations regarding the shares took place in Indonesia.(d) Indonesian law would govern any alleged oral guarantee/indemnity agreement\n\n  (which existence is denied).8.    In contrast, Mr Yugiantoros counsel, Mr Daniel Koh,\n\nsubmitted that Singapore is the appropriate forum for the action. He said that the following ought\n\nto be noted:(a) Mr Yugiantoro owns residential property in Singapore and his three children\n\n  live and study in Singapore.(b) Mr Widodo has residential property in Singapore and he has received\n\n  correspondence sent to him at his apartment in Beverly Hills Condominium, Grange Road, Singapore.(c) Mr Widodo is a director and a shareholder of a number of Singapore\n\n  companies.(d) The only action in relation to the matter being disputed is the one in\n\n  Singapore.9.    If only the place of residence and location of assets are\n\nconsidered, Indonesia is not necessarily a more appropriate forum. Admittedly, both Mr Yugiantoro\n\nand Mr Widodo are Indonesian citizens but they both have homes, assets and business interests in\n\nSingapore as well. Indeed, the agreement which gave rise to the present action was alleged to have\n\nbeen made in Mr Widodos Singapore office in Chin Swee Road.10.    As for the availability of witnesses and evidence, it was\n\nnot asserted that a trial in Singapore will be inconvenient for Mr Widodos witnesses or that\n\nrelevant evidence is unavailable in Singapore.11.    As for Mr Sivakumars submission that the action should\n\nbe tried in Indonesia because Indonesian law is the proper law of the contract and complicated\n\nissues under Indonesian law regarding the validity of an indemnity without the consent of a spouse\n\nare involved, Mr Koh pointed out that this assertion is misguided since Mr Widodos position is\n\nthat he did not enter into the alleged agreement with Mr Yugiantoro. That being the case, it would\n\nbe illogical for him to speak of any governing law, be it Indonesian or otherwise.12.    If the alleged oral contract was made, it certainly did not\n\ndeal with the question of the proper law of the contract. In the circumstances of this case, it\n\nwould not be meaningful to try and determine whether or not any inference may be drawn regarding the\n\nintention of the parties on the choice of law. It would be more productive to determine whether or\n\nnot the alleged agreement has, as Mr Widodo asserted, the closest and most real connection with\n\nIndonesian law. InLas Vegas Hilton Corporation t/a Las Vegas Hilton v Khoo Teng Hock Sunny[1997] 1 SLR 341, 351, Chao Hick Tin J, as he then was, noted as follows:To determine the question of closest and most real connection many\n\n  factors may be taken into account, the main ones are  the place of contracting, the place of\n\n  performance, the places of residence or business of the parties respectively; and the nature and\n\n  subject-matter of the contract: seeRe United Railways of Havana and Regla Warehouses Ltd[1960]   Ch 52 at 91 per Jenkins LJ.13.    As has been mentioned, Mr Yugiantoro alleged that his\n\ncontract with Mr Widodo was made in Singapore and both the parties have homes and business interests\n\nin Singapore as well as Indonesia. Mr Sivakumar asserted that there being no real evidence as to\n\nwhat is the proper law of the contract, the factor which carries more weight in the circumstances of\n\nthis case is the lex loci solutionis of the contract. He contended that Indonesia is the place for\n\nthe performance of the guarantee because demands for payment were first sent to Mr Widodos\n\nIndonesian address. He added that the fact that Mr Yugiantoro had made various attempts to enforce\n\nthe alleged oral guarantee in Indonesia indicated that he intended and expected that the alleged\n\noral guarantee would be performed in Indonesia. He also pointed out that the letters of demand were\n\nwritten in Bahasa Indonesia.14.    Mr Koh submitted that the fact that his client had sent\n\nletters of demand to Mr Widodo in Indonesia is a neutral factor. He pointed out that proceedings\n\nhave not been commenced against Mr Widodo in Indonesia and his client had written twice to Mr Widodo\n\nin Singapore, once personally and once through his lawyers, to demand payment of the amount\n\nallegedly owed to him. Mr Yugiantoro stated that he had initially tried to resolve the dispute by\n\nasking a close business associate in Indonesia to engage solicitors in Indonesia to write some\n\nletters to Mr Widodo. When Mr Widodo did not respond, he related the facts in full to his Singapore\n\nsolicitors, and upon their advice that Singapore was the appropriate forum, he gave instructions for\n\nan action to be commenced without further delay.15.    Mr Koh also said that the fact that his clients letters\n\nto Mr Widodo in Indonesia were written in Bahasa Indonesia cannot be regarded as an indicator that\n\nthe proper law of the contract is Indonesian law. This is because his client is fluent in Bahasa\n\nIndonesia. In fact, his affidavit in the present proceedings is a sworn translation of its contents\n\nin Bahasa Indonesia.16.    If all circumstances are taken into account, it cannot be\n\nsaid that Mr Widodo has established that Indonesia is the place of performance of the alleged oral\n\ncontract or that the alleged contract between him and Mr Yugiantoro has the closest and most real\n\nconnection with Indonesian law.17.    As for Mr Sivakumars argument that it would be more\n\nappropriate for the courts in Indonesia to deal with the complex issues under Indonesian law\n\nregarding the furnishing of a guarantee without spousal consent, it must be borne in mind that the\n\nrelevant question to be determined in this case is not whether or not complex issues under\n\nIndonesian law are involved but whether or not Indonesian law is, in the first place, applicable to\n\nthe alleged oral contract between Mr Widodo and Mr Yugiantoro. The fact that Indonesian law on\n\nspousal consent for guarantees is complicated cannot, by itself, be a reason for holding that the\n\nalleged contract between Mr Yugiantoro and Mr Widodo is governed by Indonesian law.18.    Mr Sivakumar referred to the decision of the Court of\n\nAppeal inBambang Sutrisno v Bali International Finance Ltd & Ors[1999] 3 SLR 140, where\n\nthe Court of Appeal stayed an action with respect to the enforcement of a guarantee executed in\n\nSingapore by the appellant, an Indonesian and a Singapore permanent resident, on the ground that the\n\nIndonesian court was a more appropriate forum. However, that case is distinguishable from the\n\npresent case. InBambangscase, the parties agreed in the contract of guarantee that\n\nIndonesian law was the proper law of the contract. Furthermore, the appellant was obliged under the\n\ncontract to submit to the non-exclusive jurisdiction of the District Court of Central Jakarta, or\n\nother courts in Indonesia, as determined by the respondents. It was also noted that the appellants\n\nwife had instituted proceedings in the West Jakarta District Court for the purpose of annulling the\n\nguarantee and indemnity executed by the appellant on the ground that she had not consented to the\n\nexecution of that instrument. The Court of Appeal, which noted that there were difficult issues\n\nrelating to spousal consent to guarantees under Indonesian law, accepted that although the\n\njurisdiction clause was, by its express terms, non-exclusive, some weight must be accorded to the\n\nselection of the Indonesian court as the forum for the determination of the dispute relating to the\n\npersonal guarantee. In the light of these circumstances, the Court of Appeal thought that \"the\n\nappellant had shown exceptional circumstances amounting to strong cause for a stay of the\n\naction\" and that the Indonesian court was clearly more appropriate than the Singapore forum for\n\nthe trial of the action. In contrast, in the present case, it was not established that the proper\n\nlaw of the alleged contract between Mr Widodo and Mr Yugiantoro is Indonesian law and the main\n\nthrust of Mr Widodos defence is that he did not enter into any contract to indemnify Mr\n\nYugiantoro.",
        "Conclusion": "19.    As Mr Widodo did not establish that Indonesia is a more\n\nappropriate forum for the action, his appeal against the Assistant Registrars decision was\n\ndismissed with costs.Sgd:TAN LEE MENGJUDGECopyright © Government of Singapore."
    }
}