{
    "case_title": "Teo Lai Huat v Ong Teow Chuie and Another",
    "ncitation": "[2001] SGHC 38",
    "coram": "Woo Bih Li JC",
    "sections": {
        "BACKGROUND": "5.    Mr Ong is a businessman. In May 1974 he set up OTCS and was\n\none of its directors and shareholders. In 1989 he resigned as its director and transferred his\n\nshares in OTCS to his wife Tiah Leng Hway and to one of his two sons, Ong Teng Pheng @ Ong Peter.\n\nMdm Tiah and Peter Ong were at all material times the directors of OTCS.6.    Mr Ong and one Ang Kho Thang (Mr Ang) were business\n\npartners. Mr Ang controlled a company known as Ang Kho Thang & Sons Private Limited (AKTS).\n\nI will refer to Mr Ang and AKTS collectively as Mr Ang/AKTS.7.    Mr Ong/OTCS and Mr Ang/AKTS held shares in the same\n\ncompanies.8.    However as the relationship between Mr Ong and Mr Ang\n\ndeteriorated, Mr Ong sought a parting of ways with Mr Ang but was not successful. Mr Ong then sought\n\nthe assistance of Mr Teo to persuade Mr Ang to agree to a parting of ways.9.    Mr Teo contended that Mr Ong had agreed to pay him $600,000\n\nif he was successful in persuading Mr Ang to the parting of ways. On the other hand, Mr Ong said\n\nthat no specific figure was promised by him and he had only agreed to take care of Mr Teo.10.    A parting of ways was eventually agreed between Mr Ang/AKTS\n\non the one hand and various parties including Mr Ong/OTCS. The terms are stated in a Deed of\n\nSettlement dated 26 May 1999 (the Deed of Settlement).11.    Essentially the Deed of Settlement provided for Mr Ang/AKTS\n\nto transfer their shares in some companies to various parties and for various parties, including Mr\n\nOng/OTCS, to transfer their shares in other companies to Mr Ang/AKTS or their nominees.",
        "MAIN ISSUES": "12.    There were two main issues:(a)    Whether Mr Ong had agreed to pay $600,000 to Mr Teo for\n\n  his services.(b)    If so, whether Mr Ongs agreement bound himself and/or\n\n  OTCS.",
        "WITNESSES": "13.    The witnesses for Mr Teo were:(a)    Mr Teo himself (PW1)(b)    Wong Wei Li (David) (PW2) - independent witness(c)    Thiam Yew Tong (PW3) - independent witness(d)    Alan Tan Hong Huat (PW4) - Mr Teos assistant/project\n\n  manager.14.    The witnesses for Mr Ong and OTCS were:(a)    Mr Ong himself (1DW1)(b)    Tian Ee Keok @ Tian Wen Luan (1DW2) - independent witness(his name was wrongly spelt as Tiah Boon Luah in some of the documents)(c)    Ong Teng Pheng @ Ong Peter (2DW1) - a son of Mr Ong.",
        "OTHER ISSUES": "15.    It was suggested by Peter Ong during cross-examination that\n\nMr Teo was not instrumental in bringing about the Settlement.16.    Mr Koh Hai Keong for Mr Ong also submitted that this was\n\none of the main issues together with the question whether Mr Teo had sacrificed $245,000, as he had\n\nalleged, to bring about the Settlement.17.    I have considered the evidence of Peter Ong on this point\n\nat NE 186B to 187B, 188B to 190E. He was suggesting that it was he and other shareholders of OHPL\n\nwho had persuaded Mr Ang to agree to the eventual settlement between them.18.    Yet, in the past, they had not been successful.\n\nFurthermore, this suggestion was not put to any of the witnesses for Mr Teo.19.    Secondly, when it came to what Mr Teo had achieved, Peter\n\nOng was ambivalent. At times he said he was not sure (NE 190E to 191A, 194D, 194E/F) and at other\n\ntimes he disagreed that Mr Teo had persuaded Mr Ang to agree to the Settlement (NE 192C).20.    Thirdly, Mr Ong himself had admitted that he had approached\n\nMr Teo to persuade Mr Ang to a parting of ways and that Mr Teo had played a crucial role in getting\n\nMr Ang to agree to the Settlement (NE 121A/B). Indeed this was eventually conceded in Mr Kohs\n\nclosing reply at para 3a:The 1st Defendant concurs with the Plaintiffs assertion that the\n\n  Plaintiff was instrumental in the success of the Deed of Settlement.21.    Fourthly, Mr Wong, who described himself as the chief of\n\nthe various other shareholders who negotiated with Mr Ang (NE 41E) agreed that Mr Teo, and his\n\nassistant Alan Tan, had played a significant role in bringing about the Settlement (NE 43C and 54D).22.    Although Mr Spencer Gwee for OTCS sought to suggest to Mr\n\nWong that Mr Teo did not do much work to bring about the Settlement, this was in my view irrelevant.\n\nMr Teo was supposed to bring about a parting of ways and it was immaterial how much effort he had to\n\nput in to bring it about.23.    The evidence also showed that Mr Teo was not present when\n\nthe Deed of Settlement was signed by the parties thereto.24.    Mr Gwee sought to make something out of Mr Teos absence\n\nbut in my view Mr Teos absence was irrelevant. It did not suggest that he had no part to play in\n\nbringing about the Settlement.25.    Therefore, it was my view that there was no real issue on\n\nthis point. Mr Teo had done what he was supposed to do.26.    As regards the point as to whether Mr Teo had sacrificed\n\n$245,000 to bring about the Settlement, Mr Teos task was to bring about the Settlement. If he did\n\nhelp to bring it about by sacrificing $245,000, then that was additional evidence to establish that\n\nhe had played a significant role to bring about the Settlement.27.    However, if he did not sacrifice $245,000, it did not mean\n\nthat he had played no part in bringing about the Settlement.28.    As I had concluded that Mr Teo did bring about the\n\nSettlement, the $245,000 sacrifice was more relevant to the first main issue, ie. whether Mr Ong had\n\npromised Mr Teo a certain sum ie. $600,000 for his services.29.    Mr Koh also submitted that what transpired at meetings on\n\n(a) 13 or 14 July 1999 and (b) on or about 20 August 1995 were additional issues.30.    In my view, they were part of the first main issue just as\n\nmany other allegations were part of the first main issue as well.",
        "FIRST MAIN ISSUE": "31.    The evidence of Mr Teo was that around May 1997, Mr Ong and\n\nPeter Ong came to see him to seek his assistance to act on behalf of OTCS to persuade Mr Ang to\n\nagree to a parting of ways.32.    Mr Teo had agreed and had quoted a success fee of $1.5m. Mr\n\nOng and Peter Ong agreed.33.    Mr Teo then instructed his project manager or assistant\n\nAlan Tan to assist him on this matter.34.    Mr Teo and Alan Tan then contacted one Li Hiaw Ho of\n\nRichard Ellis to do a valuation of assets and also met up with OTCSs solicitor Tan Cheow Hin of\n\nCheow Hin & Partners on the matter.35.    Mr Teo also instructed his lawyer Kalai Arasan from Kalai\n\n& Co to draft a contract between him and OTCS for this work. However Mr Ong and Peter Ong\n\ndecided not to proceed further.36.    There was some documentary evidence to show that one Li\n\nHiaw Ho had been approached to quote his valuation fees for various properties and that Cheow Hin\n\n& Partners had been approached to prepare two drafts of an option to purchase shares.37.    There was no documentary evidence about the drafting of the\n\ncontract between Mr Teo and OTCS by Kalai & Co.38.    Mr Teos evidence was corroborated to some extent by Alan\n\nTan who, from the documentary evidence, was the one who contacted Li Hiaw Ho and Cheow Hin &\n\nPartners.39.    Furthermore, neither Mr Teo nor Alan Tan were challenged on\n\nthis aspect of their evidence. It was only at the stage of closing submissions that Mr Gwee started\n\nto challenge such evidence by pointing out that the draft of the contract allegedly prepared by\n\nKalai & Co was not produced.40.    In my view it was too late for Mr Gwee to do so and I\n\naccepted Mr Teos and Alan Tans evidence about this earlier approach and agreement to use Mr\n\nTeos services, subject to the qualification that I did not accept that Peter Ong was with Mr Ong\n\nwhen Mr Ong first approached Mr Teo. It appeared to me that Peter Ongs name was mentioned as a\n\nbelated attempt to ensure that OTCS was bound by whatever arrangement that Mr Ong had agreed to\n\nsince Peter Ong was at all material times a director of OTCS while Mr Ong was not. I will deal with\n\nthis aspect as part of the second main issue in greater detail later.41.    According to Mr Teo, around May 1998, one Tan Kok Chye\n\napproached him to re-commence work to persuade Mr Ang to a parting of ways. Mr Teo was initially not\n\nprepared to carry on but eventually relented.42.    Tan Kok Chye was a mutual friend of Mr Ong and Mr Teo.43.    In or around October 1998, Mr Teo and Mr Ong then met over\n\nlunch at Oasis Building at 50 Stadium Boulevard to re-negotiate the deal between them. Mr Teo\n\nclaimed that as the economy was bad he was prepared to reduce the success fee (from $1.5 million) to\n\n2% of the shares in Oasis Holdings Pte Ltd (OHPL). OHPL was one of the companies in which OTCS\n\nand Mr Ang and/or AKTS held shares.44.    Alan Tan said he was asked to and he did prepare two\n\nagreements to provide for the success fee of 2% of the shares in OHPL. They were typed. These\n\nagreements were produced in evidence.45.    The first was between Mr Teo and OTCS and provided for OTCS\n\nto transfer 1% of the shares in OHPL to Mr Teo as a success fee (DBD 54 to 55).46.    The second was between Alan Tan and OTCS and provided for\n\nOTCS to transfer another 1% of the shares in OHPL to Alan Tan as a success fee (DBD 116 to 117).47.    Both of these agreements were prepared around October or\n\nNovember 1998. Alan Tan had intended to leave the dates thereof blank but decided to insert the date\n\nof 26 March 1999 thereon. He said it was a date he plucked out of the air as he knew negotiations to\n\nreach a settlement with Mr Ang would take a long time.48.    These agreements were handed to Mr Ong.49.    Mr Teo claimed that Mr Ong did not agree to the success fee\n\nof 2% of the shares in OHPL and so it was agreed between him and Mr Ong that the success fee would\n\nbe in cash and this would be $600,000.50.    However Mr Teo claimed that Mr Ong wanted to re-negotiate\n\nthe fee and with the help of Tian Ee Keok @ Tian Wen Luan (wrongly spelt as Tiah Boon Luah), the fee\n\nwas re-negotiated to $520,000 at a subsequent meeting.51.    According to Alan Tan, this subsequent meeting was around\n\nend December 1998 and it was Tan Kok Chye, not Mr Tian, who participated in the re-negotiation of\n\nthe fee to $520,000.52.    I was of the view that Alan Tan was correct because Mr Tian\n\nsaid he attended two meetings only, ie. the first on 25 March 1999 and another on 13 or 14 July\n\n1999. Furthermore, it was Tan Kok Chye , and not Mr Tian, who signed on the next two agreements\n\nprepared by Alan Tan regarding the fee of $520,000 (NE 85D).53.    Alan Tan was asked to and he did prepare two agreements to\n\nprovide for the success fee of $520,000. They were handwritten and these agreements were produced in\n\nevidence.54.    The first was between Mr Teo and OTCS and provided for OTCS\n\nto pay a success fee of $300,000 to Mr Teo (DBD 114 to 115).55.    The second was between Alan Tan and OTCS and provided for\n\nOTCS to pay a success fee of $220,000 to Alan Tan (DBD 51 to 53).56.    Again the agreements were dated 26 March 1999. Alan Tan\n\nsaid that he had inserted the same date as he had done for the first two (unsigned) agreements\n\npertaining to a success fee of an aggregate of 2% of the shares in OHPL.57.    This time, the agreements were signed by Mr Ong. However he\n\nsigned as a witness pending an intended signature on behalf of OTCS. As I have mentioned, Tan Kok\n\nChye also signed (beside or below Mr Ongs signature). Mr Teo signed on the agreement pertaining\n\nto him (DBD 114 to 115) and Alan Tan signed on the agreement pertaining to him (DBD 51 to 53).58.    The agreements were handed to Mr Ong for Peter Ong to sign\n\non behalf of OTCS but this was not done although Mr Teo chased for it to be done. This frustrated Mr\n\nTeo who then said that he would not carry on with the work unless Mr Ong reverted to a success fee\n\nof $600,000. He said Mr Ong agreed and another agreement was prepared by Alan Tan pertaining to a\n\nsuccess fee of $600,000. This was typed (DBD 7).59.    The version before DBD 7 was partially typed and partially\n\nhandwritten (DBD 8 to 9) but I need not refer to this again since the fully typed version at DBD 7\n\nwas produced in evidence.60.    This agreement was also dated 26 March 1999 as Alan Tan had\n\nused the same date as the other agreements I have earlier mentioned. It was between Mr Teo and OTCS\n\nand provided for OTCS to pay a success fee of $600,000 to Mr Teo. Again Mr Ong signed as a witness\n\npending an intended signature on behalf of OTCS and Mr Teo also signed.61.    According to Alan Tan, the agreement was prepared and\n\nsigned around 25 March 1999 as it was around this time that Mr Ong said that he wanted various\n\nshareholders of OHPL (other than Mr Ang/AKTS) to pay the success fee of $600,000 and Mr Ong was to\n\nbe treated as their spokesman for the purpose of committing them to the $600,000 success fee.62.    Accordingly Alan Tan prepared an agreement to this effect\n\nbut it was made clear to Mr Ong that if the shareholders concerned did not agree, then OTCS would\n\nhave to pay the $600,000.63.    The agreement purporting to appoint Mr Ong as the spokesman\n\nfor these shareholders was handwritten (DBD 4 to 5). It was dated 25 March 1999. It was produced in\n\nevidence. It was signed by Mr Ong and Mr Teo on 25 March 1999. It was witnessed by Mr Tian. Both Mr\n\nTeo and Alan Tan said that Mr Tian had explained this agreement to Mr Ong.64.    Mr Tian confirmed that he did sign on this agreement as a\n\nwitness but, contrary to Mr Teos and Alan Tans assertions, he said he did not explain the\n\ncontents thereof to Mr Ong. Mr Ong had already signed the agreement. When Mr Tian happened to be\n\naround, Mr Teo asked him to sign as a witness, and he agreed to do so.65.    Even if I were to accept Mr Tians evidence on this\n\npoint, I was of the view that Mr Tian would not have signed as a witness to Mr Ongs signature\n\nunless he was satisfied that Mr Ong had understood the contents of the agreement.66.    Mr Ong did not deny that he had signed (a) the two\n\nhandwritten agreements at DBD 114 to 115 and DBD 51 to 53 (as a witness pending an intended\n\nsignature on behalf of OTCS) pertaining to a success fee of $520,000, ie. $300,000 + $220,000 and\n\n(b) the typed agreement at DBD 7 (as a witness pending an intended signature on behalf of OTCS) for\n\na success fee of $600,000 and (c) the typed agreement whereby he was purportedly appointed as a\n\nspokesman for various shareholders of OHPL to pay a success fee of $600,000.67.    However, his position was that he usually signed documents\n\nwhich were in English without understanding them.68.    He said he used to sign such documents if they were first\n\nsigned by Mr Ang as he trusted Mr Ang. He did not understand the contents before he signed nor did\n\nhe ask anyone to tell him about the contents thereafter. This also applied to the agreements in\n\nquestion which he had signed.69.    However, the agreements in question before me had not been\n\nsigned by Mr Ang. Mr Ong then said that he was a very trusting person who trusted others readily.70.    Mr Ong said that he had started doing business in 1960. He\n\naccepted that he owned twenty-seven businesses and in the course of his years in business he had\n\nsigned many documents in English, including cheques and agreements and he could recognise numbers.71.    Mr Ong also said initially that he did not show the\n\nagreements mentioned above (and other subsequent) agreements to anyone (NE 114E).72.    However, subsequently he said that he had handed the\n\nagreements to Peter Ong (NE 133C to 138C).73.    When questioned about the agreements, Mr Ong kept on saying\n\nthat he would have to check with Peter Ong as Peter Ong handled such matters (NE 136F to 137D). He\n\nwas residing with Peter Ong although he did not always stay at that residence (NE 140F to 141A).74.    Yet Mr Ong denied that he had ever discussed the agreements\n\nwith Peter Ong (NE 141B).75.    On the other hand, Peter Ong said he had kept some\n\ndocuments only. None were of agreements which Mr Ong had signed whether as a witness or as a party\n\nthereto (NE 200A to B). He accepted that his evidence contradicted his fathers.76.    As for the Deed of Settlement which Mr Ong had signed,\n\nthere was an interpretation clause beside his signature. Yet he pretended that he could not remember\n\nwhether it was interpreted to him or not (NE 128C).77.    On the point as to whether Mr Ong understood the contents\n\nof the agreements that he had signed, I did not accept Mr Ongs position. He was an experienced\n\nbusinessman and was not nave. He was not the simpleton that he had portrayed himself to be.78.    Neither was Peter Ong as unaware of the agreements as he\n\nwas suggesting. On this point, I am of the view that he must have seen the agreements soon after\n\nthey were signed by Mr Ong and discussed them with Mr Ong but he did not sign the agreements on\n\nbehalf of OTCS nor return them.79.    I would also mention that according to Mr Ong, all the\n\nagreements dated 26 March 1999 (DBD 54 to 55, 116 to 117, 114 to 115, 51 to 53, and 7) had been\n\nprepared at the same time. Peter Ong suggested he had seen them then. It seemed to me that their\n\nevidence was based not so much on their recollection of events but on the dates on the agreements.80.    Furthermore, if their evidence was correct, it would mean\n\nthat (a) the agreements for a total of 2% of the shares in OHPL (DBD 54 to 55 and 116 to 117) were\n\nprepared at the same time as (b) the agreements for a total of $520,000 (DBD 114 to 115 and 51 to\n\n53) and (c) the agreement for $600,000 (DBD 7) and that both (b) and (c) were signed at the same\n\ntime by Mr Teo and Mr Ong. I did not think this was the case and I preferred Alan Tans\n\nexplanation of the sequence of events as mentioned in paras 44 to 58 and 60 to 62 above.81.    In any event, the material point was that Mr Ong did sign\n\nthe agreement for $600,000 (DBD 7) although as a witness pending an intended signature on behalf of\n\nOTCS.82.    Mr Ong also sought to make something out of an alleged\n\nincident on 25 March 1999, after the agreement dated 25 March 1999 (DBD 4 to 5) to purportedly\n\nappoint him as a spokesman for various shareholders of OHPL, was signed. He claimed that Mr Teo was\n\nangry with him because Peter Ong who arrived at the venue later, refused to sign this agreement.\n\nAccording to Mr Ong, Mr Teo then tore this agreement and purportedly called Mr Ang to call off the\n\ndeal.83.    Mr Ongs evidence on this point was supported by Mr Tians\n\nevidence. However I noted that the agreement dated 25 March 1999 did not require Peter Ongs\n\nsignature. Mr Teo probably got angry because Peter Ong did not sign the other agreement ie. at DBD 7\n\npertaining to the success fee of $600,000. Peter Ong had given the excuse that he had to consult his\n\nlawyer first.84.    Furthermore, the evidence about Mr Teo tearing up the\n\nagreement at DBD 4 to 5 was probably incorrect because that document was produced and even Mr Tian\n\nsaid in cross-examination that he did not see the document allegedly torn up.85.    The Defendants were trying to use the allegation about Mr\n\nTeo calling Mr Ang to call off the deal to establish (a) that Mr Teo did not have much influence\n\nover Mr Ang as the Settlement was achieved notwithstanding Mr Teos call to Mr Ang and (b) that Mr\n\nTeo did not do his part to deserve the $600,000.86.    I was of the view that even if Mr Teo had called Mr Ang to\n\ncall off the deal, this was more of a show. Mr Teo must have known that it was in his own interest\n\nto see the deal through and eventually, the Settlement was achieved.87.    As I have mentioned, even Mr Ong conceded that Mr Teo had\n\ndone his part.",
        "Deed of Settlement dated 26 May 1999": "88.    Mr Teo claimed that in order to persuade Mr Ang to part\n\nways and to agree to the Deed of Settlement, he made sacrifices totalling $245,000. The particulars\n\nare stated in the Statement of Claim as follows:PARTICULARS(a)    A debt of $400,000 was due and owing by Great Eastern\n\n  Hotel (to be solely controlled by Ang and/or AKTS upon the division of assets and businesses with\n\n  the 2ndDefendants) to the Plaintiff. Ang requested that Oasis Holdings Pte Ltd (in\n\n  which 2ndDefendants would have control) settle this debt on behalf of Great Eastern\n\n  Hotel. However, Oasis Holdings Pte Ltd was only prepared to pay the sum of $300,000. The Plaintiff\n\n  therefore agreed to bear and suffered a loss of $100,000.(b)    Great Eastern Hotel requested that the Plaintiff write\n\n  off the sum of approximately $120,000 due and owing by them to the Plaintiffs business firm,\n\n  Red Horse Construction. The Plaintiff agreed to absorb the sum.(c)    Angs son, Damis Ang, would only proceed with the Deed\n\n  subject to the payment of $50,000 due and owing to him by Oasis Holdings for his previous\n\n  managerial services at Oasis Disco Club. The Plaintiff agreed to absorb the said sum to expedite\n\n  the execution of the Deed. Oasis Holdings Pte Ltd later agreed to bear half of the sum of $50,000.\n\n  The Plaintiff therefore incurred \"expenses\" in the sum of $25,000.89.    The allegation about the first item was corroborated by cl\n\n4(c)(xii) of the Deed of Settlement which refers to a claim by Mr Teo, Red Horse Construction and/or\n\nRed Horse Art Studio (which were controlled by Mr Teo) for $400,000 which was to be settled for\n\n$300,000.90.    The allegation about the second item was not supported by\n\ndocumentary evidence.91.    The allegation about the third item was supported by\n\ndocumentary evidence outside of the Deed.92.    In any event, Mr Teo was not challenged on his evidence\n\nabout the financial sacrifices he had to make. It was only after his evidence was completed that\n\nsuggestions were made to other witnesses that his evidence was untrue and subsequently arguments\n\nwere presented that there was no way to verify his financial sacrifices.93.    Furthermore, the first item is part of the Deed of\n\nSettlement which Peter Ong and Mr Ong had signed.94.    I was of the view that Mr Teo had made the financial\n\nsacrifices for at least the first and third items and he would not have made such sacrifices if he\n\nhad received only a vague promise from Mr Ong to take care of him if he successfully achieved his\n\ngoal. He had been promised a certain sum ie. $600,000 for achieving his goal.",
        "Meeting on 13 or 14 July 1999": "95.    Mr Teo said that after the Deed of Settlement was signed,\n\nhe approached Mr Ong for payment of the success fee.96.    However Mr Ong wanted the shareholders of OHPL (excluding\n\nMr Ang/AKTS who were no longer shareholders of OHPL under the Deed of Settlement) to pay Mr Teos\n\nsuccess fee. However the shareholders did not agree.97.    Mr Ongs evidence was that Mr Teo and Alan Tan kept on\n\ndemanding the $600,000 from him although he had not agreed to a specific figure for the success fee.98.    Mr Ong said he then approached Mr Wong, who was then the\n\nManaging Director of OHPL to help him to resolve the matter and, at his request, Mr Wong contacted\n\nMr Teo to see if Mr Teo could settle the matter for a lesser sum (Mr Ongs AEIC para 13).99.    Mr Wongs evidence was that Mr Ong had first sought his\n\nhelp to get the shareholders of OHPL to agree to pay the success fee and when that failed, Mr Ong\n\nsought his help to reduce the success fee (NE 47C to E). He was not challenged on this evidence\n\nwhich I accepted.100.    I now come to Mr Thiams evidence. According to Mr\n\nThiam, he was first approached by Mr Teo in April 1999 to mediate in the matter of the success fee.\n\nMr Teo had approached him because Mr Teo said he was known to be a long time friend and business\n\npartner of Mr Ong. Also, Mr Thiam was an elder of the Singapore Fuzhou Association (the\n\nAssociation) and Mr Ong was a member of the Association as well.101.    Mr Thiams evidence was that he did not know Mr Teo well\n\nand he had first met Mr Teo in February 1999.102.    According to Mr Wong, Mr Thiam called him on 13 or 14 July\n\n1999 to inform him that Mr Ong had agreed to pay $550,000. At that time, Mr Teo, Alan Tan and Tan\n\nKok Chye were with him and he sought and obtained Mr Thiams clearance for them to go to Mr Thiams\n\noffice.103.    It was the evidence of both Mr Wong and Mr Thiam that Mr\n\nTeo was persuaded to agree to reduce the success fee to $550,000 and Mr Ong had clearly agreed to\n\nthis. However Mr Ong wanted to pay in instalments and Mr Teo agreed. The instalments were to be paid\n\nas follows:(a)    $100,000 by 20 July 1999(b)    $200,000 by 13 August 1999 and(c)    the balance of $250,000 would be paid from the sale\n\n  proceeds of 125,000 shares owned by Mdm Tiah (ie. Mrs Ong) in a company called Hai Guan Realty Pte\n\n  Ltd (HGR) should Mr Ang/ATKS exercise an option given to them to buy such shares at\n\n  $250,000. The option was one of the terms ie. cl 3(A)(ii)(3) of the Deed of Settlement and was\n\n  exercisable within 36 months from the Completion Date of the Deed of Settlement. This was defined\n\n  to be 14 days from the date of the Deed (which was 26 May 1999).104.    I would mention that the third instalment assumes that Mr\n\nAng/AKTS would exercise the option to buy Mdm Tiahs shares in HGR. If they do not, Mr Teo would\n\nhave waited about 36 months only to have to again seek payment of the $250,000.105.    Mr Teo was concerned that Mr Ong would not honour the\n\ninstalment agreement and Mr Ong said that he needed time to raise the money.106.    Mr Wong and Mr Thiam proposed that OHPL would make a loan\n\nto Mr Ong to enable him to pay the first instalment. He and Mr Thiam then signed a cash cheque on\n\nbehalf of OHPL for $100,000 post-dated to 20 July 1999 and handed it to Mr Teo. In turn, Mr Ong\n\nsigned a payment voucher acknowledging that he had received $100,000 from OHPL as a short term loan.107.    Mr Ong subsequently issued a cheque for $100,000 to repay\n\nOHPL. It was presented for payment on 20 July 1999 but bounced. When it was re-presented for payment\n\non 22 July 1999, it cleared.108.    Alan Tan said that when Mr Ong agreed to pay $550,000 in\n\nthe manner stated in para 103, he and Mr Wong had prepared drafts of an agreement to record the oral\n\nagreement.109.    Alan Tans handwritten draft is undated (DBD 1 to 3).\n\nThe typed version is dated 20 July 1999 (DBD 10 to 11). Alan Tan said he was asked by Mr Teo to\n\nprepare this draft to assist Mr Wong who had been asked by Mr Ong to prepare a draft (NE 86D to F).110.    Mr Wongs typed draft was undated (DBD 6).111.    Alan Tan was not challenged on his evidence regarding\n\nthese drafts.112.    In my view, the drafts corroborated the allegation that Mr\n\nOng had agreed to pay $550,000 in the manner stated in para 103 above and the drafts were not\n\nfinalised because Mr Ong then decided to resile from his agreement to pay the $550,000.113.    Mr Ongs evidence in his AEIC at para 14 was that the\n\nmeeting at Mr Thiams office was on 20 July 1999 (and not 13 or 14 July 1999).114.    In cross-examination, he denied that he was at Mr Thiams\n\noffice and then conceded this (NE 130B to F).115.    Mr Ong then said that he was at Mr Thiams office to\n\ndiscuss other matters (NE 131B) but he did not elaborate what those matters were.116.    Mr Ong said that he did not agree to the $550,000. It was\n\na figure demanded by Mr Teo and he had remained silent as he believed that all the persons at the\n\nmeeting had ganged up against him.117.    Mr Ong said that he had agreed to pay only $100,000. He\n\nclaimed that he had to borrow money from a friend to repay OHPL for the $100,000 which they had lent\n\nto him to pay Mr Teo. Mr Ong did not name the friend.118.    Mr Ong claimed that the $100,000 was sufficient to\n\ncompensate Mr Teo for his efforts as Mr Teo did not do much work.119.    When he was confronted with the financial sacrifices of\n\n$245,000 made by Mr Teo to bring about the Settlement, Mr Ong said he was not aware of such\n\nsacrifices. I did not believe Mr Ong on this aspect. As I have mentioned, the first of the three\n\nitems comprising the $245,000 ie. the $100,000 sacrifice was mentioned in the Deed of Settlement\n\nitself.120.    Counsel for Mr Ong and for OTCS sought to make something\n\nout of the fact that no directors resolution was obtained for OHPL to lend the $100,000 to Mr Ong\n\nto pay the first instalment. It was also suggested that when Mr Wong and Mr Thiam agreed to OHPL\n\nlending Mr Ong $100,000, they were trying to trap Mr Ong into acknowledging that he would pay\n\n$550,000 to Mr Teo and trying to protect OHPL (NE 51E and para 13 of closing submission by Mr Gwee).121.    I was of the view that the absence of the directors\n\nresolution was immaterial.122.    As for the argument that Mr Wong and Mr Thiam were trying\n\nto spring a trap on Mr Ong to protect the interest of OHPL, I was of the view that this was a\n\ndesperate argument. OHPL did not contract with Mr Teo, it was Mr Ong who did.123.    Besides, the payment of $100,000 did not necessarily mean\n\nthat Mr Ong had agreed to pay $550,000.124.    Mr Ongs witness, Mr Tian, said it was Mr Thiam who\n\ncontacted him to go to Mr Thiams office to resolve the matter on 13 or 14 July 1999 (NE 162C).125.    I was of the view that the meeting was on 13 or 14 July\n\n1999 and not 20 July 1999 as alluded to by Mr Ong. Again his evidence was based on the date on a\n\ndocument ie. the cheque for $100,000 and not on his recollection of events.126.    Mr Tian also said that the main purpose of the meeting was\n\nto discuss the success fee owing to Mr Teo (NE 164C) which contradicted Mr Ongs evidence that he\n\nwent there for other matters (NE 131B).127.    Mr Tian was the Chairman of a clan whose members came from\n\nthe same village in China. Mr Ong and Mr Thiam were also members of the same clan and that clan was\n\npart of the Association (NE 173D and 174C/D).128.    Mr Tian said that when he arrived at Mr Thiams office,\n\nit appeared to him that there was already an agreement to pay Mr Teo $550,000. He did not hear the\n\nfigure of $600,000 being mentioned. Mr Thiam was doing most of the talking and Mr Ong simply kept\n\nquiet. He heard Mr Thiam talking with Mr Teo and understood the contents of their conversation (NE\n\n164F to 165A) but yet he kept on saying he was not very sure whether Mr Thiam was trying to reduce\n\nthe success fee from $600,000 to $550,000 (NE 165B to C). He also said he was not certain whether Mr\n\nThiam was acting as a mediator. Mr Wong and Mr Thiam had already made the necessary arrangements and\n\nhe did not know whether Mr Ong agreed to this. (NE 175A).129.    Mr Tian also said that the meeting started off with Mr\n\nThiam talking about $550,000 and that OHPL would pay $100,000 first on behalf of Mr Ong. However, he\n\ncould not remember the other terms discussed (NE 176B to D).130.    Mr Wong agreed that Mr Ong did not speak up much at this\n\nmeeting, or other meetings (NE 58E) but he did not say that Mr Ong had remained silent.131.    Indeed Mr Wong said that it was because Mr Ong did not say\n\nmuch that Mr Ong was asked specifically to acknowledge or refute what Mr Teo was saying about having\n\ndone the job successfully and the success fee of $600,000 (see Mr Wongs AEIC para 3 and NE 58E to\n\nF). Mr Teo had so acknowledged.132.    I was of the view that Mr Tian was deliberately vague as\n\nto what had transpired at the meeting of 13 or 14 July 1999. He tried to give the impression that Mr\n\nOng did not have much of a choice but he stopped short of saying that all the others had ganged up\n\nagainst Mr Ong, as alleged by Mr Ong.133.    Besides, it was not Mr Ongs position that he had agreed\n\nto pay $550,000 under undue pressure but rather that he did not even agree to it at all.134.    The allegation that the others had ganged up against him\n\nwas a red herring. In addition, it reflected the extent to which Mr Ong was prepared to go to to\n\ndeny what he had agreed.135.    After all, Mr Wong is the son of one of Mr Ongs former\n\npartners in a business. It was Mr Ong who approached Mr Wong to help him out over the matter of the\n\nsuccess fee.136.    In the course of cross-examination, Mr Koh suggested to Mr\n\nWong that he had had personal clashes with Mr Ong. Mr Wong agreed that there had been disputes, but\n\nthey were not over the success fee (NE 50C to E). In any event, Mr Koh stopped short of suggesting\n\nto Mr Wong that he was lying to the court because of the disputes between him and Mr Ong.137.    It was during the course of re-examination of Mr Ong that\n\nMr Ong suggested that Mr Wong and Mr Teo were plotting against him (NE 159F). The basis for his\n\nsuggestion was that Mr Wong had rented out one of three pagodas in the premises of OHPL at a low\n\nrent and he was angry with Mr Wong for doing so. He insinuated that because of that incident, the\n\nshareholders of OHPL asked Mr Wong to leave OHPL.138.    Mr Ong did not mention the date when these events\n\nallegedly occurred.139.    As Mr Wong said he had resigned from OHPL on 31 January\n\n2000, I infer that the event, even if true, had occurred some time in the last quarter of 1999 or\n\nthe beginning of 2000.140.    Even then, it did not mean that Mr Wong would conspire\n\nwith Mr Teo against Mr Ong. I was of the view that Mr Wong did not have a hidden agenda against Mr\n\nOng when he testified against him. I was impressed by Mr Wongs demeanour and candid answers.141.    Besides, Mr Wong was not the only independent witness\n\ntestifying against Mr Ong. Mr Thiam had also testified against Mr Ong.142.    Mr Thiam and Mr Ong were old friends and business partners\n\nfor many years. They were both founder members of OHPL and came not only from the same Association\n\nbut from the same clan within the Association.143.    On the other hand, Mr Thiam hardly knew Mr Teo and had met\n\nhim for the first time only around February 1999.144.    There was no reason for Mr Thiam to lie in his evidence\n\nagainst Mr Teo.145.    I also noted that Mr Koh made a desperate attempt to put\n\nit to Mr Thiam that he and Mr Ong had borne personal grudges against each other all along without\n\nany elaboration (NE 67F). Mr Thiam naturally denied this.146.    Furthermore, Mr Ong did not give any reason as to why Mr\n\nThiam would bear a grudge against him. Nor did Mr Ong even allege that they were holding personal\n\ngrudges against each other although Mr Koh had taken this position.147.    Furthermore, Mr Tian, who was the chairman of the same\n\nclan, did not suggest any reason why Mr Thiam would lie in his evidence against Mr Teo.148.    I conclude that not only did Mr Ong agree to pay $550,000\n\nbut that the instalment plan mentioned in para 103 above was in response to his position that he\n\nneeded time to raise money. Otherwise there would have been no reason for Mr Teo to agree to such a\n\nplan.149.    For example, the third instalment payment, which was to\n\nhave been paid only when Mr Ang/AKTS exercised the option to purchase the 125,000 shares owned by\n\nMdm Tiah was to help Mr Ong.150.    It was suggested that Mr Ong did not agree and could not\n\nhave agreed to the manner in which the third instalment was to be paid as the HGR shares were not\n\nhis. However it was clear to me that the shares were his wifes only in name and she would have\n\ndone whatever he told her to do in respect of them or the sale proceeds thereof.151.    To bolster Mr Ongs position that he had not agreed to\n\npay $550,000 at the meeting of 13 or 14 July 1999, Mr Ong said that he was advised by a friend to\n\nlodge a police report. The friend was not named.152.    The police report is dated 22 July 1999. It states:I am a shareholder of Oasis Holdings Pte Ltd at No. 50 Kallang Park.Sometime in May 99 while I was at Oasis Restaurant together with Teo Lye Huat\n\n  and Alan Tan Hong Huat, we discussed about the transferring of my shares at Great Eastern into\n\n  Oasis Holdings. Since I am illiterate in English, I seek their assistance to do the transfer of\n\n  the shares and I also promised to give them some commission but no amount was stated.Sometime in June 99, at Oasis Restaurant, both of them told me to give 2% of\n\n  the Oasis share as commission which is amounting to $600,000/- but I refused to give them as the\n\n  amount is too much. Alan Tan also draft out a letter stating that I had to pay them $600,000/- and\n\n  they also forced me to sign but I refused.Every time they met me at Oasis, they will shout and demand me for the\n\n  $600,000/- and their actions put me in fear. On 20/7/99 at Oasis, I gave them a cheque of\n\n  $100,000/- so as to shut them up, but they still harass me to pay them $500,000/- balance. They\n\n  also hinted to me that by paying $2000/- they can lure a killer anytime. I lodged this report for\n\n  I feared for my safety and also that I am not going to pay the balance of $500,000/- to the two\n\n  men as I do not owe them.Particulars of the two men are:(1)    Teo Lye Huat I/C: 2003912D Blk 110 Aljunied Crescent\n\n  #11-90H/P: 98138210 (O) 7483734(2)    Alan Tan Hong Huat HP: 97901638153.    The police report was inaccurate in that:(a)    There was no meeting in June 1999. Also, the meeting on\n\n  13 or 14 July 1999 was not at Oasis Restaurant but at Mr Thiams office.(b)    It did not mention the presence of other persons like Mr\n\n  Wong, Mr Thiam and Mr Tian at the meeting.(c)    Mr Ong did sign an agreement in respect of the $600,000\n\n  (in March 1999), although as a witness (DBD 7).(d)    It suggested that Mr Teo was chasing for a fee of\n\n  $600,000 when Mr Teo was, by July 1999, prepared to accept $550,000 instead of $600,000.154.    I was of the view that this police report was a\n\nself-serving document because Mr Ong knew that Mr Teo would be looking to him to pay the balance sum\n\nof $450,000. Mr Ong wanted to give the impression that he had agreed to pay $100,000 only.155.    Subsequently two letters, each dated 10 August 1999, were\n\nsent for or by Mr Ong to OHPL. One was signed for Mr Ong by a person who was not identified. The\n\nother was signed by Mr Ong. The terms of each letter were identical.156.    The letter stated that (a) Mr Ong understood that there\n\nmay be an arrangement for OHPL to pay Mr Teo a fee on Mr Ongs behalf, (b) the $100,000 (already\n\npaid) must be treated as full and final settlement of Mr Teos fee and (c) Mr Ong did not owe Mr\n\nTeo any monies and he would not be liable for any monies that OHPL may pay to Mr Teo.157.    I was of the view that these two letters were sent for the\n\nsame purpose as the police report of 22 July 1999 was made.158.    They were sent on 10 August 1999 because the next\n\ninstalment was due to be paid by 13 August 1999.159.    If indeed all Mr Ong had agreed to on 13 or 14 July 1999\n\nwas to pay Mr Teo $100,000, he need not have been so concerned that Mr Teo would chase him for more\n\nmonies. However, Mr Ong knew that he had agreed to pay $550,000, which was a reduction from the\n\n$600,000, and he knew Mr Teo would expect payment of the next instalment of $200,000 by 13 August\n\n1999.160.    In response to Mr Ongs letters, Mr Wong replied by\n\nletter dated 12 August 1999 on behalf of OHPL and stated the arrangement between Mr Ong and Mr Teo\n\nfor payment of $550,000 and to stress that there was no arrangement between OHPL and Mr Teo.",
        "Meeting on 20 August 1999": "161.    Mr Teo said that he had then decided to take legal action\n\nand asked his solicitor John Ting to meet him on 20 August 1999 for lunch at a Taiwan porridge\n\nrestaurant at Oasis building.162.    There Mr Teo encountered Mr Thiam and Mr Ong and to give\n\nface to Mr Thiam, Mr Teo decided to have lunch with them. Mr Wong, Alan Tan, Tan Kok Chye and John\n\nTing were present as well.163.    Mr Teo said that Mr Ong claimed that the letter of 10\n\nAugust 1999 (it was not clear which) was not sent by him but by his son (presumably Peter Ong) and\n\nasked Mr Teo to forgive his sons stupidity. Mr Teo said that after much imploring by Mr Ong, he\n\nagreed to further reduce the success fee from $550,000 to $520,000 with payment of $170,000 by 3\n\nSeptember 1999 (the earlier payment date of 13 August 1999 had passed) and, the balance of $250,000\n\nwhen Mr Ang/AKTS exercise the option to buy Mdm Tiahs shares in HGR. At this meeting, Mr Wong\n\nalso asked Mr Ong whether Mr Ong was agreeable to this arrangement and Mr Ong replied in the\n\naffirmative.164.    John Ting then prepared an agreement between Mr Teo on the\n\none part and Mr Ong and Mdm Tiah on the other part to reflect the payment of the balance of $420,000\n\nas agreed. The agreement is at DBD 110 to 113. The agreement was sent to Mr Ongs solicitors\n\nHaridass Ho & Partners.165.    Mr Teo said that on 1 September 1999, Peter Ong issued\n\nthree cheques as follows:(a)    OCBC cheque No 363808 dated 3 September 1999 for $60,000\n\n  (cash cheque)(b)    OCBC cheque No 363809 dated 20 September 1999 for $60,000\n\n  (cash cheque)(c)    OCBC cheque No 363810 (undated) for $50,000 (cash cheque)166.    A payment voucher dated 1 September 1999 had been prepared\n\nand someone signed thereon to acknowledge receipt. According to Peter Ong the person who signed to\n\nacknowledge receipt of the three cheques was an Indian man who was referred to as Ah Ow (NE\n\n220F).167.    However the first of these three cheques bounced. Mr Teo\n\ntried to contact Mr Ong but to no avail. He then decided to take legal action to claim $600,000 less\n\nthe $100,000 already paid since Mr Ong did not keep his part of the agreements reached on 13 or 14\n\nJuly 1999 and on 20 August 1999.168.    Alan Tan and Mr Wong corroborated Mr Teos evidence\n\nabout the 20 August 1999 meeting. Their evidence on this point was not challenged during\n\ncross-examination by Mr Koh or Mr Gwee.169.    Mr Thiam also corroborated Mr Teos evidence about the\n\nmeeting on 20 August 1999.170.    His evidence about this meeting was hardly challenged\n\nduring cross-examination by Mr Koh. The only challenge about this meeting was a vague challenge at\n\nNE 68C:Q I put it to you that you are not telling the truth because OTC did not\n\n  agree to $550,000 or $520,000 as alleged by you.A I disagree.171.    Mr Gwee did not challenge Mr Thiam on his evidence about\n\nthe 20 August 1999 meeting.172.    Mr Ong did not accept that he had agreed to $520,000 at\n\nthe meeting on 20 August 1999 which meeting was not mentioned by Mr Ong in his AEIC. His AEIC only\n\nreferred to and exhibited the agreement (prepared by John Ting pursuant to the 20 August 1999\n\nmeeting) which Mr Ong said was given to him by Mr Teo.173.    Yet during cross-examination, Mr Ong denied he had seen\n\nthis agreement (NE 131F to 132A).174.    As for the three cheques totalling $170,000, the case for\n\nMr Ong/OTCS was that the cheques were issued because one Ah Ow had threatened Mr Ongs life.175.    To bolster this position, Mr Ong referred to another\n\npolice report which he made on 3 September 1999. It states:On 2.9.99 @ 4 p.m. at Oasis Restaurant of Stadium Blvd. One M/Indian known\n\n  as Ah Ow came up to the Coffee House where I was and (sic) threaten to throw me into the sea\n\n  if I do not pay up the money that I owed Teo Lai Huat I/C: 2003912D B/110 Aljunied Crest.\n\n  #11-90 S(380110). After which the m/Indian sat in the coffee house and wait for me to make\n\n  payments thru him.I wish to state that I do not owe Teo Lai Huat any money. This said\n\n  person was one of the renovation contractor for my company.176.    According to this report and the evidence from Mr Ong and\n\nPeter Ong, the threat was made on 2 September 1999. Yet the payment voucher, which must have been\n\nprepared by Peter Ong or on his instructions, was dated 1 September 1999.177.    Furthermore, this police report made no reference to the\n\nallegation that as a result of the threat, Peter Ong had issued the three cheques. Neither was a\n\nreport made by Peter Ong.178.    In my view, the police report was part of the modus\n\noperandi of Mr Ong. It was a self-serving document to lend credence to his allegations.179.    However, it did not contain the truth in view of the\n\nfactors I have mentioned.180.    I had also taken into account other factors.181.    If Mr Teo had really caused a threat to be made on Mr Ongs\n\nlife for the $170,000, Mr Teo would have insisted on payment of the $170,000 by the 3 September 1999\n\ndead-line instead of allowing it to be paid by three cheques, one dated 3 September 1999, the second\n\ndated 20 September 1999 and the third, undated.182.    I was of the view that Mr Ong had again requested for time\n\nto pay the $170,000 and that is why these three cheques were issued.183.    Furthermore, if a threat had really been made on Mr Ongs\n\nlife, Mr Ong or Peter Ong would have contacted the police while Ah Ow was waiting for payment\n\nor immediately after. After all, Mr Ong had already gone to the police to make his earlier report of\n\n22 July 1999.184.    Yet, the second police report was made only at 8.50pm of 3\n\nSeptember 1999 even though the threat was supposed to have been made at about 4pm of 2 September\n\n1999.185.    For completeness, I would mention that after 3 September\n\n1999, Mr Ong sent a letter dated 6 September 1999 to OHPL to refer to its letter dated 12\n\nAugust 1999 (refer to para 160 above) and stating that he did not agree to any specific amount as a\n\nfee.186.    He then sent another letter to OHPL dated 22 September\n\n1999 to confirm that he had authorised his wife to sign the earlier letter dated 6 September 1999.187.    There were two copies of the earlier letter dated 6\n\nSeptember 1999. One is found at p 12 of Mr Wongs AEIC with a signature and the other is at p 92\n\nof Mr Ongs AEIC which appears to be initialled. Neither tallies with the signature of Mdm Tiah\n\nwho signs in Chinese, see the Deed of Settlement at p 41, 40 and 39.188.    In any event, these letters of 6 and 22 September 1999\n\nwere again self-serving.",
        "Two attempts made by Mr Ong to reschedule payment of $420,000": "189.    Alan Tan also testified that in April 2000, Mr Ong had\n\ncalled him to ask if Mr Teo would accept the balance of $420,000 as follows:(a)    $170,000 to be paid in seventeen instalments(b)    $250,000 when Mr Ang/AKTS exercise the option to buy Mdm\n\n  Tiahs shares in HGR (NE 90D).190.    This was at a time when the parties were to exchange their\n\nAEICs and Alan Tan believed that Mr Ong/OTCS were not in a position to do so (NE 101E/F).191.    Mr Thiam also testified that in the week before the trial\n\nstarted, Mr Ong had contacted him and offered to pay the $420,000 by paying $170,000 in seventeen\n\ninstalments and the balance of $250,000 when Mr Ang/AKTS exercise the option to buy Mdm Tiahs\n\nshares in HGR. However Mr Teo did not agree and wanted $600,000 as Mr Ong did not keep his previous\n\npromises (NE 68F to 69B).192.    Neither Alan Tan or Mr Thiam was challenged on their\n\nevidence on this point. It was only when Mr Ong took the witness stand and was asked by Mr Kang\n\nabout these discussions that Mr Ong denied them.193.    I accepted the evidence of Alan Tan and Mr Thiam on this\n\npoint. Mr Ong knew that he had agreed to pay $600,000, then $550,000 and then $520,000. As late as\n\nApril 2000 when AEICs were to be exchanged and in the week before the trial started on 25 May 2000,\n\nhe made two attempts to seek even more time to pay $170,000. He would not have done so if he had\n\nnever agreed to pay the sums I have mentioned ending with the sum of $520,000.",
        "The amount payable": "194.    Mr Koh had submitted that if I accepted the evidence for\n\nMr Teo about Mr Ongs agreement to pay $600,000, then $550,000 and then $520,000, then the amount\n\npayable should be $520,000 as the last agreement had extinguished the original agreement to pay\n\n$600,000. I did not agree.195.    As Mr Teo had established the agreement to pay him\n\n$600,000, he was not obliged to accept less. His agreements to accept lower sums did not bind him as\n\nthere as no legal consideration to bind him.",
        "Summary on First Main Issue": "196.    The Defendants position on the various agreements or\n\ndrafts was that they were not signed because Mr Ong had never agreed to the contents of the same.197.    It was also submitted on their behalf that the reason why\n\nneither Mr Teo nor Alan Tan had a copy of the various agreements or drafts (except for John Tings\n\ndraft) was because there was no oral agreement between Mr Teo and Mr Ong.198.    However these arguments could not overcome the fact that\n\nMr Ong did sign some of the agreements, although as a witness (leaving aside the one which he signed\n\nto be the purported spokesman for various shareholders of OHPL).199.    The agreements he signed contain specific figures.200.    If he had never agreed to pay a specific figure he would\n\nnot have signed them as a witness. He signed as a witness because the agreements were stated to be\n\nwith OTCS and he was not an officer of OTCS.201.    It was suggested that Mr Teo and Alan Tan did not disclose\n\nthe various agreements in which Alan Tan was to receive 1% (of the 2%) of the shares in OHPL or\n\n$220,000 (of the $520,000 agreed in December 1998) because Mr Teo and Alan Tan were trying to hide\n\nthe fact that Alan Tan was to share in Mr Teos success fee.202.    I was of the view that this was not a valid argument. They\n\ndid not have copies of these agreements to disclose. Also, Alan Tan did not pretend to be an\n\nindependent witness and in the course of the trial, he was quite candid about the fact that he was\n\nto share in the fee.203.    It was also argued that if Mr Teo had felt that Mr Ong was\n\ndishonest, as Mr Teo had suggested, then Mr Teo would have ensured that Mr Ong signed the agreements\n\nor kept originals or copies of documents.204.    However, Mr Teo did get Mr Ong to sign some agreements.\n\nWhere Mr Ong signed as a witness, it was because, as a formality, he could not sign for OTCS.205.    The reason why Mr Teo and Alan Tan did not have copies of\n\nthe various agreements or drafts and Mr Ong and/or Peter Ong did was because the agreements and\n\ndrafts were left with Mr Ong for him to get Peter Ong to sign, where the agreements were in the name\n\nof OTCS. Where they were in the names of Mr Ong and Mdm Tiah, Mr Ong was supposed to follow up on\n\nthem by getting them finalised and signed by his wife and him but he did not. Mr Teo and Alan Tan\n\nhad omitted to keep copies but, in any event, Mr Ong and/or Peter Ong kept the agreements instead of\n\nthrowing them away.206.    The evidence for Mr Teo established that he and Mr Ong had\n\nagreed to a reduction of the $600,000 to $550,000 at the meeting on 13 or 14 July 1999 and then from\n\n$550,000 to $520,000 at the meeting on 20 August 1999.207.    Such evidence included independent evidence from Mr Wong\n\nand Mr Thiam.208.    The evidence of Mr Tian for the 13 or 14 July 1999 meeting\n\nwas vague and did not go so far as to contradict the evidence of Mr Wong and Mr Thiam.209.    As for the evidence for Mr Teo regarding the 20 August\n\n1999 meeting this was not tested or not really tested in cross-examination.",
        "SECOND MAIN ISSUE": "210.    As I have mentioned, the second main issue is whether Mr\n\nOngs agreement bound himself and/or OTCS. The evidence focussed on whether it bound OTCS.211.    There was some reference in Mr Teos evidence and Alan\n\nTans evidence alluding to discussions with Peter Ong about the appointment of Mr Teo prior to or\n\nat the time the $600,000 fee was agreed. It was also said that Mr Ong had mentioned specifically\n\nthat the agreement to pay $600,000 was made on behalf of OTCS.212.    I did not accept that Peter Ong had participated in such\n\ndiscussions then. Nor did I accept that Mr Ong had mentioned specifically that the agreement to pay\n\n$600,000 was made on behalf of OTCS. If Mr Ong was in fact controlling OTCS, there was no need for\n\nhim to mention specifically that the agreement was made on behalf of OTCS.213.    However, I was of the view that when the first set of\n\nagreements at DBD 54 to 55 and 116 to 117 were drafted, OTCS was named as a party because 1% of its\n\nshares in OHPL was to be given to Mr Teo and Alan Tan respectively as payment in kind.214.    From that starting point, the next set of agreements at\n\nDBD 114 to 115 and 51 to 53 for payment of $300,000 and $220,000 respectively also named OTCS as a\n\nparty thereto.215.    Likewise the agreement at DBD 7 for payment of $600,000\n\nnamed OTCS as a party thereof.216.    OTCS was not named as a party to the agreement at DBD 4 to\n\n5 because that was of a different nature which was purportedly to appoint Mr Ong as a spokesman for\n\nvarious shareholders to appoint Mr Teo for $600,000 but the shareholders did not agree to this.217.    As Mr Ong was not a director of OTCS, he had to get Peter\n\nOng to sign on the agreements mentioned in paras 214 and 215 above, after Mr Ong had signed as a\n\nwitness.218.    After Mr Wong and Mr Thiam came into the picture to assist\n\nin the matter of the success fee, the subsequent agreements drafted like the ones at DBD 10 to 11,\n\nDBD 6 and DBD 110 to 113 named Mr Ong and Mdm Tiah as parties to the agreement and not OTCS.219.    Mr Ong was named because he was the one that Mr Wong and\n\nMr Thiam were dealing with and Mdm Tiah was named because she had granted the option to Mr Ang/AKTS\n\nto buy her shares in HGR and the sole proceeds from that were to be used to pay the last instalment.220.    At the trial, OTCS took the position that even if Mr Ong\n\nhad agreed to the $600,000, or some other lower figure, his agreement did not bind OTCS as he was\n\nnot a director or even a shareholder of OTCS.221.    Both Mr Ong and Peter Ong disagreed that Mr Ong was in\n\nfact the de facto controller of OTCS.222.    However, there were considerable difficulties in the way\n\nof this position.223.    Firstly, the defence was a common defence. Mr Ong and\n\nPeter Ong had gone to see the same solicitors and paragraph 4.2 of the Defence states:4.2 The 1stDefendant had asked the Plaintiff to assistbothDefendants by acting as an intermediary to resolve the on-going dispute between the Defendants\n\n  (and others) and Ang and his related companies.[Emphasis added.]224.    When Mr Ong and Peter Ong subsequently decided to use\n\ndifferent solicitors, the Defence was not amended. Even when Mr Kang drew this plea to the attention\n\nof Peter Ong during cross-examination, no attempt was made to amend it.225.    Furthermore, even if an application had been made to amend\n\nthe defence or to file a separate defence for OTCS and it was allowed, the fact that Peter Ong had\n\nearlier accepted that Mr Ong had spoken to Mr Teo to assist both Mr Ong and OTCS must weigh heavily\n\nagainst OTCS.226.    In the circumstances, I was of the view that OTCS was\n\nbound by this plea and it was not open to OTCS to deny that it was bound by Mr Ongs agreement.227.    In any event, I also concluded that Mr Ong was the de\n\nfacto controller of OTCS and the patriarch of the family and its businesses.228.    Firstly, para 4.2 of the Defence had suggested this.229.    Secondly, I refer again to the police report Mr Ong made\n\non 22 July 1999. The contents have been set out in para 152 above.230.    Mr Ong had referred to himself as a shareholder of OHPL\n\nand to a discussion in May 1999 about the transfer of his shares at GEH. Yet he was not named as a\n\nshareholder in either one of these companies at the material time. To me, these statements revealed\n\nthe true state of affairs ie. he was the de facto controller of OTCS which in turn held shares in\n\nOHPL and GET.231.    Thirdly, at NE 139E/F, Mr Ong himself said:Q Suggest that the truth is that you persuaded Plaintiff that you would get\n\n  Peter Ong to sign p.26?A If I had said so, Peter Ong would have signed but he did not sign.232.    This was a telling piece of evidence and though Mr Ong\n\nchanged his evidence in response to the next question, it was too late.233.    The fourth factor I also noted was that Peter Ong admitted\n\nthat he knew of DBD 7 since 26 March 1999. He knew from that document that Mr Ong was acting for\n\nOTCS. He could say only that he had told his father indirectly to stop interfering in negotiations\n\nwith Mr Ang (NE 204E to 205F). Yet he never told Mr Teo that his father was not authorised to act\n\nfor OTCS (NE 207B to D).234.    Fifthly, I accepted Alan Tans evidence that Mr Ong had\n\ntransferred his shares to his family members to put his assets out of reach of his creditors and\n\nthat often after Mr Ong had agreed to something on behalf of OTCS, he would contact Peter Ong or his\n\nother son and tell them to follow up for OTCS.235.    In respect of Alan Tans evidence, Mr Gwees closing\n\nsubmission at para 8 states:The Plaintiffs assertion that 1st Defendant is equal to 2nd Defendant is\n\n  unconvincing, and lacks realism, as even Alan Tan PW4, his trusted aide conceded that, \"Yes,\n\n  we knew that OTC is not a shareholder of 2nd Defendant neither is he a director. He cannot\n\n  represent 2nd Defendant.236.    However, Mr Gwees citation of Alan Tans evidence\n\nhere was not complete. The complete evidence here was:Q If what you say is true i.e. that OTC said he would get his son to sign on\n\n  behalf of 2ndDefendant, it shows that both you and Plaintiff know that OTC cannot bind\n\n  the 2ndDefendant.A Yes. We know that OTC is not a shareholder of 2ndDefendant.\n\n  Neither is he a director. He cannot represent 2ndDefendantbut he is the de facto\n\n  controller of 2ndDefendant because of what I have earlier[said].[Emphasis added.]237.    As a matter of formality, Mr Ong could not sign documents\n\nfor OTCS but in substance, he controlled OTCS.238.    The sixth factor I noted was that Mr Wong also said\n\nseveral times that Mr Ong was synonymous with OTCS (NE 44F, 48E, 49A, 55B, 55E, 58C/D, 59A to C).239.    As for Mr Tian, all he said was that Mr Ong had ceased to\n\nbe a director of OTCS several years ago and that this was common knowledge (NE 177E to 178A). Mr\n\nGwee had cleverly avoided asking him as to who actually controlled OTCS.240.    There were also other factors pointing to the fact that Mr\n\nOng was controlling OTCS, for example, (a) as between OTCS and Mr Ong, OTCS was the main party\n\naffected by the Deed of Settlement and yet it was Mr Ong who had paid $100,000 for Mr Teos\n\nservices and (b) certain shares owned by OTCS were transferred to Mr Ongs girl friend or second\n\nwife, one Irene Chan, to discharge his debt to her which was guaranteed by his sons.241.    However, in the light of the six factors I have already\n\nmentioned above, it is not necessary for me to elaborate on other factors.242.    Accordingly, I found that OTCS was bound by Mr Ongs\n\nagreement.243.    I would also have found that Mr Ong was bound too but for\n\nthe fact that para 1 of the Statement of Claim states:By an oral agreement made in or around October 1998 between the Plaintiff\n\n  and the 1stDefendant,acting on behalf of the 2ndDefendant Company,\n\n  .[Emphasis added.]244.    Paragraph 1 did not assert that Mr Ong was acting on\n\nbehalf of himself and OTCS.245.    I also did not think that the dismissal of the claim\n\nagainst Mr Ong would leave Mr Teo empty handed as regards the balance of the success fee since Mr\n\nOngs assets were in OTCS after all, as alluded to in Mr Kangs closing submission at para 87.246.    However, I did not order costs as between Mr Teo and Mr\n\nOng as the latter was the one whose conduct led to the litigation.247.    As I have mentioned, OTCS has appealed against my\n\ndecision. Mr Teo and Mr Ong have not.",
        "Woo Bih Li": "Judicial CommissionerCopyright © Government of Singapore."
    }
}