{
    "case_title": "Pan Yee Ching v Wee Aik Joo",
    "ncitation": "[2001] SGHC 351",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "THE PARTIES AND THEIR CHILDREN": "5 The Wife is 50 years old, her date of birth being 25 August 1951. The Husband\n\nis 62 years old, having been born on 18 January 1939. They were married on 16 May 1975. The elder\n\nchild, a female, was born on 26 March 1976 and is now 25 years old. The younger child, a male, was\n\nborn on 17 October 1981 and is now 20 years old.",
        "THE MATRIMONIAL ASSET": "6 The property in issue is a flat with a floor area of approximately 182 square\n\nmetres (about 1960 square feet) located in the condominium known as Clementi Park in Sunset Way.",
        "THE WIFES AFFIDAVITS": "7 In her first affidavit filed on 15 August 1992, the Wife said she had been\n\nworking since 1973, stopping work between 1981 and 1984 to look after the two then very young\n\nchildren. She worked during the marriage to support the family when the Husband claimed he was\n\nunemployed. When the Husband left the matrimonial home in September 1987, he claimed he was unable\n\nto obtain proper employment to support the children because of his age and his lack of experience.8 The Wife engaged a private investigator who reported that the Husband was\n\nworking at a certain company.9 On 15 October 1990, the Husband was ordered to pay $600 per month as\n\nmaintenance for the Wife and the two children.10 The improper behaviour of the Husband in abusing the Wife in public and at her\n\nworkplace caused her to lose her jobs as a real estate agent and an insurance agent. She estimated\n\nher expenses and those for the two children to be $2,265 per month at that time. Since 1986, she had\n\nalso been paying $2,320 per year as maintenance charges and $929.20 per year as property tax in\n\nrespect of the matrimonial home.11 She had been working hard and had also got loans and handouts from her\n\nbrothers to make ends meet. She believed that the Husband would claim inability to increase the\n\nmaintenance of $600 per month even if ordered by the Court to do so.12 In 1976, the parties purchased a property at 5000A Laguna Park #06-03 in their\n\njoint names for $59,000. She paid a cash deposit of about $11,800 and contributed $18,880 from her\n\nCPF account. She also paid some $40,000 for the renovation, furnishings and fittings. The Husband\n\nonly contributed about $28,320 from his CPF account.13 In 1984, they sold that property for $300,000. After deducting the commission\n\npaid to the real estate agent, the reimbursements to their respective CPF accounts and the rental\n\nthey paid for a flat at $750 per month for 20 months ($15,000), the profit from the sale was\n\n$180,000.14 In 1984, the parties purchased the present matrimonial home in their joint\n\nnames for $493,000. The Wife contributed $56,840 from her CPF account and about $38,396 in cash\n\ntowards the purchase of this property. She also contributed another $77,000 or so for the legal and\n\nstamp fees, renovations, furnishings and fittings. The Husband contributed $217,764 from his CPF\n\naccount. The balance of the purchase price was paid from the profit from the sale of the Laguna Park\n\nproperty.15 Despite the Husbands misbehaviour and threats of divorce, she raised her\n\nchildren well and also served the Husband well.16 Besides the matrimonial home, she had no other property here or abroad. The\n\nchildren were doing well in their studies and she was worried about their future education. As the\n\nHusband was not providing sufficient maintenance for her and the two children, she asked the Court\n\nto order the Husbands half share in the matrimonial home to be transferred to her to assure the\n\nfamily of a roof over their heads and so that the matrimonial home could be used for their future\n\nneeds and the two childrens tertiary education. However, she requested that the transfer of the\n\nHusbands half share take place only after 18 January 1994 when the Husband would be 55 years old.\n\nPresumably, this was because his CPF contributions used for the matrimonial home would not then be\n\nrequired to be refunded to his CPF account. She asked that she and the two children be allowed to\n\ncontinue living in the matrimonial home until the transfer or, alternatively, until they completed\n\ntheir tertiary education.17 In her second affidavit filed on 21 June 2001, the Wife stated that the\n\nHusband gave her $1,300 per month (instead of the $600 per month ordered) for the last two years\n\nafter she pleaded with him. Besides that, he had completely neglected her and their two children. He\n\nwas gainfully employed in a Singapore company in Vietnam and appeared to be having a good life.18 The daughter obtained a diploma in business studies from Ngee Ann Polytechnic\n\nin 1996. She then went to study in Melbourne, Australia, obtaining a Bachelor of Commerce from\n\nDeakin University in 1998. She then returned to Singapore, worked for a couple of years with Pacific\n\nInternet but left the company disillusioned as the work she was asked to do was not in line with her\n\nstudies. She is now pursuing a course in Information Technology and Web Design application at\n\nInformatics to upgrade herself. She is also very keen to do a four-year course in MultiMedia Art at\n\nLa Salle SIA College of Art and would require about $74,400 for the course commencing in July 2001.19 The Husband did not provide any financial support for the daughters\n\neducation. The Wife took loans from her third brother to see the daughter through Ngee Ann\n\nPolytechnic and Deakin University. She promised to repay him when the matrimonial home was sold. Her\n\nthird brother lent her a total of about $15,000 for the Ngee Ann Polytechnic course between 1993 to\n\n1996. In 1993, he also lent her $4,000 for the daughter to purchase a personal computer. For the\n\ndaughters education and expenses in Australia, the Wife took a loan of $62,000 from her brother.20 In September 2000, her third brother bought a personal computer for the\n\ndaughter. The brother was now out of job and was in the process of setting up a consultancy firm.21 The Wife then stated that her brothers and sister-in-law were aware of her\n\nhardship and had never asked for repayment of the loan amounts. However, the Wife had always hoped\n\nthat she would be able to repay the loans from the sale proceeds of the matrimonial home.22 The son completed his A Levels at Anglo-Chinese Junior College,\n\nobtaining 3 As, 1 B and 1 C. He is now in National Service. He would be pursuing a course in\n\nSociology at the National University of Singapore in the academic year 2002. His tuition fee, hostel\n\naccommodation and other expenses would cost about $19,200 per year or $57,600 for the three-year\n\ncourse.23 The Wife said she did not remarry as she wanted to devote her full attention\n\nand energy to her two children. The son was asthmatic. As the $600 per month maintenance was\n\ninsufficient, she had to work to make ends meet. She also had to do all the housework herself as she\n\ncould not afford a maid.24 She is now 50 years old and unemployed. It would be difficult for her to find\n\nanother job because of her age. She then elaborated on the loans she had taken from her second\n\nbrother and his eldest sister-in-law. Her second brother had lent her $36,000 for the son between\n\n1992 and 1997 at $500 per month whereas the sister-in-law had lent her another $36,000 for the\n\ndaughters tuition fee between 1987 and 1992 also at $500 per month. This was confirmed by the\n\nsecond brothers wife, who filed an affidavit on her husbands behalf as he was abroad, and by\n\nthe said sister-in-law.25 She had been paying the outgoings of the matrimonial home, including repairs,\n\nsince February 1986 amounting to $61,110. The home was in a poor condition and would probably fetch\n\nabout $800,000 if sold. As the Husband is now 62 years old, he is no longer required to refund the\n\nCPF monies to his CPF account. She therefore prayed that the Husband transfer all his right, title\n\nand interest in the matrimonial home to her.26 The third brother affirmed an affidavit to confirm that he had lent the Wife\n\nthe sums of money mentioned by her. In addition, he said that he paid for the levy and salary for\n\nthe maid between 1988 and 1994. This maid looked after his unwell mother and his sisters two\n\nchildren.27 In her third and final affidavit filed on 4 September 2001, the Wife refuted\n\nthe Husbands claims that his sister had paid the maintenance on his behalf. She claimed that he\n\nhad deliberately used his sisters cheques to make the payments. In the early 1990s, the Husband\n\ntold the Wife that he had set aside some money in the safekeeping of his sister for the maintenance\n\npayments as he was going to work in Malaysia.28 She had received telephone calls from the Husbands relatives expressing\n\ntheir envy at the large inheritance left to him by his late father. The telephone calls were\n\nnumerous and were such an annoyance that she had to change her telephone number. The Husband had not\n\ndisclosed what this inheritance was.29 She then stated:\"During my hard times I begged the Respondent to give me more maintenance\n\n  for the children. He agreed to pay me S$1,100 per month on condition that I do not reveal this to\n\n  my solicitors. It is not true that the Respondent has been badly treated by my children and me. He\n\n  did give me monies for Chinese New Year but only for the past few years, which were meant for the\n\n  childrens Ang Pow.\"30 She added that the Husband had harassed her and ruined every career that she\n\nhad from 1986 to 1991. She worked for her father at his eating house until it closed down in\n\nFebruary 1991. Thereafter she did temporary jobs until October 1996, earning about $2,000 per month.\n\nShe was unemployed since 1 February 2001.31 She explained that her mother had been taking care of the children and helping\n\nin the household chores since the childrens birth. Unfortunately, she was in poor health from\n\n1988 to 1994 and they decided to engage the services of a maid which were paid for by her third\n\nbrother.32 She disputed the Husbands allegations that he had been locked out of the\n\nmatrimonial home. She claimed that he wanted to sell the matrimonial home and squander all the\n\nmoney. She refused to allow him to do so despite pressure by the Husbands sister and his niece.\n\nThen in September 1987, he walked out on her.33 She also disputed the Husbands claim that he paid the entire purchase price\n\nfor the Laguna Park flat, reiterating what she had stated in her first affidavit filed on 15 August\n\n1992. For the matrimonial home, she had savings in the Bank of China and in Hong Leong Finance in\n\nthe 1970s and used those savings to pay for the legal and stamp fees amounting to $22,185.00. She\n\nalso spent about $55,000 on the renovation, furniture and fittings for the flat and another\n\n$38,396.00 by way of progress payments to the developers. She had only two receipts dated 28 March\n\n1990 for $14,596.05 (said to be \"payment of balance of redemption moneys\") and dated 24\n\nApril 1990 for $216.50 (being payment of solicitors bill in respect of the redemption of the\n\nmatrimonial home).",
        "THE HUSBANDS AFFIDAVITS": "34 In his first affidavit of 15 August 1992, the Husband said he was employed as\n\na Quality Control Manager by Transtech Electronics Pte Ltd until January 1989 when the company\n\ntransferred its operations to Malaysia and he was retrenched. He had been unemployed since then.35 As he was unable to find work in Singapore, he worked in Johor Baru as a\n\ntechnician earning about S$1,000 per month, out of which he paid $600 per month as maintenance. He\n\nhad no contribution to his CPF account as he was not employed here. His CPF ordinary account as at\n\n27 June 1992 stood at a mere 8 cents.36 For the matrimonial home, he said he had used $272,848.35 (inclusive of\n\ninterest) of his CPF funds as at 27 June 1990. He had also made contributions in cash to make up the\n\ndifference between the purchase price and the mortgage amount. The matrimonial home was occupied by\n\nthe Wife, their two children and the Wifes mother since he left home on 29 September 1987.37 He had no other property here or elsewhere and did not own a motor vehicle.38 He also claimed in that 1992 affidavit that the Wife was working in her familys\n\nbusiness and was also a freelance property agent.39 He asked then that the matrimonial home be sold at the best possible price and\n\nthe sale proceeds be divided equally between the parties subject to the refund of CPF money together\n\nwith interest.40 He also claimed that the Wife had prevented the children from going out with\n\nhim since 1987. He had to speak to them every Sunday through the back entrance as he was not allowed\n\nto enter the matrimonial home. He asked for reasonable access to them.41 In his latest affidavit filed nine years later on 21 August 2001, he explained\n\nthat the original maintenance order in the earlier divorce petition was made after a contested\n\nhearing. Between the time of that order in 1990 and April 1999, his average monthly income was\n\n$1,000. As that was insufficient for his expenses, he frequently sought financial help from his\n\nsiblings. His sister paid the monthly maintenance to the Wife on his behalf. She also gave him loans\n\nwhenever he requested them. He owed his two sisters and his brothers a sum of more than $100,000\n\nover the years.42 In May 1999, he managed to obtain a decent paying job in Vietnam earning\n\n$3,000 per month. The job was on a month to month basis and could be terminated at any time as he\n\nwas almost 63 years old already. As soon as he found that new job, he started paying the Wife $1,100\n\nper month and increased it to $1,300 per month in May 2000. In addition, he gave the Wife $2,000\n\nevery year for Chinese New Year despite the fact that he had always been badly treated.43 The Wife was an educated and capable woman, being a holder of a Polytechnic\n\nDiploma in electronics. She was in good health. She had failed to disclose details of her income,\n\nproperty and bank accounts.44 Immediately after they had purchased the matrimonial home in 1984, the Wife\n\ninvited her mother to live with them under the pretext that she could look after the two children\n\nwhile she (the Wife) was at work. She also engaged the services of a foreign maid.45 The Wifes attitude towards him changed in early 1987. She began to pick\n\nquarrels with him and frequently locked him out of the flat until he was finally forced to leave in\n\nSeptember 1987. Since that time, she had exclusive use of the flat.46 He claimed to have paid the entire purchase price of the earlier matrimonial\n\nhome in Laguna Park. Part of the proceeds of sale of that property was utilised as downpayment for\n\nthe present matrimonial home. A total of $176,000 was withdrawn from the parties respective CPF\n\naccounts to pay for the matrimonial home. In addition, a loan of $100,000 was taken from Credit POSB\n\nLtd.47 He disputed the Wifes evidence that she had made cash payments for the\n\npresent matrimonial home. He also claimed that the Wife was lying about her alleged debts to her\n\nfamily members. He claimed he paid $100,000 in cash from his own money to cover the shortfall in the\n\npurchase price and the legal and stamp fees.48 He hoped to repay his siblings the more than $100,000 owed to them when the\n\nmatrimonial home was sold. He was likely to lose his job in a few months and would need money for\n\nhis future years. He had no other savings or assets and had nothing in his CPF ordinary account.49 Based on the CPF amounts utilised, his interest in the matrimonial home should\n\nbe 80%. The Wife had wilfully excluded him from the flat and had rent-free occupation for 14 years\n\nwhen the monthly rent would have been $4,500. He now prayed that the matrimonial home be sold in the\n\nopen market and the net proceeds of sale, after refunding to the respective CPF accounts together\n\nwith interest, be divided 80-20 as between him and the Wife.50 One of the Husbands sisters said in her affidavit that she had been helping\n\nhim financially since 1990. He had assured her that he would repay the loans when his flat (the\n\nmatrimonial home) was sold. She was personally owed approximately $80,000, inclusive of the\n\nmaintenance payments she had made on his behalf.",
        "THE DECISION OF THE COURT": "51 InLim Choon Lai v Chew Kim Heng[2001] 3 SLR 225at page 231, the\n\nCourt of Appeal said:\"14 In our respectful view, the approach adopted by Judith Prakash J inYow\n\n  Mee Lan v Chen Kai Buan[2000] 4 SLR 466is correct. In determining a just and equitable\n\n  division of matrimonial assets under s 112(1) of the Womens Charter, the court must, as\n\n  directed by s 112(2), have regard to all the relevant circumstances of the case at hand, and in\n\n  particular the matters enumerated in that subsection, in so far as they are applicable, and on\n\n  that basis determine what a just and equitable, division should be. The matters enumerated\n\n  there comprise both financial and non-financial contributions made by the parties. Where financial\n\n  contributions are concerned, the court must, of course, take into account the sums contributed by\n\n  each party; these are the matters specifically mentioned in paras (a) and (b) of s 112(2).\n\n  However, this does not mean that the court should engage in a meticulous investigation and take an\n\n  account of every minute sum each party has paid or incurred in the acquisition of the matrimonial\n\n  assets and/or discharge of any obligation for the benefit of any member of the family, and then\n\n  make exact calculations of each partys contributions. The court must necessarily take a broader\n\n  view than that. As for the non-financial contributions, they also play an important role, and\n\n  depending on the circumstances of the case, they can be just as important. At the end of the day,\n\n  taking into account both the financial and non-financial contributions, the court would adopt a\n\n  broad-brush approach to the issue and make a determination on the basis of what the court\n\n  considers as a just and equitable division.15 It is true that a division of matrimonial assets under s 112(1) of the Womens\n\n  Charter is not an exact science, and that each judge would have his own view in a particular case\n\n  as to what is a just and equitable division. It all depends on the facts of the case before him.\n\n  That is what is directed by that section. Bearing in mind what the section directs, the judge in\n\n  any particular case is doing the best he can in making a division of the assets between the\n\n  husband and wife. Such an exercise, in principle, is analogous to that of assessment of damages or\n\n  losses, which a judge does frequently. Having regard to what the court is statutorily directed to\n\n  do, we do not think, with respect, that it is correct to say that it is closer to reality to\n\n  use as the starting point the assumption that both husband and wife have contributed jointly and\n\n  equally throughout the marriage to the acquisition and growth of the equity in the family home,\n\n  whether the marriage be a long or a short one. The proper approach should be to have regard to all\n\n  the circumstances of the case and in particular those set out in s 112(2) and make a division on\n\n  the basis of what the court considers is a just and equitable division between the\n\n  parties.\"52 Section 112(1) and (2) of the Womens Charter provide:\"112.(1) The court shall have power, when granting or subsequent\n\n  to the grant of a decree of divorce, judicial separation or nullity of marriage, to order the\n\n  division between the parties of any matrimonial asset or the sale of any such asset and the\n\n  division between the parties of the proceeds of the sale of any such asset in such proportions as\n\n  the court thinks just and equitable.(2) It shall be the duty of the court in deciding whether to exercise its\n\n  powers under subsection (1) and, if so, in what manner, to have regard to all the circumstances of\n\n  the case, including the following matters:(a) the extent of the contributions made by each party in money, property or\n\n    work towards acquiring, improving or maintaining the matrimonial assets;(b) any debt owing or obligation incurred or undertaken by either party for\n\n    their joint benefit or for the benefit of any child of the marriage;(c) the needs of the children (if any) of the marriage;(d) the extent of the contributions made by each party to the welfare of the\n\n    family, including looking after the home or caring for the family or any aged or infirm relative\n\n    or dependant of either party;(e) any agreement between the parties with respect to the ownership and\n\n    division of the matrimonial assets made in contemplation of divorce;(f) any period of rent-free occupation or other benefit enjoyed by one party\n\n    in the matrimonial home to the exclusion of the other party;(g) the giving of assistance or support by one party to the other party\n\n    (whether or not of a material kind), including the giving of assistance or support which aids\n\n    the other party in the carrying on of his or her occupation or business; and(h) the matters referred to in section 114 (1) so far as they are\n\n    relevant.\"53 I was not impressed by the evidence of either party. As emphasized earlier,\n\nboth were totally nonchalant about the ancillary matters once the Decree Nisi was granted. If the\n\nRegistry of the Supreme Court had not goaded them into action, it was quite likely nothing would\n\nhave been done even to date. This showed that both parties were obviously quite comfortable in their\n\nrespective lives, financially and in all other aspects, contrary to the pictures they attempted to\n\npresent before the Court. If they were in financial straits, they would have taken advantage of the\n\nheady property prices between 1993 to 1995 and disposed of the condominium unit at Clementi Park for\n\nno less than $500,000 to $600,000 in profit and used the windfall for more modest and affordable\n\naccommodation, with probably some spare cash left for their living expenses. Quite clearly, the Wife\n\ncould afford to maintain her pre-divorce lifestyle without difficulty. It was equally obvious that\n\nthe Husband did not need any funds, including the large amount of CPF money locked up in the\n\nmatrimonial home which he was entitled to withdraw when he attained 55 years of age in 1994 if the\n\nproperty had been sold.54 To that extent, I did not accept both parties evidence as to their\n\nimpecuniosity and their alleged loans from their respective siblings. If they were intending to use\n\nthe sale proceeds of the matrimonial home to pay off their purported debts, they would have been\n\nvery anxious in pursuing the ancillary matters through their respective solicitors. Instead, they\n\nhad to be reminded no less than three times by the Registry before they ended the nine-year hiatus.55 Where the Laguna Park flat was concerned, apart from the CPF contributions,\n\nthere was no satisfactory evidence of cash payments alleged to have been made by the Wife. Having\n\nstarted work only in 1973 (at the age of 22), it would be rather surprising that she managed to save\n\nso much by 1976 when they bought that flat. It was much more likely that the Husband, with the\n\nadvantage of having worked about a decade earlier than the Wife, would have much more resources than\n\nthe Wife at that time. In all likelihood, he contributed much more financially to the Laguna Park\n\nflat.56 The Wife has been living in the present matrimonial home with her two children\n\nand her mother for the past 14 years since the departure of the Husband in 1987. It was only right\n\nthat she had to pay the maintenance charges and property tax for wanting to live in the rather large\n\nand fairly luxurious condominium unit. I repeat here that she was not compelled to do so because of\n\nthe refusal of the Husband to sell the flat. She stayed on by choice.57 Again, apart from the CPF contributions, she had no satisfactory evidence that\n\nshe made the alleged substantial financial contributions to the matrimonial home. It must be borne\n\nin mind that she was not working between 1981 and 1984 and the Clementi Park flat was bought in\n\n1984. She has not explained how she managed to save up those amounts of money, especially when she\n\nclaimed that she devoted much time and energy on her two young children (the daughter from 1976 and\n\nthe son from 1981). Again, here the Husbands evidence as to his contributions was much more\n\ncredible and it was much more likely that he had made greater financial contributions than the Wife.58 It followed from all this that the Husband was far from truthful about his\n\nemployment and his income. He was faring much better than he would have the Court believe. He chose\n\nto work abroad and therefore had no further contributions made to his CPF account but, as indicated\n\nearlier, he obviously did not have to rely on his CPF money anyway. There was no reliable evidence\n\nas to any alleged inheritance.59 Similarly, the Wifes evidence as to her financial status and other matters\n\nafter the Husbands departure in 1987 was wanting in truthfulness. Her mother lived with the\n\nfamily in the present matrimonial home. Quite clearly, she helped to take care of the two children\n\nand the household duties. In addition, the Wife also had a maid at least between 1988 and 1994. I do\n\nnot mean by this that the Wife had therefore abdicated her role as mother. After all, I did say inLee\n\nChung Meng Joseph v Krygsman[2001] 1 SLR 579at page 589 (paragraph 41):\"Having a maid in the household, or a number of maids for that matter,\n\n  does not mean abdication of parental responsibility towards the child.\"All this only showed that not every burden was on the Wifes shoulders. She\n\nclaimed to have done temporary jobs between February 1991 and October 1996 and to be unemployed\n\nsince 1 February 2001. What was she doing between October 1996 and 1 February 2001? Further, the\n\nfact that the Husband increased the maintenance amount for the last two years without legal\n\ncompulsion and gave ang pows during Chinese New Year also showed that he did not \"totally\n\nneglect\" the family as alleged.60 The daughter is an adult capable of earning her own keep. No good reason\n\nbeyond that of upgrading herself has been given as to why she should be undertaking one course after\n\nanother. One is at liberty to choose to be a perpetual student if one is able to afford it. It would\n\nhowever be unreasonable to choose such a lifestyle at the expense of a 62 year old father.61 The son is in National Service and has an allowance provided by the State. He\n\nwould in all likelihood be pursuing tertiary education next year and would therefore need to be\n\nmaintained beyond attainment of the age of 21 years in October 2002 (see Section 127 read with\n\nSection 69(4) and (5) of the Womens Charter).62 Bearing in mind all of the above, the fact that the marriage lasted 17 years\n\nuntil the Decree Nisi in 1992 (although it was effectively over by September 1987), the parties\n\nages and their needs and those of the two children, I thought it just and equitable to make the\n\nfollowing orders:(1) the matrimonial home be sold and the proceeds, after deduction of all fees\n\n  and costs, be distributed 50-50, with each party to refund its own share of the CPF contributions\n\n  (only the Wife needs to do so);(2) the solicitors to appoint a valuer and the matrimonial home be sold by\n\n  public auction or private treaty within six months from the date of the valuation report at not\n\n  less than the valuation unless both parties agree otherwise;(3) the Wife is to take charge of the sale;(4) $50,000 is to be set aside for the sons tertiary education expenses,\n\n  such amount to be taken out from the Husbands share of the sale proceeds and be kept in a joint\n\n  account in the names of the Husband, the Wife and the son, with all three to be joint signatories;(5) the Husband to pay maintenance of $600 per month for the Wife and $200 per\n\n  month for the son with effect from 1 November 2001;(6) there be no maintenance order in respect of the daughter;(7) each party is to bear its own costs; and(8) there be liberty to apply.63 An order for equal distribution of the matrimonial asset would also seem to\n\naccord with the parties own views as to their shares expressed in their 1992 affidavits. In\n\nparagraph 42 of the Wifes affidavit of 15 August 1992, she said:\"42. Since the Respondent is not paying enough maintenance for me and the\n\n  two children, I humbly pray for hishalf sharein the said matrimonial home be transferred\n\n  to my name.\"Similarly, the Husband stated in paragraph 15 of his affidavit of 15 August 1992:\"15. I humbly pray that the matrimonial property be sold at the best\n\n  possible price and the proceedsbe divided equallybetween the Petitioner and myself\n\n  subject to the refund to my CPF account all monies withdrawn together with interest.\"64 I saw no need to order a lump sum maintenance payment. The present arrangement\n\nappeared to have served the parties well and the Husband has been paying the monthly maintenance\n\nfaithfully. The total amount of maintenance has been reduced from the $1,300 per month that he has\n\nbeen giving voluntarily to $800 per month because the daughter should have completed the course at\n\nInformatics by now.Sgd:TAY YONG KWANGJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}