{
    "case_title": "Chai Yong Construction Co Pte Ltd v Chan Hock Seng and Another",
    "ncitation": "[2001] SGHC 360",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "2. By an agreement evidenced in a letter of award dated 31 July 1998 (the\n\nagreement) from the defendants' architect, the plaintiffs agreed to continue the construction of the\n\nproperty and the renovations of the second property, at a lump sum price of $729,000 (the contract\n\nsum). I use the wordcontinuebecause the plaintiffs were taking over from another contractor\n\nRock Create Pte Ltd (Rock Create) who had been awarded the original construction contract by the\n\ndefendants in May 1997 but, whose performance was unsatisfactory as which result their services were\n\nterminated on 3 August 1998. The defendants' architect was Soh Chip Leong (Soh) who practises under\n\nhis own name, while John Portwood (Portwood) of Portwood & Associates was their structural\n\nengineer. The plaintiffs' managing director, who negotiated with the defendants through Soh,\n\naccepted the agreement and oversaw the plaintiffs works, is Ho Bock Kee (Ho) who is referred to\n\nas Michael Ho in the relevant correspondence produced in court.3. The agreement (see 1AB482-486) inter alia provided:a. for a contract period of eleven (11) months;b. that the Singapore Institute of Architects Conditions (SIA Conditions) of\n\nContract (for lump sum contracts) would govern the contract.The SIA Conditions of Contract inter alia, stipulated that progress claims\n\nrendered by contractors which were accepted/approved for payment by the architect must be paid\n\nwithin 14 days of certification by the architect. The SIA Conditions also define what is meant by\n\ncompletion of works. The plaintiffs also had a set of the original tender documents as, prior to the\n\naward of the construction contract to Rock Create in May 1997, the plaintiffs had in fact tendered\n\nfor the project but were unsuccessful as their price was higher than Rock Create's ($620,000).4. Pursuant to the terms applicable to the agreement, the plaintiffs furnished to\n\nthe defendants a performance bond (the performance bond) dated 31 August 1998 from Cosmic Insurance\n\nCorporation Ltd (Cosmic) in the sum of $72,900, being 10% of the contract value; the performance\n\nbond was payable on demand. The plaintiffs were given possession of the site on 7 August 1998 and\n\nSoh advised them that the completion date under the agreement would be 6 July 1999.5.    There was some urgency for the plaintiffs to take over the site because of\n\nthe very precarious site conditions; the excavations were in danger of collapse, causing concern to\n\nSoh, Portwood and the temporary works engineer. Rock Create had in fact stopped work, after they\n\nhad done demolition, piling, temporary and earth works. When the plaintiffs took possession of the\n\nsite, they did not carry out any excavations and, the only temporary works they did was to\n\nstrengthen (by blinding the base of the excavations) and rectify Rock Creates temporary works, in\n\norder to make the site safe and to save the excavation, according to Portwoods testimony (V/N\n\n33). He (PW7) described the plaintiffs as a breathe of fresh air, after Rock Create (V/N 43).6. I should mention that for the greater part of the contract period, the first\n\ndefendant was absent  he was serving an 18 months' jail term for the offence of molest. He gave\n\nthe second defendant a power of attorney authorising her to act on his behalf. while he was in\n\nprison. During the first defendants incarceration (July 1997 to 7 January 1999), progress\n\npayments to the plaintiffs were made by the second defendant, who also attended site meetings. In\n\nthe absence of the first defendant, Soh and Portwood took instructions from the second defendant;\n\nwhether she consulted the first defendant in turn was not adduced in evidence.7. The plaintiffs did not carry out any piling works but reinforced those already\n\ndone by Rock Create, whose contract was terminated at the piling stage. The plaintiffs commenced\n\nconstruction under the agreement (from 7 August 1998 onwards) and completed them on 2 June 1999. An\n\ninspection (the inspection) was carried out on 5 July 1999 by an inspector from the Building Control\n\nAuthority (BCA) at the request of Soh, with a view to obtaining Temporary Occupation Licence (TOP)\n\nwhich would have allowed the defendants to move into the property. The inspection was not\n\nsuccessful, BCA refused to issue a TOP for reasons set out in their letter on the same day to Soh.\n\nTwo (2) days later, on 7 July 1999 (1AB653) Soh issued a Delay Certificate certifying that the\n\nplaintiffs were in default for not completing the works by 6 July 1999.8. Prior to the inspection, the plaintiffs had rendered progress claim no. 9 for\n\n$94,050.97 for work completed as at 6 June 1999. Pursuant thereto, Soh issued a certificate of\n\npayment no. Ala/09 (the certificate) dated 30 June 1999 (1AB885) but only for the sum of $50,453.55.\n\nWhen he testified (N/E 111C), Soh said he deemed it not prudent for him to certify payment for the\n\nfull sum claimed as, the defendants (or more correctly the first defendant) had by then raised a\n\nlist of defects concerning the plaintiffs' work; consequently, Soh held back $43,597.42. Even so,\n\nthe defendants did not pay on the certificate either by the deadline of 16 July 1999 (the\n\ncertificate having been delivered to the defendants on 2 July 1999) or at all.9. The plaintiffs (by Ho) not unexpectedly, took issue with the Delay Certificate\n\nissued by Soh. They wrote to him on 9 July 1999 (1AB660-661) referring to the inspection and the\n\noutstanding items which caused BCA to refuse to issue the TOP; the plaintiffs asserted that there\n\nwere reasons for the delay in the issuance of the TOP which had nothing to do with them. In any\n\ncase, only four (4) of the seven (7) items listed by the BCA related to the plaintiffs' outstanding\n\nworks - the plaintiffs did not carry out the remaining works as those were outside their area of\n\nresponsibility, relating to submissions to the authorities. Hence, the plaintiffs submitted, they\n\nwere entitled to an extension of time from Soh, pursuant to cl 23 of the SIA Conditions, until such\n\ntime as the delay factors no longer operated. Accordingly, the plaintiffs requested that the Delay\n\nCertificate be withdrawn.10. When he testified (N/E 112 and 117), Soh confirmed that the plaintiffs\n\nposition was correct. Soh added that, in the light of the plaintiffs' letter dated 9 July and their\n\nearlier letter dated 8 July 1999 (1AB656) wherein they had requested issuance of an Architect's\n\nInstruction for handrail installation with the appropriate extension of time to do the work, he\n\nwould have recommended to the defendants that the plaintiffs be granted an extension of time. In\n\nfact, Soh had on 9 July 1999, issued an Architect's Instruction for installation of the handrails.11. However, before Soh could recommend or grant an extension of time to the\n\nplaintiffs, the first defendant ejected the plaintiffs from the site on Sunday 11 July 1999.\n\nAccording to the plaintiffs, when their Thai worker Phayad Phraiwan (Phayad) returned to the\n\nproperty in the afternoon of 11 July 1999, he found all the locks securing the property had been\n\nchanged and he could not enter; the plaintiffs alleged the first defendant was responsible for\n\nchanging the locks. Further, the first defendant chased Phayad out of the property. Phayad was by\n\nthen living in the basement of the property as a caretaker/guard. Phayad did not testify at this\n\ntrial although he had filed an affidavit on the plaintiffs' behalf, on 29 October 1999. The reason\n\nwas because he left Singapore on 18 December 2000 when the plaintiffs could not extend his work\n\npermit (N/E 19). Despite inquiries made by Ho of Thai construction workers in Singapore, Phayad's\n\nwhereabouts (reportedly in Australia or Taiwan) could not be traced. Ho lodged a police report\n\n(1AB679) on the incident of 11 July 1999. He alleged there were two (2) other occasions prior to 11\n\nJuly 1999, when the first defendant gained forced entry into the property, once was on 9 July and\n\nthe other on 10 July 1999. On both those occasions, the first defendant cut the padlock the\n\nplaintiffs used to secure the side gate. Indeed, according to Ho (N/E 14), the first defendant\n\nscaled the fence on the property and used an electric grinder to cut the fence. Ho refuted counsel's\n\ncontention that the first defendant was denied access, pointing out that before 5 July 1999, he had\n\nconsented to and allowed the first defendant entry into the property to install air-conditioners and\n\nfixtures, without Soh's knowledge; so why would he deny the first defendant access a few days later?12. The plaintiffs recorded the incidents of 10 and 11 July 1999 in their letters\n\n(3) to Soh (1AB680, 682 and 686), unlike the first defendant whose version was purely oral. The\n\nfirst defendant initially denied he had cut the padlock but finally admitted doing so under\n\ncross-examination (N/E 703). However, the first defendant gave a vastly different version of what\n\nhappened on the three (3) dates. In regard to the incident on 10 July, his version (V/N 690) was,\n\nthat he had observed a party at the property being held by the plaintiffs Thai workers and he\n\njoined in the merrymaking. On 11 July, the first defendant alleged that he found a Thai worker (whom\n\nhe claimed was not an employee of the plaintiffs) with a woman in the master bedroom at 7am that\n\nmorning; he advised them on the strict laws pertaining to molest and rape in Singapore (V/N 692),\n\nchased them out of the property and then left. He only locked the side-gate but left the main gate\n\nunlocked; the plaintiffs therefore still had access. The first defendant claimed he returned in the\n\nevening, found the gate locked and left without entering the property. He claimed he returned to the\n\nproperty at 7am the following day and found the gate again locked. Neither he, nor the plaintiffs'\n\nplumbing subcontractor (who was there to install certain sanitary fittings) could gain entry, so\n\nboth of them left the property. However, the first defendant changed his version when he resumed\n\ntestifying on Monday 6 August 2001 (see V/N 869-15).13. The plaintiffs refuted the first defendant's first version of the incident on\n\n12 July 1999. Ho contended that if indeed Phayad had not been locked out of the property on 11 July\n\nevening, there was no reason for Phayad to spend the night at the plaintiffs' construction site at\n\nAng Mo Kio without any of his personal belongings. Ho's version of events was corroborated by Soh as\n\nwell as by Soh's assistant Doreen Poh (Doreen). Doreen (PW4) testified (N/E 252) she had visited the\n\nproperty on the evening of 12 July (after Soh had himself verified Ho's complaint that both gates\n\nwere indeed locked). She entered the property with a set of keys left for her by the first\n\ndefendant, in order that Phayad (whom she accompanied) could retrieve his personal belongings.14. A day before he purportedly repudiated the agreement, the first defendant had\n\nfaxed/handed to Soh a comprehensive list of defects (see 1AB670-675) pertaining to both properties.\n\nEarlier, at a site meeting on 10 June 1999, the first defendant had submitted another list of\n\ndefects which he claimed (para 32 of his affidavit evidence) Ho tore up when he attempted to hand it\n\nto Ho; this was denied by Ho (N/E 82) who said he merely told the first defendant to hand the list\n\nto Soh, which evidence Soh corroborated (N/E 200).15. Although the plaintiffs treated the first defendant's conduct in ejecting\n\nPhayad from the site on 11 July 1999 as a repudiation of the agreement which the plaintiffs\n\naccepted, Ho was nonetheless willing to accede to Soh's (telephone) request made on 12 July, that\n\nthe plaintiffs complete the two (2) outstanding items of work namely, installation of the handrails\n\nand the missing toilet doors, in order to resolve the dispute amicably. Ho indicated he also wanted\n\nthe issue of the Delay Certificate resolved. To that intent and purpose, Ho, Soh, the first\n\ndefendant and counsel for the plaintiffs held 'without prejudice' negotiations which culminated in a\n\nmeeting on 5 August 1999, at which several proposals were raised and one mutually acceptable\n\nproposal finally emerged. The plaintiffs' solicitors wrote to the defendants as well as to Soh on 6\n\nAugust 1999 (at 1AB715A-C) setting out the terms of what the plaintiffs said had been agreed a day\n\nearlier between the parties.16. The defendants did not respond to the plaintiffs' solicitors' aforesaid\n\nletter although the first defendant had indicated at the 5 August meeting that he would revert on\n\nthe proposal within a few days. On 13 August 1999 (1AB717), Soh wrote to the plaintiffs' solicitors\n\nto inquire if the plaintiffs would be willing to install the handrails and toilet doors so that TOP\n\ncould be obtained; the plaintiffs were forwarded a copy of Soh's letter the same evening. On 19\n\nAugust 1999 (1AB724) the plaintiffs' solicitors replied to Soh indicating the plaintiffs'\n\nwillingness to do the work requested. Unbeknownst to Soh and the plaintiffs, the first defendant\n\nhad, on 13 August 1999, issued a Notice of Termination (the Notice) to the plaintiffs, copied to\n\nSoh. The Notice (1AB718) however was not faxed/forwarded to the plaintiffs. Instead, it was sent to\n\nCosmic under cover of the first defendant's letter dated 18 August 1999 (1AB722-723) calling for\n\npayment on the performance bond. On 13 August 1999, the defendants wrote separately to Soh\n\n(1AB719-721) requesting his action on 23 letters they had previously written to Soh and to their\n\nlist of defects submitted on 10 June 1999.17. In his testimony, (N/E118-119) Soh said that although he received the Notice,\n\nhe was unaware of the defendants' call on the performance bond until he was informed by Ho on 19\n\nAugust 1999; Ho in turn, had been informed by Cosmic that afternoon. On the next day, Soh told Ho\n\nthat he (Soh), would speak to the first defendant with a view to resolving the matter amicably. Ho\n\ninformed Soh that the plaintiffs' solicitors were preparing court papers for an injunction to stop\n\nthe defendants from calling on the performance bond; he would however instruct the plaintiffs'\n\nsolicitors to hold the application in abeyance until 23 August 1999, for Soh to revert after\n\nspeaking to the defendants. On 23 August 1999, Soh told Ho that he was discussing the matter with\n\nthe defendants and was confident that a settlement could be achieved. On the same day (1AB728) Soh\n\nwrote to the BCA to say that five (5) of the items highlighted in BCA's letter dated 5 July 1999\n\nwould be complied with.18. Soh's optimism however proved to be premature as, on 21 August 1999 (1AB725),\n\nthe defendants wrote to the BCA, copied to Soh and Portwood, to withdraw their application for TOP.\n\nPuzzled by this turn of events, Soh told Ho he would speak to the defendants.19. Before he could hear further from Soh, Ho received a telephone call from\n\nCosmic on 31 August 1999, informing him the first defendant was at the premises of Cosmic, demanding\n\npayment of the sum under the performance bond, in an abusive and threatening manner. The visit was\n\ndenied by the first defendant in court but not in his written testimony; he claimed he did not know\n\nthe whereabouts of Cosmic's office and merely telephoned the company. On the following day, the\n\nplaintiffs filed D C Suit No. 4415 of 1999 (the suit) and applied for an interim injunction to\n\nrestrain the defendants from calling on the performance bond; they succeeded. By their letter dated\n\n6 September 1999, the defendants suspended the services of Soh with immediate effect. Soh notified\n\nthe plaintiffs by his letter dated 10 September 1999 that he was no longer the qualified person\n\nfor the project. On 8 October 1999, the defendants applied to set aside the plaintiffs' interim\n\ninjunction but failed. They appealed against the dismissal of their application but withdrew the\n\nappeal subsequently. In January 2000, the defendants appointed Peter Von Selkey of Seifert Asia to\n\ntake over from Soh as the architect. On 23 March 2000, the TOP was issued for both properties\n\nfollowed by the Certificate of Statutory Completion (CSC) on 10 November 2000 (1AB844).",
        "The pleadings": "20. In the statement of claim, the plaintiffs (after referring to the relevant\n\nclauses in the SIA Conditions of Contact) claimed the balance contract sum of $111,264.23 which\n\nincluded a sum of $10,450.50 for variations but excluded the sum ($50,453.55) due under the\n\ncertificate, which was separately claimed.21. The defendants not only denied liability in their (amended defence) which was\n\nprolix (20 pages) to the extreme but, went further to lodge a counterclaim, alleging that:(i)      the plaintiffs works were defective\n\n  (listing out 48 items) which disentitled them to payment;(ii)     the plaintiffs claims were inflated or\n\n  fictitious and, their works were delayed and incomplete;(iii)    their consultants had advised them that rectification\n\n  works would cost about $550,000;(iv)    the plaintiffs had damaged a neighbouring property at\n\n  No. 9 Belimbing Avenue whose owner Low Wai Seng sued the defendants in DC Suit No. 5114 of 1999;\n\n  they sought an indemnity from the plaintiffs if they were found to be liable to Mr Low;(v)     the plaintiffs wrongfully obstructed their call on the performance\n\n  bond(vi)    the plaintiffs failed to apply for their own utilities and tapped water\n\n  and electricity supplies from the second property, which resulted in the occurrence of extremely\n\n  low water pressure and frequent trippings in the electrical connection respectively, at the second\n\n  property. This forced the defendants to move out from the second property and to their flat,\n\n  causing them to lose rent of $4,500 per month for the flat.22.    As the defendants counterclaim exceeded the jurisdiction of the district\n\ncourts, the suit was transferred to the High Court (in Originating Summons no. 1475 of 2000) on the\n\ndefendants' application, by an order of court which I granted on 4 October 2000 and, converted to\n\nthis Suit. Because of the innumerable complaints of defects by the defendants, the plaintiffs were\n\nforced to call a number of people involved in their construction of the properties to testify,\n\nincluding their roof tiles supplier, their electrical subcontractor, their aluminium/window frames\n\nsubcontractor and their handrails/staircase subcontractor. Their witnesses totalled 11, including\n\nHo. Although he played a pivotal role in the plaintiffs construction works, Soh was reluctant to\n\nattend court as their witness and had to be subpoenaed. Similarly, Portwood and Doreen were\n\nsubpoenaed to testify, together with the defendants new architect Peter Von Selkey (Selkey), who\n\ntook over from Soh. Besides themselves, the defendants had two (2) other witnesses namely, their\n\nbuilding surveyor Paul Crispin Casimir (Casimir) and their professional engineer Raymond Hatfield\n\n(Hatfield). In the course of the trial, the plaintiffs produced 18 exhibits while the defendants\n\nproduced 14, including a window frame (D6) the first defendant claimed to have dismantled\n\nfrom the property, which he alleged the plaintiffs installed and, which contained scratches from the\n\noutset.",
        "The evidence": "23.    It would be well nigh impossible to address each and every item of the\n\nlitany of complaints raised by the defendants, in a concise judgment. What I propose to do therefore\n\nis, to deal with the major items alleged by the defendants to be defects in the plaintiffs\n\nworkmanship and relying on my findings on those items, determine whether the other complaints are\n\nlikely to be valid/justified.",
        "(i) basement not watertight resulting in water ingress.": "24.    In relation to this complaint, Soh, Doreen, Portwood,\n\nSelkey and Chin Cheong (the plaintiffs surveyor) all testified that they had seen the basement\n\nflooded to various depths at different points in time. Portwood (V/N 54) said the water was 8\"\n\ndeep when he inspected the property in early August 1999 while Selkey (PW8) testified he saw water\n\napproximately 15mm below the wall sockets (which were 1.5m above the floor) in January 2000 and, a\n\nrubber dinghy in the basement. The first defendant did not deny there was a rubber dinghy and\n\nexplained (V/N 894) he needed it to get to the pumps (6) which he used to pump out the water.\n\nNeither did he deny he wanted to turn the basement into a swimming pool (V/N 898-899). Chin Cheong\n\n(PW11) noted there was a pool of water in the basement in March 2001, which did not give off a foul\n\nsmell (V/N 453). Doreen said (N/E 253) the first defendant had told her he wanted the wall sockets\n\nmoved 1.5m above the floor so that he can flood the basement.25. Soh testified (N/E 124-125) that in September 1999, he noticed about 1 foot\n\n(30cm) of water in the basement. He further observed that the attic gutter was filled with water,\n\nwhich was then channelled through a hose leading to a filter box in the bathroom of bedroom 1; from\n\nthere it went to the second storeys reinforced concrete (RC) roof and into the basement. Soh\n\nnoted that the RC flat roof was flooded to about 40cm, up to the level of the parapet wall and putty\n\nhad been used to seal up the windows, to prevent water, which was up to that level, from getting\n\ninto the bedrooms. Photographs corroborating what Soh saw on the RC flat roof and in the basement\n\nwere exhibited in the affidavit of Chin Cheong (see exhibit CC2 at pp 55 [B10], 62, 66, 67\n\n[B33], 79 [C23], 80[C25] and 92 [D29]) as well as at 1AB956. When Soh inquired of the first\n\ndefendant why he had flooded the basement, the latter said he wanted to convert it to an indoor\n\nswimming pool (N/E 125). Some corroboration of Sohs testimony can be found in the first defendants\n\nown letter dated 5 April 2000 to Portwood (1AB827) where he stated:.We had not filled up the basement to more than eight inches of water at any\n\n  one period of time. Please be reminded that you had been told from the very beginning when\n\n  designing the basement thatthere is the intention to convert the basement into a swimming pool\n\n  in future.You had also been told that there is a possibility that the whole basement could\n\n  one day be flooded and that we would be away for a long period of time.(emphasis added)26. Soh opined that (N/E 125) aside from rain, the water he saw in the basement\n\ncould not possibly have come through the basement wall. Further, up to his termination, he did not\n\nnotice any water seepage through the basement wall. If there was water seepage from the outside soil\n\ninto the basement, the walls of the basement would have been damp. Even then, it would not be up to\n\n30cm. Photographs taken by Ho of the basement on 6 July 1999 (at 1AB1002-1004 and 1010), the day\n\nafter the unsuccessful TOP inspection, showed no signs of water seepage. Portwood said he inquired\n\nof the first defendant why there was water present; the first defendant professed ignorance.27. If indeed there was ground/soil water seeping into the basement from outside\n\nthe walls due to the plaintiffs failure to apply the specified/adequate waterproofing compound\n\nand thereby to provide an integral waterproofing system, one would not have expected to see such\n\nconsistent watermarks on all the walls of the basement as shown in the photographs taken by Chin\n\nCheong and Casimir (DW4). Instead, there should have been patches and uneven staining on some of the\n\nwalls (since the plaintiffs had coated two (2) of the basement walls with Shelkote waterproofing\n\nmembrane), as well as a stench/foul odour emanating from the water itself.28. The evidence from the various witnesses who saw the water in the basement\n\nleads me to conclude that the first defendant had deliberately flooded the basement to turn it into\n\nan indoor swimming pool. My finding is reinforced by the evidence from Soh and the photographs\n\nreferred to earlier taken by Chin Cheong; the photographs showed that the first defendant had\n\ndeliberately flooded his roof and roof gutters to create an aquarium effect; in effect he was\n\nstoring rainwater in an outsize tank on the roof and channelling it into the basement for his DIY\n\nswimming pool.29. The first defendant did not deny he had flooded the roof and gutters but\n\nclaimed he was conducting ponding tests. This explanation was questioned by Soh who said (N/E 132)\n\nthat ponding tests did not need water to be first filtered and, only 10cm not 45cm of water would be\n\nneeded for ponding tests (N/E196). Ho (N/E 47) also said waterproofing tests would not require theentireroof to be flooded not to mention that, flooding the gutters would cause water ingress into the\n\nbedrooms and marble flooring and, may also affect the structural integrity of the gutters. I\n\ndisbelieve and accordingly reject, the first defendants preposterous explanation.(ii) no anti-termite treatment and no 10 year warranty for the same30. In his testimony, Ho readily admitted that he had made a mistake in including\n\nthis item priced at $920 in the plaintiffs tender when the treatment was not carried out, with\n\nSohs agreement. Soh on his part explained that anti-termite treatment could not be carried out at\n\nthe site because it was in a high water table area and it was poisonous. However, treatment could\n\nhave been carried out at the apron area which Soh thought he had told the plaintiffs to do, but\n\nwhich they apparently did not. All that is needed to redress this complaint is an omission of the\n\nappropriate amount for this item from the plaintiffs claim.",
        "(iii) failure to install precast decorative window frames": "31. Ho said he did not do this work because Soh had not provided for it in the\n\ncontract drawings. When he checked with the Soh, Soh confirmed the work need not be done. As the\n\nplaintiffs are contractually obliged to follow the instructions of the defendants architect,\n\nthere is no basis for the defendants to complain against the plaintiffs. Their remedy if any, is\n\nagainst Soh.",
        "(iv) window frames not watertight": "32. Neither Ho nor Soh had any opportunity to verify the veracity of this\n\ncomplaint. It was first raised in the defendants list of defects which Soh forwarded to the\n\nplaintiffs on 29 June 1999. Ho said that before the plaintiffs could look into the complaint, they\n\nwere ejected from the property by the first defendant. The first defendant on the other hand, said\n\nthat the sealant seen on the windows in the photographs he had taken (1AB956) and seen by Soh,\n\nshowed that the plaintiffs had made attempts to rectify the leaks. I note that unlike their usual\n\npractice, there was no correspondence from the plaintiffs to Soh on this complaint. Coupled with the\n\nobviously amateurish attempts (using putty) to prevent leakage which Soh witnessed when he visited\n\nthe property in September 1999 and, in the light of the evidence that the first defendant flooded\n\nthe roof areas up to 30cm, I am of the view that the leaks if any, were of the first defendant's own\n\nmaking.",
        "(v) mismatching of roof tiles": "33. The defendants' complaint essentially was, that the plaintiffs had used two\n\n(2) different types of roof tiles, oneIwatomiand the otherShintobrand, albeit both\n\nwere 'J' type tiles. The defendants had chosenIwatomiblue tiles. In his written testimony\n\n(para 65), Ho had said that due to wastage by the plaintiffs' workers caused by the irregular\n\n(triangle) shape of the roof, the number ofIwatomitiles he had ordered from Andy Roofing\n\nTiles Supplies Pte Ltd (Andy Roofing) were insufficient. However in his oral evidence-in-chief (N/E\n\n3), Ho corrected his para 65 and testified that the problem was actually the inability of Andy\n\nRoofing to supply the quantity ofIwatomitiles he needed and had ordered. After being\n\nassured by Andy Seow (Seow) the company's managing-director, thatIwatomiandShintoblue tiles were identical in design and colour, Ho orderedShintotiles from Andy Roofing to\n\nmake up for the shortfall inIwatomitiles. He pointed out that if the two brands were not\n\nidentical in design, they would not interlock which they did, relying on a photograph (1AB952) of\n\nthe roof. He noted that the defendants' photograph numbered 15(d) (1AB956) showed the (brown)\n\nunderside of the tile.34. Seow (PW3) confirmed Ho's testimony; he said he then had only 1,500 pieces ofIwatomitiles whereas Ho wanted 1,900 pieces. So he recommendedShintotiles for which\n\nhe charged the plaintiffs 0.30 more per piece for 400 pieces. Seow explained (N/E 236) that as\n\ntiles are natural clay products, it is not possible to get the exact same colour when they are fired\n\n(not even for the same brand) particularly for coloured tiles, due to chemical reactions under high\n\ntemperatures. He also confirmed that J type tiles of the same size will interlock, regardless of the\n\nbrand (N/E 241).35. To verify that a sampleIwatomitile (P3)interlocks with a\n\nsampleShinto(P15) tile, I requested the defendants' surveyor Casimir when he\n\ntestified, to interlock the two (2) tiles (V/N 1184). He did and confirmed (V/N 1188-1189) that the\n\ntiles were quite stable and interlocked (with theIwatomibeing placed on top of theShintotile) save that one edge had a movement of 2mm. Casimir said the design of the tiles was not to have\n\nperfect interlocking in any case as otherwise, there would be rainwater ingress by reason of\n\ncapillary action. When I inquired of him whether anybody would have any reason to go on top of the\n\nroof and press the tiles in the middle or at their edges (save perhaps for the first defendant),\n\nCasimir acknowledged that it was unlikely. However he added, the tiles should be nailed to secure\n\nthem in place.36. Then, there was Soh's testimony; he said (N/E 121) he was aware that two (2)\n\nbrands of tiles were used but from below, one could not tell the difference as the colour was the\n\nsame and they interlocked well. Chin Cheong (when cross-examined) disagreed (V/N 575) with the first\n\ndefendant's suggestion that the tiles on the roof looked ugly from a distance. Chin Cheong opined\n\nthat from a distance, one would be unable to tell virtually although there may be some differences\n\nin tonality. Further, because of shading from surrounding trees, one would get an optical illusion\n\nof different colours; I note that the roof tiles are highly reflective. In the light of the evidence\n\nfrom both parties' witnesses, this complaint has not been proven at all.",
        "(vi) failing to install bi-fold/double panels back door": "37. Like item (iii) in para 31, this item was omitted by the plaintiffs on the\n\ninstructions of Soh, when Ho (N/E 122) brought to Soh's notice that there was a discrepancy in the\n\ndrawings. Consequently, the defendants have no basis to complain against the plaintiffs.",
        "(vii) roof tiles not covering the gutter or overhang the edge of the roof": "38. Ho testified that the triangle shape of the roof was a construction problem\n\nas the three (3) sides were unequal not to mention that the ridge was not perpendicular to any side.\n\nThe plaintiffs did their best to comply with both the structural and architectural drawings. Soh\n\ntestified (N/E 159) that because of the peculiar shape of the roof, the gutter was wider than usual.\n\nIf the roof tiles had covered more of the gutter, the latter would have been too narrow to walk on.\n\nHence, when the first defendant complained that the gutter was very wide, Soh explained to him which\n\nreason the first defendant accepted. The first defendant then requested for the gutter to be painted\n\nblue to match the roof tiles; the request was included as item 34(ii)(a) in the first defendant's\n\nlist of defects dated 10 June 1999 (1AB605) handed to Soh and in turn to the plaintiffs. Soh\n\ndisagreed with the suggestion of counsel for the defendants that colouring the gutter blue was only\n\na temporary measure, to minimise the ugliness. Counsel for the plaintiffs submitted that the\n\ndefendants were nit-picking as the gutter is barely noticeable from the ground level. I fully agree\n\nwith the plaintiffs' submission (para 66).",
        "(viii) roof leakage": "39. Soh testified (N/E 120) that sometime between 13-20 September 1999, he\n\ninspected the roof with the first defendant because of the latters complaint of leakage. He\n\nwaited for a rainy day and inspected just after the rain had stopped - he found no leakage. Soh had\n\nalso written to the BCA on 20 September 1999 (1AB765) to say that he did not detect any leakage.\n\nWhen the first defendant testified (V/N 924), he gave a convoluted and totally unconvincing\n\nexplanation why Soh found no leakage - he claimed it was because the leak had dried up within  to\n\n1 hour after the rain! Soh had gone onto the roof more than two (2) hours after the rain had\n\nstopped. I note that Chin Cheong did testify he saw four (4) spots of roof leakage in March 2001.",
        "(ix) insufficient roof insulation": "40. Sohs testimony that he saw no big gaps in the roof insulation nor was the\n\nfact highlighted to him by the first defendant, is significant in relation to the defendants\n\nsecond complaint of inadequate roof insulation. Nothing turns on this alleged defect now in the\n\nlight of the first defendants admission (V/N 930) that he tore parts of the roof insulation,\n\nsupposedly to inspect the plaintiffs works. His own expert Casimir (V/N 1294) agreed with counsel\n\nfor the plaintiffs that the roof insulation had been tampered with, prior to his February 2000\n\ninspection.",
        "(x) installing Parsec instead of reflectrix double blister foil insulation": "41. The defendants had specified reflectrix double blister foil as roof\n\ninsulation. Unfortunately, neither Ho nor Soh nor even Seow had heard of it; the plaintiffs\n\ninstalled 'Parsec' instead. Both Soh and Seow were familiar with Parsec (D1) which they\n\ndescribed as superior/good quality, widely used in the construction industry. Chin Cheong testified\n\nit was widely used for pitch roofs in Singapore and was by far the most expensive insulation in the\n\nmarket. Seow revealed (N/E 251) that he was approached by the first defendant for a quotation which\n\nhe gave, dated 8 September 1999 (1AB752), for the price of Japanese 'Toyo' S type tiles as well as\n\nfor double bubble pack with double-sided aluminium foil @ $6.20 per sq.m for 46 sq.m ($285). In the\n\nlight of the evidence especially Seow's (whom I consider to be a completely independent witness) and\n\nwithout any evidence from the defendants that Parsec is inferior and or less expensive than\n\nreflectrix double blister foil (which sample was not produced in court as, sample 'A' was from\n\nSeow's quotation which did not mention reflectrix), this complaint is frivolous to say the least.",
        "(xii": ")the basement handrail was slanted/off-centred43. The defendants had produced photographs (2) which showed (see 1AB984) that\n\nthe handrail for the basement stairs was off-centred. Soh testified (N/E 127) it was not due to the\n\nplaintiffs' poor workmanship but because of a building requirement that there must be 4cm finger\n\nspace between the railings and the wall. Consequently, although he acknowledged that aesthetically\n\nit would be better for the railings to be centred, Soh said it could not be done. I accept Soh's\n\nexplanation which effectively answers this complaint.",
        "(xiii": ")failing to supply/install mirror polish stainless steel railings44. Here again the defendants produced two (2) photographs (dated 2 September\n\n1999); they showed the handrails were rusty with unsightly and badly welded joints. Had the\n\nplaintiffs been given an opportunity, Ho said (para 95 of his affidavit) he would have attended to\n\nthe problem after the TOP but before actual occupation; it would not have taken long (a few hours\n\nonly) to rectify. That opportunity was never given to the plaintiffs because of the first\n\ndefendant's conduct in the July incidents (paras 11 and 12supra).Ho added that the\n\ncondition of the handrails as at 6 July 1999 was not as bad as that shown in the defendants'\n\naforesaid photographs. In this connection, the plaintiffs called their railings subcontractor Lee\n\nHeng Engineering Works Pte Ltd (Lee Heng) to testify. Tan Hui Seng (Tan), the managing-director of\n\nLee Heng said that he had obtained his raw material from Nisshin Steel Company Ltd who gave him an\n\nanalysis certificate (P13) to prove the material would not rust. He then fabricated the\n\nrailings and installed them at the site. Tan was referred to the defendants' aforementioned\n\nphotographs; he said the railings were installed (5-6 months before the photographs were taken) and\n\nhe was surprised at the condition shown in the photographs. He did not know (V/N 386) how it came to\n\nbe so, it was all very nice when his company fabricated  otherwise the plaintiffs would not have\n\npaid him. In his 21 February 2000 report, Casimir had said that the railings appeared to suffer from\n\ncorrosion. When he was referred to Casimir's report, Soh opined (N/E 138) that stainless steel\n\nrailings should not corrode under normal conditions, unless they were exposed to certain chemicals.\n\nHe then added that corrosion of the fixing nails for the ceiling (another complaint of the\n\ndefendants) could be due to the dampness in the basement; nails are made of alloy and should be\n\ncorrosion-free.45. I cannot imagine that any self-respecting contractor let alone Ho, would have\n\naccepted the railings from a subcontractor and paid for them had their condition been what is\n\nreflected in the defendants' photographs; acceptance would have been even less likely, if the\n\nrailings suffered from corrosion at the time of delivery/installation. I therefore accept the\n\nplaintiffs' submission (para 146) that the rust/corrosion resulted from the application of\n\nchemicals; I would venture a guess that the likely cause is acid. The defendants' photographs were\n\ntaken some two (2) months after the plaintiffs had left the site; the plaintiffs' photograph of the\n\nrailings taken on 6 July 1999 (1AB1005) showed no rust or corrosion. This complaint is without\n\nmerit.",
        "(xiv) failure to use heavy duty grating for the car porch": "46. The defendants complained that the plaintiffs did not use heavy duty grating;\n\nthe plaintiffs' stand was that the contract did not call for heavy duty grating, which Soh\n\nconfirmed. The plaintiffs' contention appeared to be accepted by the first defendant as, when he\n\ncross-examined Chin Cheong (V/N 581), he stated that although heavy duty grating was not stated, it\n\nwould be 'common sense' to provide heavy duty; otherwise the grating would be damaged if a Mercedes\n\nBenz went over it. The first defendant then referred to a photograph (C19) in Chin Cheong's\n\naffidavit (exhibit CC-2 p 78) which showed a perfectly good grating which he asserted was bent. The\n\nexchange between the court and the first defendant on the photograph is reflected in V/N 581 while\n\nthe first defendant's cross-examination is set out in V/N 978.47. When he testified (N/E 126), Soh said the gratings were normal gratings and\n\nwere acceptable. However, he had requested Ho to change one piece of the car porch grating as it may\n\nbend under the weight of a car. The grating was supplied by the railings subcontractor Lee Heng and,\n\nTan from the company opined that (V/N 388) based on his experience, the grating would be able to\n\ntake the weight of ordinary cars but it would definitely sag if a lorry is driven over it. I\n\nconclude that this is yet another frivolous complaint on the part of the defendants/first defendant.",
        "(xv) leaks from copper piping": "48. This was a strange defect; the defendants alleged that the copper piping\n\nembedded in the wall of one of the bathrooms leaked. They produced a photograph dated 2 September\n\n1999 (1AB981) which showed a greenish stain on the wall of the bathroom. Ho had testified there was\n\nno such leak as at 11 July 1999 (N/E 76). Soh thought (N/E 143-144) that the stain was similar to\n\nthat on the opposite side of the wall on the RC flat roof; Soh suspected that it could have been\n\ncaused by the first defendants flooding of the RC roof. When Soh was being cross-examined on 26\n\nApril 2001, counsel for the defendants produced two (2) photographs (marked 'D') which he\n\nsaid Casimir had taken two (2) days earlier, showing water spraying out from the leak; Soh's comment\n\nwas that a hole had to be drilled through the wall for such a phenomenon to happen, pointing out\n\nthat the photograph taken at 1AB981 did not show a spray. Counsel for the plaintiffs pointed out it\n\ndid not exist even when the plaintiffs' surveyor Chin Cheong took photographs in March this year;\n\notherwise he would have taken photographs. As I was not satisfied with the unconvincing explanation\n\nof counsel for the defendants why Casimirs photographs could not have been taken and disclosed\n\nmuch earlier, I directed counsel for both parties, Soh, Ho and the first defendant to visit the\n\nproperty and see the leak for themselves; this was done the very same afternoon.49. When hearing resumed the following morning with Soh in the witness stand, he\n\nsaid he had observed a hole between tiles and when the hot water pipe from the solar heater was\n\nturned on, water gushed out from the hole (about 2 foot [60cm] from the floor), the stain was 30cm\n\nfrom the floor and, there was a crack in the tile below the leak. Soh also noticed a fine crack in\n\nthe ceiling where the control valves to these pipes were located. Re-examined, Soh agreed (N/E 229)\n\nthat if indeed the water heater had not yet been commissioned and the valve was turned off, there\n\nshould not even be water in the pipes let alone a leak/spray. He hazarded a guess that the leakage\n\ncould be due to a hollow behind the wall, that the hole could have been made or could also have been\n\ncaused by water pressure coming from the back of the tile. Cross-examined, the first defendant\n\nrevealed (V/N 988) he had chiselled about 15 inches away from the hole Chin Cheong had pointed out\n\nand, he (with Casimir) found two (2) copper pipes. He then did avolte faceand denied there\n\nwas any hole! Chin Cheong (V/N 411-412) was of the view that someone had drilled a hole in the\n\ngrouting in the wall tiles and in the process accidentally drilled into the pipe, thereby causing\n\nthe rupture and the spray. That seems to be the only logical explanation. For reasons which will be\n\nset out later, I believe it was the first defendant who did the drilling, just as I believe he\n\napplied corrosive substances to the railings, amongst other questionable acts.",
        "(xvi) failing to use main roof rafters of the specified dimensions and correct fasteners": "50. There appeared to be a miscommunication between Soh and Portwood in relation\n\nto this complaint. It was Hos testimony that he noted a discrepancy between the architectural and\n\nstructural drawings which he drew to Sohs attention. According to Soh (N/E 130), he instructed Ho\n\nto follow the structural drawings whereas Portwood testified that he understood from Ho, that the\n\nplaintiffs were asked by Soh to follow the architectural drawings. Portwood's inquiry of Soh in\n\nAugust 1999 on the matter drew no response. Even so, it was Portwoods testimony that the as-built\n\nrafters were/are structurally sound and acceptable. This complaint is therefore frivolous, bearing\n\nin mind that the rafters cannot be seen as they are concealed inside the roof.",
        "(xvii) the as-built drawings differed from the actual roof structure": "51. This is a follow-up on the above complaint. Portwood acted properly by\n\nre-submitting as-built plans to the BCA to reflect the actual roof constructed once he\n\ndiscovered the discrepancy; the plans having been accepted, there is no cause for the defendants to\n\ncomplain.",
        "(xviii) failure to install mirror polished stainless steel railings to all low windows": "52. Soh confirmed (N/E 115) that he did instruct Ho not to install the railings,\n\nas the defendants intended to extend the living room area at a later stage and it would be pointless\n\nto incur the cost of this item. This was denied by the first defendant (V/N 980) even though his\n\ncounsel's earlier cross-examination of Soh (N/E 203) was premised on, the suggestion for the living\n\nroom extension having been initiated by the plaintiffs. I prefer the testimony of Ho and Soh in this\n\nregard.",
        "(xix) failing to install two (2) toilet doors": "53. According to Soh and Ho, the missing toilet doors prompted the inspector to\n\nrefuse to issue TOP on 5 July 1999. Soh testified that the defendants only selected the toilet doors\n\nin question on 29 June 1999 (N/E 114); the plaintiffs told him their supplier did not have the stock\n\nand proposed an alternative. Counsel for the plaintiffs submitted his clients were not obliged to\n\nobtain the doors from other suppliers, as was suggested by counsel for the defendants, for reasons\n\nof cost, this being a lump sum contract. As an aside, it was Doreen's testimony (N/E 253) that when\n\nshe spoke to the inspector, she was told TOP was not issued because the first defendant had told the\n\ninspector no doors needed to be installed, because the toilets were meant to be used by ladies.\n\nGranted this is hearsay evidence but, Soh did say (N/E 112) he overheard the inspector's comment'But\n\nthe neighbours can see'on 5 July 1999, although he did not hear the first defendant's remark\n\nwhich drew that response. Whether the first defendant's statement was said in jest or otherwise, it\n\nwould appear that he was directly responsible for the BCA's refusal to issue TOP. That being the\n\ncase, I am of the view that the plaintiffs should have been entitled to an extension of time after 6\n\nJuly 1999, to install the two (2) toilet doors and the railings, for which they were awaiting the\n\nissuance of Soh's Instruction.",
        "(xx) installing inferior windows with poor paint work": "54. In order to rebut this allegation, the plaintiffs called their window\n\nsubcontractor Tan Kiat Kwang (TKK) of AP Trading to confirm Soh's evidence (N/E 123) that, the\n\nquality of the window frames was satisfactory and installation was acceptable. TKK (PW6) was shown\n\nthe defendants' window frame and said it was not the sample he had produced for the plaintiffs (N/E\n\n259). He explained he had fabricated the window frames using aluminium supplied by other parties;\n\npowder-coating was subcontracted out. Thereafter, the window frames were delivered to site and\n\ninstalled together with the glass panels. While he did not have test results to confirm the quality\n\nof the aluminium supplied to him, TKK said what was supplied to him was what was commonly used in\n\nSingapore for windows.55. TKK was referred to p 113 of Casimir's affidavit which exhibited a photograph\n\n(605/2) taken on 10 February 2000 which showed powder-coating peeling off from a window frame. He\n\nacknowledged that sometimes there could be some scratches on the window frames (which if very fine\n\ncan be removed by polishing). He would also check for dents and unpainted surfaces when the window\n\nframes were returned to him after powder-coating but, he had never seen that sort of peeling before;\n\nit looked like someone had used a sharp object to scratch it (N/E 265); it could not be due to\n\nnormal wear and tear. TKK dismissed counsel's suggestion that powder-coating could have been done\n\nimproperly; powder coating was only one process and did not involve applying a number of coats. As\n\nfor the rust marks also shown on photograph 605/2, TKK testified he had provided stainless steel\n\nhinges; hence they should not rust unless some acid or chemical was used to wash the hinges.56. When Chin Cheong was cross-examined by the first defendant, he too said (V/N\n\n567) he noticed that the powder-coating had been scratched or scraped although the cause was\n\nunclear. Chin Cheong opined that the damage could have been caused by others; the damage occurred at\n\nonly two (2) specific locations. The rest of the paint work around the window frame was sound; other\n\nwindows did not suffer the same defect.57. There only remains for me to refer to the first defendant's cross-examination\n\nof Ho (upon recall). The first defendant changed tack, suggesting to Ho that the paint work had been\n\ndamagedbeforethe window frames were delivered to site! When the court inquired whether he\n\ncould prove this new allegation, the preposterous response from the first defendant was, it was\n\n'normal'.58. It is noteworthy that Soh and the plaintiffs' window subcontractor\n\nindependently raised the possibility of acid or chemicals having been applied, the former to\n\nhandrails and, the latter to the steel hinges of window frames. In any case, I find it hard to\n\nbelieve let alone accept, that only two (2) of the newly installed windows can deteriorate (apart\n\nfrom dents/scratches) to the extent shown in Casimir's photograph, over a span of only seven (7)\n\nmonths (6 July 1999 to 10 February 2000). I therefore rule out wear and tear and can only conclude\n\nthat the window frames had been deliberately damaged.(xxi) other miscellaneous complaints59. Under this heading, I propose to deal with other allegations raised by the\n\ndefendants starting with:",
        "a) ponding on the floors": "According to the plaintiffs (Ho), they did not have an opportunity to verify let\n\nalone rectify, this complaint, because of the first defendant's conduct on 11 July 1999. Chin\n\nCheong's inspection in March 2001 confirmed some ponding on terrace at first storey and external\n\nareas at second and third storeys. The plaintiffs did not deny this allegation.",
        "b) installation of defective timber doors and door frames": "Soh testified that the main door was unacceptable because the panels were not\n\nproperly lined while other doors had mouldy stains. The remedy is either to adjust the panels of the\n\nmain door and stain the doors darker in colour or, replace all the doors.",
        "c)": "failing to plaster and paint the interior of the letter and meter boxesI agree with the plaintiffs' submission that these are minor defects which\n\nwould have been touched-up/rectified had they been give an opportunity by the defendants to do so,\n\ninstead of being ejected from the site.",
        "d) using second hand wooden boards for the meter box": "Since not one iota of evidence was produced by the defendants to substantiate\n\nthis allegation, I dismiss it as baseless.",
        "e) failing to plaster the walls and ceiling evenly": "In his written testimony (para 80), Ho asserted he had rectified this defect\n\nprior to the plaintiffs' ejection from site. As his evidence was not challenged in\n\ncross-examination, this allegation has been refuted.",
        "f) failing to provide a 10 year warranty for the solar heater system": "In the course of giving evidence, Ho indicated the plaintiffs were willing to\n\nobtain the warranty from his supplier.",
        "g) failing to install wall light points and switches according to plans": "(i) In his written testimony (para 92), Ho had testified that in the course of\n\nconstruction, the first defendant made various changes vis a vis electrical fittings/switches, in\n\nconsultation with Soh, giving instructions direct to the plaintiffs' electrical subcontractor Toh\n\nKim San (Toh); this was confirmed by both Soh and Toh (V/N 338). Consequently, Ho was unable to\n\nverify the defendants' complaint save for one aspect, which he did not deny. When Toh testified, he\n\nsaid he had misread the symbol in a drawing (1AB417) to mean single socket outlet when what the\n\ndefendants wanted was twin sockets. When Ho pointed out his mistake, Toh said he spoke to the first\n\ndefendant pointing out that as he (Toh) had already installed many socket outlets they should be\n\nenough, he was willing to make a deduction for the missing twin sockets but, he wanted the\n\ndefendants to pay for the extra work he had done. He testified that the first defendant replied\n\n\"I did not ask you. Who asked you to do the extras?\"When Toh said the extra work\n\nwas done on Sohs instructions, the first defendant suggested Toh make his claim on Soh. Although\n\nhe refused to pay for the extra work Toh had done, the first defendant insisted that Toh make good\n\nthe missing twin outlets. Unhappy with the first defendants attitude, Toh refused to do the work.\n\nHowever, the first defendant kept pestering him so Toh eventually agreed to change the single to\n\ntwin sockets by, hacking out the wall where single sockets had been installed and replacing them\n\nwith double sockets. This was done in the presence of the first defendant who said nothing.(ii) Toh confirmed all the parapet lights requested by the first defendant had\n\nbeen installed. He denied the first defendants allegation that the lights had been installed at\n\nthe wrong height; no height was specified in the drawings or told to Toh. The height at which the\n\nlights were fixed was selected by Toh, for safety reasons.(iii) Like a number of his other complaints, this allegation reflects the\n\ncharacter of the first defendant. He was not willing to pay for additional work done, he insisted on\n\nwhat was due to him under the contract and yet, when the work was done as per his request, he\n\ncomplained.",
        "h) failing to provide 5 coats of paint and 10 years warranty on paint work": "Like the plastering works, the defendants produced no evidence to contradict Hos\n\ntestimony that five (5) coats of paint were applied. In his (first) affidavit filed on 16 April\n\n2001, the first defendant complained that he wanted samples of the paint used by the plaintiffs to\n\nbe sent for laboratory analysis but, was refused. Ho however testified that, all the remaining paint\n\nhad been left at the site so the defendants should have the samples; he pointed to a photograph\n\n(1AB1012) which showed tins of paint left at the property. In the midst of cross-examining Chin\n\nCheong, the first defendant made the startling comment (V/N 630) that the tins had been removed by\n\nDoreen on 12 July 1999, although no such evidence was adduced nor was this suggestion put to Doreen\n\nwhen she testified. One can only conclude that this is yet another of the first defendant's\n\nunfounded complaints.",
        "i) staining of floors and walls": "This complaint was never raisedbeforethe defence was filed and was not\n\nlisted by the defendants earlier as a defect; they had relied on three (3) photographs (1AB975) to\n\nsupport their allegation. I do not propose to comment other than to refer to Soh's (and Ho's)\n\ntestimony, that they were not aware of any stains before 10 September and 11 July 1999,\n\nrespectively. In the light of Soh's evidence (N/E 127) that there were slight stains coming through\n\nthe wall where the first defendant had flooded the gutter and, bearing in mind Soh's warning to the\n\nfirst defendant in September 1999 that such flooding would damage the granite floor finishes, I am\n\nof the view that any staining was caused by the first defendant's own conduct, save for one piece of\n\ngranite which Soh had requested the plaintiffs to replace due to tonality differences, not staining.\n\nIn regard to granite, it was also the evidence of Ho and Soh that HMK protective coating would only\n\nhave been applied after TOP had been obtained, prior to actual occupation.",
        "j) failing to provide adequate rainwater downpipes to gutters": "This complaint is again unfounded in the light of Soh's testimony that the\n\nplaintiffs had constructedconcealednot exposed downpipes (3) and took the initiative to\n\ninstall a rainwater spout without extra charge, even though Soh had not provided for it in his\n\ndrawings.",
        "k) failing to install proper Singapore Cable Vision (SCV) connection": "Toh, the plaintiffs' electrician, disagreed he had not done the cable television\n\ninstallation (V/N 366-367). After he had completed his work, Toh said he, the architect and the\n\nfirst defendant (who denied it) checked his work against the drawings, going through the electrical\n\npoints; the first defendant requested amendments/rectification to some of the points. Hence, the\n\nplaintiffs could not understand the defendants' complaint. The first defendant revealed in\n\ncross-examination (V/N 1012) that he had actually tapped the SCV connection for the property from\n\nthe second property, drawing a rebuke from the court. Apart from his bare allegation, there was no\n\nevidence to support this omission. Consequently, it is to be disregarded.",
        "l) failing to properly secure copper pipes.": "Based on Soh's testimony the plaintiffs were prepared to abide by the court's\n\ndecision on the lack of fasteners/clips to secure the pipes to the walls.",
        "m) failing to anchor water pipes in the attic": "The plaintiffs were prepared to abide by the court's decision and Chin Cheong's\n\naffidavit (p 24 item gg) where he had observed that the water pipes in the attic were not properly\n\nanchored.",
        "n) failing to install the auto-gate control switch at the living room and to ensure that the gate\n\nworked": "Soh had testified (N/E 129) this was done; Toh positioned the switch besides the\n\nkitchen door, which Soh accepted. The plaintiffs submitted that the first defendant was confused \n\nbetween an auto-gate power point and the switch. Since the switch was installed by Toh and accepted\n\nby Soh, this complaint is without merit. As for the second complaint, Ho had testified that up to 11\n\nJuly 1999, the auto-gate was working properly; I have no reason to doubt his word, especially when\n\nno evidence to prove otherwise was adduced by the defendants.",
        "o) failing to provide hot-dip galvanised protection for the main gate": "The plaintiffs indicated they were prepared to abide by the court's decision, in\n\nthe light of Soh's evidence (N/E 130) that what was required was, for the main gate to be dismantled\n\nand sent for hot-dip galvanising by a factory.",
        "p) failing to provide the agreed type of taps": "It was common ground that on 12 July 1999, the plaintiffs' plumber could not gain\n\naccess to the property to install sanitary fittings, so there is no question that the plaintiffs\n\nwere not willing to do what needed to be done. However, on the issue of not supplying the correct\n\ntype of mixers, it was the evidence of Soh (N/E 197) that Ho proposed and which the defendants\n\naccepted, a brand of mixers which was the equivalent of Aquasolux. In his written (para 88) and oral\n\ntestimony (N/E 45), Ho had maintained that the contract did not specify the type oftapsto\n\nbe supplied, onlymixers; that is correct. Ho had deposed that the plaintiffs had in fact\n\ninstalled chrome-plated bib taps and on one of the first defendant's many inspections of the\n\nproperty, the latter had requested a change of some bib to, lever taps; Ho acceded to the first\n\ndefendant's request and now he had done avolte face. This complaint is not only unreasonable\n\nbut dishonest.",
        "q) failing to use clear varnish for timber and door frames": "Ho had testified (and which Soh confirmed) that the first defendant himself\n\ninstructed and supervised the plaintiffs' sub-contractor on the varnishing works; the defendants\n\ntherefore have no cause to complain. The defendants did not produce any evidence to contradict Hos\n\nand Sohs testimony.(xxii) failing to provide 10 years' warranty for water-tightness to all joints60. The plaintiffs submitted that their contractual obligation (see 1AB120-121)\n\ndid not amount to a blanket guarantee as the first defendant contended and put to Portwood (V/N\n\n162). Apparently, the first defendant seemed to have misunderstood his rights in this respect.\n\nPortwood pointed out that the clause relied on by the defendants refers to permanent movement\n\njoints; since the project does not have a permanent joint, the clause was not applicable.",
        "(xxiii) failing to excavate and construct the basement to a depth of 5m and failing to use sheet\n\npiles to shore-up the grounds while excavating the basement": "61. I shall deal with these two (2) more serious complaints together. It was the\n\ncommon testimony of Ho, Soh and Portwood that site conditions were precarious. They testified it was\n\nagreed between them with the second defendant's concurrence, that no further excavations would be\n\ndone when the plaintiffs took over the site. This was denied by the second defendant when she\n\ntestified (V/N 1036). However, neither the defendants' former counsel nor the first defendant\n\nhimself challenged Ho, Soh or Portwood on this aspect of their testimony. At the outset (para 5), I\n\nhad also pointed out that Rock Create, not the plaintiffs, did the excavation and piling works.\n\nConsequently, both complaints are devoid of any merit.(xxiv) failing to build the entrance culvert in accordance with engineer's specifications62. Portwood had testified that the plaintiffs failed to comply with his original\n\nspecifications and in their final submissions the plaintiffs indicated that they would abide by the\n\ncourt's decision. It was Selkey's testimony (V/N 283) that the plaintiffs' culvert needed to be\n\nrectified (there was some ponding on it) to comply with the requirements of the Land Transport\n\nAuthority, who was the ultimate approving authority, not Portwood.",
        "Tapping of water and electricity supplies from the second property": "63. Having addressed most if not all, of the defendants' complaints, I now need\n\nto deal with three (3) other outstanding issues before I give my decision, starting with the\n\ncomplaint that the plaintiffs tapped from the second property, water and electricity for their own\n\nuse.64(i). It was the common testimony of Soh and Portwood that Rock Create tapped\n\nthe utilities initially (with the defendants' agreement) and that the plaintiffs continued the\n\npractice (agreed at a meeting on or about 30 July 1998) although Portwood's version was, that it was\n\nmeant to be a temporary measure. Ho testified that (N/E 72) he had offered (and which the second\n\ndefendant accepted) to reimburse the defendants in full their PUB charges, for the duration of the\n\nproject. However, despite his repeated requests of the second defendant, she never gave him the PUB\n\nbills. Eventually, Soh issued a Variation Order certifying $10,000 omission for this item, which the\n\nplaintiffs accepted.(ii) In her written testimony however (para 12), the second defendant claimed to\n\nbe unaware of this arrangement and alleged that the plaintiffs had surreptitiously tapped the\n\nsupplies from the second property. She relied on the minutes of three (3) site meetings to support\n\nher accusation. However, in his testimony (N/E 72), Ho pointed out that those minutes had nothing to\n\ndo with tapping of PUB supplies  he was assisting the second defendant to ascertain why she had\n\nno water supply to the second property. Eventually (in April 1999), the plaintiffs' plumber traced\n\nthe leak which had caused the problem. Prior thereto, the plumber constructed a temporary by-pass\n\nfor the water.(iii) My only comment is, that $10,000 was a very generous provision on the part\n\nof Soh and the plaintiffs; it is highly unlikely that the plaintiffs' consumption of power and or\n\nwater could ever reach such a high figure, throughout their period of construction. Presumably, that\n\ncould be the reason why the second defendant never handed her PUB bills to the plaintiffs. This\n\nallegation is baseless.",
        "Damage to neighbouring property at No. 9, Belimbing Avenue": "65(i). It was reprehensible of the defendants to raise this complaint against the\n\nplaintiffs when they well knew that Rock Create caused the damage. I need only refer to the letter\n\nfrom the neighbour's solicitors (M/s Peter Low, Tang & Belinda Ang) dated 12 August 1998\n\n(1AB494) addressed to the second defendant, enclosing therewith a report done by Executive Decisions\n\nInc & Partners dated 2 July 1998. In essence, the said report stated that the damage caused by\n\nexcavations/basement works at the property pre-dated the plaintiffs' appointment and possession of\n\nthe site. This was reinforced by the defendants' own letter dated 14 August 1998 (1AB504) to their\n\nthen solicitors Toh Tan & Partners wherein they said:Please note that M/S Rock Create Pte Ltd was still the contractor of the\n\n  project when the said structural defects and cracks were inspected on 18thand 19thJune 1998.(ii) If indeed the plaintiffs were the culprits, I wonder why the defendants did\n\nnot join the plaintiffs as a third party to the proceedings instituted by the neighbour against them\n\nin DC Suit 5114 of 1999.",
        "Payment of Goods & Services Tax (GST) on the plaintiffs' invoices": "66(i). The first defendant refused to pay GST on the plaintiffs' progress claim\n\nno. 9, contending that the contract sum was a lump sum, even though the second defendant's paymentsin\n\nfullon the plaintiffs' previous invoices, included the element of GST. In support of their\n\nstand, the defendants relied on these conditions (1AB27) in the tender documents:A. Notwithstanding that the Goods and Services Tax (GST) has been imposed in\n\n  Singapore from 1 April 1994, any reference in the Conditions of Contract to 'The Tender Price'\n\n  including adjustments to the Tender Price shall be regarded as such sum exclusive of any tax on\n\n  the supply of goods and services that may be recoverable by the Contractor from the Employer under\n\n  this ContractB. The Contractor is deemed to have included in the Tender Price for all costs\n\n  and expenses arising out of or in relation to the administration of the GST payable by him on the\n\n  goods and services purchased for the carrying out and bringing to completion of the Works. Such\n\n  costs and expenses shall include but not limited to all administrative costs, financial charges\n\n  etc relating to the GST payable by him.To reinforce their argument, the defendants contended that the lettersINCLmeaning 'included' had been drawn against the value column for the above conditions; they added that\n\nRock Create did not charge GST. In his closing submissions on the counterclaim (p 146 para 109)\n\nfiled on 14 September 2001, the first defendant again made reference to the above provisions,\n\nreiterating his interpretation.(ii) The plaintiffs on the other hand submitted that the defendants'\n\ninterpretation was grossly erroneous; item A above in fact specified that the contract sum ie\n\n$729,000 wasexclusiveof GST and the plaintiffs could recover the same from the defendants\n\nwhilst item B meant that the plaintiffs could not claim the administrative costs and expenses\n\nrelating to GST. Hence, the plaintiffs used the word INCL to denote that the plaintiffs understood\n\nthey could not claim such expenses. The fact that Rock Create did not charge GST is irrelevant.(iii) It is my view that the defendants' interpretation of provisions A and B is\n\nclearly wrong and they are liable to pay GST on the plaintiffs' progress claims.",
        "The plaintiffs' alleged refusal to allow the defendants to bring prospective buyers to view the\n\nproperty": "67. Ho had testified (N/E 69-70) that he did not refuse entry but he asked the\n\nvisitors to be careful; in fact the prospective buyers were subcontractors, one of whom he\n\nrecognised as his roofer. The first defendant on the other hand said (V/N 686-688) they were a\n\nTaiwanese man, the man's girlfriend and a property agent. The plaintiffs in their closing\n\nsubmissions derided this explanation  why would prospective buyers go round the property\n\ninspecting only specific areas, with measuring tapes and clipboards? I prefer the plaintiffs'\n\nversion in this regard.",
        "The submissions": "68(i) Whilst on the subject of the defendants' closing submissions, I would like\n\nto make some general observations on the closing submissions of both parties. The first defendant's\n\nsubmissions on the plaintiffs' claim (filed on 24 August 2001) comprised 1017 pages in two (2)\n\nvolumes; his submissions on the defendants' counterclaim totalled 685 pages, again in two (2)\n\nvolumes. In both sets of submissions, the first defendant made copious reference to my notes of\n\nevidence as well as to the verbatim notes mechanically recorded.(ii) The plaintiffs' closing submissions totalled 126 pages. In para 213 of the\n\nplaintiffs' submissions, they complained that although the first defendant referred to extracts from\n\nthe notes of evidence/verbatim notes to support his allegations, the passages he relied on in fact\n\ndisproved the defendants' allegations. They labelled the defendants' arguments as convoluted,\n\nconfusing, illogical and nonsensical; I agree. It would serve no purpose to refer to specific\n\nexamples to support this criticism as the comment would apply to the first defendant's entire\n\nsubmissions which, to a large extent, were incomprehensible.",
        "The witnesses": "69. I turn now to the issue of the veracity of the witnesses who testified for\n\nboth parties. Apart from Ho (PW1), Chin Cheong (PW11) and the plaintiffs' quantity surveyor Oh Joo\n\nHuat (PW5), the plaintiffs' other eight (8) witnesses were all subpoenaed to attend court. The first\n\ndefendant accused Soh, Portwood and his own architect (Selkey) of lying (V/N 896) and asserted\n\nwithout any basis at all that Casimir (DW4) was a hostile witness. He alleged that Chin Cheong\n\n(PW11) had a grudge against him from their days of working for Shell (V/N 568), which allegation\n\nChin Cheong denied. The first defendant's wild allegations went to the extent of accusing the court\n\nof preventing him (V/N 907) from pursuing a point until he was stopped by a threat of being charged\n\nwith contempt of court. Having observed the demeanour of the various witnesses, I find the first\n\ndefendant's accusations to be totally unfounded. Although Soh, Portwood and Selkey were unwilling to\n\ntestify unless compelled to do so by subpoenas, they spoke the truth when they went into the witness\n\nbox especially Soh who, by all accounts, was a most reluctant witness.70. As for Ho, I found him to be candid and forthright in his testimony. He\n\nwillingly admitted to defects in the plaintiffs' works which needed to be rectified. He came across\n\nas a reasonable person who was willing to abide by the findings/observations of Soh, Portwood, Chin\n\nCheong and the court's decision on defects, deviations and omissions. He was prepared to accede to\n\nSoh's request, notwithstanding that the plaintiffs had been ejected from the site, to finish the\n\noutstanding works, to enable the property to secure TOP, even though the refusal to issue TOP by BCA\n\non 5 July 1999, was not due to any fault on his/the plaintiffs' part; it was directly caused by the\n\nunfortunate remarks made by the first defendant, who may have alarmed the inspector by what appeared\n\nto be his voyeuristic tendencies.71. I also had the benefit of observing the demeanour of the defendants in\n\nparticular the first defendant's, who was in the witness box for more than 1 days. Referring first\n\nto the second defendant whose evidence was considerably shorter, she struck me as a quiet and\n\nsubmissive woman who was completely dominated by the first defendant. I very much doubt that the\n\nstatements made in her affidavit evidence-in-chief expressed her views at all, they were the first\n\ndefendant's opinions entirely. Whether by force of circumstances or otherwise, she was not a\n\ntruthful witness; her testimony was contradicted largely by the documents produced in court.72. As for the first defendant, I need say no more than to refer to the\n\nplaintiffs' closing submissions (paras 32-38, 217-224) for a reasonably accurate appraisal of his\n\nperformance. It is difficult if not well nigh impossible, to highlight the instances where the first\n\ndefendant was caught lying whereupon he shifted his stance (almost continuously) or did avolte\n\nface; there are just too many to enumerate. He was a man who was capable of tapping power supply\n\nand water for use at the property (which he admitted [V/N 1012]), after he apparently closed the PUB\n\naccounts forboththe property and the second property on 27 September and 11 June 1999,\n\nrespectively (see Power Supply's letter dated 20 May 2000 at 1AB836). Otherwise, why would there be\n\nobvious signs of habitation at the property, as was reported back to me and I asked of the first\n\ndefendant (V/N 1012), after the site visit on 26 April 2001? The first defendant had also done an\n\nobviously unauthorised SCV connection to the property from the second property. He had deliberately\n\nflooded the RC roof and the basement of the property, causing leaks and consequential damage. He had\n\ndeliberately left the same basement window open during very heavy rain, according to Portwood (V/N\n\n67), who produced a photograph and report (P7) of a site inspection done on 17 March 2000, to\n\nsubstantiate this statement. Indeed, the rainwater ingress was also confirmed in Casimir's first\n\nreport dated 21 February 2000. He deliberately applied acid/corrosive substances to the handrails.\n\nConsequently, the damage arising from such acts cannot be attributed to the plaintiffs' workmanship.73. The first defendant was also unreasonable to the extreme, confirming when\n\nquestioned by the court (V/N 139) that he would charge Portwood $1,000 per meeting (of not more than\n\none hour's duration) as stated in his letter dated 29 March 2000 (1AB812), in order for Portwood to\n\nverify whether the basement had been filled with water exceeding 150mm. As I said to the first\n\ndefendant, this was done obviously to deter Portwood from visiting the property and finding out that\n\nthe first defendant had deliberately flooded the basement to create his own indoor swimming pool.\n\nHis unreasonable conduct in connection with the various episodes in July 1999, when he persisted in\n\nrepeatedly cutting the plaintiffs' locks used to secure the property, have been set out in earlier\n\nparagraphs. Whilst I would not call him a pathological liar (as the plaintiffs did in para 34 of\n\ntheir closing submissions), I would most certainly be understating it when I say that the first\n\ndefendant greatly economised on the truth, throughout his entire testimony. For the foregoing\n\nreasons, it would be unsafe to accept the testimony of the first defendant or that of his wife.74. As for the defendants' two (2) witnesses, I had indicated to Casimir (DW4)\n\nthat whatever the present state of the property may be, I was only concerned with its condition as\n\nat 6 July 1999, the day after the TOP inspection and which condition (shown in the photographs\n\nproduced in court by the plaintiffs/Soh) was confirmed by Soh's own inspection in the presence of\n\nthe first defendant, in September 1999. The reason was quite simple  Casimir's inspection and\n\nreports (3) were made in February/May 2000 and in March 2001. Even for his first report, an interval\n\nof five (5) months at least had lapsed from the time of Soh's inspection. In that time, the first\n\ndefendant (as I have found) had gone out of his way to aggravate whatever defects there were, and\n\nwhich the plaintiffs did not have an opportunity to rectify, during the defects liability period\n\napplicable to the contract. In this regard, Soh had said (N/E 138) that while he was not 100%\n\nsatisfied with the plaintiffs' work, he was at least 90% satisfied, adding (N/E 150) that usually\n\nthere are defects in a construction project which would be taken care of during the defects\n\nliability period or, they may be deducted as omissions from the cost items.75. I would emphasise that I do not doubt that what Casimir and Hatfield (DW3)\n\nsaw at the site is accurately reflected in their respective reports. However, what they cannot\n\ntestify to, not having seen the property either on 6 July 1999 or in September 1999 is, who was\n\nresponsible for the present deteriorated state of the property? The plaintiffs had proven, on a\n\nbalance of probabilities, that the condition of the property on 6 July 1999 was pristine (save for\n\ntouch-ups and minor rectification works being required), as shown in the photographs at 1AB996-1013,\n\nbefore they were summarily ejected from the site on 11 July 1999. I can only conclude from the\n\npreponderance of evidence adduced, including the photographs taken by the defendants themselves,\n\nthat the first defendant deliberately went out of his way to cause damage, which was quite\n\nsubstantial, to his own property.76. It is also interesting to note that Selkey when cross-examined (V/N 283), had\n\nindicated that only minor works were required between January 2000 (when he was appointed) and 10\n\nNovember 2000 (date of obtaining CSC for the property); essentially the minor works related to the\n\nculvert and railings. This is to be contrasted with the estimate of $550,000 which Casimir said was\n\nneeded in order to rectify the defects in the property and, which figure formed part of the\n\ndefendants' counterclaim (see para 32 thereof) for damages. In this regard, it is significant that\n\nOh Joo Huat the plaintiffs' quantity surveyor, testified (N/E 258) that he had never in his\n\nprofessional experience, come across a situation where the total construction cost of a house is\n\nabout $735,000 and the costs of rectification exceeds $500,000 or 70% thereof.",
        "The decision": "77. I find on the evidence that the plaintiffs have satisfactorily proven their\n\nclaim on a balance of probabilities. Accordingly, there shall be final judgment for the plaintiffs\n\nin the sums of $50,453.55 (on certificate no. 9) and $100,813.73 ($111,264.23  $10,450.50). The\n\nplaintiffs' second item of claim for $111,264.23 included variations totalling $10,450.50. As I am\n\nonly determining liability not quantum, the variation item (unless agreed by the defendants to be\n\nvalued at $10,450.50) shall go for assessment, in which regard, Oh Joo Huat (PW5) will need to be\n\nrecalled to testify further on quantum. The plaintiffs are also awarded interest at 6% from the date\n\nof the writ on both judgment sums (and on the variation amount when assessed or agreed) and costs.78. In the light of the plaintiffs' closing submission and the indication from Ho\n\nthat the plaintiffs were/are willing to abide by the findings of their own surveyor (Chin Cheong) as\n\nwell as those of Soh and Portwood, there shall be proportionate adjustment for the following items\n\neither for omissions or for the estimated cost of rectification:-(i) omission of anti-termite treatment, either the sum of $920 or to be\n\n  assessed;(ii) the cost of battening/nailing down the roof tiles;(iii) omission for the bi-fold back door not installed on Soh's direction;(iv) 4 spots of roof leakage;(v) omission for RC 9 and 10 beams;(vi) omission for the 2 toilet doors not installed;(vii) ponding on the floors of terrace and external areas of second /third\n\n  storeys(viii) defective main door and other mouldy doors due to poor staining;(ix) omission for twin sockets not installed or poor installation of twin\n\n  sockets;(x) omission of HMK protective coating not applied to granite flooring;(xi) replacement of one piece of granite due to poor tonality;(xii) clips/fasteners needed to secure copper pipes to walls;(xiii) fasteners needed to secure/anchor water pipes in the attic;(xiv) omission for hot-dip galvanising not done to main gate;(xv) culvert not done in accordance with Portwood's specifications.(xvi) Omission of one piece of granite panel not replaced.Items (i) to (xvi) when quantified or assessed, shall be set off and deducted\n\nfrom the judgment sum of $100,813.73, pending which there shall be a stay of execution on this\n\namount.79. I also find that the defendants were not justified in calling on the\n\nperformance bond on 18 August 1999; the plaintiffs were/are entitled to restrain the defendants from\n\ncalling for payment thereon. Further, the Delay Certificate should not have been issued by Soh on 7\n\nJuly 1999 as the delay in completion (measured against the date of obtaining TOP) was due to no\n\nfault of the plaintiffs.80. Needless to say, I find no merit in the defendants counterclaim which is accordingly\n\ndismissed with costs to the plaintiffs.Sgd:LAI SIU CHIUJUDGECopyright © Government of Singapore."
    }
}