{
    "case_title": "Loo Weng Fatt v Public Prosecutor",
    "ncitation": "[2001] SGHC 188",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The facts": "The Ministry of the Environment (`the Ministry`) had been carrying out a project, involving the replacement of sewerage pipes, at the Penjuru Road pumping station (`the project`). The Ministry awarded the main contract for this project to Eng Tat Engineering Pte Ltd (`Eng Tat`). The appellant was a director of Eng Tat.As the works on the project progressed, the Ministry made periodic progress payments to Eng Tat. The steps involved in the making of such progress payments were as follows:(1) Eng Tat would submit monthly progress claims to the Ministry. Each progress claim would show the amount of work done between the last progress payment and the present claim.(2) One Wong Seng Toong (`Wong`), who was then the project officer in the Ministry, would look at each progress claim before certifying that the work stipulated therein was done. Wong would then recommend that the progress payment be made to Eng Tat.(3) Upon Wong`s recommendation, the Ministry`s Head of Sewerage Department, one Yeo Seow Eng, would approve the progress payment. The progress payment would then be made to Eng Tat.This project was completed in December 1995. By then, Eng Tat had already submitted all their progress claims to the Ministry, and the Ministry had in response to these claims made a total of 19 progress payments to Eng Tat. The 19th progress payment was made on 2 November 1995.However, on 6 July 1996, the Ministry made a 20th progress payment, in the sum of $220,000, into Eng Tat`s account. Since the project was already completed by then, there was no work done to justify this 20th progress payment. Unlike all the other prior progress payments which the Ministry had made, this 20th progress payment did not appear to have been preceded by any corresponding progress claim from Eng Tat.Lying at the very heart of this case was the question of how the payment of $220,000 came to be made to Eng Tat.",
        "The trial below": "Following the above turn of events, the appellant was charged in the district court below. The charge read as follows:You ... are charged that you, on or about the 2nd day of July 1996, in Singapore, together with Wong Seng Toong and in furtherance of the common intention of you both, cheated one Yeo Seow Eng, the Head of Sewerage Department, Ministry of the Environment, by deceiving the said Yeo Seow Eng into believing that the 20th Progress Payment Certificate for a sum of two hundred and twenty thousand dollars ($220,000) for the Replacement of Pumping Main for Penjuru Road Pumping Station project and certified by Wong Seng Toong was true and correct when in actual fact it was not so, and by such deceit you dishonestly induced the said Yeo Seow Eng to approve and deliver $220,000 to Eng Tat Engineering Pte Ltd, which amount would not have been delivered had he not been so deceived and you have thereby committed an offence punishable under section 420 read with section 34 of the Penal Code, Chapter 224.THE PROSECUTION`S CASEThe prosecution`s case was that the 20th progress payment was made as a result of a fraudulent scheme which Wong hatched, and to which the appellant was privy.Sometime in early 1996, after completion of the project, Wong observed that the aggregate of all the progress claims made by Eng Tat came up to only $1.11m. However, the contract price for the entire project was $1.38m, ie the aggregate of the progress claims that could be made by Eng Tat could not exceed $1.38m. As such, there was still room for Eng Tat to put in further claims totalling up to $270,000. Upon observation of this fact, Wong came up with a plan to cheat the Ministry.Around April or May 1996, Wong arranged to meet the appellant at Aljunied Road. At this meeting, Wong spoke to the appellant about his plan. The plan would require Eng Tat to mark up the sum which it would claim against the Ministry for the total work done on the project. This would induce the Ministry to pay Eng Tat more than what Eng Tat was contractually entitled to. The excess payment was then to be split between Wong and the appellant. At first, the appellant said that he needed time to think about it. Subsequently, he agreed to join in the plan.Pursuant to the plan, Wong procured Yeo Seow Eng`s approval for the sum of $220,000 to be paid to Eng Tat. In procuring such approval, Wong thus deceived Yeo.The $220,000 was accordingly credited into Eng Tat`s account on 6 July 1996. After this, sometime between July and September 1996, the appellant met Wong on two occasions. On each occasion, the meeting took place near the Bedok MRT station. During each meeting, the appellant handed Wong $50,000. The total sum which the appellant paid to Wong thus amounted to $100,000.That, however, was not the end of the scam. About two years later, sometime in April or May 1998, the appellant prepared a draft final bill of quantities (`BQ`), which he submitted to the Ministry for approval. The draft final BQ was meant to  evidence the work done by Eng Tat for theentireproject. The Ministry was then to vet the draft final BQ, so as to ascertain whether the sum claimed by Eng Tat for the total work done was warranted. If the Ministry found that the sum due for the total work done exceeded the aggregate amount of progress payments that had been made, the Ministry would pay Eng Tat the shortfall. If the Ministry found that the sum due for the total work done was less than the aggregate amount of progress payments made, Eng Tat would have to refund the excess accordingly. Now, as there was an excess payment of $220,000, something had to be done to somehow account for the overpayment. The appellant thus prepared a draft final BQ (P10) with inflated claims.Unfortunately for the appellant, the plan to cheat the Ministry ran into a hitch at this very last stage. Wong, who had previously been the project manager for the Ministry, left the Ministry in late 1997. It was Wong who had been certifying the progress claims previously made by Eng Tat, and who had recommended that the progress payments be made. It was Wong who fraudulently put in the recommendation that the 20th progress payment be approved. Presumably, Wong should also have been the one to vet and approve P10. With Wong gone, the appellant had to submit P10 to another officer, Devaraj.When Devaraj received P10, he handed it to one Kenny Ong, a Technical Support Officer with the Ministry, for the purpose of checking. Kenny Ong discovered that the quantities stipulated in P10 were erroneous. Upon this, Devaraj called a meeting with the appellant. At this meeting, the appellant gave Devaraj the impression that P10 had already been approved by Wong.Nevertheless, Kenny Ong proceeded to revise P10, reducing the claim stipulated therein by the sum of $237,903.41. P10, as amended, was returned to Eng Tat, and Eng Tat accepted the same without any queries. Subsequently, a revised draft final BQ (P9) was prepared, which took into account the corrections that Kenny Ong had made.As a result of the revisions made to P10 by Kenny Ong, Eng Tat had to refund the excess money (ie $237,903.41, less a 0.22% contractual variation) to the Ministry.",
        "THE DEFENCE": "The defence advanced by the appellant below can be summarised as follows.(1) Firstly, he denied ever having been privy to Wong`s plan to cheat the Ministry.(2) Secondly, he claimed that the $100,000 paid to Wong was actually a loan advanced by Eng Tat. The loan was made because Wong had pestered the appellant for money. Thinking that Wong was suffering from cancer, the appellant took pity on him and consulted Eng Tat`s managing director, Lim Lek Kiang. Lim had then agreed to Eng Tat extending a loan to Wong.(3) The appellant also contended that the sums in P10 were not inflated pursuant to any conspiracy to cheat the Ministry. Rather, he said that the figures in P10 were only estimates, which the appellant arrived at after having relied on documents found in the office.",
        "THE FINDING BELOW": "At the trial, Wong was the main prosecution witness. The prosecution also called several other witnesses, including Kenny Ong and Devaraj. The main witness for the defence was the appellant himself. After hearing the evidence, the judge rejected the appellant`s version of facts. The appellant was thus convicted and sentenced to 15 months` imprisonment.",
        "The appeal": "The appellant appealed against the conviction and the sentence. The prosecution, on the other hand, cross-appealed for the sentence to be enhanced.",
        "The appeal against conviction": "SECTION 34 OF THE PENAL CODE: THE REQUIREMENT THAT THE APPELLANT BE PRESENTWong was convicted under s 420 of the Penal Code (Cap 224), which reads:Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy the whole or any part of a valuable security, or anything which is signed or sealed, and which is capable of being converted into a valuable security, shall be punished with imprisonment for a term which may extend to 7 years, and shall also be liable to fine.The appellant was also convicted under this same provision, but read with s 34 of the Penal Code. Section 34 reads:When a criminal act is done by several persons, in furtherance of the common intention of all, each of such persons is liable for that act in the same manner as if the act were done by him alone.At this juncture, it is apt to provide a brief summary of the law relating to s 34 of the Penal Code. When a `criminal act` has been committed, the accomplices of the doer of the criminal act can still be held liable for that criminal act even if they did not harbour the specific intention to do that criminal act: seeWong Mimi v PP[1972-1974] SLR 73[1972] 2 MLJ 75;PP v Neoh Bean Chye[1972-1974] SLR 213[1975] 1 MLJ 3. The elements needed to bring s 34 into play are as follows:(1) The parties sought to be held liable under s 34 must all have shared a common intention.(2) The criminal act that was perpetrated must have been `in furtherance` of that common intention: seeOng Chee Hoe v PP[1999] 4 SLR 688.(3) All the parties sought to be held liable under s 34 must have in some way participated in the criminal act.Before me, the principal argument raised by Mr Wee on behalf of the appellant was one of law. It was argued that the element of participation was not satisfied in the present case. The appellant had no part to play in Wong`s act of submitting the fraudulent 20th progress claim to Yeo Seow Eng.Furthermore, Mr Wee argued that it was a requirement that he had to bepresentwhen Wong submitted the 20th progress claim to Yeo Seow Eng. The  appellant was not present at Wong`s office when the progress claim was prepared, neither was he present when Wong submitted the claim to Yeo Seow Eng. As such, argued Mr Wee, s 34 could not come into play. In advancing such an argument, the appellant relied on the Singapore Court of Appeal decision inPP v Gerardine Andrew[1998] 3 SLR 736. In that case, the court held at [para ]34:Section 34 operates on the basis of joint liability and its essence lies in the doing of a criminal act which furthers the common intention of the participants. The participants are regarded by virtue of this joint liability as principals in the crime. In abetment on the other hand, the actual offence is committed by someone else other than the abettor. The very nature of s 34 demands a closer association with the actual commission of the offence, as compared to abetment where the person is punished for aiding or abetting the principal. There is therefore no requirement that an abettor must be present at the immediate scene of the crime in order for there to be liability for abetment. In our view, to hold that an accused can be liable under s 34 despite being absent when the commission of the offence occurred would render much of the abetment provisions in the Penal Code otiose. It cannot have been the intention for s 34 to take over the provisions of Ch V of the Penal Code which provides for the substantive offence of abetment. In our view, therefore, in order for an accused person to be liable under s 34, there must be a requirementthat he was physically presentwhen the commission of the offence took place. [Emphasis is added.]However, the trial judge below and the prosecution relied on a passage from the Indian case ofJaikrishnadas Manohardas Desai v State of Bombay(Unreported) , which was expressly referred to in theGerardinecase. InJaikrishnadas, Shah J, delivering the judgment of the court, remarked at p 892:To establish joint responsibility for an offence, it must of course be established that a criminal act was done by several persons; the participation must be in doing the act, not merely in the planning ... But this participation need not be in all cases by physical presence. In offences involving physical violence, normally presence at the scene of offence of the offenders sought to be rendered liable on the principle of joint liability may be necessary, but such is not the case in respect of other offences where the offence consists of diverse acts, which may be done at different times and places ...As it was rightly pointed out, the Court of Appeal inGerardinedid not expressly endorse the above statement of Shah J inJaikrishnadas. However, common sense dictates that the statement must be correct. To begin with, the court should, at the very outset, isolate what is the `criminal act` referred to by s 34, viz the offence which has been perpetrated, for which it is sought to make the other accomplices of the doer of that `criminal act` liable under s 34. Where the `criminal act` is a single act, eg when a death blow is dealt to the victim, the position is relatively simple: the murderer`s accomplices must at least have been present when the blow was dealt before they can be said to have participated in the act.However, the word `act` is defined by s 33 of the Penal Code as including `a series of acts`. A good example of such an instance may be provided by the following example. Both X and Y come up with a scheme to cheat the victim, Z. X prepares a forged document and hands it to Y, and Y in turn presents this document to Z so as to cheat Z. The `criminal act` comprises two subsidiary acts: the preparation of the document by X (during which Y may be absent) and the presentation of the document by Y to Z (during which X may be absent). Both subsidiary acts are instrumental in the deception of Z. The argument in the  appellant`s case was that the requirement of presence extended even to such criminal acts which are constituted by a series of subsidiary acts. However, such an argument begs the following important question: to which of the subsidiary acts constituting the criminal act should the requirement of `presence` be imposed? It seemed that the argument advanced on behalf of the appellant was that all the accomplices have to be in each others` company wheneachof the subsidiary acts is being performed. With respect, such a construction of s 34 is not only unwarranted, but it is also wholly contrary to good sense. To take the example just given, X has clearly participated in the fraudulent scheme, by preparing the fraudulent document. One cannot conceive of how the objective of s 34 would in any further way be advanced through the pedantic insistence that X, in order to be convicted under s 34, must also be present when Y presents the fraudulent document to Z.It is of utmost importance to remember that the authorities all establish that the key element required for s 34 isparticipationby all the accomplices sought to be implicated. The requirement laid down inGerardine(supra), to the effect that the accomplices must be present at the time of commission of the offence, stems from the fact that that there must be some form of participation by all the accomplices. This can be seen from the following question which the court inGerardineposed to itself at [para ]24:The long line of authorities on this makes it clear that in order for an accused to be liable under s 34, he must have participated either actively or passively in the criminal act ... What constitutes participation in the criminal act for the purposes of s 34? Can there be participation in the criminal act notwithstanding the fact that an accused was not physically present when the act constituting the offence was committed?Looking atGerardine(supra) in context, it was in answer to the above question that the court held that the requirement of presence was necessary. However, in a case where the `criminal act` consists of a series of subsidiary acts which have been performed by several accomplices, the very fact that an accomplice has contributed to the `criminal act` by performing one of the subsidiary acts that constitutes the `criminal act` must surely constitute sufficient participation. This accomplice need not be present when the other subsidiary acts are being performed by the other accomplices. To demand that presence is necessary even in such a case would only serve to create a lot of unnecessary confusion.Reverting to the facts of the present case, the task now was to isolate what the `criminal act` was, for the purpose of s 34. The judge below held:55 In the present case, there are diverse acts such as the proposal of Wong`s plan to the accused, the accused`s agreement to participate, the preparation of the 20th progress certificate, the presentation of the certificate and the subsequent payment of $220,000 into Eng Tat`s account. There is also no specific scene of crime as the acts took place at a number of places.With respect, the trial judge`s application of s 34 was erroneous. The `criminal act` in the present case was the deception of Yeo Seow Eng into approving the progress payment of $220,000, this being the offence under s 420 of the Penal Code. The `criminal act` was completed when Yeo Seow Eng was  deceived and the 20th progress payment was transferred to Eng Tat`s account. The acts of the appellant, which included paying off the $100,000 to Wong and submitting P10 to the Ministry almost two years later, were performed long after the `criminal act` had crystallised. The appellant`s acts could thus not be considered to be constituent parts of the `criminal act` as defined by s 34. This was not a situation where the `criminal act` consisted of a series of acts, with one of the accomplices doing some of the acts and the other accomplice doing the rest. This was a case where the `criminal act` was done solely by one person only, and that was Wong.In this respect, the case ofEdmund Nathan v PP[1997] 3 SLR 782, cited by the prosecution, was quite distinguishable. In that case, the appellant solicitor clearly participated in the criminal act, as it was he who prepared the S & P document with the inflated sale price, which document had been instrumental in his client`s act of deceiving the bank. In the present case, the act of deceiving Yeo Seow Eng was executed wholly by Wong, without the appellant having any hand in it.The end analysis in respect of s 34 was thus as follows: the appellant played no part in the execution of the `criminal act` (the criminal act being the preparation and tendering of the false progress claim and the consequent deception of Yeo Seow Eng). That act was done entirely by Wong. The appellant was not even present at the time of the preparation or submission of the false progress claim to Yeo Seow Eng. That being the case, it could not be said that the appellant `participated` in any way in Wong`s criminal act. The conviction under s 34 therefore could not be sustained.",
        "ABETMENT?": "Nevertheless the judge below remarked:58 In passing, I note that even if s 34 is not applicable, the accused can be found guilty under an abetment charge.Section 107 of the Penal Code reads:A person abets the doing of a thing who -(a) instigates any person to do that thing;(b) engages with one or more other person or persons in any conspiracy for the doing of that thing, if an act or illegal omission takes place in pursuance of that conspiracy, and in order to the doing of that thing; or(c) intentionally aids, by any act or illegal omission, the doing of that thing....In response to the judge`s comment, the following contention was raised in the appellant`s case:56 ... [Wong`s] proposal was for the Appellant to submit an inflated bill of quantity to him first, then PW1 would use the inflated bill of quantities as the basis of his approval for payment. The fact as it turned out is that the Appellant did not submit the bill of quantities to PW1 at all. It was after PW1 had \"gone on long leave\" that the Appellant submitted it to another officer nearly two years after the payment.  This begs the question whether an act done so long after the commission of the principal offence can be said to be an act in abetment of that offence.The appellant`s contention may well have been true, but only in so far as it related to abetment by aiding under s 107(c). After all, explanation 2 to s 107 reads:Whoever, eitherprior to or at the time ofthe commission of an act, does anything in order to facilitate the commission of that act, and thereby facilitates the commission thereof, is said toaidthe doing of that act. [Emphasis is added.]The act of abetment by aiding must thus be performed before or at the time of commission of the offence, and not after: seeVaratharajalu v PP[1960] MLJ 158. In the present case, the appellant`s very first overt act pursuant to Wong`s plan to cheat the Ministry was his handing of the $100,000 to Wong. This act occurred onlyafterthe Ministry had been cheated by Wong.However, on the evidence and on the findings of fact by the judge below, this case quite clearly disclosed that there must have been at least an abetment by conspiracy on the appellant`s part. InNMMY Momin[1971]  Cr LJ 793, the Supreme Court of India held at p 796:Criminal conspiracy postulates an agreement between two or more persons to do, or cause to be done, an illegal act or an act which is not illegal, by illegal means ...Unlike criminal conspiracy under s 120A of the Penal Code, abetment by conspiracy requires some further act to be done pursuant to the conspiracy. (See also Explanation 5 to s 108 of the Penal Code.) According to Koh Clarkson and Morgan`sCriminal Law in Singapore and Malaysia[1989]  at pp 311-312, the essential elements of abetment by conspiracy are: first, the person abetting must engage, with one or more other persons in a conspiracy; second, the conspiracy must be for the doing of the thing abetted; and third, an act or illegal omission must take place in pursuance of the conspiracy in order to the doing of that thing.Following from the above passage, it is clear that two requirements would be needed in the present case before the appellant could be held liable for abetment by conspiracy under s 107(b).(1) There must have been an agreement between him and Wong to cheat Yeo Seow Eng.(2) Some further act had to have been done pursuant to that agreement.As regards the first requirement, ie the question of whether there was an agreement, I have no doubt that such an agreement did exist. It would have been of no use to Wong to simply siphon the money from the Ministry to Eng Tat, unless there was an insider in Eng Tat assisting him. The insider would be needed to conceal the payment, as well as to hand Wong his share of the proceeds from the fraud. Thus, before 2 July 1996, which was the date when Wong deceived Yeo Seow Eng, it was highly likely that Wong had already entered into an agreement with someone from inside Eng Tat to commit the act of cheating. In this respect, the trial judge made an unequivocal finding of fact that that someone was the appellant. This finding was premised on the evidence of Wong, who testified that, prior to his act of deception on 2 July 1996, the appellant had agreed to assist him in his fraudulent plan. Wong testified that, after meeting the appellant at  Aljunied, the latter agreed to help Wong by allowing Eng Tat to be used as a channel by which the $220,000 could be siphoned from the Ministry.In this appeal, Mr Wee for the appellant argued that Wong`s testimony was unreliable for the following reason. In court, Wong said that he first came up with his plan to cheat the Ministryafterseeing the document P9, which was the final BQ showing all the work that had been done by Eng Tat on the project. However, it was undisputed that P9 came into existence only around the middle of 1998. As explained above, P9 was an amended version of (and therefore could only have been produced after the preparation of) the inflated draft final BQ P10, which was in turn prepared in April or May 1998. This could not be reconciled with Wong`s evidence that his scheme to cheat the Ministry was hatched as early as sometime in April or May 1996.Be that as it may, Wong explained in court that he was mistaken about P9. He thought that P9 had been prepared by him, when it was in fact prepared much later by somebody else. This explanation evidently found favour with the judge below, who held:42 Whilst Wong might have been mistaken about P9, his evidence on the material aspects remained constant. He gave clear evidence that he had a plan to obtain some money from the contract. There was also clear evidence from him that his plan would require the amounts in the BQ to be inflated. There was no change in his testimony that he told the [appellant] to adjust or inflate the BQ and submit it later to him and that in the meantime, he would arrange for the 20th progress payment certificate for the sum of $220,000 to be approved and to be credited into Eng Tat`s account.The judge further held:44 The defence submitted that since Wong had lied on P9, that `must surely impinge upon his testimony on the alleged meeting in Macpherson Road.` In this regard, I exercised caution before deciding whether to accept his evidence. I gave careful consideration to his testimony. I noted he was not broken down on the material aspects of his evidence despite the lengthy cross-examination by the defence. I did not think that he was lying when he said that the accused had agreed to his plan and that pursuant to this agreement he was able to get Yeo`s approval to release $220,000 through the fictitious 20th progress payment.The judge was amply justified in so holding, especially considering the fact that by the time of the trial, Wong had already been convicted and was serving time in prison. Wong had nothing to gain by lying. I therefore saw no reason to disturb the judge`s finding of fact.In any case, the surrounding evidence also pointed to the appellant having been privy to an agreement with Wong to cheat the Ministry. InEr Joo Nguang v PP[2000] 2 SLR 645, I remarked at [para ]35:So far as proof goes, conspiracy is generally a matter of inference, deduced from certain acts of the accused parties, done in pursuance of an apparent criminal purpose in common between them. Both the surrounding circumstances and the conduct of the partiesbefore and afterthe alleged commission of the crime will be useful in drawing an inference of conspiracy: seeChai Chien Wei Kelvin v PP(supra). An inference of  conspiracy would be justified only if it is inexorable and irresistible, and accounts for all the facts of the case. [Emphasis is added.]In the present case, it was not in dispute that after the $220,000 was credited to Eng Tat`s account, the appellant gave Wong $100,000 cash. In the court below, the appellant came up with the rather flimsy excuse that the money was a loan extended by Eng Tat to Wong. The following evidence was given by the appellant in his examination-in-chief:He continued to ask me for money ... I went to Lim [meaning Lim Lek Kiang, the Managing Director of Eng Tat]. I spoke to him. He told me the company had no money to give to him and it was also not company policy to give money ...Subsequently I approached the Managing Director again. I told Lim, Wong had called again and asked for help ... Finally Lim said due to sympathy he could lend some money and he asked me to inform Wong he had to return the money when he was well, that it was company policy not to give money but it was a loan....As to why my company lent money to person whom I hardly knew, it not my decision to lend him the money and we believed he was asick [sic] suffering from throat cancer, we had sympathy for him as the treatment was very expensive. Today I know I have been taken for a ride.The story that the $100,000 was a loan was wholly unconvincing. Firstly, $100,000 is not a small sum. Yet, this `loan` was given without any record of the debt, and without any terms pertaining to interest, security or time for repayment.Furthermore, as noted by the judge, there was no reason why Eng Tat would want to extend such a loan, given its financial state. At the relevant time, Eng Tat was running on overdraft for most of the month. The appellant even had to pump in $10,000 to Eng Tat to keep Eng Tat on its feet. In the course of cross-examination, however, the appellant changed his evidence, and said that the loan came not from Eng Tat but from Eng Tat`s Managing Director, Lim Lek Kiang. As might have been expected, Lim Lek Kiang was not called to cast light on the matter.From the above, the irresistible conclusion must be that the $100,000 was not a `loan`, but rather Wong`s share of the booty that was obtained by the joint plan of both Wong and the appellant to cheat the Ministry.Apart from the shady circumstances surrounding the alleged `loan`, there were also other factors pointing to the appellant having been privy to Wong`s fraudulent plan. Firstly, after the unsolicited sum of $220,000 was credited into Eng Tat`s account, the appellant did nothing to return the sum to the Ministry, but allowed Eng Tat to keep the money for over two years. Secondly, there is the fact that the appellant sought to tender a draft final BQ (ie P10) that had been inflated to the tune of $237,903.41. One could of course suggest that the similarity between this sum and the 20th progress payment of $220,000 that had been fraudulently procured by Wong was just a mere coincidence. But given the overall facts of this case, to advance such a suggestion would be naïve.It was thus my view that the trial judge was justified in finding that prior to Wong`s act of deception on 2 July 1996, Wong had already entered into an agreement with the appellant to cheat the Ministry. The act done pursuant to that  agreement was Wong`s submission of the fraudulent progress claim to Yeo Seow Eng. The elements of abetment by conspiracy were thus made out.As such, this was an appropriate case for this court to exercise its powers of revision under the Criminal Procedure Code (Cap 68), and to substitute the conviction under s 34 with a conviction for abetment, by conspiracy, of Wong`s act of cheating. The punishment for abetment is found in s 109 of the Penal Code, which reads:Whoever abets any offence shall, if the act abetted is committed in consequence of the abetment, and no express provision is made by this Code for the punishment of such abetment, be punished with the punishment provided for the offence.The power to effect such a substitution is conferred by s 256 of the Criminal Procedure Code, which states:At the hearing of the appeal the court may ......(b) in an appeal from a conviction ...(ii) alter the finding, maintaining the sentence ...The nature of the power encapsulated by this provision was explained in the case ofGarmaz s/o Pakhar v PP[1996] 1 SLR 401at 412:The scope of such power allows the court in appropriate cases, where it finds that the accused did not commit the offence with which he was charged but had committed an offence on which no charge has been preferred against him to alter the finding below and in consequence to substitute a conviction of the latter offence for that under appeal. In effecting this substitution the court is convicting the accused of an offence with which he has not been charged.An objection raised by Mr Wee was that such a substitution should not be made in this appeal, as it would cause prejudice to the appellant. The offence of abetment by conspiracy, argued Mr Wee, was materially different from a charge involving s 34 of the Penal Code.The issue of prejudice in cases such as the present was dealt with inJimina Jacee d/o CD Athananasius v PP[2000] 1 SLR 205. In that case, I held (at 218) that prejudice will generally not arise if substitution of the conviction under one offence for a conviction under another will not affect the substance of the evidence given in the proceedings below, and if the defence advanced in the trial below, if believed, would be a complete answer to the offence as substituted.In the present case, the appellant`s defence was that he was never party to Wong`s plan to cheat the government, and that there were explanations for his dubious acts subsequent to the payment of the $220,000 to Eng Tat`s account. If this defence were true, it would be a complete answer to a charge of abetment of Wong`s plan by conspiracy. However, the facts of this case showed quite clearly that the defence was unfounded. The trial judge made a clear finding of fact that prior to the submission of the fraudulent 20th progress claim, the appellant and Wong did enter into an agreement to cheat the Ministry. It was therefore my view that the appellant would suffer no prejudice from the proposed substitution.To recapitulate, the charge under which the appellant was convicted read as follows (for ease of reference, the charge is organised into sections):You ... are charged that you, on or about the 2nd day of July 1996, in Singapore,together with Wong Seng Toong and in furtherance of the common intention of you both, cheated one Yeo Seow Eng, the Head of Sewerage Department, Ministry of the Environment, by deceiving the said Yeo Seow Enginto believing that the 20th Progress Payment Certificate for a sum of two hundred and twenty thousand dollars ($220,000) for the Replacement of Pumping Main for Penjuru Road Pumping Station project and certified by Wong Seng Toong was true and correct when in actual fact it was not so, and by such deceityou dishonestly induced the said Yeo Seow Engto approve and deliver $220,000 to Eng Tat Engineering Pte Ltd, which amount would not have been delivered had he not been so deceived and you have thereby committed an offence punishable under section 420 read with section 34 of the Penal Code, Chapter 224.The first highlighted portion of the charge should be substituted with the following words:abetted Wong Seng Toong to commit cheating, in that you conspired with Wong Seng Toong to deceive one Yeo Seow Eng, the Head of the Sewerage Department, Ministry of the EnvironmentThe second highlighted portion should be replaced with the following phrase:the said Yeo Seow Eng was inducedThe reference to s 34 in the charge should also be substituted with a reference to s 109 instead.",
        "The appeal against sentence and the cross-appeal": "The appellant also appealed against the sentence, on the ground that 15 months` imprisonment was manifestly excessive. Mr Wee argued that the appellant did not gain personally from the fraudulent transaction, nor did the Ministry suffer any loss from it. Once the errors in P10 had been discovered, the excess payment was returned to the Ministry.It was not in the least bit surprising that this argument garnered no sympathy for the appellant. The only reason why the appellant did not gain anything was quite simply because the scheme to cheat the Ministry did not go according to plan. Had Wong still been the project officer in charge in the Ministry, Wong would have approved P10, with the result that the overpayment of $220,000 would never have been discovered. The appellant would then be richer to the tune of over a hundred thousand dollars. The appeal against sentence was therefore dismissed.With regards to the cross-appeal, it was contended by the prosecution that in cases where the accused person has cheated a government department or agency, the punishment had ordinarily been at least 18 months` imprisonment. I would, however, point out that the sentence imposed by the judge below was not to be interfered with merely because it was inadequate. It had to bemanifestlyinadequate before interference was justified. Bearing that in mind, it would serve no useful purpose to quibble over the difference between 15 months and 18 months. In any case, it should be noted that the protagonist who initiated the entire scam was Wong and not the appellant; the appellant got drawn into it only after Wong hatched his plan. Furthermore, the appellant was a first time offender.Accordingly, the sentence was not disturbed.Outcome:Appeals dismissed.Copyright © Government of Singapore."
    }
}