{
    "case_title": "National Skin Centre (Singapore) Pte Ltd v Eutech Cybernetics Pte Ltd",
    "ncitation": "[2001] SGHC 369",
    "coram": "Lee Seiu Kin JC",
    "sections": {
        "The witnesses": "7 NSC called a total of seven witnesses to give evidence on its behalf, namely:(i) Associate Professor Goh Chee Leok (\"Prof. Goh\") the Medical\n\nDirector of the National Skin Centre and the person in charge of the project;(ii) Loo Swee Cheng (\"Loo\"), the Financial Controller and Project\n\nDirector;(iii) Theresa Soon, the Executive at DSC;(iv) Lawrence Quek, Deputy Operations Manager;(v) Koh Yong Leng, Manager of Nursing and Clinic Operations;(vi) Lim Lee Foon, Pharmacy Manager; and(vii) Tan Seng Cheong, Pharmacist.The principal witnesses were Prof Goh and Loo.8 The witnesses for Eutech were:(i) Sumeet Kumar (\"Sumeet\"), Vice President of Eutech (at the time of\n\nthe Project);(ii) Olaf Paul Frederik, (\"Olaf\") former Manager of Eutech's Healthcare\n\nDivision;(iii) Dr Hari Gunasingham (\"Dr Hari\"), Eutechs Chief Executive\n\nOfficer; and(iv) Prasad Raja (\"Prasad\"), Eutechs Chief Financial Officer.",
        "The Plaintiffs Case": "9 The case for NSC is briefly as follows. The Contract provides for Eutech to\n\ndevelop and deliver the System to the National Skin Centre for use in its Specialist Outpatient\n\nClinic. Under the Contract, the System was to be commissioned by 31 August 1999. However Eutech\n\nfailed to commission the System by that date due to its own default. Several extensions of time were\n\ngiven by NSC. However Eutech failed to commission the System even within the extended times. Finally\n\non 11 February 2000 NSC issued a letter to Eutech stating that the project was already in delay for\n\nmore than 5 months and that NSC expected the full system to be delivered within 3 months (i.e. by 11\n\nMay).10 5 days later, on 16 February 2000, NSC informed Eutech orally at a meeting\n\n(which was later reduced to minutes) that it would monitor Eutechs progress over the next 2\n\nmonths. If Eutech were unable to commission the System by 11 May 2000, then NSC would terminate the\n\nContract. At this meeting NSC reminded Eutech that it would not accept the System being implemented\n\nin phases. After the meeting, Eutech submitted to NSC two implementation plans for approval:(a) the first implementation plan, dated 20 February 2000, which showed a phased\n\nimplementation with a final commissioning date of 28 July 2000; and(b) the second implementation plan, dated 8 March 2000, which again showed a\n\nphased implementation and a final commissioning date of 28 July 2000.11 NSC took this to be a clear expression by Eutech that it could not deliver the\n\nSystem by the deadline of 11 May 2000. Accordingly, NSC decided to terminate the Contract. NSC\n\ncontended that by its letter to Eutech dated 21 March 2000, NSC had terminated the Contract in\n\naccordance with its terms.",
        "The Defendants Case": "12 Eutech denied that it was guilty of continuous delay or that it was in breach\n\nof any term of the Contract. Eutech claimed that the understanding of both parties was that the\n\nSystem would be largely based on the Copernicus system used in Changi General Hospital (\"CGH\")\n\nwhich NSC representatives had viewed before the Contract was entered into. Furthermore clause 11.3\n\nof the Contract only entitles NSC to make minor modifications to the design and requirements during\n\nthe prototyping/design stage. However Eutech was impeded by NSC from carrying out its works under\n\nthe Contract in that:(a) NSC had insisted on a complete change, or alternatively substantial changes,\n\nto the Copernicus system demonstrated to NSC. This amounted to a change of Eutechs scope of works\n\nas it required a re-design of the screens and a complete change in the manner in which Eutech had\n\nproposed to carry out the work.(b) sometime in October 1999, NSC required Eutech to change the system at its\n\nsub-clinic, the Department of STD Control (\"DSC\") from a satellite site connected to the\n\ncentral server by leased line, as provided under the Contract, to a stand-alone site.As a result of these changes, the time for completion of the works under the\n\nContract was set at large and Eutech was entitled to a reasonable time to complete the Works.13 Furthermore, Eutech alleged that the termination of 21 March 2000 was wrongful\n\nfor the following reasons:(i) After expiry of the various stipulated target dates under the Contract, NSC\n\nhad not elected to terminate the Contract but instead had, by its conduct, elected to continue with\n\nthe Contract;(ii) NSC had agreed to the revised schedules, or alternatively had induced Eutech\n\nto work in accordance with these revised schedules; and(iii) NSC had issued a letter to Eutech on 11 February 2000 giving Eutech a\n\nperiod of three months to \"deliver\" the System. Despite this, the letter of termination of\n\n21 March 2000 was issued only one and a half months after the 11February letter.14 Additionally, clause 49.2 of the Contract gives Eutech 14 days after the\n\ntermination notice to effect a remedy. In terminating the Contract immediately on 21 March 2001, NSC\n\nwas in breach of this clause. Accordingly this wrongful termination, in itself, constitutes a\n\nrepudiation which Eutech accepted on 23 March 2000.15 In breach of the Contract, NSC had refused to make progress payments to Eutech\n\nand this had caused a serious cash flow problem for Eutech as Eutech had to pay third party\n\ncontractors and suppliers.16 NSC had refused to accept or commission the System at DSC although this was\n\nimplemented and had been in use since 31 December 1999.",
        "The Issues": "17 The following are the issues to be considered:(i) What is the proper construction of various terms of the Contract with regard\n\nto the scope of works of Eutech;(ii) Whether there were changes made to the scope of works after the Contract was\n\nmade;(iii) Whether Eutech had breached the terms of the Contract by failing to keep to\n\nthe Stipulated Target Dates;(iv) If Eutech had been in breach of the Contract, whether NSC had nonetheless\n\nlost the right to terminate because:(a) NSC had agreed to the revised schedules; and(b) NSC had induced Eutech to carry on work in reliance on the revised\n\n  schedules,(v) Whether NSC had validly terminated the Contract in giving the proper notice\n\nby its letter of 21 March 2000;(vi) Whether NSC had breached the Contract by: -(a) failing to accept or commission the System which was implemented and in use\n\n  at DSC from 31 December 1999; and(b) failing to make progress payments to Eutech,(vii) The following miscellaneous issues:(a) whether NSC is liable to repay Eutech the discount given on account of the\n\n  sale of the Copernicus system to the Singapore National Eye Centre (\"SNEC\");(b) whether Eutech is liable to NSC for the costs of the Y2K upgrade to the SWi\n\n  system; and(c) whether Eutech is entitled to repayment of the costs of a visit by NSC\n\n  personnel to the Memorial Sloan Kettering Cancer Centre (\"MSKCC\") in New York.(i) Construction of the Contract terms18 The first issue is the proper construction of the relevant terms of the\n\nContract with regard to the scope of works. First of all I should point out that there is an entire\n\nagreement term in clause 55 which provides as follows:This General Terms and Conditions of Contract supercedes all prior agreement,\n\n  arrangements and undertakings between the parties and constitutes the entire Contract between the\n\n  parties relating to the subject matter hereof but includes all correspondence attached in the\n\n  Annex 9. No addition or modification of any provision of the contract shall be binding on the\n\n  parties unless made by a written instrument signed by a duly authorized representative of each of\n\n  the parties.Accordingly, any purported addition or modification to any provision of the\n\ncontract by one party is not binding on the other party unless it is in writing and agreed upon by\n\nthe authorised representatives of both parties. It follows that any oral agreement is not binding\n\nnotwithstanding that the authorised representatives of both sides have agreed to it. This is of\n\ncourse subject to any estoppel that might have arisen in the course of the dealings between the\n\nparties. In addition, clause 54 provides that the annexes to the Contract shall form an integral\n\npart of it with the General Terms and Conditions of Contract prevailing in the event of any\n\ninconsistency.19 As with many contracts of this nature, it began with a proposal by Eutech to\n\nNSC, followed by a demonstration of the Copernicus system in use at CGH. Thereafter a flurry of\n\nactivity ensued in which the parties sought and obtained clarifications relating to the terms of the\n\nContract. Finally the Contract was signed by their representatives on 30 December 1998. An integral\n\npart of the Contract is Annex 9 which comprises the correspondence between the parties leading up to\n\nthe signing of the Contract and which the parties agree would form part of its terms. In view of\n\nclauses 54 and 55, it is not necessary to go into a detailed account of the events leading to\n\nsigning of the Contract and all the provisions must be determined from the documents comprising the\n\nContract.20 The Contract is divided into the following parts:(a) the General Terms and Conditions;(b) Annex 1 - the Workflow;(c) Annex 2 - Eutechs Proposal including the Gap Analysis Document;(d) Annex 3 - Backfile Conversion;(e) Annex 4 - Payment Schedule;(f) Annex 5 - Contract Price;(g) Annex 6 - Items Under Maintenance;(h) Annex 7 - Implementation Plan;(i) Annex 8 - Form of Bankers Guarantee; and(j) Annex 9 - Correspondence.21 The General Terms and Conditions contain the clauses of the Contract. The\n\nscope of work of Eutech under the Contract is set out in clause 2.1 which provides as follows:VENDOR hereby agrees to the following in relation to the Application Software\n\n  and Hardwares:a) Propose, develop/customize and supply the Application Software, System and\n\n  Services (including hardwares) to NSC free from all encumbrances;b) Install the Application Software at the Location by the Stipulated Target\n\n  Dates as defined in Annex 7;c) Acquire and install all hardware, supporting software required for operating\n\n  the hardware as well as integrating them with the stipulated application software to full\n\n  operational status acceptable to NSC, including integrating NSC email and network system.d) Develop the software required to interface Copernicus Healthcare Information\n\n  System and all related softwares and other stipulated softwares with the Document Imaging system\n\n  to be provided by Far East Computers to ensure full operational status of the System.e) provide the required documentation for Application Software, System and\n\n  Services as agreed between NSC and VENDOR;f) provide the required training in accordance with the agreed training\n\n  schedule;g) perform conversion and conversion related activities as Stipulated Target\n\n  Dates as defined in Annex 7;h) provide maintenance and support for all System and Services and related\n\n  deliverables free-of-charge up to the end of System Warranty Period; and during any agreed\n\n  maintenance period with agreed maintenance contract; andi) provide all other services specified by the Agreement, upon the terms and\n\n  conditions hereinafter contained.22 Clause 2.1(a) requires Eutech to develop or customise the \"Application\n\nSoftware\". This term is defined in clause 1.6.1(b) as\"the scope defined in Annexures 1\n\nto 3\". Annex 1 is entitled\"Proposed NSC Specialist Outpatient System/Electronic\n\nMedical Record Imaging System (EMR)/Administrative System (referred to as the SYSTEM)\".\n\nThis annex outlines the features of the System. Annex 2 is Eutechs\"Proposal for the\n\nSpecialist Outpatient Clinic (SOC)\", which is its proposal in terms of hardware, software\n\nand price. Appendix 1 to this annex contains detailed specifications of the hardware to be supplied\n\nunder the Contract. Appendix 2 contains the \"Gap Analysis\" which is a list of features in\n\nthe existing National Skin Centre system that are not available in Eutechs Copernicus system,\n\nhence the term \"gap\". Clause 2.1(c) makes Eutech responsible for integrating the hardware\n\nand supporting software with the application software to full operational status acceptable to NSC.23 Clause 7 provides that time shall be of the essence and that Eutech undertakes\n\nto supply, deliver, install and commission the System by the Stipulated Target Dates prescribed in\n\nthe Implementation Plan. It also provides that NSC shall make all necessary efforts to carry out its\n\nresponsibility to implement the System in accordance with the Implementation Plan. Clause 13, which\n\ndeals with the programme of work, stipulates that Eutech shall deliver the System in accordance with\n\nthe Implementation Plan set out in Annex 7. The Implementation Plan is in the form of a Gant chart\n\nwith bars representing activities, the length of each bar signifying the period of time for that\n\nactivity. An arrow leading from the end of one bar to the start of another indicates that the first\n\nactivity must be completed before the other one can begin. The key dates specified in the\n\nImplementation Plan for each stage or milestone of the project are as follows:(a) Prototyping  January/February 1999;(b) Design Prototype Sign-off  26 February 1999;(c) Customisation  26 February to May 1999;(d) Integration May/June 1999;(e) Installation  end-June 1999;(f) Installation Tests  July 1999;(g) Data Migration  March to mid-July 1999;(h) Paper Conversion  March to mid-October 1999;(i) Training  June/July 1999;(j) System Live  30 July 1999;(k) System Performance Tests  August 1999;(l) Commissioning  31 August 1999;(m) Performance Guarantee  September/October 1999;(n) Acceptance and Warranty Start  21 October 1999.24 Under the Implementation Plan, Eutech has to first complete Prototyping,\n\nthereafter proceed to Customisation, Integration and then Installation of the System.\n\n\"Stage\" is defined in clause 1.6.1(m) as any of the 13 stages listed there, ranging from\n\n\"Prototyping stage  defining user requirements\" to \"End of Warranty\n\nmilestone\". The Implementation Plan provides for \"Design Prototype Sign-off\" after\n\ncompletion of \"Protyping\" and fixes the date as 26 February 1999. It is only after the\n\nsign-off that \"Customisation\" begins, after that \"Integration\" and then\n\n\"Installation\", and thereafter \"Installation Tests\". In parallel with these\n\nactivities, and beginning after \"Prototyping\", is Data Migration, i.e. the transfer of\n\ndata from the old computer system to the System. After completion of all these activities the System\n\nwould go live and \"System Performance Tests\" would be conducted before\n\n\"Commissioning\". The latter is followed by a \"Performance Guarantee\" period\n\nbefore the System is accepted by NSC.25 The Contract anticipates the need for clarification during the prototyping and\n\ndesign stage. Clause 11.3 provides for NSC to issue clarifications to set out the requirements more\n\nprecisely which may entail minor modification of the design requirement for which Eutech is not\n\nentitled to additional payments. Clause 11.3 states as follows:It is anticipated that some matters of details may have to be clarified during\n\n  the prototyping/design stage. In this context, NSC reserves the right to issue clarifications to\n\n  the User and Technical design documents to set out the Requirements more precisely. Some minor\n\n  modifications of the design and requirements may occur during the design stage. VENDOR shall make\n\n  such minor modification at no additional cost to NSC.26 However for major changes, Eutech is entitled to additional payments. Clause\n\n47 provides for reasonable variations to be made by NSC to the scope of works or at any time during\n\nthe Contract. NSC may also revise the Implementation Plan. However this must be by way of a formal\n\nrequest. Eutech is entitled to make a claim for additional payment and extension of time within 14\n\ndays of the formal request. Clause 47 states as follows:",
        "47 VARIATION OF CONTRACT": "47.1 NSC may, at any time during the Contract, require VENDOR to revise the\n\n  Implementation Plan and/or to undertake any reasonable alteration or addition to or omission from\n\n  the Works or any part thereof.47.2 In the event of such a variation being requested, NSC shall formally\n\n  request VENDOR to state in writing the effect such variation will have on the Contract Price and\n\n  to the Works schedule. VENDOR shall furnish such details within 14 days of receipt of NSC's\n\n  request or such other period as may be agreed. VENDOR shall not vary the Works in any respect\n\n  unless instructed in writing to do so by NSC.47.3 A variation under this Clause 47 shall not invalidate the Contract but if\n\n  such variation involves a substantial increase or decrease in the cost of VENDOR for carrying out\n\n  the Works, an appropriate adjustment to Contract Price shall be made. Such adjustment shall be\n\n  agreed between NSC and VENDOR in writing as an addendum to this Contract.47.3.1 VENDOR shall satisfy NSC as to the reasonableness of changes to the\n\n  Works schedules and of the extra costs or savings resulting from the variations.47.3.2 Upon NSC being satisfied regarding the reasonableness of any extensions\n\n  to the Works schedule by the variation, NSC shall grant such extensions of time, and inform VENDOR\n\n  accordingly in writing.Copernicus system27 Eutech contended that the understanding of the parties was that the System\n\nwould be largely based on the Copernicus system already in use in CGH and that the Contract did not\n\noblige Eutech to make substantial changes to it before installation at the National Skin Centre.\n\nHowever for the reasons that follow, I find that this contention is not supported by the provisions\n\nin the Contract.28 By Clause 2.1 of the Contract, Eutech agreed,inter alia, to propose,\n\ndevelop/customise and supply the Application Software, System and Services (including hardware) to\n\nNSC, as well as to install the \"Application Software\" at the Location by the Stipulated\n\nTarget Dates as defined in Annex 7. \"System and Services\" is defined in clause 1.6.1(p) to\n\nmean:the products and services, including the Application Software, including all\n\n  administrative, clinical, laboratory, imaging, interface machinery, third party softwares\n\n  (including the financial and human resources/payroll system) and Hardwares both in-progress and\n\n  final, that are to be supplied, delivered, installed, commissioned and supported by VENDOR.\"Application Software\" means the scope defined in the Annexes 1 to 3.\n\nThe 1st paragraph of Annex 1 states :The proposed workflow assumes all features and functionality available in the\n\n  current SWi Paramedic softwares running the NSC to be available in the NSC Specialist Outpatient\n\n  System (the System).From this it is clear that the software to be developed under the Contract is\n\nrequired to have all the features and functionality in the SWi software that was being used at the\n\nNational Skin Centre.29 Annex 2 is entitled \"Proposal For The Specialist Outpatient Clinic System\n\n(SOC)\" (\"the Proposal\"). This was a proposal put up by Eutech as part of its bid for\n\nthe project. At p.4 of the Proposal is the following statement:NSC prepared a gap analysis document after the detailed system walkthrough.\n\n  This is attached in appendix 2. Eutech has studied all points in this document and is committed to\n\n  deliver with these gaps closed within the scope of this proposal.Appendix 2 to this proposal is entitled \"Gap Analysis Document From NSC\"\n\n(\"the Gap Analysis\"). This arose from a meeting between representatives of NSC and Eutech\n\non 16 October 1998. The minutes of this meeting are incorporated into the Contract via Annex 9.\n\nAccording to the first paragraph of those minutes (emphasis added):[t]his meeting was called to brief Eutech on the enhancements that are required\n\n  to be incorporated into the system at no additional charge. MD highlighted thatthe items to be\n\n  discussed today are obvious features that are not available in the Copernicus menu. He said\n\n  that if Eutech is awarded the contract, we willhave to work closely to make all the other\n\n  necessary detailed enhancementsavailable.This is followed by a list of features for each of the 15 components of the\n\nSystem. From the words emphasised above, it is clear that the features listed in the Gap Analysis\n\nwere the\"obvious features\"not available in the Copernicus system and that there\n\nwere other necessary enhancements to be made. Eutech took this list and reproduced it word for word\n\nin the Gap Analysis.30 From this it is clear that the Gap Analysis does not set out all the features\n\nand functionality of the System under the Contract. I find that under the Contract, in addition to\n\nthe features in the Copernicus system, the System is to contain all the features and functionality\n\navailable in the SWi system.Prototype Sign off31 Eutech claimed that in respect of the item \"Design Prototype Sign\n\noff\" in the Implementation Plan in Annex 7, it was not envisaged that there would be - and\n\nneither was it obliged to provide  a single document containing the complete design prototype for\n\nNSC. Eutech contended that, given the nature of the project and the direction it took, it was\n\nreasonable to construe the Contract as requiring production of the design prototype in stages for\n\nNSC to sign off at each of those stages.32 However the provisions of the Contract militate against such a construction no\n\nmatter how reasonable it might seem. Annex 7 contains the Implementation Plan which sets out the\n\nStipulated Target Dates. The material stages and target dates are those from \"Prototyping\"\n\nto \"Commissioning\". The Prototyping stage was to commence in early January 1999. It was to\n\nlast 7 weeks and end on 26 February 1999. At the end of that period is a milestone called\n\n\"Design Prototype Sign off\" scheduled on 26 February 1999. This indicates that it was\n\nnever envisaged that there would be more than one sign off.33 I turn to the nature of the document that was to be signed-off by NSC on 26\n\nFebruary 1999 under \"Design Prototype Sign off\". At p.15 of Annex 2, under the section\n\n\"Implementation Plan  Implementation Approach and Strategy\", the following paragraph\n\nappears (emphasis added):Initial planning with all parties involved will lead to a detailed project\n\n  schedule defining deliverables and organisational details, this will need to be signed off. An\n\n  initial analysis and design phase will producethe high level design documentconsisting\n\n  of the screens, reports, operations, data model and the database design. This will bethe\n\n  detailed model of the systemrequired by NSC andwill need to be signed by NSC.It is therefore clear, and I find, that the Contract envisages that the\n\n\"Design Prototype Sign off\" would be done on 26 February 1999. The document that NSC would\n\nbe signing-off would be a comprehensive \"high level design document\" consisting of\n\n\"the detailed model of the system required by NSC\" consisting of:- screens;- reports;- operations;- data model; and- database design.",
        "(ii) Were there changes to the scope of works?": "34 Eutech claimed that NSC had made substantial changes to the scope of works\n\nafter commencement of the Contract. However the main basis for this contention is the fact that\n\nEutech had interpreted the Contract as obliging it only to make minor modifications to the\n\nCopernicus system and to incorporate the features in the Gap Analysis. However as I have held above,\n\nthe System is required,inter alia, to have all the features and functionality in the SWi\n\nsystem.35 The evidence shows that after the Contract commenced, the representatives of\n\nthe parties had a large number of meetings to settle the prototype. This essentially entails NSC\n\npersonnel from its various departments going through the screens proposed by Eutech and giving their\n\ninput as to whether such screens were acceptable, and if not, what modifications would be required\n\nin order to comply with the requirements of the Contract. Unfortunately the main feature of such\n\nmeetings  and this is where I think the problem began  was that the NSC staff would give their\n\ninput and the Eutech representatives would then go off, purportedly to work on the incorporation of\n\nsuch input. But at the meetings that followed, either Eutech had not incorporated the input yet or\n\nthe NSC staff would give further inputs. Unfortunately there is scant documentation on this. Even\n\nmore unfortunately for Eutech, the person in charge of the project, Yadavendra Balehosur (\"Yadu\")\n\nwas not available to give evidence on its behalf. Yadu was Eutechs Vice-President and he took\n\ncharge of the project from the outset until December 1999, around which time he resigned from Eutech.\n\nMost of the crucial activities took place during Yadus watch. From the contemporary written\n\ncommunications it would appear that Yadu was eager to please and accommodated the requests of NSC\n\nwithout protest. However he was not able to produce the full prototype document and the project\n\nlimped along under his management.36 The question then is, did NSC demand changes to the scope of works. Eutech\n\nclaimed it did but NSC claimed that all the inputs given to Eutech were pursuant to the requirement\n\nto incorporate the features of the SWi system into the System. Eutech was unable to produce adequate\n\ndocumentary evidence to show that such change requests exceeded the scope of the Contract. The\n\ncontemporaneous communications with Yadu show that he did not complain about those requests, even\n\ndespite complaints from NSC about Eutechs repeated failure to meet deadline after deadline. It\n\nwas only in one letter, dated 29 October 1999, that Yadu complained that NSC had requested work\n\nbeyond the scope of the Contract. However this letter was very quickly withdrawn by Eutech. Indeed\n\nYadu sent an e-mail to Prof Goh stating as follows:\" I had no choice but to send you a reply. Hope you understand. Will\n\n  now work extra hard to make the project happen. Regards, Yadu\"About a week later, on 9 November, Yadu was in a reflective mood after a bout of\n\nflu and he sent another e-mail in which he said:As far as NSC goes, I still own it, foul ups and all. I signed the letter\n\n  but know the contents are grossly wrong. Lets see how it goes. A lot depends on development\n\n  which is crawling.37 In Sumeets affidavit evidence-in-chief, he exhibited a stack of change\n\nrequests. This comprised about 25 pages of requests that NSC had asked to be made after viewing the\n\nscreens shown by Eutech. When cross-examined, Sumeet said that only 2% to 5% of these requests were\n\noutside the scope of work, which meant that the remaining 95% to 98% were within the scope. However\n\nNSC maintained that they were all within the scope of the Contract.38 One explanation for this dispute could well be that Eutech was belabouring\n\nunder the impression that all they were obliged to do was to customise the Copernicus system to the\n\nextent set out in the Gap Analysis and no more. But I do not think that such was the true reason.\n\nThis is because Eutech had gone along with those meetings way past the original deadline of 26\n\nFebruary and did not protest until October 1999.39 I should point out that there is provision in the Contract for additional\n\npayment if NSC should require Eutech to undertake work outside the scope of the contract. This is\n\nclause 47 which I have set out earlier. This clause is invoked by a formal request by NSC. However\n\nif Eutech felt that any of the requests by NSC were outside the scope of works, it could have\n\nrequested NSC to do so under this provision. The fact that this issue was never raised is another\n\nindicator of the attitude taken by Eutech at the time towards the change requests.40 On the evidence before me, I find that NSC had not requested any changes\n\noutside of the scope of works of the Contract.",
        "(iii) Was Eutech in breach?": "41 Eutech submitted that it had not breached the terms of the Contract by failing\n\nto keep to the Stipulated Target Dates. However Eutech did not dispute that there was no single\n\n\"high level design document\" containing \"the detailed model of the system required by\n\nNSC\". I should add that neither was there a series of documents that in their entirety, could\n\nconstitute such a document. Eutech alleged without much basis that there was such a document, but\n\nsuffered from the disadvantage of not having Yadu around to account for matters. Yadus successor,\n\nSumeet, took over only in January 2000. Although he was involved in the technical aspects of the\n\nproject at an early stage, he did not get involved in its management until August 1999. He offered\n\nevidence on some events before that date but obviously such evidence suffered from the fact that he\n\nwas not personally involved in them. The other principal witness for Eutech was Olaf. However again\n\nin respect of communications between the parties, it was Yadu and not Olaf who participated in them\n\non behalf of Eutech.42 It is clear on the evidence of the contemporaneous communications between Yadu\n\nand Prof Goh, and also with Loo, that there was no high level design document for the System given\n\nto NSC for signing off. Under the Contract, Eutech was responsible for the production of this\n\ndocument. Of course it is subject to the condition that NSC must use all reasonable efforts to\n\nfacilitate this. Such efforts must include providing the requisite personnel to attend the meetings\n\nto provide the inputs. There is evidence that a lot of meetings were held. But no evidence that NSC\n\nwas holding up the prototyping work from the failure of its staff to attend such meetings. I find\n\nthat the project was plagued by a singular lack of time management of the activities on the part of\n\nEutech. The slippages to the schedule were quickly compounded and the project eventually became a\n\ngigantic mess out of which Eutech was unable to drag itself. It can be said that the Implementation\n\nSchedule did not provide for much time given such a mammoth task. However it must be borne in mind\n\nthat NSC had wanted the System in order to beat the potential Y2K problem in its SWi system. It may\n\nwell be that NSC ought to have started earlier than it did. But Eutech had entered into the Contract\n\non that basis. If much more staff were needed to meet the deadlines, the onus was on Eutech to get\n\nthem in order to perform the Contract in accordance with its terms.43 The substantive deadline in the Contract is the commissioning of the System,\n\nand this was originally set at 31 August 1999. This commissioning constitutes the core of the\n\nContract and the other stipulated dates are milestones along the way to measure progress. Clause 32,\n\nthe liquidated damages provision, is based on the commissioning date. There is no dispute that the\n\nSystem was not commissioned on that date. Indeed Eutech did not manage to commission it at all,\n\nwhich led to the termination. Accordingly I find that Eutech had breached the Contract in failing to\n\ncommission the System by 31 August 1999.",
        "(iv) Did NSC lose the right to terminate?": "44Eutech submitted that even if it had been in breach of the Contract,\n\nNSC had nonetheless lost the right to terminate because:(a) NSC had agreed to the revised schedules; and(b) NSC had induced Eutech to carry on work in reliance on the revised schedules.45 The 31 August 1999 deadline came and went without the System being\n\ncommissioned. Well before that date the parties were aware that it would not be met. In an attempt\n\nto deliver some part of the System without too much delay, on 26 May 1999 Yadu proposed to implement\n\nthe DSC system first. Under the original plan that was to be a satellite system with the application\n\nsoftware running from the server located at the National Skin Centre but with the DSC data stored at\n\nthe DSC server and the two computers linked by a leased line. Yadus new proposal meant that the\n\nSystem would first be installed and run on the DSC server where it would be more convenient to carry\n\nout testing and installation. It would subsequently be ported over to the server at the National\n\nSkin Centre. However in October 1999 Yadu proposed to install and run the application software at\n\nboth the DSC and National Skin Centre servers. This would involve additional costs, i.e. in terms of\n\nextra software, installation and testing. Eutech agreed to bear such costs as this was their\n\nrequest. Unfortunately the work at DSC took on a life of its own and Eutech also encountered\n\ndifficulties in getting the software up and running. Eventually a partial DSC system was installed\n\non 31 December 1999 but even that was rejected by NSC because it failed to meet all the\n\nrequirements.46 There were other repairs made on the run, so to speak, so as to salvage the\n\nsituation as best they could. To their credit, Yadu and his team were all the time trying to propose\n\nsolutions. Unfortunately they kept failing to deliver on those proposals. Meanwhile Eutech kept\n\nrevising the schedule. The first proposal by Eutech to change the completion date was from 31 August\n\nto 21 September and 21 December (in two phases). NSC told Eutech that if it should fail to deliver\n\nby 21 September, then NSC would have to go ahead and upgrade the SWi server to be Y2K compliant in\n\norder to make the Y2K transition without affecting the operations of the National Skin Centre. NSC\n\ntold Eutech that it would look to Eutech for the additional costs. NSC said that Yadu replied that\n\nEutech was agreeable to this.47 Eutech revised the schedule again on 25 October 1999. This took the\n\ncommissioning of the System (in its entirety) to 20 June 2000. At this point I should state that NSC\n\nmade much about the fact that in Eutechs schedules the project was divided into phases. I do not\n\nthink it is unreasonable, given a project of this nature, for the System to be commissioned in\n\nphases. But for the purposes of ascertaining performance, it is the commissioning of the last phase\n\nthat would count. I will use the last commissioning dates in describing the various revisions to the\n\nschedule.48 On 26 January 2000, the representatives for the parties held a top level\n\nmeeting to review progress. Present were Dr Hari, the CEO of Eutech and Prasad, the CFO. NSC told\n\nEutech that the project was already five months late and reserved the right to impose liquidated\n\ndamages in accordance with the Contract. Eutech was asked to submit a fresh implementation schedule\n\nby 2ndor 3rdFebruary.49 On 31 January 2000, Eutech submitted a new schedule. This one put the\n\ncommissioning date at 8 August 2000, almost one year from the original commissioning date. NSC\n\ndecided that it could no longer tolerate the delays. On behalf of NSC, Prof Goh wrote a letter dated\n\n11 February 2000 to Eutech on these terms:",
        "NSC CONTRACT  IMPLEMENTATION PLAN": "I refer to your third revision of the implementation plan dated 31 January\n\n  2000.I regret to say that the implementation plan is not acceptable to NSC. The\n\n  contract signed between Eutech and NSC was for a full system i.e. the specialist outpatient\n\n  system, electronic medical record imaging system and the administrative system. As stated in the\n\n  contract we require that the full system be commissioned by 31stAugust 1999, not in\n\n  piecemeal modules. The implementation has been delayed for more than 5 months now. We therefore\n\n  expect the full system to be delivered within this 3 months.Please also be reminded of the penalty clause, as agreed in the contract,\n\n  regarding late delivery of the system applies.50 Eutech submitted that this letter is unclear as to its intent. Eutech\n\ncontended that the term \"delivered\" is not defined in the Contract and therefore cannot\n\nmean \"commissioned\". The short answer to this is that the only reasonable interpretation\n\nthat can be given to this letter is that \"delivered\" means \"commissioned\". It is\n\nquite difficult to see how anyone can see it as otherwise.51 Three months from the date of the letter would be 11 May 2000. Back to the\n\nproverbial drawing board went the Eutech staff. On 20 February, they proposed yet another schedule,\n\nthis time proposing to commission the System by 28 July 2000. Shortly after that, on 8 March, Eutech\n\nrevised the schedule by shifting some internal activities but kept the commissioning at 28 July\n\n2000.52 After these two revisions of the implementation schedule, on 21 March 2000,\n\nNSC wrote to terminate the Contract. The question of the validity of this termination will be dealt\n\nwith below. Eutech submitted that in the circumstances NSC had, notwithstanding the breach, lost its\n\nright to terminate because:(a) NSC had agreed to the revised schedules; and(b) NSC had induced Eutech to carry on working in reliance on the revised schedules.53 In respect of submission (a), I do not find on the evidence before me that NSC\n\nhad agreed to the revised schedule. The only evidence that NSC had agreed to the revised schedules\n\ncome from the oral evidence of Eutechs witnesses. NSCs witnesses denied this and this is\n\ncorroborated in the contemporaneous documents such as minutes of meetings, e-mail and the occasional\n\nletter. But the most telling evidence is the fact that Eutech was submitting revised schedules. In\n\nthe 31 January revision, the commissioning date was 8 August. Then in its 20 February and 8 March\n\nrevisions it was moved back to 28 July. This is consistent with the evidence of NSC that the\n\nschedules were not accepted and that NSC had continued to press for an earlier completion, and I so\n\nfind.54 In relation to submission (b), I think the true question is whether NSC is\n\nestopped from demanding completion within 3 months. The picture that emerges from the evidence is\n\none in which the vendor has failed to meet the original deadline. It is an express term of the\n\ncontract that time is of the essence. But the purchaser does not elect to terminate the contract at\n\nthe time of breach but chooses to continue with it. Indeed, well before the deadline, the vendor and\n\npurchaser get together to see how they can salvage the situation or minimise the disruption to the\n\npurchasers operations (particular with respect to the Y2K issues). The vendor continues to limp\n\nalong but does not appear to make much progress. By 11 February 2000, the project is already delayed\n\nby more than five months. The purchaser is faced with a promise by the vendor that he would complete\n\nit by 8 August (the 31 January revision), which would mean a delay of more than 11 months from the\n\noriginal contract period of eight months. The purchaser decides that enough is enough and tells the\n\nvendor that he expects completion within 3 months.55 This set of facts is probably a common occurrence in the world of business and\n\ncommerce for it is on all squares with the facts inCharles Rickards Ltd v Oppenhaim[1950] 1 KB 616. That was a decision of the English Court of Appeal and it involved the purchase of a\n\nmotorcar. The plaintiffs there had promised delivery within seven months, viz. by 20 March 1948, but\n\nfailed to fulfil that promise on account of difficulties in relation to labour and materials. Time\n\nwas of the essence but the defendant chose not to terminate the contract. Instead he permitted the\n\nplaintiffs to continue working on it. However after three months of further delay, the defendant\n\ngave notice on 29 June that he would terminate the contract if it was not completed by 25 July. On 8\n\nJuly the plaintiffs informed the defendant that the car would not be ready by 25 July. The defendant\n\npromptly bought another car and claimed from the plaintiffs the refund of the part payment he had\n\nmade for the car.56 In relation to the election by the defendant to continue with the contract\n\nafter the plaintiffs failure to deliver the car within the seven-month deadline, Denning LJ held\n\nthat the defendant was estopped from relying on that breach as he had induced the palintiffs to\n\ncontinue working on the car. The judge said as follows (at p.623):I agree that that initial time was waived by reason of the requests that the\n\n  defendant made after March, 1948, for delivery; and that, if delivery had been tendered in\n\n  compliance with those requests, the defendant could not have refused to accept the coach-body.\n\n  Suppose, for instance, that delivery had been tendered in April, May, or June, 1948: the defendant\n\n  would have had no answer. It would be true that the plaintiffs could not aver and prove they were\n\n  ready and willing to deliver in accordance with the original contract. They would have had, in\n\n  effect, to rely on the waiver almost as a cause of action. At one time there would have been\n\n  theoretical difficulties about their doing that. It would have been said that there was no\n\n  consideration; or, if the contract was for the sale of goods, that there was nothing in writing to\n\n  support the variation. There is the well-known case ofPlevins v. Downing(1876) 1 CPD 220,\n\n  coupled with what was said inBessler, Waechter, Glover & Co. v. South Derwent Coal Co. Ld.[1938]   1 KB 408, which gave rise to a good deal of difficulty on that score; but all those difficulties\n\n  are swept away now. If the defendant, as he did, led the plaintiffs to believe that he would not\n\n  insist on the stipulation as to time, and that, if they carried out the work, he would accept it,\n\n  and they did it, he could not afterwards set up the stipulation as to the time against them.\n\n  Whether it be called waiver or forbearance on his part, or an agreed variation or substituted\n\n  performance, does not matter. It is a kind of estoppel. By his conduct he evinced an intention to\n\n  affect their legal relations. He made, in effect, a promise not to insist on his strict legal\n\n  rights. That promise was intended to be acted on, and was in fact acted on. He cannot afterwards\n\n  go back on it.57 However there was still no delivery after another three months. Denning LJ\n\nsaid that if delivery had been made before the defendants notice, then the defendant would have\n\nbeen obliged to accept the car. However it was not delivered and Denning LJ held that the defendant\n\nwas entitled to put matters to an end by giving notice to the plaintiffs that the car should be\n\ndelivered within a reasonable time. Denning LJ said (at p.623):So, if the matter had stopped there, the plaintiffs could have said,\n\n  notwithstanding that more than seven months had elapsed, that the defendant was bound to accept;\n\n  but the matter did not stop there, because delivery was not given in compliance with the requests\n\n  of the defendant. Time and time again the defendant pressed for delivery, time and time again he\n\n  was assured he would have early delivery; but he never got satisfaction; and eventually at the end\n\n  of June he gave notice saying that, unless the car were delivered by July 25, 1948, he would not\n\n  accept it.58 The plaintiffs counsel there had submitted that the right to give a notice\n\nmaking time of the essence was only available in a contract for the sale of goods but not in a\n\ncontract for work or labour. Denning LJ held that it applied equally in the latter case. He said (at\n\np. 624):in my view it is unnecessary to determine whether it was a contract for the\n\n  sale of goods or a contract for work and labour, because, whatever it was, the defendant was\n\n  entitled to give a notice bringing the matter to a head. It would be most unreasonable if the\n\n  defendant, having been lenient and waived the initial expressed time, should, by so doing, have\n\n  prevented himself from ever thereafter insisting on reasonably quick delivery. In my judgment he\n\n  was entitled to give a reasonable notice making time of the essence of the matter. Adequate\n\n  protection to the suppliers is given by the requirement that the notice should be reasonable.59 Denning LJ then considered what constituted reasonable notice. He quoted Lord\n\nParker inStickney v Keeble[1915] AC 386 at 419:in considering whether the time so limited is a reasonable time the court\n\n  will consider all the circumstances of the case. No doubt what remains to be done at the date of\n\n  the notice is of importance, but it is by no means the only relevant fact. The fact that the\n\n  purchaser has continually been pressing for completion, or has before given similar notices which\n\n  he has waived, or that it is specially important to him to obtain early completion, are equally\n\n  relevant facts.Denning LJ added that the case before him presented one additional factor, i.e.\n\nthe fact that the original contract made time of the essence of the contract. He also said that the\n\nreasonableness of the time fixed by the notice must be judged at the time at which it was given.\n\nDenning LJ said at p.624:not only did the defendant press continually for delivery, not only was he\n\n  given promises of speedy delivery, but on the very day before he gave this notice he was told by\n\n  the works manager in charge of the work that it would be ready within two weeks. Then he gave a\n\n  four weeks' notice. The judge found that it was a reasonable notice, and, in my judgment, there is\n\n  no ground on which this court could in any way differ from that finding. The reasonableness of the\n\n  time fixed by the notice must, of course, be judged at the time at which it is given. It cannot be\n\n  held to be a bad notice because, after it is given, the suppliers find themselves in unanticipated\n\n  difficulties in making delivery.60 Applying the law to the present case, when NSC elected not to terminate the\n\nContract after Eutech was in breach by its failure to commission the System on 31 August 1999, but\n\nchose to continue with it, time was set at large and was no longer a condition. However NSC was\n\nentitled thereafter to make time of the essence again by giving reasonable notice to Eutech. InEtablissements\n\nChainbaux S.A.R.L. v Harbourmaster, Ltd[1955] 1 Ll.LR 303, Devlin J said at p. 312:Now, the position of a party who has started out with a contract where time is\n\n  of the essence and has allowed the time to go by is, I think, quite clearly laid down in the\n\n  authorities. He has got to make time of the essence of the contract again in the normal case, and\n\n  that means that he has to give a notice giving the other side what is a reasonable time in all the\n\n  circumstances to comply with their obligations, and it is only after they fail to do that that he\n\n  is entitled to cancel the contract.I find that the letter of 11 February 2000 constituted such notice. The remaining\n\nquestion is whether the three months given by NSC to Eutech in that letter is a reasonable time\n\nperiod. This must be considered in the context of the original contract period of eight months and\n\nthe fact that by 11 February 2000, Eutech had been working on the project for more than thirteen\n\nmonths. In my view, the three-month notice is reasonable and I so find.",
        "(v) Did NSC validly terminate the Contract on 21 March 2000?": "61 After the 11 February notice was given, Eutech submitted a revised schedule on\n\n20 February. But this schedule put the commissioning at 28 July 2000, which is more than two months\n\nafter the 20 May deadline given in the notice. Shortly after that, on 8 March, Eutech revised the\n\nschedule by shifting some internal activities but kept the commissioning at 28 July 2000. NSC\n\nconstrued this as an indication by Eutech that it would not be able to comply with the new deadline.\n\nTherefore on 21 March 2000, NSC wrote to terminate the Contract.62 The first question is whether NSC was entitled to terminate the Contract\n\nbefore the 20 May deadline it had set. NSC submitted that Eutech had evinced an intention not to\n\ncomply with the deadline by submitting the revised schedules in which the commissioning date was way\n\nbeyond that deadline. Therefore NSC was entitled to accept this as an anticipatory breach and\n\nterminate the Contract.63 InEtablissements Chainbaux S.A.R.L. v Harbourmaster, Ltd[1955] 1 Ll.LR 303 the sellers terminated a contract for sale of marine engines to the buyers. One of the\n\ngrounds relates to the buyers obligation to establish a letter of credit. Devlin J found it was a\n\nterm of the contract that the buyers should open a letter of credit within a reasonable time.\n\nHowever they encountered some problems in obtaining the credit due to currency controls in force at\n\nthe time. The judge found that the buyers had failed to establish the credit within the time for\n\nperformance. But the sellers gave the buyers more time to procure it. The buyers subsequently made\n\npromises of imminent delivery on a number of occasions but failed to meet their own deadlines each\n\ntime. They also proposed an alternative means of securing payment but the sellers did not agree to\n\nit. So the buyers continued their efforts to procure the letter of credit and up to 11 October 1951,\n\nthe sellers confirmed that they were prepared to accept the credit when the buyers could deliver it.\n\nHowever the sellers terminated the contract on 22 October. Devlin J held that the sellers were\n\nentitled to terminate notwithstanding that a reasonable time had not elapsed after the sellers'\n\nconfirmation of 11 October because it turned out that the buyers would have been unable to perform\n\nwithin that time. He said at p. 313:What is the position here? Supposing Mr. Wall had disclosed to the defendants\n\n  on the morning of Oct. 22 what we now know to be the true facts of the position; supposing he had\n\n  said: \"I know I promised to give the letter of credit by Sept. 28, but I have not done so;\n\n  what is more, I cannot, I have not the sterling; it is not just a question of the bank arranging\n\n  the letter of credit or just a question of the import licence or anything of that sort; I have not\n\n  the sterling and, what is more, there is no reasonable prospect of my getting the sterling until\n\n  the end of the year; I cannot say definitely that I shall get it at the end of the year, but I\n\n  hope to get it, or some of it, by January; until then, however, my position is quite plain, I\n\n  cannot provide the sterling and I cannot provide the letter of credit\" that was in truth\n\n  his position. If he had said that, it is plain that the sellers could have rejoined: \"Well,\n\n  then, it may be that we would be obliged to allow you a reasonable time, 14 days or something of\n\n  that sort, fixed in relation to the original month and the delays and so forth; it may be that we\n\n  would be obliged to allow you a whole month, another month, to start all over again; but we\n\n  certainly are not obliged to wait until January, and in those circumstances there is not the least\n\n  advantage in our saying, 'Do it within 14 days,' because you have made the matter plain to us that\n\n  you cannot do it within 14 days.\" In those circumstances, there can be little doubt that the\n\n  letter of Oct. 22 would have been properly written.64 It should be noted that inEtablissements Chainbaux, the sellers had no\n\nknowledge when they terminated the contract that the buyers would not have been able to perform\n\nwithin the reasonable time. In the present case Eutech had, by twice submitting revisions which set\n\nthe commissioning date beyond the time given by NSC, represented that it would not be able to comply\n\nwith the new deadline. In the circumstances I would hold that NSC was entitled to terminate the\n\nContract on 21 March 2000.65 I now turn to Eutech's submission that the termination letter of 21 March 2000\n\ndid not give adequate notice. The letter states as follows:We refer to the above matter and our letter dated 11thFebruary\n\n  2000.We regret to inform you that by reason of your continuous delay and failure to\n\n  comply with the implementation schedule as listed in Annex VII of the Agreement dated 31 December\n\n  1998, you are in continuous breach of the Agreement.Pursuant to clause 49.1(a) and clause 7 of the Agreement, we hereby treat your\n\n  continuous breach as repudiation of the Agreement.As such, we will be proceeding to engage a new vendor to supply us with our\n\n  required software and will be looking towards you for any damages or loss arising out of your\n\n  repudiation.In the meantime, all our rights against you are expressly reserved.66 Eutech submitted that this letter was not one written pursuant to clause 49 of\n\nthe Contract. The relevant parts of that clause state as follows:49.1 NSC will have a right to terminate the Contract by notice in writing as\n\n  from the date specified in the notice prior to the Acceptance date, if:a) At any time VENDOR is in breach of any of its obligation under the\n\n    Contract,49.2 In the event of termination of the Contract as provided in Clause 49.1 (a)\n\n  and upon receipt of the notice to terminate, VENDOR shall have 14 days to effect a remedy or show\n\n  to NSC's satisfaction the cause of such breach of its obligations and VENDOR's intended remedy, in\n\n  which case, VENDOR shall have such reasonable period as is authorized in writing by NSC to effect\n\n  the remedy.67 Eutech submitted that NSC had not complied with clause 49.2. Eutech contended\n\nthat NSC had failed to give it 14 days period of notice to either remedy the breach, or show to\n\nNSCs satisfaction the cause of such breach, before terminating the Agreement. However in my view,\n\nEutech has misconstrued those provisions. On a proper construction of the clause, as soon as Eutech\n\nis in breach of its obligations under the Contract  the failure to commission on 31 August 1999\n\nas well as the continuing failure as at 21 March 2000 would constitute such breaches  NSC\n\nacquired the right pursuant to clause 49.1(a) to terminate the Contract by notice in writing. What\n\nclause 49.2 does is to provide a rather curious mechanism by which Eutech can resuscitate the\n\nContract notwithstanding that it has been terminated. Eutech can revive it within 14 days by either\n\n(i) effecting a remedy; or (ii) satisfying NSC as regards the cause of such breach and Eutechs\n\nintended remedy. In the latter case, if NSC can be satisfied as to the proposed remedy, Eutech would\n\nbe entitled to a reasonable period to effect that remedy.68 However instead of exercising its right to resuscitate under clause 49.2,\n\nEutech chose to treat the action as a repudiation of the Contract by NSC which it accepted. This was\n\nhow Eutech, through its solicitors, replied to NSC on 23 March 2000:We act for Eutech  and have been handed your letter of 21 March 2000At the outset, our clients deny that they have been guilty of continuous delay\n\n  and/or failed to comply with the implementation schedule or that they are in continuous breach of\n\n  the agreement as alleged by you.Our clients carrying out of the works under the Agreement has been seriously\n\n  impeded by your conduct and actions. Moreover, in breach of the Agreement, you have also failed to\n\n  make the necessary payments to our clients although part of the system has been used by you for\n\n  several months.Unless you inform us otherwise, our clients construe your letter of 21 March\n\n  2000 as notice of termination purportedly pursuant to Clauses 7 and 49.1 of the Agreement. Such a\n\n  termination is wrongful and amounts to a wrongful repudiation which our clients accept and thereby\n\n  terminating the Agreement. Our clients expressly reserve all their rights to claim against you for\n\n  all loss and damage which they have sustained by result of your wrongful termination.69 In the circumstances it is not a question of whether NSC \"gave\"\n\nEutech 14 days' notice of termination. There is no requirement to \"give\" notice. What\n\nEutech was entitled to do was to revive the contract within 14 days in the manner provided in clause\n\n49.2. In the event, Eutech did not avail itself of that right. Accordingly, I hold that the\n\ntermination by way of the letter of 21 March 2000 was valid.70 I should add that this resuscitation element of clause 49.2 reinforces the\n\nreasonableness of NSCs action in terminating the contract. If Eutech had been minded to effect\n\nperformance by the deadline given, it could have taken advantage of the opportunity presented in\n\nclause 49.2 to preserve the Contract. For example if Eutech had within 14 days informed NSC that it\n\nwas prepared to revise its schedule so as to bring forward the commissioning to 11 May 2000 and had\n\npersuaded NSC that they were able to meet the new deadline, then NSC might not have been entitled to\n\nterminate until after 11 May 2000. As it was, Eutech chose not to do so which by itself is an\n\nindication that it was unable to meet the deadline given by NSC.",
        "(vi) Was NSC in breach of Contract?": "71 Eutech submitted that NSC had breached the Contract by: -(a) failing to accept or commission the System which was implemented and in use\n\nat DSC from 31 December 1999; and(b) failing to make progress payments to Eutech.72 In respect of the DSC system, the evidence clearly shows that it was\n\nincomplete. In any event, NSC was not obliged to accept part commissioning under the Contract. The\n\nobligation of Eutech was to deliver the System in its entirety by 31 August 1999. If NSC chose not\n\nto terminate the Contract thereafter, it was obliged to accept the System commissioned at a later\n\ndate subject to liquidated damages from that date or any subsequent date as may be agreed or as the\n\nlaw would hold Eutech liable for. Therefore NSC did not breach the Contract in not accepting the DSC\n\nsystem on 31 December 1999.73 In respect of progress payments, it is necessary to look at the payment\n\nclause, clause 3, the relevant parts of which provide as follows:",
        "3. TERMS OF PAYMENT": "3.1 Subject to the provisions of this Contract, NSC shall pay to VENDOR the\n\n  Contract Price in the manner prescribed in Annex 4.3.2 In accordance with Annex 4, VENDOR shall submit such invoices or other\n\n  reasonable documents as NSC may require for the purposes of making payment.74 Annex 4 contains the following schedule:Hardware Operating SoftwareApplication SoftwareSigning of Contract5%Delivery of Hardware and System Software50%Acceptance of System Design (Prototype/Pilot Test)20%Commissioning of Hardware45%Commissioning of SYSTEM30%Acceptance of SYSTEM5%35%Warranty Completion10%75 Eutechs claim for payment appears to be in connection with the DSC system.\n\nAs I have found that it was incomplete, the claim for payment is notvalid. In any event,\n\nAnnex 4 only envisages payment upon commissioning of the System and does not provide for partial\n\npayment.",
        "(vii) Miscellaneous issues": "76 The miscellaneous issues are:(a) whether NSC is liable to repay Eutech for the SNEC discount;(b) whether Eutech is liable to NSC for the costs of the Y2K upgrade to the SWi system; and(c) whether Eutech is entitled to repayment of the costs of a visit to MSKCC by NSC personnel.77 Item (a) relates to the agreement between the parties that Eutech would give a\n\ndiscount of S$90,000 to NSC if the SNEC purchased the Copernicus system from Eutech. It depends on a\n\nfinding whether the $90,000 discount had been incorporated in the contract price of $2,186,000. In\n\nview of my findings on the substantive claims, it is not necessary for me to answer this question.\n\nHowever for completeness, I shall do so. The relevant part of the Contract to look at is an e-mail\n\nfrom Prof Goh to Yadu dated 20 December 1998 which is part of Annex 9 of the Contract. That e-mail\n\nstates:Please also include the clause where a one off $90,000 discount be given to NSC\n\n  (coupled with 6 months warranty period) if SNEC purchase the Corpernicus software from Eutech.If SNEC fails to purchase the system from Eutech, then this one off $90,000\n\n  discount will be waived, but the warranty period will be reinstated to 12 months after acceptance\n\n  date.Eutech claimed that the $90,000 discount was incorporated in the contract price\n\nof $2,186,000. But if the provisions of this aspect of the agreement have been incorporated it must\n\nfollow that the warranty period in the Contract would be stated as 6 months instead of 12. However\n\nclause 30.1 states that the warranty period is 12 calendar months. Therefore this must mean that the\n\n$90,000 discount had not yet been incorporated in the contract price and I so find.78 Item (b) concerns upgrading work done to the existing system at the National\n\nSkin Centre, i.e. the SWi system, to enable it to make the Y2K transition. This was necessitated by\n\nthe failure of Eutech to deliver the System by 31 August 1999 or any date before 31 December of that\n\nyear. Had Eutech managed to deliver the System within that time, the upgrade would not have been\n\nnecessary. NSC gave evidence of an e-mail from Yadu dated 26 July 1999 in which he confirmed that he\n\nhad agreed to pay $40,000.00 for the Y2K upgrade. Eutech agreed to this in order to buy them more\n\ntime to complete the System. In the premises, Eutech is liable to NSC for the $40,000. However NSC\n\nis claiming $100,031.17, being the sum that was actually expended. NSC also produced minutes of\n\nmeetings, letters and e-mail showing that it had told Eutech that it would be held liable for such\n\ncosts. However this claim is based on an agreement and the evidence only shows that Eutech had\n\nagreed to pay $40,000. There is no evidence of an indemnity given by Eutech. I accept that NSC had\n\nbeen in communication with Eutech on this question and that Eutech had remained silent, apart from\n\nthe commitment on $40,000. However I do not think that it is reasonable in the circumstances for NSC\n\nto take this silence as an agreement by Eutech to indemnify NSC for the costs of the upgrade, in\n\nparticular when no upper limit has been set. It would necessarily mean that had the cost of the\n\nupgrade amounted to a quantum that is of the order of the Contract sum itself, Eutech would have\n\ncommitted itself to pay that amount.79 Item (c) relates to the cost of two business class tickets to the United\n\nStates by NSC personnel to view the Filenet Imaging System. NSCs position is that Yadu had agreed\n\nto pay for the first trip in March 1999 as well as the second trip in June 1999 because the first\n\none in March 1999 was unsuccessful. Eutech contended that it had not agreed to pay for the second\n\ntrip which was to MSKCC. In my view, it is not necessary for me to determine whether there was such\n\nan agreement. Even if these trips were made pursuant to the Contract, with its termination NSC would\n\nhave gained a benefit in having sent its personnel on those two trips. There is no evidence adduced\n\nthat NSC would not retain the benefit of its personnel acquiring the knowledge and information\n\nderived from those visits and I have no difficulty in inferring that it would. As it would be unjust\n\nfor NSC to retain this benefit, it would be appropriate to order NSC to repay Eutech the cost of\n\nthese air tickets.",
        "Conclusion": "80 In the premises, I find Eutech in breach of the Contract and liable to NSC for\n\ndamages. NSC has claimed the following damages:(a) A refund of the sum of $340,672.50 paid by NSC to Eutech pursuant to the\n\nterms of the Contract;(b) In respect of the Y2K upgrade, the sum of $100,031.17;(c) Under 11 of the Statement of Claim, damages to be assessed;(d) Further or in the alternative, under 15 of the Statement of Claim, a\n\ndeclaration that the Defendant is liable to the Plaintiff for any increased cost arising from the\n\nPlaintiff procuring the services of a new vendor to install an equivalent software system pursuant\n\nto clause 32. 1 (b) of the Agreement.81 In respect of claim (a), with the termination, it follows that all payments\n\nmade by NSC to Eutech under the Contract must be refunded. Eutech does not dispute that the sum of\n\n$340,672.50 was paid. I therefore order Eutech to refund this sum but against this the following are\n\nto be set off:(i) The cost of the two business class air tickets to the USA which amount is to\n\nbe assessed if not agreed upon by the parties.(ii) The sum of $109,300 paid to NSC pursuant to the call on the banker's\n\nguarantee.82 In respect of claim (b), as I have found earlier, Eutech is liable to NSC for\n\nthe sum of $40,000 and I order such payment to be made by Eutech to NSC.83 Claim (c) relates to loss of profits and this is pleaded in 11 of the\n\nStatement of Claim in the following manner:11. By reason of the matters aforesaid, the Plaintiffs has suffered loss and\n\n  damage.Particulars of Loss and Damage(a) The Plaintiffs loss of profits in having to use the original SWi system\n\n  at the National Skin Centre (Singapore ) Pte Ltd from the agreed commissioning date up to the date\n\n  when an equivalent software system supplied by a new vendor is commissioned; and(b) The Plaintiffs loss of profits in having no computer system at their\n\n  satellite clinic, Department of S.T.D. Control ( referred to as \"the DSC\" in the\n\n  Agreement) from the agreed commissioning date up to the date when an equivalent software system\n\n  supplied by a new vendor is commissioned.84 In principle I can see no reason why NSC is not entitled to such damages.\n\nIndeed counsel for Eutech did not submit otherwise. There is the problem of proving such damages but\n\nthat is for another day. However as NSC was prepared to extend the commissioning date to 11 May\n\n2000, the loss of profit must be computed from that date and not the original commissioning date of\n\n31 August 1999 which NSC had waived. Accordingly there will be a declaration that NSC is entitled to\n\nany loss of profit that it is able to prove arising from Eutechs failure to commission the System\n\nby 11 May 2000 and for such period from that date as is reasonably necessary for NSC to procure an\n\nequivalent system. I should emphasise that the key words are \"equivalent system\". If NSC\n\neventually installs a system that takes a longer period to commission than would the\n\n\"equivalent system\", then Eutech would not be liable for the loss of profits over the\n\nadditional time taken.85 In respect of claim (d), 15 of the Statement of Claim pleads the following\n\nfacts:15. At present, the Plaintiff is still in the process of calling for tenders\n\n  from various vendors to install an equivalent software system. Accordingly, the Plaintiff is\n\n  therefore not able to quantify the increased cost (if any) which would arise from procuring the\n\n  services of a new vendor. When a new vendor is engaged to install an equivalent software system\n\n  and the Plaintiff is then able to determine the increased cost (if any), and the Plaintiff claims\n\n  the same from the Defendant.As any loss suffered by NSC would be the result of Eutechs breach, it would\n\nfollow that Eutech would be liable for any increased cost arising from the procurement of an\n\nequivalent system from another vendor and I so declare.86 As for the remaining items in the Defendant's counterclaim, in view of my\n\nfindings it follows that they would be, and are, dismissed.87 Finally, NSC would be entitled to interest at the usual rate on the sums that\n\nit is entitled to under this judgment from the date of the writ. I will hear counsel on the question\n\nof costs.Sgd:LEE SEIU KINJUDICIAL COMMISSIONERCopyright  Government of Singapore."
    }
}