{
    "case_title": "Public Prosecutor v Amran bin Eusuff and Another",
    "ncitation": "[2001] SGHC 376",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "THE PROSECUTION’S CASE": "2 CPL Fazuri Bin Isnin of the CNB posed as a buyer of cannabis. On 1\n\nMay 2001, at about 8.30 pm, his contact informed him that a male Malay named Daud was\n\nlooking for a buyer of cannabis in a large quantity. He instructed the contact to\n\nrecommend him as a buyer called Man Boy and to give his handphone number 96288793 to Daud.\n\nThe contact called back a few minutes later to say that Daud wanted him to telephone him\n\nat 4688965 the following night to discuss the deal. 4688965 was the number of a public\n\ntelephone at the coffeeshop in Sixth Avenue.3 On 2 May 2001 at about 8 pm, CPL Fazuri called Daud at the said\n\nnumber and asked for 1 kg of cannabis. Daud said he would return the call after checking\n\nthe stuff and the price. About ten minutes later, Daud called to say that if he would buy\n\n3 kg of cannabis, the price would be cheaper. CPL Fazuri told him that he needed to\n\ndiscuss the matter with his partner first.4 About 15 minutes later, CPL Fazuri called Daud to say that he would\n\nagree to buy 3 kg if the price was right. Daud told him the price would be $6,000. CPL\n\nFazuri counter-offered at $5,000. Daud then handed the telephone to one Abu. After some\n\nnegotiations, Abu agreed to sell the 3 kg of cannabis for $5,000 and said that he or Daud\n\nwould telephone CPL Fazuri the next day to confirm the place and the time for the deal.5 The next day (3 May 2001), at about 1 pm, Daud called CPL Fazuri. He\n\nsaid that Abu and he would meet CPL Fazuri at the 7-Eleven store along Sixth Avenue in the\n\nevening and would bring him to another place to collect the cannabis. CPL Fazuri told him\n\nthat two of his men would drive a car to the 7-Eleven store to meet them. Daud agreed and\n\nsaid he or Abu would call again in the evening to confirm.6 At about 7 pm, Abu spoke to CPL Fazuri and told him that he had only\n\n2.5 kg of cannabis which he offered at $4,400. CPL Fazuri accepted the offer and told Abu\n\nthat his men would be driving a car with the registration plate SZA 5202 M. Abu told him\n\nthe meeting time would be about 7.45 pm.7 At about 7.10 pm, CPL Fazuri conducted a briefing for 11 CNB officers\n\nregarding the coming operation. SGT Noor Aldi and CPL Mohd Nabil would pose as Man\n\nBoy’s men. CPL Fazuri would call CPL Mohd Nabil’s handphone just before the\n\nmeeting with the two sellers and would keep the line on so that he could monitor the\n\nconversation in the car. He would then relay the communication to another CNB officer who\n\nwould in turn inform the other CNB officers via handphone. Once the cannabis was handed\n\nover, CPL Mohd Nabil was to say \"Barang bagus\" or (\"good stuff\") as\n\nthe signal for the rest of the officers in the three other cars to move in to arrest the\n\ntwo sellers.8 CPL Mohd Nabil was the front seat passenger in the undercover car\n\ndriven by SGT Noor Aldi. At about 7.50 pm, when they were parked near the 7-Eleven store,\n\ntwo male Malays approached the car and asked them if they were Man’s men. They then\n\nintroduced themselves as Daud and Abu. Daud sat in the rear behind the front seat\n\npassenger while Abu sat behind the driver. Daud then instructed them to proceed to Bukit\n\nMerah View.9 When they arrived at Bukit Merah View, Daud instructed them to stop\n\nalong the road in front of Blk 117. Abu then alighted on his own accord and crossed the\n\nroad towards Blk 123 and disappeared from view.10 About five minutes later, Abu reappeared carrying a yellow paper\n\nbag. Upon seeing Abu, they did a U-turn to pick him up on the other side of the road. Daud\n\nmoved to the seat behind the driver to make room for Abu. Upon entering the car, Abu\n\nhanded over the yellow plastic bag to CPL Mohd Nabil. When he saw that the bag contained\n\nsome bundles, CPL Mohd Nabil gave the prearranged signal by saying \"Barang\n\nbagus\".11 One of the other three cars with CNB officers, waiting in the\n\nvicinity, then drove alongside the undercover car and intercepted it. When the undercover\n\ncar stopped, both Daud and Abu ran out. They were caught a short distance away and put up\n\na violent struggle but were eventually subdued. The other two cars then arrived at the\n\nscene.12 All the CNB officers then left with Daud and Abu for the carpark\n\nnear the Delta Swimming Complex, a short drive away from Bukit Merah View. The yellow\n\npaper bag and its contents were kept by CPL Mohd Nabil until handed over to ASP Daniel\n\nTan, the Investigating Officer. Inside the yellow paper bag were two plastic bags tied\n\ntogether at the top. There were five large bundles and one small bundle of cannabis\n\ninside. CPL Mohd Nabil identified the First Accused as Daud and the Second Accused as Abu.13 In cross-examination, CPL Mohd Nabil added that while they were\n\nwaiting for Abu at Bukit Merah View, Daud told him that the stuff was still wet, meaning\n\nit was good. He also added that it was Daud who asked them if they were Man’s men.\n\nAbu did not say anything in the car. Daud also asked whether he had the money for the\n\ndrugs and CPL Mohd Nabil said, yes. Daud did not ask about how much his commission would\n\nbe.14 SGT Noor Aldi’s narration of the events that night was the same\n\nas CPL Mohd Nabil’s. He gave chase to and, with another CNB officer, caught and\n\nsubdued Daud.15 In cross-examination by the Second Accused’s Counsel, SGT Noor\n\nAldi said he remembered the name given by the Second Accused was Abu and not Rabu but\n\naccepted that he could have been mistaken.16 At the Delta Swimming Complex carpark, Insp Senthil Kumaran noted\n\ndown the particulars of the two Accused persons and then proceeded to record oral\n\nstatements from them separately. As they wished to speak in Malay, SSSGT Abdul Rahman\n\nacted as the interpreter.17 He began with the First Accused, recording the following questions\n\nand answers on a piece of paper:\"Q: What is your name?A: Amran Bin Eusuff. I am also known as ‘Daud’.Q: Whose bag is this (pointing to the yellow bag)?A: It belongs to ‘Abu’ (referred to B2) who was arrested\n\n  together with me.Q: What is inside the bag?A: Ganja.Q: How much is the quantity?A: 2  kilos.Q: What is it for?A: It is for ‘Boy’. Yesterday (2/5/01) I introduced\n\n  ‘Boy’ to ‘Abu’ over the phone.Q: How much is it?A: ‘Abu’ told me the price was $4400.\"The questions and answers were then read back in Malay by SSSGT Abdul\n\nRahman to the First Accused who confirmed the correctness thereof by signing on the piece\n\nof paper.18 Insp Senthil Kumaran then moved on to the Second Accused, recording\n\nthe following questions and answers through the interpretation of SSSGT Abdul Rahman:\"Q: What is your name?A: Rabu Bin Rahmat.Q: Whose bag is this (pointing to the yellow bag)?A: The bag belongs to ‘Daud’. (Recorder’s note: Rabu\n\n  pointed to Amran)Q: What is inside the bag?A: I do not know. I only took from a male Malay known as\n\n  ‘Ahmad’ at the void deck of Blk 123 Bukit Merah View.Q: What is it for?A: I do not know what is it for but Daud instructed me to take it from\n\n  ‘Ahmad’.Q: Who is Ahmad?A: I do not know his real name.Q: Do you know his contact number or place of abode?A: I only know his pager number 95017785.\"Similarly, the questions and answers were read back in Malay by SSSGT\n\nAbdul Rahman to the Second Accused who signed on the piece of paper thereafter. During\n\neach recording, the two Accused persons were kept about 15 to 20 metres apart.19 The CNB officers together with both Accused persons then went to the\n\nFirst Accused’s residence at Turf Club Road but were told by a security guard that\n\nthe place in question had already been demolished. They then went to the Second\n\nAccused’s flat in Bukit Batok but found nothing incriminating there. They next\n\nproceeded to Jurong Police Regional Headquarters where both Accused persons’ urine\n\nsamples were obtained.20 At about 2.15 am on 4 May 2001, the CNB officers and the two Accused\n\npersons arrived at the Major Investigation Branch (MIB) of the CNB where Insp Senthil\n\nKumaran briefed the Investigating Officer, ASP Daniel Tan. The drug exhibits and the\n\npersonal belongings of the Accused persons were handed over to the Investigating Officer.21 In response to questions from the Second Accused’s Counsel,\n\nInsp Senthil Kumaran said he did not try to ascertain who the \"Ahmad\" mentioned\n\nby the Second Accused was. He did page him using the number given but there was no\n\nresponse.22 SGT Andy Lim testified that the First Accused was running towards\n\nthe railing next to the road and attempting to climb over it when he pulled him down. With\n\nthe help of SGT Noor Aldi, he managed to hold the First Accused down and handcuff him.23 SGT Abu Hanafiah and SGT Galistan Gregory, who had a two feet long\n\nbaton with him, were the ones who chased and caught the Second Accused who also put up a\n\nviolent struggle. As the Second Accused was pinned to the pavement during the struggle, he\n\nsuffered some minor injuries to his body. The CNB officers denied that they assaulted the\n\nSecond Accused. SGT Galistan Gregory was using his baton to pin the Second Accused’s\n\nhead down and was not hitting him with it. He had the baton ready in case he had to break\n\nthe windows of the undercover car should the Accused persons lock themselves in the car.24 Dr Lui Chi Pang, an analyst attached to the Centre for Forensic\n\nScience (CFS) analysed the five large blocks and one small block of vegetable matter found\n\nin the yellow paper bag seized by the CNB and certified that they contained a total of\n\n2174.86 grams of cannabis, the amount specified in the joint charge.25 Dr Natarajan Srikanth, also an analyst at the CFS, analysed the\n\nurine sample of the Second Accused and found it to be positive for cannabis consumption.26 Dr Ann Young, also an analyst at the CFS, analysed the urine samples\n\nof the First and the Second Accused. No cannabis was detected in the First Accused’s\n\nurine sample but the Second Accused’s urine sample again tested positive for\n\ncannabis.27 Dr John Chiam of the Alexandra Hospital examined the First Accused\n\nat 3.39 am on 4 May 2001 and found recent abrasions on the forehead, the nose, the right\n\ncheek and the right lip. He examined the Second Accused at 3.20 am on 4 May 2001 and found\n\na bruise on the forehead, an abrasion on the left shoulder, a bruise on the right back and\n\non the right hand. The injuries were also of recent origin. The Second Accused also had a\n\npre-existing skin condition. These examinations were pre-statement medical examinations.28 Dr Tan Sing Huang did the post-statement medical examinations on\n\nboth Accused persons at 4.45 am (for the Second Accused) and at 5.20 am (for the First\n\nAccused) on 4 May 2001. She noted essentially the same injuries as Dr John Chiam did in\n\nrespect of the First Accused. For the Second Accused, she noted three red patches\n\nmeasuring 2 cm, 2.5 cm and 3 cm on his back. She said such patches could appear when there\n\nwas impact of a blunt injury. However, the Second Accused did not complain of any assault\n\nby the CNB officers at the time of his arrest. She also noted that the Second Accused had\n\na moderate fever of 37.8 degrees Centigrade and had complained of a mild sore throat. The\n\nnormal body temperature of an adult would be about 37 degrees Centigrade. She prescribed\n\nfor the Second Accused paracetamol for two days and lozenges for three days.29 Ms Chelvi d/o Thirunavukkaraju, a Customer Service Officer at\n\nSingtel, produced the Call Details Statement in respect of handphone number 96288793 (CPL\n\nFazuri’s handphone) for 1 and 2 May 2001. She had been served with a subpoena by\n\nCounsel for the First Accused, who later decided not to call her to testify. The\n\nProsecution decided to use her evidence in its case.",
        "THE TRIAL WITHIN A TRIAL": "30 The admissibility of two statements recorded by the Investigating\n\nOfficer, ASP Daniel Tan, on 9 May 2001 and on 15 May 2001 from the Second Accused was\n\nchallenged on the ground that they had been made as a result of inducement emanating from\n\nthe Investigating Officer. A trial within a trial was therefore conducted to determine\n\ntheir admissibility.31 The Investigating Officer testified that at about 2.52 am on 4 May\n\n2001, in the MIB, he weighed the drug exhibits in the presence of both Accused persons and\n\nthen instructed that the two Accused persons be sent for pre-statement medical\n\nexaminations.32 At about 3.37 am, he began the process of taking a statement under\n\nSection 122(6) of the Criminal Procedure Code from the Second Accused, who indicated that\n\nhe wished to speak in Malay. Ms Sofia Bte Sufri, an interpreter at the CNB, was therefore\n\nintroduced as the interpreter. At about 4 am, the Second Accused made a statement.33 At about 4.14 am, the process was repeated in the case of the First\n\nAccused and a statement under Section 122(6) of the Criminal Procedure Code was made at\n\nabout 4.36 am by the First Accused through the interpretation of Ms Sofia. All subsequent\n\nstatements of both persons were recorded with the assistance of Ms Sofia.34 On 8 May 2001, between 2.50 pm and 4.10 pm, the Investigating\n\nOfficer recorded a long statement from the First Accused. On 9 May 2001, between 11 am and\n\n12.15 pm, he recorded a long statement from the Second Accused.35 On 15 May 2001, between 11.25 am and 12.10 pm, the Investigating\n\nOfficer recorded a further statement from the First Accused after having the earlier\n\nstatement of 8 May 2001 read to the First Accused. Between 4 pm and 4.55 pm that day, he\n\nalso recorded a further statement from the Second Accused after the Malay interpreter had\n\nread the statement of 9 May 2001 to the Second Accused.36 The Investigating Officer asserted that no threat, inducement or\n\npromise was rendered to either of the Accused persons before or during any of the\n\nrecording sessions. He added that the pager number mentioned by the Second Accused in his\n\noral statement at the time of his arrest was traced to one Mohd Zainin Bin Taib but the\n\npager was apparently used by another person called Mohd Dawood Bin Johari whom the CNB was\n\nunable to locate.37 Under cross-examination by Counsel for the Second Accused, the\n\nInvestigating Officer said the Second Accused did not ask for food or drinks during the\n\nrecording of the statement on 9 May 2001. The Second Accused appeared alert and was able\n\nto answer coherently. He did not look sickly and did not complain about feeling unwell. If\n\nhe had done so, the Investigating Officer would have sent him to see a doctor. It was not\n\nthe practice to send accused persons for pre-statement and post-statement medical\n\nexaminations in the case of long statements.38 The Investigating Officer agreed that the Second Accused did\n\ncomplain about not feeling well on 9 May 2001 but that was at about 1.40 pm, way after the\n\nrecording concluded at about 12.15 pm. The Investigating Officer received a call from the\n\nCID lockup informing him that the Second Accused complained that he was not feeling well.\n\nSometime after 2 pm, he proceeded to the lockup to see the Second Accused and asked him\n\nwhether he would like to see a doctor but he refused. He then asked the Investigating\n\nOfficer for two Panadols. They were given to him later. As far as the Investigating\n\nOfficer could recall, the Second Accused did not mention having a toothache. He only said\n\nhe was having a slight fever. There was no further complaint from the Second Accused after\n\nthe two Panadols were given to him. The Investigating Officer did not know whether the\n\nSecond Accused had some teeth extracted at the Queenstown Remand Prison a few weeks after\n\n9 May 2001.39 The Investigating Officer was unable to comment on the conditions\n\nand the situation in the CID lockup where the Second Accused was remanded.40 The Investigating Officer disagreed that he had told the Second\n\nAccused at the start of the interview that if the Second Accused cooperated with him, he\n\nwould be given a lighter sentence. He was satisfied that the 9 May 2001 statement by the\n\nSecond Accused was truthful as the sequence of events tallied with the version of the\n\narresting party and that of the First Accused although there were some discrepancies where\n\nthe details were concerned.41 By the time the 15 May 2001 statement was taken from the Second\n\nAccused, he had been transferred to the Police Cantonment Complex lockup. He was not\n\nallowed any visitors as the investigations were still incomplete. At the recording of that\n\nstatement, the Second Accused did not appear depressed or tired or unwell and did not\n\ncomplain to the Investigating Officer about any illness. One of his hands was handcuffed\n\nto the chair he sat in during the recording. He did not ask for food or water. He did not\n\nask for cigarettes but that was after the conclusion of the statement.42 Asked why the 9 May 2001 statement was read to the Second Accused\n\nbefore the further statement was taken, the Investigating Officer replied that it was to\n\nrefresh his memory as well as to confirm the facts in the earlier statement. The 15 May\n\n2001 statement was primarily to obtain some statistics required by the CNB, such as the\n\nSecond Accused’s family background. He disagreed with the suggestion that the only\n\nreason the 15 May 2001 statement was recorded was because he wanted another positive\n\nstatement from the Second Accused. He also disagreed that he had offered the same\n\ninducement alleged, i.e. that the Second Accused would be let off with a lighter sentence\n\nif he cooperated with the Investigating Officer.43 The Investigating Officer reiterated that the Second Accused did not\n\ngive him any reason why he was not in the right frame of mind to give the statements.\n\nThere was no urgency in recording the 9 May 2001 and the 15 May 2001 statements at the\n\nstated times.44 Ms Sofia, the Malay interpreter, testified that there was no threat,\n\ninducement or promise made to the Second Accused by her or by the Investigating Officer in\n\nrespect of the two statements. The Second Accused appeared normal on both days and did not\n\nsay that he was unwell or was having a toothache or that he had not slept well the night\n\nbefore. It was the standard procedure to read to an accused person a previous statement\n\nmade by him before recording a further statement. She disagreed that the Second Accused\n\nhad requested to see a doctor during the recording of the 9 May 2001 statement. She also\n\ndisagreed that the Second Accused had asked for a cigarette during the recording of the 15\n\nMay 2001 statement. She could not recall whether one of his hands was handcuffed to the\n\nchair during the recording as the practice of the Investigating Officers differed in this\n\nmatter.45 The Second Accused testified in this trial within a trial, saying\n\nthat after his arrest on 3 May 2001, he was kept in custody in the CID lockup until 15 May\n\n2001. In the CID lockup, he was placed in a cell with five or six men. On 15 May 2001,\n\nafter his further statement had been taken that day, he was moved to the Police Cantonment\n\nComplex.46 The CID lockup was noisy as there was constant movement into and out\n\nof the cells. His cell was near the door of the lockup. The lights were turned on 24 hours\n\na day. His bed was a cement block. It was thus difficult to sleep well. Further, his\n\nfamily members were not allowed to visit him. He missed his family.47 For the statement recorded on 9 May 2001, the Second Accused was\n\nseated to the right of the interpreter with his left hand handcuffed to one of the arm\n\nrests of the chair he was seated in. They sat facing the Investigating Officer. No one\n\nwalked into the room during the recording. The Second Accused was not feeling well as he\n\ndid not have enough sleep. In addition, he was suffering from a toothache. He informed the\n\ninterpreter and the Investigating Officer about these matters but was told to give a\n\nstatement first. They would see what they could do after that. His request to see a doctor\n\nwas turned down.48 The Second Accused said that he was given an inducement before the\n\nrecording of the statement. The Investigating Officer told him that if he cooperated, his\n\nsentence for the offence would be reduced. That had an effect on him as he thought that he\n\nmight escape hanging. His statement was not voluntary as some things he said were not\n\nrecorded by the Investigating Officer. He also requested a cigarette after the interview,\n\nwhile waiting to be brought back to the CID lockup.49 At the CID lockup, he complained about not feeling well to the\n\nofficer in charge there and was subsequently given Panadol by the Investigating Officer.\n\nHe also complained about his toothache. His tooth was extracted at the Queenstown Remand\n\nPrison sometime after 15 May 2001.50 On 15 May 2001, the same three persons were in the room where the\n\nrecording of the further statement took place. They were seated in the same way as before.\n\nThe Second Accused was feeling tired due to lack of sleep and of food. His tooth also\n\nached. He was longing to see his family. He said so to the Investigating Officer and the\n\ninterpreter but the recording proceeded nonetheless. He was again told that if he\n\ncooperated and told them everything, his charge would be reduced to a non-capital one.\n\nAccordingly, he cooperated with the Investigating Officer.51 In cross-examination by the Prosecution, the Second Accused said he\n\ncould not remember when the toothache started but it was about four days after his arrest.\n\nHis tooth was extracted about three weeks after he was moved to the Queenstown Remand\n\nPrison. The ache was severe but everytime he complained about it, he was given Panadol\n\nwhich would alleviate the pain for a while. There was also waiting time before his\n\nappointment with the dentist. He agreed with the Prosecution that the extraction took\n\nplace on 4 July 2001.52 On 9 May 2001, he did request Panadol from the Investigating Officer\n\nduring the recording of the statement but was not given any then. He agreed that the\n\nInvestigating Officer attended to him promptly after his complaint in the CID lockup.53 He said he did not tell his Counsel that there were other things\n\nsaid by him during the recording which were not taken down by the Investigating Officer.\n\nIt did not occur to him to tell him so.",
        "THE DECISION OF THE COURT IN THE TRIAL WITHIN A TRIAL": "55 Where voluntariness of a statement is challenged, the burden is on\n\nthe Prosecution to prove beyond reasonable doubt that the statement was made voluntarily\n\nand not on the defence to prove on a balance of probabilities that it was not made\n\nvoluntarily. However, the Prosecution does not need to remove every lurking shadow of\n\ninfluence or remnants of fear (see the Court of Appeal’s decision inGulam bin\n\nNotan & Anor v PP[1999] 2 SLR 181).56 I had no doubt that the Investigating Officer and the interpreter\n\nwere telling the truth about the recording of the statements from the Second Accused on 9\n\nMay 2001 and on 15 May 2001. The interpreter had no interest in ensuring that any\n\nstatement was recorded. She said what she could remember and was candid about the fact\n\nthat she could not recall whether the Second Accused was handcuffed or not during the two\n\nrecording sessions. There was no particular reason why the Investigating Officer should\n\ninsist on recording a statement on those two days if the Second Accused was unwell then.\n\nIndeed, it would be foolhardy for the Investigating Officer to do so on 15 May 2001\n\nknowing that the Second Accused had already informed someone at the CID lockup that he was\n\nunwell after the recording session on 9 May 2001. If the Second Accused was unwell in any\n\nway before the recording on those two days, it was strange that he did not tell the\n\nofficers at the CID lockup before he was brought to meet the Investigating Officer.58 There was nothing sinister in reading a previous statement or\n\nstatements to an accused person. I would have thought that was fair play on the part of\n\nthe Investigating Officer. If the Investigating Officer wanted to induce \"another\n\npositive statement\", why bother to even read a previous statement to the Second\n\nAccused? He could just as well have told the Second Accused, \"This is what I want to\n\nhear from you and if you will sign such a statement, your charge will be reduced\",\n\nthereby saving himself and the interpreter a lot of time and effort.59 I rejected the Second Accused’s evidence about the recording of\n\nthe statements on those two days. The issues of alleged lack of food and omission by the\n\nInvestigating Officer of matters mentioned by him were not even canvassed in the\n\ncross-examination of the Investigating Officer and the interpreter. What the Second\n\nAccused experienced in the CID lockup might not be the same conditions of home but I was\n\nsatisfied that he had not been deprived of food or of sleep, at least not to the extent\n\nthat he was in no mental state to comprehend what was going on during the recording of the\n\nstatements. Medical attention would have been accorded to him should he have requested to\n\nsee a doctor at any time. I accepted the evidence of the Investigating Officer and the\n\ninterpreter that the Second Accused did not appear at all ill at the recording sessions\n\nand said nothing about feeling unwell or being unable to carry on with the statements at\n\nany time. His tooth problems featured only after the recording of the two statements in\n\nissue. The deprivation of family visits was necessary in the circumstances. I was also\n\nsatisfied beyond reasonable doubt that no inducement or promise of any sort was extended\n\nto the Second Accused in respect of the two statements.60 Accordingly, I ruled that the two statements were voluntary ones and\n\nadmitted them in evidence.",
        "THE TRIAL PROPER CONTINUES": "61 The First Accused did not challenge the admissibility of the\n\nstatements made by him. His statement made pursuant to Section 122(6) of the Criminal\n\nProcedure Code was as follows:\"I do not admit. The ganja does not belong to me. It was Rabu who\n\n  collected the ganja while I was in the car. Rabu came into the car with a plastic bag and\n\n  handed it to me. I then handed over the plastic bag to the person sitting beside the\n\n  driver of the car.\"62 The First Accused’s statement of 8 May 2001 was as follows:\"I am known as \"Daud\" to family and my friends.2 On 2ndMay 2001 at about 2.45 pm, while I was at my\n\n  sister’s food stall at the coffeeshop in Six Avenue, my friend Bob was talking on the\n\n  public phone (4688965) with Boy. I overheard Bob telling Boy \"Cakap sama gua punya\n\n  brother.\" I knew that Bob was referring to me as he addressed me as Abang Daud. I\n\n  knew Bob when we reported for our urine test at Tanglin Police Station. Bob then passed\n\n  the telephone to me. Boy asked for my name. I told him to address me as Abang Daud. I\n\n  asked Boy what was the matter. Boy told me that he wanted a large amount of ganja. He\n\n  wanted me to look for the ganja for him. I told Boy to give me his handphone number. He\n\n  gave me his handphone number as 96288793. I then told Boy that I would contact him at\n\n  about 6.30 to 6.45 pm. I then hang up the phone at about 3.15 pm. At about 6.30 pm, I\n\n  contacted Boy on his handphone. I told him I can get the ganja for him. I told him that I\n\n  would confirm the deal the next day at about the same time.3 On the next day (3rdMay 2001), I contacted Boy at about\n\n  6.45 pm on his handphone at the coffeeshop. Rabu was also at the coffeeshop with me. I\n\n  told Boy that I would talk to the seller about someone wanting to buy ganja from him. I\n\n  told Boy to call me about 7 to 7.15 pm. I then hang up the phone. I then approached\n\n  Rabu’s table to talk to him. I told him that someone wanted to buy ganja. Rabu asked\n\n  how much. I then immediately contacted Boy and asked him how much ganja he wanted as the\n\n  seller was there. Boy said he wanted 5 kilograms of ganja. I then conveyed this to Rabu\n\n  who told me he was not able to supply 5 kilograms of ganja. I told Boy about this and\n\n  passed the phone to Rabu. Rabu then talk to Boy on the phone for about 10 minutes. I did\n\n  not listen to what Rabu said to Boy as I was sitting some distance away. Rabu passed the\n\n  phone back to me. Boy said that about 7.45 to 7.50 pm, his friend would come in a grey\n\n  car, SZA 5202, to pick Rabu and myself in front of the 7-11 store along Six Avenue. We\n\n  ended our call at about 7.25 pm. I then sat with Rabu and talk about the deal. At that\n\n  time, Rabu was alone. I asked him how much ganja Boy wanted. Rabu told me Boy wanted 2 and\n\n  a half kilograms of ganja and the price was $4,400/-.4 At about 7.45 pm, both Rabu and I proceeded to the place where\n\n  Boy’s friend would be picking us up. At about 7.50 pm, a grey car stopped in front of\n\n  the 7-11 store. I saw the licence plate and told Rabu that that was the car. Both Rabu and\n\n  I crossed the road and enter the car. I saw two male Malay in the car. I sat behind the\n\n  driver and Rabu sat behind the passenger. The passenger said that he has my commission for\n\n  helping Boy get the ganja. He did not tell how much was the commission. He then asked Rabu\n\n  for the direction. Rabu showed him the direction until we reach the vicinity of a\n\n  coffeeshop in Bukit Merah View. Rabu told me to wait in the car and then left the car. I\n\n  did not know where Rabu go to. A few minutes later, I saw Rabu carrying a plastic bag. I\n\n  pointed Rabu to the driver and he make a U turn to meet Rabu. Rabu entered the left side\n\n  of the car, passed the plastic bag to me, which I handed over to the passenger. The car\n\n  moved off at this juncture. A short distance away a red car blocked the car we were in. I\n\n  noticed Rabu opened the door and ran when he saw men coming out of the red car. I moved\n\n  towards the door that was opened by Rabu. I managed to get out of the car but was arrested\n\n  by CNB officers a few steps away. I was pushed to the ground and handcuffed. I suffered\n\n  some abrasions on my face and shoulder during my fall. I was told brought to a open space\n\n  where the 2 male Malay identified themselves as CNB officers by showing their warrant\n\n  cards. I did not see Rabu then. I was search and my identity card was seized from me. Two\n\n  officers recorded a statement from me at the open space. One spoke in English and the\n\n  other interpreted in Malay. I then signed the statement after it was read back to me in\n\n  Malay. After a short while, I saw some officers escorting Rabu towards us. I was asked to\n\n  sit down on the kerb while a few CNB officers stood guard over me. I saw the same 2\n\n  officers recording a statement from Rabu. We were then brought to a Police Station where 4\n\n  bottles of our urine samples were taken and sealed. We were told to deposit 2 bottles of\n\n  our urine samples into 2 different metal boxes.5 We were brought to another CNB office where the drugs were weighed in\n\n  our presence. I was told of the weight but I cannot recall now. I was then brought to see\n\n  a doctor at Alexander Hospital and then brought back to the office where I was served the\n\n  charge and I gave a statement. After which I was sent back to Alexander Hospital for\n\n  another medical check before I was sent to CID lock up.\"63 On 15 May 2001, the First Accused added the following:\"6 The previous statement recorded on 8.5.2001 was read back to me\n\n  in Malay.7 I wished to add that Rabu was the man who was arrested with me. I had\n\n  only came to know him at the coffeeshop for about 2 months. Rabu always hang around the\n\n  coffeeshop with his friends. They always talk about horses and Rabu always come down after\n\n  his working hours at about 5 pm. Rabu would come to the coffeeshop about twice a week. I\n\n  am not close to Rabu. We were just casual friends. I did not know that Rabu is selling\n\n  drugs. I just happened to ask him if he had drugs for sale because he was sitting alone.\n\n  By coincidence, Rabu had the drugs for sale.8 Boy had promised that he would give me a commission if I can help him\n\n  get the ganja. Boy did not tell me how much commission he was going to give me. He only\n\n  told me that he wanted 5 kilograms of ganja.9 In paragraph 2 of my previous statement, I promised Boy to get the\n\n  ganja for him because I wanted the commission badly.10 I have 11 or 12 siblings, but only 6 live in Singapore. All of them\n\n  had their own families and I only contact one of my cousins. The rest of my family had\n\n  lost contact with me when I went to prison in August 1997.\"64 The Second Accused said the following in his Section 122(6) of the\n\nCriminal Procedure Code statement on 4 May 2001:\"Amran asked me to follow him to Bukit Merah. At Bukit Merah View,\n\n  he told me to go to a void deck of a block of flat number 123 to meet someone and collect\n\n  a plastic bag from this person. I did as I was told. After that, I brought the plastic bag\n\n  into the car. When the car was intercepted, I realised that the driver was actually a CNB\n\n  officer and that the plastic bag contained ganja.\"65 The Second Accused’s statement of 9 May 2001 stated:\"I am known as \"Rabu\" to family and my friends.2 On 3rdMay 2001 at about 5 pm, I went to the Joo Heng\n\n  coffeeshop at Six Avenue to chat with my friends about horse racing. I was chatting with a\n\n  few of my friends and drinking coffee. Daud, who worked at a stall in the coffee shop,\n\n  came and approach me at 7 plus pm. Daud said that he had made a deal with someone and\n\n  there is a car coming to pick him up at between 7.45 to 7.50 pm in front of the 7-11\n\n  store. Daud asked me to come along. I do not know the reason why he asked me to come\n\n  along. I thought Daud was referring to something about horse racing, so I followed him. At\n\n  about 7.40 pm, I left the coffeeshop with Daud. We waited in front of the 7-11 store. At\n\n  about 7.50 pm, a grey car arrived. Daud told me to enter the car. There were 2 male Malay\n\n  in the car. They also asked Daud and me to enter the car. I sat behind the passenger seat\n\n  of the car while Daud sat behind the driver. The car moved off. Daud told the driver to\n\n  drive to Bukit Merah View. The passenger told us that he had brought the money with him.\n\n  Daud told me that we were going to Bukit Merah View to collect ganja. He did not tell me\n\n  the amount of ganja.3 We stopped along the road near Blk 123 Bukit Merah View at sometime\n\n  passed 8 pm. We waited in the car for about 10 minutes. During the 10 minutes, the\n\n  passenger told us to bring the ganja into the car. After which he would give us the money.\n\n  Daud pointed a male Malay, who was at the void deck of Blk 123 Bukit Merah View, to me and\n\n  asked me to collect the \"Barang\" from him. I understand \"Barang\" to be\n\n  ganja, but I did not know how much ganja I am supposed to collect from this man. I did as\n\n  I was told and left the car. I went up to the man and he led me to the staircase landing\n\n  between the second and third storey of the said block. I had not seen this man before.\n\n  When we were walking up the stairs, I asked the man what did he promise Daud. He said to\n\n  follow him up and nothing else. At the staircase landing, the man picked up a yellow\n\n  plastic bag from behind some rubbish and handed over to me. The man asked for his money. I\n\n  told him that Daud was in the car and asked him to follow me to the car. He refused. I\n\n  then told the man that Daud would pass the money to him personally. The man said that he\n\n  would wait at the void deck. I then walked back to the car, opened the door of the car and\n\n  passed the yellow plastic bag to Daud. Daud took the bag from me. The passenger asked me\n\n  to get into the car while he checked the content of the plastic bag. I then got into the\n\n  car. The car moved off and Daud passed the yellow plastic bag to the passenger. The\n\n  passenger then checked the content of the plastic bag and said confirm. Suddenly a red car\n\n  blocked our car and some men came out of the car. I saw one of the men carried a baton and\n\n  suspected that they were CNB officers. I opened the door and ran out of the car. I heard\n\n  someone shouted don’t run, we are CNB as I was running. I then felt someone pushed me\n\n  from behind and I fell towards a slope. I was then handcuffed. I was then brought to a car\n\n  park in a car. I saw a lot of CNB officers and a few cars there. I also saw Daud sitting\n\n  at the kerb near a car where the officers were opening the ganja for inspection. A\n\n  statement was then recorded from me by 2 officers in Malay. One officer asked me in\n\n  English while the other interpreted in Malay to me. The statement was then read back to me\n\n  in Malay and I signed after confirming that the statement is true and correct.4 We were then brought to the Turf Club quarters where Daud was\n\n  staying. The place was closed and we did not go into the building. We were then brought to\n\n  my house and a search was conducted, nothing was seized. We were then brought to Jurong\n\n  Police Station where 4 bottles of our urine samples were taken from us and sealed in our\n\n  presence. We were then brought to another CNB office in Outram Road. We then witness the\n\n  weighing of the ganja. I was told that the ganja was about 2.7 kilograms. I was then\n\n  brought to see a doctor for a check up at Alexandra Hospital. After that I was brought\n\n  back to the Outram Road Office where a statement was recorded from me. After the\n\n  statement, I was again sent back to the hospital for another check up and then I was sent\n\n  to CID lock up.\"66 His statement of 15 May 2001 continued as follows:\"5 The previous statement recorded on 9.5.2001 was read back to me\n\n  in Malay.6 Daud was the man who was arrested together with me. I got to know\n\n  Daud at the coffeeshop that I always go to. I always go to the coffeeshop 2 or 3 times a\n\n  week to look for horse racing tips among the people there. There are a lot of stable boys\n\n  at the coffeeshop. On the day of arrest, Daud asked me if I can get any ganja for him. I\n\n  told Daud that I can try to get for him. At about 7.15 pm, Daud asked me to talk to a male\n\n  person, Boy, on the phone. Boy spoke to me in Malay and asked me if I can get the ganja\n\n  for him. I said I would try to get for him. Boy asked me to try and get 3 kilograms of\n\n  ganja for him at a price of S$5000. I contacted Daud, someone whom I had met on my Batam\n\n  trips, and asked him if he had 3 kilograms of ganja for sale at the price of S$5000. He\n\n  told me that he would check and called me later. Daud called and informed me that he only\n\n  had 2 and a half kilograms of ganja and he wanted $4400 for it. I then told Daud and he in\n\n  turn informed Boy about it. Boy agreed and we proceed as arranged. Boy told Daud that he\n\n  would give a commission to him. Daud told me about the commission and promised to share\n\n  with me. I do not know how much is the commission. I was also promised commission for\n\n  introducing the business to the other Daud.7 I am now telling the truth as I am having nightmares in the lock up.8 I am married with 2 daughters. My wife, Sarai Bte Ali Mohd, is\n\n  working as a production clerk. My elder daughter working as in a 7-11 store. My younger\n\n  daughter is still studying. My parents are both no longer around. I had 7 siblings. All my\n\n  siblings are married and staying with their own families. I still kept in regular contact\n\n  with my siblings.\"67 Cross-examined by Counsel for the Second Accused, the Investigating\n\nOfficer said the Second Accused’s statements were narrative in nature with some\n\nquestions asked by the Investigating Officer. He was not conversant in Malay and recorded\n\nwhatever the interpreter said to him. He did not omit or add anything or refuse any\n\namendments requested by the Second Accused.",
        "THE FIRST ACCUSED’S DEFENCE": "68 The First Accused used to live in the Bukit Turf Club quarters. At\n\nthe time of his arrest, he had no home. He would sleep at void decks or in a lorry.69 His testimony was essentially the same as his statements of 8 May\n\n2001 and of 15 May 2001. He added that Boy had promised him a commission for the drug\n\ndeal. In the CNB undercover car at Bukit Merah View, while they were waiting for the\n\nSecond Accused who had alighted, the First Accused asked the front seat passenger whether\n\nBoy had passed the commission to him. He said he had and pointed to something in an\n\nenvelope. He said he did not know how much money Boy had put in it.70 When the Second Accused returned, he handed the plastic bag to the\n\nFirst Accused who in turn handed it to the front seat passenger in the CNB undercover car.\n\nIt was only when that person opened the package that the First Accused knew it contained\n\nganja because of the smell. That person then tied the plastic bag and said to the Second\n\nAccused that the envelope he was holding contained the $4,400 for the ganja. He also told\n\nthe First Accused that his commission was in another envelope. He then asked the First\n\nAccused where he would be going to from Bukit Merah View. The First Accused told him to\n\nreturn to Sixth Avenue. The envelopes were not handed over.71 At the Delta Swimming Complex carpark after the arrest had been\n\nmade, he told the two CNB undercover officers that they had set him up. After the oral\n\nstatement had been taken and before he was brought to the Jurong Police Station, a CNB\n\nofficer offered him a piece of tissue paper to wipe the blood from his face but the First\n\nAccused declined it.72 He said he told the Investigating Officer the truth on 8 May 2001\n\nwhen his long statement was recorded. On 15 May 2001, he had nothing to add and so told\n\nthe Investigating Officer that his statement was the same as the one made on 8 May 2001.\n\nHe asked the Investigating Officer whether he could smoke and was told he could not\n\nbecause the place was air-conditioned.73 In cross-examination by Counsel for the Second Accused, the First\n\nAccused said he knew the Second Accused for about two months. He saw the Second Accused at\n\nthe said coffeeshop where he met the stable boys living at the turf club’s quarters.\n\nHe and the Second Accused were casual friends only.74 The Second Accused did not know Bob. The First Accused met the\n\nSecond Accused at the coffeeshop on 2 May 2001 at about 8 pm or later. It was not a\n\nprearranged meeting. There was no one else called Abu. People at the coffeeshop called the\n\nSecond Accused Abu.75 When the First Accused called Boy on 3 May 2001 at about 6.45 pm\n\nfrom the public telephone at the coffeeshop, the Second Accused was not there. He told Boy\n\nhe had the ganja he wanted and to call back between 7 pm to 7.15 pm as he was then busy\n\ncollecting and washing the dishes at the coffeeshop.76 Boy did not call. The First Accused called Boy again at about 7.20\n\npm and asked him whether he would be coming to fetch him. Boy asked whether he had got 5\n\nkg of ganja. The First Accused then told the Second Accused, who had arrived at the\n\ncoffeeshop, that Boy wanted 5 kg of ganja. The Second Accused said he could not get 5 kg.\n\nThe First Accused relayed the message to Boy and then suggested that Boy talk to the\n\nSecond Accused direct. The Second Accused then spoke to Boy over the telephone.77 The First Accused maintained that it was the Second Accused who\n\ndirected the CNB undercover officers to Bukit Merah View and told them where to stop. He\n\nagreed that when they first met the undercover officers near the 7-Eleven store, the\n\nSecond Accused did not speak to them at all. In the car, the Second Accused told the front\n\nseat passenger his name was Abu. While in the car, the First and the Second Accuseds did\n\nnot speak to each other..78 The First Accused then added that Boy had earlier promised him both\n\na commission and a handphone.79 In cross-examination by the Prosecution, the First Accused said that\n\nwhen he approached the Second Accused on 2 May 2001 to tell him that someone wanted ganja,\n\nthe Second Accused warned him to be careful about that person. The Second Accused did not\n\nask the First Accused how much ganja that person wanted. He only asked that question on 3\n\nMay 2001. The First Accused said he did not speak to Boy on 2 May 2001 at about 8 pm to\n\nsay that he was able to obtain the ganja. He did so only on 3 May 2001. On 2 May 2001, he\n\ndid not offer Boy 3 kg of ganja for $6,000 and neither was there any bargaining by Boy to\n\nreduce the price to $5,000. He disagreed that he then handed the telephone to the Second\n\nAccused because he could not agree on the price with Boy. By the time the Second Accused\n\nconcluded the conversation with Boy over the telephone, the First Accused had gone to\n\nBukit Batok where he slept at the void deck. The meeting on 3 May 2001 with Boy’s men\n\nwas arranged with Boy specifying the time and the First Accused stipulating the venue. The\n\nFirst Accused had already confirmed the plan with the Second Accused which was that they\n\nwould lead the buyer to another place for the drugs to be delivered. Before they got into\n\nthe undercover car, the First Accused asked the Second Accused how much drugs they had and\n\nthe Second Accused told him that he had 2.5 kg and the price was $4,400. The First Accused\n\nthen said that on 2 May 3001, the Second Accused told him that he had got the ganja but\n\nasked him whether it was a genuine customer or not.80 The First Accused agreed that when the Second Accused got out of the\n\nundercover car at Bukit Merah View, he knew that the Second Accused was going to collect\n\nthe ganja. He knew that the plastic bag contained the drugs even before the CNB officer\n\nopened it. He disagreed that while they were waiting for the Second Accused in the car, he\n\nhad told the CNB officers that the stuff was wet and therefore good. When they were\n\nintercepted, he knew immediately that CNB officers were in the other car. He added later\n\nthat he knew they were CNB officers when they went after the Second Accused.81 When asked by the Court later about his 8 May 2001 statement, the\n\nFirst Accused agreed that he had forgotten he spoke to Boy twice on 2 May 2001. He added\n\nthat the stall holder whom he worked for was not his blood sister but someone whom he\n\nregarded as a sister. He was educated up to Primary 6 in a Malay school here. He worked as\n\na stable boy before. He said he admitted \"the wrongdoing\" and \"the\n\nmistake\" he had made but maintained that he was not involved in drug trafficking or\n\nconsumption of cannabis.",
        "THE SECOND ACCUSED’S DEFENCE": "82 The Second Accused lived in Bukit Batok and worked as a part time\n\nmover. He is married with two daughters.83 He testified that he had never used the name Abu. He went to Batam\n\nalone for the May Day holidays on 30 April 2001 and returned to Singapore on 2 May 2001,\n\narriving at the World Trade Centre at about 8 pm. He had a mistress in Batam. He then went\n\nto the hawker centre at the World Trade Centre to have his dinner until around 8.35 pm or\n\n8.40 pm. He then walked to the bus interchange and took a bus home. He did not speak to\n\nBoy at all on 2 May 2001.84 The next day, 3 May 2001, he was at the coffeeshop in Sixth Avenue\n\nat sometime past 5 pm. He would go there two or three times a week to get tips about\n\nhorses from the stable boys who gathered there. He received a call asking for the First\n\nAccused and he told the caller to call later as the First Accused was not there. The First\n\nAccused arrived at the coffeeshop at about 7.15 pm and did not speak to the Second Accused\n\nuntil after the First Accused had answered a telephone call.85 The First Accused told him that his friend would be coming in a car\n\nand asked him whether he wanted to go along to Bukit Merah View. He did not mention the\n\npurpose of going there. The Second Accused went along as he thought the First Accused\n\nwanted to talk to him about horses. They had talked about horses before. The First Accused\n\ntold him the registration number of his friend’s car. The Second Accused did not ask\n\nthe First Accused anything else.86 When the car arrived at the 7-Eleven store, the First Accused went\n\nup to it, introduced himself as Daud and asked the front seat passenger whether he was\n\nBoy’s friend. The Second Accused then told him that he was known as Rabu. The front\n\nseat passenger told them to get into the car and they did, with the First Accused seated\n\nbehind the driver and the Second Accused behind the front seat passenger. The First\n\nAccused then gave the directions to Bukit Merah View. The Second Accused did not speak to\n\nthe two CNB undercover officers during the journey there. The First Accused asked them\n\nabout the handphone that Boy promised him and the front seat passenger told him to speak\n\nto Boy about it personally. There was no talk about drugs.87 At Bukit Merah View, The First Accused told the officers to stop and\n\nasked the First Accused to do him a favour by going to the void deck of Blk 123 to collect\n\na plastic bag. When the Second Accused told him to go and get it himself, the First\n\nAccused said he needed to talk to the front seat passenger. The Second Accused asked the\n\nFirst Accused and the front seat passenger to go with him and collect the plastic bag but\n\nthey did not. Instead, the front seat passenger told the Second Accused to help the First\n\nAccused by collecting the plastic bag. So the Second Accused went alone to the void deck\n\nsince the First Accused was a \"normal friend\" whom he had known for two or three\n\nmonths. The Second Accused did not know what was inside the plastic bag. If he had known\n\nit contained drugs, he would not have agreed to take it. He was not offered any reward for\n\ncollecting the plastic bag.88 At the void deck, he met a man whom he had not met before and asked\n\nhim what he had promised to Daud. That man said it was not necessary for him to know and\n\nasked him to follow him to the landing between the second and the third floors. There, he\n\ntook a paper bag which contained a plastic bag from a heap of rubbish and handed it to the\n\nSecond Accused. The plastic bag was tied up and the Second Accused could not see what was\n\ninside.89 The man then asked him about money. The Second Accused told him he\n\ndid not know anything about that as it was not his business. The man then told him to send\n\nthe paper bag to the First Accused and then ask the First Accused to meet him at the void\n\ndeck.90 Back at the car, he handed the paper bag to the First Accused. The\n\nfront seat passenger told him to get into the car and he did. The car then moved off. The\n\nFirst Accused handed the paper bag to the front seat passenger who immediately opened the\n\nplastic bag inside. When he did so, the Second Accused smelled ganja and then realized\n\nwhat the contents were. He also heard the words \"barang bagus\" which meant ganja\n\nto him. He did not see any envelopes held up by the CNB undercover officers.91 When the other car intercepted the undercover car, the Second\n\nAccused saw a man carrying a baton coming out and, suspecting he was from the CNB,\n\nimmediately opened the car door and fled. He did so because it was a drug offence and also\n\nbecause he had smoked ganja while in Batam and his urine could still have traces of the\n\ndrug. The CNB officers might not believe his innocence in the matter if he was arrested.92 He was pushed from behind and fell onto the road. He saw the baton\n\ncoming at him and used his right hand to ward off the baton. It hit his right hand and\n\nbecause of the pain, he curled up his body and put both hands behind his head. His hand\n\nbecame swollen subsequently. He was also hit on his shoulder and at the back of his head.93 At the Delta Swimming Complex carpark, he told Insp Senthil Kumaran\n\nthat he did not know what was inside the paper bag.94 Later, at the Alexandra Hospital, he told both doctors there that he\n\nwas assaulted during the struggle with the CNB officers. He requested an X-ray for his\n\nright hand at the post-statement medical examination.95 In the 9 May 2001 statement, the Second Accused did not say anything\n\nabout \"ganja\" or \"barang\". They were inserted by the Investigating\n\nOfficer. He also told the Investigating Officer that he had been assaulted but that was\n\nnot recorded.96 In the 15 May 2001 statement, the words in paragraph 6 from \"On\n\nthe day of arrest, …\" until the end of that paragraph were not his. The\n\nInvestigating Officer wrote them himself and then had the statement read to him by the\n\nMalay interpreter. The Second Accused objected but the Investigating Officer forced him to\n\nsign the statement.97 In cross-examination by Counsel for the First Accused, the Second\n\nAccused maintained he knew nothing about the events at the coffeeshop on 2 May 2001 as he\n\ndid not go there.98 He had gone to the Kranji Turf Club with the First Accused before.\n\nPut to him that there was only one such occasion, the Second Accused said there were more\n\nthan one. They had also been to night clubs together and to other places which he could\n\nnot remember. He agreed that the First Accused did not tell him what sort of friend was\n\ngoing to pick him up on 3 May 2001 or that the friend wanted to discuss horses.99 He added that the First Accused pointed out the man in the void deck\n\nwhile they were in the undercover car at Bukit Merah View and told him his name was Ahmad.100 In cross-examination by the Prosecution, the Second Accused\n\nsurmised that the First Accused could have said that he was known as Abu because he wanted\n\nto push the blame to him. He maintained that he had not spoken over the telephone to Boy.101 The Second Accused said he knew he arrived at the World Trade\n\nCentre from Batam at about 8 pm because he had boarded the ferry at Batam at 7 pm and the\n\njourney took about 45 minutes. He agreed that he could also have arrived at about 7.30 pm.\n\nThe Prosecution then tendered a letter dated 30 October 2001 from the Singapore\n\nImmigration and Registration addressed to the CNB indicating that the Second Accused had\n\nleft Singapore on 30 April 2001 by sea and had re-entered by sea at 7.32 pm on 2 May 2001.\n\nThe Second Accused did not dispute the facts stated in that letter but said he would have\n\nneeded to take two buses from the World Trade Centre to Sixth Avenue and the journey would\n\ntake almost an hour altogether.102 He added that the First Accused had taken him out previously to\n\ntalk about horses although he could not recall when. He did not mention this when\n\ncross-examined by Counsel for the First Accused as it did not cross his mind then.\n\nSometimes, certain people would not like to talk in the open but preferred to talk in\n\nsecret in a car.103 When the Prosecution pointed out the fact that the level of the\n\nroad at Bukit Merah View was much higher than the void deck of Blk 123 and therefore the\n\nFirst Accused could not have pointed out Ahmad at the said void deck to the Second Accused\n\nwhile the car was stopped there, the Second Accused replied that the First Accused did so\n\nbefore the car arrived at the spot where it stopped. Asked how he managed to know\n\nAhmad’s pager number (which he mentioned in his oral statement to Insp Senthil\n\nKumaran), the Second Accused said that the First Accused had told him that if Ahmad did\n\nnot believe that he was sent by him, he was to tell Ahmad that pager number.104 The Second Accused was suspicious when he saw Ahmad retrieving the\n\npaper bag from the rubbish heap and that was why he asked Ahmad what was he trying to do\n\nto which Ahmad replied that there was no need for him to know, just give the paper bag to\n\nthe First Accused. The Second Accused was in a hurry and wanted to take the paper bag and\n\nleave. He had been told by the CNB undercover officers to hurry as the car was stopped at\n\nthe roadside. He added that he did tell the First Accused when he returned to the car that\n\nAhmad was waiting for him at the void deck. He forgot to mention this fact in his\n\ntestimony earlier.105 He signed the 15 May 2001 statement although it was made up by the\n\nInvestigating Officer as he was told it was only a charge and he could explain further in\n\nCourt. Being a person under arrest, he had no choice. The Investigating Officer also told\n\nhim that if he signed, he could reduce the charge to a non-capital one. Although he had\n\nmaintained he was not involved in drug trafficking, he thought the Investigating Officer\n\nwanted to charge him for drug consumption.",
        "THE DECISION OF THE COURT": "106 The First Accused’s version of the events coincided materially\n\nwith the Prosecution’s evidence save for his assertions that he was seated behind the\n\ndriver in the CNB undercover car and that it was the Second Accused who directed the\n\nundercover officers to Bukit Merah View in the evening of 3 May 2001. In the circumstances\n\nof this case, those discrepancies were not material to the charge. In any event, I\n\naccepted the Prosecution’s evidence that the First Accused did give the directions.\n\nHis only defence appeared to be that the cannabis did not belong to him and that it was\n\nthe Second Accused who knew the source of the drugs. However, ownership of the cannabis\n\nwas not a necessary ingredient in a trafficking charge.107 It was clear the First Accused knew he was involved in a drugs deal\n\nand that, upon the drugs being delivered successfully to the intended buyer, he would get\n\na commission in cash or in kind or both. There was no question of lack of knowledge of\n\nwhat was in the yellow paper bag that the Second Accused brought back to the undercover\n\ncar at Bukit Merah View. It was immaterial to the First Accused whether the said bag was\n\nfirst passed by the Second Accused to him and then from him to CPL Nabil or it was given\n\ndirectly by the Second Accused to CPL Nabil. Either way, the First Accused clearly knew\n\nthe nature of the transaction and participated in it fully. He was in fact the first link\n\nin the chain between the buyer and the seller of drugs. Even if he had been lured into the\n\nillegal deal by an agent provocateur, the evidence showed that he played an active role\n\nwillingly and for good reason. In his own words (in paragraph 9 of the 15 May 2001\n\nstatement), he \"wanted the commission badly\".108 The Prosecution’s case against the First Accused was therefore\n\nproved beyond reasonable doubt.109 I accepted the First Accused’s evidence relating to the\n\ninvolvement of the Second Accused in the drugs transaction. Even though the First Accused\n\nwas an accomplice, his testimony did not seek to push the blame away from himself. There\n\nwas also no reason whatsoever for him to implicate the Second Accused if the latter was\n\nnot involved in the deal. Clearly, the Second Accused was the \"Abu\" in question.110 As indicated in the trial within a trial, I rejected the Second\n\nAccused’s assertions that his long statements had been given involuntarily. In the\n\ntrial proper, the Second Accused sought to exclude the incriminating portions of the\n\nstatements by alleging that the Investigating Officer had inserted them into the\n\nstatements despite his protests. I had no doubt that these allegations were spurious. He\n\nhad not even alluded to this alleged egregious conduct of the Investigating Officer in the\n\ntrial within a trial. There, he had only said that the Investigating Officer refused to\n\ninclude certain things which he had mentioned and not that the Investigating Officer was\n\nforcing words into his mouth. I had no doubt that the Investigating Officer did no\n\nsubtraction and/or addition where the Second Accused’s statements were concerned.111 The Second Accused sought to dissociate himself from the\n\nnegotiations of 2 May 2001 by saying that he was not at the coffeeshop that evening and\n\ncould not have been there between 8 to 9 pm in any event as he had arrived from Batam at\n\nabout 8 pm and was having his dinner near the World Trade Centre until about 8.40 pm. He\n\nhad no choice but to agree with the Singapore Immigration and Registration document that\n\nhe had disembarked at World Trade Centre terminal at 7.32 pm on 2 May 2001. That would\n\ngive him ample time to travel by taxi to Sixth Avenue and to arrive there at about 8 pm.\n\nIn any event, I accepted the First Accused’s evidence that the Second Accused was at\n\nthe coffeeshop that evening and that he did talk to Boy over the telephone there.112 It was incredible that the Second Accused, a fully grown up man,\n\nwould agree to go along with the First Accused to Bukit Merah View with people he had\n\nnever met before without even first enquiring about the purpose or the length of time they\n\nintended to stay there. It was even more absurd that he would then sit silently in the car\n\nwithout knowing what was going on. Why was there no talk about horses? Obviously, his\n\nconduct was much more consistent with someone who knew the purpose of that trip. He was\n\nsilent because he needed no answers from anyone about what the outing was all about.113 Both the undercover officers and the First Accused said that the\n\nSecond Accused had alighted at Bukit Merah View without being told to do so by the First\n\nAccused. Clearly, the Second Accused knew where he was going to, whom he was going to meet\n\nand what he was going to pick up. The Second Accused’s conduct in bolting from the\n\nundercover car immediately upon interception by the other car also showed quite clearly he\n\nknew he was handling drugs. I was satisfied that the injuries he suffered were the result\n\nof his violent struggle in resisting arrest and not the consequence of assault by the CNB\n\nofficers who were doing nothing more than to subdue him and secure his arrest. In any\n\nevent, the Second Accused was not relying on the alleged assault as a factor influencing\n\nthe admissibility of his statements.114 The totality of the evidence put it beyond reasonable doubt that\n\nthe Second Accused was deeply involved in the cannabis deal and had played a key role in\n\nit after the initial introduction by the First Accused.115 The First Accused’s statements and oral testimony clearly\n\namounted to confessions of his guilt. Pursuant to Section 30 of the Evidence Act, as\n\nexpounded byChin Seow Noi & Ors v PP[1994] 1 SLR 135, they could be used as\n\nthe basis for convicting the Second Accused. However, there was ample evidence in any\n\nevent to support his conviction apart from the First Accused’s confessions.116 I therefore found both Accused persons guilty as charged and\n\nconvicted them accordingly. As the amount of cannabis involved exceeded 500 grammes, I\n\npassed the mandatory death sentence on both of them.Sgd:TAY YONG KWANGJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}