{
    "case_title": "Shia Kian Eng (trading as Forest Contractors) v Nakano Singapore (Pte) Ltd",
    "ncitation": "[2001] SGHC 68",
    "coram": "Judith Prakash J",
    "sections": {
        "Issues relating to Forests claim": "1. What form did the various sub-contracts between Nakano and Forest take?8. Forest and Nakano agree that there was no single sub-contract which covered\n\nthe works to be carried out by Forest in relation to the project. They differ, however, as to the\n\nform which the various sub-contracts took. Forests position is that these were made partly\n\norally, partly in writing and partly by conduct. Further, during the course of various sub-contract\n\nworks, Forest had, pursuant to either written or oral requests from Nakano, carried out additional\n\nand variation works. With reference to the Purchase Orders which Nakano issued, Mr Shia does not\n\ndeny signing these Purchase Orders on behalf of Forest. His stand is that these documents were\n\nissued purely for accounting purposes and for processing payments to Forest. The conditions endorsed\n\non the Purchase Orders were not intended to be, and were not, incorporated as terms of the\n\nsub-contracts.9. Nakanos position is that the sub-contracts are wholly in writing and that\n\nthey comprise the Purchase Orders issued by Nakano and the various other documents mentioned in\n\nthose Purchase Orders. These additional documents varied depending on the sub-contract concerned.\n\nAll the Purchase Orders referred to the relevant quotation submitted by Forest. In addition, almost\n\nall referred to a document entitled Conditions of Sub-Contract and many referred to an Undertaking\n\non Hiring of Foreign Workers. The Purchase Order which has caused the most dispute relates to the\n\ncontract for block wall and external wall plastering and that referred, in addition to the documents\n\njust mentioned, to a document entitled Conditions of Purchase, to one entitled Bills of\n\nQuantity/Schedule of Rates and to Drawings.10. The Purchase Orders take a standard form. Each of them has a ten digit\n\nidentifying number. The first three digits of the identifying numbers of the Purchase Orders in\n\nquestion were all 800 and the court was informed that these digits were used to indicate\n\nPurchase Orders issued in the 1998 financial year whereas Purchase Orders issued in the following\n\nfinancial year bore the identifying digits 900. The first sentence of the first paragraph of\n\neach Order reads:We are pleased to issue purchase order to you for the undermentioned works\n\n  subject to the following Term and Conditions:That sentence is followed by various items including a description of the scope\n\nof work, the contract price, the maintenance period, the dates of commencement and completion and\n\nthe item payment terms which in each case was described as being 30 days. The second\n\nparagraph of each Purchase Order starts:Subject also to the following documents as annexed herewith which form an\n\n  integral part of this contract:(a) Conditions of Sub-Contract ...and thereafter there are further sub-paragraphs mentioning other documents\n\nincluding the relevant quotation submitted by Forest. The last sentence of the Purchase Order is in\n\nbold capital letters and states:PLEASE SIGN AND RETURN DUPLICATE COPY TO THIS OFFICE EARLY SO AS TO AVOID\n\n  DELAYED PAYMENT11. It is not in dispute that none of the Purchase Orders were issued before\n\nForest started work on any of the sub-contracts. Mr Shia testified that the sub-contracts arose out\n\nof negotiations between himself, Mr Hattori and Mr Ling based on the scope of work to be done and\n\nquotations that he had given to Nakano in June and July 1998. Also Forest had been requested to do\n\nmock-ups of the plastering works and, after these mock-ups were found to be acceptable, Forest had\n\nbeen instructed to start work by Nakanos representatives. The Purchase Orders were, according to\n\nMr Shia, nowhere in evidence at the time of these discussions or when he started work. They were\n\nonly given to him subsequently when he asked how payment was to be made. He was then told that the\n\nPurchase Orders had to be signed in order for him to receive payment. He therefore signed the\n\ndocuments purely for Nakanos administrative purposes.12. Nakano submitted that the Purchase Orders were sent to Forest on varying\n\ndates and that Mr Shia had ample opportunity to raise any objections he had to their terms. Mr Shia,\n\nhowever, did not raise any such objection. He signed all the Purchase Orders without seeking to vary\n\nany of the terms and conditions. As he did not indicate that he was unhappy with the terms or could\n\nnot agree to any of them, Nakano had no reason to believe that Forest did not consider itself bound\n\nby the terms of the Purchase Orders and the terms and conditions of sub-contract attached to them.\n\nWhen Mr Shia returned the signed Purchase Orders, it was reasonable for Nakano to assume that he had\n\naccepted their terms.13. Nakano submitted that by attempting to adduce oral evidence to contradict the\n\nwritten terms and conditions set out in the Purchase Orders, Forest had fallen foul of the parol\n\nevidence rule. I cannot accept this submission. Whilst once it is clear that a contract has been\n\nmade wholly in writing, parol evidence is not admissible to add to, vary, subtract from or\n\ncontradict the written terms, that rule does not apply when the issue to be determined is whether\n\nthe contract is wholly in writing or not. In such a case, the court is entitled to receive evidence\n\nwhether parol or otherwise of all the relevant circumstances in order to determine what sort of\n\ncontract came into existence.14. Forests stand is that as an acceptance of an offer can be made by conduct,\n\nin this case the sub-contracts had been constituted by Forests commencement of work on Nakanos\n\ninstructions and the only written documents that formed part of the sub-contracts were its amended\n\nquotations. In order to combat this submission, Nakano further submitted that even though the\n\nPurchase Orders were issued and signed after works had commenced, the conditions of sub-contract\n\nattached to them formed part of these sub-contracts and had a retrospective effect so as to make the\n\nconditions apply to things done earlier in anticipation of the conclusion of formal documentation.\n\nIt relied onTrollope & Colls Ltd. v Atomic Power Construction Ltd[1962] 3 All ER 1035\n\nwhich held that there was no principle of English law which provided that a contract could not, in\n\nany circumstances, have retrospective effect. In that case the defendants carried out civil\n\nengineering works for the building owner at the request of the plaintiff at a time when the parties\n\nwere still negotiating alterations to the tender. Parties only agreed on the form of general\n\nconditions of contract ten months after the defendants started work. The Court held that the\n\nconditions of contract were binding on the parties on the basis that they had been conducting their\n\ntransactions with one another for many months on the assumption that the contract would ultimately\n\nbe agreed on lines known to both the parties although the final form of various terms of the\n\nproposed contract were still under discussion. In that case the parties had assumed that when the\n\ncontract was made, ie when all the terms had been agreed in their final form, the contract would\n\napply retrospectively to the preceding transactions.15. In this case, it is not quite so clear that both parties had been in active\n\nnegotiation on the form of terms and conditions and had started work on the assumption that these\n\nwould eventually be agreed. The evidence given by Mr Shia was that his negotiations with Nakano\n\nrelated mainly to the type of work to be done and to the rates chargeable by Forest. Although Mr\n\nHattori asserted in his affidavit that he had told Mr Shia during one of these meetings that the\n\nfinal contract would be subject to Nakanos standard terms and conditions, there was no evidence\n\nthat, at any time prior to asking Forest to start work on the external plastering, Nakano had\n\nfurnished Forest with copies of its standard purchase orders and conditions of sub-contract. Even Mr\n\nHattori did not go so far as to assert that any of the wording of the conditions in the standard\n\nterms and conditions was discussed with Forest. Further, whilst Forest started external plastering\n\nwork in July, the Purchase Order for that sub-contract was dated 12 August 1998 and signed by Mr\n\nShia on 10 September 1998. Mr Shia in fact asserted that he did not receive it in August 1998 and\n\nthat it had been back-dated. He did not object to this, however, as he was anxious to receive\n\npayment and therefore concentrated on signing and returning the document as quickly as possible.16. It is difficult to accept Nakanos contention that Forests quotations\n\nwere accepted on the understanding that formal contracts would follow. Nakano had confirmed that it\n\nwas familiar with the practice in the construction industry of using letters of intent that would\n\nusually contain a provision indicating that a formal contract would follow. It conceded that it had\n\nnot issued any letter of intent in connection with this contract. As pointed out earlier, nor did\n\nits representatives give Forest a copy of its conditions of sub-contract for the latters\n\nconsideration. Whilst Forest probably would have expected a written acceptance of its quotations it\n\nwould not have expected to be inundated with contractual documents when it had not been given any\n\nsuch documents prior to commencing work. This would definitely be the case for those quotations\n\ntendered and accepted before 10 September 1998 when Mr Shia signed the Purchase Order for the block\n\nand external plastering works. Nakano could perhaps have argued in respect of the sub-contracts\n\nconcluded after 10 September 1998 (by which I mean those in respect of which quotations were\n\ntendered and work started after that date) that they were made on the basis of all the terms of the\n\nrelevant Purchase Orders including the conditions of sub-contract since after that date Forest would\n\nhave been aware that Nakano did have standard conditions of sub-contract that it wanted to apply to\n\nall its sub-contracts. Nakano has not, however, made any submission that distinguishes the position\n\nin relation to the later sub-contracts. This may be because it is mainly in relation to the\n\nsub-contract for the external plastering works that Nakano is anxious to persuade the court that the\n\nPurchase Order and its attachments formed the entire contract. The issue is not as important for the\n\nother sub-contracts. In any case since no such submission has been made, I must treat all the\n\nsub-contracts as having been concluded on the same basis.17. In my judgment, the sub-contracts were, as contended by Forest, partly in\n\nwriting and partly oral. The written portions of the sub-contracts comprised the quotations and the\n\noriginal Purchase Orders which Forest signed after commencing the work. It is significant that, as\n\nNakano pointed out, Mr Shia did not object to any of the terms relating to the works that appeared\n\non the face of the Purchase Orders. These were the items that had to be agreed in order for a\n\ncontract to exist and it is likely that the reason he did not object to them was that these terms\n\nreflected the prior discussions.18. The above holding, however, does not mean that Forest had agreed to accept as\n\npart of the contract all the documents that were annexed to the Purchase Orders or that the same\n\nwere incorporated in the contract simply by being mentioned in the Purchase Orders. I have already\n\nmentioned the difficulties with incorporating the conditions of sub-contract. As regards other\n\ndocuments, it should be noted that while the Purchase Orders mentioned these various documents as\n\nbeing annexed to them, not all the documents were in fact so annexed. For example, in the Purchase\n\nOrder relating to the external plastering works, among the documents stated as being annexed were\n\nSpecification and Drawings. It appears from Mr Lings evidence that these documents\n\nwere not in fact annexed. In his affidavit after listing the documents that had been forwarded under\n\ncover of the Purchase Order, he stated that the drawings had already been shown to Mr Shia and the\n\nspecifications were the ones which had been furnished to Nakano by one Mark Tung. It is difficult to\n\nincorporate as part of a contract documents which are not furnished (and not simply shown) by one\n\nparty to the other either prior to or at the time of signing of the contract unless there is clear\n\nindication by that other party that he would accept documents subsequently given as part of the\n\ncontract. This did not happen in this case.19. As regards the plastering contract, Nakanos position is that the\n\nmanufacturers brochure for the use of the proprietary cement product called Smartplas was\n\nincorporated as part of the sub-contract by the reference in the relevant Purchase Order to Specification\n\nin para 2(d) thereof. This brochure was sent to Nakano by the aforementioned Mark Tung, the vendors\n\nrepresentative. The brochure was not supplied by Forest nor was there any evidence that Forest had\n\nseen the same brochure that had been given to Nakano.20. Forest did not accept that the product brochure was incorporated as part of\n\nthe plastering sub-contract by mention of the word Specification in the Purchase Order. Forest\n\ndid accept that the brochure contained technical information but this in itself did not, Forest\n\nsubmitted, mean that the word Specification referred to that brochure. In fact there was a\n\ngreat deal of doubt over the precise meaning of the term as used in the Purchase Order.21. First, the persons in Nakanos quantity surveying department who prepared\n\nthe Purchase Orders had not seen, and would not know of the existence of, this Smartplas brochure.\n\nThey were not even aware that Smartplas was the product being used. Further, Nakano gave no evidence\n\nas to who gave the Purchase Orders to Mr Shia to sign and what he was told about documents at that\n\ntime. Mr Shia identified Ms Phyllis Leong as the person who handed the Purchase Orders to him but Ms\n\nLeong herself gave no evidence on the circumstances surrounding the preparation of the Purchase\n\nOrders or their submission to Mr Shia. So there was no evidence that when he received the Purchase\n\nOrder Mr Shia was informed that the Specification mentioned in that document referred to the\n\nSmartplas brochure or that the brochure was attached to the Purchase Order. Mr Hattori in his oral\n\nevidence also appeared to agree that the brochure had not accompanied the Purchase Order.22. That there was doubt as to what the word Specification meant was also\n\nevident from the oral testimony of Mr Ling. He conceded that that word may have meant either item 18\n\nof the specifications in the main contract dealing with plaster work or secondly, a separate set of\n\nspecifications that Nakano might have intended to specially prepare for the work to be carried out\n\nby Forest.23. In view of the confused position relating to the project brochure, I am not\n\nable to hold that it was incorporated as part of the plastering sub-contract between Forest and\n\nNakano. This does not mean, however, that the contents of the brochure are entirely irrelevant to\n\nthis case. Since the brochure contained information about the use of Smartplas, it might be relevant\n\nin considering whether Forests workers applied the product properly. It is not relevant, however,\n\nfor the purpose of considering what Forests contractual obligations consisted of.2. What is due to Forest in respect of work completed before termination?24. There is no dispute that Forest is entitled, in principle, to be paid for the\n\nwork that it had done prior to the termination of the contract. What is at issue is exactly how much\n\nis due to Forest. The parties have agreed on some items but there are still substantial disputes in\n\nthis regard.25. Forests original claim was for $2,794,744.61. Due to agreements before and\n\nduring the trial, by the time of submissions, Forests claim was reduced to $2,041,632.63\n\n(excluding GST). This sum comprised the unpaid balance for all the original works and variation\n\nworks carried out by Forest up to the date of termination. Forest derived this amount in the\n\nfollowing manner:(S$)(S$)(a)Agreed value of original sub-contract\n\n        works5,100,896.76(b)Agreed/Undisputed variation34,501.40(c)Disputed variation1,309,020.55Sub-total:6,444,418.71(d)Less: Previous payment4,402,786.08Balance:2,041,632.63=======26. It would be noted at once that the parties had agreed on the value of the\n\noriginal sub-contract works performed by Forest. The dispute over Forests payment entitlement is\n\nlargely centred on the variation works that Forest claims to have effected. Its original claim for\n\nvariation works was for $1,777,669.04. Due to agreements arrived at, the total sum now claimed for\n\nvariation works is $1,343,521.95. As shown in the table above, of this sum $1,309,020.55 is disputed\n\nby Nakano. There are eight items which make up this claim. I will deal with them separately.2.1 Extra over-thickness for external plastering27. In the original quotation for external plastering, Forest quoted a rate of\n\n$14 per square metre for plastering the internal walls and a rate of $15.50 per square metre for\n\nplastering the external walls. After discussion with Nakano, these rates were revised and the\n\nsubsequent quotation issued read, in relation to these items:Plaster  Internal Wall (8mm. plaster with skim coat) S$10.50/m- External Wall (10mm. plaster without skim coat) S$12.50/mIn each case, the words in parenthesis describing the thickness of plaster\n\nrequired had not appeared in the original quotation.28. Forests case is that in respect of the external walls, it was\n\ncontractually obliged to apply plaster only to a thickness of 10 mm. Its price of $12.50 per square\n\nmetre was based on this thickness of plaster being all that was needed for the external walls. The\n\nclaim for over-thickness is founded on the assertion that in order to provide a smooth and vertical\n\nsurface over an uneven concrete substrate, Forest found that it had to apply plaster that had a\n\nthickness greater than 10 mm. As a result, it incurred extra costs that it contends it should be\n\ncompensated for.29. Forest pointed out that originally Nakano had intended only to apply a skim\n\ncoat over the concrete substrate, not to apply plaster. As it turned out, however, Nakano was not\n\nable to achieve the smooth surfaces it had expected and therefore, as Mr Hattori agreed, it\n\neventually decided to use plaster to cover the uneven surfaces. Forest was not, however, informed\n\nthat this was the purpose of the plastering sub-contract.30. Prior to the application of the plaster, Forest was required to put in place\n\ncorner beads and level pegs. A mock-up was conducted to observe and approve its sequence of work and\n\nrepresentatives of Nakano and the developer were present to inspect the work carried out at the\n\nmock-up. The application of the plaster according to the alignment marked out and delineated by the\n\ncorner beads and level pegs was intended to ensure that the plastering work was sufficiently flat\n\nand smooth. In short, Forest submitted, the walls were not meant to remain uneven after plastering.\n\nIn the course of applying the plaster, however, it became clear that it was not possible to achieve\n\nthe flat and smooth plastered surface by applying only 10 mm of plaster owing to the non-verticality\n\nof the concrete walls and the introduction of groove lines.31. Forest pointed out that verticality reports prepared by Nakano itself\n\nindicated that the concrete walls were not vertical and had indentations and protrusions. During\n\ncross-examination, Mr Hattori conceded to deviations of up to 20 mm. Further, in some locations, the\n\nreports seem to show that there were deviations of up to 32 mm.32. In August 1998, Mr Shia approached Mr Ling at the site office and informed\n\nhim that the concrete walls were not vertical. At that time most of the blocks were roughly about\n\nfour storeys high. Nakano did not take Mr Shias comments very seriously. It considered that they\n\nwere a method of trying to obtain an increased rate for the external plastering. Mr Shia repeated\n\nhis observation of the non-verticality of the walls in a letter of 16 November 1998. This stated\n\nthat as a result Forest had had to lay plaster of a minimum thickness of 15 mm and, in many cases,\n\nhad laid plaster of 45 mm thickness. It put the average thickness of the plaster laid to that date\n\nas 25 mm and quoted a rate of $22.50 per square metre for the total thickness of plaster laid (ie\n\nthe original rate of $12.50 per square metre for the contracted thickness of 10 mm plus an\n\nadditional $10 per square metre for the over-thickness). Forest asked Nakano to issue it with a\n\nformal variation and confirmation of the new rate. As this letter was not responded to, a reminder\n\nwas sent a month later. That was ignored too.33. Forest submitted that Nakano should and could have made further\n\ninvestigations based on what Forest had told it. It further submitted that this was not done because\n\nNakano had decided that the application of over-thick plaster was a solution to deviations in\n\nverticality. Counsel pointed to a letter that Nakano had written to BBR in September 1999\n\ncomplaining about a slanting wall which BBR had not rectified and stating that Nakano would carry\n\nout rectification works by getting its plastering contractor to thicken the wall. When shown this\n\nletter, Mr Hattori agreed that he had decided by September 1999 that the solution to deviations in\n\nverticality was to apply extra-thick plaster. He also conceded that it was more expensive to rectify\n\nconcrete structures directly than to cover the unevenness with plaster. Mr Hattori maintained,\n\nhowever, that the concrete structure needed to be rectified only when the deviation was out of the\n\ntolerance and that in this case there had been no verticality problems.34. Nakano takes the position that Forests claim for the application of\n\nover-thick plaster is a fictitious one. It pointed out that Forest had not produced any records of\n\nthe thickness of plaster that was applied to the external walls. Nakano therefore submitted that\n\nthere was no evidence that Forest had in fact plastered an average thickness of 25 mm throughout the\n\nentire expanse of all the external walls or that such thickness was necessitated by the alleged\n\nnon-verticality of the walls. Nakano relied on the report that Mr CW Wong of SETSCO had prepared.\n\nThis gave an analysis of samples of plaster which had been extracted from the reinforced concrete\n\nwalls at different locations at the first storey level. According to the report, these samples\n\nshowed that the overall thickness of the plaster fluctuated widely from 8 mm to 28 mm. The number of\n\nlayers also varied: there were between one and three layers. Nakano used this observation to submit\n\nthat Forests claim that it had plastered three coats throughout the external walls was untrue. It\n\nshould be noted, however, that SETSCO took only seven samples from the external walls. In view of\n\nthe wide expanse covered by the external walls (the parties agreed that Forests work covered\n\n59,257.50 square metres of external wall), seven samples do not seem to me to be a sufficient number\n\nfor one to infer that the samples are, in relation to thickness, representative of the total work\n\ncarried out. Further, these samples were taken from the lowest level where the deviations in\n\nverticality, if any, would have been the least. No samples were taken from the higher levels where\n\ndeviations in verticality would have increased.35. Nakano also relied on readings of plaster thickness taken by Insight\n\nSurveyors for each level of several blocks chosen at random. From these readings, it appeared that\n\nForest did not start with a minimum of 10 mm of plaster but started with 14 mm at the highest point.\n\nNakano submitted that this made it clear that the over-thickness applied by Forest was more the\n\nresult of poor supervision and workmanship than done to address any alleged verticality problem.\n\nNakanos position was that 10 mm was an average requirement rather than a fixed requirement and\n\nthat if Forest had started at 5 mm at the highest point it would only have had to plaster an average\n\nof 10.7 mm as demonstrated by the readings of one of the elevations of block 17. In the alternative,\n\nNakano submitted that if the court held that 10 mm was a fixed requirement, then the average\n\nthickness of the plaster would have been 15.7 mm.36. The results of the survey made by Insight Surveyors were exhibited in\n\nevidence. The survey covered one entire elevation of each of the 14 storeys of three of the blocks\n\nof the project and two entire elevations of a fourth block. This was a better sampling than that\n\ncarried out by SETSCO. It showed that the thickness of plaster applied at block 17 varied between 14\n\nmm and 20 mm. The average thickness of the plaster was 19.7 mm. For block 15, the thickness of\n\nplaster varied between 11 mm and 20 mm giving an average thickness of 14.4 mm. For block 9C, the\n\nthickness of the plaster varied between 14 mm and 24 mm giving an average thickness of 18.2 mm. For\n\nblock 9C, the thickness of plaster laid varied between 15 mm and 24 mm giving an average of 19.5 mm\n\nin thickness.37. I accept the submission made by Forest that they were required by the\n\nsub-contract to plaster a fixed quantity of 10 mm of plaster over the external walls. This appears\n\nto me to be the plain reading of the sub-contract. The depth of the plaster required was\n\nspecifically added to the original quotation. It was also specified that this depth had to be\n\nachieved without skim coat thus indicating that it was a specific depth that was wanted. If it\n\nhad been intended, as Nakano submitted, that this depth was to be an average depth, the word average\n\nwould have been inserted in the quotation. I also accept the evidence of Forest that due to\n\nunevenness and variations in verticality the actual thickness of plaster applied exceeded the fixed\n\nquantity. This evidence was supported by the verticality surveys carried out by Nakano itself and\n\nalso by the survey of Insight Surveyors. Mr Hattori made much of the fact that Forest did not start\n\nwith the alleged minimum plaster thickness of 10 mm at the highest point and also put forward an\n\nalternative method of plastering. His method was effectively discredited during cross-examination.38. I accept that due to variations in the verticality of the external walls and\n\ntheir unevenness Forest had to apply more than 10 mm of plaster to the walls in order to achieve an\n\neven and vertical effect. The difficulty that arises is in determining exactly how much extra\n\nplaster was applied. Forests claim is based on an average thickness of 25 mm of plaster being\n\napplied but this figure is not derived from records kept during the plastering work. There is no\n\nfull survey of the thickness of plaster applied to all the elevations of all 13 blocks. Insight\n\nSurveyors report, dealing with four full elevations taken from three blocks, showed an average\n\nthickness per elevation of 19.7 mm, 14.4 mm, 18.2 mm and 19.5 mm respectively.39. Forest derived its figures for the amount of plaster applied by calculations\n\nbased on the amount of Smartplas cement premix that it had purchased and had delivered to the site\n\nfor the purpose of the plastering works. Mr SF Wong, a professional quantity surveyor himself,\n\nagreed that a quantity surveyor can calculate a total quantity of premix required for a particular\n\njob if he knows what the material volume yield is. In this case, the volume yield of Smartplas, as\n\nobtained from the manufacturers brochure, was 0.6m per metric ton. Using this figure, Mr Jones,\n\nForests expert, computed the total volume of internal wall plastering that was applied by\n\nmultiplying the total quantity in metric tons by the yield per metric ton. In respect of the\n\nexternal walls, similar calculations were carried out by Forests quantity surveyor, Mr Manolo\n\n(who did not give evidence), and verified by Mr Choo. The calculations as such were not discredited\n\nby cross-examination. The issue that remains is whether I should rely on such calculations rather\n\nthan on physical measurements. I see no good reason not to accept the calculations since the\n\nquantity of plaster purchased was not challenged and the method of making the calculations was a\n\nvalid one. There was a point raised in court regarding possible wastage of the plaster during use\n\nbut I accept Forests submission that this wastage would have been diminis. Certainly no evidence\n\nwas adduced by Nakano to establish widespread wastage of plaster exceeding the 10% allowance for\n\nwastage already included in the calculations.40. Accepting that 25 mm of plaster, instead of the contracted 10 mm, was applied\n\nto the external walls, the next issue is at what rate Forest should be paid for the additional 15 mm\n\nof plaster. It has claimed $10 per square metre on the basis that its total cost for all 25 mm\n\n(including a profit element of 10%) was $22.50 and thus the cost of the extra 15 mm after deducting\n\nthe original price of $12.50 per square metre was $10 per square metre.41. Mr SF Wong suggested an alternative rate of $8.75 per square metre for the\n\nextra 15 mm of plaster applied. This was based on a calculation that to apply 25 mm of plaster would\n\ncost $21.25 per square metre if three layers of plaster were applied. If two layers of plaster were\n\napplied then the cost would be $16.25 per square metre. In either case, Mr Wongs calculation did\n\nnot include any figure for profit on the work. As Forest submitted, it would be entitled to a profit\n\nelement as part of its rate. It should also be noted that during cross-examination Mr Wong accepted\n\nthat two coats of plaster on top of the base coat would have to be applied in order to bring the\n\nthickness up to 25 mm. Thus, the material rate suggested by him would be $21.25 per square metre and\n\nnot $16.25 per square metre. If a profit element of 10% is added to $21.25, the total rate would be\n\n$23.375 which would be more than Forests claimed rate of $22.50 per square metre. Accordingly I\n\naccept Forests rate of $10 per square metre for the extra 15 mm of plaster.42. The next question is to what area this rate should be applied. In the course\n\nof proceedings, the parties agreed that the area of external walls worked on by Forest was\n\n59,257.50. They also agreed that Forest had worked on 5,551 square metres of walls in the lift\n\nlobbies. The issue here is whether the lift lobby walls should be considered as part of the external\n\nwalls for the purpose of this rate or whether they should be considered as part of the internal\n\nwalls to which a lower rate was applicable. The submission made by Nakano was that Forest had\n\ncarried out plastering and skim coating on the lift lobby walls and this activity was consistent\n\nwith classifying those walls as internal walls as, under the internal plastering sub-contract, skim\n\ncoating was required for internal walls. Further, since these walls were not exposed to the weather,\n\nthey should be classified as internal walls rather than external walls.43. Forest did not answer the above submissions. It appears to me that Nakanos\n\nargument is correct and since the lift lobby walls have little exposure to the weather, they should\n\nbe treated as internal walls. Further, there was no evidence on non-verticality of lift walls which\n\nwould have required correction by an application of thicker plaster. There is no need, therefore, to\n\ninclude the area of the lift lobby walls as part of the area for which Forest should be paid for the\n\napplication of extra thick plaster.44. Accordingly, the amount to be paid to Forest for the extra thickness of\n\nplaster applied to the external walls should be $10 x 59,257.50 ie $592,575. I award this sum to\n\nForest. It is payable in full and without any deduction for retention.2.2 Hacking to form keys45. Forest claimed $17,118.86 for hacking the concrete surface of the external\n\nwalls to form keys to assist in adhesion of the plaster to the substrate. Nakano disputed this claim\n\non the basis that it was part of Forests duty to do all that was necessary to ensure good\n\nplastering workmanship and that since the sub-contract for the plastering works was a supply and\n\ninstall contract, and as Forest claimed to be specialist plasterers, Nakano left it entirely to\n\nForest to carry out whatever preparation the latter deemed appropriate to ensure good workmanship.\n\nAny hacking which Forest did, therefore, formed part of its plastering costs and could not be\n\ncharged for separately.46. Forest argued that preparation of surfaces and actual plaster works were two\n\ndistinct items of work. This was reflected in the main contract between Nakano and the developer in\n\nthat the preparation of surfaces appeared under item 11 whilst the plaster works appeared separately\n\nas item 18. Further, item 11 specifically made it Nakanos obligation to hack off projecting fins\n\non the concrete work, to clean the concrete surface of dirt and incompatible materials and to\n\nthoroughly hack surfaces to form a key. The first two of the foregoing were not sub-contracted to\n\nForest but carried out by Nakano itself or through BBR. As Mr Hattori acknowledged in court, item 18\n\ndealing with plaster works said nothing about the formation of keys or the provision of a bonding\n\nagent.47. Mr Hattori tried to avoid the implications of the separate categorisation by\n\nstating that the main contract specifications with regards to plastering work were only relevant if\n\nconventional cement/sand plaster was used. Whilst it is true that the main contract envisaged\n\nconventional cement/sand plaster being applied, this does not mean that simply because a different\n\nplastering material is used hacking need not be separately specified if it is to be carried out by\n\nthe plasterer since, in any case, hacking does not appear as part of the item relating to\n\nplastering. Secondly, Forests contract was to supply and install not to design and build\n\nunlike the contract Nakano had. Although Forest suggested the premix material, the decision whether\n\nit should be used or not lay with Nakano and Nakano had therefore the obligation to determine what\n\nsort of surface was required for such material and who should provide the necessary surface.48. Forest submitted that hacking to form keys or the application of a bonding\n\nagent were components of work that must, as  matter of practice, be clearly specified. It\n\nrelied on Rule 15.04(b) of Standard Method of Measurement of Building Works (SMM Rules) which states\n\nthat any special treatment of a base (for example hacking, applying bonding agent) and the nature of\n\nthe surface finish should be given in each description or in the relevant sub-heading for the work.49. In this case, none of the sub-contract documents made express mention of any\n\nrequirement to form keys or provide a onding agent. Nakanos position was that since Forest had\n\nproposed the use of Smartplas, it had a duty to consider the specifications of that material and to\n\ncarry out such surface preparation as was stipulated to be necessary by those specifications. In\n\nrelation to this argument, as I have stated above, the ultimate decision as to whether Smartplas\n\nshould be used lay with Nakano. Nakano had overall design responsibility and therefore had to\n\nconsider how Smartplas would work in conjunction with the structural conditions found on site. It\n\nwould therefore be up to Nakano to determine whether hacking was required for Smartplas and, if so,\n\nto so specify in its contract with Forest. It would be noted also that according to the product\n\ninformation on the Smartplas brochure, that material only required a bonding agent or hacking to\n\nform keys if the thickness of plaster to be applied exceeded 12 mm. In this case, the specified\n\nthickness was 10 mm and therefore even if it was Forests obligation to consider hacking, Forest\n\nwould not originally have concluded that hacking was required.50. In my opinion, hacking was not included as part of the sub-contract. When\n\nNakano requested Forest to hack the concrete surface, it was issuing a variation instruction and\n\nwould therefore have to pay for the additional work done. Forests claim for this work amounts to\n\n$17,118.86. Nakano submitted that the claim was inflated and should only amount to $8,473.80 arrived\n\nat by using a rate of $0.99 per square metre. This rate was calculated using the same formula as\n\nForest did but replacing the skilled workers rate of $10 per hour with the general workers\n\nrate of $4.50 per hour plus 10% for profit. I accept this submission. Forest did not explain why\n\nskilled labour had to be used for hacking. I therefore award Forest $8,473.80 for its hacking work.2.3 Finishing of entrance canopy51. Forest originally claimed that it had finished nine entrance canopies and was\n\nentitled to be paid for this work as a variation. Nakano did not dispute that this was variation\n\nwork. It only disputed the number done. Forest subsequently conceded that it had done only six\n\ncanopies, as asserted by Nakano but continued to assert that it was entitled to more money than\n\nNakano was prepared to offer because it had not only plastered these canopies but had also laid\n\nblock walls, including corner beads and wire mesh, to the faade beam and walls of the entrance\n\ncanopies. Forest submitted that the rate for this item of variation work should not be based on the\n\nexternal plastering work rate of $12.50 per square metre (which would mean that it would receive a\n\ntotal of $5,318.25) but that it should be paid $2,970.48 for each canopy based on the materials\n\nsupplied and the labour charges involved.52. Nakano submitted that Forests claim of $2,970.48 per canopy was wholly\n\narbitrary since its original claim was $5,000 per canopy. Further it had claimed the same amount for\n\neach canopy even though these were of different sizes. Additionally, most of the work involved\n\nplastering and, even if the rate was doubled, the claim should not exceed $10,700.53. There was no evidence that the canopies were of different sizes. Mr Michael\n\nChoo gave evidence as to how the cost of $2,970.48 per canopy is arrived at. This was not challenged\n\nby Nakano in cross-examination. It is also true that Nakanos calculation did not provide for the\n\ncost of materials. There was no evidence to contradict Forests assertion that each canopy\n\nrequired 24 man days of labour. This component accounted for most of the cost of construction.\n\nAccordingly, I award Forest its full claim of $2,970.48 per canopy making a total of $17,822.88.2.4 Grouting around door frames54. This claim relates to grouting work done by Forest to the openings between\n\nthe door frames and block walls of the apartment units and of the lift lobbies. The total claim is\n\nfor $121,072 on the basis that Forest is entitled to receive $156 for each of the 696 apartment\n\nunits and $71 for each of the 126 lift lobby door frames. Nakanos position is that grouting\n\naround the doors was part of the negotiated price for internal plastering works.55. During cross-examination, Mr Ling admitted that grouting around door frames\n\nwas not in Forests sub-contract. This was a significant concession since as far as Nakano was\n\nconcerned, the normal sequence of work was to install the block wall first and then install the\n\ndoor. It was common ground that such a sequence of work would lead to gaps between the block wall\n\nand the door which would then require grouting. Under cross-examination, counsel for Nakano got Mr\n\nShia to agree that installing the door first and then the wall (which would eliminate the need for\n\ngrouting) was the old fashioned way of proceeding. Since Nakano knew that the walls were to be\n\ninstalled first and thus grouting would be required, it should have specified that the internal\n\nplastering included such grouting. Its failure to insert such a term in the sub-contract is\n\nsignificant.56. I find in favour of Forest in this issue and award it $121,072.2.4 Rectification of external walls57. This claim for $273,275 relates to work which Forest did to rectify debonded\n\nexternal plaster. It is Forests case that the debonded plaster resulted from Nakanos fault and\n\nwas not due to its own poor workmanship. Nakano alleges the opposite and has counterclaimed for its\n\nown cost of rectifying defective work. I will consider this issue when dealing with the\n\ncounterclaim.2.5 Filling in of gaps between door jambs and reinforced concrete walls58. Forest claims $11,616 for filling in the gaps between the lift door jambs and\n\nthe concrete lift shaft with lightweight blocks at block 19. Nakanos position is that Forest did\n\nnot do this work.59. Forests evidence in respect of this claim was given by Mr Koon. He stated\n\nthat, as far as he was aware, Nakano had instructed Forests site engineer, Mr Cai Yoa Zhong, to\n\ncommence these variation works. Further, some time in July 1999, he himself saw Forests workers\n\nat block 19 filling in the gaps between the lift door jamb and the concrete lift shaft. Mr Cai\n\nhimself did not testify.60. On the other hand, Nakanos witness Mr Quek testified that he did not issue\n\nany variation order to Forest to grout these gaps. He had considered getting Forest to do the job\n\nbut, as he had received poor report on their progress, he decided to award the work to another\n\nsub-contractor, Kow Sang Woodworks. He stated that Nakano had told Kow Sang Woodworks to go ahead\n\nand start the work in July 1999 and that a purchase order was issued for this purpose. The documents\n\nattached to Mr Queks affidavit showed that Kow Sang Woodworks quotation for these works (which\n\nprobably extended to all the blocks and not simply to block 19 as it did not contain any reference\n\nto any particular block) was dated 11 August 1999. Further, the purchase order issued by Nakano was\n\ndated 12 August 1999 and specified the date of commencement of work as 16 August 1999.61. It appears from the documents produced by Nakano that Kow Sang Woodworks was\n\nonly engaged in August 1999. No document has been produced to show that Kow Sang Woodworks did, and\n\nwas paid for, work at block 19. On the other hand, there is Mr Koons clear evidence that he saw\n\nForests workers doing such work at block 19 in July 1999 ie prior to the engagement of the other\n\ncontractor. I accept Forests submissions on this point and award it $11,616 as claimed.2.6 Extra over thickness of internal wall plastering62. The sub-contract provided that Forest would apply 8 mm of plaster to the\n\ninternal walls. The claim here arises from the contention that in fact Forest had to apply plaster\n\nthat was 10 mm thick on the areas of the block walls which were adjacent to the door frames in order\n\nto ensure that the door frames merged with the block walls and did not jut out. This was because the\n\ndoor frames were 120 mm wide whilst the block walls were 100 mm wide so that the door frames\n\nprotruded to the extent of 10 mm on either side of the adjacent block walls. An application of\n\nplaster that was only 8 mm thick would not have completely eliminated the protrusion.63. Nakano resisted Forests claim to be paid for the extra 2 mm of plaster\n\napplied around the door frames. Various objections were put forward. The first was that whilst the\n\ninternal wall plastering commenced in September 1998, it was only on 1 July 1999 that Forest\n\nmentioned that it had to provide an extra 2 mm of plaster adjacent to the door frames and that it\n\nwas incurring extra material costs. Further, the variation claim itself was only submitted in\n\nJanuary 2000. Secondly, Forest was trying to isolate the internal walls with door frames from the\n\nrest of the internal walls despite the fact that the sub-contract did not make such a distinction.\n\nNakanos position was that the 8 mm thickness specified in the sub-contract referred to an average\n\nof 8 mm. There would have been areas where the plaster thickness was less than 8 mm and therefore as\n\nlong as the average thickness of the internal plaster was 8 mm, Forest was not entitled to make any\n\nclaim for over-thickness. Thirdly, Nakano submitted that there was no evidence that Forest did\n\nplaster a 10 mm thickness throughout the wall. In any case, it was submitted that 2 mm was\n\nnegligible in terms of labour as well as the amount of plaster used when the sub-contract was\n\nconsidered as a whole.64. I do not find much merit in Nakanos submissions. My opinion is that the 8\n\nmm in the sub-contract referred to a fixed thickness and not an average thickness. This opinion is\n\nbased on a construction of the wording in the sub-contract. That is straight-forward with no\n\nindication that a varying thickness was contemplated or submitted. Secondly, there is not much in\n\nthe point of delay in making the claim. Although the bill was not submitted until January 2000, Mr\n\nShia had, as early as November 1998, informed Mr Ling of the additional thickness required and that\n\nthis item of work was a variation. This was confirmed by the letter of 1 July 1999.65. Thirdly, Forest did not try to draw any distinction between the block walls\n\nadjacent to the doors and the rest of the block walls. All it contended was that it had to plaster a\n\nthickness of 10 mm at either side of the block wall adjacent to the door frame in order to prevent\n\nthe door frame from protruding. Nakanos evidence supported this. Mr SF Wong confirmed in court\n\nthat there was a defined area of 34,314 m of block wall that required 10 mm of plaster and a\n\ndefined area of 83,314 m of block wall that required 8 mm of plaster. Mr Wong also testified that\n\nNakano had told him that the areas with the door openings required plaster of 10 mm thickness\n\nbecause of the protrusion of the door frame. Fourthly, the extra thickness of 2 mm was not\n\ninsignificant as contended by Nakano. Mr Wong admitted that in proportional terms 2 mm represented a\n\n23% increase over the original thickness of 8 mm.66. In my judgment, Forest is entitled to recover for the extra 2 mm of plaster\n\napplied to 34,314m of block wall. The question is as to the rate that it is entitled to charge. On\n\nthe basis of the agreed rate of $10.50 per m to apply 8 mm of plaster, Forest calculated that it\n\ncost them $13.125 per m to apply 10 mm of plaster. It therefore claimed an extra $2.625 for each\n\nsquare metre where an additional 2 mm of plaster had been applied. Nakano submitted that the rate\n\nshould not provide for additional labour as plastering an extra 2 mm is within reasonable tolerance\n\nand did not involve any additional labour. It argued that, if at all, Forest would be entitled to\n\nclaim for additional cost of material only. It appears to me that whilst there must have been some\n\nadditional labour costs incurred in applying a thicker layer of plaster, it is not correct to obtain\n\nthis cost by simply taking a proportion of the original agreed rate of $10.50 per m. This is\n\nbecause there would be some overlapping in the work done. There is already an agreed rate for\n\napplication of 10 mm thick plaster. This is $12.50 per m ie the agreed figure for the external\n\nplastering. I think this rate should also be applied to the areas of the internal walls which\n\nreceived that thickness of plaster. On this basis, Forest should receive an extra $2 per m for the\n\n34,314m of block walls which adjoined the door frames. I therefore award Forest $68,628 for this\n\nwork.2.7 Plastering of separation walls67. Forest claimed that the original scope of the internal plastering walls under\n\nthe sub-contract did not include plastering of the separation walls. Nakano subsequently instructed\n\nForest to do this work and Forest therefore claimed $129,856.50 for the same.68. In its submissions, Nakano did not deal with liability for this work but only\n\nwith quantum. It pointed out that Forest was now claiming it should be paid at the rate of $13.50\n\nper m whereas previously it had claimed that the rate should be $15.50 per m. Nakano asserted\n\nthat whilst Forest had claimed that it had to apply, on the average, plaster that was 15 mm thick,\n\nit had not produced any evidence that this had been done throughout all the separation walls. Nakano\n\nsubmitted that since the separation walls were within the apartment units and not exposed to\n\nweather, they should be considered as internal walls and the court should adopt the internal wall\n\nplastering rate of $10.50 per m.69. The evidence showed that originally Nakano had planned to skim coat the\n\nseparation walls. The subsequent decision to plaster them was made because it discovered that the\n\nseparation walls were not even and plastering was required to smoothen them out. Mr Shias\n\nevidence was that when Nakano asked him to carry out this additional item of work, he made\n\ninvestigations and was informed by his site supervisors that to adequately plaster these walls, an\n\naverage of 15 mm of plaster would be required. On 26 August 1999, Mr Shia put in a quotation for his\n\nwork at the rate of $15.50 per m. In the quotation the thickness of the plaster to be applied was\n\nput as being 15 mm. Although Nakano did not formally accept this quotation, it must have been aware\n\nof its existence when it instructed Forest to proceed with the work. Further, it must have been\n\naware that Forest was intending to apply 15 mm of plaster to the separation walls. In these\n\ncircumstances, I do not think it lies in Nakanos mouth now to quibble about the reduction from\n\n$15.50 per m to $13.50 per m or to suggest that the correct rate should be $10.50 per m on the\n\nbasis that only 8 mm of plaster was required. Accordingly, I award Forest $129,856.50 for the 9,619\n\nm of separation walls plastered at the rate of $13.50 per m.2.8 Amount of previous payments made70. It is Forests case that the total amount paid to it by Nakano pursuant to\n\nthe various sub-contracts was the sum of $4,402,786.08. The full details of all receipts from Nakano\n\nare contained in Appendix 5 to Mr Choos second affidavit. Nakano on the other hand asserts that\n\nit had paid Forest $4,460,716.80. The difference between the two amounts is $57,930.72. Forest\n\nsubmitted that Nakano had made a mistake in calculating the amount paid because it had wrongly\n\nincluded payments which were due to Forest for another project.71. Nakano submitted that this discrepancy was in fact due to Forests own\n\nfailure to properly account for the full sum of $165,747.63 which Nakano had paid to Forest pursuant\n\nto BOTM cheque number 014148 dated 7 December 1999. This was Nakanos first answer to the\n\ncalculation.72. Appendix 5 to Mr Choos second affidavit shows the payments Forest received\n\nin December 1999. It credited Nakano with paying it during that month the sum of $7,500.25 in\n\nrespect of the solid brick walls, $3,857 in respect of the steel lintels, $40,850 in respect of\n\ntiling works, $87,762.90 in respect of the block works and external wall plastering, and $13,300 in\n\nrespect of the internal wall plastering. This table therefore shows that Forest acknowledged\n\nreceiving a total of $153,269.90 in December 1999. Thus, only $12,477.73 of the amount paid by\n\nNakano that month is unaccounted for in Forests accounts. At the most, therefore, Nakano has been\n\nable to establish that Forest received $4,415,264.38 (ie $4,402,786.55 + $12,477.73).73. Forest did not produce any documents establishing that any part of the\n\n$165,747.63 paid by Nakano in December 1999 had been credited to the amounts due from Nakano on the\n\nother project on which it had employed Forest. In the absence of such evidence, I have to hold that\n\nthe full $165,747.63 should have been credited to the amounts payable for the Woodsvale project.\n\nAccordingly, Forest has not been able to establish that it received only $4,402,786.08. In my\n\njudgment it received $4,415,264.38.74. The other objection that Nakano raised to Forests account was that it did\n\nnot reflect 14 invoices and credit notes which were sent by Nakano to Forest between 28 July 1998\n\nand 7 December 1999. These totalled $7,985.50 and comprised, in part, charges for repairs to\n\nequipment allegedly damaged by Forests workers, and in part penalties imposed for various types\n\nof damage inflicted and infringement of safety rules and insubordination. Nakano did not lead\n\nevidence to establish that these invoices were validly raised and that Forest was legally liable to\n\npay them. Accordingly, I disregard this objection.",
        "2.9 Outstanding balance due to Forest": "75. By reason of the findings above, the balance amount due to Forest is\n\n$1,670,177.96 (excluding 3% GST) derived as follows:($)($)(a)Agreed value of original sub-contract\n\n        works5,100,896.76(b)Agreed/Undisputed variation\n\n        works34,501.40(c)Variation works awarded:(i) extra thick external plaster592,575.00(ii) hacking keys8,473.80(iii) entrance canopies17,822.88(iv) grouting door frames121,072.00(v) filling in of gaps11,616.00(vi) extra thick internal\n\n        plaster68,628.00(vii) separation walls129,856.50Sub-total:6,085,442.34(d)Less previous payment:4,415,264.38Balance due:1,670,177.96",
        "Issues relating to wrongful termination and counterclaim": "1. Forests claim for wrongful termination76. On 13 January 2000, Nakano wrote a letter to Forest entitled Termination\n\nWarning. The letter referred to various written reminders to Forest to re-plaster the hacked\n\nareas in the external walls of the blocks and in particular to a letter dated 18 December 1999 which\n\nenclosed lists of the locations to be re-plastered. It went on to note that despite this notice and\n\nthe further chance afforded to Forest to complete the re-plastering by 6 January 2000, it had failed\n\nto do so. Further, instead of stepping up the work, the number of workers attending to the plaster\n\nworks on site had decreased. Forests letter of 7 January 2000 put it beyond doubt, according to\n\nNakano, that Forest had no intention of fulfilling its contractual obligations. The letter went on\n\nto deal with the defective works and alleged that Forest was in default of its contractual\n\nobligations. Nakano ended by giving Forest notice that it might terminate Forests employment.77. The next day, 14 January, Nakano sent Forest a further letter. This was\n\nentitled Termination for Defaults(sic). It referred to the letter of 13 January and\n\nstated that Nakano accepted Forests wrongful repudiation of its sub-contracts by terminating\n\nForest with immediate effect. Forest was asked to ensure that its remaining workers vacated the site\n\nimmediately. It was also notified that Nakano would be appointing alternative contractors to\n\ncomplete the remaining sub-contract works, including rectification of the defective works. All costs\n\nincurred would be charged to Forest. Nakano also reserved its right to claim damages from Forest.78. The position taken by Forest throughout the trial was that its sub-contracts\n\nfor plastering works were prematurely and wrongfully terminated. As a result of this early\n\ntermination, Forest was unable to earn the profit in respect of work not performed which it would\n\nhave earned had the sub-contracts continued to their natural conclusion. Forest seeks compensation\n\nof $7,264.24 for the wrongful termination.2. Nakanos position79. Nakanos position is that it was fully entitled to terminate the\n\nsub-contracts and that Forest was the party in default. It claimed various amounts from Forest\n\narising from defective work, delays and the necessity of employing alternative contractors to\n\ncomplete Forests work. The validity of some of these claims depends on the validity of the\n\ntermination notice.80. In its re-re-re-amended defence and counterclaim filed on 6 September 2000,\n\nNakano cited condition 19 of its conditions of sub-contract. That condition is entitled Termination\n\nby Contractor and sets out the procedure whereby the contractor may send the sub-contractor a termination\n\nwarning and, within two weeks thereafter, a notice of termination of the employment of the\n\nsub-contractor. Nakano admitted that it had terminated Forests sub-contract on 14 January 2000\n\nand stated that it would rely on the terms of the sub-contracts for their full intent and purposes.81. Nakano went on to plead that Forest:(1) had failed and/or neglected to properly install the tiling works;(2) had failed to complete the solid brick wall sub-contract works;(3) had failed to complete its sub-contract for block wall and external wall\n\n  plastering by 30 October 1999 and that for internal wall plastering by 30 September 1999 and\n\n  thereby held up the rest of the main contract works;(4) had failed and/or neglected to properly install the block walls and the\n\n  internal and external wall plastering in that:(a) Forests inferior workmanship and lack of preparation of the substrate\n\n    surface resulted in a failure in the bonding within the plaster and between the plaster and the\n\n    substrate thereby causing hollows in the plaster;(b) despite repeated written and oral reminders by Nakano, Forest failed,\n\n    refused and/or neglected to rectify the defective plastering;(c) Forest was substantially behind its schedule of plastering works as at\n\n    July/August 1999;(d) having agreed to effect rectification works to the defective plaster wall\n\n    by hacking out the parts of the plaster that were hollow, Forest failed to make good the defects\n\n    but left substantial portions of the hacked areas un-replastered and, further, failed to attend\n\n    to other areas of defective plaster at all; and(e) despite promises to speed up the works, the number of workers sent by\n\n    Forest to the site progressively decreased.Nakano went on to plead that because of the matters that I have set out in para\n\n81(4) above, it had sent a termination warning to Forest to terminate the sub-contracts relating to\n\nthe plastering of the external and internal walls in accordance with clause 19(2) of the conditions\n\nof sub-contract. The termination notice was then served the next day. Alternatively, Nakano pleaded\n\nthat it would rely on those same matters to say that Forest had effectively repudiated the block\n\nwall and external and internal wall plastering sub-contract works which repudiation was accepted on\n\nor before 14 January 2000.3. Legal position82. As I have already held that the conditions of sub-contract appended by Nakano\n\nto its purchase orders did not form part of the sub-contracts between Nakano and Forest, Nakano\n\ncannot justify its termination of those sub-contracts on the basis of condition 19. Accordingly,\n\nNakano has to rely on its common law rights to justify the termination. Under general law, not every\n\nbreach of contract by one contracting party justifies the other (the innocent party) in terminating\n\nthe contract. Action to terminate can only be taken when the defaulting party has evinced an\n\nintention to itself repudiate the contract.83. As held by the Court of Appeal inSan International Pte Ltd v Keppel\n\nEngineering Pte Ltd[1998] 3 SLR 871, a defaulting party repudiates the contract when he\n\nintimates by words or conduct that he is or would be unable to perform his obligations in some\n\nmaterial respect. Short of an express refusal or declaration, the test is to ascertain whether the\n\naction or actions of the party in default are such as to lead a reasonable person to conclude that\n\nhe no longer intended to be bound by the provisions of the contract. However, even if the defaulting\n\npartys conduct does amount to a refusal to perform, it does not follow that the innocent party\n\nwould be entitled to terminate the contract unless the repudiation deprives the innocent party of\n\nsubstantially the whole benefit which was the intention of the parties that the innocent party\n\nshould obtain from the obligations of the parties under the sub-contract then remaining unperformed.\n\nThe Court of Appeal opined that the materiality of the refusal must be weighed in the context of the\n\nobligation then remaining unperformed and that this test was particularly applicable in the context\n\nof construction contracts where progress payments are provided for works already completed so that\n\nat the time of termination the parties are primarily concerned with the remaining unperformed\n\nobligations and the impact on them of the particular breach. (See  25 and 26 of the judgment.)4. Were the works delayed: (a) applicable completion dates84. Whilst the pleadings, as summarised in  81 above, appeared to indicate that\n\nNakano would be relying on a whole host of allegations to justify terminating the sub-contracts, its\n\nwritten submissions proceeded on narrower grounds. In closing, Nakano averred that Forest had\n\nrepudiated the plastering sub-contracts by its repeated failure to complete the works within the\n\nagreed deadlines and by removing most of its skilled workers from the site some time towards the end\n\nof December 1999 or in early January 2000 when there were still substantial areas where the\n\nplastering work was incomplete.85. The first sub-contract was for the block wall and external wall plastering\n\nworks. Nakanos purchase order for this sub-contract provided that the works should commence on 17\n\nAugust 1998 and be completed on 30 October 1999. In relation to the sub-contract for the internal\n\nwall plastering, Nakanos purchase order indicated a commencement date of 7 November 1998 and a\n\ncompletion date of 30 September 1999. I should state here that I accept that the two dates indicated\n\nas completion dates in the two purchase orders were the contractually agreed completion dates.\n\nFirst, they were embodied in the purchase orders which were contractual documents and secondly, Mr\n\nShia did not complain at any time during the course of the project to Nakano that he had not agreed\n\nto those dates. That lack of complaint must reflect an acceptance on his part.86. Although both the internal and external plastering works were started before\n\nthe issue of the respective purchase orders, Forest was not able to complete these works by the\n\nindicated dates. Nakano complained that despite being given final extensions to 15 November 1999\n\n(for internal plastering works) and 15 December 1999 (for external plastering works), Forest had\n\nfailed to complete the work even by 14 January 2000, the date of termination.(b) Extent of works not completed on 14 January 200087. As at 14 January 2000, substantial areas of the external walls remained\n\nunplastered or so Nakano alleged. According to Nakanos evidence, the total external area to be\n\nplastered was 85,565 m of which Forest left 28,466 m (or 31%) unplastered. As for the internal\n\nareas, those not plastered by Forest as at 14 January 2000 were the penthouses of blocks 9A and 9B\n\n(wholly unplastered); the penthouses of block 9C (partially plastered); the air-conditioner ledge\n\nkerbs of blocks 9A, 9B, 9C and 11B; the access openings of blocks 9A and 9B; the type E1 & E2\n\npenthouses of blocks 3 and 5; the staircase accesses of blocks 9A, 9B, 9C, 11A, 11B and 11C; certain\n\nother small areas in block 19; and certain areas near the pipe shaft opening of all the blocks and\n\nsome other areas in the vicinity of the staircases of all the blocks.88. There are some difficulties, however, with Nakanos evidence relating to\n\nthe unplastered areas. First of all, at the time Nakano did not consider that 31% of the external\n\nplastering had not been completed. At the beginning of December 1999, as shown by the minutes of a\n\nsite meeting, Nakano reported to the developer that 82.1% of the external plastering had been\n\ncompleted. Mr Ling testified that this was the case but asserted this was an estimated figure.89. The figure of 31% was derived from figures given in Mr SF Wongs report.\n\nAccording to his measurements, the total area of external walls requiring plastering amounted to\n\n85,565 m. The report also stated that the area that had not been completed was 28,446 m. When Mr\n\nWong gave evidence, however, it appeared that the area of 28,446 m had not been physically\n\nmeasured by him. He had made only one site visit and that took place on 10 March 2000 by which time\n\nthe plastering work was in the course of completion. Mr Wong spent four hours on site but did not\n\ntake any actual measurements of the plastering works at that time. He testified that his\n\nmeasurements of the quantities of the plaster were based, not on actual site measurements, but on\n\nthe drawings and plans supplied by Nakano. Further, he had depended on Nakano to identify to him the\n\nareas of plastering which had been carried out by Forest. Mr Wongs evidence was therefore not\n\nprimary evidence on the amount of work left undone by Forest.90. There is also doubt about the correctness of the information given by Nakano\n\nto Mr Wong. Presumably this information was similar to that contained in a list which Nakano gave to\n\nMr Law. That document listed all outstanding external plastering work and Mr Law then went round the\n\nsite with Nakanos representatives in order to verify this list. The list was produced in court\n\nand it is an impressive document running through some five pages with over 40 items on each page.\n\nWhen Mr Law was cross-examined about it, however, he admitted that many of the items in the document\n\ndid not relate to distinct areas but related to the same area and the photographs taken reflected\n\nthis in that they did not always show distinct areas but often showed the same area from different\n\nangles. The number of items therefore did not indicate directly how many areas were left\n\nunplastered.91. The onus lay on Nakano to prove the extent of the areas remaining unplastered\n\nas at the termination of the sub-contract. It has not established to my satisfaction that 31% of the\n\nexternal wall area remained unplastered. I accept, rather, the figure given to the owner in December\n\n1999 as that was the contemporaneous estimate made and it must have been reasonably accurate since\n\nthe developer would have had consultants on site with the ability to carry out a physical check.\n\nFurther, there were no records kept by Mr Law on the incomplete internal plastering. As Forest\n\nsubmitted, this was probably because the internal areas where the plaster work had not been\n\ncompleted were not large enough to pose a problem for Nakano who had managed to complete the same by\n\nthe time Mr Law carried out his inspections between 31 January 2000 and 3 February 2000 and on 15\n\nFebruary 2000.(c) Was there delay?92. It was common ground that the plastering of the external walls had to be\n\ncarried out in segments in accordance with the concrete casting of the external frame of each\n\napartment block which also proceeded in segments. The concrete form work was cast in segments of\n\nfour storeys per block each time. Once the casting of one segment of a block had been completed, the\n\nDoka framework was removed and taken to the another block. Eight to 12 weeks would elapse between\n\nthe casting of one segment of a block and the return of the Doka for the casting of the next segment\n\nof that block. The concrete had to harden and then BBR had to grind it and remove silt and\n\nprotrusions before Forests plastering work could commence. Nakano submitted that Forest had at\n\nleast six weeks to plaster the external walls of each segment before the Doka returned. It further\n\nsubmitted that there were many instances when Forest started plastering a segment but failed, due to\n\nthe lack of manpower, to complete the same before the Doka returned. This lack of manpower led to\n\ndelays in the plastering since once the Doka returned, the hanging scaffoldings that Nakano had\n\nsupplied for the use of the plasterers had to be removed and plastering work on the segment had to\n\nstop until the Doka left that block again.93. Nakanos witnesses asserted that Forest lacked manpower and it was this\n\nlack rather than various other matters (eg a lack of scaffolding) put forward by Forest as excuses\n\nthat was the main cause of the slow progress of the plastering works. Nakanos witnesses further\n\nstated that they had sent chasers to Forest to increase the number of plasterers but that these were\n\nignored. Many of the segments had to be abandoned as a result of Forests slow progress. According\n\nto Mr Ling and Mr Steven Lee, Nakano had provided about 78 sets of hanging scaffolding at the site\n\nand this meant that three of the construction zones had 23 to 25 sets of scaffolding each intending\n\nto cover the perimeter walls of two units of each segment. However, often the hanging scaffolding\n\nwas left unused. As Forest did not have enough workers, additional sets of scaffolding were not\n\nbrought in for the fourth zone. Instead, the sets on site were re-deployed among all zones from\n\nabout February 1999.94. It was Nakanos contention that for Forest to keep out with the sequence of\n\ncasting works and within Nakanos schedule, it needed to have at least 17 workers per block\n\nworking on the 25 sets of hanging scaffolding provided over each segment. Since there were four\n\nzones, Forest required about 68 plasterers to carry out plastering work simultaneously in all the\n\nzones. Nakano pointed out that Forest had not supplied the total number of plasterers it had\n\navailable for the works. Instead, Mr Koon had stated that depending on the availability of the\n\nworking area provided by Nakano, a few groups of skilled workers, each group consisting of\n\napproximately five skilled workers, would be engaged to carry out the work at the available\n\nlocations. In court, however, Mr Koon claimed that he would send two or three workers up per\n\nscaffolding and that two of these would be skilled whilst the third would be a general worker. He\n\nalso claimed that Nakano had provided only about 16 sets of scaffolding for each segment. He then\n\nclaimed that he would need more than 20 plasterers for these 16 sets. On this basis, Forest would\n\nhave needed 80 plasterers to work in all four zones, 12 more than the figure estimated by Nakano.95. Nakano submitted that Forest never had 80 plasterers for the external\n\nplastering. Mr Koon, though unable to give even a rough estimate of the number of plasterers on\n\nsite, claimed that Forest had workers on every available scaffolding platform throughout the site\n\nand that it was Nakano who did not have sufficient hanging platforms. On the other hand, the\n\nevidence of Nakanos foreman, Mr Lee, was that Forest had only four to five workers for the corner\n\nbeading and the level pegs for all four zones whilst it had eight to nine plasterers in each of the\n\nfour zones. Nakano had often asked Forest to increase its labour force. One such request was\n\ndocumented in Nakanos letter of 8 September 1999 which referred to a promise made by Mr Choo to\n\nmobilise an additional 27 plasterers by 12 September 1999 to add to the then existing site workforce\n\nof 32 plasterers.96. Mr Koon asserted that during the course of the project, he had insured that\n\nthe number of workers engaged at the site was sufficient. Based on Forests records, an average of\n\n64 skilled workers and 32 general workers were engaged per day. The general workers were engaged\n\ndirectly by Forest whilst the skilled workers were either direct employees or obtained from labour\n\nsub-contractors. Mr Koon also said that during the period September and November 1999 Forest had\n\nengaged an average of 150 skilled workers and 32 general workers per day. A physical inspection of\n\nthe site was undertaken by Nakano towards the end of November 1999. At that point, Forest was found\n\nto have 104 workers on site, a substantial number although somewhat below the 182 figure given by Mr\n\nKoon for that period.97. Mr Koons assertions were not, however, substantiated by documentation.\n\nForest does not seem to have kept complete and accurate records. Certain records showed that another\n\ncontractor had supplied Forest with 15 plasterers between August and November 1998. Other payroll\n\nrecords produced by Forest apparently indicated that it employed 20 to 30 general workers from\n\nOctober 1998 to January 1999 and thereafter, in addition to the general workers, 15 skilled workers.\n\nNo records of the actual number of plasterers working at the Woodsvale site were kept by Forest. Mr\n\nShia himself insisted that he had some Chinese plasterers but there are no records of the number of\n\nthese workers. Mr Shia was not able to remember the number of plasterers on site nor could he\n\nexplain the payroll records. Mr Koon himself was not able to say how many of the skilled workers who\n\nwere supplied to the site were plasterers as there were also skilled workers for block laying and\n\ntiling.98. On 10 October 1999, Nakano wrote to Forest. It expressed its regret that\n\ndespite several reminders regarding sub-standard quality of workmanship and work progress, Forest\n\nhad not taken Nakanos instructions seriously. It further stated that since Forest had not been\n\nable to meet Nakanos schedule, it had extended Forests final completion dates for brick works\n\nto 21 October 1999, for internal plastering to 15 November 1999 and for external plastering to 15\n\nDecember 1999. Forest was informed that if it failed to improve its work performance and quality\n\nimmediately, Nakano would have no alternative but to accept Forests wrongful repudiation of the\n\ncontract by appointing alternative contractors and looking to Forest for all loss and expense. It\n\nappears from this letter that Nakano was very frustrated with the progress of the work and was\n\nbeginning to build the case for termination. Mr Shia received this letter. He did not dispute its\n\ncontents. Mr Koon was aware of it as well. He asserted on the stand that at the time he received the\n\nletter he thought that he should be able to finish the external plastering within two to three\n\nmonths ie around mid December 1999.99. In the event, by 14 January 2000, despite further agitation by Nakano and\n\nseveral inspections of the site at which unfinished work was pointed out to Forests\n\nrepresentatives and promises were made to complete same, the internal and external plastering works\n\nwere not complete. In my opinion, Forest had been slow. The question is whether such delay justified\n\nthe action taken by Nakano to terminate the relevant sub-contracts.(d) Did delay justify termination?100. At that time, Nakano had an obligation to deliver the completed project to\n\nthe developer by 6 May 2000. Its concern was that because of the slow progress of the plastering\n\nworks it would not be able to do so. This was because even after the plastering works had been\n\ncompleted, there would be painting and external works to complete and the authorities would have to\n\ninspect the project and issue the necessary approvals. Painting work scheduled for end December 1999\n\nby Nakano had been held back due to the incomplete plaster works.101. Nakano was also concerned because its foremen saw a significant decrease in\n\nthe number of plasterers in early January 2000. Mr Koan Ping Seng and Mr Lee recorded the number of\n\nplasterers at the site on 7, 8, 9 and 10 January 2000 and these records showed that on those days,\n\nthere were only about 15 plasterers on site, roughly half the normal strength.102. Whilst Nakanos concern over the slowness of the work and the apparent\n\ndecrease in plasterers is understandable, that does not mean that it was justified in terminating\n\nthe sub-contracts. As held inFelton v Wharrie[1906] Hudsons BC 4thed Vol 2 p\n\n398, delay to the works per se does not amount to repudiation unless it is of such magnitude and\n\ncharacter as to show that the contractor is either unable to proceed with the works or has no\n\nintention of proceeding with them. At the time of termination, Nakano itself was not yet late under\n\nthe main contract and therefore the termination was an anticipatory one based on the concern that if\n\nForest continued to be slow it would inevitably delay Nakanos own work. There was no clear\n\nevidence of how allowing Forest to continue would have delayed Nakanos own completion. As it was,\n\nthe rectification work carried out by Acolite after Forest was terminated was not completed until\n\naround the end of May or June 2000 and, according to Mr Hattori, other works that had to be done\n\nafter this rectification work took a further two months. Thus, the termination itself caused delay\n\nand there is no evidence that had Forest continued to work on the project it would not have been\n\nable to complete at the same time that Acolite did.103. Further, the slow progress of the plastering works was not entirely due to\n\ndefault on the part of Forest. Nakano had a role to play in this as well. For one thing, Forests\n\nplastering work was given a lower priority than the concreting works. This meant that any disruption\n\nin BBRs work resulted in serious disruption to Forests work and, secondly, resources that\n\nNakano were already short of were allocated first to BBR rather than to Forest. Mr Ling agreed that\n\npriority in the use of resources was given to BBR to enable them to catch up with the casting\n\nschedule and that the hanging platforms had been removed without regard as to whether Forest had\n\ncompleted applying plaster so as to make way for the Doka form work to be brought back to enable BBR\n\nto cast the next segment.104. Secondly, a number of walls or parts thereof were not always ready for\n\nplastering by Forests workers. The protrusions on the walls were not always trimmed, as admitted\n\nby Mr Ling, as it was presumed that the plastering would hide the defective concrete. There was\n\nevidence in the form of admissions by Nakanos witnesses that at the time of termination some wall\n\nsurfaces had not been ground by BBR and/or Nakano and therefore were not ready for plastering work.\n\nThere were also delays in the inspection of the concrete work which in turn led to delays in\n\ncommencement of plastering work. Further, even at the date of termination the window sills had not\n\nbeen installed in a number of blocks so that Forest was unable to plaster the areas around the\n\nwindow sills. Mr Lee agreed that the minutes of a site meeting held at about that time showed that\n\nwindow sills in blocks 9A, 9B, 11A and 11C had still to be hacked to enable installation of the\n\nwindows.105. It was also significant that Nakano was rather haphazard in the\n\ncommunication of its construction programme to its sub-contractors including Forest. In\n\nevidence-in-chief Nakano had asserted that it had briefed the respective sub-contractors on the\n\nsequence and timing of their respective works. Nakanos witnesses alluded to a master programme.\n\nDuring cross-examination Mr Hattori agreed that the plastering programme should have been agreed in\n\nconsultation with Forest as the sub-contractor responsible for carrying out the plastering work. He\n\nalso agreed that Forest was not consulted on the original master programme but asserted that there\n\nwas a revised programme and that during negotiations he had informed Forest that each segment of\n\nconcrete had to be plastered within four months.106. Whatever Mr Hattori might have told Mr Shia during negotiations, there was\n\nno evidence that Forest was consulted in relation to the revised master programme which was\n\nsubmitted to the architect in February 1999. Mr Hattoris testimony was that he had no idea\n\nwhether Mr Shia was consulted on this. When he was asked if he had told Mr Lee to consult Mr Shia,\n\nhis reply was that he could not recall whether he gave specific instruction to his staff members at\n\nthis time but they understood that when they needed to revise a schedule they were supposed to\n\nconsult particular contractors. Mr Lee when asked about this stated that he himself had not been\n\nconsulted about the revised schedule. If that was so, he could not have consulted Mr Shia about it.107. It would appear therefore that the sequence and timing of the work were\n\nplanned by Nakano without any contribution from Forest. Instead, it was simply briefed on the\n\nprogramme by Nakano. Mr Ling remembered that he had briefed Mr Shia on the schedule which he needed\n\nto follow until the project was completed. By this he meant that he had told Mr Shia that the\n\nplastering work had to be completed some time in July or August 1999 but he had not given him any\n\nwritten schedule. When he was asked whether he would agree that most of the time Forest had been\n\ngiven only a vague idea of when particular work had to be completed without any firm deadlines, Mr\n\nLing agreed after stating that he had verbally given Forest a schedule every day.108. In any case, the master programme did not even properly mention or provide\n\nfor the plastering works. Mr Ling attempted, under questioning, to fit these works into the general\n\ncategories of architectural works and, alternatively, external wall finishing. Both of\n\nthese, however, were much wider categories encompassing more areas of work. The plan, therefore,\n\nfailed to precisely indicate the schedule for the plastering works. This lack lends force to the\n\nsubmission by Forest that there was in reality no plan and at best, decisions were taken on a weekly\n\nbasis as to where, how and when Forest should carry out its plastering work. To me it appears as if\n\nthere was a general idea as to what needed to be done within what time frame but without specific\n\ndeadlines within the general outline. Since the work was segmented and dependent on the progress of\n\nthe casting work it would have been very difficult to lay down specific deadlines.109. Having considered the evidence as a whole, it appears that whilst Forest did\n\nnot work as fast as Nakano desired or as fast as it could have, there were various reasons for the\n\nslow progress and among these were deficiencies on Nakanos part as well. It was not all Forests\n\nfault. Further, it was not at all clear at the time of termination that delays on the part of Forest\n\nwould have a devastating impact on Nakanos work. Instead of resorting to termination, an object\n\nwhich it seemed to have had in mind since October 1999, Nakano could have continued to chivvy Forest\n\nto hurry up and also made a claim for damages against it if in fact the completion of the project\n\nwas delayed due to Forests slow speed. There was a submission made by Forest that because the\n\nword nil was entered against the heading liquidated damages on Nakanos purchase\n\norder, Nakano would not be able to claim even general damages had Forests delay caused it to\n\nsuffer the same. It is not necessary for me to decide that point now but I should state that I find\n\nit difficult to accept the proposition that simply because it was agreed that there should be no\n\nliquidated damages clause, no damages at all could be claimed even if Forest was in default and its\n\ndelay caused loss to Nakano.110. Accordingly I find that Nakanos termination of the plastering\n\nsub-contracts was wrongful. Forest would be entitled to damages for wrongful termination. It has\n\nquantified these at $7,264.24 which it says is the profit it would have earned from the\n\nsub-contracts if they had not been prematurely terminated. Details of this figure were set out in\n\nappendices to the statement of claim. Nakano has not challenged this quantification. I therefore\n\naward Forest $7,264.24 in damages.",
        "Nakanos counterclaims": "111. Nakanos counterclaims are based primarily on Forests alleged failure\n\nto complete the sub-contract works, on defects in the external and internal plastering works and\n\nadditional cost of rental for gondolas and platforms which resulted from Forests failure to\n\ncomplete within schedule. As a result of Forests termination, Nakano had to appoint alternative\n\nsub-contractors to complete the works and rectify Forests defective works. The particulars of\n\nloss are as follows:(a) overpayment for external plastering sub-contract ($57,705.29);(b) Acolites invoices (ie $803,235 less back charges of $68,785);(c) Yu Bees invoices ($971,156.91);(d) Hai Hwas invoices (additional costs of labour and\n\n  materials)($85,327.89);(e) Kan Leongs invoices (additional costs) ($98,875);(f) Wong Kam Thongs charges for rectification of Forests defective tiling\n\n  works ($13,050);(g) Gondolas and climbing platforms ($415,146.62); and(h) Fines (not yet backcharged)($16,000).In the light of my finding on the issue of termination, some of the above claims\n\nare no longer maintainable. I will deal with each claim in turn.(1) Overpayment for external wall plastering112. In Nakanos submissions, there is just one sentence on this claim. It\n\nreads Based on the agreed quantities for external wall plastering, the overpayment is $57,705.29.\n\nThere is insufficient material on this submission for me to accept it. Further, even if there was an\n\noverpayment of $57,705.29 in respect of the plastering, all payments made by Nakano to Forest have\n\nnow been taken into account in the calculation of what is due from Nakano to Forest as shown in \n\n75. This claim is therefore not allowed.(2) Acolites invoices ie payment for rectification of defective plaster113. Nakano submitted that in relation to this claim, the two issues that arose\n\nwere (i) whether the defects found in the plaster were the result of Forests failure to follow\n\nmanufacturers specifications in relation to the application of Smartplas, its poor supervision of\n\nworkers and poor workmanship and (ii) if so, what should be the quantum of damages.114. For the purposes of determining the reason why such a large portion of the\n\napplied plaster debonded, both Forest and Nakano appointed experts to investigate and report. These\n\nwere Mr Kenneth Hugh Jones and Mr CW Wong.(a) Evidence of Mr Wong Chung Wan115. Mr Wong is a qualified civil and structure engineer who holds a Masters\n\ndegree in Building Science. He is presently head of the Construction Technology Division and General\n\nManager of SETSCO Services (M) Sdn Bhd. SETSCOs investigation was commissioned on 1 March 2000.\n\nMr Wong inspected the site physically on 6 March 2000. On the external facades inspection was made\n\nvisually from the ground level and internally some of the units and staircases were inspected.\n\nLocations were selected for extraction of samples for laboratory analysis. Fourteen samples were\n\ntaken altogether, seven from external areas and seven from internal areas. In both cases, samples\n\nwere extracted from sound areas, areas with hollow sounding and areas with cracks accompanied by\n\nhollow sounding. As there was no specific pattern of distribution of the defects, the samples were\n\nextracted randomly from accessible areas.116. Mr Wong took the samples back to his laboratory and subjected them to\n\nvarious tests. One of these tests was a Petrographic examination to determine the plasters\n\nmicrostructure and composition. He also prepared samples of plaster from fresh bags of Smartplas.\n\nTwo samples were prepared and applied in accordance with the manufacturers recommendation. The\n\nplaster was applied onto a G40 concrete substrate and the control samples were then subjected to the\n\nsame sort of Petrographic examination.117. In his report, Mr Wong stated that during the initial walk-around\n\ninspection, no clear pattern of distribution of the failure in the plaster could be detected. The\n\nfailure appeared random, similar to the mode seen from photographs of the site which had previously\n\nbeen furnished to him by Nakano. These photographs indicated that the failure was widespread. As a\n\nresult, subsequent detailed inspection was confined to blocks 5, 7, 9 and 17 which showed similar\n\nmodes of distress. Unfortunately, due to access constraints, the physical inspection was confined to\n\nthe lower storeys and no close up inspection of the external faade of the upper storeys was\n\ncarried out.118. In relation to internal plaster works, the visual inspection was made at the\n\nreinforced concrete staircase shaft. It was observed that:(1) hollow sounding areas were often accompanied by pattern-cracks (0.2 to 0.5\n\n  mm in width);(2) detachment (falling off) of plaster had physically occurred in considerable\n\n  areas and bulging of debonded plaster was evident;(3) web-like pattern cracks were found even in areas without hollow sounding;(4) thickness of plaster varied widely from 9 to 20 mm;(5) debonding failure occurred mostly between the plaster and the concrete\n\n  substrate and to a lesser extent, between the different layers of the plaster.119. Having completed the visual inspection of the site and the laboratory\n\nanalysis of both the samples taken from the site and the control samples made up and applied in the\n\nlaboratory, Mr Wong came to the following conclusions:(1) the failures observed on site appeared to be widespread, with no\n\n  apparent consistent pattern or distribution. On concrete substrate, ie, external walls and\n\n  staircase walls, the failure manifested as debonding of the plaster and was often accompanied by\n\n  cracks. These cracks appeared largely as random pattern cracking, similar to shrinkage. The mode\n\n  of delamination was mostly failure between the plaster and concrete substrate and debonding\n\n  between layers of plaster. Bulging of the debonded plaster was also evident.(2) The appearance of random pattern cracks on the plaster indicates those that\n\n  are usually caused by shrinkage. This is likely due to inherently high shrinkage of the plaster\n\n  or/and cracking due to shrinkage. Higher shrinkage is usually expected for the mixes that have\n\n  higher amount of water than the amount recommended. Too much water in the mix causes a reduction\n\n  in strength of the plaster, higher shrinkage of the plaster and would have contributed to the\n\n  debonding of the plaster from the substrate or between layers.(3) The adhesion bond strength of both the control samples exceeded the minimum\n\n  requirements spelt out in the HDBs specification. This is despite the slight deviation in the\n\n  mode of application for control #2.(4) Petrographic examination of plasters extracted from site and compared\n\n  against laboratory simulated samples revealed that:(i) signs of efflorescence or cement laitance were detected along the\n\n    interface between the base and final coat. Such deposits are caused by the migration of the\n\n    plaster constituents from within the plaster mix to the surface of the coat. Such a migration\n\n    would not occur if the right mix of powder and water was adhered to. In any case, these deposits\n\n    should have been removed/cleaned before plastering, as it will inhibit adhesion.(ii) where debonding was reported, there was significant amount of voids\n\n    along the plaster and concrete interface. This indicates the lack of a tight application of the\n\n    base coat to the concrete substrate. The simulated samples showed very good contact between the\n\n    base coat and concrete substrate with small amount of voids along the interface. The lack of the\n\n    tight base coat would have resulted in poor adhesion between the plaster and concrete substrate;(iii) over combing of the base coat was also detected resulting in cutting\n\n    through of the base coat into the concrete surface. This contravened the recommended practice as\n\n    highlighted in the technical brochure;(iv) large gaps and voids were found between the final and base coat,\n\n    apparently due to insufficient pressure being applied why laying the final coat or poor\n\n    workability of the plaster at the time of application. This has resulted in poor contact between\n\n    the two layers and hence weak bonding. It is therefore not surprising to see failure between the\n\n    base coat and final coat of the plaster on site.(v) neither spatterdash nor key coat was detected, though recommended in the\n\n    technical brochure. Similar recommendation is also given in BS 5262, which is also referred to\n\n    in the technical brochure;(vi) large variations in thickness of each layer were evident and in several\n\n    occasions, the total thickness of the plaster exceeded the maximum of 20 mm recommended. In\n\n    addition, the thickness of the final coat(s) generally exceeded that allowed by the\n\n    manufacturer. Thickness of the samples extracted from areas without defects seemed to comply\n\n    with the limit given by the manufacturer. A final coat that is too thick causes detachment of\n\n    the plaster.120. It can be seen from the above analysis that Mr Wongs main conclusion was\n\nthat the debonding was due, in large part, to poor workmanship on the part of the plasterers. This\n\nmanifested itself in too high a proportion of water being used in the mixing of the Smartplas, a\n\nlack of tight application of the base coat to the concrete substrate, over combing of the base coat,\n\ninsufficient pressure being applied when laying the final coat, poor workability of the plaster at\n\nthe time of application and lack of bonding agents such as spatterdash.(b) Evidence of Mr Kenneth Hugh Jones121. Mr Jones has 25 years experience as a professional building surveyor engaged\n\nin the assessment and appraisal of residential, commercial and industrial buildings. He is a fellow\n\nof the Chartered Institute of Building and of the Architecture and Surveying Institute and a member\n\nof the Australian Institute of Building Surveyors and the Australian Institute of Building. Prior to\n\nsettling in Singapore in 1991, he provided building surveying services and technology services in\n\nAustralia, the Middle East and the United Kingdom. According to his c.v., Mr Jones has extensive\n\nexpertise in the diagnosis of building defects and the preparation of effective solutions to\n\nbuilding problems, based upon extensive practical experience and an in-depth technical knowledge\n\ngained from 43 years of study and research.122. At the beginning of 2000, Mr Jones company, Robinson Jones Associates Pte\n\nLtd, was instructed by Forest to carry out a survey inspection and necessary investigations in order\n\nto establish the cause and reasons for localised bond failures between reinforced concrete walls and\n\napplied external plaster at the Woodsvale project. Mr Jones carried out a site inspection on 1\n\nJanuary 2000. This comprised a visual examination of the exposed reinforced concrete walls, the\n\napplied plaster and areas of the substrate where the debonded plaster was being replaced. No opening\n\nup of the fabric or the structure of the building was carried out. Three further visits were made to\n\nthe perimeter of the site for the purpose of taking digital and infra-red photographs.123. Mr Jones investigations included examination of digital and infra-red\n\nphotographs of the plastered and unplastered areas of the reinforced concrete walls, a study of the\n\ntechnical specifications of the premix plaster form work system and the pin-fixing system carried\n\nout by Acolite. He also examined samples of cured plaster removed from the walls and did\n\ncalculations to quantify the actual average thickness of applied plaster.124. On conclusion of his investigations, Mr Jones opined that the cause and the\n\nreason for the bond failure of the localised areas of the plaster resulted from some or all of the\n\nfollowing factors:(a) the reinforced concrete walls, which form the substrate to which the\n\n  subject plaster has been applied, were constructed using system formwork with smooth forms, which\n\n  produce a totally smooth finish;(b) despite the use of smooth forms, no measures were taken to provide an\n\n  appropriate keyed surface by scabling the surface of the concrete, or wire brushing upon removal\n\n  of the formwork;(c) the placement of the concrete was erratic and had been over vibrated at\n\n  some locations, resulting in a layer of weak material with a high silt content on the face of the\n\n  concrete;(d) the forms were not raised and set in a regular and even vertical plane,\n\n  resulting in a need for significant variations in plaster thickness. This in turn has resulted in\n\n  differences in the rate of thermal movement to the cured plaster and uneven stress at the bond\n\n  joint between the plaster and concrete.(e) it is possible that mould oil, or other release agents had been applied to\n\n  the face of the forms and that the surface of the concrete could contain traces of these\n\n  chemicals.In summary, Mr Jones opinion was that rather than the defects in the plaster\n\nhaving arisen from bad workmanship, they had been caused by the nature of the concrete walls and\n\ndeficiencies in the treatment, placement and vibration in the concrete. These were matters for which\n\nNakano rather than Forest would be responsible.(c) Discussion and findings125. Dealing first with Mr Jones opinion, there are some difficulties with\n\naccepting all of his conclusions. The first possible cause of bond failure put forward by him was\n\nthat the reinforced concrete walls were constructed using system form-work with smooth forms which\n\nproduced a totally smooth finish. Mr Jones suggested that indented form-work should have been used\n\nwhen the concrete was cast. In cross-examination, however, he admitted that he had never seen this\n\ntype of form-work used in Singapore. That being the case, there must be means of insuring that\n\ndespite the use of system form-work like the Doka, plaster would adhere to the resulting smooth\n\nconcrete.126. Whilst the smooth surface may have contributed to the difficulties initially\n\nexperienced in achieving a bond between the plaster and the external walls, it cannot have been the\n\nonly or main cause of the debonding. This is because when the debonding first became obvious, Nakano\n\ninstructed Forest to hack keys onto the concrete surface and also to use a bonding agent. Despite\n\nthese steps delamination continued to occur thus disclosing that there were other reasons for the\n\ndefects. It would also be noted that when Mr Wong made up a sample of plaster in his laboratory and\n\napplied it to a slightly roughened concrete surface, he found the degree of adhesion of the plaster\n\nto the concrete to be good. This indicates that properly mixed plaster would adhere to the concrete\n\nonce keys had been hacked into it.127. The next opinion was that there was a high silt content on the face of the\n\nconcrete because it had been over-vibrated resulting in a layer of weak material with a high silt\n\ncontent on the face of the concrete. This layer would inhibit the cementitious bond from coming into\n\nbeing between the plaster and the concrete substrate. Mr Jones opined that this layer of silt was\n\nthe main cause of the debonding of both the internal and the external plaster. He stated that the\n\nappearance of the concrete, particularly its light grey colour and the smoothness of its surface\n\nindicated that high levels of fines made up of silt and other fine particles had migrated to the\n\nface of the forms during placing and compaction of the concrete.128. During re-examination of Mr Jones, it turned out that he had not seen the\n\nsurface of the concrete himself. He had simply relied on photographs of the substrate for his\n\nanalysis of what the appearance of the concrete meant. Thus, his evidence was speculative rather\n\nthan based on physical examination. On the other hand, Mr Wong had conducted a microscopic\n\nexamination of samples of all the various layers of the reinforced concrete wall, including the\n\nsubstrate. During cross-examination, he stated that his investigations, both by way of visual\n\ninspection on site and by way of laboratory examinations of extracted samples, did not reveal silt\n\non the surface of the substrate. He disagreed that the photographs showed obvious levels of silt on\n\nthe concrete. He said it was very difficult to tell from photographs whether the concrete surface\n\nwas covered by fines or not because the photographs showed concrete surfaces that had the same\n\nappearance as most concrete surfaces.129. Further, even if there had been a layer of fines or silt at the surface of\n\nthe concrete substrate, this layer would have been removed by grinding. Mr Jones agreed that\n\ngrinding the surface of the substrate would remove all the silt. The evidence given by Nakanos\n\nwitnesses was that grinding regularly took place and the whole surface of the wall was ground and\n\nnot just the protruding areas. No doubt there were times when, as alleged by Forests witnesses,\n\nthe grinding was slow or incomplete but there is no evidence that this was a widespread phenomenon\n\nor that the areas of debonded plaster were co-extensive with the areas which were not ground by\n\nNakano or BBR.130. Mr Jones third observation was that the forms had not been raised and set\n\nin a regular and even vertical plane resulting in a need for significant variation in plaster\n\nthickness. Mr Jones had come to certain conclusions on the thickness of the plaster applied. He had\n\nseen certain areas on the walls where plaster had been hacked off at the time of his inspection and\n\nin these cases the thickness of the plaster had ranged from 10 mm to 30 mm. Further samples of\n\nremoved plaster were delivered to his office subsequently and these were between 19 mm to 49 mm\n\nthick.131. Mr Jones, however, was not aware whether these plaster samples were taken\n\nfrom walls that allegedly had a verticality problem or exactly how much the alleged deviation from\n\nverticality was. His evidence was that he did not check the verticality of the walls himself. His\n\nconclusion that the walls were not raised and set in a regular and even vertical plane was based\n\nmainly on his observations of the hacking of a significant number of windows. During\n\ncross-examination, however, he agreed that the alignment of the window reveals had no effect\n\nwhatsoever on the verticality of the form-work.132. Mr Jones bolstered his opinion by suggesting that a possible reason for the\n\nalleged misalignment of the form-work was the combination of the system form-work with traditional\n\nform-work construction methods. During cross-examination, he admitted that this was his own\n\nsuggestion and did not come from the suppliers of the Doka. He also admitted that the possibility\n\nwas mere speculation and that he did not have any evidence of such a combination having taken place\n\nin this case. He further testified that he was not familiar with the Doka form-work and that he was\n\nbasing his comments on it purely on the brochures.133. Mr Jones was not able to support his theory that the walls were not set in a\n\nvertical plane. No doubt I have found that there were deviations from verticality as shown by Nakanos\n\nown records, but the extent of these deviations was not such as to be significantly outside of the\n\npermitted deviations required by the Singapore Code of Practice CP 23 as opined by Mr Jones. The\n\nverticality check results taken by Nakano were passed by the structural engineer as being within the\n\npermissible tolerances. Mr Jones was not aware of this position. It appeared to me that his view of\n\nthe verticality problems was an exaggerated one. In any case, the significance of the verticality\n\nproblems lay in Mr Jones view that varying thicknesses of plaster contributed to debonding. This\n\nview was severely undermined in cross-examination.134. Mr Jones had stated that the variations in the plaster thickness had\n\nresulted in differences in the rate of thermal movement to the cured plaster and uneven stress\n\nbetween the plaster and the concrete. No calculations were given in support of this theory but only\n\na sketch showing how the thickness of the plaster varied over the height of the wall. His theory was\n\nin areas of thicker rendering, the thicker mast of the plaster would expand linearly less than the\n\nthinner mast of plaster. Therefore, at the point where the thickness changed, the thinner plaster\n\nwould exert a compressive force against the thicker plaster which would cause the thinner plaster to\n\nmove outwards and away from the wall, thereby debonding.135. During cross-examination, Mr Jones agreed that the formula for linear\n\nexpansion of materials is the multiplication of the length of the material with the thermal\n\ncoefficient of the material and the difference in temperature. It was put to Mr Jones that this\n\nformula did not take into account the thickness of the material and thus for a given material of\n\nsimilar length but of any given thickness, the amount of linear expansion would be the same for a\n\ngiven range of temperature. Mr Jones stuck to his theory but was unable to cite an alternative\n\nformula to account the thickness of the plaster. Thus, as Nakano submitted, there did not seem to be\n\na scientific basis for Mr Jones thermal expansion theory. It should also be noted that Mr Jones\n\neventually admitted that his thermal expansion theory would not cause debonding to occur if the\n\nplaster had properly adhered to the wall in the first place.136. In any event, as Mr Jones admitted, since the internal walls of the\n\nbuildings were not as exposed to the normal temperature changes as were the external walls, the\n\nlarge scale debonding of plaster that occurred in the internal areas was not due to thermal\n\nexpansion. Under questioning by me, he also admitted that even externally, if everything else had\n\nbeen in order, the plaster would not have been debonded simply because of thermal movement.137. In the course of his report, Mr Jones opined that vibrations emanating from\n\nconcrete work on the higher storeys of a block could be transmitted to the completed sections of the\n\nwalls below and that this vibration would to some extent disturb the bond between the newly\n\napplied plaster and the RC walls. In his conclusions, however, he did not include vibration as a\n\ncause of debonding. In view of this, I do not think I need to spend much time on this theory. I note\n\nthat Mr Wong had disagreed with Mr Jones opinion on the basis that most of the vibrations\n\ngenerated by the poker vibrator used to compact the wet cement would have been absorbed by the\n\ncement itself. Even if the vibrator had come into contact with the form-work or the steel\n\nreinforcement, the vibrations would still be absorbed by the fresh concrete and the amount of\n\nvibration transferred down to the lower walls would be minimal. Further, for some blocks in the\n\nproject, the plaster was applied to the external walls only after all concreting work to those\n\nblocks had been completed. Yet, debonding of the plaster on these walls still occurred. This\n\nevidence makes it highly improbable that vibration was a contributing factor to debonding.138. The final possible reason for the debonding given by Mr Jones was that mould\n\noil, or other release agents had been applied to the face of the forms and that the surface of the\n\nconcrete could contain traces of these chemicals. This appears to me to be pure speculation since\n\nno tests on the concrete were carried out to ascertain the presence of these chemicals. Further, Mr\n\nJones agreed in cross-examination that grinding and washing the walls before plastering would remove\n\nthese chemicals. As I have stated earlier, grinding works were regularly carried out. Further,\n\nForests evidence was that it would wet the walls before applying the plaster.139. Turning to Mr Wongs reasons for debonding, as Nakano pointed out in its\n\nsubmissions, there was evidence which supported the theories that the plaster had not been properly\n\nmixed and properly applied by Forests workers. First of all, it was clear that neither Mr Shia\n\nnor his supervisors had ever read the specifications for Smartplas or the instructions as to how\n\nmixing of the material with water should take place. It is not surprising that their mixing process\n\nwas not that recommended by the Smartplas manufacturer and whilst from the evidence the proportions\n\nof Smartplas and water mixed were roughly correct, it appeared that there was no system in the\n\nmixing and that what was done was done without any reference to the manufacturers instructions.\n\nFurther, the mixing of plaster was not always carried out under supervision.140. My impression of Forests supervisors were that they were rather rough and\n\nready and also complacent. They were sure that what they were doing was correct. They relied on\n\nprevious experience and did not take the trouble to study manufacturers instructions whether in\n\nrelation to the use of Smartplas or to the use of the bonding agent Hydroment 476 Crete (Hydroment).\n\nThe latter was added directly into the plaster mix which was a mode of use which was only prescribed\n\nwhen the plaster was intended to be applied as a thin-set mortar. For the Hydroment to be used as a\n\nbonding agent, it should have been mixed with type 1 Portland cement to form a slurry bond coat. Mr\n\nKumar and Mr Koon also gave contradictory evidence on the way that the Hydroment was used and the\n\namount of water used in the mix at that time. I accept Nakanos submission in this regard that\n\nForest had acted in contravention of the instructions set out in the specifications to the Hydroment\n\nby (a) adding water into the Hydroment; (b) using Smartplas instead of Portland cement and (c) by\n\nmixing one part of Hydroment with two parts of Smartplas and water.141. I find Mr Wongs evidence persuasive. His opinion was clear and was not\n\nadversely affected during cross-examination. He was able to explain his methodology well. His\n\nfindings indicate that more water was added to the plaster mix than was recommended by the\n\nmanufacturers of Smartplas and that this was the cause of the high shrinkage of plaster that led\n\nto cracking and debonding. I also accept his evidence that a large number of air voids were found in\n\nthe site plaster and this was contributed to by various types of poor workmanship on the part of\n\nForests workers. I note that the number of samples taken by Mr Wong was small. In relation to the\n\ncause of the defective plaster, I accept his explanation that these samples can be regarded as\n\nrepresentative although the debonding occurred over a large area because the failure areas showed a\n\nsimilar manner of distress and the failure appeared random.142. Forest, in its reply submissions, criticised Mr Wongs conclusion that\n\nthere was too much water in the plaster mix on the basis that in the original report, this\n\nconclusion was based on the appearance of random cracks only. The laboratory findings were\n\nraised only at the trial. Forest submitted that that was a surprising, if not irregular, way to\n\ntreat findings made and that there was no reason why the same should not be documented if they were\n\nvalid. Whilst it would have been better for the laboratory findings to have been mentioned in the\n\nreport, this does not mean that I should disregard the evidence entirely. As stated, I found Mr Wong\n\nto be a professional and reliable witness and in my view, the quibble raised by Forest could not\n\ndetract from the essential truthfulness of the evidence.143. Forest also raised objections to general inferences being derived from a\n\nsmall number of samples. I have already dealt with that. It then went on to submit that the\n\nconclusion was arrived at by a comparison of what Forest had applied with a control sample produced\n\nunder ideal and perfect conditions. This, Forest submitted, was grossly unsatisfactory. I do not see\n\nmuch force in this submission. Forest was in effect saying that on site it is not possible to mix\n\nand apply plaster properly. Surely, this cannot be the case. It is always possible to follow the\n\nmanufacturers instructions as to mixing if one is aware of them (which Forest was not) and as for\n\napplication, the samples which Mr Wong examined were taken from the lowest storeys of the blocks and\n\nthus, Forest should have had no problem in properly applying the plaster to those areas. No hanging\n\nplatforms or gondolas would have been required for such application. Thus, the conditions in which\n\nthe applications were made would not have varied significantly from laboratory conditions.144. Referring to the samples extracted from external areas, Forest noted that Mr\n\nWongs evidence was that for plaster taken from areas without hollows, bonding between the plaster\n\nand the concrete substrate appeared good and well applied with few amounts of void along the plaster\n\nsurface. Adhesion between the different layers of plaster also appeared good. From the samples\n\nextracted from debonded areas, there was a significant number of voids across the cross section of\n\nthe plaster. Forest concluded that for areas where there was no debonding, the comments were\n\nfavourable to it. Forest therefore submitted that it must be concluded that its workmanship was, on\n\nthe whole, good. To say otherwise would lead to the anomalous conclusion that Forests\n\nworkmanship was bad for debonded areas, but good for areas where the plaster did not debond. I do\n\nnot follow the logic of that submission. In my view, a conclusion that Forests workmanship varied\n\nfrom good to bad is not ipso facto an anomalous one. It is the explanation why the debonding was not\n\nwholesale. If the condition of the concrete was the reason for the debonding, then one would have\n\nexpected wholesale debonding as the concrete was the same throughout the project. The very fact that\n\ndebonding took place at random is an indication that it was due to poor workmanship rather than the\n\ninherent condition of the substrate.145. Forest had no control over the quality of the plasterers in that many of\n\nthem were not direct employees of Forest but were furnished by labour sub-contractors. It does not\n\nseem to have insisted that all of these had proper qualifications since it could only produce\n\ndocuments establishing the plastering qualifications of about 15 workers. I was not very impressed\n\neither with the technical skills of the Forest supervisors. They appeared somewhat slap-dash and,\n\nfor plastering work, to rely more on experience than proper training. Mr Koon for example possessed\n\na Skills Evaluation Certificate in Electrical Wiring and Lifting Supervisor Safety. He had no\n\nqualifications in the installation of block walls, brick walls, tiling or plastering works. Whilst\n\nhe had had some experience previously in supervising plastering works, the Woodsvale development was\n\nthe first time in which he had worked in a project which had a number of multi-storey blocks. Yet Mr\n\nKoon was the main supervisor.146. As for Mr Kumar, he had had no formal training in plastering work but had\n\nsupervised plastering and tiling works in more than five projects in Malaysia. His Malaysian\n\nprojects had, however, involved shop-houses, factories and terrace houses, not high-rise blocks. In\n\ntwo of those projects, he had used a premix plastering cement that, according to the product\n\nbrochure, could be mixed either by hand or in a drum. He did not read the Smartplas brochure. All he\n\nknew about mixing it is what Mr Koon had told him and Mr Koons instructions related only to the\n\nproportion of water to be used and not to the method of mixing. I was also amazed by the fact that\n\nMr Shia could describe Mr Choo as a supervisor when it was clear that the latter had neither the\n\nexperience nor the training nor the time to carry out any supervision of the plasterers.147. Having considered the evidence as a whole, I am satisfied that the defects\n\nin the plastering work were the result of poor workmanship on the part of Forest. This being the\n\ncase Forest had to rectify the defects on its own account and cannot claim any money for\n\nrectification work. Its claim for $273,275 for such work mentioned in no. 54 is therefore\n\ndisallowed.(d) What damages can Nakano recover?148. Nakano accepted that the conventional method of rectification of plaster\n\ndefects was to hack out the defective plaster and then re-plaster the area properly. This method of\n\nrectification is also that prescribed by British Standards. In this case, however, Nakano did not\n\nresort to that method in order to rectify most of the defective plaster. Instead, it appointed\n\nAcolite to rectify the debonded plaster by using the pin injection method. Its claim against Forest\n\nfor the sum of $734,450 represents the total charged to it by Acolite ($803,235) less the amount\n\nwhich it claimed from Acolite as backcharges ($68,785).149. Nakano argued that after terminating Forests employment, it had to\n\ncomplete the rectification and outstanding plaster works as soon as possible in order to avoid\n\npaying the owners of the project liquidated damages of $35,000 per day. It argued that had it\n\nemployed conventional plasterers, the rectification work would have taken much longer. Further, no\n\nthird party sub-contractor was willing to quote for hacking and re-plastering of defective plaster\n\nworks. In this respect, Nakano referred to efforts that it had made to obtain quotes from third\n\nparty contractors and the fact that for those portions of the defective areas that were rectified by\n\nconventional means the rectification works were carried out by workers supplied by Yu Bee\n\ncontractors on a daily-rated basis.150. Forest on the other hand submitted that it had never agreed to the\n\nemployment of Acolite as the rectifying contractor. Further, Nakano did not exercise any supervision\n\nor control over Acolites work. There was no control over the number of pins they put in and no\n\nproper explanation was ever given why small areas of debonding required the large number of pins\n\ninserted. No proper negotiations were carried out and Acolites quotation was accepted with\n\nquestion. Further, the original method statement by Acolite required nine pins per metre square.\n\nSubsequently, however, this was changed to 36 pins (at $5 per pin) per metre square. Mr Hattoris\n\nexplanation for the change was that it was required by the architect. Forest complained that the\n\narchitect was not called to verify this nor was there any documentary evidence substantiating the\n\nexplanation. I find Mr Hattoris explanation for the change in the number of pins credible. As\n\nNakano had to pay Acolites bills first with no guarantee of being able to recover any part of the\n\nsame from Forest, it would be eager to ensure that the pin injection costs would be as low as\n\npossible. Quadrupling the number of the pins and thereby quadrupling the costs cannot have been\n\nNakanos idea. I am satisfied that it would not have done this without a positive direction from\n\nthe architect.151. Forest further submitted that it was completely unreasonable for Nakano to\n\nemploy Acolite and incur rectification costs of $803,235 for an area of approximately 4,462 m of\n\nplaster (calculated on the basis that with 36 pins being inserted per square metre, the cost per\n\nsquare metre was $180) when Forest had charged $810,106.25 (based on the original rate without\n\ninclusion of the charges for extra-thickness) for 64,828.5 m of external wall plastered.152. In this respect, Forest as the party in breach of its contractual obligation\n\nto provide proper workmanship in the application of the plaster cannot insist on the rectification\n\nwork being done in any particular manner and at any particular price. As long as Nakano had acted\n\nreasonably in taking the steps that it did to rectify the bad workmanship, Forest would have to pay\n\nfor the same even though the cost is on the high side. In this case, the situation was that Forest\n\nwas having difficulty doing both the rectification work and the plastering work. That was why Nakano\n\nbrought Acolite in in the first place. Although Mr Shia says that he did not agree to Acolite being\n\nbrought in, it seems clear that he did not seriously object to their participation until he received\n\ntheir third bill and found out just how expensive this method of rectification could be. At that\n\nstage, he wrote to Nakano telling them that he had then obtained sufficient labour to carry out\n\nrectification works and asking them to stop Acolites participation. Nakano acceded to his request\n\nfor a few weeks but brought Acolite on site again when it was clear that Forest was lagging behind\n\nin the rectification works.153. The evidence also established to my satisfaction that Nakano had difficulty\n\nin finding a conventional plasterer to carry out the rectification works after it terminated Forest.\n\nIts explanation for these difficulties was a reasonable and credible one. No one wanted the onerous\n\nand time consuming task of rectifying someone elses defects. In the end, it only managed to\n\nobtain plasterers from Yu Bee to rectify the defective internal plastering on a daily basis. The job\n\nhad to be done quickly as Nakano was facing time pressure by reason of the looming deadline for\n\ncompletion of the project. It was therefore reasonable for Nakano to continue to employ Acolite on\n\nthis job although their costs were high. On the question of cost, it must also be observed that in\n\nany case, Nakano would not have been able to employ plasterers to do the rectification work on the\n\nbasis of any rate close to that originally charged by Forest. Forest itself charged differently for\n\nrectification work. Its bill for the rectification work it did was calculated on the basis of number\n\nof workers supplied over a four and a half month period and the cost of the materials. This bill\n\ncame up to $300,000. Yu Bees charges for its supply of daily rated plasterers also shows that it\n\nis expensive to employ plasterers to do conventional plastering when rectification work is involved.154. In the circumstances, Nakano is entitled to recover from Forest the sum of\n\n$734,450 which it paid to Acolite and I award it the same.",
        "(3) Yu Bees invoices": "155. Nakano sought to claim from Forest the amount of $971,156.91 which it paid\n\nYu Bee. In its submissions, it stated that it had had difficulty in engaging third party contractors\n\nto take over Forests incomplete works as well as rectification works. Yu Bee was only prepared to\n\nprovide day workers to do plaster works under the supervision of Nakanos site supervisors. Nakano\n\nhad no choice but to accept this offer although it meant that Nakano would end up assuming the risk\n\nof bad workmanship on the part of Yu Bees workers. Yu Bees workers were used primarily to\n\nrectify the defects in the plastering works and some touch up on the external defects.156. Forest submitted that Nakanos total counterclaim for $2,472,943.92\n\ncovering both defective and incomplete works had not been sufficiently broken down to disclose the\n\nbasis of the various items constituting the counterclaim. In particular, the item of claim based on\n\nYu Bees work cut across both categories but was expressed in the single amount of $971,156.91,\n\napparently for day works. In the end it was not clear whether Yu Bee and the other contractors were\n\ncharging for work done to complete work left undone or to rectify defects.157. I agree with the submission made by Forest that there are two distinct heads\n\nof counterclaim that Nakano must address, namely damages flowing from (a) the alleged failure to\n\ncomplete and (b) alleged defective work. This distinction is particularly important because I have\n\nfound in Forests favour in relation to the termination for the alleged failure to complete whilst\n\nI have found in Nakanos favour in relation to defective works. Since I have found that Nakano\n\nshould not have terminated Forests employment, it cannot recover the cost of employing other\n\ncontractors to complete the work left undone at the time of such termination. It is, however,\n\nentitled to recover the cost of rectifying Forests defective works. As Forest further submitted,\n\nthe onus is on Nakano to satisfy the court how much it incurred in respect of rectification work and\n\nthat the overall amounts that it claimed were properly apportioned between the incomplete work and\n\nthe rectification work.158. Forest submitted that in relation to Yu Bee, Nakano had not properly\n\napportioned the sum of $971,156.91 between rectification works and completion of incomplete works.\n\nAn analysis of Yu Bees bills made by Forest showed that the total amount comprised $370,702.50\n\nfor external bricklaying, $44,091.89 for bricklaying and $556,437.51 for internal wall plastering.\n\nLooking at Yu Bees bills, I could not see how Forest was able to distinguish between the\n\nbricklaying and internal wall charges which together amounted to $600,454.41. As the rectification\n\nof the external walls was done mainly by Acolite, I think the figure of $370,702.50 must have\n\nrelated mostly, if not totally, to plastering of the incomplete areas by Yu Bees workers.\n\nTherefore, it cannot be claimed.159. In relation to the remaining amount, it was the evidence of Mr Zuraimi that\n\nafter Forest had been terminated he had inspected blocks 1 and 3 in order to identify hollows in the\n\ninternal plastering. Thereafter, day workers supplied by Yu Bee worked under his supervision to\n\nrectify the defects in these blocks. The workers hacked and re-plastered hollow areas and also\n\nre-plastered the hacked areas left behind by Forest. They also made good uneven surfaces. The\n\nrectification works were tedious and took about five months to complete. In addition, according to\n\nMr Ling, Yu Bees workers took over all the outstanding plastering of the internal walls.\n\nAccording to him, these were extensive. His listing of the outstanding work is set out in  87\n\nabove. It is impossible for me to apportion the sum of $600,454.41 between the costs incurred for\n\nrectifying defective plaster and those incurred for completing outstanding work. If Nakano kept\n\ndetailed records of what work Yu Bees workers did after January 2000, these were not shown to the\n\ncourt. Nor were Nakanos closing submissions helpful in this regard as there was no attempt there\n\nto break down the sum of $971,156.91 into its constituent items or to give detailed justifications\n\nof the individual components. Accordingly, I cannot make any award in relation to Yu Bees\n\ninvoices.(4) Hai Hwas and Kan Leongs invoices160. Hai Hwa and Kan Leong were the other two third party sub-contractors engaged\n\nto complete the outstanding external plastering works as well as to re-plaster areas that were\n\nhacked by Forest but left unplastered and to touch up uneven surfaces. According to Nakanos\n\nsubmission, Hai Hwa and Kan Leong claimed payment for about 28,000 m of external plastering works\n\nand the difference in their charges and what would have been charged by Forest amounted to\n\n$85,327.89 and $98,875 respectively.161. In its submissions, Nakano did not distinguish between the amount that it\n\npaid to these two sub-contractors for rectification work and the amount that it paid them for\n\ncompleting the external plastering. As I have stated, Nakano is not entitled to recover any amount\n\npaid for completion work since it should not have terminated Forests employment. As there is no\n\nindication of the figures paid in respect of rectification work, I cannot make any award in favour\n\nof Nakano to compensate it for the rectification costs, if any, it paid to Hai Hwa and Kan Leong.(5) Defective tiling works162. Nakano submitted that there were defective works in the tiling sub-contract.\n\nBy this sub-contract, Forest was supposed to carry out the tiling works in all 696 units in the\n\nproject. In April 2000, however, Forests tiling works were terminated by Nakano because the works\n\nwere defective and slow. At that time, Forest had completed tiling in only 72 units. Messrs Wong Kan\n\nThong was engaged to take over the remaining units. At the same time, Forests tilers continued to\n\nrectify the defective works. As they were unable to complete the rectification work, Messrs Wong Kan\n\nThong had to take those over as well and charged Nakano $13,050 for the same. Nakano seeks to\n\nrecover that sum from Forest.163. The evidence of Mr Koon was that Forest had completed all its tiling work by\n\nJune 1999. Thereafter, its workers did rectification work on the tiles as and when the defects were\n\npointed out by Nakano. These rectification works were completed by December 1999 and Mr Koon stated\n\nthat he had not received any further complaint about defective tiling work thereafter. Forest\n\nsubmitted that the evidence adduced by Nakano did not make it clear what kind of defects were found\n\nin Forests tiling works or when these defects occurred. Nor was there any detailed evidence on\n\nthe alleged rectification work.164. I, too, find Nakanos submissions and evidence on this point to be\n\nperfunctory. I am unable to make a finding in its favour on this issue as it had not been proved.(6) Rental of gondolas and climbing platforms165. Nakano claims $415,146.62 as the costs of additional rental of the gondolas\n\nand climbing platforms during the period between 15 December 1999 and 31 March 2000. Its case is\n\nthat had Forest completed its external plastering works according to sequence and within schedule,\n\nNakano would not have incurred these additional costs. Whilst Nakano conceded that there may be some\n\noverlap in the claim as the gondolas were also necessary for the painting works, it submitted that\n\nhad it not been for Forests delay, it would not have been necessary for it to rent the gondolas\n\nand climbing platforms for the additional few months. It should be noted that according to Mr\n\nHattoris affidavit, Nakano had to pay for rental of gondolas and climbing platforms right up to\n\nJune 2000. Although the rectification works went on till June 2000 and the plastering works by Kan\n\nLeong were completed only at the end of May 2000, Nakanos claim was up to the end of March 2000\n\nonly to take into account that some platforms and gondolas were used for painting.166. Forest submitted that there is absolutely no merit in this claim. The\n\ngondolas and working platforms were part of the general facilities provided by Nakano for the use of\n\neveryone on site. As Mr Hattori had admitted in cross-examination, these facilities were used by the\n\nother sub-contractors both before and after Forest had left the site. Forest further submitted that\n\nthese facilities should be treated in the same way as the tower cranes and other hoisting facilities\n\nprovided by Nakano. It did not occur to Mr Hattori that Nakano should claim against Forest for the\n\ncosts of supplying these facilities even though the hoisting equipment was used by various\n\nsub-contractors after Forest had left the site.167. This is another claim which has been insufficiently particularised by\n\nNakano. The period covered by the claim is from December 1999 to March 2000 whilst the hiring\n\nplatforms and gondolas were on site until June 2000. It is not clear whether these platforms and\n\ngondolas were at any time occupied exclusively by plasterers or whether during the whole of the\n\nperiod they were occupied by both plasterers and painters. A lot of the plaster work had been\n\ncompleted by the end of December 1999. Even if Nakanos estimate of 30% of external plaster work\n\nbeing incomplete at the time of Forests termination is accepted as accurate, that would mean that\n\n70% of the plaster work had been completed and that a substantial amount of painting could be done.\n\nNakano has recognised that it cannot claim hire for the gondolas and platforms during the times that\n\nthey were occupied by painters. Seeing that there was overlap in the use of the equipment by\n\npainters and plasterers, it was up to Nakano to establish to my satisfaction how much of the costs\n\nit incurred in hiring the equipment could be attributed solely to the extended plaster works. It did\n\nnot do this. It made a rough estimation that that the plaster works took about three and a half\n\nmonths out of the total six and a half months that it had to continue to hire the gondolas and\n\nclimbing platforms. I am not able to award it damages on this basis.(7) Fines and damages168. Nakano is claiming the sum of $16,000 in respect of fines which it imposed\n\non Forest during the course of its works and which Forest had not yet paid. It submitted that all\n\nthe sub-contractors working on the project had agreed to the system of fines and penalties. The\n\npurpose of these fines was to maintain a safe working environment. The rules and fines were agreed\n\nupon at Safety Committee meetings chaired by the safety officer and attended by the representatives\n\nof the various sub-contractors. Throughout the course of the project, Forest had been fined by\n\nNakano of various acts of non-compliance with these rules. It had only objected on one occasion when\n\nit was fined for having illegal workers on site. After investigating Forests assertion that the\n\nillegal workers were not its employees, Nakano refunded the sum of $3,500 to Forest.169. Forest submitted that there was no legal basis to justify this claim. I\n\nagree. Simply being the main contractor does not give Nakano a right to fine its sub-contractors for\n\nbreach of safety rules and other regulations which it might seek to enforce on site. The\n\nsub-contractor must agree to this situation. Alternatively, there must be a law permitting the\n\nimposition of fines in such circumstances. In this case, neither situation exists. There is no\n\ncontractual term allowing Nakano to impose fines on Forest. This claim cannot be allowed either.",
        "Conclusion": "170. In respect of Forests claim, I have found that it is entitled to recover\n\n$1,670,177.96 as the balance due in respect of the works performed by it and the sum of $7,264.24 as\n\ndamages for wrongful termination. As against this, I have found that Nakano is entitled to\n\ncounterclaim the sum of $734,450 in respect of the costs of rectifying the defective plaster works.\n\nThis must be set-off against the amount of Forests claim. Forest is therefore entitled to\n\n$942,992.20.171. I therefore give judgment in favour of Forest in the sum of $942,992.20\n\ntogether with interest thereon at the rate of 6% per annum from the filing of the writ. As regards\n\ncosts, although Forest has succeeded on its claim, it has lost on one major issue ie that relating\n\nto defective works and I think that there should be some adjustment in the costs order to reflect\n\nthat. I will therefore hear the parties on costs.",
        "Judith Prakash": "JudgeCopyright © Government of Singapore."
    }
}