{
    "case_title": "Hou Ai Hui v Public Prosecutor",
    "ncitation": "[2001] SGHC 238",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The prosecutions case": "3 The prosecutions version of the facts was based mainly on the testimony of\n\nLim. They adduced evidence that on 1 March 1997 the appellant engaged Lim to conduct investigations\n\non her husband, one Tan Poh Chye (\"Mr Tan\"), who was carrying on an extra-marital affair\n\nwith one Kwek Geok Moi (\"Ms Kwek\") at Ms Kweks Yishun residence. Lim agreed to carry\n\nout observations on the couple for the month of March 1997 for $ 1,500. After conducting the\n\nobservations for one month, Lim submitted his first investigation report to the appellant. Lim\n\ntestified that the appellant found the report inadequate, and asked that he include more\n\ninformation. Lim agreed to do so and carried out observations on the couple at Yishun for the month\n\nof April 1997. As Lim did not receive extra payment for the observations in April, he only conducted\n\nsurveillance randomly. The observations in April did not produce any evidence of Mr Tans\n\nextra-marital affair. Lim informed the appellant who then asked that he continue to observe the\n\ncouple but this time at her own matrimonial home in Jurong West.4 The observations at Jurong West did not disclose anything. Lim informed the\n\nappellant accordingly. She expressed disbelief that no evidence could be gathered and insisted that\n\nLim continue to carry out further observations. These further observations were also futile as they\n\ntoo did not yield any evidence of the extra-marital affair.5 Lim then submitted a new report documenting his observations on the dates in\n\nMarch, April and May when he conducted surveillance and explained its contents to her. This new\n\nreport did not contain any information suggesting that Mr Tan and Ms Kwek were involved in an\n\nextra-marital affair. Lim testified that the appellant then informed him that she had witnesses who\n\ncould testify to the couples co-habitation in the Jurong West flat on 8, 9, 10, 11, 14, 22 and 23\n\nApril 1997 (\"the material dates\"). Lim accepted what the appellant had told him and\n\ninserted the said dates and events into his investigation report (\"P4\") dated 28 May 1997.\n\nHe then handed the amended report, P4, to the appellants sister one Hou Yan Hui.6 Lim further testified that he had admitted to the appellant that he had not\n\nseen Mr Tan and Ms Kwek on the said dates. He added that had the appellant not told him that she had\n\nwitnesses who could testify to the incidences of co-habitation, he would not have included the false\n\nentries into the report, P4.7 It was not disputed that P4 was subsequently filed in court, via Lims\n\naffidavit in support of the appellants divorce proceedings. Mr Tan and Ms Kwek corroborated the\n\ntestimony of Lim. They testified that they had not co-habited at the Jurong West flat on the said\n\ndates.",
        "The appellants case": "8 The appellants case was based mainly on the appellants testimony. Her\n\nevidence, in so far as it was material, was that Mr Tan and Ms Kwek did in fact cohabit at the\n\nJurong West flat on the dates in April which were stated in P4. The appellant also denied that she\n\nhad anything to do with Lims compilation of P4 and claimed that she had no knowledge of P4 until\n\nit was produced in court.Decision of the Court below9 The district judge, who had the opportunity to observe the credibility and\n\nveracity of the witness, found the appellant to be an unreliable witness and rejected her evidence.10 In finding that the appellant knew and intended that P4 be relied upon and\n\nused in her divorce proceedings, the trial judge also relied on a transcript of a telephone\n\nconversation between the appellant and Lim (\"P7\") adduced by the prosecution as compelling\n\nevidence against the appellant. He found that the contents of P7 clearly corroborrated Lims\n\ntestimony that it was the appellant who had directed Lim to make the false statements in P4 so as to\n\nexpedite her divorce proceedings.The Appeal11 At the hearing before me, counsel for the appellant, Mr Spencer Gwee (\"Mr\n\nGwee\"), contended that the prosecution had failed to establish the elements of the offence\n\nbeyond a reasonable doubt. Mr Gwee also contended that the trial judge had erred in fact by\n\naccepting the evidence of Lim and failing to sufficiently examine the evidence and defence of the\n\nappellant. After hearing his arguments, I found them to be of little or no meritand\n\ndismissed the appeal accordingly. I now set out my reasons.",
        "Unreliability of Lims testimony": "12 As this appeal deals essentially with issues of fact, the respective versions\n\nof the facts given by the prosecution and the appellant will inevitably be in conflict. The trial\n\njudge is therefore tasked with deciding whose version of the facts to believe. To this end, it is\n\npertinent to state the well-established principle that an appellate court should not disturb the\n\ntrial judges finding of facts unless they were clearly reached against the weight of evidence or\n\nif they were clearly wrong. Further, where the trial judges finding of fact was based on his\n\nassessment of the witnesses credibility and veracity, as in the present case, the appellate court\n\nshould be even more reluctant to overturn such findings:Lim Ah Poh v PP[1992] 1 SLR 713, Yap\n\nGiau Beng Terence v PP[1998] 3 SLR 656, Tan Hung Yeoh v PP [1999]3 SLR 93, Ng Chiew Kiat v PP[2000] 1 SLR 439.13 In his attempt to convince me to reject Lims testimony, Mr Gwee submitted\n\nthat Lims testimony was unreliable as he had a motive to lie. He also submitted that the trial\n\njudge had failed to accord proper weight to the evidence of the defence witnesses. I note that the\n\ntrial judge found that Lim had no reason to lie and implicate the appellant. He ruled that Lim quite\n\nclearly had no interest in the outcome of the trial or the divorce proceedings between the appellant\n\nand Mr Tan. As such, he accepted the evidence of Lim. On the other hand, the trial judge found the\n\nappellant to be an unreliable witness. He also held that he was unable to accept the evidence of the\n\nappellants sister and mother in the absence of independent corroboration as they were interested\n\nwitnesses.14 As the above allegations do not demonstrate that the trial judges finding\n\nof facts was clearly reached against the weight of evidence or that they were clearly wrong, I see\n\nno reason for me to overturn the trial judges finding of facts and I accordingly accept the\n\ntestimony of Lim.",
        "Ingredients of the Offence": "15 It was held inPP v Ng Ai Tiong[2000] 1 SLR 454that the\n\noffence for instigating the fabrication of false evidence comprises four elements, each of which\n\nmust be proved beyond a reasonable doubt in order to establish conviction. On the present facts, the\n\ningredients of the offence were as follow:(i) that Lim made a false statement;(ii) the appellant knew the statement to be false;(iii) the appellant instigated Lim to make the statement; and(iv) the appellant intended to use the statement in her divorce proceedings.",
        "(i) Whether Lim made a false statement": "16 Mr Gwee contended that there was insufficient evidence to prove that the\n\nalleged observations in P4 on the material dates were in fact false. This was because, under\n\ncross-examination, Lim admitted that he conducted only random observations at the Jurong West flat\n\nduring the material dates in April 1997. On top of that, Lim also admitted that he worked together\n\nwith his partner, one \"Ah Chui\", to conduct surveillance on Mr Tan and Ms Kwek. Sometimes\n\nthey would work independently of each other in conducting surveillance. Lim further admitted that\n\nthe report P4 was based on the observations of both himself and Ah Chui and that he could not\n\nremember if Ah Chui was on duty on any of those material dates in April 1997.17 I found Mr Gwees submission that Lim had conducted surveillance on the\n\ndates in April 1997 to be totally irrelevant. The fabrication of false evidence lay in the fact that\n\nLim claimed in P4 to have observed the couple when in fact he had not done so. Lim had maintained\n\nthroughout his cross-examination that he did notseethe couple at all during his random\n\nobservations on the material dates in April 1997. This fact, being the crux of the present charge,\n\nwas not disputed by the appellant either before me or at the trial below.18 In addressing Mr Gwees submission concerning Ah Chui, I noted that Ah Chui\n\nwas not produced as a witness at the trial below. The prosecution explained that they had no means\n\nof tracing him. They explained that Lim only knew Ah Chui as a part-time staff, and did not have any\n\nother information on him since he stopped work. I was satisfied with the prosecutions reasons for\n\nnot producing Ah Chui as witness. Notwithstanding that the court did not have the benefit of Ah Chuis\n\ntestimony, I found that there was no \"real probability\" that Lim could have reported Ah\n\nChuis actual observations of the couple. This was because Lim testified that Ah Chui, being his\n\nsubordinate, would always report his observations to him. Lim, who bore the sole responsibility of\n\ncompiling the report, would then include in the report Ah Chuis account of his observations.",
        "(ii) Whether the appellant knew the statement to be false": "19 Mr Gwee contended that the appellant did not know that the statement was false\n\nbecause she knew for a fact, and had witnesses to affirm, that Mr Tan and Ms Kwek were co-habiting\n\non the material dates. Mr Gwee also submitted that the trial judge did not give due weight to the\n\nappellants defence that she did not understand the contents of P4 as her command of English was\n\npoor. In this connection, the appellant had also testified that she did not try to discover the\n\ncontents of the report.20 The requisite level of knowledge for this limb of the charge was met as long\n\nas the appellant knew that Lim did not witness the events on the material dates himself. Lim had\n\ncategorically informed the court that he did not see the couple entering or leaving the matrimonial\n\nhome in Jurong on the material dates. Lim also testified that when the appellant told him to include\n\nthe entries of the material dates in P4, he informed the appellant specifically that he did not see\n\nthe couple on those material dates. This having been established, it was inconsequential whether Mr\n\nTan and Ms Kwek were in fact co-habiting on the material dates or, for that matter, that the\n\nappellant had actually seen them engage in the act of sexual intercourse.21 With regard to Mr Gwees contention that due weight was not accorded to the\n\nappellants defence, I found it inconceivable that she could not have known about the contents of\n\nP4. Her alleged ignorance of the report when she was the one who commissioned the report in the\n\nfirst place flew in the face of logic. It was unimaginable that she would not have even attempted to\n\ndiscover the contents of the report when she had revealed herself to be interested and anxious about\n\nthe report to be tendered in support of her divorce proceedings. Her claims that neither Lim nor any\n\none of the previous three lawyers she had engaged (including the lawyer handling her divorce) had\n\nexplained the contents of P4 to her was equally unbelievable. To this end, I concurred entirely with\n\nthe trial judges decision not to accord any weight at all to her evidence.",
        "(iii) Whether the appellant instigated Lim to make the false statement": "22 Mr Gwee contended that, apart from Lims testimony, there was no evidence to\n\nprove that the appellant instigated Lim to make the false statements. He pointed out that the\n\nsubject matter of the conversation between the appellant and Lim contained in the transcript, P7,\n\ndid not contain any incriminating evidence against the appellant. He submitted first that the report\n\nreferred to in the taped conversation was a report dated 28 May 1997 (\"D5\") and not the\n\nalleged report put up by Lim which was subsequently altered to form P5. Secondly, he submitted that\n\nthe taped conversation \"at best\" revealed the appellant taxing Lim for his failure to\n\ninclude the dates in March and May 1997 when she had told Lim to come down to conduct observations\n\nas the couple was in the flat. Mr Gwee further submitted that P7 also revealed the appellant making\n\nenquiries as to why Lim had omitted to mention the presence of her mother at the flat on 8 April\n\n1997.23 The relevant parts of the conversation, translated from mandarin, are set out\n\nbelow:At page 8 of the transcript:",
        "Hou: Then the last time you wrote in the report, you only wrote about the 10th.\n\n  That is to say, I told you about the 8thof April and the 10thof April\n\n  nights, he brought the woman here.": "At page 9 of the transcript:",
        "Hou: No, you record this down now. That is on the 8thand 10th,\n\n  my mother was around. You only wrote in the report about the 10thshe was around only.\n\n  Now I have your report in my hands.": "24 The prosecutions written submission argued that D5 could not possibly be\n\nthe report referred to in P7 for two main reasons. First, the transcript of the conversation as set\n\nout above showed that there was at least one previous report that did not include an entry for 8April 1997. D5 showed that there was an entry for 8 April 1997. Second, if the court were to\n\naccept the appellants claim that the conversation at page 9 of the transcript (as excerpted\n\nabove) merely showed her enquiring why the presence of her mother on 8 April 1997 was not stated in\n\nD5, then it followed from a plain reading of the excerpt that the court must also accept that D5\n\ncontained an entry dated 10 April 1997 which referred to the appellants mother. I found that the\n\nentry in D5 for 10 April 1997 made no such reference to the appellants mother. Instead, the entry\n\nfor 10 April 1997 documented Mr Tan and Ms Kwek arriving together at the Jurong West flat at about\n\n12:30am.25 Given that the authenticity of the tape recording and the accuracy of the\n\ntranscript were not in issue, it was a question of interpretation whether P7 corroborated Lims\n\nevidence. From my reading of the transcript, I accepted the prosecutions arguments that P7 did\n\nnot refer to D5. Accordingly, I agreed with the trial judge in finding that P7 was compelling\n\nevidence which proved the element of instigation.",
        "(iv) Whether the appellant intended to use the report in support of her divorce\n\nproceedings": "26 Mr Gwee contended that the appellant had no motive, and therefore no\n\nintention, to use the report in support of her divorce proceedings. This was because she already had\n\nsufficient evidence to prove the fact of adultery in the form of a photo of her husband cavorting\n\nwith another woman in Taiwan. Taking Mr Gwees contention to its logical conclusion, the question\n\nwhich begged itself was: If the appellant had no motive to use the report because she had sufficient\n\nevidence to prove her husbands adultery, then why did she put herself through the trouble and\n\ncost of engaging a private investigator in the first place?27 Even if I were to accept that the appellant had no motive to use the report, a\n\nlack of motive does not automatically equate to an absence of intention. Motive is merely a test of\n\nintention. It is not an ingredient of the offence of fabricating false evidence (seeKoh Pee Huat\n\nv PP[1996] 3 SLR 235). Notwithstanding that the appellant admitted under cross-examination that\n\nshe intended to use P4 in her divorce proceedings, I was satisfied on the facts that the requisite\n\nintention was established by the appellants very act of commissioning a private investigator to\n\nconduct surveillance on her husband.",
        "Appeal on Sentence": "28 The appellant also appealed against the sentence on the ground that it was\n\nmanifestly excessive.29 In view of the fact that the offence under s 193 is a serious offence that\n\nperverts and undermines the administration of justice, I found that the sentence was not manifestly\n\nexcessive. This was especially as the first limb of s 193 strikes at the very root of the justice\n\nsystem that is designed to protect society.Conclusion30 For the reasons set out above, I found that the prosecution had established\n\nbeyond a reasonable doubt that the appellant had directed Lim to include the entries on 8, 9, 10,\n\n11, 14, 22 and 23 April 1997 as eye-witness accounts when in fact they were not.Appeal dismissed and conviction and sentence affirmed.Sgd:YONG PUNG HOWChief JusticeCopyright © Government of Singapore."
    }
}