{
    "case_title": "Nicholas Hugh Bertram Malcomson and Another v Naresh Kumar Mehta",
    "ncitation": "[2001] SGHC 309",
    "coram": "Lee Seiu Kin JC",
    "sections": {
        "The Pleaded Facts": "10 I turn now to the facts pleaded in the Amended Statement of Claim.\n\nIn the particulars pleaded under para 5, the Plaintiffs alleged that the following had\n\noccurred after Mehta had ceased employment:(i) Between May 2000 and June 2000, the Defendant telephoned Malcomson\n\n  at the Premises on not less than 10 occasions;(ii) Between October 2000 and April 2001, the Defendant sent 8 e-mails\n\n  to Malcomson which he retrieved at the Premises and elsewhere;(iii) In November 2000, the Defendant sent Malcomson 2 facsimiles and 1\n\n  bouquet of flowers at the Premises;(iv) On 22 October 2001, the Defendant procured a third party, whose\n\n  name and identity is unknown, to telephone Malcomson at the Residence at 6.00 am;(v) On 1 April 2001, the Defendant trespassed on the Residence while\n\n  Malcomson was overseas. He demanded and obtained from Malcomson’s maid the latter's\n\n  confidential mobile phone number. On the same day, the Defendant made 3 calls to Malcomson\n\n  at his mobile phone. These calls were received by Malcomson while he was outside the\n\n  Residence.(vi) On 22 April 2001, the Defendant trespassed on the Residence and\n\n  delivered a greeting card addressed to Malcomson and his wife. This was a card normally\n\n  used to congratulate couples over the birth of a new-born baby. The Defendant was aware\n\n  that this was close to the anniversary of the death of their infant son.(vii) Following his resignation in May 2000, the Defendant sent\n\n  numerous e-mails and SMS messages via mobile telephone to various employees and directors\n\n  of Zerity, namely the Chief Financial Officer Nachiappan Alagappan, the Chief Operating\n\n  Officer Cavin Choo and Malcomson. The e-mails and messages were received at the Premises\n\n  and elsewhere.11 In the particulars pleaded under para 9 of the Statement of Claim,\n\nthe following additional facts were alleged:(i) Between May 2000 and June 2000, the Defendant telephoned Marianne\n\n  Lim, Nachiappan Alagappan, Cavin Choo and Martin Buchholz, employees of Zerity, at the\n\n  Premises on a total of 15 occasions;(ii) In October 2000, the Defendant telephoned Marianne Lim, the Human\n\n  Resource Manager of Zerity, at the Premises on 3 occasions;(iii) Between October 2000 and April 2001, the Defendant sent a total\n\n  of 31 e-mails to Marianne Lim, Nachiappan Alagappan, Cavin Choo, Martin Buchholz and\n\n  William Scrimgeour, employees of Zerity, at the Premises;(iv) In November 2000, the Defendant sent a bouquet of flowers and 2\n\n  greeting cards to Marianne Lim, Nachiappan Alagappan and Cavin Choo at the Premises;(v) On 1 June 2001, the Defendant attempted to wrongfully enter the\n\n  Premises.12 And finally, in para 10 of the Statement of Claim, the following\n\nadditional particulars were pleaded:(i) In May 2000, the Defendant wrongfully entered the Premises on at\n\n  least 2 separate occasions;(ii) On 24 October 2000, the Defendant wrongfully entered the Premises;13 In respect of the first two causes of action, i.e. trespass and\n\nnuisance in respect of the Residence and the Premises, on the pleadings the Plaintiffs\n\nhave established the bases for them. The Plaintiffs have alleged that Mehta had trespassed\n\nor attempted to trespass the Residence and the Premises. The persistent faxes, telephone\n\ncalls and e-mail retrieved at either location would interfere with the Plaintiffs’\n\nuse and enjoyment of the land. These acts collectively constitute the tort of nuisance in\n\nrelation to the Residence and the Premises.14It is the third cause of action that requires consideration.\n\nThis is because harassment is not an established tort. However Mr Pillai urges that the\n\ntime has come for the Court to give recognition to it as an actionable tort. Before\n\nturning to examine the relevant developments in the law pertaining to this, I first set\n\nout factual circumstances. I am aware that in the present application it is not necessary\n\nto look at the evidence. However due to the unique circumstances of the present case, it\n\nwould be useful to do so in order to obtain a full picture of the harassment complained\n\nof. Malcomson had filed an affidavit on 6 June 2001 in support of the application for\n\ninterim injunction and it is based on that affidavit, along with the documents exhibited,\n\nthat the findings of fact are based.",
        "The Facts from Malcomson’s Affidavit": "15 The substantive complaint of Malcomson in respect of harassment is\n\nthat Mehta:(i) sent e-mails to Malcomson, some of which he had retrieved outside\n\n  the Premises;(ii) obtained the confidential mobile phone number of Malcomson and\n\n  made calls to that number which Malcomson received outside the Residence; and(iii) sent numerous e-mails and SMS messages via mobile phone to\n\n  Malcomson and various employees and directors of Zerity, some of which were received\n\n  outside the Premises.16 It was Mehta who had resigned of his own accord. It is not known\n\nwhether he was pressured to do so, but this was not asserted in the e-mail he sent on 28\n\nApril 2000 in which he tendered his resignation. However, shortly after his departure, in\n\nMay 2000, Mehta started making persistent calls to the various directors of Zerity,\n\nincluding Malcomson, Alagappan (the Chief Financial Officer), Choo (the Chief Operating\n\nOfficer), Buchholz (the Chief Technology Officer) and Lim (the Human Resources Manager).\n\nHe also sent them e-mails and SMS messages via their mobile phones. These communications\n\nvaried from pleas to reinstate his employment to allegations of misconduct, incompetence\n\nand neglect of duties on the parts of Zerity’s employees. On two occasions Mehta\n\nappeared unannounced at the Premises to demand his job back. Lim, who met him on those\n\noccasions, told him that this was not possible and that he should get on with his life.17 Around 6 June 2000, at the insistence of Mehta, Malcomson met him at\n\nthe Starbucks coffee house at Temasek Towers. Mehta told Malcomson that he wanted to\n\n\"re-establish good relations\". He also wanted his job back. Malcomson asked\n\nMehta to stop annoying the directors of Zerity and to leave the company alone. He told\n\nMehta that Zerity intended to issue a \"formal complaint\" to him. Mehta pleaded\n\nwith Malcomson not issue such a complaint and promised that he would cease all contact\n\nwith Zerity’s employees and related third parties. In view of this, Malcomson agreed\n\nnot to \"issue\" the complaint.18 However matters did not end there. From October to early November\n\n2000, Mehta sent e-mail messages to Malcomson and various other directors and employees of\n\nZerity. In these messages he levelled accusations at the recipients of giving him a bad\n\nreference to a potential employer, Loh. Malcomson was annoyed by this because to his\n\nknowledge, Zerity had not given any such reference. Mehta had attached an e-mail from Loh\n\nto him to support his accusation. Loh’s e-mail states as follows:Naresh,After the latest incidences of unsolicited calls at night and numerous\n\n  emails, I have made various reference checks on your background including your stints in\n\n  Finesse Alliance, Keppel and [Zerity].I regret to inform you that your profile will not fit my requirements,\n\n  and hence I have no need to meet you on Monday as planned. …19 Lim subsequently received an e-mail from Loh in which the latter\n\napologised for any inconvenience caused as a result of his e-mail to Mehta. Loh later\n\ntelephoned Lim and clarified that he had not spoken to anyone in Zerity about Mehta and\n\nthat the reference on Mehta he obtained was from a third party. Loh said that he had\n\nreceived persistent calls and e-mails from Mehta insisting on a job interview and so he\n\nhad sent that e-mail to Mehta.20 On the morning of 21 October 2000, a Saturday, Mehta telephoned\n\nZerity's solicitor, Joyce Tan of Joyce A. Tan & Partners. Tan had drafted the\n\nemployment contract between Mehta and Zerity. She is also Zerity's company secretary.\n\nMehta introduced himself as \"John Tan\" and made arrangements to meet her the\n\nsame day about an employment matter. Shortly afterwards he turned up at Tan's office. Tan\n\ntold him to leave. Mehta however insisted on having a discussion with her. He eventually\n\nleft the office but not before making a nuisance of himself.21 That afternoon Mehta sent an e-mail to Malcomson and Lim demanding\n\nreinstatement of his employment with Zerity. He stated the following:I have also written to you all to reconsider my case in the past and\n\n  also the NULL VOID case of the letter of appointment issued to me. I need an answer by\n\n  Monday and would like to settle this issue in a nice manner before I escalate it to the\n\n  next level of seeking justice.I have arrived at this conclusion that my letter of appointment given\n\n  to me via the below email was Null and Void. Factor-e Asia Pte Ltd, First-e Asia Pte Ltd,\n\n  First-e OUB Asia Pte Ltd were formed only on 01/03/2000 while the letter was issued to me\n\n  in Feburary 2000 as the date stated below.He went on to demand reinstatement on the following terms:1. No Termination Clause till December 20012. You shall reinstate me immediately with the AVP Position and all the\n\n  benefits, overseas training and other product training that have been deprived from me\n\n  including stock Options from the date of Joining. Under what bad circumstances and\n\n  abusement [sic] I had been told to tender resignation will be considered as Null\n\n  and Void.3. Apology for all the harassement [sic] I went thru in finding\n\n  a Job in a very tight job market, Bad Comment I received from various employers and\n\n  First-e employees \"willingly\" coming to my house taking my notebook and cleaning\n\n  all the stuff searching my house etc. etc. on the instructions of [sic]4. The Human Resource Manager- Marianne Lim was appointed after me so\n\n  she has no right to handle my case at that point of time or until asked for.5. You shall with immediate effect refrain to write or speak any\n\n  adverse comments about my performance or anything else that shall spoil my image/\n\n  reputation etc to any of my prospective employers and shall write to all those employers\n\n  who you have already to undone the damage as an apology (including BroadVision Singapore\n\n  whose email is below)\"22 On Sunday 22 October 2000, at about 6 o'clock in the morning, the\n\ntelephone at the Residence rang. Malcomson answered it and a lady’s voice at the\n\nother end introduced herself as Mehta’s sister. She wanted to talk about Mehta's\n\nemployment in Zerity. Annoyed at receiving the call at such an early hour, Malcomson told\n\nher that he had already put Mehta on notice not to make further contacts with him, either\n\npersonally or through his representatives. At this the lady apologised and hung up. That\n\nnight, Alagappan and Scrimgeour (employees of Zerity), informed Malcomson via e-mail that\n\nMehta had, to their great annoyance, telephoned them on Saturday 21 October 2000 and\n\nSunday 22 October 2000 respectively to complain about his failure to be reinstated.23 On 23 October 2000, Mehta telephoned Lim at the Premises. He told\n\nher that he would report for work the next day. He demanded to be provided with a desk and\n\na telephone at the Premises. Lim told Mehta that Zerity would not consider reinstating\n\nhim. Notwithstanding this, Mehta insisted on turning up for work the next day. And he\n\nlived up to his word by appearing at the Premises at 8.45 am the next day. Lim told him to\n\nleave immediately, warning him that she would summon the police otherwise. At this, Mehta\n\nleft. Later that day, Mehta telephoned Lim at the Premises. He threatened to inform the\n\npress that his house was ransacked by Zerity at the time his employment was terminated.\n\nMalcomson explained that at that time, Alagappan, Choo and Lim had called at Mehta's\n\nresidence to check if he had kept any information pertaining to Zerity in his notebook\n\ncomputer. Mehta had willingly submitted himself to the check, which revealed that he was\n\nindeed in possession of information and intellectual property belonging to Zerity. He was\n\nasked to erase the information from his computer and he complied.24 On 27 October 2000, Mehta telephoned Lim at the Premises. He again\n\ndemanded to be reinstated. She was annoyed at his persistent demands and told him once\n\nagain that Zerity would not reinstate him.25 In the evening of 31 October 2000, Malcomson received an e-mail from\n\nMehta. Again he asked for reinstatement with Zerity. He also threatened to complain about\n\nZerity to the authorities should he not be re-employed. The relevant excerpt of the e-mail\n\nis as follows:This morning at 11.15 am I have passed the necessary papers along with\n\n  the ROC/ROB registered papers to the front recep. I would like to resolve this issue on a\n\n  co-ordial manner and peacefully.I have already emailed to you that I would like to resolve this on a\n\n  lunch table today but later on calling found that all people missing in the office. I have\n\n  given my word to Gerhad Huber, Chairman of the company and CEO Nicholas Malcomson that I\n\n  would like to settle this issue in a nice and professional way.However if the company and responsible people still would like to test\n\n  my patience then I had a small chat with the Management Consultants in a nice way\n\n  regarding ROB/ROC issues in a general manner. Under the act the following breaches takes\n\n  place1. Breach of Contract Act-Both employment and Company Act. The company\n\n  and the relevant companies can be taken for task.2. Breach of Contract Ractification by Lawyers and other necessary\n\n  Board of Directors. They can be struck of LawBar Payroll if I take the matter to that\n\n  level.Leading to cease of their operation and cannot work or operate business\n\n  in Singapore and all the directors and company secretaries will be liable for prosecution.26 By a letter dated 1 November 2000, Zerity's solicitors, Messrs Allen\n\n& Gledhill, requested Mehta to stop harassing and making unsolicited communication\n\nwith the employees of Zerity. Mehta was also warned not to enter the Premises. Mehta\n\nreplied to this letter by e-mail on the same day. In the e-mail, he apologised for his\n\nactions and agreed not to harass or contact Zerity's employees. The relevant excerpt of\n\nhis e-mail is reproduced below:I have forgiven your client and all their staff for the so \"called\n\n  employment letter\". Having read the contents of the same. I will here by from\n\n  02/11/2000 shall just follow the said contents in it.Please accept my apology if I have hurt anyone's feeling directly or\n\n  indirectly/intentionally or non intentionally. I hereby wish you all the best in whatever\n\n  you people do for we small people. I hold no prejudice about the company or any of its\n\n  persons. However on record I would like to keep injustice was done to me.27 However Mehta continued to send numerous e-mails, faxes, cards and\n\neven flowers to Malcomson and other employees of Zerity at the Residence and the Premises.\n\nMessrs Allen & Gledhill sent another letter, dated 10 November 2000, to Mehta to warn\n\nhim again not to harass or communicate with Zerity's employees. He responded by sending to\n\nAllen & Gledhill two faxes the same evening as well as an e-mail at about 1.32am on 11\n\nNovember 2000. In the first telefax, he confirmed that he had already promised and\n\n\"given his word of honour\" that he would not further communicate with Zerity. He\n\nadded that it was Lim who had telephoned to thank him for the flowers he had sent. He\n\nfurther claimed that it was Alagappan who had telephoned him to tell him that he\n\n(Alagappan) was leaving Zerity and that Mehta should contact Malcomson in respect of any\n\n\"pending issues in the near future\". In the second fax, he accused Messrs Allen\n\n& Gledhill's clerk of forcing his entry into his home to deliver their letter dated 10\n\nNovember 2000. In an e-mail dated 11 November 2000, Mehta raised the issue of Messrs Allen\n\n& Gledhill's letter dated 10 November 2000. He wrote as follows:I am writing to you and also have spoken to you asking if you have any\n\n  concerns in a nice manner however you still send me the letter which is not professional.\n\n  Please do not test my patience. I am a nice person and a gentleman…28 When Malcomson checked with Lim, she said that it was Mehta who had\n\ntelephoned her to ask if she had received the flowers. She had told him not to send\n\nanything or call her again. Lim however recalled an incident which occurred a few days\n\nearlier when she had telephoned Mehta by mistake. As soon as she realised this, she\n\napologised and discontinued the conversation. As for Alagappan, he clarified that the\n\nreason he telephoned Mehta was to tell him that he was leaving Zerity so that Mehta would\n\nstop calling him. Prior to that, Mehta had been calling him frequently on the telephone,\n\nsometimes through third parties and had become \"too much of a nuisance\". Mehta\n\nhad also turned up at Alagappan's house unannounced on 5 November 2000 only to be told to\n\nleave immediately.29 Finally, in paras 44 to 52 of his affidavit, Malcomson sets out the\n\nlatest incidents as follows:44. Between 12 November 2000 and 31 March 2001, the Defendant, to my\n\n  knowledge, did not make any contact with the employees of [Zerity] or myself.45. On 1 April 2001, the Defendant came to my residence, uninvited, and\n\n  asked to see me. At that time, I was overseas. Our maid, Rosmina, informed him that I was\n\n  not around. The Defendant in an extremely belligerent manner demanded that my maid give\n\n  him my handphone number. My maid was reduced to tears by his conduct. She was eventually\n\n  forced to reveal my mobile phone number. This is a private number, which I do not give it\n\n  to anyone outside the family. He then made three calls to me on the same day through my\n\n  handphone number. The substance of the conversation was that the Defendant wanted to be\n\n  re-employed by [Zerity]. I told him not to call me, ever.46. On 22 April 2001, the Defendant came to my house, again, uninvited.\n\n  This time, he handed delivered a card addressed to my wife and I. The card had a picture\n\n  of a rattle on its front with ‘Congratulations’ printed across the front. It is\n\n  clear from the design of the card that it was meant to be used to congratulate couples\n\n  over the birth of their newly born babies.47. The following words were written in the card:\"Thanks a lot Nick for your help. All I need from you, Gracy Choo,\n\n  Marianne Lim, Peter Seah clearance of my case as green or cannot be employed for the job\n\n  marked so I can get a job - Naresh.\"48. … My wife showed me the card when I returned to Singapore on\n\n  23 April 2001.49. The receipt of this card from the Defendant was especially\n\n  distressing to my wife and I. We have been married for some 10 years and our son died at\n\n  birth two years ago around this time. The Defendant obviously intended to inflict my wife\n\n  and I with emotional pain and distress by giving us a card containing a picture of a\n\n  rattle so close to the anniversary.50. The next day, on 23 April 2001, the Defendant sent me an e-mail\n\n  requesting that I send a:\"clearance letter to the Ministry of Manpower to allow Singapore\n\n    Employers to hire [him] and let [him] earn [his] bread and butter.\"He also asked for a letter to be sent to the Home Affairs Ministry to:\"put his Singapore identity card back to workable position and not\n\n    tagging of any criminal/ offence or green record\".These demands simply did not make sense to me as [Zerity] has not\n\n  written to the relevant authorities to complain about him in the first place. …51. On 27 April 2001, I made a police report against the Defendant.\n\n  …52. On 4 June 2001, I received a note from William Scrimgeour of\n\n  [Zerity]. He stated in the note that on 1 June 2000, whilst he was having lunch at a\n\n  coffee shop located at the basement of Temasek Tower, the Defendant approached him. The\n\n  Defendant asked for my whereabouts. He also asked where Ms Lim was. On that day, both of\n\n  us were overseas. He further informed William Scrimgeour that he had earlier visited\n\n  [Zerity’s] office and found out that there was nobody there. It was plain to William\n\n  Scrimgeour that the Defendant had intended to confront me or Ms Lim on that day. …30 What emerges from Malcomson’s affidavit is a sorry story of a\n\nperson who, out of either malice or due to mental instability, had embarked on a course of\n\nconduct with such persistence that he had made life unbearable for the objects of his\n\nattention. He had used physical presence as well as telephone, mail, e-mail and SMS\n\nmessages – all forms of communication available in this day and age - to wear out\n\nthose people and in the process caused them much annoyance and great distress.\n\nParticularly vicious is the sending of the card with the picture of the baby rattle close\n\nto the anniversary of the death of Malcomson’s son.",
        "Developments in the Law": "31 Before considering the law, it is necessary to define the meaning of\n\nthe term \"harassment\". The Shorter Oxford English Dictionary (3rdEd.) defines \"harass\" as follows:\"1.To wear out, or exhaust with fatigue, care, trouble,\n\n  etc. …3.To trouble or vex by repeated attacks …4.To worry,\n\n  distress with annoying labour, care, importunity, misfortune, etc. …\"Black’s Law Dictionary (7thEd.) gives the meaning of\n\n\"harassment\" as follows:\"Words, conduct, or action (usually repeated or persistent) that,\n\n  being directed at a specific person, annoys, alarms, or causes substantial emotional\n\n  distress in that person and serves no legitimate purpose.\"For the purposes of this application I shall take the term\n\n\"harassment\" to mean a course of conduct by a person, whether by words or\n\naction, directly or through third parties, sufficiently repetitive in nature as would\n\ncause, and which he ought reasonably to know would cause, worry, emotional distress or\n\nannoyance to another person. This is not intended to be an exhaustive definition of the\n\nterm but rather one that sufficiently encompasses the facts of the present case in order\n\nto proceed with a consideration of the law.32 There is no reported decision in our courts which deal with\n\nharassment in an action in tort. The position in England is not settled and I now consider\n\nthe authorities.33Patel v Patel[1988] 2 FLR 179concerns an action in which\n\nthe plaintiff sought an injunction against his son-in-law who, in the course of a family\n\ndispute, had trespassed on the plaintiff’s home and threatened him in a number of\n\nways such as telephoning him at home or abusing him in the street or at work. An\n\ninterlocutory injunction was issued restraining the defendant from,inter alia,\n\napproaching within 50 yards of the plaintiff’s home. This part of the injunction was\n\nsubsequently discharged and the Court of Appeal upheld that decision on appeal. In his\n\nreasoned judgment, May LJ said:\"…it must be made clear, at any rate in my opinion, that in\n\n  common-law actions based upon an alleged tort injunctions can only be an appropriate\n\n  remedy where an actual tortious act has been or is likely to be committed. A number of\n\n  allegations in the various affidavits that are before us do not constitute a tort, nor\n\n  give any reason for thinking that a tort might be committed, and I have no doubt that it\n\n  was for this reason that the judge thought it proper to limit the terms of the original\n\n  injunction of 20 August 1986, in particular removing from it the restraint on the\n\n  son-in-law from approaching within 50 yard of his father-in-law’s house. Unless an\n\n  actual trespass is committed or is more than likely to be committed, it does not seem to\n\n  me that merely to approach to within 50 yards of a person’s house does give cause of\n\n  action which may be restrained by an injunction in those terms.\"34 That judgment does not deal with the question of harassment. However\n\nWaterhouse J, sitting as the second judge in the Court of Appeal, extended the scope of\n\nthis decision by stating that there was no tort of harassment. In a single-paragraph\n\njudgment, he said (at p.182):I agree with the orders proposed by May LJ and with the reasons for\n\n  them that he has given. In particular, I endorse the approach adopted by the judge below\n\n  in reformulating the injunctions. The essence of the appellant’s complaint is that he\n\n  has been the victim of repeated harassment since May 1985, but in the present state of the\n\n  law there is no tort of harassment. The judge was right, in my judgment, in limiting the\n\n  scope of the injunctions in the way that he did.35 This position was doubted by the Court of Appeal inKhorasandjian\n\nv Bush[1993] 3 All ER 737. After quoting from the judgment of Waterhouse J, Dillon LJ\n\nsaid (at p.678):I find it difficult to give much weight to that general dictum that\n\n  there is no tort of harassment, when the reformulated injunctions which Waterhouse J\n\n  approved included an injunction restraining the defendant from molesting the plaintiff.36 InBurris v Azadani[1995] 1 WLR 1372, Sir Thomas Bingham MR\n\nalso doubted the position taken by Waterhouse J inPatel v Patel. The Master of the\n\nRolls, with whom the other two Lord Justices agreed, quoted from the judgments of May LJ\n\nand Waterhouse J and said (at p.1378):I do not, however, understand May LJ to have held that such an order\n\n  was improper even in a case where the commission of a tort was reasonably to be\n\n  apprehended and where an \"exclusion zone\" order was reasonably judged to be\n\n  necessary for protection of the plaintiff as the potential victim of tortious conduct.\n\n  Nor, in the light of later authority, can the view be upheld that there is no tort of\n\n  harassment.37 In England the matter is now covered by the Protection from\n\nHarassment Act 1997 - seeHunter v Canary Wharf Ltd[1997] 2 All ER 426. In that\n\ncase, the House of Lords was faced with the question whether a person who had no right to\n\nthe land affected by a nuisance could bring an action in private nuisance. The majority of\n\ntheir Lordships held that only a person with a right to exclusive possession of the land\n\naffected could sue, and a mere licensee or occupier could not. In so holding, the House\n\nhad to overrule the decision of the Court of Appeal inKhorasandjian v Bush[1993] 3 All ER 737, in which the facts were as follows: the plaintiff met the defendant in a\n\nsnooker club when she was 16 years of age and he 20. They became friends and dated on and\n\noff over a period of about a year. Then the plaintiff broke up the relationship but the\n\ndefendant, who had suicidal tendencies, could not accept it. He embarked on a series of\n\nacts directed at the plaintiff which included threats of violence, aggressive behaviour in\n\nher presence and simply following her around and shouting abuse. He also pestered her with\n\ntelephone calls to her parents’ as well as grandmother’s home. On one occasion,\n\nas a result of such abusive behaviour, the defendant was arrested and kept in custody over\n\nthe weekend but was given a 12-month conditional discharge. However he made further\n\nthreats against the plaintiff and was eventually sent to prison for six weeks for\n\nthreatening to kill her. He was also fined for offences under the Telecommunications Act\n\n1984 in respect of nuisance telephone calls he made to the plaintiff. The Court of Appeal\n\nhad upheld an injunction against the defendant restraining him from,inter alia,\n\n\"harassing, pestering or communicating with\" the plaintiff. In his speech inHunter\n\nv Canary Wharf Ltd, Lord Goff had this to say (at p.437) of the decision of the Court\n\nof Appeal inKhorasandjian v Bush:… The question before the Court of Appeal was whether the judge\n\n  had jurisdiction to grant such an injunction, in relation to telephone calls made to the\n\n  plaintiff at her parents’ home. The home was the property of the plaintiff’s\n\n  mother, and it was recognised that her mother could complain of persistent and unwanted\n\n  telephone calls made to her; but it was submitted that the plaintiff, as a mere licensee\n\n  in her mother’s house, could not invoke the tort of private nuisance to complain of\n\n  unwanted and harassing telephone calls made to her in her mother’s home. The majority\n\n  of the Court of Appeal (Peter Gibson J dissenting) rejected this submission, relying on\n\n  the decision of the Appellate Division of the Alberta Supreme Court inMotherwell v\n\n  Motherwell(1976) 73 DLR (3d) 62. In that case, the Appellate Division not only\n\n  recognised that the legal owner of property could obtain an injunction, on the ground of\n\n  private nuisance, to restrain persistent harassment by unwanted telephone calls to his\n\n  home, but also that the same remedy was open to his wife who had no interest in the\n\n  property. In the Court of Appeal Peter Gibson J dissented on the ground that it was wrong\n\n  in principle that a mere licensee or someone without any interest in, or right to occupy,\n\n  the relevant land should be able to sue in private nuisance.It is necessary therefore to consider the basis of the decision inMotherwell\n\n  v Motherwellthat a wife, who has no interest in the matrimonial home where she lives,\n\n  is nevertheless able to sue in private nuisance in respect of interference with her\n\n  enjoyment of that home. The case was concerned with a claim for an injunction against the\n\n  defendant, who was the daughter of one of the plaintiffs, the other two plaintiffs being\n\n  her brother and sister-in-law. The main ground of the complaint against the defendant was\n\n  that, as a result of a paranoid condition from which she suffered which produced in her\n\n  the conviction that her sister-in-law and her father’s housekeeper were inflaming her\n\n  brother and her father against her, she persistently made a very large number of telephone\n\n  calls to her brother’s and her father’s homes, in which she abused her\n\n  sister-in-law and the housekeeper. The Appellate Division of the Alberta Supreme Court, in\n\n  a judgment delivered by Clement JA, held that not only could her father and brother, as\n\n  householders, obtain an injunction against the defendant to restrain this activity as a\n\n  private nuisance, but so also could her sister-in-law although she had no interest in her\n\n  husband’s property. Clement JA said (at 78):‘Here we have a wife harassed in the matrimonial home. She has a\n\n    status, a right to live there with her husband and children. I find it absurd to say that\n\n    her occupancy of the matrimonial home is insufficient to found an action in nuisance. In\n\n    my opinion she is entitled to the same relief as is her husband, the brother.’This conclusion was very largely based on the decision of the Court of\n\n  Appeal inFoster v Warblington UDC[1906] 1 KB 648, which Clement JA understood to\n\n  establish a distinction between ‘one who is \"merely present\"’ and\n\n  ‘occupancy of a substantial nature’, and that in the latter case the occupier\n\n  was entitled to sue in private nuisance. However,Foster v Warblington UDCdoes\n\n  not, in my opinion, provide authority for the proposition that a person in the position of\n\n  a mere licensee, such as a wife or husband in her or his spouse’s house, is entitled\n\n  to sue in that action. This misunderstanding must, I fear, undermine the authority ofMotherwell\n\n  v Motherwellon this point; and in so far as the decision of the Court of Appeal inKhorasandjian\n\n  v Bushis founded uponMotherwell v Motherwellit is likewise undermined.38 Lord Goff recognised that the primary complaint of the plaintiff inKhorasandjian\n\nv Bushwas not private nuisance but harassment. He continued (at p.438):But I must go further. If a plaintiff, such as the daughter of the\n\n  householder inKhorasandjian v Bush, is harassed by abusive telephone calls, the\n\n  gravamen of the complaint lies in the harassment which is just as much an abuse, or indeed\n\n  an invasion of her privacy, whether she is pestered in this way in her mother’s or\n\n  her husband’s house, or she is staying with a friend, or is at her place of work, or\n\n  even in her car with a mobile phone. In truth, what the Court of Appeal appears to have\n\n  been doing was to exploit the law of private nuisance in order to create by the back door\n\n  a tort of harassment which was only partially effective in that it was artificially\n\n  limited to harassment which takes place in her home. I myself do not consider that this is\n\n  a satisfactory manner in which to develop the law, especially when, as in the case in\n\n  question, the step so taken was inconsistent with another decision of the Court of Appeal,\n\n  vizMalone v Laskey[1907] 2 KB 141, by which the court was bound. In any event, a\n\n  tort of harassment has now received statutory recognition (see the Protection From\n\n  Harassment Act 1997). We are therefore no longer troubled with the question whether the\n\n  common law should be developed to provide such a remedy.39 Lord Hoffman agreed and expressed similar sentiments, saying (at\n\np.452):The perceived gap inKhorasandjian’scase was the absence\n\n  of a tort of intentional harassment causing distress without actual bodily or psychiatric\n\n  illness. This limitation is thought to arise out of cases likeWilkinson v Downton[1897] 2 QB 57, andJanvier v Sweeney[1919] 2 KB 316. The law of harassment has\n\n  now been put on a statutory basis (see the Protection from Harassment Act 1997) and it is\n\n  unnecessary to consider how the common law might have developed. But as at present\n\n  advised, I see no reason why a tort of intention should be subject to the rule which\n\n  excludes compensation for mere distress, inconvenience or discomfort in actions based on\n\n  negligence (seeHicks v Chief Constable of the South Yorkshire Police[1992] 2 All\n\n  ER 65). The policy considerations are quite different. I do not therefore say that\n\n  Khorasandjian’s case was wrongly decided. But it must be seen as a case on\n\n  intentional harassment, not nuisance.40Wilkinson v Downton[1897] 2 QB 57 andJanvier v Sweeney[1919] 2 KB 316 are of course the well known cases which established that false words or\n\nverbal threats calculated to cause, and uttered with the knowledge that they are likely to\n\ncause, and actually causing physical injury to the person to whom they are uttered are\n\nactionable. But I do not understand those cases, which have extended the law to include\n\nrecovery for mental shock caused by intentional acts, as restricting in any manner its\n\nfurther development.41 The editors of Bullen & Leake & Jacob’sPrecedents\n\nof Pleadings(14thEd. 2001) take the position that harassment is a\n\nrecognised tort, although they did not consider the judgment of the House of Lords inHunter\n\nv Canary Wharf Ltd. In paragraph 54-01 of Bullen & Leake, the editors state:Harassment is now recognized at common law and protection will be\n\n  afforded against it, in particular, by the courts’ powers to grant injunctive relief.\n\n  InKhorasandjian v Bush.. the Court of Appeal dismissed an appeal against an order\n\n  restraining the defendant from \"using violence to, harassing, pestering or\n\n  communicating with\" the claimant by, among other things, \"the persecution by\n\n  telephone calls\". InBurris v Adazani… Sir Thomas Bingham MR reviewed\n\n  the law of harassment in the context of the court’s power to grant interlocutory\n\n  injunctive relief and concluded that the jurisdiction derived from section 37(1) of the\n\n  Supreme Court Act 1981 and section 38 of the County Courts Act 1984 was not limited to\n\n  restraining conduct which is in itself tortious or otherwise unlawful but extends to the\n\n  protection of \"the legitimate interests of those who have invoked [the Court’s]\n\n  jurisdiction\" …42 InInternational Privacy, Publicity and Personality Laws(2001) (Henry, Ed.), the contributors to the chapter on Singapore (Chapter 24), opined\n\nthat the Singapore courts should recognise the tort of harassment. After quoting from the\n\nspeech of Lord Hoffman inHunter v Canary Wharfthat I have reproduced above, the\n\neditors say (at p.368):This passage from the decision of Lord Hoffman provides material for\n\n  the development in Singapore of a common law tort of intentional harassment. …If, and when this takes place, there would be much scope for the\n\n  protection of privacy, since the tort may, if fully developed, protect against\n\n  ‘distress, inconvenience and discomfort’. The main difficulty against the\n\n  adoption of the tort of harassment in Singapore is a passage from the decision of Selvam J\n\n  inArul Chandran v Gartshorewhich suggests that mental distress is not actionable.\n\n  It is submitted that Selvam J’s statement that mental distress is not actionable\n\n  should not preclude the development and acceptance of a tort of intentional harassment in\n\n  Singapore for several reasons. First, the statement of Selvam J was only anobiter\n\n  dictain respect of recovery for mental distress in tort, since the case before Selvam\n\n  J involved a claim for breach of contract. Secondly, Selvam J relied on old judgments that\n\n  mental distress was not recoverable. Selvam J’s attention was not drawn to the modern\n\n  cases including those cited in this part of the chapter that support the view that there\n\n  can be a cause of action based on intentionally causing mental distress. Thirdly, Selvam\n\n  J’s suggestion that such damages should not be recoverable on the basis that they are\n\n  difficult to quantify is not a good reason to deny a remedy. The courts are adept in\n\n  quantifying damages. …43 The passage inArul Chandran v Gartshore[2000] 2 SLR 446that the editors are referring to is probably paragraph 13 in which the judge said:I now commence an analysis of the law on the issue. Historically\n\n  speaking, English law acted on the apriorism that pure mental suffering without physical\n\n  injury was an inevitable fact of interpersonal relationships in private and public life\n\n  alike. Unlike actionable physical injury, which arises from an external cause, mental\n\n  distress stems from inherent predisposition of the individual. As it arose from the\n\n  constitution and circumstances of the individual it did not traditionally give a cause of\n\n  action. After all, people must learn to accept with a certain degree of stoicism the\n\n  slings and arrows of this vale of tears. In such instances, they should be slow to rush to\n\n  the law with a tale of tears and fears save in certain recognised circumstances. It makes\n\n  no difference whether the event causing such suffering was the commission of a tort or the\n\n  breaking of a contract. In the time-honoured language of the law, such suffering is too\n\n  remote for recompense at law: seeVictorian Railway Commissioners v Coultas[1888]   13 App Cas 222. At one time, it was thought that this was not a desirable situation\n\n  because it failed to deter the callous conduct of irresponsible people. So an attempt was\n\n  made to move the boundary by Wright J inWilkinson v Downton[1897] 2 QB 57.\n\n  Notably, that was not a contract action. Even in tort the novelty failed to flourish. It\n\n  is settled law that mental distress by itself does not constitute sufficient damage to\n\n  found a cause of action. In 1957, Devlin J stated the correct position inBehrens v\n\n  Bertram Mills Circus Ltd[1957] 2 QB 1 at 28: `The general principle embedded in the\n\n  common law that mental suffering caused by grief, fear, anguish and the like is not\n\n  assessable.'44 For my part, I do not think that the judge had intended to rule out\n\nall actions founded on mental distress. But to the extent that he does, I would agree with\n\nthe editors that the statement in respect of tort isobiterbecause the question\n\nbefore the court in that case involved damages for mental distress in a breach of contract\n\nsituation. Also, counsel there did not appear to have cited the authorities that I have\n\ndealt with above, in particular, the statement by Lord Hoffman inHunter v Canary Wharf\n\nLtd(quoted in paragraph 39 above) in which he said that he saw no reason why\"a\n\ntort of intention should be subject to the rule which excludes compensationfor\n\nmere distress, inconvenience or discomfort in actions based on negligence.\"In\n\nthe premises, I consider that there is no authority in the way of the development of the\n\nlaw in this area in Singapore.45 The basic facts in the present case can be summarised as follows:\n\nMehta, having left the employment of Zerity, embarked on a course of conduct that made\n\nlife unbearable for Malcomson and the other employees of his former employer. It was a\n\ncourse of conduct that any reasonable person would consider intolerable. Indeed\n\nMehta’s actions, as can be seen from his behaviour generally, the written\n\ncommunications from him, and the fact that third parties have also been at the receiving\n\nend of his actions, could well be a manifestation of some form of mental illness. However\n\neven if that is relevant, Mehta has not entered a defence nor filed any affidavits and for\n\nthe present purposes I can only assume that he has the faculties of an ordinary person.46 InWilkinson v Downton[1897] 2 QB 57, the defendant played a\n\npractical joke on the plaintiff by telling her that her husband had met with a serious\n\naccident and had broken both legs. On hearing this the plaintiff suffered a violent shock,\n\nfell ill and became incapacitated for several weeks. The court found that these\n\nconsequences were not the result of any existing condition or predisposition of the\n\nplaintiff. In giving judgment for the plaintiff, Wright J declined to base the action on\n\nfraud because the damage suffered did not naturally result from the plaintiff acting upon\n\nthe false statement. Instead he held as follows (at p.58):The defendant has, as I assume for the moment, wilfully done an act\n\n  calculated to cause physical harm to the plaintiff - that is to say, to infringe her legal\n\n  right to personal safety, and has in fact thereby caused physical harm to her. That\n\n  proposition without more appears to me to state a good cause of action, there being no\n\n  justification alleged for the act. This wilful injuria is in law malicious, although no\n\n  malicious purpose to cause the harm which was caused nor any motive of spite is imputed to\n\n  the defendant.It remains to consider whether the assumptions involved in the\n\n  proposition are made out. One question is whether the defendant's act was so plainly\n\n  calculated to produce some effect of the kind which was produced that an intention to\n\n  produce it ought to be imputed to the defendant, regard being had to the fact that the\n\n  effect was produced on a person proved to be in an ordinary state of health and mind. I\n\n  think that it was. It is difficult to imagine that such a statement, made suddenly and\n\n  with apparent seriousness, could fail to produce grave effects under the circumstances\n\n  upon any but an exceptionally indifferent person, and therefore an intention to produce\n\n  such an effect must be imputed, and it is no answer in law to say that more harm was done\n\n  than was anticipated, for that is commonly the case with all wrongs.47 Wright J then held that the connection between cause and effect in\n\nthat case was sufficiently close such that the damages suffered by the plaintiff were not\n\ntoo remote in law. He considered the decision of the Privy Council inVictorian\n\nRailways Commissioners v Coultas13 AC 222 to be of doubtful authority. In any event\n\nWright J distinguished it on the grounds that theVictorian Railwayscase did not\n\ninvolve any element of wilful wrong. He also distinguishedAllsop v Allsop5\n\nH.&N. 534, a case involving a slander. Wright J considered that the plaintiff had a\n\nlegal right to personal safety. This right was infringed by the defendant who had wilfully\n\ndone an act calculated to cause, and which did cause, physical harm to her. It did not\n\nmatter that it was not the defendant’s intention to cause physical harm. What was\n\nimportant was that the defendant had intended to carry out the act and the consequences\n\nthat resulted were within reasonable contemplation.48 InJanvier v Sweeney & Anor[1919] KB 316, the plaintiff\n\nwas a French woman employed as companion to one Mrs Rowton. She was engaged to be married\n\nto a Mr Neumann, a German, against the wishes of her relatives. In July 1915 Neumann was\n\ninterned in the Isle of Man. The plaintiff had visited him there twice and corresponded\n\nregularly with him. In mid-1917, one Miss Marsh moved in to live with Rowton. The first\n\ndefendant was a private detective and he wanted to look at some letters that Marsh had in\n\nher possession. His assistant, the second defendant, went up to the plaintiff and\n\nannounced, falsely, that he was a detective from Scotland Yard representing the military\n\nauthorities. He told the plaintiff that she was the woman they were looking for as she had\n\nbeen corresponding with a German spy. They had hoped to scare her into helping them gain\n\naccess to Marsh’s letters. Unfortunately the plaintiff suffered a severe nervous\n\nshock as a result of this encounter. The English Court of Appeal approved and appliedWilkinson\n\nv Downtonand held that the defendants were liable to the plaintiff in damages. The\n\nwords of Duke LJ, at p. 326 are particularly apposite:This is a much stronger case thanWilkinson v. Downton. In that\n\n  case there was no intention to commit a wrongful act; the defendant merely intended to\n\n  play a practical joke upon the plaintiff. In the present case there was an intention to\n\n  terrify the plaintiff for the purpose of attaining an unlawful object in which both the\n\n  defendants were jointly concerned.",
        "Should there be a tort of harassment?": "49 There the law in this area has remained up to today, apart from the\n\ndicta inBurris v AdazaniandHunter v Canary Wharf Ltd. The common law has\n\nbeen in development for close to 1000 years. In most of that time the nature of the\n\ncommunity regulated by it was rural and agrarian. Indeed emphasis had been placed on land\n\nbecause that was the main means of economic output and, consequently, wealth. As concerns\n\nthe area of law in the present case, protection was offered to the landowner against\n\ninterference with enjoyment of his land by the tort of nuisance. Outside of his land he,\n\nas with any individual, is protected generally by the tort of trespass to the person and\n\nthe tort of negligence.50 In the last 200 years improvements in technology have brought about\n\n3 great changes in lifestyle, at least for those of us in affluent societies. The first is\n\nurbanisation due to the fact that the means of livelihood for most people shifted from\n\nagriculture to manufacturing and services. More and more people live closer and closer\n\ntogether. The second is the widespread availability of leisure time. No longer do most\n\npeople have to toil long hours daily in order to eke out a hand to mouth existence. With\n\neducation, and hence skills, and technology, productivity has risen to such levels that\n\nvirtually everyone can afford considerable periods of leisure. The third great change is\n\nin communication. With mobile phones, voicemail, SMS and pagers we can be contacted\n\nanytime, anywhere, instantaneously or otherwise. With e-mail and internet homepages our\n\npresence is not tied down to geography but has become virtual, somewhere out there in the\n\nether of cyberspace.51 These three changes have combined to create the problem in the\n\npresent case which did not and could not exist before. An abundance of leisure time means\n\nthat there are people who can afford the time and money to indulge in fantasies about\n\nother people, whether in respect of any grievance they have, or of so-called celebrities,\n\nanother product of the modern era of mass media and sophisticated marketing. And the means\n\nby which such people can act out their fantasies have become not only easier but more\n\npowerful. No longer need one be within sight or hearing of the victim. He or she can be\n\nreached aurally by mobile phone and pager, or communicated to in the form of words,\n\nsymbols or graphics by SMS or e-mail. This can be done anytime from anywhere. With a\n\ncomputer, such communications can be generated at high volumes automatically, e.g. e-mail\n\n\"spamming\". While there are those who may view the proliferation of pagers,\n\nmobile phones and e-mail with dismay, a steadily growing number of people consider these\n\ndevices indispensable to their occupation and in many cases, to their personal lives as\n\nwell. Certainly within one generation these will be as commonplace as the fixed-line\n\ntelephone and television have become in the lifetime of those of us who are old enough to\n\nhave ever been deprived of them. People will arrange their lives around these devices as\n\nwas done for the earlier inventions.52 But life can be unbearable for the person who finds himself the\n\nobject of attention of one who is determined to make use of these modern devices to\n\nharass. That person’s mobile phone can be ringing away at all times and in all\n\nplaces. He may get a flood of SMS messages, which can now be conveniently sent out by\n\ncomputer via e-mail. His inbox can be flooded with unwanted e-mail. These communications\n\ncan be warm words of adulation or they can be chilling threats to property or personal\n\nsafety. The result can range from displeasure to distress to debilitation.53 Sections 13A and 13B of the Miscellaneous Offences (Public Order and\n\nNuisance) Act provide as follows:Intentional harassment, alarm or distress13A. --(1) Any person who in a public place or in a private place, with intent to\n\n  cause harassment, alarm or distress to another person —(a) uses threatening, abusive or insulting words or behaviour; or(b) displays any writing, sign or other visible representation which is\n\n    threatening, abusive or insulting,thereby causing that person or any other person harassment, alarm or\n\n  distress, shall be guilty of an offence and shall be liable on conviction to a fine not\n\n  exceeding $5,000.(2) It is a defence for the accused to prove —(a) that he was inside a dwelling-house and had no reason to believe\n\n    that the words or behaviour used, or the writing, sign or other visible representation\n\n    displayed, by him would be heard or seen by a person outside that dwelling-house or any\n\n    other dwelling-house; or(b) that his conduct was reasonable.Harassment, alarm or distress13B. --(1) Any person who in a public place or in a private place —(a) uses threatening, abusive or insulting words or behaviour; or(b) displays any writing, sign or other visible representation which is\n\n    threatening, abusive or insulting,within the hearing or sight of any person likely to be caused\n\n  harassment, alarm or distress thereby shall be guilty of an offence and shall be liable on\n\n  conviction to a fine not exceeding $2,000.(2) It is a defence for the accused to prove —(a) that he had no reason to believe that there was any person within\n\n    hearing or sight who was likely to be caused harassment, alarm or distress;(b) that he was inside a dwelling-house and had no reason to believe\n\n    that the words or behaviour used, or the writing, sign or other visible representation\n\n    displayed, would be heard or seen by a person outside that dwelling-house or any other\n\n    dwelling-house; or(c) that his conduct was reasonable.54 Therefore, under that Act, if a person uses words that are abusive,\n\ninsulting or threatening or behaves in that manner in any place and as a consequence\n\ncauses harassment, alarm or distress to another person, the former may have committed an\n\noffence under the Act. However it would appear that similar words expressed by the\n\nperpetrator over the mobile phone which causes harassment, alarm or distress to the victim\n\nwould not be an offence under this Act. Of course the victim can always switch off his\n\nmobile phone if he does not want to receive such calls and therefore it is not necessary\n\nto make that behaviour an offence. But this suggestion restricts the victim’s right\n\nto use his mobile phone or any other device through which the perpetrator’s\n\ncommunications are sent. In my opinion there is a need to address this lacuna in the law.55 I do not believe that it is not possible for the common law to\n\nrespond to this need. In Singapore we live in one of the most densely populated countries\n\nin the world. And the policy of the government is to further increase the population. It\n\nwill make for an intensely uncomfortable living environment if there is no recourse\n\nagainst a person who intentionally makes use of modern communication devices in a manner\n\nthat causes offence, fear, distress and annoyance to another. Mehta had embarked on such a\n\ncourse of conduct by making the mobile phone calls along with his other acts of nuisance.\n\nHe ought reasonably to know that such acts would cause worry, emotional distress,\n\nannoyance to Malcomson. In the law of negligence, a person has a duty to ensure that he\n\ndoes not cause any damage to others. Such acts are unintentional but they result in\n\nphysical harm to the victim. Surely in respect of intentional acts that cause harm in the\n\nform of emotional distress, the law is able to provide a recourse. The fact that in such\n\ncases it is difficult to quantify damages should not, in my opinion, hinder the court from\n\ngiving the appropriate relief. In the present case, as I suspect will generally be the\n\nsituation in most cases of this nature, what the Plaintiffs essentially want are not\n\ndamages but an injunction restraining Mehta from continuing with such acts. I see no\n\nreason of policy against ordering Mehta to stop such behaviour. They do not further the\n\ncommon good. Instead they cause the plaintiffs to lose time and emotional energy which can\n\nbe better spent on more productive activities. Just as importantly, those acts do not\n\ncontribute anything to the welfare of Mehta and an injunction from the court would in all\n\nprobability steer him into a positive direction and at the very least make him get on with\n\nhis life.56 There is of course the need to balance the Plaintiffs’ right to\n\nprivacy against Mehta’s right to free speech. However the latter right has always\n\nbeen subject to the existing law, e.g. defamation, sedition and, as I have demonstrated\n\nabove, the Miscellaneous Offences (Public Order and Nuisances) Act. Freedom of speech, as\n\nwith any other freedom, extends to where it begins to impinge on another person’s\n\nrights. If Mehta has any cause of action against the Plaintiffs he should seek his\n\nrecourse in the courts. What the Plaintiffs ask here, apart from orders in respect of the\n\nwell established tort of private nuisance, is for Mehta to be prohibited from keying\n\nseveral combinations of numbers in his telephone. I can see no reason why the law cannot\n\ncome to their aid in the circumstances.57 I would note also that there appears to be an increasing number of\n\ncases of what is known as \"stalking\", i.e. the harassment by individuals of the\n\nobjects of their fantasies or desire. The latter are mostly celebrities, i.e. people such\n\nas entertainment figures who are glamorised by the mass media. In some countries such\n\ncases sometimes end tragically. Although that situation does not obtain in the present\n\ncase, recognition of a tort of harassment could nip many of those cases in the bud. InRobert\n\nFine v. Eileen May McLardy[1998] EWCA 3003(6 July 1998), Millet LJ commented as\n\nfollows:In the past, the absence of a tort of interference with privacy has\n\n  been a serious blot on our jurisprudence. It has made it difficult to uphold injunctions\n\n  of the present kind, necessary though they are, on any rational basis. With the imminent\n\n  incorporation of the European Convention on Human Rights, which guarantees the privacy of\n\n  the individual, his or her home and correspondence, this may be a thing of the past. It\n\n  will not be long before this court is called on to consider whether, in the new\n\n  circumstances, injunctions of the present kind can be granted generally to prevent\n\n  harassment and stalking wherever it may take place, and without having to base this\n\n  jurisdiction on the law of nuisance.In my opinion that time has come in Singapore.Conclusion58 In the premises, I give judgment to the Plaintiffs and make the\n\nfollowing orders:(1)    An Injunction restraining the Defendant from entering or being\n\n  within the Residence;(2) An Injunction restraining the Defendant (whether by himself or his\n\n  agent) from doing, procuring, inciting, abetting or encouraging any other person to do,\n\n  any of the following:contacting or attempting to contact the 1stPlaintiff either directly or\n\n      indirectly by speaking to him, telephoning (with or without speaking), writing, sending\n\n      messages electronically or through facsimile or in any other way; orsending or causing to be sent by hand, postal service, facsimile, electronic mail or\n\n      otherwise howsoever, any article to the 1stPlaintiff or so that it is likely\n\n      to come to the attention of the 1stPlaintiff.(3) An Injunction restraining the Defendant from entering or being\n\n  within the Premises;(4)    An Injunction restraining the Defendant from telephoning (with or\n\n  without speaking) the 2ndPlaintiff's employees or officers at the Premises or\n\n  procuring, inciting, abetting or encouraging any person to do likewise;(5) An Injunction restraining the Defendant from sending any document\n\n  or article to the 2ndPlaintiff's employees or officers at the Premises whether\n\n  by hand, postal service, facsimile, electronic mail or otherwise howsoever or from\n\n  inciting, causing or encouraging any person to do likewise.59 The interim injunction granted on 11 June 2001 is consequently\n\ndischarged. I also order Mehta to pay the costs of the Plaintiffs (in one set only) in\n\nthis action.Sgd:LEE SEIU KINJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}