{
    "case_title": "Brian Wesley Batie v Tan Boon Hock",
    "ncitation": "[2001] SGHC 251",
    "coram": "Lee Seiu Kin JC",
    "sections": {
        "(1) Breach of": "Contract2.    Defendant was in breach of the following clauses\n\nof the Agreement:(a) clause 4, in not removing the electrical wiring;(b) clause 6, in not paying the November 2000 rent;(c) clause 6 & implied term of the Agreement, that the Defendant\n\n  should carry out the removal of his equipment, furniture, electrical wiring and electrical\n\n  fittings in a reasonable manner,(d) the Agreement spells out what the Defendant is entitled to remove\n\n  and does not entitle him to remove what is not specifically set out. Therefore the removal\n\n  of the fire doors, etc is a breach of the Agreement.",
        "(2) Trespass": "3.    Defendant had trespassed on the premises on 1\n\nNovember and caused the removal of the fire doors, fire rated ceiling and damage to the\n\nroller shutters, etc.Damages:",
        "Breach of clause 6 of Agreement": "4.    November 2000 rent of$15,250",
        "Other breaches of Agreement & Trespass:": "5.    Re-instatement works: As the Plaintiff’s\n\nevidence was that he did not pay for the re-instatement works pleaded, and evidence of his\n\nwitness, Pow Boon Chye was, in effect, that it was the landlord that was liable to him in\n\nrespect of the invoice exhibited, I find no loss to the Plaintiff on account of the\n\nre-instatement works pleaded.6.    Delay in opening: From the evidence, I find that a\n\nreasonable period that was needed to carry out the re-instatement works as well as to\n\nobtain the necessary approval from the Fire Safety Bureau on account of the removal of\n\nfire doors, fire rate ceiling and other fire safety equipment, would be 2 months from 1\n\nNovember 2000. Since the Plaintiff’s original plan was to open on 15 November, it\n\nfollows that the delay caused was 1.5 month.7.    Loss of profit: From the evidence I am satisfied\n\nthat the Plaintiff would have broken even after a few months of operation. Therefore the\n\nloss to him in respect of the 1.5 month delay would have been the cost that he had\n\nreasonably incurred between mid-November and mid-December. In this respect I find that it\n\nwas reasonable for him to pay staff to be on standby, but not to pay his partner, Nassir.\n\nIn the event the costs are as follows:(a) 1.5 month’s rental: $15,250 x 1.5 = $22,875(b) Staff costs for 1.5 month: $13,400(Tan, Phua, Catherine, Stephanie)There being no evidence of any other costs incurred, the total is\n\ntherefore$36,275Claim for aggravated damages:8 Find that Plaintiff has not made out his claim for aggravated\n\ndamages.Judgment9 Judgment for Plaintiff in the sum of $15,250 + $36,275 =$51,525,\n\nwith interest at 6% from date of writ (19 Jan 2001)10 On costs, as the judgment sum is lower than the High Court\n\nthreshold, the Plaintiffs shall have an order for costs against the Defendant on the\n\nSubordinate Courts scale, with disbursements (including court fees) also on that scale.Sgd:LEE SEIU KINJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}