{
    "case_title": "Golden Village Multiplex Pte Ltd v Marina Centre Holdings Pte Ltd",
    "ncitation": "[2001] SGHC 169",
    "coram": "Woo Bih Li JC",
    "sections": {
        "Introduction": "The plaintiffs Golden Village Multiplex Pte Ltd (`Golden Village`) had entered into an Agreement to Lease dated 28 February 1995 (`the agreement`) with the defendants Marina Centre Holdings Pte Ltd (`Marina Centre`).The agreement is in respect of the third and fourth levels and a small portion of the second level of a building known as the Leisureplex adjoining the shopping centre known as Marina Square (`the premises`).The intention of Golden Village was to operate a six-screen cinema complex at the premises which would be its flagship in Singapore.Under the agreement, read together with the attached form of a lease, the term is for a period of 15 years. It commenced in or about July or September 1996.In this action filed on 12 February 2001, and amended on 17 May 2001, Golden Village sought a declaration that the agreement is void, illegal and/or unenforceable and for consequential relief.On 20 June 2001, I dismissed the claim of Golden Village with costs.",
        "Background": "It is necessary to bear in mind the background leading to the execution of the agreement.According to paras 5 to 27 of the affidavit of See San San, the Senior Manager of the Marketing Department of Marina Centre, filed on 7 March 2001:5 The Defendants own operate and manage the building known as the Leisureplex and the adjoining shopping centre known as Marina Square both of which are located in the area known as Marina Square, Singapore (the \"Shopping Centre\"). The Shopping Centre has about 250 units, the number of which varies from time to time as units are consolidated or resized to meet the needs of existing or new tenants. It is therefore impractical for the Defendants to subdivide the Shopping Centre into fixed unit sizes.6 In view of the above, the Defendants` practice has always been not to subdivide the units in the Shopping Centre. To give effect to this practice, the Defendants require all their tenants to covenant that they will not require the Shopping Centre to be subdivide [sic] and their standard terms and conditions of Agreement to Lease contains a covenant by the tenant:-\"That it shall not, during the continuance of the TERM, register the lease to be granted under this Agreement to Lease and the ANNEXED LEASE at the Registry of Land Titles and Deeds, Singapore or at any other registry in Singapore, or to require the Landlord to subdivide the BUILDING or any part thereof or to do any act or thing which could result in the Landlord being required to subdivide the BUILDING or any part thereof.\"7 To further give effect to the above policy, the Defendants standard terms of Agreement to Lease contains a provision as follows:-\"The Tenant shall on or before the time fixed for the commencement of the TERM upon receipt of a twenty-eight (28) day written notice from the Landlord duly execute the ANNEXED LEASE with such amendments or variations thereto only as may be agreed between the parties hereto.\"8 The abovementioned ANNEXED LEASE is not in the form contain [sic] in the Approved Forms For Use Under The Land Titles Act 1993 & The Land Titles (Strata) Act. A copy of the approved form is set out at [pages 9 to 13].9 As the leases granted or to be granted by the Defendants are not intended for registration, they are not in the approved form and are not registrable. In this respect, the Defendants had been advised that if leases in the approved form are granted without written permission having been obtained to subdivide the land, there might be a deemed subdivision of the land under Section 4 of the Planning Act [pages 14 to 15] and a contravention of Section 12(3) thereof [page 16].(NB: The numbering of the sections of the Planning Act referred to here by the deponent is from the 1998 Edition whereas the applicable Act is the 1990 Edition. However, the substance is the same.)10 Following negotiations between the Plaintiffs and the Defendants on the Plaintiffs` intention to lease premises from the Defendants that the Plaintiffs intended to operate as a cinema complex, they signed a \"Heads of Agreement\" dated 12th March 1993 [pages 17 to 31]. By this agreement, the Plaintiffs agreed in principle to take a lease of premises (the \"Premises\") in the Leisureplex building that was then under construction. The lease of the Premises would be for 15 years commencing after the building was constructed.11 Item 7 of Appendix II [page 19] to the Heads of Agreement provided that the terms and conditions of the Lease Agreement to be signed between the Plaintiffs and the Defendants would be in accordance with the standard terms and conditions of the Defendants` Lease Agreement. The Plaintiffs thereby agreed to the inclusion of theouldresaid [sic] provisions that the Lease to be granted to them would be in non-registrable form and they would not register it.12 On or about 12th April 1994, the Plaintiffs received from the Defendants a discussion draft of the Agreement to Lease dated 8th April 1994 and the draft Lease annexed thereto (the \"Lease Documents\" which term includes the amendments thereafter made thereto). The Defendants are presently unable to trace their copy of the discussion draft but they believe that clause 9.2 of the Agreement to Lease contains the aforesaid standard provisions as set out in paragraph 6 above and clause 8 of the Agreement to Lease contains the standard provisions as set out in paragraph 7 above.13 The Plaintiffs commented on the draft Lease Documents by their letter to the Defendants dated 24th May 1994 [pages 32 to 41]. The comments did not relate to clauses 8 and 9.2. Following this letter, the representatives of the Plaintiffs met and discussed it.14 On the instructions of the Defendants, their then solicitors, M/s De Souza Tay & Partners wrote to the Plaintiffs` solicitors Messrs. Herbert Geer & Rundle in Melbourne by a letter dated 2 September 1994. The letter set out the Defendants`  rationale for requiring certain clauses in the Lease Documents that had been objected to by the Plaintiffs. With regards to clause 9.2, the Defendants` solicitors explained [page 42] as follows:-\"MCH (i.e. the Defendant) has never agreed with any tenant that its lease may be registered. All tenants including anchor tenants have agreed to dispense with registration of the notification of the lease in the Land Titles Registry on the basis that they will rely instead on the reputation of MCH and its shareholders who have the highest standing. May we note that if in the future MCH were to dispose off [sic] its ownership in the BUILDING, it will be in MCH`s interests to ensure that the transferee is bound by the provisions of the leases failing which MCH will be liable in damages to the tenants.\"15 By letter dated 17th October 1994 [page 45], the Plaintiffs` solicitors commented on the Lease Documents. With regard to clause 9.2, they enquired:-\"Is there any statutory protection given to the Tenants if the Lease is not registered? Notwithstanding the impeccable reputation of MCH and its shareholders, our client obviously has a substantial investment in the Lease and its interest must be protected.\"16 The Defendants` solicitors replied by letter dated 10th November 1994 [page 48] and wrote with regards to clause 9.2, as follows:-\"There is no statutory protection to tenants if the Lease is not registered. Nevertheless, no tenant of MCH has insisted on a registered lease. It is not only the impeccable reputation of MCH and its shareholders which is relied upon, but no doubt also the net-worth of its assets.\"17 By letter dated 14th November 1994 [page 50], the Plaintiffs` solicitors replied and with regards to clause 9.2, stated that the Plaintiffs would require the Lease to be registered.18 Further negotiations took place between the Plaintiffs and the Defendants and by letter dated 25th November 1994 [page 52] the Plaintiffs informed the Defendants, with regards to clause 9.2, as follows:-\"John will discuss this with our solicitors as it would appear that we can only rely on the agreement and proceed against the Landlord in eithera) a claim in damages for breach of the agreement orb) specific performance of the agre pant [sic].\"19 Subsequent to the Plaintiffs` aforesaid letter, the parties agreed that clause 9.2 would be retained without amendment and the Defendants provided finalised drafts of the Lease Documents to the Plaintiffs.20 By letter dated 9th January 1995 [page 54], the Plaintiffs returned the Agreement to Lease to the Defendants duly signed for the same to be stamped.21 The Plaintiffs took possession of the Premises in or about July 1996 and thereafter operated the same as a cinema complex.22 By letter to the Defendants dated 12th April 2000 [page 55], the Plaintiffs noted that the parties had not executed any formal Lease Agreement and requested for a formal Lease for their review and execution.23 Pursuant to the Plaintiffs` aforesaid letter, the Defendants forwarded the Lease to the Plaintiffs for their execution by their letter dated 26th June 2000 [page 56].24 The Plaintiffs acknowledged the receipt of the Lease for their execution by their letter to the Defendants dated 3rd August 2000 [page 57]. In this letter, they commented as follows:-\"The terms set out in the enclosed lease agreement are the same as those set out in the draft lease agreement annexed to the Agreement to Lease dated 28 February 1995 and we note that you have not forwarded a lease in the form approved by the Land Titles Act Chapter 157 Revised Edition 1994 (the \"LTA\").In the light of the foregoing, kindly forward to us a lease in the form approved by the LTA for our execution as soon as possible.\"25 The Defendants` solicitors wrote to the Plaintiffs on 10th August 2000 [page 58], and drew the Plaintiffs` attention to clause 9.2 of the Agreement to Lease dated 28th February 1995.26 Thereafter, the Plaintiffs and subsequently their solicitors, M/s David Lim & Partners corresponded with the Defendants` solicitors on the Plaintiffs` requirement that their lease of the Premises must be registrable under the Land Titles Act. Copies of the correspondence are annexed at pages [59 to 67].27 The Plaintiffs have failed or refused to pay rent since January 2001. The Defendants have consequently called on the guarantee issued by The Hongkong and Shanghai Banking Corporation Ltd for the sum of $198,971.20 to account of the rental of $215,245.28 (inclusive of GST) for January 2001.I set out below cll 8 and 9 of the agreement:8 TENANT TO EXECUTE THE ANNEXED LEASEThe Tenant shall on or before the time fixed for the commencement of the TERM upon receipt of a twenty-eight (28) day written notice from the Landlord duly execute the ANNEXED LEASE with such amendments or variations thereto only as may be agreed between the parties hereto.9 COVENANTS BY THE TENANTThe Tenant hereby covenants with the Landlord as follows:-9.1 That it shall during all periods of use and/or occupation of the PREMISES prior to the commencement of the TERM be bound by all terms, covenants, conditions, stipulations and provisions set out in the ANNEXED LEASE so far as the same may be applicable.9.2 That it shall not, during the continuance of the TERM, register the lease to be granted under this Agreement to Lease and the ANNEXED LEASE at the Registry of Land Titles and Deeds, Singapore or at any other registry in Singapore, or to require the Landlord to subdivide the BUILDING or any part thereof or to do any act or thing which could result in the Landlord being required to subdivide the BUILDING or any part thereof.In the annexed lease, the term is defined as 15 years starting from a certain event which is immaterial for present purposes.The agreement is not a deed. Neither is the annexed lease intended to be a deed nor is it in a form approved under the Land Titles Act (Cap 157, 1994 Ed).",
        "Submissions and my conclusions": "Ms Josephine Chong for Golden Village relied on various statutory provisions and cases.",
        "CONVEYANCING AND LAW OF PROPERTY ACT (CAP 61, 1994 ED) (`CLPA`)": "Section 53(1) CLPA states:A conveyance of any estate or interest in land other than a lease for a period not exceeding 7 years at a rack rent shall be void at law unless it is by deed in the English language.Section 2 CLPA defines `conveyance` and `lease` as:\"conveyance\" includes assignment, appointment, lease, settlement and other assurance made by deed on a sale, mortgage, demise or settlement of any property, and on any other dealing with or for any property; and \"convey\" has a corresponding meaning;\"lease\" includes an agreement for a lease where the lessee has become entitled to have his lease granted;As the agreement was not under deed and the intended lease was not intended to be under deed, it was clear that under the CLPA, the agreement and the intended lease, if executed, are void at law.However, this does not lead to the conclusion that they are devoid of any legal consequence or are incapable of creating any rights.In her bookPrinciples of Singapore Land Law(1994), Tan Sook Yee summarises the position as follows at pp 272 to 274:(d) FormalitiesUnder the general law, section 53 of the Conveyancing and Law of Property Act provides that a lease, other than one for a period of seven years and below, must be by deed in the English language. The common law applies to leases of seven years and below so that a legal tenancy will be created by an intention to create a lease for the relevant period, accompanied by entry into possession. Under the Land Titles Act, a lease of over seven years should be in the prescribed form and registered, while leases of seven years and under will bind the title of the registered proprietor without registration or notification.Where there is an agreement to grant a lease for a period of over seven years which has been partly performed, equity will enforce the agreement. Thus, it is now the law that where there is only an agreement for a lease, there is a lease in equity. This is the doctrine inWalsh v Lonsdale[1882] 21 Ch D 9. In that case, there had been an agreement for a lease for seven years. The terms of the agreement had included payment of rent in advance. The tenant had entered into possession, but then had failed to pay rent as agreed under the agreement. The landlord attempted to exercise his right of distress. The Court of Appeal found for the landlord -`The tenant holds under an agreement for a lease. He holds, therefore, under the same terms in equity as if a lease had been granted, it being a case in which both parties admit that relief is capable of being given by specific performance ...`Thus, it is said that an agreement for a lease is as good as a lease. But while in many respects this is true, it should be noted that the lease is only an equitable one; thus it has all the weaknesses of equitable interests in regard to enforceability. Further, there is no privity of estate between the tenant and the landlord as this doctrine is one of common law. From this it follows that covenants in an equitable lease are not enforceable by assignees, unless specifically assigned.Where there is an intended lease for a period of over seven years but the lease is not by deed in the English language, the lease is `void at law`. But if, nevertheless, the lessee has entered into possession, it would be construed as an agreement for a lease and so would be a good lease in equity. This was so held inParker v Taswell[1858] 2 De G & J 560.`If the Legislature had intended to deprive such a document of all efficacy, it would have said that the instrument should be \"void to all intents and purposes\". There are no such words in the Act. I think that it would be too strong to say that because it is void at law as a lease, it cannot be used as an agreement enforceable in equity, the intention of the parties having been that there should be a lease and the aid of equity only being invoked to carry that intention into effect.`Where the land is governed by the Land Titles Act and the lease for over seven years is not registered as required, the same principles apply. Where the tenant enters into occupation and pays rent, a common law periodic tenancy arises and where the circumstances so justify, an equitable lease under the doctrine ofWalsh v Lonsdalewill also arise [citingChan v Cresdon Pty Ltd[1989] 168 CLR 242].I would elaborate that, at common law, an agreement for a lease which was void for failure to meet the statutory requirement was construed as a tenancy at will. However, if the tenant had entered into possession and was paying rent, the common law would conclude that he had a periodic tenancy, eg year to year or month to month, depending on how the rent was computed to be payable.However, equity would conclude that the tenant had a term for the period mentioned in the agreement and would grant specific performance of the agreement unless a party`s conduct disentitled him to such specific performance.Thus in the classicus locusWalsh v Lonsdale[1882] 21 Ch D 9, Jessel MR said at pp 14 to 15:Now since theJudicature Actthe possession is held under the agreement. There are not two estates as there were formerly, one estate at common law by reason of the payment of the rent from year to year, and an estate in equity under the agreement. There is only one Court and the equity rules prevail in it. The tenant holds under an agreement for a lease. He holds, therefore, under the same terms in equity as if a lease had been granted, it being a case in which both parties admit that relief is capable of being given by specific performance. That being so, he cannot complain of the exercise by the landlord of the same rights as the landlord would have had if a lease had been granted. On the other hand, he is protected in the same way as if a lease had been granted; he cannot be turned out by six months` notice as a tenant from year to year. He has a right to say, \"I have a lease in equity, and you can only re-enter if I have committed such a breach of covenant as would if a lease had been granted have entitled you to re-enter according to the terms of a proper proviso for re-entry.\" That being so, it appears to me that being a lessee in equity he cannot complain of the exercise of the right of distress merely because the actual parchment has not been signed and sealed.Walsh v Lonsdalehas been cited with approval by the Court of Appeal inBannerji HL v Chin Cheng Realty[1982-1983] SLR 135[1983] 2 MLJ 18.",
        "LAND TITLES ACT (CAP 157, 1994 ED) (`THE 1994 LTA`)": "Section 87(1), (2)(a) to (c) and (3)(a) of the 1994 LTA states:(1) Registered land may be leased for any term of years exceeding 7 years by an instrument of lease in the approved form.(2) The Registrar shall not register any lease unless -(a) the term is expressed to exceed 7 years;(b) the date of commencement of the term and its maximum duration are certain; and(c) the lease purports to confer on the lessee exclusive possession of land.(3) For the purposes of this section -(a) the fact that the term of a lease may be extended in pursuance of an option shall be taken into consideration in determining whether the term of the lease exceeds 7 years;I accepted the argument of Mr David De Souza, for Marina Centre, that s 87(1) is not a mandatory provision. It is an enabling provision. A lease may be registered if the term thereunder exceeds seven years and the instrument of lease is in an approved form, and the other requirements of s 87(2) are met. However, there is no requirement in the 1994 LTA that a lease for a term exceeding seven years, and which would meet the other requirements of s 87(2), must be in an approved form or must be registered.Section 45(1) and (2) of the 1994 LTA states:(1) No instrument until registered as in this Act provided is effectual to pass any estate or interest in land under the provisions of this Act, but upon registration of an instrument the estate or interest therein specified shall pass, or the land shall become liable as security for the payment of money (as the case may be), subject to such covenants and conditions as are set forth in the instrument and are capable of taking effect, and subject to such covenants and conditions as are by law declared to be implied in instruments of a like nature.(2) Nothing in this section shall be construed as preventing any unregistered instrument from operatingas a contract. [Emphasis is added.]On the other hand, s 53(1) of the New South Wales Real Property Act 1900 states:When any land under the provisions of this Act is intended to be leased or demised for a life or lives or for any term of years exceeding three years, the proprietor shall execute a memorandum of lease in the form of the Eighth Schedule hereto.As compared with s 87 of the 1994 LTA, s 53(1) applies to leases exceeding three years and appears to be couched in mandatory terms.Section 41(1) of the New South Wales Real Property Act, which is similar to s 45(1) of the 1994 LTA, states:No instrument, until registered in manner hereinbefore prescribed, shall be effectual to pass any estate or interest in any land under the provisions of this Act, or to render such land liable as security for the payment of money, but upon the registration of any instrument in manner hereinbefore prescribed, the estate or interest specified in such instrument shall pass, or as the case may be the land shall become liable as security in manner and subject to the covenants, conditions, and contingencies set forth and specified in such instrument, or by this Act declared to be implied in instruments of a like nature.Furthermore, the New South Wales Real Property Act does not have the equivalent of s 45(2) of the 1994 LTA.Even then, the cases on this New South Wales legislation show that an unregistered lease or the underlying agreement thereunder is still effective as a contract. I will refer to four of these cases.InLeitz Leeholme Stud v Robinson[1977] 2 NSWLR 544, the lessee had executed a memorandum of lease commencing 1 July 1973 and went into occupation. However, the memorandum was never registered. The lessee remained in occupation and paid the rent until 8 March 1976 when he wrote to the lessor stating that he could no longer pay the rent and he would be vacating on 9 April 1976. The lessor treated this as a repudiation, accepted it and when the lessee vacated, the lessor entered into possession of the property. The lessor sued for the rent due on the balance of the term and, by amendment, damages for breach of contract. Before the Court of Appeal, the lessor relied only on its claim for damages. The appeal of the lessee was dismissed.At pp 546 to 548, Glass JA said:The first argument put to the Court on behalf of the defendant involved a series of steps. Because the memorandum of lease was never registered it was ineffectual to pass any estate or interest in the land to the lessee: s.41 of theReal Property Act. However, by virtue of s.127 of theConveyancing Act, 1919, the defendant`s entry into possession and payment of rent gave rise to an implied tenancy at will determinable by one month`s notice in writing. There was, prior to 8th March, an agreement to give and take a lease for six years which was capable of specific performance by order of an equity court. However, the notice given by the lessee on 8th March determined, not only the tenancy at will, but also the whole of the relationship between the parties, including the pre-existing agreement. When asked for authority in support of the final proposition counsel could only answer that there was no authority to the contrary of what was being put. It was argued on general principles that the notice given by the lessee did not involve a repudiation of the agreement, but a lawful termination of it, since it was entitled by notice to terminate the tenancy at will. It was put that you could not have a lawful termination of the right to remain in possession by a notice which took effect as a wrongful repudiation of the agreement, thus entitling the lessor to sue for damages. The two positions were entirely inconsistent. The lessee could not be sued for doing something which he was lawfully entitled to do.In my view, the argument involves a misconception. The agreement and the tenancy at will are independent sources of rights. At no stage do they merge, so that the termination of the estate automatically extinguishes the agreement. The relevant principles are, in my view, as follows. A lease of land under theReal Property Actfor a term exceeding three years creates no legal term unless it is both registrable and registered. But the informal instrument may be treated as evidencing an agreement for a formal lease:Carberry v. Gardiner(1). The unregistered memorandum of lease operates merely as an agreement specifically enforceable in equity, but not itself creating a legal term in the land:Australian Provincial Assurance Association Ltd v Rogers(2). Entry into possession and payment of rent bring into existence a common law tenancy upon such terms of the unregistered memorandum as are applicable to the tenancy at will (3). But, in so far as the memorandum operates as an agreement, it retains a separate identity as the repository of the substantial rights of the parties (4). The doctrine relevant for present purposes had been previously worked out in relation to demises which were void at law, not having been made by deed as required by the  statute. The purported lease, nevertheless, took effect as an executory agreement for a lease enforceable in equity, and there entitling the lessee to a formal lease:Hoyt`s Pty Ltd v Spencer(5);Butts v O`Dwyer(6). The existence or otherwise of a contract is determined exclusively by common law principle:Parkin v Thorold(7).Accordingly, when these decisions allude to an informal lease operating as an agreement for a lease enforceable in equity, they affirm, not only the availability of equitable relief, but also the existence of a contract at law. If the innocent party deems damages to be adequate, there is no reason why the contract may not be enforced at law. But, in any event, the actionability at law of the executory agreement is supported by authority. Prior to theJudicature Act, 1873 (Imp.) actions for damages were successfully brought on instruments which for want of a seal were void at law as demises:Bond v Rosling(8);Tidey v Mollett(9);Rollason v Leong(10).Given the availability of the legal remedy,the contractual positionis entirely clear. The defendant, by executing the memorandum of lease, concluded an agreement to take a lease for six years. On 8th March, after being in occupation for under three years, he gave a notice which amounted to a wrongful repudiation of his obligations under that agreement. The plaintiff accepted the repudiation, and thereby elected no longer to be bound by the agreement. Upon such rescission, it become entitled to sue for damages for loss of its bargain:Heyman v Darwins Ltd(11).The trial judge ruled that the plaintiff, though unable to sue for damages at common law, could enforce the agreement in equity and obtain damages in lieu of specific performance. The defendant advanced arguments why his Honour should have held, on discretionary grounds, that equitable relief was not available to the plaintiff. In view of the conclusion I have reached, I find it unnecessary to consider these submissions. [Emphasis is added.]The second case isProgressive Mailing House v Tabali[1985] 157 CLR 17. The facts are stated at pp 18 and 19:By unregistered lease in registrable form dated 4 December 1978 Tabali Pty. Ltd. leased factory premises at Artarmon in New South Wales to The Progressive Mailing House Pty. Ltd for five years commencing on that date. Clause 10.1 provided that if rent remained unpaid for fourteen days the lessor might \"without prejudice to any claim which he might have against the Lessee in respect of any breach of the covenants\" of the lease re-enter the premises. Clause 11.6 required the lessor, within twelve weeks of the obtaining of development approval from the municipal council, to carry out certain works and provided that the lessee would take possession fourteen days after the lessor had given notice in writing that, in the opinion of the lessor`s architect, the works had been completed. The first payment of rent was to be made two months after the fourteen days. In fact, the lessee went into possession before the lease was executed. The lessor subsequently gave notice to the lessee that, in the opinion of its architect, the works had been completed. The lessee denied that the works had been satisfactorily completed, and ceased to pay rent on the ground that the lessor`s failure to complete the works satisfactorily relieved it of liability to make further payments. The lessor brought an action in the Supreme Court of New South Wales seeking possession, judgment for outstanding rent, and damages. Lusher J. gave judgment for the lessor for possession and awarded damages of $85,000 for its loss, as a consequence of re-entry, of the benefit of the covenant to pay rent. An appeal by the lessee to the Court of Appeal Division of the Supreme Court (Reynolds, Hutley and Glass JJ.A.) was dismissed. The lessee appealed from the judgment of the Court of Appeal Division to the High Court.The sole question before the High Court of Australia was whether the judge of first instance was correct in awarding damages to the lessor.At pp 25 to 27 Mason J said:In the first instance it is necessary to examine the legal consequences of the failure to register the memorandum of lease. At common law where there was an agreement for lease but no demise, either because the agreement was expressed as an executory contract or consisted of an intended demise for more than three years which was void under ss. 2 and 3 of theStatute of Fraudsbecause it was not under seal, the intended lessee upon entering into possession became a tenant at will and upon payment of rent became a tenant from year to year. The tenancy thereby created had the following characteristics: (1) the terms and conditions of the agreement, save in so far as they were inconsistent with a tenancy from year to year, applied to it; and (2) the tenancy from year to year continued only during the term contracted for, and expired at the end of that term by effluxion of time without notice to quit, being in the meantime liable to a sooner determination by notice to quit: seeMoore v. Dimond(15);Carberry v. Gardiner(16).By s. 127(1) of theConveyancing Act1919 (N.S.W.), as amended, it is provided that no tenancy from year to year shall be implied by payment of rent and that if there is a tenancy and no agreement as to its duration then it shall be deemed to be a tenancy determinable by either party by one month`s notice in writing expiring at any time.In equity, however, a written lease not under seal was regarded as evidencing an agreement for lease. As an agreement for lease was capable of specific performance equity would decree specific performance of the written lease by ordering the execution of a lease under seal. In the meantime, in accordance with the doctrine ofWalsh v. Lonsdale(17), the relationship between the parties in equity was that of landlord and tenant:Carberry v. Gardiner(18). The landlord could, if necessary, be restrained by injunction from acting on the footing that the other party was merely a tenant at will or a tenant from year to year:Walsh v. Lonsdale;Dockrill v. Cavanagh(19). It was otherwise where the agreement had been terminated. Then equity would not allow one party to allege that any tenancy, even a tenancy at common law, existed:Dimond v. Moore(20)....InNational Trustees, Executors and Agency Co. of Australasia Ltd v. Boyd(26) the High Court held that a lease for a term of seven years which was not registered as required by s. 61 of theTransfer of Land Act1915 (Vict.) was effective to give the lessee an equitable lease for seven years and was a good defence to an action by the successors in title of the lessor to recover possession of the premises. Knox C.J., Gavan Duffy and Rich JJ., having said that the real argument before them was that the instrument, for want of registration, could operate only as a contract and not as a lease binding the remainder, continued (27):\"The simple answer is that it operates, not merely to create contractual rights and duties, but to create an equitable term of years and a tenure by estoppel between the lessor and her privies and the lessee.\"I should prefer to say that the equitable term arises by virtue of the doctrine inWalsh v. Lonsdaleand the maxim that equity considers as done what ought to be done, rather than by reference to the doctrine of estoppel. That was the approach taken inYork House Pty Ltd v. Federal Commissioner of Taxation(28). And it is an approach which accords with the comprehensive explanation given by Jordan C.J. inCarberry v. Gardiner, Dockrill v. Cavanagh, and inAustralian Provincial Assurance Ltd v. Rogers(29).It follows that the rights of the parties in the present case are to be determined on the footing that as between them, notwithstanding the failure to register the memorandum of lease, it brought into existence an equitable term of the duration which it specified and subject to the conditions which it contained. The question which arises is the extent, if at all, to which the relevant rights, duties and liabilities of the parties to the memorandum of lease fall to be determined by reference to the ordinary principles of contract law.At p 29, Mason J concluded:The decisions in Australia and Canada, and the speeches inPanalpina, reflect the point made by William O. Douglas and Jerome Frank in \"Landlords` Claims in Reorganizations\",Yale Law Journal, vol. 42 (1933), p.1003, in footnote 6, that, as the law of landlord and tenant had outgrown its origins in feudal tenure, it was more appropriate in the light of the essential elements of the bargain, the modern money economy and the modern development of contract law thatleases should be regulated by the principles of the law of contract. [Emphasis is added.]The third case isChan v Cresdon[1989] 168 CLR 242, FC. The facts are stated in the judgments of Mason CJ, Brennan, Deane and McHugh JJ at pp 245 and 246:The appellants were parties to an agreement for lease executed in March 1984 pursuant to which the respondent agreed to lease for a term of five years certain land in Queensland to Sarcourt Pty. Ltd. (\"Sarcourt\"), and the appellants were named as guarantors of Sarcourt. The agreement provided that the parties would execute a lease in the form which was annexed to the agreement. The form of lease contained a further guarantee by the appellants of the obligations of Sarcourt as lessee. A lease in that form was executed simultaneously with the agreement for lease, but was not registered with the Registrar of Titles notwithstanding that the land was under theReal Property Act1861 (Q.) (\"the Act\").The respondent brought proceedings against the appellants and Sarcourt claiming a sum of $28,877.70, being the total amount payable by Sarcourt as lessee for rent and other charges and interest. Sarcourt did not appear in the action and the respondent proceeded against the appellants and a third person also named as a guarantor. The appellants successfully contended in the District Court that there had been a total failure of consideration on the part of the respondent as lessor because it had been required to grant to Sarcourt a legal lease for a term of five years, and that accordingly the appellants were relieved of their obligations as guarantors described in the executed instruments.In the Full Court of the Supreme Court of Queensland, the respondent`s appeal was allowed on the grounds that there was no failure of consideration and that the lease was good in equity despite being \"void at law\" due to the failure of the respondent to see to its registration. The guarantee was held to extend to obligations under that equitable lease. From that decision the appellants now appeal....The relevant part of the lease for present purposes is cl. 23 which provided, so far as is relevant:\"23.01[emsp ]GUARANTEE AND INDEMNITY[emsp ]The [appellants] in consideration of the [respondent] entering into this lease at the [appellants`] request jointly and severally GUARANTEES to the [respondent] due and punctual performance by [Sarcourt] of the obligations on its part to be performed under this lease AND INDEMNIFIES and agrees to indemnify the [respondent] against all loss damage costs and expenses suffered or incurred by the [respondent] as a result of any failure by [Sarcourt] to pay any moneys under this lease or any breach by [Sarcourt] of any of the covenants and conditions contained or implied in the Lease ...\"It is the guarantee set out above upon which the respondent sued. It was not sought to rely upon the indemnity.After referring to various cases, the judgments go on to say at p 252 onwards:For present purposes these authorities establish two propositions. First, the court`s willingness to treat the agreement as a lease in equity, on the footing that equity regards as done what ought to be done and equity looks to the intent rather than the form, rests upon the specific enforceability of the agreement. Secondly, an agreement for a lease will be treated by a court administering equity as an equitable lease for the term agreed upon and, as between the parties, as the equivalent of a lease at law, though the lessee does not have a lease at law in the sense of having a legal interest in the term.The first proposition requires some elaboration or qualification in order to accommodate what has been said in later cases.Although it has been stated sometimes that the equitable interest is commensurate with what a court of equity would decree to enforce the contract, whether by way of specific performance(Connolly v. Ryan(50);Brown v. Heffer(51);Chang v. Registrar of Titles(52)),injunction or otherwise(Tailby v. Official Receiver(53);Redman v. Permanent Trustee Co. (54);Legione v. Hateley(55)),the references in the earlier cases to specific performance should be understood in the sense of Sir Frederick Jordan`s explanationadopted by Deane and Dawson JJ. inStern v. McArthur(56):\"Specific performance in this sense means not merely specific performance in the primary sense of the enforcing of an executory contract by compelling the execution of an assurance to complete it,but also the protection by injunction or otherwise of rights acquired under a contractwhich defines the rights of the parties`: ... `Chapters on Equity in New South Wales`,Select Legal Papers, 6th ed. (1947), p.52, n.(e).\"In relation to the second proposition stated above Maitland, in hisLectures on Equity, 2nd ed. (1936), p.158, in a statement quoted by Latham C.J. inWilliams v. Frayne(57), commented:\"An equitable right is not equivalent to a legal right; between the contracting parties an agreement for a lease may be as good as a lease ... But introduce the third party and then you will see the difference.\" [Emphasis is added.]The judges then concluded that although the equitable lease would incorporate the terms of the unregistered lease, this arose not from the instrument of lease but from the underlying agreement. Therefore, the liability to pay rent under the equitable lease was not an obligation `under this lease` within the meaning of cl 23.01. Toohey J, however, reached a different conclusion.The fourth case isTelado P/L v Vincent[1996]  NSW ConvR 56.In that case, the appellant was the proprietor of lands on which a commercial building was erected. The building had a number of shops of which Shop 4 was the relevant one.Penrado Pty Ltd (`Penrado`) had entered into occupation of the shop pursuant to an oral agreement for a lease for a term of five years commencing in December 1989.A memorandum of lease was signed between the appellant, Penrado and the respondents, as guarantors. The memorandum of lease was dated 29 June 1990.The memorandum of lease contained the following two clauses:DEEMED AGREEMENT UNDER SEAL10 That this document shall be deemed an agreement under seal for the granting of such a lease as is hereby purported to be granted and the covenants and conditions herein contained shall be deemed to bind the parties in the same manner as if THIS  DOCUMENT WERE REGISTERED NOTWITHSTANDING THAT IT MAY BE held that no estate passed hereunder PROVIDED that should the Lessee require registration the Lessor will procure the same but any necessary survey and the registration of such lease and the obtaining of all necessary consents thereto shall be at the cost or expense of the Lessee.GUARANTEE11 The Lessor agrees to grant this lease at the request (testified by his/her execution hereof of TERRENCE PATRICK O`NEILL AND CLIFTON GEORGE VINCENT (hereinafter called the Guarantor). In consideration of the Lessor at the request of the Guarantor entering into this lease the said Guarantor does hereby guarantee to the Lessor the due and punctual performance by the Lessee of its several obligations and duties on its part to be observed and fulfilled and performed pursuant to the terms of this lease and in particular but without limiting the generality of the guarantee hereby given IT IS AGREED THAT: ...The memorandum of lease was under hand. Initially no action had been taken to register the memorandum of lease but on 20 September 1990, it was lodged for registration.On 2 October 1990, Penrado vacated the shop following which the appellant re-let it to another person for a term commencing 3 October 1990 to 9 December 1994. The memorandum of lease (for Penrado`s lease) was registered on 16 October 1990.The question was whether cl 11 of the lease bound the respondents as guarantors in view of the fact that no legal leasehold estate was conferred upon Penrado as the memorandum of lease was not registered at the relevant time.In the New South Wales Court of Appeal, Powell JA said:Since they have some bearing upon the approach to be taken to the question to be determined on this appeal, it is, perhaps, desirable that one should first record certain basic principles. They are as follows:-1. a lease, or attempted lease, of land under Old System title for a term in excess of 3 years is ineffective to pass any interest at law in the subject land unless made by deed (Conveyancing Act 1919 s.23B, s.23D(2)), and a lease, or attempted lease, of land registered under the Real Property Act 1900 for a term in excess of 3 years is ineffective to pass any estate or interest in the subject land unless, and until, registered in accordance with the provisions of the Act (Real Property Act 1900, ss. 53, 41, 36);2. however, a purported lease which either because - being in relation to land under Old System title - it is not by deed, or because - being in relation to land registered under the Real Property Act 1900 - it is not registered, does not of itself create a legal term in the subject land, nonetheless operates as an agreement for lease enforceable in equity. Two consequences flow from that fact, they being:-(a) in the event of a repudiation by the putative lessor, the putative lessee would be entitled to seek relief in the nature of specific performance of that agreement for lease; and(b) in the event of repudiation by either party to that agreement for lease, the innocent party, if he deems damages to be adequate, might sue on the agreement at law (see, for example,Leitz Leeholme Stud Pty. Limited v.  Robinson;Shevill v. The Builders Licensing Board;The Progressive Mailing House Pty. Limited v. Tabali Pty. Limited);3. further, although the instrument in question may of itself be ineffective to create a legal or equitable estate or interest in the subject land, the underlying agreement which it represents, if capable of being made the subject of an order for specific performance, will, in accordance with the principles of equity, be effective to bring into existence an equitable estate or interest in the land (see, for example,Progressive Mailing House Pty. Limited v. Tabali Pty. Limited;Chan v. Cresdon Pty. Limited).4. ...5. ...6. ...7. ...Therefore, the same principles, as enunciated in the earlier cases, were applied although the New South Wales Court of Appeal inTelado(supra) reached a different conclusion from the High Court of Australia inChan v Cresdon(supra) and found the guarantors liable in view of the interpretation by the Court of Appeal of cl 10 of the memorandum of lease.It was my view that the same principles apply under the 1994 LTA especially in view of s 45(2) of the 1994 LTA which, in my view, expressly preserves the underlying contract.The same principles apply to a lease which is not in an approved form and not under deed and to an agreement to lease which is not under deed.However, Ms Chong referred to, inter alia, (1)Cheong Lep Keen v Tan Tin Kek[1968] 2 MLJ 126and (2)Lee Lum Soh v Low Ngah[1973] 1 MLJ 97. I need refer to the latter only as it adopted the same approach in the former.In the case ofLee Lum Soh, the appellant had entered into possession of the premises under a lease for ten years which was not registered under the National Land Code.The magistrate had found the agreement of lease was void and that the appellant was in occupation of the premises as a monthly tenant and that the monthly tenancy had been duly terminated by a six-month written notice.On appeal to the High Court in Kuala Lumpur, Azmi J dismissed the appeal.The judge found that the agreement was void for non-registration under the National Land Code.Secondly, the judge found that the appellant had failed to establish any equitable ground and, as such, the agreement should not be specifically enforced.The judge then relied on p 3 ofWoodfall on Landlord and TenantVol 1 (26th Ed) which states:A contract for a lease is not in itself a demise, but is merely an agreement that the intending lessor shall grant a lease and that the intending lessee shall accept the same. Such a contract does not of itself create a legal relationship of landlord and tenant, but it has long been established that so soon as the tenant enters under the agreement the relationship arises and he becomes a tenant at will, and that when he pays, or expressly  agrees to pay, any part of the annual rent thereby reserved, his tenancy at will changes into a tenancy from year to year, upon the terms of the intended lease, so far as they are applicable to and not inconsistent with a yearly tenancy. The same rule applies to entry under a void lease.Accordingly, the judge concluded that the remaining issue was whether the demised premises were held under a yearly or monthly tenancy as the lease was void for non-registration.With respect, I did not think that the approach in that case was correct.It proceeded on the basis that as the lease was void for non-registration, it was for the tenant to show some equitable ground which would justify the court to order specific performance. It then assumed that such an equitable ground would exist only if the tenant could show that he had expended sufficient moneys on the premises which were not recoverable from the landlord.However, under the doctrine inWalsh v Lonsdale, equity would enforce the contract upon the same terms of the contract unless there was some reason why the party claiming relief should be disentitled to the relief sought.As regards the judge`s citation of the passage from p 3 of the twenty-sixth edition ofWoodfall on Landlord and Tenant, I have considered the twenty-sixth edition and I have noted the following passage immediately after the passage cited by the judge. The following passage is instructive and it reads:Moreover, under the rule laid down inWalsh v. Lonsdale, a tenant holding under a contract for a lease which is capable of being enforced by specific performance holds under the same terms in equity as if a lease had been granted. In this way a relationship of landlord and tenant is created in equity, and as between the lessor and lessee the rights and obligations of the parties are the same in all respects as they would have been if the lease had already been executed ...SPECIFIC PERFORMANCEMs Chong submitted that as Marina Centre refused to provide a lease in the approved form, Golden Village could not obtain specific performance.In my view, this submission was begging the question.The concept of specific performance is not applied in isolation. It is applied in the context of agreements. One can only seek specific performance of an agreement.Therefore it was necessary to consider what the parties had agreed to.Ms Chong submitted that Golden Village was supposed to get a registrable lease. However, the correspondence prior to the signing of the agreement demonstrated that this was not true. The point about a non-registrable lease had been specifically raised and discussed. By the time Golden Village signed the agreement, it knew that Marina Centre was not going to grant it a registrable lease. Golden Village had entered into the agreement on that basis.By asking for a registrable lease, Golden Village was not asking for the agreement to be specifically enforced but was instead asking for something outside of the agreement and, indeed, contrary to what had been agreed.It is true that in many cases, the courts have referred to the specific performance of an agreement for a lease in the context of ordering the other party to execute a lease in registrable form. However, that was because the intention between the parties in those cases was for the tenant to be granted a lease in registrable form, or, that was assumed to be the case.The following passage from the judgment of Lord Esher MR inSwain v Ayres[1888] 21 QBD 289at 293, which Ms Chong relied on, must be considered in that context:The distinction between law and equity is now abolished in the sense that the same Court is to give effect to both, and that, when the doctrines of law and equity conflict, the latter are to prevail. I should therefore be disposed to say that, when there is such a state of things that a Court of Equity would compel specific performance of an agreement for a lease by the execution of a lease, both in the Equity and Common Law Divisions the case ought to be treated as if such a lease had been granted and was actually in existence. There would then be the equivalent of a lease, that is to say, the lease of which equity would compel the execution in specific performance of the agreement. That is a very different thing from saying that, where equity would not compel specific performance by the execution of a lease, the lease of which equity would not decree execution is to be considered in equity as existing. That contention seems to me quite untenable. It seems to me quite impossible to say that equity would consider a lease in existence, though it would not grant specific performance by decreeing execution of a lease. Such a contention seems to me to make the doctrine of equity on the subject self-contradictory.It must also be borne in mind that inSwain v Ayres, the tenant was not the plaintiff nor was he seeking the execution of the lease itself.In that case, the landlord`s predecessor had entered into an agreement for a lease of a house with the intended lessee by which the intended lessee had agreed to expend a certain sum in repairs and improvements and upon this being done, a lease would be granted for 80 years at a specified rent. The agreement provided that the lease to be executed should contain the usual covenants to pay the rent and keep the premises in good repair.The intended lessee had entered the house, the stipulated sum for repairs and improvements had been expended and rent had been paid from time to time. However, no lease was executed.Subsequently, the intended lessee died and his personal representatives assigned his interest to the present tenant who was one of the defendants, the other defendants being his sub-tenants.The landlord brought an action to recover possession of the house for subsequent breach of the agreement to repair.Under s 14 of the Conveyancing and Law of Property Act 1881, the right of re-entry was not enforceable `unless and until the lessor serve on the lessee a  notice specifying the particular breach complained of, and if the breach is capable of remedy, requiring the lessee to remedy the breach ...`.No such notice was given by the landlord and the tenant was contending that such a notice should have been given.To determine this, the court had to decide whether the defendant had only a tenancy or a lease for the purpose of s 14.In deciding whether the tenant had a lease, the court had to decide whether the tenant would be entitled to specific performance of the agreement for a lease by the execution of a lease. As he was himself in breach of the covenant to repair, the court held that specific performance would not have been granted and therefore there was no lease or the equivalent of a lease for the purpose of s 14.Therefore,Swain v Ayres(supra) is not authority for the proposition that specific performance of an agreement for a lease must always be by way of an execution of a lease in a form complying with the relevant statutory provision.As I have said, it depends on what the parties had agreed to.In the present case before me, specific performance can be by way of an injunction as was recognised in, for example,Chan v Cresdon(supra). Hence, if, for example, Marina Centre were to attempt to lease the premises to some other persons, in breach of its obligations under the agreement, Golden Village could seek an injunction to restrain it from doing so.I would add that when Golden Village sought a lease in the approved form, this was merely a ploy to escape from its obligations under the agreement. It was simply looking for a way out to avoid paying further rent or to reduce the rent. In other words, it was not acting bona fide in seeking a lease in the approved form.",
        "CONSIDERATION": "Ms Chong submitted that as Golden Village would not be getting a lease which could be registered, there was a failure of consideration or the consideration was illusory.I did not agree. As I have said, Golden Village did not bargain for a lease which could be registered.Furthermore, it had been and presumably still was enjoying the benefit of what it had contracted for, ie the use of the premises. That benefit can be protected should Marina Centre choose to take any step to jeopardise it.",
        "REPUDIATION": "Ms Chong`s next submission was that Marina Centre was in repudiatory breach of the agreement as the intended lease is not valid in law. She submitted that the parties had thought that they could come to court to obtain remedies if their respective rights were threatened and a lease which was void in law would not give rise to any right or remedy.That submission is not correct in view of what I have said above and I need not say any more about it.",
        "MISTAKE": "Ms Chong then submitted that although Golden Village knew it was not supposed to get a registrable lease, that was due to a mistake of law which was shared by Marina Centre. She said that both parties had thought that the agreement had conferred some kind of interest in the premises.The short answer was that the agreement does confer an equitable interest in the premises on Golden Village.Furthermore, the agreement also creates contractual rights which is what Golden Village had eventually agreed to.",
        "INTERPRETATION OF CLAUSE 2 OF THE AGREEMENT": "Ms Chong submitted that cl 2 of the agreement should be construed in two parts. I set out below the provisions in the two parts she proposed:LEASE OF PREMISES(First part)The parties hereto hereby agree that upon the completion of the development of the BUILDING and the issue by the relevant authority of the Temporary Occupation Permit for the same, the Landlord shall grant and the Tenant shall take a lease of the PREMISES for the TERM commencing on the earlier to occur of the expiration of the FITTING-OUT PERIOD or the commencement of business by the Tenant in the PREMISES or any part thereof(Second part)such lease to be on the terms and conditions and in the form set out in the ANNEXED LEASE.Ms Chong ran her argument in this manner. She said that the first part contemplated a valid lease whereas the second part in contemplating a lease which was not in the approved form had destroyed the effect of the first part. As the second part was inconsistent with the first part, it should be rejected as repugnant to the first part and the first part prevails, relying on a principle of interpretation in Kim LewisonThe Interpretation of Contracts(2nd Ed) at p 245.However, that principle also states that, `If, however, the later clause can be read as qualifying rather than destroying the effect of the earlier clause, then the two are to be read together, and effect given to both`.It was clear to me that the second part of cl 2 was not repugnant to and was qualifying the first part by elaborating on the terms and conditions of the lease and the intended form of the lease.",
        "PLANNING ACT (CAP 232, 1990 ED) (`THE 1990 PLANNING ACT`)": "Ms Chong`s final argument was that the intended instrument of lease (`the lease`) was in breach of the Planning Act as it constituted a subdivision of the  premises from the rest of the building without complying with the requirements for subdivision under the 1990 Planning Act. She said that this was a scheme by Marina Centre to deceive public administration.Section 10(3)(a) of the 1990 Planning Act states:No person shall subdivide any land unless -(a) he has obtained the written permission of the competent authority, and a copy of his written permission has been forwarded by the competent authority to the Collector together with a plan of the permitted subdivision on which dimensions of all lots, widths of streets and backlanes and such other particulars as the competent authority may consider necessary are shown; ...Section 10(8) of the 1990 Planning Act states:Any person who contravenes subsection (1) or (3), shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $3,000 and, in the case of a continuing offence, to a further fine not exceeding $100 for every day after the first day during which the offence continues after conviction.Section 2(2) of the 1990 Planning Act states:For the purposes of this Act, a person is said to subdivide land if, by any deed or instrument, he conveys, assigns, demises or otherwise disposes of any part of the land in such a manner that the part so disposed of becomescapable ofbeing registered under the Registration of Deeds Act orin the case of registered land being included in a separate folio of the land-register under the Land Titles Act, and \"subdivide\" and \"subdivision\" shall be construed accordingly:Provided that a lease for a period not exceeding 7 years without the option of renewal or purchase shall not be deemed to be a disposal within the meaning of this definition. [Emphasis is added.]Section 165(1)(a) of the 1994 LTA states:Except as provided in this section, the Registrar shall not register any instrument affecting part of the land in a folio until he is satisfied that -(a) the authority for the time being charged with the duty of controlling or supervising the subdivision of the land has certified that the lawful requirements of that authority relating to subdivision have been complied with; ...As I understood Ms Chong`s submission, the lease constituted a subdivision of the building, known as Leisureplex, and as the written permission of the competent authority for subdivision was not obtained, the lease was illegal and void.InBannerji HL v Chin Cheng Realty[1982-1983] SLR 135[1983] 2 MLJ 18, the plaintiff obtained a lease dated 23 July 1957 of premises for a period of ten years from 1 August 1957. The lease contained a proviso for renewal for a further term of ten years on the same covenants including the covenant for renewal.By a letter dated 22 April 1967, the plaintiff requested the defendants to grant him a further term of ten years. The defendants refused but the plaintiff remained in possession of the premises.Subsequently, by a letter dated 22 April 1977, the plaintiff again requested the defendants to grant him a further term of ten years, this time from 31 July 1977. Again the defendants refused.The plaintiff then commenced proceedings on 27 July 1977 for specific performance of the original lease. There were other disputes which were not material to the case before me.One of the defences raised by the defendants was that the covenant for renewal could not be performed without proper subdivision under the Planning Act (Cap 279, 1970 Ed) which came into force in February 1960. The provisions of the Planning Act (Cap 279) which were relied on in that case were similar to s 2(2), s 10(3) and (8) of the 1990 Planning Act which is applicable to the case before me.Justice AP Rajah, delivering the judgment of the Court of Appeal, said ([1982-1983] SLR 135 at 143-144; [1983] 2 MLJ 18 at 23-24):One of the defences raised by the respondents at the trial of the High Court suit was that cl 3(c) of the 1957 lease could not be performed for the reason that since 1 February 1960 it was an offence for the respondents to grant a lease for a term exceeding seven years without proper subdivision under the Planning Ordinance 1959. It seems to us that the argument that was put to the learned trial judge by counsel for the respondents, and not controverted in the manner in which, in our view, it should have been by counsel for the appellant, was that it was only since 1 February 1960 that no person could subdivide any land unless he had obtained the permission of the competent authority (s 9(3)) and that any person who contravened this provision was guilty of an offence and liable on conviction to a fine (s 9(8)). But was this really so? Did the Planning Ordinance enact something new regarding the division of land into lots or parcels for the first time?Before February 1960 by virtue of the Singapore Improvement Ordinance `a person is said tolay-out` land if by any deed or instrument he conveys, assigns, demises or otherwise disposes of any part of such land in such manner that the part so disposed of becomes a separate holding` and `holding` means any piece or parcel of land held or possessed under an instrument of title capable of being registered under the Registration of Deeds Ordinance`; but as from 1 February 1960 `a person is said tosubdivideland, if, by any deed or instrument, he conveys, assigns, demises or otherwise disposes of any part of such land in such manner that the part so disposed of becomes capable of being registered under the Registration of Deeds Ordinance`. In effect to `lay-out` land under the Singapore Improvement Ordinance became to `subdivide` land under the Planning Ordinance. It was merely a change in nomenclature. Further under s 59(11) of the Singapore Improvement Ordinance any person who lays out land without the approval of the Board is liable to a fine not exceeding $250; similarly under s 9(8) of the Planning Ordinance any person who shall subdivide land without permission of the competent authority shall be liable to a fine not exceeding $1,000. Under the Singapore Improvement Ordinance it was an offence to grant a lease for a term exceeding three years without a proper lay-out; under the Planning Ordinance it is an offence to grant a lease for a term exceeding seven years without a proper subdivision. Yet it was possible under r 13 of the Registration of Deeds Rules 1934 for the Registrar of Deeds, exercising his discretion, to have such deeds registered as indeed was what happened both to the 1953 lease and the 1957 lease. If the learned trial judge`s attention had been drawn to the similar sections in the Singapore Improvement Ordinance we are of the view that he would not have found:`that it was never in the contemplation of the parties that subdivision should be applied for in respect of the said premises. The plaintiff (appellant) says that the defendants (respondent) are required to apply for subdivision of the said premises. That would be a fundamental change in the conditions of the said lease. I am of the view that by virtue of the Planning Ordinance, cl 3(c) is unenforceable as against the defendants (respondents) and that they are released from their obligations thereunder.`The 1953 lease for four years and the 1957 lease for ten years were executed while the Singapore Improvement Ordinance was in force and yet it was possible to have the two deeds registered on 4 August 1953 and 1 August 1957 respectively under the Registration of Deeds Rules. The position in 1967 with regard to the registration of a lease for ten years was in effect no more different than it was when the 1957 lease was registered on 1 August 1957. The respondents took no steps whatsoever in 1967 with the competent authority and/or the Registrar of Deeds with a view to register a further lease for ten years. It lies ill in the mouth of the respondents now to raise this defence when no such fears of criminal illegality assailed them when the appellant gave written notice to them in 1967 under the 1957 lease asking for an extension of ten years from 1 August 1967.In any event this plea taken by the respondents on the subdivision issue becomes meaningless as the court in the course of the hearing of this appeal was informed that the property in question has now in fact been subdivided and allowed registration.InChin Hwa Trading v United Overseas Bank[1984-1985] SLR 584[1986] 1 MLJ 207, the plaintiff company (the sub-sub-purchaser) was the successful bidder at an auction of a property put up for sale by a mortgagee bank. The property was one of the lots the original purchaser had subdivided into separate factory units without obtaining any prior permission from the planning authorities.The bank`s solicitors served a notice to complete on the plaintiff`s solicitors who applied to court for a determination whether the auction sale agreement was tainted with illegality because it amounted to an agreement to complete the sale and purchase by an act in breach of s 9(3) of the then Planning Act.Chief Justice Wee Chong Jin said ([1984-1985] SLR 584 at 588-590; [1986] 1 MLJ 207 at 209-211):First, it is contended on behalf of the sub-sub-purchaser that as no approval has been given by the competent authority as provided in s 9(3)(a) of the Planning Act for the subdivision of the ground floor of Block B into more than one separate factory unit, the auction sale agreement of 18 April 1984 is `tainted with illegality`. It is said that the contract is illegal because it amounts to an agreement to complete the sale and purchase of the property by an illegal act in breach of s 9(3) and punishable under s 9(9).The argument, as I understand it, is that it is a contract that the mortgagee could not lawfully perform because in order to perform it the mortgagee has to execute an instrument assigning to the sub-sub-purchaser, inter alia, `all the estate right and title to the property` and which instrument subdivides land within the meaning of the Planning Act.Section 2 of the Planning Act defines the expressions `land` and `sub-divide` unless the context otherwise requires as follows:`\"land\" includes buildings and any estate or interest in or right over land;\"sub-divide\" - a person is said to sub-divide land if, by any deed or instrument, he conveys, assigns, demises or otherwise disposes of any part of the land in such a manner that the part so disposed of becomes capable of being registered under the Registration  of Deeds Act or in the case of registered land being included in a separate folio of the land register under the Land Titles Act, and `sub-division` shall be construed accordingly:Provided that a lease for a period not exceeding seven years without the option of renewal or purchase shall not be deemed to be a disposal within the meaning of this definition;`Section 9(3)(a) provides as follows:`(3) No person shall subdivide any land unless -(a) he has obtained the written permission of the competent authority, and a copy of its written permission has been forwarded by the competent authority to the Collector together with a plan of the permitted subdivision on which dimensions of all lots, widths of streets and backlanes and such other particulars as the competent authority may consider necessary, are shown;`Section 9(9) provides as follows:`Any person who contravenes the provisions of subsection (1) or (3) of this section, is guilty of an offence under this Act and is liable on conviction to a fine not exceeding three thousand dollars and in the case of a continuing offence, to a fine not exceeding one hundred dollars for each day after the first day during which the offence is continued.`Whether or not the argument advanced on behalf of the sub-sub-purchaser is right depends on the construction of the expression `sub-divide` as defined in s 2. In my opinion it must be implicit in that definition that it is the instrument which becomes capable of being registered or being included in a separate folio of the land register before a person can be said to sub-divide land within the meaning of the Planning Act. The reason is because the Registration of Deeds Act and the Land Titles Act provide for the registration of instruments affecting land and not of land.In the present case the agreement itself is clearly not capable of becoming registered under the Registration of Deeds Act or being included in a separate folio of the land register under the Land Titles Act and accordingly the agreement does not sub-divide land within the meaning of the Planning Act and does not infringe the provisions of s 9(3) of the Planning Act.The remaining question is whether the deed of assignment of all the estate right and title to the property which the mortgagee must execute in performance of the contract amounts to sub-dividing land within the meaning of the Planning Act.If the property is governed by the Registration of Deeds Act and has not been surveyed and demarcated in accordance with the provisions of s 14(1)(c) of that Act the deed of assignment cannot be registered.Section 14(1)(c) reads:`No instrument or memorial shall be registered -(c) unless the boundaries of all lands affected thereby have been surveyed and demarcated to the satisfaction of the Chief Surveyor, or unless the Chief Surveyor certifies to the Registrar that a plan showing the boundaries of all the lands affected thereby and certified as correct by a licensed surveyor has been lodged with him and that the plan has been approved by him for the purposes of this subsection;`On the undisputed facts, the property has not been surveyed or demarcated in accordance with the requirements of s 14 and accordingly the mortgagee`s deed of assignment when executed would not be capable of becoming registered under that Act.If the property is part of land which has been included in a separate folio of land register kept by the Registrar of Titles under the Land Titles Act, the deed of assignment when executed by the mortgagee cannot be registered under that Act unless the provisions of s 144(1) have been complied with. Section 144(1) reads:`Except as provided in this section, the Registrar shall not register any instrument affecting part of the land in a folio of the land register until he is satisfied that -(a) the authority for the time being charged with the duty of controlling or supervising the sub-division of the land has certified that the lawful requirements of that authority relating to sub-division have been complied with; and(b) the boundaries and dimensions of part of the land in a folio of the land register shown in the plan annexed to any instrument are in accordance with the final boundaries and dimensions shown in the plan lodged with and approved by the Chief Surveyor.`It is common ground that the authority referred to in s 144(1) has not certified that the lawful requirements relating to sub-division have been complied with and accordingly the deed of assignment would not be an instrument which sub-divides land within the meaning of the Planning Act and the provisions of s 9(3) would not be infringed and I must therefore declare that (1) the auction sale agreement is lawful and (2) it is lawful for the parties to the agreement to complete the sale and purchase of the property. There must also be an order for costs in favour of the mortgagee in these proceedings.As can be seen, ss 2, 9(3)(a) and (9) of the Planning Act considered inChin Hwa Trading(supra) are similar to ss 2(2), 10(3)(a) and (8) of the 1990 Planning Act.Section 144(1)(a) of the Land Titles Act considered inChin Hwa Trading(supra) is similar to s 165(1)(a) of the 1994 LTA. The premises come under the 1994 LTA.It is not disputed that the authority referred to in s 165(1) of the 1994 LTA has not certified that the lawful requirements of that authority relating to sub-division have been complied with in respect of the lease.One interpretation of s 2(2) of the 1990 Planning Act is that in the absence of the certificate, the lease from Marina Centre, pursuant to the agreement, is not one that is capable of being included in a separate folio of the land register under the 1994 LTA since the Registrar of Titles is prohibited from registering that instrument. Accordingly there would be no subdivision within the meaning of s 2(2) of the 1990 Planning Act and therefore s 10(3) of the same Act would not be infringed. This seems to have been the court`s interpretation inChin Hwa Trading(supra).However, if this interpretation were to be adopted, then, even if the lease were to be in an approved form, it would still not be in breach of the 1990 Planning Act so long as the authority has not certified that the requirements relating to sub-division have been complied with.In other words, the very failure to obtain the certificate of subdivision would itself save the lessor from being in breach of the 1990 Planning Act.I was of the view that this would not be correct and that the correct interpretation of s 2(2) of the 1990 Planning Act is that it applies to instruments in an approved form.Therefore if a lease were to be in a form that is approved and were to be executed, but there is no certificate of subdivision, the lessor would be in breach of s 10(3) read with s 2(2) of the 1990 Planning Act but not otherwise.I should mention that under s 51(2) of the 1994 LTA, the Registrar of Titles may still register an instrument even if it is not in an approved form.Sections 51(1) and (2) of the current Land Titles Act state:(1) The forms from time to time approved by the Registrar shall be used for all instruments intended to affect registered land.(2) The Registrar may register any instrument containing departures from an approved form and the instrument shall be deemed to be in a form approved by the Registrar.However, I was of the view that s 2(2) of the 1990 Planning Act was not intended to and did not extend to all instruments whatsoever but only to those in the approved form.In other words, an instrument which is not in an approved form is not one that is `capable of` being included in a separate folio unless and until the Registrar exercises his discretion under s 51(2) to register it but not before.On the other hand, an instrument in an approved form is `capable of` being included in a separate folio but must still comply with the requirements for subdivision before the Registrar will register it.As the lease was not in the approved form, there was no breach of s 10(3) of the 1990 Planning Act read with s 2(2).If my interpretation as stated in [para ]117 and 118 above was not correct, I would then have adopted the interpretation in [para ]114 above. In that event, there would still be no breach of the relevant provisions of the 1990 Planning Act.For completeness, I would add that:(1) the agreement also does not breach these provisions, and(2) even if the lease were to constitute a subdivision of land and were to be in breach of the relevant provisions of the 1990 Planning Act, it does not necessarily follow that that would render the lease void and unenforceable.However, it was and is not necessary for me to delve into the effect of a breach of the relevant provisions as I have concluded that there was no breach.In the circumstances, I also concluded that Marina Centre did not embark on a scheme to deceive public administration.Outcome:Claim dismissed.Copyright  Government of Singapore."
    }
}