{
    "case_title": "Gerhard Hendrik Gispen & ors v Ling Lee Soon Alex & anor",
    "ncitation": "[2001] SGHC 350",
    "coram": "Lee Seiu Kin JC",
    "sections": {
        "The Defendants": "8 Alex Ling and Philip Ling are brothers. Their father, Tan Sri Ling Beng Siew is\n\na prominent Malaysian tycoon based in Sarawak. The Ling family controlled extensive timber interests\n\nin Malaysia, Indonesia and Papua New Guinea. It also controlled Hock Hua Bank Bhd, a Malaysian bank.\n\nAt the material time Tan Sri Ling was its chairman and Alex Ling was a director with Philip Ling his\n\nalternate. In addition, the Ling family controlled a subsidiary bank, Hock Hua Bank (Sabah) Bhd, as\n\nwell as a finance company. The Ling family also controlled companies mining gold in Malaysia and\n\nPapua New Guinea and coal in Sarawak. They also have interests in stone and sand quarries,\n\nengineering industries and property. The Ling family managed these interests through a variety of\n\ncompanies and the choice of vehicle depended on the partners they venture with in respect of any\n\ngiven project, and presumably on tax and other advantages offered in each case.9 Alex Ling was involved only in the timber, banking and mining businesses. He\n\nholds a law degree from the University of Cambridge and for several months after graduation,\n\nchambered in the firm of M/s Rodyk & Davidson in Singapore. He joined the family business after\n\nthat and never went into legal practice. He has been involved in the timber business for more than\n\n20 years. Alex Ling said that he was the deal maker in the family group. His primary role was to\n\nlocate or identify commercially feasible projects and concessions. He would meet with relevant\n\npersons or authorities and collate basic facts and figures from which he would decide whether to\n\nrecommend that the project be undertaken.10 Philip Ling did not give evidence at the trial and what little is known of him\n\ncame from Alex Ling. Philip Ling was the person in charge of operating the timber concessions  he\n\nwas the production man as opposed to Alex Ling the rain-maker.",
        "The Timber Industry": "11 The evidence on the nature of the tropical timber industry was generally not\n\ncontested and the following facts emerged from it. In any rainforest, there is a large variety of\n\nspecies of plants and trees. As far as a timber man is concerned he is interested only in the trees.\n\nNot all trees at that, but only those he can sell at a profit. Whether a tree is in the latter\n\ncategory depends on a number of factors, not least of which is whether there is a market for that\n\nspecies of tree. There are established species such as teak, ebony and rosewood, with which the\n\nmarket is familiar and for which there is a strong demand. But established species are not found in\n\nany concentration in a rainforest because of its bio-diversity. Therefore the timber industry is\n\nconstantly marketing non-established species in order to improve the profitability of any\n\nconcession.12 Marketable tree species are divided into 2 broad classifications, saw logs and\n\npeeler logs. Saw logs are intended for further processing at the sawmill after felling. The process\n\nof sawing the logs into planks result in large losses of between 55% and 75%. Therefore they are\n\nusually processed near the source at the home country before export in order to reduce transport\n\ncosts. Saw logs can be hard or soft woods. Because there is double handling and a time delay from\n\nfelling to shipping due to sawing and seasoning, kiln drying or other treatment required by the\n\nbuyer, the profitability of such logs is lower than that of peeler logs.13 Peeler logs are those used for the manufacture of plywood. They are so named\n\nbecause of the process in the plywood factories in which a thin layer is \"peeled\" off the\n\nlog in a circular fashion. Because of to this process, peeler logs need to be of sufficiently large\n\ndiameter, usually a minimum of 40 cm. They also need to be straight, of uniform diameter and without\n\ndeformities. Most importantly, they need to be soft woods to be peeled. They are therefore light and\n\ncan float on water - hence they are also called floaters. Peeler logs are easier to transport, as\n\nthey can be floated downstream. And they can be shipped very quickly after felling because no\n\nprocessing is needed. Due to a high demand from plywood factories, they also fetch a higher price in\n\nthe market compared to most saw logs. As a result production of peelers is very profitable compared\n\nto saw logs. The only problem with peelers is that they are more susceptible to fungus. Therefore\n\nthey cannot be left lying on the ground for long periods after felling and need to be shipped\n\nquickly. Peelers can also be sawed for planks but this will not maximise the profit and is only done\n\nas a last resort. Therefore, most saw logs are hard woods which are unsuitable as peeler logs.14 Peelers are the logs of choice of investors  they generate revenue in a\n\nshorter time than can be done with saw logs. Furthermore saw logs require higher investment in terms\n\nof the sawmills and manpower. However from the point of view of the country of the concession,\n\npeelers do not contribute as much to the economy as saw logs because the latter entails more\n\ndownstream processing, and hence jobs. Timber rich countries are therefore sensitive about the\n\napproach which the concessionaire intends to take in exploiting the timber resources.15 Another area of sensitivity is the green issue. In recent times, the\n\nenvironmental movement has highlighted the damage done to the environment by the indiscriminate\n\nfelling of trees. This has resulted in the destruction, in a matter of decades, of huge areas of\n\nrainforests that had taken millions of years to develop. The recognition that severe deforestation,\n\nand the consequential environmental disaster, can be caused by indiscriminate timber exploitation\n\nhas resulted in a movement, particularly strong in Europe and North America, to ban or boycott\n\ntropical timber that are not harvested in a manner which does not result in the destruction of the\n\nrainforest.",
        "Sale of DTL": "16 It is within this factual milieu that our story is set. In 1991 the government\n\nof Guyana privatized the publicly-owned timber company, Demerara Woods Limited. The company was sold\n\nto the British investor, Lord Beaverbrook. It was renamed Demerara Timbers Limited and was awarded\n\ntimber concessions on 554,000 Ha of forest. The purchase price was US$16.5 million, to be paid to\n\nthe government in instalments. Within a year Lord Beaverbrook sold DTL to UDG for a small amount of\n\ncash and a controlling interest in UDG. But UDG ran into financial difficulty, largely because its\n\ninvestments in real estate and other sectors outside Guyana were overextended. Its was taken over by\n\nthe Receivers in January 1993. In May 1993 UDG was put in liquidation.17 In April 1993, what was looming on the Receivers horizon was the next\n\ninstalment for the Concession payable by DTL to the Guyanese government on 28 June. The amount they\n\nhad to raise was US$4.2 million. The Receivers were in negotiation with CDC for the sale of DTL and\n\ntheir target was to do so by about 24 June so that the US$4.2 million payment could be made by CDC.\n\nAlthough there was the option for the principal creditor, Credit Lyonnais, to make this payment\n\nshould the deal not be closed by then, it was no doubt an unpalatable alternative from the banks\n\npoint of view. In any case, CDC had undertaken studies of the Concession and were poised to make a\n\ndecision soon  or so the Receivers thought.",
        "First Visit to Guyana: April/May 1993": "18 I now turn to the interposing events which led to the Defendants\n\ninvolvement in this matter. According to Alex Ling, he learnt in early 1993 that there were great\n\ninvestment opportunities in timber and gold mining in Surinam, Guyana and French Guiana. He decided\n\nto pursue these opportunities and contacted a Guyanese agent, Sparrock who undertook to show him\n\naround the region. Alex Ling flew to Guyana in late April 1993 with one of his forest surveyors,\n\nJohn Bin Jae. They spent 2 weeks in South America looking at investment opportunities in those 3\n\ncountries. In Guyana, Sparrock informed Alex Ling of a number of projects in gold mining and timber.\n\nThat was when Alex Ling heard about DTL. Sparrock told him that the Guyanese government had granted\n\nlarge timber concessions to DTL and another company, Barrama. Alex Ling also consulted a local\n\nsolicitor, Luckhoo, who briefed him on the political situation. Luckhoo advised that Guyana was\n\nundergoing dramatic political change under a new socialist government that had just overthrown the\n\nold regime. Alex Ling learnt from him that the legal system was based on the English system as\n\nGuyana was a former British colony.19 Luckhoo arranged for Alex Ling to meet the forestry commissioner, Black. Alex\n\nLing found Black to be helpful and friendly. Black told him about the potential for timber\n\ninvestment in Guyana. Black said that DTL was owned by a Dutch company that was in financial\n\ntrouble. DTL was due to pay a licence fee to the government to keep its concession and unless it\n\ncould find a business partner to inject funds into the company, the concession would be lost.20 Luckhoo also arranged for Alex Ling to meet the chief executive officer of\n\nDTL, Karsten Borch (\"Borch\"). They had 2 meetings at the Georgetown office of DTL, the\n\nfirst around 3 May and the second the following day. Alex Ling said that he met Borch at his hotel\n\non 2 occasions after that. They had a third meeting at the DTL office around 8 May after he returned\n\nfrom Surinam and French Guiana. Alex Ling said that during these meetings Borch provided him with\n\ninformation about DTL and he in turn briefed Borch on the activities of the companies controlled by\n\nhis family. Alex Ling and Borch do not agree on the amount of information that they exchanged in\n\nthose meetings. However this is not so important as they agree on the totality of the information\n\nthat was eventually given on subsequent occasions.21 Before Alex Ling left Guyana, Borch told him that he should follow up by going\n\nto meet the Receivers to negotiate the sale and purchase of DTL. Alex Ling said that he would need\n\nto consult Philip Ling who would be the person to make the decision. Borch suggested that they meet\n\nagain in London to discuss the matter further.",
        "Meetings in London: May 1993": "22 Alex Ling returned to Sarawak and discussed the matter with Philip Ling and\n\ntheir father. Based on the information he obtained in Guyana he was optimistic about the investment.\n\nThey agreed to pursue the matter and decided that Alex Ling and Philip Ling should go to London to\n\nmeet Borch and also Colin Barber (\"Barber\"), the finance director of DTL.23 The Defendants arrived in London around 18 May 1993. Borch met them at their\n\nhotel that day. Their discussion ranged from technical to cost issues. Borch told them that the\n\nReceivers were at that moment negotiating with CDC. However a payment of US$4.2 million was due to\n\nbe paid to the Guyanese government on 28 June 1993 in order for DTL to continue with the Concession.\n\nBorch said that as UDG, the ultimate owners of DTL, were not in a financial position to pay that\n\nsum, the Receivers were anxious to secure some arrangement whereby a buyer or prospective buyer\n\nwould come up with the money to maintain the Concession. Borch got word that CDC wanted a few more\n\nmonths to decide on the investment, time that the Receivers did not have. Borch said that he had\n\nheard that another company, Primegroup, had expressed strong interest in acquiring DTL. Borch told\n\nthem that he did not like Primegroup because they were not \"green\", i.e. their harvesting\n\npolicy was not environmentally sound. He had heard that they had raped the forests in Papua New\n\nGuinea. Borch said that he preferred the Lings whom he had heard practised sustainable logging\n\nmethods. At the end of their discussion, Borch drafted for them the outline of a letter to the\n\nReceivers to register their interest in purchasing DTL. The Defendants subsequently composed a\n\nletter by fleshing out this outline and embellishing it with introductory remarks about their\n\nforestry group. This letter was sent on the letterhead of P.T. Pagai Forest Products Corporation Ltd\n\n(\"Pagai\"), an Indonesian company which was the principal timber company of the Lings. It\n\nwas signed by Alex Ling in his capacity as Executive Director of Pagai. The letter was dated 20 May\n\n1993 and sent to the Receivers on that day.24 On 19 May, Borch brought the Defendants to meet Barber, the finance director\n\nof DTL. Borch had told them that Barber favoured selling DTL to CDC and this meeting was to help\n\npromote the Defendants proposal to Barber. They briefed him on the activities of the Defendants\n\nfamilys timber interests. Thereafter, Alex Ling met with Borch socially and even visited Barber\n\nat his new country house.",
        "Second Visit to Guyana: June 1993": "25 The Receivers replied to the Pagai letter on 26 May 1993. They said that they\n\nwere not considering a divestment by UDG of its interests in DTL at that stage, but they noted their\n\nserious interest and would contact them if the circumstances changed. Alex Ling was puzzled and\n\ntelephoned Borch about this. Borch explained that the Receivers were obliged to negotiate\n\nexclusively with CDC and was constrained to reply in this manner. Borch also added that the\n\nReceivers were not confident that CDC would be able to make a decision in time for the 28 June\n\ndeadline. He suggested to Alex Ling to reply to the Receivers along the terms of a draft letter that\n\nhe prepared. Alex Ling did as Borch advised and sent a second letter to the Receivers on 28 May,\n\nalso on the Pagai letterhead and in his capacity as Executive Director. Then on 31 May, Borch faxed\n\nanother draft letter for Alex Ling to send to the Receivers. However Alex Ling felt that this dealt\n\nwith the same matters as the second letter and decided not to send a further letter.26 Within a week of the letter of 28 May to the Receivers, Borch telephoned Alex\n\nLing to say that CDC was on the verge of confirming that they would not be able to meet the 28 June\n\ndeadline. Borch said that Primegroup was already working towards submitting its proposals and that\n\nAlex Ling should do the same. He suggested that the Defendants visit DTLs operations at Mabura,\n\nGuyana to collect whatever information they needed. Alex Ling decided to travel again to Guyana to\n\nconduct a brief survey and verify the basic figures before consulting his family members on this\n\nproject. He returned to Guyana in the first week of June 1993 with John Bin Jae.27 Alex Ling first made a visit to a goldmine at Omai, another potential\n\ninvestment. He then went to meet Borch at DTLs Mabura camp. There Borch told him that CDC was\n\nabout to formally confirm to the Receivers that it was not able to meet the 28 June deadline and to\n\nrequest an extension of time. Borch said that the Receivers were now prepared to close a deal with\n\none of the other investors.28 At Mabura, Alex Ling was taken to look at the forest, or whatever was\n\naccessible by jeep and bucket loader. He was briefed by Borch and Leroy Welcome, the Production and\n\nOperation Manager, on the details of the Concession. Borch also took Alex Ling to look at computer\n\ndata of forest inventories that had been produced from detailed surveys on specific blocks within\n\nthe Concession. Borch suggested that Alex Ling should go to Rotterdam to see the Receivers\n\nimmediately as Primegroup was already negotiating with them in earnest.",
        "Negotiations in Rotterdam: June 1993": "29 Alex Ling returned to Singapore after that and had an internal discussion on\n\nthe matter. Then on 17 June Borch sent a fax to Alex Ling to give him an update of the situation\n\nregarding the negotiations. Borch advised Alex Ling to write a letter to the Receivers and to set\n\nout their proposals in a manner that would impress them and induce them to negotiate. Alex Ling\n\nfollowed Borchs suggestion and sent a letter to the Receivers on the same day to advise that he\n\nwould be able to meet them at Rotterdam on 22 June to present a proposal in respect of DTL. Alex\n\nLing flew to London on 19 June, followed by Philip Ling a short while later. The latter was\n\naccompanied by his solicitor, David Yeow (\"Yeow\").30 When Alex Ling arrived, he met Borch who handed him a document entitled\n\n\"Resume\". In this document, Borch gave a short history of DTL and the Concession. He then\n\nstated that CDC had written the previous week to state that they needed six to nine months before a\n\nfinal decision, but they could not guarantee that they would go through with the purchase. CDC also\n\nsaid that if they made the purchase, it would be for 100% at US$25 million to be paid between five\n\nand six years. Borch wrote that the Receivers had until then refused to see anyone but CDC in spite\n\nof interest expressed by at least six other parties. However they had suddenly agreed to see\n\nPrimegroup, which had indicated a very strong interest in buying. Primegroup had deposited\n\nUS$250,000 to be allowed to talk to the Receivers.31 Borch concluded by advising that in order to win over the Receivers, Alex Ling\n\nshould:\"- offer to lend money to receivers for six months to pay the Government\n\n  and to fund DTL;- offer to arrange an agreement with the Government;- offer to let the receivers keep 49% of equity to \"share in upside\"\n\n  but also to allow them to be able to sell the shares at any time to Pagai or nominee at an agreed\n\n  minimum price (Pagai to get the same option at higher price);- offer to pay large amount in cash, on utilising the option after six months\n\n  so the receivers can see money coming in quickly;- offer to let the receivers sell up to 25% of equity [to] CDC, even if Pagai\n\n  normally has first refusal on all shares.\"32 When Philip Ling and Yeow arrived in London they, together with Alex Ling, met\n\nBorch. Borch advised them of the negotiation strategy they should adopt. Alex Ling, Philip Ling and\n\nYeow then flew to Rotterdam on 21 June.33 The first meeting with the Receivers was on 22 June. The Defendants were\n\naccompanied by Yeow and their Dutch lawyer, Michiel Wesseling (\"Wesseling\"). On the other\n\nside were Gispen, Rootselaar and Barber. However after introductions, Rootselaar excused himself and\n\ndid not participate in the negotiations after that.34 Alex Ling and Gispen have very different versions of what transpired in this\n\nmeeting. Alex Ling said that he began the session by briefing Gispen on the structure of his family\n\nbusiness and their expertise in the timber business. He then said, and this is hotly disputed, that\n\nhe had met Borch in Guyana and with Philip Ling, met Barber and Borch in London. From those meetings\n\nthey had been provided with information and material about the DTL and the Concession. In particular\n\nhe said that Borch had represented to him that the Concession was capable of yielding at least 20\n\ncubic metres of timber per hectare. Alex Ling said he explained to Gispen that he was looking mainly\n\nto export peeler logs, with sawmilling logs as a secondary source of revenue. He said he explained\n\nthe tripartite corporate structure of his project in Pagai, Indonesia which involved a joint venture\n\nbetween the Indonesian company owning the forest concession and his family company. He said he told\n\nGispen that he was looking to set up a similar structure in respect of DTL and the Concession. As\n\nfor the financing, Alex Ling said that he told Gispen that he would procure this in the same manner\n\nas his other projects, which was through standby letters of credit secured by the trees to be sold.\n\nThis method would enable him to minimise his capital outlay for the project. He told Gispen that he\n\nwas aware that the yields in the Concession, estimated at 20 to 22 cubic metres per hectare, were\n\nmuch lower than what was found in the Pagai concession. However it would still be profitable\n\nprovided labour and other costs were as low as what he was led to believe and large volumes of\n\npeeler logs could be exported early to repay the financing quickly.35 Alex Ling said that at no time did Gispen say that Borch was not authorised to\n\nprovide him with such information. Gispen did not ask questions during the briefing and merely\n\nnodded his head approvingly. As for the information about forest yields, Alex Ling said that Gispen\n\ntold him that he was not a timber expert and he usually left such matters to Borch.36 According to Gispen, Alex Ling merely briefed him on the grand achievements of\n\nthe Ling family and how he had visited Guyana and spoken to the people in the Forestry Department\n\nthere. Gispen said that Alex Ling told him that he had flown over the Concession and had noted that\n\nthere was a lack of commercial species in the forest, although he was comfortable with the forestry\n\nconditions. Gispen emphasised that Alex Ling made no mention of meetings with Borch or of documents\n\nreceived from him. This is what he said in 19 of his affidavit evidence-in-chief:19. At no time during this meeting did the Defendants make any mention of any\n\n  meetings that they had had with Mr Borch, or of any documents that they had received from him.\n\n  Neither did they mention that any party other than themselves was or would be involved. We assumed\n\n  that the Defendants had assessed the value of the Concession, especially since they had\n\n  represented that they had substantial experience and expertise in the field.37 There was a bit of a stand-off during this meeting when Gispen asked the\n\nDefendants to execute a negotiation agreement which would entail payment of a commitment fee of\n\nUS$250,000. The Defendants felt insulted about this as they had gone there in earnest to make a\n\nserious proposal. Gispen relented and dispensed with the negotiation agreement. The discussions\n\nspilled over to 23 June. But at the end of that day, the parties reached agreement and adjourned to\n\nenable the Defendants lawyers to prepare the written agreement. Gispen said that at this stage,\n\nhe was informed that the Defendants would be using an \"offshore company\" to enter into the\n\npurchase agreement. This is what he said at 27 of his affidavit:27. At the end of the negotiations after agreement had been reached between the\n\n  Defendants and us on all material issues, the Defendants, without any consultation, designated an\n\n  offshore company, Concorde Investments Limited (\"Concorde\") as the company that would\n\n  enter into the share purchase agreement on their behalf. Mr Wesseling made clear that his clients\n\n  wished for their purposes, that were not explained, to use one of their offshore companies to, in\n\n  their stead and on their behalf, execute the agreement. I was told by Mr Wesseling that this was\n\n  the normal way that his clients structured their group of companies. In my recollection, the name\n\n  of Concorde was only made known to me in the first draft of the Share Purchase Agreement the next\n\n  day.38 The following day, 24 June 1993, at around noon the Agreement was signed. It\n\nwas expressed to be an agreement between the purchaser, Concorde, and the vendors, Gispen and\n\nRootselaar as receivers of UDG. Philip Ling signed on behalf of Concorde. The following are the\n\nsalient terms of the Agreement:(i) Concorde or its nominee would give an interest-free loan to the vendors of\n\n  US$4.2 million to meet DTLs payment obligation to the Guyanese government falling due on 28\n\n  June;(ii) Concorde was to pay a total of US$32.5 million to the vendors in\n\n  instalments, the first one being US$10 million and due on 24 December 1993, and 3 further\n\n  instalments of US$7.5 million each being due 6-monthly thereafter;(iii) the vendors warranted that the liabilities of DTL and Demerara Holdings,\n\n  apart from the said US$4.2 million, did not exceed US$1 million;(iv) Concorde was entitled to rescind the Agreement by written notice to the\n\n  vendors if, on or prior to 24 December 1993, it discovered that any guarantee, undertaking,\n\n  representation or warranty under the Agreement was or would not be met on that date. Upon\n\n  rescission, the US$4.2 million loan was immediately repayable by the vendors;(v) from the date of Agreement, Concorde was to have conduct and management of\n\n  DTL.",
        "Operating the Concession: July  December 1993": "39 Pursuant to the Agreement, the Defendants procured the payment by one of their\n\ncompanies, Southseas Timber Pte Ltd (\"Southseas\") of US$4.2 million to the Receivers for\n\npayment to the Guyanese government. This was in fact made on the very day the Agreement was\n\nexecuted. Alex Ling had given evidence on how the financial aspect of the project would be\n\nstructured, which was similar to that of their project in Pagai, Indonesia. He described this as a\n\ntripartite arrangement. One company would hold the right to the forest concession. A second\n\nmarketing company would provide funds for the project and it would also sell the timber to buyers. A\n\nthird company would procure the manpower and machines to work on the project.40 As provided in the Agreement, Concorde took over control of DTL from UDG.\n\nPhilip Ling was assigned to the task. Borch was retained as the CEO but he was to take instructions\n\nfrom Philip Ling. In July 1993 Philip Ling went to Guyana to assess the situation. Money and\n\nequipment poured in to improve the infrastructure and logging capacity. According to Alex Ling, by\n\nSeptember about US$10 million (inclusive of the US$4.2 million paid to the Receivers) had been\n\ninvested. He also said that facilities totalling US$9 million had been obtained by Southseas from\n\nthe Hong Kong & Shanghai Banking Corporation (\"HSBC\"). Alex Ling said, at 407 of his\n\naffidavit:By October 1993, the infrastructure and equipment level within the Concession\n\n  had been significantly upgraded and DTL was for the first time properly operational and equipped\n\n  to carry out logging on the scale needed to generate log volumes of peelers for export.41 However Alex Ling said that they began to realise that the Concession would\n\nnot be able to yield the volume of logs that they had anticipated. The Defendants had sent\n\nexperienced staff from their Indonesian operations to Guyana and they reported that the yield was\n\nwell below the anticipated 20 cubic metres per hectare. The Defendants began considering\n\n\"pulling out\" of the Agreement. Alex Ling said he called Borch to complain about the poor\n\nyield encountered. He asked Borch to\"put his honest thoughts on paper since he was the one\n\nwho had furnished the grossly inaccurate information\".Borchs response was faxed to Alex\n\nLing on 23 December 1993. It reads as follows:Dear AlexYou asked me to put my thoughts on paper. I am pleased to be asked because I\n\n  have felt for some time I could contribute.First the business:The forest probably has 70% sawlogs and 30% peeler logs. The two new\n\n  concessions are quite similar, though Ivan Harris reports from the western concession the trees\n\n  are generally larger. I believe therefore a special effort should be made to build up the\n\n  mill-capacity. We have inquiries for up to 2000 m3 a month, which is nearly twice present\n\n  capacity. We must not forget that from 1995 the major part of Europe closes down import of\n\n  tropical timber if it does not have independent certification. D.T.L will be one of very few\n\n  producers able to supply this and should be able to push prices up. As regards peeler logs our\n\n  real capacity is probably 4-5000 m3 a month. Initially we should probably sell to Barama and then\n\n  to Brasil, Venezuela or Mexico to keep the shipping cost down. I believe over 1994 it will be\n\n  possible to build the business to a monthly turnover of about 1 million dollars U.S. and to get\n\n  costs stabilised between 500.000 and 600.000 U.S. dollars. As prices increase in 95 the turnover\n\n  will improve.Then the contract with the DutchAs I have not been involved in the negotiation I may be completely wrong.\n\n  Please read my proposal with that in mind. I believe the single most important point is to propose\n\n  a model. This should be based on the fact that there are more problems than expected and that the\n\n  cash flow is and will remain strained. The Dutch could probably live with half of the original sum\n\n  to be paid now. I also believe it possible to their refinance this payment through a loan from\n\n  Credit Lyonnais. If for instance you paid 5 million dollars U.S. and borrowed 10 million dollars\n\n  U.S. you would cover the payment to the Bank/Receiver, be able to fund the next 6 months operation\n\n  and still have most of the money for the June payment for the Government. If you at the same time\n\n  proposed that the outstanding money under the agreement plus the new loan of 10 million U.S.\n\n  dollars were repaid over 5-6 years from 1995 I believe the business could do that.Finally - the long-term futureAs soon as the business has shown a full year of profitable operation, say by\n\n  the end of 1995, it will be possible to sell part of the business - either locally through placing\n\n  DTL-shares that's on the coming Guyanese stock market - or by selling shares in Concorde\n\n  internationally. If we made for instance 6 million dollars U.S. net and based on a ratio of 8\n\n  times earnings the business would be valued at 48 million U.S. dollars. But there have also\n\n  constantly been interested parties asking whether they could buy into DTL and other options are\n\n  available. The Guyanese stock market option has the strength that it would be very much in line\n\n  with the thinking of the present Government in Guyana: let Guyanese have a chance to invest in and\n\n  own their natural resources.ConclusionI would be very sad to see a situation of default developing because it often\n\n  becomes unmanageable - also I think highly of you and would like to see you stay with the\n\n  business. These are my thoughts at midnight.KB23.12.90",
        "Warranty on liabilities of DTL and Demerara Holdings": "42 The Receivers warranted in clause 5.1(g) of the Agreement that apart from the\n\nUS$4.2 million owed to the Guyanese government, the other debts of DTL and Demerara Holdings did not\n\nexceed US$1 million. That clause states as follows:The Vendors Representatives  represent and warrant that as at the date of\n\n  this Agreement and as at the Transfer Date  to the best of the Vendors Representatives\n\n  belief and knowledge, except for [the US$4.2 million] and except for an aggregate amount not\n\n  exceeding [US$1 million] due to the creditors of DTL, at the date of this Agreement no amounts are\n\n  due and no liabilities including contingent liabilities are owed by or outstanding from [Demerara\n\n  Holdings] and/or DTL.43 Alex Ling said that after the Agreement was signed, Philip Ling had been\n\nreminding Barber to furnish them with the full accounts of the liabilities of DTL and Demerara\n\nHoldings. But Barber had not done so up to December 1993. Alex Ling said that he eventually\n\ndiscovered that at the date of the Agreement those liabilities in fact exceeded US$2 million. This\n\nis denied by Gispen. However this fact does not seem to figure in the Defendants decision to\n\nrescind the Agreement on 24 December 1993. It would appear that it was raised as an additional\n\nfactor in support of that action after the fact. I find that this allegation has no relevance to the\n\nmatters I have to decide.",
        "Contract is Terminated": "44 According to Alex Ling, on 24 December 1993 Yeow, on behalf of Concorde,\n\norally notified Gispen of Concordes intention to \"withdraw\" from the Agreement. No\n\ndetails were given of this, but in my view nothing turns on it. This is because in the event,\n\nConcorde failed to make payment of the first instalment of US$10 million by 24 December 1993 or at\n\nany time thereafter. Accordingly Gispen wrote to Concorde on 27 December to give notice of default\n\nof the first instalment. And in that letter, Gispen made reference to meetings with Wesseling in\n\nrelation to interim financial measures and mitigation of damages. It would appear that Gispen had\n\naccepted the breach at that stage. Although the parties continued to negotiate for a short while\n\nafterwards to try to salvage the situation, nothing came out of it. As I have described earlier,\n\nGispen and Concorde referred their claims and counterclaims to arbitration and the Award was made in\n\nGispens favour in October 1996. That led to enforcement action against Concorde in the Isle of\n\nMan resulting in Concorde being put into liquidation, and in the Plaintiffs commencing this action\n\nin May 1999.",
        "Karsten Borch": "45 I turn to say a few words about Borch. He is a most interesting and capable\n\ngentleman. He was not a timber man; in fact until his involvement in DTL, he had no experience in\n\nthat field. He is a Dane whose career had been in shipping. Sometime in 1990, having retired from\n\nthe Maersk Group, he was asked by a friend to help write down a Dutch shipping company in trouble.\n\nThis company was one of the divisions of UDG. It was in performing this role of winding down the\n\nshipping company that Borch was appointed a director of UDG. He was then asked to evaluate the\n\npossibility of shipping timber out of Guyana. So he went there and in the course of the\n\ninvestigation met up with Dutch forestry scientists who strengthened his conviction in the green\n\ncause. Borch became fascinated by the idea of sustainable harvesting. In the course of his evidence\n\nhe gave an insight into the depth of his feelings in this area. The following answer he gave in\n\ncross-examination is illuminative:in the first place, sir, when I went to Guyana I probably was of the\n\n  conviction that we should look after our environment ourselves, so I had a green interest, as a\n\n  base.  [until going] to Guyana I had never been into a rainforest and, having done my shipping\n\n  study, I took the occasion to go into the rainforest. It was here I met with the Dutch scientists\n\n  who conducted studies of the forest. These Dutch scientists said to me, \"It is possible to\n\n  save the rainforest by harvesting it with due care.\" They were the ones who told me about the\n\n  work in Indonesia and Surinam, where they had developed something called the CELOS system.\n\n  Basically, if you want to understand sustainability, these scientists said to me, \"You have\n\n  to measure how much is the growth every year in the hectare of forest. Once you have established\n\n  that, you can then decide: how much can I take out without damaging the forest?\" Let me give\n\n  you an example: if the growth is one cubic metre per year, the scientists then say you can then\n\n  harvest 20 or 30 cubic metres under certain conditions, but then you cannot return for 20 or 30\n\n  years before the forest has regrown to the volume it had before. These scientists said to me --\n\n  and it was later on confirmed  \"There is a massive amount of timber in these forests in\n\n  Guyana. There is between 300 and 400 cubic metre of timber in every hectare, but you have to\n\n  harvest them carefully so as not to damage the forest, and you have to find ways of selling that\n\n  timber so that you do not harvest without having a buyer for the timber.\" These principles\n\n  interested me. I went back. I went to the University of Utrecht and other places in Europe and\n\n  talked to specialists. On the basis of that, I had the idea that European consumers would not go\n\n  on buying timber without certification. The green movement was very strong at the time, stronger\n\n  than it is today. I think that my proposal was right. Because if you, sir, go [to any] major\n\n  seller of wood in Europe today, they do not stock any wood that does not have a certificate. This\n\n  was the idea: if we have a certificate, it will be easier to sell all these many species in\n\n  Guyana. What you have to bear in mind is where you live you have a very homogenous forest with a\n\n  relatively few species, maybe a hundred species. In Guyana, there are a thousand. So the two\n\n  things are totally different and that is why we have to do something special to sell the forests\n\n  of Guyana.46 Borch explained during cross-examination how he made the switch from shipping\n\nto forestry:Later on, having met the Dutch scientists, I went back to UDG's top management\n\n  and said to them, \"Look, if you really want this to become a success, I think you have to\n\n  attack this from an environmental angle, because everybody is raping the forest and here it could\n\n  be done differently.\" I was then invited by UDG's top management to write a proposal which\n\n  really was my green charter. That means that from  early to mid-June  1991 -- I moved over\n\n  and became involved in this project.47 Borch eventually put up his green charter to UDG who approved it. This is a\n\ndocument which sets out the principles which DTL would follow in harvesting the Concession. It\n\nstates as follows:1. Each year DTL will harvest an area of approximately 12,000 hectares at an\n\n  average rate of 20m3 per hectare. This will give an annual yield of approximately 240,000 m3. The\n\n  12,000 hectares harvested will then be left for 20 years before further harvesting takes place.\n\n  This extraction rate is the lowest figure proposed by expert forestry advisors. They base their\n\n  proposal on scientific research which has shown that natural growth in an untouched forest is\n\n  about 1m3 per hectare per year. The research also shows that if careful harvesting is carried out,\n\n  this increases growth because the forest is opened up.2. DTL will fund independent scientific research to confirm that these findings\n\n  also apply in its forest area.3. When DTL plans the harvesting, it will ensure that trees are never harvested\n\n  in such a way that large openings occur in the canopy.4. DTL will plan harvesting to ensure minimum land use for roads.5. When roads are needed, DTL will ensure they are aligned to the natural\n\n  contours of the terrain to avoid soil erosion.6. DTL recognises that it will not be alone in its forests. DTL will\n\n  specifically propose to the Government of Guyana:- that large scale farming will be banned for the life of DTL's forest lease;- that hunting be reduced to a minimum;- that any mineral licences granted should be accompanied by strict\n\n  environmental controls.7. DTL will, over the life of its lease, make a special effort to develop and\n\n  promote other species than those which are presently considered commercial. The aim will be to\n\n  reduce the harvesting of the most popular species as new species become accepted in the market\n\n  place. DTL's marketing programme will cover 18 species from the outset.8. DTL will aim to increase its product range to reduce waste.9. DTL will work towards a waste management programme to ensure that waste is\n\n  being converted into charcoal, briquettes or energy.10. DTL will seek to establish in Guyana traditional downstream activities such\n\n  as furniture production, so that more value is added to Guyana's forest products, more jobs are\n\n  created and DTL's earnings are enhanced while the company makes its optimum contribution to the\n\n  nation's economy.48 Borch gave evidence by video-link from London. Despite the limitations of this\n\nmeans of communication, Borchs personality came through clearly enough. He spoke fluently and, I\n\nshould add, with passion. It was clear that he was a resourceful person with a forceful personality.\n\nAs I have said at the outset, there is some dispute as to when Borch gave documents concerning the\n\nConcession to Alex Ling, but the timing is not important. They more or less agree as to the totality\n\nof the documents given. The areas of dispute are whether Borch represented to Alex Ling:(i) that the Concession was capable of yielding 20 cubic meters of timber per\n\n  hectare; and(ii) as to the yield of peeler logs.49 Alex Ling had given evidence that Borch had represented to him that the\n\nConcession could yield 20 to 22 cubic metres per hectare, of which about 15 cubic metres would be\n\npeeler logs. On this basis he had done his calculations and concluded that by concentrating on\n\npeeler logs at the initial stage, he would be able to secure the cash flow early in the project to\n\nmake it viable at the price that he was paying for it. Alex Ling described how he had lined up red\n\nclause letters of credit which were secured on the peeler logs that he would be shipping. Under this\n\narrangement the amount of cash that he required up front for the project would be minimised and the\n\nprofitability of the venture would be much enhanced.50 In his affidavit, Borch agreed that in some of the documents he had given to\n\nAlex Ling, which were studies conducted by forestry consultant, it was suggested that the yield\n\ncould exceed 20 cubic metres per hectare. Yet Borch emphasised that he told Alex Ling that 20 cubic\n\nmetres per hectare was the maximum figure beyond which it was not possible to go. He said this at\n\n8 (1.)(iii) of his affidavit:From its context, i.e. in a \"Green Charter\" the purpose of which was\n\n  to show that commercial timber production by DTL in the Forestry Concession would be consistent\n\n  with environmental conservation and protection, the figures given were figures for the maximum\n\n  rate of harvesting above which DTL undertook not to go (as indeed I told the 1st Defendant) and\n\n  did not indicate how easily or over what period of time it would be possible (if at all) in fact\n\n  to harvest at the rate indicated.He re-emphasised this in cross-examination, saying as follows:Q.  you harvest according to the growth rate?A. Well, I think if you want to be very precise, you set a top limit. You say \"I can never\n\n  ...\" -- that is why I called it a charter. It links you to something you will promise to do.\n\n  I will never, in this forest, go above 20 cubic metre per hectare when we reach tiller.Q. And that limit is, in a large way, dependent on the growth rate of that forest?A. The way you set your limit is by trying to establish, \"How much can I take out of the\n\n  forest?\" The scientists saying, \"Only take what is the natural growth, so do not go\n\n  in\" -- and this is a very, very long story, but let us try to keep to the key points of it --\n\n  \"Do not go in and cut out sea trees. Do not go in and harvest along river bases. Do not go\n\n  into ecologically fragile areas. Do not go into areas where there are special animals.\" You\n\n  have a million different elements that come into it, but the overriding one is that with the\n\n  scientific evidence we had, the 20 m3 would be the very maximum we could ever take out of that\n\n  forest, which was what we then put into our forest management plan which was then subsequently\n\n  approved by the forestry Minister of Guyana. That is, therefore, an agreement that you cannot\n\n  breach; it becomes part of your concession.Q. I am sorry to be repeating, Mr Borch, but I think that your answer does not quite address my\n\n  question directly. All I wanted to establish was that this target that you have set is, in a way,\n\n  dependent on the growth rate of the forest.A. No. I would hate to disagree with you -- you are a learned lawyer -- what I am saying is\n\n  that this is not a target. You used the word \"target.\"Q. See --A. Let us just be very precise. It is a maximum allowable cut. That is the correct word; the\n\n  \"maximum allowable cut\" at any time in this forest. And you have to be absolutely clear\n\n  that when you define the maximum allowable cut, you first exclude a number of areas in which you\n\n  cannot harvest. So it is not quite as simple as saying \"that is my target\"; it is the\n\n  maximum allowable cut based on the scientific analysis which we were given51 Yet despite the unequivocal nature of his assertion, the crucial 1 of the\n\nGreen Charter is equally unequivocal. It speaks of an\"average rate\"of 20 cubic\n\nmetres per hectare. It states that this extraction rate is the\"lowest figure\"proposed by expert forestry advisors. It also says that this is based on research which shows the\n\nnatural growth of an untouched forest is about 1 cubic metre per year and if careful harvesting is\n\ncarried out, this growth is increased because the forest is opened up.52 Further, Alex Ling had given evidence that in his first meeting with Borch,\n\nwhich was in Guyana on 3 May 1993, Borch had told him that the yield was 20 to 22 cubic metres per\n\nhectare. Alex Ling exhibited a note written by Borch at that meeting in which, among other things,\n\nthe following appears:1 m3= per HA per year20 m3=\n\n  HA            8 trees   \n\n  20-22 m3Borch explained in cross-examination that this was written while he was\n\nexplaining to Alex Ling that the Green Charter provided for a maximum of 20 cubic metres per\n\nhectare. He said that the reference to \"1 m3\" was written after he had\n\nexplained to Alex Ling that:there are scientists who say 1 cubic metre, scientists who says 2 cubic metres, scientists\n\n  who say 1.5 cubic metres. So I write 1.5 cubic metres.53 I find Borchs explanations in respect of whether he had told Alex Ling that\n\n20 cubic metres per hectare was the maximum to be rather contorted. However it is not necessary for\n\nme to make a finding as to whether Borch did unequivocally represent to Alex Ling that the yield was\n\n20 cubic metres per hectare and that of these, 15 cubic metres would be peeler logs. What is\n\nrelevant is whether Alex Ling, as a consequence of those sessions with Borch and from the documents\n\nprovided by him, formed the impression that such yields could be achieved. I have no doubt that Alex\n\nLing did form that impression. I arrive at this conclusion from an overall evaluation of the\n\nevidence at hand. This included the demeanour of the witnesses, the contemporaneous documents and\n\nthe circumstances of the case. In respect of the last factor, I have taken into consideration the\n\nfact that the Lings were facing a multi-million dollar investment. US$4.2 million was immediately\n\npayable in late June 1993. Another US$10 million in December. Between those dates, they would have\n\nto pour in millions more in terms of machinery, equipment and manpower, which they did. Alex Ling\n\nand Philip Ling are experienced people in the timber business. I do not think that they would commit\n\nsuch money without doing the sums. And the figures in question, 20 and 15 cubic metres per hectare\n\nare fundamental to the sums that the Lings had to work out. Alex Ling said that he formed this\n\nimpression. It is not so relevant for the decision I have to make in this case whether it was\n\nreasonable for him to have done so. But if I have to make that finding, I would find that it was.\n\nThe evidence shows Borch to possess a very charming and forceful personality. He had told Alex Ling\n\nthat he preferred the Lings over Primegroup. And indeed even before CDC was ruled out by the\n\nReceivers, Borch was already actively promoting the Lings by giving them inside information of the\n\nongoing negotiations with other parties. In my view, an additional factor was that Alex Ling was\n\nrather caught up with this attention from Borch. He probably thought that because he had inside\n\nsupport, he was latching on to a very good deal.54 Be that as it may, in my view what is important is whether Alex Ling believed\n\nthat those were the yields that could be achieved. Alex Ling struck me as a hard-headed businessman\n\nwho has experience in the timber industry as well as other sectors. I cannot imagine him going into\n\na project of this immensity, and committing such large sums of money, without being convinced of the\n\naccuracy of his assumptions. I therefore hold that Alex Ling did form the impression that those\n\nfigures were accurate and based his evaluation of the project on them.FINDINGS OF FACT55 The Plaintiffs submit that Concorde did not, could not and was never intended\n\nto conduct the business of purchasing and operating the Concession and that it was a\n\n\"faade\" or \"sham\" for the following reasons:(i) The Defendants had contended that Concorde was 60% owned by one Arifin\n\n  Kusuma. The Plaintiffs say that this was a sham and that the Defendants owned 100% of the\n\n  business. The Defendants alone were in personal, constant and complete control over all aspects of\n\n  the purchase of the Concession and conduct of the business.(ii) From the outset, the Defendants intended to operate the business in their\n\n  own personal interests alone, entirely without regard for Concorde (or South Seas or Polynesia)\n\n  and that was how the business was operated.(iii) The directors of Concorde had no prior knowledge whatsoever of the\n\n  purchase of the Concession in Concordes name. Even after the purchase of the Concession, the\n\n  directors had no knowledge of what was purchased or the terms of the purchase. At no time did the\n\n  directors of Concorde contribute to or have any knowledge of any aspect of the operation of the\n\n  business.(iv) Concorde had no financial means to purchase the Concession or conduct the\n\n  business. The Defendants did not provide Concorde with the means to do so and never intended to\n\n  provide Concorde with the means to do so. From the outset the Defendants knew and intended that\n\n  they would provide (and would have to provide) the financial means to purchase and operate the\n\n  Concession.(v) There was no \"tripartite agreement\" or marketing agreement. Such\n\n  financing/equipment as was provided by South Seas and Polynesia for the conduct of the business\n\n  was procured by the Defendants entirely at their discretion.(vi) There was no commercial basis either for the provision of\n\n  finance/equipment by South Seas/Polynesia to Concorde or the receipt thereof by Concorde from\n\n  South Seas/Polynesia. Whatever such finance/equipment was provided/received was not authorised by\n\n  Concorde, South Seas or Polynesia.(vii) The Defendants had no financing plan, as they claim, based on the export\n\n  of peeler logs. The Defendants would have known that such a plan would not be viable at all.56 On the evidence before me I find the following:(a) In respect of point (i), the Plaintiffs have failed to prove that Arifin\n\n  Kusuma was a sham. Alex Ling had explained that Kusuma, an Indonesian Chinese, had helped the Ling\n\n  family in projects in Indonesia. Alex Ling had said that he and Philip Ling agreed to give Kusuma\n\n  60% of the shares of Concorde in gratitude towards the past favours. Kusuma himself had given\n\n  evidence. He said in effect that he was the person who opened the doors for the Lings in Indonesia\n\n  in return for a share of the profits. I was impressed by his demeanour; he was not prone to\n\n  exaggeration and readily admitted that he did not know the details in relation to Concorde, which\n\n  is consistent with his position. I conclude that the Defendants had in mind to give Kusuma those\n\n  shares. Given the tripartite arrangement they had, it was not a large portion of the anticipated\n\n  profit that Kusuma would be getting as much of it would be channelled to the other two companies.\n\n  So it was not an incredible proposition as the Plaintiffs have submitted.(b) I deal with points (ii) to (vii) collectively. I am satisfied, on the\n\n  evidence given by Alex Ling, that his group was able to provide the financing and that the\n\n  tripartite arrangement wasbona fide. I see no benefit in Alex Ling going into this project\n\n  without ensuring he was able to see it through on the basis of the assumptions he had made. This\n\n  was not a case where he was trying to persuade Gispen to hand him a benefit that he could run away\n\n  with leaving Gispen high and dry. He was trying to persuade Gispen to give him the privilege of\n\n  coughing up US$4.2 million immediately, after which he would have to follow up with several\n\n  millions more before any returns would be forthcoming. From such an angle, it is not difficult to\n\n  see why the Defendants had to bebona fide. The Plaintiffs submit that the manner in which\n\n  the Defendants handled the accounting and formalities of the various companies involved in the\n\n  financing for the project shows that the tripartite arrangement did not exist. But that view is\n\n  from the vantage point of the present day and with all the benefit of hindsight. It does not take\n\n  into account the realities at the time and does not see it from the viewpoint of the protagonist.\n\n  The problem might lie in that fact that lawyers are trained to see the legal aspect of things and\n\n  they therefore take a dim view of any non-compliance with legal requirements. Similarly\n\n  accountants are trained to count every cent and to put it in the right place. They will throw up\n\n  their arms in horror at any misplaced number. But an entrepreneur would normally ride roughshod\n\n  over such niceties. Indeed if he were to dissipate his energies on these matters, he would\n\n  probably not be able to generate the economic activities to keep his lawyers and accountants busy.\n\n  A successful entrepreneur usually takes a \"can-do\" attitude and leaves the ensuing mess\n\n  in the documentation to be cleared up by his lawyers and accountants. This was exactly the\n\n  evidence that Alex Ling gave. He said that this tripartite arrangement was very much in his mind\n\n  and it was based on a successful formula in their Pagai project. But the accounting would be\n\n  settled later. I find that his evidence in this respect fully accords with common sense and\n\n  reality.THE PLAINTIFFS CLAIMS57 The Plaintiffs claims against the Defendants may be classed under the\n\nfollowing alternative heads:(i)agency, in that Concorde was the agent of the Defendants with\n\n  respect to the Agreement (\"agency claim\");(ii) misrepresentation, fraudulent or negligent (\"misrepresentation\n\n  claim\");(iii) collateral contract or warranty (\"warranty claim\"); and(iv) the Defendants having used Concorde as a mere faade or extension of\n\n  themselves, the corporate veil should be lifted (\"corporate veil claim\").AGENCY CLAIM58 The Plaintiffs claim that Concorde was the agent of the Defendants. The only\n\nevidence given on behalf of Plaintiffs in this regard is 27 of Gispens affidavit\n\nevidence-in-chief in which he said as follows:At the end of the negotiations after agreement had been reached between the\n\n  Defendants and us on all material issues, the Defendants, without any consultation, designated an\n\n  offshore company, Concorde Investments Limited (\"Concorde\") as the company that would\n\n  enter into the share purchase agreement on their behalf. Mr Wesseling made clear that his clients\n\n  wished for their purposes, that were not explained, to use one of their offshore companies to, in\n\n  their stead and on their behalf, execute the agreement. I was told by Mr Wesseling that this was\n\n  the normal way that his clients structured their group of companies. In my recollection, the name\n\n  of Concorde was only made known to me in the first draft of the Share Purchase Agreement the next\n\n  day.59 Gispen had said that Wesseling had informed him that the Defendants wished to\n\nuse Concorde to enter into the Agreement\"in their stead and on their behalf\".\n\nHowever there is no mention in the Agreement that Concorde had entered into it as agent. Mr Rajah\n\ndid not make any submission as to any other manner in which Concorde would become the agent of the\n\nDefendants in relation to the Agreement. Accordingly there is no merit in the Plaintiffs claim in\n\nthis respect.MISREPRESENTATION CLAIM60 The Plaintiffs pleaded in paragraph 10 of the Statement of Claim that the\n\nfollowing representations were made by the Defendants:(a) that Concorde had the means to and would meet and perform all the\n\n  purchasers obligations under the Agreement (\"the first Representation\");(b) that the Defendants group had the necessary experience and expertise to\n\n  develop and market the numerous species of timber in Guyana (\"the second\n\n  Representation\"); and(c) that the Defendants group was able to and would meet the requirement for\n\n  expenditure of between US$15 million to US$17 million to meet payments due to the Government of\n\n  Guyana in respect of the Concession and for upgrading and additional investments in logging and\n\n  sawmilling equipment and for injection of working capital required for the viable operation of the\n\n  Concession (\"the third Representation\").61 The Plaintiffs submit that:(1) such representations were made in the Pagai letter to the Receivers dated\n\n  20 May 1993, coupled with the presentation made by the Defendants during the meeting on 22 June\n\n  1993;(2) insofar as reference is made in the 20 May letter to the \"group\"\n\n  or \"we\", this referred to the Defendants' group, not the Pagai group; and(3) those were personal representations of the Alex Ling and Philip Ling.62 There are two aspects to this issue:(i) whether such representations were made and if made, whether they were true;\n\n  and if so(ii) on whose behalf were they made.63 I first deal with the second aspect. The Plaintiffs say that those were\n\npersonal representations of Alex Ling and Philip Ling. I note that the 20 May letter does not\n\nmention Philip Ling at all. If anything, it mentions the Defendants father Tan Sri Ling Beng\n\nSiew. Insofar as the Plaintiffs are asserting that this letter constitutes a representation by\n\nPhilip Ling, this is obviously out of the question.64 But the Plaintiffs submission is more subtle than that. They couple this\n\nwith the presentation made by Alex Ling and Philip Ling during their meeting with Gispen on 22 June\n\n1993. In relation to that meeting, Gispen said the following in 14 of his affidavit\n\nevidence-in-chief (emphasis added):The first part of the meeting was used to establish the credentials of the\n\n  Defendantsand their family. The Defendants elaborated on their various businesses and then\n\n  focused on their forestry operations and their \"green image\" in that respect. Their\n\n  presentation very much focused on themselves being members of a very well respected family with\n\n  huge financial interests in the banking, mining and timber industry. They extensively describedtheir\n\n  involvement and interest in Hock Hua Bank, of which they told me that Alex Ling was\n\n  Vice-Presidentsecond only to his father, Tan Sri Ben Siew Ling. We were also told that\n\n  Alex Ling had visited the Government of Guyana and had proposed to open up or assist in theopening\n\n  up of a new bank. In fact the presentation in many ways resembled the presentation as I have\n\n  recently read it from a letter written by Alex Ling dated 6 May 1993 on a paper bearing the name\n\n  Longmuir Investments, discovered to the Plaintiffs by the Defendants in these proceedings (item\n\n  no. 35 in the Defendants List of Documents). A copy of this letter is annexed hereto and marked\n\n  \"GHG-6\" for easy reference. The only difference was that, to us,it was presented as\n\n  their own family business. Longmuir Investments is, I believe, also an offshore vehicle\n\n  company used by the Defendants.Quite how Gispen could conclude, in view of the words emphasised above, that Alex\n\nLing and Philip Ling were speaking in their personal behalf rather than on behalf of the Pagai group\n\n(in whose letterhead the letter of 20 May 1993 was written and which was signed by Alex Ling as\n\nExecutive Director) or the Ling family group, which includes their father at the very least, escapes\n\nme. The evidence clearly shows that the venture was entered into on behalf of the Ling family group\n\nor the Pagai group. I find that any representations made in connection with the 20 May 1993 letter\n\nand the meetings on 22 to 24 June 1993 were made on behalf of the Ling family group or Pagai group\n\nand not in their personal behalf.65 I turn now to the question whether the representations were made. In respect\n\nof the first Representation, i.e. that Concorde had the means to and would meet and perform all the\n\npurchasers obligations under the Agreement, the Plaintiffs had pleaded that it was made orally by\n\nthe Defendants to Gispen at the meetings of 22 to 24 June 1993. However this does not appear\n\nanywhere in Gispens affidavit evidence-in-chief. His evidence recalls how the Defendants briefed\n\nhim of the activities their group and how it was capable of undertaking the project. Then, at the\n\nend of negotiations on the second day, Wesseling suddenly informs him that his clients wished to use\n\nan offshore company to execute the agreement. This is what Gispen said at 27 of his affidavit:At the end of the negotiations after agreement had been reached between the\n\n  Defendants and us on all material issues, the Defendants, without any consultation, designated an\n\n  offshore company, Concorde Investments Limited (\"Concorde\") as the company that would\n\n  enter into the share purchase agreement on their behalf. Mr Wesseling made clear that his clients\n\n  wished for their purposes, that were not explained, to use one of their offshore companies to, in\n\n  their stead and on their behalf, execute the agreement. I was told by Mr Wesseling that this was\n\n  the normal way that his clients structured their group of companies. In my recollection, the name\n\n  of Concorde was only made known to me in the first draft of the Share Purchase Agreement the next\n\n  day.66 So it was Gispens position that he was unaware until that moment that an\n\noffshore company would be used. Thereafter, there was no evidence from him that the Defendants had\n\nsaid anything about Concorde having the means to and would meet and perform its obligations under\n\nthe Agreement. Indeed, at 30 of his affidavit, Gispen stated why he agreed to enter into the\n\nAgreement with Concorde:Prior to me confirming the Receivers acceptance of the Defendants\n\n  proposals of 23 June 1993, I had conversations with the parties that needed to approve the\n\n  transaction on my side, being Mr van Rootselaar, CLBN and the Supervisory Judge appointed in the\n\n  bankruptcy of the 3rd Plaintiff. Based on my verbal report of the several meetings including those\n\n  on the assurances given by the Defendants, and of course having it compared to the offer made by\n\n  Primegroup, which proved to include a slightly lower purchase price and to be subject to an\n\n  unclearly defined condition of a \"satisfactory due diligence\", everybody approved the\n\n  agreed transaction. The acceptance of Concorde (or any offshore vehicle appointed by the\n\n  Defendants) was found acceptable on the grounds that (a) the Defendants had agreed to pay in the\n\n  next day the required USD 4.2 million prior to the signing of the agreement, (b) that the explicit\n\n  and extensive assurances of their personal commitment - affirmed by the Defendants' vehement\n\n  response on the proposed Negotiation Agreement - provided sufficient comfort to enter into the\n\n  agreement and (c) since as a rule of Dutch law any person who has a controlling interest in a\n\n  company and who makes a company enter into a contract has an obligation to enable that company to\n\n  fulfil its contractual obligations. It was clearly put by them that the Defendants had a\n\n  controlling interest in Concorde. Based on the explanation given by the Defendants I believed that\n\n  the Defendants interjected Concorde for tax purposes only since we had been dealing with the\n\n  Defendants on a purely personal basis. At no time earlier or thereafter was any mention made by\n\n  the Defendants or their lawyers of the involvement of any other party than the Defendants\n\n  themselves.67 Although Gispen did say that the Defendants had given\"explicit and\n\nextensive assurances of their personal commitment\", this is different from the first\n\nRepresentation, viz. that Concorde had the means to and would meet and perform all the purchasers\n\nobligations under the Agreement. So the Plaintiffs evidence is quite different from their pleaded\n\ncase. While this might seem a technicality, the expression \"personal commitment\" is itself\n\na vague one. Gispen did not provide further clarification of this. Mr Chong did not ask Gispen to\n\nelaborate on it, which he is entitled to refrain from doing as this fact was not pleaded. Therefore\n\nthe conclusion must be that this does not constitute evidence that the Defendants had made the first\n\nRepresentation. Accordingly I find that the Plaintiffs have failed to prove that the first\n\nRepresentation was made.68 As concerns the second and third Representations, it is true that such\n\nstatements were made in the 20 May letter. Gispen also said that the representations as to the\n\nDefendants' group's expertise and \"financial muscle\" were also substantially repeated\n\nduring the meeting on 22 June 1993.69 The Plaintiffs submit that on the evidence, such representations were false\n\nfor the following reasons:(i) The Defendants' group clearly failed to develop and market the numerous\n\n  species of timber in the Concession. In fact they made little or no attempt to do so and the\n\n  inference from that can only be that they lacked such experience and expertise.(ii) There was no evidence to show that the Defendants' group was able to meet\n\n  expenditure of US$15-17 million. The amounts alleged to have been expended fall short of this sum\n\n  and no credible evidence was produced to show that any further resources were available by way of\n\n  bank loans or otherwise to add to this.(iii) There was no evidence to show that the Defendants had any reasonable\n\n  grounds to believe that their group was, and would be, able to meet the promised expenditures.\n\n  According to Alex Ling, the Defendants expected that all the expenses of the venture would be met\n\n  by way of timber financing based on peeler log exports. The Plaintiffs submit that the Defendants\n\n  could not have believed this.70 I have made the finding earlier that the Defendants had based their sums on\n\ntheir belief that the Concession would yield 20 cubic metres per hectare, a substantial portion of\n\nwhich would be peeler logs. They had figured on substantial sales being made at an early stage of\n\nthe project in order to succeed. However they subsequently discovered that the yield was much less\n\nthan they had expected and, more importantly, there did not exist a substantial quantity of peeler\n\nlogs to generate the early cash flow that was crucial to their plans. The evidence on this is\n\ncorroborated by Borch himself in his \"Dear Alex\" note of 23 December that I have\n\nreproduced above. Alex Ling said that they decided to cut their losses at that stage even though\n\nthey had by then sunk in about US$10 million. Although the Plaintiffs dispute this figure, they\n\nagree that US$4.2 million was transferred to Gispen in June 1993 to pay the instalment for the\n\nConcession. And Borch himself in his contemporaneous correspondence had said that the Defendants had\n\nprocured a great deal of equipment, manpower and financing to operate the Concession up to December\n\n1993. Alex Ling had produced evidence of hire purchase transactions for heavy plant and equipment\n\nthat were delivered to the site. I find that even if the figure of US$10 million was not reached,\n\nthe Defendants group had sunk in a sum between US$4.2 and US$10 million, which sum is in all\n\nprobability nearer the latter figure.71 I have also found earlier that Alex Ling and his group were able to provide\n\nthe financing and that the tripartite arrangement wasbona fide. According to Alex Ling, what\n\nhappened was that upon realising that the yields were well below what they had counted on, they\n\ndecided to cut their losses and abandoned the project. On this score I believe him and so find. In\n\nthe premises, the representations are not false. The failure of Concorde to fulfil the contract was\n\nthe result of the Defendants and their group discovering that the basis upon which they had jumped\n\ninto the project was not true and deciding in December 1993 to cut losses. In the course of so\n\ndoing, Concorde committed an act of default under the Agreement by failing to pay the first\n\ninstalment to Gispen.72 Hence the claim in misrepresentation fails.WARRANTY CLAIM73 The Plaintiffs submit that a collateral contract arose out of the Defendants\n\nassurance or promise to the Receivers in terms of the representations set out in the previous\n\nsection, with the intention that the Receivers would act on their assurances by entering into the\n\nAgreement with Concorde. I have found above that the Defendants did not make the first\n\nRepresentation. As for the second and third Representations, I have found that they were made on\n\nbehalf of the Pagai group or the Ling family group. In any event I have found that they were true.\n\nIt follows that this part of the claim must fail.74 There is a matter relating to Dutch law that I should dispose of. The parties\n\nhave each engaged an expert on Dutch law to give evidence. One of the issues concerns whether under\n\nDutch law the Plaintiffs have a cause of action. The two experts were able to come up with an agreed\n\nstatement of Dutch law on this area and this states as follows:If,     (i)  sub-paragraph 10(a), (b) or (c); and(ii) sub-paragraph 12(a), (b) or (c)\n\n  (as the case may be); and(iii) paragraph 13 or 15; and(iv) paragraph 16of the Statement of Claim are correct, these matters would constitute an\n\n  unlawful act and be actionable under Section 6:162 of the Dutch Civil Code by reason of being a\n\n  violation of an unwritten law pertaining to a duty of care as required by society which resulted\n\n  from a fault or cause which is attributable to the Defendants according to the law or generally\n\n  prevailing views.75 I have earlier made the finding that 10(a) of the Statement of Claim is\n\nincorrect in that no such representation was made. However I have found that 10(b) and 10(c) are\n\ncorrect in that such representations were made, but by the Defendants as agents of the Pagai group\n\nor the Ling family group.76 As for 12 of the Statement of Claim, this provides as follows:The said representations\n\nwere and each of them was false and untrue. In particular:(a) Concorde did not have the means to and did not meet and perform all its\n\n  obligations under the Agreement;(b) the Defendants group did not have the necessary experience and/or\n\n  expertise to develop and/or market the numerous species of timber in Guyana; and(c) the Defendants group was not able to and did not meet the requirement\n\n  for expenditure of between US$15 million to US$ 17 million required for the viable operation of\n\n  the Concession.In respect of 12(a), I have already found that the representation concerned was\n\nnot made. As for 12(b) and 12(c ), I have found earlier that these representations were true. In\n\nview of these findings, there would be no cause of action under section 6:162 of the Dutch Civil\n\nCode and it is not necessary for me to consider the remaining elements of the agreed statement of\n\nDutch law77 Finally, the Plaintiffs seem to submit that a binding oral agreement was\n\nreached between Gispen and the Defendants personally on 23 June 1993, based on 22 of Gispens\n\naffidavit evidence-in-chief which states as follows:22. After further negotiations during the course of that day, an agreement was\n\n  reached with the Defendants. I should point out that under Dutch law a contract exists once both\n\n  parties have confirmed that they mutually accept all proposed terms and conditions. A binding\n\n  agreement can exist by verbal agreement only. The Defendants and I had agreed that Dutch law would\n\n  apply to the contract. Therefore, at a certain moment on 23 June 1993, full agreement was reached\n\n  between the Defendants and me and a binding contract concluded.78 This paragraph does not set out the terms of the oral agreement, but they are\n\nset out in the next five paragraphs:23. The Defendants agreed to pay the sum of US$ 32.5 million, in consideration\n\n  of which they would obtain title to the Shares and a cancellation of all inter-company debts as of\n\n  the date the Shares would be transferred. The reason for this was that the Defendants had agreed\n\n  that as of the date of the Share Purchase Agreement, they would manage and control the businesses\n\n  of both DTL and Holdings and they wanted an assurance that all inter-company accounts would be\n\n  eliminated.24. In addition, the Defendants, anticipating their position as the new owners\n\n  of the company, agreed to fund DTL's 1993 concession payment of US$4.2 million to the Government\n\n  of Guyana. It was agreed that this loan would be extinguished as of the closing date or in the\n\n  event of a default by the Defendants.25. The agreement also included a warranty that the amount owed to the\n\n  creditors of DTL and Holdings (other than debts owed to related companies which were cancelled)\n\n  did not exceed the sum of US$1 million as of the date of the share purchase agreement. We agreed\n\n  on this figure after some discussion and negotiations and mainly based on the numbers given on the\n\n  spot by Mr Barber and qualified the warranty to be to the best of the Receivers' knowledge as at\n\n  that date.26. In the meetings I clarified to the Defendants and their lawyers that the\n\n  Receivers and CLBN had created Stichting Demerara Trust (SDT), the 2nd Plaintiff, to own and\n\n  manage the interest in Holdings and DTL and to distribute any proceeds therefrom between CLBN as\n\n  chargee and (the receivers of) UDG on behalf of the joint creditors of UDG, the 3rd Plaintiff.\n\n  CLBN at that time had a security charge on approximately 47.5% of the Shares and a mortgage on the\n\n  lands and buildings owned by DTL. I made clear to the Defendants that upon receipt of the\n\n  consideration the money would in part be applied to the debt owed by Holdings and UDG to CLBN and\n\n  in part be paid out to the bankruptcy estate of UDG. This explanation was accepted by the\n\n  Defendants and their lawyers without comment. I also clarified that at that time neither the\n\n  Receivers nor SDT owned 100% of the Shares, and that the remaining Shares would be acquired from\n\n  GCB prior to closing or otherwise we would ensure that the Defendants would acquire 100% of the\n\n  Shares. This was also accepted by the Defendants.27. At the end of the negotiations after agreement had been reached between the\n\n  Defendants and us on all material issues, the Defendants, without any consultation, designated an\n\n  offshore company, Concorde Investments Limited (\"Concorde\") as the company that would\n\n  enter into the share purchase agreement on their behalf. Mr Wesseling made clear that his clients\n\n  wished for their purposes, that were not explained, to use one of their offshore companies to, in\n\n  their stead and on their behalf, execute the agreement. I was told by Mr Wesseling that this was\n\n  the normal way that his clients structured their group of companies. In my recollection, the name\n\n  of Concorde was only made known to me in the first draft of the Share Purchase Agreement the next\n\n  day.79 Gispens conclusion that a binding agreement was reached at the end of the\n\nmeeting on 23 June does not accord with the activities of Rootselaar, the joint receiver.\n\nContemporary documents show that Rootselaar was still in negotiation with Primegroup on 24 June\n\n1993; he had invited the latter to make an offer before 10 am on that day. So it would not be\n\npossible for Gispen to say that he and the Defendants had entered into a binding agreement on 23\n\nJune, although he did make a rather weak attempt to say so in cross-examination. The Defendants\n\ncertainly disagree that such a stage was reached. And there is no other evidence, apart from Gispens\n\nbare assertion which is itself contradicted by the behaviour of Rootselaar. Indeed the manner in\n\nwhich the negotiations were conducted does not indicate that the parties had reached a binding\n\nagreement on 23 June. Obviously in the course of negotiations, parties would arrive at a meeting of\n\nminds in respect of certain terms. Unless there is a definitive \"end\" to the negotiations,\n\nat which juncture it is clear to all parties that the terms they had discussed and agreed upon up to\n\nthat time are final and binding, it would not be possible to conclude that a binding agreement had\n\nbeen reached. The parties adjourned the session for the Agreement to be drafted. There is no\n\nevidence of any changes suggested by either side to the draft that was presented for signature the\n\nfollowing day. But if there were demands for changes, even if it contradicted the understanding\n\nreached the previous day, I have no doubt that this would be considered by the parties as part of\n\nthe negotiation process and that nobody felt bound until pen was put to paper. While I would not\n\npreclude the possibility in theory of a separate collateral agreement between Gispen and the\n\nDefendants which parallel the Agreement, in my view this is too far divorced from the facts of this\n\ntransaction. Accordingly I hold that there was no such oral agreement binding on the Defendants.CORPORATE VEIL CLAIM80 The Plaintiffs contend that on the basis of the facts that can be determined\n\nfrom the evidence, the court should lift the corporate veil and permit the Plaintiffs to enforce the\n\nArbitration Award against the Defendants personally. Before I embark on a consideration of those\n\nfacts, it would be useful to set out the present state of the law in this area.",
        "The Law": "81 The starting point in any analysis of this area of the law must be the\n\ndecision of the House of Lords inSalomon v A. Salomon & Co Ltd[1896] AC 22. The\n\nplaintiff there, Salomon, had sold his solvent business to the defendant, a limited company with\n\nnominal share capital comprising 40,000 shares of 1 each. The members of the company were Salomon,\n\nhis wife and five children who each subscribed to one share. In payment of the purchase price the\n\ncompany issued 20,000 shares to Salomon and also issued debentures to him. Salomon was appointed the\n\nmanaging director and under this corporate set-up, continued to operate the business as before.\n\nHowever the company soon encountered bad times and was eventually wound up. There was not enough\n\nmoney to pay the ordinary creditors if the debentures had priority and the issue in the suit was\n\nwhether the debentures were valid. The court found no fraud on the part of Salomon in the\n\nincorporation process which was done in accordance with the statutory requirements. The English\n\nCourt of Appeal had held that the formation of the company and issue of debentures to Salomon were a\n\nmere scheme to enable him to carry on business in the name of the company with limited liability\n\ncontrary to the true intention of the Companies Act 1962. Further, this enabled Salomon to obtain a\n\npreference over the unsecured creditors. Salomon appealed.82 The House of Lords allowed the appeal. It is worthwhile to cite at length the\n\nspeeches of some of their Lordships. Lord Halsbury, LC said at p.30-31:I am simply here dealing with the provisions of the statute, and it seems to me to be essential\n\n  to the artificial creation that the law should recognise only that artificial existence  quite\n\n  apart from the motives or conduct of individual corporators. In saying this, I do not at all mean\n\n  to suggest that if it could be established that this provision of the statute to which I am\n\n  adverting had not been complied with, you could not go behind the certificate of incorporation to\n\n  shew that a fraud had been committed upon the officer entrusted with the duty of giving the\n\n  certificate, and that by some proceeding in the nature of scire facias you could not prove the\n\n  fact that the company had no real legal existence. But short of such proof it seems to me\n\n  impossible to dispute that once the company is legally incorporated it must be treated like any\n\n  other independent person with its rights and liabilities appropriate to itself, and that the\n\n  motives of those who took part in the promotion of the company are absolutely irrelevant in\n\n  discussing what those rights and liabilities are.I will for the sake of argument assume the proposition that the Court of Appeal lays down -\n\n  that the formation of the company was a mere scheme to enable Aron Salomon to carry on business in\n\n  the name of the company. I am wholly unable to follow the proposition that this was contrary to\n\n  the true intent and meaning of the Companies Act. I can only find the true intent and meaning of\n\n  the Act from the Act itself; and the Act appears to me to give a company a legal existence with,\n\n  as I have said, rights and liabilities of its own, whatever may have been the ideas or schemes of\n\n  those who brought it into existence.83 Lord Watson said this at p.40:The unpaid creditors of the company, whose unfortunate position has been\n\n  attributed to the fraud of the appellant, if they had thought fit to avail themselves of the means\n\n  of protecting their interests which the Act provides, could have informed themselves of the terms\n\n  of purchase by the company, of the issue of debentures to the appellant, and of the amount of\n\n  shares held by each member. In my opinion, the statute casts upon them the duty of making inquiry\n\n  in regard to these matters. Whatever may be the moral duty of a limited company and its\n\n  share-holders, when the trade of the company is not thriving, the law does not lay any obligation\n\n  upon them to warn those members of the public who deal with them on credit that they run the risk\n\n  of not being paid. One of the learned judges asserts, and I see no reason to question the accuracy\n\n  of his statement, that creditors never think of examining the register of debentures. But the\n\n  apathy of a creditor cannot justify an imputation of fraud against a limited company or its\n\n  members, who have provided all the means of information which the Act of 1862 requires; and, in my\n\n  opinion, a creditor who will not take the trouble to use the means which the statute provides for\n\n  enabling him to protect himself must bear the consequences of his own negligence.84 Lord Herschell said the following at p.42:As little am I able to adopt the view that the company was the agent of\n\n  Salomon to carry on his business for him. In a popular sense, a company may in every case be said\n\n  to carry on business for and on behalf of its share-holders; but this certainly does not in point\n\n  of law constitute the relation of principal and agent between them or render the shareholders\n\n  liable to indemnify the company against the debts which it incurs. Here, it is true, Salomon owned\n\n  all the shares except six, so that if the business were profitable he would be entitled,\n\n  substantially, to the whole of the profits. The other shareholders, too, are said to have been\n\n  \"dummies,\" the nominees of Salomon. But when once it is conceded that they were\n\n  individual members of the company distinct from Salomon, and sufficiently so to bring into\n\n  existence in conjunction with him a validly constituted corporation, I am unable to see how the\n\n  facts to which I have just referred can affect the legal position of the company, or give it\n\n  rights as against its members which it would not otherwise possess.And at p.45:The creditor has notice that he is dealing with a company the liability of\n\n  the members of which is limited, and the register of shareholders informs him how the shares are\n\n  held, and that they are substantially in the hands of one person, if this be the fact. The\n\n  creditors in the present case gave credit to and contracted with a limited company; the effect of\n\n  the decision is to give them the benefit, as regards one of the shareholders, of unlimited\n\n  liability.And at p.46:it must be remembered that no one need trust a limited liability company\n\n  unless he so please, and that before he does so he can ascertain, if he so please, what is the\n\n  capital of the company and how it is held.85 Lord Macnaghten said at p. 53 that:It has become the fashion to call companies of this class \"one man\n\n  companies.\" That is a taking nickname, but it does not help one much in the way of argument.\n\n  If it is intended to convey the meaning that a company which is under the absolute control of one\n\n  person is not a company legally incorporated, although the requirements of the Act of 1862 may\n\n  have been complied with, it is inaccurate and misleading: if it merely means that there is a\n\n  predominant partner possessing an overwhelming influence and entitled practically to the whole of\n\n  the profits, there is nothing in that that I can see contrary to the true intention of the Act of\n\n  1862, or against public policy, or detrimental to the interests of creditors. If the shares are\n\n  fully paid up, it cannot matter whether they are in the hands of one or many. If the shares are\n\n  not fully paid, it is as easy to gauge the solvency of an individual as to estimate the financial\n\n  ability of a crowd.86Salomons caseleft an indelible mark in this area of the law. It\n\nfirmly planted the doctrine that a duly incorporated company possesses a legal personality separate\n\nfrom that of its incorporators. This distinctiveness was affirmed inLee v Lees Air Farming[1960] 3 All ER, a decision of the Privy Council on appeal from the New Zealand Court of Appeal.\n\nThere the appellants husband, Lee, had formed the respondent company for the purpose of carrying\n\non the business of aerial top-dressing. He held 2,999 of the shares of the company and a solicitor\n\nheld one share. Lee was appointed the governing director and had full control of the company. He was\n\nalso employed as chief pilot at an annual salary of 1,500. Unfortunately Lee was killed in an\n\naccident while piloting an aircraft in the course of his work. The question before the court was\n\nwhether he was an employee of the company for the purposes of compensation under the New Zealand\n\nWorkers Compensation Act, 1922. Lee was the controlling shareholder and governing director of the\n\ncompany and in such capacity had the duty to give orders. The New Zealand Court of Appeal was of the\n\nview that he could not also be an employee, who had the duty to receive and obey orders as this\n\nwould mean in effect that he was both employer and worker. In the view of the New Zealand court, the\n\ntwo offices were clearly incompatible as there could exist no power of control and therefore the\n\nrelationship of master-servant was not created. The Privy Council disagreed. The Board affirmed the\n\ndoctrine of separate legal personality established inSalomons caseand said at p.426:In their Lordships view, it is a logical consequence of the decision inSalomon\n\n  v Salomon & Cothat one person may function in dual capacities. There is no reason,\n\n  therefore, to deny the possibility of a contractual relationship being created as between the\n\n  deceased and the respondent company.87 Since then, judicial approach to theSalomondoctrine has spanned a\n\nwide spectrum. At one end is that of Lord Denning MR. InLittlewoods Mail Order Stores Ltd v\n\nCommissioners of Inland Revenue[1961] 1 WLR 1241 he said at p.1254 that:The doctrine laid down inSalomon v A. Salomon & Co Ltdshould be\n\n  watched very carefully.However the other 2 judges of the English Court of Appeal did not support him.\n\nSachs LJ did not associate himself with that statement. And Karminski LJ said this at p.1256:[counsels] contention  was rightly that Fork [Manufacturing Co Ltd]\n\n  and the respondents to this appeal, Littlewoods, are two separate entities in law. There is no\n\n  doubt as to the correctness of that submission, based as it is on the rule inSalomon v Salomon\n\n  & Co.of many years standing.88 At the other end of the spectrum is the approach of Richmond P inRe\n\nSecuritibank Ltd (No 2)[1978] 2 NZLR 136 where he said at p.159:It may be, as Lord Denning said inLittlewoods Mail Order Stores Ltd v\n\n  McGregorthat the doctrine laid down inSalomon v Salomon & Co Ltdis to be watched\n\n  very carefully. But that can only be so if a strict application of the principle of corporate\n\n  entity would lead to a result so unsatisfactory as to warrant some departure from the normal rule.\n\n  So far as this Court is concerned the starting point must be that the importance of the doctrine\n\n  laid down inSalomon v Salomon & Co Ltdwas re-emphasised by the Privy Council inLee\n\n  v Lee's Air Farming. For myself, and with all respect, I would rather approach the question\n\n  the other way round, that is to say on the basis that any suggested departure from the doctrine\n\n  laid down inSalomon v A. Salomon & Co Ltdshould be watched very carefully.89 Dents to theSalomondoctrine have been made to suit the justice of the\n\ncircumstances. Lord Denning MR lifted the veil inWallersteiner v Moir[1974] 1 WLR 991 and\n\ninAmalgamated Investment and Property Co Ltd v Texas Commerce International Bank Ltd[1982] QB 84, although the other members of the English Court of Appeal in those cases did not agree with\n\nhim in this respect. InRe a Company[1985] BCLC 333, the defendant was alleged to be in\n\nbreach of his fiduciary duty to the plaintiffs. There was some evidence that once the defendant knew\n\nthat the plaintiff companies were insolvent, he arranged for his personal assets to be held by a\n\nnetwork of interlocking foreign and English companies in order to conceal his true interests. One of\n\nthe injunctions granted prohibited the defendant from disposing of his shares in and assets of those\n\ncompanies. The defendant appealed against this and other orders of the High Court. The English Court\n\nof Appeal upheld the injunction. Cumming-Bruce LJ said at p.337:In our view the cases  show that the court will use its powers to pierce the\n\n  corporate veil if it is necessary to achieve justice irrespective of the legal efficacy of the\n\n  corporate structure under consideration.90 However judicial attitude swung back strongly in favour of theSalomondoctrine with the decision of the English Court of Appeal inAdams v Cape Industries plc[1990] 1 Ch 433. Cape Industries plc (\"Cape\") was an English company that owned\n\nsubsidiaries in South Africa engaged in asbestos mining. Cape also owned a subsidiary, Capasco Ltd\n\n(\"Capasco\"), also incorporated in England, that marketed the asbestos world-wide. Another\n\nCape subsidiary, North American Asbestos Corporation (\"NAAC\"), an Illinois company,\n\nassisted in the marketing of asbestos in the USA. The plaintiffs were employees of a factory in\n\nTexas which had used the asbestos supplied by NAAC. The plaintiffs alleged they had suffered\n\npersonal injuries as a result of exposure to asbestos dust in the factory. They sued,inter alios,\n\nCape, Capasco and NAAC in Texas. Cape and Capasco decided not to submit to the jurisdiction.\n\nAccordingly they did not participate in the Texan proceedings and default judgment was entered\n\nagainst them. The plaintiffs applied in England to enforce the Texan judgment against Cape and\n\nCapasco. As for NAAC, Cape put it into liquidation but thereafter promoted the incorporation of a\n\nnew company in Illinois, Continental Products Corporation (\"CPC\"), to carry out similar\n\nmarketing functions in the USA. The shares of CPC were held by the chief executive of NAAC.91 In order to succeed in the English proceedings it was necessary for the\n\nplaintiffs to establish that Cape or Capasco were resident or present in the USA at the material\n\ntime. The court found that NAAC and CPC were not agents for Cape or Capasco in the USA. At issue was\n\nwhether:(i) NAAC together with Cape and Capasco represented a single commercial unit\n\n  such that the presence of NAAC in the USA would constitute presence of Cape/Capasco (\"the\n\n  single economic unit argument\"); and(ii) in relation to CPC, the corporate veil should be lifted and the presence\n\n  of CPC in the USA be deemed to constitute the presence of Cape/Capasco (\"the corporate veil\n\n  argument\").92 In respect of the single economic unit argument, the court found that NAAC was\n\noperated as an independent company and even though Cape had exercised corporate financial control\n\nover it, this was what would be expected in a group of companies such as this one. The court\n\nconcluded that in the circumstances the presence of NAAC in the USA did not constitute presence\n\nthere of Cape/Capasco. One of the authorities considered wasDHN Food Distributors Ltd v Tower\n\nHamlets LBC[1976] 3 All ER 462. That case involved a group of three companies, \"DHN\",\n\n\"Bronze\" and \"Transport\". They sought compensation under the Land Compensation\n\nAct, 1961 after land owned by Bronze was acquired by the defendants. DHN, which held all the shares\n\nin Bronze and Transport, and controlled the business of the group, appealed against the holding by\n\nthe Lands Tribunal that it was a mere licensee of Bronze and only entitled to a negligible\n\ncompensation. The court had lifted the corporate veil and Lord Denning MR had said, at p.467:Third, lifting the corporate veil. A further very interesting point was raised\n\n  by counsel for the claimants on company law. We all know that in many respects a group of\n\n  companies are treated together for the purpose of general accounts, balance sheet and profit and\n\n  loss account. They are treated as one concern. Professor Gower in his book on company law says:\n\n  there is evidence of a general tendency to ignore the separate legal entities of various\n\n  companies within a group, and to look instead at the economic entity of the whole group. This\n\n  is especially the case when a parent company owns all the shares of the subsidiaries, so much so\n\n  that it can control every movement of the subsidiaries. These subsidiaries are bound hand and foot\n\n  to the parent company and must do just what the parent company says. A striking instance is the\n\n  decision of the House of Lords inHarold Holdworth & Co (Wakefield) Ltd v Caddies. So\n\n  here. This group is virtually the same as a partnership in which all the three companies are\n\n  partners. They should not be treated separately so as to be defeated on a technical point. They\n\n  should not be deprived of the compensation which should justly be payable for disturbance. The\n\n  three companies should, for present purposes, be treated as one, and the parent company, DHN,\n\n  should be treated as that one. So that DHN are entitled to claim compensation accordingly. It was\n\n  not necessary for them to go through a conveyancing device to get it.Goff LJ, sounding a more cautious note, said at p.468:this is a case in which one is entitled to look at the realities of the\n\n  situation and to pierce the corporate veil. I wish to safeguard myself by saying that so far as\n\n  this ground is concerned, I am relying on the facts of this particular case. I would not at this\n\n  juncture accept that in every case where one has a group of companies one is entitled to pierce\n\n  the veil, but in this case the two subsidiaries were both wholly owned; further, they had no\n\n  separate business operations whatsoever; thirdly, in my judgment, the nature of the question\n\n  involved is highly relevant, namely whether the owners of this business have been disturbed in\n\n  their possession and enjoyment of it.93 The English Court of Appeal inAdams v Cape Industriestook the view\n\nthat the decision inDHN Food Distributors Ltd v Tower Hamlets LBCas well as in the other\n\nauthorities cited in which the court had treated the parent and subsidiary as a single unit ought to\n\nbe regarded as decisions that turned on the relevant statutory provisions. After referring to the\n\nspeeches of Lord Denning MR and Goff LJ reproduced above, the court said at p.536:The relevant parts of the judgments in theD.H.N.case  must, we\n\n  think, likewise be regarded as decisions on the relevant statutory provisions for compensation,\n\n  even though these parts were somewhat broadly expressed, and the correctness of the decision was\n\n  doubted by the House of Lords inWoolfson v. Strathclyde Regional CouncilThe court then went on to uphold theSalomondoctrine in very strong\n\nterms, as follows:Mr. Morison described the theme of all these cases as being that where legal\n\n  technicalities would produce injustice in cases involving members of a group of companies, such\n\n  technicalities should not be allowed to prevail. We do not think that the cases relied on go\n\n  nearly so far as this. As Sir Godfray submitted, save in cases which turn on the wording of\n\n  particular statutes or contracts, the court is not free to disregard the principle ofSalomon\n\n  v. A. Salomon & Co. Ltd.[1897] A.C. 22 merely because it considers that justice so\n\n  requires. Our law, for better or worse, recognises the creation of subsidiary companies, which\n\n  though in one sense the creatures of their parent companies, will nevertheless under the general\n\n  law fall to be treated as separate legal entities with all the rights and liabilities which would\n\n  normally attach to separate legal entities.And again at p.537:If a company chooses to arrange the affairs of its group in such a way that the\n\n  business carried on in a particular foreign country is the business of its subsidiary and not its\n\n  own, it is, in our judgment, entitled to do so. Neither in this class of case nor in any other\n\n  class of case is it open to this court to disregard the principle ofSalomon v. A. Salomon\n\n  & Co. Ltd.[1897] A.C. 22 merely because it considers it just so to do.94 The English Court of Appeal inAdams v Cape Industriesheld that apart\n\nfrom cases where statute or contract permits a broad interpretation to be given to references to\n\nmembers of a group of companies, there is one well-recognised exception to the rule prohibiting the\n\npiercing of the corporate veil. As stated by Lord Keith inWoolfson v Strathclyde Regional\n\nCouncil[1978] SLT 159, this is:the principle that it is appropriate to pierce the corporate veil only where\n\n  special circumstances exist indicating that it is a mere faade concealing the true facts.However the court said that it was not a well developed concept, commenting at\n\np.543:From the authorities cited to us we are left with rather sparse guidance as to\n\n  the principles which should guide the court in determining whether or not the arrangements of a\n\n  corporate group involve a faade within the meaning of that word as used by the House of Lords inWoolfson, 1978 S.L.T. 159. We will not attempt a comprehensive definition of those\n\n  principles.95 The court inAdams v Cape Industriesalso disapproved the direction\n\ntaken by Lord Denning MR inWallersteiner v MoirandLittlewoods Mail Order Stores Ltd v\n\nCommissioners of Inland Revenue, saying at p.543:We were referred to certain broad dicta of Lord Denning M.R. inWallersteiner\n\n  v. Moir[1974]  and inLittlewoods Mail Order Stores Ltd. v. Inland Revenue\n\n  Commissioners... In both these cases he expressed his willingness to pull aside the corporate\n\n  veil, saying in the latter:\"I decline to treat the [subsidiary] as a separate and independent entity.\n\n  . . . The courts can and often do draw aside the veil. They can, and often do, pull off the mask.\n\n  They look to see what really lies behind. The legislature has shown the way with group accounts\n\n  and the rest. And the courts should follow suit. I think that we should look at the Fork\n\n  Manufacturing Co. Ltd. and see it as it really is - the wholly-owned subsidiary of Littlewoods. It\n\n  is the creature, the puppet, of Littlewoods, in point of fact: and it should be so regarded in\n\n  point of law.\"However, inWallersteiner v. Moir[1974] 1 W.L.R. 991 Buckley L.J., at\n\n  p. 1027, and Scarman L.J., at p. 1032, expressly declined to tear away the corporate veil. In theLittlewoods\n\n  case[1969] 1 W.L.R. 1241, 1255, Sachs L.J. expressly dissociated himself from the suggestion\n\n  that the subsidiary was not a separate legal entity and Karminski L.J. refrained from associating\n\n  himself with it. We therefore think that the plaintiffs can derive little support from those dicta\n\n  of Lord Denning M.R.96 The court made the following findings of fact inAdams v Cape Industries(at p.541):The inference which we draw from all the evidence was that Cape's intention was\n\n  to enable sales of asbestos from the South African subsidiaries to continue to be made in the\n\n  United States while (a) reducing the appearance of any involvement therein of Cape or its\n\n  subsidiaries, and (b) reducing by any lawful means available to it the risk of any subsidiary or\n\n  of Cape as parent company being held liable for United States taxation or subject to the\n\n  jurisdiction of the United States courts, whether state or federal, and the risk of any default\n\n  judgment by such a court being held to be enforceable in this country.97 The court went on to consider whether the arrangements regarding NAAC and CPC\n\nmade by Cape with those intentions constituted a faade such as to justify lifting the corporate\n\nveil. The court considered the decision inJones v Lipman[1962] 1 WLR 832 and held that\n\nwhere a faade was alleged, the motive of the perpetrator may be highly material. The court held\n\nthat because CPC was a company whose shares were owned by the chief executive of NAAC in law and in\n\nequity, it could not be a faade. This position was not altered by the fact that Capes intention\n\nin coming up with this arrangement was to enable sales of asbestos from the South African\n\nsubsidiaries to be made while reducing the appearance of any involvement by Cape and reducing by any\n\nlawful means available the exposure of Cape and its subsidiaries to enforcement in England of any\n\ndefault judgment entered in the USA. One of the submissions of counsel for the plaintiffs there was\n\nthat the court would lift the veil where a defendant by the device of a corporate structure\n\nattempted to evade such rights of relief as third parties may in the future acquire. The court\n\ndisagreed, saying at p. 544:we do not accept as a matter of law that the court is entitled to lift the\n\n  corporate veil as against a defendant company which is the member of a corporate group merely\n\n  because the corporate structure has been used so as to ensure that the legal liability (if any) in\n\n  respect of particular future activities of the group (and correspondingly the risk of enforcement\n\n  of that liability) will fall on another member of the group rather than the defendant company.\n\n  Whether or not this is desirable, the right to use a corporate structure in this manner is\n\n  inherent in our corporate law. Mr. Morison urged on us that the purpose of the operation was in\n\n  substance that Cape would have the practical benefit of the group's asbestos trade in the United\n\n  States of America without the risks of tortious liability. This may be so. However, in our\n\n  judgment, Cape was in law entitled to organise the group's affairs in that manner and  to\n\n  expect that the court would apply the principle ofSalomon v. A. Salomon & Co. Ltd.[1897] A.C. 22 in the ordinary way.98 A later English Court of Appeal affirmedAdams v Cape Industries. InOrd\n\nv Belhaven Pubs Ltd[1998] 2BCLC 447, the plaintiffs in 1991 sued the defendant, Belhaven, who\n\nwere the legal owners of a public house. The plaintiffs claimed damages for misrepresentation and\n\nbreach of warranty in relation to their purchase from Belhaven of a 20-year lease of the public\n\nhouse. Belhaven counterclaimed for unpaid rent. Belhaven was a subsidiary of a group of property\n\ncompanies. In 1992, the group was restructured in such a way that the hotels in Belhavens name\n\nwere transferred to the parent company. Thereafter the Belhaven ceased trading although it was still\n\nthe legal owner of the public house leased to the plaintiffs. In 1997 the plaintiffs applied for\n\nleave to substitute the parent company and another subsidiary as defendants on the ground that\n\nBelhaven was a mere shell with insufficient assets to pay damages. The deputy judge ordered the\n\nsubstitution and one of the grounds for it was that the circumstances justified lifting the\n\ncorporate veil. Belhaven appealed.99 The English Court of Appeal found that the restructuring had been carried out\n\nwithout any impropriety. Also, it was not a question of the company being a mere faade. Hobhouse\n\nLJ, with whom the other two judges agreed, said at p.456:Indeed, before us [counsel for the plaintiffs] has frankly accepted that he\n\n  does not put his case in that way. He says no impropriety is alleged. He does not allege that\n\n  there was any breach of the provisions of the [Insolvency Act 1986] nor that there was any conduct\n\n  on the part of the directors (or any other person) in 1992 or 1995 which would give rise to\n\n  remedies under the Companies Act 1985 or under the 1986 Act. Therefore, he is not able to rely\n\n  upon any concept of fault or indeed of fraud in support of his contention that the corporate veil\n\n  should be pierced. It will be appreciated that this immediately puts the facts of this case into a\n\n  completely different category from cases such asWallersteiner v Moir[1974] 3 All ER 217.\n\n  Furthermore, he is not able to make out any case that at any stage the company was a mere faade,\n\n  or that it concealed the true facts, nor that there was any sham. All the transactions that took\n\n  place were overt transactions. They were conducted in accordance with the liberties that are\n\n  conferred upon corporate entities by the Companies Act 1985 and they do not conceal anything from\n\n  anybody. The companies were operating at material times as trading companies and they were not\n\n  being interposed as shams or for some ulterior motive.100 The deputy judge below had also relied on the concept of corporate benefit or\n\nsingle economic unit. Counsel had citedWoolfson v Strathclyde Regional CouncilandDHN\n\nLtd v Tower Hamlets LBCin support of this. But Hobhouse LJ said at p.457:These were both compensation cases which involved questions of valuation of\n\n  interest which raised much broader criteria than those which are concerned with establishing legal\n\n  liability of one corporate entity or another for alleged torts or breaches of contract.In any event, the court said that this matter was reviewed inAdams v Cape\n\nIndustriesand the court there had considered that those concepts were extremely limited. To\n\nignore the legal distinction in corporate personality was a course that was (at p.457):radically at odds with the whole concept of corporate personality and\n\n  limited liability and the decision of the House of Lords inSalomon v A Salomon & Co Ltd.Hobhouse LJ was of the view that impropriety must be present before the veil can\n\nbe lifted in such cases, and said, at p.457, that the Court of Appeal inAdams v Cape Industrieswas clearly:of the view that there must be some impropriety before the corporate veil\n\n  can be pierced.101 InFar East Oil Tanker SA v Owners of the Ship or Vessel Andres\n\nBonifacio (The Andres Bonifacio)[1993] 3 SLR 521, the Court of Appeal appliedAdams\n\nv Cape Industriesand said at p.531:there must be special circumstances to exist before lifting the corporate\n\n  veil, such as the presence of a facade or sham set up to deceive the appellants. One could not\n\n  lift the corporate veil just because a company made subsidiaries in order to avoid future\n\n  liabilities (see Slade LJs judgment at p 1026 inAdams v Cape IndustriesThis position was followed by the High Court inST Shipping and Transport Inc\n\nv Owners of The Skaw Prince[1994] 3 SLR 379. The court was invited to lift the corporate\n\nveil in the context of one-ship companies. Amarjeet Singh JC applied the above statements of\n\nthe Court of Appeal and held, at p.386, that:[I]t is well known that businesses engaged in shipping set up and utilize\n\n  one-ship companies within their corporate structure for the purpose of limiting liability. The\n\n  device has been around and recognized by the courts as a legitimate one and the courts view has\n\n  been that the court will not lift the corporate veil unless the circumstances are exceptional.102 Toulson J recognised the change wrought byAdams v Cape Industrieswhen he said inYukong Line Ltd v Rendsburg Investments Corporation (\"The Rialto\")(No\n\n2)[1998] 1 Lloyds Rep 322 at p.329:It has long been recognized that theSalomonprinciple can cause\n\n  hardship, although those dealing with one-man companies may, and commonly do, seek to protect\n\n  themselves by requiring a personal guarantee. Some authorities have suggested that the Court will\n\n  use its powers to pierce the corporate veil whenever it thinks it necessary to achieve justice\n\n  (seeRe A Company,[1985] B.C.L.C. 333 at pp. 337-338), but such a broad approach was\n\n  disapproved by the Court of Appeal inAdams v. Cape Industries Plc103 The High Court was invited to pierce the corporate veil inWin Line (UK)\n\nLtd v Masterpart (S) Pte Ltd & Anor[2000] 2 SLR 98. The first defendant, Masterpart, had\n\nchartered the plaintiffs vessel to carry a cargo from Kandla to Colombo. Although the vessel was\n\nready at Kandla, Masterpart failed to load any cargo. The buyers eventually rejected the cargo,\n\nwhereupon Masterpart informed the plaintiff that it was no longer interested in the vessel. The\n\nplaintiff accepted the repudiation and sued Masterpart for damages which the latter admitted. The\n\nplaintiff also sued the second defendant, D&M, on grounds that:(1) Masterpart entered the charterparty as agent of D&M;(2) Masterpart was only the nominal charterer and was a sham or mere faade or\n\n  alter ego;(3) Masterpart and D&M were run as a single corporate entity.104 Prakash J found that Masterpart and D&M had different directors and\n\nshareholders, although the 2 sole directors/shareholders of Masterpart were employees of D&M.\n\nMasterpart had a paid-up capital of $10,000. Although it had a different registered office from\n\nD&M, they shared the same office and telephone and fax numbers. Masterpart had no staff apart\n\nfrom its directors. Masterpart also maintained its own bank accounts although there was never very\n\nmuch money or activity in those accounts. The court found no evidence that the two shareholders of\n\nMasterpart did not hold the shares beneficially. However Masterpart was used by D&M in\n\ncircumstances where the latter did not want to be seen to be involved. This was because D&M had\n\nexclusive arrangements with some Indian companies. To get around that restriction, in respect of\n\ntransactions with other companies, D&M contracted with Masterpart to conduct those transactions,\n\nprovided the financing and paid Masterpart 0.1% of the turnover, which amounted to about 20% of the\n\nprofit. Masterpart would provide and do everything else to complete the transaction. In respect of\n\nthe transaction, the subject of the dispute, Masterpart had provided to the buyer a standby letter\n\nof credit which functioned as a performance bond. This letter of credit was guaranteed by D&M.105 To the plaintiffs first contention, Prakash J found that there was no\n\nprincipal-agent relationship between D&M and Masterpart. She found that D&M had considered\n\nMasterpart useful in pursuing business that the former would otherwise be unable to undertake in\n\nview of its exclusive arrangements with third parties. Also, the judge found that there was no\n\nrepresentation by Masterpart that it was acting as agent of D&M. The judge found no evidence to\n\nconclude that Masterpart was the alter ego of D&M nor that the two companies were a single\n\neconomic unit as would move the court to lift the corporate veil. On the issue of risks of dealing\n\nwith insubstantial companies, Prakash J said at 41 - 42:The charterparty itself was not obtained by any dubious practice. That\n\n  Masterparts paid-up capital was only $10,000 was a fact in the public domain. Masterpart never\n\n  deceived the plaintiffs as to its standing and the description of it as being part of D&Ms\n\n  group of companies does not help the plaintiffs because they knew they were contracting with\n\n  Masterpart and not with D&M. If the plaintiffs had not been prepared to accept Masterpart on\n\n  its own merit, they could have asked its directors to guarantee the freight or supply a guarantee\n\n  from a suitable third party. The evidence was, however, that at that time the freight market was a\n\n  charterers market and for this reason, the plaintiffs were willing to accept a charter rate\n\n  which was below the vessels daily operating cost. It was also the reason probably why the\n\n  plaintiffs were willing to accept Masterpart as their charterers without any personal guarantee\n\n  even though they knew very little about the company.42 Arcadia had made direct enquiries as to the standing of the charterer with\n\n  Captain Appaswamy and was satisfied with the outcome of those enquiries. It did not feel the need\n\n  to carry out any further searches and therefore must be taken to have accepted Masterpart as it\n\n  was. As ship managers of long standing, Arcadia must have known the risks that ship owners incur\n\n  when they enter into charterparties with charterers who do not have substantial assets. The\n\n  plaintiffs having become embroiled in such a situation cannot now improve their position by\n\n  seeking to treat Masterpart, with whom they were content to contract after only nominal\n\n  investigation, as the clothing worn by D&M.106 A similar issue was before another High Court inSri Jaya (Sdn) Bhd v RHB\n\nBank Bhd[2001] 1 SLR 486. That case is primarily concerned with the duties of a mortgagee in\n\nconducting the sale of a mortgaged property and it is not necessary to set out the facts. Rajendran\n\nJ was invited to lift the veil in a situation in which he found that the company concerned was not\n\nbeing used to evade any legal obligations or to perpetrate a fraud, even though the company was\n\nacquired with a view to commencing an action against the bank. The judge said at 63-64:63 Apart from the statutory exceptions to the rule that the company is a\n\n  separate legal entity from its shareholders and directors, the courts have, in limited\n\n  circumstances, lifted the corporate veil. It would appear that this power is exercised sparingly\n\n  and although the ambit of exceptions is not closed, the case law authorities as to when the courts\n\n  have in fact lifted the corporate veil can be broadly classified as cases where the corporate\n\n  entity is being used to evade legal obligations (Gilford Motor Co Ltd v Horne[1933] Ch\n\n  935) and where the corporate entity is used to perpetrate a fraud (Re Darby[1911] 1 KB\n\n  95).64 Sri Jaya had been a dormant company from about the time Tan Sri Almenoar\n\n  died in late 1994. It was a fair conclusion that Ng Kheng Chye, being the shrewd businessman that\n\n  he was, assumed control of Sri Jaya with a view to commencing the present action against RHB Bank.\n\n  However, even as such, Ng Kheng Chyes actions and motives in assuming control of RHB Bank and\n\n  commencing the present suit against RHB Bank cannot be characterised as fraudulent. Sri Jaya were\n\n  not being used to evade any legal obligations or to perpetrate a fraud. If RHB Bank were\n\n  negligent, Sri Jaya were fully entitled to pursue their legal rights even though its directors and\n\n  shareholders were no longer the same and even though the present shareholders might have a\n\n  collateral purpose in commencing the suit. The situation here did not fall within the existing\n\n  principles of when a court will lift the corporate veil nor were there any compelling reasons\n\n  advanced as to why I should, in this particular case, extend the ambit of the established\n\n  exceptions.107 In a recent case before the Chancery Division,Trustor AB v Smallbone\n\n& Ors[2001] 1 WLR 1177, Morritt V-C was faced with a submission by counsel that the\n\ncorporate veil should be lifted in three potentially overlapping categories, namely:(1) where the company was shown to be a faade or sham with no unconnected\n\n  third party involved;(2) where the company was involved in some impropriety; and(3) where it was necessary to do so in the interests of justice and no\n\n  unconnected third party is involved.108 After examining the authorities, the judge concluded that the authorities\n\nestablished the first proposition cited above. In respect of the other two propositions, he held as\n\nfollows (at 21-23):21 The third proposition is said to be derived from the decision in In re A\n\n  Company [1985] BCLC 333. In that case a complicated structure of foreign companies and trusts was\n\n  used to place the individual's assets beyond the reach of his creditors. Cumming-Bruce LJ\n\n  described the structure as a facade, at p 336, but expressed the principle, at pp 337-338, to be\n\n  that the court will use its powers to pierce the corporate veil if it is necessary to achieve\n\n  justice irrespective of the legal efficacy of the corporate structure under consideration. The\n\n  latter statement is not consistent with the views of the Court of Appeal inAdams v Cape\n\n  Industries plc[1990] Ch 433, 536, where Slade LJ said:\"[Counsel for Adams] described the theme of all these cases as being\n\n    that where legal technicalities would produce injustice in cases involving members of a group of\n\n    companies, such technicalities should not be allowed to prevail. We do not think that the cases\n\n    relied on go nearly so far as this. As [counsel for Cape] submitted, save in cases which turn on\n\n    the wording of particular statutes or contracts, the court is not free to disregard the\n\n    principle ofSalomon v A Salomon & Co Ltd[1897] AC 22 merely because it considers\n\n    that justice so requires. Our law, for better or worse, recognises the creation of subsidiary\n\n    companies, which though in one sense the creatures of their parent companies, will nevertheless\n\n    under the general law fall to be treated as separate legal entities with all the rights and\n\n    liabilities which would normally attach to separate legal entities.\"InOrd v Belhaven Pubs Ltd[1998] BCC 607, 614-615 Hobhouse LJ expressed\n\n  similar reservations. It does not appear from the reports that in either of those cases the court\n\n  was referred toIn re A Company[1985] BCLC 333. In those circumstances I consider that I\n\n  should follow the later decisions of the Court of Appeal inAdams v Cape Industries plc[1990] Ch 433 andOrd v Belhaven Pubs Ltd[1998] BCC 607 and decline to apply so broad a\n\n  proposition as that for which counsel for Trustor contends in the third principle referred to in\n\n  paragraph 14 above.22 The second proposition also appears to me to be too widely stated unless\n\n  used in conjunction with the first. Companies are often involved in improprieties. Indeed there\n\n  was some suggestion to that effect inSalomon v A Salomon & Co Ltd[1897] AC 22. But it\n\n  would make undue inroads into the principle ofSalomon's caseif an impropriety not linked\n\n  to the use of the company structure to avoid or conceal liability for that impropriety was enough.23 In my judgment the court is entitled to \"pierce the corporate\n\n  veil\" and recognise the receipt of the company as that of the individual(s) in control of it\n\n  if the company was used as a device or facade to conceal the true facts thereby avoiding or\n\n  concealing any liability of those individual(s).",
        "Plaintiffs submissions": "109 The Plaintiffs rely primarily on the decision of Atkinson J inSmith,\n\nStone & Knight v Birmingham Corporation(1939) 4 KB 116. The headnote to that report reads\n\nas follows:A company acquired a partnership concern and, having registered it as a\n\n  company, continued to carry on the acquired business as a subsidiary company. The parent company\n\n  held all the shares except five which its directors held in their respective names in trust for\n\n  the company. The profits of the new company were treated as profits of the parent company, which\n\n  appointed the persons who conducted the business and were in effectual and constant control. The\n\n  defendant corporation compulsorily acquired the premises upon which the business of the subsidiary\n\n  company was carried on, and the parent company claimed compensation in respect of removal and\n\n  disturbance, but the respondents contended that the proper claimants were the subsidiary company,\n\n  that being a separate legal entity.110 Although the subsidiary company was apparently carrying on its own business,\n\nthe business was operated by the parent company. The subsidiary had no staff and its books were\n\nmaintained by the parent. The subsidiary had also never declared dividends and their profits were\n\ntreated in fact as the parents profits. Atkinson J held that the subsidiary was not operating in\n\nits own behalf but on behalf of the parent and therefore the latter company was entitled to claim\n\ncompensation. The judge analysedGramaphone & Typewriter Ltd v Stanley[1908] 2 KB 89 andInland Revenue Commissioners v Sansom[1921] 2 KB 492 and held that it was a question of fact\n\nin each case whether a subsidiary was carrying on business on its own account. The judge said at\n\np.121:It seems therefore to be a question of fact in each case, and those cases\n\n  indicate that the question is whether the subsidiary was carrying on the business as the companys\n\n  business or as its own. I have looked at a number of casesthey are all revenue casesto see\n\n  what the courts regarded as of importance for determining that question. There isSan Paulo\n\n  Brazilian Ry Co v Carter,Apthorpe v Peter Schoenhofen Brewery Co Ltd, p 41;Frank\n\n  Jones Brewing Co v Apthorpe,St Louis Breweries v Apthorpe, and I find six points which\n\n  were deemed relevant for the determination of the question: Who was really carrying on the\n\n  business? In all the cases, the question was whether the company, an English company here, could\n\n  be taxed in respect of all the profits made by some other company, a subsidiary company, being\n\n  carried on elsewhere.111 Atkinson J went on to enumerate 6 points relevant in determining this issue:(i) Were the profits treated as the profits of the company, i.e. the party on\n\n  whose behalf the business was really being carried on?(ii) Were the persons conducting the business appointed by the true conductor\n\n  of the business?(iii) Was the true conductor of the business the head and brains of the trading\n\n  venture?(iv) Did the true conductor govern the adventure, decide what should be done\n\n  and what capital should be embarked on the venture?(v) Did the true conductor make the profits by its skill and direction?(vi) Was the true conductor in effectual and constant control?Atkinson J said that for the claimant to succeed, all six questions must be\n\nanswered in the positive.112 Before me the Plaintiffs submitted that, applying those principles to the\n\nfacts of the present case, there was no question that the Defendants were the persons carrying on\n\nthe business. Therefore I should lift the corporate veil. In my view the first question is whether\n\nthis test is applicable in the circumstances of the present case.Smith, Stone & Knight v\n\nBirmingham Corporationconcerned a claim for compensation. The question for determination\n\nby the court was whether compensation was payable by Birmingham Corporation to the parent company.\n\nIn his analysis of the authorities, Atkinson J had referred to revenue cases in which the question\n\nwas whether in relation to tax liability another company should be held liable. That is quite a\n\ndifferent question from the issue in the present case, i.e. whether the Defendants should be deemed\n\nliable for the liabilities of Concorde.113Smith, Stone & Knight Ltd v Birmingham Corporationwas not\n\nconsidered by the English Court of Appeal inAdams v Cape Industriesalthough it was cited at\n\nfirst instance. AsSmith, Stone & Knight Ltd v Birmingham Corporationalso concerns\n\nacquisition and compensation, the comments inOrd v Belhaven Pubs Ltdregarding theWoolfsonandDHN Ltdcases that I have referred to above would apply with equal force. As Toulson J\n\ncommented inYukong Line Ltd v Rendsburg Investments Corporation (\"The Rialto\")(No 2)[1998] 1 Lloyds Rep 322, at p.328:InAdams v. Cape Industries Plc.,[1990] Ch. 433 at p. 536 the Court of\n\n  Appeal observed that the wording of a particular statute or contract has sometimes been held to\n\n  justify the treatment of parent and subsidiary as one unit for some purposes, and gave as an\n\n  example the compensation case ofDHN Food Distributors Ltd. v. Tower Hamlets London Borough\n\n  Council, [1976] 1 W.L.R. 852, while commenting that parts of the judgments in that case were\n\n  somewhat broadly expressed. It seems to me that the same observations apply to the decision inSmith\n\n  Stone and Knight Ltd. v. Birmingham Corporation.114 Mr Rajah said thatSmith, Stone & Knight v Birmingham Corporationwas followed by the Federal Court of Australia inSpreag and anor v Paeson Pty Ltd & Ors[1990] 94 ALR 679, and applied by the Supreme Court of New South Wales inHotel Terrigal Pty Ltd\n\nv Latec Investments Ltd (No. 2)[1969] 1 NSWR 676. I turn to examine those decisions.115Spreag & anor v Paeson Pty Ltd & Orsinvolved a contract for\n\nthe sale of a brick-making machine which the plaintiffs entered into after advertisements and a\n\ndemonstration. Unfortunately, the machine failed to perform as promised. The plaintiffs took out an\n\napplication against nine respondents for damages pursuant to breaches of s.52 of the Commonwealth\n\nTrade Practices Act 1974. The plaintiffs also took out actions against the first and second\n\nrespondents based on s.71 of the Trade Practices Act and s.19 of the Sale of Goods Act of New South\n\nWales. We are only concerned with the action against the first respondent, Paeson Pty Ltd\n\n(\"Paeson\"), and the second respondent, Componere Pty Ltd (\"Componere\") under the\n\nNew South Wales statutes.116 Paeson was the company that the plaintiffs had effectively transacted with\n\nbut they sought to recover damages from Componere as well, on the basis that the latter was liable\n\nto them as a principal either because: (i) Paeson allowed Componere to conduct its business or\n\ndelegated its business to Componere; or (ii) Componere was the undisclosed principal of Paeson. The\n\nevidence revealed that Paeson had at no material time any bank account, any premises of its own or\n\nkept any books of account, nor prepared any balance sheet or profit and loss account. It also\n\nrevealed that payments were made by Componere on Paeson's behalf for a variety of expenses,\n\nincluding wages, while moneys received by Paeson or on its behalf were paid to Componere and\n\nretained by the latter. Sheppard J posed the same six questions that Atkinson J had stated in his\n\ndecision inSmith, Stone & Knightand decided that the evidence before him allowed him to\n\nanswer all six questions in the affirmative. Sheppard J found that the reality of the matter was\n\nthat Componere was carrying on the business of Paeson, notwithstanding the references to payments\n\nbeing made on behalf of Paeson in Componere's books of account and the existence of the loan account\n\nin Componere's balance sheet.117 It should be noted that Componere did not deal with the plaintiffs at all.\n\nSheppard J found that Componere was in the position of an agent acting for an undisclosed principal.\n\nPaeson, which dealt with the plaintiffs, was but an empty shell. Therefore there was some degree of\n\ndeception involved. I should add also that this case predatesAdams v Cape Industries.118 InHotel Terrigal Pty Ltd (in liq.) v Latec Investements Ltd (No. 2)the\n\nSupreme Court of New South Wales appliedSmith, Stone & Knight v Birmingham Corporation.\n\nThat case involved a mortgagee sale under suspicious circumstances by a company, L Ltd, to one of\n\nits wholly-owned subsidiaries, S Ltd. The evidence showed that the directors of both companies were\n\nthe same and S Ltd was in fact chosen to be the buyer by the directors of L Ltd. No negotiations\n\nwere carried out and the purported sale was not accompanied by payment of the purchase money until a\n\nyear later, which also seemed to have been a formality.119 The court found that the sale was invalid as it was procured by equitable\n\nfraud because, inter alia, referring toSmith, Stone & Knight and Birmingham Corporation,\n\nthe facts rebutted the independent corporate personality rule laid down inSalomon v Salomon\n\n& Co. This was because the subsidiary company was in fact an agent, and not a true\n\nindependent corporation. Therefore, the sale amounted to a sale by the mortgagee to itself. It\n\nshould be noted that fraud or impropriety had been alleged.120 Mr Rajah also relied on the fact thatSmith Stone & Knight Ltd v\n\nBirminghamwas considered by the Court of Appeal inMiller Freeman Exhibitions Pte Ltd v\n\nSingapore Industrial Automation Association & Anor[2000] 4 SLR 137. In that case, the first\n\ndefendant (\"the Association\") wholly owned and managed the second defendant\n\n(\"SIAA\"). SIAA appointed the plaintiffs (\"MFE\") to manage and organise biennial\n\nIndustry Automation exhibitions in 1995, 1997 and 1999. The 1995 exhibition was a resounding success\n\nbut not the one in 1997. In May 1998 SIAA terminated the management agreement and MFE sued for\n\nbreach of contract. MFE joined the Association as a defendant on the ground that the Association and\n\nSIAA were in reality one and the same entity. On the question whether the Association was a proper\n\ndefendant, the Court of Appeal held that it was not and said as follows (at 19-21):19 We now turn to the contention that the Association and SIAA were one and the\n\n  same party and it was the Association that carried on the business. The basis for this contention\n\n  is the under-capitalisation of SIAA; the commonality of the directors and executives of SIAA and\n\n  the Association; the ownership by the Association of all the shares in SIAA; the use of the\n\n  letterhead of the Association in the correspondence with the appellants; and the sharing of the\n\n  same office and address with the Association. These indicia, in our view, are by no means\n\n  conclusive on this issue. The fact remained, however, that the management agreement was expressly\n\n  made between SIAA and the appellants, and both of them entered into this contract as principals\n\n  and not as agents. Pursuant to the contract, a performance bond was issued at the instance of the\n\n  appellants and was issued to SIAA and not to the Association. The formal notice of assignment of\n\n  the management agreement to MDA was given in the name of the SIAA; so also was the letter stating\n\n  that the management agreement had been terminated and refusing permission to the appellants to be\n\n  present at the presentation of the IA 99 given jointly by MDA and the Association. The letter of\n\n  termination of the agreement was given on behalf of SIAA. In addition, there was evidence to show\n\n  that payments by the appellants were made to SIAA itself. First, in the letter dated 22 April\n\n  1996, Teng complained that a cheque for $5,000 to SIAA Pte Ltd to be drawn from the joint\n\n  account from the sales of 26th ISIR proceedings was long overdue. Secondly, according to the\n\n  evidence of Foo Chee Lan, the finance director of the appellants, the share of profits from the IA\n\n  95 and IA 97 exhibitions was, in each case, paid by the appellants to SIAA.20 True it is that the Association managed and controlled SIAA and that the driving\n\n  force or the head and brain of SIAA was and is the Association and that it is the\n\n  Association which made the important decisions in relation to the IA exhibitions. However, it does\n\n  not necessarily follow that SIAA was the Associations agent or that both of them were one and\n\n  the same party. It should be borne in mind that SIAA was specifically formed by the Association to\n\n  absorb the risk of the business involved in organising IA exhibitions, which the Association was\n\n  entitled to do. True also that most of the letters or faxes written to the appellants in relation\n\n  to matters concerning the IA exhibitions came from the office or address and written by the\n\n  officers of the Association using the letterhead of the Association. This, however, is not\n\n  altogether surprising, having regard to the commonality of directors and executives of the\n\n  Association and SIAA.21 Counsel for the appellants refers to the case ofSmith, Stone &\n\n  Knight Ltd v Birmingham Corp[1939] 4 All ER 116 and relies on the factors laid down by\n\n  Atkinson J therein to suggest that the business carried on was the Associations business and\n\n  not SIAAs.  In the course of his judgment, the learned judge found the following six\n\n  questions material in determining the question as to who was carrying on the business:(1) were the profits treated as the profits of the company?(2) were the persons conducting the business appointed by the parent company?(3) was the company the head and the brain of the trading venture?(4) did the company govern the adventure, deciding what should be done and\n\n    what capital should be embarked on the venture?(5) did the company make the profits by its skill and direction? and(6) was the company in effectual and constant control?Having considered these questions, the learned judge found that the subsidiary\n\n  was the agent of SSK and that the business was that of SSK.121 Turning to the 6-point test of Atkinson J inSmith, Stone & Knight Ltd\n\nv Birmingham Corporation, the Court of Appeal cautioned that, while helpful, it was not a\n\ndefinitive test. The court said at 22:22 The six points adumbrated by Atkinson J are certainly helpful guidelines but\n\n  they are by no means, and it was never suggested by the learned judge to be, a conclusive and\n\n  definitive test applicable in all circumstances in determining whether a business is carried on by\n\n  a subsidiary as the principal or as an agent for its holding company. In some cases, as in the\n\n  present one, there are other circumstances which have to be taken into account. In this case, in\n\n  particular, SIAA carried on the business: it entered into the management agreement with the\n\n  appellants as the principal; it was the beneficiary of a performance bond issued at the instance\n\n  of the appellants to secure the latters due performance of the management agreement; it\n\n  received the shares of the profits derived from the IA 95 and 97 exhibitions, and presumably for\n\n  this and other purposes it had banking accounts; it gave formal notice to the appellants of the\n\n  assignment of the management agreement and through its solicitors it issued the notice of\n\n  termination of the agreement. On the facts, we do not find that in the execution and performance\n\n  of the management agreement, SIAA was the alter ego or the agent of the Association.122 Finally I should also discuss two English decisions in which the corporate\n\nveil was lifted. The first isGilford Motor Co Ltd v Horne[1933] 1 Ch 935. The defendant,\n\nHorne, was the managing director of the plaintiffs (\"Gilford\") until 1931. Gilford wanted\n\nHorne to leave and the parties settled, with Horne tendering his resignation and being paid a lump\n\nsum in 3 instalments. There was a non-solicitation covenant in Hornes employment contract. After\n\nhe left Horne immediately started trading and solicited Gilfords customers, but quickly realised\n\nhe was in breach of the covenant. In order to get around it, he incorporated a small company in\n\nwhich his wife held 101 shares with another 101 shares held by one Howard, a former employee of\n\nGilford who was later employed by the company. Mrs Horne and Howard were the only directors of the\n\ncompany. The registered office was Hornes home. Farwell J found that the business of the company\n\nwas carried out wholly by Horne. The English Court of Appeal found that the company was mere cloak\n\nor sham, a mere device to enable Horne to commit breaches of the covenant.123 The second decision is that of Russell J inJones v Lipman[1962] 1 WLR 832. The first defendant had entered into a written agreement to sell land to the plaintiffs for\n\n5,250. However pending completion the first defendant sold and transferred the land to the second\n\ndefendant, a company, for 3,000. The company had a nominal share capital of 100 and its only\n\nshareholders and directors were the first defendant and a clerk employed by his solicitors. The sale\n\nwas financed by a bank loan of 1,564 taken out by the company with the balance shown as a debt by\n\nthe company to the first defendant. The plaintiffs sued the first defendant and the company for\n\nspecific performance.124 Counsel for the defendants admitted that the company was under the complete\n\ncontrol of the first defendant and the sale by him to the company was carried out solely for the\n\npurpose of defeating the plaintiffs rights to specific performance. After citingGilford Motor\n\nv Horne, Russell J said at p. 836:Those comments on the relationship between the individual and the company apply\n\n  even more forcibly to the present case. The defendant company is the creature of the first\n\n  defendant, a device and a sham, a mask which he holds before his face in an attempt to avoid\n\n  recognition by the eye of equity. The case cited [i.e.Gilford Motor v Horne] illustrates\n\n  that an equitable remedy is rightly to be granted directly against the creature in such\n\n  circumstances.It should be noted that Russell J was of the view that this was such a clear case\n\non the facts that he granted summary judgment even though this ordinarily would have gone to trial.125 It can be seen from the last two cases that where a company is a cloak or\n\nsham to avoid the legal obligations of a party to the plaintiff, the court will lift the veil of\n\nincorporation. But if, as inAdams v Cape Industries, no legal obligation was involved, but\n\nwas merely a situation where the purpose of the arrangement was to achieve an objective that did not\n\ninvolve fraud or impropriety, the court would not lift the veil. InAdams v Cape Industries,\n\nthe objectives of the arrangement were so that Cape would not have its name linked with asbestos\n\ntrading and that Cape would avoid exposure to litigation in the USA. InWin Line, the second\n\ndefendant was even legally obliged to a third party not to trade with other parties. Yet the court\n\nthere found as a fact that it was not a sham. It is likely that the court considered that there was\n\nno legal obligation on the part of the second defendant towards the plaintiff shipping company that\n\nwas sought to be evaded by the arrangement. A similar view was taken by Morritt V-C inTrustor AB\n\nv Smallbone & Ors.CONCLUSION126 At its core, the present case relates to a situation where two businessmen,\n\nAlex Ling and Philip Ling, had engaged in arms length negotiations with Gispen, one of the receivers\n\nof UDG, over the sale of DTL. Gispen is a Dutch lawyer and an experienced receiver. The Defendants\n\noffered certain terms for the purchase of DTL, which included an immediate advance of US$4.2\n\nmillion. Another term was that an offshore company would be used as the vehicle for the purchase.\n\nGispen accepted those terms. The Agreement was drawn up by the Defendants lawyers and approved by\n\nGispen before he signed it on behalf of himself and as proxyholder of Rootselaar. The Receivers were\n\naware that Concorde was a shelf company. It was also stated in the Agreement that Concorde was\n\nincorporated in the Isle of Man. There was no attempt by the Defendants to deceive the Receivers as\n\nto the nature or personality of Concorde. The Defendants say that Gispen was at that stage desperate\n\nto close the deal because the deadline for payment of the US$4.2 million to the Guyanese government\n\nwas due in a few days and that was why he was prepared to accept Concorde. The Plaintiffs contend\n\nthat Gispen was under no such pressure because Primegroup was also poised to close the deal, and\n\nmoreover Credit Lyonnais was prepared to provide the bridging finance if necessary. I accept the\n\nPlaintiffs contention but I am not sure if this makes their case worse. If Gispen was under no\n\npressure to close the deal, then all the more he should have refused to accept Concorde as the\n\npurchaser or asked for some form of guarantee to be included in the Agreement. The interposition of\n\nConcorde was not for the purpose of escaping any existing obligations of the Defendants to the\n\nPlaintiffs nor to anyone else but to limit the liabilities of the other players, which include\n\nSouthseas and Polynesia. If Gispen had been concerned that Concorde was not a substantial company,\n\nit was open to him to express those concerns and ask for some form of guarantee. This would require\n\nthe Defendants to make a conscious decision on the issue.Prima facieConcorde was the party\n\nto the contract and if Gispen wanted anything more, surely the onus ought to be on him in the\n\ncircumstances to request that it be put in writing. I do not think that the Defendants, in putting\n\nin place this deal, ever contemplated that they would be putting themselves on the line, so to\n\nspeak. And I suspect neither did Gispen.127 Those are the main features of the case, although I have taken into\n\nconsideration all the other relevant factors. In the circumstances of the case, I cannot see any\n\nreason nor authority for lifting the corporate veil to make the Defendants liable for the\n\nliabilities of Concorde. The words of the Court of Appeal inMiller Freeman Exhibitions Pte Ltd v\n\nSingapore Industrial Automation Associationare particularly apposite (at 23):23 The Association had utilised the corporate structure by setting up a company\n\n  in order to limit its liability and risk. The law gives it a right to do so. True it is that SIAA\n\n  was a two dollar company and probably even now is not a substantial company; but this must have\n\n  been known or should have been known to the appellants, and despite having had such notice the\n\n  appellants, on their own free will, decided to do business with SIAA.128 The institution of limited liability has served a very important economic\n\nfunction and this is too well known to require elaboration here. The principle inSalomon v A.\n\nSalomon & Co Ltdhas been established for over a century and business people have since\n\ntransacted on that basis. To make the Defendants personally liable in the present case, where there\n\nis no fraud or impropriety, would turn that principle on its head. It would make it impossible for\n\nanyone in abona fidetransaction, where he intends to use a shelf company as a vehicle and\n\nwhich fact is known to the other party, to be certain as to whether he or his principal would\n\neventually be made liable for the performance of the contract entered into by the shelf company. I\n\ncannot see any support in the authorities, nor any reason from the point of view of business\n\nefficacy or even fairness, to lift the corporate veil and make a departure from the well-entrenched\n\nprinciple inSalomon v A. Salomon & Co Ltdin the circumstances that obtain in the\n\npresent case.129 For the reasons that I have given, the Plaintiffs claims are dismissed. I\n\nwill hear counsel on the question of costs.Sgd:LEE SEIU KINJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}