{
    "case_title": "Gunapathy Muniandy v James Khoo and Others",
    "ncitation": "[2001] SGHC 165",
    "coram": "G P Selvam J",
    "sections": {
        "Because he explained to us on the normal brain, like you can see all\n\n  the scar, you know, the brain, they have all the different, we have, thing, and her brain\n\n  was like this, you know, like very smooth, like this, like a balloon, you know. I mean,\n\n  you have all those threads, whatever, I mean, her brain was like so---like flesh, very\n\n  like---": "Like a balloon, you know, I can tell you. It was very strange, I mean.Q Did you all ask Dr Prem Pillay or did he advise you that you\n\n  could---can he control, is there other---other from surgery, could you have done by\n\n  medication?A He told us, I mean, at this stage, now, I mean, if you just leave it\n\n  as it is now, I mean, he said this can be quite---pretty bad, you know, so he told us I\n\n  think the best is to go for operation to relieve the pain. It’s not to cure, but just\n\n  to relieve the pain, because it was so painful, at least to make her a bit better, you\n\n  know, to, I mean---.Q Now, witness, your wife was complaining of headache, and before this\n\n  final where a lot of family members were there, you had seen Dr Prem Pillay together with\n\n  your wife before this?A No, because I just arrived from overseas, and the next day I went to\n\n  see with all---my brother-in-law went to see Dr Pillay, because he wanted to see me, me\n\n  personally, and explained to us what’s going on, and asked us to give him an answer,\n\n  I mean, about the things. So we went out, outside, and we just talked for hours, we came\n\n  back and we said, OK, we---I mean, because he said better don’t wait, I mean\n\n  it’s quite urgent. Had to do it very urgently.[NE 169-170]23.11.The inference of what has been related is that Gunapathy and her\n\nkin had no other option but to ask Dr Prem Pillay to remove the necrotic tissues and\n\n\"deflate the balloon\" inside her cranium. The radionecrosis and the oedema\n\ncaused the same kind of extreme suffering a malignant overgrown tumour would have. This\n\nwas not a case where Gunapathy could reasonably be expected to suffer the agony any\n\nlonger. In any event much of the permanent damage had been done in that her internal\n\ncapsule had been damaged. Dead neurons do not regenerate. They do the opposite. They\n\ndestroy other viable neurons. The inflated brain had to be deflated. There was no other\n\npractical option. Continued steroid treatment was not a practical option. Dr Karlsson had\n\nseen patients die of radionecrosis caused by radiosurgery. Dr Tsao had seen patients die\n\nbecause of prolonged administration of corticosteroid. Gunapathy, as Mr Michael Khoo SC\n\nput it, was between the devil and the deep blue sea and in extreme agony. There was no\n\nother option but to remove the necrotic tissue – palliative though it was. There was\n\ntherefore objective as well as subjective justification for Dr Prem Pillay’s\n\ninterventional surgery. After that she was in a much better condition. It did not worsen\n\nher condition at any rate.The disabilities23.12.The result of the radiation damage done to her brain was immense\n\nand intolerable agony for Gunapathy. Now, when she walks she walks with a grotesque gait.\n\nSo she avoids walking. She uses a wheelchair with the help of a maid. Her own hands cannot\n\neven push it. The few words she utters she utters as though she was born with a birth\n\ndefect like cerebral palsy. She is not even half the lively person that everyone said she\n\nwas before the radiosurgery. She is crippled by severe dysphasia and right-sided severe\n\nhemiparesis. This happened when she was on the ascent of a promising career as the chief\n\nexecutive officer of a service providing company connected with a construction industry.\n\nShe needs to be permanently cared for because her deficits are permanent. Emotionally she\n\nis insecure in the extreme. The radiosurgery is the direct cause of all these\n\nconsequences. According, the law must compensate her.Chapter 24 : The Damages24.1.I now turn to the question of damages. Gunapathy was the managing\n\ndirector of Haneda Services Pte Ltd until the end of 1997. The company in effect was a\n\nquasi-partnership and she was the precedent partner. She was proficient in the Japanese\n\nlanguage. The activities of Haneda Services and other companies in the group were\n\nconnected with Japanese construction companies. The activities of the group to a great\n\nextent depended on her for she provided the force and fuel for the company to prosper. She\n\nhad spent much time in Japan clinching business deals and establishing business ties.24.2.In 1995, 1996, 1997 and 2000 the financial high-lights relevant to\n\nthis case were as follows :YearProfit/LossDirectors Remuneration FeesDirectors1995$19,312$222,218$160,0001996$581,838$241,920$310,0001997($115,175)$207,360$330,0001998($301,168)$207,360$ 10,00024.3.The profits or the losses were arrived at after charging the\n\ndirectors remuneration and fees. If they are charged back (added to the profits or losses)\n\nthe position would have been as follows :1995$ 401,530profits1996$1,133,758profits1997$ 422,185profits1998($ 83,808)(loss)The above does not include the CPF payments.24.4.It was the evidence of Gunapathy’s brother that because of\n\nher disabilities the company lost much of its existing business, as well as additional\n\nbusiness that was in the pipeline. The company will not recover its business because it\n\nhas lost her services and talent. \"Following the departure of my sister as managing\n\ndirector, the business of Haneda Services declined as the company had difficulties in\n\nprocuring fresh ventures and maintaining links with our clients\", was his evidence.24.5.There was evidence to the effect that in 1998 she was paid $86,400\n\nand in 1999 she was paid $57,600. Although this was called \"salary\", it was in\n\nfact not so because she ceased to work. That is understandable because in a family private\n\ncompany such a course of action is neither reasonable nor unusual. It is also not unusual\n\nin such a company to award special bonuses to the MD who brings in the business and\n\nprofits. The payments obviously were meant to help her out during the difficult period she\n\nwas going through.24.6.The company’s three shareholders were :Gunapahhty33,334 sharesRamakrishnan (brother)33,333 sharesGopal (brother)33,333 shares24.7.The plaintiff’s real income was directly linked to the\n\nrevenue and profits of the company. Her real financial loss of earnings therefore was\n\ninevitably and inextricably related to the loss of the entire company.24.8.Having stated the source of her income I shall now consider\n\nGunapathy’s claims.Medical and other expenses24.9.This was agreed at $50,000.Pain and suffering24.10.Gunapathy claimed damages for pain and suffering and loss of\n\namenities. The damages under this head are at large. It is assessed on the basis of what\n\nwould be a fair compensation. In assessing damages under this head it is customary to be\n\nguided by previous awards in like cases. At the same time previous awards are not treated\n\nas statutory tariffs. In this regard, the Court inTan Joon Heng v Thiam Boon Kiap\n\n& Anor[1989] BLD Yearbook 681 cited and discussed inPeh Diana &\n\nAnother v Tan Miang Lee[1991] 3 MLJ 375awarded $100,000 for pain, suffering and\n\nloss of amenities. The plaintiff in that case had right hemiplegia and head injury. That\n\nwas in 1987. In the present case, Gunapathy has suffered greater agony and for a longer\n\ntime. Accordingly, to award anything less than $100,000 would be egregiously low. So I\n\naward $100,000.Loss of earnings24.11.Gunapathy calculated her average monthly income at $12,180\n\n($146,171.36 annual). This was the average of her gross income from 1993 to 1997, after\n\ndeducting income tax. This was generous to the defendants because in computing average\n\nincome it is usual to calculate the average of the previous three years. That would have\n\ngiven a yearly average of $183,000 or $15,250 per month. The amounts received by her as\n\n\"salary\" after 1997 must be taken as a loan. Accordingly I award $511,560 as\n\npre-judgment loss of earnings ($12,180 x 42 months – January 1998 to June 2001). Loss\n\nof future earnings should be based on a multiplier of 11 years at $146,171.36. She is 41\n\nyears old now. This gives $1,607,884.96.24.12.Gunapathy asked for CPF contributions on future loss of earnings\n\nat $13,824 per year. She is entitled to it and I therefore award $152,064 under that head.24.13.In addition I award $100,650 for past and future domestic care as\n\nclaimed at $550 per month.24.14.Finally I allow her $33,000 for future medical care as claimed.Sgd:GP SELVAMJUDGECopyright © Government of Singapore."
    }
}