{
    "case_title": "Public Prosecutor v Muhammad Ali Hashim and Others",
    "ncitation": "[2001] SGHC 78",
    "coram": "MPH Rubin J",
    "sections": {
        "Prosecution evidence": "3 The prosecutions evidence against all three accused comprised in the main in\n\nthree segments, ie (a) the evidence of Raymond Quattlander (PW-3) (Ray), an undercover agent\n\nattached to the US Drug Enforcement Agency (DEA) who spearheaded a sting operation resulting in the\n\narrest of all three accused persons. [In relation to this segment the prosecution produced several\n\naudio and video-tapes and their transcripts, recording the conversation between Ray, the first\n\naccused and second accused on 6 April 2000 in connection with the drug deal as well as the delivery\n\nof two suitcases (exhs P-52 and P-53) by the first accused where the offending drugs were\n\nconcealed);] (b) an agreed statement of facts substantially gleaned from the preliminary inquiry\n\nstatements of some 39 witnesses, most of whom were involved in the surveillance and the arrest of\n\nthe accused persons; and (c) the evidence of the investigating officer as well as an Urdu language\n\ninterpreter who assisted the investigating officer in recording statements from the accused persons.4 Insofar as is material, the evidence of Ray could be summarised as follows.5 Ray had been a special agent in the employ of the DEA in New York City, New\n\nYork, USA. Sometime in June 1999, he was assigned to act in an undercover operation for negotiating\n\nthe purchase of a quantity of heroin from the first and second accused. In the event, contact was\n\nmade by the DEA with them and soon Ray left New York for Singapore for the drug transaction.\n\nAlthough other venues were suggested by Ray to them to conduct the anticipated deal, Singapore was\n\nchosen by the first and second accused. Consequently, on 5 April 2000 he set out for Singapore to\n\nassist the DEA Singapore country office in collaboration with Singapore Central Narcotics Bureau (CNB)\n\nin this joint operation.6 Rays role in this operation was to feign as the head of a major\n\ninternational heroin syndicate based in New York. His arrangement was to purchase two kilograms of\n\nheroin (No. 4) for US$120,000 in cash and another 3 kilograms on consignment.7 After Rays arrival in Singapore on 6 April 2000, the first accused who was\n\nby then in Singapore contacted him. Later, the first and second accused met Ray at about 5.00pm on 6\n\nApril 2000 at River View Hotel, Singapore. Another DEA Special Agent, Kimberley Elliot (Elliot)\n\npretending to be the woman friend of Ray was also present. Ray, at this point of time was fully\n\nwired and had a concealed micro-audio device on him to record the conversation between him and\n\nothers. Then as Ray, Elliot, the first accused and the second accused were seated at a table at the\n\nground level caf, Ray opened a small bag which was kept inside a backpack held by Elliot and\n\nshowed briefly to the first and second accused the wad of US currencies amounting to US$120,000\n\nstacked inside the bag. Soon Elliot departed from the caf.8 At about 5.10pm, Ray invited the two of them to his room at River View Hotel to\n\ndiscuss business in private. They all then trooped into Rays room where they engaged themselves\n\nin a long and rambling discourse on the proposed sale of 5 kilograms of heroin by the two accused to\n\nRay. Their entire conversation punctuated by two intervals ie from 5.10pm to 5.50pm (between the two\n\naccused and Ray), from 10.10pm to 10.30pm (between the first accused and Ray) and later from 10.48pm\n\nto 11.34pm (between the first accused and Ray) was captured by a secret video recording device\n\ninstalled in Rays hotel room as well as by an audio device concealed within the clothes worn by\n\nRay. The conversations thus taped  both audio and video - were replayed in court. The transcripts\n\nof the relevant portions of the tapes would be referred to later in this grounds.9 According to Ray, whilst all three were in his hotel room, he was told by them\n\nthat the heroin to be supplied to him were concealed in suitcases in an extremely sophisticated\n\nmanner. He was warned that once the heroin was exposed for inspection, it would be impossible for\n\nthe luggage in which the drugs were hidden to be restored to its original state. Ray persisted. In\n\nthe end, it was agreed that Ray would take delivery of 5 kilograms of heroin (although the original\n\nplan was for only 2 kilograms) and the price to be paid was US$300,000  US$120,000 initially and\n\nthe balance to be remitted later. It was also agreed between them that the heroin to be sold would\n\nbe shown to Ray later that evening. According to Ray, his two visitors discussed the sale of 5\n\nkilograms of heroin to Ray in earnest.10 Soon, both the first and the second accused departed the hotel room at about\n\n5.53pm. Later that evening at about 8.02pm, the first accused returned to see Ray in his room\n\nwithout any suitcases. He presently informed Ray that he had brought with him a sample for testing.\n\nIn the event, the sample was tested and it was found to be heroin. All the same, Ray made it clear\n\nto the first accused that the latter should return with the suitcases that contained heroin to\n\nconclude their business. The first accused who left Ray at about 8.11pm returned later at about\n\n10.09pm with two suitcases.11 The first accused then attempted to open the suitcases but they were found\n\nlocked and he had no keys with him to open them. As a result after making a telephone call to\n\nsomeone (who was later identified the third accused) he left Rays room briefly to obtain the\n\nkeys. The arrangement was that the third accused would bring the keys to the suitcases to the hotel\n\nand hand them to the first accused at the hotel lobby.12 At about 10.45pm, the third accused made his appearance and after giving a\n\nbunch of keys to the first accused left the place by the same taxi.13 Later at about 10.48pm, the first accused and Ray returned to Rays room.\n\nThe suitcases that were brought were opened. Ray found them to be empty but emitting an odour of\n\nmothballs. The first accused pointed to the sides of the suitcases and stated that the heroin was\n\nconcealed along the walls of the suitcases. Both of them, in the event, tried to locate it. Ray told\n\nthe first accused to cut open the lining of the suitcases which the latter did but was not able to\n\nlocate any drugs. Consequently, the first accused called the second accused using Rays mobile\n\nphone to inquire the whereabouts of the heroin.14 Whilst the first accused was waiting for the second accused to come up with an\n\nanswer, he told Ray that one of the suitcases contained about 1,300 grams of heroin and the other\n\nabout 3,200 grams.15 A short while later, Rays telephone rang. Ray who first answered the phone\n\npassed it to the first accused. After speaking to the second accused, the first accused conveyed to\n\nRay that the drugs were compressed against the walls of both suitcases. The first accused and Ray\n\nthen scraped the walls of the suitcases and discovered powder - flakes along the suitcase walls. Ray\n\ntested the powder for heroin and it proved positive. Thereafter, the suitcases were closed. Ray\n\ndirected the first accused to pick up the suitcases and accompany him to the lobby, stating that\n\nupon the first accused handing over the suitcases to his courier (referring to Elliot) he would\n\nreceive payment.16 At about 11.34pm the first accused and Ray left the hotel room for the hotel\n\nlobby; the first accused was carrying both the suitcases. Once in the lobby, Ray left him after\n\nadvising him to wait at the lobby for Elliot. Ray had with him the micro-audio recording device\n\nwhich was employed to record Rays conversation with the first and the second accused that\n\nevening.17 On 7 April 2000, Ray handed over to one Todd Davidson of the US Embassy in\n\nSingapore, the audio-cassettes which recorded the conversations alluded to. It is pertinent to add\n\nhere that Agent Elliot substantially corroborated the evidence of Ray in relation to the meeting at\n\nthe lobby, prior to Ray and the two accused left for a discussion in Rays room.18 The next segment of the prosecution evidence was contained in a statement of\n\nagreed facts submitted in accordance with s 376(1) of the CPC (Cap 68) by the prosecution and\n\ncounsel for all the accused. The said statement sketched out the events which transpired on 6 April\n\n2000, the movement and interaction between the accused persons including the third accused, the\n\nseizure of exhibits, the raid conducted at the respective rooms of the accused persons, their\n\nmedical examination, scientific analysis of the drugs seized, the setting up of audio-visual device\n\nat the River View Hotel which captured the conversation between Ray, the first accused and the\n\nsecond accused live and a few other details. Insofar as is material the said statement of agreed\n\nfacts reads as follows:Activities of the first and second accused1. On 6.4.2000, the first accused arrived at the River View Hotel at about 5.05\n\n  pm. He was accompanied by the second accused, and one Ray. They were seen meeting a female\n\n  Caucasian. After the meeting, the first and second accused accompanied Ray to Rays hotel room,\n\n  number 1711 in River View Hotel.2. At about 5.55 pm, the first and second accused left River View Hotel, and\n\n  took a taxi, SHA 511 C, to Hotel Grand Central. They arrived at Hotel Grand Central at about 6.10\n\n  pm. They then took a lift up to Hotel Grand Central.3. At about 7.55 pm, the first accused left Hotel Grand Central, boarded a taxi\n\n  (SHA 7355 A) and travelled to River View Hotel. At about 8.05 pm, the first accused was seen\n\n  arriving at River View Hotel. At about 8.15 pm, the first accused left River View Hotel aboard\n\n  taxi SHA 9614 U; he arrived at Hotel Grand Central at about 8.30 pm and entered Hotel Grand\n\n  Central.4. At about 9.30 pm, the first accused left Hotel Grand Central and walked to\n\n  Centrepoint Shopping Centre. Outside Centrepoint Shopping Centre, the first accused met the third\n\n  accused. The third accused had with him two dark coloured suitcases. The first accused took the\n\n  two suitcases from the third accused and they parted ways.5. Meanwhile, the first accused hailed a taxi at Cavenagh Road. The first\n\n  accused took taxi SHB 3611L to River View Hotel, arriving at about 10.10 pm. He then went up to\n\n  Room 1711 of River View Hotel.6. At about 10.30 pm, the first accused and Ray were at the lobby of the River\n\n  View Hotel. At about 10.45 pm, the third accused arrived, and met the first accused. The third\n\n  accused handed to the first accused a bunch of keys. The third accused left shortly after. The\n\n  first accused then returned to Room 1711 River View Hotel with Ray.7. The first accused was arrested at about 11.40 pm at the lobby of River View\n\n  Hotel. At the time of his arrest, he had with him the two suitcases, which he had brought to River\n\n  View Hotel earlier.8. The second accused was arrested at about 12.25 am, on 7.4.2000, in his hotel\n\n  room, number 340, at Hotel Grand Central.Activities of the third accused9. On 6.4.2000, at about 1 pm, the third accused was having his lunch at the\n\n  Kopitiam foodcourt at Meridien Hotel. He returned to his hotel, Hotel Supreme, at about 1.05\n\n  pm.10. At about 4.40 pm, the third accused left Hotel Supreme, carrying two white\n\n  plastic bags and a black paper bag. He went to a shop at Orchard Plaza, Uncle Sim Luggage Shop.\n\n  He then left the shop empty-handed.11. At about 5.30 pm, the third accused boarded a bus, SBS service number 106,\n\n  at Orchard Road, and travelled to Serangoon Plaza.12. After window-shopping at Serangoon Plaza, he took a taxi, SH 1912, back to\n\n  Hotel Supreme, arriving at about 6.40 pm. He walked towards Orchard Plaza, and returned to the\n\n  luggage shop. He left the luggage shop carrying a travel bag, and returned to Hotel Supreme with\n\n  it at about 6.55 pm. At about 9.30 pm, the third accused left Hotel Supreme with two dark coloured\n\n  suitcases. He walked to Centrepoint Shopping Centre. At about 9.35 pm, the third accused met the\n\n  first accused, with whom he had a short conversation. The two parted, with the first accused\n\n  carrying away the two suitcases the third accused had brought with him.13. At about 9.45 pm, the third accused returned to Hotel Supreme.14. At about 10.20 pm, the third accused left Hotel Supreme, walked towards\n\n  Centrepoint Shopping Centre, and boarded a taxi SHA 6686G. He travelled in that taxi to River View\n\n  Hotel, arriving there at about 10.45 pm. The third accused met the first accused at the lobby of\n\n  River View Hotel and handed a bunch of keys to the first accused. After that, the third accused\n\n  left River View Hotel and boarded the same taxi that had brought him there. At about 10.50 pm, the\n\n  third accused was arrested in his taxi at the junction of Orchard Boulevard and Paterson Road.Seizure and raid15. On 7.4.2000, shortly after 12.25 am, a party of officers seized various\n\n  items belonging to the second accused after his arrest in Room 340, Hotel Grand Central.16. At about 2.30 am, the third accused accompanied a group of CNB officers to\n\n  his hotel room, number 207, at Hotel Supreme. A number of items were seized by the officers.17. At about 3.10 am, the first accused accompanied a group of CNB officers to\n\n  his hotel room, number 602, at Starlet Hotel. A number of items were seized by the officers.19. The items seized from all three accused persons after their arrest were\n\n  subsequently handed over to the Investigation Officer, ASP Fan Tuck Chee.Medical examinationFirst Accused18. On 7.4.2000, at about 4.40 am, the first accused was at Alexandra Hospital,\n\n  having been brought there by an escort of CNB officers. The first accused was examined by a\n\n  doctor. In the medical examination, the first accused denied having any injuries. The examining\n\n  doctor found no injuries on the first accused. The first accused then left the hospital under\n\n  escort at about 6.10 am.19. At about 7.15 am, the first accused was at Alexandra Hospital, again having\n\n  been escorted by CNB officers. The first accused was examined by a doctor. The first accused\n\n  denied having any injuries or complaints. The examining doctor found no injuries on the first\n\n  accused. The first accused left the hospital under escort at about 8.15 am.Second Accused20. At about 4.35 am on 7.4.2000, the second accused was at Alexandra Hospital,\n\n  escorted by a group of CNB officers. The second accused was examined by a doctor. The second\n\n  accused denied that any injury had been caused to him. In the medical examination, the doctor\n\n  found that the second accused had superficial abrasions on the right collar bone and right arm.\n\n  The second accused then left the hospital together with the CNB officers at about 5.55 am.21. At about 8.30 am, the second accused was again at the Alexandra Hospital,\n\n  accompanied by CNB officers. He was examined by a doctor, who did not find any further injuries.\n\n  The second accused denied being injured.Third Accused22. At about 6.15 pm on 7.4.2000, the third accused was escorted by CNB\n\n  officers from CID to Alexandra Hospital, where they arrived at about 6.30 pm. There the third\n\n  accused was examined by a doctor. In the examination, the third accused denied having any injuries\n\n  or complaints. The examining doctor found no injuries on the third accused. At about 6.40 pm, the\n\n  third accused was escorted to MIB at CNB, where they arrived at 6.50 pm.23. At about 8.40 pm, the third accused, under escort by CNB officers, was\n\n  taken from MIB to Alexandra Hospital, where he arrived at about 8.55 pm. The third accused was\n\n  examined by a doctor. In the examination, the accused denied having any injuries or complaints.\n\n  The examining doctor found no injuries on the third accused. The third accused was escorted back\n\n  to CID at about 9.30 pm, and arrived at CID at about 9.45 pm.Seizure and analysis of the drugs24. Upon their arrest, on 7.4.2000 all three accused persons were brought back\n\n  to the Major Investigation Branch (MIB) of the Central Narcotics Bureau, together with the two\n\n  suitcases that were seized from the first accused.25. At MIB, CNB, in the presence of all three accused persons, the 2 suitcases\n\n  were opened and the inner lining of the suitcases were chiselled away. A white granular substance\n\n  believed to be heroin was found concealed in the sides of both suitcases.26. The white granular substance found in the black Goldcrown suitcase\n\n  was packed into 2 plastic bags and marked A1a and A2a. The white granular substance\n\n  found in the blue Bless suitcase was packed into 1 plastic bag and marked B1a.27. On 10 April 2000, contents in A1a, A2a and B1a were sent\n\n  to the Department of Scientific Services (DSS) for analysis. On 10 July 2000, the DSS certificates\n\n  pertaining to the analysis of A1a, A2a and B1a were collected by the CNB. The\n\n  results of the analysis are as follows:a. The contents of A1a were found to contain 2182 grams of damp\n\n    granular substance. The damp granular substance was dried, pulverised and homogenised into a\n\n    powdery substance. The powdery substance was analysed and found to contain not less than 1628\n\n    grams of diamorphine, at a confidence level of 99.9999%;b. The contents of A2a were found to contain 1671 grams of damp\n\n    granular substance. The damp granular substance was dried, pulverised and homogenised into a\n\n    powdery substance. The powdery substance was analysed and found to contain not less than 533.0\n\n    grams of diamorphine and other substance not related to these proceedings.c. The contents of B1a were found to contain 1021 grams of damp\n\n    granular substance. The damp granular substance was dried, pulverised and homogenised into a\n\n    powdery substance. The powdery substance was analysed and found to contain not less than 710.2\n\n    grams of diamorphine, at a confidence level of 99.9999%.Setting up of audio-visual equipment28. On 6.4.2000, DEA Special Agent Larry Sproat installed a concealed\n\n  audio/video device in Room 1711 of River View Hotel. Monitoring equipment consisting of a\n\n  television monitor, videocassette recorder, receiver and antenna, was set up by him in Room 1712.\n\n  The equipment was maintained by DEA Special Agent Larry Sproat until after the arrest of the first\n\n  accused.Testing of urine samples29. The three accused persons provided urine samples after their arrest, which\n\n  were analysed by the Department of Scientific Services (DSS). The analysis by DSS showed that the\n\n  urine samples of all three accused persons were negative for morphine, amphetamine,\n\n  methamphetamine and 11-nor-delta-9-tetrahydrocannabinol-9-carboxylic acid.The above facts are not disputed and are agreed upon between the Prosecution\n\n  and Defence pursuant to section 376(1) of the Criminal Procedure Code (Cap 68).19 The next segment pertained to the evidence of the investigating officer and\n\nthe Urdu language interpreter who assisted him in recording statements from the accused persons.20 ASP Fan, the investigating officer in this case testified that at about\n\n11.20pm on 6 April 2000 he took custody of the third accused (who was arrested at about 10.50pm by a\n\nteam of CNB Officers). At about 12.05am on 7 April 2000, he took custody of the first accused who\n\nwas arrested at about 11.40pm on 6 April 2000 by another team of CNB operatives at River View Hotel\n\nLobby with two suitcases. At about 12.50am on 7 April 2000 he was given custody of the second\n\naccused who was arrested by another team of CNB officers at about 12.25am that morning.21 In the event, whilst all the three accused were present at the Major\n\nInvestigation Branch (MIB) of the CNB, ASP Fan chiselled the interior of both suitcases and found in\n\nthem a substantial amount of heroin. Later after taking photographs of the suitcases and the heroin\n\nfound therein, the investigating officer weighed it. Subsequently, after the formalities in relation\n\nto the raid of the accused persons hotel rooms, their urine tests and sending some of them for\n\nmedical examination had been completed, he secured the drugs in his office cabinet.22 ASP Fan added that in the course of his investigation, several statements were\n\nrecorded from the accused persons. Insofar as is relevant, the prosecution sought to admit\n\naltogether three statements recorded from the first accused, two recorded on 13 April 2000 and one\n\non 15 April 2000. The prosecution also sought to admit two statements from the third accused  one\n\nrecorded on 10 April 2000 and the other on 11 April 2000. After being informed that there was an\n\nobjection on behalf of the first accused as to the voluntariness of his three statements, a trial\n\nwithin a trial was conducted to determine their admissibility. As far as the third accused was\n\nconcerned, there was an objection by his counsel only as to the voluntariness of his second\n\nstatement. As a result, a trial within a trial was also held to determine the admissibility of the\n\nthird accuseds second statement.",
        "Trial within a trial as respects the first accused": "23 The issue in this trial within a trial concerned three investigation\n\nstatements marked for identification as P-47, P-48 and P-49.24 ASP Fan in his testimony asserted that neither before nor during the recording\n\nof any of the statements the first accused was subjected to any form of threat or inducement or\n\npromise for him to make the statements. ASP Fan further testified that all the three statements\n\nrecorded from the first accused were given voluntarily by him.25 The other prosecution witnesses Sgt Stanley Tan and S/S/Sgt Patrick Thng Joo\n\nSeng in their evidence denied any knowledge of any deal for co-operation between ASP Fan and the\n\nfirst accused. S/Sgt Patrick Thng was somewhat ambivalent in regard to the time the first accused\n\nhad lunch with ASP Fan. He also retracted a segment of his earlier evidence where he had claimed\n\nthat on 15 April 2000 he escorted the accused back to the lock-up (page 1058 of the NE). His pocket\n\nbook entries were also found to be incomplete (pages 1060 to 1063 of the NE).26 The first accused in his evidence denied that the statements sought to be\n\nadmitted were given by him voluntarily. His evidence in the main can be summarised as follows.27 After his arrest at about 11.45pm on 6 April 2000, ASP Fan proceeded to record\n\nfrom him a cautioned statement at about 6.20am on 7 April 2000. However, when the charge preferred\n\nagainst him was read and explained to him he realised that he was facing the consequences of a death\n\npenalty. As a result, he became sick, started feeling dizzy, suffered a headache and could not think\n\nproperly. Presently, he made a statement to Insp Fan in the following terms: I am not feeling\n\nwell and my mind is not able to think. So I cant talk now.",
        "The first statement P-47": "28 Consequently, on 13 April 2000 he was taken to ASP Fans room for the\n\npurposes of recording a statement. No one else except ASP Fan and he were in that room. At the\n\noutset, ASP Fan told him to make a statement. The first accused replied:I dont expecting\n\n(sic) any drugs. ASP Fan then remarked that they, meaning CNB, knew everything and they were\n\nwatching and listening to everything and that nobody would believe the first accuseds\n\nprotestations. Faced with this retort, the first accused asked ASP Fan how the latter could help\n\nhim. ASP Fans immediate response was that the first accused should give the CNB a good statement\n\nand co-operate with them and if he did the first accused would be offered a different charge, a\n\nlenient sentence and would not have to suffer a death sentence. The first accused understood the\n\nwords of ASP Fan to mean that if he were to give a good statement to CNB, he would get a\n\nlenient sentence and escape the death penalty.29 Following the foregoing understanding, the first accused gave ASP Fan a\n\nstatement. Whilst the recording was in train, the first accused on his own asked ASP Fan a few times\n\nabout help to which ASP Fan replied: Give me a good statement, I will help you. The first\n\naccused added that the co-operation alluded to was in reference to devising a set-up for one Faribourg\n\nof Sweden to be apprehended in Singapore. He reieterated that he gave a statement to ASP Fan that\n\nevening because the latter promised to give him another charge to avoid death penalty (page\n\n1077 of the NE). The recording of the statement (P-47) on this occasion ended at 5.25pm.",
        "The second statement P-48": "30 The first accused was taken again to the room of ASP Fan at 7.45pm on 13 April\n\n2000 for the purposes of recording yet another statement. ASP Fan read to the first accused what was\n\ntaken from him earlier that evening.31 The first accused didnt want it to be read back to him for he knew what was\n\nin it. ASP Fan then asked the first accused to commence his second statement. According to the first\n\naccused: I asked him the same thing about my health (sic). He told me, you give a good statement,\n\nI help you (page 1079 of the NE). The first accused added that ASP Fan then told him: I will give\n\nyou a different charge that wont get you death penalty. There then followed the recording of\n\nthe second statement. During this recording too, the first accused asked ASP Fan to help him. The\n\nreply from ASP Fan was: You help me, I help you. (page 1080 of the NE). During the recording\n\nof the second statement, there was a coffee break. The atmosphere was friendly. The subject of the\n\naccuseds help and co-operation in getting Faribourg of Sweden to visit Singapore was raised\n\nagain. After break, the recording continued in the same vein as before.",
        "The third statement P-49": "32 On 15 April 2000 at about 11.45am, the first accused was again taken to the\n\nroom of ASP Fan. When ASP Fan tried to read to the first accused the statements recorded by him\n\nearlier, the first accused did not want them to be read. As a result, the previous statements were\n\nnot read back to him.33 At the commencement of this third statement (P-49) once again, the first\n\naccused raised the same questionabout [his] health(page 1085 of the NE). He told ASP\n\nFan:I am giving you this statement, you promise me to help me. ASP Fan replied:You\n\ngive good statement, I will help you. On this occasion, ASP Fan did not tell him how he would\n\nhelp him but on the previous occasions, he had already told him that he would arrange for a\n\ndifferent charge to be preferred against him so that the first accused would not get the death\n\nsentence (page 1086 of the NE).34 When the recording was in progress, the first accused asked ASP Fan again: You\n\nwill help me? ASP Fan responded: Yes Ill help you, you give me a good statement, I will\n\ngive you a different charge. (page 1088 of the NE). There was a lunch break during the recording\n\nof the third statement. Whilst at lunch he was seated with ASP Fan and S/S/Sgt Patrick Thng. ASP Fan\n\nand he were then talking about Faribourg of Sweden. S/S/Sgt Patrick Thng and another officer by name\n\nStanley were close by. In essence, the first accused told ASP Fan he could arrange for Faribourg to\n\ncome to Singapore. He added that he made all the statements sought to be admitted because there was\n\na promise as well as an inducement from ASP Fan to be lenient with him and a confirmation that he\n\nwould be given a lesser charge. He also said a number of days later he was interviewed by one Kumar\n\nand one Naseer of the CNB concerning the said Faribourg.35 Kumar and Naseer asked him to repeat the statements made by the first accused\n\nto ASP Fan. He gave them a statement and at the end of the meeting they also told him that when\n\nyou co-operate with us, we will write to Judge to [be] lenient on you. (page 1100 of the NE).36 S/Sgt Sukumar Balan and Cpl Nazir Ali Khan were called by the prosecution as\n\nrebuttal witnesses. They in their evidence denied that any promise or inducement of the nature\n\nalleged by the first accused was ever made by them to him. They also denied any threats on their\n\npart. They confirmed however that they interviewed the first accused to elicit intelligence.",
        "Trial within a trial as respects the third accused  P-51": "37 Following objection by counsel for the third accused that the second statement\n\n(P-51) recorded from the third accused on 11 April 2000 was not given by him voluntarily, a trial\n\nwithin a trial was held. There was however no objection by the defence to the admissibility of a\n\nprevious statement (P-50) recorded from the third accused on 10 April 2000.38 ASP Fan who recorded this particular statement with the assistance of an Urdu\n\ninterpreter Neaz Ahmad Khan testified that he recorded a statement from the third accused on 11\n\nApril 2000 between 7.25pm and 11.15pm. ASP Fan affirmed that the statement recorded from the third\n\naccused was given voluntarily by him and that there was neither threat nor inducement nor any\n\npromise given or made to the third accused either by him or by the interpreter who assisted him\n\neither during or before the recording of the statement.39 However, in cross-examination and not before, ASP Fan admitted confronting the\n\nthird accused during the process of recording. His field book also had the entry: At 9.30pm\n\nconfronted the accused that Nassim Khan could not have paid his expenses for free  After\n\nexplanation, accused broke into tears and cried. At about 9.45pm, accused requested for water and\n\nwas given two mugs. (pages 1210 and 1211 of the NE).40 Neaz Ahmad Khan, a part-time Urdu interpreter engaged by the CNB to assist ASP\n\nFan in the recording of statements from the third accused averred that there was no threat,\n\ninducement or promise made to the accused either before or during the recording of the statement. He\n\nsaid that the only persons present during the recording were the accused, ASP Fan and himself.41 The Urdu interpreters cross-examination however threw up a few significant\n\nfacets to the recording and the excerpts of which are reproduced below:(a) [ASP Fan] once raised his voice  he shouted only once  (page\n\n  1250 line 18 of the NE)(b) [ASP Fan] raised his voice at the time when he said: Dont come and\n\n  tell some other story, dont make up the story and tell me. (page 1251 line 3 of the NE)(c) [ASP Fan]  asked again and again in different form. At one stage he\n\n  shouted because hes taking time and he says, You dont make up the story (page 1251\n\n  lines 18 to 22)(d) [Naveed]  didnt even understand. I told him  whatever you say\n\n  must tell the truth (page 1252 lines 5-7 of the NE).(e) And then at that instance he [Naveed] broke down  He cried (page\n\n  1252 lines 11-12 of the NE).(f) When [ASP Fan] raised his voice and shouted he looked angry or irritated\n\n  (page 1253 line 9 of the NE).(g) [Naveed] was taking time.  then suddenly he started to cry. I felt\n\n  very uncomfortable  when he started to cry. I told him --- as a Muslim brother, \"If you\n\n  believe hereafter, the life hereafter if you have done anything wrong\"  you might admit\n\n  or you might tell the truth  nobody forcing but you can decide yourself. (page 1258 lines 8\n\n  to 21 and page 1259 line 1 of the NE).(h) He cried  really he cried (page 1261 lines 6-8 of the NE).(i) I [Neaz] [made] the whole environment very friendly  Always talk about\n\n  family (page 1261 lines 18-21 of the NE).",
        "Evidence of the third accused at the trial within a trial": "42 The third accused testified at about 7.25pm on 11 April 2000, ASP Fan started\n\nrecoding a statement from him with the assistance of Neaz Ahmed Khan. Insofar as is material the\n\nmain aspects of his testimony can be summarised as follows.43 There were two breaks during the recording of the statement. Just after the\n\nfirst break, he saw ASP Fan and the interpreter conferring amongst themselves. When they eventually\n\nreturned, the interpreter told him: Look you are seated on a chair. You admit otherwise you will\n\nbe taken to a torture room. At that time, ASP Fan who was seated in front of him was shouting and\n\nbanging the table with his fist (page 1278 of the NE). He was frightened and started to cry (page\n\n1282 lines 9 to 15).44 The third accused was very frightened. He was fearful because earlier on there\n\nwas an attempt to assault him whilst he was inside a vehicle just after his arrest. The third\n\naccused added that at one stage in the course of the recording, the interpreter told him: You\n\nadmit. You made a mistake, you might as well admit. You have travelled in the aeroplane. If the\n\nplane had crashed, you would have died. God has given you an opportunity to admit, so before you die\n\nyou might as well admit. (page 1284 lines 15 to 18).45 In sum, he said that he gave the statement because he was forced to do it. He\n\nclaimed that in fact all that he wanted to say was already stated by him to ASP Fan previously on 10\n\nApril 2000.46 During cross-examination, he added another fragment about what the interpreter\n\nhad told him (page 1310 lines 17 to 21 and page 1311 lines 1 to 3). It reads as follows:He said that on one occasion he was going to India to meet his father. In the\n\n  train a man stole someones things and ran. [He] caught up with that man and I locked him up in\n\n  the bathroom of the train. From inside the bathroom this man broke the window pane and tried to\n\n  escape. The train was travelling fast and he fell out of the train. He died. That man never had\n\n  the opportunity to ask for forgiveness. You are given an opportunity. So he was giving me such\n\n  stories to frighten me.47 It must be presently observed that the foregoing part was never put to the\n\ninterpreter by the defence when the latter was being cross-examined.48 S/Sgt Subramaniam was called by the prosecution to rebut the third accuseds\n\nallegation that there was an attempt to assault him by the CNB officers who arrested him. The\n\nofficer said that there was no attempt to threaten or assault the third accused at any stage.",
        "Ruling on the admissibility of the statements made by the first accused": "49 There were lengthy submissions both by the counsel for the first accused as\n\nwell as the learned DPP on the admissibility or otherwise of the three statements (P-47, P-48 and\n\nP-49) which were the subject matters of contention during the trial within a trial. It was submitted\n\nby counsel for the first accused that the first accused proffered those three statements because of\n\nthe inducement or promise made to him by ASP Fan that if the first accused were to give a good\n\nstatement, the capital charge he was facing would be altered to one which did not attract the death\n\npenalty. Counsel urged the court to accept the evidence of the first accused and reject the version\n\nof the prosecution. Counsel for the first accused also highlighted the alleged co-operation to be\n\nrendered by the first accused to set up a sting operation to entice the said Faribourg out of Sweden\n\ninto Singapore.50 I need not replicate at any length the submissions made by the prosecution.\n\nThey are in print for all to see. Suffice it if I said that the prosecution urged the court to\n\nreject the claims of the first accused that he was induced into making the statements alluded to.51 It is a settled principle of law that the burden is always on the prosecution\n\nto prove beyond a reasonable doubt that confessional statements recorded from the accused persons,\n\nbe they plenary or non-plenary, are made voluntarily without being vitiated by any elements of\n\nthreat, inducement, promise or oppression. By the law of England and the law applicable in\n\nSingapore, a confession to be admissible, must be free and voluntary. Lord Sumner in the well-known\n\ncase ofIbrahim v King[1914] AC 599 said at page 609:It has long been established as a positive rule of English criminal law, that\n\n  no statement by an accused is admissible in evidence against him unless it is shown by the\n\n  prosecution to have been a voluntary statement, in the sense that it has not been obtained from\n\n  him either by fear of prejudice or hope of advantage exercised or held out by a person in\n\n  aithority.52 The foregoing principle was amplified by Lord Morris of Borth-Y-Gest inDPP\n\nV Ping Lin[1976] AC 574. He commented at page 595D-E:was it as a result of something said or done by a person in authority that\n\n  an accused was caused or led to make a statement: did he make it because he was caused to fear\n\n  that he would be prejudiced if he did not or because he was caused to hope that he would have\n\n  advantage if he did. The prosecution must show that the statement did not owe its origin to such a\n\n  cause.53 Having reviewed all the evidence, my finding is that the prosecution has\n\nindeed proven that the three statements recorded from the first accused were made voluntarily by him\n\nwithout any elements of threat, inducement, promise or any form of oppressive conduct on the part of\n\nASP Fan or any one in authority. In my finding, it was the first accused who seemed to have\n\ninitiated the subject of co-operation perhaps hoping that such an endeavour on his part would soften\n\nthe prosecution to acceding to his plea for a lesser charge. In my view, his claim that ASP Fan\n\ncoerced him into giving him a so-called good statement was a fabrication.54 His repeated claims that ASP Fan promised him that his charge would be reduced\n\nif he gave him a good statement, were distinctly marked by a great deal of tentativeness and\n\nhesitation on his part. Although I found a few slivers of equivocation in the evidence of ASP Fan as\n\nto the first accused mentioning to him a character known as Faribourg and some ambivalent\n\nfeatures in the evidence of S/S/Sgt Thng, at the end, after considering all the evidence, I was\n\nsatisfied that the prosecution had proven that the statements adverted to were made by the first\n\naccused voluntarily. Consequently I ruled that they be admitted to evidence.",
        "Ruling on the admissibility of the statement made by the third accused": "55 The principles applicable and questions the court had to consider before\n\nadmitting the contested statements of the accused persons, stated inIbrahim v KingandDPP v Ping Lin(supra)need not be restated here. The crucial\n\npoint in the pronouncements of Lord Morris inDPP v Ping Linwas not whether the\n\nperson in authority had intended to make an inducement or threat but whether the accused person\n\nperceived the statements and actions of the person in authority as such. Another point which had to\n\nbe borne in mind is the principle: Voluntariness is not an issue to be determined by reference to\n\nsome hypothetical standard: it requires a careful assessment of the effect of the actual\n\ncircumstances of a case upon the will of the particular accused (seeCollins v Rex(1980) 31 ALR 257 at 307, lines 30-45  per Brennan J).56 In my evaluation, the admission by ASP Fan that he confronted the third\n\naccused and the evidence of the interpreter about ASP Fan looking angry and irritated, banging the\n\ntable, raising his voice which made the third accused to cry, asking the questions again and again\n\nand the suggestion by the interpreter to the third accused that as a Muslim he should admit and tell\n\nthe truth, inevitably raised the spectre of oppression and gave rise to a real and reasonable doubt\n\nas to the voluntariness of the statement.57 In my finding the repeated questions by ASP Fan and the gratuitous\n\nexhortations by the interpreter appeared to have actually operated in the mind of the accused. In my\n\ndetermination, there was most clearly a substantial degree of over-persuasion, undue insistence and\n\nimportunity on the part of the recording officer, compounded by an unwarranted intoning by the\n\ninterpreter. The repeated questioning by the recording officer and the manner in which he seemed to\n\nhave conducted the interview appeared to have propelled the recording process into the realm of\n\noppression alluded to by Chao Hick Tin JA inYeo Swee How v Public Prosecutor[1997] 2 SLR 390at 400E-H where he observed that cross-examination could render a statement inadmissible if\n\nit amounted to oppression. The learned DPPs comment in his supplementary submission that there\n\nmay be occasions when the prosecutions own evidence per se may indicate some element of\n\ninvoluntariness, was apt and applied to the situation at hand squarely.58 In my opinion, the prosecution had failed to satisfy me that the statement\n\nrecorded from the third accused on 11 April 2000 was given voluntarily. In the result, I ruled that\n\nthe said statement could not be admitted in evidence.",
        "Resumption of the main trial": "59 Following my rulings above, the three statements (marked P-47, P-48 and P-49)\n\nrecorded from the first accused were formally admitted in evidence. They were too long to be entered\n\nupon here. It was sufficient if I said that in those statements the first accused admitted his\n\ninvolvement in the drug deal initially with one Lou and later with Ray; the involvement of his\n\nbusiness partner the second accused in the proposed transaction; the selection of Singapore as the\n\nvenue for the delivery of heroin by the parties; the arrangement for a courier to send the drugs in\n\nsuitcases; his as well as the arrival of the second accused in Singapore; the meeting between Ray\n\nand himself with the second accused at River View Hotel lobby and in Rays room; the delivery of\n\nthe two suitcases to Ray in the hotel room later; the identification of drugs along the walls of the\n\nsuitcases and his subsequent arrest at the hotel lobby.60 Insofar as is material, para 7 (in exh P-47) paras 9, 14 and 21 (in exh P-48)\n\nand paras 30 and 31 (in exh P-49) require reproduction. They read as follows:7. In January 2000, I sought help from my partner Afzal by asking him to find\n\n  and send samples to Lou. Afzal is aware of my financial situation and also Lou asking me to do\n\n  drugs as I discussed with him my personal problems. Afzal agreed to help but he also could not\n\n  find anybody who would send the sample. Afzals heroin supplier asked for 30 per cent advance\n\n  advance of the money. So we contacted Lou to ask him to come to Pakistan to check the sample and\n\n  take the drugs from Pakistan. It is then that myself and Afzal got to know Ray. Sometime at the\n\n  end of January 2000, Lou called me on my mobile and told me that he wanted to introduce me to his\n\n  cousin Ray who is the main man and whom he works for. According to Lou, Ray has been in the\n\n  business for a long time and has all along got his heroin from Mexico and Columbia. He also told\n\n  me that Ray could be trusted  and then he handed the conversation over to Ray. Ray told me that\n\n  he did not want to go to Pakistan but suggested that I send the heroin to New York or get someone\n\n  in New York who can deliver it to him.9. My conversation with Lou about the heroin sample continued almost every day\n\n  and I also understand from Lou that Ray suggested that I meet them in either Singapore or anyway\n\n  in Europe. I was also told that it could not be in Pakistan as Ray did not want to go there.\n\n  Neither could the meeting be in USA as I would not be able to get a visa. Through Afzal, I asked\n\n  the heroin supplier to either do the transaction in Singapore or Europe. I was then informed by\n\n  Afzal that according to the heroin supplier, the drug courier could not get a visa to Europe.\n\n  Therefore, it has to be done in Singapore initially, the drug deal was to be done in Paris.\n\n  However, the heroin courier could not get a visa for Paris and the supplier did not want to do it\n\n  in other parts of Europe. It was sometime in February 2000 when we finally agreed on the place. At\n\n  that time, Lou told me that Ray would get a new mobile number in Singapore, one different from the\n\n  number 1-917-971-5360 that was given to me previously (Recorders note: Accused was asked about\n\n  Rays mobile number and he retrieved it from his address book as 1-917-971-5360).14. On 2 Apr 2000, Afzal informed me that the courier would be going to\n\n  Singapore on 3 Apr from Lahore, passing through Karachi. The supplier would fax a copy of his\n\n  passport photo so that I could watch him while he goes through the Customs. He then asked me to\n\n  change my flight to Singapore Airlines, the same as the courier. It was only at that time when he\n\n  told me that instead of 2 jackets, there would be 5 and they would be going in suitcases. I asked\n\n  him how would the money be done and he asked me to talk to Lou. Immediately, I called Lou and told\n\n  him of the change. He was surprised and asked me to talk to Ray. An hour later, Lou called me back\n\n  and said that the US$120,000/- has already been packed. There would not be a problem at all with\n\n  the rest but the balance money would be sent to Pakistan by Lous girlfriend named Liz only\n\n  after the goods reach New York and they had seen it. After that, Afzal asked me for a guarantee as\n\n  he was worried that his suppliers would kill him if the balance money were not paid.21. Ray then asked Afzal and myself to go to his Room 1711 where he started\n\n  talking about the business. He said that we had agreed on 2 for US$120,000/- and the remaining 3\n\n  to be at US$50,000/- each. I asked how he would pay us and Ray said that after checking the goods,\n\n  he would make the payment through his girlfriend in 2 days time. Ray also asked where we want, in\n\n  Pakistan or Singapore and Afzal replied in Singapore. Ray insisted to open the suitcase in\n\n  Singapore but we did not agree as the arrangement was for him to check in New York. We started an\n\n  argument with Ray stating that he could not pay for something he did not see. Afzal and myself\n\n  disagreed and no decision was made. We then left the room and took a taxi back to the Hotel Grand\n\n  Central.30. I went back to the lobby to meet up with Ray and we both returned to his\n\n  room. Ray asked me to open the suitcases and I opened one of them, only to find it empty. He\n\n  started searching the suitcase and ripped open the inside using a knife but he could not find\n\n  anything. He then asked me to open the other suitcase and it is also empty. Ray started getting\n\n  furious again and said that I am cheating him. He asked me to ask Afzal about how the heroin was\n\n  hidden using his mobile. I called Afzal and he got furious that I called him at the hotel using\n\n  Rays mobile. I told him that there was nothing in the suitcases and he sounded worried. He said\n\n  that he would call the people in Pakistan. Afzal called into Rays mobile about 10 minutes later\n\n  and asked him to look at the de-colouration at the corners of the suitcase. Afzal hung up the\n\n  phone and I passed the message to Ray. Ray then tried breaking through the crust of both\n\n  suitcases. He managed to break the crust only after some hard work and saw some powder inside. Ray\n\n  started testing the powder found at every corner of the suitcases and told me that it is OK but\n\n  that it may not be 5 kilograms. Ray told me that it may just be 2 kilograms and he would pay me\n\n  the US$120,000/-. He said that when he had checked that it is 5 kilograms in New York, he would\n\n  send the rest of the money, which is US$50,000/- per kilogram through his girlfriend.31. After testing the heroin, Ray asked me to close the suitcases. I reminded\n\n  him that there was a portion of the fabric of the suitcase still in the room. He told me that it\n\n  was alright as he would take care of that. Ray then asked me to follow him and he would take me to\n\n  his girlfriend. I did not carry the suitcases with me then but Ray asked me to pick up the\n\n  suitcases and follow him. We then went to the hotel lobby and he told me to wait there for his\n\n  girlfriend whom I am to hand over the suitcases to. She would also hand me the money. After that,\n\n  Ray went off. A few minutes later, I was arrested by 5 to 6 people.61 As regards the third accused, a statement which was recorded on 10 April 2000\n\nby ASP Fan was tendered in evidence. This particular statement was not subject to any trial within a\n\ntrial and the court admitted it upon receiving confirmation from counsel for the third accused that\n\nthe said statement was made voluntarily by the third accused. Insofar as is material the relevant\n\nportions of this statement (exh P-50) are as follows:I am the above person and is also known as Koko to my relatives and\n\n  friends.2. I am the youngest child in a family of four children. My parents have\n\n  already passed away and I am staying alone in Lahore because my siblings are either all married or\n\n  working overseas. In Lahore of Pakistan, I own a shop selling motor vehicle spare parts. I earn\n\n  about US$70/- (4000 Rupees) per month through the business. Although I have only received till the\n\n  9thyear of education, I could speak and understand broken English of which I have\n\n  learnt from the television.3. On 6.4.2000 sometime after 10.00 p.m., I was arrested in a taxi along a road\n\n  by about 8 to 10 plainclothes man. They identified themselves as policeman. I was then asked to\n\n  come out of the taxi and handcuffed. A search was done on me but nothing was found. I was then\n\n  asked to sit back into the taxi with 2 officers and they brought me to an unknown place where\n\n  another group of about 4 officers took over me and brought me to the office where I am in now. I\n\n  now know that it is an office for anti-narcotics.4. After I was brought to the anti-narcotics office, I was questioned by 2 men\n\n  in English but I told them that I do not understand English. Then, another officer came and spoke\n\n  to me in simple Urdu. He asked me to whom did I give two bags to and also how many people were\n\n  there in my group. I told him I do not know what he was talking about. I was then brought into\n\n  another room and asked whether I know two other male persons there who were handcuffed. I told him\n\n  I do not know them. When I entered the room, there were many officers there and I saw one suitcase\n\n  being opened and there was some white substance that looked like stone beside it. Another suitcase\n\n  was then opened in front of myself and the 2 other male persons and it looked clean, neat and\n\n  empty. I did not notice how the inner layer of the suitcase was taken out. However, with the inner\n\n  layer taken out, I saw white substance that looked like stone in it. All the white substance in\n\n  the 2 suitcases was then taken out and weighed in front of us and I was told that it was 5\n\n  kilograms of heroin.5. After the weighing of the heroin, I was brought by the same team of officers\n\n  to my room at Supreme Hotel and my belongings in the room was taken away by the officers. Before I\n\n  left the hotel, I paid for all my bills. I was then brought to another place where the officers\n\n  took 6 bottles of my urine which I later put inside a box. The officers then brought me back to\n\n  the anti-narcotics office and later I was brought to the lock-up.6. The next day after lunch, I was taken out of the lock-up and brought to the\n\n  hospital for a medical check-up. After that, I was brought to a room in the anti-narcotics office\n\n  and an office[r] read over to me the charge in English. It was interpreted by an Urdu speaking\n\n  gentleman. A short statement was also recorded from me. After the statement, I was brought back to\n\n  the hospital for another check-up after which I was sent to the lock-up.7. I am not a drug addict and I have never taken any drugs before.8.  In 1998, Nashim Khan was released from prison and he came to visit me at\n\n  my home in Lahore. He was there for 15 minutes. When he left, he gave me his telephone number for\n\n  Karachi. I can recall the home number to be 021-272760 and 021-2851074 and his mobile number to be\n\n  0300209088. The country code of Pakistan is 92.3 days later, I called his house at Karachi from a\n\n  public phone at Lahore just to say hello. I was informed by a female answering the phone that\n\n  Nashim Khan is serving sentence in jail for a drug charge.9. Sometime in Dec 1999, Nashim Khan came to my home for 15 minutes. We\n\n  chi-chat and he left. Then again on 15.3.2000, he came to my home in Lahore and offered me to go\n\n  to Singapore. I agreed. He said that he will buy me a ticket and also give me some money. He also\n\n  told me that he has 2 briefcases that I can use to carry my clothing.Adjourned for a break at 10.30 p.m.Resumed statement recording at 10.50 p.m.10. Since 25.3.2000 until 3.4.2000, Nashim Khan visited me almost every day and\n\n  I went to the Bakhtawar Hotel where he resided in my town on 1.4.2000. At the hotel, I had wine\n\n  with Nashim Khan and an unknown male was present. The unknown male spoke to Nashim Khan but I\n\n  could not hear what they said as they spoke very softly. This same unknown male was later seen by\n\n  me at the airport in Lahore. He was wearing a sky blue shirt and navy blue trousers. To me, he is\n\n  a immigration officer and he has a name tag. However, I could not read the name in English. I\n\n  recognised him but he pretended not to see me. I had easy access for my luggage and immigration\n\n  checks at the airport. On 1.4.2000, I together with Nashim Khan also went to the travel agents\n\n  office where he bought for me an air ticket from Pakistan to Singapore and back. After buying the\n\n  ticket, he handed the ticket to me and I returned home.11. On 2.4.2000, a Sunday, I went to the hotel as my passport was with Nashim\n\n  Khan. When I was at the hotel, Nashim Khan sent a photocopy of the first 2 pages my passport to an\n\n  Karachi. I asked him why and he told me that he is sending to a friend whom will help me in\n\n  Singapore.12. On 3.4.2000 at about 4.00 p.m. (local time), I went to the hotel carrying\n\n  my clothing in a plastic bag. At the hotel, Nashim Khan opened 2 suitcases which were empty and\n\n  put my clothing into them. We then left for Lahore airport by taxi. He paid the taxi fare and I\n\n  would like to say that all the way from the hotel to airport, he carried the 2 suitcases and I\n\n  never had the chance to hold them. I then checked in the suitcases and have only my jacket and\n\n  passport with me. The plane that I took was Singapore Airlines SQ 418. I was at seat number 39A.13. At the Lahore airport, Nashim Khan told me to check into either Supreme\n\n  Hotel or Musthafa Hotel when I reach Singapore. He also told me to call him on his mobile in\n\n  Karachi when I reach the hotel so that his people could meet me at the hotel. He also gave me\n\n  US$500/- to spend.14. I boarded the plane in Lahore at about 6.10 p.m. (local time) and it took\n\n  off at about 7.00 p.m. (local time). I reached Karachi at about 8.40 p.m. (local time) and I\n\n  stayed on board the plane. At about 9.30 p.m. (local time), the plane took off again and I reached\n\n  Singapore in the morning on 4.4.2000.15. After I come out from the plane, I approached the Immigration and filled up\n\n  an immigration card with some help from another passenger. After I cleared the Customs, I\n\n  collected the 2 suitcases and left the airport on a taxi. I told the taxi driver to go to Supreme\n\n  Hotel where I checked into Room 207. In the room I called Nashim Khan to inform him that I am\n\n  already at Supreme Hotel. He told me that his man known as Ash will come to me and I am to\n\n  give the person the 2 suitcases. If they were to give me US$500/- to US$1,000/-, I could just it\n\n  and spend. I slept for 2 hours after which I left the hotel at about 6.00 p.m. to walk around. I\n\n  returned at about 9.00 p.m. to sleep again.16. On 5.4.2000, I woke up about 8.00 a.m. and was in the room until about\n\n  12.00 p.m. About 11.00 a.m., I received a call from a male person whom introduced himself as Ash\n\n  in a native manner. He spoke to me in Urdu and told me that he is from Nashim Khan. He wanted to\n\n  come and see me but I told him that I wanted to go for sightseeing. Ash then told me that he\n\n  would come at about 5.00 p.m. I then left the hotel.17. I returned to my room before 5.00 p.m. but Ash did not come. He\n\n  called me and said that he will meet me at a shopping centre. I told him that I could not\n\n  recognize him but he said that he had seen my photograph as he has a copy of my passport. I then\n\n  went to the shopping centre where Ash approached me. We spent about 5 minutes together and\n\n  he told me that he had left the 2 suitcases in Pakistan with Nashim Khan. As I am busy today, he\n\n  will come to collect the suitcases the following day on 6.4.2000. I then went shopping and\n\n  returned to the hotel at about 8.00 p.m.18. I am now shown a photograph of a male person whom I recognised as Ash\n\n  whom I had mentioned (Recorders note: Accused is shown a polaroid photograph of one Muhammad\n\n  Ali Hashim, P/P No.:F118067 whom he identified as Ash whom he mentioned earlier in his\n\n  statement).62 As stated by me earlier, the prosecution case was to a large extent hinged on\n\nthe audio-visual tape recordings made secretly at the River View Hotel bedroom where the first and\n\nsecond accused met with Ray. All the video-tapes were played during the proceedings and the\n\ntranscripts thereof were also tendered and admitted in evidence without objection. On the face of\n\nvideo presentation and the transcripts, it appeared that the first and the second accused were\n\nactively discussing the sale of heroin to Ray. Insofar as is material a few segments as appear in\n\npages 7, 8, 10, 11, 12, 13, 17, 25, 35, 37, 71 and 72 are reproduced below:Page 7 of the transcript:Hashim: It is all concealed in the suitcase so you dont have to worry about\n\n  taking there.Officer: Well, OK, you mean the actual heroin itself, OK.Khan:  It came right from ---Officer: It came from the area.Khan: North East Asia.Officer: OK. Now, my question is this, I want to see my product before I pay\n\n  you. Do you understand that? Because I didnt come half way around the world not to see my\n\n  drugs. I got my courier, shell take care of everything for me. She knows how to get it. Shes\n\n  a professional. She has been working for me since I started my business. OK?Khan: OK.Officer: I trust her, I can leave money here, with her here, I come back, theres\n\n  not a dime taken from there.Khan: I understand.Officer: And you cant get that kind of help anymore.Khan: I understand.Officer: You understand? So, I need to see, and with due respect, I came half\n\n  way around the world, I want to see those drugs here now, you know, the drugs, and I want to see\n\n  it because ---Page 8 of the transcript:Khan: Same as with us.Officer: Right, you saw, I showed you the money, Im ready. In that packet is\n\n  a hundred and twenty thousand, because we had agreed, it was two \"ki\"s with sixty a\n\n  piece. Now, you come out with, what, three---three more?Khan: Five.Officer: So its five now. Theres three extras.Khan: Its very, very, very, very nice  most latest system which is\n\n  already known there.Officer: OK. So when they get here, do you know how to open it? Do you know how\n\n  to access it?Khan: Yes, you can open but(Urdu)Hashim: No, if you want to see the sample ---Officer: No, I want to see the drugs. I can have it taken out of here,\n\n  reprocess, re-whatever. I can, trust me. I want to know what Im getting. Ive done this --- Ive\n\n  done this before. I want to see my drugs. I want to test my drugs. I want to make sure its\n\n  heroin.Khan: You want to test, huh?Officer: Yes.Pages 10 and 11 of the transcript:Khan: Three hundred thousand dollars.Officer: No, no, I understand that but we got to get to that. Wait, wait, lets\n\n  get to that. I understand where youre coming from. Our arrangement was for two kilos for\n\n  hundred and twenty thousand based on, listen to me, based  and correct me if Im wrong, two\n\n  kilos, hundred and twenty thousand dollars  based on that any future negotiation, any future\n\n  kilos that I would purchase from you would come down in price.Hashim: But thats on a different trip, you know, different ---Officer: No, no not a different trip. Our initial  initial, and correct me\n\n  if Im wrong, these five \"ki\"s came up to me in the last minute when I had the money\n\n  already transporting over here, and I couldnt come up to have the rest of the money\n\n  transported. So, technically, I came here to buy two \"ki\"s for hundred and twenty\n\n  thousand, sixty a piece. That is a lot of money, because I can get from the Columbians, in the\n\n  United States, sixty-five, seventy thousand per \"ki\"  per kilo of heroin.Khan: What we did, we did sincerely ---Page 12 of the transcript:Khan: Yes. And, now, I dont know, he knows, if you want to open, you can\n\n  open.Officer: Yes, I want to open.Khan: IOfficer: Good, good, good.Khan: He will look after everything. If --- I dont know, if you open, again,\n\n  how you will ---Officer: Dont worry, Ill get it out. Trust me.Khan: How you will, how you will ---Officer: Trust me, I will. She will take care of it, no problem.Khan: How you will transport?Officer: The transportation, dont worry. Ill take care. I just want to\n\n  make sure I have what I have, thats all. I will take care of transportation, OK? Now, how much\n\n  for the other three \"ki\"s? You got to be reasonable with price. Where are you getting it\n\n  from? A source, right? Youre getting it from your country? Is it good quality?Khan: Its top quality.Hashim: Its top quality.Officer: From your country?Page 13 of the transcript:Khan: I tell you one thing, Mr Ray, theres no match, this product made in\n\n  Columbia. No match.Page 17 of the transcript:Officer: Whats the price?Khan:  They give about fifty thousand to fifty-five thousand, depending on 1\n\n  to 3 quality.What quality is this on 1 to 3Khan: Which quality we are offering. We do business with topmost quality, the\n\n  topmost, because we understand, we understand if we are taking so much risk right from one place\n\n  to other place, other place to other place, and then here, and then from this place to other\n\n  place, because in our country, in number 1 and number 2, theres no much difference. Its a\n\n  very, very, slight difference.Officer: Uh-hmm.Khan: So every sensible businessman wants to (send) the best quality ---Officer: Of course.Khan: --- because every sensible businessman, every educated sensible\n\n  businessman wants that the quality should go the top-most, and we call that triple 5.Officer: OK.Page 25 of the transcript:Khan: Federal express  (speaks in Urdu)Officer: Federal Express, it would have come directly to me. Its guaranteed.Khan: But still, it was a risk.Officer: Sure, sure. But you know what, it would have come.Khan: It was a risk for you.Officer: No, it wouldnt have been a risk for me because Ive had a few\n\n  things sent Federal. It just depends. You dont do lump sums entirely. You do short thing ---Khan: Yes, probablyOfficer: Right, that would have been perfect. That would have been---that would\n\n  have been perfect. And another thing would have been---you see, what I do, I have some Colombian\n\n  women, they come in and do body-carry. They swallow and then they come.Khan: I know but you cant make big quantity.Officer: Right, I understand that. But that was just, you know, that was what\n\n  these different things. I sent several people, they go and collect my merchandise in another\n\n  country and theyll send in little by little.Khan: I tell you, body---body probably it would be best if you can pick up \n\n  but flight should be direct.Officer: Right.Page 35 of the transcript:Khan: Well go, well discuss. And once the system is opened, then this is\n\n  your responsibility.Officer: No problem. If you bring it here, we open it here and Ill check it\n\n  and Im responsible for it from here. Its not a problem. Trust me, its not a problem.Khan: And he will be with you after one and half hours.Officer: OK.Khan: Hell bring the sample also, hell do whatever you want.Officer: You dont want to count the money? (Laughter)Khan: No.Page 37 of the transcript:Khan:  the things which are packed, they are really very highly, technically\n\n  packed, and if you open them there, as I said, that---Officer: Well, you got to---with due respect, with all respect, this is our\n\n  first deal.Khan: Yeah.Officer: So I want to make sure, and you got to respect me on that. I came from\n\n  a long distance and if I see this is what it is, I take your word from every other load. However\n\n  you said, Ill take your word for every little load and youll have your money. My word, OK?\n\n  But you got to respect, we have to set precedence and this first deal now is going to be the first\n\n  of a happy marriage.Khan: Yeah, right (laughter).Page 71 of the transcript:Hashim: You see this  This much left, and big one.  You have toOfficer: Yes, my couriers are going to have to struggle now.Hashim: Huh?Officer: My couriers are going to take their time in pulling these out. All\n\n  right, this is what were going to do. Let me test that one, and were going to close this up.\n\n  Just let me test this. Im tired, Im sorry, but Im tired. So this is your new system? Im\n\n  going to suffer with your new system.Hashim: Thats what they claim, they will check. You know something?Officer: No, I know, I know what you mean. I mean, its going  until we\n\n  get used to it. Yes, it looks like the magic colour to me, how about you?Hashim: Yes.Officer: Yes?Hashim: youif youre happyPage 72 of the transcript:Hashim: Hes (worried). \"Is something coming?\", yes, its coming,\n\n  now I told him its coming.Officer: Yes, its coming.Hashim: Its coming but we are checking the quantity.Officer: Yes, I mean, look at this. (Be it for real), do you think this is five\n\n  kilos? I dont think so.Hashim: No, Ray, we have to check it and ---Officer: Im going to check it thoroughly and I give you my word, if theres\n\n  five kilos here, you get all your money. Im a man of my word, and youre going to get your\n\n  money. Youre getting your money today.Hashim: Hmm.Officer: Youre getting it, so dont worry about that. But if theres no\n\n  five kilos in here, and theres just the two kilos that I ordered, then I think thats only\n\n  fair.Hashim: You should be honest with me.63 Before closing its case, the prosecution offered 32 witnesses to the defence\n\nbut the offer was declined by counsel for the accused persons.",
        "Ruling at the close of the prosecutions case": "64 At the close of the prosecution, counsel for the accused persons did not make\n\nany submission of no case to answer. The prosecution for its part submitted that a prima facie\n\ncase had been made out against each accused on the respective charges each individual faced. Having\n\nconsidered all the evidence thus far and having regard to the principles enunciated inHaw Tua\n\nTau v PP[1981] 2 MLJ 49(PC), I was satisfied that the prosecution had made out a case\n\nagainst each accused person on the charge each was facing, which if unrebutted would warrant his\n\nconviction. Consequently I called upon each of them to enter upon his defence and explained to each\n\nof them the courses open to them. All the accused in the event, after conferring with their\n\nrespective counsel elected to give evidence on affirmation and in their own defence.",
        "Evidence of the first accused": "65 The evidence of the first accused in his defence can be stated as follows.66 He is a Pakistani National born in Bahrain on 3 June 1947. He was for sometime\n\ndoing business in London but having been unsuccessful in his venture he returned to Pakistan\n\nsometime in May 1999 and shortly thereafter joined the second accused in a leather and leather\n\ngarment business.67 He became acquainted with one American by name Lou whilst the first\n\naccused was in the United States about ten years previously. Lou who used to be in touch with the\n\nfirst accused contacted him in Pakistan sometime during the third week of May 1999. Lou told him\n\nthat he had just opened a leather goods shop in New York City and asked the first accused for some\n\nleather jacket samples to show his customers.68 In the event, the first accused arranged for such samples to be sent over to\n\nLou in New York. Although eight leather jacket samples were sent to Lou for which Lou was obliged to\n\npay him US$1,000, no payments were forthcoming. Curiously though, Lou had for some inexplicable\n\nreasons approached the first accuseds brother-in-law who was in the United States and asked him\n\nfor drugs. Following a protest from his brother-in-law on Lous audacity, the first accused sent a\n\nfax to Lou questioning him why he should mention drugs to his brother-in-law when they were engaged\n\nin the leather garment business. Lou shot back that the leather business was just a business front.\n\nThe first accused didnt quite comprehend what Lou meant. Since then he tried to avoid calls from\n\nLou. However, sometime in October 1999, the first accused was in dire straits. He needed money. So\n\non one occasion when Lou called him he asked Lou for US$2,000; $1,000 for the jackets sent earlier\n\nand the other $1,000 as a loan.69 Lous immediate response to the first accused was: Do drugs. Lou\n\nwanted him to send drugs to New York through mail. The first accused did not agree. He rejected the\n\nproposal. Lou was unyielding; he told the first accused that he would make him rich and advised him\n\nnot to lose the opportunity. Exchanges of this nature continued over a span of two months.70 Later on sometime in October 1999, Lou telephoned the first accused in his\n\noffice. As he was not in, his partner the second accused answered the call. Subsequently, the first\n\naccused briefed the second accused that Lou had a leather shop in New York and that Lou was pushing\n\nhim to do drugs. The second accused did not say anything.71 Noting that Lou had neither paid for the leather jackets nor extended any\n\nfinancial help to him, the first accused decided to cheat Lou (page 1728 line 1). He realised that\n\nLou, a rich man was very desperate for drugs. The first accused wanted Lous money with a view to\n\nalleviating his present financial difficulties. He was indebted at that stage in the region of about\n\nUS$60,000 altogether. The first accused told the second accused of his plan to cheat Lou.72 Subsequently, when Lou called him the next time, the first accused who was in\n\nneed of funds [falsely] promised to send him drugs. They then started discussing the price. Lou told\n\nthe first accused that if the first accused were to deliver to Lou in New York one jacket (meaning\n\none kilogram of heroin) the price payable was US$70,000. The price would be different if delivery\n\nwas effected outside the United States.73 Lou, however, was unwilling to travel to Pakistan for the drugs. He told the\n\nfirst accused that it was risky to carry a large sum of money to Pakistan. Lou insisted that the\n\ndrugs be sent to New York by mail or by courier. The first accused intimated to Lou that if he\n\nwanted delivery in New York, Lou had to make an advance payment of 30% for two jackets. The first\n\naccused said that the expression jacket used by Lou meant one kilogram of heroin.74 Since they had agreed on the price of US$70,000 per jacket, the first accused\n\nrequested Lou to remit to him US$42,000 being the advance payment of 30% for two jackets (US$70,000\n\nx 2  3 = US$42,000). Lous reaction was that the first accused should send him samples before he\n\nsent the first accused any monies.75 The first accused did not send Lou any samples although he told him he had\n\nsent them through some greeting cards. About a fortnight later, Lou complained to the first\n\naccused that he had yet to receive the samples. The first accused gave him an excuse that the\n\nsamples might have been intercepted by customs. In the event, no samples were in fact sent. Lou was\n\ngetting impatient and told the first accused that his boss was of the opinion that the first accused\n\nwas wasting Lous time and that the first accused had no connections.76 Lou called the first accused regularly and the first accused kept maintaining\n\nto Lou that he had sent the samples requested. In the course of one such conversation between them,\n\nthe first accused told Lou: either come to Pakistan or send 30 per cent advance (page 1744 of\n\nthe NE). Lou replied that he could not come to Pakistan and suggested instead that the first accused\n\ngo to Europe. The first accuseds reply was that he could not travel to Europe as he had no visa\n\nto visit Europe.77 In February 2000, Lou called the first accused again and this time he informed\n\nthe first accused that his boss was going to Singapore for a holiday with his girlfriend. He\n\nenquired from the first accused whether the latter could also make the trip to Singapore. The first\n\naccuseds response was that he would call him in two days. Later he discussed this matter with his\n\npartner, the second accused who was a party to the scam planned by the first accused to cheat Lou.78 In the event, the first accused sent an e-mail to Lou stating that they could\n\nmeet in Singapore. After the e-mail Lou called the first accused back and told him that his cousin\n\nRay was his boss. After this introduction, the first accused and Ray began to communicate with each\n\nother. Ray advised the first accused that he was going to Singapore with his girlfriend during the\n\nfirst week of March 2000. Having agreed to this, the first accused arranged with the second accused\n\nto get a courier who would pay his own expenses. Consequently, it was decided by the first and the\n\nsecond accused that the first accused should contact one of his friends in Islamabad known as Mumtaz\n\nAhmed Abbasi who was also known to the second accused. In the event, Mumtaz Abbasi gave him\n\ninformation concerning the system in relation to transportation of drugs. According to the\n\nfirst accused, the arrangement of a courier and so-called system were for the purposes of\n\ngaining Lous confidence.79 Once Singapore was identified as the venue to meet, the agreement between him\n\nand the NY parties was that two jackets would be taken to Singapore and the agreed price for them\n\nwas US$120,000. Ray was initially not agreeable to the price suggested but Lou managed to convince\n\nRay that the price was all right for the first transaction. The first accused intended to obtain the\n\nUS$120,000 from Lou according to the scam he had planned but in truth he was not going to bring the\n\nproposed two jackets (ie, two kilograms of heroin) to Singapore. In relation to this scam, his\n\nagreement with the second accused and the said Mumtaz Abbasi was that after expenses, he would get\n\n40 per cent and the other two 30 per cent each.80 The trip planned by Ray to Singapore in March 2000 was postponed by two weeks.\n\nThe reason given by him was that as President Clinton was visiting Pakistan, the security would be\n\ntight and there would be problems in taking out the money. The trip was again postponed for a\n\nfurther two-week period because of the intervening Muslim religious festival of Eid.\n\nEventually, it was agreed they meet in Singapore on 3 April 2000. By this time, the agreement in\n\nplace was that upon delivery of the two jackets, a sum of US$120,000 would be paid in cash to the\n\nfirst accused. Shortly thereafter, Lou called the first accused once again to tell him that Rays\n\ngirlfriend would be going to Singapore with the money on 3 April 2000 and Ray would arrive later. It\n\nwas agreed between Lou and the first accused that only a sample of the heroin would be inspected and\n\nthere would not be any inspection of the jackets in Singapore.81 Whilst the first accused was thus negotiating with Ray and Lou, Mumtaz Abbasi\n\nwas trying to arrange for a courier. The day before he left for Singapore, the first accused was\n\nsent a fax containing the copy of the passport of the courier. It was also stated in the fax that\n\nthe courier was going to Singapore with only one suitcase and the first accused had to give him\n\nUS$3,000 to $4,000 for the couriers expenses. In the event, the first accused flew to Singapore\n\nfrom Karachi, Pakistan and arrived in Singapore on 4 April 2000 and checked into Broadway Hotel at\n\nSerangoon Road, Singapore.82 After his arrival, the first accused contacted the second accused and gave him\n\nthe name and telephone number of the hotel he had checked in. He also called Lou in New York. The\n\nfirst accused was advised by Lou that Ray would be arriving in Singapore the next day ie, on 5 April\n\n2000. Lou also described the appearance of Rays girlfriend.83 On 4 April 2000, the second accused called back the first accused and told him\n\nthat the courier had arrived in Singapore and was staying at Supreme Hotel.84 On 5 April 2000 the first accused moved out of Broadway Hotel and checked into\n\nStarlet Hotel. Again, he called the second accused and gave him the name and telephone number of his\n\npresent address. Lou was also advised of the transfer. At about 5.00pm on 5 April 2000 he met the\n\ncourier, the third accused near Supreme Hotel. When he met the third accused he came to realise that\n\nthere were two suitcases instead of one. He was surprised. The third accused informed him that\n\nsomeone had given him two suitcases at the Lahore Airport and instructed him to deliver them to one\n\nHash in Singapore. The first accused knew that Mumtaz Abbasi referred to him as Hash.\n\nThe first accused after informing the third accused that he would take over the suitcases in a few\n\ndays, left the place.85 On 6 April 2000 the first accused learnt from Lou that Ray had arrived in\n\nSingapore. Later that morning when he returned to the hotel after shopping, there was a message for\n\nhim from Ray to contact him at 11.00am on 6 April 2000. Ray had left his mobile phone number in the\n\nvoicemail. A few moments later he received a call from the second accused stating that he was also\n\nin Singapore and staying at Grand Central Hotel. According to the first accused, the second accused\n\nhad arrived in Singapore earlier than expected. He was to arrive only after the first accused had\n\nreceived the monies.86 Soon, the first accused went to the second accuseds hotel to meet him where\n\nthey talked about the scam: to give Ray the suitcases; to tell him that the drugs were in the\n\nsuitcases; test only the samples; not to open the suitcases; take Rays money and leave Singapore.87 Before the first accused met the second accused, the first accused had called\n\nearlier. Ray had told him then to call him at 4.00pm that day as he had to meet someone. Later at\n\nabout 4.00pm he called Ray on his mobile phone and consequently an appointment was made to meet Ray\n\nat 5.00pm that day.88 At about 5.00pm, the first and the second accused met Ray at the lobby of the\n\nRiver View Hotel. A woman who looked like a Chinese (Elliot) was there. The first accused was taken\n\naback by her appearance since he was earlier informed by Lou that Rays girlfriend was a tall\n\nblonde. However his suspicions abated when Ray asked Elliot to hand over a bag to Ray and showed him\n\nthe monies inside. He believed at that time Ray had US$120,000 with him for payment. Elliot left\n\nthem shortly thereafter at the request of Ray.89 Ray and the two accused presently proceeded to the room of Ray at the hotel.\n\nAt the room, Ray mentioned to the first accused that he was informed by Lou that there were in fact\n\nfive jackets (reference to five kilograms of heroin) for collection. Although the first accused had\n\npreviously never discussed with Lou for more than two jackets, he was content to talk about five\n\njackets as he thought that this was good for the cheating (sic) scam (page 1777 of the NE,\n\nline 19).90 The first accused added that: Lou [was] paying for 2 jackets and 3 hes\n\ngetting on credit  3 jackets  (page 1777 of the NE, lines 21 to 24).91 As the conversation continued, Ray was intent on checking what the first\n\naccused had brought from Pakistan but the two accused were not agreeable to open the suitcases. They\n\nwanted only the samples to be tested. They did not want the suitcases to be examined because the\n\nsuitcases were not supposed to contain anything.92 The first accused confirmed that he had, prior to the commencement of the\n\ntrial, watched the video-tapes replayed in court and had read the transcripts thereon. He added that\n\nin that meeting with Ray the second accused did most of the talking. Finally, it was agreed that he\n\nand the second accused would decide whether they would let Ray open the suitcase (sic) (pages 1779\n\nto 1783 of the NE).93 Shortly later, both the first and the second accused left Rays room for the\n\nsecond accuseds hotel room. After their arrival, the first accused used the public telephone at\n\nthe lobby and complained to Lou about Rays insistence in opening the suitcases. Lou told him that\n\nRay was his boss and let him do what he wanted. He advised the first accused not to blow the deal.94 The first accused was concerned. He went to the second accuseds room and\n\ndiscussed how to handle the situation. In the end, he suggested to the second accused: We do this\n\nsame cheating to Faribourg. (page 1787 of the NE). The second accuseds reply was: We dont\n\nknow how long Faribourg will [take to] come to Singapore. We have only 14 days visa. (page\n\n1789 of the NE). So they decided to try Ray again. The upshot was the first accused returned to\n\nvisit Ray again in his room. This time the second accused did not accompany him.95 When Ray saw the first accused without any suitcases he was upset. He was mad\n\nat the first accused for calling Lou. The first accused explained to him that it was agreed\n\npreviously that the suitcase would not be opened in Singapore. Ray retorted: I must see my stuff\n\nbefore I pay you. The first accused then gave him a sample which he had brought with him. Ray was\n\nnot satisfied with the sample. The first accused told him to test the samples. In the event, the\n\nsample was tested. Ray still asked him: OK where is the suitcase? The first accused replied\n\nthat he needed some money to give to the courier so that the courier could deliver him the suitcase.\n\nRay was adamant and said: No, there is no money unless I see the suitcase (page 1793 of the\n\nNE). The first accused returned to Grand Central Hotel and told the second accused that Ray was very\n\nstubborn. The second accused then told him to show Ray the suitcases.96 The first accused thereafter telephoned the third accused at about 9.00pm and\n\nasked him to meet the first accused at the McDonalds Restaurant at Centrepoint at 9.30pm with the\n\nsuitcases. The third accused obliged and delivered the two suitcases to him and then asked for\n\nmoney. The first accused after telling him that he would call him later left the place. As he was\n\nlater walking along the road looking for a taxi to return to see Ray, the second accused went past\n\nhim. About 20 minutes later, he managed to get a taxi and arrived at River View Hotel. Ray was\n\nwaiting for him at the lobby since the first accused had telephoned him a little earlier. Ray got\n\nhold of one suitcase and escorted him to his room.97 Ray placed the suitcase he was carrying on the bed in the room. He tried to\n\nopen the suitcase but found it locked. Ray exclaimed: What is this? (page 1798 of the NE). The\n\nfirst accused then asked for the money. Ray replied that the first accused had already seen the\n\nmoney and that he was trying to cheat him. Ray looked very upset. At that time the first accused\n\nfelt that the scam [was] going to fail (page 1798, lines 16 to 17). The first accused did not\n\nwant to open the suitcases and told Ray that drugs were concealed inside and he did not have to open\n\nthem to see it. According to the first accused there was nothing inside the suitcases and they were\n\nall empty (page 1799 of the NE).98 At any rate the first accused did not have the keys to the suitcases. He then\n\ncalled the third accused and asked for the keys. The third accused agreed to bring the keys to River\n\nView Hotel. Consequently, Ray and himself went downstairs to the lobby. The third accused arrived\n\nshortly, handed the keys to him and departed.99 After receiving the keys from the third accused, both of them returned to Rays\n\nroom. Both suitcases were opened but they were both empty. Ray then queried the first accused as to\n\nthe whereabouts of the drugs. The first accused replied they were concealed inside. Thereafter, Ray\n\ngave a knife to the first accused and asked him to look for the drugs inside the suitcases. The\n\nfirst accused knew that there were no drugs in the suitcases. Both of them, nonetheless, tried to\n\nlocate the drugs but failed.100 Ray then suggested to the first accused that he should call the second\n\naccused to find out where the drugs were. The first accused then called the second accused and told\n\nhim that the scam had failed and that Ray had opened both the suitcases. The second accused\n\nwanted to know what Ray wanted. The first accused told him that Ray wanted to know where the paper\n\nwas. Both he and the second accused knew what the word paper meant. The word was coined by\n\nthem as part of the scam to mean drugs. The second accused replied that it was becoming a\n\nmess. He said that he would think about it and call him back soon. A few minutes later the second\n\naccused called him back and advised him what to do. Consequently the first accused suggested to Ray\n\nto break the suitcases and check everywhere. So Ray started again to dig the panelling of the\n\nsuitcase with his knife.101 After about five or six minutes, he heard Ray say: Here it is. Since\n\nthe first accused did not expect anything inside the suitcases, he was shocked to see the drugs\n\n(page 1810B of the NE, lines 11-15). At about this time, the second accused called. The first\n\naccused expressed his surprise and told him: Where is the drug coming from? He replied: It\n\nis impossible. I dont know. The second accused added that it must be a mistake by Mumtaz\n\nAbbasi at the Lahore Airport. I asked him: What do you mean by this? The second accused\n\nreplied: Just come and we talk later and then hung up the phone (page 1810C of the NE).102 Ray appeared happy but the first accused was worried and was anxious to\n\nescape from all this. His thinking then was not to take any money but to run away from the place.\n\nAfter Ray had made a phone call saying: Honey we are coming, both of them left the room. The\n\nfirst accused carried both the suitcases at the request of Ray. He was told to hand over the\n\nsuitcases to the girl downstairs and she would give him the money.103 The suitcases (exhs P-52 and P-53) were in the event taken by the first\n\naccused to the hotel lobby. As he was trying to go out of the hotel with a view to dumping the\n\nsuitcases outside and get away from the place he was arrested by CNB officers. He said that his plan\n\nwas merely to cheat Ray. The scam he conceived was to give an empty suitcase to Ray telling him that\n\neverything was concealed inside employing a new system and to give him only a sample of what was\n\nsupposed to be inside the suitcases. To give credibility to the scam, the feature of a courier was\n\nadded.104 He was extensively cross-examined by other defence counsel as well as the\n\nDPP. Many an aspect of his cross-examination would be referred to if need be, later in this grounds.\n\nHowever it would be sufficient if I said that he maintained his stand that he came to Singapore in\n\norder to cheat Ray and obtain monies from him under false pretences; he never intended to deliver\n\nany drugs to Ray; and that he was greatly taken aback by the inexplicable presence of heroin in the\n\nsuitcases. He maintained that whatever statements given by him to ASP Fan were merely for the\n\npurposes of giving him a good statement and not otherwise. He also retracted some segments of his\n\nstatements which need not be detailed here.",
        "Evidence of the second accused": "105 The evidence of the second accused insofar as is material is as follows.106 He is a Pakistani National, born on 28 November 1950. For the past 10 to 12\n\nyears he had been supplying defence equipment to the Pakistani Army. He had also been dealing in\n\nelectronic goods, photostat machines, computer parts, faxes and other goods. The firm which he owned\n\nwas known as Management & Marketing Services International. He arrived in Singapore on 6 April\n\n2000 for the main purpose of making inquiries in respect of some cabin compressor parts.107 He met the first accused about 10 to 12 years ago in New York for the first\n\ntime. They exchanged addresses and telephone numbers. In 1998, the first accused paid a visit to his\n\noffice to tell him that he was moving to London.108 The next occasion they met was when the second accuseds father passed away\n\nin June 1999. The first accused called on him to pay his condolences. Later, at the end of June\n\n1999, the first accused again paid him a visit. This time the first accused told him that he was in\n\nleather garment business, had a small factory and was looking for an office space. As the second\n\naccused had a large office, he was prepared to accommodate the first accused. Eventually, it was\n\nagreed between them that the first accused would bear 50 per cent of the expenses incurred. However,\n\nafter about five months, the second accused admitted the first accused as his business partner in\n\nDecember 1999.109 The first accused often came to the office bringing with him leather purses,\n\nleather jackets and other leather goods. The first accused made use of the fax and e-mail facilities\n\navailable at the second accuseds office premises.110 In November 1999, about a month before both of them entered into a\n\npartnership deed, the first accused told him that he was in the course of securing a large order for\n\nleather jackets from overseas and would be receiving an advance payment. In fact, the first accused\n\nhad shown him orders for the supply of leather jackets in large numbers from the US, UK and\n\nAustralia and told the second accused that he was going to receive a lot of money. The second\n\naccused never suspected that the first accused was doing anything irregular. In the main, the\n\nagreement between themselves was that each would concentrate on his own area; the first accused\n\nwould not transgress into the second accuseds defence procurement business and the second accused\n\nwould not interfere with the leather business of the first accused.111 The first accused never mentioned or talked about drugs to him at any time.\n\nBefore his arrival in Singapore, the second accused had spoken to Lou only once. The first\n\naccused had sometime in January or February 2000 told him that Lou was engaged in leather business\n\nin the US and that he was his buyer.112 As he learnt that Lou was the first accuseds business partner, he had\n\nspoken to Lou once and greeted him. He, however, had no communication with Ray whilst in Pakistan.\n\nHe did not suspect that the first accused had anything to do with drugs; neither did he overhear any\n\nconversation between the first accused and any person concerning drugs nor did he come across any\n\ndocuments where there was any mention of drugs. The first accused never told him about any drugs\n\ndeal with Lou. If such a transaction was mentioned, he would have thrown the first accused out of\n\nhis office immediately.113 The second accused had visited Singapore many times previously. He came here\n\nmainly to procure electronic goods which were either unavailable in Pakistan or were too expensive\n\nthere.114 When asked about the name Mumtaz Abbasi, the second accused said that\n\nMumtaz Abbasi was a friend of the first accused and the latter had sold his house through him. Apart\n\nfrom that he knew nothing about Mumtaz Abbasi.115 Reverting to Lou, the second accused said that the first accused\n\nmentioned to him in February 2000 that he was going to meet Lou in Paris. However, the first accused\n\ncould not get a visa to go to Paris did not make the trip. Then sometime in March 2000, the first\n\naccused told him that Lou was going to Singapore and that the first accused would be meeting him\n\nthere. However, the planned trip did not materialise. Then at the end of March 2000, the first\n\naccused told him that he would be going to Singapore to meet Lou; Lou was going to make him some\n\nadvance payments in return for some samples. The second accused learnt from the first accused that\n\nthe order was for the supply of 2,000 leather jackets.116 The second accused informed the first accused that he had also been intending\n\nto visit Singapore since he too had to make some inquiries there. The first accused then told him\n\nthat if the second accused were to be in Singapore, the first accused would pay him a substantial\n\nsum to clear part of his debts to the second accused. The first accused wanted the second accused to\n\nhelp remit monies to Pakistan from Singapore as the first accused was planning to stay in Singapore\n\nfor a while.117 By the end of March 2000, as he was unable to get the required spare parts in\n\nPakistan, the second accused decided to visit Singapore. He booked his flight only two days before\n\nhis arrival here. His main object was to buy cabin compressor parts for supply to the Civil Aviation\n\nAuthority, Karachi, Pakistan. In this connection, he produced a list (marked exh D-6). He added that\n\nexcept for the sums owed to him by the first accused, his firm was doing financially well. The first\n\naccused was indebted to him in the sum of Pakistani RS550,000 (Rs55 to US$1), out of which he had\n\nrepaid only RS40,000.118 The first accused arranged with the second accused that once the former had\n\nreached Singapore, he would telephone him. On 4 April 2000, the first accused indeed telephoned him\n\nsaying that he had arrived in Singapore and provided him with the telephone number of the hotel\n\nwhere he was staying. In fact, before the first accused left for Singapore, the second accused had\n\ngiven him the locations of a few hotels in Singapore. Later, the first accused called him again to\n\nsay that he had moved to another hotel by the name Starlet Hotel and gave him its telephone number.119 The second accused left Karachi on 5 April 2000 and arrived in Singapore on 6\n\nApril 2000 at about 6.15am. The final tender for cabin compressors was to be submitted by 9 April\n\n2000. By this time, he had to be back in Pakistan. If he could not get the spare parts in Singapore\n\nhe would have to leave for Hong Kong to make enquiries. After his arrival at about 9.00am he called\n\nthe first accused. They then agreed to meet later and have lunch. The first accused in the event\n\ncalled at his room later. Their conversation was general in nature and about the defence equipment\n\nthe second accused was trying to source. The first accused on his own mentioned that his buyer was\n\nin Singapore and he was meeting him later that day.120 After lunch the first accused left the second accused briefly and when he\n\nreturned later requested the second accused to accompany him as he would be collecting some advance\n\npayments from his buyer: The first accused mentioned that two persons would be better than one.121 The second accused agreed to accompany the first accused because the latter\n\nhad informed him that he wanted to show his buyer some leather samples and persuade him to make the\n\nadvance payment. The first accused represented to him that the order which he had received was a\n\nsubstantial one valued at US$300,000. Earlier whilst they were in Pakistan the second accused heard\n\nfrom the first accused that the order was for the supply of between 4000 and 5000 leather jackets.122 Following the request, the second accused accompanied the first accused to\n\nmeet the buyer. Later as both of them arrived at the lobby of River View Hotel, the first accused\n\nintroduced Ray to him. They all sat at a table. A lady (subsequently identified as Elliot) was also\n\nwith them at that time.123 There was a discussion between Ray and the first accused at the table. He\n\noverheard Ray telling the first accused that he was tired because his flight was very long. The\n\nsecond accused interjected and said that he too was tired. A short while later, the second accused\n\nnoticed Ray receiving a bag from Elliot and from that he removed a smaller bag from within, placed\n\nit in front of the first accused, unzipped the bag briefly and zipped it back. The second accused\n\ndid not see what was inside the bag (page 2184 lines 8 to 17). Whatever that was said by Ray when he\n\nwas unzipping and zipping the bag was not comprehended by the second accused due to Rays accent\n\nand the speed with which he was talking; the second accused could catch only some of the words (page\n\n2185 of the NE).124 After the bag was zipped back, it was handed back to Elliot by Ray and soon\n\nElliot left. Later at the invitation of Ray, both he and the first accused proceeded to Rays\n\nhotel room.125 Once they had entered the room, Ray showed some photographs to the first\n\naccused. The second accused had only a brief glance at them.126 The second accused said that whilst he was at Queenstown Remand Prison he had\n\nseen the video recording of what transpired in the room; he had also seen them replayed during the\n\ncourt proceedings and had read the transcripts. He admitted that whilst in Rays room on that\n\noccasion he did most of the talking.127 He explained that he went to Rays room because the first accused requested\n\nhim to do so as the latter was expecting some advance payment for the supply of leather jackets. The\n\nsecond accused said: I did not have any idea in my mind about drugs because Hashim had told me\n\nthat he was to receive advance money and I was talking in relation to that (page 2188, lines 16\n\nto 22).128 The second accused added that during their conversation he could not\n\nunderstand some of the things which were said and he didnt understand the English language (page\n\n2189, line 10). At some stages when Ray was talking he could not understand what he said and\n\ntherefore asked the first accused in Urdu what Ray was saying. At one stage, he even told the first\n\naccused in Urdu: Where have you brought me? I shouldnt have been coming here. (page 2189\n\nlines 17 to 21). But the first accused gestured to him to remain seated.129 He maintained that throughout the entire conversation he never used the word\n\ndrugs. He did not know that the code word jacket meant heroin. He thought the word Ki\n\nuttered by Ray was in reference to the word key (page 2191 of the NE). As regards his own\n\nwords: Its very, very, very, very nice  most latest system which is already known there\n\nappearing in the transcripts (page 8, line 9), he claimed that it was a reference to leather jackets\n\n(pages 2192 to 2193 of the NE). When he uttered the figure $300,000 and topmost quality during\n\nthe conversation, he was also referring to leather jackets and nothing else (page 2196 of the NE).\n\nHe claimed that when he said that  the things which are packed they are really very highly,\n\ntechnically packed, and if you open them there  , he was merely repeating what the first\n\naccused had told him about the jackets earlier that they were technically packed and if he were\n\nto open the things, then he would have difficulty in taking them back (page 2198 of the NE lines\n\n1 to 8).130 The second accused admitted receiving a telephone call from the first accused\n\nand asking him about papers and things. But his explanation was that when the first\n\naccused called him, he thought the first accused was referring to a telephone number written by the\n\nfirst accused on a piece of paper earlier. He did not however, understand what was meant by the\n\nexpression things. Therefore, when the first accused asked about the papers he simply replied:\n\nthe paper is with me. When the first accused asked him where are the things, he thought\n\nthat the first accused wanted the second accused to call the telephone number written on the paper.\n\nOn that assumption, the second accused told the first accused that he would call the given number\n\n(page 2202 of the NE). As a result, the second accused called the telephone number 2851074 in\n\nPakistan and spoke to one Naseem Khan or Naseem Ahmet and conveyed to him that the first\n\naccused wanted to speak with him.131 The second accused denied that he had told the first accused to break the\n\nsuitcases to find the drugs (page 2209 lines 9 to 16).132 The second accused claimed that after the first accused and he left Rays\n\nhotel room after their meeting, the second accused questioned the first accused: Where did you\n\ntake me to and what is the whole matter about and what does your leather garment buyer want.? The\n\nfirst accuseds alleged reply was: You will not understand all this. When the second accused\n\nheard this he told the first accused that if that was the case, he would not meet Ray anymore and\n\nthat he would not get himself involved in any deals with him (page 2213 of the NE lines 6 to 22).133 The second accused claimed that after this he did not see the first accused.\n\nLater that evening he was arrested in his room and was taken to the CNB where he saw the first\n\naccused and later the third accused. He also saw three CNB officers scraping the suitcases. He did\n\nnot suspect anything at first but when he was told that heroin had been found inside, he was\n\nshocked.134 The second accused maintained that he did not know anything about the\n\nsuitcases, to whom they belonged or what was inside them. He also denied the version given by the\n\nfirst accused in his testimony that there was a scam to cheat the leather buyer and the second\n\naccused was aware of the scam. He said that he did not know of any scam and he came to Singapore\n\nmainly to source for compressor parts and would have taken the monies to Pakistan if the first\n\naccused happened to receive an advance for his reported leather jacket orders (pages 2233 and 2234\n\nof the NE). He added that in the meeting with Ray in the hotel room, he was not engaged in assisting\n\nthe first accused to cheat Ray.",
        "Final speeches and conclusions": "(a)First accused164 The charge against the first accused was that on 6 April 2000 at River View\n\nHotel, Singapore, he trafficked in a controlled drug by having in his possession for the purpose of\n\ntrafficking about 5 kilograms of heroin in two suitcases containing not less than 2,871.2g of\n\ndiamorphine, an offence punishable under s 5(1)(a) read with s 5(2) and punishable under s 33 of the\n\nMDA.165 Sections 5(1)(a) and 5(2) of the MDA read as follows:5-(1) Except as authorised by this Act or the regulations, it shall be an\n\n  offence for a person, on his own behalf or on behalf of any other person, whether or not that\n\n  other person is in Singapore to -(a) traffic in a controlled drug; or(2) For the purposes of this Act, a person commits the offence of trafficking\n\n  in a controlled drug if he has in his possession that drug for the purpose of trafficking.166 It was not in dispute that the drugs found in the two suitcases (P-52 and\n\nP-53) carried by the first accused and seized at the scene of arrest contained not less than the\n\namount stated in the charge. The scientific evidence as to analysis as well as the claim of evidence\n\nin relation thereto were also not disputed by the defence.167 The submission by counsel for the first accused, delaminated of all excess,\n\nwas simply this: That the first accused came to Singapore not to traffic in any drugs but to execute\n\na scam on Ray, by which Ray would be induced to hand over a large sum of money on the pretext\n\nthat the latter was going to receive a suitcase containing heroin (which turned out to be two\n\nsuitcases) although there would not be any drugs in those suitcases.168 Counsel for the first accused submitted (para 37 of the submission) that the\n\nscam bottomed out and failed when the suitcases were opened and worse, drugs were eventually found\n\nwithin. The first accused was shocked. As a result the first accused was stunned speechless; he even\n\nneeded a drink and in fact was looking for an opportunity to leave the room. Later as the first\n\naccused started to walk towards the entrance of River View Hotel, intending to get out of the place\n\nquickly, he was stopped and arrested at the lobby by a few CNB officers.169 In my determination, the defence put forward by the first accused that he\n\ncame all the way to Singapore to deliver an empty suitcase to a drug buyer and receive a substantial\n\nsum of money in return for the said empty suitcase appeared to border on the ludicrous.170 If he was indeed intending to deliver empty suitcase or suitcases, why didnt\n\nhe simply walk away soon after he and Ray were unable to locate the whereabouts of the supposedly\n\nhidden (for that matter allegedly non-existing) substance. Could he not have excused himself from\n\nRay stating that he had to return to his hotel to check with his business associate as to the\n\nwhereabouts of the drugs and use that occasion to vanish once and for all? At any rate, why did he\n\nhave to telephone the second accused and ask for instructions and later convey to Ray that the drugs\n\nwere stored on the inside ends of the suitcases?171 The first accused was seen twisting and turning in the witness box. Many an\n\nanswer by him was glib and tentative. Rays evidence that there was a confirmed order for heroin\n\ncould not be doubted. The first accused, for all to see, was caught red-handed with the offending\n\nsubstance when he was at the hotel to hand-deliver them to an undercover agent. All his actions and\n\nwords on the evening of 6 April 2000 were caught in the audio and video-recorders put in place by\n\nthe law enforcement agencies. His attempted defence that there was never any intention on his part\n\nto deliver drugs to Ray was totally decimated by the materialisation of nearly 5 kilos of heroin\n\nfound in the suitcases. Was it a pure miracle or an inexplicable preternatural phenomenon that\n\nbrought forth about 5 kilograms of heroin, the amount coincidentally mentioned by the first accused\n\nbefore the sides of the suitcases were prised open?172 In my view the defence of the first accused was a hopeless and rickety\n\ngambit, hastily assembled, ill-thought out, ill-prepared and ineptly presented  no reflection on\n\ncounsel. The story narrated by him defied common sense and reason; it was unreal, weird and entirely\n\nrid of substance.173 The video-tapes played in court and the transcripts provided gave a clear\n\nimpression that the on-going negotiation at the hotel was not a mere sham but a serious and sinister\n\nenterprise to deal in drugs then and in future. Furthermore, it would be inconceivable that the\n\nempty suitcases to be delivered in Singapore would soon turn out to be a storehouse for 5 kilograms\n\nof heroin. The first accuseds story in my finding was nothing but a tissue of lies. The sample of\n\nheroin he carried with him on that day further belied his defence.174 In coming to my conclusion, I did not have to rely on any of the\n\nconfessionals admitted in evidence by the prosecution. In my finding, the prosecution had proven\n\nbeyond a reasonable doubt that the first accused was not only in physical possession of the drugs\n\nbut also had knowledge of the existence of the drugs, the nature of the drugs found in the suitcases\n\nand that he was in possession of the drugs for the purposes of trafficking.175 As submitted by the learned DPP, there was ample evidence to justify the\n\nconclusion that the possession of drugs by the first accused was for the purpose of trafficking: In\n\nthis the following aspects were in my opinion significant:(a) Ray talked to the first and second accused of Colombia and Bangkok and;(b) both the first and the second accused discussed with Ray the sale of the\n\n  drugs to Ray including its price;(c) they discussed future sales;(d) the first accused provided a sample of heroin to Ray for testing;(e) the suitcases were hand-delivered by the first accused to Ray;(f) the money had been shown to the first accused earlier; and(g) the first accused was keen to exchange the suitcases for cash.176 Reviewing the evidence in its totality, the inescapable conclusion was that\n\nthe first accused was in Singapore to traffic in heroin found in his possession on 6 April 2000. If,\n\nas he claimed, the whole exercise was meant to be a sham, he did not have to enlist the help of a\n\nthird party (ie, Naseem Khan) to arrange for the suitcases to be flown all the way from Lahore to\n\nSingapore.177 In the circumstances, after being satisfied that the prosecution had proven\n\nits case beyond a reasonable doubt and that the first accused had not established his defence on\n\nbalance of probabilities, I found him guilty as charged and sentenced him to the only punishment\n\nprescribed under the law.(b)Second accused178 The second accused faced an amended charge that on 6 April 2000 at River View\n\nHotel, he engaged himself with the first accused in a conspiracy to traffic in diamorphine and in\n\npursuance of the conspiracy, offered to sell to Ray about 5 kilograms of heroin containing not less\n\nthan 2,871.2g of diamorphine and he thereby abetted the commission of the offence of offering to\n\ntraffic in the drugs, an offence under s 5(1)(b) read with s 12 and punishable under s 33 of the\n\nMDA.179 The charge was amended on 19 January 2001 from one under s 5(1)(a) to one\n\nunder s 5(1)(b) of the MDA. In the result, an opportunity was afforded to the second accused to\n\nrecall and re-examine witnesses pursuant to s 167 of the CPC but counsel for the second accused\n\ninformed the court that it was unnecessary since the amendment did not introduce any new element to\n\nthe charge.180 Section 5(1)(b) of the MDA provides:5-(1) Except as authorised by this Act or the regulations, it shall be an\n\n  offence for a person, on his own behalf or on behalf of any other person, whether or not that\n\n  other person is in Singapore to -(b) offer to traffic in a controlled drug;181 Section 12 of the MDA reads thus:Any person who abets the commission of or who attempts to commit or does any\n\n  act preparatory to, or in furtherance of, the commission of any offence under this Act shall be\n\n  guilty of that offence and shall be liable on conviction to the punishment provided for that\n\n  offence.182 It would also be useful to remember that the word traffic appearing in\n\nthe MDA has been defined under s 2 of the Act to mean:(a) to sell, give, administer, transport, send, deliver or distribute; or(b) to offer to do anything mentioned in paragraph (a) [above].183 As submitted by the prosecution that the prosecution had to prove the\n\nfollowing ingredients to bring home a conviction against the second accused:(1) That the second accused was engaged in a conspiracy with the first accused;(2) That as conspirators, both of them agreed to traffic in diamorphine, a\n\n  controlled drug, this being the object of the said conspiracy.(3) That pursuant to this conspiracy, the second accused abetted the offence by\n\n  offering to sell Ray 5 kilos of heroin containing not less than 2871.2g of heroin.184 Before dealing with the submissions made in respect of the guilt or innocence\n\nof the second accused, reference should be made to what the Court of Appeal said inVinit\n\nSopon & Ors v Public Prosecutors[1994] 2 SLR 226, where Yong Pung How CJ, in delivering\n\nthe judgment of the Singapore Court of Criminal Appeal, said at page 241E-G:The charge against the third appellant was one of abetment by conspiracy.\n\n  Section 12 of the MDA provides that a person who abets the commission of any offence under the Act\n\n  shall be liable on conviction to the punishment provided for that offence. Although abet is\n\n  not defined in the MDA, it bears the same meaning as in s 107 of the Penal Code, by virtue of s 2\n\n  of the Interpretation Act (Cap 1), which states:abet with its grammatical variations and cognate expressions, has the\n\n    same meaning as in the Penal Code.Conspiracies under s 107(b) of the Penal Code are proved generally from\n\n  inference of conduct as it is often difficult to have direct evidence of conspiracy. Even in a\n\n  criminal case, it can be inferred from circumstantial or oral evidence. It may be proved by\n\n  evidence of surrounding circumstances and the conduct of the accused both before and after the\n\n  alleged commission of the crime.185 In relation to abetment by conspiracy, inLai Kam Loy & Ors v\n\nPublic Prosecutor[1994] 1 SLR 787, Yong Pung How CJ commented at 795:As for the second and third appellants, the charge against them was one of\n\n  abetment of trafficking by conspiracy. The ingredients which the prosecution had to prove were the\n\n  existence of a conspiracy to do an illegal act, with the result that the illegal act which was the\n\n  object of the conspiracy was actually carried out. The latter ingredient was not in issue as the\n\n  object of the conspiracy was the delivery of drugs which was effected by the first appellant. The\n\n  question that arose was whether the second or the third appellant was party to the conspiracy to\n\n  deliver the drugs. The essence of a conspiracy is agreement and in most cases the actual agreement\n\n  will take place in private such that direct evidence of it will rarely be available. A frequent\n\n  method of proving a conspiracy is to show that the words and actions of the parties indicate their\n\n  concert in the pursuit of a common object or design, giving rise to the inference that their\n\n  actions must have been co-ordinated by arrangement beforehand. We emphasize that these acts do not\n\n  of themselves constitute the conspiracy but constitute evidence of the conspiracy.The question that a trial court must ask itself at the end of the trial was\n\n  stated succintly by Huggins J inR v Chau Sau-Tai, which is whether, in respect of each\n\n  alleged conspirator, the court is satisfied that, on the evidence as a whole, he must have\n\n  conspired with one or more of the others.186 InPublic Prosecutor v Sugianto & Anor[1994] 2 SLR 1, the\n\nCourt of Appeal reiterated at page 16:The essential ingredient of a conspiracy is agreement. (See the judgment of\n\n  the Court of Appeal inLai Kam Loy & Ors v PP.) From the very nature of a conspiracy,\n\n  direct evidence will hardly ever be available. It is evident, therefore, that the existence of a\n\n  conspiracy will have to be inferred from the evidence and all the surrounding circumstances of the\n\n  case.187 In essence, the prosecutions case against the second accused centred\n\naround the evidence of the DEA undercover agent Ray; the audio-video recording made at the River\n\nView Hotel and the transcripts thereon.188 The second accuseds defence as summarised by his counsel in his closing\n\nsubmission (paras 8 and 9) was as follows:8. In essence Afzals defence was that:-(1) he never conspired with Hashim to sell any drugs to Ray;(2) he never arranged for any courier to bring the drugs to Singapore;(3) he did not negotiate for the sale of any drugs to Ray in Rays room in\n\n    River View Hotel;(4) he did not know anything about the 2 suitcases and their contents which\n\n    Naveed delivered to Hashim;(5) he did not meet and speak to Hashim in the vicinity of Orchard Plaza when\n\n    Hashim was carrying the two suitcases;(6) he had not called any drug supplier in Pakistan;(7) he did not make a call to Hashim telling him how to locate the drugs in\n\n    the two suitcases;(8) he did not make a phone call from a public telephone at a bus stop\n\n    outside Orchard Plaza on 6.4.2000 at about 11.00 p.m;(9) that he was in Singapore on legitimate business to source for cabin\n\n    compressor spare parts;(10) that Hashim who was his business partner in Pakistan had falsely\n\n    implicated Afzal in this case for his own ends; and(11) that he was not involved in any cheating scam as alleged by Hashim.189 In short, the second accuseds explanation was that he was an innocent\n\nbusinessman drawn into this mess, without his knowing by his scheming and conniving partner, the\n\nfirst accused. He denied that he had anything to do with the drugs found in the suitcases and that\n\nhis presence at the River View Hotel was merely to lend support to his partners leather jacket\n\nbusiness and nothing else. He told the court that his main purpose in coming to Singapore was to\n\nsource for cabin compressor parts which he required for a tender exercise closing on or about 9\n\nApril 2000 although he would have assisted in remitting whatever advance payments the first accused\n\nwas hoping to receive from his leather garment buyer. In this connection he even produced a list of\n\nequipment to be purchased which was found with him when he was arrested. His counsel urged me to\n\naccept his defence; reject both Rays evidence as well as the first accuseds claim that the\n\nsecond accused was an active partner in the so-called scam.190 I must say at the outset that after due consideration I did not accept the\n\nclaim of the first accused that there was a so-called scam. I found it to be a pure myth and\n\nconsequently dismissed it as unworthy of belief and credit.191 However, the transcripts as well as the video presentation gave a clear\n\nimpression that the second accused was neck-deep in this drug conspiracy. The video-tape played in\n\ncourt and the transcripts confirmed that he was the chief orator in Rays room.192 His defence was found by me to be wholly against the drift and grain of some\n\ndirect and compelling evidence before the court. His mention in the hotel room of: (a) We have\n\nvery, very, very new item, very, very safe items  (page 6 of the transcript) (b) a special\n\nsystem that is very new (page 6 of the transcript), (c) come right from  North East Asia\n\n(page 7 of the transcript); (d)   there is no match, this product made in Columbia. No match.\n\n(page 13 of the transcript); (d)   We do business with topmost quality  so much risk right\n\nfrom one place to other place (page 17 of the transcript); (e) we will always give you the\n\ntopmost quality, crystal, topmost (page 18 of the transcript); (f) if there is transit, then\n\nno problem but there can be hassles(page 26 of the transcript) (g)  the guy has sample also\n\nopened sample also very little (page 28 of the transcript); (h)  we often come here, we travel\n\nhere, its easy. Its very dangerous also. (page 32 of the transcript); (i) the things which\n\nare packed they are really very highly technically placed and if you open them  (page 37 of\n\nthe transcripts) and a reference to a sample sent in a Christmas card (page 24 of the transcript)\n\n all read in the context of the exchange between Ray, the first and second accused, left no room\n\nfor doubt that what the second accused was talking about in the hotel room; his entire conversation\n\nwas about top quality drugs and not leather jackets in their true sense.193 The second accused endeavoured to explain that he was at all times making\n\nreference to leather jackets and did not quite comprehend or follow what Ray was talking about due\n\nto Rays peculiar accent and diction. Watching the video not once but many times, the distinct\n\nimpression the court had was that the second accused knew what Ray was talking about and his present\n\nexplanations were nothing but fabrications on his part.194 In fact, the segment which is reproduced below seemed to entirely nullify the\n\nsecond accuseds claim that he did not know that Ray was talking about drugs since the words it\n\nis all concealed in the suitcase were this time clearly uttered not by Ray but by his partner in\n\ncrime, the first accused:Pages 6 and 7 of the transcript:KHAN: So we will tell you what we did. We did a very, very---and very, very\n\n    nice (Urdu). (Urdu)HASHIM: Well, weve got a special system that is very new.OFFICER: Im lost.HASHIM: \"Im lost\"?OFFICER: Im lost. Oh, you got to mean carrying.HASHIM:It is all concealed in the suitcase, so you dont have to worry\n\n    about taking there.OFFICER:Well, OK, you mean the actual heroin itself, OK.KHAN: It came right from---OFFICER: It came from the area.KHAN: North East Asia.OFFICER: OK. Now, my question is this, I want to see my product before I pay\n\n    you. Do you understand that? Because I didnt come half way around the world not to see my\n\n    drugs. I got my courier, shell take care of everything for me. She knows how to get it. Shes\n\n    a professional. She has been working for me since I started my business. OK?KHAN: OK.[Emphasis added.]195 Having reviewed all the evidence in its totality after discounting what the\n\nfirst accused said about the second accuseds role, the only compelling conclusion was that the\n\nsecond accused was on 6 April 2000 actively engaged in a conspiracy with his business partner, the\n\nfirst accused and abetted him in the commission of the offence spelt out in the charge. In my\n\nfinding, the second accuseds evidence was replete with untruths and was an exercise in\n\nskulduggery. I was in the end satisfied beyond a reasonable doubt that the prosecution had proven\n\nbeyond a reasonable doubt by direct and unequivocal evidence that the second accused was guilty of\n\nthe offence charged. In the premises, I found him guilty, convicted him and sentenced him to the\n\nmandatory punishment prescribed under s 33 of the MDA.(c)Third accused196 The charge facing the third accused was that on 6 April 2000 at about 9.53pm,\n\nhe trafficked in a controlled drug outside Centrepoint Shopping Centre, Singapore, by delivering two\n\nsuitcases containing not less than 2871.2g of diamorphine to the first accused and thereby committed\n\nan offence under s 5(1)(a) punishable under s 33 of the MDA.197 Section 5(1)(a) of the MDA has already been reproduced elsewhere in this\n\ngrounds and therefore requires no repetition. The fact that the two suitcases seized by the CNB from\n\nthe first accused (exhs P-52 and P-53) were the same suitcases delivered by the third accused to the\n\nfirst accused was not disputed by the third accused. He also did not dispute that at about 10.45pm\n\non 6 April 2000, he handed over the keys to the suitcases to the first accused at River View Hotel.\n\nThe scientific evidence as to the diamorphine content of the drugs found inside the suitcases as\n\nwell as the chain of evidence relating thereto were also not contested by the third accused. The\n\nonly dispute was in relation to the question whether the third accused knew that the two suitcases\n\nwhich he carried from Lahore to Singapore and handed over to the first accused on that day,\n\ncontained a controlled drug when he delivered them to the first accused.198 Counsel for the third accused seemed to concede at the outset that by virtue\n\nof the fact that the third accused had physical possession of the two suitcases in which the\n\nconcealed drugs were found, the statutory presumptions prescribed under s 18 of the MDA became\n\noperative. Insofar as is material ss 18(1) and (2) of the MDA provide as follows:18.-(1) Any person who is proved to have had in his possession or custody or\n\n  under his control(a) anything containing a controlled drug;(b) the keys of anything containing a controlled drug;(c) the keys of any place or premises or any part thereof in which a\n\n    controlled drug is found; or(d) a document of title relating to a controlled drug or any other document\n\n    intended for the delivery of a controlled drug,shall, until the contrary is proved, be presumed to have had that drug in his\n\n  possession.(2) Any person who is proved or presumed to have had a controlled drug in his\n\n  possession shall, until the contrary is proved, be presumed to have known the nature of that drug.(3) The presumptions provided for in this section shall not be rebutted by\n\n  proof that the accused never had physical possession of the controlled drug.(4) Where one of 2 or more persons with the knowledge and consent of the rest\n\n  has any controlled drug in his possession, it shall be deemed to be in the possession of each and\n\n  all of them.199 The learned DPP also submitted in the same vein and said that the presumption\n\ncontained under s 18(2) of the MDA applied and in the circumstances the third accused would have to\n\nrebut the operative presumptions on balance of probabilities (para 96 of the prosecution\n\nsubmission).200 However, it would be instructive at this stage to call to mind the applicable\n\nprinciples enunciated by the Court of Appeal in like situations.201 InSim Teck Ho v Public Prosecutor[2000] 4 SLR 39at 43, it\n\nwas held by the Court of Appeal (per Yong Pung How CJ) that:Therefore, in order to prove possession, the prosecution must prove that\n\n  there is first, physical control over the controlled drug, and second, knowledge of the existence\n\n  of the thing itself,that is the existence of the controlled drug, but not the name nor nature\n\n  of the drug.[Emphasis added.]202 In other words, in addition to proving the element of the physical control on\n\nthe part of the accused, the prosecution would also have to prove knowledge on the part of the\n\naccused as to the existence of the controlled drug.203 The next aspect relates to the defence of ignorance by the accused and the\n\nconsideration whether the accused could have been wilfully blind to the reality. In this regard,\n\nYong Pung How CJ, in delivering the opinion of the Court of Appeal inChou Kooi Pang &\n\nAnor v Public Prosecutor[1998] 3 SLR 593at 599 observed:Ignorance can only be a defence where there was no reason for suspicion. In\n\n  the circumstances, the first appellant should have been alerted to the fact that he was carrying\n\n  something illegal. He was being given a substantial sum of money just to deliver a bag to someone\n\n  in Singapore. As such, his failure to inspect the contents of the bag when he received them or at\n\n  any time until the bag was delivered to the second appellant amounted to wilful blindness to the\n\n  obvious truth of the matter:PP v Hla Win[1995] 2 SLR 424.204 Now some first principles: InTan Ah Tee & Anor v Public Prosecutor[1978-1979] SLR 211, the Singapore Court of Criminal Appeal (per Wee Chong Jin CJ) commented at\n\npages 217 and 218: Indeed if there were no statutory presumptions available to the prosecution,\n\nonce the prosecution had proved the fact of physical control or possession of the plastic bag and\n\nthe circumstances which this was acquired by the [accused], the trial judges would be justified in\n\nfinding that [the accused] had possession of the contents of the plastic bag within the meaning of\n\nthe Act unless [the accused] gave an explanation of the physical fact205 The Singapore Court of Criminal Appeal then cited with approval what\n\nLord Wilberforce said inR v Warner[1969] 2 AC 256 (HL) at 312 in the following\n\nterms:In all such cases, the starting point will be that the accused had physical\n\n  control of something  a package, a bottle, a container  found to contain the substance. This\n\n  is evidence  generally strong evidence  of possession. It calls for an explanation: the\n\n  explanation will be heard and the jury must decide whether there is genuine ignorance of the\n\n  presence of the substance, or such an acceptance of the package with all that it might contain, or\n\n  with such opportunity to ascertain what it did contain or such guilty knowledge with regard to it\n\n  as to make up the statutory possession. Of course it would not be right or consistent with the\n\n  terms of the Act, to say that the onus of showing innocent custody rests upon the accused. The\n\n  prosecution must prove the offence, and establish its ingredients. But one starts from the point\n\n  that the Act itself has exempted the great majority of cases of innocent possession, so that once\n\n  the prosecution has proved the fact of physical control in circumstances not covered by an\n\n  exemption and something of the circumstances in which this was acquired or held, this, in the\n\n  absence of explanation, may be sufficient to enable a finding of possession to be made. On the\n\n  other hand, the duty to submit the question of possession to the jury in this way does give the\n\n  opportunity of acquittal to innocent carriers and custodians, who can put forward an explanation\n\n  of the physical fact which a jury accepts.206 Citing a host of authorities the learned DPP argued that the third accused\n\nwas wilfully blind to the actual contents he was carrying. He submitted: Naveed did not even\n\ninquire as to what he was in fact carrying. He was fully satisfied with bringing two suitcases that\n\nappeared empty to Singapore to be handed over to someone he never knew. He did not bother to make\n\ninquiry at all of Naseeem Khan about most, if not, all relevant matters.207 On the issue of wilful blindness the following segment appearing at para 119\n\nof the prosecutions submission requires mention. It reads:InWarnerit was said by Lord Pearce:For a man takes over a package or suitcase at risk as to its contents being\n\n  unlawful if he does not immediately examine it (if he is entitled to do so). As soon as may be he\n\n  should examine it and if he finds the contents suspicious reject possession by either throwing\n\n  them away or by taking immediate sensible steps for their disposal.In this present case, Naveed took possession of the suitcases in Pakistan. He\n\n  did not examine it there. He made no enquiries about the suitcases or the person to whom he was to\n\n  deliver them. He also had sufficient time in Singapore and contact with Hashim to ask Hashim more\n\n  about the suitcases, but he did not. He had ample opportunity to examine them in Singapore.\n\n  Therefore, he recklessly and wilfully closed his eyes to the fact that he was indeed transporting\n\n  drugs.208 I found the foregoing submission to be altogether disingenuous. First of all,\n\nit seemed to ignore the evidence of the third accused (which was not contested at any length) that\n\nwhen he was handed the bags in Pakistan, they were completely empty save for an odd mothball.\n\nSecondly, it also seemed to side-step the prosecutions own evidence that when the bags were\n\nopened in Rays hotel room, both Ray who was said to be an experienced DEA operative and the first\n\naccused, the principal culprit in this episode, were themselves hard-put to locate the drugs in the\n\nsuitcases so much so they had to stop the search for a while and seek advice from the associate of\n\nthe first accused, before they actually located the drugs. In the circumstances, the suggestion by\n\nthe prosecution that the third accused had ample opportunity to examine the bags in Singapore was\n\nfound by me to be somewhat effete.209 In my opinion, the error on the part of the third accused for not asking\n\nNaseem Khan why two empty suitcases were being sent to Singapore could not be used to tack him with\n\nthe label of wilful blindness. The situation at hand cannot be likened to the famous Nelsons\n\nblind eye at the battle of Copenhagen, alluded to by Lord Scott of Foscote inManifest\n\nShipping Co Ltd v Uni-Polaris Shipping Co Ltd and others(2001) 1 All E R 743 at 780, where\n\nNelson made a conscious decision to place the telescope to his blind eye in order to avoid seeing\n\nwhat he knew he would see if he placed it to his good eye. A distinction ought to be made between a\n\ndishonest person and a person who was found to be honestly blundering (see Lord Blackburns dicta\n\ninJones v Gordon(1877) 2 App Cas 616 at 629). In my evaluation, the third accused\n\nwas more of a blundering nitwit than a shrewd scoundrel.210 There was an attempt by the prosecution to assail his credibility. This was\n\non account of certain inconsistencies in his evidence on some dates mentioned by him in his\n\nstatements as well as in his testimony. Chief amongst them was the date on which Naseem Khan made\n\nthe first offer to him to visit Singapore. The third accused said it was on 15 March 2000. But his\n\npassport entries showed that he was in Uganda at that time and had not arrived in Pakistan until 25\n\nMarch 2000. The prosecution opened fire with all its guns blazing on this. But the forgotten fact\n\nwas that he had previously, well before he was confronted with his passport entry, told the court\n\nthat this meeting with Naseem Khan took place on the very day he returned from Uganda and the said\n\noffer was made to him when members of his family gathered around him upon his return at his\n\nresidence. In my evaluation, the said discrepancy should not be viewed as a deliberate lie on his\n\npart but was caused due to his inability to recall the correct date. In any event, even if it was a\n\nlie, which I did not think it was, it was not of that category of a lie bespoken inR v Lucas[1981] QB 720 orPublic Prosecutor v Yeo Choon Poh[1994] 2 SLR 867, being a\n\ndeliberate lie, related to a material issue, motivated by a realisation of guilt and fear of truth.\n\nIn this regard, it behoved the court to bear in mind the advice contained inYeo Choon Pohthat the mere fact an accused tells lies should not be taken as evidence of his guilt and only a lie\n\ngiven out of a realization of guilt and fear of truth relating to a material issue can amount to\n\ncorroboration of the accuseds guilt.211 The other dates alluded to by the prosecution ie, whether the third accused\n\nmet the first accused in Singapore on 4 April or 5 April 2000 and whether the third accused had met\n\nNaseem Khan in the hotel on 1 April or 3 April 2000 were similarly in my determination of little\n\nconsequence to the material issue; neither of them could be regarded as a deliberate lie; nor were\n\nthey considered by me to be material to the core issue. The prosecutions submission here was\n\nextremely tenuous and consequently not accepted by me.212 To digress a little, I must observe that if I were to accede to the\n\nprosecutions invitation to hold that the third accuseds evidence stood discredited or\n\nimpeached basically because of the so-called inconsistencies and discrepancies with regard to the\n\ndates mentioned by the third accused in relation to some peripheral details, the prosecution would\n\nfind itself equally in an uncomfortable terrain in regard to some inconsistencies as to timings\n\nlisted by S/S/Sgt Thng when the first accused was reportedly narrating matters concerning Faribourg\n\nduring the recording of his statements. What was sauce for the goose must be sauce for the gander as\n\nwell.213 In my determination, the account narrated by the third accused appeared to\n\nhave a substantial degree of cogency; he was neither shifty nor evasive nor prevaricating. Except as\n\nto certain dates on which he seemed to have some problems, I was inclined to think that he was in\n\nfact naive and somewhat unwittingly had fallen in the trap set up by Naseem Khan and his fellow\n\ncollaborators. It also did not escape my notice that the third accused was the one who volunteered\n\nthe information concerning Naseem Khans involvement and the latters antecedents. The third\n\naccused could simply have hidden them. But he did not.214 The learned DPP in his submission urged the court to draw an adverse\n\ninference against the third accused for his failure to mention in his cautioned statement that he\n\nhad brought the suitcases from Pakistan to return them to their owner Hash. This was a curious\n\nsubmission so to speak. First of all, the court noted that the prosecution was singularly shy in not\n\ntendering this cautioned statement during the prosecutions case for reasons well known to it.\n\nHaving elected so, it did not fall for the prosecution to argue later that the third accused should\n\nhave mentioned the particulars alluded to in his cautioned statement.215 Secondly, the case cited by the prosecutionRoshdi v Public Prosecutor[1994] 3 SLR 282highlights the aspect that a cautioned statement recorded under s 122(6) of the CPC\n\ndoes not require the accused person to minutely detail the defence he would be relying on at the\n\ntrial. At any rate, looking at the cautioned statement in its true perspective, it was my opinion\n\nthat the third accused had stated his position sufficiently. In any event, in the statement (exh\n\nP-50) made by him on 10 April 2000  two days after his cautioned statement - he had adequately\n\nadumbrated his defence. In the circumstances, the invitation by the prosecution to draw an adverse\n\ninference against the third accused pursuant to s 122(3) of the CPC was found by me to be entirely\n\nunprepossessing. In this, I am fortified by a view expressed by the Singapore Court of Appeal inPublic\n\nProsecutor v Abdul Naser bin Amer Hamsah[1997] 1 SLR 73where the court observed that no\n\nadverse inference could be drawn when the defence was disclosed in an investigation statement\n\nrecorded.216 I considered all the evidence adduced at this trial in its totality. In the\n\nadministration of criminal justice, there are many contending and complementary principles the\n\ncourts would have to be often reminded of. The first and foremost is the famous maxim:It is\n\nbetter that ten guilty persons escape than that one innocent suffer. (Sir William Blackstone\n\n1723-80 Commentaries on the Laws of England, 15thEdn, 1809 Vol 4, page 358). Then we\n\nhave another equally forceful expression:A miscarriage of justice may arise from the\n\nacquittal of the guilty no less than from the conviction of the innocent. (Viscount Simon\n\nLC,inStirland v DPP[1944] AC 315 at 324. Correspondingly, there is another gnome:The judge is condemned when the criminal is absolved. (Thomas Fuller 1654-1734). The\n\nforegoing sayings are no mere aphorisms but judicial sign-posts that often guide judges in the\n\nadministration of criminal justice.217 Having examined the entire spectrum of the evidence, I formed the view that\n\nthe third accused was narrating a credible and cogent account of what took place. He was found by me\n\nto be a simpleton and entirely forthcoming without so much as a twitch of shiftiness about his\n\ndemeanour or inflexion. In my finding, the third accused, a person of low academic attributes fell\n\ninto a trap set up by Naseem Khan and his confederates without his knowing. When the third accused\n\nwas told that he could get a free trip if he agreed to deliver some bags in Singapore, he readily\n\naccepted it without much thought. He did not know that the suitcases he carried into Singapore and\n\ndelivered to the first accused contained drugs. With regard to all the evidence in its entirety, I\n\nwas of the view that the third accused had indeed raised a reasonable and a real doubt on the\n\nprosecutions case.218 In this connection, it might serve well if I reproduced below what I said on\n\n30 January 2001 when I delivered my verdict in relation to the case of the third accused.(a) Having considered all the evidence and the submissions made thereon by\n\n  counsel for the third accused as well as the learned DPP, I am of the view that the third accused\n\n  has indeed raised a reasonable doubt on the prosecutions case and has rebutted whatever\n\n  presumptions which may have arisen against him on a balance of probabilities. After reviewing the\n\n  totality of the evidence, I am of the opinion that the prosecution has not discharged its ultimate\n\n  burden in proving its case against the third accused beyond a reasonable doubt. I shall no doubt\n\n  in due course set out my reasons in this connection in writing. However, within the parameters\n\n  laid out inGoh Lai Wak v PP[1994] 1 SLR 748, I must say that the case against the third\n\n  accused was by and large anchored amongst other things on two broad grounds. The first ground was\n\n  that the third accused ought not to have agreed to carry those suitcases, albeit empty for\n\n  delivery to someone in Singapore especially from one Naseem Khan who had been to prison in\n\n  Pakistan for drug-related offences. The second ground was that the sum of US$500 which the third\n\n  accused was paid to bring those suitcases into Singapore, must have triggered the requisite alarm\n\n  bell in his mind so as to cause him to examine even the inner linings of the said suitcases\n\n  closely.(b) The foregoing submission had no doubt an appearance of logic. However, it\n\n  seemed to elude the prosecutions own evidence that even their star witness Raymond Quattlander,\n\n  a trained DEA operative as well as Hashim, the principal character in this saga whom the\n\n  prosecution portrayed as one of the traffickers, encountered noticeably, great difficulty  that\n\n  too for a considerable period of time  in locating the hidden drugs. Given this scenario, the\n\n  suggestion that had the third accused examined the linings of the bags closely he would have\n\n  discovered that they contained drugs, is found by me to be lacking in substance. Further, a\n\n  payment of US$500 which is equivalent to about S$875 to act as an errand boy for someone from\n\n  Lahore to Singapore, in itself, does not warrant a reasonable, let alone an irresistible inference\n\n  that the third accused knew or ought to have known that he was bringing drugs into Singapore.(c) In my view, the story narrated by the third accused appeared to possess a\n\n  degree of cogency. Add to this fact that he had lugged the two large suitcases over some distance\n\n  from his hotel room and delivered them to Hashim in a public area rather than within the confines\n\n  of his hotel room, appeared to lend some weight to his defence. Moreover, his claim that he came\n\n  to Singapore to sell some wares and earn a bit of money and in pursuance of this he in fact sold\n\n  some of his wares to a trader in Orchard Road was not challenged by the prosecution although the\n\n  prosecution did have the whereabouts of the stores he had visited. Still more, his immediate and\n\n  unhesitating statement declaring his non-involvement when charged with the offence as well as his\n\n  volunteering information about events in Pakistan including the background of Naseem Khan which he\n\n  could have well hidden and one which the prosecution would not have known but for his\n\n  volunteering, appeared to render his story all the more creditworthy. Now dealing with the\n\n  inconsistencies highlighted by the prosecution as respects the dates of his meeting with Naseem\n\n  Khan in Lahore and with Hashim in Singapore they are in my view not significant enough to reject\n\n  his evidence as being unworthy of credit. In my view he had tilted the balance in his favour and\n\n  created a real and reasonable doubt on the prosecutions case.(d) In the premises I am unable to conclude that he is guilty as charged and\n\n  consequently acquit and discharge him of the charge. I will now hear the learned DPP as to the\n\n  charge which is pending against him.219 In the end, as stated by me earlier I found the first and second accused\n\nguilty as charged, convicted them and sentenced them to the only punishment prescribed under the\n\nlaw. The third accused was acquitted. Consequent upon the verdict and upon the application of the\n\nprosecution, leave was granted to withdraw the remaining charges pending against the first and the\n\nsecond accused. They were as a result given a discharge amounting to an acquittal in relation to the\n\nsaid charges, pursuant to s 177 of the CPC.M P H RubinJudgeCopyright  Government of Singapore."
    }
}