{
    "case_title": "Goh Kim Heong and Others v AT & J Co Pte Ltd",
    "ncitation": "[2001] SGHC 269",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "Leave to appeal": "The vendor does not accept the decision and wishes to appeal against it. However it does not have an absolute right of appeal because under s 34(2)(a) of the Supreme Court of Judicature Act (Cap 322, 1999 Ed),Except with the leave of the Court of Appeal or a Judge, no appeal shall be brought to the Court of Appeal in any of the following cases:(a) where the amount or value of the subject-matter at the trial is $250,000 or such other amount as may be specified by an order made under subsection (3) or less.The intended appeal is $200,000 short of the threshold figure.It is axiomatic that an applicant must show that it deserves leave to appeal. Although the basis for granting leave to appeal to the Court of Appeal is not set out in s 34 (or in s 21 relating to leave to appeal to the High Court), a body of case law has developed on it.When the Court of Appeal considered s 34 inSpandeck Engineering (S) v Yong Qiang Construction[1999] 4 SLR 401, it referred to the Minister of Law`s explanation that the threshold amount in s 34(2) was raised from $30,000 to $250,000 to avoid straining limited resources of the Court of Appeal, and it concluded that the intention of Parliament in raising the threshold in s 34(2)(a) was to limit the right of appeal to the Court of Appeal.In what circumstances would leave be granted? InAnthony s/o Savarimiuthu v Soh Chuan Tin[1989] SLR 607[1989] 3 MLJ 5, Lai Kew Chai J in dealing with an application for leave under s 21, held ([1989] SLR 607 at 608; [1989] 3 MLJ 5 at 6):To obtain leave to appeal when the amount involved is below the statutory amount an applicant for leave must show that a serious and important issue of law is involved ... The circumstances for granting leave would include (though obviously not limited to) cases where an applicant is able to demonstrate a prima facie case of error or if the question is one of general principle upon which further argument and a decision of a higher tribunal would be to public advantage. That was pronounced by Edgar Joseph Jr J inPang Hon Chin`s case ([1986] 2 MLJ 145). These propositions have a common thread: that to deny leave may conceivably result in a miscarriage of justice.and this was cited and approved by the Court of Appeal inLee Kuan Yew v Tang Liang Hong[1997] 3 SLR 489. The court went on to state in [para ]16:[I]t is apparent that there are at least three limbs which can be relied upon when leave to appeal is sought: (1) prima facie case of error; (2) question of general principle decided for the first time; and (3) question of importance upon which further argument and a decision of a higher tribunal would be to the public advantage.The issue received further consideration inAbdul Rahman bin Shariff v Abdul Salim bin Syed[1999] 4 SLR 716, where Tay Yong Kwang JC held at [para ]30:I should clarify here the words `a prima facie case of error` used inAnthony Savarimiuthu`s case. In another application of this nature heard by me, the applicant there sought to demonstrate a prima facie case of error by referring me to the evidence adduced at the trial and attempting to show that the collision could not have occurred in the way described by the plaintiff there on such evidence. That, in my view, was no more than an attempt to show an erroneous conclusion on the facts of the case for which leave to appeal must be and was denied. If it were otherwise and facts have to be examined in detail in each case to demonstrate the error, the High Court might as well hear the appeal proper.He went on at [para ]31:In my opinion, leave of court to appeal may be granted where the applicant is able:(1) to demonstrate a prima facie case of error of law that has a bearing on the decision of the trial court;(2) to show that there is a question of law decided for the first time or a question of law of importance upon which a decision of a higher tribunal would be to the public advantage;(3) to show a question of law on which there is a conflict of judicial authority and a pronouncement from a higher court in the judicial hierarchy is desirable.Leave of court should not be granted when there are mere questions of fact to be considered.thereby refining and clarifying the principles to be applied.I suggest that the value of the proposed appeal and the costs and time burdens the appeal would place on the parties and the appellate court should also be taken into account.The vendor failed to discharge the burden on it. All that was said in the affidavit filed in support of the application for leave was:The Defendants wish to appeal to the Court of Appeal given that there are serious and important issues of law involved, namely:-a. whether the Plaintiffs` alleged \"deemed completion\" of the sale and purchase of the property on 29 February 2000 was vague and for which oral evidence ought to have been required;b. whether there were substantive issues of facts pertaining to the existence of the agreements of the parties, such that the Court ought to have invoke (sic) Order 28 Rule 8 of the Rules of Court and made directions as if the matter had been begun by way of a Writ.The dispute between the parties arose from its peculiar facts. It turned on the effect of the recorded terms the parties agreed to for the functional completion, and whether there were other implied conditions as asserted by the vendor. It did not involve any important question which should be determined by the Court of Appeal. This dispute over $47,484.88 does not merit further expenditure of time and costs on the part of the parties and the Court of Appeal, and leave to appeal was refused.Outcome:Order accordingly.Copyright © Government of Singapore."
    }
}