{
    "case_title": "Wee Soon Kim Anthony v The Law Society of Singapore",
    "ncitation": "[2001] SGHC 44",
    "coram": "Woo Bih Li JC",
    "sections": {
        "The Background": "4.    The background to the OS and the Solicitors application\n\nis set out in paras 4 to 10 of the first affidavit of Davinder Singh s/o Amar Singh of which paras 5\n\nand 6 were derived from the Grounds of Decision of Lai Kew Chai J in Originating Summons No 37 of\n\n2000. Paragraphs 4 to 10 state:4. By a letter dated 18 August 1999, the Plaintiff lodged a complaint with\n\n  the Law Society against HK and me. A copy of the letter is annexed hereto as \"DS-1\".5. In appears from paragraph 9 of the Honourable Justice Lai Kew Chais\n\n  Grounds of Decision that by a letter dated 5 November 1999, the Director of the Law Society stated\n\n  that a meeting of the Council of the Law Society had decided that, in view of the decision of the\n\n  Court of Appeal inTang Liang Hong v Lee Kuan Yew, the Plaintiffs letter of complaint\n\n  disclosed no information of misconduct that must be referred to the Chairman of the Inquiry\n\n  Committee. The Plaintiff asked the Council for the basis upon which the Court of Appeal \"empowered\n\n  the Council to disregard due process of an inquiry committee to determine the facts complained of\".6. In appears from paragraphs 10 and 11 of the Honourable Justice Lai Kew Chais\n\n  Grounds of Decision that by a letter dated 9 December 1999, the then President of the Law Society\n\n  provided the Plaintiff with an explanation. The Plaintiff asserted that the explanation left him\n\n  \"none the wiser\".7. The Plaintiff then commenced proceedings against the Law Society in OS\n\n  37/2000 seeking, inter alia, a declaration that the Law Society should have referred the Plaintiffs\n\n  letter of complaint dated 18 August 1999 against HK and I to the Chairman of the Inquiry Panel.8. The application was heard before the Honourable Justice Lai Kew Chai. The\n\n  Learned Judge delivered his judgment on 4 August 2000, and found that of the four alleged\n\n  \"falsehoods\", three were \"baseless and frivolous and plainly did not and could not\n\n  fall within\" Section 85(1) of the Act. As for the fourth alleged \"falsehood\", His\n\n  Honour found that it fell within Section 85(1) of the Act, but added that \"whether there is a\n\n  prima facie case of misconduct against [HK and me] is a matter strictly for the Inquiry Committee\n\n  to be constituted\". A copy of the Learned Judges Grounds of Decision is annexed hereto as\n\n  \"DS-2\".9. An Inquiry Committee was constituted to investigate this complaint.\n\n  Following a hearing of the complaint, the Inquiry Committee recommended the dismissal of the\n\n  complaint. By a letter dated 26 September 2000, the Law Society informed HK and me that the\n\n  Council of the Law Council had determined pursuant to Section 87 of the Act that formal\n\n  investigation of our conduct by a Disciplinary Committee was not necessary, and that the complaint\n\n  was dismissed. A copy of this letter is annexed hereto as \"DS-3\".10. By this Originating Summons, the Plaintiff has now seeks, inter alia, an\n\n  order compelling the Law Society to apply to the Chief Justice for the appointment of a\n\n  Disciplinary Committee to investigate into the Plaintiffs complaint dated 18 August 1999.5.    The Solicitors application to be added as Interveners was\n\nmade under O 15 r 6(2)(b) which states:Misjoinder and nonjoinder of parties (O.15, r.6).6(1) .(2) Subject to the provisions of this Rule, at any stage of the proceedings in\n\n  any cause or matter, the Court may, on such terms as it thinks just and either of its own motion\n\n  or on application(a) .(b) order any or the following persons to be added as a party, namely:(i) any person who ought to have been joined as a party or whose presence\n\n      before the Court is necessary to ensure that all matters in the cause or matter may be\n\n      effectually and completely determined and adjudicated upon; or(ii) any person between whom and any party to the cause or matter there may\n\n      exist a question or issue arising out of or relating to or connected with any relief or remedy\n\n      claimed in the cause or matter which in the opinion of the Court it would be just and\n\n      convenient to determine as between him and that party as well as between the parties to the\n\n      cause or matter.",
        "Mr Wees arguments": "6.    Mr Wee argued that to come within O 15 r 6(2), the\n\nSolicitors had to have some interest which is directly related to or connected with the subject\n\nmatter of the OS and not just merely an interest in its outcome. He relied onSanders Lead Co Inc\n\nv Entores Metal Brokers Ltd[1984] WLR 452 at p 460E.7.    He argued that the Solicitors did not have an interest in\n\nthe subject matter of his action if and until a Disciplinary Committee was appointed by the Judge\n\nhearing the OS.8.    He argued that the OS under s 96 of the LPA was provided by\n\nstatute and did not come within the meaning of a cause of action in the contractual sense\n\nunder O 15 r 6(2).9.    As for the case ofLaw Society of Singapore v\n\nDisciplinary Committee[2000] 4 SLR 413, a decision by Lim Teong Qwee JC, as he then was, Mr Wee\n\npointed out that that was not a case whereby the solicitors concerned applied to be heard under O 15\n\nr 6(2) but that the right to be heard by the solicitors concerned was under the rules of natural\n\njustice applicable to all judicial or quasi-judicial proceedings. He accepted that under such rules,\n\nthe Solicitors would have a right to be heard at the hearing of the OS.10.    Mr Wee also argued that it would be impossible if every\n\nsolicitor is permitted to intervene in an application made under s 96 of the LPA.",
        "Mr Yims arguments": "11.    Mr Jimmy Yim SC, for the Solicitors, rested his arguments\n\nprimarily on O 15 r 6(2)(b)(i) ie. any person whose presence before the Court is necessary to\n\nensure that all matters in the cause or matter may be effectually and completely determined and\n\nadjudicated upon.12.    He argued that necessary did not mean that the Court\n\ncould not decide without the Solicitors being present or that the Law Society was not able to defend\n\nthe decision of the Inquiry Committee. It included reference to the Solicitors who were parties\n\nbefore the Inquiry Committee.13.    Also, while Mr Yim accepted that there is no direct matter\n\nto be determined between the Solicitors and Mr Wee in the OS, he argued that if O 15 r 6(2)(b)(ii)\n\nwas not read narrowly, then the Solicitors would come under that provision as well.14.    Mr Yim added that the LPA did not exclude the Solicitors\n\nright to be heard, relying on the decision from Lim JC for this proposition.15.    Mr Yim also referred to the White Book at p 226 para\n\n15/6/10 which states:In addition to the powers contained in this rule or under O.75, r.17(1) the\n\n  Court has an inherent jurisdiction to enable it to do justice in particular cases to allow a\n\n  person not a party to intervene in proceedings if the effect of such proceedings has been, or is\n\n  likely to be, to cause such a person serious hardship, difficulty or damage, e.g. a person whose\n\n  property is adversely affected by the presence of an arrested vessel in an Admiralty actionin\n\n  remeven though he has no interest in the vessel to entitle him to intervene under O.75,\n\n  r.17(1) (The Mardina Merchant[1975] 1 W.L.R; [1974] 3 All E.R. 749).16.    Mr Yim added that if a Disciplinary Committee was appointed\n\nand the Solicitors succeeded before it, they could not claim costs against Mr Wee.",
        "My reasons": "17.    Although the Solicitors are not named in the OS and there\n\nis no requirement under the LPA that they be so named, I was of the view that in any application\n\nunder s 76 of the LPA, one of the true substantive parties is the solicitor against whom the\n\ncomplainant is made.18.    Although the application to have a Disciplinary Committee\n\nappointed is but the first step for a complainant to pursue his complaint after an unfavourable\n\nreport by the Inquiry Committee ie. unfavourable to the complainant in that he prefers a different\n\noutcome, it is nevertheless a step which is of great significance to the solicitor concerned. If a\n\nDisciplinary Committee is appointed, the solicitor is put to the inconvenience, expense and anxiety\n\nof proceedings before the Disciplinary Committee and the risk of an adverse outcome against him.\n\nThese are not factors which can be adequately compensated by any order that the Disciplinary\n\nCommittee can make. Accordingly, if the matter can be nipped in the bud in that the court is not\n\npersuaded to appoint a Disciplinary Committee, the solicitor concerned avoids the inconvenience,\n\nexpense, anxiety and risk I have mentioned.19.    Therefore, the solicitor concerned has, at least, as great\n\nan interest as the complainant in an application under s 96 of the LPA.20.    It was not necessary for me to decide whether the\n\nSolicitors application came within O 15 r 6(2)(b)(i) or (ii) because I was of the view that the\n\ncourt has an inherent jurisdiction to allow a party to intervene if the justice of the case requires\n\nand that this jurisdiction is not confined to the illustration given in the White Book.21.    For the reasons I have mentioned, I was satisfied that this\n\nwas a just case to allow the Solicitors to intervene.22.    This was not a situation where the Solicitors were\n\ninterested only in the outcome of the OS. The case ofSanders Lead Cowas on very different\n\nfacts.23.    Furthermore, the fact that the OS was filed pursuant to the\n\nLPA was neither here nor there.24.    As regards the decision of Lim JC, I was aware that the\n\napplication there was not under s 96. In that case, a Disciplinary Committee had been appointed and\n\nafter its conclusion which was favourable to the solicitors concerned, it was the Law Society who\n\nwas applying to court under a different provision ie. s 97 of the LPA for the solicitors to show\n\ncause or directing the Council to make an application under s 98 for the solicitors to show cause.\n\nAlso, the Law Society in that case did not object to the solicitors concerned being heard and the\n\nsolicitors there also apparently did not ask to be heard under O 15 r 6.25.    Be that as it may, I was of the view that solicitors who\n\nare or may be affected by an application under s 97 or 96 have a right to be heard and should, as a\n\ncorollary to that, have a right to intervene. There is nothing in the LPA which excludes either\n\nright.26.    As I have mentioned, Mr Wee accepted that the Solicitors\n\nhave a right to be heard at the hearing of the OS under the rules of natural justice but argued that\n\nthey did not have a right to intervene under O 15 r 6. I was of the view that, as regards him, this\n\nwas a distinction without significance. There was no real reason for him to object to the Solicitors\n\napplication since he had agreed that they have a right to be heard anyway. For the Solicitors, an\n\norder granting them leave to intervene would ensure that they would have a right to be heard.27.    I also did not agree that it would be impossible if every\n\nsolicitor against whom a complaint is made were to be allowed to intervene in such a situation.Woo Bih LiJudicial CommissionerCopyright © Government of Singapore."
    }
}