{
    "case_title": "Denis Matthew Harte v Tan Hun Hoe and Another",
    "ncitation": "[2001] SGHC 19",
    "coram": "Chan Seng Onn JC",
    "sections": {
        "Bullock and Sanderson orders": "6. Paragraph 62/B/124 at p 1222 of the White Book 1999 Edn Vol 1 sets out\n\nsuccinctly the nature of theBullockandSandersonorders:Where a plaintiff sues two defendants, making his claim against them in the\n\n  alternative, and succeeds only against one of them, the Court in its discretion may order the\n\n  unsuccessful defendant to pay the successful defendants costs. This may be done either by an\n\n  order that the unsuccessful defendant pay the successful defendants costs direct to him (known\n\n  as a \"Sanderson Order\" fromSanderson v. Blyth Theatre Co.[1903] 2 K.B. 533, CA)\n\n  or by an order that the plaintiff pay the successful defendants costs to him and recover them\n\n  from the unsuccessful defendant as part of the plaintiffs costs of the action (known as a\n\n  \"Bullock Order\" fromBullock v. London General Omnibus Co.[1907] 1 K.B. 264,\n\n  CA).7. In my view, such orders are not limited to the cases where the plaintiffs\n\nclaim against the defendants is only in the alternative. Where there is no good reason to deprive\n\nthe successful defendant of his costs, then the principal consideration is whether in all the\n\ncircumstances of the particular case, it would be fair and reasonable for the unsuccessful defendant\n\n(and not the plaintiff) to bear the costs of the successful defendant directly or indirectly. The\n\nusual order however is for the plaintiff to pay the costs of the defendant eventually found not\n\nliable to him, since he mustprima faciebe held responsible for his wrong decision to join\n\nthe successful defendant in the first place. He has to bear the consequence of his own choice of\n\ndefendants in litigation.8. InMulready v Bell Ltd[1953] 2 All ER 215, Lord Goddard stated that aBullock(orSanderson)order would not be appropriate where the plaintiff alleges\n\nindependent causes of action against different defendants, and the respective breaches of duty are\n\nin no way connected.9. InMohd bin Sapri v Soil-Build (Pte) Ltd and another appeal[1996] 2 SLR 505, Yong Pung How CJ stated at p 521E that:If the plaintiff includes an additional defendant because of his uncertainty of\n\n  the law rather than the facts, the court will not make either aBullockorSandersonorder\n\n  (Poulton v Moore[1913] WN 349).10. The following paragraph inPoulton v Mooreby Lush J at 350 was also\n\nquoted by the Chief Justice:The reason for the order inBullock v London General Omnibus Cowas that\n\n  as the omnibus company had wrongly thrown the responsibility for the accident to the plaintiff on\n\n  to the other defendants, they had caused the plaintiff to be in a state of uncertainty on the\n\n  facts as to who was really liable, and therefore they were responsible for the extra costs he\n\n  incurred in suing both defendants There is no precedent for such an order being made where the\n\n  joinder of an additional defendant has resulted from the plaintiff being doubtful as to the law,\n\n  nor is there any principle that I can see upon which such an order can be justified. It was the\n\n  fault or misfortune of the plaintiff if he was not satisfied as to his legal rights; it certainly\n\n  was not the fault of [the defendants].11. Thus, in determining whether to grant aBullockorSandersonorder, the following factors are relevant:(a) What facts are reasonably ascertainable by the plaintiff before the\n\n  decision is made to join the successful defendant (D1);(b) Whether the facts themselves are unclear to such an extent that it is\n\n  necessary to safeguard the plaintiffs position by bringing in D1. Where it is reasonable for\n\n  the plaintiff to adopt the position that either one or the other or both defendants may be liable\n\n  and hence prudence dictates that both should be joined, then aBullockorSandersonorder may be appropriate;(c) Of considerable importance is whether the unsuccessful defendant (D2)\n\n  has tried to shift all or some of his liability to D1 or has characterised the facts such that D1\n\n  is more blameworthy and should bear a greater proportion of the damages, in which case it may be\n\n  appropriate to make D2 (and not the plaintiff) shoulder D1s costs because D2 has put the\n\n  plaintiff in a difficult position, thereby forcing him to join D1.(d) Whether the plaintiffs claim against D1 and D2 is in reality separate\n\n  and distinct, in which case it will be inappropriate for D2 to pay D1s costs (SeeDonovan v.\n\n  Walters(1926) 135 L.T. 12). Being independent claims, it is unlikely for D1 to have\n\n  influenced the joinder of D2. Hence, the plaintiff must answer for the costs of D1 himself.(e) The likelihood of the plaintiff or D2 becoming insolvent may dictate\n\n  whether aBullockorSandersonorder should be made. The court has to determine\n\n  whether it is more equitable to put the risk of non-recovery of D1s costs from D2 on the\n\n  shoulders of the plaintiff or on D1 himself. Thus the conduct of the plaintiffvis--visthe successful defendant has to be considered.12. I agreed with counsel for Dr Tan thatMohd bin Saprishould be\n\napplicable on the facts of the case here. Mr Hartes decision to join the hospital had been\n\nquestionable. The hospital had, from the very beginning in its correspondence prior to the\n\ncommencement of proceedings, rightly disabused Mr Harte of any wrong impression that Dr Tan might\n\nhave been their employee, servant or agent. Neither was there any representation to that effect by\n\nthe hospital or by Dr Tan. Mr Harte first sought out Dr Tan in his private clinic for his fertility\n\ntreatment. Following those consultations, Mr Harte agreed to have Dr Tan perform a bilateral\n\nvaricocelectomy on him at the hospital. It was at the instructions of Dr Tan that Mr Harte admitted\n\nhimself into the hospital, which merely accredited Dr Tan, an independent contractor, with the use\n\nof the hospital facilities and with admitting privileges for his private patients, of which Mr Harte\n\nwas one of them.13. The facts and the law were both reasonably clear. By simply providing the\n\noperating theatre, ward and nursing facilities to its accredited surgeons, the hospital could not\n\nbecome the principal for the operation, over which the hospital had absolutely no control. The\n\nindependent surgeon continued to take full charge of the operation and he remained the principal for\n\nthe operation. Under these circumstances, the hospital could not be held jointly liable for any\n\nnegligent acts of the independent, private surgeon, who happened to be given the privilege of using\n\nthose facilities in the hospital for his operations on his private patients. It was also not\n\ndisputed that none of the hospitals nurses were negligent when they took care of Mr Harte in the\n\nward after the operation. He had gone to the toilet against their advice soon after he had woken up\n\nfrom the surgery.14. Mr Harte was plainly at fault in joining the hospital as an additional\n\ndefendant. His case against the hospital was at the outset quite unsustainable. Even if the law were\n\nnot clear, he would still have to bear the adverse consequences for his own mistake in suing the\n\nhospital. Throughout, Dr Tan made no attempt to shift any aspect of the alleged liability against\n\nhim to the hospital nor had he tried to muddy any facts with the intention of shifting the blame to\n\nthe hospital, thus forcing Mr Harte to join the hospital as a defendant. I thus refused to make\n\neither aBullockor aSandersonorder. Accordingly, costs should follow the event in\n\nrespect of the plaintiffs claim against the hospital.",
        "Clarification of cost order": "15. I would take this opportunity to clarify my cost order. It is unfortunate\n\nthat I did not make clear that the 1stdefendant is to pay the costs of the plaintiff,but\n\nonly in relation to the plaintiffs claim against the 1stdefendant,which was what\n\nI had in mind all along. This means that the plaintiffs costs in relation to issues on agency and\n\nvicarious liability, which were exclusive to the plaintiffs claim against the 2nddefendants, would be borne by the plaintiff himself because I dismissed the plaintiffs quite\n\ndistinct claim against the 2nddefendants and had ordered the plaintiff to pay the costs\n\nof the 2nddefendants. In my view, it would be totally inappropriate that the 1stdefendant be made to bear the getting up costs plus the portion of the plaintiffs costs at the\n\ntrial in relation to the 2nddefendants case, particularly when the 2nddefendants had written to the plaintiffs solicitors prior to the commencement of the proceedings\n\nstating in very clear terms that the 1stdefendant was not their servant or agent, and\n\nhence, could not be vicariously liable for any negligence of the 1stdefendant.",
        "Offer to settle": "16. Counsel for Dr Tan contended that the 1stdefendants offer to\n\nsettle was valid, and since the plaintiff recovered an amount less than the offer, the plaintiff\n\nmust suffer the adverse cost consequences provided for in Order 22A Rule 9 of the Rules. Order 22A\n\nis obviously intended to encourage the settlement of claims.17. On 11 May 2000, Dr Tan offered to settle the plaintiffs claim for\n\nS$150,000. Five days later, on 16 May 2000, an increased offer of S$300,000 was served on the\n\nplaintiffs solicitors because Dr Tan was very anxious that his name should not appear in the\n\npapers at all, and he agreed to double the amount offered, which counsel considered to be very\n\nreasonable and extremely generous. Counsel then submitted that the plaintiff should only be entitled\n\nto costs on a standard basis up to the date of service of the revised offer and the plaintiff should\n\npay his costs on an indemnity basis from the date of service of the offer till the conclusion of the\n\ntrial. For convenience, I have set out below the terms of the increased offer:The 1stDefendant offers to settle these proceedings on the\n\n  following terms:-1. The 1stDefendant offers to pay the Plaintiff the sum of\n\n  S$300,000.00; and2. The 1stDefendant offers to pay the Plaintiff his Party and Party\n\n  Costs together with disbursements reasonably incurred up to the date of receipt of this Offer To\n\n  Settle, to be agreed or taxed.18. The question before the court was whether this offer was a conforming offer,\n\nthus attracting the application of Order 22A Rule 9(3), which stipulates that:Where an offer to settle made by a defendant(a) is not withdrawn and has not expired before the disposal of the claim in\n\n    respect of which the offer to settle is made; and(b) is not accepted by the plaintiff, and the plaintiff obtains judgment not\n\n    more favourable than the terms of the offer to settle,the plaintiff is entitled to costs on the standard basis to the date the offer\n\n  was served and the defendant is entitled to costs on the indemnity basis from that date,unless\n\n  the Court orders otherwise. (Emphasis is mine.)19. Of some significance is the fact that even under Rule 9(3), the court retains\n\nthe discretion not to impose the adverse cost consequences in an appropriate case where there are\n\nspecial reasons for doing so. Order 22A Rule 9(5), a recent amendment taking effect from 15 December\n\n1999, makes it very clear that notwithstanding anything in the offer to settle, the courts wide\n\ndiscretion in this regard is still preserved. Recognising the severity of these cost consequences,\n\nthe Rules themselves thus ensure that the court has the full discretion to ameliorate what could\n\notherwise be an unduly harsh consequence if Rule 9(3) is applied strictly across the board\n\nregardless of the circumstances. This assumes even greater importance nowadays with the cost of\n\nlitigation running possibly into the hundreds of thousands of dollars, sometimes even several times\n\nhigher than the judgment sum awarded as in this case.20. Counsel for Mr Harte argued that Order 22A Rule 9(3) ought not to apply, as\n\nthe offer to settle did not comply with Rule 10. Order 22A Rule 10 states:Where there are 2 or more defendants, the plaintiff may offer to settle with\n\n  any defendant and any defendant may offer to settle with the plaintiff, but where the defendants\n\n  areallegedto bejointly or jointly and severally liableto the plaintiff in respect of a claim and rights of contribution or indemnitymayexist between the defendants,the cost consequencesprescribed by Rule 9do\n\n  not applyto an offer to settleunless",
        "(b) in the case of an offer made to the plaintiff": "(i) the offer is an offerto settlethe plaintiffs claimagainst\n\n    all the defendantsandto pay the costs of any defendant who does not join in\n\n    making the offer; or(ii) the offer is made by all the defendants and is an offer to settle the\n\n    claim against all the defendants, and, by the terms of the offer, they are made jointly and\n\n    severally liable to the plaintiff for the whole of the offer. (Emphasis is mine.)21. The rationale behind Rule 10 (b) is to ensure that a defendant alleged to be\n\njointly or jointly and severally liable with any other defendant does not offer to settle only his\n\npart. This is to avoid putting the plaintiff in an embarrassing position having to deal with the\n\nbalance of his claim against the other defendants jointly or jointly and severally liable, and\n\nhaving at the same time to face the risk of a cost penalty should he decide not to accept the offer\n\ncoming from only one of the defendants.22. Halsburys Laws of Singapore on Tort Volume 18, Year 2000 sets out the\n\nfollowing as joint tortfeasors:a.    employer and employee where the employer is vicariously liable for the tort\n\n  of the employee;b.    principal and agent where the principal is liable for the\n\n  tort of the agent;c.    employer and independent contractor where the employer is\n\n  liable for the tort of his independent contractor;d.    a person who instigates another to commit a tort and the\n\n  person who then commits the tort;e.    persons who take concerted action to a common end and in\n\n  the course of executing that joint purpose commit a tort.23. Clerk & Lindsell on Torts 16thEdn at p 148 similarly\n\ncategorised as joint tortfeasors, the agent who commits a tort on behalf of his principal, the\n\nemployee who commits a tort in the course of his employment including the independent contractor who\n\ncommits a tort in a case where his employer is liable for the acts of the independent contractor.24. Mr Harte in his statement of claim hadallegedthat Dr Tan was\n\nthe servant or agent of the hospital and hence, the hospital was vicariously and thereforejointly\n\nliablefor the negligence of Dr Tan. Dr Tan had not offered to settle the whole of the\n\nplaintiffs claim againstall the defendantsand neither did he offer to pay\n\nthe costs of the hospital, which had refused to join in the settlement. I have no doubt that the\n\nplaintiff had in substanceallegedthat both defendants were jointly liable. Yet Dr\n\nTans offer, as it appeared to me, was essentially to settle only the plaintiffs part of the\n\nclaim against him, although it was worded to settle these proceedings. The terms of the offer\n\nwere not particularly clear.25. On a plain reading of Order 22A Rule 10, it would seem that a subsequent\n\nfinding by the court that there was no joint liability does not affect the applicability of Rule 10,\n\nwhich is simply based on the claim as alleged. That an allegation has been unsubstantiated or proved\n\nwrong does not mean that it is not an allegation to begin with or that the allegation is a\n\ncompletely wild allegation. For reasons of certainty, a defendant must be able to ascertain from the\n\nstatement of claim what has been alleged against him. Then and only then can he decide how he is to\n\nconstruct the terms of his offer to settle. On receipt of the offer, the plaintiff must be able to\n\ndetermine if that offer has been made in compliance with the Rules. Thereafter the plaintiff must\n\nconsider whether to accept it, ignore it or make a counter-offer. The scheme in Rule 10 will hardly\n\nbe workable if it has to depend on a finding of fact by the court at the conclusion of the trial\n\nwhether or not the defendants were on the evidence jointly or jointly and severally liable because\n\nthe point of decision making both by the offeror and offeree with regards to the offer in question\n\nis not after receipt of the courts judgment at the end of the trial but before that.26. Hence Rule 10 is founded upon whether the defendants have beenallegedto be jointly or jointly and severally liable, and not whether they have been proved to be jointly,\n\nor jointly and severally liable. Of course, if the plaintiff has no reasonable basis at all to mount\n\na cause of action based on agency and vicarious liability, I would have expected the 2nddefendants to apply to strike out the plaintiffs claim against them under Order 18 Rule 19. The\n\nfact that no such application was even made indicates that the matter was not exactly as\n\nstraightforward, and thus, there was a reasonable belief on the part of the plaintiff to found a\n\nclaim based on vicarious liability and agency against the hospital, having regard to what he\n\nperceived to be a very close connection between the hospital and Dr Tan.27. As such, I was satisfied that the alleged joint liability was not some\n\nfanciful allegation that was obviously unsupportable from the beginning and hence, could not in law\n\nand in substance amount to a proper allegation for the purpose of Rule 10. The fact that the\n\nplaintiff was proved wrong on this issue is quite another matter.28. Since Dr Tan did not offer to settle Mr Hartes claim both against himself\n\nand the hospital and neither had he offered to pay the costs of the hospital, Rule 10 b(i) was\n\nplainly not satisfied. Neither was b(ii) since the hospital refused to join in making any offer to\n\nsettle Mr Hartes claim against them. Hence, the punitive cost consequences spelt out in Rule 9\n\ncould not visit the plaintiff although the plaintiff had rejected Dr Tans generous offer of\n\n$300,000, which far exceeded the damages I had assessed at the conclusion of the trial. Rule 10expressly\n\nprovidesthat the cost consequences prescribed by Rule 9 are not to apply to any offer to settle\n\nunless the conditions stipulated in b(i) or b(ii) are satisfied. Accordingly, the plaintiff was not\n\nrunning the risk of any adverse cost consequences prescribed under Rule 9 when he ignored the offer\n\nbecause there was no offer to settle falling within b(i) or b(ii) which he could properly consider.\n\nBy extension, the court should similarly be very slow to impose the adverse cost consequences (of a\n\nnature similar to Rule 9) under a separate exercise of discretion in the case of the 1stdefendants offer to settle, which was not in an acceptable form as prescribed by the Rules\n\nbecause the plaintiff would legitimately be labouring under an expectation that those cost\n\nconsequences in Rule 9 would not apply as stated by the Rules themselves when he chose to reject the\n\nnon-conforming offer.29. However counsel for the 1stdefendant argued on two grounds why\n\nOrder 22A, Rule 10 would not apply: (a) where the allegation of joint or joint and several liability\n\nwas not a responsible allegation with some basis, and (b) where there was no question of\n\ncontribution between the defendants.30. I will deal with the 2ndground first. Rule 10 does not state that\n\nthe rights of contribution or indemnitymustexist between the defendants as a further\n\ncondition before Rule 10 can apply. It simply states that rights of contribution or indemnitymayexist between the defendants (second limb of Rule 10). As such, where on the alleged facts\n\nin the statement of claim, there are reasonable grounds for the plaintiff to believe that such\n\nrights of contribution or indemnity may or can exist between some of the co-defendants, Rule 10 is\n\napplicable, whether or not, it is subsequently proved at trial that those rights never existed at\n\nall. I am reinforced in my view by Order 22A Rule 11, which provides that where two or more\n\ndefendants areallegedto be jointly or jointly and severally liable to the\n\nplaintiff in respect of a claim, any defendant may make to any other defendant an offer to\n\ncontribute in Form 38D towards a settlement of the claim.31. On the alleged facts of this case, it was not conclusive that there could\n\nnever be any rights of indemnity or contribution between the hospital and Dr Tan. They were not\n\nnecessarily within the plaintiffs domain of knowledge. In my opinion, the second limb of Rule 10\n\nwas satisfied and hence, this argument of the 1stdefendant failed.32. On the 1stground, I understood counsel to be submitting that\n\nthere was no reason why the 2nddefendants would want to participate in any offer to\n\nsettle in the first place. As the claim against the 2nddefendants was absolutely without\n\nlegal basis, the 2nddefendants would obviously insist on their full legal costs should\n\nthe plaintiff withdraw his entire claim against both defendants upon acceptance of the settlement\n\noffer from the 1stdefendant. Hence, there was no logical reason why the 1stdefendant should additionally offer to pay the costs of the 2nddefendants incurred as a\n\nresult of an irresponsible claim initiated by the plaintiff himself before the 1stdefendant could make a good offer to settle these proceedings (as would be required by Rule 10\n\nb (i)). Apparently, the 1stdefendant was expecting the plaintiff to accept that he had\n\nwrongly sued the hospital and therefore, he ought to pay the costs of the hospital himself should he\n\naccept the offer. There is much force in counsels argument that the law does not expect the\n\nimpossible from the 1stdefendant. Why should the 1stdefendant offer to pay\n\nthe costs of the hospital for no good legal reason other than to fulfil the requirements of Rule 10\n\nb(i) just to benefit from the cost advantages available under Rule 9, when the 1stdefendant already held the firm view that the hospital was wrongly joined and that view was proved\n\nright in the end? As it turned out, the 1st defendant only made a partial offer, so to speak, to\n\nsettle the matter only as between himself and the plaintiff.33. I concluded that the terms of the partial offer did not accord with the\n\nstrict requirements of Rule 10 (b). Since the Rules stipulate that the usual adverse cost\n\nconsequences prescribed by Rule 9 are not to apply unless either Rule 10 b(i) or b(ii) is satisfied,\n\nit follows then that those serious cost consequences flowing from Rule 9 cannot be imposed as a\n\nmatter of course under Order 22A. An offer that clearly does not conform to the scheme under Rule 9\n\nread with Rule 10 cannot simply be treated as a conforming offer, or equated to one in terms of its\n\nconsequences.34. In my view, the 1stdefendant would have to invoke the discretion\n\nof the court (and not Rule 9) to impose the adverse cost consequences having regard to the\n\nparticular circumstances of his case. So far as Rule 10 is concerned, its ambit is sufficiently\n\nplain and unambiguous.",
        "Exercise of discretion": "35. Although the normal order is for costs to follow the event, the court still\n\nretains a wide discretion to take account of the 1stdefendants generous albeit\n\nnon-conforming offer to settle and grant appropriate cost advantages to him. It remains open to me\n\nto decide on costs in the usual way as provided by the Rules and give whatever weight to the\n\nnon-conforming offer to settle as I think appropriate.36. Order 59 Rule 2(2) states that:Subject to the express provisions of any written law and of these Rules, the\n\n  costs of and incidental to proceedings in the Supreme Courtshall be in the discretion of the\n\n  Court, and the Court shall have full power to determine by whom and to what extent the costs are\n\n  to be paid.37. How then is the discretion on award of costs to be exercised? The normal rule\n\nis that the court shall order the costs to follow the event except when the circumstances of the\n\ncase require the court, in exercise of its discretion, to make some other cost order: Order 59 Rule\n\n3(2).38. Although the court has an unfettered discretion to make whatever cost order\n\nthe justice of the case demands, this discretion obviously cannot be exercised arbitrarily, or on\n\nextraneous grounds and irrelevant considerations. It must be exercised judicially guided by\n\nestablished rules and principles.39. Special matters to be taken into account when exercising discretion are:(1)    Payment of money into court and the amount of such payment: Order 59 Rule 5.\n\n  The defendant paying money into court exceeding the sum awarded is generally regarded as the\n\n  successful party in the litigation. Therefore he is entitled to be paid costs as from the date of\n\n  payment in and he can only be deprived of such costs by the proper exercise of judicial discretion\n\n  upon proper materials arising out of the instant litigation or the conduct of it:Finlay v\n\n  Railway Executive[1950] 2 All E.R. 969; White Book 1999 Edn Vol 1 para 22/5/7 at p 421.\n\n  Interestingly, there is nothing within Order 22 pertaining to Payment into and out of court\n\n  that specifically deals with the consequences of not obtaining a judgment better than the amount\n\n  paid into court. Nothing similar to Order 22A Rule 9 exists in Order 22. The only provision\n\n  governing this is Order 59 Rule 5 which simply requires that the court, when exercising its\n\n  discretion as to costs, shall, to such extent as may be appropriate in the circumstances, take\n\n  into account any payment into court and the amount of such payment.(2)    Acts done or omissions made unreasonably or improperly by\n\n  or on behalf of any party where the costs of that party in respect of those acts or omissions may\n\n  be disallowed and that costs occasioned by them to the other party shall be paid by him to that\n\n  other party - Order 59 Rule 7(1): For instance, having acts done with a view to occasion\n\n  unnecessary costs - Order 59 Rule 7(2)(b) ; omitting to do any thing the doing of which would have\n\n  been calculated to save costs - Order 59 Rule 7(2)(a); and incurring unnecessary delays in the\n\n  proceedings - Order 59 Rule 7(2)(c).(3)    Whether costs have been incurred unreasonably or\n\n  improperly in any proceedings where the solicitor responsible may have to personally bear the\n\n  costs: Order 59 Rule 8.(4)    Whether costs have been wasted by a failure to conduct\n\n  proceedings with reasonable competence and expedition where the solicitor responsible may have to\n\n  personally bear the costs: Order 59 Rule 8.(5)    Without prejudice to Order 22A Rules 9 and 10, the court, in exercising its\n\n  discretion with respect to costs, may take into account any offer to settle, the date the offer\n\n  was made, the terms of the offer and the extent to which the plaintiffs judgment is more\n\n  favourable than the terms of the offer to settle: Order 22A Rule 12. An offer to settle is deemed\n\n  to be an offer of compromise made without prejudice save as to costs: Order 22A Rule 4.(6)    Without prejudice to Order 22A Rule 9 (1), (2) and (3),\n\n  where an offer to settle has been made, and notwithstanding anything in the offer to settle, the\n\n  court shall have full power to determine by whom and to what extent any costs are to be paid:\n\n  Order 22 A Rule 9 (5).40. The Court of Appeal inTullio v Maoro[1994] 2 SLR 489referred to the\n\nheadnote inRe Elgindata Ltd[1993] 1 All ER 232 which neatly collated the relevant\n\nprinciples governing the award of costs as follows:The principles on which costs were to be awarded were (i) that costs were in\n\n  the discretion of the court, (ii) that costs should follow the event except when it appeared to\n\n  the court that in the circumstances of the case some other order should be made, (iii) that the\n\n  general rule did not cease to apply simply because the successful party raised issues or made\n\n  allegations that failed, but that he could be deprived of his costs in whole or in part where he\n\n  had caused a significant increase in the length of the proceedings, and (iv) that where the\n\n  successful party raised issues or made allegations improperly or unreasonably the court could not\n\n  only deprive him of his costs but could also order him to pay the whole or part of the\n\n  unsuccessful partys costs. The fourth principle implied, moreover, that a successful party who\n\n  neither improperly nor unreasonably raised issues or made allegations which failed ought not to be\n\n  ordered to pay any part of the successful partys costs41. For the purpose of exercising its discretion on the award of costs, the court\n\nis thus entitled to take account of the conduct of the parties before as well as during the trial\n\nitself. I do not propose to give an exhaustive list, but it is useful to set out some of the\n\nrelevant conduct and circumstances. They include whether or not:(a)    Pre-trial procedures have on the whole been promptly and correctly adhered\n\n  to, or disregarded most of the time;(b)    Proper and full disclosure of all relevant documents and\n\n  materials as part of the discovery process has been given;(c)    Adequate accounts have been rendered and interrogatories\n\n  answered with all the necessary information and details provided;(d)    Ambush techniques or like strategies and late\n\n  disclosures are deliberately resorted to, thereby prejudicing the fair, proper and expeditious\n\n  disposal of the matter at hand;(e)    Sufficient effort has been taken to ensure that all\n\n  relevant and material facts have been included in the affidavits of evidence-in-chief to avoid\n\n  causing delays and unnecessary surprises to the other party, thereby forcing him to take last\n\n  minute instructions and conduct urgent further investigations in the course of the trial;(f)    Portions of the claim or defence are wholly unrealistic\n\n  or exaggerated;(g)    Plainly unsustainable, unmeritorious or unreasonable\n\n  issues have been put forward and argued at length;(h)    The successful party has lost or abandoned issues which\n\n  have consumed a substantial amount of the trial time;(i)    Court time has been wasted by unnecessarily long-winded\n\n  or repeated cross-examination, or by cross-examination on rather inconsequential and peripheral\n\n  matters;(j)    An excessive number of witnesses have been called to\n\n  prove the same point or to prove rather inconsequential and peripheral matters or matters not\n\n  really necessary to establish the partys case;(k)    Costs and expense have been unnecessarily, unreasonably\n\n  or improperly incurred;(l)    There are last minute amendments of pleadings and\n\n  inclusion of new heads of liability or damage at the trial itself;(m)    Fresh evidence and new witnesses have been brought\n\n  forward in the midst of the trial;(n)    Strict proof of documents evidently authentic has been\n\n  incessantly insisted upon when their authenticity could have been readily investigated and then\n\n  agreed upon well before the trial;(o)    The parties or their witnesses in conspiracy with the\n\n  parties concerned have lied in evidence, fabricated evidence for use or misled the court, or have\n\n  been dishonest in anyway. A successful party may be deprived of his costs if he presents a false\n\n  case or false evidence (SeeBaylis Baxter Ltd v Sabath[1958] 2 All ER 209);(p)    There is disgraceful behaviour deserving of moral\n\n  condemnation so as to warrant denying costs in full or in part to the culpable party.(q)    There is oppressive, unreasonable or unnecessarily\n\n  argumentative behaviour, which has increased the costs of the litigation, or impeded the\n\n  expeditious, fair and proper disposal of the case.(r)    Intolerable or prejudicial conduct of the litigation of\n\n  any kind is present;(s)    The hearing has been prolonged through incompetence,\n\n  negligence or simply dilatory conduct, and costs and expenses have been driven up by unnecessary\n\n  delays, which are not limited to those that are inordinate, inexcusable or prejudicial, or caused\n\n  by deliberate delaying tactics.42. In short, a successful party may be deprived of his costs in full or in part,\n\nif its conduct has been sufficiently blameworthy. Disallowing his entitlement to costs is one way\n\nthat the court can effectively express its view of the misconduct of the successful party during the\n\npre-litigation or litigation process and show its displeasure. In an exceptional case, the court may\n\neven order the successful party to pay the costs of the unsuccessful party.43. The question before me is whether after taking into account all the relevant\n\nfactors including the non-conforming offer to settle, there is any sound basis to depart from the\n\nnormal order that the costs should follow the event, and whether there is sufficient reason to deny\n\nany part of the costs of the successful plaintiff, or perhaps take an even more extreme and\n\nexceptional measure to order the successful plaintiff to pay all or part of the costs of the\n\nunsuccessful defendant instead. In the absence of an enabling provision like Order 22A Rule 9, which\n\nin this case has been specifically rendered inapplicable, I must exercise caution and have cogent\n\nreasons before exercising my discretion to impose the extreme cost sanctions similar to those\n\navailable under Order 22A Rule 9 and order the successful plaintiff to pay the costs of the\n\nunsuccessful 1stdefendant, who has made the non-conforming offer.44. In other words, where the failure to accept the non-conforming offer is so\n\nunreasonable in all the circumstances of the case, it may justify a punitive award of post-offer\n\ncosts to the defendant offeror (offeror) when the plaintiff offeree (offeree) fails to\n\nobtain a better result. However, where the circumstances merely show that the offeree should\n\nreasonably have accepted the non-conforming offer, it may be sufficient to deprive the offeree of\n\nhis post-offer costs. But where it is reasonable in the circumstances of the case for the offeree to\n\nreject the non-conforming offer, then the offeree should not be penalised in any way for not\n\naccepting the offer, and he should still be entitled to his post-offer costs.45. Counsel for the 1st defendant submitted strenuously that should the offer to\n\nsettle be found not to comply with Order 22A Rule 10, the court should still exercise its discretion\n\nin favour of the 1st defendant and order the plaintiff to pay the 1stdefendants costs\n\nincurred from the 16 May 2000 although the plaintiff may keep his entitlement to costs up to that\n\ndate. In addition, counsel for the 1stdefendant contended that the plaintiff lost on all\n\nthe major issues, which took most of the trial time. Further, the amount awarded was less than\n\n$100,000, which would have been within the jurisdiction of the Subordinate Court. It was only for\n\nabout 3 % of the amount claimed. He argued that it would be outrageous to give costs of about\n\n$400,000 or $500,000 where the judgment was for less than $100,000 and the plaintiff succeeded on\n\nonly a very small aspect of his claim, for which not much time was taken. Counsel even asked for\n\ncosts to be on the Subordinate Court scale and to have it apportioned.46. Counsel for the 1stdefendant further pointed out that Order 22A\n\nis relatively new, and there has been no case precedent in the context where the plaintiff had\n\nwrongly joined a party as the 2nddefendants. He submitted that in circumstances where\n\nthe 1stdefendant wished and in fact offered to settle the whole of the proceedings but\n\nthe plaintiff refused to accept the offer, and as the event turned out, the judgment sum was\n\nsubstantially less than the terms of the offer to settle, the 1stdefendant ought not to\n\nbe unfairly disadvantaged by the application of Order 22A Rule 10.47. In the exercise of my discretion in relation to the costs incurredafter\n\nthe date of the offer(of which there are broadly three options, namely, to award those\n\ncosts to the plaintiff, deprive the plaintiff his costs or part of his costs, or order the plaintiff\n\ninstead to pay the costs to the 1stdefendant), I have to consider the following factors\n\nwhich are relevant in my view:(a)    In favour of the 1stdefendant is the generous non-conforming\n\n  offer he had made, which the plaintiff failed to beat. I recognise that it is an important\n\n  consideration in the exercise of the courts discretion with regard to costs. But that\n\n  non-conforming offer should only influence but not govern or dictate the exercise of discretion by\n\n  the court.(b)    As against that is the fact that the non-conforming offer\n\n  only deals with the party and party costs of the plaintiff up to the date of service of the offer.\n\n  Presumably, the offer was only for the getting up costs of only one counsel. However, my cost\n\n  order was for two counsel. As such, if the pre-trial getting up cost of a second counsel for the\n\n  plaintiff were to be included, the difference between the whole amount (including costs) actually\n\n  awarded by the court and that offered by the 1stdefendant would be significantly\n\n  reduced. One has to compare the offer as a whole including costs, and not merely that part\n\n  relating to damages.(c)    The 1stdefendant kept silent in his offer on\n\n  how the costs of the 2nddefendants were to be settled. The terms of the offer called\n\n  for a settlement of the proceedings, which suggests a complete withdrawal of the whole action\n\n  against both defendants by the plaintiff. If the plaintiff were to release the 1stdefendant upon acceptance of his offer to settle, the plaintiff must also release the hospital as\n\n  the other alleged joint tortfeasor. But who then is to bear the 2nddefendants\n\n  costs? Is the plaintiff to assume that the 2nddefendants would not be asking for their\n\n  costs upon a withdrawal of the plaintiffs claim? If not, is it going to be the 1stdefendant or the plaintiff himself who has to pay the 2nddefendants costs? It is of\n\n  crucial importance therefore that a clear offer to settle be made with all the terms\n\n  comprehensively set out. The offeree needs to know precisely what the terms are before he accepts\n\n  the offer. In the event of default, the offeree must be able to enter judgment on the terms of the\n\n  offer stated, whether or not it is an offer conforming to Order 22A Rule 10. Hence an offer to\n\n  settle must be precise and unequivocal, particularly when there are many heads of claim and\n\n  perhaps many defendants, not all of whom are joining in the offer to settle, and the settlement\n\n  may well be with respect to certain heads of claim only. A precise offer with unequivocal terms\n\n  also helps the court to determine whether the plaintiff has, on the action as a whole, obtained an\n\n  order or a judgment sum (together with the interest awarded for the period before the service of\n\n  the offer to settle), which is more favourable or less favourable than the terms of the offer. If\n\n  the court cannot readily determine that because of incomplete terms or ambiguity, the court may\n\n  disregard the offer and the offeror may well lose his cost advantage altogether. With the\n\n  uncertainty or ambiguity in the offer from the 1stdefendant in relation to the costs\n\n  of the 2nddefendants, and in the light of his non-compliance with Order 22A Rule 10, I\n\n  could not to place too much weight on the non-conforming offer to settle.(d)    Added to this is the fact that the revised offer was\n\n  served on 16 May 2000 at the very doorstep of the trial fixed to commence on the following day.\n\n  The last minute offer to settle only the 1stdefendants portion of the claim puts\n\n  the plaintiff in a difficult and embarrassing position. Given the shortness of time and the\n\n  frenzied preparations for trial, would it be fair to expect the plaintiff to give the offer\n\n  adequate and serious consideration? InThe Salavery[1968] 1 Lloyds Rep 53, Brandon J\n\n  rejected a submission that he should pay regard to an offer of settlement made only 11 days before\n\n  the trial, and the rejection of that offer because it was not reasonable to expect decisions to be\n\n  taken, particularly with foreign shipowners, in such a short time. Similarly, inColgate\n\n  Palmolive Ltd v. Markwell Finance[1990] R.P.C. 197, the offer of settlement \"without\n\n  prejudice save as to costs\" afforded no basis for denying the plaintiffs their full costs of\n\n  the actions when (a) the letter was sent five days before trial in which the plaintiffs had\n\n  witnesses travelling from abroad; (b) the letter did not offer all the relief to which the\n\n  plaintiffs were entitled; and (c) the offer related to only one of two products the subject-matter\n\n  of the actions and a settlement on that basis would have had little effect on the length of trial\n\n  (see White Book 1999 Vol 1 at para 62/9/4 at p 1139). Clearly, the plaintiff must be given the\n\n  opportunity to properly assess and evaluate the offer. If not, the offeror only has himself to\n\n  blame if the court would not exercise its discretion in his favour and grant him the cost\n\n  advantages.(e)    At this stage when the offer was served, the 1stdefendant had not fully disclosed all the material facts of their defence known as the fall\n\n  theory. The details of how he had operated on Mr Harte were also not fully disclosed. The\n\n  brevity and lack of details of the 1stdefendants own affidavit of evidence-in-chief\n\n  and those of his witnesses speak for themselves. In fact, at the trial I had to allow the\n\n  plaintiff to recall his expert witnesses to give rebuttal evidence on areas which were not put to\n\n  the plaintiffs expert witnesses earlier and which were alluded to only at the stage of the\n\n  defence. Not apprised of the full extent of the 1stdefendants case, the plaintiff\n\n  could not be said to be in a good position to assess the strength of his own casevis--visthat of the 1stdefendants in relation to all the facts and issues brought out in\n\n  his statement of claim and the defence of the 1stdefendant. In the circumstances and\n\n  given the shortage of time, I did not think that the plaintiff was given a fair opportunity to\n\n  evaluate the offer properly. In my opinion, the plaintiff had not acted unreasonably in refusing\n\n  to accept the non-conforming offer to settle.(f)    The 1stdefendant had resorted to tendering at\n\n  the last minute a number of medical authorities in support of his defence, which should have been\n\n  given to the plaintiff well before hand. In the midst of the trial, the 1stdefendant\n\n  notified that he intended to call an engineer in support of his fall theory. This put the\n\n  plaintiff in a difficult position. In response, the plaintiff had to call a biomechanical engineer\n\n  to testify for him on an urgent basis. The result was a flurry of new scientific papers submitted\n\n  by the engineering experts and a computer modelling analysis was performed. A body scan to obtain\n\n  the physical dimensions of the plaintiff had to be done. The trial was therefore lengthened\n\n  considerably owing to the late calling of these engineers and the resulting interruptions, which I\n\n  must say was caused by the 1stdefendant. I allowed these new witnesses to testify as I\n\n  felt their evidence would be relevant and be of assistance. But this aspect of getting up and\n\n  planning should have been done during the pre-trial stages so that the trial can proceed smoothly\n\n  and expeditiously. It seemed as if the 1stdefendant was doing intensive groundwork,\n\n  research and investigations after the trial had begun, and was firming up his defence on the fall\n\n  theory as the trial was progressing. Admittedly it was not easy for the 1stdefendant to flesh out and piece together the fall theory he advanced. Nevertheless it\n\n  seemed that much of the work was done on a last minute basis and in the course of the trial.(g)    The 1stdefendant also brought out a surprise\n\n  exhibit to which counsel for the plaintiff objected to on the basis of ambush litigation.(h)    I have to consider also the fact that the plaintiff had\n\n  lost on an important issue: that Dr Tan was negligent in his operation, which issue took a\n\n  substantial amount of the trial time. The 1stdefendant on the other hand was trying to\n\n  prove that the fall caused the injury instead. Both these issues of causation were closely\n\n  intertwined. I had to deal with the surgery and the fall together to analyse the probabilities,\n\n  and to establish which was the more likely cause. In my view, it was not unreasonable for the\n\n  plaintiff to have alleged that Dr Tan was negligent during his surgery. As the operation was\n\n  wholly within the control of Dr Tan, the plaintiff was not in a position to know and to prove what\n\n  exactly had happened at the operation.How Dr Tan actually performed the surgery was by no\n\n  means clear from the very brief contemporaneous notes he kept after the surgery. There were some\n\n  circumstances causing the plaintiff to suspect that Dr Tan was not forthcoming and was hiding\n\n  certain facts about the surgery from him during the post-operative treatment. I was not prepared\n\n  in the circumstances to deny the plaintiffs costs on causation although the plaintiff lost on\n\n  that issue because I did not regard that issue as one improperly or unreasonably raised by him.(i)    Eventually I found Dr Tan to be negligent for not\n\n  treating the plaintiff soon after the plaintiff reported to him of unusual pain and swelling in\n\n  his scrotum on the morning after the surgery. Dr Tan was held liable for his poor post-operative\n\n  care but not for his surgery. He must in substance be treated as one who had lost the action\n\n  against the plaintiff.I thus regarded that the plaintiff was the successful party on the\n\n  action as a whole despite having failed on the substantive issue of causation.(j)    Dr Tan in his defence against any post-operative\n\n  negligence had taken the position that Mr Harte never telephoned him to complain on the next day\n\n  following the surgery, on which I found that Dr Tan had lied. I also found that Dr Tan had\n\n  fabricated his clinical notes to state that there was \"No pain\". In court, Dr Tan\n\n  maintained that Mr Harte was not in pain when he eventually saw him on the 4thday\n\n  after the surgery, which evidence I disbelieved. His deplorable conduct at the trial to shift away\n\n  his responsibility to attend to the patient after receiving the plaintiffs distress calls by\n\n  falsely denying that he ever received them must be factored into the equation when determining if\n\n  Dr Tan should be disallowed the attendant cost advantages flowing from his non-conforming offer to\n\n  settle. InSutcliffe v Smith(1886) 2 T.L.R. 881, Lord Justice Fry concurring with Lord\n\n  Justice Bowen said that whenever a defendant had by his mis-statements, made under circumstances\n\n  which imposed an obligation upon him to be truthful and careful in what he said, brought\n\n  litigation on himself, and rendered the action reasonable, there would be \"good cause\"\n\n  to deprive him of costs. If one looks at the 1stdefendant as being entitled to his\n\n  costs because the plaintiff has failed to beat the 1stdefendants offer to settle,\n\n  the 1stdefendant may be deprived of this cost benefit if his conduct was such that he\n\n  had been dishonest, which he was found to be in relation to his insertion of \"No pain\"\n\n  into his post-operative clinical notes when the plaintiff obviously was suffering from pain, and\n\n  his insistence on the absence of any distress calls from the plaintiff in order to absolve himself\n\n  of blame for his negligent post-operative care. Basically, I found that the 1stdefendant lied in a material part of his testimony in court.48. Having regard to (h), (i) and (j) above, I found no good reason to disallow\n\nany part of the costs of the plaintiff (in relation to his claim against the 1stdefendant) incurred for getting upprior to the service of the offer to settle, which\n\nthe successful plaintiff would generally be entitled to as a matter of course.49. As for the issue of the costsafter the service of the offer to settle,\n\nit was not an easy task trying to factor in all the matters from (a) to (j) above. On the whole, the\n\nmajority weighed against the 1stdefendant. After carefully taking account of all the\n\nfactors, I exercised my discretion in favour of the plaintiff. I decided that on the whole, it would\n\nbe far more fair and equitable that the unsuccessful 1stdefendant continues to bear the\n\npost-offer costs of the successful plaintiff (again only in relation to the plaintiffs claim\n\nagainst him), notwithstanding the rather generous non-conforming offer from the 1stdefendant. I found insufficient reason to penalise the plaintiff in costs or to deprive him of his\n\npost-offer costs, except in so far as his entire costs in relation to his separate claim against the\n\nhospital were entirely excluded from the costs payable by the 1stdefendant. The\n\nplaintiffs refusal to accept the non-conforming offer was reasonable in all the circumstances of\n\nthe case.50. Dissatisfied, the 1stdefendant made an application for leave to\n\nappeal solely against my order on costs against him.",
        "Leave to appeal on costs": "51. Counsel for Dr Tan highlighted the case,Buckle v Holmes[1926] 2 KB\n\n125 at 127, which was of assistance. There Banker LJ gave leave to appeal, not because there was any\n\nreal doubt about the law, but because the question was one of general importance and one upon which\n\nfurther argument and a decision of the Court of Appeal would be to the public advantage.52. Section 34(2) of the Supreme Court of Judicature Act states that:Except with the leave of the Court of Appeal or a Judge, no appeal shall be\n\n  brought to the Court of Appeal....a.    where the only issue in the appeal relates to costs ..53. InLee Kuan Yew v Tang Liang Hong & Anor[1997] 3 SLR 489, Yong\n\nPung How CJ considered the principles concerning leave to appeal:.. there are at least three limbs which can be relied upon when leave to appeal\n\n  is sought: (1)prima faciecase of error; (2) question of general importance decided for\n\n  the first time; and (3) question of importance upon which further argument and a decision of a\n\n  higher tribunal would be to the public advantage.It is my opinion that leave to appeal on costs ought to be granted, relying upon\n\neither the second or the third limb as stated by the Chief Justice.54. Moreover, there was some compelling force in the 1stdefendants\n\ncontention that the law does not expect the impossible to take place i.e. expect Dr Tan to pay the\n\ncosts of the hospital (which the 1stdefendants counsel said may amount to some\n\n$300,000) for no good legal reason, when both defendants rightly took the view that the hospital was\n\nnot vicariously liable at all to Mr Harte and that the hospital should not have been joined as a 2nddefendant by Mr Harte.Prima facie, the 1stdefendant will never be able to make a\n\nconforming and valid offer to settle the claim under Rule 10 when he has no wish to pay the 2nddefendants costs under the circumstances aforesaid. The 2nddefendant will naturally\n\nbe insisting on his costs to be paid should the action be settled. How then is the 1stdefendant to make an offer to settle such that he will be entitled to the cost consequences in Order\n\n22A Rule 9 as a matter of course, and where it will no longer be a matter depending largely on the\n\nwide discretion of the court? How is he to protect his position on costs and effectively put that\n\nrisk on costs on the plaintiff? Whether an offer to settle the entire action on the basis of an\n\noffer of $300,000 plus all reasonable costs on a two counsel basis up to the date of offer but with\n\nan express provision for the plaintiff to bear all the costs of the 2nddefendant may be\n\nregarded as a proper conforming offer under Order 22A Rule 10 thereby invoking the cost consequences\n\nin Rule 9 is difficult to say. What if the plaintiff had brought a claim of joint liability against\n\n5 defendants, and the 1stdefendant, in his offer to settle the whole claim for a\n\nspecific sum plus the plaintiffs costs, makes an offer to pay only the costs of the 2ndand 3rddefendants but explicitly states that it is for the plaintiff himself to bear the\n\ncosts of the 4thand 5thdefendants? Will these terms be clear enough for the\n\ncourt, at the conclusion of the trial, to determine whether or not the plaintiff has effectively\n\nbeaten the offer? Will that be a sufficiently clear, unambiguous and complete offer to settle which\n\ncan then be given effect to under Order 22A Rules 9 and 10? If so, then the argument of impossibility\n\nfails. If not, then perhaps the Rules themselves leave such complicated situations to be dealt with\n\nmore flexibly under the inherently wide discretion of the court as if they were Calderbank offers\n\n(seeCalderbank v Calderbank[1975] 3 W.L.R. 586).55. Having regard to these legal questions, which I admit I have difficulty\n\ngrappling with, I thought it appropriate and justifiable to grant leave to appeal on costs, which I\n\ndid, so that some beneficial guidance would be available for parties finding themselves in similar\n\ncircumstances in the future. As is the modern practice, I fixed costs for the 1stdefendants application for leave to be costs in the appeal.56. Since the costs incurred after the date of service of the offer to settle\n\ncould potentially amount to some S$250,000.00 (based on two counsel for some 31 days of trial),\n\nwhich when added to those costs of Dr Tans own counsel that Dr Tan would not now recover from Mr\n\nHarte, the difference in costs could be in the region of S$500,000. However, if the 1stdefendants offer to settle is good and the plaintiff has to pay the costs of the 1stdefendant instead, then it is going to be worse than a Pyrrhic victory for the plaintiff. In\n\nsubstance, it is a ruinous and annihilating defeat, as he would be out of pocket by some $400,000\n\neven after taking account of the judgment sum awarded. The financial consequences are indeed severe\n\nand the matter is naturally of considerable importance to both parties, though I must emphasize that\n\nit was not a factor I took into consideration when I granted leave to appeal on costs.",
        "Stay of execution": "57. The total judgment sum awarded was S$32,995.62 and US$36,589.25. In Singapore\n\ndollars, this totalled approximately S$96,660 at the exchange rate of S$1.74 to US$1. Counsel for Dr\n\nTan applied for a stay of execution of the judgment sum pending his application for leave to appeal\n\non costs. He informed me that his client was not going to appeal on the question of liability, nor\n\non the amount of damages awarded. But if his clients appeal on costs were to be successful, there\n\nmight be nothing to pay over to the plaintiff. The 1stdefendant essentially wanted to\n\nstay the execution of the judgment sum, for which there was no appeal, in order to have security\n\nagainst any costs payable by the plaintiff in the event that he succeeds on his appeal on costs. He\n\nwanted to set off the judgment sum against the costs recoverable from the plaintiff.58. At first brush, it appeared odd that the 1stdefendant who was not\n\ngoing to appeal against liability or quantum of damages assessed should be asking to stay execution\n\nof the judgment sum. Counsel for the plaintiff termed it a stay of executionin vacuo.\n\nHowever, on reflection, I did not think that it was an application that could be dismissed outright\n\nas being a non-starter. Where an appeal on costs alone, if allowed, results in the entire judgment\n\nsum not payable to the plaintiff because the net costs in favour of the defendant exceed that\n\njudgment sum, the defendant should not be precluded from making a stay of execution on the judgment\n\nsum simply because he has not appealed against the judgment itself. Where the circumstances show\n\nthat a judgment sum paid over is not likely to be recoverable for setting off against the costs\n\npayable and hence, the appeal on costs will be rendered nugatory in the event of a successful\n\nappeal, I think the defendant has a sufficient basis to apply to stay the execution on the judgment\n\nsum.59. Order 57 Rule 15 states the general principle that:(1) Except so far as the Court below or the Court of Appeal may otherwise\n\n  direct-a.    an appeal shall not operate as a stay of execution or of\n\n    proceedings under the decision of the Court below;60. Section 41(1) of the Supreme Court of Judicature Act also states that:(1) An appeal shall not operate as a stay of execution or of proceedings under\n\n  the decision appealed from unless the court below or the Court of Appeal so orders.61. The position in Singapore was succinctly laid down by Yong Pung How CJ inLee\n\nSian Hee v Oh Kheng Soon[1992] 1 SLR 77at p 78H:Whilst the court has power to grant a stay, and this is entirely in the\n\n  discretion of the court, the discretion must be exercised in accordance with well established\n\n  principles (Lee Kuan Yew v J B Jeyaratnam[1990] SLR 740;[1991] 1 MLJ 83). First, as a\n\n  general proposition, the court does not deprive a successful litigant of the fruits of his\n\n  litigation, and lock up the funds to whichprima faciehe is entitled, pending an appeal (The\n\n  Annot Lyle(1886) 1 PD 114 at 116). However, when a party is exercising his undoubted right\n\n  of appeal, the court ought to see that the appeal, if successful, is not nugatory (Wilson v\n\n  Church (No2)(1879) 12 Ch D 454 at 458-459). Thus, a stay will be granted if it can be shown\n\n  by affidavit that, if the damages and costs are paid, there is no reasonable probability of\n\n  getting them back, if the appeal succeeds (Atkins v Great Western Railway Co(1886) 2 TLR\n\n  400).62. The Chief Justice continued at p 80:In the affidavit filed, there are no indications of special circumstances other\n\n  than the alleged likelihood of success in the appeal  the likelihood of success is not by\n\n  itself sufficient, even in the context of an appeal against a summary judgmentIf a bald\n\n  assertion of the likelihood of success is adequate, then a stay would be granted in every case,\n\n  for every appellant must expect that his appeal will succeed (Atkins v Great Western Railway Co).\n\n  This is quite contrary to the Supreme Court of Judicature Act, the Rules of the Supreme Court, and\n\n  to established case law.63. This was followed inLian Soon Construction Pte Ltd v Guan Qian Realty Pte\n\nLtd[1999] 2 SLR 233. The court, in every case, will have to examine the facts to see if special\n\ncircumstances justifying the grant of a stay of execution exists:Cathay Theatres Pte Ltd v LKM\n\nInvestment Holdings Pte Ltd[2000] 1 SLR 701at 705H. Halsbury Laws of England 4thEdn (1976) Vol 17 para 451 at p 270 states that the special circumstances which entitle the court to\n\nstay execution of a money judgment are circumstances which go to the enforcement of the judgment and\n\nnot those which go to its validity or correctness. In other words, the existence of strong grounds\n\nfor an appeal based on the incorrectness or invalidity of a judgment does not constitute a special\n\ncircumstance upon which a stay of execution pending appeal should be granted. (See alsoLee Kuan\n\nYew v Jeyaretnam JB[1991] 1 MLJ 83at p 85.)64. The mere fact that the plaintiffs are a foreign company is insufficient in\n\nitself to justify a stay of execution:Exim Sales Corporation v Dolly Enterprises Pte Ltd(15\n\nMay 1997 in S150/96). I was also referred to the judgment of Abdul Malik Ishak J inWu Shu Chen v\n\nRaja Zainal Abidin bin Raja Hussin & Anor[1995] 3 MLJ 224where it was stated that although\n\nwhat may amount to special circumstances is a question of fact in each case, it must be something\n\ndistinctive and out of the way. The fact that a large amount of money is involved does not per se\n\nconstitute a special circumstance:Eng Yam Construction Sdn Bhd v TAP Properties Sdn Bhddigested in 2 Mallals Digest (4thEdn, 1994 Reissue) para 1363.65. The main factors relied upon by the 1stdefendant in his stay\n\napplication were that the plaintiff is a United States (US) national, and that enforcement of\n\na successful appeal in the US would be inconvenient and difficult. There was however no evidence\n\nthat the plaintiff was financially insolvent. Neither was there evidence that the plaintiff, being a\n\nsuccessful and experienced commodity trader having a reputation to maintain, would attempt to do\n\nanything as to render any possible successful appeal nugatory. Nor was there evidence that he would\n\nlikely abscond with the judgment sum and make himself untraceable in the event of a successful\n\nappeal.66. Weighing all the relevant factors carefully, it was my conclusion that the\n\napplication for stay was not supported by any argument, let alone any evidence, that could amount to\n\nspecial circumstances justifying a stay of execution. Mere inconvenience and difficulty of having to\n\nbring proceedings in a foreign jurisdiction to recover is not a sufficient circumstance justifying a\n\nstay without more. Unless that judgment sum paid over was also likely to be unrecoverable, I would\n\nnot regard the appeal on costs, if successful, to be rendered nugatory or partially nugatory, if no\n\nstay was granted. In this case, the judgment sum awarded of S$32,995.62 and US$36,589.25 plus\n\ninterest was not particularly large relative to the present salary of the plaintiff in New York at\n\nUS $77,800 per annum excluding bonus. I also noted that the plaintiff has a house in the United\n\nStates. As such, I did not think that Mr Harte is a man without the means to repay this judgment sum\n\nin the event of a successful appeal. What counsel for the 1stdefendant managed to put\n\nforward was a possibility that the plaintiff could become insolvent and that it would be\n\ninconvenient to bring recovery proceedings in the United States, should the 1stdefendant\n\nsucceed in his appeal on costs. These were clearly insufficient for the court to exercise its\n\ndiscretion to grant a stay of execution. This was not a case of a summary judgment or a judgment in\n\ndefault but a judgment after a trial of 31 days where the issues on liability, assessment of damages\n\nand costs had been carefully considered. I did not think I should deprive the successful plaintiff\n\nof the fruits of his hard fought victory just because of a pending appeal on costs, where the 1stdefendant, if successful on the appeal, might recover an amount in costs exceeding the amount of\n\ndamages awarded to the plaintiff.67. In the circumstances, I dismissed the application for a stay of execution. I\n\nalso fixed the costs for this application at $1,500, to be paid by the 1stdefendant to\n\nthe plaintiff.",
        "Chan Seng Onn": "Judicial CommissionerCopyright © Government of Singapore."
    }
}