{
    "case_title": "PT GE Astra Finance v The Owners of the Ship or Vessel \"Pioneer Glory\"",
    "ncitation": "[2001] SGHC 156",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "1. PT GE Astra Finance (the plaintiffs) appealed (in Registrar’s\n\nAppeal No. 600031 of 2001) against the decision of the Assistant Registrar in refusing to\n\naward them the sum of US$476,250 alternatively, the sum of US$617,150 they had claimed as\n\ndamages against the owners (referred to collectively as the defendants) of the tug\n\n‘Pioneer Glory’ and the barge ‘POE 2410’ arising from a shipment of\n\nthe plaintiffs’ equipment from Samarinda, Indonesia, to Singapore. The defendants\n\nfiled a cross-appeal (in Registrar’s Appeal No. 600030 of 2001) against the orders of\n\nthe Assistant Registrar awarding the plaintiffs the sums of US$187,360.38 and US$158,750\n\nfor loan interest and depreciation (on the equipment) respectively. The assessment of\n\ndamages was pursuant to an order of court dated 9 April 1998 made by Khoo J.2. I heard both appeals after which I allowed the plaintiff’s\n\nappeal but dismissed the defendants’ cross-appeal. The defendants have now filed a\n\nnotice of appeal (in Civil Appeal No. 600038 of 2001) against my decision.",
        "The facts": "3. The plaintiffs are an Indonesian finance company.. They leased out\n\n14 pieces of heavy equipment (the equipment) to an Indonesian company PT DML Resources\n\n(DML) for a (mining) project in Kalimantan owned by PT Tanito Harum (Tanito), under a\n\nlease agreement dated 17 March 1995. The equipment was the ‘Komatsu’ brand and\n\nwas supplied to the plaintiffs by an Indonesian company called PT United Tractors (UT). At\n\nthe time of their purchase, the plaintiffs had entered into two (2) repurchase agreements\n\n(the repurchase agreements) with UT for the latter to repurchase the equipment at agreed\n\nprices.4. Upon completion of the project, and as required under its agreement\n\nwith DML, Tanito arranged for the equipment to be exported out of Indonesia as otherwise,\n\nDML would have to pay import duty if the equipment remained in Indonesia. The plaintiffs\n\ndecided to send the equipment to Singapore with a view to finding buyers who could offer\n\nbetter prices than what UT had agreed to pay under the repurchase agreements. That was the\n\nbeginning of the plaintiffs’ problems.5. The equipment was shipped to Singapore under 14 bills of lading\n\n(which named the plaintiffs as the consignees and DML as the notify party) on board the\n\nbarge ‘POE 2410’ towed by the tug ‘Pioneer Glory’, both being named as\n\nthe vessel in the bills of lading. The shipment arrived in Singapore on 3 December 1997\n\nbut neither the plaintiffs’ shipping agents (Sembawang Kimtrans Pte Ltd) nor the\n\nplaintiffs were able to take delivery. This was because the defendants claimed to have a\n\nlien on the cargo due to the fact that the charterers (Nakhoda Bestari Sdn Bhd) of the\n\ntug/barge owed them charter freight of $177,597.6. As attempts by the plaintiffs and their solicitors in securing\n\ndelivery of the equipment were fruitless, the plaintiffs commenced these two (2) suits on\n\n31 January 1998. On 11 March 1998, Selvam J made an interim order (on the plaintiffs’\n\napplication) for the plaintiffs to take delivery of the equipment at their own expense,\n\nand adjourned the substantive question of wrongful detention on the part of the\n\ndefendants, for later consideration.7. On 9 April 1998, the question of wrongful detention was heard by\n\nKhoo J who:a. ordered that both suits be consolidated;b. declared that the defendants’ detention and or purported\n\n  exercise of a lien on the equipment shipped under the 14 bills of lading was wrongful;c. ordered the defendants to pay damages to the plaintiffs (to be\n\n  assessed) including all costs incurred by the plaintiffs in implementing the order of\n\n  court of 11 March 1998, arising out of the wrongful detention, and awarded costs to the\n\n  plaintiffs.The equipment was not discharged until 20 April 1998 as arrangements\n\nhad to be made therefor; discharge was completed on 22 April 1998. While the barge was at\n\nthe yard of Ban Choon Shipyard Pte Ltd for the purpose of discharging the equipment, the\n\nplaintiffs commissioned Insight Marine Services Pte Ltd (Insight) to conduct a survey\n\n– to record any damage that may be sustained by the barge during the discharge\n\noperation and, to note the condition of the equipment. Khoo J gave the grounds for his\n\ndecision on 14 July 1998.",
        "The assessment": "8. Pursuant to Khoo J’s order dated 9 April 1998, assessment of\n\ndamages took place before the Assistant Registrar between 15-17 January 2001, pursuant to\n\na summons for directions filed by the plaintiffs on 26 March 1999. Damages were awarded on\n\n31 January 2001.9. Affidavits were filed for the assessment hearing and their deponents\n\ncross-examined. For the plaintiffs, an affidavit was filed by Frans Louis Lewerissa\n\n(Lewerissa) their marketing manager at the material time, who is also their director. In\n\nhis affidavit, Lewerissa claimed the following items:(a) cancellation fees (for permit to discharge) S$600.00(b) extension of insurance policy for period of detention US$4,724.68(c) insurance for discharge S$750.00(d) survey fees (of Insight Marine Services Pte Ltd) S$4,124.00(e) transportation costs (air-fare of Lewerissa) US$ 278.66(f) accommodation costs (of Lewerissa) S$212.00(g) damages (fall in value of equipment) US$476,250.00(h) or, fall in repurchase price US$617,150.00(i) additional interest paid on loan US$187,360.38(j) interest on judgment sum(k) costs pursuant to Order of Court dated 9 April 1998Of the above breakdown, items (a) to (f), (j) and (k) were conceded by\n\ncounsel for the defendants in his closing submissions. The awards for items (g) and (h)\n\nwere the subject of the plaintiffs’ appeal while that for item (i) was the subject of\n\nthe defendants’ cross-appeal together with the court’s award of US$158,750 for\n\nitem (g).10. The plaintiffs had called a valuer John Rounce (Rounce) to testify;\n\nhe is a director of Henry Butcher Plant & Machinery Sdn Bhd (HB) who are international\n\nplant and machinery consultants. Rounce (who described himself as a specialist in\n\nvaluation of plant and machinery for over 25 years) gave a valuation report dated 26\n\nFebruary 1999 on the equipment. He had seen the equipment on or about 22 October 1998 at\n\nthe storage yard of Sembawang Kimtrans after its discharge from the barge. Rounce’s\n\nrole was to assess the fall in value of the equipment over the period of detention, based\n\non time factor alone. Rounce opined that from December 1997 to April 1998, the equipment\n\nhad fallen in value by 15% based on US$3,175,000, which translated into a loss of\n\nUS$476,250.11. On their part, the defendants called their managing-director John\n\nKoh to testify, together with their (former) shipping executive Alvin Lim. They had\n\nappointed Tay Kes Siong (Tay) from Marine Management Surveyor & Services Pte Ltd (MSS)\n\nto conduct a survey of the equipment when the vessels arrived in Singapore on 3 December\n\n1997. Another surveyor Chan Weng Fatt (Chan) from MSS conducted a second survey (between\n\n20-22 April 1998) before the equipment was discharged from the barge, at the same time\n\nthat Insight carried out the plaintiffs’ survey. Both Tay and Chan rendered reports\n\nof their respective surveys which were exhibited to their affidavits and upon which they\n\nwere cross-examined.12. In her grounds of decision (para 6), the Assistant Registrar stated\n\nthat she allowed the plaintiffs’ claim for interest (US$187,360.38) as it was\n\nincurred in the natural course of events, as an extension on an already existing loan. The\n\nextension was necessitated by the detention of the equipment and hence the defendants are\n\nliable. In this regard, she must have accepted the evidence of Lewerissa (see paras 71 to\n\n76 of his affidavit). He had explained that the plaintiffs’ purchase of the equipment\n\nhad been funded by a loan (the loan) from GE Capital International Holdings Corporation\n\n(GE Capital) pursuant to a Revolving Credit Agreement dated 1 July 1997 (which copy he\n\nexhibited to his affidavit). He identified the various clauses pertaining to payment of\n\ninterest in the document. He deposed that had the equipment not been detained by the\n\ndefendants, it would have been resold to UT by the beginning of February 1998 and the sale\n\nproceeds applied to repay the loan. The defendants’ detention of the equipment\n\ndelayed the plaintiffs’ resale to UT until November 1998; UT also paid the resale\n\nprice by instalments with the last payment being made in February 1999. Each time UT paid,\n\nthe plaintiffs applied the instalment payment towards reduction of the loan.13. The Assistant Registrar however, reduced the plaintiffs’ claim\n\nfor the fall in value and disallowed their alternative claim for the fall in the\n\nrepurchase price from UT, of the equipment. In her grounds of decision, she opined that\n\nthe consequential loss for the defendants’ wrongful action which the plaintiffs could\n\nclaim was from 9 December 1997 (when formal notice to deliver the equipment was tendered)\n\nuntil 20 April 1998 (when the equipment was delivered to the plaintiffs). She held that\n\nthe defendants cannot be held liable for the period in which the plaintiffs had difficult\n\nrelations with UT under the repurchase agreements. The Assistant Registrar felt that the\n\nclaim for the fall in the repurchase price was too remote. Based on the evidence adduced,\n\nshe said that notwithstanding the wrongful detention, the plaintiffs would have\n\nencountered problems in obtaining payment from UT in any event, because the latter was in\n\nfinancial difficulties. I take judicial notice of the fact that the events in question\n\ntook place when Indonesia went through a political as well as economic, crisis in 1998.14. The court below also held that the damage arising from the wrongful\n\ndetention could not be as great as Rounce had estimated. She observed that Rounce only had\n\nsight of the equipmentafterits discharge. She said (see paras 11 to 14 in her\n\ngrounds) that Rounce’s contribution was to show a trend analysis of the\n\nequipment’s market prices, based on time factor alone. Rounce did not produce\n\nevidence to show the actual depreciation suffered by the equipment although she\n\nappreciated the fact that such evidence was hard to come by (Rounce had deposed that at\n\nthe date of his valuation there was no market for such equipment in Singapore). Further,\n\nthe comparative figures produced by Rounce were not for the actual machines in the\n\nequipment, one example being the two (2) models of excavators he used to establish market\n\nprices even though only two (2) of the 14 pieces of equipment were hydraulic excavators\n\nand, one (1) of them was an extra large model which was manufactured in limited numbers.15. The Assistant Registrar considered that rust had damaged the\n\nequipment before the barge was detained. She observed that the plaintiffs did not call\n\ntheir surveyor (from Insight) to testify on the extent of the damage claimed by the\n\nplaintiffs although they were present at the points of detention and delivery. A further\n\nconsideration she took into account was, that the equipment was stored in conditions not\n\nentirely different from other construction equipment when it is leased out to contractors.\n\nFinally (which factor was the most important to her mind), she noted that the average\n\nlife-span of such equipment is/was 10 years. She could not accept that five (5) months of\n\ninactivity (when the equipment was sitting on the barge) could cause the extent of\n\ndepreciation estimated by Rounce. Accordingly, she reduced his 15% depreciation to 5% and\n\nthe plaintiffs’ claim of US$476,250 was accordingly adjusted to US$158,750.",
        "The appeal": "(i) the plaintiffs’ submissions16. In his submissions, counsel for the plaintiffs referred to\n\nLewerissa’s affidavit (see paras 49 to 70). According to Lewerissa, a few interested\n\nbuyers had offered to buy the equipment when it was still under detention. However, the\n\nplaintiffs did not/could not accept the offers because they did not know when the same\n\nwould be released. Parties who were interested to purchase the equipment after its release\n\neither offered prices which were too low or, eventually lost interest. Consequently, the\n\nplaintiffs served notice on UT on or about 13 May 1998 to repurchase the equipment. Based\n\non formulae set out in the repurchase agreements (which were dependent on the number of\n\nlease payments made by DML), the agreed repurchase prices for the 14 pieces of equipment\n\nwere fixed at US$3,317,150 as at February 1998. By a letter dated 2 July 1998 however, UT\n\ninformed the plaintiffs they did not agree with the plaintiffs’ exercise of the\n\nbuy-back option; the company complained that the equipment had deteriorated under the\n\nextended period of detention without protection in a corrosive environment and, the\n\nbatteries therein had weakened because the engines had not been turned on daily during\n\nthat period.17. In October 1998, after negotiations between the parties (in which\n\nLewerissa participated), UT agreed to pay the plaintiffs US$2,142,510 for the equipment,\n\nclaiming that US$832,129.84 was needed to recondition/repair the equipment and that the\n\nmarket price then was only about US$1.8m. The parties finally agreed on US$3.3m as the\n\napproximate repurchase price less the agreed repair cost of US$832,129.84. After further\n\nnegotiations, the repurchase price was fixed at US$2.9m on the following terms:(a) after receipt of the equipment in their yard in Singapore, UT would\n\n  pay the plaintiffs a first instalment of US$1m;(b) the balance of US$1.9m would be paid by 19 monthly instalments of\n\n  US$100,000 each;(c) ownership would be transferred to UT in stages in accordance with\n\n  the sums paid by the company.Lewerissa said the plaintiffs decided to accept UT’s reduced offer\n\nbecause they had not received any better offers from interested buyers, given the\n\nequipment’s deteriorated condition and the regional economic crisis.18. UT paid the first instalment of US$1m around 30 November 1998\n\nfollowed by the second and third instalments of US$100,000 each at end December 1998 and\n\nJanuary 1999. In February 1999 however, UT informed the plaintiffs that the company was\n\nunder debt-restructuring and proposed that the equipment be sold immediately. In that\n\nregard, UT had reached agreement with an Australian buyer to sell the equipment at US$1.5m\n\nand proposed that the plaintiffs accept the US$1.5m in full and final settlement of what\n\nUT owed. The plaintiffs decided to accept UT’s proposal (which meant a reduction of\n\nUS$200,000 from US$2.9m to US$2.7m); it was Hobson’s choice. Otherwise more time and\n\nexpense would be wasted in negotiating with UT or having to find new buyers which would\n\nresult in further deterioration to the equipment. Lewerissa pointed out that US$2.7m was\n\nin any case close to Rounce’s valuation of US$2,698,750 as at April 1998. UT\n\nbackdated their purchase order for US$2.7m to 8 July 1998 and paid the balance US$1.5m to\n\nthe plaintiffs by telegraphic transfer around 19 February 1999.19. In his arguments, counsel defended the plaintiffs’ decision to\n\naccept UT’s initial offer of US$2.9m in November 1999 – they had to make a\n\njudgment call whether to accept the offer or to negotiate further with UT or look for\n\nother viable options. The plaintiffs decided they had no other options as, they could not\n\nsell in the market nor could they sue UT. The plaintiffs had little expertise, hence it\n\nwas not practical for them to conduct an inspection of the equipment to verify the\n\naccuracy of UT’s complaint on the condition of the machines involved. Even so, they\n\nwere not so nave as to believe and accept UT’s figure of US$800,000 for repair\n\ncost; they used that figure as a starting point for negotiations with UT. In this regard,\n\ncounsel disagreed with the survey findings made by the defendants’ two surveyors. Tay\n\nhad stated (at p 4 of his report) thatall units (of the equipment) were noted to be in\n\nused condition…However, all units were noted to be intact with no damage apparentwhileChan had said throughout his report that all items werenoted to be stained with\n\n‘old’ marks or appeared to be in original undisturbed condition and considered\n\nto be pre-shipment damage/defectand no further damage was sustained in transit from\n\nthe barge to the open (storage) yard. Counsel argued that the surveyors could only confirm\n\nthere was no apparent visual damage.20. Counsel submitted that as it turned out, the plaintiffs’\n\njudgment call was correct, because of UT’s debt-restructuring in February 1999. For\n\nthe same reason, the plaintiffs had little choice but to accept UT’s further reduced\n\noffer of US$2.7m; otherwise they may not be able to recover anything from the company. He\n\nsaid the defendant’s detention played a big part in the fall in value of the\n\nequipment which UT used to its advantage. He urged the court to recognise the\n\ncircumstances existing at the time.",
        "(ii) the defendants’ submissions": "21. Counsel disputed firstly, the commencement period of the\n\ndefendants’ wrongful detention. He said it should start on 24 and not 9 December 1997\n\nas the plaintiffs had admitted that they formally informed the defendants of DML’s\n\ninstructions for discharge of the equipment on 24 December whilst the plaintiffs’\n\nshipping agents had obtained approval for discharge from the port authorities on 26\n\nDecember 1997. Hence, the relevant date for purposes of valuation of the equipment should\n\nbe 27 December and not, 9 December 1997. Further, discharge could have taken place well\n\nbefore 9 April 1998 had it not been for the plaintiffs’ unreasonable insistence on\n\nusing the defendants’ barge as a floating workshop to carry out repairs to the\n\nequipment. Consequently, the period of detention for depreciation purposes should only be\n\nfrom 27 December 1997 to 9 March 1998.22. Counsel also criticised Rounce’s valuation as being highly\n\nspeculative and without adequate substantiation to a standard required of an expert.\n\nRounce did not compare like with like. I should point out Rounce’s methodology was to\n\nuse trade figures to depreciate the equipment over the period of detention. He had used\n\nguide prices from the European Trade Guide publication (the guide) a reputable publication\n\nfrequently relied on by trade buyers and by valuation experts. Using the prices in the\n\nguide, Rounce had calculated the average depreciation rates on a reducing balance basis,\n\nfor the different types of Komatsu machinery in question, over a five (5) year period,\n\nfrom either 1992 to 1996 or from 1993 to 1997 as, these were the years closer to the\n\ndetention period. Although the guide provided trade and market prices. Rounce used the\n\n(lower) trade prices for his valuation because the equipment was not in showroom\n\ncondition. As the guide did not have figures for the exact models in question, Rounce\n\nadopted the figures in respect of models which were most similar to the equipment (nearest\n\nin technical specifications). He had opined that the equipment would have fallen in value\n\nby 6% between December 1997 and April 1998 purely due to age. However, the actual fall in\n\nvalue was between 10% and 25% because there was a general oversupply in the world market\n\nfor such equipment during the period in question, due to the economic downturn in Asia. He\n\nhad consulted his colleagues (who are specialists in the field) in America and England\n\nbefore arriving at a figure of 15% depreciation.23. Counsel criticised Rounce’s valuation as unreliable, he said\n\nit was an exercise in calculating a theoretical not actual, depreciation consequent upon\n\ndetention; it did not discharge the plaintiffs’ burden of having to prove actual\n\nloss. Based on Rounce’s methodology, counsel submitted that the plaintiffs had\n\nsuffered no loss. In the alternative, he submitted that the plaintiffs failed to mitigate\n\ntheir loss by not selling to UT at higher prices in a falling market. He contended it was\n\nunreasonable of the plaintiffs to increase their loss by accepting a higher proportion of\n\nliability for the condition of the equipment when, UT’s claim of the cost of\n\nrepair/reconditioning was not borne out by the defendants’ surveyors’ reports\n\nand was due to pre-shipment damage. As the damage if any, was due to prior use of the\n\nequipment by DML, the defendants should not be held liable. He added that the defendants\n\nmade good all tyre deflation and battery draining problems of the machines, at their own\n\nexpense.24. The defendants’ criticisms of the valuation of Rounce must\n\nhave been accepted to some extent by the Assistant Registrar as she reduced his figure of\n\n15% depreciation by 10%. In allowing the appeal, I increased her figure by 7% to 12% based\n\non a market value of $3,175,000 to give US$381,000 as depreciation in place of her award\n\nof US$158,750.",
        "The decision": "(i) the defendants’ cross-appeal25. I shall first set out my reasons for dismissing the\n\ndefendants’ cross-appeal before giving my reasons for allowing the plaintiffs’\n\nappeal. The general object of an award of damages is to compensate the claimant for the\n\nlosses, pecuniary and non pecuniary, sustained as a result of the defendant’s tort\n\n(seeClerk & Lindsellon Torts 18 ed pg 1559 para 29-06). More specifically,\n\nthe assessment process is said to aim at restitutio in integrum. The general principle is,\n\nin the oft-quoted words of Lord Blackburn [inLivingstone v Rawyards Coal Co(1880)\n\n5 AC 25 at p 39], that the court should award \"that sum of money which will put the\n\nparty who has been injured, or has suffered, in the same position as he would have been in\n\nif he had not sustained the wrong for which he is now getting his compensation or\n\nreparation\". Attendant to that principle of law is the principle that the damages\n\nclaimed must not be too remote or, put another way, they must be reasonably foreseeable.26. I was also conscious of the fact that an appellate court should\n\nnot, save in very exceptional circumstances disturb the findings on facts made by a court\n\nbelow. In this regard, I note that the Assistant Registrar had commented (para 9 of her\n\ngrounds of decision) that the defendants’ managing-director misrepresented facts in\n\nhis testimony. She further found that the defendants’ case was lacking in their\n\nsubmissions on the law. I have no reason not to respect such findings.27. In dismissing the defendants’ cross-appeal, I had affirmed the\n\ndecision of the court below in awarding the plaintiffs interest of US$187,360.38 for the\n\nadditional interest incurred on their extended loan from GE Capital. This expense was a\n\ndirect consequence of the delay in repaying the loan arising from the defendants’\n\ndetention of the equipment. I agreed with the plaintiffs’ submission that it was\n\nentirely foreseeable that the plaintiffs purchased the equipment either with their own\n\nmonies or, with a loan. The defendants knew as a fact that the plaintiffs shipped the\n\nequipment to Singapore for the purpose of sale; this was admitted in the affidavits of\n\nJohn Koh (paras 27 to 32) and Alvin Lim (paras 8, 11 to 17). If the equipment was\n\npurchased by means of a loan, then it was equally foreseeable to the defendants that the\n\nsale proceeds would be applied towards repayment of the loan. The fact that John Koh and\n\nAlvin Lim claimed they were not told about any lease agreement on the equipment makes no\n\ndifference on the issue of foreseeability.",
        "The plaintiffs’ appeal": "28. In England, the action in detinue has been abolished by the Torts\n\n(Interference with Goods) Act 1977, the reason being that the tort of conversion had\n\nexpanded in scope to cover almost every case of detinue resulting in the latter action\n\nbecoming largely redundant. In Singapore, the common law position is retained. According\n\ntoClerk & Lindsell(at pp 773-4 para 14-103) at common law, the claimant is\n\nlimited to claiming the value of the goods upon their return [which was the\n\ndefendants’ contention] and could only claim further damages if he could show actual\n\nloss (for example that he lost the opportunity, which he would have exercised, to sell the\n\ngoods at an advantageous price). The plaintiffs in this case are claiming such further\n\ndamages. In Lewerissa’s affidavit, they had exhibited (at p 236 of FL-17)\n\ncorrespondence with a company which had offered US$3.8m some time in April 1998 and at\n\npage 241 of the same exhibit, they produced an offer they had received from MAC Equipment\n\nInc of only US$1.4m on 6 September 1998, barely five (5) months later, showing the impact\n\nof the economic and political crisis in the interval. I accept that such evidence\n\nsubstantiates the plaintiffs’ position that it was not unreasonable of them to\n\ncontinue negotiations with UT as the company represented the only realistic prospect of\n\nachieving the best recovery for the equipment. I note that the defendants do not dispute\n\nthat the plaintiffs are entitled to claim depreciation of the equipment; what they dispute\n\nis the quantum of depreciation – they say it was minimal for the period of detention\n\ninvolved whereas the plaintiffs contend it was much more than the 5% allowed by the court\n\nbelow.29. Before I go into the reasons why I increased the percentage of\n\ndepreciation to 12%, I need to revert to an argument put forward by counsel for the\n\nplaintiffs as to why the court below erred in not accepting Rounce’s valuation.\n\nCounsel pointed out that Rounce had testified that the value of the equipment fell by\n\napproximately $476,250.00 over the period of detention, based on time factor alone (see\n\npara 8 of his affidavit). The Assistant Registrar however, did not accept that portion of\n\nRounce’s testimony, for the reasons set out in paras 14 and 15 above.30. I increased her percentage of depreciation by 7% from 5% as I was\n\nof the view that the latter figure was too conservative and insufficient weight had been\n\ngiven to the evidence of Rounce. Cross-examined, Rounce had said that rusting was not a\n\nsignificant factor and the condition of the equipment upon his visual inspection was\n\nconsistent with actual/normal usage and age; hetook into account the age and the hours\n\nof usage. As such, it was incorrect for the court below to conclude that rusting of\n\nthe equipment before it was detained played a significant role and to take into account\n\nthe (open) storage condition of the equipment after it was released. Rounce had pointed\n\nout that his brief from the plaintiffs was to provide the market value of the equipment\n\nunder standard terms,notunder forced sale terms. His valuation was on the\n\nassumption that the equipment would have been marketed properly although perhaps not at\n\nits full market value. It was also premised on sale of such equipment being conducted by\n\npublic auctions worldwide on a quarterly basis and if not, then by negotiated sale. In\n\nthis connection, Singapore is a trading centre albeit it does not attract the whole\n\nmarket. Rounce had also searched for records of sales on the internet to check the last\n\ntransacted prices. He had also explained that he was unable to produce a single sale for\n\nthe exact models of the equipment in question because, firstly, the excavator model PC1000\n\nwas very limited and secondly (as regards to the dump trucks), the machines were not made\n\nto order. Even if all other factors remained the same, Rounce had deposed that all\n\nequipment of this nature depreciated with time,whether or not they are used.\n\nHence, it did not matter that the plaintiffs encountered difficulties in their\n\nrelationship with UT during the period of detention; that factor played no part in the\n\nmarket valuation of the equipment, particularly as the Assistant Registrar had disallowed\n\nthe plaintiffs’ alternative claim (with which decision I agreed) based on the\n\nrepurchase price of the equipment from UT.31. What should have been borne in mind is, that the detention took\n\nplace during the Asian economic crisis which resulted (according to Rounce) in no\n\ncontracts (requiring such equipment) being awarded while several large contracts were\n\ncancelled. Consequently, a significant quantity of equipment came onto the market; prices\n\nwould accordingly have been depressed; this was a possibility which should or ought to\n\nhave been, foreseen by the defendants, in a downturn in any economy. The situation in this\n\ncase was exacerbated by the political crisis in Indonesia in May 1998. Yet another factor\n\nI took into consideration was, that the defendants did not call any witness to rebut what\n\nRounce said; therefore his testimony stood largely unchallenged. As a parallel, it is a\n\nknown fact that new vehicles depreciate greatly, even just one (1) day after registration.\n\nConsequently, the Assistant Registrar should not have emphasised the fact that Rounce did\n\nnot provide evidence ofactualdepreciation; it was not for want of trying on his\n\npart. Rounce was unable to find such evidence due to the very specialised nature of the\n\nequipment itself. He had deposed (para 13 of his affidavit) that equipment of the quality\n\nand quantity in question would normally be sold either to an end-user who has an existing\n\ncontract or future contract for its use or, to a trade dealer who buys it for stock. Both\n\ncategories of buyers would have been adversely affected by the economic crisis of 1997-98.\n\nAlthough I accepted his valuation and the basis thereof, I still did not apply the 15%\n\ndepreciation figure used by Rounce. I decided to be conservative and reduce his percentage\n\nby 3%, as a precaution in case he had erred on the generous side in the plaintiffs’\n\nfavour.32. Apart from increasing the depreciation percentage to 12%, I had\n\nalso made the following orders in allowing the plaintiffs’ appeal:-a. Interest of 6% per annum on the increased judgment sum of $381,000\n\n  (instead of $158,750) for 32 and not 36 months;b. other orders made below to stand:c. costs of appeal to the plaintiffs to include the dismissal of the\n\n  defendants’ cross-appeal.I had reduced the period of interest by four (4) months as I found that\n\nit was unreasonable of the plaintiffs to have waited until 26 March 1999 before applying\n\nfor directions for assessment of their claim for damages, followed by their notice of\n\nappointment for assessment of damages (filed on 23 November 2000). The Rules of Court [O\n\n37 r 1(1)] require the plaintiffs to apply to the Registrar for directions within one\n\nmonth from the date of the judgment ordering damages to be assessed. Granted that the\n\nplaintiffs cannot be faulted for reaching agreement with UT on the repurchase price only\n\non 6 November 1998 (by their letter of that date to UT) which was some seven (7) months\n\nafter the order of court dated 9 April 1998. Thereafter however, there was no reason for\n\nthe plaintiff to have delayed applying for directions and assessment; their failure to\n\nexpedite the assessment of their claim after November 1998 was inexcusable. Their counsel\n\nsought to explain the delay by referring to the instalment plan the plaintiffs had agreed\n\nwith UT; he said they had to wait until February 1999 (when they received full payment\n\nfrom UT) before they could proceed with assessment. I rejected that argument – once\n\nagreement had been reached with UT, the question of deferred payment should not be a\n\nfactor in the assessment process. Accordingly, interest was only awarded for 32 instead of\n\n36 months (from 31 January 1998 to 31 January 2001) allowed by the court below as, I was\n\nof the view that the four (4) months’ delay in applying to court (on 26 March 1999)\n\nafter November 1998 was not justified. However, I increased the interest rate to 6% from\n\n3% for the pre-judgment period as I saw no reason to make a distinction between\n\npre-judgment and post-judgment interest in this case; the plaintiffs had already suffered\n\nthe loss in depreciation before the damages were awarded, after the proceedings were\n\ncommenced.Sgd:LAI SIU CHIUJUDGECopyright © Government of Singapore."
    }
}