{
    "case_title": "Teo Keng Chuan v Public Prosecutor",
    "ncitation": "[2001] SGHC 49",
    "coram": "Yong Pung How CJ",
    "sections": {
        "he shall be guilty of an offence and shall be liable on conviction to a fine\n\n  not exceeding $100,000 or to imprisonment for a term not exceeding 5 years or to both.": "10 In this case, the presumption in s 8 of the PCA applied. Section 8 provides:8. Where in any proceedings against a person for an offence under section 5 or\n\n  6, it is proved that any gratification has been paid or given to or received by a person in the\n\n  employment of the Government or any department thereof or of a public body by or from a person or\n\n  agent of a person who has or seeks to have any dealing with the Government or any department\n\n  thereof or any public body, that gratification shall be deemed to have been paid or given and\n\n  received corruptly as an inducement or reward as hereinbefore mentioned unless the contrary is\n\n  proved.11 Therefore, under ss 6(a) and 8 of the PCA, what the prosecution had to prove\n\nwere the following elements (Yuen Chun Yii v PP[1997] 3 SLR 57at 68 andChew Chew Sun v\n\nPP[1975] 2 MLJ 58at 59):(i) a gratification was paid or given to or received by Teo;(ii) at the material time, Teo was in the employment of the Government or any\n\n  department thereof or of a public body; and(iii) the gratification was from a person who had or sought to have dealings\n\n  with the Government or any department thereof or any public body.12 Once the three elements under s 8 of the PCA were proven, the presumption\n\nbecame operative. Teo would be presumed to have received the money or gratification corruptly as an\n\ninducement or reward for doing the act in relation to his principal's affairs, i.e. directing the\n\ncrew to move the piece on the site. The burden would then be on Teo to rebut the presumption on a\n\nbalance of probabilities:Yuen Chun Yii v PP (supra);Chew Chew Sun v PP(supra);WeeToon Boon v PP[1976] 2 MLJ 191;PP v Yuvaraj[1969] 2 MLJ 89; andGeorge\n\ns/o Joseph v PP(MA 571/87) (unreported). In such a case, whether the presumption is rebutted is\n\na question of fact to be determined on a case-by-case basis:Yuen Chun Yii v PP(supra at\n\n76).13 In this case, there was no dispute that Teo was in the employment of PUB, a\n\n\"public body\" within the meaning of the Act (the second element) and that Tan had dealings\n\nwith this \"public body\" (the third element). On the facts, this appeal turned on two main\n\nissues: first, whether the judge was correct in finding that Teo had in fact received the $50 from\n\nTan (the first element); and second, whether the judge was correct in finding that Teo had not\n\nrebutted the presumption under s 8 of the PCA on a balance of probabilities.(i) Whether Teo had accepted money from Tan14 The only direct evidence on this question of fact came from Tan himself, who\n\nsaid that he had handed over $50 to Teo at the site on the day in question. Teo, on the other hand,\n\ndenied receiving any money from Tan. No other person saw Tan handing the money over to Teo.15 According to Tan, at the material time when Teo and the service crew\n\ncomprising Isa, Tay, Rahman and Ronald arrived at the site in a van, the service crew alighted from\n\nthe van and Tan walked up to them. Isa told Tan that there were four of them. Tan had the impression\n\nthat Isa wanted money and he handed $30 to Isa. After accepting the money, Isa told him that there\n\nwas another officer in the van (Teo). Tan then walked to the van which was about 20 feet away. Teo\n\nalighted from the van and stood by the side of the van. Thinking that Teo might also want money, Tan\n\ngave $50 to Teo and Teo took the money. Nothing was said between the two men.16 Tan claimed that he gave the money to the PUB officers as it was the market\n\npractice to do so and he was afraid that if he did not give the money to them, they might find fault\n\nand not install the meter for him. Installing the meter was very important to Tan as he might be\n\nliable for damages for late completion if it was not installed. According to Tan, this was the first\n\nand only time he had attended such an installation. Yet, at one point in his evidence regarding what\n\nprompted him to think that the PUB officers would refuse to install the meter unless they were give\n\n'coffee money', he said that 'normally, (he) decided based on their reaction'. He was unable to give\n\na satisfactory explanation as to why he said 'normally' when he claimed that this was the first time\n\nhe had encountered such an incident. Tan claimed that his licensed plumber, Wee Sian Guan\n\n(\"Wee\"), had told him that some PUB officers asked for money. Wee had been Tan's licensed\n\nplumber for the last ten years.17 Teo, however, denied receiving any money from Tan. Teo's evidence was that on\n\nthat day at the site, when he opened the door of the van, he saw Tan standing just next to the van.\n\nTan and he did not speak to each other but merely looked at each other. Teo then walked away from\n\nthe van because Isa called out to him, telling him that there was a shortage of a pipe.18 Isa, one of the crew members, gave evidence for the prosecution. Isa had\n\npleaded guilty to a charge of corruptly accepting a gratification of $10 from Tan that day at the\n\nsite. His evidence was that, after he had received $30 from Tan, Tan asked if he was the supervisor\n\nthere. Isa said \"No, the supervisor is inside,\" and pointed to the van. Isa then saw Tan\n\nwalk towards the van but did not know what transpired after that. The $30 Isa received from Tan was\n\nshared among the crew members. Isa kept $10 for himself and gave $10 to Tay and $5 each to Rahman\n\nand Ronald.19 Between the evidence of Tan and of Teo, the judge chose to believe Tan rather\n\nthan Teo. It was not disputed that Tan, after handing the $30 to Isa, walked towards the van where\n\nTeo was. It was unbelievable that Tan could have walked over to the van just to look at Teo. In the\n\ncircumstances, it was more likely than not that Tan had walked over to the van for the purpose of\n\ngiving money to the supervisor, Teo. In my opinion, this was a reasonable inference to draw in the\n\nlight of the evidence adduced at the trial below.20 Teo's defence at the trial and on appeal was one of denial. He alleged that\n\nTan and Wee (Tan's licensed plumber) had set him up because they were angry with him over a project\n\nat Bukit Batok. What happened at Bukit Batok was that on two occasions, when Teo's crew went down to\n\nthe site, Wee's men were not around and as a result, the meter could not be fixed.21 The judge rejected Teo's defence and rightfully so. Teo's allegation, that he\n\nhad been framed by Tan and Wee as a result of their unhappiness over the Bukit Batok project, was a\n\nmere allegation not supported by any evidence.22 There was no evidence of a boiling feud between the parties which could have\n\nmotivated Tan and Wee to set Teo up. After the Bukit Batok incident, both Teo and Wee had supposedly\n\nreported the matter to Teo's supervisor, Nair. However, Nair was not called upon by the defence to\n\ntestify whether Wee had complained about Teo and was angry over the Bukit Batok incident. Further,\n\nthe engineer in charge of the Big Metering Unit and Teo's supervisor, Michael Toh, testified that no\n\ncomplaint in respect of the Bukit Batok incident was brought to him although in terms of hierarchy,\n\nhe would have been made aware of any such complaint brought to the department.23 Teo testified that Wee was angry with him over the Bukit Batok project and had\n\ninsinuated that Teo's crew had tried to get money from Wee in return for their services. Fearing\n\nthat Tan and Wee would set him up, Teo claimed that in the van on their way to the site at Lim Chu\n\nKang, he had warned his crew against taking money. However, the fact that the crew did take money\n\nfrom Tan that day certainly undermined Teo's evidence in this regard.24 Teo also said that, at the CPIB, he was shown two photographs taken at the\n\nsite that day, one showing him about to alight from the van and the other showing Tan standing near\n\nthe door of the van, indicating that there had been a set-up. The prosecution, however, denied the\n\nexistence of any such photographs. None of the alleged photographs were tendered as evidence in\n\ncourt and I therefore disregarded Teo's evidence in this respect.25 Most importantly, and this was crucial, Teo's defence that he was framed by\n\nTan and Wee did not appear anywhere in his s 122(6) Criminal Procedure Code (Cap 68) ('CPC')\n\nstatement or in his statements to the CPIB. Teo's explanation for the omission was that he had told\n\nthis to the officer but it was not recorded for some reason, or that he had not thought of telling\n\nthe recorder so. In such circumstances, I had no hesitation in drawing an adverse inference against\n\nTeo.26 The evidence in this case was complicated by the fact that there were various\n\ninconsistencies in the testimonies of the witnesses on both sides. At the trial below and on appeal,\n\ndefence counsel pointed out several inconsistencies between the evidence of Tan and that of Wee, who\n\nwas also a prosecution witness. Counsel submitted that the judge had erred in convicting Teo on\n\nTan's evidence in the light of those inconsistencies. I noted, however, that although there were\n\ninconsistencies in the prosecution's evidence, they were not material and did not affect the central\n\nissues in this case.27 The judge, in evaluating the evidence, acknowledged that Tan was not an honest\n\nand forthright witness and thus treated his evidence with caution. In particular, she treated his\n\nevidence with caution also, because she found that Tan himself was instrumental in initiating the\n\ncorrupt transaction and played an active part by asking Isa for the supervisor and then approaching\n\nTeo, who was in the van.28 As for Teo, it was evident that he was not an honest witness either and\n\ninconsistencies emerged at different points in his evidence. As a matter of fact, he was impeached\n\nas a witness during the course of the trial below. Three of the crew members, namely Isa, Rahman and\n\nTay, were also impeached as witnesses.29 Although the credit of the various witnesses had been impeached, this did not\n\nmean that all their evidence should be disregarded. The judge recognised the principle that the\n\ncourt must carefully scrutinise the whole of the evidence to determine which aspect might be true\n\nand which should be disregarded:Chng Gim Huat v PP[2000] 3 SLR 262;Kwang Boon Keong\n\nPeter v PP[1998] 2 SLR 592;PP vMohammed Faizal Shah[1998] 1 SLR 333; andPP\n\nv Somwang Phatthanasaeng[1992] 1 SLR 138.30 I found that the judge had evaluated carefully the evidence put forward by\n\nboth the prosecution and the defence and had correctly treated the evidence of the witnesses with\n\nutmost caution in arriving at the finding that Teo had indeed accepted the money from Tan. It was\n\nwithin the discretion of the judge to prefer the evidence of certain witnesses over others based on\n\nher evaluation of the evidence in totality and on her observation of the demeanour of the witnesses.\n\nIn my mind, defence counsel had not shown on appeal how the judge had erred in arriving at this\n\nfinding of fact.31 Once it was accepted that Teo had received the money from Tan, the next\n\nquestion was whether Teo had corruptly received the money or gratification as an inducement to do\n\nthe act in relation to his principal's affairs, i.e. directing the crew to move the lengthening\n\npiece. The presumption under s 8 of the PCA applied and the burden was on Teo to rebut the\n\npresumption on a balance of probabilities.(ii) Whether presumption under s 8 PCA was rebutted32 In order to rebut the presumption, the burden was on Teo to show on a balance\n\nof probabilities that he had not corruptly accepted the money from Tan as an inducement to show\n\nfavour to Tan. The question of whether Teo had corruptly received the gratification as an inducement\n\nto direct the crew to move the lengthening piece on the site revolved around two main questions of\n\nfact. The first was whether Teo had in fact directed the crew to move the lengthening piece on the\n\nsite and the second was whether Teo had the knowledge at the material time that he should have\n\nreferred the matter to the PUB Installation Unit.33 With regard to the first question of whether Teo had directed the crew to move\n\nthe lengthening piece, there were inconsistencies in the evidence of the witnesses.34 Teo's evidence in this regard was inconsistent at various points. His CPIB\n\nstatement of 24 May 1999 stated as follows:I recall that some of the piping was in the wrong position. As such, I asked\n\n  the crew to make the necessary alterations, fit the water and turn on the water supply.35 His subsequent evidence in court was that when he went to the meter position,\n\nhe saw the lengthening piece attached to the customer side and not the PUB side where it ought to\n\nbe. He then told Isa that since the lengthening piece was present, he could fix the meter and\n\nreturned to the van without giving instructions as to how the meter was to be fixed. Later, however,\n\nhe said that by the time he went to the meter position, the lengthening piece had already been\n\ndismantled and he did not ask the crew to make alterations.36 Isa's evidence on this point in his CPIB statement of 24 May 1999 was as\n\nfollows:I saw that the length of the pipe was too short Therefore, we could not\n\n  fix the meter. Teo then asked me and Tay to alter the pipe. This was extra work to us as the\n\n  installation of the pipes was done by the Installation Department from PUB, they did not do a good\n\n  job... We could actually not alter the pipes, as it was not our job but the job of the\n\n  Installation Department37 In court, however, Isa too changed his evidence. He said that that was no\n\nproblem with the pipe and that it was not too short but that the crew, including him, moved the\n\nlengthening piece anyway. However, he did not know who had instructed the crew to move the piece. He\n\naccepted that he was in charge of the crew and that Teo was the most senior person present but\n\nmaintained that he did not know who had issued the instruction to move the piece.38 As for Tay, the evidence in his CPIB statement of 24 May 1999 was as follows:The contractor for the pipe has installed the pipe position wrongly and Teo\n\n  Keng Chuan had asked us to help him do some changing of the position of the pipe. This is not one\n\n  of our duties but as it was a small problem and something that we could do, we helped him to\n\n  change the position of the pipe before fitting the meterIn court, however, Tay's evidence was that the pipes were not in the wrong\n\nposition but were just not fastened properly.39 On the issue of whether Teo had directed the crew to move the lengthening\n\npiece, it was clear that what Teo, Isa and Tay had said in their CPIB statements were materially\n\ninconsistent with their testimonies in court. The credit of all three of them was impeached on this\n\nbasis and the relevant parts of their CPIB statements were admitted as evidence under s 147(3) of\n\nthe Evidence Act (Cap 97).40 The final position of the defence in the trial below was that it was Teo who\n\nhad directed the crew to move the lengthening piece. Coupled with the relevant parts of the CPIB\n\nstatements admitted in evidence under s 147(3) of the Evidence Act, the judge found as a fact that\n\nTeo had directed the crew to move the piece. I saw no reason to disturb the finding of the judge on\n\nthis point.41 The next question to be considered was whether Teo knew at the material time\n\nthat instead of moving the lengthening piece to its correct position at his own initiative, he\n\nshould have referred the matter to the Installation Department of PUB. In this regard, Teo claimed\n\nthat, at the material time, although he had directed the crew to move the lengthening piece, he did\n\nnot know that the move should have been done by the Installation Unit as there was nothing in the\n\ninstruction manual prohibiting this. Moreover, he had never encountered a similar situation before.\n\nThe move was thus not evidence of any favour shown to the contractor, Tan.42 Clear evidence was led to the effect that, if the lengthening piece was\n\nrequired to be moved for purposes of fixing the meter, such a move was not within the job scope of\n\nTeo's unit, the Big Metering Unit. Should such a scenario arise, the service van crew was to report\n\nthe matter to the Senior Technician who would in turn report it to the Installation Unit. The\n\nInstallation Unit would then get the licensed plumber to remove the piece. As a matter of checks and\n\nbalance, it was PUB's practice that the person who laid and approved the pipes ready for fitting\n\nwith the meter was different from the person who fitted the meter. The officers from the Big\n\nMetering Unit and the service crew were not allowed to move the piece and alter the position of the\n\npipes. This rule was not documented but was disseminated through briefings.43 The judge rejected Teo's evidence that he had no knowledge that he should have\n\nreferred the matter to the Installation Unit and I agreed entirely with her finding. The technicians\n\nIsa and Tay were aware that moving the piece was outside the scope of their duties. It would be\n\nincredible if, as a Senior Technician who supervised the crew, Teo did not know what was known to\n\nhis crew members. I found it hard to believe that having been with PUB for 23 years and having\n\njoined the Big Metering Unit since 1990, Teo did not know of the proper scope of the duties of the\n\nBig Metering Unit.44 Having found that Teo did in fact direct the crew to move the lengthening\n\npiece, knowing that the proper procedure was to refer the matter to the Installation Unit of PUB, it\n\nwas clear to me that he had failed to rebut the presumption in s 8 of the PCA on the required\n\nstandard of proof, i.e. balance of probabilities.Conclusion45 On the facts of the case and in the light of the evidence, I was of the view\n\nthat a connection had been established between the money received from Tan and Teo's act of\n\ndirecting the crew to move the lengthening piece, i.e. Teo's act was a favour to Tan stemming from\n\nthe gratification received. The elements in s 8 of the PCA had been proven beyond a reasonable doubt\n\nand the failure of Teo to rebut the presumption in s 8 meant that his conviction must stand.46 This case revolved largely around an evidential exercise. The witnesses in\n\nthis case were not honest as was evident from the numerous inconsistencies in the evidence as well\n\nas the impeachment of the various witnesses, including the appellant, Teo, himself. Even the\n\nevidence of the main prosecution witness, Tan, had to be treated with caution. The judge had applied\n\nher mind to these evidential matters and had come to findings based on her assessment of which parts\n\nof the evidence were true and which were not. In my view, objectively, it could not be said that the\n\nfindings of fact below were clearly against the weight of the evidence and I would not disturb the\n\nfindings.47 As for Teo's sentence, three months' imprisonment and a penalty of $50 with\n\none day's imprisonment in default was not manifestly excessive. A custodial sentence was justified\n\nin this case as the corrupt transaction involved a public servant, of whom the highest standards of\n\nintegrity was expected.48 In the premises, the appeal was dismissed and the conviction and sentence\n\naffirmed.Appeal dismissed.",
        "Yong Pung How": "Chief JusticeCopyright © Government of Singapore."
    }
}