{
    "case_title": "Stratech Systems Limited v Guthrie Properties (S) Pte Ltd and Another",
    "ncitation": "[2001] SGHC 77",
    "coram": "Lai Kew Chai J",
    "sections": {
        "Background facts": "2.    The plaintiffs, Stratech System Limited (Stratech),\n\nare a public-listed company incorporated in Singapore, whose principal activities are the design,\n\ndevelopment, supply, installation, commissioning and maintenance of advanced technology systems. In\n\n1998, in anticipation of a public tender by the Urban Redevelopment Authority to design a car park\n\nsystem that would replace car park coupons, Stratech created and developed the ICPS. The tender was\n\neventually not proceeded with. Briefly, the ICPS is a computer-based system which automatically\n\nmonitors, records and controls the entry and exit of vehicles from a car park. The essence of the\n\nICPS lies in it being a cashless and ticketless car park system. It uses Optical Character\n\nRecognition (OCR) technology to recognise the licence plate numbers of vehicles and NETS\n\n(Network for Electronic Transfers) cash cards for making payment. OCR technology involves using an\n\nimage capturing system to record an image and translating the captured image or characters into data\n\nfor application. Typically, this would entail the use of cameras and computer hardware and software\n\nto translate the captured image into computer data which can then be applied in various ways, e.g.\n\nfor identification purposes. Such technology has been applied commercially in a number of ways, such\n\nas for recognising container markings or, as in the present case, licence plate numbers.3.    Stratechs ICPS works sequentially as follows. The\n\npresence of a vehicle is detected at the entry/exit of a car park and the image of the licence plate\n\nnumber will be captured, via cameras, and processed for identification. At the same time, the system\n\nrecords the times of entry into and exit from the car park for each vehicle, as identified by its\n\nlicence plate number, and calculates the respective parking charges for the period spent in the car\n\npark. Payment of the charges are made using NETS cash cards, hence dispensing with the need for\n\ncash. The system does not require any tickets or tokens to be used and there is no need for any\n\ndevice to be installed into the vehicles.4.    The first defendants, Guthrie Properties (S) Pte Ltd (GPS),\n\nand the second defendants, Mall Management Pte Ltd (MM), are both companies within the Guthrie\n\ngroup of companies (the Guthrie group). GPS are a 100% owned subsidiary of Guthrie GTS\n\nLimited, while MM are a 100% subsidiary of GPS. GPS are a property development and management\n\ncompany and in particular, they manage properties which are owned by the Guthrie group. Part of GPSs\n\nactivities include the management of car parks. MM are in the business of marketing car park\n\nsystems. Jurong Point Realty Pte Ltd (JPR) is a joint venture company between Guthrie GTS and\n\nLee Kim Tah Holdings Limited, with each holding equal shares. GPS, MM and JPR are all managed by the\n\nsame person, Michael Leong Choon Fai (Leong), who is the general manager of the three\n\ncompanies.5.    Also belonging to the Guthrie group are Ledbury Technologies\n\nPte Ltd (Ledbury) and Guthrie Engineering (S) Pte Ltd (GES). Ledbury are a 100% owned\n\nsubsidiary of GES, while the latter are a 100% owned subsidiary of Guthrie GTS. Both Ledbury and GES\n\nare managed by one Mah Chin Paw (Mah), a senior manager in the two companies. Ledburys\n\nbusinesses include systems integration, home automation, security access and vehicular access, most\n\nof which are for small scale or private sector projects. Systems integration is also an area of GESs\n\ncore businesses but their projects are generally on a larger scale, as compared to Ledbury. More\n\nwill be said later of how they became involved in this dispute.The Jurong Point System6.    Around July 1998, JPR was looking for an innovative and\n\nintelligent car park system to be installed in the Jurong Point building (Jurong Point) which\n\nit was managing. To this end, a competition was organised for the Temasek Polytechnic students,\n\ninviting them to design and submit innovative car park systems for use at Jurong Point. The entries\n\nfor the competition were received in September 1998 and the results were announced in October. There\n\nwere some media coverage of the event and the competition, and the winning entries were featured in\n\na newspaper article in the Straits Times.7.    In or around October 1998, Leong, acting on behalf of JPR,\n\ncontacted one Mickey Teo of GES to ask if GES could build and install a cashless car park system at\n\nJurong Point. Mickey Teo then informed Mah of Leongs inquiry. GES decided not to undertake this\n\nproject as they were already very busy with other work commitments, such as the Vehicle Entry Permit\n\n(VEP) project.8.On 27 November 1998, Stratech\n\nwrote to JPR to introduce their \"Smart Park  Intelligent Car Park System\". Pursuant to\n\nthis letter, discussions ensued between Stratech and JPR. On 9 December 1998, Stratech submitted to\n\nJPR a proposal (the JP proposal) for the implementation of the ICPS at Jurong Point. The JP\n\nproposal outlined the advantages of the ICPS and included,inter alia, the functional\n\ndescription, job scope/construction, item lists, system layout, schematic diagrams and network for\n\nelectronic transfers for the installation of the system. On 25 March 1999, Stratech forwarded to JPR\n\na project plan and a revised proposal. A trial for the system to be installed at Jurong Point (the\n\nJP system) was conducted at Guthrie House sometime in April 1999. On 2 May 1999, JPR issued a\n\npurchase order to Stratech for the JP system and work on the installation of the new car park system\n\ncommenced. The JP system was completed and operational in August 1999. A proposal for improvements\n\nand additional works to the JP system was sent by Stratech to JPR on 24 September 1999.9.    Sometime in the latter half of 1999, two meetings were held\n\nbetween the management of Stratech and the Guthrie group to discuss the possibilities of\n\ncollaboration and of entering into a joint venture. The Guthrie group was keen to assist Stratech\n\nfinancially in exchange for a stake in Stratechs business. However, nothing came out of these\n\ndiscussions.The Guthrie House System10.    In early April 1999, Leong, on behalf of GPS asked Stratech\n\nif they were able to install a similar car park system at Guthrie House. GPS were in charge of the\n\ndevelopment and management of Guthrie House, including managing its car park system. Soon after GPS\n\nrequest, Stratech submitted a proposal on 23 April 1999 for the same ICPS system to be installed in\n\nGuthrie House (the GH proposal). Nothing more was done, however, until about 7 October 1999\n\nwhen GPS issued a purchase order to Stratech for the installation of the ICPS at Guthrie House. In\n\nthe purchase order, the delivery date of the ICPS was to be in 10 weeks time from the date of the\n\nletter, i.e. by 16 December 1999. By a letter dated 4 November 1999, Stratech replied to say that\n\nthey were not able to comply with the time frame given but could only deliver the system by end\n\nFebruary 2000. This was acknowledged by GPS, who wrote to Stratech on 24 November 1999 informing\n\nthem of the decision not to proceed with the installation of the ICPS at Guthrie House.11.    As GPS decided not to install Stratechs ICPS at Guthrie\n\nHouse, other alternatives were sought. Sometime after 4 November 1999, Leong, on behalf of GPS,\n\ncontacted Mah of Ledbury to ask if Ledbury could install a cashless car park system for Guthrie\n\nHouse. Subsequently, in December 1999, Mah and some of his colleagues visited Jurong Point to\n\nobserve the external workings of the JP system that had been installed by Stratech. Mah then\n\ninformed Leong that Ledbury were able to build a system for Guthrie House that would overcome the\n\nproblems of the JP system which Leong had previously complained of. It was alleged that the\n\nperformance of the JP system had not been very satisfactory as there were problems with the cash\n\ncard readers which resulted in traffic jams at the exit points during peak hours. On 2 December\n\n1999, Ledbury gave a quotation to GPS for the installation of a car park system at Guthrie House (the\n\nGH system). Soon after, Ledbury were awarded the job and a purchase order was issued accordingly.12.    The project for the GH system was sub-contracted by Ledbury\n\nto Optasia Systems Pte Ltd (Optasia) and Wei Long Electronics Engineering Pte Ltd (Wei Long).\n\nOptasia were in the business of marketing OCR technology for,inter alia, transportation and\n\nvehicle management systems and this includes supplying licence plate recognition products, while Wei\n\nLong were in the business of supplying cash card reading equipment. The GH system was installed and\n\noperational by end February to early March 2000. At the same time, around February 2000, Ledbury\n\nwere asked to provide a quotation for another car park system to be built at Craig Place, a property\n\ndeveloped and managed by Craig Development Pte Ltd, a company belonging to the Guthrie group. On or\n\nabout 14 March 2000, Craig Development issued a purchase order to Ledbury, engaging the latter to\n\nbuild the same car park system at Craig Place.13.    Similar car park systems using the OCR and NETS concept\n\nwere subsequently installed by Optasia and Wei Long at the Ubi Industrial Estate and the Orchard\n\nCineleisure building. However, none of the companies in the Guthrie group, including GPS and MM,\n\nwere involved in those projects.Passing Off14.    Sometime in early 2000, Stratech found out that GPS had\n\ninstalled a car park system at Guthrie House and Craig Place that was thought to be similar to their\n\nICPS. They also discovered that MM were marketing and promoting the car park system that has been\n\ninstalled at Guthrie House. Suspecting that GPS had copied the ICPS and were then passing off the\n\nICPS as their own, Stratech engaged the services of private investigators to look into the matter.\n\nOn 13 July 2000, Gan Wee Siong (Gan) and Chong Ban Long (Chong) of Commercial\n\nInvestigations visited Guthrie House, posing as potential customers of the car park system. They\n\nwere met by Martin Chew Eng Tong (Martin Chew) who told them that the relevant person to speak\n\nto was Kirk Hock Ser (Kirk), who was not around that day. Nonetheless, Martin Chew agreed to\n\nshow them generally the car park system at Guthrie House. During this occasion, Martin Chew made\n\ncertain remarks which Stratech now claim showed that GPS and MM were passing off the ICPS as their\n\nown system. On 14 July 2000, Gan and Chong visited the Guthrie House again to speak to Kirk. A video\n\nrecording of the conversation they had with Kirk was made and I will deal with the details of the\n\nrelevant parts later. In essence, it is alleged by Stratech that Kirks statements misrepresented\n\nGPS and MM as the owners and developers of the ICPS. Both Martin Chew and Kirk are employees of GPS.Stratechs claim15.    According to Stratech, the ICPS is a unique car park system\n\nwhich they have designed and built and they claim to be the first to have designed such a system. In\n\nfact, a patent application for the system had been filed by Stratech in several jurisdictions,\n\nincluding Singapore, but the registration of the patent remained pending. A temporary patent had\n\nbeen granted in Hong Kong but this is not of relevance to the present case. The action before me is\n\nnot one that is based on patent infringement.16.    Stratechs case is that they gave confidential\n\ninformation relating to the ICPS to JPR and GPS for the limited purpose of enabling the recipients\n\nto decide on the installation of the system at Jurong Point and Guthrie House respectively. The\n\ninformation was given in circumstances which clearly imposed a duty of confidence on the recipients,\n\nthe relevant documents having been marked \"Confidential\" and \"Patent Pending\"\n\nwhen they were forwarded to JPR and GPS. Such confidential information was then misused by GPS and\n\nMM when they installed the ICPS at Guthrie House and Craig Place.17.    Although Stratech do not have actual evidence of misuse of\n\nthe confidential information by GPS and MM, they assert that there are many facts supporting the\n\ninference that the duty of confidence had in fact been breached. One of the factors highlighted by\n\nStratech is the short period within which Ledbury, together with Optasia and Wei Long, managed to\n\nset up the GH system. Stratech submitted that this could not have been possible unless the\n\nconfidential information given by Stratech was made use of. This is so because, prior to Stratechs\n\ninstallation of the ICPS at Jurong Point, they claim that there was no similar existing system in\n\nSingapore or, to their knowledge, anywhere else in the world. Furthermore, GPS, Ledbury, Optasia and\n\nWei Long have not shown themselves as having the necessary expertise to set up such a system within\n\nthe short time period. The striking similarities between the GH system and Stratechs ICPS, as\n\nreflected in the JP system and the GH proposal, also indicated that the GH system must have been\n\ncopied from Stratechs confidential information.18.    On the passing off claim, Stratech relied mainly on Gans\n\nand Chongs evidence based on their encounter with Martin Chew and Kirk on 13 and 14 July 2000.\n\nSeveral other incidents where Stratech were informed of GPSs and MMs supposed attempts to pass\n\noff the ICPS as their own system are also cited in support.The defence19.    GPS and MM in their defence disputed the confidentiality of\n\nthe information Stratech had transmitted. It is submitted that even if the concept of using OCR and\n\nNETS cash cards to build a ticketless and cashless car park system had been confidential when it was\n\ntransmitted to JPR, it lost its quality of confidence once the JP system was installed, since the\n\nconcept had entered the public domain and could be observed by anyone who visited the car park at\n\nJurong Point. The same reasoning applied to the specific information particularised by Stratech to\n\nbuild such as system, such as the system design, software specifications and components list.\n\nFurther, it is claimed that such information is not confidential in any event, as it is already\n\nknown and practised by the public or at least by the persons skilled in this area.20.    Next, GPS and MM deny that any of the information,\n\nconfidential or not, was misused by them. It is asserted that GPS and MM are not in the business of\n\nbuilding car park systems and the car park systems at GH and Craig Place had not been designed or\n\nbuilt by them but by independent contractors. Hence, there was no reason for them to make use of the\n\nalleged confidential information. Neither did they communicate any of the confidential information\n\nto Ledbury, Optasia or Wei Long to assist them in building the GH system and the system at Craig\n\nPlace. The GH system essentially involved an integration of two sub-systems, the licence plate\n\nrecognition system and the NETS cash card payment system. These were independently supplied by\n\nOptasia and Wei Long respectively. Both parties are greatly experienced in their particular areas of\n\npractice and have ample knowledge to supply their respective systems without any reference\n\nwhatsoever to Stratechs information. This also explained why the GH system could be built and\n\ninstalled within the short period of time. In addition, significant differences between the GH\n\nsystem and Stratechs ICPS were highlighted during the trial to show that these two systems are in\n\nfact fundamentally distinguishable.21.    With regard to the claim of passing off, it is contended\n\nthat Martin Chew and Kirk did not say anything which amounted to a misrepresentation by GPS and MM\n\nthat they owned or developed the ICPS and/or the JP system. Moreover, it is argued that the nature\n\nof the business, i.e. the sale of car park systems, is such that it is not susceptible to passing\n\noff by a competitor.Background of main witnesses22.    At this juncture, I will go into greater detail of the\n\nrelevant experience and expertise as well as the role played by the respective individuals in\n\nrelation to the present dispute. This is necessary in order to better understand the positions taken\n\nby the parties in this action, especially with respect to the expertise of the defence witnesses,\n\nwhich was challenged by Stratech. I do not propose to deal with every witness that has been called\n\nby the parties but will focus only on those whose evidence have formed the pith and substance of\n\neach partys case.23.    One of the main witnesses for Stratech was Kennedy Chew\n\nKhien Mien (Kennedy Chew). He holds the position of deputy chief executive (technology and\n\nstrategy) in Stratech. He obtained his basic degree from the University of Toronto and his Ph.D.\n\nfrom the University of Texas, Austin. Both his degrees were in the field of computer sciences.\n\nThroughout his tertiary education, he was a National Computer Board (NCB) scholar and he\n\nworked for the organisation for a number of years, during which he was involved as the chief\n\narchitect in many large-scale projects. This included the Ministry of Educations Student-Teacher\n\nWorkbench, the Digital Library Initiative and the Integrated Criminal Justice System. He\n\nsubsequently left NCB to join Stratech, which was set up by his brother, David Chew Khien Meow (David\n\nChew). I am satisfied that Kennedy Chew played a key role in the designing and building of the\n\nICPS, especially in the technical aspects. Much of his evidence, however, dealt with his views on\n\nthe similarities between the ICPS and the GH system installed by Ledbury, Optasia and Wei Long.24.    David Chew was also called to give evidence on behalf of\n\nStratech. He is the chairman and chief executive officer of Stratech. Unlike his brother, Kennedy\n\nChew, his doctorate degree is in business administration and he is primarily responsible for the\n\nmanagement of the companys business. According to his evidence, Stratechs core businesses are\n\nin developing advanced technologies and systems and providing infrastructure for e-businesses. They\n\nhave been involved in many governmental projects, such as providing multi-media educational systems\n\nand a Weapons Scoring System for the Republic of Singapore Navy. The ICPS, however, appears to be\n\nStratechs first venture into the business of car park systems.25.    Richard Goh Tiong Hwee (Richard Goh) is the general\n\nmanager of Optasia. He was called by GPS and MM to give evidence on the role that Optasia played in\n\nthe installation of the GH system at Guthrie House. Richard Goh has been in the field of OCR\n\ntechnology since 1992. From 1990 to June 1996, he worked at the Institute of System Science (ISS)\n\nwhich develops high-technology products, including OCR technology. OCR technology was developed by\n\nthe ISS for commercial use at the Port of Singapore Authority (PSA) to read container numbers\n\nfor identification and keeping track of the movement of containers in and out of the port. This was\n\nthe Container Number Recognition system (CNRS system) for which Richard Goh was the project\n\nmanager from around 1994 till 1996. He was also the project manager for the Quay Cranes Container\n\nNumber Recognition system (QCCNRS system) which was developed by the ISS from 1995 to 1996 for\n\nuse by PSA. It was around 1994 to 1995 that ISS adapted the OCR technology for use in licence plate\n\nrecognition. This technology was then used in the trials conducted for the Electronic Road Pricing (ERP)\n\nsystem. OCR technology was also used at the Woodlands Checkpoint (the Woodlands project).\n\nRichard Goh was the project manager for the Woodlands project for about six months, after which he\n\nleft to set up Optasia. Optasia were later engaged to improve and maintain the system for a number\n\nof years.26.    Optasia were set up in 1996 and have been involved in\n\nproviding OCR technology for a number of commercial car parks, even prior to the installation of the\n\nGH system. On or about 5 November 1997, Optasia signed a Memorandum of Understanding with Amano Time\n\n& Air Singapore Pte Ltd (Amano), a company which develops and markets car park systems. It\n\nwas agreed that Optasia would provide the necessary OCR technology which would be integrated with\n\nAmanos existing car park system to develop into a new system. A purchase order dated 24 December\n\n1997 was issued by Singapore Technologies (ST) Electronics Pte Ltd for Optasias licence\n\nplate recognition system. The system was later installed in Taiwan in a school car park (the\n\nTaiwan system). Around May 1998, the consortium in charge of constructing the car parks for the\n\nKuala Lumpur International Airport was interested to use OCR technology in the car parks and\n\nOptasia, through a company known as CNL Pte Ltd, were asked to submit a proposal for the use of such\n\na system. Richard Goh prepared a demonstration system and it was shown to the consortium\n\nrepresentatives on 27 May 1998. Finally, in February 1999, ST Electronics again approached Optasia\n\nfor the use of OCR technology in the car park system for Sim Lim Square. The OCR technology was\n\nemployed to record licence plate numbers of vehicles entering the car park. It should be noted,\n\nhowever, that for all the car park systems which Optasia had been previously involved in, none of\n\nthem was a tickletless and cashless system.27.    The next important witness for GPS and MM was Lu Youming (Lu),\n\nthe managing director of Wei Long. Prior to setting up Wei Long in 1998, Lu was employed as a\n\nresearch director in a company called Norva (S.E.A) Pte Ltd (Norva) from 1990 to early 1998.\n\nWhile he was at Norva, his work included supplying car park systems for as many as 13 commercial\n\nprojects, some examples being the car parks at the Alexandra Technopark, the PSA Building, the\n\nTanjong Pagar Complex and Finger Pier. Lus work also covered the development of smartcard parking\n\nsystems and the installation of Light Emission Diode (LED) information displays.28.    In early 1998, Lu left Norva to set up Wei Long and it was\n\naround June 1998 that Wei Long developed a new cash card reader that would be suitable for use in a\n\nhigh-volume environment such as a car park. In July 1998, Wei Long submitted to the National Science\n\nand Technology Board (NSTB) a proposal for a car park system which would allow payment of\n\nparking charges to be made using NETS cash cards. The system was called \"Cashpark\", later\n\nrenamed as \"Epark\". In 1999, NSTB awarded Wei Long a grant to develop a ticketing system\n\nthat was based on the use of cash cards.29.    It was around 1996 to 1998, through the course of his work\n\nat Norva that Lu first came into contact with GES. Around September 1998, Mah of GES approached Lu\n\nand told him that GES were tendering for the construction of the Vehicle Entry Permit (VEP)\n\nsystem for the Land Transport Authority (LTA). A cash card system was used for the VEP\n\nproject. For the purposes of the VEP project, GES engaged Wei Long to provide the installation of a\n\nfront end system, which included,inter alia, the hardware and software for cash card readers\n\nand LED displays. The VEP system was later installed at the Woodlands, Tuas and Changi Ferry\n\nTerminal checkpoints. Wei Longs work for the VEP project commenced around May 1999 and was\n\ncompleted by around the end of 1999. Incidentally, GES had also sub-contracted a large part of the\n\nworks in the VEP project to Stratech and they were responsible for the central computer system, the\n\nnetwork and the system architecture in the project.30.    Lu claimed that it was from his work on the VEP project\n\nthat he recognised the feasibility of using cash card readers in a car park system. Thus, around\n\nSeptember 1999, Wei Long loaned from NETS two cash card components for the purpose of making a\n\nworking prototype of a cash card reader to be used in a car park system. The prototype and the\n\nsoftware for the system was written by one Qian Lei, an engineer in Wei Long. This prototype was\n\ndemonstrated to Mah sometime in November 1999. Subsequently, Mah contacted Lu with regard to\n\ninstalling the GH system.31.    Finally, there is Mah of GES and Ledbury. He gave evidence\n\non the experience of the two companies in the fields of car park and vehicular access systems. GES\n\nwas first involved in the installation of a car park system in 1994. This was a contract for the\n\nHousing and Development Board and it involved an outdoor car park using automated payment. Since\n\nthis project, Ledbury and GES have worked on several other installations of car park or vehicular\n\naccess systems and these included the car parks for the Guthrie Building at Changi Road, the Guthrie\n\ncondominium at Fifth Avenue and the VEP project for LTA. It was in the course of these projects that\n\nMah acquired a working knowledge in the area of systems integration, especially in the context of\n\ncar parks and vehicular access systems. I should stress that the defendants access to the\n\ntechnical capability to integrate the OCR system and the cashless/ticketless payment system is a key\n\nissue of fact in this action.32.    Having dealt with the backgrounds of the main witnesses for\n\neach of the parties, I now turn to Stratechs claim for breach of confidence.The law of confidence33.    The requirements which must be satisfied before an action\n\nfor breach of confidence can be made out has been succinctly summarised by Megarry J in the\n\noft-cited case ofCoco v Clark[1969] RPC 41at 47:First, the information itself must \"have the necessary quality of\n\n  confidence about it\". Secondly, that information must have been imparted in circumstances\n\n  importing an obligation of confidence. Thirdly, there must be an unauthorised use of that\n\n  information to the detriment of the party communicating it.34.    In the present case, the relevant documents which Stratech\n\nclaim contained the alleged confidential information are as follows:(i) The JP proposal by Stratech dated 9 December 1998.(ii) A fax transmission dated 4 June 1999 from Stratech to JPR which enclosed\n\n  the new charging algorithm.(iii) The system requirements specifications for the JP system dated 8 June\n\n  1999.(iv) The software requirements specifications for the JP system dated 8 June\n\n  1999.(v) A fax transmission dated 24 September 1999 from Stratech to JPR which\n\n  enclosed a proposal for additional works to be carried out on the JP system.(vi) The delivery acceptance certificate dated 16 February 2000 for the JP\n\n  system, signed by JPR for Stratech.(vii) The GH proposal by Stratech dated 23 April 1999.35.    The information which is claimed to be confidential, dealt\n\nessentially with the technical and functional description of how the ICPS worked, its system design\n\nand layout, the components involved, how they were installed, the hardware aspects of the system,\n\nits implementation and even the solutions to problems encountered in the functioning of the system.\n\nThis is, of course, only a general summary of the nature of the information which Stratech are\n\nseeking to protect and should not be treated as an exhaustive description. For the ease of\n\nreference, any subsequent mention of the ICPS shall mean a reference to Stratechs system as\n\nreflected in the information which they are claiming to be confidential.Quality of confidence36.    Is the information confidential in nature? GPS and MM\n\ncontend that the relevant information cannot be regarded as confidential for two reasons. Firstly,\n\nbecause the information was already known and practised by members of the industry who are skilled\n\nin this area, and secondly, the information became public knowledge when the JP system was fully\n\ninstalled by August 1999. Stratech disagree with both contentions. Stratech submit that there is no\n\nproof that the information was known and practised by persons in the industry. The cumulative effect\n\nof the entries submitted by the Temasek Polytechnic students do not equate to the information which\n\nmake up the ICPS. Prior to the JP system, there was no similar system available in the market,\n\nSingapore or elsewhere. It is suggested that the Guthrie group recognised precisely the uniqueness\n\nof the system and that was the reason why they had been keen to enter a joint venture with Stratech\n\nto develop and market the ICPS. The installation of the JP system also did not render the\n\ninformation public knowledge. Members of the public could only see the system from the outside and\n\nthere remained a lot of technical details, such as the system network, the technology used, the\n\nsoftware specifications of the system, which were not accessible or available to the public at\n\nlarge.37.There is no doubt that\n\nprotection can only be extended to information which is not already freely available in the public\n\ndomain. InCoco v Clark (supra), Megarry J quoted Lord Greene from the case ofSaltman\n\nEngineering Co Ltd v Campbell Engineering Co Ltd(1948) 65 RPC 203 and said, at p.47 :\"something which is public property and public knowledge\" cannot per\n\n  se provide any foundation for proceedings for breach of confidence. However confidential the\n\n  circumstances of communication, there can be no breach of confidence in revealing to others\n\n  something which is already common knowledge.38.    I am of the view that the concept of using OCR technology\n\nand NETS cash cards to create a \"cashless\" and \"ticketless\" car park system,\n\nlost its confidentiality, if any, once the JP system was installed, since it could easily be\n\nobserved by a person who visited the car park at Jurong Point. However, Stratech are not seeking to\n\nclaim that the concept is confidential. It is the technical information on the functional\n\ndescription, system specifications, software specifications, system architecture and design and\n\nlayout, etc. which are alleged to remain confidential. In this respect, I accept Stratechs\n\narguments. Most of such information would not be observable by the public when they visit the JP car\n\npark. As pointed out by Stratech, it would not be possible to see how the system architecture was\n\ndesigned, how the network was set up, what was the software that was being used and the pricing of\n\nthe whole system. These are examples of the type of information which remained confidential.39.    I also do not accept the contention that the information\n\ngiven by Stratech to JPR and GPS is public knowledge because it is known and practised by persons\n\nskilled in this area. Stratechs information must be looked at in its entirety and not in its\n\nindividual parts. The existence of the software used, and the distinct components by themselves were\n\nknown to people in each relevant industry but it is the way Stratech have combined everything\n\ntogether which makes the integrated information, as a whole, confidential in nature. The ICPS is but\n\none form of \"cashless\" and \"ticketless\" car park system which makes use of OCR\n\ntechnology with payment by NETS cash cards. The fact that competitors of Stratech may then\n\ncapitalize on the concept and come up with their own similar but distinct car park systems does not\n\nmean that the information relating to the ICPS is no longer confidential.40.    Directly linked to this is the springboard doctrine\n\nwhich is a rule that, where the information has become part of the public domain or where some of\n\nthe information was not confidential to the plaintiff to begin with, the defendant-recipient is\n\nnonetheless under a duty not to make use of the information as a \"springboard\" for\n\nactivities that would be detrimental to the plaintiff. The doctrine was enunciated inTerrapin\n\nLtd v Builders Supply Company (Hayes) Ltd and Others[1967] RPC 375at 391-2 in the following\n\nterms:the essence of this branch of the law, whatever the origin of it may be, is\n\n  that a person who has obtained information in confidence is not allowed to use it as a\n\n  spring-board for activities detrimental to the person who made the confidential communication, and\n\n  spring-board it remains even when all the features have been published or can be ascertained by\n\n  actual inspection by any member of the public.More will be said on the subject later when I consider the question of whether\n\nthere has been unauthorised use of the information.Obligation of confidence41.    This issue can be disposed of quickly. There is no doubt in\n\nmy mind that the information was given by Stratech to JPR and GPS in circumstances which imposed an\n\nobligation of confidence. The information was given by Stratech for specific purposes. For JPR, it\n\nwas to assist them in deciding on the installation of the ICPS at Jurong Point and later, in the\n\nactual installation and implementation of the JP system. As for GPS, it was to enable them to decide\n\non whether to install the ICPS at Guthrie House as well. The information was highly technical and\n\nwould have been useful to anybody interested in building a similar system. Stratech clearly intended\n\nto protect the information when they marked the documents \"Confidential\" and \"Patent\n\nPending\" before forwarding them to the respective parties. Leong, who had received the\n\ndocuments and the information therein on behalf of JPR and GPS, had certainly understood the duty of\n\nconfidentiality that was imposed. When cross-examined by counsel for Stratech about whether the GH\n\nproposal had been shown to Ledbury, Leong stated that he did not and would not have done that\n\nbecause it would have been morally and legally wrong to do so. He admitted that the\n\ndocuments were marked \"Confidential\" and that he had felt a duty to protect the documents\n\nas confidential.Unauthorised use42.    I now deal with what is at the end of the day the main\n\ninquiry in this case, that is, whether the confidential information had been misused by GPS and MM\n\nto the detriment of Stratech. Stratechs claim is one that is based on inferences to be drawn from\n\nthe facts. They have not adduced any direct evidence of misuse but that is hardly unusual in cases\n\nof this kind. A plaintiff in a position such as Stratech would often find it difficult to prove the\n\nactual commission of the breach or actual misuse and the way to establish ones case would be\n\nthrough highlighting the tell-tale signs of striking similarities, especially in unique features,\n\nthat exist between the plaintiffs and the defendants products. That was the approach of\n\nStratech. The issue is best approached by dealing with critical features of the two systems.Similarities between the ICPS and the GH system(i) System architecture43.    It is contended by Stratech that the system architecture of\n\nthe GH system is highly similar to the ICPSs. On the other hand, Lu and Richard Goh asserted that\n\nthere are fundamental differences between the two system architectures. Put simply, the alleged main\n\ndistinction is that under the ICPS, the processing of the licence plate number image, calculation of\n\nthe entry/exit times and the respective parking charges and other processes are all done at a single\n\nprocessor called the ICPS processor; whereas under the GH system, the processing is done in two\n\nsteps in two processors  the Number Plate Recognition (NPR) processor and the payment\n\nstation processor. The NPR processors only processes the image of the licence plate number while the\n\npayment station processor is responsible for the other functions. Richard Gohs evidence is that\n\nthe separation of the processes into two steps is an important difference. The GH system involved an\n\nintegration of two sub-systems, namely, Optasias and Wei Longs, and the two systems were based\n\non different operating systems and it would actually have been more difficult and time-consuming if\n\nthey had attempted to design the architecture such that all the functions were performed in a single\n\nprocessor. Further, changing the functions to be carried out at each processor could significantly\n\naffect the performance of the overall system. Kennedy Chews evidence is that this is a\n\ndistinction without a real difference. He drew an analogy with an assembly line of parts to be done\n\n- getting two persons to perform what one person was doing does not result in a fundamental change\n\nin the system. He then referred to the drawing of the system architecture for the GH system and\n\npointed out that if some of the wires were manipulated and extended, then the system architecture\n\nwould effectively be the same as that for ICPS.44.    In the course of the proceedings, it came to light that\n\nthere was actually another processor that is involved in the system architecture. Both the ICPS and\n\nthe GH system have an additional \"Parking Administration Workstation\" and \"Management\n\nStation\" respectively. Stratech allege that Lus evidence on the system architecture is\n\ncontradictory. In his written affidavit, he made no mention of the Management Station but brought it\n\nup suddenly during his oral testimony. Qian Lei, an engineer with Wei Long, who designed the\n\nsoftware of the GH system, also supposedly described a system that is different from Lus\n\ndescription. Stratech argue that it is suspicious why the Management Station was only mentioned\n\nduring the witnesses cross-examination but not in their affidavits and this, coupled with the\n\ncontradictions, lead to the inference that the witnesses for GPS and MM are not entirely forthright.45.    In my judgment there are fundamental differences in the\n\nsystem architecture of the GH system and Stratechs ICPS. The analogy drawn by Kennedy Chew with\n\nan assembly line of parts is not accurate or suitable for the division of functions between computer\n\nprocessors. Limiting or expanding on the number and/or type of functions to be performed by each\n\ncomputer processor would in fact significantly affect the way the system worked. If one computer had\n\nto perform all the functions when it had not been designed to, it would adversely affect the overall\n\nperformance of the whole system. I find the explanation given by the defence to be entirely\n\nconsistent with their case that the GH system is an integration of two discrete systems and hence\n\nthe image processing would naturally be taken care of b Optasias sub-system while the other\n\nprocesses (eg. payment charges) would be handled by Wei Longs sub-system. I do not think that the\n\nGH system had been described differently by the different witnesses. As explained by Richard Goh,\n\nwhose explanation I accept, each sub-system runs on different operating systems (Optasias runs on\n\nUNIX while Wei Longs runs on DOS), and trying to combine the functions into a single step to be\n\nperformed in one processor, although possible, would effectively have been more troublesome since it\n\nwould have required significant modifications and adjustments to each of the sub-systems which had\n\nbeen designed to perform only its own specialised functions. Kennedy Chews attempt to highlight\n\nany similarities through the extension and manipulation of the wires in the GH system does not\n\nconvince me. The fact remains that the wiring in the two systems are done differently and I am not\n\npersuaded that the extension of the wires then shows that the systems are effectively the same. I\n\nshould also point out that other differences between the GH system and Stratechs ICPS, in terms\n\nof the operating systems used as well as computer specifications, can be observed. As mentioned\n\nearlier, Optasias NPR processor uses UNIX while Wei Longs payment station processor uses DOS,\n\nas contrasted to the ICPS which uses Windows NT. Wei Long uses a low specification 386\n\n\"diskette\" industrial PC for his payment station processor whereas the ICPS utilises a\n\nstandard Pentium II 350 industrial PC. While Optasia also uses a Pentium industrial PC for his NPR\n\nprocessor, this is hardly surprising when it is shown that this was the type of processor he had\n\nbeen using for the Taiwan system and the Sim Lim Square car park, even before the GH system was\n\ninstalled. This cannot be regarded as an indicator of copying by Optasia.46.    As for the supposedly suspicious introduction of the\n\nManagement Station during the defence witnesses oral testimonies, I find the contention by\n\nStratech unmeritorious. The comparison of the two system architectures was made by comparing the\n\nICPS processor (one) to the GH systems NPR processor and payment station processor (two). When\n\nKennedy Chew was cross-examined on this issue, he did not dispute this description of the ICPS and\n\nneither did he make any reference to the Parking Administration Workstation in the ICPS to say that\n\nthere are actually two, and not one, processors involved in the ICPS. He merely tried to explain\n\nthat the difference depicted by the defence was not a fundamental one. In any event, it was clear\n\nfrom Lus evidence that the performance of the GH system is not dependent upon the Management\n\nStation because Lu had specially designed his system with a \"back up\" feature, such that\n\nif the Management Station should breakdown or be switched off (accidentally or otherwise), the\n\nnecessary functions can still be performed by the NPR processor and the payment station processor.\n\nFurther, it appears to me that the Management Station in the GH system is similar to the Parking\n\nAdministration Workstation in the ICPS, or at least Stratech did not seem to have contended\n\notherwise. If the Management Station should be discussed as part of the system architecture, then\n\nsimilarly, the Parking Administration Workstation would also have to be considered. The end result\n\nis effectively still the same since the ICPS would still only have two processors (the ICPS\n\nprocessor and the Parking Administration Workstation) as opposed to the GH system which uses three\n\n(the NPR processor, the payment station processor and the Management Station).(ii) Grace Period47.    Under the ICPS installed at Jurong Point (ie. the JP\n\nsystem), there is a grace period feature for motorists whereby they are given free access for a\n\nnumber of minutes, although the evidence is unclear on the exact amount of time allocated as the\n\ngrace period. A grace period feature was also mentioned in Stratechs GH proposal. In Lus\n\naffidavit of evidence-in-chief, he stated that in contrast, the GH system didnothave a\n\ngrace period feature and all motorists using the GH car park are charged based on the time spent in\n\nthe car park. During the trial, evidence was adduced by Stratech to show that the GH system did in\n\nfact have a five minute grace period. Leong explained in his oral testimony that the GH system had\n\nthe capability of incorporating a grace period but that it was a management decision not to give any\n\ngrace period and instead to charge motorists on a per minute basis. The supposed five minute\n\n\"grace period\" could be due to the clocks determining the entry time and exit time, which\n\nshould have been synchronised but were out of synchronisation by five minutes. Lu, during his\n\ncross-examination, confirmed that the system did in fact have the capability of setting grace period\n\nparameters but that the management for Guthrie House had chosen to set it at zero. Evidence was then\n\nadduced on behalf of Stratech to show that the grace period in Guthrie House could not have been due\n\nto the clocks being out of synchronisation, since a motorist who stayed in the GH car park for a\n\nperiod of six minutes was still being charged for the full six minutes, and not for only one minute\n\n which should have been the case if the clocks were indeed out of synchronisation by five\n\nminutes. On such evidence, Lu conceded that this showed that the grace period parameters must have\n\nbeen set to five minutes, whether or not intentionally. Lu was, however, contradicted later by Qian\n\nLeis evidence, who claimed that he had just inspected the GH system and the grace period\n\nparameters and found it still to be set at zero. Qian Lei then reiterated the explanation that the\n\nclocks for the entry/exit times were out of synchronisation by five minutes.48.    Based on the inconsistencies in the evidence given by\n\nLeong, Lu and Qian Lei on the grace period feature, as well as their inability to properly explain\n\ntheir contradictions, it is contended by Stratech that this is an obvious tell-tale sign of the GH\n\nsystem having been copied from the ICPS. Stratechs manual for the ICPS must have been taken and\n\ncopied \"lock, stock and barrel\" by Wei Long and the supposed designer of the system did\n\nnot even realise that there was such as feature as the grace period, which Stratech had specially\n\nincluded into the system. Stratech argue that this must have been the reason why Lu initially said\n\nthat there was no grace period feature in the GH system.49.    In the beginning, this was an issue that I did not consider\n\nto be particularly helpful to Stratechs case. Despite what they may wish to claim about the grace\n\nperiod being a unique feature which they had specially designed into the ICPS, there is no denying\n\nthat it is already a well-recognised attribute of many existing conventional car parks. I do not\n\nbelieve that any argument can be made that the presence of such a feature in the GH system, by\n\nitself, can be an indicator of breach by GPS. However, I am compelled to acknowledge that the\n\nevidence given by the defence witnesses in this area is somewhat unsatisfactory, hence requiring a\n\nmore in-depth consideration of the issue. After examining the evidence in careful detail, I find\n\nthat the GH system, as it is presently functioning, does in fact have a grace period of 5 minutes.\n\nNotwithstanding that, I also find that the GH system, when it was first installed, did not have a\n\ngrace period as a management decision had been made not to give any free access but instead, to\n\ncharge motorists on a per minute basis. This was clearly evidenced in the transaction reports\n\ngenerated by the GH system for the relevant period. I believe that Lu intentionally designed the\n\nsystem with the capability of setting a grace period and that his affidavit evidence dealt with the\n\nfact that no grace period had been set and not with the systems capabilities. Why the GH system\n\nnow appears to have a five minute grace period cannot be properly explained by the evidence. It\n\ncould be a technical defect in the system that has so far escaped the understanding of the system\n\ndesigners or simply due to some human \"error\", but I do not see it necessary for the\n\npurposes of the present case to determine the exact cause. At the end of the day, I am not prepared\n\nto accept Stratechs arguments on this issue for the reason that they cannot be reconciled with\n\nthe objective evidence. If Stratechs allegation that their software, as used in the JP system,\n\nwas given to and copied wholesale by Wei Long, then the GH system should have been the same as the\n\nJP system and would have had a grace period feature right from the day of its installation. This is\n\nbecause a grace period had been triggered for the software in the JP system and this would have been\n\ndirectly copied into the GH system and could not have been changed if Wei Long and GPS were unaware\n\nof it. This is clearly not the case since the evidence showed that the grace period for the GH\n\nsystem had been set at zero in the beginning and this was the intended result of GPSs management\n\ndecision.(iii) Use of Licence Plate Recognition software50.    The Licence Plate Recognition (LPR) software that is\n\nused by Stratech in their ICPS is called GLIMPSE. This is a software licenced by Stratech from Kent\n\nRidge Digital Labs (KRDL), which is the research arm of the ISS that was corporatised in 1998.\n\nAccording to Richard Goh, the LPR software used by Optasia in the GH system is called IMPS, the\n\nproprietary rights of which belongs to Optasia. IMPS was developed from the software that was used\n\nin the Woodlands project and which had no proprietary name assigned to it then. GLIMPSE and IMPS\n\nthus share the similarity that they are both based on predecessor LPR softwares which were developed\n\nby ISS, now KRDL, and hence, can be said to be from a common original source. Stratechs case is\n\nthat the fact that GLIMPSE is the LPR software used in the ICPS is useful information since the\n\nrecipient of the information can then save time and costs through deducing that GLIMPSE, or at least\n\nLPR software originating from KRDL, would be suitable for use in a car park system. They contend\n\nthat such confidential information was clearly misused by Mah in helping him to choose Optasia as\n\nthe company to provide the OCR technology. This is seen from Mahs cross-examination where he\n\nstated that Optasia were selected because Ledbury had wanted to use the LPR software from KRDL and\n\nother than Stratech, Optasia and ST Electronics were the two other licencees of the software.\n\nOptasia were chosen over ST Electronics based on pricing and their superior technical competency.\n\nStratech then submit that this is an obvious tell-tale sign of the confidential information being\n\nmisused because Mah could not have known that the LPR software from KRDL would have been suitable\n\nfor use in a car park system, unless he had been given access to the confidential information. The\n\ndefences counter to this allegation is that, even prior to the development of the ICPS which uses\n\nGLIMPSE, Optasia had already been using their own LPR software, IMPS, in other car park systems such\n\nas the Sim Lim Square car park.51.    I am unable to accept Stratechs contention on this\n\npoint. It is not a secret that KRDL develops OCR technology, in particular, software for LPR. KRDLs\n\nLPR software has been in use at the Woodlands project even before the ICPS was designed by Stratech.\n\nThese are information which are known to people who are in this field and can hardly be claimed to\n\nbe confidential to Stratech. In addition, the LPR software that was used by Optasia for the GH\n\nsystem is not GLIMPSE at all but Optasias own LPR software, IMPS. Both GLIMPSE and IMPS were\n\ndeveloped at around the same time and in parallel, and while GLIMPSE runs on a Windows operating\n\nsystem, IMPS runs on UNIX as an operating system. Although they may have originated from the same\n\npredecessor software, both have been modified significantly to be rightfully regarded as distinct\n\nsoftwares with their own proprietary rights attached to them. The reason Optasia did not use GLIMPSE\n\nis not because it was deduced from the confidential information that the software is not suitable,\n\nwhich is one of the allegations raised by Stratech, but because Optasia already had their own LPR\n\nsoftware and they had already previously used it in other car park systems (e.g. the Taiwan system\n\nand the Sim Lim Square car park). It is also undisputed that Mah was acquainted with Richard Goh\n\nsince 1992 while the latter was still working in ISS and was doing work related to OCR technology.\n\nMah was already familiar with Richard Gohs area of expertise. Taking all these facts into\n\nconsideration, I do not think that it was necessary at all for Mah to have relied on the\n\nconfidential information to select Optasia for providing the OCR technology for the GH system.(iv) Use of two cameras at the exit52.    The next similarity highlighted by Stratech is the fact\n\nthat two cameras are used for the exit in the GH system to capture the image of the vehicles\n\nlicence plate number. Although the JP proposal had stated the use of only one camera, the final\n\ninstallation of the JP system had involved two cameras and in the GH proposal, two cameras had also\n\nbeen recommended. Richard Goh, however, claims that the use of two cameras was entirely his own\n\nidea. His experience with other car park systems, such as the car park at Sim Lim Square, made it\n\napparent to him that there was likely to be a tailgating problem, which would then lead to the\n\nlicence plate of the car being obscured, a problem which could be overcome by adding a second\n\ncamera. Richard Goh further asserted in his affidavit that he had used two cameras at the exit for\n\nhis other earlier projects. This proved to be inaccurate though when he was cross-examined on this\n\npoint and he admitted that the other car park or vehicular access systems he had worked on\n\npreviously only used one camera per lane for the exits.53.    Whilst I am not entirely satisfied by Richard Gohs\n\nexplanation for using two cameras, especially his unwarranted claim with regard to his earlier\n\nprojects, I am not inclined to examine this issue just based on the number of cameras used. In my\n\nview, it is unsafe to place too much significance on the mere fact that the same number of cameras\n\nwere used. The number of cameras used is not an isolated factor but must be looked at in conjunction\n\nwith other factors relating to the cameras. As Kennedy Chew himself would put it, the choice of\n\ncamera, the location and placement of the camera, the angle used, etc. are all important\n\nconsiderations which require detailed calculations. There are a variety of reasons why two or even\n\nmore cameras should be used and they need not be the same for designers of different car park\n\nsystems. Ultimately, I am not convinced that there are enough similar factors to indicate that\n\nconfidential information was made use of by Optasia. The specifications of the camera used were\n\ndifferent, Optasias camera had a fixed focal length of 18mm while Stratechs original JP\n\nproposal used one with 12mm, and the revised JP proposal and the GH proposal had recommended a fixed\n\nfocal length of 25mm. Although Optasia used a 1/2\" Charged Coupled Device (CCD) camera in the\n\nGH system, which was similar to that recommended by Stratech in the GH proposal, this cannot be\n\ninterpreted against Optasia because the 1/2\" CCD camera was already used by them in their\n\nearlier projects, such as the Taiwan system and Sim Lim Square car park. It is also not disputed\n\nthat Optasia had placed their cameras at different locations and at different angles from that\n\nstated by Stratech in their proposals.(v) Miscellaneous points of similarity54.    I shall now deal briefly with several other points which\n\nStratech allege to be confidential and must have been misused by GPS and MM. Firstly, Kennedy Chew\n\nclaimed in his evidence that Ethernet is not commonly used to network car park systems and the fact\n\nthat the GH system also used Ethernet is telling. However, this allegation lost much of its\n\npersuasive force, if any, when it was shown that Lu had previously used Ethernet in his previous\n\nprojects involving car parks, namely, the car parks in the PSA building and the Tanjong Pagar\n\nComplex. Secondly, transaction reports generated by the system were referred to but evidence showed\n\nthat the format of the transaction reports produced by the GH system was quite different from that\n\nproduced by the JP system which Stratech installed. The use of LED displays was also brought up by\n\nStratech as a point of similarity. I find this an unconvincing argument since Lu has sufficient\n\nexperience in this area and the use of LED displays cannot be foreign to him. Further, the manner of\n\nuse of the LED display would have been apparent to anyone who visited and observed the JP system\n\nafter it was installed. Finally, there were references to the pricing information and lead time\n\nbeing confidential information but I certainly cannot find any evidence of misuse by GPS and/or MM\n\nof such information and that much was admitted by Kennedy Chew during his cross-examination.Timing55.    Other than drawing attention to the supposed similarities\n\nbetween the GH system with their ICPS, Stratech also emphasised the fact that Ledbury, with Optasia\n\nand Wei Long, took an extremely short time to set up the GH system. They contend that this is very\n\nsuspicious as they believe the GH system could not possibly have been installed within such a short\n\ntime when the parties did not have the expertise to do so and the fact that it was done leads to the\n\ninference that Ledbury, Optasia and Wei Long did not start from scratch and must have made use of\n\nthe confidential information. In support, it is highlighted by Stratech that in the second half of\n\n1999, the Guthrie group was interested in forming a joint venture with them to market the system and\n\nas late as October 1999, GPS issued a purchase order to Stratech to install the ICPS at Guthrie\n\nHouse, despite GPSs claims that they were unhappy with the JP system. Stratech submit that these\n\nare evidence that up to late 1999, GPS and MM were not able to set up their own similar car park,\n\nyet suddenly, by early March 2000, the GH system was installed.56.    It seems to me that Stratech are under the misconception\n\nthat everyone else in the industry must be behind them in terms of the technology used in a car park\n\nsystem such as the ICPS. But this is not necessarily true at all. It may be true that Stratech were\n\nthe first to implement the concept of a \"cashless\" and \"ticketless\" car park\n\nsystem through the use of OCR technology and NETS cash cards for payment. But, where it concerns the\n\ntechnology involved in the separate aspects, as in the OCR technology and the NETS payment system,\n\nOptasia and Wei Long appear to be much more experienced than Stratech in these fields. Richard Goh\n\nof Optasia has been in the field of OCR technology since 1992 and Optasia have been supplying their\n\nLPR software for car park systems from late 1997 onwards. Lu also acquired vast experience on car\n\npark systems during his time in Norva where he worked on as many as 13 projects for car park\n\nsystems. Thus, I cannot find any grounds for the allegation that Richard Gohs and Lus\n\nexperience and expertise in their respective fields are not relevant towards their work on the GH\n\nsystem. It did not escape my notice that, by comparison, the JP system was Stratechs first foray\n\ninto the business of building and marketing car park systems and they could not speak of much\n\nexperience in this area either. If anything, it seems to me that the short time that Optasia, Wei\n\nLong and Ledbury took to set up the GH system testifies to their capabilities and experience in car\n\npark systems and systems integration. Stratech themselves would have required about four months to\n\ninstall the GH system and this was so even though they already had the requisite know-how and had\n\nacquired valuable experience from installing the JP system. If Optasia, Wei Long and Ledbury were\n\ntruly as inexperienced in car park systems as Stratech would make them out to be, then even with\n\nreliance on the confidential information, they surely would have taken at least the same amount of\n\ntime, if not more, to complete the GH system. Instead, the facts prove otherwise and they were able\n\nto do it within two and half to three months and I find this to be consistent with the defences\n\nassertions that Optasia and Wei Long were already familiar with the respective sub-systems they were\n\nresponsible for providing and Ledbury had no problems integrating the two together.The \"springboard\" issue(i) Lack of documentation57.    Another argument raised by Stratech is that the lack of\n\ndocumentation with respect to the project on the GH system is highly suspect and it is a sign that\n\nthe GH system was \"springboarded\" from the ICPS. The paper trail must have been\n\n\"wiped clean\" so as to hide the facts showing misuse of the confidential information by\n\nthe parties. However, not all the tell-tale signs were removed. In particular, Stratech referred to\n\nthe letter of award for the GH system that was issued by GPS to Ledbury on 13 December 1999. In this\n\nletter of award, one of the few documents relating to the GH system, a special condition was\n\nincluded in the following terms:3 Special Condition3.1 It is a condition of this agreement that M/s Ledbury Technologies Pte Ltd\n\nshall undertake the maintenance of the Carpark system at Jurong Point should the existing installer\n\nwhich is M/s Stratech Systems Pte Ltd fail to provide the service required.3.2 Cost and conditions for the maintenance and upkeep of Carpark system at\n\nJurong Point shall be similar to that of M/s Stratech Systems Pte Ltd.58.    Stratech submit that this is a clear indication that GPS do\n\nnot function independently from JPR, otherwise GPS would not have contracted for the benefit of JPR\n\nwhen the car park system in question was the GH system, which was not any of JPRs concern. The\n\nsame also applied to Ledbury vis--vis GPS and confidential information must have been given to\n\nLedbury since they could not have agreed to such a condition being imposed without first knowing\n\nwhat are the \"costs and conditions\" referred to in condition 3.2. They contend that the\n\ninference to be drawn from all these facts is that confidential information must have been passed by\n\nGPS to Ledbury, Optasia and Wei Long.59.    GPS and MM deny that they had removed any paper trail at\n\nall. The explanation for the dearth of written documentation was that the GH system was a design and\n\nbuild project and for such projects, GPS were more concerned with the end results and how the\n\n\"product\" functioned. Mah of Ledbury also clarified that the GH system was only a small\n\nscale project for them and there was not much need for documentation. The amount, which was about\n\n$70,000, was not a large sum and the work was completed in a short time. As for the special\n\ncondition referred to in the letter of award, Leong said they included that condition because they\n\nwere already dissatisfied with the performance of the JP system then and were concerned about\n\nprotecting the interest of the Guthrie group as a whole. Nothing confidential was given to Ledbury\n\nsince the situation contemplated in the condition had not arisen yet. Mah confirmed that the\n\nquestion of the \"costs and conditions\" was never discussed and he did not see the need to\n\nfind out. Mah interpreted the clause quite widely and understood it to mean that Ledbury were free\n\nto propose their own costing and conditions since the clause did not require them to be exactly the\n\nsame as Stratechs.60.    As regards this issue, I am not prepared to draw any\n\nadverse inferences against GPS and MM. I find Stratechs allegation against them of having\n\ntampered with the paper evidence rather speculative. There are no real grounds for supporting such\n\nan accusation. It is not unusual to find businessmen dispensing with the need for written\n\ndocumentation of their dealings. This is even more likely when one is dealing with companies which\n\nbelong to the same group and share common interests. However, such a practice should not be taken to\n\nmean that the parties are not operating at arms length. In any event, I find that there was in\n\nfact proper documentation of the main agreement and quotations were prepared by the various parties\n\nand proper letters of award were issued. I observe that for the business dealings between Stratech\n\nwith JPR and GPS, the documentation were mainly provided by Stratech and there is no evidence to\n\nsuggest positively that this was a requirement by JPR and GPS which was later mysteriously\n\ndisregarded for Ledbury. The fact that Stratech chose to document their projects in specific details\n\ndoes not mean that the same should be expected of other parties who deal with GPS and MM. I accept\n\nthe reason given by Leong and Mah as to why the special condition was inserted into the letter of\n\naward for the GH system. In the light of all the circumstances, it seems to be a logical\n\nexplanation.(ii) Role of Martin Chew61.    Next, Stratech sought to highlight the role which Martin\n\nChew played in the two projects relating to the JP system and the GH system. Martin Chew is employed\n\nby GPS and he was the project manager for the installation of the GH system. He called for bids for\n\nthe project and was the recipient of Ledburys quotation for the GH system. However, he was also\n\ninvolved in supervising the trial for the JP system that was conducted at Guthrie House. Stratech\n\ncontend that Martin Chew must have been given a copy of the JP proposal and JP system requirements\n\nin order to supervise the trial of the system at Guthrie House. The information that Martin Chew\n\nacquired from there was then used, intentionally or subconsciously, when he later became in charge\n\nof the GH system. This showed that there was a free flow of information from within the Guthrie\n\ngroup of companies and the GH system was thereby \"springboarded\" from the JP system.62.    Leong did not dispute the role played by Martin Chew in the\n\ninstallations of both the JP system and the GH system. He admitted that Martin Chew had played a\n\nmajor role in relation to the GH system. However, he disagreed that Martin Chew was given a copy of\n\nthe JP proposal and the system requirements when he supervised the trial of the JP system at Guthrie\n\nHouse. It is claimed that Martin Chew was merely there to ensure that the system functioned smoothly\n\nand nothing was done which might affect the operations of the Guthrie House itself. There was no\n\nneed to give him any of the information relating to the JP system as he was not involved in the\n\ntechnical aspects of the project. Consistent evidence was given by Martin Chew himself, who\n\ntestified that he was only carrying out his duties as the property manager of Guthrie House.63.    I fail to see how this point really furthers Stratechs\n\narguments on misuse by GPS and MM. It is clear that Martin Chew did not play a technical role in the\n\ntwo projects. He was generally in charge of overseeing the property management of the Guthrie House.\n\nI accept the evidence that it was not necessary for Martin Chew to have access to any confidential\n\ninformation as he was not concerned with the technical aspects of the JP system but more on how the\n\ntrial might affect the normal operations of the Guthrie House. This was also the same for the GH\n\nsystem. My view is buttressed by the evidence given by Richard Goh when he was cross-examined about\n\nwhether he had dealt with Martin Chew in the course of installing the GH system. Richard Gohs\n\ncandid reply was that Martin Chew did not deal with him on the technical details of the system but\n\nwas responsible for the operations aspects such as whether the system is aesthetically pleasing.64.    Ultimately, it must be remembered that it was not GPS who\n\nbuilt and installed the GH system. The work had been contracted to Ledbury who in turn,\n\nsub-contracted Optasia and Wei Long to perform the job. Martin Chew, even if he had acquired any\n\nconfidential information, did not make use of it to help build the car park system. This is an\n\nimportant distinguishing factor from other cases where the courts found that the defendants had made\n\nuse of confidential information to \"springboard\" themselves ahead to the detriment of the\n\nplaintiffs. One of the cases that is cited by Stratech in support of their claim isTerrapin Ltd\n\nv Builders Supply Company (Hayes) Ltd and Others[1967] RPC 375. The facts of this case,\n\nbriefly, were that the defendants were licenced to manufacture prefabricated portable buildings (the\n\nMark 24) designed by the plaintiffs. Under this agreement, confidential information on the\n\ndesign, full manufacturing details, specifications and relevant technical information and know-how\n\nwere communicated by the plaintiffs to the defendants. An improvement to the design of the Mark 24\n\nwas later made by the plaintiffs who disclosed this in confidence to the defendants. However, not\n\nlong after, the licence agreement came to an end and was not continued. Soon after the termination\n\nof the agreement, the defendants then started to offer, in competition with the plaintiffs, a\n\nsimilar prefabricated building which incorporated numerous features of the plaintiffs original as\n\nwell as the improved design. The plaintiffs sued successfully for breach of confidence. It was\n\nproven that an employee, one Mr Chambers, who was allegedly responsible for the defendants design\n\nhad previously supervised the manufacture of the Mark 24 while the licence agreement was still\n\nsubsisting. It was held there that the confidential information must have been made use of by the\n\ndefendants, even if albeit unintentionally. Justice Roxburgh said, at p.390:Mr Chambers returned from abroad in November 1957, he took charge of this\n\n  workshop and of the production of the Mark 24, which was already in full swing. He was the heart\n\n  and centre of it all. He personally has sworn that although he had access to the drawing and\n\n  specifications, he did not use them. This might be because his staff did, but it might be that\n\n  neither did because Mr Chambers knew every stage in the actual production of the Mark 24 unit,\n\n  which was going on day by day under his very nose, and, accordingly, his mind must have been\n\n  saturated with every detail of its design, features and methods of construction; and if his mind\n\n  was so saturated from observing the work in progress on the manufacture of Mark 24 buildings,\n\n  obviously that information was either directly or indirectly derived from the original\n\n  confidential communications made by the plaintiffs to the first defendants. Moreover, upon what\n\n  were Mr Chambers first efforts now directed?  to improve the floor of the Mark 24; not to\n\n  make some new building unit. If, therefore, his mind was not already saturated with the Mark 24,\n\n  his efforts to improve it must assuredly have completed that process. There is no better way of\n\n  really understanding something than to try and improve it, and if you produce a different result,\n\n  it is absurd to say that you made no use of the thing which you set out to improve.65.The facts of the present case\n\nmay appear to bear some similarities to theTerrapincase but there are significant factors\n\nwhich distinguish the earlier case from ours. In the present case, GPS and MM were not the ones who\n\ndesigned and built the GH system. In fact, they do not appear to be interested in the making or\n\ninstallation of car park systems and have not claimed to have such expertise themselves. Their\n\ninterest is in the marketing of such systems. In both the JP system and the GH system, JPR and GPS\n\nwere respectively the \"customers\" buying the car park system and not the suppliers. As a\n\ncustomer, GPS are fully entitled to engage independent contractors to provide a system similar to\n\nthat installed at Jurong Point. There was no need for them to misuse the confidential information\n\nand they are not shown to have done so.Evidence of Richard Goh and Lu Youming66.    Finally, Stratech sought to attack the veracity of the two\n\ndefence witnesses, Richard Goh and Lu. It is alleged that Richard Goh is an interested party who is\n\nprone to exaggeration and misleading statements. He is not as experienced as he claims himself to be\n\nand he often commented on matters which he was not involved in. Little weight should be given to his\n\nevidence since he did not have the relevant experience in similar car park systems and is not really\n\nqualified in this area. As for Lu, Stratech sought to cast doubt on his integrity and credibility by\n\npointing out that his evidence was not very consistent. It is submitted that the\n\n\"Cashpark/Epark\" proposal which Lu allegedly conceptualised never existed and it is\n\ndubious why no mention of it was ever made in Lus affidavit. It is further argued by Stratech\n\nthat an adverse inference should be drawn against GPS and MM for failing to call one Loh Yew Fatt (Loh)\n\nto give evidence on their behalf. The said Loh was the project manager in Ledbury who was directly\n\nin charge of the project on the GH system. He was the main person in Ledbury who was involved in the\n\nproject and had worked closely with Richard Goh and Lu. Even though he had left Ledbury and was no\n\nlonger in the employment of the Guthrie group, there was no reason why he could not be called as a\n\nwitness, especially since he had personal first-hand knowledge on the situation.67.    Having had the benefit of watching the witnesses give\n\nevidence and testing their credibility and veracity on the stand, I find both Richard Goh and Lu to\n\nbe honest and forthcoming witnesses. They were helpful in their evidence and were able to explain\n\nclearly their involvement in the installation of the GH system. As mentioned earlier, I have no\n\ndoubt about their expertise in their fields of practice and I am convinced that it was their\n\nrelevant experience and technical know-how which enabled them to perform their respective tasks in\n\nthe installation of the GH system. I agree that there were some unsatisfactory lapses in their\n\nevidence and that there may have been some mis-statements on their part but in my view, these are\n\nminor and are not crucial to the defences case. The same deficiency could be said of the evidence\n\ngiven by Kennedy Chew, the main witness for Stratech. Regarding the point about the defence not\n\ncalling Loh, I am not disposed in the circumstances to draw any adverse inferences. An adverse\n\ninference should only be drawn if the failure to call the witness amounted to a withholding of\n\nevidence. In this case, while Lohs evidence would probably have been useful, he was not a\n\nmaterial witness as Mah was sufficiently able to speak for Ledburys position in this entire\n\ntransaction. Furthermore, Loh had left the employment of the Guthrie group and it was not as if the\n\nfailure to call him as a witness was totally without reason.Conclusions on the claim for breach of confidence68.    In all the circumstances, I find that Stratech have not\n\nproven a case against GPS and MM for breach of confidence. Although I am satisfied that the\n\ninformation concerned with was confidential in nature and was given in circumstances which imposed\n\nan obligation of confidence on the recipients, I am of the view that there was no breach of this\n\nduty as there had been no misuse by GPS or MM of the information. The main weakness in Stratechs\n\ncase was that it was overly speculative and depended too heavily on inferences which the court is\n\nunable to draw objectively based on the evidence. The similarities pointed out by Stratech are not\n\nthat striking or significant as to indicate copying of Stratechs ICPS. Furthermore, the\n\nsimilarities were credibly explained for by the defence witnesses. This case is unlike that ofCreative\n\nTechnology Ltd v Aztech Systems Pte Ltd[1997] 1 SLR 621where a case of copyright infringement\n\nof a computer program was successfully established. There, the defendants had copied even the design\n\nflaws, errors and unessential features in the plaintiffs program and there were startling\n\nsimilarities in numerous features between the two programs, including the coding of some parts of\n\nthe program which were almost identical. The coincidence could not be properly explained for and\n\nclearly represented \"fingerprints\" which gave away the defendants act of infringement.\n\nThis is not the case here. On the contrary, I find that there are considerable differences in the GH\n\nsystem and the ICPS so as to justify a finding that they are two distinct systems. To reiterate,\n\nsome of the differences between the two systems include the system architecture, the LPR software\n\nused, the type of operating system used, the type of cameras and the transaction reports generated.\n\nIf Optasia and Wei Long were as inexperienced as Stratech made them out to be and had to rely on\n\nconfidential information, then surely there would not have been so many important differences\n\nbetween the GH system and the ICPS and a lot more indicators of copying would have shown up.69.    Accordingly, I find that there was no communication of any\n\nof the confidential information by GPS and MM to Ledbury, Optasia and/or Wei Long as there was no\n\nneed to. The GH system was built independently through the expertise of Ledbury, Optasia and Wei\n\nLong.Passing Off70.    Turning now to Stratechs other claim of passing off by\n\nGPS and MM, their case is one of inverse passing off, that is, GPS and MM have passed off the ICPS\n\nas their own system. The law of passing off was considered and dealt with by the local Court of\n\nAppeal in the case ofTessensohn t/a Clea Professional Image Consultants v John Robert Powers\n\nSchool Inc & Ors[1994] 3 SLR 308. After citing with approvalErven Warnick BV v J\n\nTownend & Sons[1979] 2 All ER 927 andReckitt & Colman Products v Borden Inc[1990] 1 All ER 927, it was held that these cases establish that there are three essential elements\n\nto the tort of passing off. The three elements can be summarised as follows:(i) goodwill attached to the plaintiffs goods or services;(ii) a misrepresentation that the plaintiffs goods or services are the\n\n  defendants; and(iii) damage to the plaintiffs goodwill as a result of the misrepresentation71.    The main issue here is whether GPS and/or MM had\n\nmisrepresented the ICPS to be their own. The facts which Stratech are relying on to establish\n\npassing off are the meetings which the hired private investigators, Chong and Gan, had with Martin\n\nChew and Kirk. The meeting with Martin Chew took place on 13 July 2000 at the Guthrie House car\n\npark. Chong had asked Martin Chew some questions while Gan was secretly filming the Guthrie House\n\ncar park system. Gan was not able to give any useful evidence in this area as he was busy filming\n\nand did not hear what Martin Chew had said. In his affidavit, Chong stated that Martin Chew had, on\n\nthat occasion, claimed that GPS installed the same car park system at Guthrie House, Jurong Point\n\nand Craig Place. When Chong was cross-examined on this point, he then clarified that Martin Chew did\n\nnot say that GPS had installed the systems. What was actually said was that the same system was also\n\ninstalled at Jurong Point and Craig Place. Martin Chew admitted that he had said the same system as\n\nGuthrie House had been installed at Jurong Point and Craig Place. However, he claimed that he had\n\nspecifically stated that the Jurong Point had a car park system but it was not done by any of the\n\ncompanies in the Guthrie group. This was denied by Chong.72.    The evidence on this meeting is difficult to assess. It is\n\nessentially one persons word against another and as Chong and Gan were not entirely consistent in\n\ntheir evidence, I am not convinced by their version of the facts. Even if I am to accept that Martin\n\nChew had only said that the same system was installed at Jurong Point and did not clarify that the\n\nsystem was not built by the Guthrie companies, I remain reluctant to find that this amounted to a\n\nmisrepresentation that would constitute passing off. Martin Chew had made it clear that he was not\n\nthe person they should speak to and he was obviously only introducing the system in general terms.\n\nAs such, he may not have been very careful with the use of his words. The \"same system\"\n\ncould have just been a loose term used by Martin Chew to refer to the same type of\n\n\"cashless\" and \"ticketless\" system which made use of OCR technology and payment\n\nby NETS cash cards. It is apparent that on that occasion, Chong and Gan were only making general\n\ninquiries and were not asking for detailed information, such as on the specifications of the system,\n\nwho had designed it and who was the owner of the system. Indeed, there was no evidence that Martin\n\nChew had said that the Guthrie group were the ones who came up with the system at Jurong Point or\n\nthat they were the first to come up with such a system, for such a claim would clearly be a\n\nmisrepresentation.73.    The other incident relied upon is the meeting between Chong\n\nand Gan with Kirk on 14 July 2000, which took place in an office in Guthrie House. A video recording\n\nof the meeting was made and the relevant portions were played and viewed in court. Having watched\n\ncarefully the video recording and heard the statements made by Kirk in the meeting, I am of the view\n\nthat there was also no misrepresentation made by Kirk. I reproduce the relevant extracts of the\n\nrecorded meeting here:[P.I  Private Investigator; K  Kirk]K : This one [i.e. the GH system] is the second generation that you see. The\n\n  first generation is in Jurong Point.K : The first system was installed sometime September last year, it was first\n\n  installed in Jurong Point, the very first system. But the system is no good. We improve over the\n\n  year. We are moving in to upgrade the system, taking away the program and putting in another\n\n  program.P.I : Oh you mean, there are actually competitors also?K : Yes, there are competitors in the market, there some competitors using this\n\n  program but they are not soP.I : But youre the pioneers, actually?K : We are not really the pioneer, ok, we are not really the pioneer. But we\n\n  are more advanced than them because we put in effort and money to push forward. They are not very\n\n  keen because they want to do other thing. They said car parks - peanuts, so they dont want, so\n\n  we push forward.The statements made by Kirk during the meeting must be viewed in their entirety.\n\nKirk had clearly said that the Guthrie group were not the pioneers. The consequence of this is that\n\nthe Guthrie group could not have been responsible for the \"first generation\" of the car\n\npark system which had been installed at Jurong Point. I also noticed that Kirk had been eager to\n\npoint out the differences between Guthries system and the earlier ones by pointing out the\n\ndeficiencies in the previous system. That would have been a highly unlikely approach one would have\n\nadopted when dealing with a product that one was responsible for.74.    Several other instances of alleged misrepresentation by GPS\n\nand MM were also cited by Stratech, but these were all either based on hearsay evidence or were\n\ncompletely unsubstantiated allegations which could not justify a finding of passing off.\n\nAccordingly, I make no findings on these bare assertions.Conclusion75.    On the evidence as a whole and for all the aforesaid\n\nreasons, I find that Stratech are also unable to establish a claim against GPS and MM for passing\n\noff. In the result, Stratechs action against GPS and MM fails and is dismissed with costs.Lai Kew ChaiJudgeCopyright © Government of Singapore."
    }
}