{
    "case_title": "Philips Hong Kong Limited v China Airlines Limited",
    "ncitation": "[2001] SGHC 363",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The number of packages": "10. The convention does not define a package, but there is little doubt over what\n\nmay constitute a package. A receptacle like a box, a carton, or a pallet can be a package. If a\n\nconsignment consists of an item in a box, the box is a package. If a consignment consists of a\n\ncarton holding an item, the carton is a package, and if the consignment is a pallet holding an item,\n\nthe pallet is a package. Differences of opinions arise where these receptacles are combined, e.g.\n\nwhere a consignment is made up of a pallet formed by 5 cartons, each containing 10 boxes. In this\n\nsituation, there cannot, for the purposes of Article 22(2) be at the same time 1 pallet-package, 5\n\ncarton-packages and 50 box-packages.11. This problem arises in all modes of carriage of goods. In carriage by sea the\n\nsame issue has given rise to the views and treatments referred to in Lord Justice Phillips\n\ncomprehensive review of the issues in connection with the Hague Rules inThe \"River Gurara\"[1998] 1 Ll LR 225.12. For the carriage of goods by air coming within the convention, assistance is\n\nprovided by Article 11(2) which states thatThe statements in the air waybill relating tothe weight, dimensions and\n\n  packing of the cargo, as well as those relating tothe number of packages,areprima\n\n  facieevidenceof the facts stated; those relating to the quantity, volume and\n\n  condition of the cargo do not constitute evidence against the carrier except so far as they both\n\n  have been and are stated in the air waybill to have been, checked by him in the presence of the\n\n  consignor, or relate to the apparent condition of the cargo. (Emphasis added)13. This provision gives the parties, especially the consignor who prepares the\n\nair waybill, the discretion to decide how the number of packages for a particular consignment is to\n\nbe reckoned. It is not the consignors sole discretion because the carrier can have a say on it\n\nbefore it accepts the consignment for carriage.14. Once the number of packages is fixed and stated in the air waybill, that isprima\n\nfaciethe number of packages for the purpose of the convention. As long as the number stated is\n\na correct figure, it will apply. In the example used the number of packages could be stated as 1\n\n(for pallets), 5 (for cartons), or 50 (for boxes). Each of them will be the operative number of\n\npackages when it is stated in the waybill. The number stated is not conclusive if it is not correct,\n\ne.g. if it is stated as 3 in the example given, reflecting neither the number of pallets, cartons\n\nnor boxes.15. The defendant submitted that evidence of the 9 cartons can be adduced\n\nalthough it was not stated in the waybill, citingYusen Air & Sea Service (S) Pte Ltd v.\n\nChangi International Airport Services Pte Ltd[1999] 4 SLR 135where the Court of Appeal held\n\nthat the weight on an waybill can be rebutted with proper evidence. That applies to allprima\n\nfacieevidence and reflects the essential character ofprima facieevidence. The question\n\nhere is not whether theprima facieevidence can be rebutted, but whether it is .16. The defendant accepts that the consignment was in a pallet consisting of 9\n\ncartons holding 1,000 transceivers. The number of packages could be taken to be 1, 9 and arguably\n\n1,000 if the transceivers were packed in individual boxes. When it was stated as 1 in the waybill,\n\nit was a proper description. If it was stated as 9, that would also be proper, but it did not\n\nhappen. The defendant is now obliged by Article 11(2) to acknowledge that the number of packages was\n\ncorrectly stated as 1.",
        "Unjust benefit to the plaintiff": "17. Counsel for the defendant placed considerable reliance on the argument that\n\nit is impermissible and unjust to use the full weight of a consignment in quantifying the\n\ncompensation when only a part of the consignment is lost.18. This argument arises from a fallacy. Article 22(2) sets the limit to the\n\ncompensation payable. It says that for lost, damaged or delayed cargo, the compensation shall not\n\nexceed 250 francs per kilogramme of the package or packages concerned. It does not fix the\n\ncompensation at 250 francs per kilogramme of the package or packages lost, damaged or delayed.19. Article 22 does not enable a consignee to recover more than its loss. If a\n\nconsignee suffered a loss of 1,000 francs as a result of the loss, damage or delay of its goods in a\n\nconsignment of 50 kilogrammes, it cannot recover 12,500 francs. The most it can recover is 1,000\n\nfrancs, and less if the compensation is reduced by limitation. This is evident in the present case.\n\nThe value of the lost transceivers is US$74,360. The plaintiff limits its claim to $7,635.32, while\n\nthe defendant contends that it should be limited to $2,974.80. The defendant may argue that the\n\nplaintiffs claim is subject to a lower limitation (if the number of packages is taken as 9), but\n\nit is overstating the case to complain that the claim would result in an unjust benefit to the\n\nplaintiff.20. While dealing with this complaint, it should also be noted that the weight of\n\nconsignment lost, damaged or delayed is not used in the computation under Article 22(2)(b) which\n\nprovides for \"the total weight of the package or packages concerned\" to be taken into\n\nconsideration. Where a package is partially lost, damaged or delayed, the total weight of that\n\npackage is taken into account. If that is unjust, it arises from Article 22(2)(b) itself.21. Counsel for the defendant also argued that thePlaintiffs claim is only for part of the cargo.  (T)hey proceeded under\n\n  Article 22(2)(b). If the Plaintiffs claim is for the whole of the cargo, they would have\n\n  proceeded under Article 22(2)(a). It is submitted that they recognise there is a difference\n\n  between losing the whole cargo and part of the cargo and the 2 situations must be treated\n\n  differently.22. I do not think that it is a correct reading of Article 22(2) that sub-article\n\n(2)(a) applies to claims for total loss and sub-article (2)(b) applies to claims for partial loss.\n\nOn my reading, sub-article (2)(a) sets the monetary limit by weight to claims for total as well as\n\npartial loss, damage or delay. Sub-article (2)(b) sets out the basis on which monetary limit is to\n\nbe computed. It states that for partial damage, loss or delay, the total weight of the package\n\nconcerned is taken into account, but it does not refer to claims arising from total loss, damage or\n\ndelay in which the total weight of the package must apply. Put another way, there is a need to refer\n\nto claims for partial loss, damage or delay to remove any doubt whether the partial or full weight\n\nshould apply, but there is no need to refer to total loss, damage or delay where there is no\n\nuncertainty over that. Like sub-article 2(a), it applies to total and partial loss, damage or delay.23. Counsel for the defendant also citedBland v British Airways Board[1981] 1 Ll LR 289 where Lord Denning in discussing the convention held at page 290Article 22(2)(a) covers the case when thewholeof a persons baggage\n\n  is lost. I need not deal with that. But art.22(2)(b) covers the case when onlypartof the\n\n  baggage is lost. That article says:In the case of loss, damage or delay ofpartof registered baggage \n\n    the amounts to which the carriers liability is limited shall be only the total weight of the\n\n    package or packages concerned. (Emphasis supplied)",
        "So it depends on the weight of the \"package concerned\". Compensation\n\n  depends on the number of kilogrammes you have lost.": "(Emphasis added)24. I humbly repeat my views on the application of Article 22(2). In any event,\n\nthe effect is the same. As the judge pointed out, the limitation to the carriers liability (and\n\nthe consignees entitlement) is set by reference to the weight of the package concerned (not the\n\nweight of the lost, damaged or delayed part of the package) whereas the compensation is measured by\n\nthe weight of the lost, damaged or delayed part thereof. This applies equally to claims for total\n\nand partial loss.25. The plaintiffs full loss is US$74,360. Its claim under Article 22(2) is\n\nfor $7,635.32. The plaintiffs claim was properly made on the basis that the consignment was in\n\none package. There is no unjust benefit in the sense that the compensation sought exceeds the loss\n\nincurred. The plaintiffs appeal was allowed for these reasons.Sgd:Kan Ting ChiuJudgeCopyright © Government of Singapore."
    }
}