{
    "case_title": "Oversea-Chinese Banking Corp Ltd v Chng Sock Lee and Another",
    "ncitation": "[2001] SGHC 306",
    "coram": "Lai Kew Chai J",
    "sections": {
        "The basic facts": "Prior to the Asian financial crisis and the events hereinafter recited, the father was a relatively successful property developer. He carried out his business through a group of companies of which he was the principal shareholder. He was also the directing mind of those companies. The plaintiffs were his principal bankers. Goldenlite, however, was an exception. He did not hold any share in that company and he was not a director. As stated earlier, the defendants were the sole shareholders and directors. It was incorporated on 1 November 1994. In early 1996 its share capital was increased to $300,000 represented by 300,000 shares of $1 each. The defendants held all the shares equally.The father wanted the son, Mr Tan, to help him in his business. The son worked for him in the companies which the father controlled. Goldenlite was incorporated by the father just after the son Mr Tan had completed his National Service.In all, the plaintiffs granted to Goldenlite two sets of banking facilities. The father and both defendants signed the acceptances of those facilities on the stationery of the plaintiffs. The stationery contained the well-known logo of the plaintiffs. The defendants would have known that they were dealing with the plaintiffs. In January 1996 Goldenlite accepted a set of land loan and construction loan banking facilities of $4.3m to develop a pair of two-storey semi-detached houses in a plot of land at Dunbar Walk (`the Dunbar Walk property`). The terms and conditions of the banking facilities were set out in the facility agreement dated 15 February 1996 and entered into between Goldenlite and the plaintiffs. Those facilities were secured by firstly the joint and several guarantees of the defendants and the father and secondly Goldenlite`s mortgage of the Dunbar Walk property to the plaintiffs. In February 1996 two separate letters of guarantee (`the first guarantee`) were signed by both defendants and the father. They signed those documents before an advocate and solicitor, Ms Cynthia Lim Ai Ming, who witnessed their signatures.It should be noted that sub-cll 14(f) and (g) of the facility agreement when drafted had provided for some control over the proceeds of sale of the units when eventually developed out of the Dunbar Walk property if and when they were sold by Goldenlite. This was because Goldenlite was not a housing developer subject to the Housing Developers (Control and Licensing) Act (Cap 130). They had expressly required firstly that the agreements of sale of the Dunbar Walk property when sold by Goldenlite had to be in the form as prescribed under the Housing Developers Rules 1985 and secondly under those prescribed forms Goldenlite would have been required to deposit the sale proceeds into a project account from which Goldenlite`s withdrawals would have been controlled and subjected, among other things, to the plaintiffs being progressively repaid in exchange for the plaintiffs` releases pro tanto in favour of the purchasers of units from Goldenlite. At the request of Goldenlite those prudential sub-clauses were deleted. The position of any purchaser of those units from Goldenlite, and indirectly the exposure of guarantors of Goldenlite in respect of its liabilities to its bankers, therefore reverted to the common law position where purchasers had to ensure pro tanto discharges of the plaintiffs` mortgages and Goldenlite`s payment of proceeds of sale in reduction of the liabilities.Goldenlite obtained from the plaintiffs the second set of banking facilities on 27 December 1996 in the sum of $6,750,000 to purchase and also to develop a pair of two-storey semi-detached houses on a piece of land at Roseburn Avenue, Singapore (`the Roseburn Avenue property`). These facilities were to be secured by a mortgage over the property and by the joint and several guarantee by the father and the defendants for the aggregate sum of $10,550,000. This aggregate sum included the outstanding sums under the Dunbar Walk property facility.On 7 January 1997 the guarantee was signed by the father and by both defendants. Their signatures were witnessed by Maureen Ann Mei Lian (PW1),  an advocate and solicitor, hereinafer called `Ms Maureen`). Ms Maureen was extensively cross-examined. The cross-examination was broadly to determine the extent of her knowledge, if any, of any undue influence which the father was exerting on both defendants at the time when they signed the guarantee so that her knowledge would be that of the bank. The bank officers of the plaintiffs had dealt only with the father and did not have any direct contact with either defendant. Secondly, the questions were directed to ascertain the nature and scope of each and every unusual circumstance which the defendants could conceivably contend should have been disclosed by the plaintiffs as a matter of their duty. Although a contract of guarantee is not one where both parties must act with utmost good faith, and therefore duty bound to disclose for instance all material facts, there is however a duty not to misrepresent by suppression of a falsehood in order to suggest that a particular factual issue in question is in fact the truth. In other words one must not suppress the truth in order to suggest a falsehood, ie suppressio veri suggestio falsi. Our common law accepts the principle which requires a beneficiary of the guarantee (usually a bank) to disclose to the proposed surety `unusual features` relating to its transaction with its principal obligor: seeHabibullah Mohamed Yousuff v Indian Bank[1999] 3 SLR 650where the Court of Appeal must have intended to set forth that proposition in [para ]27 of its judgment.In relation to the question of special circumstances, I should set out the facts which in my view were indisputable. The pair of semi-detached houses, marked privately as Plot 1 and Plot 2, Dunbar Walk property were both sold by Goldenlite by June 1996. Not all the progress payments made by purchasers were banked into Goldenlite`s current account with the plaintiffs. Some progress payments were in fact paid into the current account maintained with the plaintiffs but the plaintiffs were not informed by the father, the defendants or, surprisingly, the purchasers or the solicitors of the purchasers. As a result, the overdraft limit of the banking facilities was not reduced. Goldenlite withdrew part of these sums from the account for its own purposes. That the plaintiffs did not know was perfectly credible: they could not be expected, absent any special arrangement, to monitor each payment in by Goldenlite when they handled numerous such transactions daily. Secondly, in the ordinary way purchasers of the developed units, or their solicitors, were expected to notify the plaintiffs of each progress payment and require a pro tanto partial discharge of the plaintiffs` mortgage on the property concerned. The plaintiffs, in my judgment, had no knowledge of those payments.Up to the signing of the guarantee on 7 January 1997 the total amount of the progress payments of the two units in the Dunbar Walk property was $3,023,000. Of this amount, only two sums of $295,000 and $321,000 were earmarked by the plaintiffs for the reduction of the overdraft facilities. They did so because they were duly notified. The limit of the overdraft facility was accordingly reduced. The other progress payments were banked in over the counter and credited in the ordinary course of operating the overdraft account.",
        "Issues of fact": "(1)UNDUE INFLUENCE, PLAINTIFFS` IMPUTED NOTICE AND MANIFEST DISADVANTAGEAs noted earlier, the defendants in seeking to set aside the guarantee are relying on the imputed knowledge of the plaintiffs that the father had by undue influence procured the defendants to sign the guarantee. The basis for invalidating the rights of the plaintiffs under the guarantee is the plaintiffs` notice. As stated by the Court of Appeal inRoyal Bank of Scotland plc v Etridge (No 2)[1998] 4 All ER 705at 717: `... a person who has been induced to enter into a transaction by undue influence, misrepresentation or some other vitiating factor has an equity to have the transaction set aside, and the equity is enforceable against third parties, including third parties who have given value, with notice, actual constructive or imputed, of the equity: seeBainbridge v Browne[1881] 18 Ch D 188`.In this part of the action, three issues of facts therefore arise for consideration, viz (1) Did the father unduly influence them? (2) Did the plaintiffs know of the relationship between the father and the defendants giving rise to a presumption of undue influence? and (3) Was the signing of the guarantee by the defendants manifestly disadvantageous to the defendants? If the answer to the first question is in the negative, it will not be necessary strictly to consider the next two questions.The defendants and the father gave evidence on these three issues. Both Mdm Chng and Mr Tan gave evidence that the father was of ungovernable temper. Occasionally, he was violent to his wife, Mdm Chng. Mr Tan was verbally abused in a cruel and unusual manner. The son suffered so much that he even inflicted pain on himself by cigarette burns in order to forget about the pain, mostly mental, inflicted upon him by his own father. It was, frankly, heart-rending to hear evidence on the exceptional harshness of the father. I believed Mdm Chng and Mr Tan and accepted their evidence that the father was exceptionally strict, cruel and harsh; that they were fearful of him. But I must, in order to keep a balanced perspective of the evidence, also bear in mind the clear distinction between familial relationships on the one hand and relationships in family business on the other. I have to recognise and point out the commercial context involving the incorporation of Goldenlite, the ownership of the company by both Mdm Chng and Mr Tan exclusively, and the undisputed wishes of the father to train his son, Mr Tan, to take up the same line of business with a view that Mr Tan succeeds the father in the family business. Admittedly, Mr Tan was 23 years old and was put through the paces by the father; he had to assist the father in several housing developments which the father was engaged in. He was paid only $1,800 per month. I accept his evidence that he had worked extremely hard on his father`s projects, in addition to the projects at Dunbar Walk and Roseburn Avenue. It is most unfortunate that his family business succumbed to the Asian financial crisis. But I am glad that he has since graduated from Curtin University; one can only hope that his bankruptcy status will be lifted as soon as possible.I am of the view and I find that the father had not exerted any undue influence on either of the defendants. Both of them knew that they were signing the  guarantee for their own company. It was a family enterprise. I have no doubt that they were expecting to make a handsome profit out of the two projects. There was no rhyme or reason why the father should have wanted to exploit them or victimise them. On the contrary, the father was exerting himself to promote the interest of the family and of the son, Mr Tan. The transaction took place six months before the Asian financial crisis and the property development market was on the upbeat. But the defendants and the father in evidence tried to persuade me that the father victimised them and gave them no choice but to sign the guarantee. The defendants and the father all confirmed that on the way to the solicitor`s office the father had firmly told them to sign the guarantee without asking too many questions. All three told the court that they were present when the defendants signed the guarantee.I accept the evidence of Ms Maureen, the solicitor of the plaintiffs and Goldenlite in the mortgage. She did not have any inkling that the father gave them no choice but to sign the guarantee. She did not witness any pressure. The transaction had no unusual feature. She knew very well and had enjoyed a long professional relationship with the father. She first met him in 1993 or a year later. She also knew the father`s secretary, Cindy Ng, who gave evidence on behalf of the defendants. Ms Maureen had acted for the father in 23 to 25 property transactions. Significantly, she was of the view that the father did not strike her as having an extremely dominating personality. She said Mdm Chng had asked some questions about the amounts of the guarantee and the properties. Mdm Chng, however, did not bother herself with the accounts which she, naturally, left to her husband. As for Mr Tan, Ms Maureen was under the clear impression that he was being groomed to take over the father`s business. He was learning the construction business. Mr Tan in evidence described himself as given menial tasks to perform. That was true but he was given the exposure and was closely supervised by the father in the business. In the process, he was working very hard. He told her that his lunchtime could not take too long. In connection with the guarantee in question, she told me that she did not advise them about taking independent legal advice because that question had been raised previously. Her concern was to ensure that the defendants understood that they were not signing any company document but a bank guarantee in which their personal liability could exceed the limit of $10.55m.Ms Maureen was tested by counsel as to her ability to converse with Mdm Chng, as she had testified. She was asked to repeat what she said in Mandarin to Mdm Chng. I recorded the English interpretation of the conversion in Mandarin as follows: `You are going to sign this document as a guarantor. The contents of this document are regarding the loan which Goldenlite Development Pte Ltd is going to take up. After signing this document you are liable to pay the loan owed by GDPL and the bank can look for you to pay this debt. Let me show you this figure: $10.55m. Is the amount correct? Most importantly, you have to remember that you are signing this document in your personal capacity. This is not a document of the company. If the bank presses for payment, it may affect your own properties. If it is alright, you may append your signature.` Accordingly, I find that Ms Maureen did not know of any undue influence or of any circumstance which ought to have alerted her. Since she was the only person through whom the  defendants could impute knowledge to the plaintiffs, it follows that the plaintiffs could not be affected by any constructive notice.I turn to the question whether the signing of the guarantee was manifestly disadvantageous to the defendants. The short answer is, for the reasons already stated, there was clearly no disadvantage to them. There were the usual risks inherent in the commercial venture, just like any other, but they were not exploited or victimised by any manifest disadvantage.",
        "(2)FAILURE TO DISCLOSE UNUSUAL FEATURES": "Under this defence, three unusual features were said to have existed prior to or at the time when the guarantee was signed. The guarantee was in addition to the all moneys overdraft mortgage in respect of the Dunbar Walk and Roseburn Avenue properties. The defendants say that the plaintiffs knew that the pair of semi-detached were sold and they failed to disclose to the defendants. They say that the plaintiffs knew or ought to have known that there were progress payments which ought to have been earmarked to reduce the limit of the overdraft. But the fact of the matter was that the defendants themselves had signed the respective sale and purchase agreements on behalf of the company. They assert, however, that they were mere puppets and did not know about the affairs of Goldenlite. Their mere assertions are not sufficient proof of their claims that they did not know what was happening. I accept that the father was making all the commercial decisions but the defendants went along. Goldenlite was a separate entity and the defendants had acted as directors and had signed all the statutory documents. I noted the allegation that the father never discussed anything about the affairs of Goldenlite; literally, there was not a whimper. There was no reference to any happy family discussion when each of the two properties was acquired. According to them, they did not discuss the prospects of profit. Nor was any evidence led as to the circumstances under which the two sales agreement were signed by the defendants on behalf of Goldenlite. I am of the view that I was not told anything what would naturally have been said over mealtimes or at home.There was a suggestion by the father that the defendants were made shareholders and directors of Goldenlite at the request of the plaintiffs. He said that Ms Mary Leong, the branch manager who had dealt with the father, had told him that the plaintiffs could not extend any more credit to the father`s group of companies. The plaintiffs` limit would have been exceeded. This was nothing more than a suggestion. It has to be noted that the father was initiating his son, Mr Tan, into his business with the view of the son succeeding him. Mr Tan`s hands-on involvement in the business was known to his mother, Mdm Chng, who undoubtedly was pleased though she felt that he had been overworked by the father with meagre rewards. The whole venture failed because the father had used the funds of Goldenlite for his other ventures which failed because of the fall in the property market. The defendants had allowed him to do what he liked, trusting in his business acumen as they had done all along. They undoubtedly hoped to enjoy the benefits of his success and hardly worried over any downside burdens. In the circumstances, I could not accept the allegation that the defendants were mere puppets of the father.As noted earlier, the plaintiffs did not know that the progress payments, except for those earmarked, had been banked in. They could not be expected to disclose any unusual feature if they themselves were ignorant of them. The plaintiffs certainly did not turn a blind eye to what was happening. They had expected their attention to be drawn in relation to the banking in of any progress payments, either by Goldenlite or by the purchasers or both of them, and they would have, as they did in the two payments, earmarked them and reduced the overdraft limit accordingly. As it was an all moneys overdraft, and so long as the mortgages were in place, there was no reason why the plaintiffs would have wanted to suppress anything. There was nothing untoward to suppress.",
        "(3)VARIATION OF THE PRINCIPAL CONTRACT": "Under this ground the defendants rely on the alleged breaches of the plaintiffs for failing to set up a project account, failing to earmark the progress payments and reduce the limits of the overdraft facilities when each progress payment was banked into Goldenlite`s account. The facility agreement envisaged the disbursements of the loans for the purposes specified, after which the account was operated as an overdraft facility. It was beyond dispute that Goldenlite could operate the account so long as each withdrawal would still fall within the limit. It was not for the plaintiffs to check the purpose of each withdrawal was within the limit and in accordance with the proper mandate. There was an allegation that the father had been allowed to exceed the limit on occasions. Ms Mary Leong was recalled and she said she did not authorise it. Head Office approval had to be obtained and she did not apply for any such approval. In my judgment, the defendants also failed to discharge the guarantee under this ground.",
        "(4)UNAUTHORISED WITHDRAWALS": "By para 7 of the amended defence, the defendants averred that the plaintiffs had allowed Goldenlite and the father to withdraw moneys from the account which were for purposes other than those stated in the letters of offer dated 18 January 1996 and 27 December 1996 or which were without proper signatories. In relation to the first complaint, it is clear that this became an overdraft account for the initial disbursements for the purposes specified and thereafter there were no restrictions to any withdrawal so long as it was within the limit. However, in relation to withdrawals with only the sole signature of the father, which was insufficient, there were four instances involving the sum of $84,441. In my judgment, that sum and any interest calculated on them should be deducted from the claims.There will be judgment accordingly for the plaintiffs with costs.Outcome:Claim allowed.Copyright © Government of Singapore."
    }
}