{
    "case_title": "Kay Swee Tuan v Chia Shih Ching James",
    "ncitation": "[2001] SGHC 117",
    "coram": "Lai Kew Chai J",
    "sections": {
        "Background": "2 They were married in 1983 and have two sons who are in their early teens. The\n\ndecree nisi to dissolve their marriage was based on their respective unreasonable behaviour to the\n\nother such that the marriage could not continue. By consent, Kay was granted custody, care and\n\ncontrol of the two sons with reasonable access to Chia. Chia agreed to pay $2,500 per month\n\nmaintenance for the sons.3 One of the matrimonial assets in issue before the district judge was the\n\nmatrimonial home known as 5 Tanglin Hill, Singapore (\"the house\"). It was held in their\n\njoint names. Before the district judge, it was estimated that the house was worth between $8m and\n\n$9.6m. But it was encumbered by a mortgage loan granted by the Overseas Chinese Banking Corporation\n\nLtd (\"OCBC\") and the loan was then about and taken to be $5.5m. The district judge decided\n\nthat Chia was entitled to 50% of the value of the house free from encumbrances. As the house was\n\nencumbered by the substantial mortgage loan which was in excess of the estimated share of Kay, she\n\nwas ordered to pay Chia the difference between the mortgage loan from OCBC and 50% of the value of\n\nthe house. A firm of valuers was appointed by the district judge and the valuers were ordered to\n\nfurnish a valuation of the house on an open market price basis as at 9 September 2000. Kay had to\n\npay Chia within 9 months from the date of the valuation report together with interest as stipulated.4 In relation to the other matrimonial assets, which were held in their\n\nrespective names, they were allowed to keep them beneficially.5 Both parties filed extensive affidavits. Almost every issue of fact, however\n\nmarginal in its relevance, was contested in relation to the division of the matrimonial assets. It\n\nis beyond dispute that the district judge had considered in great detail every issue of fact of any\n\nmaterial significance. In addition, she had to draw some adverse inferences against Kay. I shall\n\nreturn to these later in this judgment. By way of a preface, it is helpful to note two points.\n\nFirst, Kay and Chia were partners in a law firm known as S.T. Kay & Company from 1985 to 1998.\n\nUntil the firms dissolution in June 1998 Chia managed the law firm solely whilst Kay spent a\n\nmajor part of her time pursuing commercial opportunities. I agree entirely with the district judge\n\nthat she had invested and pursued every commercial opportunity for the benefit of the marriage and\n\nthe children. This was a central finding of fact supported by ample evidence. If the investments had\n\nbeen successful, the wealth accumulated would have become matrimonial assets held for the benefit of\n\nthe marriage and family. On the other hand, if losses were incurred the burdens and liabilities had\n\nto be shared by the couple. Secondly, on the evidence, I also agree with the district judge that\n\nChia was meticulous and careful in the management of the financial resources or the undertaking of\n\ncommitments to the banks. He held the cheque books and knew of the issue of the cheques, many of\n\nwhich he had signed himself as the authorized signatory. It would not be open to him to assert that\n\nhe was not aware of Kays commercial ventures. In fact, I had no doubt that he knew of them\n\nintimately and approved every one of those investments. Kay had also operated the investments of her\n\nmother, siblings and the estate of her late father. Those were kept quite separate. Undoubtedly,\n\nChia knew what assets and ventures were those undertaken by them as husband and wife and those which\n\nKay conducted on behalf of her mother and siblings.6 From 1986 to 1993 Kay was the Executive Director of Insas Berhad (\"Insas\"),\n\na company listed in Kuala Lumpur Stock Exchange. Kay has 189,150 shares and is a director from 1986\n\ntill today. She also owns 1 million shares and is a director of an company known as Isedecor Sdn\n\nBerhad (\"Isedecor\") from May 1995 till today. From 1986 Kay has been owning shares in\n\nSketchley Services Pte Ltd (\"Sketchley\"), Landmark Realty & Investment Pte Ltd\n\n(\"Landmark\") and Laundry land, which is owned by Sketchley, and Master Penguins\n\nDrycleaning & Laundry Pte Ltd (\"Master Penguin\"). She has been a director of these\n\nthree companies and held 99,000 shares in the first two named companies and 399,999 shares in Master\n\nPenguin. In addition to these shareholdings and interest, she has been owning shares in the\n\nMalaysian companies of Premtec Sdn Bhd and Premtec Marine Environmental Sdn Bhd in each of which she\n\nholds 80,000 shares.7 Kay filed her affidavit of means and supplementary affidavit of means. As Chia\n\nalleged that there was non-disclosure of all her assets, he applied for and obtained an order in\n\nJune 1999 to produce 26 items of documents. Although Kay had produced 15 items of the documents, she\n\nhad not produce her bank statements maintained with the Kuala Lumpur Citibank (Citigold Priority\n\nBanking) from 1 January 1990 for the ensuing period of 9 years. Kay instead had disclosed a single\n\nstatement of bank account showing the deposit of RM10,126.67. Chia made the specific allegation that\n\nhe had seen Kays August 1996 bank statement which showed deposits of two substantial sums of RM$8\n\nmillion and US$4.5 million. Chia further alleged that those deposits were part of the RM$20 milion\n\nwhich Kay had earned in assisting one Datuk Thong of Malaysia in acquirisng majority control of\n\nInsas in 1993. That acquisition involved the injection of Shahzen Tower into Insas in consideration\n\nof the issue of shares in Insas.",
        "Findings of the district judge": "8 Chia further alleged that since 1993 Kay was involved in the sale and purchase\n\nof substantial quantities of shares. The district judge considered the evidence led by both sides.\n\nBy para 109 of her Grounds of Decision she summarized the assets of the parties. She made the\n\nfollowing decisions. We have mentioned the house, its value and the OCBC liabilities. There was a\n\nflat in Sommerville. 19% of it came from their joint funds and Kay should pay Chia $164,902. With\n\nregard to the Isedecor shares, the district judge could not put down a value to them, although Chia\n\nalleged that they were worth $1.79 million. Regarding the Insas shares, the value was $69,039. The\n\ndistrict judge concluded that 2.441 million Insas shares were not owned by Kay. Turning to the 3.5\n\nmillion Insas shares, for the purchase of which funds were withdrawn from the OCBC joint account,\n\nthe district judge imputed the sum of $3.673 million as they were not accounted for. As for the sale\n\nof the other Insas shares, particulars were earlier set out in the grounds of decision of the\n\ndistrict judge, the district judge imputed the profit of $6.733 million earned by Kay. These deals\n\nwere due to the sole effort of Kay. The district judge valued the shares in Technology Resources as\n\nworth $30,000. According to the district judge, they were acquired by the sole effort of Kay. The\n\nPremtex Marine shares and Premtex shares were valued at RM80,000 and RM800 respectively. The cash of\n\nUS137,800 was also identified as part of the matrimonial assets. Kay had accounts in Citibank but\n\nthe deposit or deposits were unknown to Kay. Among the assets was the small sum of $6,599 deposited\n\nunder the Industrial & Commercial Bank account. Chia had 4,000 pounds in his account in London\n\nMidland Bank. His CPF monies stood at $120,969 and those of Kay stood at 26,021. Other assets such\n\nas vehicles, SICC membership valued at $139,000 before transfer fee were also identified as part of\n\nthe matrimonial assets.9 The district judge was convinced that Kay had not fully disclosed her assets.\n\nShe found the absence of bank statements from the Citibank (Malaysia) and Citibank (Singapore)\n\naccounts \"glaring\". She further found that her transfers of the shares in Master Penguin\n\nand Sketchley were suspicious. Kay did not fully persuade the district judge that some of the assets\n\nwere held by her on trust for her family members. There were no supporting documentary evidence and\n\nthere was no evidence of the source of funds coming from Kays siblings or mother or her late\n\nfathers estate. On the other hand, the district judge also made the observation, quite properly\n\non the state of the evidence before her, that while she was \"invited to draw adverse inference\n\nagainst her, even Chias counsel was not able to assist (her) as to the amount of assets (she)\n\nshould find her to have failed to disclose.\" Contrary to the submissions of Chias counsel,\n\nthe district judge concluded that the loans between Kay and Chia were to be taken into account as\n\nforming the matrimonial assets. This was no longer a live issue when the appeal came before me.10 A major issue before the district judge was the question as to who was\n\nresponsible for the mortgage loan (inclusive of the accumulated substantial interest) in the OCBC\n\nloan mortgage account. It was undisputed that Kay had withdrawn \"at least $4.49 million\"\n\nand that \"the bulk of the withdrawals from the OCBC account started after January 1994. Prior\n\nto that month, Kay had withdrawn moneys from the account but had always paid back the withdrawals\n\nand the interest. But the district judge went on to find that the withdrawal was for investment for\n\nthe joint benefit of the couple. By the same token, whatever Kay had earned, whether shown or\n\nimputed by the district judge, was also to be shared between Kay and Chia since they were\n\nmatrimonial assets.11 I now turn to the profits \"imputed\" by the district judge. I should\n\nquote in extenso paras 116 and 117 of Grounds of Decision.\"116 In respect of the imputed profits, it was pertinent to note that they\n\n  related to profits made around 1993 and latest in 1995. I believed that in 1993 or 1994, when Kay\n\n  was involved in the restructuring of Insas, she earned quite a lot of money from buying and\n\n  selling Insas shares and her Citibank accounts probably had huge deposits. But I did not accept\n\n  Chias allegation that she earned RM20 million from Datuk Thong as thee was no evidence to\n\n  support the allegation. Kay however started to invest in Isedecor in 1994. I believed her that the\n\n  project (involving the recycling sludge to extract Bitumen for road making) made tremendous\n\n  losses. It was not disputed that the permit to operate the plant was never obtained and that\n\n  substantial funds had been dumped into the projct. I also accepted that none of her other business\n\n  ventures had done well after 1996. (words within brackets added by me).117. Apart form the share in the bungalow at 5 Tanglin Hill, her known assets\n\n  came to about $1.6 million. There were imputed Insas share profit of $6.733 million earned by\n\n  herself and $3.673 million earned from funds in the joint account (i.e. the OCBC account) 1993 to\n\n  1995. There were other assets of unknown value. I concluded that she would have total assets known\n\n  or undisclosed, amounting to $4 to $5 million altogether at the time of the hearing. This was a\n\n  figure, admittedly, arrived at to the best of my estimation. There was simply no sufficient\n\n  information given during proceedings. (words within brackets were again added by me.)\"12 On the first day when the appeal before me came on, I had to decide on a\n\nmotion each filed by Chia and Kay. Chia wanted to adduce new evidence that in July 1999 Kay had on\n\nthe face of the purchase documents in respect of an apartment in the Arcadia paid $640,000. If this\n\nwas un-rebutted and true, then the new evidence would go some way to show that Kay was not as\n\ninsolvent as she wanted to make herself out to be.13 Kay on the other hand wanted to introduce evidence of the bank statements of\n\nCitibank (Malaysia). They were obtained late, and not in time to be placed before the district\n\njudge. Finally, Kay secured copies of them after the intervention of her friend in Kuala Lumpur who\n\nprevailed over Citibak (Malaysia). Their admission would cast great light on a number of issues in\n\nrespect of which the district judge had ruled against Kay. Counsel for Kay refer to the 3.5 million\n\nInsas shares. The district judge accepted Chias allegation that they were sold between 1993 and\n\n19995 for $5.25 million. Accordingly the district judge imputed a profit of $3.67 million. Kay had\n\nbefore the district judge relied on the statement of a stockbroker, one Mr Peter Leow which the\n\ndistrict judge rejected because there were no bank statements to corroborate Leows statement. The\n\nentries in the bank statements at the relevant time showed that Kay had banked into the Citibank\n\n(Malaysia) account the proceeds of sale from those Insas shares. Secondly, counsel for Kay\n\nemphasized that the bank statements obtained from Citibank (Malaysia) would disprove the district\n\njudges imputation that she had made a profit of $6.733 million. There were no entries of any\n\ndeposit at the material times.14 The applications were both made under Order 55D r 3(1) of the Rules of Court.\n\nThe sub-rule provides that an appeal to the High Court from the Subordinate Courts \"shall be by\n\nway of rehearing\". So far as the admission of further evidence on questions of fact, Order\n\n55D r 11(1) provides that in the case of an appeal from a judgment after trial or hearing of any\n\ncause or matter on the merits, no such further evidence (other than evidence as to matters which\n\nhave occurred after the date of trial or hearing) shall be admitted except on special grounds\".\n\nI relied on the decisions of the Court of Appeal inThe Nikko Merchant bank (Singapore) Ltd v\n\nSyamsui Bachri(1989) CA No. 17 of 1989 C.A. (unreported) andLian Soon Construction Pte ltd\n\nv Guan Qian Realty Pte LtdC.A. No. 269 of 198 (unreported) where it was ruled in the former and\n\naffirmed in the latter (albeit obiter) that \"(to) justify reception the reception of fresh\n\nevidence or a new trial, three conditions must be fulfilled; first, it must be shown that the\n\nevidence could not have been obtained with reasonable diligence for use at the trial; secondly, the\n\nevidence must be such that, if given, it would probably have an important influence on the result of\n\nthe case, though it need not be decisive; thirdly, the evidence must be such as is presumably to be\n\nbelieved, or in other words, it must be apparently credible, though it need not be\n\nincontrovertible.\" They reiterated the test inLadd v Marshall[1954] 3 All E.R. 745. In\n\nthe applications before me to adduce new evidence, however, I also bore in mind the fact that though\n\nthe merits of the case had been considered in detail by the district judge, and that no new evidence\n\ncould be adduced except after complying with the three-fold test, the payment of $640,000 had arisen\n\nsince the hearing before the district judge. As for the bank statements of Citibank (Malaysia), Kay\n\nhad great difficulties in obtaining them until recently. Admittedly, the receipt of her payment for\n\nthe microfils was dated April 2000, that piece of evidence was an error and I was persuaded that Kays\n\nsolicitors had written to Citibank (Malaysia) and had not elicited a response. In the circumstances,\n\nI admitted the new evidence which Chia and Kay sought to adduce.",
        "Grounds of Appeal": "15 Chia raised the first issue whether the district judge had erred in holding\n\nthat the overdraft in the OCBC account was caused by Kays withdrawals in 1994 for her investments\n\nin Isedecor. This ground of appeal, to my mind, had no merit whatsoever. In his affidavit of means\n\nfiled as early as 9 March 1999 Chia affirmed that Kay had \"withdrawn from the OCBC account a\n\ntotal of sum of $6,321,586 out of which $4.941,570.50 as at 28 Feb 99 is from the OCBC overdraft.The\n\n$4,941,570.50 ws for the Respondents (i.e. Kays) personal investment in a Johore project\n\n(referring to the Isedecor project).\"(Emphasis and words within brackets are added by me).\n\nBy his affidavit of 1 December 1999, Chia repeated the effect of this piece of evidence. In my\n\njudgment, this argument of Chia must be given short shrift. He is changing his position in view of\n\nthe fact that the investment in Isedecor has failed and is not, on the evidence, worth anything.16 The district judge found that the proceeds of sale of the Insas shares\n\namounted to $10.35 million as at the end of 1995 but the court also found that Kay had lost the said\n\nsum in her investments in the Isedecor Johore project and in her other businesses after 1995. Both\n\nChia and Kay try to re-open their submissions, ignoring the evidence against their respective\n\npositions. Chia contended that Kay did not lose this sum of money. Kay, on the other hand, claimed\n\nthat the shares belonged to her mother, the estate of her late father and siblings or to other\n\nparties. The findings of the district judge set out in paras 116 and 117 were and are, in my view,\n\nunassailable. There is ample evidence, which the district judge had recited in extenso earlier in\n\nthe Grounds of Decision and I see no virtue in repeating them except to adopt them for present\n\npurposes. In the absence of cross examination, the district judge had to evaluate the intrinsic\n\nprobabilities of the cae and she made the findings she did based on the evidence. The district judge\n\nfound that between 1993 and 1995 Kay sold about 8 million Insas shares and the sale proceeds were\n\nabout $11.9 million. After the payment of $1.58 million into the OCBC account the district judge\n\nheld that the balance of $10.35 million were matrimonial assets. But the district judge, as noted\n\nearlier, went on to hold, as she was entitled to on the evidence, to infer that Kay had \"dumped\n\nsubstantial funds\" into Isedecor. Kay, on the other hand, pointed to the fact that the bult of\n\n3.5 million Insas shares were sold between 8 April and 18 May 1993. Kay submitted that the new\n\nevidence from the statements of Citibank (Malaysia) confirmed her version. She referred to the\n\nfinding of the district judge that the sale of the Insas shares to Dasarmas Sdn Hd was not aborted.\n\nBut the district judge noted that Kay did not provide any documentary prof to support her\n\nallegation; one would have expected some reliable contemporaneous documents to prove that there was\n\nno closing of the deal. Although Kay managed to produce the bank statements from Citibank, I was\n\nbaffled by the fact that she was invoiced a year earlier for the provision of the microfilms. I was\n\nuncomfortable in relying on her statements from the Citibank. I was not at all sure that the account\n\nwas the only account which Kay had maintained. There could have been other accounts where the\n\nimputed profits were banked. Kay had been so reluctant to furnish the documentary trail and I am\n\ncompelled to share the district judges inclination to infer against her by reason of her lack of\n\ncandour. If our inferences had exceeded what she had actually profited she had herself to blame. She\n\nwas the best and only person in the world who could come clean with the contemporaneous records to\n\nprove what money was made and where they went. She is not permitted to use the convenient excuse\n\nthat profitable ventures belonged to her siblings or her side of the family interest.17 The district judge also found that Kay had lost in her other ventures. There\n\nwere, in my view, ample evidence which were credible following the Asian crisis which began in June\n\n1997.18 I would refer to the new evidence about Kays financial means in paying for\n\nthe Arcadia flat. She was on the affidavit evidence of independent parties acting as the solicitor\n\nand the money came from her client. It was not her money. The new evidence was of no assistance to\n\nChia.19 Both Chia and Kay had submitted to me their respective lists of the\n\nmatrimonial assets, how they should be divided and Chia set out his reasons. Their lists are annexed\n\nhereto and marked Annexures A and B respectively. I am unable to accept either of them. I saw no\n\nreason to disturb the findings and inferences drawn by the district judge and I would myself adopt\n\nher own chart and the reasons given by her.. I therefore dismissed the two appeals with no order as\n\nto costs.",
        "Lai Kew Chai": "JudgeCopyright © Government of Singapore."
    }
}