{
    "case_title": "Overseas Union Insurance Ltd v Turegum Insurance Co",
    "ncitation": "[2001] SGHC 147",
    "coram": "Judith Prakash J",
    "sections": {
        "The telephone conversation and subsequent events": "39. The next development was the telephone conversation between Mr Yeo and Mr Johnson.\n\nAt the beginning of that conversation there was, as I have found, no offer on the table\n\nfrom Turegum. Thus, Mr Johnson’s evidence that he offered to commute at US$220,000 is\n\nevidence of a new offer put forward orally by Turegum at that time. The issue here is\n\nwhether that new offer was withdrawn during the course of the conversation, as Mr Johnson\n\naverred, or whether it remained open thereafter, which was Mr Yeo’s position.40. Before dealing with the contents of the conversation, I must deal with the\n\nsubmission of OUI that the evidence given by Turegum’s witnesses as to the withdrawal\n\nof the offer on 26 August cannot be admitted because it was not pleaded. In the defence,\n\nthe date of the telephone conversation and consequently of the withdrawal was stated to be\n\n5 September 1999. This date was not a source of dispute. OUI accepted that there was a\n\nconversation between Mr Yeo and Mr Johnson and, in its reply and defence to counterclaim,\n\nalso referred to this conversation as having taken place in September 1999. When, in the\n\ncourse of trial, Mr Johnson retrieved an e-mail message that he had sent to his superiors\n\non 26 August 1999 referring to the conversation with Mr Yeo, and therefore adjusted the\n\ndate of the conversation, OUI did not put forward any other evidence of its own to suggest\n\nthat the adjustment of the date was incorrect. Nor did it suggest that there had been more\n\nthan one conversation between the parties during that period. As far as I am concerned,\n\nthe exact date of the conversation is not material since it was not in dispute and whether\n\nit took place in August or September it occurred prior to the important events of October\n\n1999. What was material and what was clearly in issue by reason of the pleadings was what\n\nhappened during the conversation. I must therefore reject the submission as to the\n\ninadmissibility of the evidence on this latter issue simply because the pleaded date was 5\n\nSeptember 1999 and not 26 August 1999.41. Mr Yeo’s affidavit evidence was that during the telephone conversation Mr\n\nJohnson had reiterated that Turegum’s offer to accept US$220,000 was reasonable and\n\nhe urged Mr Yeo to consider it seriously and to accept it to achieve a commutation.\n\nOtherwise, he might have to commence recovery proceedings. Mr Yeo stated that far from\n\nwithdrawing the offer, Turegum had expressly maintained it. Under cross-examination, Mr\n\nYeo said that during the conversation he had repeated OUI’s offer of US$160,000 and\n\nasked Mr Johnson to reduce Turegum’s figure. Mr Johnson had responded by stating that\n\nhe would refer the matter to his board of directors. Mr Yeo agreed that this fact had not\n\nbeen mentioned in his affidavit.42. Counsel for Turegum made much of the fact that Mr Yeo had stated in court, for the\n\nfirst time, that Mr Johnson had agreed to refer the matter to his directors. Counsel\n\nsubmitted that it was odd that Mr Yeo had mentioned that OUI remained hopeful that Turegum\n\nwould relent and reduce its offer but omitted evidence as to the reason as to why it was\n\nhopeful ie that it was hopeful because Mr Johnson had said that he would talk to his board\n\nabout reduction of Turegum’s offer. Counsel further submitted that since it was\n\nOUI’s case that Turegum’s offer to commute at US$220,000 subsisted all the way\n\nfrom March 1999 to October 1999, if Mr Johnson had indeed said in August 1999 that he\n\nwould refer to the board about reducing this offer, this evidence would have been included\n\nin Mr Yeo’s affidavit. These are valid points and it may be that Mr Yeo was, by\n\nmentioning the reference to a board meeting, trying to embellish his evidence. That does\n\nnot, however, make all of Mr Yeo’s evidence on the contents of the conversation\n\nuntrue.43. On the other hand, there is also some doubt about the evidence by Mr Johnson in\n\nthat having, in a last ditch attempt to settle the matter, renewed the US$220,000 offer\n\nover the telephone, he had then withdrawn it when Mr Yeo stuck to his original\n\ncounter-offer of US$160,000. What was interesting here was that in his first affidavit, at\n\nthe time when Mr Johnson placed the conversation in September, he had stated that by\n\nSeptember he had obtained certain information which convinced him that OUI had misled\n\nTuregum about its financial status. Mr Johnson said that armed with this knowledge, he was\n\ndetermined to recover all outstanding debts from OUI. He was angry that Turegum had been\n\nmisled and had nearly entered a commutation that would not have been to its benefit. The\n\nnegotiations from then on were aimed at getting all Turegum’s money back, and\n\ncertainly not at completing a commutation. This evidence, it seemed to me, was included in\n\nthe affidavit to bolster his assertion that he categorically withdrew the oral offer\n\nimmediately it was rejected.44. During the course of the evidence, however, it became clear that in August 1999 Mr\n\nJohnson had not had the financial information to which he referred in his affidavit. When\n\nhe called Mr Yeo therefore, there was no reason for him to be angry with OUI. Accordingly,\n\nit is unlikely that his attitude when he spoke with Mr Yeo was that Turegum should get all\n\nits money back from OUI and to accept anything less would mean that OUI had fooled\n\nTuregum. There is further support for this conclusion from the e-mail that Mr Johnson sent\n\nto his superiors on the commutation negotiations on the same day as the conversation took\n\nplace. In that he said:‘I have now spoken to Overseas Union (today) in a final attempt to negotiate a\n\n  commutation within the price range (US$170,000 – 255,000) as previously agreed by the\n\n  TMM. I have spoken to Diarmuid Brennan and we will send a letter to Overseas Union (again)\n\n  rejecting their offer of US$160,000 and reiterating our final offer of US$220,000 which is\n\n  available for the next 7 days, otherwise we stop negotiating for a commutation settlement\n\n  and commence arbitration proceedings.’In the event no further letter was sent to OUI because the next day Mr Johnson’s\n\nsuperiors informed him that commutation negotiations should cease and Turegum should go to\n\narbitration. The tone of the e-mail is, however, telling. It is not the tone of an angry\n\nman. It is a tone of a man who is trying to achieve a settlement and who is still willing\n\nto accept the earlier figure which had been proposed on the basis of Turegum’s belief\n\nin the financial difficulties that OUI had said it was facing. In court, Mr Johnson\n\nadmitted that he had had authority to settle the matter at US$220,000 from March 1999\n\nright up to 27 August 1999. The e-mail shows that he was still prepared to use that\n\nauthority. It does not show that the offer was no longer acceptable or that it had been\n\ncategorically withdrawn.45. It is also significant that the correspondence from Turegum after OUI’s\n\nacceptance of 21 October did not mention the oral withdrawal. Whilst there was an\n\nassertion that the offer had been withdrawn in Mr Johnson’s letter of 21 October,\n\nthere was no mention in that letter of the telephone conversation of 26 August nor any\n\nassertion that the withdrawal had been communicated during that conversation. A month\n\nlater, a letter was written by Diarmuid Brennan & Co to OUI’s solicitors in which\n\nvarious dates were asserted on which the offer was said to be withdrawn. The alleged oral\n\nwithdrawal during the telephone conversation was not mentioned. Instead, the only oral\n\nwithdrawal referred to was that allegedly made during the meeting of 15 October. Further,\n\nin Mr Brennan’s affidavit of evidence in chief, he was silent on any oral withdrawal\n\nwhich allegedly took place in August or September 1999 although he testified as to having\n\nbeen informed about it contemporaneously by Mr Johnson. Mr Brennan did agree that the oral\n\nwithdrawal was an important event. His explanation for not mentioning it was that Mr\n\nJohnson was giving an affidavit about it.46. OUI’s submission was that Mr Johnson’s evidence on the withdrawal of the\n\noffer was unreliable because he was trying to work out what happened backwards. Counsel\n\npointed to the fact that he had thought that the conversation was in September and his\n\nevidence suggested that the report he had obtained on OUI (referred to as the DTI report)\n\nwas ready by then. Putting the two together he claimed in para 27 of his affidavit that\n\n‘Armed with this knowledge (from the DTI report) …’ he had called Mr Yeo.\n\nIn truth, however, it was submitted that he did not remember and therefore could not claim\n\nthat he withdrew the offer on 26 August. Having located the e-mail after making the\n\naffidavit, he realised that his mandate to negotiate expired on 27 August and therefore\n\nassumed subsequently that he must have withdrawn the offer on 26 August.47. This submission seems to me to be a reasonable interpretation of the course of\n\nevents. I think that having renewed the offer, Mr Johnson warned Mr Yeo that if it was not\n\naccepted Turegum would start arbitration proceedings but that he did not expressly\n\nwithdraw it during the course of the conversation. Since he wanted to move things along,\n\nhe suggested to his superiors thereafter that a letter be written with a specific time\n\nframe for acceptance of the offer so that at the end of that time period, Turegum would\n\nknow where it stood and would be able to act accordingly. He did not do anything further\n\nafter being told that his superiors no longer wanted to commute but must have had some\n\ndoubt as to whether his offer was in existence. He therefore took care to assert at the\n\nmeeting in October that he had previously made it absolutely plain that the US$220,000\n\noffer no longer stood.48. The finding as to the continued existence of Turegum’s offer after 26 August\n\nleads on to the next issue which is whether that offer was impliedly withdrawn by the\n\nnotice which Diarmuid Brennan & Co issued on 5 October 1999 telling OUI that unless\n\npayment of the balance due on five contracts was made in full by 18 October 1999,\n\narbitration proceedings would be commenced. Turegum pointed out that this letter had to be\n\ncontrasted with the previous negotiations wherein the parties had been negotiating to\n\nsettle all past business between them which included the five contracts mentioned in the\n\ndemand letter. It submitted that the letter of demand was entirely inconsistent with a\n\ncontinuing intention to enter into an agreement on the terms previously proffered and that\n\nafter it was made, OUI could not, objectively, have believed that the offer was still in\n\nexistence to be accepted. In any event, by causing this letter of demand to be sent,\n\nTuregum had withdrawn and/or revoked any existing offer to commute.49. I accept the above submission. The maker of an offer is free to withdraw it at any\n\ntime before it is accepted. Notice of the withdrawal must be given and must be actually\n\nreach the offeree to be effective. It is not necessary, however, that the notice of\n\nwithdrawal be explicit. It is enough if the offeree is given information which would show\n\nthat the offeror has changed his mind and no longer wants to proceed with the offer. This\n\ninformation need not even come directly from the offeror. In this case, the instructions\n\nwhich Turegum gave its solicitors to make a formal demand for the balance due and to give\n\nnotice that arbitration proceedings would be commenced if that demand was not met were\n\nclear evidence that Turegum no longer wished to settle its claim. This intention was\n\ncommunicated to OUI by Diarmuid Brennan & Co’s letter. OUI received the letter\n\nand although its officers stated that they did not regard the letter as a revocation of\n\nthe offer but simply as an attempt to put pressure on them to settle, this assertion was\n\nbelied by their reaction which was to immediately arrange a meeting with Turegum. Mr Tang\n\nadmitted that OUI’s letter to Turegum of 7 October was the first time that OUI had\n\nshown an interest in meeting Turegum on its proposed visit to Europe. I consider that OUI\n\nhad been content to wait on events until it received the letter of demand. It then\n\nrealised that matters had reached a serious point and that drastic action had to be taken\n\nto prevent arbitration. Even if I am wrong in my analysis of the belief held by OUI’s\n\nofficers, I consider that an objective person would have realised from the letter that\n\nTuregum was no longer minded to settle the claim on the terms previously put forward.",
        "The 15th October meeting": "50. My finding is that at the start of the meeting on 15 October, no offer existed. OUI\n\ndid not take that view. Mr Yeo’s evidence-in-chief was that Turegum’s approach\n\nat the meeting was that if OUI did not accept the offer of US$220,000 and reach a\n\nsettlement, it would commence arbitration proceedings. Turegum may have been rather\n\ndoubtful as to the situation at the start of the meeting as, according to the evidence of\n\nits three witnesses who were present, Mr Johnson felt it necessary to state explicitly\n\nduring the meeting that the offer of US$220,000 was off the table entirely.51. Mr Brennan gave evidence that Mr Peter Yap did most of the talking on behalf of OUI\n\nduring the meeting. Mr Yap who started talking first proceeded to recapitulate the\n\nnegotiations and noted what he thought was each party’s respective position: that\n\nTuregum had offered US$220,000 and that OUI had offered US$160,000, and asked where\n\nparties should progress to. It was at this point that Mr Johnson told Mr Yap about the\n\ntelephone conversation and said that Turegum’s offer to commute was off the table. He\n\nthen told OUI that it had to pay the ledger debt first, before any further negotiations to\n\ncommute could take place. It appeared to Mr Brennan that Mr Johnson’s assertion that\n\nthe offer to commute had been withdrawn caused concern to OUI and that Mr Yap was\n\nsurprised to hear it. Mr Yap subsequently informed Turegum that he was not authorised to\n\ndo anything except to commute, that is to say, he had no authority to settle the ledger\n\ndebt. Mr Yap then expressed regret at not having accepted the offer to commute at\n\nUS$220,000. Mr Brennan’s evidence was that the meeting ended with no agreement having\n\nbeen reached and with no commutation offer in existence.52. I am inclined to accept Mr Brennan’s account of the meeting. In the first\n\nplace, it is consistent with the evidence given by Mr Johnson and Ms Gard. Secondly and\n\nmore importantly, it is substantiated by hand written notes that Mr Brennan took during\n\nthe course of the discussion. I accept those notes as being contemporaneous and see no\n\nreason to doubt their contents. Those notes are also supported by an ‘Arbitration\n\nReport’ prepared by Mr Brennan on 19 October in which he referred to the 15 October\n\nmeeting and stated that OUI’s representatives ‘made no meaningful offer to pay\n\nbeyond their original offer of US$160,000 though it was apparent that they wished they had\n\naccepted the US$220,000 that had been on offer’.53. I should state that I am not as convinced of the accuracy of the typed written\n\nmemorandum prepared by Ms Gard some months after the meeting and which purported to be a\n\nsequential account of what occurred. In my view, that memorandum was a reconstruction of\n\nwhat Ms Gard thought, after discussion, had happened at the meeting. It was prepared after\n\nit was clear that the events of the meeting were hotly disputed. At this stage, it is\n\ndifficult to de-construct the memorandum so as to ascertain what part of it was written\n\nfrom her actual memories.54. Thirdly, the evidence that Mr Johnson stated that the offer of US$220,000 was off\n\nthe table was consistent with the documentary evidence produced by Turegum showing that\n\nafter 26 August 1999, Mr Johnson’s authority to commute was withdrawn and that his\n\nsuperiors wanted to proceed with arbitration and thought that they should get much more\n\nthan US$220,000 from OUI. All Turegum’s actions thereafter were aimed at this result.\n\nWhen the meeting started Mr Johnson knew the attitude of his superiors. By that time, he\n\nhad also seen the DTI report and therefore would have believed that OUI was in a stronger\n\nfinancial position than he had thought earlier. There was no reason for him to maintain\n\nthe offer of US$220,000 and every reason for him to make it clear to OUI that Turegum\n\nwanted more.55. Overall, I found the evidence given by Turegum’s witnesses as to the contents\n\nof the meeting to be coherent and convincing. The evidence given by OUI’s witnesses\n\non the same issue, however, was not as persuasive. When asked the crucial question of\n\nwhether Mr Johnson had confirmed at the meeting that the commutation offer was withdrawn,\n\nMr Yeo’s response was equivocal. He said ‘I did not recall that there was such a\n\nconfirmation’. Why could he not have given a straight answer in the negative since\n\nthat was OUI’s position? As it stands, it is not Mr Yeo’s evidence that Mr\n\nJohnson did not confirm at the meeting that the offer was withdrawn. This lapse in memory\n\ncontrasted with his seemingly flawless recollection of other matters that occurred at the\n\nmeeting for example, that Mr Johnson had stated that OUI’s final offer of US$160,000\n\nwas rejected; and that Mr Yap did not respond that OUI had lost a court action and what\n\nwas stated in its audit accounts was not a true reflection on recovery.56. There were other implausibilities in Mr Yeo’s evidence. He had testified that\n\nin asking for the meeting OUI was making a last ditch attempt to resolve the matter.\n\nHaving said that he then stated that none of OUI’s representatives attending the\n\nmeeting had had any prior discussion amongst themselves on the strategy to be adopted for\n\nthe meeting. It is extremely difficult to believe that they were prepared to attend the\n\nmeeting and have final discussions without any previously worked out plan of action. There\n\nmust have been such a plan since Mr Yeo, as he admitted, knew after the telephone\n\nconversation that US$160,000 would never be accepted by Turegum.57. Mr Yeo also testified that he had no figure in mind that he hoped to persuade\n\nTuregum to agree to when he went for the meeting. However, he then said that at the back\n\nof his mind, he had been considering a figure of US$190,000 in order to close the gap.\n\nYet, he wanted me to believe that despite knowing he had to offer more in order to\n\ninterest Turegum, when it came to the point he had simply asked it to reconsider\n\nUS$160,000.58. Mr Tang’s evidence was that OUI’s purpose in attending the meeting was to\n\ntest Turegum’s bottom-line. In some correspondence it had hinted that it was prepared\n\nto move down from US$220,000 so OUI had gone for the meeting to test Turegum’s\n\ndetermination. But, if this was in fact the case, OUI should have attempted to put forward\n\nits alternative figure for Turegum’s consideration. This was especially so since Mr\n\nYeo is supposed to have had in mind a figure of US$190,000. Yet, this was not done.59. OUI’s conduct as related by its witnesses does not make sense to me. There was\n\nno point in arranging a meeting in London with Turegum simply to repeat an offer that had\n\nconsistently been rejected by Turegum. As at 15 October, OUI must have thought that since\n\nthe figure of US$220,000 had not been expressly withdrawn during the telephone\n\nconversation, it could, with the personal skills of its general manager thrown in, still\n\npersuade Turegum that it would be better to accept that amount than to go to the expense\n\nof conducting arbitration proceedings. The OUI representatives must have gone to the\n\nmeeting with that intention but Mr Yap must have been thrown off course when Mr Johnson\n\nsaid very firmly that that figure was no longer acceptable and therefore, no figure was\n\nput forward by OUI during the meeting.60. I should also state here that I am drawing an adverse inference from the failure of\n\nOUI to call Mr Yap as a witness. No reason was given to me as to why Mr Yap could not be\n\ncalled. As far as I knew, he was still holding his position at OUI at the time the hearing\n\ntook place. Mr Yeo tried to explain away OUI’s failure to call Mr Yap by stating that\n\nhe had only made one insignificant comment, ie that agreement could not be reached, just\n\nwhen they were about to leave the meeting room. Upon further cross-examination, however,\n\nMr Yeo changed his evidence and asserted that Mr Yap had expressed regret that the gap\n\ncould not be bridged at the meeting. That comment was more in line with the evidence given\n\nby Turegum’s representatives.61. It is not possible to believe, as OUI would have me do, that Mr Yap, the most\n\nsenior officer among the three representatives of OUI, remained absolutely silent during\n\nthe entire meeting save for one ‘insignificant comment’ apparently directed at\n\nnobody at particular at the end of the meeting when everyone was about to leave the room.\n\nMr Yap’s testimony would have helped shed light on the events that occurred. I can\n\nonly conclude that his failure to take the stand is because if he had, he would have had\n\nto explain why all three of Turegum’s witnesses testified that Mr Yap did the talking\n\nfor OUI and that he said that it was a pity that the offer to commute at US$220,000 had\n\nbeen withdrawn. I therefore infer that Mr Yap’s account of the meeting would have\n\nbeen more consistent with that given by Mr Brennan than that given by Mr Yeo.62. The result of the above is that on 15 October there was no existing offer to\n\ncommute at US$220,000. The purported acceptance of 21 October therefore did not result in\n\nany concluded commutation. Looking at the course of events in the manner suggested in the\n\nProjection Pte Ltd case cannot change this outcome. To an objective observer it is plain\n\nthat on 15 October no agreement could have been reached since the parties were not of like\n\nminds. Turegum no longer wished to effect a commutation at US$220,000 and OUI knew this.",
        "The events of 20 and 21 October": "63. Whilst the finding above makes consideration of the subsequent events unnecessary,\n\nin view of the submissions I have received, I will express my views on them.64. I have construed Diarmuid Brennan & Co’s letter of 5 October as a\n\nrevocation of any existing offer to commute made by Turegum. The letter which Diarmuid\n\nBrennan & Co sent on 20 October giving notice of arbitration must be similarly\n\nconstrued. That in fact was an even stronger manifestation of Turegum’s decision not\n\nto compromise on the issue and to withdraw all previously existing offers.65. According to the evidence adduced by Turegum, the notice of arbitration was\n\nsuccessfully faxed to OUI’s office at just after midnight on 20 October 1999\n\n(Singapore time) or 16:07 hours London time as shown on the relevant fax transmission\n\nreport. No evidence was provided by OUI to show that the date and time printed on this\n\nreport were inaccurate. Nor did it provide any affirmative evidence that its office had\n\nactually received the notice of arbitration at any other time or date. I accept the\n\nevidence adduced by Turegum on this point and find that OUI received the notice of\n\narbitration in the early hours of 21 October 1999. It was therefore available to be read\n\nby OUI’s officers when they came into the office at the start of business that\n\nmorning.66. Although Mr Yeo’s evidence-in-chief was that he only saw the arbitration\n\nnotice after sending out OUI’s acceptance of the US$220,000 offer on 21 October, OUI\n\ndid not use this assertion as the basis of its contention that the notice had not\n\nwithdrawn the offer. Instead it pleaded in its reply and defence to counterclaim that the\n\nnotice was invalid and inoperative as the reinsurance contracts contained no arbitration\n\nclause. In its closing submissions, OUI took another tack entirely. It was submitted that\n\nsince according to Turegum’s case, the offer had already been withdrawn by the time\n\nthe notice was sent out, the notice could not have been a withdrawal of the offer.\n\nFurther, Turegum could not have intended the notice to have the effect of withdrawing the\n\noffer since the withdrawal had already been made. Counsel stated that OUI did not read the\n\nnotice as having that effect. How then, counsel asked, could the objective meaning of the\n\nnotice be different from what both parties originally intended.67. I do not accept the above submissions. Whilst Turegum did not send out the notice\n\nof arbitration as an express withdrawal of the compromise offer since in its mind the\n\noffer no longer existed, the objective interpretation of the notice must be that Turegum\n\ndid not want to compromise and that any previous indication of its willingness to do so\n\nwas no longer effective. Secondly, having heard the witnesses and considered the evidence\n\nas a whole, I do not believe that the notice of arbitration was not seen by OUI prior to\n\nthe acceptance letter being sent out. Mr Yeo might not have realised at that time that the\n\nnotice of arbitration had the effect of destroying a compromise offer (if any then\n\nexisted), but he obviously knew that it meant Turegum was now intent on full recovery and\n\nthat was what prompted the issue of the acceptance. Only the previous day Mr Yeo had sent\n\nDiarmuid Brennan & Co a fax asking for a further three weeks to look into the papers\n\nrelating to the reinsurance contracts. I do not believe that he would have sent out the\n\nacceptance the very next day if it had not been for the arrival of the notice of\n\narbitration. It was also telling that the submissions relied on legalities and inferences\n\nand logic (ie on the inference to be drawn from the notice) and not on the bald assertion\n\nthat the notice was not sighted before acceptance. Obviously that evidence was not\n\nregarded as compelling.",
        "Conclusion on first issue": "68. I therefore hold that no commutation was concluded between the parties on 21\n\nOctober 1999.Second Issue: Do the reinsurance contracts contain arbitration clauses?The background69. There are four reinsurance contracts which are now in issue between OUI and\n\nTuregum. Originally, there were five, but Turegum has not been able to find any documents\n\nevidencing the fifth contract and is therefore not proceeding on its claim on that\n\ncontract for the time being. The four contracts which Turegum seeks to refer to\n\narbitration have been known during the proceedings as contracts no. 3TD69, 3TD70, 3TD71\n\nand 3TG71.70. Before I go on to discuss the issues relating to these contracts, it would be\n\nhelpful to give a brief account of how such contracts usually come about. An insurance\n\ncontract placed in the London market is initiated when an insurance broker presents a\n\nproposal for insurance or reinsurance to underwriters at Lloyds or to insurance companies.\n\nThe procedure is described by Lord Diplock in American Airlines Inc. v Hope [1974] 2 LLR\n\n301 at 304-305. What happens is that the broker acting for the assured prepares the slip\n\n(a folded card) and indicates in brief terms the cover the assured requires. Thereafter,\n\nas Lord Diplock says:‘... He takes the slip … to an underwriter whom he has selected to deal with\n\n  as leading underwriter, i.e., one who has a reputation in the market as an expert in the\n\n  kind of cover required and whose lead is likely to be followed by other insurers in the\n\n  market. If it is the first contract of insurance covering that risk in which a particular\n\n  underwriter has acted as leading underwriter it is treated as an original insurance. The\n\n  broker and the leading underwriter go through the slip together. They agree on any\n\n  amendments to the broker’s draft and fix the premium. When agreement has been reached\n\n  the leading underwriter initials the slip for his proportion of the cover and the broker\n\n  then takes the initialled slip round the market to other insurers who initial it for such\n\n  proportion of the cover as each is willing to accept. For practical purposes, all the\n\n  negotiations about the terms of the insurance and the rate of premium are carried on\n\n  between the broker and the leading underwriter alone. …After the slip has been initialled by all the insurers it is retained by the broker. In\n\n  due course, often after several months, he prepares the policy from the slip. In the case\n\n  of an original insurance he generally agrees the wording of the policy with the leading\n\n  underwriter before taking it to Lloyd’s Policy Signing Office for signature.’71. When the slip is signed, it constitutes a binding contract. At that stage, the\n\nwhole of the contract is found in the slip. It has been described as\n\n‘free-standing’. See Insurance Company of the State of Pennsylvania v Grand\n\nUnion Reinsurance Co. [1990] 1 LLR 208 and The Zephyr [1984] 1 LLR 58. OUI relies on these\n\nprinciples in relation to the two slips (for contracts 3TG70 and 3TG71) which it has in\n\nits possession and argues that since these slips do not contain arbitration clauses or any\n\nreference to any arbitration clause in any other document, the contracts of insurance do\n\nnot contain any agreement to submit disputes to arbitration.72. The slip is usually only the first stage in the process. Following its signing, the\n\nbroker will issue a cover note to its own client confirming the cover which has been\n\nplaced on the client’s behalf. As stated in The Law of Reinsurance in England and\n\nBermuda by O’Neill and Woloniecki, the cover note is not provided to the insurer and\n\nthus cannot be a contractual document. It is, however, prima facie evidence of a contract\n\nand may be used to establish the terms of that contract when the slip is lost.73. Further, it is often clear from the slip itself that the parties intend that a\n\npolicy or treaty wording be issued subsequently. The purpose of this is to expand on the\n\nterms found in the slip which are usually short and often only titles of the clauses\n\nrequired. According to another text, Reinsurance Practice and The Law [1993] put out by a\n\nfirm called Barlow, Lyde and Gilbert, once a wording is executed by both parties, it\n\nreplaces the slip as a contract document. Should any inconsistency between the slip and\n\nthe wording need to be resolved, it is the wording which is paramount (see section\n\n10.5.1.3). This statement was based on the holding in Youell v Bland Welch [1990] 2 LLR\n\n423 (HC) and [1999] 2 LLR 127 (CA) which discussed the ranking of the slip versus the\n\nwording and ruled that if formal wording was subsequently issued, the slip would be\n\ninadmissible as an aid to construction of the policy. The judge at first instance, Philips\n\nJ, also stated (at page 429):‘An insurance slip customarily sets out a shorthand version of the contract of\n\n  insurance, in terms which may neither be clear nor complete. Where, as here, the slip\n\n  provides for the formal wording to be agreed by the leading underwriter, the other\n\n  subscribers to the risk anticipate and agree that the leading underwriter will, on their\n\n  behalf, agree the final wording that will spell out their rights and obligations. If\n\n  differences between the wording of the slip and that of the formal contract which is\n\n  embodied in the policy give rise to the possibility that the natural meaning of the slip\n\n  differs from that of the policy, the natural assumption is and should be that the wording\n\n  of the policy has been designed the better to reflect the agreement between the parties.\n\n  To refer to the slip as an aid to construction of the policy runs counter to one of the\n\n  objects of replacing the slip with the policy.’The pleadings on the reinsurance contracts74. The reinsurance contracts which Turegum seeks to enforce go back more than thirty\n\nyears. As a result, it is not clear whether the documentation that has been produced is\n\nall of the documentation. In relation to certain of the contracts, OUI is not willing to\n\naccept the authenticity of the documents produced by Turegum as it does not have copies of\n\nthe same. The difficulty is that OUI acted through agents in the London market and these\n\nagents have since closed and the files have been transferred more than once. Retrieval of\n\ndocuments and information has been piecemeal and slow.75. In its amended Statement of Claim, OUI pleaded that sometime between 1963 and 1979\n\nit had entered into five reinsurance contracts with Turegum in respect of excess of loss.\n\nAs particulars of this assertion, OUI stated that the contracts of reinsurance were as\n\ncontained in and/or as evidenced by and/or to be inferred from the slips issued at the\n\ntime of placement. OUI further stated that in particular it relied on two slips signed by\n\nit through its underwriting agents in December 1969 and July 1971 and that it was unable\n\nto produce or give precise particulars of any other slips due to the substantial lapse of\n\ntime. It averred, however, that the terms of all the five reinsurance contracts were\n\neither contained in or expressly referred to in slips. It went on to plead that the\n\npurported notice of arbitration given by Turegum and all further proceedings consequent\n\nupon the notice were null and void because the reinsurance contracts made no reference to\n\nnor contained any arbitration clause. OUI averred that in the circumstances there was no\n\nagreement to refer any disputes to arbitration and it further put Turegum to strict proof\n\nof the existence of any agreement to refer disputes to arbitration.76. In Turegum’s re-amended defence and counterclaim it gave brief details of the\n\nfive reinsurance contracts which it originally intended to claim under. Paragraph 4 stated\n\nthat following the issuance of the respective slips when placement of the reinsurances was\n\nconcluded, Turegum or the brokers issued the full set of terms and conditions of the\n\nrespective contracts to OUI or its agents. Turegum further averred that each set of the\n\nfull terms and conditions was signed by OUI and/or its agent. It admitted that it did not\n\nhave in its possession all five slips or sets of the signed terms and conditions but\n\nasserted that the contracts were contained in and/or expressly set out in the respective\n\nsets of terms and conditions. It also pleaded that the slips contained a clause reading\n\n“Conditions – Wording to be agreed L/U only” and that by virtue of these\n\nwords because of the usage or custom of the London reinsurance market, OUI and Turegum had\n\nagreed to be bound by the full wording and terms and conditions of the reinsurance\n\ncontract as agreed (including any arbitration clause).77. By 6 and 7, Turegum pleaded that it was an implied term of the five reinsurance\n\ncontracts that the proper law of the same was English law or, in the alternative,\n\nobjectively the proper law was English law. In 8, it pleaded that by virtue of the\n\nprovisions of the English Arbitration Act 1996, each of the reinsurance contracts\n\ncontained an arbitration agreement. Paragraphs 9, 10 and 11 contained alternative pleas\n\nthat the arbitration agreements were made in writing or evidenced in writing in accordance\n\nwith the provisions of the Act.78. In its reply OUI pleaded that apart from the reinsurance slips, no other documents\n\nwere issued or signed by it or its agents in relation to the reinsurance contracts. OUI\n\nfurther averred that even if the slips contained the wording relating to the leading\n\nunderwriter, such wording did not have the effect of, nor was it capable of, incorporating\n\nany terms and conditions contained in any other documents into the contract between the\n\nparties. It denied also that there was any custom or usage in the London market which\n\ndictated that such wording was capable of incorporating terms and conditions in other\n\ndocuments into the contract between the parties.79. In relation to the governing law, OUI’s main plea was that the proper law of\n\nthe five reinsurance contracts was Singapore law. Even if English law governed these\n\ncontracts, however, the English Arbitration Act 1996 did not apply and, in any case, did\n\nnot have the effect which Turegum had contended it did.80. Whilst it can be seen from the above account that various issues arise in relation\n\nto the form and content of the reinsurance contracts, in summary OUI’s case is that\n\nof the four contracts Turegum now seeks to enforce, it is only aware of two. It says those\n\ncontracts are contained in the slips and since the slips do not have arbitration clauses,\n\nit cannot be forced into arbitration over Turegum’s claims. As for the other two\n\ncontracts, OUI does not accept that it is a party to these and challenges the\n\nadmissibility and authenticity of the documents which Turegum relies on to establish the\n\ncontracts.81. I will deal first with the issue of the governing law. There are other common\n\nissues which will arise when I consider the individual contracts but I think it better to\n\ndeal with those issues in the concrete environment of an individual contract rather than\n\nabstractly.",
        "Governing law": "82. There are three stages in determining the governing law of a contract. The first\n\nstage is to examine the contract itself to determine whether it states expressly what the\n\ngoverning law should be. In the absence of an express provision one moves to the second\n\nstage which is to see whether the intention of the parties as to the governing law can be\n\ninferred from the circumstances. If this cannot be done, the third stage is to determine\n\nwith which system of law the contract has its most close and real connection. That system\n\nwould be taken, objectively, as the governing or proper law of the contract. See Las Vegas\n\nHilton Corporation v Khoo Teng Hock Sunny[1997] 1 SLR 341and Dicey & Morris on The\n\nConflict of Laws (11th Ed) at Rule 180.83. It is common ground here that none of the contracts, whether they are considered as\n\nbeing contained in the slips alone or whether their terms are reflected in other documents\n\nsuch as treaty wording or policies, contains an express choice of law clause. Should I\n\nthen go on to the second stage? In the Las Vegas case Chao J gave examples of\n\ncircumstances from which it may be possible to infer a common intention as to the proper\n\nlaw of the contract like clauses giving jurisdiction to the courts of a particular country\n\nto decide disputes arising out of the contract and matters like the currency of the\n\ntransaction or its commercial purpose. He decided, however, that in the circumstances of\n\nthe case before him which dealt with an alleged oral contract, it was not meaningful to go\n\ninto an exercise to try and determine the intention of the parties from inference. Instead\n\nhe went straight to the third stage of determining with which law the transaction before\n\nhim had its closest and most real connection. I think I should do the same. Since in this\n\ncase the parties acted entirely through brokers and OUI did not even see many of the\n\ndocuments for years, if at all, it would be absurd to try and infer any intention.84. OUI’s submission was that the three stages had to be applied in strict\n\nchronology. It said that the second stage would only be looked at if there was proof that\n\nthe first stage was inapplicable and the third stage only applied when there was proof\n\nthat the second stage could not apply. In this case it agreed that the first stage could\n\nnot apply as there was no express reference to the proper law of the contract. OUI then\n\nwent on to submit that since no evidence had been adduced of the implied intention which\n\nstage two looks for, the court could not move to stage three. I cannot accept this\n\nargument. The passages from Dicey & Morris in the commentary for Rule 180 make it\n\nclear that the exercise to determine the proper law is one of legal analysis based on the\n\nfacts in evidence and not one of following mandatory rules in such a manner that if one\n\ncannot be followed the rest are inapplicable. The following passage makes this clear:‘… the line between the search for the inferred intention and the search for\n\n  the system of law with which the contract has its closest and most real connection is a\n\n  fine one which is frequently blurred. In theory, in the absence of an express choice as\n\n  the first test, the court should consider as a second test whether there are any other\n\n  indications of the parties’ intention, and only if there is no such indication go on\n\n  to consider the third stage, namely with what system of law the contract has its closest\n\n  and most real connection. But in practice the same result can be reached by the\n\n  application of the second or third tests, and frequently the courts move straight from the\n\n  first stage to the third stage. This is largely because the tests of inferred intention\n\n  and close connection merge into each other, and because before the objective close\n\n  connection test became fully established the test of inferred intention was in truth an\n\n  objective test designed not to elicit actual intention but to impute an intention which\n\n  had not been formed.’ (at p 1162)85. Proceeding with the analysis to elicit the governing law, I note that the only\n\nconnection that any insurance contract that came into being had with Singapore is that the\n\nreinsurer, OUI, is incorporated in Singapore and has its place of business here. On the\n\nother hand there are many factors that connect the contracts with English law. First,\n\nalthough Turegum is incorporated in Switzerland, it had an office in London at the\n\nmaterial time. Secondly, the negotiations for the reinsurance contracts took place in\n\nLondon and any contracts that resulted were entered into in London between the respective\n\nbrokers/agents of OUI and Turegum. Thirdly, the risks undertaken were placed in the London\n\nreinsurance market and the lead underwriters carried on business in London. Fourthly, all\n\nthe contract documents were prepared and issued in London and the terminology of the slips\n\nwas characteristic of slips issued in the London market. Fifthly, the claims made against\n\nTuregum under the policies reinsured with OUI were received and processed in London by\n\nTuregum or its brokers. Sixthly, the brokers acting for both parties were situated in\n\nLondon and OUI’s London agents were the ones who administered and dealt with the\n\nclaims in London from inception up till 1992. Turegum also pointed out that the\n\narbitration clauses which were contended to be part of the contracts provided for\n\narbitration in London. Even if I leave this last factor out of consideration since it has\n\nnot yet been established, the connections between the contracts and London and, therefore,\n\nEnglish law, are overwhelming. The only reasonable and logical finding is that English law\n\nis the governing law of the insurance contracts as being the law that has the closest and\n\nmost real connection to them.",
        "Contract 3TD69": "86. The relevant documents produced in court in relation to this contract were the\n\nfollowing:1) The original copy of the slip. Attached to it was a document bearing the heading\n\n  ‘Turegum Insurance Company Third Party etc Excess of Loss Insurance’ on which\n\n  was hand-written ‘Agreed Wording RO1692’;2) Premium slips (also attached to the original slip) and3) A folder prepared by Rose, Thomson, Young (Reinsurance) Ltd, (Rose, Thomson)\n\n  Turegum’s agents, containing a cover note dated 27 February 1969 issued by Rose,\n\n  Thomson in respect of this insurance contract, a letter dated 22 July 1969 forwarding to\n\n  Turegum a copy of the treaty wording of the contract which had been agreed by the leading\n\n  underwriter, and the treaty wording itself which in terms was identical to that attached\n\n  to the slip.It should be noted that the slip was in respect of excess of loss reinsurance covering\n\nlosses occurring within 12 months from 1 January 1969 and the interest covered was\n\n‘all policies and/or contracts of insurance and/or reinsurance covering Third Party\n\nLiability and/or all other risks deemed by the Reinsured to be casualty business’.87. In its Amended Statement of Claim, OUI stated that it relied on two slips signed by\n\nit through its underwriting agents in December 1969 and July 1971. In Mr Yeo’s\n\nAffidavit however, he said that the only policy documentation OUI had been able to\n\nretrieve from the papers it obtained from London after it took control of the run-off\n\noperations in 1992 were two slips covering the years 1970 and 1971. In its closing OUI did\n\nnot accept that it had been a party to the 1969 contract. It must be noted however that\n\ncertain correspondence sent out by OUI in 1994 contains a contract reference found on the\n\n1969 slip and wording which duplicates that found on the slip. OUI may, therefore,\n\nalthough it denies this, have had sight of the slip at that time or at least had\n\ndocumentation which made it aware of the slip’s existence and contents.88. In any case the original slip produced shows that OUI had written a 2% line on\n\nthis slip on 13th January 1969. On the slip itself, OUI’s name appears on a stamp\n\naffixed by Winchester Fox which contains a reference number XL/2/462/69. The cover of the\n\nslip has the reference number RO1692. The slip contains various terms and conditions. None\n\nof these provides for arbitration. Among the conditions however, is the term ‘Wording\n\nto be agreed L/U only’. Such a clause is commonly known as a leading underwriter\n\nclause.89. It is Turegum’s contention that the treaty wording attached to the original\n\nslip produced by it was the wording agreed by the ‘L/U’ or leading underwriter\n\nwhich in that case was Stronghold Insurance Company Ltd (Stronghold). Clause 15 of this\n\nwording is entitled ‘Arbitration Clause’ and provides for disputes between the\n\nreinsured and the reinsurer to be referred to two arbitrators and an umpire and for the\n\narbitration to take place in London. Turegum said that this arbitration clause was a part\n\nof the reinsurance contract between itself and OUI because OUI was bound by the leading\n\nunderwriter clause to accept all the terms of the treaty which Stronghold had accepted.\n\nThis is an argument based on the principle that a principal making a contract through an\n\nagent acting with authority is bound by all the terms agreed to by that agent. It is not\n\nan argument that the arbitration clause in the treaty wording was binding on OUI because\n\nit had been incorporated by reference into the insurance contract contained in the slip.90. OUI’s submission was that the reinsurance contract would effectively have been\n\nconcluded once the slip was subscribed and signed by the parties. It pointed out that this\n\nwas accepted by Mr Peter John Downey, a gentleman who had worked for 30 years in the\n\nLondon insurance market and who was called as an expert witness by Turegum. OUI was not\n\nhowever willing to accept Mr Downey’s further evidence that the leading underwriter\n\nclause in the slip had the effect of binding all the following reinsurers to the wording\n\neventually accepted by the leading underwriter. Mr Downey had stated that the use of\n\nleading underwriter clauses was very common in the London reinsurance market and that the\n\neffect of this clause was that the leading underwriter had authority from the following\n\nmarket to bind them according to the terms recorded on the slip. He also testified that if\n\na following reinsurer did not wish to be bound by the actions or decisions of the lead as\n\nset out in the slip he would endorse the slip with the appropriate note in this respect.\n\nIn the absence of such objections or alterations, by signing the slip reinsurers were\n\ntaken to agree to follow the leading underwriter and to be bound by any wording signed by\n\nthat underwriter.91. OUI submitted that Mr Downey’s evidence on market practice was not\n\nsatisfactory. It pointed that whilst he was under cross-examination he had accepted that\n\npractice varied within the market and that who decided what practice would be followed in\n\na particular case depended on the cedant, the broker or the reinsurer. He also said that\n\nthe London market was a large market and not everyone follows the same practice. On this\n\nbasis, OUI submitted that there was no market practice in London whereby reinsurers were\n\nbound by treaty wording agreed to by the leading underwriter. It contended that to\n\nestablish an agreement to arbitrate, Turegum had to show that subsequent to the signing of\n\nthe slip, OUI had agreed to arbitrate and that the evidence tendered did not prove this.92. OUI did not call any witness of its own to establish market practice in London. Mr\n\nTang and Mr Yeo had no knowledge of the practices of the London market and thus in order\n\nto impugn the evidence given by Turegum’s witnesses on such custom, OUI had to try\n\nand highlight inconsistencies in such evidence. Although at first glance the answers given\n\nby Mr Downey to questions posed while he was in court appeared rather damaging to\n\nTuregum’s case, further examination revealed that his testimony remained strongly in\n\nits favour. The answers that OUI relied on were given in response to questions by\n\nOUI’s counsel relating to certain other reinsurance contracts that he showed Mr\n\nDowney and asked the latter to comment on. In one of those cases, the contract wording had\n\nbeen sent to the following reinsurers for signing notwithstanding a leading underwriter\n\nclause and it was OUI’s position that such action was inconsistent with the meaning\n\nof the leading underwriter clause as propounded by Turegum.93. The broker’s letter to OUI enclosing the wording for signing had stated:‘We are sending you a copy of the Wording. This has been agreed by the leading\n\n  underwriter as required by the broking slip.We also enclose the signing pages in triplicate. Please sign these and return all three\n\n  copies …’As counsel for Turegum noted, Mr Downey’s evidence was dealing with the question\n\nof signing rather than of agreement. He stated that the wording was agreed by the leading\n\nunderwriter and the follower must accept that but that the leader did not necessarily have\n\nto sign. All the evidence following that point dealt with varying practice regarding\n\nsigning and not with varying practice regarding agreement. The witness remained firm that\n\nthe practice was that the following underwriters who did not object to the leading\n\nunderwriter clause were bound by the leading underwriter’s agreement to the wording.\n\nOn this issue, Mr Downey’s evidence was corroborated by the evidence of Mr Brian\n\nPryce Johnson, an underwriter who had actually worked for Winchester Fox between 1969 and\n\n1972 when Winchester Fox in relation to the excess of loss account wrote non-marine\n\nbusiness exclusively on behalf of OUI.94. Apart from the evidence of the London market practice as to the meaning of the\n\nleading underwriter clause, there are a number of English cases that have commented on the\n\nlegal effect of this type of clause. In the American Airlines case, Lord Diplock said:‘Almost invariably the slip provides that the wording of the policy is to be\n\n  agreed by leading underwriter. Where this is the case the leading underwriter may\n\n  occasionally consent to some clause going into the policy which was not provided for by\n\n  the slip, if in his judgment it would not affect the premium. So there is the possibility\n\n  of minor variations being made in the contract of insurance when the terms of the policy\n\n  are agreed.’ (at p 305).95. Thus under the English law governing the contract contained in the slip the\n\npresence of the leading underwriter clause meant that the leading underwriter was given\n\nthe authority to agree on the wording of the full policy and to even consent to the\n\ninsertion of a clause which had not been provided for in the slip. Roskill L.J. who was\n\npart of the coram in the Court of Appeal in the American Airlines case (reported at [1973] 1 LLR 233) also commented on the leading underwriter clause. He confirmed (at p 245) that\n\nit normally had the effect that an underwriter other than the leading underwriter by whom\n\nthe slip had been subscribed would subsequently be bound by any relevant agreement made by\n\nthe broker on behalf of the assured and the leading underwriter.96. In the case of Roadworks (1952) Ltd v JR Charman & Others [1994] 2 LLR 99, the\n\nslip contained a leading underwriter clause which stated that ‘All alterations,\n\nadditions, deletions, extensions, agreements, rates and changes in conditions to be agreed\n\nby the leading Lloyd’s underwriter …. Such agreement to be binding on all\n\nUnderwriters subscribing hereon.’ One of the issues that arose was whether the\n\nleading underwriter was the agent of the following underwriters and whether the leader as\n\nagent could validly waive a contingent condition. It was held that the slip was a contract\n\nbetween the insurers and the insured. It was not a contract between the leading\n\nunderwriters and the following underwriters although its terms i.e. the leading\n\nunderwriter’s clause, evidenced the terms of the contract of agency and the leading\n\nunderwriter had the actual authority of the following underwriters to waive even a\n\ncontingent condition. The judge expressed the view that the only express material which\n\nrelated to the authority of the leader was the wording of the L/U clause itself.97. The issue that arises is as to the extent of the authority conferred on the leading\n\nunderwriter by the L/U clause contained in the slip before me. That is a really brief\n\nclause with none of the refinement and elaboration of the clause before the judge in the\n\nRoadworks case. It simply states that ‘wording’ is to be agreed by the leading\n\nunderwriter only. This may imply a fairly wide ranging authority and such an\n\ninterpretation would seem to be borne out by an analysis of the document which is put\n\nforward as the wording agreed subsequently by the leading underwriter. That contains 15\n\nfairly substantial clauses. Some of these bear the same titles as clauses referred to in\n\nthe slip for example ‘Ultimate net loss clause’ and ‘Aggregate extension\n\nclause’ but some clauses like the arbitration clause, the ‘Inspection of records\n\nclause’ and the ‘Amendments and alterations clause’ are not even hinted at\n\nin the slip. It should be noted that even those clauses that are mentioned in the slip are\n\nreferred to by their titles with no indication as to their content and the evidence was\n\nthat though such clauses were standard in reinsurance practice they could take varying\n\nforms and therefore it was up to the leading underwriter to decide in any particular case\n\nwhich was the most appropriate form of the clause for the insurance contract at hand.98. Mr Richard Jacobs, QC, who testified as an expert on English law explained that the\n\nlead underwriter could not introduce any new clauses that he thought fit. He had to act\n\nconsistently with the contract that had been made. Mr Jacobs’ view was however that\n\nthe underwriter certainly had the authority to agree an arbitration clause since such a\n\nclause was quite usual in a reinsurance contract.99. Some support is lent to Mr Jacobs’ view by the facts of the case of Excess\n\nInsurance v Mander [1995] L.R.L.R. 358. There a reinsurance slip which subsequently gave\n\nrise to an Excess of Loss treaty (XOL treaty) binding on the plaintiffs contained a\n\nprovision reading ‘full wording as may be agreed by leading Reinsurer only’. In\n\ndue course, the leading reinsurer agreed the XOL treaty and it contained an arbitration\n\nclause. The issue which the judge had to decide as between the plaintiffs and the\n\ndefendants who had reinsured the plaintiffs’ liability under the XOL treaty was\n\nwhether the arbitration clause in the XOL treaty had been incorporated in the retrocession\n\nagreement between the plaintiffs and the defendants. The judge decided it did not because\n\nat the time when the retrocession agreement had been concluded the reinsurance slip\n\nexisted but the XOL treaty had not been concluded and therefore no binding arbitration\n\nagreement between the plaintiffs and their own insured existed at that point. It was\n\nstated by the judge that the treaty wording had become binding on the plaintiffs when it\n\nwas issued four months after the defendants became bound by the retrocession. The argument\n\nproceeded on the basis that the arbitration clause in the XOL treaty was valid and binding\n\non the plaintiffs and the only issue was as to whether the wording of the retrocession\n\nslip had been adequate to incorporate that clause into the retrocession agreement. It was\n\ntherefore taken for granted by all parties that the leading reinsurer had been given\n\nauthority by the wording of the leading underwriter clause in the XOL slip to agree to the\n\ninclusion of an arbitration clause in the XOL treaty.100. In view of the foregoing I am satisfied that under English law a leading\n\nunderwriter clause in the terms contained in the slip for contract 3TD69 would authorise\n\nthe leading underwriter to agree on treaty wording which would include an arbitration\n\nclause and that the following underwriters would be bound by such agreement. I note also\n\nthat such a clause would not have an impact on the premium payable as it would have no\n\neffect on the risk covered. It would therefore fall within the parameters of a minor\n\nclause that, as Lord Diplock said, the leading underwriter could agree to even though it\n\nwas not in the slip.101. The next question is whether in this case that actually happened. This is an issue\n\nrelating to the documents produced by Turegum and whether such documents have been\n\nsufficiently proved to be admissible in evidence before me. OUI was not willing to accept\n\nthe treaty wording adduced by Turegum since it had never been given a copy of the same.\n\nFurther, the treaty wording was the only document that Turegum had which evidenced the\n\nagreed terms of the insurance. Turegum was not able to produce a policy between itself and\n\nOUI in relation to this slip. It did however produce an original reinsurance policy\n\nbetween itself as reinsured and National Insurance and Guarantee Corporation (NIGC) dated\n\n10 September 1969 under which it was reinsured by NIGC for 0.5% of the risk covered in the\n\nslip for contract 3TD69. The wording of this policy is identical (except that a different\n\nagent is named in clause 6 for purposes of notice to the reinsurers) to the treaty wording\n\nthat Rose, Thomson had forwarded to Turegum on 22 July 1969.102. Section 92 of the Evidence Act (Cap 97) provides:‘Where any document purporting or proved to be 30 years old is produced from any\n\n  custody which the court in the particular case considers proper, the court may presume\n\n  that the signature and every other part of such document which purports to be in the\n\n  handwriting of any particular person is in that person’s handwriting, and in the case\n\n  of a document executed or attested, that it was duly executed and attested by the persons\n\n  by whom it purports to be executed and attested.’As stated in Sarkar’s Law of Evidence Volume 1, 15th Edition, 1999 (Cap V section\n\n90) this section does away with the strict rules of proof and allows a document to prove\n\nitself. If a document not less than 30 years old is produced from proper custody, and is\n\non its face free from suspicion, the court may presume that the document has been signed\n\nor written by the person whose signature it bears or in whose handwriting it purports to\n\nbe and that it has been duly attested and executed if it so purports to be.103. The two prerequisites for the application on the section are the age of the\n\ndocument and that it has been produced from proper custody. Sarkar makes it clear that the\n\ntime period of 30 years is computed from the date of the document purports to bear and\n\nthat the outer limit of time is the date on which, the document having been tendered in\n\nevidence, its authenticity or otherwise becomes the subject of proof. The presumption is\n\napplicable to documents which were not 30 years old either on the date of suit or on the\n\ndate of production, but were so on the date when arguments were heard or when they were\n\nsought to be proved.104. In this case the documents concerned were produced by Turegum and were obtained by\n\na search of Turegum’s records by its witnesses. I consider Turegum’s custody of\n\nthe documents to have been a proper custody since they were documents relating to\n\nTuregum’s contracts and its transactions. As for the dates of the documents, all\n\nthose that related to contract 3TD69 were more than 30 years old at the time of production\n\nin court in September 2000. On the basis of the section there can be no doubt about the\n\nauthenticity of the original slip for that contract, the cover note prepared by Rose,\n\nThomson, its letter of 22 July 1969 forwarding the agreed wording and the reinsurance\n\npolicy between OUI and NIGC. As stated earlier, attached to the original slip is the\n\ndocument bearing the words ‘Agreed Wording R01692’. That wording is identical to\n\nthe wording attached to the letter of 22 July 1969 and the wording that appears in the\n\nNIGC policy. I am satisfied that that wording was in fact the agreed treaty wording for\n\ncontract 3TD69.105. The proposed treaty wording which had already been agreed by the leading\n\nunderwriter was sent by Rose, Thomson to Turegum as the insured for its comments on 22\n\nJuly 1969. That covering letter stated that unless the brokers heard from Turegum to the\n\ncontrary within 7 days they would assume that Turegum had found the wording to be in order\n\nand would proceed with the preparation of the formal policy documents incorporating the\n\nwording. I think that it is safe to infer that Turegum did not inform the brokers within\n\nthe prescribed period or even thereafter that it objected to the wording. This is because\n\nthe brokers did go on to procure the issue of the NIGC policy which contained identical\n\nwording. They probably also produced a policy between Turegum and OUI but neither that\n\ndocument nor any other referring to it was produced. It appears to have been lost. There\n\nwas, however, an authorisation form signed by Winchester Fox which bears the same\n\nreference number as Winchester Fox’s scratch on the slip i.e. 2/462/69. The evidence\n\nof Turegum’s witnesses was that OUI by signing the authorisation form through\n\nWinchester Fox had authorised the leading company reinsurer to sign a formal policy\n\ndocument. Thus if any formal policy document had come into existence it would have been\n\nsigned on OUI’s behalf.106. If a policy was produced and signed on OUI’s behalf it would have contained\n\nthe same wording as the NIGC policy and thus OUI would have been bound by the arbitration\n\nclause in the policy. Even if no policy was issued, I take the view that OUI is bound by\n\nthe arbitration clause contained in the agreed wording. Although it was anticipated from\n\nthe very beginning that a formal policy document would eventually come into existence,\n\nthis does not mean that until it did so there was no contract and no agreed terms. In this\n\ncase there was an initial contract evidenced by the slip which in itself anticipated\n\nfurther terms coming into existence and binding the parties thereafter. Once these terms\n\nwere agreed the parties would be bound by them notwithstanding that they had not been\n\nembodied in the formal policy document.107. The commentary at para 2-106 of Chitty on Contracts (28th Edition) Vol 1,\n\nindicates there are three possible consequences of an agreement among parties to produce a\n\nformal written contract. One possibility is that the agreement was intended to be\n\nincomplete or not binding until incorporated in the formal document and that document is\n\nduly executed. The second possibility is that such document is intended only as a solemn\n\nrecord of an already complete and binding agreement whilst the third possibility is that\n\nthe main contract is not concluded for want of execution of the formal document but a\n\nseparate preliminary contract comes into existence at an earlier stage.108. The evidence given by Mr Trowbridge and Mr Brian Johnson who had many years of\n\nworking experience in the London insurance market was that the wording would be agreed as\n\nsoon as the lead underwriters had initialled/scratched the same. No evidence to the\n\ncontrary was introduced by OUI. OUI operated in the London market entirely through brokers\n\nwho were familiar with its practices and who would have intended matters to be dealt with\n\nin the normal way and would have expected the normal consequences to flow from their\n\ndealings. Going on the evidence, it appears to me that in the London market the issue of\n\nthe policy document would have been regarded as the solemn record of an already complete\n\nand binding agreement and not as the document creating that agreement. That being the\n\ncase, OUI was bound by the terms of the agreed wording once it was agreed by the leading\n\nunderwriter and not objected to by Turegum.109. In respect of contract 3TD69, therefore, I conclude that it contained the term\n\nproviding for disputes to be referred to arbitration and that OUI is bound by that term. I\n\nalso note the evidence of Mr Jacobs that an English Court, on the basis of the treaty\n\nwording incorporating a London arbitration clause, would conclude either that the treaty\n\nwording contained an arbitration agreement ‘made in writing’ within s 5(2)(a) of\n\nthe 1996 Act or that the treaty wording was written evidence of an arbitration agreement\n\nso that that agreement was ‘evidenced in writing’ within s 5(2)(c) of the 1996\n\nAct.",
        "Contract 3TD70": "110. The stand taken by OUI on this contract is that it has not been established. OUI\n\nhas not agreed to the authenticity or contents of any documents adduced and hence it must\n\nbe taken that they have not been proved. It should be noted however that OUI has in its\n\npossession a photocopy of the original slip produced by Rose, Thomson for this contract.111. The original slip is not in evidence. Turegum was only able to produce a\n\nphotocopy. The contents of the copy slip produced by Turegum and that produced by OUI are\n\nidentical. Both show that the cover was for losses occurring during the 12 months from 1\n\nJanuary 1970 and the interest covered was identical to the interest covered for the\n\npreceding 12 months by contract 3TD69. Among the terms of the slip is a leading\n\nunderwriter clause reading ‘Wording as expiring or as agreed L/U only’. Strictly\n\nspeaking, since there was no evidence that either photocopy was made from the original\n\nslip, neither qualified as secondary evidence of the contents of the original pursuant to\n\ns 65(a) of the Evidence Act. To my mind however, the fact that each party had a photocopy\n\nwhich was identical to that held by the other, was strongly indicative that indeed the\n\nphotocopies were true copies of the original slip and disclosed its contents accurately.112. Turegum was also able to produce an original document which could make up for the\n\nabsence of the original slip. This was a cover note dated 13 January 1970 (and an addendum\n\nno. 1 dated 21 January 1970) issued by Rose, Thomson to Turegum, confirming that the\n\nreinsurance was effected with the schedule of reinsurers mentioned. The reference number\n\nRO1940 appears on the cover note and the addendum. A comparison of the cover note and the\n\nphotocopy of the slip makes it obvious that they relate to the same contract. The period\n\nof insurance, interest, geographical limits, limits, and conditions are identical. It can\n\nalso be seen from the copy slip that a hand-written amendment was made to the clause\n\n‘Premium Hereon’ by inserting the word ‘adjustable’ and this amendment\n\nis reflected in the cover note. The addendum lists the reinsurers that the reinsurance was\n\neffected with. It shows that OUI subscribed two lines, one through Winchester Fox and the\n\nother one directly.113. The cover note was produced as part of a folder printed with Rose, Thomson’s\n\nname and entitled ‘Reinsurance Contract’ followed by details of the insured and\n\nthe type and limits of cover. Inside the folder, apart from the cover note, is a letter\n\ndated 28 May 1970 from Rose, Thomson to Turegum forwarding copies of the wording agreed by\n\nthe leading reinsurer. This letter stated that unless Rose, Thomson heard from Turegum to\n\nthe contrary within 14 days it would assume that Turegum had found the wording to be in\n\norder and would proceed with the preparation of the formal policy documents incorporating\n\nthe wording. That wording also bears the reference number R01940.114. Turegum was not able to produce the original policy for the line written by OUI\n\nthrough Winchester Fox. There was no evidence however that it had disagreed with the\n\nwording as forwarded to it by Rose, Thomson. That it did not may be inferred from another\n\ndocument that Turegum produced. This is an original document signed by OUI containing\n\ntreaty wording which Turegum submits was for the direct line written by OUI. The document\n\nis entitled ‘Turegum Insurance Company Third Party ETC Excess of Loss\n\nReinsurance’ and at its top left hand corner the reference number ‘R.01940’\n\nappears. The first lines of the document read:‘Be it known that we Overseas Insurance Ltd., (hereinafter called the\n\n  “Reinsurers”) agree, in consideration of the premium provided for herein, to\n\n  indemnify Turegum Insurance Company (London Nett Account) (hereinafter called the\n\n  “Reinsured”) for our pro rata proportion of any and all losses the Reinsured may\n\n  sustain as hereinafter provided.’Those lines are followed by 15 clauses including, as clause 15, an arbitration clause\n\nwhich is in identical terms to that found in the treaty wording for contract 3TD69. After\n\nthe arbitration clause the following wording appears:‘Signed in Singapore this 8th day of July 1970. For and on behalf of Overseas\n\n  Union Insurance Ltd., in respect of a 0.620% of 80% participation.’That wording is followed by a rubber stamp setting out OUI’s name in full and the\n\nwords ‘General Manager’. A signature appears in the space between the name and\n\nthe title. The document therefore appears to have been signed on 8 July 1970 by OUI and on\n\nthe basis of s 92 of the Evidence Act, this document which was produced in court in\n\nSeptember 2000 from the custody of Turegum, a party to the contract, has proved itself.115. When that treaty wording is compared with the contents of the photocopy of the\n\nslip many similarities are found. For example, the ‘Insuring Clause’ and the\n\n‘Limit of Liability Clause’ of the treaty wording cover the same ground as the\n\nportions of the slip referring to ‘Interest’ and ‘Limits hereunder’.\n\nUnder clause 1, ‘Insuring Clause’, of the treaty wording it is provided that the\n\nreinsurance shall apply in respect of ‘all loses occurring anywhere in the World\n\nduring the period of 12 months at 1 January, 1970 under all Policies and/or Contracts of\n\ninsurance and/or reinsurance covering Third Party Liability and/or other risks deemed by\n\nthe reinsured to the casualty business’. This wording more or less mirrors the\n\nwording in the slip appearing against the titles ‘Period’ and\n\n‘Interest’. Against the title ‘Geographical limits’ in the slip are\n\nwritten the words ‘World wide’ and this again corresponds with the geographical\n\nlimit found in the ‘Insuring Clause’ in the treaty. The ‘Exclusion\n\nClause’ in the treaty wording is obviously an expansion of the matters stated next to\n\nthe title ‘Exclusions’ in the slip. It is also significant that the treaty\n\nwording numbered R01940 is identical, mutatis mutandi to the treaty wording for contract\n\n3TD69 since the contention is that contract 3TD70 was in fact a renewal of the insurance\n\nfirst placed via contract 3TD69 and is also identical to the treaty wording forwarded by\n\nRose, Thomson to Turegum on 28 May 1970 as being the wording agreed by the leading\n\nunderwriter.116. Turegum was not able to produce the actual policy although it is probable that it\n\nwas issued. In any case, the cover note is prima facie evidence of the existence of the\n\ncontract where the original slip cannot be located. In that event the cover note would be\n\nadmitted as the best available evidence of the terms of the contract. It, together with\n\nthe other documents in the folder, is admissible under s 92 of the Evidence Act.117. I accept the cover note as evidence of the contract 3TD70. I also infer from it\n\nand the other documents produced that there was agreed treaty wording for that contract\n\nand that such wording was identical to that which OUI signed in respect of the\n\nunderwriting line which it wrote directly. It is highly improbable that the wording for\n\nthe reinsurance policy would differ depending on whether the line had been written through\n\nWinchester Fox or directly. In any case, the letter of 28 May 1970 does not indicate that\n\nmore than one set of wording had been agreed.118. Further, Turegum in relation to this contract was also able to produce the\n\noriginal reinsurance policy for this contract for another line subscribed by NIGC through\n\nthe brokers D G Jago & Co Ltd. The clauses in this policy are identical to the clauses\n\nfound in the treaty wording signed by OUI and those forwarded by Rose, Thomson’s\n\nletter of 28 May 1970.119. I therefore hold that OUI was a party to the contract of insurance 3TD70 as stated\n\nin the addendum no. 1 to cover note RO1940 having subscribed for the same both through its\n\nbrokers and directly and that the contract for the portion subscribed to through its\n\nbrokers included an arbitration clause identical to that found in the wording which OUI\n\nsigned for the portion it subscribed to directly. In respect of this contract therefore,\n\nOUI has also agreed to arbitration in London.",
        "Contract 3TD71": "120. The only evidence produced in support of this contract was a document entitled\n\n‘Endorsement attaching to and forming parts of slip no. RO1940’. It contains\n\nonly two typewritten sentences, a handwritten proviso and a number of signatures. The\n\ntypewritten portions read:‘It is hereby noted and agreed that this Contract is extended to the 30th June\n\n  1971 (Losses occurring during basis) at pro-rata of the Minimum and Deposit Premium. ...All other terms, clauses and conditions remain unchanged.’Although the hand-written portion of the endorsement is not entirely legible, it is\n\nclear enough for a reader to understand that it deals with limits and not with the\n\narbitration clause. Though the original endorsement was not produced, OUI and Turegum each\n\nproduced a photocopy of this document and the two copies appear to be more or less\n\nidentical though one copy is considerably clearer than the other. I therefore consider\n\nthat the contents of the original document have been shown to be as in the photocopies.121. Mr Brian Johnson testified that he personally initialled this endorsement on\n\nbehalf of OUI and that since he underwrote solely on behalf of the plaintiffs at that time\n\nthis endorsement committed OUI to an extension of the expiring contract for a further six\n\nmonths. He also testified that the endorsement related to contract 3TD70. His testimony on\n\nthis point was credible. Turegum submitted that it would logically follow that the\n\nextended contract would have been governed by the same terms and conditions, including the\n\narbitration clause, as was originally agreed. I agree. This interpretation is also\n\nsupported by the wording of the endorsement that stated the conditions would remain\n\nunchanged except as specifically written in the endorsement.122. I also consider this evidence of the extension of contract 3TD70 to be excellent\n\nevidence of the original conclusion of that contract. Mr Johnson acting on behalf of OUI\n\ncould not have agreed to a six months extension of a contract on behalf of OUI unless OUI\n\nwas already a party to the initial contract.",
        "Contract 3TG71": "123. This is the other contract in respect of which a copy of the slip is in OUI’s\n\npossession. This contract is the most complete one from the point of view of documents.\n\nTuregum produced a complete set of original documents evidencing this contract. The\n\noriginal slip, reinsurance policy, authorisation form and cover note were tendered in\n\ncourt.124. The copy slip produced by OUI consists of two pages. These two pages correspond to\n\ntwo of the four pages of the original slip and appear to be almost identical to those two\n\npages. However, the photocopy is not clear and some of the endorsements on the original\n\nslip do not appear on the photocopy. The typewritten portions of both documents are\n\nidentical. According to the slip, OUI wrote a line of 7% through Winchester Fox. The\n\nreference on the Winchester Fox stamp on the slip is ‘XL/2/395/71’. The cover of\n\nthe slip contains the handwritten reference 10318/A. According to Mr Brian Johnson’s\n\nevidence, he signed the slip for 7.5% which was subsequently signed down to 6.13% and this\n\ncontract was a renewal of contract 3TD70. The slip is applicable to losses occurring\n\nduring the 12 month period commencing 1 July 1971, i.e. the coverage continues directly\n\nfrom the expiry of the period covered in the endorsement for contract 3TD71. The slip does\n\nnot contain an arbitration clause. It does however, have a clause which reads:‘Wording as expiring or as agreed by leading underwriter.’125. The other two original documents are the cover note dated 10 August 1971 issued by\n\nBellew, Parry & Raven Ltd, the same brokers who issued the slip and a Companies\n\nCollective Reinsurance Policy signed by the leading underwriter and dated 3 March 1972.\n\nThis policy is numbered 10318 which is the same number as appears on the slip. The policy\n\nidentifies OUI as a reinsurer with a 6.13% line. Attached to the policy is the agreed\n\nwording and Clause 10 of this is an arbitration clause providing for arbitration to take\n\nplace in London and the laws of England to govern the arbitration procedure.126. I have already decided that the presence of a leading underwriter clause in the\n\nform found on the slip here would authorise the leading underwriter to agree treaty\n\nwording which included an arbitration clause and that the following underwriters would be\n\nbound by the treaty wording once agreed. The issue in this case is whether the insurance\n\npolicy produced can be admitted in evidence and taken as having been signed with the\n\nauthority of OUI.127. The third original document produced was entitled ‘Authorisation Form’.\n\nIt was stated to be in respect of ‘Collective Policy No. 10318’ and was dated 10\n\nSeptember 1971. It also states the reinsurers’ policy reference number to be\n\n2/395/71. This is the same number that appeared on the slip. This form is clearly\n\nadmissible in evidence since Mr Trowbridge who signed it on behalf of Winchester Fox gave\n\nevidence confirming this fact. The form provided that OUI authorised the leading\n\nunderwriter, Home & Overseas Insurance Co. Ltd. to sign the collective policy on its\n\nbehalf.128. As Mr Brian Johnson explained in his affidavit the authorisation form was issued\n\nand the policy was signed by the leading company underwriter because of the application of\n\nan agreement called the Companies Collective Signing Agreement to which Winchester Fox was\n\na signatory. This agreement allowed the leading company underwriter to sign on behalf of\n\nthe other company underwriters on the slip. The policy itself purports to have been signed\n\non 3 March 1972 by a manager of the Treaty Department of Home & Overseas Insurance Co.\n\nLtd. This person was not called however and since the document is less than 30 years old I\n\nhave to consider whether the original policy may be admitted.129. Section 32(b) of the Evidence Act allows a statement made in the ordinary course\n\nof business and in particular when it consists of a document used in commerce to be\n\nadmitted in evidence even though the maker of the statement is not called as long as the\n\nmaker is dead or cannot be found or his attendance cannot be procured without an amount of\n\ndelay or expense which under the circumstances of the case appears to the court\n\nunreasonable.130. From the evidence before me, as to the course of business in the London insurance\n\nmarket, it is plain that the policy is a document that was made in the ordinary course of\n\ninsurance business. It is a document that was used in commerce. The document is one of a\n\nseries of documents relating to the transaction and is consistent with the other documents\n\nwhich were generated for the transaction as part of the normal course of events. Having\n\nexamined the document, I am satisfied of its physical integrity and that the clauses\n\nattached to the policy were (as shown by the careful placement of the rubber stamp of Home\n\n& Overseas Insurance Co. Ltd.) part of the document when it was signed. I am also\n\nsatisfied that since the document was signed 28 years ago by a person working for a\n\ncompany that is not a party to this action, it would have caused an unreasonable amount of\n\ndelay and expense in what was supposed to be an expedited hearing for a search to have\n\nbeen made for the person who signed the policy or a colleague who could identify his\n\nsignature.131. It should also be noted that up to two days before the first hearing of this case,\n\nOUI had not made it plain to Turegum that it required strict proof of all documents in the\n\ncase. It was this position that caused Turegum to subsequently undertake a wholesale\n\nsearch of its storage facilities and retrieve the original documents which it later\n\nadduced. Turegum also did its best to prove these documents by calling former employees of\n\nWinchester Fox as witnesses. Although Winchester Fox was OUI’s agent, OUI itself made\n\nno attempt to track down witnesses or to ascertain exactly what documents had been signed\n\non its behalf by its agent and whether Turegum’s case was a genuine one. Instead it\n\npreferred to stand on its strict legal right of calling for strict proof of any and every\n\ndocument, even those of which it had copies in its possession.132. In the circumstances, I hold that the policy is admissible in evidence despite the\n\nfact that the maker was not called. I therefore find that OUI was a party to contract\n\n3TG71 and that that contract contained an arbitration clause for arbitration in London\n\nthat bound OUI.Conclusion133. In the light of the conclusions I have come to, the claim of the plaintiffs OUI\n\nmust be dismissed. Turegum has succeeded on its counterclaim in relation to the existence\n\nof the contracts and the arbitration clauses. I therefore make the following declarations:1. The four reinsurance contracts nos. 3TD69, 3TD70, 3TD71 and 3TG71 are valid and\n\n  subsisting and binding on OUI.2. Each of the foregoing contracts contains an arbitration clause whereby parties have\n\n  agreed to submit all disputes arising to arbitration in London.OUI shall pay the costs of the claim and the counterclaim.Sgd:Judith PrakashJudgeCopyright © Government of Singapore."
    }
}