{
    "case_title": "Loh Kok Siew v Public Prosecutor",
    "ncitation": "[2002] SGHC 121",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The facts": "2 The applicant is the general manager of Dennis General Contractor Pte Ltd\n\n(\"Dennis General Contractor\"), a sub-contractor involved in the construction of the\n\nChinatown station along Singapores proposed North East Mass Rapid Transit (\"MRT\") rail\n\nline which is slated for completion at the end of 2002. At or about March 2001, Dennis General\n\nContractor was awarded a contract to supply and install the roof system and various glazing works of\n\nthe Chinatown station and related commercial developments.3 Following a trial, on 25 August 2001, the applicant was convicted by a district\n\ncourt of four charges of abetment by conspiracy to cheat, punishable under s 109 read with s 420 of\n\nthe Penal Code (Cap 224). In total, he was sentenced to three years imprisonment. Bail was granted\n\npending his appeal against conviction.4 On 26 March 2002, however, counsel for the applicant appeared before the High\n\nCourt and applied for leave to withdraw the applicants appeal. I granted the application.5 Counsel also applied for leave to postpone the commencement of the sentence of\n\nimprisonment for two months so as to allow the applicant time to complete outstanding works awarded\n\nto Dennis General Contractor by the end of May 2002. Leave was granted and the applicants\n\nsentence was postponed and ordered to commence on 3 June 2002. Bail was accordingly extended.6 On 21 May 2002, the applicant filed the current criminal motion for an\n\nalteration of the 26 March 2002 order that he be allowed to commence serving his sentence on 1\n\nAugust 2002 instead. On 23 May 2002, I heard and dismissed the application. I now give my reasons.The criminal motion7 Section 223 of the Criminal Procedure Code (Cap 68) (\"CPC\") states:Date of commencement of sentence223.Subject to the provisions of this Code and of the Supreme Court of\n\nJudicature Act, every sentence of imprisonment to which section 221 or 222 apply shall take effect\n\nfrom the date on which it was passed, unless the court passing the sentence or when there has been\n\nan appeal the appellate court otherwise directs.8 The usual position is therefore clear: unless the sentencing court or the\n\nappellate court exercises its discretion to postpone the commencement of a sentence of imprisonment,\n\nsentence shall take effect from the date on which it is passed. An exception is provided in s 234(1)\n\nof the CPC where, if a person who is an escaped convict or is undergoing a sentence of imprisonment\n\nis sentenced to imprisonment, the latter sentence of imprisonment shall commence either immediately\n\nor at the expiration of the imprisonment to which he was previously sentenced as the court awarding\n\nthe sentence directs.9 In the recent case ofLim Teck Leng Roland v PP[2001] 4 SLR 61, Roland\n\nLim was convicted of a number of traffic offences. After having been granted an order allowing him\n\nto delay the commencement of his sentence of imprisonment by two weeks to settle personal and work\n\nmatters, he applied to court on the due date for an order that sentence be postponed for a further\n\ntwo weeks. While noting that I was able to alter my own previous decision and grant an alteration of\n\nthat order to provide for a further postponement of the commencement of the sentence, I rejected\n\nRoland Lims application and stated at  16 :However, this still leaves the issue of when and in what circumstances the High\n\nCourt would consider a further extension of time before serving the sentence. It would be impossible\n\nto lay down a clear-cut guideline. It is possible that during the period of extension, the applicant\n\nmay suffer from illness which necessitates treatment in hospitals or other places where better\n\nfacilities are available. It might be that a further extension would be justifiable as the applicants\n\nclose relative or a member of immediate family happened to suffer from serious illness. Different\n\nconditions and circumstances could arise that would necessitate or justify an order of further\n\nextension of time before serving the sentence. Ultimately, the court would be guided by whether the\n\ninterests of justice require that discretion be exercised to allow the applicant a further period of\n\ntime before he serves his sentence. At the same time, the court must take a robust approach and\n\nensure that the discretion not be abused by frivolous requests from the applicant. The burden is\n\nalways on the applicant to show and explain that the circumstances and conditions are of such a dire\n\nand serious nature or of such urgency that they merit the exercise of discretion by the court to\n\ngrant a further period of time before he serves his sentence.10 In the exercise of the courts discretion, the paramount consideration would\n\nbe the applicants reasons for the further postponement of sentence. In my opinion, the court\n\nshould also have regard to all the circumstances of the case, including the length of time granted\n\nby the court in the first instance, the reasons given in support of that application in the first\n\ninstance and the length of the additional time being sought. Further, seeing as there would be the\n\nattendant need for bail to be extended, the usual considerations with respect to bail being granted\n\nfollowing a conviction would also be relevant. InRalph v PP[1972] 1 MLJ 242.1 AV Winslow J\n\nsuggested that relevant factors include the gravity or otherwise of the offence, the offenders\n\ncriminal record, if any, the possibility of the applicant offending or re-offending whilst at\n\nliberty and whether the security imposed will ensure the attendance of the appellant before the\n\nappellate court. It is obvious that there is a plethora of factors which the court has to take into\n\naccount before a further postponement may be granted, but, as it was stated in Roland Lims case,\n\nthe burden lies on an applicant to satisfy the court that the peculiar circumstances and conditions\n\nin his case necessitate the courts exercise of its discretion to postpone the commencement of his\n\nsentence for a second time. The success of each application depends on the full facts of the case\n\nand the circumstances of the applicant. Ultimately, the courts must adopt a robust approach,\n\nweighing the reasonableness of the applicants request against the justice of the case. While the\n\ncourt should take a humane approach in deserving cases, the discretion to postpone should be\n\nexercised judiciously and only where good reasons exist.",
        "Appropriate length of a postponement": "11 In deserving cases where the court is minded to extend time, I noted that the\n\nonly provision in the CPC which provides for the suspension of the execution of the sentence is\n\nfound in s 225 which states:Suspension of execution in certain cases225. When an offender has been sentenced to fine only and to imprisonment in\n\ndefault of payment of the fine and the court issues a warrant under section 224, it may suspend the\n\nexecution of the sentence of imprisonment and may release the offender on his executing a bond with\n\nor without sureties, as the court thinks fit, conditioned for his appearance before that court on\n\nthe day appointed for the return of the warrant, such day not being more than 15 days from the time\n\nof executing the bond, and in the event of the fine not having been realised the court may direct\n\nthe sentence of imprisonment to be carried into execution at once.12 In cases where an offender has not been sentenced to only a fine and to\n\nimprisonment in default of that fine, s 225 of the CPC would not apply. Nevertheless, I regarded the\n\nspirit behind s 225 to be instructive and held that unless the circumstances in the case are\n\noverwhelmingly urgent thereby requiring the applicants immediate attention, or if the interests\n\nof justice otherwise demands it, the court granting a postponement of the commencement of a sentence\n\nof imprisonment should not ordinarily grant reprieve in excess of 15 days.",
        "The current application": "13 In the current case, the applicant stated at  6 of his supporting affidavit\n\nthat Dennis General Contractors outstanding works could not be finished on time and that he was\n\n\"rushing to complete the projects in time so as not to disrupt the opening of the North-eastern\n\nline of the MRT\". He further stated that he had \"been instructed to personally supervise\n\nthe works undertaken to ensure that the MRT project will complete on time.\" In support of his\n\napplication, the applicant attached a letter addressed to Dennis General Contractor dated 17 May\n\n2002 from the construction manager of the awarding contractors, Mero Asia Pacific Pte Ltd (\"Mero\")\n\nstating:In order to complete the project in time and to minimise disruption to the\n\nestimated time of completion, you are hereby required to do the following:(a) Complete your sub-contract works before mid July 2002.(b) Give the sub-contract works your personal supervision during this critical\n\n  phase of the project, and provide updates of the progress of your works.Please note that we have instructions from the main contractors to complete the\n\nproject within the time frame given to us. Please note that we require you to give your personal\n\nattention to this project, meaning that we require your physical presence at the job site.14 The contents of Meros letter did little to advance the applicants case.\n\nNotably, there was no mention that the sub-contract works had been delayed and if any delay was\n\ncaused by unforeseen circumstances beyond the applicants control. All that was before the court\n\nwas the applicants bare assertion that the sub-contract works could not be completed on time. In\n\nmy view, this was simply not good enough. On 26 March 2002, the applicant had successfully applied\n\nto the court for a two month extension on the basis that he was building the Chinatown station. He\n\nwas therefore precluded from coming before the court again to apply for a further extension using\n\nthe same reason. On that date, the court weighed the public interest factor heavily in his favour\n\nand granted the exceptional two month postponement. Even if the applicants assertion was true,\n\ngranting a further postponement of the sentence would send out a wrong message that the interests of\n\njustice may be made subordinate to other considerations. Justice cannot be made to wait indefinitely\n\nfor the applicant to commence his sentence.15 In any event, I was not inclined to grant a second postponement in the light\n\nof the circumstances: Dennis General Contractors contracts were awarded around March 2001. The\n\nproceedings relating to the applicants trial at the district court were held on various dates in\n\nMarch, April, July, August, and September 2001. By 25 August 2001, the applicant was already\n\nconvicted. At that stage, he should have made final arrangements for a replacement to be found to\n\nsupervise the work or for Dennis General Contractors contractual liabilities to be taken over by\n\nanother contractor in the event that bail pending his appeal would not be granted. In any case, the\n\napplicant was granted reprieve when bail was granted. When he applied to withdraw his appeal on 26\n\nMarch 2002, the court further indulged him by granting him a total extension of two months eight\n\ndays for the commencement of his three year sentence. In the circumstances, the applicant had\n\nclearly been granted more than enough time to settle his work commitments.16 Further, I rejected the applicants contention that his \"personal\n\nsupervision\" and \"physical presence\" at the site were required. It was not as if the\n\nsub-contract works were of such a complex nature that required his special and unique expertise.\n\nDennis General Contractor was merely engaged to provide and install roofing and glazing works for\n\nthe Chinatown station and an alternative contractor or supervisor could easily be found. In any\n\ncase, the applicant had a further ten days from the date of the hearing of the motion to the\n\nscheduled date for the commencement of his sentence to settle his affairs. This ought to be\n\nsufficient.Conclusion17 For the reasons given above, the criminal motion was dismissed. Accordingly,\n\nthe applicant should adhere to the 26 March 2002 court order and surrender himself to the prison\n\nauthorities on 3 June 2002 to commence serving his sentence.Sgd:YONG PUNG HOWChief JusticeRepublic of SingaporeCopyright © Government of Singapore."
    }
}