{
    "case_title": "Cendekia Candranegara Tjiang v Yin Kum Choy and Others",
    "ncitation": "[2002] SGHC 136",
    "coram": "MPH Rubin J",
    "sections": {
        "Evidence": "6\n\n        The plaintiff’s evidence was to the\n\nfollowing effect. He is in his forties, educated in Bahasa Indonesia, and is engaged in a\n\nbusiness in Surabaya, Indonesia dealing with glass and furniture. He had known the Kwan\n\nbrothers, directors of the company for more than 10 years. Sometime in September 1999,\n\nKFC, the third defendant approached the plaintiff and told him that his company had not\n\nbeen doing well and that he was looking for a buyer for the company. KFC suggested that\n\nthe plaintiff speak with the company’s judicial manager to enquire if the latter was\n\ninterested. As a result, the plaintiff visited Singapore in September 1999 and met with\n\nKFC and subsequently the first defendant. It might perhaps be helpful at this stage to\n\nreproduce paras 3 to 15 of the plaintiff’s affidavit of evidence-in-chief to fully\n\nappreciate the background which led to the present dispute. They are as follows:3. I visited Singapore in\n\n    September 1999 and met with the 3rdDefendant. He explained that the company\n\n    was facing difficulties, and was presently under the supervision of the 1stDefendant.4. The 3rdDefendant\n\n    requested that we assist him by taking over the Company at the price of about S$4 million\n\n    and a personal debt of S$600,000.00. The 3rdDefendant promised that the 1stDefendant would have to be consulted.5. The 3rdDefendant\n\n    informed me that if the deal went through the 1stDefendant would then help me\n\n    find a Bank to finance the amount of S$3 million and the remainder of S$1.6 million were\n\n    to be funded by me. With these funds I could assist to save him and his families and his\n\n    brother and his families from bankruptcy.6. The 3rdDefendant\n\n    also told me that the sale of the company and its related companies will also include\n\n    trade marks and goodwill.7. The 3rdDefendant\n\n    then arranged a meeting with the 1stDefendant. The 1stDefendant\n\n    said no contract could be entered outright, he preferred the Memorandum of Understanding\n\n    and later we would have several Agreements to embody the terms.8. The 1stDefendant\n\n    said I have to pay earnest money which would be 10% of the purchase price. He also told me\n\n    that this money would be safe. It can earn interest on the 10%. If the parties enter into\n\n    a formal contract this would become part of the purchase price. I believe what he said.9. I did not consult any lawyers\n\n    as I felt that this was a preliminary understanding and with the advice of my solicitors,\n\n    the formal agreements would be properly studied concluded and executed in December 1999.\n\n    The Memorandum of Understanding was signed on 10thNovember 1999. A photocopy\n\n    of the same is annexed and marked \"CCT 2\".10. The 1stDefendant\n\n    told me that in order to facilitate, I would have to form a new company which will\n\n    eventually take over the business of the company. As time was running short, he wanted\n\n    this company to be incorporated as he expected the Agreement for the sale of the company\n\n    to be reached by December 1999.11. The 1stDefendant\n\n    said that a Company need to be incorporated with a $2.00 paid up capital and later the\n\n    capital would be enlarged.12. I agreed to pay the necessary\n\n    fee for the registration of the Company and the Company known as IS Glass Pte Ltd was\n\n    incorporated with a paid-up capital of $2.00.13. However, no Agreements were\n\n    prepared by December 1999 and the Draft Agreements were only sent to me in April 2000. I\n\n    then consulted my present solicitors, Messrs. Hin Rai & Tan. My solicitors and I had a\n\n    meeting with the 1stDefendant together with the 2ndand 3rdDefendants.14. I as the Plaintiff has to\n\n    consider the following terms:-a) The fact that the Company was\n\n      under Judicial Management, the usual complexities in matters like finance, management,\n\n      employees and operation problems arise. The Company has also claims by many creditors,\n\n      some of them are banks with substantial loan.b) The taking over of Company as\n\n      a going concern and thus many detailed aspects of the business operation have to be looked\n\n      into, such as checking and verification of stock, materials, finished products, plants,\n\n      machinery, equipments, accounts, statutory documents, taxation, litigation matters,\n\n      employees, sales data and forecasts, creditors and debtors lists, customers lists, etc.c) In short, a very thorough due\n\n      diligence needs to be done before a decision can be made as to whether or not the\n\n      Plaintiff would like to proceed with the purchase.15. In January 2000, the 3rdDefendant and I went to Europe to explore the market but before we can finish the task,\n\n    the 3rdDefendant returned to Singapore. He wanted higher salary but I was not\n\n    prepared. The salary of the 2ndand 3rdDefendants was fixed at\n\n    S$5,00.00 per month and I was surprised that they were asking for higher salary. When I\n\n    did not agree, he became very upset and in fact asked me not to proceed with the sale and\n\n    he would search for a new investor. Then in April 2000, the 3rdDefendant\n\n    approached me again. The 3rdDefendant informed me that he cannot get a\n\n    purchaser for the Company.7\n\n        The plaintiff commented on the various clauses\n\nin the draft agreements forwarded to him and found them to be unacceptable. According to\n\nhim, some of them were not in accord with the terms found in the memorandum; some were\n\ntotally new and plainly one-sided to safeguard the interests of the Kwan brothers. Having\n\nfound them unacceptable, he consulted his solicitors and hence the present action. In the\n\nmain, he claimed that the MOU he signed was only a preliminary document; it did not\n\ncontain all the terms; and that the parties had to work out and agree on the terms of the\n\nsubsequent agreements envisaged in the said MOU. He complained that the time schedule\n\nprescribed in the MOU, in relation to the preparation and execution of the formal\n\nagreements was not complied with by the first defendant for several months. This was due\n\nto the laxity of the first defendant and his legal advisers.8\n\n        Amplifying the dispute he had with KFC in\n\nrelation to KFC’s remuneration, he said (page 294 of the NE) that KFC had told him\n\nover the phone that if the latter was not offered $12,000 a month ($7,000 over the sum of\n\n$5,000 per month stipulated in the MOU), KFC wanted the plaintiff to withdraw from the\n\ndeal and that KFC would get someone else to buy the company. According to the plaintiff,\n\nthe problem he was facing with the Kwan brothers was discussed by the parties at a meeting\n\nheld on 26 February 2000 at the Grand Plaza Hotel at Coleman Street, Singapore, where he,\n\nthe Kwan brothers, the first defendant and his manager Ramasamy were present. He said that\n\nat that meeting the Kwan brothers wanted one month to look for another investor (see the\n\nevidence of the first defendant at pages 777 and 882 of the NE). The plaintiff made it\n\nplain that he was not running away from the deal and in this regard he made reference to\n\nhis solicitors’ letter dated 11 August 2000. In that letter his solicitors set out\n\nthe plaintiff’s counter-proposals in response to the numerous complex and some\n\naltogether new terms appearing in the eight draft agreements forwarded to the plaintiff by\n\nthe first defendant or their solicitors between 19 April and 26 July 2000 (see AB-693 and\n\nAB-744), although the said agreements were required to be executed by 1December\n\n1999 under the MOU. Another aspect which emerged during the testimony of the plaintiff was\n\nthat he did not visit Singapore nor did he attempt to participate in the affairs of Newco\n\nsince his fall-out with the Kwan brothers from about 26 February 2000. He confirmed\n\nhowever that the Kwan brothers, the first defendant and his manager Ramasamy met him at\n\nthe Changi Airport on 8 April 2000 in relation to the deal which was under strain.9\n\n        Before dealing with the evidence adduced on\n\nbehalf of the first defendant, reference ought to be made to the MOU around which the\n\nwhole action revolved. The said MOU, insofar as is material, reads as follows:Memorandum Of UnderstandingThis Memorandum of\n\n      Understanding (\"MOU\") is dated the 10thday of November 1999 and\n\n      entered among:1. Mr Cendekia Candranegara\n\n      Tjiang (\"the Investor\") of Jl Dukuh Kupang Komp, Bintang Diponggo Kav. 833,\n\n      Surabaya 60256, Indonesia, holder of Indonesian Passport No. H 304263.2. Mr Yin Kum Choy, the Judicial\n\n      Manager (\"the JIM\") of Yuan Guang Building Materials Pte Ltd (\"YGBM\"),\n\n      who is also the Special Accountant of Yuan Guang Safety Glass Pte Ltd (\"YGSG\"),\n\n      Quarz Trading (\"QT\") and Quarz Trading Pte Ltd (\"QTPL\").3. Mr Kuan Yew Choong\n\n      (\"KYC\") and Mr Kwan Fatt Cheong (\"KFC\"), the directors and\n\n      shareholders of YGBM and directors of YGSG.4. Ms Ho Choy Lun\n\n      (\"HCL\") and Ms Tjhan Soei Ngan (\"TSN\"), the directors and shareholders\n\n      QTPL and partners of QT, who are also the respective spouses of KYC and KFC.Whereas1. YGBM, YGSG, QTPL and QT\n\n      (collectively referred to herein as \"the Group\") are companies incorporated in\n\n      Singapore with their registered offices at 10 Tuas Crescent Singapore 638704. QT is a\n\n      partnership registered as a partnership in Singapore.2. The Investor is interested to\n\n      buy:(a) the land and building of YGBM\n\n        which is mortgaged with Four Seas Bank, a member of Overseas-Chinese Banking Corporation\n\n        Group.(b) the laminating machine line\n\n        of equipment and related accessories of YGBM which are financed with OUT Ltd, Maybank\n\n        Finance and DBS Finance.(c) the tempering machine line of\n\n        equipment and related accessories of QTPL which are financed through Sembawang Capital Pte\n\n        Ltd.(d) the double glazing line of\n\n        equipment and related accessories of QT which are financed with UOB Ltd.(e) the uncharged assets of YGBM.(f) all the trademark and trade\n\n        name in the Group and more particularly the trademark and trade name \"Yuan\n\n        Guang\".(collectively referred to a\n\n      \"Assets\") from the respective companies and/or financial institutions which may\n\n      claim title and/or who have an interest in the above-said Assets. The details of the\n\n      Assets are set out in Appendix 1 of this MOU.3. The Investor besides having an\n\n      interest to acquire the Assets is also interested in employing certain of the personnel\n\n      currently employed in the Group.4. The Investor is also desirous\n\n      of retaining one or more names of the companies in the Group for the purpose of the\n\n      operations to continue under a company to be incorporated (the \"Newco\").5. The Investor is interested to\n\n      buy the Assets for a total consideration of S$4,028,000 (\"the Consideration\"),\n\n      excluding GST, subject to terms and conditions herein stated.6. The sellers for each of the\n\n      Assets being the respective company in the Group having title to the Assets are agreeable\n\n      in selling the Assets subject to obtaining the requisite consent from the respective\n\n      financial institution (\"the Secured Creditor\") and the Court, where necessary.7. The Investor is also desirous\n\n      of retaining KYC and KFC as directors and shareholders of the Newco to manage the affairs,\n\n      business and properties of the Newco and in this connection is willing to earmark an\n\n      approximate sum of $600,000 (\"the VA sum\") to facilitate the entire payment of\n\n      composition amounts under the voluntary arrangements of KYC, KFC, HCL and TSN.8. The Investor, in consideration\n\n      of KYC and KFC participating as directors and shareholders of the Newco, proposes to enter\n\n      into a shareholder agreement with KYC and KFC the terms of shareholding, profit-sharing\n\n      and remuneration to be agreed upon between KYC and KFC and the Investor.9. KYC, KFC, HCL and TSN are\n\n      currently negotiating with their personal creditors for a composition of the amount owed\n\n      to these creditors. KYC, KFC, HCL and TSN are also exposed to several creditors under the\n\n      various companies in the Group, KYC and KFC have already applied for individual voluntary\n\n      arrangements under Part V of the Bankruptcy Act. HCL and TSN are seeking a similar\n\n      voluntary arrangement on an informal basis with their respective creditors.The Investor, The Jm, Kyc,\n\n      Kfc, Hcl And Tsn Agree As Follows:1. The Investor shall\n\n      through the Newco acquire the Assets for the Consideration subject to written approval\n\n      being received from each Secured Creditor to be paid for each of the Assets out of the\n\n      Consideration and the Court, where necessary. A schedule of the tentative amount to be\n\n      paid to each of the Secured Creditor is set out in Appendix II of this MOU.2. The Investor shall enter into\n\n      the relevant agreements (the \"Contracts\") with the JM and with the directors of\n\n      the respective company in the Group which terms and conditions will be agreed upon at a\n\n      later date.3. The Consideration shall be\n\n      paid as follows:(a) 10% (or $402,800) to be paid\n\n        to the JM as earnest money within 2 weeks from the signing of the MOU.(b) 20% (or $805,600) to be paid\n\n        to the JM upon signing of the Contracts.(c) The remaining 70% and the\n\n        respective GST to be paid within 4 weeks from the signing of the Contracts. The Investor\n\n        shall with the assistance of the JM negotiate with each of the Secured Creditor as to the\n\n        financing arrangement for this 70% and/or alternatively endeavour on his own to procure\n\n        such financing facility from his existing banker.4. The Investor shall pay for the\n\n      VA sum as follows:(a) 10% (or $60,000) to be paid\n\n        to the JM, acting as the Nominee of KFC and KYC and nominated person to administer the\n\n        informal voluntary arrangement for HCL and TSN, within 2 weeks from the signing of the\n\n        MOU.(b) 20% (or $120,000) to be paid\n\n        to the JM upon signing of the Contracts.(c) the remaining 70% to be paid\n\n        within 4 weeks from the signing of the Contracts and in any case shall be paid no later\n\n        than 24thDecember 1999.5. The Investor shall arrange to\n\n      incorporate the Newco to commence operation with effect from 1stDecember 1999.6. The Investor shall transfer\n\n      the employment of all necessary personnel for the Newco with effect from 1stDecember 1999.7. The Investor shall pay such\n\n      rates and fees to the respective companies in the Group for the use of the Assets with\n\n      effect from 1stDecember 1999 until the day when title to all such assets is\n\n      transferred to the Newco should transfer of title for such Assets be delayed beyond 1stDecember 1999.8. The Investor under the Newco\n\n      shall apply to open such accounts as PUB, Telecom accounts and the like to be operated\n\n      effective from 1stDecember 1999.9. The JM, KYC, KFC, HCL and TSN\n\n      shall endeavour to assist the Investor as regards to the matters referred in Para 5 to 8\n\n      in connection with the Newco operating effectively with effect from 1stDecember 1999 provided the Contracts are signed before 1stDecember 1999.10. The JM shall procure the\n\n      written agreement of the Secured Creditors as to the tentative amount to be paid to each\n\n      of the Secured Creditor as set out in Appendix II of this agreement.11. The JM, who is also the\n\n      Nominee of KYC and KFC under their respective voluntary arrangements and the nominated\n\n      person to handle the informal voluntary arrangements of HCL and TSN, shall procure the\n\n      written agreement of each of the secured creditors to agree to approve the composition\n\n      amounts proposed by KYC, KFC, HCL and TSN to be paid to each of the Secured Creditors\n\n      under the respective voluntary arrangements, both formal and informal.12. KYC and KFC shall enter into\n\n      a binding shareholder agreement with the Investor under the Newco before 1stDecember 1999 on the following salient terms and conditions:(a) The shareholding in Newco\n\n        will be in the proportion of 70% in favour of the Investor, 15% in favour of KYC and 15%\n\n        in favour of KFC.(b) KYC and KFC shall be entitled\n\n        to increase their respective shareholdings in the Newco to a maximum of 50% (25% in favour\n\n        of KYC and 25% in favour of KFC) from the initial shareholding of 30%.(c) The Consideration to be paid\n\n        by the Investor shall be divided under the Newco into a paid-up capital of S$1 million and\n\n        the remaining S$3 million (save for such part thereof which is to be financed by new\n\n        financial institutions under the Newco) treated as a loan by the Investor to the Newco.\n\n        The Investor shall be entitled to charge the assets of the Newco as are deemed necessary\n\n        to secure such amounts advanced by the Investor. The Newco shall enter into such\n\n        agreements with the Investor as are necessary as regards to the repayment to the Investor\n\n        of the S$3 million loan as well as how the assets of the Newco may be charged for this S$3\n\n        million loan.(d) 30% of the paid-up capital\n\n        (\"30% shares\") of the Newco which is paid for by the Investor pursuant to (c)\n\n        above shall be treated as an amount paid for by the Investor on behalf of KYC and KFC\n\n        pursuant to the shares that KYC and KFC is entitled to pursuant to (a) above. The 30%\n\n        shares shall be issued in the respective names of KYC and KFC and shall be pledged to the\n\n        Investor and shall remain so pledged as security until such time when these shares are\n\n        paid for pursuant to k (i) below.(e) KYC and KFC and the Investor\n\n        shall be entitled by virtue of their respective shareholdings to share the net profit\n\n        after tax (\"NPAT\") on the basis of their respective shareholding for all NPAT\n\n        recorded for each financial year.(f) KYC and KFC shall together\n\n        (individually 5%) be entitled to a bonus (\"Bonus\") of 10% of the profit before\n\n        tax before the NPAT is shared pursuant to clause (e) above.(g) KFC and KYC shall each be\n\n        entitled to the Bonus commencing from the financial year 2001 inclusive (1stJanuary to 31stDecember). KYC and KFC shall not be entitled to any Bonus for\n\n        the year 2000, being the first year of operation of the Newco.(h) KYC and KFC shall be entitled\n\n        to a monthly remuneration of $5,000 each, subject to be changes upon mutual written\n\n        agreement with the Investor.(i) KYC and KFC, and HCL and TSN\n\n        shall be indebted jointly and severally to the Investor for the estimated amount of\n\n        $600,000 to be advanced by the Investor in his personal capacity towards the VA sum\n\n        expected to be paid under the respective voluntary arrangements, both formal and informal\n\n        of KYC, KFC, HCL and TSN.(j) The Investor shall also be\n\n        entitled to debit the current accounts of KYC and KFC in the books of the Newco for the\n\n        indebtedness of $600,000 arising from the respective voluntary arrangements, both formal\n\n        and informal of KYC, KFC, and TSN.(k) KYC and KFC’s\n\n        entitlements to dividends (computed pursuant to (e) above) would be utilised in the\n\n        following order of priority:(i) To pay the Investor and/or\n\n          credit the account of the Investor in the books of the Newco towards the indebtedness of\n\n          KYC and KFC for the 30% shares stated in (d) above.(ii) To credit their respective\n\n          current accounts towards the amount of $6000,000 to be advanced by the Investor towards\n\n          the VA sum expected to be paid under the respective voluntary arrangements, both formal\n\n          and informal of KYC, KFC, HCL and TSN.(iii) To pay to KFC and KYC in\n\n          cash any excess remaining after (i) and (ii) above are credited, provided both the cash\n\n          position and future cash flow position of the Newco permit such cash payments.(l) Both KYC and KFC shall agree\n\n        to work diligently with the JM who will be supervising and monitoring the activities of\n\n        the Newco on behalf of the Investor at a professional fee to be agreed under the Newco.13. All parties shall agree to\n\n      bear their respective share of all legal and other costs in undertaking their obligation\n\n      under the MOU and the Contract.14. Both the Investor on the one\n\n      part and KYC and KFC on ther other part including their agents shall undertake to keep all\n\n      matters relating to all terms of this MOU strictly confidential and shall not disclose any\n\n      information obtained under or pursuant to this MOU to any third party.15. The JM who is also the\n\n      Nominee, shall, however, be entitled to disclose to any third party, as he may deem\n\n      necessary, all matters relating to all terms of this MOU and any information obtained\n\n      under or pursuant to this MOU.16. All parties undertake to do\n\n      all things within its power which are necessary or desirable to give full effect to the\n\n      spirit and intent of this MOU.17. The 10% earnest money\n\n      (referred to in 3(a) above) deposited with the JM shall not be refundable should the\n\n      Investor decide not to sign the Contracts and no further action shall be taken against the\n\n      JM by the Investor to recover this 10% earnest money. The 10% earnest money, forfeited in\n\n      such an instant, shall be deemed to be an amount the JM is entitled to in consideration of\n\n      the JM not considering the other offers received by the JM for the Assets of the Company.18. This MOU is subject to the\n\n      requisite consent and/or approval of the Secured Creditors of the Group and the Court,\n\n      where necessary. In the event the Secured Creditors of the Group and/or the Court fail to\n\n      provide such requisite consent and/or approval, where necessary, to the Contracts and any\n\n      agreements that may be executed pursuant to this MOU, the parties shall not be liable to\n\n      any party to this MOU.19. Any dispute(s) arising out of\n\n      or in connection with this MOU including any question regarding its existence, validity or\n\n      termination shall be governed by the laws of the Republic of Singapore and parties shall\n\n      submit to the jurisdiction of the Courts of the Republic of Singapore.[Signed by parties]10\n\n        The evidence of the first defendant was to the\n\nfollowing effect. He was appointed initially the interim judicial manager of the company\n\nby an order of court dated 5 October 1998 and later as its judicial manager by a later\n\ncourt order dated 18 February 1999. Besides being the judicial manager of YGBM, he was as\n\nfrom 16 October 1998, the special accountant of Quarz Trading (‘QT’), Quarz\n\nTrading (Singapore) Pte Ltd (‘QTSPL’) and Yuan Guang Safety Glass Pte Ltd\n\n(‘YGSG’), being companies related to YGBM, either through common shareholdings\n\nor through common management control exercised by persons related to the directors of the\n\ncompany. Both the Kwan brothers, KYC and KFC are directors and shareholders of the\n\ncompany. They are also the directors of YGSG, a subsidiary of the company. The respective\n\nwives of KYC and KFC, Ho Choy Lun (‘HCL’) and Tjhan Soei Ngan (‘TSN’)\n\nare directors and shareholders of QTSPL. HCL and TSN are also partners of QT. The first\n\ndefendant was also the personal adviser of KYC , KFC and their respective wives.11\n\n        It would appear from the account narrated by\n\nthe first defendant that his appointment as special accountant and personal adviser to the\n\nKwan family and their business ventures was through private arrangement between him and\n\nthe Kwan family. There was more to come. Sometime between June 1999 and September 1999,\n\nowing to demands made by several creditors against KYC and KFC, both KYC and KFC had\n\napplied for a voluntary arrangement under the provisions of the Bankruptcy Act (Cap 20)\n\nand in the event the first defendant was appointed as their Nominees on 24 June 1999 and 6\n\nSeptember 1999 respectively. The reasons why he accepted appointment as nominee of KYC and\n\nKFC appear from paras 20 to 24 of his first affidavit of evidence-in-chief and they read\n\nas follows:20. I accepted appointment as\n\n    Nominees of KYC and KFC for various reasons. The majority of debts owed by both KYC and\n\n    KFC and their respective spouses primarily arose from guarantees extended by them for\n\n    loans and advances made by these creditors to companies in the Group. I therefore\n\n    essentially had to deal with the same creditors. Further, both KYC and KFC were essential\n\n    to me to assist me with the judicial management administration of the Company. They were\n\n    crucial elements to the overall plan contemplated under the judicial management\n\n    administration of the Company to rescue and recover the Company which was inextricably\n\n    linked to other companies in the Group. In addition, the composition sums if any that were\n\n    to be paid to the personal creditors of both KYC and KFC under their respective voluntary\n\n    arrangements were substantially meant to advance the recovery to the secured creditors of\n\n    the Group.21. Besides attending to the\n\n    various operational and financial issues of the companies in the Group, I was also\n\n    actively seeking to locate investors interested in either acquiring an interest to\n\n    participate into the Group or to buy outright the assets and operations of the Group and\n\n    to possibly involve KYC and KFC in subsequent operations. The participation of a potential\n\n    investor was essential if any possible recovery for the creditors of the Group was to be\n\n    considered.22. Based on my initial review of\n\n    the Group, it was evident to me that the Group was insolvent. The estimated realisable\n\n    value of the assets available for distribution to the unsecured creditors was negligible.It was also evident, and I have\n\n    also reported to both the Court and the secured creditors of the Group, that the turnover\n\n    of the Group barely sustained the operations, let along meet any interest payments or\n\n    principal repayments to the secured creditors of the Group.There was therefore agreement\n\n    among the secured creditors of the Group to continue with the operations of the Group as\n\n    they were and to maintain the assets of the Group in as intact a manner as possible until\n\n    a potential investor could be located to acquire all the assets of the Group as a single\n\n    on-going package. There was agreement among the secured creditors that this\n\n    strategy/approach of a rescue/recovery plan would maximise the realisable values of the\n\n    assets of the Group.23. The secured creditors\n\n    (\"Secured Creditors\") of the Group are:a.    OCBC Finance\n\n      Ltd (Four Seas Bank Ltd) (for exposure under the Company)b.    Overseas\n\n      Union Trust Ltd (for exposure under the Company)c. United Overseas Bank Ltd (Far\n\n      Eastern Bank Ltd) (for exposure under QT)d. DBS Finance Ltd (for exposure\n\n      under the Company)e. Maybank Finance Ltd (for\n\n      exposure under the Company)f. Sembawang Capital Pte Ltd (for\n\n      exposure under QTSPL)24. I have therefore since my\n\n    appointment as the Judicial Manager of the Company been negotiating with various potential\n\n    investors, some of whom were introduced by both KYC and KFC.12\n\n        The first defendant, after sketching out his\n\nendeavours to obtain the best deal for the company that would please the secured\n\ncreditors, narrated the circumstances under which he met the plaintiff. He said that the\n\nplaintiff was introduced to him by KYC and KFC on 27 August 1999 and he also met him later\n\non 11 September 1999. He said by the end of August 1999, the amount required for the\n\nvoluntary arrangements of both KYC and KFC was in the region of $250,000 (‘VA\n\nsum’) with further sums to be made available by KYC and KFC to their personal\n\ncreditors from profits and remuneration to be earned by them from new operations. At about\n\nthis time, he had also learnt from the company’s secured creditors that they were not\n\nprepared to consider any offer less than $4 million for the sale of the assets of the\n\ncompany.13\n\n        By noon of 9 November 1999, the first defendant\n\nhad received two written bids in response to his invitation to bid for the assets of the\n\ncompany. The plaintiff arrived at his office on 9 November 1999 accompanied by KYC and KFC\n\nat around 11.45 am. The first defendant then informed the plaintiff that if he were to\n\nconsider the plaintiff’s bid, ‘it would have to be one that maximised the return\n\nfor the secured creditors of the Group as well as one which catered to the aspects of\n\nremuneration, equity and the like relating to both KYC and KFC in the operations of the\n\nnew company (‘Newco’) to be established by the investor to absorb the assets and\n\noperations of the Group’ (see para 60 of his affidavit of evidence-in-chief).14\n\n        As it transpired, the first defendant found the\n\nbid of the plaintiff more favourable than the two bids he had received in terms of price\n\nas well as the interests of various interested parties. He then advised that he would\n\nproceed to draw up the MOU for signing. In the event, on 10 November 1999, the MOU was\n\nsigned by the plaintiff KYC, KFC and himself at his office. Copies of the signed MOU were\n\nthen handed to KYC and KFC to procure the signatures of their respective spouses. They\n\nwere duly signed later and consequently he instructed his then solicitors, David Lim and\n\nPartners to prepare all requisite contracts and agreements relating to the said MOU. In\n\nrelation to the agreements to be executed by the parties, the first defendant averred in\n\npara 118 of his affidavit that on 19 April 2000, his manager Ramasamy handed to the\n\nplaintiff the draft of all the agreements that were to be entered into pursuant to the\n\nMOU. (This assertion was later retracted, accompanied by a claim that only four draft\n\nagreements were in fact handed over to the plaintiff on 19 April 2000, the remaining four\n\nbeing only mirror images of those handed to the plaintiff, were forwarded to the\n\nplaintiff’s solicitors on 26 July 2000).15\n\n        The first defendant, in outlining the\n\ndevelopments since the signing of the MOU, said that his manager Ramasamy and his senior\n\nassistant Yap Chee Leong assisted the plaintiff to prepare amongst other things, a\n\ncash-flow report in relation to the company financial information including forecast for\n\nthe Newco, the personal and business profile of the plaintiff and other details in order\n\nfor the plaintiff to procure suitable banking facilities. The first defendant added that\n\nsometime in mid-November 1999, the plaintiff along with KYC and KFC instructed his\n\nassociate company, Yin Services Pte Ltd, a corporate secretarial firm, to proceed with the\n\nincorporation of the Newco called ‘IS Glass Pte Ltd’. He added that the\n\nincorporation was promptly done, bank accounts were opened in the name of Newco, and as\n\nfrom 1 December 1999, the plaintiff even remitted monies for Newco. (The supporting\n\ndocuments produced at the trial revealed that the plaintiff was not the registered\n\nshareholder of Newco, although he was one of the authorised signatories to the bank\n\naccount together with the Kwan brothers, the first defendant and his manager Ramasamy).16\n\n        The first defendant testified that although the\n\nMOU was signed on 10 December 1999, the 10% deposit/earnest money was not paid until 29\n\nDecember 1999. As regards developments which took place in the course of December 1999 and\n\nFebruary 2000, including the unhappy differences between the plaintiff and the Kwan\n\nbrothers, what the first defendant averred in paras 95 to 113 of his affidavit of\n\nevidence-in-chief is as follows:95. Between 8 December 1999 and\n\n    24 January 2000, Cendekia had remitted and/or advanced for the account of IS Glass Pte Ltd\n\n    a sum of about S$300,000. A copy of the ledger account of IS Glass Pte Ltd relating to the\n\n    account of Cendekia with IS Glass Pte Ltd is annexed herewith and exhibited as\n\n    \"YKC-37\". I also refer to the above paragraph 82 and my exhibit\n\n    \"YKC-26\" which are to be read together as to the amounts advanced by Cendekia\n\n    for IS Glass Pte Ltd’s operations.96. In the meantime, on 5 January\n\n    2000, when Cendekia came to Singapore to attend to the secretarial matters of IS Glass Pte\n\n    Ltd and to meet several bankers as regards the financing sought to fund the acquisition of\n\n    the Group’s assets and operations, a meeting was arranged by me between him and\n\n    Heller Asia Capital (S) Ltd. This meeting was attended by my manager, Mr Rama.97. During his visit to Singapore\n\n    on 5 January 2000, Cendekia also requested me to assist him to apply for an employment\n\n    pass for his own representative, one Sandiawati Pangestu, whom he informed me was meant to\n\n    be the financial controller of IS Glass Pte Ltd and to be stationed in Singapore.\n\n    Accordingly, I proceeded to assist him in this regard. A copy of the completed application\n\n    form is annexed herewith and exhibited as \"YKC-38\".98. Sometime in mid-January 2000,\n\n    Cendekia organised a trip to Europe, Germany in particular. KFC went with Cendekia on this\n\n    trip and I came to know from Cendekia that the main purpose of this trip was to procure\n\n    export orders for IS Glass Pte Ltd as forecasted in the Cendekia’s Profile which is\n\n    exhibited at \"YKC-16\".99. In the meantime, since 1\n\n    January 2000, IS Glass Pte Ltd proceeded:a. to procure both local and\n\n      export orders in the name of IS Glass Pte Ltd;b. to procure from Indonesian\n\n      manufacturers float glass both for reprocessing as well as for trading orders (see\n\n      paragraphs 82 and 95 above);c. to organise transfers of\n\n      personnel from the various companies in the Group to IS Glass Pte Ltd; andd. to establish new accounts in\n\n      the name of IS Glass Pte Ltd with local vendors and suppliers including transfer of\n\n      telephone accounts.100. In all my meetings with\n\n    Cendekia, KYC and KFC in December 1999 and early January 2000, I had cautioned Cendekia,\n\n    KYC and KFC to the fact that as from 1 January 2000, all costs and expenses of the\n\n    Group’s operations are to be borne by IS Glass Pte Ltd since this became the new\n\n    operating entity. And that as the Judicial Manager of the Company, I will seek to recover\n\n    rent from IS Glass Pte Ltd for the use of the assets of the Group as from 1 January 2000,\n\n    pursuant to the MOU, and reimbursement of all expenses incurred by the Company and the\n\n    other companies in the Group.101. On 1, 3 and 4 February 2000,\n\n    my manager, Mr Rama, spoke to Cendekia to obtain approvals from Cendekia before certain\n\n    cheques of IS Glass Pte Ltd were signed by me or Mr Rama to meet payments for certain\n\n    advances requested by KYC and KFC and for payments to be made in view of the Chinese New\n\n    Year festivities. Mr Rama also took the opportunity to advise Cendekia to make a visit to\n\n    Singapore to resolve certain issues like advances and remunerations made to KYC and KFC\n\n    under IS Glass Pte Ltd.102. By early February 2000, I\n\n    had also decided on an amount that the Company intended to charge IS Glass Pte Ltd for the\n\n    use of the assets of the Company. In consultation with KYC and KFC, I had also arrived at\n\n    a sum proposed to be charged by QTSPL and QT for the lease of the assets of QTSPL and QT\n\n    to IS Glass Pte Ltd.103. By mid-February 2000, I had\n\n    prepared a first draft of the preliminary accounts of IS Glass Pte Ltd which I forwarded\n\n    to Heller Asia Capital (S) Ltd on 17 February 2000 in response to their request. This is\n\n    included at exhibited (sic) \"YKC-19\".104. A copy of my letter dated 17\n\n    February 2000 to Heller Asia Capital (S) Ltd incorporating the preliminary accounts of IS\n\n    Glass Pte Ltd was also faxed to Cendekia sometime in mid-February 2000.105. The JM Order was expiring in\n\n    February 2000 and I had made an application to Court to extend this Order. A copy of my\n\n    affidavit and the Order of Court is annexed herewith and exhibited as \"YKC-39\".106. On 21 February 2000, I\n\n    instructed my manager, Mr Rama, to request Cendekia to pay a visit to Singapore to discuss\n\n    certain issues. Mr Rama had sent to Cendekia an e-mail dated 21 February 2000 in that\n\n    regard which is annexed herewith and exhibited as \"YKC-40\".107. On 26 February 2000, I had a\n\n    meeting with Cendekia at Singapore. The meeting was held at a coffee house at Grand Plaza\n\n    Hotel at Coleman Street.108. At this meeting, among other\n\n    issues discussed, I informed Cendekia of the Company’s proposal to charge IS Glass\n\n    about S$80,000 a month for rental of the Company’s assets, I also advised him about\n\n    the other amounts that QTSPL and QT intended to charge for rental of their assets to IS\n\n    Glass Pte Ltd. Cendekia did not take objection to the proposed amounts.109. At this meeting, the amount\n\n    of remuneration of KYC and KFC paid under IS Glass Pte Ltd and the advances if any made to\n\n    KYC and KFC under IS Glass Pte Ltd and the manner in which these advances were to be\n\n    repaid as well as treated in the accounts of IS Glass Pte Ltd were also discussed.110. The paramount issue mooted\n\n    by Cendekia at this meeting was Cendekia’s intention to pull out from the MOU. This\n\n    intention of Cendekia was indicated to me for the first time at this meeting. Cendekia\n\n    informed me, after KYC and KFC had left the meeting, that he was afraid that he might not\n\n    be able to work with KYC and KFC. I told him that this was not a valid reason for him to\n\n    pull out from the MOU.111. I was surprised with\n\n    Cendekia’s intention to pull out from the MOU. I told him at that meeting that if he\n\n    had such intention he had to advise me in writing and if so, I would proceed to forfeit\n\n    the deposit and/or look to him for an action in specific performance and/or alternatively\n\n    to look to him for further damages.112. I also informed him to\n\n    consider carefully all his options and to see through to the completion of his obligations\n\n    pursuant to the MOU since he had committed an amount not only as a deposit placed pursuant\n\n    to the MOU but also made advances for account of IS Glass Pte Ltd and to manage the\n\n    business operations of IS Glass Pte Ltd. I also highlighted to him that he was responsible\n\n    for the rental sums charged to IS Glass Pte Ltd by the companies in the Group.113. Cendekia also informed me\n\n    that he had agreed with KYC and KFC for them to look for a period of one month for an\n\n    alternate investor to stand in Cendekia’s shoes to complete his obligations under the\n\n    MOU, failing which Cendekia would proceed to complete his obligations under the MOU.17\n\n        As regards the counterclaim what the first\n\ndefendant averred in paras 205 to 219 his affidavit of evidence-in-chief is as follows:205. I will in this section set\n\n    out the issues concerning the Counterclaim which claim I made through my Defence and\n\n    Counterclaim.206. I had on 15 September 2000\n\n    through my previous solicitors, M/s David Lim & Partners made a demand for a sum of\n\n    S$469,004.66 due to the Company for the total rental sum owing by Cendekia to the Company\n\n    (see exhibit \"YKC-60\"). This sum of S$469,004.66 was included in the sum of\n\n    S$688,197.41 then demanded by my solicitors, acting for the Company, QT and QTSPL, for\n\n    rental sums owed by Cendekia to these three companies.207. Since then the accounts of\n\n    the Company have been updated and the revised amount of the Counterclaim against Cendekia\n\n    as regards the total rental sums owed by Cendekia to the Company under the MOU is\n\n    S$565,153.68. A detailed listing and statement of account of the Company as regards this\n\n    sum of $565,153.68 is exhibited at \"YKC-64\".208. Cendekia, at paragraphs 2\n\n    and 23 of his Reply and Defence to Counterclaim has stated that my Counterclaim for the\n\n    rental sums charged to IS Glass Pte Ltd if at all is to be claimed by the Company through\n\n    its Liquidators since the Company has been ordered by the Court on 6 April 2001 to be\n\n    wound up.209. Further, at paragraph 3 of\n\n    his Reply and Defence to Counterclaim, Cendekia states that the 10% paid by him pursuant\n\n    to Clause 4(a) of the MOU be paid to Cendekia as the 2ndand 3rdDefendants have decided not to make any claim for this S$60,000.210. I have signed the MOU in my\n\n    then capacity as the Judicial Manager of the Company, as an agent of the Company.211. I have no choice in how I am\n\n    named in this suit/action brought by the Plaintiff, Cendekia.212. If Cendekia, through\n\n    paragraph 23 of his Reply and Defence to Counterclaim, is suggesting that the rightful\n\n    party to assert the Counterclaim is the Company, accordingly it should also follow that\n\n    the Company should be named as the 1stDefendant and not me.213. Nevertheless, until such\n\n    time as such applications, if any, are made by Cendekia or by the Liquidators of the\n\n    Company, I have to continue to defend this Suit.214. Through paragraphs 2 and 23\n\n    of his Reply and Defence to Counterclaim, Cendekia has chosen to draw a distinction in\n\n    that he has taken out this Suit against me as the 1stDefendant to recover the\n\n    10% deposit but put up a defence as to the Counterclaim by stating that the rightful party\n\n    to assert such a Counterclaim is the Company. This position is not reconciliable since\n\n    there is a privity of Contract, by virtue of the MOU, as between Cendekia and me, then\n\n    acting for the Company. I therefore have a valid right to assert the Counterclaim against\n\n    Cendekia, until directed otherwise by the Court.215. Clause 7 of the MOU reads\n\n    as:\"The Investor shall pay\n\n      such rates and fees to the respective companies in the Group for the use of the Assets\n\n      with effect from 1stDecember 1999 until the day when title to all such assets\n\n      is transferred to the Newco should transfer of title for such Assets be delayed beyond 1stDecember 1999.\"216. Clause 7 is clear in\n\n    its terms in that it reads that the \"Investorshall pay such rates and fees……..\" (underlined to add emphasis). It does not read as the Newco as having\n\n    to pay for such rates and fees.217. Clause 7 clearly\n\n    contemplates an obligation/responsibility on the part of the Investor (Cendekia) to pay\n\n    for such rates and fees for the use by the Newco of the Assets.218. At paragraphs 21 and 22 of\n\n    the Reply and Defence to Counterclaim of Cendekia, Cendekia admits to the transfer of\n\n    machinery and factory space by way of lease to IS Glass Pte Ltd and the transfer of\n\n    personnel to IS Glass Pte Ltd, although he claims that such transfer was done without his\n\n    approval and agreement. I have shown under the section on the Background Facts and in the\n\n    previous sections that he actively participated in the incorporation of the Company in\n\n    establishing the bank accounts of IS Glass Pte Ltd and in the commencement of the\n\n    operations of IS Glass Pte Ltd by remitting advances to procure materials and to make\n\n    business trips to procure export orders for the benefit of IS Glass Pte Ltd. Cendekia was\n\n    therefore not\"going to invest through IS Glass Pte Ltd\"as stated at\n\n    paragraph 21 of his Reply and Defence to Counterclaim. Rather, Cendekia consciously and\n\n    voluntarily invested into IS Glass Pte Ltd.219. I therefore maintain that,\n\n    pursuant to Clause 7 of the MOU, I have a valid Counterclaim for S$565,153.68 against\n\n    Cendekia who is obligated to pay for such rates and fees as charged to the Newco (IS Glass\n\n    Pte Ltd) and in addition, pursuant to Clause 17 of the MOU, I am entitled to forfeit the\n\n    10% deposit sum placed with me by Cendekia because of his failure to sign the Contracts.18\n\n        In essence, the first defendant averred that\n\nthe plaintiff’s conduct in not signing the eight contracts forwarded to him\n\nconstituted a repudiation of the MOU; the plaintiff was not entitled to recover the\n\ndeposit sum paid by him in pursuance of the MOU; and that the plaintiff owed the first\n\ndefendant an amount of $565,153.68 (later amended to $596,817.81 – see\n\n‘re-re-re-amended defence and counterclaim’ of the first defendant) being\n\nrentals and other outgoings in respect of the assets of the company.19\n\n        The evidence of Ramasamy, the first\n\ndefendant’s manager was in support of his employer and they require no\n\nre-capitulation at this point. No minutes or memoranda were made available either by the\n\nfirst defendant or Ramasamy in relation to what took place at the meeting held on 26\n\nFebruary 2000 at the Grand Plaza Hotel, where it was alleged by the first defendant and\n\nRamasamy that the plaintiff did not raise any objection to the first defendant’s\n\ncommunication that the first defendant would charge $80,000 a month for the rental of the\n\ncompany’s assets.",
        "The pleadings": "20\n\n        In his statement of claim the plaintiff after\n\nmaking reference to the various clauses in the MOU signed between the parties, contended\n\nthat the MOU was void for uncertainty. He further contended that the forfeiture of the\n\nsums paid by him constituted penalty under the law. However, the contention based on\n\npenalty was abandoned by the plaintiff’s counsel during final arguments.21\n\n        The first defendant denied in his defence that\n\nthe MOU was void for uncertainty. He pleaded that the sum of $462,800, made up of two\n\nsegments, ie, a sum of 402,800 being 10% earnest money payable under cl 3(a) of the MOU\n\nand a sum of $60,000 paid to him as nominee of the second and third defendants under cl\n\n4(a) of the MOU was for the purposes of the second and third defendant’s VA sum. The\n\nfirst defendant contended in para 8 of his defence that the plaintiff terminated and\n\nrepudiated the MOU through his solicitors’ letter dated 11 August 2000. The first\n\ndefendant acting for and on behalf of the YGBM accepted the plaintiff’s said\n\nrepudiation and forfeited the said 10% earnest money.In para 9 of his defence, he\n\naverred that besides forfeiting the 10% earnest money, he was entitled to and was holding\n\nthe VA sum of $60,000 as he had a valid set-off and counterclaim against the plaintiff in\n\nthe amount of $596,817.81. Particulars provided disclosed that the counterclaim was in\n\nrespect of rates and fees payable for use of the assets of the company from 1 December\n\n1999 onwards by the plaintiff.",
        "Arguments, issues and conclusion": "22\n\n        As mentioned by me at the outset, there were\n\ntwo main issues to be decided in this case. The first one was whether the MOU signed\n\nbetween the parties was a binding and final agreement in the light of the very terms of\n\nthe document. The second issue concerned the authority and legal standing of the first\n\ndefendant to continue with this action.23\n\n        In the first place, what was glaring in this\n\ndispute was the feature that the first defendant, in addition to his role as the judicial\n\nmanager – needless to highlight the aspect that he was appointed to that position by\n\nan order of court - was seen to be wearing many other hats in connection with the\n\nresponsibilities undertaken by him, ie, (a) special accountant to the related companies of\n\nthe company (para 12 of his AEIC), (b) personal adviser to the Kwan family (para 15 of his\n\nAEIC), (c) nominee for the Kwan brothers in connection with their problems with their\n\ncreditors (para 19 of his AEIC) and finally (d) corporate service provider to Newco. Could\n\nhe have objectively managed all these in an even-handed manner? I will return to this\n\nquestion later in these grounds.24\n\n        Let me now deal with the MOU under scrutiny.\n\nThis was the handmaiden of the first defendant, an experienced accountant, admittedly\n\nwell-versed in corporate practice, liquidation and judicial management. The court was told\n\nthat in the drafting of the MOU, he had some input from his legal advisers. A careful\n\nsweep of the MOU unmistakably showed that it was not meant to be a final document and that\n\nit required a great deal more to make it certain and final. In this regard, it was\n\nexpressly and unequivocally stated in cl 2 of the MOU (vide para 3 infra), that the\n\ninvestor, namely the plaintiff ‘shall enter into the relevant agreements’\n\nwith the first defendant and others ‘which terms and conditions will be agreed\n\nupon a later date’. Nothing could be clearer or more precise.25\n\n        In his arguments, counsel for the first\n\ndefendant attempted to downplay the import of cl 2 of the MOU. He contended that too much\n\nsignificance should not be attributed to the terminology of the said clause and that the\n\nMOU could stand on its own without any further agreements since all the essential and\n\nfundamental terms were found in that document. In my view, the contention put forward did\n\nnot make much sense and appeared to introduce linguistic and semantic uncertainties to an\n\notherwise plain and uncomplicated provision. Clause 2 of the MOU which by its very words\n\nwas calling out for a number of‘relevant’further‘agreements’‘which terms and conditions[had to]be agreed upon at a later date’.26\n\n        Counsel for the first defendant invited my\n\nattention to principles enunciated by the Singapore Court of Appeal inKlerk-Elias\n\nLiza v KT Chan Clinic Pte Ltd(1993) 2 SLR 417, and a High Court decision inClimax\n\nManufacturing Co. Ltd v Colles Paragon Converters (S) Pte Ltd(2000) 1 SLR 245and\n\nsubmitted that the MOU under reference was a contract that was certain in scope, meaning\n\nand application as was held in the cases cited.27\n\n        InKlerk-Elias Lizathe facts as\n\nappear in the head notes of the report are as follows:The respondents owned premises\n\n    (‘the premises’) which he had leased to a company called Perrodo Offshore (S)\n\n    Pte Ltd (‘Perrodo’). The appellant had two businesses, a beauty salon and a\n\n    jewellery retail shop which she ran from premises at a hotel. The offices of these two\n\n    businesses were at another building. In early 1983, it became known that both the hotel\n\n    and the building where the appellant had her offices were to be demolished. Alternative\n\n    premises were found for the beauty salon and in mid-1983 the appellant reached an\n\n    agreement with Perrodo whereby Perrodo would sublet the premises to her for the remaining\n\n    months of their lease for $8,100 per month provided the respondents agreed.On 7 July 1983, the respondents wrote to the appellant on a letterhead which read ‘KT\n\n    Chan Clinic’ referring to earlier discussions with the appellant and confirming the\n\n    terms of rental of the premises. The material terms were as follows: rent was fixed at\n\n    $7,740 per month, maintenance charges of $1,440 per month would be borne by the tenant,\n\n    the lease was to be for three years commencing 1 December 1983, subletting was permitted\n\n    ‘details of which will be in the lease’ and the lease was to be legally drawn up\n\n    ‘with the usual terms that apply in Singapore’. The letter called for the\n\n    appellant to sign the attached copy of the letter and to return it to the respondents if\n\n    she agreed to the terms, following which, the respondents would authorize Perrodo to\n\n    sublet the premises to the appellant. The letter was signed on the appellant’s behalf\n\n    and returned to the respondents, accepting the terms. In late July or early August, the\n\n    appellant moved into the premises.On 13 September 1983 a formal lease naming ‘KT Chan Clinic’ as landlord and the\n\n    beauty salon as tenant, as the appellant had requested, was prepared by the\n\n    respondent’s solicitors and sent to the appellant. Clause 3(17) of the lease provided\n\n    for the prior written consent of the landlord to be obtained before any assignment,\n\n    sublease or parting or sharing of possession of the premises. Clause 3(21) provided that\n\n    the premises could only be used as an office for the tenant’s business and cl 5(5)\n\n    provided, inter alia, an option to renew the lease for a period of one year and the terms\n\n    for such renewal. The appellant refused to sign the lease on the ground that the terms\n\n    therein were unacceptable. On 14 December 1983, the respondents requested that the\n\n    appellant vacate the premises in the course of the week; however, on 27 December, he\n\n    countermanded his request and sought instead specific performance of the agreement for the\n\n    lease of the premises entered into on 7 July 1983. The appellant denied the existence of\n\n    any agreement and vacated the premises on 31 January 1984. The respondents eventually\n\n    leased the premises to Blitz Advertising Pte Ltd (‘Blitz’) for 24 months\n\n    commencing 9 November 1984 at $6,300 per month.The respondents commenced proceedings for damages for breach of the tenancy agreement\n\n    evidenced by or contained in the letter of 7 July 1983. The learned trial judge held that\n\n    the appellant had breached the lease agreement contained in the letter of 7 July and gave\n\n    judgment for the respondents for $167,378 and costs to be taxed. The appellant appealed\n\n    and the respondents cross-appealed for interest on the judgment sum under s 9 of the Civil\n\n    Law Act (Cap 43, 1988 Ed).28\n\n        On the foregoing facts, the Court of Appeal, by\n\na majority of two to one, dismissed the appeal and cross-appeal and held that:(1) On the evidence, the\n\n    appellant’s discussions with the respondents were with a view to securing for herself\n\n    a tenancy or lease of the premises for a fixed term of years with an option for renewal\n\n    for another fixed term of years and the respondents only consented to the sublease by\n\n    Perrodo to the appellant because an agreement had been concluded between him and the\n\n    appellant for a lease of the premises as contained in the letter of 7 July 1983.(3) An agreement had been reached\n\n    on both the question of the option for renewal and that of subletting and although the\n\n    details to be incorporated into the lease had not been agreed, there was no uncertainty\n\n    which would render those two provisions void for uncertainty resulting in there being no\n\n    concluded contract.(5) All the essential terms for a\n\n    valid agreement for a lease being either clearly defined in the letter of 7 July or there\n\n    being no mistaking what they were, the letter of 7 July and the signed acceptance thereof\n\n    constituted a valid and binding agreement for a lease of the premises.(6) The evidence leading to the\n\n    signing of the letter of 7 July indicated that it was the parties’ intention that the\n\n    document was to constitute a binding agreement between them for the lease of the premises\n\n    on those terms pending the finalization and execution of a formal lease. An agreement to\n\n    execute a formal agreement does not prevent there being a valid and concluded agreement in\n\n    the meanwhile.29\n\n        InClimax Manufacturing(supra)\n\nthe facts as they appear in the headnotes are as follows:The defendants were manufacturers\n\n    of repositional adhesive memo pads. They developed a system for production of these pads\n\n    at lower costs, the heart of the system being the machine designed by the defendants. The\n\n    defendants were seeking a business partner to help them penetrate the Hong Kong and China\n\n    markets. They were keen on marketing the technical know-how required to convert and print\n\n    on special repositional adhesive paper. This would involve selling the machine developed\n\n    for this process and the know-how to convert and market the product. The plaintiffs found\n\n    the defendants’ proposition interesting. On 24 November 1995 their Chief Executive\n\n    Officer, one Mr Fung Kin Yuen Kenneth, visited the defendants at their factory in\n\n    Singapore. The parties subsequently decided to go ahead with the project and they signed a\n\n    memorandum of understanding expressing the intention of the parties to enter into a joint\n\n    venture agreement.On 30 November 1995 the defendants sent the plaintiffs an agreement, which they had\n\n    pre-signed, for execution by the plaintiffs. The plaintiffs were not happy with the terms\n\n    of the agreement and, on 15 December 1995, they wrote to the defendants giving their\n\n    detailed comments on its various clauses. One of these comments was that they wished the\n\n    defendants to amend the agreement by adding the ‘name, specification, machine number\n\n    and photo for the Machine’. The ‘Machine’ in question was described in cl\n\n    2.2 as ‘one (1) unit 2-colour Web Offset Printing Machine dedicated to the printing\n\n    of Repositional Adhesive Memo Pads’. The defendants proceeded to redraft the\n\n    agreement. However, they did not add all the particulars which the plaintiffs had\n\n    requested in relation to the Machine. After the amendments, cl 2.2 of the agreement read:\n\n    ‘Supply of raw material plus one (1) unit 2-Colour Web Offset Printing Machine\n\n    dedicated to the printing of Re-positional Adhesive Memo Pads (the Machine). The\n\n    specifications of the Machine is (sic) attached hereto.’ The sentence ‘the\n\n    specifications of the Machine is attached hereto’ were added after the defendants had\n\n    received the plaintiffs’ comments, as had been the schedule with the specifications.On 8 January 1996, the defendants’ Chief Executive Officer brought the amended\n\n    agreement to Hong Kong for execution, and the agreement was signed that same day. However,\n\n    this was only after Mr Fung made some further hand-written amendments. The amendments\n\n    included,inter alia, the addition of the words ‘to be agreed by both\n\n    parties’ behind cl 2.2.Under the agreement, the plaintiffs were to pay the defendants 30% of the contract price\n\n    of $500,000 upon signing of the agreement. The remaining 70% was to be paid by letter of\n\n    credit which the plaintiffs were to forthwith establish in favour of the defendants. After\n\n    the signing on 8 January, there was a lot of correspondence between the parties, wherein\n\n    the plaintiffs sought details of the Machine. The defendants them (sic) replied with a\n\n    certain amount of information but the plaintiffs considered the information supplied\n\n    inadequate and asked for further specifications. The correspondence thus continued.On 6 February 1996, the plaintiffs paid the defendants $150,000 being the 30% down\n\n    payment. They did not then or thereafter, despite various requests from the defendants,\n\n    establish the letter of credit for the remaining 70% of the purchase price. The defendants\n\n    considered this failure to be a repudiation of the agreement on the part of the plaintiffs\n\n    and, on 10 June 1996, they purported to accept the plaintiffs’ repudiatory breach of\n\n    the agreement. The plaintiffs commenced this action in January 1997 for the return of the\n\n    $150,000 down payment. The basis of their action was that the agreement was void for\n\n    uncertainty because it provided for the specifications ‘to be agreed by both\n\n    parties’. Alternatively, they claimed that there was breach of an implied term to\n\n    supply certain information relating to the machine so that the plaintiffs could assess the\n\n    suitability of the Machine to their needs before deciding whether or not to agree to the\n\n    Machine’s specifications.On the application of the plaintiffs pursuant to O 14 r 12, the question of construction\n\n    came before the court as to whether the agreement was a valid and legally binding document\n\n    or, as the plaintiffs termed it, an ‘illusory agreement’. The assistant\n\n    registrar came to the conclusion that the agreement was not an illusory one. The\n\n    plaintiffs appealed.30\n\n        Upholding the assistant registrar’s\n\ndecision and dismissing the plaintiff’s appeal, the High Court held that:(1) In construing a particular\n\n    clause of an agreement one must not do so in isolation but must have regard to the\n\n    contract as a whole and also, to a more limited extent, to the factual matrix in which the\n\n    contract was negotiated or concluded. This principle holds true also when one was trying\n\n    to decide whether a contract had actually come into existence. The words ‘to be\n\n    agreed’ in cl 2.2 had to be construed in their context and their mere presence in the\n\n    agreement did not ipso facto mean that no concluded contract was formed (see  25-26).(3) In the present case,\n\n    everything necessary to be concluded between the parties had been concluded. The\n\n    defendants were selling to the plaintiffs their system for the production of the\n\n    pre-printed repositional memo pads and not just a machine. Reflecting that, the agreement\n\n    went far beyond an agreement for sale and purchase of a single piece of equipment. When\n\n    the terms of the agreement were looked at as a whole, it could be seen that the parties\n\n    had a more complex arrangement in mind involving the transfer of know-how and the\n\n    appointment of the plaintiffs as the distributor for the defendants’ product in a new\n\n    market which the defendants wished to penetrate. They had agreed on all the basic issues\n\n    that were relevant to this relationship (see  27-28).31\n\n        In my evaluation, the facts and circumstances\n\nof the case before me were vastly different from that ofKlerk-Elias LizaorClimax Manufacturing. In those two cases, the agreements referred to did not\n\nrequire the parties to enter into relevant agreements on terms and conditions to be ‘agreed\n\nupon a later date’.32\n\n        InCourtney and Fairbairn Ltd v Tolaini\n\nBrothers (Hotels) Ltdand another [1975] 1 All ER 716, the Court of Appeal in\n\nEngland held that a contract to negotiate even though supported by consideration was not a\n\ncontract known to the law since it was too uncertain to have any binding force and no\n\ncourt could estimate the damages for breach of such an agreement.33\n\n        Returning to the facts of the present case,\n\nquite apart from the express terminology of cl 2 of the MOU which in no uncertain language\n\ndemanded further agreements to be entered on terms to be agreed later, the plethora of new\n\nterms incorporated in the draft agreements forwarded to the plaintiff for his\n\nconsideration most certainly tended to diminish the first defendant’s contention that\n\nthe MOU by itself was all embracing, conclusive, certain in scope and that subsequent\n\nagreements were but a mere formality. The plaintiff’s counsel had extensively set out\n\nin his final submissions the glaring differences in content between the MOU and the drafts\n\n(paras 68 to 141 of his written submission). What became clear at the trial was that many\n\na term in the draft agreements did not feature at all in the MOU and that the draft\n\nagreements were in fact sent to the plaintiff by the first defendant for the purposes of\n\nnegotiation (pages 904 lines 5 to 6, 950 lines 1 to 5 and 974 lines 21 to 213 of NE, where\n\nthe first defendant himself had conceded this). The admissions made by the first defendant\n\nduring his testimony alone would be sufficient to demolish his present stand that the\n\ndrafts agreements were prepared only to give effect to the terms of the memorandum.34\n\n        At this juncture, I ought to make reference to\n\na few not too insignificant terms appearing in the draft agreements, forwarded to the\n\nplaintiff way out of time and that too after cracks had developed in the relationship\n\nbetween the Kwan brothers and the plaintiff over the Kwan brothers’ remuneration and\n\nthe intimation by them to opt out of the deal.35\n\n        In this context I must first make reference to\n\nthe Sale and Purchase of Assets Agreements between the company and Newco (AB- 785 to 809),\n\nbetween QTPL and Newco (AB-810 to 823) as well as between QT and Newco AB-824 to 837).\n\nClause 4 of the said agreements (see AB-792, AB-816 as well as AB-830) is intituled\n\n‘conditions precedent’. It reads:4 Conditions Precedent4.1 This Agreement is\n\n    conditional upon the fulfilment of the following conditions precedent:-(a) the Vendor and/or the\n\n      Judicial Manager having obtained the requisite approval of the respective creditors and/or\n\n      the Court, as applicable and as the case may be, in respect of the sale herein;(b) all the conditions for\n\n      completion of the sale and purchase of the Property as set out in Schedule 3 hereto are\n\n      performed and/or complied with;(c) the conditions precedent of\n\n      each of the Sale and Purchase Agreements are fulfilled on or before the Cut Off Date.4.2 If any of the conditions\n\n    precedent in Clause 4.1 is not satisfied on or before the Cut Off Date, then the Agreement\n\n    shall automatically be null and void and thereafter neither party shall have any claim or\n\n    demand against the other, save for outstanding rental fees, and each party shall bear\n\n    their own solicitors’ costs and the Vendor shall refund to the Purchaser the Advance\n\n    Payment without interest.36\n\n        The first defendant did not disagree that this\n\n‘conditions Precedents’ clause was a fundamental one and it was a complete\n\nvariation of the MOU (page 976 of NE). His only explanation in this regard was that the\n\nsaid clause was put in place to make sure that all the agreements were executed\n\nsimultaneously (page 977 of NE).37\n\n        The rental provisions (cl 10 at AB-794) again\n\nposed difficulties. Clause 7 of the MOU was particularly vague as to the rental amount. It\n\nrequired payments by the plaintiff of such rates and fees for the use of the\n\ncompany’s assets (AB-273) and clearly seemed to provide for further negotiations. As\n\nto how the first defendant could demand from the plaintiff a monthly rental of $80,000 or\n\nfor that matter $78,000 and $74,000 per month as stipulated in the proposed agreement,\n\nthere was very little credible evidence placed before me except for some bland claims from\n\nthe first defendant and his employee Ramasamy. At any rate, the plain reading of cl 7 of\n\nthe MOU tended to point towards only one direction, that was, that parties would have to\n\nnegotiate further on the issue of rental, which from the facts placed before me\n\nestablished that it was not something of a negligible proportion.38\n\n        The sale and purchase of the land and premises\n\nas appearing in Schedule 3 (AB-799 to 802) was again a subject of debate and concern. This\n\nschedule again was found to be heavily slanted in favour of the vendor. It seemed to\n\ninclude special conditions which a prudent purchaser would normally take objection to. For\n\nexample, the vendor was not even obliged to produce any evidence that any caveat or other\n\nencumbrance notified or registered against the subject property would be cancelled on or\n\nafter completion and the purchaser was nonetheless required to complete the sale on that\n\nbasis (AB-799, condition 5). Next, time was made the essence in relation to the\n\npurchaser’s obligations under condition 18 (AB-801), whereas under condition 7\n\n(AB-799) the purchaser was not entitled to any compensation for any delay in completion\n\noccasioned by the vendor. Moving further, under condition 21 (AB-802), the vendor would\n\nnot guarantee or assume any responsibility for the accuracy of any information given by\n\nhim in respect of the subject property. The first defendant’s counsel’s argument\n\nthat all these special conditions were mere inessentials and they did not alter the\n\ncharacter of the MOU was, in my view, something that appeared to have been taken out of a\n\npage from ‘Lewis Carrol’s Alice in Wonderland’.39\n\n        Still further, the clauses in the draft\n\n‘Investment Agreement’ (AB-753 to 784) were also found to be riddled with\n\ncontroversial terms. To mention only a few: First, cl 4(d) (AB- 761) of the said agreement\n\ndeals with the subject of loans to be provided by the plaintiff. It stipulates that the\n\nsaid loans shall be interest free. There was no such term in the MOU. Second, cl 4(f)\n\n(AB-762) requires the plaintiff to make available to the Newco from time to time such\n\nfunds as are necessary to meet its working capital requirements. There was no such\n\nprovision in the memorandum. Next, provisions concerning the constitution of the board of\n\ndirectors of the Newco and the deadlock provisions were not only heavily weighted in\n\nfavour of the Kwan brothers but they also appeared to give very little leverage to the\n\nplaintiff who was supposed to be the major shareholder of Newco.40\n\n        A few observations about the service agreements\n\nbetween KYC and Newco (AB-838 to 847) and between KFC and Newco (AB-848 to 856) would also\n\nbe appropriate at this stage. Clause 4 of these agreements (AB-842 and AB-852) contained\n\nprovisions in relation to remuneration and benefits payable to the Kwan brothers by Newco.\n\nA noticeable feature of these clauses was that they were left blank. Under cl 12 (h)\n\n(AB-274) of the MOU the Kwans’ remuneration was clearly delimited to only $5,000 per\n\nmonth each, although subject to changes upon mutual written agreement between them. But\n\nthe question was why this clause had to be left blank even as of 19 April 2000? The only\n\nreasonable inference was that the festering issue that surfaced at the parties’\n\nmeeting at the Grand Plaza Hotel on 26 February 2000, was still to be resolved and that\n\nthere was no agreement on this issue even up to the time that these agreements were sent\n\nout to the plaintiff for his consideration. There was yet one other aspect. Clause 4.2 of\n\nthe said service agreements (see AB-842 and AB-852) provided for the use of a motor-car of\n\na model and price yet to be determined. There was nothing of this sort in the memorandum.\n\nCould it then be said that this clause conformed with the memorandum? The answer again was\n\nin the negative.41\n\n        The opening phraseology of cl 12 of the MOU\n\n(AB-273) provided that the Kwans shall enter into binding shareholder agreement with the\n\nplaintiff before 1 December 1999 on the salient terms and conditions provided thereunder.\n\nLeaving aside the deadline of 1 December 1999 which was never complied with, cl 12 (l)\n\n(AB-275) of the MOU expressly required that the Kwans ‘shall agree to work\n\ndiligently…. at a professional fee to be agreed under the Newco’. In my view,\n\nthe wording chosen was susceptible to only one interpretation - that was that the\n\nmemorandum was merely a preliminary plank and the deal contemplated could not be completed\n\nunless parties settled all their terms amongst themselves by further negotiations.42\n\n        Another feature that caught the court’s\n\nattention was in relation to cl 12 (c) of the MOU (AB-274). The last sentence of the\n\nclause provided that Newco shall enter into such agreements with the plaintiff as are\n\nnecessary as regards the repayment to the plaintiff of the $3 million loan as well as how\n\nthe assets of Newco may be charged for the said $3 million loan. There was nothing in\n\nrelation to this matter in any of the draft agreements sent to the plaintiff even as of 26\n\nJuly 2000 (AB-744).43\n\n        Finally, reference ought to be made to cl 7 of\n\nthe MOU (AB-273) provided that the plaintiff ‘shall paysuch rates and feesto\n\nthe respective companies in the Group for the use of the assets with effect from 1\n\nDecember 1999 until the day when title to all such assets is transferred to the Newco,\n\nshould transfer of title for such Assets be delayed beyond 1 December 1999.’ It was\n\nnot in dispute that the 1 December 1999 deadline was a dead letter. The first\n\ndefendant’s counterclaim was hinged to this clause. His claim was for a monthly\n\nrental of between $82,400 and 74,160 (vide his counterclaim). But the undisputed fact was\n\nthat when the memorandum was signed on 10 December 1999, the rental issue was still at\n\nlarge. Counsel for the defendant in his inimitable manner tried to argue that inasmuch as\n\nthe ‘three ‘P’s’ (price, parties, and property) had been identified\n\nand settled in the MOU, there was little else required. But in my determination, the\n\nrental aspect was clearly a significant segment of the three ‘P’s’,\n\nadverted to by the first defendant’s counsel, on which there was no credible evidence\n\nof any concluded agreement. In this regard, I found the evidence of the first defendant\n\nand that of his manager, claiming that the plaintiff agreed to the figure of $80,000 per\n\nmonth as on 26 February 2000 (page 853 of NE) to be laced with expediency. I found it odd\n\nthat on that day when the Kwan brothers were reportedly agitating for a higher monthly\n\npay, and the possibility of the plaintiff opting out of the venture was looming (paras 108\n\nto 110 of the affidavit of evidence-in-chief of the first defendant), there could have\n\nbeen an agreement emanating from the plaintiff as regards rental amounting to such a\n\nsubstantial sum. I must further remark at this stage that the first defendant was found by\n\nme to be decidedly ambivalent on this so-called agreement and in this regard what he said\n\nduring cross-examination indeed seemed to throw the spanner in the works. The relevant\n\nsegments of his testimony read as follows:Q Please read Clause 7.A Yes, Clause 7 reads \"The\n\n    Investor shall pay such rates and fees to the respective companies in the Group for the\n\n    use of the Assets with effect from 1stDecember 1999 until the day when title\n\n    to all such assets is transferred to the Newco should transfer of title for such Assets be\n\n    delayed beyond 1stDecember 1999.\"Q So there is no agreement. The\n\n    figure has to be agreed between the parties.A I agree with the statement,\n\n    your Honour.Q So that would be another\n\n    uncertainty.A No, your Honour. Uncertainty\n\n    about what, sorry?Q As to the figure, as to the\n\n    certainty of the contract. We had to agree something. Without mechanism, I would say that\n\n    it is uncertain.A Your Honour, the amount had to\n\n    be agreed, your Honour. We have to compute and tell Mr Cendekia how much we want to charge\n\n    and that’s what we did in January and February, your Honour.Q But Mr Cendekia has to agree,\n\n    you can’t --- I mean, unless there is agreement. There is no agreement. All right.A Mr Cendekia agreed, your\n\n    Honour.Q You mean to say Mr Cendekia\n\n    agreed to pay the rental?A He agreed to our computation of\n\n    $80,000 but he wanted a discount, your Honour.Q Where is this in writing?A We have told him on the 26thof February meeting, your Honour, and we gave him the account factoring the $80,000\n\n    rental.His Honour: You gave him the\n\n      figure only on the 26thof February?Witness: That’s correct,\n\n      your Honour.His Honour: Not before, not\n\n      before?Witness: Before I don’t know\n\n      whether Rama gave it to him but I am sure there’s some discussion.His Honour: But don’t\n\n      speculate. But as far as you are concerned, he was given the figure of $80,000 on the 26thof February 2000?Witness: Your Honour, I believe\n\n      we had mooted the figure many times but on the 26thof February we specifically\n\n      discussed this issue.44\n\n        What Ramasamy, the first defendant’s\n\nmanager said in this regard should also be reproduced in order to capture its flavour. His\n\nevidence as appears at page 1168 in reply to some questions from the court reads as\n\nfollows:His Honour: I want you to testify\n\n    to the best of your knowledge.Witness: Yes.His Honour: All right. According\n\n    to your affidavit, the rental was first suggested to him on the 26thof\n\n    February 2000.Witness: Yes, your Honour.His Honour: Right. You also\n\n    agreed prior to that, there was no figure suggested to him.Witness: Yes, your Honour.His Honour: All right. From there\n\n    I’m taking, you asked him for $80,000.Witness: Yes, your Honour.His Honour: Mr Yin asked for\n\n    $80,000 you said.Witness: Yes, your Honour.His Honour: You did not mention\n\n    the figure in the meeting at all?Witness: No.His Honour: No. You are sure of\n\n    that?Witness: Yes, because it was ---\n\n    they was speaking in Mandarin and he proposed the figure and I ---His Honour: But do you\n\n    know---when they speak in Mandarin, when they say $80,000, you wouldn’t understand?Witness: He would---immediately\n\n    after---His Honour: You would not\n\n    understand?Witness: I would not understand,\n\n    your Honour.45\n\n        In my evaluation and determination, the\n\nrequirement under cl 2 of the MOU, phraseology of which was chosen by the first defendant,\n\napparently with much care and deliberation, was clear and unmistakable. Under this clause,\n\nthe parties were expected to enter into several relevant agreements upon terms and\n\nconditions which would have to be agreed upon at a later date. Similar purport seemed to\n\nfeature in cl 7 of the MOU in relation to rates and fees for the use of the assets of the\n\ncompany.46\n\n        InShore v Wilson[1839, 1842] IX\n\nClark & Finnelly, 355 (reproduced in 8 ER 450), a decision approved by the Singapore\n\nCourt of Appeal inChiang Hong Pte Ltd v Lim Poh Neo t/a Tai San Plastic Factory[1984-85] SLR 112, Lord Tindal CJ said at pages 532 and 533 of the English Reports:The general rule I take to be, that where the words of any written instrument are free\n\n    from ambiguity in themselves, and where external circumstances do not create any doubt or\n\n    difficulty as to the proper application of those words to claimants under the instrument,\n\n    or the subject-matter to which the instrument relates, such instrument is always to be\n\n    construed according to the strict, plain, common meaning of the words themselves; and that\n\n    in such case evidencedehorsthe instrument, for the purpose of explaining it\n\n    according to the surmised or alleged intention of the parties to the instrument, is\n\n    utterly inadmissible. If it were otherwise, no lawyer would be safe in advising upon the\n\n    construction of a written instrument, nor any party in taking under it; for the ablest\n\n    advice might be controlled, and the clearest title undermined, if, at some future period,\n\n    parol evidence of the particular meaning which the party affixed to his words, or of his\n\n    secret intention in making the instrument, or of the objects he meant to take benefit\n\n    under it, might be set up to contradict or vary the plain language of the instrument\n\n    itself.The true interpretation, however, of every instrument being manifestly that which will\n\n    make the instrument speak the intention of the party at the time it was made, it has\n\n    always been considered as an exception, or perhaps, to speak more precisely, not so much\n\n    an exception from, as a corollary to, the general rule above stated, that where any doubt\n\n    arises upon the true sense and meaning of the words themselves, or any difficulty as to\n\n    their application under the surrounding circumstances, the sense and meaning of the\n\n    language may be investigated and ascertained by evidencedehorsthe instrument\n\n    itself; for both reason and common sense agree that by no other means can the language of\n\n    the instrument be made to speak the real mind of the party. Such investigation does of\n\n    necessity take place in the interpretation of instruments written in a foreign language;\n\n    in the case of ancient instruments, where, by the lapse of time and change of manners, the\n\n    words have acquired in the present age a different meaning from that which they bore when\n\n    originally employed; in cases where terms of art or science occur; in mercantile\n\n    contracts, which in many instances use a peculiar language employed by those only who are\n\n    conversant in trade and commerce; and in other instances in which the words, besides their\n\n    general common meaning, have acquired, by custom or otherwise, a well-known peculiar\n\n    idiomatic meaning in the particular country in which the party using them was dwelling, or\n\n    in the particular society of which he formed a member, and in which he passed his life. In\n\n    all these cases evidence is admitted to expound the real meaning of the language used in\n\n    the instrument, in order to enable the Court or Judge to construe the instrument, and to\n\n    carry such real meaning into effect.But whilst evidence is admissible in these instances for the purpose of making the written\n\n    instrument speak for itself, which without such evidence would be either a dead letter, or\n\n    would use a doubtful tongue, or convey a false impression of the meaning of the party, I\n\n    conceive the exception to be strictly limited to cases of the description above given, and\n\n    to evidence of the nature above detailed; and that in no case whatever is it permitted to\n\n    explain the language of a deed by evidence of the private views, the secret intentions, or\n\n    the known principles of the party to the instrument, whether religious, political, or\n\n    otherwise, any more than by express parol declarations made by the party himself, which\n\n    are universally excluded; for the admitting of such evidence would let in all the\n\n    uncertainty before adverted to; it would be evidence which in most instances could not be\n\n    met or countervailed by any of an opposite bearing or tendency, and would in effect cause\n\n    the secret undeclared intention of the party to control and predominate over the open\n\n    intention expressed in the deed.47\n\n        The first defendant could not run away from the\n\nexpress terminology of cl 2 of the memorandum. His counsel tried to bury its meaning by\n\nhis ‘three P’s’ argument. Sadly though, defence was hoist with its own\n\npetard, not only by the wording and terminology of the memorandum but also by the complete\n\nlack of agreement in relation to the rental segment. At any rate, the host of new\n\nconditions making their debut in the eight draft agreements forwarded to the plaintiff,\n\nmany months after the 1 December 1999 deadline, further tended to fortify my view that\n\nthere were innumerable terms which awaited discussion and agreement between the parties\n\nbefore it could be said that there was a binding deal between the parties. This must be so\n\nparticularly when the MOU also seemed to make the contract conditional upon consent being\n\nobtained from the secured creditors, the Jurong Town Corporation for the transfer of the\n\nlease of the property and also from the court, although all these might well be a matter\n\nof technical formality.48\n\n        In my opinion, there was an agreement in\n\nrelation to the basic framework for the plaintiff to take over the company as contained in\n\nthe MOU and nothing more. The phraseology employed by the first defendant in the MOU made\n\nit abundantly clear that many other matters had to be settled before a deal could be\n\nsealed. The introduction by the first defendant of a multitude of fresh terms in the draft\n\nagreements prepared on his and on behalf of the Kwan brothers and forwarded to the\n\nplaintiff most certainly created a great deal of uncertainty in respect of the proposed\n\ndeal. It must be added here that the uncertainty bespoken was the making of the first\n\ndefendant. The insistence of the Kwan brothers for a higher remuneration than what was\n\nmentioned in the MOU and their intention to part from the plaintiff added further\n\ncomplexity to the deal. The first defendant was found by me to be far too ambitious in his\n\nbalancing exercise. He was indeed wearing too many hats and the resultant conflict of\n\ninterest, substantially contributed to the collapse of this deal. A judicial manager\n\nappointed by the court is bound to carry out his tasks even-handedly and in an objective\n\nmanner. He should at all costs avoid overt and unseemly bias in favour of those who in the\n\nfirst instance invited him to accept appointment. In the case at hand, it would seem that\n\nthe objectivity and balance required of him were unwittingly lost when he tried to obtain\n\na little too much for the Kwan family. This was borne out by the fact that when the\n\ncompany was finally wound-up, his application to assume the role of liquidator was not\n\nacceded to by the creditors (AB-2102) and hence the appointment of three other persons as\n\nthe liquidators of the company on 6 April 2001.49\n\n        In my view, having regard to the evidence\n\npresented, the plaintiff’s contention that the MOU was riddled with uncertainty and\n\nconsequently void, was held by me to be sound. On the other hand, I found the argument by\n\ncounsel for the first defendant that the said MOU constituted a binding agreement and that\n\nall the essential and fundamental terms of the agreement between the parties had been\n\nincorporated in the said document, inexorably faulty and seemed to fly in the face of the\n\nvery words of cl 2 of the MOU.50\n\n        The train of events that followed from 10\n\nNovember 1999 until 26 July 2000 further reinforced my view that the said MOU could never\n\nbe regarded as a final document, particularly when one were to scrutinise the eight draft\n\nagreements forwarded to the plaintiff by the first defendant many months after the 1\n\nDecember 1999 deadline for his review and consideration. These eight agreements which took\n\na long time coming, contained several not so inessential terms and did not even feature in\n\nthe MOU. In my view, the argument by counsel for the first defendant that these eight\n\nvoluminous draft agreements were no more than a mere amplification of what was agreed to\n\nbetween the parties and purported to add a few inessential or less significant terms, went\n\nagainst the grain of truth and substance and found by me to be entirely unmeritorious. I\n\nmust add that the first defendant’s omission to call the Kwan brothers to rebut the\n\nplaintiff’s evidence that the Kwan brothers wanted him out and as a result the whole\n\ndeal came to grief in many ways tended to weaken the first defendant’s case. It must\n\nbe remembered that the first defendant was at all times the special adviser to the Kwan\n\nbrothers.51\n\n        It must also be remarked at this stage that the\n\nfirst defendant’s plea in para 8 of his defence that the plaintiff terminated and\n\nrepudiated the memorandum by way of his solicitors’ letter dated 11 August 2000, was\n\nfound by me to be equally flawed. First of all, the MOU itself, by its very language,\n\nenvisaged further negotiations. When the first defendant forwarded four of the eight\n\nagreements, by his letter dated 18 April 2000 (AB-597 and 598), he himself invited the\n\nplaintiff to ‘review these agreements and revert as soon as possible’ (AB-598).\n\nAgain, by a letter dated 29 May 2000, Ramasamy signing on behalf of the first defendant\n\n(AB-698 and 699), asked the plaintiff or his solicitors to revert to him on the\n\n‘suitability of the agreements’, forwarded to the plaintiff. Given the\n\ncomplexity of the documentation and the web of new conditions making their appearance in\n\nthe said drafts, the plaintiff’s solicitors were well entitled to comment on these\n\ndrafts and come up with their own proposal. And that was what seemed to have happened when\n\nthe plaintiff’s solicitors sent in their letter dated 11 August 2000 (AB 887-to 889).\n\nTo characterise the counter-proposal a repudiation was in my view unreasonable.52\n\n        The next issue was in relation to the\n\ncounterclaim and the legal standing of the first defendant to continue with his\n\ncounterclaim.53\n\n        It should be remembered that the action herein\n\nwas commenced by the plaintiff on 21 February 2001 against the first defendant in his\n\ncapacity as the judicial manager of the company and against the Kwan brothers. The Kwan\n\nbrothers would not and did not appear at the trial. The first defendant averred in paras 2\n\nand 35 of his original defence and counterclaim, he was defending the action and\n\ncounterclaiming against the plaintiff on behalf of the company. However, the company\n\nhaving been wound up on 6 April 2001, the first defendant’s appointment as judicial\n\nmanager came to an end on that day and the court appointed three persons, Mr Ong Yew Huat,\n\nMr Nagaraj Sivaram and Ms Fang Ai Lian as liquidators of the company as of that date. The\n\nsolicitors for the liquidators, Rajah and Tan wrote to the solicitors on 25 April 2001.\n\nThe said letter, in fact addressed to the attention of the present counsel for the first\n\ndefendant read:1. We act for the Liquidators of\n\n    Yuan Guang Building Materials Pte Ltd (the \"Company\") and understand that you\n\n    act for the 1stDefendant Yin Kum Choy in the abovementioned Suit.2. We refer to your Defence and\n\n    Counterclaim against the Plaintiff Cendekia Candranegara Tjiang filed on 24thMarch 2001 wherein your client purported to assert a set-off and counterclaim against the\n\n    Plaintiff, for and on behalf of the Company, in respect of the Plaintiffs’ rental of\n\n    the Company’s assets. In view of the Order for Winding-Up by the Court dated 6thApril 2001 and the appointment of Mr Ong Yew Huat, Mr Nagaraj Sivaram and Ms Fang Ai Lian\n\n    as Liquidators of the Company, your client is not the appropriate party to assert such\n\n    claim against the Plaintiff.3. If, at all, any action in\n\n    respect of such claim should be commenced and/or maintained by the Company, it would be\n\n    the Liquidators of the Company who should be having the conduct of such action.4. Kindly make the necessary\n\n    amendments to the Defence and withdraw the said Counterclaim in the abovementioned Suit,\n\n    failing which we may have no alternative but to make the necessary applications to Court.(Signed)54     \n\nDespite the said communication from the solicitors for the liquidators, the first\n\ndefendant still would not let his grip off the counterclaim, preventing as a result, the\n\nplaintiff taking his case to the liquidators. That was not all. He further proceeded to\n\namend his defence and counterclaim by deleting the words in paras 2 and 35 of his defence\n\nand counterclaim which declared earlier that he was \"acting for on behalf of\n\nYGBM\". The plaintiff, left with no option, had to press on with the action and defend\n\nthe counterclaim made against him.55\n\n        Under s 272 (2) of the Companies Act (Cap 50)\n\nonly the liquidator of the company may ‘bring or defend any action or other legal\n\nproceeding in the name and on behalf of the company.’ In the case at hand, the first\n\ndefendant, having commenced the counterclaim for and on behalf of the company, had no\n\nfurther authority to continue with his action once his appointment had been revoked and\n\nthe liquidators had been appointed. The court was told that the first defendant was\n\ncontinuing with this action because of his perception that he might be held liable for\n\npossible negligence during his tenure of office. In my view, such a perception as regards\n\na contingency was not a valid ground to continue with his claim, especially in the light\n\nof clear instructions from the solicitors of the present liquidators.56\n\n        The foregoing conclusion alone might be\n\nsufficient to dispose of the first defendant’s counterclaim for want of authority and\n\nlegal standing. However, the following few observations on the substance of the\n\ncounterclaim should be made at this juncture.57\n\n        The counterclaim was by and large in respect of\n\nthe alleged rental for the assets of the company and for certain other outgoings. In my\n\nview, as I have noted earlier (para 42 infra), the evidence adduced by and on behalf of\n\nthe first defendant in relation to the rental aspect was far from satisfactory. In fact,\n\nwhat he claimed in his affidavit of evidence-in-chief was that he would ‘seek to\n\nrecover rent from IS Glass Pte Ltd [Newco] for the use of the assets of the Group as from\n\n1 January 2000 pursuant to the MOU [the memorandum]’ (para 100 of his affidavit of\n\nevidence-in-chief) and that he informed the plaintiff of the company’s proposal to\n\ncharge Newco about $80,000 a month for rental of company’s assets, at the meeting on\n\n26 February 2000 (para 108 of his AEIC). If this was the best he could come up with, in\n\nrelation to this rental claim, what was the basis to require the plaintiff to bear the\n\nentire rental sum and any outgoings? In my determination, the first defendant had wholly\n\nfailed to establish that the plaintiff assumed any personal responsibility to pay the\n\nrental or any other outgoings.58\n\n        Before concluding, I must also briefly deal\n\nwith the 10% earnest money paid pursuant to cl 17 of the MOU. The said clause stipulates\n\nthat the said sum shall not be refundable should the investor decide not to sign the\n\ncontracts. In Black’s Law Dictionary (Sixth Edition), ‘earnest money’ is\n\ndefined ‘as a sum of money paid by a buyer at the time of entering a contract to\n\nindicate the intention and ability of the buyer to carry out the contract. Normally such\n\nearnest money is applied against the purchase price. Often, the contract provides for\n\nforfeiture of this sum if the buyer defaults’.59\n\n        In the case before me, I could not on balance\n\ncome to a conclusion that the plaintiff was in any way responsible for the collapse of the\n\nwhole enterprise. Besides the elements of uncertainties intrinsic in the MOU, the actions\n\nby the Kwan brothers in demanding terms over and above what had been specified in the MOU\n\nand the emergence of some totally new and onerous terms in the draft agreements forwarded\n\nto the plaintiff were the factors that caused the demise of the provisional deal between\n\nthe parties. In my view, the blame could not be laid on the doorsteps of the plaintiff. He\n\nwas well entitled to come up with counter-proposals as he did through his solicitors’\n\nletter dated 11 August 2000, which in my opinion was not altogether unreasonable. Any term\n\nfound in the 11 August 2000 letter of the plaintiff’s solicitors, which was found to\n\nbe contrary to the terms in the MOU, could well have been addressed, negotiated and\n\nsettled. But it was not to be by the precipitous action of the first defendant in electing\n\nto treat the said letter as repudiation. In my finding, the course adopted by the first\n\ndefendant, no doubt upon advice, was faulty, unreasonable and could not be supported.60\n\n        In the premises, I ordered that the plaintiff\n\nbe entitled to the relief as prayed for in paras 12 (i), (ii) and (iii) of the statement\n\nof claim. Consequently, I dismissed the first defendant’s counterclaim. As regards\n\npara 12(ii) of the statement of claim, interest was awarded only from the date of writ,\n\nie, 21 February 2001. I further ordered that the plaintiff shall have recourse to the\n\ndeposit sum now being held in escrow by the liquidators and that costs shall be recovered\n\nfrom the first defendant, as undertaken by him at the commencement of the hearing in these\n\nproceedings.",
        "Order accordingly.": "Sgd:MPH RUBINJudgeCopyright © Government of Singapore."
    }
}