{
    "case_title": "Aglow Alicom Pte Ltd v Neewscomm Marketing Pte Ltd & Others",
    "ncitation": "[2002] SGHC 312",
    "coram": "Thian Yee Sze AR",
    "sections": {
        "[Total number of terminated customers] x [Percentage of customers who\n\nstay active] x [Average loss of usage per day] x [Average number of business days per\n\nmonth] x [Number of months which each customer remains as a customer with the plaintiffs]\n\nx [Profit margin]": "I looked into each of the factors in turn.4        With respect to (a), after\n\nconsidering all the evidence, I found that, on a balance of probabilities, the most\n\naccurate figure to use was 173. It is incontrovertible evidence that the attached schedule\n\nto the termination agreement of 31 August 1999 set out the plaintiffs’ customers,\n\nwhich stood at 322 according to the agreement (or more accurately, 321). This agreement,\n\ntogether with the schedule, was an agreement between the parties, and the 1stdefendants cannot recant from admitting the veracity of the contents of that agreement,\n\nunless very clear and unequivocal evidence is presented to the contrary. This, I failed to\n\nfind. I accepted Anthony Khoo’s evidence that the attached scheduled was prepared by\n\nthe 1stdefendants, as opposed to the 1stdefendants’\n\ncontention that it was prepared by the plaintiffs. The 2nddefendant’s\n\nevidence was inconsistent. He could not clearly ascertain when the termination of the 17\n\ncustomers (which the defendants contended were the only customers who terminated the\n\nplaintiffs’ services as a result of the 1stdefendants’ breach) took\n\nplace. I accepted Simon Har and Craymond Ching’s evidence that the database of the\n\nplaintiffs’ customers was handed to the 3rddefendants after the date of\n\nthe termination agreement. Having established that as at 31 August 1999, 322 customers\n\nwere the plaintiffs’ customers, I accepted the plaintiff’s evidence and found\n\nthat 173 of those had terminated the plaintiffs’ services (190 minus 17 who\n\nre-subscribed to the plaintiffs’ services).5        Factor (b) is crucial as\n\nnot all 173 customers who terminated the plaintiffs’ services could have done so\n\nbecause of the 1stdefendants’ breach of the non-solicitation term. This\n\nis because the customers who would have terminated the services in the normal course of\n\nthe plaintiffs’ business would have to be taken into account. After evaluating the\n\nplaintiffs’ expert witness, Chee Yoh Chuang’s, evidence as to the accurate\n\npercentage of attrition in the normal course of business, I found that the best figure to\n\nuse was 57.2%, based on Scenario 1 of his report and the findings in paragraphs 2.15 to\n\n2.17 therein. Although there was some evidence that some customers used the\n\nplaintiffs’ services after a lapse of more than six months, that was not, in my view,\n\nsufficient to establish such a trend as to render this selected pool of customers\n\n\"active\". As such, I did not rely on the premises set out in Scenario 2 of the\n\nreport. On the other hand, the defendants did not proffer any cogent evidence to rebut the\n\nfigures put forth by the plaintiffs.6        With respect to factor (c),\n\nI accepted the plaintiffs’ calculation that each customer used the plaintiffs’\n\nfax forwarding service at an average of 14.03 minutes per day. The defendants did not\n\nsubmit any cogent evidence to contradict this. Factor (d) is not in contention. With\n\nrespect to factor (e), I accepted Chee Yoh Chuang’s method of calculation in arriving\n\nat a period of 2.5 years, or 30 months, as set out in paragraphs 2.21 and 2.22 of his\n\nreport (taking the premises in Scenario 1). I did not agree with the defendants’\n\nsubmission that one should deem customers who were \"inactive\" for more than six\n\nmonths as customers who had terminated the services with the plaintiffs. First, there was\n\nevidence that some of these customers used the plaintiffs’ services after being\n\n\"inactive\" for more than six months. Second, the contractual terms in the\n\nplaintiffs’ standard agreement with their customers provided that termination would\n\nhave to be effected in writing. With respect to factor (f), I accepted the\n\nplaintiffs’ estimated figure of between $0.45 to $0.64 per minute. On the other hand,\n\nthe defendants did not produce substantiated evidence as to why these figures should be\n\nrejected. They submitted a figure of $0.30 per minute without explaining clearly how that\n\nfigure was arrived at. I arrived at a figure of $0.45 per minute, taking Anthony\n\nKhoo’s estimate.7        As such, the damages\n\nawarded to the plaintiffs payable by the 1stdefendants as a result of the\n\nbreach of the non-solicitation term are:",
        "173 (customers) x 0.572 (percentage of customers who stay active) x\n\n14.03 (average loss of usage per day in minutes) x 20 (working days per months) x 30\n\n(months in which each customer stays as a customer of the plaintiffs) x $0.45 (profit\n\nmargin per minute) = $374,855.20": "(II)        Damages for breach of\n\nthe confidential information term and breach of confidence8        There is an overlap in the\n\ndamages suffered by the plaintiffs as a result of the breach of the non-solicitation term,\n\nand the breach of the confidential information term and breach of confidence. The\n\nplaintiffs contended that the calculation for such a loss was either loss of profits or\n\nthe value of the information (which in this case was the database of customers). I was of\n\nthe view that calculating the loss to the plaintiffs on account of the value of the\n\ndatabase was not accurate; although there was some evidence that the 1stdefendants were trying to sell the 3rddefendants the database for $120,000, no\n\nagreement was reached. There was no definitive \"price\" which could be affixed to\n\nthe database. As for loss of profits suffered by the plaintiffs, it was difficult to\n\nattribute what portion of the terminated accounts was as a result of the breach of the\n\nnon-solicitation term, and what portion was as a result of the breach of the confidential\n\ninformation term and breach of confidence. Neither the plaintiffs nor defendants brought\n\nup any evidence towards this end. Hence, I could only calculate damages on the basis that\n\nthe loss of profits would be calculated as a result of all the three types of breaches as\n\na whole and not apportion the damages to each type of breach.9        For all the above reasons,\n\nI awarded the plaintiffs damages in the sum of $374,855.20 to be payable by the 1stand 2nddefendants. Interest on the judgment sum would be at a rate of 6% per\n\nannum from the date of the issue of the writ to the date of judgment. The costs of the\n\nassessment and the action are to be paid by the 1stand 2nddefendants to the plaintiffs, the quantum of which are to be agreed or taxed.Sgd:THIAN YEE SZEASSISTANT REGISTRARCopyright © Government of Singapore."
    }
}