{
    "case_title": "Ng Swee Eng (administrator of the estate of Tan Chee Wee, deceased) v Ang Oh Chuan",
    "ncitation": "[2002] SGHC 137",
    "coram": "Belinda Ang Saw Ean JC",
    "sections": {
        "Liability": "5.        The Defendant, at the\n\ntrial, gave his address as Block 451, #13-557, Hougang Avenue 10. At the time of the\n\naccident, he had lived there for the past nine years. The Defendant was undoubtedly\n\nfamiliar with the driveway, T-junction, pedestrian crossing and the traffic lights nearby.\n\nFor the past nine years, he would have used the T-junction to turn right on numerous\n\noccasions (seeNE 33/34).6.        On the morning in\n\nquestion, the Defendant together with his wife left home at about 6.30am for work. As with\n\nmost mornings, the Defendant would first drop off his wife at her workplace at Tai Seng\n\nDrive before making his way to Kranji.7.        That morning, Hougang\n\nAvenue 10 was still lit by street lights. The weather was clear, the road surface was dry\n\nand visibility was good. The traffic volume was moderate.8.        Along Hougang Avenue 10,\n\nin the vicinity of the driveway, are six traffic lights. There are four traffic lights at\n\nthe pedestrian crossing to the right of the driveway. The other two are overhead traffic\n\nlights. It is common ground that the traffic lights are push button controlled lights\n\noperated by pedestrians. Notably, these traffic lights do not control traffic emerging\n\nfrom the driveway into Hougang Avenue 10.9.        The Defendant contended\n\nthat at the time he proceeded to turn right, it was safe to do so; it was only due to the\n\nfact that the motorcyclist had gone through the red light at an excessive speed that the\n\ncollision occurred. According to the Defendant, his speed was about 5kmph. He estimated\n\nthe motorcyclist’s speed to be about 100kmph.10.        The Defendant submitted\n\nthat he was not negligent; the accident was entirely due to the negligence of the\n\ndeceased. Alternatively, it was said that if the Defendant was negligent, there was\n\nnevertheless contributory negligence on the part of the deceased. It was put forward on\n\nbehalf of the Defendant that the deceased was 70% to blame for the collision.11.        At this juncture, I\n\nshould mention that the Defendant was charged and convicted under s 304A of the Penal Code\n\n(Cap. 224). The charge reads as follows:\".. on the 17thday of January 2000 at about 6.37am, at\n\n    the T-junction of Hougang Avenue 10 and the driveway to the car park of Blks 435 –\n\n    458, Singapore, while driving motor lorry, YJ 9208K, [you] did cause the death of a motor\n\n    cyclist one, Tan Chee Wee, male 22, by doing a negligent act not amounting to culpable\n\n    homicide to wit, by failing to give way to oncoming traffic from your right whilst making\n\n    a right turn from the driveway of the said car park into the main road, Hougang Avenue 10,\n\n    thus causing a collision between your vehicle and a motor cycle, FM 1247J, ridden by the\n\n    deceased, Tan Chee Wee, who was travelling along Hougang Avenue 10 in the direction of\n\n    TPE, and consequently causing his death and you have thereby committed an offence\n\n    punishable under Section 304A of the Penal Code, Chapter 224.\"12.        S 304A provides:\"Whoever causes the death of any person by doing any rash or\n\n    negligent act not amounting to culpable homicide, shall be punished with imprisonment for\n\n    a term which may extend to 2 years, or with fine, or with both.\"13.        The Defendant claimed\n\ntrial. At the end of the trial, the Defendant was found guilty of failing to give way to\n\nthe deceased who was travelling on a main road whereas the Defendant was turning right\n\nfrom a minor road. The Defendant was fined $6,000 and in default a term of three\n\nmonths’ imprisonment. He was further disqualified from driving all classes of\n\nvehicles for a period of five years. He did not appeal against the conviction.14.        Under s 45A (5) of the\n\nEvidence Act (Cap 97), the charge and conviction are admissible in evidence.15.        The Plaintiff contended\n\nthat the accident was solely caused by the negligence of the Defendant. The particulars of\n\nnegligence pleaded in 7 of her Statement of Claim are:\"(1)    Failing to notice or to keep any or any\n\n    proper look out or to observe or heed the deceased;(2)    Driving out of the driveway into Hougang Avenue\n\n    10 too fast or at an excessive speed in the circumstances;(3)    Failing to give any or any sufficient signal or\n\n    warning of his approach to the deceased;(4)    Failing to stop in time or at all so as to steer\n\n    or control the said lorry as to avoid the deceased striking the said lorry;(5)    Driving into the path of the deceased and\n\n    colliding with the deceased;(6)    Failing to accord precedence to the deceased who\n\n    had the right of way;(7)    Failing to exercise reasonable care, skill and\n\n    prudence in the driving, use and management of the said lorry at the material time;(8)    Failing to stop, slow down, swerve or in any\n\n    other way avoid the said collision. \"16.        Although many particulars\n\nof negligence were pleaded against the Defendant, the crux of the plea comes down to\n\nreally one issue: would a reasonable driver in the position of the Defendant, have seen\n\nthe deceased earlier than the Defendant did and been able to avoid the collision.17.        Lord Macmillan inFardon\n\nv Harcourt-Rivington,146 Law Times 391 at p.392 observed:\"Members of the public, motor owners, and pedestrians alike, in\n\n    their use of the highway, owe to each other a duty to take care that they do not injure\n\n    each other. The mere circumstance of their being on a highway brings them into a\n\n    relationship with each other from which relationship arises the duty to have regard for\n\n    each other’s safety. In each case the question is whether there is any evidence of\n\n    such carelessness in fact as amounts to negligence in law- that is to breach of the duty\n\n    to take care. To fulfil this duty the user of the road is not bound to guard against every\n\n    conceivable eventuality, but only against such eventualities as a reasonable man ought to\n\n    foresee as being within the ordinary range of human experience.\"18.        Lord Macmillian’s\n\nstatement is applicable generally to actions in which the negligence alleged is founded on\n\nan omission to take due care for the safety of others.19.        At the exit of the\n\ndriveway is a stop line. This stop line is indicated on the sketch plan as \"C1\"\n\n(see AB10). The Defendant said he halted at the stop line, \"C1\", for a short\n\nwhile waiting for an opportunity to turn right. That opportunity came when traffic came to\n\na stop at the pedestrian crossing. He noticed two cars. One vehicle was to his left on the\n\nopposite side of the road in the direction of Hougang Central. The other vehicle was to\n\nhis right on the lane nearest him heading in the direction of Tampines Expressway. The\n\ntraffic light was on red. Both vehicles had stopped. He then entered the main road to turn\n\nright. At the mouth of the driveway, he looked right once more to make sure that his\n\npassage was clear. The mouth of the driveway is the imaginary line joining the letters\n\n\"e\" and \"b\" on the sketch plan.20.        It is clear that after\n\none last and final turn to his right at the mouth of the driveway to check for traffic,\n\nthe Defendant continued his passage across the T-juncture to turn right into Hougang\n\nAvenue 10 without keeping a look out for other users of the road. Having already checked\n\ntwice, he did not see the need to continue to do so or take any other precaution.21.        The Defendant was asked\n\nduring cross-examination (NE 42-43, 50):\"Q:     Did you at any point in time before\n\n    [you] turn[ed] into Hougang Avenue 10 look for traffic on second lane \"T-V\"?A:     When I was proceeding slowly I did check whether there was any\n\n    vehicles.Q:     You did that as you were moving?A:     Yes. When my vehicle was moving I turn to my right to check\n\n    again.Q:    Would it not be safe to stop and look if [the]\n\n    second lane was clear before turning?A:     Because I had already stopped and checked once. I found that\n\n    there was no vehicle.Q:     That was when you were at \"C1\"?A:     I checked at \"C1\". When I moved to \"e-b\", I\n\n    checked again.Q:     Did you stop at \"e-b\" to check or\n\n    was you lorry still moving?A:     I moved slowly.Q:     Going by your evidence, traffic already\n\n    stopped. 2 cars already stopped. It would have been safe for you to stop [the] lorry to\n\n    check before continuing. Why did you not stop?A:     When I moved to \"e-b\" I already looked again. At that\n\n    time I was moving slowly.….Q:     Do you agree with me that if you had stopped\n\n    your lorry just before passing into path of second lane at \"T-V\" and looked at\n\n    the second lane of \"T-V\" you would have seen the deceased?A:     I had already checked twice. I did not expect him to beat the\n\n    red light.Q:     Assuming the light was red, if you had\n\n    stopped your lorry and looked at \"T-V\" the deceased would have passed in front\n\n    of you instead of hitting your lorry?A:     It was not necessary to stop because I have checked twice.Q:     First time checked was at \"C1\"?A:     Yes.Q:     [Second] time you checked where was that?A:     When I reached \"e-b\". \"22.        The T-juncture at the\n\ndriveway was not controlled by any traffic lights. Having proceeded forward to turn right\n\ninto Hougang Avenue 10, the Defendant would have to take care. He was under a duty coming\n\nfrom a minor road to a major one to watch out and give way to traffic on Hougang Avenue10.23.        Even if the traffic light\n\nwas on red as he claimed (I shall deal with this point below), that fact did not entitle\n\nhim to drive without paying sufficient attention to oncoming traffic; especially, when he\n\nwas alive to the possibility of motorists proceeding without stopping. This is borne out\n\nby his answers to Counsel for the Plaintiff (NE 45):\"Q:    Supposing the lights are green and you are\n\n    turning right into Hougang Avenue 10, do you still drive slowly and look at the same time\n\n    for traffic?A:     I would still see if there are any oncoming vehicles even if\n\n    vehicles on my left and right have stopped.\"24.        Earlier he had said (NE 40):\"Q:    You assumed that because there was a red\n\n    light, you could go across the junction without looking at [the] second lane \"T\n\n    – V\". That is what you are saying?A:    No.\"25.        The Defendant, an\n\nexperienced lorry driver of 25 years, was aware and conscious that motorists could\n\nsuddenly drive through a red light when it was not wise to do so. He was therefore under a\n\nduty to take some precautions to guard against the occurrence of an accident as a result\n\nof such a possibility becoming a reality. This is not a case where the Defendant was\n\nentitled to assume as a matter of common sense that the T-juncture would remain clear and\n\nhe could cut across the main road without watching out for oncoming traffic.26.        Prior to impact, from the\n\ncorner of his eye the Defendant caught a glimpse of the motorcyclist about 10 m or two\n\nlorry-lengths away. By which time, even though he had stepped on the footbrake, it was too\n\nlate to avoid the accident. By his own admission, the Defendant did not, as he approached\n\nthe second lane, look to see if there was oncoming traffic. If he had kept watch and been\n\nvigilant, he could have stopped in time to allow the motorcyclist to cross in front of\n\nhim.27.        The Defendant submitted\n\nthat he could not see the motorcyclist as his view to the right was obstructed by a\n\nvariety of things: a bend in the road, bus stop, a tree and a stationary vehicle at the\n\nstop line before the pedestrian crossing and marked \"W\" on the sketch plan. At\n\nthe stop line \"C1\", he could see to his right vehicles on the first lane but not\n\nthose on the second lane unless they were close to the stop line \"W\". At the\n\nmouth of the driveway, he still could not see traffic further back along the second lane\n\nother than for vehicles that are nearer the stop line \"W\" (seeNE\n\n38-40).28.        The Plaintiff disputes\n\nthe Defendant’s contention that his view was blocked or restricted. Even on the\n\nDefendant’s contention, the obstructions that confronted the Defendant, would in my\n\nview have served as a warning to the Defendant to proceed and execute the manoeuvre with\n\nthe utmost care and caution. A. reasonable driver in the circumstances of the Defendant\n\nwhose vision was restricted as alleged, would have taken care during the passage through\n\nthe T-junction to look out for vehicles on the second lane coming from Hougang Central. If\n\nthe Defendant had done so, he would have seen the deceased earlier than he did and in time\n\nto avoid the collision.29.        Further, if is true that\n\nhis view was blocked, a reasonable driver in the circumstances of the Defendant would have\n\nas he approached the second lane either paused for a moment to check for oncoming traffic\n\n(and it is clear from the Defendant’s testimony that he did not think it was\n\nnecessary) or warned road users on the second lane of his approach or presence.30.        In my view, the\n\nobstruction alleged was nothing more than an excuse for his omission to keep a look out\n\nand for not seeing the motorcyclist earlier. There was no mention in the police report and\n\nin the Defendant’s affidavit of evidence-in-chief that his vision was obstructed,\n\nthat he had signaled his intention to turn right into Hougang Avenue 10, warned or alerted\n\nroad users on the second lane of his presence when approaching it, for example, by either\n\nflicking his headlights or sounding his horn. Moreover, the alleged obstruction was not\n\npleaded. The bend in Hougang Avenue 10 was not pleaded. It was the same with the bus stop\n\nand tree. In any case, the investigating officer’s evidence, which I accept, is that\n\nthe bus stop was not an obstruction and that was his reason for omitting it from the\n\nsketch plan. For that matter, the tree was also left out of the sketch plan.31.        On the evidence, after\n\nthe second look to the right at the mouth of driveway, the Defendant did not keep a look\n\nout for other road users. He was not vigilant, observant and did not warn road users on\n\nthe second lane of his approach or presence. He took the risk of executing the manoeuvre\n\nwhen it was unsafe to do so and did not perceive until it was too\n\nlate to react in time that the motorcyclist was moving into his path. I find the\n\nDefendant’s failure to keep a look out was causative of the accident. The failure to\n\nsee the deceased and take steps to avoid the collision was a breach of his duty to take\n\ncare. The Defendant was driving without sufficient regard to other users of the road. I\n\nfind that he failed to take reasonable care for the safety of other traffic on the road,\n\nand was therefore negligent.32.        The Defendant had alleged\n\nthat the motorcyclist was travelling at an excessive speed of about 100kmph. I do not\n\naccept the Defendant’s evidence. He was in no position to form an estimate of the\n\nspeed of the motorcyclist given that he only caught a glimpse of the deceased from the\n\ncorner of his eye. Very shortly thereafter, the collision occurred. He could not then have\n\nobserved the speed the motorcyclist was travelling at.33.        Zulkepli Bin Buniran (PW\n\n2) the investigating officer, Traffic Police gave evidence at the trial. At the material\n\ntime, the investigating officer was a Staff Sergeant. In year 2000, he has had three years\n\nexperience investigating some 200 motor vehicle collision cases at accident scenes of\n\nwhich 20-25 cases were fatal accidents. The accidents he had investigated included\n\ncollision between lorries and motorcycles.34.        The collision damage to\n\nthe lorry was minor (see 2AB 7 & 8). The repair costs together with replacement of\n\ndamaged parts was adjusted at $1,850.00 (see 2AB 4-6). I accept the opinion evidence of\n\nthe investigating officer drawn from his observations that the damage to the lorry was not\n\nindicative of excessive speed by the motorcyclist. He had examined the damage sustained by\n\nthe lorry and deduced from there that the deceased was travelling at a speed of 50-60kmph.\n\nHe testified that the speed limit along Hougang Avenue 10 was 50kmph. I thus find that the\n\nmotorcyclist’s speed prior to impact was between 50-60kmph.35.        I will now turn to the\n\nallegation that the traffic light on Hougang Avenue 10 was on red and the motorcyclist\n\nrode through the red light without stopping.36.        The Defendant was adamant\n\non this subject(NE 46 & 48):\"Put:     Not telling the truth about\n\n    traffic lights being red at the time of accident.A:       Disagree.\"……\"Put:   You are not telling the truth when you say\n\n    motorcyclist did not stop at the red traffic light.A:       I disagree.Put:    The traffic light was not red against the\n\n    motorcyclist at the time of the accident.A:      Disagree.\"37.        In his police report (AB\n\n9) the Defendant had stated:\"On 17/1/00 at 6:40am I was driving lorry YJ 9208K along the\n\n    unnamed road towards Hougang Ave 10. I stopped at the T-junction joining Hougang Ave 10.\n\n    When the red light appeared against the vehicle along both sides of Hougang Avenue 10 to\n\n    allow pedestrian to cross I proceeded to turn right into Hougang Ave 10. As soon as the\n\n    front part of my lorry reached the yellow box on the other side of the road a motor cycle\n\n    at fast speed coming from my right side on the outer lane and knocked into the right side\n\n    door of my lorry. The rider fell on the center of the road. I immediately called the\n\n    police .\"38.        That portion of the\n\npolice report was typewritten. The following additional information was handwritten:\" The said rider had passed away at scene. My right side of the\n\n    door was damaged. That’s all.\"39.        The Defendant ended his\n\nreport with the words \"That’s all.\". Nothing was specifically said in his\n\npolice report about the motorcyclist going through the red light. That fact if true, would\n\nhave been vivid in his memory. After all, it was an important and material piece of\n\nevidence to place on record in his police report.40.        On the day of the trial,\n\nthe Defendant applied for leave to amend his Defence to include a plea that the\n\nmotorcyclist had gone through the red light. The omission in the police report coupled\n\nwith this late amendment undermined the credibility of the Defendant’s testimony.41.        Further doubt I had about\n\nthe Defendant’s assertion on this point, stemmed from his rather unsatisfactory\n\nanswers to questions from Counsel for the Plaintiffs. He said that two cars had stopped at\n\nthe pedestrian crossing. One vehicle was to his left on the opposite side of the road in\n\nthe direction of Hougang Central. The other vehicle was to his right on the lane nearest\n\nhim heading in the direction of Tampines Expressway. When questioned, he was not able to\n\ntestify to the make and colour of the vehicles (seeNE 46/47):\"Q:    Car that stopped on [your] right, what car\n\n    was it?A:      It is a car. Ordinary car.Q:      Do you remember the colour?A:      I can’t remember because the street lamp was orange\n\n    in colour.\"42.        I find his evidence\n\nunbelievable. Even if the street lights had affected his ability to make out the colour of\n\nthe vehicles, he should still have been able to tell the court whether the cars were light\n\nor dark in colour.43.        The Defendant in closing\n\nsubmissions sought to rely on the presence of pedestrian(s) at the traffic light to\n\nsupport his contention that the traffic light was on red. Counsel referred me to the\n\ncertified notes of evidence in the criminal case. Those certified notes of evidence do\n\nform part of the record of proceedings and are admissible in evidence under s 45(A)(5) of\n\nthe Evidence Act. However, in deciding the weight (if any) to be attached to evidence,\n\nregard should be had, for instance, to whether the person whose testimony is being relied\n\nupon was or was not a witness in the civil proceedings; whether the accuracy and veracity\n\nof the evidence was tested before the trial judge for the purpose of destroying or\n\nsupporting his or her credibility.44.        The Defendant’s\n\ntestimony before the criminal court on that point appeared inconsistent and confused. The\n\nDefendant in his affidavit of evidence-in-chief said nothing at all about pedestrian(s) at\n\nthe crossing; that in executing the turn he was mindful of pedestrian(s) using the\n\ncrossing or had to wait for them to cross the road before turning right. Before me, no\n\nquestion was asked about that. I accordingly attached no weight to the evidence in the\n\ncriminal case on that subject.45.        The investigating officer\n\nhad also testified that in the course of his investigations, he was not able to confirm\n\nthe Defendant’s story that the vehicles that had stopped at the pedestrian crossing\n\n(seeNE 24/25).46.        In  6 and 7 of the\n\nDefendant’s written testimony, he stated that the traffic light was green when he\n\nstopped at C1. It later changed to red. I agree with Counsel for the Plaintiff that the\n\nchange of traffic light was not corroborated by his wife Neo Pheck Luan (\"Neo\").\n\nShe had closed her eyes when the lorry halted at the stop line.47.        Neo, DW2, gave evidence\n\nof events shortly before and shortly after impact.48.        In my view, it would be\n\nunreasonable to rely upon the Defendant’s wife as an accurate witness. She did not\n\nsee the accident at all. She did not see the traffic light turn red before the Defendant\n\nentered the main road. She had shut her eyes to rest when the lorry was at the stop line\n\nof the driveway. She opened her eyes after she was abruptly thrust forward when the\n\nDefendant’s applied the footbrake. At that stage, she claimed that the traffic light\n\nwas on red.49.        In  6 of her written\n\ntestimony, Neo said:\"when the lorry was approaching the car park exit, it stopped. I\n\n    felt tired and I just closed my eyes, but I did not fall asleep.\"50.        Neo, during\n\ncross-examination, clarified that she closed her eyes after the lorry approached C1 and\n\nstopped there.51.        In  12 of her written\n\ntestimony she said \"when the lorry was moving out into the junction,the\n\ntraffic lights along Hougang Avenue 10 were red\". I find her testimony\n\nuntruthful. By that time, she had already closed her eyes. She was therefore in no\n\nposition to make such a statement in  12.52.        Neo was reluctant to\n\nidentify the particular traffic light she saw that was on red when she opened her eyes.\n\nShe said (NE 64 to 67):\"Q:     When opened [your] eyes, you were\n\n    facing forward?A:      Yes.….Q:     You could see in front of the lorry at eye\n\n    level?A:      I saw the red traffic light because it was shinning at\n\n    me.Q:     Where was the traffic light? Was it in front\n\n    of you?A:      I can’t describe it. There is no photo for me to\n\n    see.Q:      Did you turn your head to see [the]\n\n    traffic light?A:      No.Q:     Look at sketch plan. Indicate where is the\n\n    traffic light.A:     I’m not sure. I’m afraid that I might draw at the\n\n    wrong place…Q:     In order for you to notice [the] car on your\n\n    left and traffic light, you would have to turn your head?A:     My body moved forward. I saw traffic light shinning red. There\n\n    was a vehicle stopped at \"K\". There were 2 vehicles stopped at \"K\".Q:     One behind the other or side by side?A:     Side by side.Q:     After that you turned to [your] husband and\n\n    asked him what [had] happened?A:     I did not turn. I leaned forward and asked him what [had]\n\n    happened. I opened my eyes I saw red light. I asked him what happened and then heard the\n\n    bang.Q:     Put:     what you saw is\n\n    not possible.A:     Disagree. I can tell you what I saw.Q:     Do you agree that you may have been mistaken\n\n    about the red light?A:     When I opened my eyes the red light was shinning at me.Q:     You could be mistaken because you were tired\n\n    and sleepy?A:     NoQ:     Put:     You are not\n\n    telling the truth.A:     Disagree. \"53.        Her reluctance is\n\ntelling. I would have expected her to be able to without hesitation point to the traffic\n\nlight in question. I contrast that with her willingness and ability to identify the\n\ntraffic light she had referred to in  12 of her affidavit of evidence-in-chief when in\n\nreality she ought not to be able to do so since by her own admission her eyes were closed\n\nat the time (see NE 66).54.        In my view, Neo is an\n\nunreliable witness. This can be further illustrated by her rather confused and\n\ninconsistent account of the sequence of events after she had opened her eyes on being\n\nabruptly thrust forward when the Defendant applied the footbrake. Her oral testimony on\n\nthis point is also totally inconsistent with what she had said in her affidavit of\n\nevidence-in-chief.55.        In  7 to 10 of her\n\nwritten testimony, she said that her husband had suddenly stepped on the brake. She then\n\nopened her eyes. After that she heard a loud bang to the right of the lorry. She asked her\n\nhusband what had happened and was told that they have been involved in an accident. During\n\ncross-examination, she came up with inconsistent versions. The first is this ( NE 63 -64\n\nand 67):\"A:     ..All I know was [he] suddenly jammed\n\n    brakes. My body moved forward. I opened my eyes.…Q:     Bang occurred after you asked him\n\n    [Defendant] what [had] happened?A:     After I asked him what happened, I heard the bang.\"…She gave the same answer - she asked her husband what had happened and\n\nthen heard the bang - several questions later (see NE 67).56.        However, towards the\n\nclose of cross-examination, she said [see NE 70]:\"A:     On that day he stopped at\n\n    \"CI\". I shut my eyes. He moved slowly. I heard screeching sound. I saw red\n\n    light. I saw vehicles. I heard a loud bang.\"57.        In the circumstances, I\n\nam not satisfied that the Defendant has established on a balance of probabilities that the\n\ntraffic light was on red at the material time.I agree with Plaintiff’s Counsel that the more likely version is\n\nthat the Defendant had moved into the T- Junction without waiting for the light to turn\n\nred. As Counsel had submitted, the Defendant would not normally wait for the traffic\n\nlights along Hougang Avenue 10 to change since they are pedestrian controlled lights.",
        "Contributory Negligence": "58.        The Defendant submitted\n\nin the alternative that the deceased was 70% to blame for the collision.59.        On the question of\n\ncontributory negligence, the Defendant bears the onus. The question is whether the\n\nDefendant has made out a case of contributory negligence. If so the question then arises\n\nas to the extent to which it is just and equitable to reduce the Plaintiff’s damages\n\nhaving regard to the contribution by the deceased to his own death.60.        The principles of\n\ncontributory negligence are set out in Halsbury’s Laws of Singapore Vol. 18 at \n\n240.326 and 240. 327.  240.326 reads:\"The existence of contributory negligence does not depend on any\n\n    duty owed by the plaintiff to the defendant and all that is necessary to establish a plea\n\n    of contributory negligence is for the defendant to prove that the plaintiff did not in his\n\n    own interest take reasonable care of himself and contributed by this want of care to his\n\n    own injury.\"61.        Further, at  240. 327:\"..The standard of care depends on foreseeability. .. [S]o\n\n    contributory negligence requires the foreseeability of harm to oneself. A person is guilty\n\n    of contributory negligence if he ought reasonably to have foreseen that, if he did not act\n\n    as a reasonably prudent person, he might hurt himself. A plaintiff must take into account\n\n    the possibility of others being careless. As with negligence, the standard of care is\n\n    objective in that the plaintiff is assumed to be of normal intelligence and skill in the\n\n    circumstances…\"62.        The Defendant, in his\n\nAmended Defence, pleaded that the deceased had failed to keep a proper lookout for\n\nvehicles emerging from the slip road. I take reference to \"slip road\" there as\n\nthe driveway. He also pleaded that the deceased had failed to slow down when approaching a\n\ntraffic-controlled junction; failed to swerve or otherwise control and manage his\n\nmotorcycle so as to avoid colliding into the lorry.63.        Even though the traffic\n\nlight was, as I have found, in the motorcyclist’s favour, there is no rule of law\n\nthat the motorist cannot be guilty of contributory negligence; it all depends on the facts\n\nof each case:240.330 of Halsbury’s Laws of Singapore, Vol 18. The deceased\n\nmust take into account the carelessness of others:Jones v Linox Quarries Ltd(1952) 2 QB 608 at 615;240. 327 Halsbury’s Laws of Singapore Vol. 18. A\n\nreasonable motorcyclist in the position of the deceased must anticipate that if he\n\ncollides with a lorry he is likely to be injured more severely in a collision than the\n\ndriver of a lorry. That imposes a duty on the motorcyclist to take care of his safety.64.        The Defendant said that\n\nhe only caught a glimpse of the deceased from the corner of his eye when he was outside of\n\nthe yellow box near the letter \"N\" on the sketch plan. The deceased was\n\nsomewhere along the pedestrian crossing marked \"X\" on the sketch plan. The\n\nDefendant said that the motorcyclist was travelling along the middle of the second lane.65.        The Plaintiff said that\n\nfrom the sketch plan the lorry had traversed three-quarters of the width of the second\n\nlane prior to impact. By the Defendant’s reckoning, the lorry had cut across half the\n\nwidth of the second lane. The length of the lorry is 5m 70cm. The width of the first lane\n\n\"V – R\" is 3m 70cm. Thus, I find that prior to the impact, 2m of the lorry\n\nwas across the width of the second lane which is 3m 30cm. As such and given the fact that\n\nthe vehicle in question was a lorry, a reasonable motorcyclist in the position of the\n\ndeceased would have seen the lorry. The absence of tyre marks indicated that the deceased\n\neither did not see the impending collision in time or had misjudged the lorry’s speed\n\nand distance from the point of impact. I therefore find that the deceased was at fault in\n\nfailing to keep a proper look out. He had thereby contributed by his failure to take\n\nreasonable care of himself to his own death.66.        In my view, on the facts\n\nof this particular case the Defendant was far more at fault and is to bear a greater share\n\nof the responsibility for the damage, which flowed from his breach of duty towards other\n\nroad users. I find him 80% to blame and the deceased 20% to blame for his own contributory\n\nnegligence.67.        Accordingly, there be\n\njudgment for the Plaintiff with costs. I order that damages be assessed by the Registrar.Sgd:BELINDA ANG SAW EANJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}