{
    "case_title": "Public Prosecutor v Aw Teck Hock",
    "ncitation": "[2002] SGHC 249",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "Previous Convictions": "11        The accused was convicted\n\nof the offence of gaming in public in 1981, 1985 and 1994 and of the offence of gaming in\n\na common gaming house in 1995 for which he was fined on each occasion.",
        "The Mitigation Plea": "12        The accused was a cleaner\n\nworking in the Ministry of Environment Building. On 14 May 2002, he was invited by 4\n\ncolleagues to join them for drinks after work.13        At about 7 pm, 3 of them\n\nshared 2 bottles of beer at a coffee shop at Bukit Merah View. The other 2 persons drank\n\ncoffee and then left the group. At about 9pm, the 3 proceeded to a pub at Clarke Quay\n\nwhere they shared one jug of beer. They then went to a karaoke lounge in Kim Seng Road.\n\nOne of the trio had beer and then left. The accused and the remaining colleague drank one\n\nand a half bottles of brandy until about 2 am when they shared a taxi home. Both lived in\n\nTaman Ho Swee.14        The accused stumbled home\n\nand opened the main door. In his drunken stupor, he saw his father storming towards him\n\nand hurling vulgarities at him. They quarrelled and he vaguely remembered having pushed\n\nhis father away. The rest of the events in the early hours that day were completely hazy\n\nto him.15        When he woke up around\n\nnoon and saw his father lying motionless on the floor, he tried to rouse him. He then\n\ntelephoned the police and his sister and waited for the police to arrive.16        The accused married in\n\n1989 and divorced in 1997. His wife has custody of their son aged 9 and their daughter\n\naged 12. After his divorce, he moved in with his father. He was usually unemployed due to\n\nhis low education and the poor state of his mental and physical health. He used to do odd\n\njob labour until March 2002 when he got a job as a cleaner earning $40 per day. He was\n\npaid fortnightly.17        Being the youngest in a\n\nfamily of 7 siblings, he was doted on by his father with whom he had lived harmoniously\n\nfor the past 5 years. His mother passed away a few years ago. The family had a tragic\n\nhistory. His eldest brother committed suicide in 1986 and his second eldest brother was\n\nstabbed to death in 2001. The attack on his father was completely uncharacteristic and he\n\noffers no excuse for his actions. He is truly remorseful and suffers immense agony over\n\nthe tragic incident day after day. He \"is the one who will suffer the most from the\n\nloss of his father who died at his hands\". The tragedy happened within the family and\n\nthe accused is not a danger to anyone.18        His previous convictions\n\nwere rather long ago and did not involve offences of violence. He used no weapon in the\n\nattack on his father. He was not a habitual drinker of alcohol – he could scarcely\n\nafford to do so.19        Among the many cases cited\n\nwasPP v Jamal anak Nyalau[2002] 3 SLR 66where the 3 accused persons there\n\nwere convicted of an offence under section 304 (b) Penal Code and sentenced to\n\nimprisonment of 6 years and 6 months each. There, the 3 accused persons had attacked a\n\nhelpless victim without provocation. They had no previous conviction and had pleaded\n\nguilty at the first opportunity. No weapons were used. It was argued that there was some\n\nprovocation by the father in the present case. Further the victim here was not\n\noutnumbered. I was therefore urged to imprison the accused for no more than 6 years.",
        "THE DECISION OF THE COURT": "20        I acknowledge that the\n\naccused did inform and cooperate with the police and has pleaded guilty. I also accept\n\nthat the previous convictions show him to be a man given to gambling rather than to\n\nviolence.21        The father was 73 years\n\nold. It is quite apparent from the extensive injuries suffered by him and the total lack\n\nof injury on the accused’s body that the deceased was frail while the accused was\n\nmuch more robust despite his assertion about having a rather weak disposition. Whatever\n\nlittle provocation came from the elderly man was not something that was so out of the\n\nordinary that it should cause so explosive a reaction. The accused literally kicked a man\n\nwho was down and out.22        It was highlighted in\n\nmitigation that the accused carried his father to the mattress after the attack before he\n\nwent to bed. Even so, I seriously doubt it was an act of filial piety or of tender mercy\n\nor even of remorse. It is as comforting as having been robbed and then having the robber\n\nwish you, \"Have a good day\". It would of course be quite different if he had the\n\ngood sense then to call for the police or for an ambulance.23        It was also said that the\n\naccused was no habitual drinker of alcohol. However, the merry-making sessions in the\n\nevening of 14 May 2002 showed that this could not be so. The effects of consuming\n\nexcessive alcohol are well known and should certainly be known to the then 37 year old\n\naccused. The law does not allow intoxication as a defence to a criminal charge except in\n\nvery limited circumstances (sections 85 and 86 Penal Code). Intoxication is also of no\n\nmitigating value in the case of a grown-up man like the accused. He who imbibes\n\nexcessively and is then imbued with Dutch courage should not be heard crying,\n\n\"Don’t blame me, it’s the alcohol\" when charged with some offence\n\ncommitted in the state of intoxication.24        In the circumstances, I\n\ncould not agree that the accused should be given a sentence at the lower end of the scale\n\nprovided in section 304 (b) Penal Code. I therefore sentenced him to 9 years imprisonment\n\nwith effect from 15 May 2002, the date of his arrest.Sgd:TAY YONG KWANGJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}