{
    "case_title": "Ong Heng Chuan & Another v Ong Boon Chuan & Another",
    "ncitation": "[2002] SGHC 285",
    "coram": "Belinda Ang Saw Ean JC",
    "sections": {
        "Terms of the common understanding": "12.        OHC deposed in his\n\naffidavit filed on 4 February 2002 (and OTC’s affidavit is identical in substance) as\n\nfollows:\"8. Under the proposed rights issue, both the 2ndPlaintiff and I were each entitled to subscribe to 260,000 shares in the company at $1.00\n\n    per share. However,both the 2ndPlaintiff and I needed time to raise funds\n\n    to take up the shares which we were entitled tofor we had earlier, in May 1999, each\n\n    paid the Company the sum of $260,000 to take up the 260,000 shares which we were each\n\n    entitled to under the earlier rights issue made in May 1999.9.In view of the urgency facing the Company then to raise funds,\n\n    the 1stdefendant proposed to lend both the 2ndplaintiff and I the\n\n    monies required to take up our rights issue on the basis that he would hold the shares in\n\n    his name on trust for us until we were able to repay him the money.10. On that basis and trusting that the 1stdefendant (who\n\n    is our elder brother) would honour his words, both the 2ndPlaintiff and I\n\n    assented to the proposed rights issue.\"[emphasis added]13.        8 and 9 contemplate\n\nthe existence of an express trust. OBC in his affidavit of 26 February 2002 denied that\n\nthere was any conversation between the Plaintiffs and himself whereby he agreed to hold\n\n260,000 shares each on trust for the Plaintiffs. OHC and OTC each filed a further\n\naffidavit on 9 March 2002. The Plaintiffs clarified that their case is founded on\n\nconstructive trust. OHC explained:\"4. My contention of the subsistence of the trust arises in the\n\n    following way. Thesole reasonfor the 2ndplaintiff and I assenting\n\n    to the calling of the rights issue in October 1999 was the common understanding reached\n\n    between the 1stdefendant, the 2ndplaintiff and I that the 1stdefendant would provide the necessary funds to take up our rights issue on the basis that\n\n    he would transfer to the 2ndplaintiff and I our entitlement of 260,000 shares\n\n    each when we were able to reimburse him for the price of acquiring our shares. Pending the\n\n    2ndplaintiff and I making reimbursement to the 1stdefendant, it\n\n    was the 1stdefendant’s idea that the shares would be registered in his\n\n    name as security.I am advised and I verily believe that such a common intention\n\n    results in the 1stdefendant holding in trust for us our entitlement of the\n\n    share.5.Without such a common intention, both the 2ndPlaintiff and I would never have assented to the rights issue in October 1999for (a)\n\n    we would be relinquishing our majority control to the 1stdefendant without any\n\n    consideration and (b) we would be relinquishing such control for a song since the price\n\n    paid for the rights shares was $1 per share while the value of each such share was much\n\n    more than $1….6. It was pursuant to such common intention that the 1stdefendant went ahead to apply for 1 million shares to be issued to him.\"[emphasis added]14.        OTC agreed with 4 to\n\n6 of OHC’s second affidavit.15.        The oral evidence of OHC\n\nand OTC changed significantly the common understanding so definitively expressed in their\n\nrespective affidavits. In the result, the terms of the common understanding are imprecise\n\nand the credibility of the Plaintiffs’ case is undermined. It is necessary to\n\nidentify the inconsistencies in the various conflicting accounts of the Plaintiffs’\n\nevidence.16.        In the course of\n\ncross-examination, both the Plaintiffs said that they would have been able to take up the\n\nshares in October 1999 because they could have borrowed from others. This is the first\n\nshift from the written testimony. Apart from that, two other matters were raised. Firstly,\n\na \"scheme\" to show to Ong Leong Chuan (\"OLC\") that the October rights\n\nissue was not designed to oppress him and secondly, the plan to marginalise OLC by\n\ndiluting his shares.17.        In oral evidence, OHC\n\nsaid that the pre-acquisition arrangement for the shares to be registered in OBC’s\n\nname was to ensure that OLC could not complain that the October rights issue was designed\n\nto oppress him as the Plaintiffs too did not have funds to subscribe to the rights issue.\n\nOHC said:Q:    ….[S]o this plan to fool Mr Ong Leong Chuan\n\n    was the real reason why the shares were put in Mr. Ong Boon Chuan’s name, is that\n\n    your evidence?A:    This was a common understanding at that\n\n    time.\"[VN 104]18.        The shift from the\n\nwritten testimony is evident from the series of questions put to OBC during\n\ncross-examination:\"Q:    Well, I’m putting it to you Mr. Ong,\n\n    that both the Plaintiffs would have subscribed for the rights issue if not for the fact\n\n    that you and the Plaintiffs had an understanding that all the shares would be put in your\n\n    name to give an appearance to Mr. Ong Leong Chuan that both the plaintiffs could not take\n\n    up the shares.A:    I don’t agree\"[VN 609]……\"Q:    I put it to you Mr. Ong, that the reason why\n\n    you made payment for all the 900,000 extra shares by the deadline, was because of the\n\n    scheme you had with the plaintiffs to have all the shares registered in your name in order\n\n    to give Mr. Ong Leong Chuan the appearance that the plaintiffs were not able to pick up\n\n    their shares.A:    I don’t agree, ..\"[VN 619]19.        According to OHC, the\n\n\"scheme\" was suggested by either OBC or TCY. This \"scheme\" or plan was\n\nnot alluded to in the affidavits filed by the Plaintiffs nor was it addressed in the\n\nPlaintiffs’ Opening Statement. OHC’s earlier answers to Counsel for 1stDefendants expose the flaw in his own testimony:\"Q. Did you agree to this suggestion?A.We had this understanding, but I don’t recall whether I\n\n    agreed, I remember we had this understanding.Q. What understanding are you talking about now?A. The understanding that I just mentioned.Q. Which is?A. We have no money to take out the shares, to show that we don’t\n\n    oppress Ong Leong Chuan.Q. So you agree to it?A. This is one of the suggestions andI recall that the share was\n\n    already registered under Ong Boon Chuan’s nameas the director. As the\n\n    security.\"[emphasis added][VN 37]20.        OBC has denied the\n\nexistence of such a plot or plan. His denial is corroborated by TCY. TCY explained that\n\nthis ex post facto argument was his idea for the minority oppression action that started\n\nin December 1999, well after the October 1999 rights issue. OLC in that action had\n\ncomplained that the affairs of the company were being conducted in a manner that was\n\noppressive to him.21.        OTC in oral evidence said\n\nthat the common understanding was to marginalise OLC by diluting his shares. Counsel for\n\nthe Plaintiffs went on to suggest to the 1stDefendants that the \"real\n\nreason\" for proposing the rights issue in October 1999 was to dilute the shares of\n\nOng Leong Chuan (see VN 594).22.        OTC conceded that there\n\nwas a risk of the plan going awry. The common understanding as alleged would not\n\nmarginalise OLC by diluting his shares. The way to go about achieving that objective, if\n\ntrue, would be for the Plaintiffs to take up their entitlement of the rights issue shares\n\nin their respective names.23.        The Plaintiffs say that\n\nthey would not have assented to the October rights issue without the common understanding\n\nas it would have meant relinquishing majority control bears the hallmark of rationalised\n\nevidence. OHC’s testimony is also unreliable for another reason. The 1stPlaintiff admits that at the time of pre-acquisition of the rights issue shares, he was\n\nnot concern with voting rights and majority control. He only came to appreciate the\n\nimportance of voting rights in July or August 2001 when he tried to get the board of Tong\n\nGuan to approve the transfer of shares from 1stDefendant to him.24.        Although OBC’s\n\nshareholdings substantially increased after the October rights issue, it is not enough to\n\ngive him majority control of Tong Guan. The Plaintiffs’ contention of majority\n\ncontrol by OBC is based on OBC acquiring both the Plaintiffs’ October rights issue\n\nshares as well OLC’s shares under the Tomlin Order in OS 1944 of 1999. I accept the\n\nsubmissions of Counsel for 1stDefendant that it is factually impossible for\n\nthe 1st Defendant to take into account any purchase of OLC’s shares in August or\n\nSeptember 1999 when the Tomlin Order was only made in July 2000. Moreover, there is no\n\nproper evidence before me as to the value of the shares at the material time. The value of\n\nthe shares then was, as Counsel for 1stDefendant argued, anybody’s guess.\n\nIt is quite clear from the minutes of the EGM on October 1999 that the Plaintiffs and 1stDefendant deferred discussion on OLC’s proposal for a management buy-out as the\n\naccounts of the Malaysian subsidiaries were not available to the Plaintiffs and 1st\n\nDefendant to determine the fair value of the shares in Tong Guan.",
        "When was the common understanding reached?": "25.        Counsel for the\n\nPlaintiffs submits that the common understanding was reached at different times with each\n\nof the Plaintiff and OBC. The evidence does not support this submission. It is not stated\n\nanywhere in their affidavits that they each separately reached the common understanding\n\nwith OBC. In fact the impression given was that it was reached at the same time. In oral\n\nevidence, OCH stated that prior to the 1stOctober 1999 EGM, there were several\n\ndiscussions in August/September 1999. During those discussions, both he and OTC reached\n\nthis common understanding with OBC. He mentioned that OTC, OBC, OSA and TCY were present\n\nwhen the common understanding was discussed in 1999. He gave the impression that OTC was\n\nalso present when the common intention was reached.\"Q. Was Mr Ong Teck Chuan part of this agreement between you and\n\n    Mr Ong Boon Chuan?A. Yes, your Honour.Q. Did both of you agree to Mr Ong Boon Chuan’s idea or proposal\n\n    at the same time?A. Yes, your Honour.\"[VN 42]26.        However, during\n\nre-examination he said that when this common understanding was reached between himself and\n\nOBC, both OSA and TCY were present. He was not sure whether OTC was present.27.        OTC’s evidence is\n\nthat OBC had told him that he would put up funds for his rights issue and that the shares\n\nwould be returned to him upon reimbursement. OHC was not present during this conversation\n\nbut he is unable to recall whether anyone else was present.28.        TCY and OSA deny being\n\npresent when the alleged common understanding was reached. If there were such an\n\narrangement TCY would have recorded it in writing. He had no record of such a meeting or\n\narrangement. TCY said that he was at meetings where the parties would talk about raising\n\nmoney to pay off UOBVI through the rights issue. I accept his evidence that he was not at\n\nany critical meeting where the brothers allegedly agreed on what and how they wanted to\n\ndistribute the October right issue shares among themselves.",
        "Was there a loan?": "29.        OHC, with whom OTC\n\nconcurs, deposed in 4 of OHC‘s second affidavit, that the sole reason for agreeing\n\nto a rights issue in October 1999 was the existence of the common understanding of a loan.\n\nOHC contradicts himself during cross-examination:\"Q:    And you will also agree that the rights\n\n    issue helped to pay UOBVI the October 1999 rights issue? It helped to pay UOBVI?A:    That is one of the reasonsQ:    And you will also agree thatit is precisely\n\n    because of this reason that you agree to the October 1999 rights issue?A:Yes, Your Honour.\"[Emphasis\n\n    added][VN 87]30.        OBC denounces as untrue\n\nand incredible the Plaintiffs’ contention that he had extended a loan to them to\n\nsubscribe to the shares and the shares were held in his name as security. It is against\n\nlogic and common sense to go ahead in this way. It would have been logical for OBC to loan\n\nthe money directly to OHC and OTC and for them to handover the shares and duly executed\n\nblank transfer forms to OBC as security for the loan. Moreover, there was no discussion or\n\nagreement on the repayment period. Neither the Plaintiffs nor the 1stDefendant\n\nraised this question. The idea of an indefinite loan at a time when 1stDefendant had cash flow constraints would seem particularly unattractive, seeing that he\n\ndid not think that his brothers would have difficulty raising funds from borrowings and\n\nhad told them to raise their own funds. Overall, I find that the Plaintiffs have not\n\nestablished the existence of a loan as alleged.31.        Even if there was a loan,\n\nthe loan arrangement is not acquisition of property within thePallant v Morgandoctrine.",
        "August 2000 meeting and purported sale of 260,000 shares to OHC": "32.        On 23 August 2000, at a\n\nmeeting held at the offices of Tan Cheng Yew, OBC offered to sell to OHC and OTC an equal\n\nnumber of ordinary shares in Tong Guan, namely, 260,000 each. The minutes of that meeting\n\ntell against the Plaintiffs’ case. The sale fits in with OBC’s evidence that\n\nafter settling with OLC in OS 1944 where he had offered to sell to OLC 380,000 October\n\nrights issues shares as part of the settlement, OTC had complained that OBC had not given\n\nhim a similar opportunity to purchase shares. This testimony is unchallenged by the\n\nPlaintiffs. The sale of the shares was also to give the Plaintiffs a larger stake in the\n\ncompany in order to motivate them in the family business. Therefore, in August he made an\n\noffer to sell 260,000 shares to each of the Plaintiffs at a price of $290,000. The\n\nPlaintiffs were given an option to purchase 260,000 shares or a smaller quantity. The\n\nminutes of the family meeting confirmed the 1stDefendant’s case. The\n\nminutes were prepared by TCY who testified that at the meeting the sale of shares was\n\noffered. TCY’s attendance note reads:\"260,000 right issue (Oct 1999) OBC paid, to be repaid by 31/10/01\n\n    (optional). Option to purchase the shares at a price, the price at which they [are to]\n\n    purchase the shares $290,000 rateable and proportionate, don't have to pay all to get\n\n    all.\"He explained his attendance note:\"A. You can buy a portion of the shares if you want. So you don't\n\n    have to buy the whole 260,000 shares. If you wanted to buy for example 100,000 shares, you\n\n    could buy it, but the price you pay is a proportion of $290,000.\"[VN 458]33.        TCY’s attendance\n\nnote is contemporaneous documentary evidence. The option to purchase part if not all of\n\nthe 260,000 shares fits in with the 1stDefendant’s case of a sale. If\n\nthere was a trust as alleged, there could be no option to purchase part of the shares.34.        I accept the 1stDefendant’s submission that the 40:30:30 distribution of OLC’s shares pursuant\n\nto the Tomlin Order of July 2000 discussed on 23 August 2000 is consistent with OBC’s\n\ndesire to enlarge the shareholdings of both the Plaintiffs to motivate the management of\n\nTong Guan. At that meeting the sale of 260,000 shares to each of the Plaintiffs coupled\n\nwith the 30% purchase of OLC’s shares under the Tomlin Order was made. If carried\n\nout, the Plaintiffs would have substantially more shares than OBC. TCY confirmed that OBC\n\nwas trying to be the peacemaker and he felt that if everyone had a sizeable interest in\n\nthe company, it would motivate them to work together for their mutual benefit.35.        The Plaintiffs took the\n\nposition that no sale of shares was discussed. The discussion was on the return of shares\n\nfor $290,000. Nevertheless, in a letter dated 17 August 2001 to TCY, M/s Kumar & Loh\n\n(AB 189), on instructions from OHC, referred to the shares as having been\n\n\"bought\" from OBC and wanted to know when the shares would be registered in the\n\nname of the 1stPlaintiff.36.        In the present matrix and\n\nparticularly in the light of the corroborative evidence of TCY, the sale of shares is in\n\nharmony with the evidence of 1stDefendant and OSA.37.        The 1stDefendant’s case is that the offer to sell was revoked when the outcome of the\n\nmeeting held on 23 August 2000 was rescinded. TCY corroborates this evidence. He said that\n\nsave for the matters pertaining to Suit No. 633 of 1999 and Suit No. 84 of 2000, all\n\nmatters resolved on 23 August were rescinded. TCY’s attendance note of 7 September\n\n2000 reads:\"All parties (majority of parties) agreed that the meetings held\n\n    in my office are not valid. Not valid for TG [Tong Guan] and not valid for family.\"38.        The rescission arose from\n\nOTC’s unhappiness with the corporate structure proposed and agreed at the meeting in\n\nhis absence. As he had challenged the validity of the meeting, the 1stDefendant and Plaintiffs agreed to unravel everything that was agreed or decided at the\n\nmeeting save for the items that were agreed to be still valid.39.        I also accept the\n\nevidence of TCY that it was he who had subsequently persuaded OBC to make a fresh offer to\n\nsell 260,000 shares to OHC. OHC paid for the shares in July 2001 and the share transfer\n\nform was signed by OBC. The shares were not registered in the name of OHC. OBC and OSA\n\nrefused to approve the share transfer as there was at that time some doubt on the source\n\nof funds for OHC’s purchase. There was concern that Article 6 of the Articles of\n\nAssociation may have been contravened. Moreover, OSA had objected to the sale on ground of\n\npre-emption rights.40.        The question whether the\n\npurported sale and transfer which turns on the true construction of the pre-emption clause\n\nis defeasible is not before me. Neither is the question whether the company had acted\n\nproperly in refusing to register the shares.41.        I accept the 1stDefendant’s evidence which is corroborated by TCY that he did not revive the offer to\n\nsell 260,000 shares to OTC. The 1stDefendant had therefore no reason to accept\n\nthe tender. TCY as company secretary in reply wrote to M/s Kumar & Loh on 24 August\n\n2001 to explain that the company’s inability to effect a transfer of shares to OTC\n\n\"until Ong Boon Chuan agrees to sell the shares currently registered with him.\"\n\nSee AB 192.",
        "December 2000 agreement": "42.        OTC relies on an\n\nagreement where he is to sell his entire interest in Tong Guan to OBC, OSA and OHC and in\n\nreturn the company sells its business in Thailand and the rest of Indo China to him as\n\nproof of his interest in the 260,000 shares held by OBC. It is said that in the recital to\n\nthe agreement, OTC is acknowledged as the legal and beneficial owner of 780,000 ordinary\n\nshares in Tong Guan..43.        Both OBC and OSA\n\ntestified that in that transaction, the consideration for the shares would be calculated\n\nbased on a notional figure of 780,000 shares. This evidence is corroborated by TCY. The 2ndPlaintiff was unhappy and wanted to sell his shareholdings in Tong Guan and take over the\n\nThai business of the group. TCY who prepared the document said it was agreed that the\n\nother shareholders would treat the 2ndPlaintiff as having 780,000 shares for\n\nthe purpose of calculating the consideration for the shares. It was a notional number\n\nadopted as a compromise of the dispute and was to formalise an exit point for the parties\n\non the basis of a clean break. TCY further testified that everybody knew that this\n\nagreement would not take effect straightaway. A valuation of the shares would have to be\n\ncarried out and that would take time and money. His testimony is consistent with the\n\nexisting facts.44.        Counsel for the\n\nPlaintiffs sought to exclude the evidence of OBC, OSA and TCY by relying on ss 93 and 94\n\nof Evidence Act. In my view, the evidence of TCY, OBC and OSA is admissible as part of the\n\nobjective framework of facts and circumstances within which the contract was made.45.        In any event, had I been\n\nconfined to the agreement alone under the parol evidence rule, I would have been unable to\n\ndraw a clear conclusion on its probative value argued for by the Plaintiffs. The agreement\n\nwould not have been applicable to the existing facts. OTC only signed the agreement for\n\nthe sale of shares in April 2001 well before the tender of his cheque to OBC in early\n\nAugust 2001. OTC would not have been able to sell and deliver the shares within 14 days of\n\nexecuting the agreement in accordance with clause 8. The facts in existence show that the\n\nrecital is incorrect as only 520,000 shares are registered in the name of OTC and the\n\nbalance 260,00 shares in the name of OBC.",
        "Findings and Conclusion": "46.        As stated, the essential\n\ningredient to the Plaintiffs’ claim in constructive trust is an arrangement or shared\n\nunderstanding, however informal, about the way in which the shares will be acquired or\n\ndealt with.47.        I have compared the\n\naccounts given and assessed the credibility of the principal witnesses. The\n\nPlaintiffs’ evidence is inconsistent and self-contradictory. There are also\n\ninconsistencies in their respective evidence when compared with the various accounts of\n\nsome of the witnesses. Their testimony also conflict with logic and common sense. What\n\nalso struck me is the Plaintiffs’ constant parroting of the words \"common\n\nunderstanding\" in the witness box, which goes to show their tendentious view. I find\n\nthe Plaintiffs’ evidence inherently unreliable.48.        The 1stDefendant’s evidence on the other hand is uncomplicated consistent and sensible. More\n\nimportantly, his testimony is corroborated by TCY. Having listened to TCY carefully\n\nthroughout his evidence, I find him a convincing and credible witness. He gave his\n\nevidence in a fair, moderate and convincing way. He is an independent party whose file\n\nnotes provided contemporaneous written evidence. His files notes provided an insight of\n\nthe situation and position of the parties. The integrity of the transcripts of\n\nconversations with TCY is questionable. On any view, they are of no probative value. I am\n\ntherefore satisfied that TCY’s evidence supports the 1stDefendant’s\n\ncase.49.        I am not persuaded by the\n\nPlaintiffs’ evidence and argument that, but for the common understanding (which in\n\nthe light of the contradictory evidence is completely doubtful) they would not have voted\n\nin favour of the October rights issue. The Plaintiffs have strong commercial and personal\n\nreasons for the approving the rights issue. The thought of making payment, albeit of only\n\npart of indebtedness, would improve Tong Guan’s negotiating position with UOBVI. The\n\nPlaintiffs are guarantors for banking facilities of the company and were concerned that if\n\nUOBVI sued the company, other banks may follow suit. The Plaintiffs were anxious to\n\npreserve their personal exposure or to prevent any enforcement of UOBVI’s right\n\nagainst the Plaintiffs under the personal guarantees. OTC estimated his own personal\n\nexposure under the guarantee to UOBVI to be about $2 million or $3 million.50.        In my view, it was in the\n\nPlaintiffs’ interest that $1 million be raised. It may well be that the company and\n\nits subsidiaries may have assets but that cannot be realised immediately to meet the\n\nurgent need of funds. It was not clarified whether the assets were unencumbered and freely\n\ndisposable at the will of the company or its subsidiaries. OHC admitted that it was not\n\npossible for the Singapore operations alone to pay UOBVI in a short period. With the help\n\nof its subsidiaries, the loan could be repaid in full in 3-4 years. I find that the\n\noverriding motive for the October rights issue was to raise $1 million to pay UOBVI at\n\nleast something.51.        Quite apart from this\n\naspect, as I have earlier described, I find that the terms of the understanding are\n\nimprecise. It is also unclear when the common understanding was reached. Both Plaintiffs\n\nare unable to furnish details of where and when the common understanding was reached. I\n\nhave found that there was no loan as alleged. I also found that there was an offer to sell\n\n260,000 shares to each of the Plaintiffs on 23 August 2000 but the offer was subsequently\n\nrevoked on 7 September 2000.52.        For all the above\n\nreasons, I find as a fact that there was at all material times no common understanding as\n\nalleged. It follows that the declaration sought in prayer 1 of the Amended Originating\n\nSummons is dismissed with costs.Sgd:BELINDA ANG SAW EANJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}