{
    "case_title": "Kang Hock Seng Paul v Lee Teck Nam",
    "ncitation": "[2002] SGHC 308",
    "coram": "S Rajendran J",
    "sections": {
        "Kang’s negligence in losing\n\ncontrol of his car": ".13.       There was\n\nno evidence before me from which I could arrive at the conclusion that motor-car SBU 3236H\n\nskidded because of Kang’s negligence. The only evidence I had on the matter –\n\nand I had no reason to reject that evidence – was that Kang lost control of the car\n\nwhen he applied his brakes to avoid a pedestrian who had dashed across the road. Losing\n\ncontrol of a car, in those circumstances, was not negligence.",
        "Breach of s 122 of the Road\n\nTraffic Act": ".14.        It\n\nwas clear, on the evidence, that motor-car SBU 3236H was left at the position where it\n\nlanded for about an 1 hour only because Kang was not able to move the car away sooner than\n\nthat. I was satisfied that Kang had done all that he could reasonably be expected to do to\n\nhave SBU 3236H quickly removed from the scene. Section 122, in my view, would be breached\n\nonly if Kang had allowed SBU 3236H to remain where it was for a time longer than the time\n\nreasonably required for its removal.",
        "Failure to warn other road users": ".15.        In\n\nthis case, Kang had switched on the hazard warning lights of the car and they were\n\nflashing. His car was equipped with a traffic warning triangle but he could not access it\n\nbecause of the position the car was in. It was unreasonable and even hazardous to expect\n\nKang to stand in the rain directing traffic. In any event, SBU 3236H was some distance\n\naway from the bend in Marymount Road and was occupying only one-third to half of the\n\noutermost lane. There was therefore sufficient space for cars in that lane to pass safely\n\nby. I noted that for the entire hour (until Lee collided into SBU 3236H) traffic passed\n\nsafely by. The position may have been different if the bend at Marymount Road was a blind\n\ncorner and if SBU 3236H had come to a rest nearer to the bend.16.        I\n\nwould also note that the tow-truck was parked just in front of SBU 3236H. It was a high\n\nvehicle and its hazard lights (including revolving lights at the top) were flashing. The\n\npresence of that tow-truck with its flashing lights was, by itself, a sufficient warning\n\nof the hazard on the road at the time EN 966E collided with SBU 3236H.",
        "Attempting to straighten the\n\nwheels without regard for his safety.": "17.        In\n\nattempting to straighten the wheels, Kang was doing what he could to expedite the removal\n\nof SBU 3236H. When he was straightening the wheels, the tow-truck was parked just ahead\n\nand it had its revolving lights flashing. As noted above, the presence of that truck was a\n\nsufficient warning of the existing hazard. In the circumstances, Kang was not, in my view,\n\nnegligent in straightening the wheels. I would note that it was somewhat inconsistent for\n\nLee to suggest that Kang was negligent in trying to straighten the wheels but at the same\n\ntime fault Kang for not directing traffic.",
        "Case law": ".18.        Mrs\n\nKwok-Chern, counsel for Lee, in support of her submissions on contributory negligence,\n\nquoted a number of Malaysian and English cases, includingLee & Lever[1974] RTR 35;Zainap bte Abd Majid & Ors v Gan Eng Hwa & Ors[1995] 1 MLJ 801;Chop\n\nSeng Heng v Thevannasan & Ors[1975] 2 MLJ 3;Siow Choo Foo v Lee Peng Lay\n\n& Anor[1981] 2 MLJ 336;Ahmad Nordin bin Haji Maslan & Anor v Eng Ngak Hua\n\n& Ors[1985] 2 MLJ 431. In all these cases, the vehicle in question had been\n\nparked in such a way that the vehicle constituted a danger to the other road users. In the\n\npresent case, SBU 3236H had not been \"parked\" on Marymount Road. It came to be\n\non the road through a mishap not arising from any negligent conduct on the part of Kang.\n\nThe factual matrix in all those cases was materially different from the present case. I\n\ndid not find those cases to be of any significant assistance in dealing with the issues in\n\nthis case.19.        I\n\nwas satisfied in this case that there was no contributory negligence on the part of Kang.\n\nAccordingly, I held Lee to be solely liable for the injuries suffered by Kang and the\n\ndamage caused to motor-car SBU 3236H in the collision.Sgd:S. RAJENDRANJudgeCopyright © Government of Singapore."
    }
}