{
    "case_title": "Ma Teresa Bebango Bedico v Public Prosecutor",
    "ncitation": "[2002] SGHC 11",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The charge": "2          The charge read: You … are charged that you, on 1 Oct 01, being a person who was lawfully removed from Singapore on 24 Dec 99 by an Order of Removal made by the Controller of Immigration, Singapore on 16 Nov 99, did enter Singapore without the permission in writing of the Controller of Immigration, Singapore, and you have thereby committed an offence under Section 36 of the Immigration Act (Cap 133) 1985 Ed, punishable under Section 36 of the said Act.",
        "The facts as shown by the statement of facts": "3          The petitioner admitted without qualification to the statement of facts (“SOF”). She had previously been charged on 16 March 1999 for an offence under s 36 of the Immigration Act and sentenced to 12 months’ imprisonment. After she had served her sentence, she was served with an order of removal on 16 November 1999, and removed from Singapore on 24 December 1999. Her passport was endorsed with an entry ban and she was told that she had to obtain the Controller’s prior written permission if she wished to re-enter Singapore. 4          When the petitioner returned to the Philippines, she obtained a new passport. The new passport did not contain any indication of the entry ban. The petitioner was able to enter Singapore on 1 October 2001 using this new passport, and also because she did not inform the immigration officer of the entry ban. She was arrested on 3 October 2001.",
        "The petitioner’s case": "5          The petitioner sought a criminal revision on the ground that the SOF did not make out every element of the offence. Firstly, the SOF did not indicate that she had a duty to disclose the entry ban, nor did it allege any fraud on her part. Secondly, as the Immigration Office would undoubtedly have had a record of the entry ban, the fault lay with the immigration officer who had nonetheless granted the petitioner a “visit pass” (within the meaning of reg 12 of the Immigration Regulations (Cap 133, Rg 1, 1998 Ed)). As the petitioner had thought that the visit pass amounted to the Controller’s written permission to enter Singapore, the authorities would be estopped from denying the validity of the visit pass. 6          The petitioner further alleged that the effect of the order for removal had not been explained to her in Tagalog and that she had not been given a copy of such order before she was repatriated on 24 December 1999.",
        "Principles governing the exercise of the revisionary jurisdiction": "7          Section 23 of the Supreme Court of Judicature Act (Cap 322) states: 23. -- The High Court may exercise powers of revision in respect of criminal proceedings and matters in subordinate courts in accordance with the provisions of any written law for the time being in force relating to criminal procedure. The relevant written law is found in the Criminal Procedure Code (Cap 68) (“CPC”): 266. -- (1)         The High Court may call for and examine the record of any criminal proceeding before any subordinate court for the purpose of satisfying itself as to thecorrectness, legality or propriety of any finding, sentence or orderrecorded or passed and as to theregularity of any proceedingsof that subordinate court. 268. -- (1)         The High Court may in any case, the record of the proceedings of which has been called for by itself or which otherwise comes to its knowledge, in its discretion exercise any of the powers conferred by sections 251, 255, 256 and 257. This means that the High Court can stay execution, issue a warrant of arrest, reverse a conviction, alter a finding, alter the nature of a sentence, take further evidence or order that further evidence be taken. It may not, however, reverse an acquittal: CPC s 268(3). 8          The starting point is that this power is to be exercised sparingly. InTeo Hee Heng v PP[2000] 2 SLR(R) 351, the court said at [7]: It is certainly not the purpose of a criminal revision to become a convenient form of ‘backdoor appeal’ against conviction for accused persons who had pleaded guilty to their charges. The threshold then is the requirement of “serious injustice”, which was laid down inAng Poh Chuan v PP[1996] 1 SLR 326: [V]arious phrases may be used to identify the circumstances which would attract the exercise of the revisionary jurisdiction, but they all share the common denominator that there must be some serious injustice. … there cannot be a precise definition of what would constitute such serious injustice for that would … unduly circumscribe what must be a wide discretion vested in the court … But generally it must be shownthat there is something palpably wrong in the decision that strikes at its basis as an exercise of judicial power by the court below. (emphasis added) InGlennKnight Jeyasingamv PP[1999] 3 SLR 362, the court clarified the relationship between CPC s 266(1) and the requirement of “serious injustice”. Not only must there have been some error, illegality, impropriety or irregularity, it must also have caused serious injustice (supraat [19]): The court’s immediate duty is to satisfy itself as to the correctness, legality or propriety of any order passed and as to the regularity of any proceedings of that Subordinate Court. However, this is not sufficient to require the intervention of the courts on revision.The irregularity or otherwise noted from the record of proceedings must have resulted in grave and serious injustice. (emphasis added) 9Mok Swee Kok v PP[1994] 3 SLR 140 concretised these abstract principles with particular reference to the SOF. I would state the reasoning in that case as follows: (a)        A plea of guilt will be accepted only if the accused admits to the offence without qualification. (b)        A SOF has become an essential part of criminal procedure, and it is not uncommon for accused persons who plead guilty to also admit to all or some part of the SOF. As the accused or defence counsel does not address the court on liability, the facts relevant to the charge will be encapsulated solely in the SOF. (c)        Hence it is necessary that: (i)         the SOF contain all the facts that disclose all the elements of the offence charged; and (ii)        the accused admit to all the facts in the SOF that disclose all the elements of the offence charged. The court held (at [15]) that the High Court should exercise its revisionary powers “only where it ismanifestly plainthat the offence charged is nowhere disclosed in the statement of facts tendered (emphasis added)”.",
        "Whether the court should exercise its jurisdiction in the present case": "",
        "Relevant offences": "10        There were at least two ways in which someone in the petitioner’s position could be dealt with under the Immigration Act. Firstly, s 9(5) provides: 9. --(5) Any person who enters or re-enters or remains in Singapore in contravention of any order made under subsection (1) shall be guilty of an offence and shall on conviction be punished with imprisonment for a term of not less than 2 years and not more than 4 years and shall also be liable to a fine not exceeding $6,000. The “order” referred to includes an order to prohibit the entry or re-entry into Singapore of any person: s 9(1)(a)(i). This no doubt encompasses an order for removal. However, the Prosecution elected to proceed on s 36, the second option, instead: 36. -- Any person who,having been removedor otherwise lawfully sent out of Singapore,entersor resides inSingapore without the permission in writing of the Controllershall be guilty of an offence and shall on conviction be punished with imprisonment for a term of not less than one year and not more than 3 years and shall also be liable to a fine not exceeding $6,000, and shall in addition be liable to be removed from Singapore. (emphasis added) 11        The elements of the s 36 offence are: (a)        The accused has been removed from or sent out of Singapore. (b)        The accused enters or resides in Singapore. (c)        The accused did not have the Controller’s written permission to be in Singapore. 12        The petitioner’s first point was that the SOF did not allege fraud or a duty to disclose the entry ban. I did not think that this was necessary as neither fraud nor the breach of a duty is an element of the offence. The SOF did make out all the elements. As for element (a), the petitioner was removed on 24 December 1999 (para 2 of the SOF). As for element (b), the petitioner entered Singapore on 1 October 2001 (para 3 of the SOF). Element (c) was stated in para 4 of the SOF. 13        The petitioner’s second point was that the authorities were estopped by their own mistake from alleging that she had committed the offence. It was indeed unfortunate that the immigration officer overlooked any records that may exist, but as there was no evidence in relation to that, it will not be dealt with here. In any case, that argument did not assist the petitioner for three reasons. One, the petitioner had admitted to taking “positive steps” to conceal her entry ban by obtaining a new passport (SOF para 4). Two, as the petitioner had previously been convicted of the very same offence, she could not hope to persuade the court that she had thought that the mistakenly-issued visit pass amounted to written permission from the Controller. Three, “written permission” can only mean “prior written permission”, for it would defeat the purpose of s 36 if a person who had been removed from Singapore could enter Singapore, then await the Controller’s decision while in the country. Parliament intended to prevent such persons from entering Singaporebeforethe Controller could decide whether to allow them entry. To read the provision otherwise would be to present the Controller with afait accompli.",
        "Cancellation of the pass?": "14        Defence counsel also sought to rely on s 14 of the Immigration Act. He contended that, if the petitioner had indeed been guilty of an offence under s 36 of the Immigration Act, there would have been other consequences. Firstly, under s 14(2), the Controller could have cancelled the pass had it been issued as a result of a false representation or concealment of a material fact. Secondly, under s 14(3), the Controller would have been under an obligation to cancel her visit pass, if she was a prohibited immigrant. Thirdly, under s 14(4)(a), the Controller could have declared the petitioner’s presence to be unlawful if she had made a false or misleading material statement in applying for the pass. Hence, he argued, the fact that her visit pass had not been cancelled, and that her presence had not been declared illegal, were significant. Such reasoning is erroneous for the key reason that s 14 applies to “permits” and “certificates”. A “visit pass” is an entirely different animal. 15        A more appropriate provision would have been reg 17 of the Immigration Regulations: 17. If the Controller is satisfied that the holder of [a] pass issued under regulation 9, 10, 11, 12, 13, 14 or 16 is [a] prohibited immigrant, or has failed to comply with the conditions specified in the pass … or the purposes for which the pass was issued, or that his presence in Singapore is undesirable or would be prejudicial to public security in Singapore, he shall cancel the pass. However, even if the petitioner had made a similar argument based on reg 17, it would have failed. The petitioner’s case did not fall within those situations contemplated by reg 17. One, she was not a “prohibited immigrant” within the meaning of s 8 of the Immigration Act. Two, it was not that she had failed to comply with the conditions specified in the visit pass or the purposes for which the pass was issued; she should not have received the visit pass in the first place. Three, it may have been possible to argue that her presence in Singapore was undesirable, but that was rather vague and the policy reasons for controlling the petitioner’s entry into Singapore could be, and are, better articulated elsewhere in the legislation. Four, it would have been a stretch to say that her presence would prejudice public security in Singapore.",
        "Other issues": "16        The petitioner also alleged that she had not been served with the order for removal nor told of its effect. This was not raised in the court below, and the petitioner did not seek to adduce fresh evidence to support these contentions. It would suffice to refer toPackir Malim v PP[1997] 3 SLR 429: [The petitioner] relied on facts not disclosed in the record or in the exhibits. These facts were untested, and no attempt was made to apply to adduce fresh evidence. In these circumstances, it was difficult to accept any of these allegations.",
        "Conclusion": "17        There was no reason for the court to exercise its revisionary power. There was no error, illegality, impropriety or irregularity which caused serious injustice. Specifically, all the elements of the offence were made out in the SOF, and the petitioner had admitted to the SOF without qualification. For these reasons, I dismissed the petition. Petition dismissed."
    }
}