{
    "case_title": "Sin Sai Peng and Another v Soh Kim Lian Florence",
    "ncitation": "[2002] SGHC 233",
    "coram": "Tan Lee Meng J",
    "sections": {
        "The claim for $61,000": "33.\n\n        Florence claimed that the $61,000 paid by\n\nPatrick for the Tampines flat was a gift to her. She has the burden of proving her\n\nassertion. No presumption of advancement arises as Florence is Patrick’s mistress and\n\nnot his wife. After considering the evidence and listening to the witnesses, I hold that\n\non a balance of probabilities, it is more likely than not that the $61,000 was a gift from\n\nPatrick to Florence.34.\n\n        When cross-examined, Patrick explained why he\n\ndecided that Florence, who was then staying with her sister, and his son, A, should have a\n\nhome of their own in the following terms:Q. You decided that it was time\n\n    for the defendant and A to have a house to live in?A. I have to be a responsible\n\n    father to my son and to provide a roof for his mother.I considered the defendant\n\n    more or less as my wife.(emphasis added)35.\n\n        Patrick next testified that if he had the\n\nmoney, he would have presented the flat as an \"outright gift\" to the person he\n\nconsidered \"more or less\" as his wife. When cross-examined, he said as follows:Q. Were you prepared, as a\n\n    Chinese businessman, to buy a house outright for her?A.If I were a rich man, I\n\n    wouldbut I did not have money to buy a house outright for her and my son. I\n\n    needed assistance.(Emphasis added)36.\n\n        If Patrick was, in his own words, prepared to\n\ngive Florence an \"outright gift\" of a house had he been a rich man, it may be\n\nassumed that as he could not afford to pay the entire amount required for the purchase of\n\nthe Tampines flat, he gave her part of the money needed to purchase this flat.37.\n\n        It is also pertinent to note that in the\n\nre-amended reply and defence to the counterclaim, it was alleged that Florence gave\n\nPatrick the $170,000 from the proceeds of the sale of the Tampines flat \"in\n\nappreciation\" of the initial capital contribution by him for the purchase of the\n\nflat. It was thus not asserted by the plaintiffs that Florence refunded Patrick $61,000\n\nand gave him $109,000. The plaintiffs cannot blow hot and cold. After taking into account\n\nall the circumstances of the case, including the fact that Patrick regarded Florence\n\n\"more or less\" as his wife and wanted to be a responsible father to A by\n\nproviding a roof for him and his mother, I hold that the $61,000 paid by Patrick for the\n\nTampines flat was a gift to Florence. As such, the amount owed by Florence to the\n\nplaintiffs for the Lakeview apartment is only $101,795.",
        "The plaintiffs’ claim for\n\nthe cost of renovations and other expenses": "38.\n\n        During the trial, the plaintiffs claimed from\n\nFlorence the $80,000 spent on renovating the Lakeview apartment in early 1994 as well as a\n\nnumber of other specified expenses. Apart from the fact that this claim was not pleaded,\n\nit is unreasonable and ludicrous.39.\n\n        InDodsworth v Dodsworth[1973] 228 EG\n\n1115, the plaintiff, an old lady who lived alone in a bungalow, invited her younger\n\nbrother and his wife, the two defendants, to live with her in her bungalow. The defendants\n\nspent more than 700 on improvements to the premises in the expectation that they would\n\nbe able to remain there. After the relationship between the parties broke down, the\n\ndefendants sought an order protecting their right to occupy the bungalow. Braithwaite J,\n\nwho found that the plaintiff had encouraged and induced the defendants to spend money on\n\nimprovements to the bungalow, ordered the plaintiff to repay the defendants the amount\n\nexpended by them. His decision was affirmed by the Court of Appeal, which varied the\n\namount due to the defendants to 976.40.\n\n        In another case relied on by the plaintiffs, an\n\nAustralian decision,Morris v Morris[1982] 1 NSWLR 61, a widower, the plaintiff,\n\ndiscussed his living arrangements with the defendants, his son and daughter-in-law, after\n\nhis wife passed away. It was agreed that the plaintiff should sell his house, use the\n\nproceeds of the sale to pay for the construction of a second storey extension to the\n\ndefendants’ house and stay in the extended house. Subsequently, the plaintiff’s\n\nson left the house after his marriage broke down. The plaintiff also left the house when\n\nhis relationship with his daughter-in-law deteriorated. It was held by McLelland J that it\n\nwould be unconscionable and inequitable for the defendants to retain the benefit of the\n\nplaintiff’s expenditure on their property free from any obligation of recoupment. He\n\nthus ruled that the plaintiff was entitled to an equitable charge over the\n\ndefendants’ property in the sum of $28,000. In coming to his decision, he relied on\n\nthe following statement by the Privy Council inChalmers v Pardoe[1963] 1 WLR 677,\n\n681, 682:There can be no doubt upon the\n\n    authorities that where an owner of land has invited orexpressly encouraged another to\n\n    expend moneyupon his part of his landupon the face of an assurance or promisethat that part of the land will be made over to the person so expending his money, a court\n\n    of equity will prima facie require the owner by appropriate conveyance to fulfil his\n\n    obligation….41.\n\n        InDodsworth v DodsworthandMorris v\n\nMorris,the owner of a house invited another party to move into his or her house and\n\nthat other party’s expenditure to improve the house was encouraged by the owner. In\n\nthe present case, all the parties were living together in the same home and it was not\n\nestablished that Florence encouraged Patrick or his wife to renovate the Lakeview\n\napartment in 1994. I believe that Florence had no say in the matter. The unreasonableness\n\nof the plaintiffs’ position becomes even more evident when it is borne in mind that\n\ntheir claim for the cost of renovations includes money spent on beds, mattresses,\n\nfurniture and household appliances, which have been used by them, their children and\n\nPatrick’s mother since early 1994. Surely, these old and used items, if not already\n\ndiscarded, can be carted away when the plaintiffs vacate the Lakeview apartment.42.\n\n        Admittedly, some value may be attached to tiles\n\nand grilles that were replaced in 1994. However, in the unexpected altered circumstances\n\nthat the parties find themselves in after the breakdown of Patrick’s relationship\n\nwith Florence, the claim for the cost of renovations, which, in the main, satisfied the\n\nplaintiffs’ own needs, ought to be rejected.",
        "The plaintiffs’ claim for\n\nother expenses": "43.\n\n        The plaintiffs also asserted that Florence\n\nshould reimburse them for the sums paid by them for maintenance fees, sinking fund and\n\nproperty tax from 1994 until Florence left the Lakeview apartment in September 1997. This\n\nclaim, which was not pleaded, is also a ridiculous claim. Surely Patrick, the head of the\n\nhousehold, cannot expect his mistress to maintain him, his wife, his children and his\n\nmother by paying for the maintenance fees and property tax from 1994 onwards when he was\n\nnot paying her any rent for occupying the Lakeview apartment.F. DEFENDANT’S COUNTERCLAIM\n\nFOR RENTAL44.\n\n        I now turn to Florence’s claim for loss of\n\nrental for the Lakeview apartment for the period after November 1997. Her basis for asking\n\nthe plaintiffs to move out of the Lakeview apartment in 1997 was that she was entitled to\n\nvacant possession of the property without having to pay the unpaid balance of the purchase\n\nprice. This, as has been pointed out, is a fallacious assumption. In the unusual\n\ncircumstances of this case, there can be no doubt that until the question of\n\nFlorence’s liability to pay the unpaid balance of the purchase price of the Lakeview\n\napartment has been sorted out, one cannot expect the plaintiffs to give Florence vacant\n\npossession of the said apartment. That being the case, the question of a claim for loss of\n\nrental does not arise. For the same reason, I also hold that Florence is not entitled to\n\nclaim the amount paid by her for the premises required by her after she left the Lakeview\n\napartment in September 1997. No one asked her to leave the said apartment. She conceded\n\nthat she left because that was the only way to end her relationship with Patrick.45.\n\n        It is also worth noting that as far as\n\nFlorence’s claim for loss of rental of the Lakeview apartment is concerned, no\n\nsatisfactory evidence of the alleged loss was tendered. Her witness, a real estate agent,\n\nadmitted that he had no knowledge of the rental of apartments in Lakeview at the relevant\n\ntime. As such, for more than one reason, this claim by Florence cannot be countenanced.G. REMOVAL OF THE PLAINTIFFS’\n\nCAVEAT46.\n\n        Florence applied for an order that the\n\nplaintiffs remove their caveat on the Lakeview property. As the plaintiffs ought to be\n\nallowed to retain the caveat until the unpaid balance of the purchase price has been paid\n\nto them, Florence’s application is dismissed.H. COSTS47.\n\n        The plaintiffs and the defendant shall bear\n\ntheir own costs of the action.Sgd:TAN LEE MENGJUDGECopyright © Government of Singapore."
    }
}