{
    "case_title": "Re XYZ (an infant)",
    "ncitation": "[2002] SGHC 184",
    "coram": "Woo Bih Li JC",
    "sections": {
        "Introduction": "1.        The infant, who was the subject of\n\nthe appeal before me, was born in the mid-1990s. He is a male Malay.2.        On 21 March 1997, an adoption order was\n\nmade (‘the Adoption Order’) in respect of the infant in favour of the Appellants\n\nwhose names I am also not mentioning because of the sensitive nature of the matter before\n\nme. The Appellants are also Malays.3.        At the time the Adoption Order was made,\n\nthe full name of the infant conferred by the Adoption Order included his original name\n\nwhich in turn referred to the name of his natural father e.g the adopted name was XYZ Bin\n\nM, ‘M’ being the name of his natural father.4.        As a result, the birth certificate of the\n\ninfant issued on 30 May 1997 reflects the adopted name but save as aforesaid, there is no\n\nsuggestion therein that the infant is adopted by the Appellants whose names are recorded\n\nin the birth certificate as his father and mother.5.        In 2002, the Appellants applied to amend\n\nthe Adoption Order to delete any reference in the adopted name to the infant’s\n\noriginal name and for an order that the Registrar-General of Births and Deaths be directed\n\nto re-register the birth and issue a new birth certificate in accordance with the amended\n\nAdoption Order.6.        In their supporting affidavit, the\n\nAppellants said they had not deleted the original name of the infant from the adopted name\n\nat the time when they applied to adopt him because they believed that neither the natural\n\nfather, his wife or his family would disclose to the infant his true identity after the\n\nAdoption Order was made. I should add that the natural father is a brother of the adopting\n\nmother.7.        As events turned out, the infant was in\n\ncontact with his natural siblings.8.        Apparently for the last three months\n\nbefore the application was made, these children, as well as other cousins of the infant,\n\nhave been telling him that he is not the natural son of the Appellants but of his natural\n\nfather. This caused him to be very sad and inquisitive. By then, he was about seven years\n\nof age.9.        For better or worse, the Appellants did\n\nnot respond to his inquisitiveness by telling him the truth. Instead, they told him that\n\nhe is their son, meaning their natural son. The infant then insisted on seeing his birth\n\ncertificate thus causing the Appellants to be afraid that he would be ‘terribly\n\nemotionally affected’ when he learns the truth.10.        Hence, the application was made to amend\n\nthe Adoption Order. The application was heard by District Judge Regina Ow. The\n\nAttorney-General who was the guardian ad litem for the infant pending the making of the\n\nAdoption Order appeared and objected to the application on the basis that the court had no\n\njurisdiction to amend the Adoption Order as the court was functus officio after the\n\nAdoption Order was made.11.        The District Judge dismissed the\n\napplication on the ground that she had no jurisdiction to amend the Adoption Order. The\n\nAppellants then appealed and I heard their appeal. After hearing submissions, I dismissed\n\nthe appeal. I now give my written reasons.",
        "My reasons": "12.        Ms Dyan Zuzarte, from the\n\nAttorney-General’s Chambers, drew my attention to an unreported decision of Michael\n\nHwang JC (as he then was) in Adoption Petition No 143 of 1990 where he held that he had no\n\npower to allow amendment of an infant’s name to include his Hanyu Pinyin name after\n\nthe adoption order was made and perfected. However, no written reasons were given.13.        Counsel for the Appellants, Ms Halimah\n\nBte Abdul Jalil argued that that decision was wrong.14.        She submitted that the court had\n\njurisdiction to amend the Adoption Order notwithstanding that it had been made and\n\nperfected. She relied on s 16 and 17 of the Supreme Court of Judicature Act (Cap 322) but\n\nit was quite clear to me that those provisions did not address the question whether the\n\ncourt had jurisdiction to amend an order after it was made and perfected. Moreover, the\n\ninitial application of the Appellants for amendment was made to the District Court and not\n\nto the High Court (which is part of the Supreme Court).15.        Counsel for the Appellants then submitted\n\nthat para 14 of the First Schedule to the Supreme Court of Judicature Act (Amendment) Act\n\n1993 provides that the court has ‘powers to grant all reliefs and remedies at law and\n\nin equity’ but again, for the same reasons I have mentioned, this provision did not\n\nhelp.16.        Counsel for the Appellants also relied on\n\nO 92 r 4 of the Rules of Court which states:‘4 For the removal of doubt it is hereby declared that nothing in\n\n  these Rules shall be deemed to limit or affect the inherent powers of the Court to make\n\n  any order as may be necessary to prevent injustice or to prevent an abuse of the process\n\n  of the Court.’She then citedWee Soon Kim Anthony v Law Society of Singapore[2001] 4 SLR 25.17.        However the facts in the case she cited\n\nwere different and did not involve the question of amending an order that had been made\n\nand perfected.18.        Furthermore, as far as I was aware, O 92\n\nr 4 has never been used by a court or any party to amend an order already made and\n\nperfected. Rather it is used to persuade a court to make an order before the court makes\n\nits order.19.        I was of the view that the District Judge\n\nwas correct in concluding that the court had no jurisdiction to amend the Adoption Order\n\nafter it had been made and perfected, unless the amendment was being sought under what is\n\nknown as the slip-rule. This was not the case before me.20.        I also considered whether a court could\n\nvary the Adoption Order, as opposed to amending it, on the basis of a change of\n\ncircumstances akin to a variation of maintenance for a woman and/or a child under the\n\nWomen’s Charter Act (Cap 353). However, that variation is allowed under specific\n\nprovisions of the Women’s Charter and, even then, such a variation does not relate\n\nback to the date of the original maintenance order.21.        Having considered the scheme under the\n\nAct and in particular s 12 thereof, I was of the view that the change of name for an\n\nadopted infant arises only when an adoption order is made.22.        The material parts of s 12 state:‘12.(1) Where an adoption order has been made, the Registrar of\n\n  the court by which the adoption order was made shall forthwith send to the\n\n  Registrar-General of Births and Deaths a notice in the form set out in the Schedule,\n\n  setting out the following particulars so far as they are known to the court:(a)    the full name of the child before the making of\n\n  the adoption order;(b)    the full name of the child conferred by the\n\n  adoption order;[the other sub-provisions are not material.](2) ….(3)Uponreceipt of the form referred to in subsection (1), the\n\n  Registrar-General shall if the birth of the adopted child has been registered in Singapore\n\n  cause the entry in the relevant registrar of births to be marked with the word\n\n  \"Adopted\". Particulars as to the birth of the child shallthenbe\n\n  registered separatelysubstituting the name conferred by the adoption for the name of\n\n  the child prior to adoption, and recording the name, address and description of each\n\n  adopting parent in substitution for the particulars as to the natural or last adopting\n\n  parents.(4) ….(5) Where a copy of the entry as to the birth of any child to which\n\n  this section relates is required for any purpose, the Registrar-General, subject to any\n\n  regulations as to payment of fees as are prescribed, shall supply a copy of the last entry\n\n  made pursuant to subsection (3) omitting in the copy of the word \"Adopted\" that\n\n  appears in the original or former entry.’[Emphasis added.]23.        If an adopted infant or his adopting\n\nparents are not happy with the name chosen at the time the adoption order is made, then\n\nthe change of name has to be effected by a deed poll but this will not alter the name in\n\nthe birth certificate.24.        My attention was also drawn to a decision\n\nby Chan Sek Keong J (as he then was) inRe ABZ (An infant)[1992] 2 SLR 445. In\n\nthat case, the infant was a Chinese and his natural parents were Chinese. However the\n\nnatural father had died and the mother married a man, Mr Z, of Japanese origin. They\n\nadopted the infant with Mr Z’s surname. Subsequently, Mr and Mrs Z were divorced and\n\nthe mother had custody of the infant and had no intention of settling in Japan. The infant\n\nwent to school in Singapore and, according to the mother, was humiliated by other students\n\nbecause of the Japanese surname. The mother then applied to set aside the adoption order\n\nand Mr Z had no objection to the application.25.        Justice Chan decided this could not be\n\ndone. He went on to say that the infant’s surname could be changed by a deed poll,\n\nbut added, at p 445 A/B:‘… However, I note that the Act makes no provision for a\n\n  birth certificate issued pursuant to s 12 to be changed to reflect a change of name.’I agreed.26.        I should add that Justice Chan was also\n\nof the view that the mother in the case before him was not without recourse as she could\n\ninvoke s 9 of the Act to re-adopt the infant under the intended new name.27.        Section 9 states:‘9. An adoption order or an interim order may be made in respect\n\n  of an infant who has already been the subject of an adoption order, and, upon any\n\n  application for such further adoption order,the adopter or adopters under the adoption\n\n  order last previously made shall, if living,be deemed to be the parent or parents\n\n  of the infantfor all the purposes of this Act.’[Emphasis added.]28.        I was of the view that on the facts\n\nbefore me, it was not possible for both the Appellants to apply to re-adopt the infant\n\nunder s 9 because s 9 envisages re-adoption by different adopting parents. It is not\n\nnecessary for me to express a view whether one of the Appellants can apply to re-adopt the\n\ninfant since such an application will create other problems for the infant as the name of\n\none of the Appellants will then drop out from the birth certificate to be issued.29.        There is also one more point which I\n\nwould wish to make. Although the Appellants might have good intentions, they were in\n\neffect asking the court to assist them to continue to bluff the infant. I had serious\n\nreservations as to whether the court should be an accomplice in this endeavour even if it\n\nhad the jurisdiction and power to do so.30.        Ultimately, the Appellants have no legal\n\nrecourse. However, it is precisely because there may be no recourse that adopting parents\n\nmust take great care in the choice of the adopted name.Sgd:WOO BIH LIJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}