{
    "case_title": "Re Dayang Construction and Engineering Pte Ltd",
    "ncitation": "[2002] SGHC 123",
    "coram": "Belinda Ang Saw Ean JC",
    "sections": {
        "Held": ", maintaining the winding-up order:(1) Having regard to the scheme, structure and language of s 254(2)(a),\n\nthere is clearly no merit whatsoever in either of the alleged defects raised by counsel\n\nfor Dayang. The letter of 5 December 2001 was an effective demand for the purposes of s\n\n254(2)(a) (see  19).(2) The three-week period is not a statutory requirement of the notice\n\nof demand itself. It is relevant only in the context of a company failing or neglecting to\n\npay a debt within that period:Re Simpson Devp Investment (HK) Co Ltd[1999] 1 HKLRD 202 followed. It is also not a legal imposition of s 254(2)(a), express or implied,\n\nthat the creditor must indicate on the face of the demand the implications to the company\n\nand the detriment it may suffer if it fails to comply, or the other two alternatives\n\navailable to it, namely securing or compounding. Ultimately, it is for the court to decide\n\nwhether a company should be wound up in the exercise of its discretion. The form in which\n\na statutory demand is expressed ought to be approached with the general discretion of the\n\ncourt in mind and in this case, it was not suggested that Dayang was in fact misled by the\n\ndemand:Helicarr Consolidated Ltd v Royal Insurance Fire & General (NZ) Ltd[1993] 2 NZLR 46 followed (see  20 – 33).(3) It was clear from the Amended Petition that the petitioner had an\n\nundisputed judgment debt, it was due and Dayang had neglected to pay it. The court was\n\nentitled to accept that as prima facie proof, and inference could be drawn, that the\n\ncompany was unable to pay its debts within the meaning of s 254(2)(e):Cornhill\n\nInsurance Plc v Improvement Services Ltd And Others[1986] 1 WLR 114 andTaylors\n\nIndustrial Flooring Ltd v M & H Plant Hire (Manchester) Ltd[1990] BCLC 216\n\nfollowed (see  35 and 36).(4) The company was commercially insolvent. It had no available cash to\n\nsettle the judgment debt. There were no on-going projects in hand and no future contracts\n\nin the pipeline. There was no reason to keep the company alive just to pursue a claim\n\nagainst the two trade debtors when that could be left to liquidators who had consented to\n\nact in the winding up of the company. In the hands of those liquidators, any possible\n\npotential conflict of interest would be avoided, given that Goh’s brother and father\n\nare directors of Tong Hup Seng (see  39 – 42).(5) The initiatives to stop the winding-up for the reasons given were\n\nviewed with some reservations. Dayang had made loans to its directors and directors’\n\nfees were due from the company. With liquidators in place, the directors would face the\n\npossibility of having to repay these loans and stand in the queue like the rest of the\n\nunsecured creditors to recover any sum due to them from the company as directors (see \n\n44).(6) The proposed Scheme of Arrangement exhibited in Goh’s second\n\naffidavit was skimpy and unconvincing. It glaringly omitted to take into account the\n\nsubstantial borrowings of the directors and solely focused on the trade debts of Tong Hup\n\nSeng and Guobena. Creditors were left to wonder when the proposal would take effect and\n\nthe length of time they would have to wait for payment. The proposal was also dependent on\n\nthe company succeeding in any litigation against Tong Hup Seng and Guobena (see  47).(7) None of the creditors who opposed the grant of a winding-up order\n\nfiled affidavits stating reasons for their opposition. From what was said in court or seen\n\nin letters exhibited by Dayang, they were all mere expressions of willingness to give the\n\ncompany time to recover money from Tong Hup Seng and Guobena. That alone was not good\n\nenough a reason for opposing the winding-up, even if it represented the wishes of the\n\nmajority (see  49).(8) Accordingly, the order made on 12 April 2002 to wind up Dayang is\n\nto stand.",
        "Cases referred to": "Bateman Television Ltd And Another v Coleridge Finance Co Ltd[1969] NZLR 794\n\n(refd)Cornhill Insurance Plc v Improvement Services Ltd And Others[1986] 1 WLR 114\n\n(folld)Helicarr Consolidated Ltd v Royal Insurance Fire & General (NZ) Ltd[1993] 2 NZLR 46 (folld)Malayan Plant (Pte) Ltd v Moscow Narodny Bank Ltd[1980] 2 MLJ 53(refd)Pac Asian Services Pte Ltd v European Asian Bank AG[1989] 3 MLJ 385(refd)Re Simpson Devp Investment (HK) Co Ltd[1999] 1 HKLRD 202 (folld)Sri Hartamas Development Sdn Bhd v MBF Finance Bhd[1992] 1 MLJ 313(refd)Taylors Industrial Flooring Ltd v M & H Plant Hire (Manchester) Ltd[1990] BCLC\n\n216 (folld)United Malayan Banking Corp Bhd v Richland Trade & Developmetn Sdn Bhd[2000] 4 MLJ 670(refd)Wei Giap Construction Co (Pte) Ltd v Intraco Ltd[1979] 2 MLJ 4(refd)Legislation referred toCompanies Act (Cap 50) ss 254(1)(e), 254(2)(a)Insolvency Act 1986 [UK] s 123(1)(a)JudgmentGROUNDS OF DECISION1.\n\n        Eastern Steel Services Pte Ltd, a judgment\n\ncreditor, petitioned on 11 March 2002 for Dayang Construction & Engineering Pte Ltd\n\n(\"Dayang\") to be wound up under s 254(1)(e) of the Companies Act (Cap. 50) on\n\nthe ground that Dayang is unable to pay its debts. As proof of insolvency, the petitioner\n\nrelied on the provisions of s 254(2)(a) of the Act under which a company shall be deemed\n\nto be unable to pay its debts if:\"(a). a creditor by\n\n    assignment or otherwise to whom the company is indebted in a sum exceeding $10,000 then\n\n    due has served on the company by leaving at the registered office a demand under his hand\n\n    or under the hand of his agent thereunto lawfully authorised requiring the company to pay\n\n    the sum so due, and the company has for 3 weeks thereafter neglected to pay the sum or to\n\n    secure or compound for it to the reasonable satisfaction of the creditor;\"2.\n\n        The petitioner stated in the Amended Petition\n\nthat judgment in the sum of $200,090.30 together with pre-judgment interest and costs of\n\n$1,216.99 and $1,800 respectively were entered on 29 November 2001 against Dayang. On 5\n\nDecember 2001, solicitors for the petitioner served on Dayang a letter demanding payment\n\nof the judgment sum, interest and costs. This demand letter, which was relied on for the\n\npurposes of s 254(2)(a) states:\"YOUR REF:OUR REF: FC/ES/2687/01/lit/ac5 December 2001M/s Dayang Construction &\n\n    Engineering Pte Ltd19 Kim Keat Road#04-00 Fu Tsu BuildingSingapore 328804Dear Sirs,D.C. SUIT NO. 4185 OF 2001/VCLAIM BY EASTERN STEEL SERVICES\n\n    PTE LTDWe refer to the above matter.By way of service, we forward\n\n    herewith a L.S. copy of the Judgment dated 29thNovember 2001 obtained against\n\n    you.TAKE NOTICE that unless the\n\n    outstanding Judgment sum of S$200,090.30, interest thereon at the rate of 6% per annum\n\n    calculated from the date of the Writ 23rdOctober 2001 till the date of\n\n    Judgment 29thNovember 2001 and S$1,800.00 costs are paid to our clients or to\n\n    us as our clients’ solicitors within five (5) days from the date hereof, our clients\n\n    will be proceeding as they deem fit for the recovery thereof.Yours faithfullySignedEncl.cc: clients\"3.\n\n        At the adjourned hearing of the Amended\n\nPetition on 12 April 2002, Counsel for Dayang sought an adjournment of four weeks as the\n\ncompany wished to apply for Judicial Management.4.\n\n        Goh Eng Soo (\"Goh\"), a director of\n\nDayang, filed an affidavit on 4 April 2002 to oppose the winding-up. He admitted that the\n\ncompany’s unsecured creditors were owed approximately $1.5 million. But the\n\ncompany’s inability to pay its creditors was largely due to the company being owed\n\nsubstantial sums of money by two main trade debtors, Tong Hup Seng Construction Co Pte Ltd\n\n(\"Tong Hup Seng\") and Guobena Sdn Bhd (\"Guobena\"). Legal proceedings\n\nagainst both trade debtors were intended. Moreover, the company needed time to complete\n\nand finalise the accounts and file for Judicial Management or apply for a Scheme of\n\nArrangement. Several creditors supported the adjournment. Goh claimed that creditors\n\nrepresenting 70% of the total value of the debts owed by the company opposed the\n\nwinding-up.5.\n\n        The petitioner and other creditors who\n\nsupported the winding-up, opposed the adjournment. Ee Teck Siew (\"Ee\"), the\n\npetitioner’s Finance Manager, in  5 and 11 of his affidavit filed on 11 April\n\n2002 deposed that the petitioner had not received any payment or any concrete payment\n\nproposal from Dayang; the petition was based on Dayang’s failure to pay on the\n\njudgment. From notices received by the petitioner, creditors who supported the winding-up\n\namounted to $444,569.10 out of $771,342.63 of the updated list of parties wishing to\n\nattend the hearing of the Amended Petition. This represented more than 50% in value of\n\nthose creditors wishing to attend.6.\n\n        After hearing arguments and on the evidence\n\nbefore me (and detailed below), the application for an adjournment was refused; an order\n\nwas made for Dayang to be wound up.7.\n\n        On 18 April 2002, M/s Madhavan Partnership\n\nacting in place of M/s Anthony Wee Jin requested further arguments. At that stage, the\n\nwinding-up order had not yet been perfected. I permitted the company and those creditors\n\nopposing the Amended Petition, another opportunity to be heard. After hearing full\n\narguments, I maintained the winding-up order. I now publish the reasons for my decision.8.\n\n        At the hearing on 30 April 2002, Counsel for\n\nDayang contended that there was no affidavit verifying the Amended Petition at the time\n\nthe order to wind-up the company was made. The Official Receiver, as it transpired, had\n\ndeclined to act as liquidator and consent of private liquidators had to be sought. The\n\nPetition was amended to cater to the Official Receiver’s decision. The other\n\namendment to the Petition was to correct an error in the registered address of Dayang. In\n\nmy view, a further affidavit was not required as there were no substantial changes to the\n\noriginal Petition. The amendments were obvious and largely consequential.9.\n\n        Counsel for Dayang also contended that the 5\n\nDecember letter was not a statutory demand within s 254(2)(a) of the Act. The demand\n\nletter was defective in two respects. Firstly, it did not refer to a period of three weeks\n\nfor payment. The notice period was five days. Secondly, it contained no warning that the\n\ncompany would be wound up if the company did not meet the demand. Consequently, the\n\nAmended Petition must fail.10.\n\n        The objection raised questions concerning the\n\ninterpretation and operation of the Act relating to proof of the insolvency of the debtor\n\ncompany in winding-up proceedings.11.\n\n        There was no dispute that the letter dated 5\n\nDecember 2001 demanding payment of a judgment debt was properly served on Dayang at its\n\nregistered office. The judgment, which was undisputed and was admittedly due, remained\n\nunsatisfied.12.\n\n        It was common ground that there is no form of\n\nnotice prescribed in the Companies Act or Companies Winding Up Rules.13.\n\n        S 254(1) of the Companies Act (Cap.50) sets out\n\nthe various grounds under which a company may be wound up. In this case, the petitioner\n\nrelied on subsection (e), namely, a company may be wound up if it is unable to pay its\n\ndebts. The insolvency of a company may be established in different ways. A petitioning\n\ncreditor may or may not avail itself of the provisions of s 254(2) to prove the insolvency\n\nof a company. S 254(2)(a) affords creditors who are owed more than $10,000 a simple and\n\nconvenient means of establishing ground (e).14.\n\n        On a plain and ordinary reading of s 254(2)(a),\n\ntwo separate sets of statutory requirements are discernible; one for the creditor and the\n\nother is for the debtor company to comply.15.\n\n        The statutory requirements of sub-section (a)\n\nthat pertains to the creditor are:(a) the debt must be in excess of\n\n    $10,000;(b) the written demand to pay the\n\n    sum due must be under the hand of the creditor or his authorised agent;(c ) the demand has to be served\n\n    on the debtor company by leaving it at its registered address.16.\n\n        Unless the creditor has fully complied with the\n\nrequirements imposed by sub-section (a), the statutory demand would be defective. The\n\nCourt of Appeal inPac Asian Services Pte Ltd v European Asian Bank AG[1989] 3 MLJ 385held that in order to raise the presumption of insolvency, there must be\n\nstrict compliance with the statutory requirements. In that case, the statutory demand was\n\nnot served on the company’s registered address and that was found to be fatal.17.\n\n        As for the debtor company, it has to be mindful\n\nof the following statutory provisions under sub-section (a):(a)    for three\n\n    weeks after date of service of the demand letter, the debtor company fails to pay the sum\n\n    due or to secure or compound it to the reasonable satisfaction of the creditor.18.\n\n        So, after service of the demand, the debtor\n\ncompany has three weeks to pay or secure or compound the debt to the reasonable\n\nsatisfaction of the creditor. If the debtor company neglects to take any of those three\n\nspecified options, after expiry of that period of three weeks, a petition to wind up the\n\ncompany may then be presented in reliance of the presumption of insolvency, which has\n\narisen.19.\n\n        Having regard to the scheme, structure and\n\nlanguage of sub-section (a), there is clearly no merit whatsoever in either of the alleged\n\ndefects raised by Counsel for Dayang. In my view, the letter dated 5 December 2001 was an\n\neffective demand for the purposes of s 254(2)(a).20.\n\n        The three-week period is not a statutory\n\nrequirement of the notice of demand itself. I agree with Le Pichon J who held inRe\n\nSimpson Devp Investment (HK) Co Ltd[1999] 1HKLRD 202 at p 202 that:\"There was nothing in\n\n    s.178(a) that required there to be any reference to three weeks in the demand. The\n\n    three-week period in s.178 (1)(a) was relevant only in the context of a company failing or\n\n    neglecting to pay a debt that was not disputed on bona fide grounds within that\n\n    period.\"21.\n\n        InRe Simpson Devp Investment (HK) Co Ltd,\n\nthe demand letter in question did not refer to the period of three weeks for payment. The\n\nletter demanded payment within six days of all sums advanced by way of general banking\n\nfacilities. It went on to further state that failing repayment, proceedings would be\n\nissued against the company for recovery of all sums outstanding, interest and legal costs\n\nas well as possession of the properties mortgaged as security for the advances. The amount\n\noutstanding and due to the petitioner, the Hongkong and Shanghai Banking Corporation was\n\nin excess of HK$52 million.22.\n\n        Like Dayang, the Hong Kong company opposed the\n\npetition on the ground that there was no statutory demand within s178(1)(a) of the\n\nCompanies Ordinance (Cap. 32). Counsel submitted that the letter was \"just a simple\n\ndemand letter\". He argued that for the presumption of insolvency to arise under\n\ns178(1)(a), there had to be a reference to a period of 21 days for payment. Le Pichon J\n\nrejected his submissions.23.\n\n        InSri Hartamas Development Sdn Bhd v MBF\n\nFinance Bhd[1992] 1 MLJ 313, a decision of the Malaysian Supreme Court, MBF\n\nFinance Bhd as judgment creditor petitioned on 17 January 1988 to wind up the judgment\n\ndebtor, Sri Hartamas Development, on the back of a statutory demand served on the latter\n\non 27 December 1988. It was argued that the statutory demand was bad as the company was\n\nnot given the statutory three weeks notice but instead a shorter time to comply with the\n\ndemand. Consequently, the presumption of insolvency did not arise.24.\n\n        The Supreme Court held that the demand letter\n\nwith a shorter notice period than 21 days was not bad or invalid. At p 313 of the report:\" (4) Although the\n\n    respondent has stated incorrectly in the notice of demand that the debt must be paid\n\n    within 21 days from the date of the notice, that does not affect the validity of the\n\n    demand to pay the sum due. The three weeks in the section refer to the neglect to pay\n\n    before the presumption of inability to pay debts arises under the section and is not a\n\n    requirement relating to the notice of demand itself.\"25.\n\n        It is also not a statutory requirement of\n\nsub-section (a) to spell out or indicate to the recipient in the demand letter the two\n\nother specified options, other than payment:Helicarr Consolidated Ltd v Royal\n\nInsurance Fire & General (NZ) Ltd[1993] 2NZLR 46. To that extent, the\n\nsub-section does not require any explicit reference in the demand to the consequence the\n\nsub-section imposes or to warn the company of the creditor’s intention of instituting\n\nwinding-up proceedings if satisfaction was not given.26.\n\n        If there is some other unexpressed requirement\n\nwith which a demand must comply in order to fall within the subsection, it can only arise\n\nby implication as a matter of statutory construction. Having regard to accepted guides to\n\nlegislative intention, no proper implication within the express words of subsection (a)\n\ncan arise to introduce in the demand letter a warning of winding–up proceedings.27.\n\n        Counsel for Dayang relied onSri Hartamas\n\nDevelopment Sdn Bhd v MBF Finance Bhd[1992]. At p 313 of report, the Supreme\n\nCourt held:\" (1) Although the demand in\n\n    writing need not be in any special form, it must strictly comply with the requirements of\n\n    s 218(2)(a) of the Companies Act 1965. The whole purpose of the demand is to warn the\n\n    debtor of an impending petition.\"That decision was also cited by\n\nthe authors ofThe Singapore Companies Act - An Annotation Vol. 2by Walter\n\nWoon and Andrew Hicks at paras. [465]-[467].28.\n\n        I declined to followSri Hartamason this point. With respect, there is no legal basis for that view. It is not a legal\n\nimposition of s 254(2)(a), express or implied, that the creditor must indicate on the face\n\nof the demand the implications to the company and the detriment it may suffer if it fails\n\nto comply.29.Sri Hartamasand the later\n\ndecision ofUnited Malayan Banking Corp Bhd v Richland Trade & Development Sdn\n\nBhd[2000] 4 MLJ 670both referred toBateman Television Ltd And Another v\n\nColeridge Finance Co Ltd[1969] NZLR 794. North P recounted and accepted\n\ncounsel’s reasoning there that since the object of the demand was to warn the debtor\n\nthat a winding–up petition may be presented, it did not matter whether or not the\n\ndemand was signed by or on behalf of the creditor. The decision inBateman\n\nTelevisionwas read as suggesting that the statutory demand must warn the debtor\n\ncompany that a failure may lead to winding-up proceedings.30.\n\n        That suggestion was commented upon and, rightly\n\nso, not adopted by the Wellington Court of Appeal inHelicarr Consolidated Ltd v\n\nRoyal Insurance Fire & General (NZ) Ltd[1993] 2NZLR 46. It is plain from the\n\nobservations of the Wellington Court of Appeal, that there is no legal requirement that a\n\nstatutory demand must contain a warning.31.\n\n        The Wellington Court of Appeal held at p 46:\" 1. Section 218(a) of the\n\n    Companies Act 1955, sets out one of three circumstances in which a company is deemed to be\n\n    unable to pay its debts. A notice must be served on the company requiring it to pay the\n\n    sum due and then the company must have neglected for three weeks after service to pay the\n\n    sum or to secure or compound it to the reasonable satisfaction of the creditor. The\n\n    section does not require that the notice should do more than demand payment and there is\n\n    no implied requirement that the notice inform the company of the other two alternatives\n\n    available to it, namely securing or compounding. …\"32.\n\n        McKay J at p 49 observed:\"The section was considered\n\n    by this Court inBateman Television Ltd And Anotherv Colderidge Finance Co Ltd,\n\n    where the issue was whether a demand under the section in its then form could be signed by\n\n    an agent. In his judgment North P said at p 803:‘As Mr. Fox pointed out,\n\n      there is no prescribed form of notice and the whole object of the demand was to warn the\n\n      debtor of an impending petition and accordingly whether the notice be signed by the\n\n      creditor personally or by another on his behalf adds nothing to the value of the\n\n      notice.’This statement might suggest that\n\n    before a demand could be relied on for the purposes of the section, it must warn the\n\n    debtor that failure to comply may lead to a petition for winding up.The section does\n\n    not in terms so require, but whether or not such a requirement is to be implied, it would\n\n    seem to be both desirable and prudent, in view of the fact that the Court has a discretion\n\n    whether or not to make an order for winding up.\"[emphasis added]33.\n\n        I am in complete agreement with McKay J’s\n\nobservations. The form in which a statutory demand is expressed ought to be approached\n\nwith the general discretion of the Court in mind. Ultimately, it is for the Court to\n\ndetermine whether a company should be wound up in the exercise of its discretion. In this\n\ncase, it was not suggested at all that Dayang was in fact misled by the December demand.34.\n\n        I hasten to add that unlike in Singapore, a\n\nform of statutory notice is prescribed by English legislation. The corresponding provision\n\nto s 254(2)(a) is s 123(1)(a) of the Insolvency Act 1986. The sub-section expressly states\n\nthat the written demand is to be in a form prescribed. The form prescribed in the\n\nInsolvency Rules draws the debtor’s attention to 21 days to deal with the demand or a\n\nwinding-up order could be made in respect of the company. That is also the case in\n\nAustralia. Since 23 June 1993, the statutory notice is in a form prescribed.35.\n\n        I would add that in the particular\n\ncircumstances of this case, from the matters set out in the Amended Petition and the two\n\naffidavits that were filed before the hearing on 12 April 2002, I was satisfied that the\n\ncompany was unable to pay its debts.36.\n\n        It was clear from the Amended Petition that the\n\npetitioner had an undisputed judgment debt, it was due and Dayang had neglected to pay it.\n\nI am entitled to accept that as prima facie proof, and inference could be drawn, that the\n\ncompany was unable to pay its debts within s 254(1)(e):Cornhill Insurance Plc v\n\nImprovement Services Ltd And Others[1986] 1WLR 114;Taylors Industrial\n\nFlooring Ltd v M & H Plant Hire (Manchester) Ltd[1990] BCLC 216.37.\n\n        Le Pichon J inRe Simpson Devp Investment\n\n(HK) Co Ltdat p 204 of the report said:\"Proof by a creditor that\n\n    the debt has not been paid within a reasonable time is prima facie evidence that the\n\n    company is insolvent where the company has no bona fide basis on which to dispute the debt\n\n    in question. See Re Globe New Pattern Iron and Steel Co (1875) LR 20 Eq 337. Therefore\n\n    irrespective of whether the letter constitutes a statutory demand, it is open to the court\n\n    to infer that the company is unable to pay its debts with s. 177(1)(d) where it was under\n\n    an undisputed obligation to pay a specific sum and failed to do so. See Re United Strength\n\n    Ltd [1992] 1 HKC 386 and Halsbury’s Laws of Hong Kong Vol6, para. 95.0978…\"\n\n    ]38.\n\n        The explanation offered for Dayang’s\n\nfailure to pay on the judgment was cash flow constraints. The reason given by the Company\n\nto stave off the winding -up was for more time to pursue two trade debtors, Tong Hup Seng\n\nand Guobena who each owed the company $1,616,947.58 and $267,441.28 respectively. If\n\nDayang was given this opportunity, the unsecured creditors stood a chance of full recovery\n\nof all debts owed to them by the company.39.\n\n        There were no on-going projects in hand and no\n\nfuture contracts in the pipeline. In a letter dated 19 January 2002 to a prospective\n\nclient, Goh admitted the company had no working capital and therefore, it could not tender\n\nfor new projects. In other words, the company was unable to sustain business activity in\n\nits situation.40.\n\n        The company was commercially insolvent. It had\n\nno available cash to settle the judgment debt. The Privy Council inMalayan Plant\n\n(Pte) Ltd v Moscow Narodny Bank Ltd[1980] 2MLJ 53 at 54 approved a passage in\n\nBuckley on Companies Act dealing with commercial insolvency, that is, of the company being\n\nunable to meet current demands upon it. The passage reads:\"In such a case it is\n\n    useless to say that if its assets are realized there will be ample to pay twenty shillings\n\n    in the pound: This is not the test. A company may be at the same time insolvent and\n\n    wealthy. It may have wealth locked up in investments not presently realisable; but\n\n    although this be so, yet if it has not assets available to meet its current liabilities it\n\n    is commercially insolvent and may be wound up.\"41.\n\n        Ee, in his affidavit filed on 11 April 2002,\n\nexplained that the petitioner took out garnishee proceedings in December 2001 to enforce\n\nthe judgment but was not successful. It was advised by M/s Rajah & Tann representing\n\nthe garnishee, Tong Hup Seng, that there was no money due to Dayang.42.\n\n        Goh explained that Dayang had not sued Tong Hup\n\nSeng as the company’s cause of action had only arisen of late. Be that as it may, I\n\nsaw no reason to keep the company alive just to pursue a claim against Guobena and Tong\n\nHup Seng when that could be left to liquidators who had consented to act in the winding-up\n\nof the company. In the hands of those liquidators, any possible potential conflict of\n\ninterest would be avoided. Dayang’s Counsel had earlier informed the Court that\n\nGoh’s brother is a director of Tong Hup Seng. Counsel during further arguments\n\nconfirmed once again on 28 May 2002 that Goh’s brother and father are directors of\n\nTong Hup Seng.43.\n\n        From the audited accounts for the financial\n\nyear ended 31 December 1999, amounts owing by directors stood at $332,185. Loans to\n\ndirectors increased significantly in the following financial year to $962,186. The\n\nunaudited balance sheet for the financial year ended 31 December 2001, exhibited in\n\nGoh’s first affidavit, showed the directors’ borrowings reduced to $320,728.67.\n\nThat appeared to contradict the management accounts for the same period exhibited in\n\nGoh’s second affidavit. The management accounts for the financial year ending 31\n\nDecember 2001 revealed that the directors of the company owed $846,585.33 to the company\n\nwhilst directors’ fees due from the company were $400,000.44.\n\n        In year 2001, when the company was experiencing\n\nserious cash flow difficulties, directors’ borrowings were as high as $846,585.33. I\n\nviewed the initiatives to stop the winding-up for the reasons given with some\n\nreservations. With liquidators in place, the directors would face the possibility of\n\nhaving to repay these loans and stand in the queue like the rest of the unsecured\n\ncreditors to recover any sum due to them from the company as directors.45.\n\n        Goh in  9 of his second affidavit deposed:\" It is respectfully stated\n\n    that the fact that the Company and its directors are prepared to go to every length to\n\n    save itself demonstrates the genuine manner in which the Company will strive to maintain\n\n    and achieve its obligations.\"46.\n\n        I was not persuaded by that declaration when\n\nthe obvious thing for the directors to do, if they sincerely and genuinely wanted to\n\nensure the company’s survival, is repay their own substantial borrowings to the\n\ncompany. There was never any hint of an offer or pledge to repay the loans.47.\n\n        The proposed Scheme of Arrangement exhibited in\n\nGoh’s second affidavit was skimpy and unconvincing. It glaringly omitted to take into\n\naccount the substantial borrowings of the directors and solely focused on the trade debts\n\nof Tong Hup and Seng Guobena. Creditors were left to wonder when the proposal would take\n\neffect and the length of time they would have to wait for payment. The proposal was\n\ndependent on the company succeeding in any litigation against Tong Hup Seng and Guobena.48.\n\n        D’Cotta J inWei Giap Construction\n\nCo (Pte) Ltd v Intraco Ltd[1979] 2MLJ 4 held that:\"(2) in exercising its\n\n    discretion, the court will have regard for the wishes of the majority of the creditors if\n\n    they have good reason for opposing the petition.(3) in the exercise of its\n\n    discretion it is the duty of the court to weigh all the relevant matters and decide\n\n    whether theprima facieright of the petitioning creditors to an order should give\n\n    way to the wishes of some creditors who assign no reason for their opposition or who\n\n    merely state that in their view the appellants might be in a position to pay their debts\n\n    if allowed to continue to operate.\"49.\n\n        None of the creditors who opposed the grant of\n\na winding-up order filed affidavits stating reasons for their opposition. From what was\n\nsaid in Court or seen in letters exhibited by Dayang, they were all mere expressions of\n\nwillingness (stemmed probably from a promise of full satisfaction of their debts or\n\nclaims) to give the company time to recover money from Tong Hup Seng and Guobena. That\n\nalone, in my view, was not good enough a reason for opposing the winding-up, even if it\n\nrepresented the wishes of the majority.50.\n\n        Obviously, the directors recognised and\n\nacknowledged the company’s insolvency. That is to be inferred from their desire to\n\nplace the company under Judicial Management or to apply for a Scheme of Arrangement.51.\n\n        After seeing the second affidavit of Goh and\n\nhearing further arguments, I was more convinced than ever that the company was\n\ncommercially insolvent and unable to pay its debts.52.\n\n        Accordingly, I ruled that the order made on 12\n\nApril 2002 to wind-up Dayang is to stand. I also awarded the petitioner costs (to be\n\ntreated as winding-up costs) fixed at $4,500.Sgd:BELINDA ANG SAW EANJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}