{
    "case_title": "Public Prosecutor v Choong Kian Haw",
    "ncitation": "[2002] SGHC 211",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Undisputed facts": "2        Prior to his bankruptcy,\n\nChoong was a fairly successful businessman who ran his own family’s business.\n\nHowever, the company he ran became insolvent due to the economic crisis in Asia in 1998\n\nand some mistaken business decisions. Choong was made a bankrupt on 19 March 1999 as he\n\nhad given personal guarantees for loans granted to his company.3        On 1 June 1999, Choong\n\nfound gainful employment with HIN Investments Pte. Ltd. (‘HIN Investments’) as\n\nan executive officer. His duties involved a considerable amount of traveling out of\n\nSingapore. The purpose of the trips was to make contacts and forge ties with existing and\n\nprospective overseas partners so as to secure deals with them and also to survey overseas\n\nmarkets.4        Choong knew that it was an\n\noffence to leave Singapore without the previous permission of the Official Assignee. On 13\n\nApril 1999, he acknowledged receipt of the Bankruptcy Information Sheets which informed\n\nhim of this offence. Furthermore, as he had committed the offence on numerous occasions,\n\nthe Official Assignee sent him a formal warning on 23 September 1999. He was informed that\n\nhe would be prosecuted if he continued to commit this offence.5        Choong sought the Official\n\nAssignee’s permission to go on work-related travel thrice and permission was granted\n\non two occasions. On the first application, he obtained permission to travel for fifteen\n\nweeks from 23 September 1999 to 31 December 1999. However, on his second application in\n\nJanuary 2000, he failed because a GIRO deduction for one of the monthly installments that\n\nhe had to make pursuant to an arrangement to repay his creditors had failed. Choong\n\npromptly took steps to make the necessary payment. In March 2000, he made a further\n\napplication which was also successful. He was permitted to travel abroad for a further six\n\nmonths from 29 March 2000 to 28 September 2000.6        After March 2000, Choong\n\nhad no further contact with the Official Assignee until January 2002, when his offences\n\ncame to light. In the meantime, he continued to travel frequently, i.e. two or three times\n\na month. The trips lasted from a few days to ten days and were for work related purposes.\n\nHIN Investments made the arrangements for his travels and undertook to keep track of the\n\nduration of the permission granted by the Official Assignee. However, both HIN Investments\n\nand Choong failed to take any steps to check that he was always traveling with permission.\n\nAs such, after his permission to travel lapsed in September 2000, Choong did not seek\n\nfurther permission but made a total of 44 trips out of Singapore without permission.7        In January 2002, Choong\n\nneeded a new passport as all the pages in his existing passport had been used up. He went\n\nto the Singapore Immigration & Registration department where he was advised that he\n\nhad to obtain the permission of the Official Assignee to do so. The offences which Choong\n\ncommitted were then discovered when he surrendered his existing passport to the officer at\n\nthe Official Assignee’s office to obtain permission to get a new passport.8        The prosecution initially\n\ntook out 50 charges against Choong for the offence of traveling out of Singapore without\n\nthe previous permission of the Official Assignee. However, only three charges were\n\neventually proceeded with, i.e. the 20th, 25thand 36thcharges. 41 other charges were taken into account and six were withdrawn. With respect to\n\nthe 20thcharge, the subject matter was Choong’s travel to the Philippines\n\non 23 April 2001 where he attended an exhibition to source for new products. As for the 25thcharge, Choong was charged with traveling to Australia on 3 June 2001 where he had gone to\n\ndiscuss the possibility of a joint venture with an Australian party. Lastly, on the 36thcharge, the prosecution charged Choong for traveling to the UK on 21 September 2001\n\nwithout permission. Choong had gone to the UK to discuss the possibility of obtaining a\n\nlicence to operate a dry cleaning business in Singapore.",
        "The decision below": "9        Magistrate Chong convicted\n\nChoong on all three charges and sentenced him to the maximum fine of $10,000 per charge\n\nsuch that the total fine payable was $30,000.10        The magistrate considered\n\ntwo competing public interest elements in sentencing, ie the need for specific and general\n\ndeterrence against the commission of such offences and the need to encourage enterprise.\n\nHe concluded that a custodial sentence was inappropriate in the present case because it\n\nwould discourage risk-taking entrepreneurs such as Choong who traveled abroad in the\n\ncourse of helping his employer’s business. Furthermore, he found that Choong had not\n\ncommitted the offence intentionally but through a negligent omission \"contributed by\n\nthe hectic pace of an entrepreneurial effort\". The magistrate also did not think that\n\nit was necessary to impose a custodial sentence on Choong to deter him as the magistrate\n\nwarned him that he would be imprisoned if he committed the same offence again and this\n\nwarning was a sufficient deterrent. He also made it clear that the sentence imposed was\n\nbased on the unique facts of this case and would not send the wrong signals to other\n\nbankrupts. However, in arriving at the appropriate sentence, the magistrate placed little\n\nweight on Choong’s ill health and his plea of guilt as he had been caught red-handed.",
        "The appeal": "11        The only issue in this\n\nappeal was whether the sentence imposed by the magistrate was manifestly inadequate.12        The DPP contended that a\n\ncustodial sentence should have been imposed. He had four main grounds of appeal. First,\n\nthat the trial judge erred when he found that Choong had not committed the offence\n\ndeliberately, recklessly or with blatant disregard for the obligations imposed on him to\n\nseek permission from the Official Assignee before leaving the jurisdiction. Secondly, that\n\nthe magistrate failed to consider that the imposition of a fine would not have any\n\npunitive effect on Choong. Thirdly, that the sentence was out of line with sentencing\n\nprecedents. Lastly, that the magistrate wrongly relied on the need to promote enterprise\n\nas a relevant policy consideration to reduce the sentence imposed on Choong.",
        "Choong’s mental state": "13        The magistrate held that\n\nChoong had not traveled out of the jurisdiction without the permission of the Official\n\nAssignee deliberately, recklessly or with blatant disregard. He noted that Choong had made\n\n44 such trips without permission and that this wouldprima faciequalify as a\n\nflagrant breach. However, he accepted Choong’s explanation that he had merely\n\noverlooked the requirement to apply for permission after his existing permission lapsed.\n\nThe magistrate noted that Choong had arranged for his employer to monitor the duration of\n\nhis permissions and concluded that he was simply negligent in failing to check whether his\n\nemployer had applied for permission on his behalf. He claimed that his conclusion was\n\nfortified by the following facts: First, there was no reason for Choong not to apply for\n\npermission deliberately. This was because he had been granted permission previously and\n\nwas likely to succeed if he had made an application for permission to travel on the same\n\nbasis as the previous successful applications, i.e. work-related traveling. Secondly,\n\nChoong did not attempt to conceal his travels from the Official Assignee. He voluntarily\n\nsurrendered his passport with the incriminating evidence although it would have been so\n\neasy for him to hide this evidence. Lastly, the magistrate accepted that the frequency of\n\nChoong’s work-related travel contributed to his inadvertent failure to check on his\n\nemployer regarding extensions of the permission for him to travel.14        The DPP argued before me\n\nthat the trial judge erred in finding that Choong had committed the offences negligently.\n\nHe pointed out that Choong had committed such offences before and had been warned\n\npreviously. Thus, he was well-aware of the requirement for permission to travel. In spite\n\nof his knowledge, Choong traveled 44 times out of Singapore without the previous\n\npermission of the Official Assignee. In addition, the DPP also contended that the\n\nmagistrate erred in taking into consideration the fact that Choong had asked HIN\n\nInvestments to keep track of his travels to conclude that Choong was merely negligent in\n\nfailing to ensure that HIN Investments had actually obtained a valid permission for him to\n\ntravel.15        In defence, Counsel for\n\nChoong submitted that he had only negligently overlooked the requirement to obtain\n\npermission for his travels due to the frequency of the trips or, in the words of the\n\nmagistrate, the \"hectic pace of an entrepreneurial effort\".16        I accepted the arguments\n\nof the prosecution and found that the magistrate drew the wrong inference from the facts\n\nbefore him when he found that Choong had committed the offence negligently and notrecklessly.\n\nChoong had admitted, in the Statement of Facts, that he had received the Bankruptcy\n\nInformation Sheets which informed him that it was an offence to leave Singapore without\n\nthe previous permission of the Official Assignee. Despite such a warning, he left\n\nSingapore without obtaining permission on \"numerous occasions\". As such,\n\na second official warning was given to him, informing him that he would be prosecuted if\n\nhe persisted in committing the offences. Choong was clearly apprised of the severity of\n\nthe offences from his historical dealings with the Official Assignee. Despite this\n\nknowledge, Choong continued to travel out of Singapore without permission for a total of\n\n44 times over a period of more than 15 months, from September 2000 to January 2002. In my\n\nview, the numerous times in which he committed the offence, knowing its severity, amounted\n\nto a blatant disregard for the law. Choong shut his eyes to the possible consequences\n\narising from his failure to ensure that he had the relevant permission to travel. It was\n\nclearly not open to Choong to rely on the frequency of his trips to prove that he had\n\nnegligently overlooked the requirement for permission.17        I was also of the view\n\nthat the magistrate’s finding that Choong committed the offences negligently could\n\nnot be supported by the two facts he relied on. First, that Choong made arrangements for\n\nhis employer to monitor whether he had the permission to travel. I agreed with the DPP\n\nthat the magistrate had effectively condoned the delegation of duties imposed on a\n\nbankrupt by the bankruptcy regime by finding Choong negligent since he had merely failed\n\nto check on HIN Investments. Such an approach is wrong because the duty imposed on a\n\nbankrupt to ensure that he does not breach any of the limitations imposed on him is\n\npersonal and non-delegable. This is so that there is proper accountability by the bankrupt\n\nfor the effective administration of his bankruptcy, to the benefit of his creditors.18        Secondly, the fact that\n\nChoong had voluntarily surrendered his passport to the Official Assignee could not prove\n\nthat Choong was innocent. The magistrate’s reasoning that Choong could have easily\n\nhidden the incriminating evidence instead of surrendering it to the Official Assignee if\n\nhe had indeed known that he committed the offence was highly speculative. In any case, I\n\ndisagreed with the magistrate that it was easy to hide the incriminating evidence by\n\nclaiming that the passport was lost since such an action involved committing the criminal\n\noffence of making a false police report to declare its loss.19        In conclusion, the facts\n\nand evidence before me did not support the magistrate’s conclusion that Choong\n\ncommitted the offences inadvertently. In my opinion, Choong committed the 44 offences\n\nblatantly, recklessly and deliberately.",
        "The general suitability of a custodial sentence – sentencing\n\nprecedents and policy": "20        There are only two cases\n\nconcerning sentencing for the offences of leaving Singapore without the permission of the\n\nOfficial Assignee for which written grounds are available, ieChong Fook Choy v PP(MA\n\n116/2000/01) andRe Ho Kok Cheong(RA 80/1995). The magistrate held that the\n\nsentencing guideline that could be derived from these cases was that a custodial sentence\n\nwould be normally imposed only when the accused had deliberately, recklessly or blatantly\n\ndisregarded the requirement to obtain the Official Assignee’s permission to leave\n\nSingapore. At  26 of his grounds of decision, the magistrate stated that a fine of $5000\n\nwas the usual tariff sentence in cases where an offender pleads guilty to an offence under\n\ns 131(1)(b). As such, the magistrate held that a custodial sentence was inappropriate\n\nsince Choong committed the offences negligently.21        In my view, the magistrate\n\nwas wrong in limiting the imposition of a custodial sentence only to cases when the\n\noffences are committed deliberately, recklessly or with blatant disregard for the\n\nrequirements under s 131(1)(b).A fortiori, I disagreed with his conclusion that a\n\nfine of $5000 is the usual tariff sentence for offenders who plead guilty to a charge\n\nunder s 131(1)(b). The positions taken by the magistrate were certainly not supported by\n\nany authority. The cases ofRe Ho Kok CheongandChong Fok Choy v PPdid\n\ninvolve offenders who had deliberately, recklessly or blatantly breached the requirements\n\nto obtain permission. However, nothing in those cases suggested that custodial sentences\n\nshould be imposed only if the offenders were reckless, or deliberately and blatantly broke\n\nthe law. In fact, in the case ofRe Ho Kok Cheong, Rubin J noted that inallof the 28 cases heard before his own case, a sentence of imprisonment was imposed oneveryoffender who had been convicted of the offence of leaving the jurisdiction without the\n\nprevious permission of the Official Assignee. The prosecution had also tendered a list of\n\nseven recent cases involving offences committed pursuant to section 131(1)(b). In all but\n\none case, custodial sentences were imposed. As for the only case which did not attract a\n\ncustodial sentence, the accused had left the jurisdiction without permission on only one\n\noccasion. Counsel for Choong failed to produce any other case to support her contention\n\nthat a fine was generally the appropriate punishment. The authorities stood for the\n\nproposition that a custodial sentence was the norm for offences committed under s\n\n131(1)(b).22        The imposition of a fine\n\nas an exception is also consistent with the approach which I took inPP v Ong Ker Seng[2001] 4 SLR 180. In that case, the accused was convicted of two charges, under s 141(1)(a) of\n\nthe Bankruptcy Act, of obtaining loans without informing the lender that he was a\n\nbankrupt. I expressed the opinion that such an offence would generally attract a custodial\n\nsentence. Fines were normally inappropriate because the funds to pay the fine would either\n\ncome from a third party, diluting the punitive effect on the bankrupt, or from funds which\n\nshould go to the unpaid creditors in the first place.23        The magistrate reasoned\n\nthat I did not lay down any definitive rule that a bankrupt ought to be punished with\n\nimprisonment in general but dealt only with offences under s 141(1)(a). He stated that the\n\nappropriate sentence should depend on the nature of the offence and the facts and\n\ncircumstances of the case. Furthermore, he commented that one of the prescribed\n\npunishments for an offence under s 131(1)(b) was the imposition of a fine and therefore\n\nParliament must have intended the imposition of fines instead of custodial sentences on\n\nbankrupts in appropriate cases.24        The magistrate misread my\n\ndecision inPP v Ong Ker Seng. In that case, I did not contradict the trite\n\nprinciples that fines may be imposed in appropriate circumstances. However, I stated my\n\nview that fines were, in general, not a suitable means of punishment since bankrupts would\n\ntypically lack the means to pay for the fines themselves. If they had the funds to pay the\n\nfines, these monies should clearly be channeled instead to the unpaid creditors. If they\n\nlacked the funds and a third party paid for them, the punitive effect of the punishments\n\nis diminished. These concerns apply with equal force to the sentencing of bankrupts in\n\ngeneral. They are not limited to offences committed under s 141(1)(a).25        I was of the view that the\n\ncase law clearly stood for the proposition that a custodial sentence would generally be\n\nimposed for the offence of leaving the jurisdiction without the previous permission of the\n\nOfficial Assignee. The burden was on the offender to show that there were such exceptional\n\ncircumstances in his case that it warranted a deviation from the usual imposition of a\n\ncustodial sentence. Choong failed to prove that his case was an exception warranting only\n\na fine, as he had committed a grand total of 44 offences recklessly and blatantly.",
        "Policy considerations": "26        On the grounds mentioned\n\nabove, the prosecution was entitled to succeed in this appeal. However, I found it\n\nnecessary to deal specifically with one part of the magistrate’s reasoning. In\n\nconcluding that Choong should not be given a custodial sentence, the magistrate was\n\ninfluenced by what he considered to be a key public policy consideration in the sentencing\n\nof offenders under the Bankruptcy Act, i.e. the promotion of enterprise. At  40 of his\n\ngrounds of decision, he stated:… I was also conscious of the other public interest\n\n    element of the new Bankruptcy Act, which was that of encouraging entrepreneurship. While\n\n    encouraging entrepreneurship was an important public policy concern in 1995 when the new\n\n    Bankruptcy Act was passed to make it easier for failed entrepreneurs to obtain discharges,\n\n    it is an even more important and crucial concern in today’s changed economic\n\n    environment. The government has recently strongly encouraged Singaporeans to become\n\n    entrepreneurs and to venture abroad. Entrepreneurship has been identified as an important\n\n    engine of growth for the Singapore economy in this changed economic environment.At  42, of his grounds, the magistrate then made the startling\n\nstatement that the imposition of a custodial sentence on Choong would be overly harsh and\n\nwould discourage risk-taking entrepreneurs which went against the national policy of\n\npromoting enterprise.27        With respect, I could not\n\nunderstand the rationale for taking into consideration the need to promote enterprise in\n\nthe sentencing of offenders. The promotion of enterprise in Singapore is important.\n\nHowever, it was clear from the debates on the reform to the bankruptcy regime on 25 August\n\n1994, culminating with the passing of the new Bankruptcy Act that Parliament did not\n\nintend the promotion of enterprise to be at the expense of the need to protect the\n\ninterests of creditors and society. At volume 63, column 399 of the parliamentary reports,\n\nthe Minister for Law, Professor S. Jayakumar, stated the functions of the new Act, as\n\nfollows:… to improve administration of the affairs of\n\n    bankrupts and protect creditors’ interests without stifling entrepreneurship. We will\n\n    strike a balance between the interest of the debtor, the creditor and society.Furthermore, at column 401 of the same report, the Minister stated that\n\nthe Act would encourage enterprise through allowing the early discharge of bankrupts who\n\nbecame bankrupts due to business failure. Parliament’s intention was to promote\n\nenterprise through such a mechanism, not through being more lenient towards bankrupts who\n\nbroke the law while carrying on a business.28        The purpose of prohibiting\n\nan undischarged bankrupt from leaving the jurisdiction without the previous permission of\n\nthe Official Assignee is to ensure that the Official Assignee can monitor the\n\nbankrupt’s movements to properly administer his affairs for the benefit of his\n\ncreditors. A bankrupt who goes overseas without permission would have opportunities to\n\nsalt away his assets, earn income or acquire assets abroad without accounting for them to\n\nthe detriment of his creditors, since the Official Assignee would not have the power to\n\nsupervise his affairs. As such, it is necessary to treat every infraction of section\n\n131(1)(b) seriously.29        In my view, there is no\n\nreason to treat preferentially offenders who commit an offence supposedly in the course of\n\ntheir business. Adopting such an approach would set a bad precedent and send the wrong\n\nsignals to bankrupts that the law views such offenders more leniently. This is manifestly\n\ncontrary to Parliament’s intention to protect the interests of creditors and improve\n\nthe administration of the affairs of bankrupts. In any case, I do not see how an\n\nimposition of a custodial sentence for breaking the law by failing to seek permission\n\nwould discourage enterprise. Bankrupts who have work-related reasons to travel need only\n\ntake the extra step of applying for permission to carry on their businesses legitimately.\n\nIf they fail to do so, they must be treated like any other offender. Such an approach will\n\nproperly reflect the balance of the interests of the creditors, debtors and society.\n\nAccordingly, I rejected the magistrate’s view that the promotion of enterprise should\n\nbe a relevant policy consideration in sentencing bankrupts.",
        "Conclusion": "30        Choong committed the\n\noffences of leaving Singapore without the previous permission of the Official Assignee\n\nrecklessly and blatantly a total of 44 times. On this ground alone, he deserved a\n\ncustodial sentence. The imposition of a term of imprisonment was also consistent with the\n\nprevious cases and policy considerations.31        Accordingly, I allowed the\n\nappeal of the Public Prosecutor. I set aside the fines of $10,000 per charge for the three\n\ncharges imposed by the magistrate and ordered that the fines which had already been paid\n\ninto Court be paid over to the Official Assignee. I substituted the fines with a term of\n\nimprisonment of two months for each of the three charges. I ordered that all the terms of\n\nimprisonment should run consecutively. On an application by Counsel for Choong, I allowed\n\nthe commencement of the period of imprisonment to be deferred to 10 September 2002. Bail\n\nwas set at $10,000.Sgd:YONG PUNG HOWChief JusticeRepublic of SingaporeCopyright © Government of Singapore."
    }
}