{
    "case_title": "Tham Lai Hoong v Fong Weng Sun Peter Vincent",
    "ncitation": "[2002] SGHC 45",
    "coram": "Lee Seiu Kin JC",
    "sections": {
        "Background": "5 The parties were married on 6 June 1979. They resided at various\n\nplaces after the marriage and the last was at 43 Charlton Road. They have two sons born in\n\n1980 and 1985. The Petitioner is a housewife. The Respondent is a Training Director with\n\nthe Institute of Certified Public Accounts of Singapore. On 24 April 1999, the Petitioner\n\nfiled this Divorce Petition on the ground of the unreasonable behaviour of the Respondent.\n\nHe filed a Cross-Petition based on the Petitioner’s unreasonable behaviour, but later\n\nwithdrew it. On 5 September 2000 the Decree Nisi was granted. Custody, care and control of\n\nthe two children were, by consent, given to the Respondent with reasonable access to the\n\nPetitioner. The Respondent also agreed to pay the Petitioner $10,000 as costs of the\n\ndivorce hearing.6 The Petitioner was last employed as a tour guide before marriage. She\n\nclaimed that she had spent a considerable amount of her own money in decorating and\n\nfurnishing the matrimonial home. But apart from this, it is not disputed that the\n\nRespondent had borne all repayments of the housing loan and all household expenses. In\n\n1994, with part of the overdraft of $300,000 secured by the second mortgage on the\n\nmatrimonial home, the Respondent got into the childcare business through a company called\n\nthe London Montessori Centre (Singapore) Pte Ltd. (\"LMC\"). He had used $180,000\n\nof the overdraft for this business. The Petitioner withdrew the remaining $120,000 for her\n\ninvestments. It was around that time that their marriage became strained. In fact the\n\nPetitioner had in 1995 filed an earlier petition, Divorce Petition No. 2168 of 1995. They\n\nthen executed a Settlement Agreement dated 13 August 1996 wherein the Petitioner was to\n\nhave custody of the two children and the Respondent would pay $1,500 as monthly\n\nmaintenance for her and the children. In the Settlement Agreement the Petitioner agreed to\n\nreceiving 25% of the matrimonial assets.",
        "Matrimonial home": "7 The matrimonial home at 43 Charlton Road is worth about $1.4 million.\n\nIt was purchased in their joint names in 1989 for $800,000. Of this, $550,000 came from\n\nthe Respondent’s CPF account and $14,000 from the Petitioner’s CPF account. The\n\nbalance of $250,000 was from a housing loan in which the outstanding balance by February\n\n2001 was about $100,000. The monthly installments of $2,218 were paid from the\n\nRespondent’s CPF account.8 In 1994, the parties took out a second mortgage on the matrimonial\n\nhome to secure a $300,000 overdraft facility. The Respondent subsequently borrowed\n\n$300,000 from his father to clear the overdraft and the parties became indebted to him\n\ninstead. This loan is evidenced by a written Agreement signed by the three of them on 4\n\nSeptember 1998. This provides that the parties would repay him the $300,000 if they sold\n\nor transferred the property in any manner or by Order of Court. Therefore the\n\nparties’ equity in the matrimonial home would be its value less: (i) the costs and\n\nexpenses of sale; (ii) the outstanding housing loan; and (iii) the $300,000 owed to the\n\nRespondent’s father.",
        "Other assets of the parties": "9 The Petitioner disclosed that she had the following assets apart from\n\nher share in the matrimonial home:(a)Credit Balance in bank accounts$132,916.39(b)Shares in Singapore companies$ 19,285.00(c)Shares in Malaysian companies (S$ equivalent)$ 11,000.00The Respondent disclosed that his assets apart from the matrimonial\n\nhome were as follows:(a)Credit balance in his CPF ordinary and special accounts$ 46,354(b)22,500 shares in his company, LMC (estimated value)$ 50,000(c)70,000 shares in Cross Holdings Pte Ltd (estimated value)$ 50,000(d)Shares in Singapore and Malaysian listed companies(value as\n\n      at February 2000)$19,910(e)2 club memberships$197,000(f)Two Insurance Policies the beneficiaries of which are his two\n\n      sons10 Before the District Judge, counsel for the Respondent said that he\n\nwould not make a claim on the Malaysian shares of the Petitioner and counsel for the\n\nPetitioner said that she was not making a claim on his Malaysian shares as well as the\n\ninsurance policies. As for items (a) to (d) of the Respondent’s list, it was not\n\ndisputed that they were matrimonial assets. As regards item (e), the two club memberships\n\nare those in the Singapore Island Country Club (\"SICC\") and the Seletar Country\n\nClub (\"SCC\"). The SCC was purchased by the Respondent sometime in the early\n\n1980s and there was no dispute that this was matrimonial property. The Respondent\n\nestimated its value at $50,000 with a transfer fee of $30,000. As for the SICC, the\n\nRespondent said that his father had purchased the membership for him before his marriage,\n\nhaving paid a sum of $5,000 to convert the junior membership to full membership when he\n\nturned 21 years. The Respondent argued that as it was acquired before marriage, it was\n\ntherefore not a matrimonial asset. Both counsel agreed that on this basis, the\n\nPetitioner’s other assets total $157,000 and the Respondent’s other assets total\n\n$192,000.",
        "Division": "11 The District Judge had ordered division of the matrimonial home\n\n(sale proceeds less outstanding housing loan, $300,000 owed to the Respondent’s\n\nfather and sale expenses) in the proportion of 35% to the Petitioner and 65% to the\n\nRespondent. In respect of the remaining assets, she did not order distribution and the\n\nparties would be entitled to retain what were in their names. In doing so, the judge had\n\nregard to the circumstances of the case and the matters set out in Section 112(2) of the\n\nWomen’s Charter. The judge was of the view that the Petitioner should be awarded more\n\nthan the 25% she had agreed to accept in the Settlement Agreement in view of the long\n\nmarriage and the need to provide her with sufficient funds to enable her to purchase a\n\nhome. The judge felt that with 35% of the net proceeds of sale and the other assets she\n\nwas allowed to retain, she should be able to buy at least an HDB or private apartment.12 The power to order division of matrimonial assets is given under s\n\n112(1) of the Women’s Charter which states as follows:The court shall have power, when granting or subsequent to the grant of a decree of\n\n  divorce, judicial separation or nullity of marriage, to order the division between the\n\n  parties of any matrimonial asset or the sale of any such asset and the division between\n\n  the parties of the proceeds of the sale of any such asset in such proportions as the court\n\n  thinks just and equitable.The basis of the division shall be what is just and equitable. Section\n\n112(2) provides that in exercising this power the court shall have regard to all the\n\ncircumstances of the case, including the eight matters listed therein. In order to be able\n\nto make such a determination, it is first of all necessary for the court to have a clear\n\nidea of the extent of the matrimonial assets available for distribution. What the District\n\nJudge did was to order distribution of the matrimonial home only, leaving the other assets\n\nof the parties to be retained by them. While I do not say that it is not possible to make\n\nan order in this manner, it seems to me that this approach makes it more difficult for the\n\ncourt to arrive at the correct order. In my view the better way to approach the task would\n\nbe first of all to set out and add up the values, or estimated values, of all the\n\nmatrimonial assets. Then the court should proceed to compute the direct contributions made\n\nby each party. These are, after all, numerical computations which are relatively easy to\n\nascertain. With these numbers out of the way, the court can then proceed with what is\n\nreally the most difficult part of the exercise, i.e. the determination of a just and\n\nequitable division in the light of all the circumstances of the case, including the\n\nmatters listed in s 112(2). Having decided on the division, it then becomes a simple\n\nmatter again to decide who should keep what asset and what others should be sold. To\n\nexclude some assets from this consideration could contribute to a misapprehension in the\n\nmind of the judge as to the extent of the matrimonial assets as well as extent of each\n\nparty's contribution thereto.13 Taking that approach, the first step is to add up the matrimonial\n\nassets. These total about $1.35 million, comprising as follows:AssetEstimated net valueMatrimonial home$1 millionPetitioner’s other assets$157,000Respondent’s other assets (excluding SICC)$192,00014 The next step is to decide on direct contribution, which is a simple\n\nexercise in the present case. She had taken $120,000 from the $300,000 overdraft to\n\ninvest, at the end of which she was able to show total assets of $157,000. Therefore due\n\nto her efforts, the assets had increased by $37,000. The Petitioner had contributed\n\n$14,000 from her CPF towards the purchase of the matrimonial home. She claimed she spent a\n\nsubstantial sum of money on renovation and the garden, but this is not quantified nor\n\nsupported by documents. I am prepared to give a generous estimate to the \"substantial\n\nsum\" that she claimed she had spent on renovation and the garden. I put it at\n\n$14,000, which is of the same order as her contribution to the purchase price. Adding\n\nthese up, her total direct monetary contribution to the matrimonial assets would be\n\n$65,000.15 The Respondent’s direct contributions were as follows. In\n\nrespect of the family home, he paid $550,000. He took out a loan of $250,000 for the\n\nbalance and paid the monthly installments. By February 2001, there was an outstanding\n\nbalance left of about $100,000. Therefore he had contributed another $150,000 (ignoring\n\ninterest). He took $180,000 from the overdraft to invest and his other assets are now\n\nworth $192,000. Therefore he had augmented the assets by $12,000 which would be his\n\ncontribution. His total direct monetary contribution would be the sum of $550,000,\n\n$150,000 and $12,000, which total $712,000. Comparing this against the Petitioner’s\n\ncontribution of $65,000, the ratio of the parties’ contribution are 8.4% by the\n\nPetitioner and 91.6% by the Respondent. For convenience, I round this to 9% and 91%.16 I turn to consider the indirect contributions. The marriage lasted\n\n21 years. The Petitioner ceased full-time employment entirely after marriage and she was\n\nsoon pregnant with their first child. Thereafter she had to look after the family and the\n\nmatrimonial home. The Respondent claimed that she had led a comfortable life and always\n\nhad a live-in maid and therefore did not do much housework. However his own mother had\n\nadmitted that the Petitioner had been a good and loving mother to the boys. The Petitioner\n\nclaimed that as a result of her sacrifice in giving up working and devoting herself to\n\ntaking care of the family and the home, the Respondent was able to advance from an\n\nemployee earning a low income to the owner of various businesses. They were able to\n\nupgrade from a smaller house to their current matrimonial home. She said that she had\n\nagreed to the Respondent having the custody, care and control of the children because he\n\nwas financially in a better position to provide for them. She was still staying with them\n\nin the matrimonial home. The 1996 Settlement Agreement provided for the Petitioner to get\n\n25% and this is a factor to be taken into account.17 Taking into account the direct and indirect contributions of the\n\nparties and all the other circumstances of this case, I was of the view that a just and\n\nequitable division would be 40% to the Petitioner and 60% to the Respondent. This\n\nproportion would be applied to the net matrimonial assets as and when each asset becomes\n\nrealised. Each party would be responsible for refunding his or her CPF account from his or\n\nher share of the proceeds of sale of the matrimonial home. So far as the shares are\n\nconcerned, listed shares are to be valued at the market price on the date of the order,\n\ni.e. 14 January 2002. Unlisted shares may be taken at the value attributed to them by the\n\nparty concerned unless the parties otherwise agree. If the Respondent decides to retain\n\nhis membership of SCC, then it shall be valued at the prevailing market price at the date\n\nof the order.18 After I made the order on 14 January 2002, the Petitioner applied\n\nfor further arguments which were heard on 5 February. Counsel argued that the SICC\n\nmembership was a matrimonial asset because after they were married, the Respondent had\n\npaid $50,000 to convert it to transferable membership, a fact not pointed out at the\n\nearlier hearing. I agreed that in the circumstances it would constitute a matrimonial\n\nasset. However one of the factors that I had taken into account in deciding on the\n\ndivision was the overall quantum. Had the SICC membership been included I would have\n\nadjusted the ratio a little in favour of the Respondent. In view of that I declined to\n\nchange my order.19 The Petitioner’s counsel also argued that the $300,000 in\n\nconnection with the loan from the Respondent's father should be included in the\n\nmatrimonial assets. However, with respect, I fail to see the logic of his arguments. The\n\nsimplest way to look at it is to consider what assets are owned by the parties after\n\ndeduction of their liabilities. In plain language, this money did not belong to them but\n\nto the Respondents’ father.20 The Respondent’s counsel argued that the money in the\n\nPetitioner’s CPF account should also be included as matrimonial asset. I have done so\n\nin the computation above. With respect to the sums to be refunded to their respective CPF\n\naccounts from the sale proceeds, as the refund would come from their respective share of\n\nthe proceeds, the money in their respective CPF accounts have been treated as matrimonial\n\nassets.",
        "Maintenance": "21 In respect of her decision on maintenance, the District Judge had\n\nsaid this at  9, 14 and 20 of her Grounds of Decision:\"9. With regard to the matrimonial home, the wife stated that if\n\n  it was sold, she would have to rent a place or buy a property for herself and be solely\n\n  responsible for the expenses incurred thereby. She would need no less than $2,500 per\n\n  month as maintenance for herself or a lump sum maintenance of $300,000 to achieve a clean\n\n  break. She stated that she had been accustomed to a comfortable standard of living during\n\n  the marriage. She had been chauffeur-driven. She had travelled abroad at least twice a\n\n  year to various countries and stayed at five or six-star hotels. She had purchased or been\n\n  given expensive jewellery and luxurious goods. She had also dined at fine restaurants and\n\n  country clubs.…14. With regard to maintenance, the wife had previously agreed and a\n\n  Consent Order was recorded on 24 November 2000 that he pay her $1,500 monthly as\n\n  maintenance for herself alone. He would also have to reimburse her for her groceries and\n\n  pet care expenses until she moved into her own accommodation. Previously, he earned a\n\n  total salary of $6,000 as a Director of LMC and another company, Cross Holdings Pte Ltd.\n\n  In December 2000, he joined ICPAS and is currently earning $7,000 per month as a Training\n\n  Director. His expenses amounted to $5,144 per month. He was of the view that the\n\n  wife’s present claim for a minimum sum of $2,500 was excessive. She had inflated her\n\n  monthly expenses. Furthermore, she had other and substantial assets all of which were\n\n  acquired from the monies he had given her through the marriage. He submitted that a sum of\n\n  $1,500 per month was more than sufficient maintenance for her alone.…20. With regard to the amount of maintenance for the wife alone, I took\n\n  into consideration the fact that the husband was and would be solely responsible for all\n\n  the expenses of the two children. According to him, both the children would be pursuing\n\n  their tertiary education and abroad too. He had to put aside some of his savings for the\n\n  children’s education. The wife had only her own needs to provide for. She is now 44\n\n  years old and could still rejoin the workforce for some additional income. Having regard\n\n  to all the circumstances of the case, including the matters set out in Section 114(1) of\n\n  the Women’s Charter and taking into consideration also sub-section (2), I decided\n\n  that a sum of $2,000 per month would be reasonable maintenance for her alone.\"22 I fully agree with the judge’s decision and find no merit\n\nwhatsoever in counsel’s submission that this was not the appropriate award in the\n\ncircumstances.",
        "Costs": "23 On the question of costs, the District Judge took into account the numerous\n\naffidavits filed by both parties, the several pre-trial conferences and the fact that the\n\nRespondent had already paid $10,000 for the divorce hearing. She had decided that $3,500\n\nrather than the $5,000 asked by the Petitioner was reasonable costs for the hearing of the\n\nancillary matters. I see no reason to disturb this award and dismissed the\n\nPetitioner’s appeal in this regard.Sgd:LEE SEIU KINJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}