{
    "case_title": "Toh Kim Chan v Toh Kim Tian & Others",
    "ncitation": "[2002] SGHC 266",
    "coram": "Woo Bih Li JC",
    "sections": {
        "Claim for a declaration that Kim\n\nTian and Mdm Ang are trustees of Kim Chan’s 20% share in the Partnership": "22.        As\n\nMdm Ang was not a named partner, it is not appropriate for Kim Chan to seek a declaration\n\nthat she is a trustee of his share in the Partnership.23.        As\n\nfor Kim Tian, I will make a declaration that he holds Kim Chan’s 20% share in the\n\nPartnership in trust for Kim Chan but that does not mean that Kim Tian is a trustee for\n\nall matters in connection with the Partnership. I will elaborate on this point later.",
        "Claim for a declaration that Kim\n\nChan is entitled to 20% of the business, assets and profit of the Partnership and of GJEWB": "24.        I\n\nwill treat the claim for a declaration that Kim Chan is entitled to 20% of the business,\n\nassets and profit of the Partnership and of GJEWB together with the claim for an\n\naccounting and an inquiry.",
        "Claim for an accounting and an\n\ninquiry": "25.        \n\nThis claim for an accounting and an inquiry is set out in para 22(6)(a) to (c) of the\n\nAmended Statement of Claim. Paragraph 26(e) is a claim for an order regarding access to\n\ndocuments and 26(f) is in respect of an order for interim payment. These provisions seek:(a) an account of the credits,\n\n    property, assets and effects belonging to:-(i) GUAN JOO ENGINEERING WORKS;\n\n      and(ii) GJEWB;(b) an account of all receipts\n\n    and payments, dealings and transactions of Kim Tian and Mdm Ang in respect of the\n\n    businesses of:-(i) GUAN JOO ENGINEERING WORKS;\n\n      and(ii) GJEWB;(c) an inquiry as to what has\n\n    become of the property, assets and effects of:-(i) GUAN JOO ENGINEERING WORKS;\n\n      and(ii) GJEWB;(d) ….(e) an order that Kim Tian and\n\n    Mdm Ang do give Kim Chan access on demand to and a copy each of (as may be desired) all\n\n    books, vouchers and other documents in their possession or power relating to the said\n\n    accounts;(f) an order that Kim Tian and\n\n    Mdm Ang do pay Kim Chan the sum of $500,000.00 as an interim payment on account of the\n\n    sums payable in respect of the above mentioned accounts (the claim for $500,000 as an\n\n    interim payment has been reduced to $50,000) …It was not clear how far back Kim\n\nChan was seeking the accounting and inquiry to extend to.26.        Mr\n\nCheong Gay Eng, Counsel for Kim Tian, resisted the claim for an accounting and an inquiry\n\non the basis that Kim Chiew had been asked by the other partners to look at the accounts\n\nsince 1992 or 1993 and Kim Tian had acceded to this. Alternatively, if Kim Tian was\n\nrequired to account, this should be limited to no more than six years from the date of the\n\nWrit in view of s 6(2) and 2(6)(a) of the Limitation Act (Cap 163).27.        Mr\n\nCheong also relied on acquiescence and delay under s 32 of the Limitation Act. He\n\nsubmitted that it was 25 years later, i.e from 1977, when Kim Chan instituted the present\n\naction and Kim Chiew had been reviewing the accounts at the request of his father and\n\nbrothers every year. However, I note that Kim Chiew clarified in cross-examination that he\n\nreviewed the accounts from 1992 or 1993 only (NE 76). It was also Kim Chiew’s\n\nevidence that when he reviewed the Firm’s accounts in 1994 and 1995 and when the\n\nbusiness was to be transferred to the Company that he noticed that a cash balance of\n\n$200,000 had disappeared from the accounts. I will say more about this later.28.        I\n\nalso note that there was no suggestion that Kim Chan or any of the other partners had\n\nasked for an account before 1992. Even Kim Chan himself said that the first time he asked\n\nfor an account was in 1992 or 1993 (NE 14).29.        To\n\ncounter Mr Cheong’s alternative argument that any account should be restricted to no\n\nmore than six years prior to the commencement of the Writ, Mr Low relied on s 22(1) of the\n\nLimitation Act regarding an action by a beneficiary under a trust.30.        \n\nSecondly, Mr Low submitted that there had been no termination of the Partnership and that\n\nKim Tian did not say that the Partnership had been terminated and no particulars thereof\n\nhad been given. Relying on Halsbury’s Laws of England, 4thEd, Vol 28,\n\npara 699, he submitted that when an account is claimed between partners, the statute of\n\nlimitation does not run until the partnership is determined.31.        \n\nThirdly, Mr Low submitted that since Kim Tian claims that there have been payments to the\n\nother partners, time begins to run only from the date of the last payment under s 26 of\n\nthe Limitation Act. However, Mr Low did not elaborate as to when the last payment by Kim\n\nTian was and he said this was supposed to be in the knowledge of Kim Tian.32.        As\n\nfor acquiescence, Mr Low submitted that there was no acquiescence as there were quarrels\n\nbecause Kim Tian refused to give an account. He relied on the fact that there was a family\n\nmeeting in or about 1997 to resolve differences. Mr Low also submitted that acquiescence\n\nis no defence to a claim by beneficiaries for an account by trustees of trust property.33.        In\n\nmy view, Mr Low’s submissions have lumped the Partnership and the Company together.\n\nThey should be considered separately as the Company is a separate legal entity from the\n\npersons purportedly to be its shareholders.34.        As\n\nregards the Partnership, I am of the view that Kim Chan’s position cannot be better\n\nthan that of a sleeping partner whose name has been registered as a partner. What Kim Chan\n\nmay be entitled to is an account by Kim Tian of the Partnership’s assets, but the\n\nprima facie liability to account does not make Kim Tian a trustee of whatever he may be\n\nliable to pay to Kim Chan, after the taking of an account.35.        For\n\nexample, Partnership Law by Geoffrey Morse, Fifth Edition, p 134, states:‘In modern terms partners\n\n    are said to be in a fiduciary position towards each other, which is to say that, in\n\n    addition to their common law duties of care to each other, they owe each other duties as\n\n    if each were a trustee and the other partners were beneficiaries under a trust. They arenot\n\n    actual trusteesof course, although in special cases they may be, but they have\n\n    similar obligations. Sometimes such fiduciaries are described as being constructive\n\n    trustees but this may not always be accurate since it suggests that the trustee/partner is\n\n    always the legal owner of something of which the other partners are the beneficial owners\n\n    (as under a trust), whereas in reality a fiduciary liability oftenonly gives rise to a\n\n    duty to account for profits etc.made in breach of those duties. The distinction is\n\n    important - if the partner concerned becomes insolvent and he is a constructive trustee\n\n    for another his creditors will be unable to claim the relevant asset. This is not so if he\n\n    merely has a duty to account which is an equitable remedy and not a proprietary\n\n    right.’[Emphasis added.]36.        \n\nLindley & Banks on Partnership, Eighteenth Edition, p 612 and 613 states:‘Account normally required\n\n    between partnersIt is a well recognised rule\n\n    that, whenever money allegedly belonging or owing to the firm in respect of a partnership\n\n    transaction is sought to be recovered from a partner, an action for an account is\n\n    required, unless an account has already been taken between the partners or, exceptionally,\n\n    taking an account would serve no useful purpose. In such an action, it will, of course, be\n\n    open to the defendant partner to show that the money is his or even that a larger sum is\n\n    due to him.Where, on the other hand, a claim\n\n    is made by one partner against another in some other capacity, e.g. as trustee, this\n\n    principle may not apply. Such was the position inHurst v. Benneth. There,\n\n    following a dissolution, four partners who were trustees of the firm’s lease sought\n\n    to enforce an express indemnity against one of the other partners (H) by means of a\n\n    statutory demand. An attempt to have the statutory declaration set aside on the basis that\n\n    money might be due to H on the taking of dissolution accounts was rejected.’37.        \n\nTherefore, it is not sufficient for Kim Chan to assert that Kim Tian is a trustee of Kim\n\nChan’s share in the partnership. In my view, the prima facie liability of Kim Tian is\n\nto account but not as a trustee. Following from this, it seems to me that the applicable\n\nprovision regarding limitation is s 6(2) of the Limitation Act and not s 22(1). Secondly,\n\nI do not agree with Mr Low that there had been no termination of the Partnership. True,\n\nthere was no formal termination of the Partnership but, in my view, that was not\n\nnecessary. All the partners must have known about the incorporation of GJEWB and the\n\ntransfer of the business from the Partnership to GJEWB as this was done openly, and\n\nindeed, on the advice of Kim Chiew as I have mentioned. In my view, the Partnership had\n\neffectively ceased or had been effectively terminated in April 1996. Thirdly, as regards\n\npayments to other ‘partners’, I am of the view that Kim Chan’s case on\n\nlimitation is not better just because the payments were continued. The Partnership had\n\nceased and other payments were made from the monies or profits of the Company, not the\n\nPartnership. Even if I were wrong about the application of s 6(2), s 32 of the Limitation\n\nAct preserves the court’s equitable jurisdiction to refuse relief on the ground of\n\nacquiescence, laches or otherwise. For convenience, I set out the provisions which are s\n\n6(2), s 22(1) and s 32:Section 6(2)‘(2) An action for an\n\n    account should not be brought in respect of any matter which arose more than 6 years\n\n    before the commencement of the action.’Section 22(1)‘22. (1) No period of\n\n    limitation prescribed by this Act shall apply to an action by a beneficiary under a trust,\n\n    being an action -(a) in respect of any fraud or\n\n      fraudulent breach of trust to which the trustee was a party or privy; or(b) to recover from the trustee\n\n      trust property or the proceeds thereof in the possession of the trustee, or previously\n\n      received by the trustee and converted to his use.’Section 32‘32.Nothing in this\n\n    Actshall affect any equitable jurisdiction to refuse relief on the ground of\n\n    acquiescence, laches or otherwise.’[Emphasis added.]38.        As\n\nfor acquiescence, I do not accept Mr Low’s argument that acquiescence is no defence\n\nto a claim by beneficiaries for an account by trustees. It can be a defence, just as delay\n\nwith knowledge or laches can be a defence. Mr Cheong relied on a few cases regarding\n\nacquiescence or delay but I need refer only to one i.eIn re Jarvis, Decd. Edge v\n\nJarvis[1958] 1 WLR 815.39.        In\n\nthat case, a testator by his will appointed his daughters E and J, the plaintiff and the\n\ndefendant respectively, to be his executors and trustees, and gave them his business as a\n\ntobacconist, confectioner and newsagent at No 7 W. Road. The Will provided that the gift\n\nof the business was subject to the payment by E and J of annuities to the testator’s\n\nwife and, on her death, to another of his daughters. The will did not give any power to\n\nthe executors to carry on the business. I now quote from the rest of the headnotes:‘At the date of his death,\n\n    on September 17, 1941, the testator was in occupation for a term of three years expiring\n\n    on March 25, 1944, at a rent of 70 per annum. The premises had been badly damaged by\n\n    enemy bombing in 1940 and virtually no business was carried on until they were completely\n\n    restored in 1944. The plaintiff took little part in the administration of the estate, but\n\n    the defendant paid the business debts out of her own pocket as far as necessary, the\n\n    business being insolvent at the date of the testator’s death and the debts exceeding\n\n    the assets by about 350. The defendant had her own business of a similar nature at No.\n\n    230, T. Road, which was nearby. The landlords of No. 7, W. Road sued the plaintiff and the\n\n    defendant for arrears of rent and possession and obtained judgment by default in 1943. The\n\n    defendant paid off the judgment debt by instalments. In May, 1994, the landlords granted\n\n    her a new tenancy on substantially the same terms as the testator’s tenancy, and she\n\n    ran the business jointly with that at No. 230, T. Road. In April, 1951, the plaintiff\n\n    issued a writ claiming an account in respect of the defendant’s occupation of No. 7,\n\n    W. Road, and of the profits of the business carried on there. The defendant conceded that\n\n    she was a constructive trustee of the leasehold interest for herself and the plaintiff in\n\n    equal shares but argued that the plaintiff’s claim was barred by her laches,\n\n    acquiescence and delay:-Held, (1) that the plaintiff was\n\n    entitled, in spite of her delay, to an inquiry as to what rent, if any, the defendant\n\n    ought to be charged year by year in respect of her beneficial occupation of No. 7, W.\n\n    Road.(2) That, subject to laches, the\n\n    defendant was accountable as a constructive trustee for the business and its profits\n\n    subject to all just allowances for her own time, energy and skill, for the assets she had\n\n    contributed, the testator’s debts she had paid and for her mother’s annuity.(3) But that the plaintiff was\n\n    barred by laches from relief on the claim to the business, since, although she was fully\n\n    aware of her rights, she took no step to assert them until the issue of the writ in 1951,\n\n    and the principles applicable were quite different from those applicable in the case of a\n\n    specific asset, such as a lease.’40.        At\n\np 820 and 821, Upjohn J said:‘Then as to laches,\n\n    acquiescence and delay for six years before the issue of the writ, the plaintiff has stood\n\n    by and observed her sister running the business, incurring debts and liabilities, paying\n\n    her mother 10 a month, and in 1948 transferring assets and business from No. 230,\n\n    Trafalgar Road to No. 7, Woolwich Road. In that connexion, it is, of course, a remarkable\n\n    circumstance, strongly relied on by the plaintiff, that the last transfer of assets took\n\n    place after the issue and service of the writ. The defendant’s venture at No. 7,\n\n    Woolwich Road has in fact proved remarkably successful. Until the issue of the writ in\n\n    1951, the plaintiff, I am satisfied, made no claim whatever but was paid a weekly wage as\n\n    a counter assistant at No. 230, Trafalgar Road. It is possible that she took some small\n\n    part in the administration of No. 7, Woolwich Road by helping with the accounts, but that\n\n    was a very small matter. Furthermore, although permitting her sister and Edge to reside at\n\n    No. 230, Trafalgar Road may be attributed to sisterly love on the part of the defendant,\n\n    it is in my judgment a circumstance which I ought to bring into the scales that the\n\n    defendant permitted the plaintiff to open her own business at No. 230. All this time the\n\n    plaintiff was fully aware of her rights but took, I am fully satisfied on the evidence, no\n\n    step to assert them or to claim at all until the issue of the writ.….The plaintiff is seeking to say\n\n    that the defendant has been a trustee for her of one moiety of this highly successful\n\n    business, although she has never been at risk for one penny. I have been referred to a\n\n    number of textbooks and authorities on this question of laches, acquiescence and delay,\n\n    but I forbear from referring to them, for in this realm of law each case depends so much\n\n    on its own facts that the citation of other cases having some points of similarity and\n\n    some of difference does not really assist. I do not overlook the circumstance that the\n\n    plaintiff has said she could not afford a solicitor; but I have to try to do justice to\n\n    both sides. In my judgment, on the whole of the circumstances of this case, in relation to\n\n    the business the plaintiff by waiting until 1951, has not been sufficiently prompt in\n\n    seeking her remedy, and this part of the action fails.’41.        In\n\nthe case before me, Kim Chan knew that Kim Tian had been managing the business of the\n\nPartnership. Indeed Kim Chan himself was working for the business since 1991 until 1999.\n\nHe had received remuneration. He was provided with a car and then a replacement car. I\n\nfind that he knew that Kim Tian had provided himself a better or more valuable car. He\n\nalso knew that various personal expenses of the partners were paid from monies of the\n\nbusiness, advances were given to various partners from time to time and his father was\n\nreceiving monies from the business on a monthly basis, although Kim Chan probably did not\n\nknow all the details. Kim Chan did not complain or ask for an account until 1992 or 1993\n\nor so he says. What he, and the others did, was to ask Kim Chiew to review the accounts\n\nfor them from 1992 or 1993 and even after GJEWB was incorporated. Kim Chan did not take\n\nany action until after his services were terminated in 1999.42.        As\n\nfor Kim Chiew’s review of accounts, there was no evidence as to how much time he had\n\nspent or the details he had gone into, if at all. I am of the view that it was probably a\n\nsimple exercise which might pick up a deficiency which was obvious but not if it was\n\notherwise. I do not think it constituted a settled account as between the partners such as\n\nto preclude Kim Chan from seeking an accounting at all.43.        \n\nLindley & Banks on Partnership, Eighteenth Edition, p 626 states:‘Nature of settled accountAn account which has been agreed\n\n    between the partners, conventionally referred to as a \"settled account\" or, more\n\n    inaccurately, as an \"account stated,\", naturally constitutes a good defence to\n\n    an action seeking a further account of any transactions or dealings covered thereby. Lord\n\n    Lindley summarised the requirements for a settled account as follows:\"No precise form is\n\n      necessary to constitute a stated and settled account; but an account stated, unless it be\n\n      in writing, is no defence to an action for a further account. It is not, however,\n\n      necessary that the account should be signed by the parties, if it can be shown to have\n\n      been acquiesced in by them; and an account may be stated and settled, although a few\n\n      doubtful items are omitted.\"However, merely rendering an\n\n    account is clearly not sufficient to deprive the claimant of his right to have the same\n\n    account taken under the direction of the court: he must be shown both to have received and\n\n    acquiesced in the account. Moreover, such acquiescence must relate not only to the\n\n    principles on which the account was prepared, but also to be items included in it.’44.        \n\nBesides, Kim Tian’s Amended Defence did not plead that Kim Chan was precluded from\n\nseeking an account because Kim Chiew had been reviewing the accounts. On the contrary,\n\nparagraph 12(2) of his Amended Defence pleads that at no time did the others request for\n\nan account.45.        I\n\nhave mentioned above Kim Chan’s evidence that when he reviewed the Partnership\n\naccounts in 1994 and 1995 and when the business was to be transferred to the Company, he\n\nnoticed that a cash balance of $200,000 had disappeared from the accounts. I would add\n\nthat in Kim Chiew’s AEIC, he also said that he asked Kim Tian of the whereabouts of\n\nthe $200,000 but did not receive any reply. He said he warned Kim Tian that he would be\n\nheld liable and responsible for the $200,000. In cross-examination, he elaborated at NE\n\n81:‘Q Put: Your AEIC para 9.\n\n    You did not say this.A Disagree. Because of this\n\n    accounting problem, I had a heated argument with Kim Tian in his office. His eldest son\n\n    was also present as he was helping out in the office then. Kim Tian was so heated up and\n\n    it looked like he wanted to fight with me. His son had to calm him down. With the loud\n\n    noise caused by Kim Tian banging on the table, Kim Ann who was working downstairs in the\n\n    factory heard the noise and came upstairs to check whether we were fighting or not.’46.        Mr\n\nCheong sought to persuade me that I should not accept Kim Chiew’s evidence about the\n\nmissing $200,000. Mr Cheong’s first point was that there was a discrepancy in Kim\n\nChiew’s evidence because in Kim Chiew’s AEIC, he had said that he had learned\n\nabout the missing $200,000afterthe Partnership was converted into a company but\n\nin cross-examination, his evidence was that he noticed this when he went to an\n\naccountant’s office with Kim Tianbeforethe Company was incorporated and Kim\n\nTian was presenting the accounts of the Partnership to a new accountant.47.        Mr\n\nCheong’s second point was that Kim Chiew’s evidence was that the document from\n\nwhich he saw the $200,000 cash balance was prepared by an accountant by the name of Kim\n\nSeng. However, the Partnership was registered as a GST business in 1994 and the accountant\n\nhad been changed since then as Kim Seng was not qualified to do accounts for GST\n\nregistered businesses. So, according to Mr Cheong, it could not be Kim Seng who had\n\nprepared the Partnership accounts from which Kim Chiew allegedly noticed the $200,000 cash\n\nbalance.48.        Mr\n\nCheong’s third point was that Ms Toh Chwee Kian, who was in charge of the accounts of\n\nthe Partnership, did not corroborate Kim Chiew’s evidence in that she did not assert\n\nthat there had been a cash balance of $200,000.49.        Mr\n\nCheong’s fourth point was that there was no documentary evidence of the $200,000\n\nwhich supposedly went missing.50.        In\n\nmy view, the discrepancy in Kim Chiew’s evidence as to when he noticed the $200,000\n\nbalance was missing is not material bearing in mind that the event occurred several years\n\nago and Kim Chiew is not involved in the business.51.        As\n\nregards the question of who prepared the document from which Kim Chiew first noticed a\n\ncash balance of $200,000, Kim Chiew believed it was prepared by Kim Seng but admitted\n\ncandidly that he was not sure whether it was Kim Seng. In my view, the real question is\n\nwhether Kim Chiew did see a cash balance of $200,000 in the accounts of the Partnership\n\nwhen he was reviewing them, irrespective of which accountant or book-keeper prepared the\n\naccounts. If he did see that cash balance, Kim Tian cannot disavow the accounts reviewed\n\nby Kim Chiew as it was Kim Tian who allowed Kim Chiew to review the accounts. In my view,\n\nKim Chiew was the most objective witness before me. Not only is he a neutral party whom\n\neveryone else in the family would otherwise trust, his demeanour and the substance of his\n\nevidence on the whole showed that he was sincere and was not given to making such an\n\nimportant assertion lightly. True, he did also make mistakes in some other parts of his\n\nevidence but he did not hesitate to accept the truth when the mistakes were pointed out to\n\nhim. However, he was certain about the existence of the $200,000 cash balance from one set\n\nof accounts which item went missing when he reviewed another set of accounts. I see no\n\nreason to reject Kim Chiew’s evidence on this point.52.        The\n\nfact that Ms Toh Chwee Kian did not notice a cash balance of $200,000 is neither here nor\n\nthere. She was only a general clerk for the Partnership and later the Company. Her duties\n\nincluded recording of all sales, whether cash or credit. However, she would make a record\n\nbased on invoices passed to her by Kim Tian. As she herself said in her AEIC, if no\n\ninvoice was rendered for a transaction, she would not be aware of the transaction. It is\n\nclear to me that she is not privy to all the transactions or all the financial details of\n\nthe Partnership or the Company. For example, she does not know the true extent of the\n\nrevenue and expenses and hence the profit or the cash balances from time to time.53.        As\n\nfor the absence of documentary evidence regarding the $200,000 cash balance, it is not\n\nsurprising that Kim Chiew could not produce any documentary evidence as Kim Tian is the\n\none who controls access to documents. Now that there is litigation, Kim Tian is not going\n\nto produce a document which will prove wrongdoing on his part.54.        I\n\nfind that the Partnership had a cash balance of $200,000 but this went missing before the\n\nPartnership was converted to the Company. This brings me to another point. Kim Chan\n\nalleged that Kim Tian had not accounted for the profits from the sale of scrap metal. Kim\n\nTian did not dispute that there were such sales but he denied they were of the magnitude\n\nsuggested by Kim Chan. Kim Tian alleged that such sales should have been recorded but\n\n‘there must be times that some of these were not recorded unintentionally’ (see\n\nhis AEIC at para 13).55.        \n\nAccording to Chwee Kian, the accounting records which were produced to her did not reveal\n\nall the sales. She said she had seen a small notebook with ‘555’ written on it\n\nin which the cash sale of scrap metal was recorded (NE 70 and 71). In response during the\n\ntrial, Kim Tian produced some notebooks with ‘555’ on them but these notebooks\n\ncontain entries of a different nature, like advances to various persons. They did not have\n\nany entry of cash sales of scrap metal. Moreover, Kim Tian did not elaborate as to where\n\nthe notebooks or other source documents of such sales were kept or how one could try and\n\nmatch the sales recorded in the books or other source documents with those recorded in the\n\nformal accounting records of the Partnership or vice versa.56.        Kim\n\nTian had also said in cross-examination that cash had been deposited into the bank account\n\nof the business but later retracted his evidence when a bank statement of account for 1996\n\nshowed no evidence of any cash deposit (NE 96). In my view, whether the cash derived from\n\nthe sale of scrap metal or other activities of the business make up the $200,000 and\n\nwhether there is some more cash unaccounted for is a matter which is within Kim\n\nTian’s knowledge but not in the knowledge of the other partners or Kim Chiew.57.        In\n\nthe circumstances, I will order Kim Tian to account for all the assets of the Partnership\n\nfrom 31 January 1996. This will be within six years prior to the filing of the Writ on 31\n\nJanuary 2002 and, even if s 6(2) of the Limitation Act does not apply, I am not prepared\n\nto order the accounting period to be extended to any period before 31 January 1996 in view\n\nof laches on the part of Kim Chan. However, the $200,000 cash balance is to be deemed to\n\nbe part of the assets of the Partnership as at 31 January 1996. There will also be an\n\ninquiry as to what has become of such assets. I will also order Kim Tian to pay Kim Chan\n\n20% of the assets so accounted unless the inquiry concludes that the assets have been\n\ntransferred to GJEWB or given to any of the partners other than Kim Tian or have been\n\nreasonably used to pay Kim Tian in view of the time he spent in managing the Partnership.\n\nTo the extent that they have been so transferred or given to other partners or have been\n\nreasonably used to pay Kim Tian, Kim Tian need not pay Kim Chan 20% thereof, but the\n\nburden of establishing any of these qualifications is on Kim Tian. The accounting is to be\n\ntaken before and the inquiry is to be undertaken by the Registrar of the Supreme Court who\n\nshall make such directions and orders as he thinks fit, including orders in respect of\n\ninterest and costs of the accounting and inquiry.58.        I\n\nnow come to the question of an accounting in respect of GJEWB. I am of the view that Kim\n\nChan’s rights as an unregistered shareholder cannot be better than those of a\n\nregistered shareholder. Had he been a registered shareholder, he would not be entitled to\n\nan accounting or be entitled to be given access to accounting records and supporting\n\ndocuments other than the usual financial statements required by law, although it may be\n\nsensible for Kim Tian to allow such access in view of the background leading to the\n\nbusiness being transferred to the Company. If Kim Chan is pursuing an action for\n\noppression and/or unfair discrimination under s 216(1)(a) and/or (b) of the Companies Act\n\nor an action to wind up GJEWB on the ground that it is just and equitable to do so under s\n\n254(1)(i) of the Companies Act or under some other relevant ground, he may then apply to\n\ncourt for an accounting or access to accounting records and supporting documents and at\n\nthat time the court will decide whether to grant his application. I need not decide\n\nwhether Kim Chan must be a registered shareholder before he is entitled to pursue such\n\nactions because, at present, he is not pursuing such actions.59.        \n\nAside from any of the actions I have mentioned, Kim Tian owes a duty to act in good faith\n\nand a duty of care to GJEWB but not to Kim Chan. As Mr Cheong has rightly pointed out, it\n\nis GJEWB, and not Kim Chan, who is entitled to take any action against Kim Tian for any\n\ndefault of his vis--vis GJEWB.60.        \n\nLikewise, as a shareholder, whether registered or not, Kim Chan is not entitled to be paid\n\n20% of the profits or the assets of GJEWB, unless the Company is wound up. For example, it\n\nis for the directors to decide how much of the profits is to be distributed to the\n\nshareholders by dividends. As I have mentioned, there was no agreement to make Kim Chan a\n\ndirector. In the absence of an agreement, a shareholder has no right to be appointed as a\n\ndirector of a company. Whether the failure to appoint Kim Chan as a director is an\n\noppressive act in the light of the background leading to the incorporation of the Company\n\nis a matter I need not go into at present.61.        In\n\nthe circumstances, I will also not direct Kim Tian, or GJEWB to make Kim Chan or Kim Yock\n\nco-signatories of the cheques of the Company or injunct Kim Tian from disposing of or\n\ndealing with the assets of GJEWB as was suggested under Section A of Mr Low’s closing\n\nsubmission (it is not clear whether these were the consequential orders sought under\n\nSection F of Mr Low’s closing submission in the context of protecting the interest of\n\nother partners and Kim Chan). Should Kim Tian be minded to act in a manner contrary to\n\nhis, and Mdm Ang’s duty, to the Company, he, and Mdm Ang, will have a civil liability\n\nand, perhaps a criminal one as well. On the other hand, if Kim Chan is still concerned\n\nabout wrongdoing by Kim Tian, then Kim Chan and his solicitors should get their act\n\ntogether and focus on the correct steps to be taken to protect Kim Chan’s interest.",
        "Claim for an order for access to\n\nbe given to Kim Chan to all books, vouchers and documents": "62.        In\n\nthe light of the orders that I will be making, as stated above, I will also be ordering\n\nKim Tian to give Kim Chan and any accountant appointed by him access to all accounting\n\nrecords and supporting documents and to allow them to make copies or provide copies to\n\nthem upon reasonable copying charges being paid, subject to the cut-off date I have\n\nmentioned. Kim Tian is also to give such consent as may be required by any auditor and/or\n\naccountant and/or book-keeper of the Partnership to divulge information or disclose\n\ndocuments to Kim Chan and his accountant as may be reasonably required for the purpose\n\nstated above.",
        "Claim for an order for interim\n\npayment of $50,000 to Kim Chan": "63.        I\n\nam of the view that it is pre-mature to make an order for interim payment to Kim Chan.",
        "Claim for an order that Kim Tian\n\nand Mdm Ang do pay Kim Chan CPF": "64.        As\n\nregards the Partnership and the Company, I am of the view that Kim Chan was really an\n\nemployee and not a sub-contractor, as alleged by Kim Tian. However, I am also satisfied\n\nfrom the evidence before me that Kim Chan had agreed to receiving and did receive cash in\n\nlieu of the employer’s CPF contributions and there was no deduction from his salary\n\nfor the employee’s portion of CPF contribution. For example, Exhibits P2 and P3 are\n\nenvelopes which contain cash received by Kim Chan. There are figures written on each\n\nenvelope. For Exhibit P2, the envelopes have a figure for CPF. For Exhibit P3, the\n\nenvelopes do not have the word ‘CPF’, but Kim Chan nevertheless admitted that\n\nthe payment he received, included CPF (NE 35). Although this payment arrangement is\n\ncontrary to the law, Kim Chan should not be allowed the relief he seeks in respect of\n\nemployer’s CPF contribution since he was, as I find, a willing party to it. I also\n\nnote that he did not offer to return the cash he had received that was in lieu of the\n\nemployer’s and employee’s contribution.65.        \n\nBesides, any payment of CPF contribution is to be made by the Partnership or the Company,\n\nas the case may be. It is not the personal liability of the person managing the business.\n\nWhether the manager is in breach of his duty of care is another matter. I would add that\n\nnothing I say here is to affect the right of the relevant statutory authority to act under\n\nthe relevant law.",
        "Claim for an order that Kim Tian\n\nand Mdm Ang purchase Kim Chan’s 20% share in the Partnership and GJEWB": "66.        As\n\nI have mentioned, the business of the Partnership has been taken over by the Company.\n\nSince Kim Chan is not pursuing an action under s 216 Companies Act, I do not have any\n\njurisdiction to compel Kim Tian or Mdm Ang to buy Kim Chan’s 20% stake in GJEWB. The\n\ncase ofYeo Hung Khiang v Dickson Investment (Singapore) Pte Ltd and Ors[1999] 2 SLR 129, which Mr Low relied on, is based on oppression. Although Kim Tian had indicated a\n\nwillingness to buy Kim Chan’s stake, I note that this was to be based on a valuation\n\nof certain physical assets which valuation Kim Tian had obtained and, as regards the rest\n\nof the assets, it seemed that Kim Tian did not want any investigative audit and the\n\nfigures in the accounting records of GJEWB were to be accepted at face value. Kim Chan has\n\nnot accepted that suggestion.67.        \n\nHowever, I will make an order that Kim Tian is to transfer or cause to be transferred to\n\nKim Chan 20% of the issued shares of GJEWB, with the transfer expenses including any\n\nvaluation for stamp duty and the stamp duty itself being paid by Kim Chan. The transfer is\n\nto be effected within 14 days of a notice from Kim Chan (or his solicitors) to Kim Tian\n\n(or his solicitors) that Kim Chan wishes to have the shares transferred to him or such\n\nother extended time as Kim Chan (or his solicitors) may agree to in writing. Kim Tian is\n\nthen also to take all necessary steps to procure the issuance of a share certificate or\n\ncertificates to Kim Chan for his shares and to ensure that he is registered as a\n\nshareholder of GJEWB for his shares in the share register of GJEWB.",
        "Summary": "68.        In\n\nthe circumstances:(a) I declare that Kim Tian holds\n\n    Kim Chan’s 20% share in Guan Joo Engineering Works in trust for Kim Chan.(b) I order Kim Tian to give an\n\n    accounting and there is to be an inquiry as stated in paragraph 57 above.(c) I order that Kim Tian is to\n\n    give access to documents and to give his consent as stated in paragraph 62 above.(d) I order Kim Tian to transfer\n\n    or cause to be transferred to Kim Chan 20% of the issued shares of GJEWB on the terms\n\n    stated in paragraph 67 above.(e) Liberty to apply.69.        The\n\nclaims against Mdm Ang Kiang Hua are dismissed. I make no order against GJEWB. I will hear\n\nthe parties on costs of the action.Sgd:WOO BIH LIJUDICIALCOMMISSIONERSINGAPORECopyright © Government of Singapore."
    }
}