{
    "case_title": "Mcconnell Dowell Constructors (Aust) Pty Ltd v Sembcorp Engineers and Constructors Pte Ltd (formerly known as SembCorp Construction Pte Ltd)",
    "ncitation": "[2002] SGHC 8",
    "coram": "Woo Bih Li JC",
    "sections": {
        "The Bank Guarantee": "16.    The bank guarantee that McConnell had procured was dated 5\n\nJanuary 2001 and was issued by Australia and New Zealand Banking Group Limited. In this\n\nbank guarantee (‘BG’), SE was referred to as ‘the Principal’ and\n\nMcConnell was referred to as ‘the Customer’. The material terms of the BG\n\nstated:‘Australia and New Zealand Banking Group Limited (the Bank) asks\n\n  the Principal to accept this Undertaking in connection with the exclusive subcontract\n\n  pre-bid agreement dated 16 December 2000 between the Principal and Customer:-for the design and construction of the gas pipeline for I.G.L\n\n  Manappad Port, LNG re-gas import terminal and gas pipeline project, Manappad, India.In consideration of the Principal accepting this Undertaking, the\n\n  Bank undertakes unconditionally to pay the Principal on written demand from time to time\n\n  any sum or sums to an aggregate amount not exceeding USD625,000.00 (United States Dollars\n\n  Six Hundred and Twenty-Five Thousand Only).The Bank will pay this amount or any parts of it to the Principal on\n\n  demand without reference to the Customer and even if the Customer has given the Bank\n\n  notice not to pay the money, and without regard to the performance or non-performance of\n\n  the Customer or Principal under the terms of the contract or agreement.Any alteration to the terms of the contract or agreement or any\n\n  extensions of time or any other forbearance by the Principal or Customer will not impair\n\n  or discharge the Bank’s liability under the undertaking.’",
        "McConnell’s contentions": "17.    McConnell relied primarily on unconscionability. Mr Kenny Chooi,\n\nCounsel for McConnell, submitted that although the BG appeared to be payable on demand, it\n\nwas not an on-demand guarantee.18.    He referred to an e-mail dated 4 December 2000 from Mr Ho of SE\n\nto Alan Black of CBI and Mark Twycross of McConnell. It stated:‘Subject: Pre-Bid Agreement & Bank Guarantee Drafts….Dear Alan & Mark,I am pleased to enclose herewith the drafts of the above-mentioned\n\n  documents for your review.Pse let me try to capture the spirit of the revision. We are all\n\n  agreeable that if FICON fails to deliver USD158m by 31 Mar 2001, CBI and MacDow will pay\n\n  SCC USD625,000 each in cash. These are made very clear in the proposed Pre-bid agreement.\n\n  To ensure that the payments of USD625,000 are made, SCC needs some form of guarantees and\n\n  this is provided by BG from banks of CBI and MacDow.The condition for calling on the\n\n  BG is written in the Pre-Bid agreement but not in the BG.This is not unlike a contractor’s performance bond to a client.\n\n  The contractor’s bank issues a guarantee to the client and if for some reason the\n\n  contractor fails to perform, the client calls on the BG unconditionally. Any dispute will\n\n  have to be settled based on the construction contract.Pse note that we are proposing it in this manner so that the BG makes\n\n  legal sense. We have not deviated from the original understanding.….’[Mr Chooi’s emphasis.]19.    Mr Chooi also referred to another e-mail. This was dated 12\n\nDecember 2000 and was from Mr Twycross to Mr Ho. It said:‘KK,McConnell Dowell have had extensive discussions, internally and with\n\n  CBI, regarding the agreement to an exclusive subcontract for the pipeline portion of the\n\n  Manappad IGL project.We attach an Agreement between SCC and McConnell Dowell which we\n\n  consider truly reflects the intent and actions of each party.These issues are;1) The bank guarantee is to act as surety for the costs involved with\n\n  the non performance of the Funder, not because of actions by SCC or IGL to frustrate the\n\n  signing of a contract.….’20.    Mr Chooi then referred to McConnell’s PBA. He submitted that\n\nMcConnell’s obligation to pay US$625,000 was premised on there being in the first\n\nplace a funding agreement between SE and Ficon. He described that premise as a condition\n\nprecedent to the parties entering into the PBA. A call on the BG could only be made if\n\nFicon breached that funding agreement.21.    According to Mr Twycross, Mr Ho had represented to him that SE\n\nand Ficon had reached such an agreement. Mr Twycross was relying, inter alia, on:(a) an e-mail dated 20 November 2000 from Mr Ho to him. The material\n\n  portion reads, ‘On the separate issue of project funding, Sembcorp has arrived at an\n\n  arrangement with FICON and Mohan’,(b) an e-mail dated 30 November 2000 from Mr Ho to him, stating, at the\n\n  bottom thereof, ‘As you are aware, we have cleared with FICON all the\n\n  paperwork’.22.    Mr Twycross rejected Mr Ho’s explanation (in Mr Ho’s\n\naffidavit) that he was referring to the oral agreement of 4 or 5 November 2000 between SE\n\nand Ficon and not a written one.23.    Mr Chooi then went through various e-mail between Ficon and SE\n\nafter 5 November 2000 to demonstrate that there was no agreement on 4 or 5 November 2000\n\nbetween Ficon and SE because these parties were still negotiating on the terms of the\n\nagreement.24.    He also stressed that at no time in this subsequent e-mail did SE\n\nsay to Ficon that there was already an agreement between them. For example, in an e-mail\n\ndated 7 November 2000, Mr Ho was thanking Ficon for draft documents when they contained\n\nterms which were repugnant to the oral agreement. Mr Ho’s excuse was that he had sent\n\nthe e-mail without reading the drafts.25.    To reinforce his argument that the parties entered into the PBA\n\non the premise of a binding agreement between SE and Ficon, Mr Chooi relied on certain\n\nprovisions in the PBA dated 16 December 2000: clauses 2.1, 2.2, 2.3, 2.4 and 3.1b.26.    These provisions stated:‘2.0 Financing, Deposit and Expenses2.1 The Sub-Contract Tenderer acknowledges that the Funder has\n\n  committed or shall be committing to make payment of funds according to a payment schedule\n\n  (the \"Payment Schedule\") and other terms of payment as may be agreed under an\n\n  agreement between Sembcorp and other parties with the Funder in respect of such financing.2.2 In the event that the Funder fails to make payments amounting to an\n\n  aggregate of US$158,000,000.00 into the Project Escrow Account (as defined in the\n\n  agreement referred to in Clause 2.1) by 31 March 2001, the Sub-Contract Tenderer shall, in\n\n  consideration of Sembcorp inviting it to submit the Sub-Contract Tender and considering\n\n  the Sub-Contract Tender, pay to Sembcorp within 24 hours of such failure a non-refundable\n\n  deposit of US$625,000.00 (six hundred and twenty five thousand US Dollars) by cash into\n\n  such bank account as may be notified in writing by Sembcorp to the Sub-Contract Tenderer.\n\n  Provided that in the event that the said amount of US$158,000,000.00 is partially paid by\n\n  the said date, the said deposit of US$625,000.00 shall be reduced in the proportion which\n\n  the amount paid bears to the full amount of US$158,000,000.00. The Sub-Contract Tenderer\n\n  shall forthwith upon execution of this Agreement provide Sembcorp with a bank guarantee in\n\n  the form attached at the Appendix hereto issued by a bank located in Singapore which is\n\n  acceptable to Sembcorp.2.3 If the Funder fails in his obligation as per Clause 2.2 above and\n\n  Sembcorp calls for the deposit under the guarantee, the said deposit shall belong\n\n  absolutely to Sembcorp.2.4 If the Funder has fully funded his obligations under clause 2.2\n\n  above, no call can be made under the guarantee.2.5 ….2.6 ….2.7 ….3.0 Determination of Pre-Bid Agreement3.1 Save for clause 5 this Agreement shall terminate on the first to\n\n  occur of:-a) ….b) a breach by the Funder to pay the funds in accordance with the\n\n  payment schedule and other terms of payment as may be agreed between Sembcorp and other\n\n  parties with the Funder, as referred to in clause 2.1 above; andc) …. ’27    Although the Funder was not identified in the PBA, it was\n\ncommon ground that Ficon was the Funder. Mr Chooi submitted that the reference in clause\n\n2.3 to the Funder failing in its obligations must mean that there was a binding agreement\n\nwith Ficon in the first place otherwise no obligation could arise which would entail a\n\nfailure thereof. Likewise for clause 2.4 which referred to the Funder’s obligations\n\nand clause 3.1b which referred to a breach by the Funder. He submitted that a payment\n\nschedule of the Funder’s obligations and other terms which were to be agreed were\n\nless material.28.    Mr Chooi also pointed out that Mr Ho of SE had admitted in an\n\naffidavit that the ‘agreement’ referred to in clause 2.1 was an existing binding\n\nagreement, although Mr Ho had said it was the oral one on 4 or 5 November 2000.29.    To augment his argument about misrepresentation from Mr Ho, Mr\n\nChooi submitted that Recital 2 of the PBA mentioned that SE was in the course of preparing\n\na tender but in fact SE had already been awarded the main contract on 8 December 2000 by\n\nIGL’s letter dated 8 December 2000. This was not disclosed to McConnell when it\n\nsigned the PBA.30.    Lastly, Mr Chooi submitted that there was no evidence of\n\nSE’s loss as a result of Ficon not obtaining the funds envisaged. To reinforce this\n\npoint, Mr Chooi pointed out that Mr Mohan (of IGL) had sent an e-mail dated 2 April 2001\n\nto Mr Ho to say that all costs incurred by the parties with respect to Ficon’s\n\nfunding plan may be charged to the project.",
        "SE’s contentions": "31.    Mr Quentin Loh SC, for SE, submitted that the BG\n\nwas clearly payable on demand.32.    As for the alleged misrepresentation about a binding agreement\n\nbetween SE and Ficon, Mr Loh pointed out that Mr Twycross’ second affidavit had\n\nemphasized that McConnell had been misled into thinking that there was a binding written\n\nagreement between SE and Ficon, and not just an oral one (see paras 17, 18(e), (g), 19,\n\n26(h), 28(E)(a), 60, 63 of that affidavit).33.    Mr Loh submitted that there was no representation about a binding\n\nwritten agreement. For example, clause 2.1 of the PBA used words like, ‘has committed\n\nor shall be committing … and other terms of payment as may be agreed …’.\n\nThe PBA had been drafted by McConnell, perhaps with the help of its in-house counsel.34.    As for the oral agreement alleged by Mr Ho to have been reached\n\non 4 or 5 November 2000 and the e-mail subsequent thereto, Mr Loh submitted that the\n\nsubsequent e-mail showed that SE had rejected Ficon’s attempts to vary the oral\n\nagreement.35.    Mr Loh also submitted that the other intended exclusive\n\nsub-contractor, CBI, had no complaints about the alleged premise or misrepresentation. He\n\ninformed me that CBI had paid the US$625,000 and this was not disputed by Mr Chooi. Also,\n\nAlan Black of CBI had executed an affidavit for SE.36.    Mr Loh submitted that if there had indeed been a\n\nmisrepresentation about a binding written agreement and if Mr Twycross had indeed been\n\nshocked to learn about the misrepresentation in a subsequent meeting on 19 March 2001,\n\nwhen the parties realised that the funds to be obtained by Ficon was not forthcoming, then\n\nMr Twycross would surely have mentioned this in his subsequent e-mail to Mr Ho when CBI,\n\nMcConnell and SE were discussing the extension of the respective bank guarantees during\n\nthat time.37.    However, nothing of the sort was mentioned in the next e-mail\n\nfrom Mr Twycross to Mr Ho dated 26 March 2001 or in another dated 27 March 2001. The\n\nallegation of a misrepresentation was made for the first time only in an e-mail from Mr\n\nTwycross dated 28 March 2001.38.    As for the alleged non-disclosure about the award of the main\n\ncontract by IGL to SE, Mr Loh said that although IGL’s letter dated 8 December 2000\n\nstated that the award was unconditional, it also stated that, ‘The terms and\n\nconditions of the EPC Contract with technology and detailed specifications shall be\n\nfinalised upon signing of the EPC Contract’. The EPC Contract was the intended main\n\ncontract for engineering, procurement and construction and there were still terms and\n\nspecifications to be agreed.39.    Mr Loh also submitted that the existence of a written binding\n\nagreement between SE and Ficon was not as crucial as McConnell was alleging because it\n\nnever once asked to have sight of the same or for a copy.40.    As for SE’s loss, Mr Loh submitted that I should take\n\njudicial notice that banks would impose a penalty for pre-mature termination of a fixed\n\ndeposit. In any event, the US$625,000 from McConnell was a pre-determined sum for\n\nSE’s damages or loss in having to provide the US$125m. There was therefore no\n\nnecessity for SE to establish its actual loss.41.    As for Mr Mohan’s e-mail dated 2 April 2001 that all costs\n\nincurred by the parties with respect to Ficon’s funding plan may be charged to the\n\nproject, Mr Loh submitted that IGL had no money. That is why it required 100% financing.42.    Mr Loh did not dispute that the court could restrain a call on a\n\nguarantee or restrain a beneficiary from receiving monies thereunder if it was\n\nunconscionable for the beneficiary to do so. However, he submitted that McConnell had\n\nfailed to discharge its burden of adducing compelling evidence to establish a strong prima\n\nfacie case of unconscionability.",
        "McConnell’s rebuttal": "43.    Mr Chooi’s response was that CBI’s PBA with SE was very\n\ndifferent from that between SE and McConnell. He stressed that McConnell had been very\n\ncareful and that is why it negotiated and obtained better terms from SE in its PBA with\n\nSE. It had placed importance on the existence of a funding agreement between SE and Ficon.44.    In addition, CBI subsequently entered into another agreement with\n\nSE in which clauses 2.2 to 2.4 of the existing agreement had been replaced. It was unknown\n\nwhether CBI would have paid under its original PBA with SE.45.    He submitted that Alan Black’s affidavit did not\n\nspecifically deny Mr Twycross’ assertions. In any event, CBI’s views did not\n\nrepresent that of McConnell.46.    Mr Chooi also submitted that even if McConnell had agreed to SE\n\nreceiving US$625,000 irrespective of SE’s actual loss, it would be inequitable for SE\n\nto keep the US$625,000 if it actually suffered no loss or its loss was less than\n\nUS$625,000. As for IGL, he submitted that while it may not have the money for the entire\n\nproject, there was no evidence to show that it was not good for US$625,000.",
        "My decision": "47.    In my view, the right of SE to make a call and receive money\n\nunder the BG depends on the terms of the BG itself and not the underlying contract\n\npursuant to which the BG was issued, unless the terms of the BG stipulated otherwise.\n\nHere, the terms of the BG did not stipulate otherwise.48.    As for the e-mail from SE to McConnell dated 4 December 2000, it\n\nreferred to drafts of the PBA and BG. The drafts were not exhibited. Even assuming that\n\nthe draft of the BG was the same as the executed BG, there was no evidence that McConnell\n\nhad agreed with SE’s view on the intended bank guarantee or that it had relied on\n\nsuch a view before signing the PBA and procuring the issuance of the BG. Furthermore, with\n\nall its experience, it was not likely that McConnell could have been unaware of the nature\n\nand effect of an on-demand guarantee.49.    Even if the terms of the PBA should be considered, clause 2.1 is\n\nthe first of the provisions in clause 2 which Mr Chooi was relying on. I reiterate its\n\nterms:‘2.1 The Sub-Contract Tenderer acknowledges that the Funder has\n\n  committedor shall be committingto make payment of funds according to a payment\n\n  schedule (the \"Payment Schedule\") and other terms of paymentas may be agreedunder anagreementbetween Sembcorp and other parties with the Funder in respect of\n\n  such financing.’[Emphasis added.]50.    It was arguable that McConnell and SE were acting on the basis\n\nthat either Ficon had committed or would be committed to obtaining the funds and that it\n\ndid not matter which. Even the payment schedule for Ficon to pay over the funds had not\n\nyet been agreed.51.    It is true that Mr Ho of SE had said in an affidavit that the\n\nreference to ‘agreement’ in clause 2.1 was to the oral agreement of 4 or 5\n\nNovember 2000 which he had alleged. This would mean that there was at least an existing\n\nagreement with Ficon, even if it was not in writing. However, I was not bound by Mr\n\nHo’s evidence which appeared to be his interpretation of clause 2.1.52.    The rest of the provisions like clauses 2.2, 2.3 and 3.1b\n\nreferring to a failure or a breach by the Funder or clause 2.4 which refers to the\n\nFunder’s obligations must be read in context. They did not necessarily mean that\n\nthere was an existing agreement already and could mean a breach or failure of an\n\nobligation if and after the Funder had committed to raising the funds.53.    For example, clause 3.1(b) did not refer only to a breach by the\n\nFunder. It said:‘3.1 Save for clause 5 this Agreement shall terminate on the first\n\n  to occur of:-a) ….b) abreachby the Funder to pay the funds in accordance with\n\n  the payment schedule and other terms of payment asmay be agreedbetween Sembcorp\n\n  and other parties with the Funder, as referred to in clause 2.1 above; andc) …. ’[Emphasis added.]54.    Also, the recitals of the PBA did not refer to an existing\n\nagreement between SE and Ficon, whether oral or in writing.55.    As for Mr Ho’s e-mail dated 20 November 2000 stating that,\n\n‘… Sembcorp has arrived at an arrangement with FICON and Mohan’, there was\n\nno contemporaneous evidence that McConnell had relied on this as constituting a\n\nrepresentation of an existing binding agreement between SE and Ficon. Likewise for Mr\n\nHo’s e-mail dated 30 November 2000.56.    In addition, if the existence of a written binding agreement with\n\nFicon was as crucial as McConnell was alleging, it was surprising that it did not ask to\n\nhave sight of it before signing the PBA with SE. This was a glaring omission.57.    Even if McConnell was relying on the existence of an oral, as\n\nopposed to a written, agreement with Ficon, there was no clear contemporaneous evidence\n\nthat it had relied on the existence of the oral agreement.58.    If there was no reliance by McConnell on the existence of a\n\nbinding agreement with Ficon, whether written or oral, when McConnell executed the PBA,\n\nthen it would not matter whether the alleged representation about it was true or not.59.    Accordingly, it was unnecessary for me, especially at this stage\n\nof the proceedings, to dwell on the various e-mail after 5 November 2000 which Mr Chooi\n\ndrew my attention to with a view to establishing that there was no agreement between SE\n\nand Ficon as at 5 November 2000.60.    Furthermore, although CBI’s position did not bind McConnell,\n\nit was a factor which I could not ignore.61.    If the basis of each of the PBAs was premised on the existence of\n\na binding agreement with Ficon or a misrepresentation, CBI would have complained. It did\n\nnot and has paid on its PBA.62.    It was true that Alan Black’s (of CBI) affidavit did not\n\nspecifically contradict McConnell’s allegations but it was not intended to be a point\n\nby point rebuttal of such allegations. This was understandable since CBI is not a litigant\n\nin the present proceedings. In any event, the thrust of his affidavit was that:‘…. If FICON failed to deliver the funds by 31 March 2001,\n\n  the Defendant was entitled to call on our bank guarantee, i.e., we would each pay\n\n  US$625,000 to cover our share of the risk and losses.’[Paragraph 17 thereof.]There was no suggestion by Mr Black that the PBAs were entered into on\n\nthe alleged premise or misrepresentation raised by McConnell.63.    As regards the submission that CBI’s original PBA was\n\ndifferent from that of McConnell’s, it was true that McConnell had two additional\n\nprovisions i.e clauses 2.6 and 2.7. These provisions stated:‘2.6 Should the Funder provide funds later than expiration of the\n\n  31st March date and Sembcorp are subsequently awarded the Main Contract by I.G.L. then\n\n  Sembcorp shall return the full amount of any call made against the bank guarantee pursuant\n\n  to clause 2.2 less McConnell Dowell’s agreed share of the costs in respect of the\n\n  $US125 million deposit from 1stApril to the date of funding, and Sembcorp\n\n  shall negotiate in good faith with the Sub-Contract Tenderer the Subcontract and Sembcorp\n\n  will enter into the Subcontract with the Sub-Contract Tenderer as originally intended in\n\n  Recital 4.2.7 Other than provided for in clause 2.2 above, whether or not the\n\n  Main Contract is awarded to Sembcorp, each party shall be separately and solely liable for\n\n  all costs and expenses it may have expended or incurred in connection with the\n\n  preparation, submission and negotiation of the Tender and the Sub-Contract Tender.’64.    However, I could not see how the inclusion of these provisions\n\nmade the two PBAs so different in respect of the alleged premise and misrepresentation\n\nthat McConnell was relying on. These provisions were equally consistent with the\n\nexpectation that Ficon was to obtain funds and did not add anything else as to whether\n\nthere was already a binding agreement or not with Ficon.65.    As for the argument that CBI had subsequently entered into an\n\namended PBA with SE, without reference to funding to be obtained by Ficon, I was of the\n\nview that this did not necessarily mean that the original PBA with CBI was premised on the\n\nexistence of a binding agreement with Ficon. It was arguable that the amended agreement\n\nwas entered into simply because Ficon was no longer expected to obtain the funds.66.    As for the argument that SE had not suffered any loss, I was of\n\nthe view that in the absence of any evidence from SE, at least for the time being, I\n\nshould infer that SE did not suffer any loss. The question was not whether I should take\n\njudicial notice that banks do impose pre-maturity termination penalties but whether in\n\nfact the bank in question, Societe Generale, did and, if so, how much the penalty was.67.    However, even if SE did not suffer any loss, I was of the view\n\nthat it was arguable that the US$625,000 was the pre-determined sum to be paid should\n\nFicon be unable to obtain the funds. Clause 2.2 of the PBA provided that in such an event,\n\nMcConnell ‘shall … pay to Sembcorp within 24 hours of such failure anon-refundable\n\ndepositof US$625,000 ….’. [Emphasis added.]68.    I was aware that under clause 2.2, part of the US$625,000 need\n\nnot be paid if Ficon obtained some of the funds before 31 March 2001. Also, under clause\n\n2.6, part or all of the US$625,000 could be returned if Ficon obtained some funds after 31\n\nMarch 2001. However, these provisions did not provide for a reduction of the US$625,000 to\n\nbe paid if SE’s loss was less than US$625,000 or if SE did not suffer any loss.69.    As for the argument that it would be inequitable for SE to retain\n\nthe US$625,000 if its loss was less or non-existent, I did not agree. It was open to the\n\nthree parties, CBI, McConnell and SE, to agree that SE should only be compensated by CBI\n\nand McConnell for its loss up to a maximum of US$1.25m. For all its alleged caution in\n\nnegotiating the terms of the PBA, McConnell did not insist on this term. Neither did CBI.\n\nFurthermore, as the PBA stood, it appeared that SE would not be able to claim anything\n\nfrom CBI or McConnell if its loss was greater than US$1.25m.70.    As for IGL, SE was not obliged to claim the US$625,000 from IGL,\n\nwhether IGL was in a position to pay or not.71.    I will now cite some authorities in respect of an application for\n\nan injunction to restrain a call on or receipt of monies under an on-demand guarantee or\n\nbond.72.    InBocotra Construction Pte Ltd v A-G (No 2)[1995] 2 SLR 733, Karthigesu JA, said, at p 747C:‘…. Indeed, a higher degree of strictness applies, as the\n\n  applicant will be required to establish a clear case of fraud or unconscionability in\n\n  interlocutory proceedings. It is clear that mere allegations are insufficient.’73.    InStar-Trans Far East Pte Ltd v Norske-Tech Ltd & Ors[1995] 3 SLR 631, GP Selvam J said, at p 643A:‘First, the injunction would be granted only in exceptional\n\n  circumstances; the court having regard to the purpose of the bond, will be disinclined to\n\n  granting it. Secondly, … the party making the application must come up with\n\n  compelling evidence to establish the exceptional circumstances.’74.    InDauphin Offshore Engineering & Trading Pte Ltd v The\n\nPrivate Office of HRH Sheikh Sultan bin Khalifa bin Zayed Al Nahyan[2000] 1 SLR 657,\n\nChao Hick Tin JA said, at para 57:’57 In coming to this view we have borne in mind the standard of\n\n  proof required of the alleged unconscionability. InBocotrathis court stated that\n\n  ‘a high degree of strictness applies, as the applicant will be required to establish\n\n  a clear case of fraud or unconscionability in the interlocutory proceedings. It is clear\n\n  that mere allegations are insufficient’. InGHL v Unitrackthis court\n\n  implicitly endorsed the strong prima facie standard propounded by the High Court inChartered\n\n  Electronics Industries v Development Bank of Singapore Ltd[1999] 4 SLR 655. In our\n\n  opinion, what must be shown is a strong prima facie case of unconscionability. We do not\n\n  think that that standard has been satisfied in the instant case.’75.    InEltraco International Pte Ltd v CGH Development Pte Ltd[2000] 4 SLR 290, Chao Hick Tin JA said, at paras 29 and 30:’29 InRaymond Construction Pte Ltd v Low Yang Tong & Anor(Suit\n\n  1715/95, 11 July 1996, unreported) Lai Kew Chai J opined that:The concept of ‘unconscionability’ to me involves unfairness,\n\n  as distinct from dishonesty or fraud, or conduct of a kind so reprehensive or lacking in\n\n  good faith that a court of conscience would either restrain the party or refuse to assist\n\n  the party. Mere breaches of contract by the party in question would not by themselves be\n\n  unconscionable.30 The appellants would appear to suggest that based on this opinion,\n\n  unfairness, per se, could constitute ‘unconscionability’. We do not think it\n\n  necessarily follows. Lai Kew Chai J said the concept of ‘unconscionability’\n\n  involves unfairness. We agree. That would be so. In every instance of unconscionability\n\n  there would be an element of unfairness. But the reverse is not necessarily true. It does\n\n  not mean that in every instance where there is unfairness it would amount to\n\n  ‘unconscionability’. That is a factor, an important factor no doubt in the\n\n  consideration. It is important that the courts guard against unnecessarily interfering\n\n  with contractual arrangements freely entered into by the parties. The parties must abide\n\n  by the deal they have struck.’76.    In my view, McConnell’s case fell far short of a strong\n\nprima facie case of unconscionability. Both McConnell and SE disagreed on the alleged\n\npremise and misrepresentation. Pending final resolution of the dispute, SE was entitled to\n\nmake a call upon the BG and receive monies under it.77.    I would add that the views I have expressed above regarding the\n\nalleged premise and misrepresentation and McConnell’s PBA are not final bearing in\n\nmind the nature of the application before me.78.    I also note that the application for an interlocutory injunction\n\nwas filed on 30 March 2001. The first substantive hearing thereof was on 30 October 2001\n\npartly because of the time required by the parties to file and serve affidavits. I learned\n\nfrom Counsel that the parties had not travelled very far, if at all, on the road to\n\narbitration, as provided in McConnell’s PBA or, in any event, towards securing a\n\nfinal order. It seemed to me that undue time and resources have been spent in relation to\n\nan interlocutory application when they should have been better spent in securing a final\n\norder.Sgd:WOO BIH LIJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}