{
    "case_title": "Senthamel Selve d/o Ramanathan v Public Prosecutor",
    "ncitation": "[2002] SGHC 143",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Charge": "2      The charge against Selve read as\n\nfollows:You,\n\nSenthamel Selve d/o Ramanathan, f/41 yearsNRIC No\n\n: S 1437177ZDate of\n\nBirth: 03-06-1960are charged that you on 10thday of July\n\n  2001, at or about 3:35 p.m. at \"Shop N Save Supermarket\" located at No. 51, Ang\n\n  Mo Kio Avenue 3, #02-01, Big Mac Centre, a building used for the custody of property, did\n\n  commit theft of a packet containing eight \"Selar Ikan\" fishes, total valued at\n\n  $7.05/-, in the possession of one Koh Chin Hoe, and you have thereby committed an offence\n\n  punishable under section 380 of the Penal Code, Chapter 224.",
        "Prosecution’s case": "3        The prosecution presented\n\nthe following facts: On 10 July 2001, Wong Fok Seng (‘Wong’), a security guard\n\nat the Ang Mo Kio Avenue 3 branch of Shop and Save (‘SNS’) was on duty. Wong\n\ntestified that at about 3:35 p.m., he saw Selve entering the store. She walked straight to\n\nthe fish section, bypassing some weighing machines at point \"184\" on exhibit\n\n\"P5\" (the map of the store). Selve selected some \"Selar\" fish and put\n\nthem in a clear plastic bag provided by the store. After that, he saw Selve going to the\n\nrice section, which he described as a \"very quiet area\". There, Selve put the\n\nplastic bag containing the fish into an NTUC plastic bag that she had with her. She then\n\nwalked straight to the main entrance and made her exit quickly, without paying for the\n\nfish. She had left the store and was already near the escalators outside the store when\n\nWong stopped her.4        Wong saw that the NTUC\n\nplastic bag that Selve was carrying contained the bag of fish that had not been paid for.\n\nHe asked her why she did not pay for the fish. She became very angry and spoke to him in\n\nEnglish in a loud voice. However, he did not understand her because he did not have a good\n\ncommand of English. At this point, an Indian cashier, Ms. Isvari d/o P. Thirupathy\n\n(‘Isvari’) came over because of the commotion. Wong pointed to the fish that\n\nwere still in the NTUC plastic bag and told Isvari that Selve did not pay for them. Isvari\n\nspoke with Selve and asked her to follow Wong into the office of the manager, Ms\n\nShashikala d/o Packirisamy (‘Shashikala’).5        Shashikala testified that,\n\nwhen she questioned Selve about the theft, Selve kept denying that she had stolen the fish\n\nbut had only taken them outside the store to weigh them. She repeatedly claimed that she\n\nwas told by an executive in charge of the fish counter that the weighing machines were\n\noutside. When asked why she had put the fish in the NTUC plastic bag if she wanted to\n\nweigh them, Selve did not answer the question but continued saying that she just wanted to\n\nweigh the fish. The police were called. Two male officers and one female officer came.\n\nThey asked who caught Selve and Shashikala told them that it was Wong.6        One of the police officers\n\nwas Staff Sergeant Tay Hwee Meng (‘SSGT Tay’). He testified that, on 10 July\n\n2001, he was on Fast Response Car duty with his partner, Corporal Lai Yew Wai (‘CPL\n\nLai’). At about 3:59 p.m., he received a message asking him to proceed to SNS. After\n\nhe arrived there, he obtained the facts from Wong and proceeded to talk to Selve while Lai\n\ntook Wong’s statement. He also called for a female police officer to come to the\n\nscene as Selve was a woman. Inspector Noorwati (‘INSP Noorwati’), SSGT\n\nTay’s team leader, came in response to his request. SSGT Tay testified that Selve was\n\nvery uncooperative when he questioned her and she refused to give her particulars to him.\n\nShe claimed that there was a misunderstanding but she did not tell him that she was\n\nlooking for a weighing machine. Tay took three photographs at the scene to use as\n\nevidence. He left the clarification on whether an offence had actually been committed to\n\nthe Investigating Officer.7        The Investigating Officer\n\nwas one Sergeant Adrian Goh (‘SGT Goh’). On 11 July 2001, he interviewed Selve\n\nto obtain her version of the facts. He also went down to SNS three times. During his first\n\nvisit, he ascertained the layout of the supermarket. On his second visit, he checked the\n\nvisibility of the weighing machines from the fish counter and on his last visit he took\n\nShashikala’s statement. He also called Wong to obtain his version of the facts. SGT\n\nGoh also reviewed the statements of the arresting officers, SSGT Tay and CPL Lai. After\n\ncarrying out these investigations, he decided to charge Selve on the strength of\n\nWong’s statement which he had personally verified. He testified later that he had no\n\nreason to suspect that that SSGT Tay, CPL Lai or Wong were lying in their statements\n\nsetting out the circumstances surrounding Selve’s arrest.8        As for the location of the\n\nweighing machines, Shashikala and Wong testified that there were two weighing machines in\n\nthe store. In the morning, one machine would be placed near the fish counter. The other\n\nmachine would be placed near the vegetables and fruits. In the afternoon, however, both\n\nmachines would be placed at the same spot near the vegetables and fruits. This was where\n\nthe weighing machine was located at the time Selve was detained. Shashikala also testified\n\nthat this arrangement of shifting the weighing machines daily had been the store’s\n\npractice for the past year.9        Lastly, Wong testified that\n\nhe had never seen Selve before 10 July 2001. He also testified that the store did not\n\npromise or give him any incentives to catch shoplifters.",
        "Defence’s case": "10        Selve testified to the\n\nfollowing: She was a part-time office attendant and part-time helper at a canteen stall\n\nrun by her friend, Mohamad Shaheed (‘Shaheed’). She was a divorcee and had\n\ncustody of her three children. However, she claimed that she was not in any financial\n\ndifficulty.11        On 10 July 2001, she went\n\nto the \"NTUC\" supermarket at Ang Mo Kio to purchase some groceries. She had $126\n\nand some coins on her that day. She paid for her purchases and left carrying four\n\n\"NTUC\" plastic bags containing the groceries. After that, she proceeded to SNS\n\nto buy some \"Selar\" fish for the canteen at which she helped.12        At SNS, Selve walked\n\nstraight to the fish counter. She passed the two weighing machines there. She claimed\n\nhowever, that she did not notice them. She explained that there were a lot of baskets\n\nfilled with fruits in that area. She intended to use the machine near the fish counter.\n\nShe had been to SNS twice before 10 July 2001, to buy fish and crabs. On both occasions,\n\nshe was there in the afternoon and she weighed her items at the machine near the fish\n\ncounter.13        When she was at the fish\n\ncounter, she met a Chinese man who was the executive in charge of that counter. She\n\nidentified Koh Chin Hoe (‘Koh’) as that executive. Koh helped her select some\n\n\"Selar\" fish and put them inside a clear plastic bag. She then took the fish to\n\nthe machine near the fish counter to weigh them, but the weighing machine was not there.\n\nThus, she asked Koh where it was and whether he could help her weigh the fish. She claimed\n\nthat he refused to help her to weigh the fish because he was too busy. Instead, he pointed\n\naround and said that the weighing machine was somewhere near the exit but he did not tell\n\nher exactly where the machine was.14        She went towards the\n\ndirection of the exit to look for the machine. When she could not find it, she asked a\n\nChinese cashier for directions, only to be rudely told to find it herself. She then went\n\nto the exit and stood on a red carpet there. At this point, she was approached by Wong who\n\naccused her of not paying for the fish. She explained to him that she was trying to look\n\nfor the weighing machine. She also told an Indian cashier what happened but the cashier\n\ndid not help and told her to go into the manager’s office instead. Wong brought her\n\nto the office. Subsequently, Shashikala and then the policemen came. She explained to\n\nWong, Shashikala, the male police officer interviewing her and another female police\n\nofficer that she did not steal the fish. She also asked them to call Koh to clarify the\n\nmatter but no one paid any attention to her pleas. She wanted to call her friend, Shaheed,\n\nand the police allowed her to do so. After that, the police officers brought her back to\n\nthe police station where she was detained.15        Shaheed gave evidence for\n\nthe defence. He testified that, on the day in question, he received a telephone call from\n\nSelve. She told him that she was being accused of shoplifting. He went down to the store.\n\nAt the store, he took 23 photographs of the store, under Selve’s directions to\n\n\"prove what the Accused was trying to say, that she was looking for a weighing\n\nmachine around the exit where she was directed by the fishmonger.\" However, he\n\nadmitted that he did not try to look for the weighing machine himself or pay any attention\n\nto the signs which the store put up to indicate the position of the weighing machine.16        Koh was the third witness\n\nfor the defence. His evidence was that on 10 July 2001, he saw Selve at the fish counter.\n\nShe picked some fish and put them in a clear plastic bag. She also asked him where she\n\ncould weigh the fish. He told her that she could do so \"in front\" and pointed to\n\nthe weighing machine near the vegetable and fruit counter. He testified that from where he\n\nstood the sign board that was hanging above the weighing machine which indicated their\n\nposition and the machine could be seen clearly. It was only about six metres away from\n\nwhere he was standing. After pointing out the location of the machine to her, he continued\n\nwith his work. He could not recall where she walked to.17        CPL Lai and INSP Noorwati\n\ngave evidence as arresting officers. CPL Lai testified that he recorded Wong’s\n\nstatement but he did not speak to Selve at all. His evidence was that he saw the fish in\n\nthe NTUC plastic bag belonging to Selve. Wong told him that Selve did not pay for the fish\n\nand Wong stopped her near the escalators outside the store. As for INSP Noorwati, she\n\ntestified that she was called to SNS on 10 July 2001. When she arrived, she spoke to her\n\nofficers in the manager’s office. She arrested Selve after ascertaining the situation\n\nfrom her officers. INSP Noorwati remembered that Selve wanted to call someone but Selve\n\ndid not explain anything to her about the fish. INSP Noorwati said that her role was to\n\nescort Selve, not to carry out investigations, which was the duty of the Investigating\n\nOfficer.18        The last witness for the\n\nDefence was Isvari, the Indian cashier that Selve spoke to, prior to being brought into\n\nthe manager’s office. Isvari testified that on 10 July 2001 she saw Wong speaking to\n\nSelve and went over to help to translate. Wong told her that Selve stole some fish from\n\nthe store and put them in the NTUC plastic bag. Isvari gave evidence that Selve showed her\n\nthe NTUC plastic bag and she saw that there was a bag of fish in it. Selve explained that\n\nshe wanted to weigh the fish, but Isvari told her that if she really intended to do so,\n\nshe should not place the fish in the NTUC plastic bag. After that, Isvari told Selve to\n\nfollow Wong into the manager’s office.",
        "The decision below": "19        The trial judge concluded\n\nthat Selve was guilty of the offence of committing theft in a building used for the\n\ncustody of property. She accepted Wong’s evidence that Selve selected the fish and\n\nput them into an NTUC plastic bag in a quiet corner. The fact that the fish was in the\n\nNTUC bag that Selve was carrying was also corroborated by CPL Lai and Isvari.20        The judge disbelieved\n\nSelve’s evidence that she was looking for a weighing machine to weigh the fish when\n\nshe was caught. She gave these reasons:first, Koh denied pointing to the exit when\n\nSelve asked him where the weighing machine was. The judge accepted Koh’s testimony\n\nthat he pointed Selve to the machines near the vegetables and fruits. The weighing\n\nmachines and sign indicating their location were visible from the fish counter.Secondly,\n\nthe route she took to the fish counters showed that she had passed the two machines.Thirdly,\n\nthe judge found that Selve was familiar with the layout of the store as she admitted that\n\nshe had been to the store twice previously. As such, she ought to know that there were no\n\nweighing machines outside the store.Lastly, the judge preferred Wong’s\n\ntestimony that Selve did not stop to ask a cashier for directions as to where the weighing\n\nmachines were placed but headed straight to the exit over Selve’s evidence that she\n\nasked for stop to ask for directions. The judge observed that Selve had not called this\n\ncashier to testify at trial. Furthermore, when asked to mark the route she took out of the\n\nstore, she omitted to mark the stop at the cashier. It was only when her counsel pointed\n\nout this omission to her during her re-examination that she changed the drawing of the\n\nroute she took.21        The trial judge also gave\n\na detailed analysis of the credibility of the witnesses. She found Wong to be a reliable\n\nwitness because he did not have any incentive to frame Selve. Wong was never offered any\n\nreward for catching shoplifters. In addition, the judge found that all the\n\nprosecution’s witnesses withstood cross-examination. Their evidence corroborated with\n\neach other and with even the defence’s witnesses. She observed that they had no\n\nreason to conspire against Selve. On the other hand, she found that Selve was evasive and\n\ngave contradictory evidence. She had reason to lie to get herself out of the charge. She\n\nalso discounted the evidence of Shaheed because it was hearsay and he had admitted that he\n\nwould \"definitely\" help Selve if she were in trouble.",
        "The appeal": "22        The only issue before me\n\nwas a factual one, whether Selve intended to leave SNS without paying for the\n\n\"Selar\" fish in her possession, thereby committing theft in a building used for\n\nthe custody of property. As this was an appeal against the findings of fact made by the\n\ntrial judge, I applied the established principle that an appellate court will not disturb\n\nfindings of fact unless they areclearlyreached against the weight of the evidence\n\n:Lim Ah Poh v PP[1992] 1 SLR 713,Yap Giau Beng Terence v PP[1998] 3 SLR 656).23        After a review of the\n\nevidence available, I was convinced that the trial judge had ample reasons to support her\n\nfinding that Selve had not intended to look for a weighing machine outside the store but\n\nhad wanted to leave the store without paying for the fish. In particular, I noted the\n\nfollowing pieces of evidence which pointed irresistibly to the conclusion that Selve was\n\nguilty of the charge against her:24        First, Selve put the fish\n\nwhich she had not paid for into an NTUC plastic bag and took that bag outside the store.\n\nSelve never denied these facts. Her own witnesses, CPL Lai and Isvari, both clearly\n\ntestified that they saw the unpaid fish in Selve’s NTUC plastic bag. The evidence of\n\nCPL Lai and Isvari was consistent with Wong’s testimony that he saw Selve go to a\n\n\"very quiet area\" of the store, the rice section, and surreptitiously put the\n\nfish into the NTUC plastic bag. I find no reason to doubt Wong’s evidence. The fact\n\nthat Selve put the unpaid fish into a white NTUC plastic bag and walked out of the store\n\nmade her story that she wanted to go outside to weigh the fish highly unbelievable. If it\n\nwas really her intention to weigh the fish and pay for them, she would not have placed\n\nthem in her own bag and bring that bag out of the store without paying. I also observed\n\nthat Selve never explained this inconsistency although she was confronted with it by\n\nIsvari and Shashikala.25        Secondly, Selve had no\n\nreason to believe that the weighing machines were outside of the store. She claimed that\n\nshe thought the machines were outside because Koh had told her that they were somewhere\n\nnear the exit. However, Koh, who was her own witness, testified that he had never told her\n\nthat the machines were near the exit. On the contrary, Koh gave evidence that he pointed\n\nSelve towards the weighing machines near the vegetables and fruits. Furthermore, he also\n\ntestified that the machines were clearly visible from where he and Selve stood and were,\n\nin fact, only a mere six metres away.26        In addition, Selve should\n\nknow that there were no weighing machines outside the store because she was familiar with\n\nits layout. During her examination-in-chief, she said that she had been to the store\n\n\"many times\" and that she sometimes went there as frequently as once every two\n\nweeks. However, on further questioning by her own counsel, she subsequently said that she\n\nhad only been there twice before 10 July 2001. I doubted that she was being truthful about\n\nthe number of times she had been to the store before. Nevertheless, it was reasonable to\n\ndraw the conclusion that she was familiar with the store’s layout. She had been there\n\nat least twice and she knew where the fish counter and the weighing machine next to the\n\nfish counter was. The trial judge’s finding that it was incredible that Selve would\n\nbelieve that the weighing machines were outside of the store in light of her familiarity\n\nwith the store’s layout, could not be faulted.27        Before me, Counsel for\n\nSelve argued that the trial judge’s assessment of the witnesses was wrong because she\n\nrelied on Wong’s testimony. Wong gave evidence that he saw Selve put the fish into a\n\nplastic bag at the fish counter without any help. Counsel for Selve pointed out that it\n\nwas impossible for Selve to place the fish into the plastic bag without help because she\n\nonly had the use of one of her hands as she was carrying the rest of her shopping bags\n\nwith her other hand. As such, Counsel for Selve submitted that Wong’s entire\n\ntestimony should be discredited.28        I rejected the argument\n\nput forth by Counsel for Selve, which appeared to me to be an attempt to grasp for straws.\n\nThe question of exactly how Selve put the fish into the plastic bag was merely a minor\n\npoint which was unnecessary to prove the charge against her. In any case, in light of the\n\noverwhelming evidence against Selve, such a minor discrepancy certainly could not show\n\nthat the trial judge was clearly wrong in accepting Wong’s testimony over\n\nSelve’s.29        Furthermore, I agreed with\n\nthe trial judge’s analysis on the credibility of the witnesses. She observed rightly\n\nthat Wong and the police officers had no reason to conspire together to frame Selve. In\n\nfact, their evidence was generally consistent with each other and even Selve’s own\n\nwitnesses, such as Koh and Isvari. On the other hand, Selve had every incentive to lie to\n\nget herself acquitted. Her testimony contained many contradictions. Such contradictions\n\nincluded whether or not she stopped to ask a cashier for directions to the weighing\n\nmachine, the number of times she had been to SNS previously and whether she was\n\nfinancially strapped. Her evidence was also not corroborated by her own witnesses. The\n\ntrial judge’s finding that Shaheed’s evidence was hearsay and potentially biased\n\nbecause of his close relationship with her was also not obviously wrong. I concluded that\n\nSelve failed to show why the trial judge’s analysis was clearly wrong when she\n\npreferred the testimony of the prosecution witnesses over Selve’s own and\n\nShaheed’s evidence.",
        "Conclusion": "30        For the reasons given\n\nabove, I found that Selve did intend to take the fish out of the store without paying for\n\nthem, thereby committing the offence of committing theft in a building used for the\n\ncustody of property. Accordingly, I dismissed her appeal and confirmed her sentence.Sgd:YONG PUNG HOWChief JusticeRepublic of SingaporeCopyright © Government of Singapore."
    }
}