{
    "case_title": "Yeoh Poh San and Another v Won Siok Wan",
    "ncitation": "[2002] SGHC 129",
    "coram": "Woo Bih Li JC",
    "sections": {
        "Held": ", allowing the appeal:(1)    When a plaintiff’s solicitor is aware that a defendant\n\nhas filed an appeal against the refusal to order a stay, he should not insist on the\n\nfiling of the Defence pending the hearing of the appeal. This principle applies to an\n\napplication for a stay on any grounds and is not confirmed to a challenge based on an\n\nabsence of jurisdiction. To insist on the filing of the Defence is wrong because it will\n\ndefeat the very purpose of the appeal against the refusal to order a stay. ( 18)(2)    If the plaintiff’s solicitor insists on the filing of the\n\nDefence, the defendant’s solicitor should apply for an extension of time to file\n\npending the outcome of the appeal. An extension of time should generally be granted so as\n\nnot to render the appeal nugatory. ( 19)(3)    Compromise orders that order a defendant to file his Defence\n\npending his appeal on the stay proceedings provided the plaintiff undertakes not to treat\n\nthe filing of the Defence as a step in the proceedings should not be granted for the\n\nfollowing reasons: First, no such compromise orders are granted before the original stay\n\napplication is heard and the position should be the same for appeals on stay applications.\n\nSecondly, to insist on the filing of a Defence while an appeal on the stay was pending is\n\nprejudicial to the defendant who has to meet the merits of the plaintiff’s claim\n\nwhile seeking a stay. Thirdly, if the defendant succeeds in the appeal, he may never have\n\nto meet the plaintiff’s claim on the merits as the plaintiff may abandon his claim in\n\nthe alternate jurisdiction. Lastly until all avenues of appeal in relation to a stay\n\napplication are exhausted, our courts are not properly seized of the matter. ( 24-29)(4)    On the facts, due to the peculiar words used in the\n\nDefendant’s application for an extension of time and the fact that the Defendant\n\norally requested for an extension of time and obtained it from the Plaintiffs, a\n\ncompromise order was granted as an exception to the general rule that compromise orders\n\nshould be granted.( 30)JudgmentGROUNDS OF DECISIONBackground1.    The Plaintiffs Yeoh Poh San and Choo Lee Chin are husband and wife\n\nand are Malaysian citizens. They claim various sums of money from the Defendant Won Siok\n\nWan who was a female companion of the First Plaintiff. She is also a Malaysian citizen.\n\nThe claim is based on alleged wrongful withdrawals of monies by the Defendant from a joint\n\nbank account in Singapore in the name of the Second Plaintiff and the Defendant. The\n\nsource of the monies is allegedly the First Plaintiff.2.    The Writ of Summons was filed in the High Court in Singapore and\n\nthe Plaintiffs applied for and obtained leave to serve it, with a Statement of Claim\n\nendorsed thereon, on the Defendant at her residence in Malaysia.3.    After the Defendant was served, her Singapore solicitors entered\n\nan appearance on her behalf and applied for an order that the proceedings be stayed or\n\ndismissed or discontinued on the ground of multiplicity of proceedings or forum non\n\nconveniens. Apparently there were related actions in Malaysia and Thailand as well.4.    The stay application was heard by an Assistant Registrar on 17\n\nApril 2002 and was dismissed with costs. There was an alternative prayer in the stay\n\napplication for extension of time to file a Defence but apparently this was not pursued\n\nand no order was made thereon.5.    The next day i.e on 18 April 2002, the Defendant filed a Notice of\n\nAppeal to the judge-in-chambers. This was fixed for hearing on 21 May 2002. It was served\n\non the Plaintiffs’ solicitors on 24 April 2002. In the meantime, the time for filing\n\nthe Defence expired. Apparently, someone from the Defendant’s solicitors’ firm\n\norally asked for and obtained an extension of time to file the Defence. The time for doing\n\nso expired at 4pm of 30 April 2002. Thereafter the Plaintiffs’ solicitors applied for\n\njudgment in default of Defence and the Defendant’s solicitors in turn applied for an\n\nextension of time. The Defendant’s application was not aptly worded. It was couched\n\nin terms seeking an extension to file the Defence within ‘fourteen (14) days from the\n\ndate of the order herein or upon final determination of the Defendant’s application\n\nfor a stay of the action or its dismissal or discontinuance’. In other words, the\n\nfirst limb of the prayer only sought an extension of 14 days from the date of the order to\n\nbe made and it was the second limb which sought a stay until ‘final\n\ndetermination’.6.    Both applications were heard before the Deputy Registrar Mr Foo\n\nChee Hock on 17 May 2002. He made one Order i.e to grant the Defendant an extension of\n\ntime of 14 days to file her Defence on the undertaking of the Plaintiffs’ counsel not\n\nto treat the filing of the Defence as a step taken by the Defendant in the proceedings in\n\nview of the pending appeal by the Defendant to the judge-in-chambers. However, he declined\n\nto require a broader undertaking from the Plaintiffs’ counsel i.e for the undertaking\n\nto apply to all steps taken by the Defendant thereafter.7.    The Defendant then filed a Notice of Appeal against this order on\n\nthe basis that what the Defendant really wanted was an extension of time to file the\n\nDefence until she exhausted all avenues of appeal.8.    When this appeal came up for hearing before me on 30 May 2002, the\n\nmain appeal on the stay application had been heard by Belinda Ang JC and dismissed.\n\nHowever, the Defendant’s solicitors had written to request further arguments and were\n\nawaiting a response. I was informed that if the request for further arguments was not\n\nsuccessful, for whatever reason, the Defendant would then appeal to the Court of Appeal.Arguments9.    Counsel for the Plaintiffs, Mr Kuppanchetti, submitted that unless\n\nthe jurisdiction of the Singapore court was being challenged on the basis that the court\n\ndid not have jurisdiction at all, as opposed to a forum non conveniens argument, the\n\nDefendant should file her Defence. He was prepared to broaden his undertaking below to\n\napply to any other step which the Defendant may take in the proceedings. This would mean\n\nthat pending the outcome of her request for further arguments and any appeal to the Court\n\nof Appeal, no step taken by the Defendant would be construed as being a submission to the\n\ncourt’s jurisdiction since, after the filing of the Defence, the proceedings would\n\ncarry on in the usual manner with pre-trial conferences and directions being given.\n\nParties would probably be required to file list of documents, conduct inspection of the\n\ndocuments and file their affidavits of evidence-in-chief. There might also be requests for\n\nfurther and better particulars and/or interrogatories.10.    Counsel for the Defendant, Mr Andre Arul, submitted that the\n\nDefendant was not obliged to file a Defence pending the final determination of her stay\n\napplication. By this, he meant pending the final appeal to the Court of Appeal if the\n\nDefendant was still unsuccessful before Ang JC.11.    Mr Arul stressed that if a Defence or any other step is taken by\n\nthe Defendant then that would be a submission to the Singapore court’s jurisdiction.\n\nHis alternative argument was that the Deputy Registrar, in granting the Defendant an\n\nextension of time to file the Defence, should have done so on the basis of a broader\n\nundertaking from Plaintiffs’ Counsel so as to apply to any other step that the\n\nDefendant might take after Defence.12.    In paras 26 to 30 of his written submissions, Mr Arul referred to\n\ncertain passages from the judgment of Karthigesu JA inThe Jarguh Sawit[1998] 1 SLR 648. That was a case in which the facts and issues were different from those before\n\nme. Nevertheless, certain parts of the judgment of Karthigesu JA are apposite and I cite\n\nthem below:‘30    Firstly, whether or not a\n\n  court has jurisdiction is, of necessity, a question logically prior to the substantive\n\n  dispute of the parties. Unless anduntil a court is properly seized, it cannot\n\n  adjudicate on the matter…. Thus, our law provides that a party disputing jurisdiction\n\n  may appear before the court to argue the question of jurisdiction (which we hold to be a\n\n  procedural issue) without thereby submitting to the court’s jurisdiction to determine\n\n  substantive issues ….34    The Rules of Court also contemplate\n\n  that the matter of jurisdiction should be determined once and for all at the interlocutory\n\n  stage. The Rules clearly suggest that jurisdiction is finally determined at the stage\n\n  where an application is made under O 12 r 7 ….35    A party to an action brought in\n\n  Singapore may dispute jurisdiction after having first entered an appearance by an\n\n  application made by summons under O 12 r 7. This does not amount to a submission to\n\n  jurisdiction: O 12 r 7(5). Order 12 r 7(2) then prescribes that a defendant may dispute\n\n  jurisdiction by making an interlocutory application by a summons in chambers.36If the application fails, the defendant may\n\n  appeal against it without thereby submitting to the jurisdiction of the court.Once,\n\n  however, it has beenfinally determinedthat either no order should be made on the\n\n  application to dispute jurisdiction, or the application is simply dismissed, O12 r 7(5)\n\n  provides that O 12 r 7(6) shall apply. Order 12 r 7(6) provides that a defendant who has\n\n  entered an appearance is to be treated as having submitted to the jurisdiction of the\n\n  court unless the appearance is withdrawn.[Emphasis added.]13.    Mr Arul also referred to a decision of mine in Suit No 224 of\n\n2001 where he was himself the plaintiff and Tunku Ibrahim Ismail Ibni Sultan Iskandar\n\nAl-Haj was the defendant. In that case, the defendant applied for a stay of proceedings\n\nbefore the Singapore court on the ground of forum non conveniens. He failed before a\n\nregistrar and before the judge-in-chambers. Pending his appeal to the Court of Appeal, he\n\napplied for an extension of time to file his defence until after his appeal to the Court\n\nof Appeal had been heard and determined. He failed in this application before a registrar\n\nand appealed therefrom to a judge-in-chambers. That appeal was heard by me and I allowed\n\nthe appeal i.e I extended the time for filing the defence to after the determination of\n\nthe appeal by the Court of Appeal.My decision in the present case14.    The very reason why a defendant is required to apply for a stay\n\nof proceedings before taking any step other than filing an appearance is because such an\n\nother step may be construed as a submission to the court’s jurisdiction.15.    As a matter of practice, once the stay application is filed, the\n\nplaintiffs’ solicitors will generally not insist on the filing of the Defence pending\n\nthe hearing of the stay application.16.    For reasons which I shall elaborate below, the position has\n\nbecome unnecessarily complicated if the stay application is dismissed.17.    Once a stay application is dismissed. It is not uncommon for a\n\nplaintiff’s solicitors to insist that the Defence be filed even though they are aware\n\nthat the defendant has filed an appeal. When the plaintiff’s solicitors do this, a\n\nhelpless defendant is then compelled to apply for an extension of time to file the\n\nDefence. Quite often, this application is met by the argument that as there is no existing\n\norder for a stay, and the appeal does not operate as a stay, the Defence must be filed. A\n\nregistrar hearing that application then seeks to balance that argument with the prejudice\n\nto the defendant if he is required to file his Defence notwithstanding his appeal.\n\nAccordingly there has developed a sort of compromise order which requires the Defence to\n\nbe filed with the qualification, or undertaking from the plaintiff’s solicitors, that\n\nthe filing of the Defence will not be construed as a step in the proceedings. Sometimes\n\nthe qualification, or undertaking, is in broader terms so as to apply to all other steps\n\nafter the filing of the Defence as well, but sometimes it is not as was the situation in\n\nthe case before me.18.    I was of the view that when a plaintiff’s solicitor is aware\n\nthat a defendant has filed an appeal against the refusal to order a stay, he should not\n\ninsist on the filing of the Defence pending the hearing of the appeal. Support for this\n\nproposition can be found in para 36 of the judgment of Karthigesu JA which I have cited in\n\npara 12 above. I also did not think that the view expressed by Karthigesu JA is confined\n\nto a challenge based on an absence of jurisdiction as such. It applies equally to an\n\napplication for a stay whether based on forum non conveniens or some other ground. The\n\nvery reason why a plaintiff’s solicitor does not, and should not, insist on the\n\nfiling of the Defence before the original stay application is heard is equally applicable\n\nto an appeal i.e to require the filing of the Defence will defeat the very purpose of the\n\nstay application, or, as the case may be, the appeal.19.    If, however, a plaintiff’s solicitor insists on the filing\n\nof the Defence notwithstanding the appeal, then the defendant’s solicitors should\n\napply for an extension of time to file the Defence pending the outcome of the appeal.\n\nIndeed, to avoid any unnecessary aggravation or concern, this is a matter that the\n\ndefendant’s solicitors should consider from the very beginning when drafting the\n\noriginal stay application. In other words, the defendant’s solicitors should consider\n\nthen whether to include an alternative prayer that should the application be unsuccessful,\n\nthe defendant be granted an extension of time to, say, 14 days after the outcome of his\n\nappeal or appeals that may be filed by him.20.    The primary prayer or the first limb of the prayer for such a\n\nrelief should be for an extension of time pending the outcome of the appeal or appeals, as\n\nthe case may be. That should not be left as an alternative prayer as was in the present\n\ncase before me.21.    Mr Arul had sought to explain away the terms of the\n\nDefendant’s application for an extension of time by submitting that he was\n\napproaching the matter chronologically. I did not accept such a submission. The point was\n\nnot one of chronology but one of priority i.e what was the Defendant primarily seeking.\n\nHowever, he further submitted that during arguments before the Assistant Registrar he had\n\nmade it clear that what the Defendant was primarily seeking was an extension of time\n\npending the outcome of her appeals.22.    I was of the view that once an application for an extension of\n\ntime to file a Defence pending the outcome of an appeal is made, the extension should,\n\ngenerally speaking, be granted so as not to render the appeal nugatory.23.    For various reasons, I was not in favour of the type of\n\ncompromise order that I have mentioned.24.    First, if the concern about submission to jurisdiction can be so\n\neasily addressed by the compromise order, then there is no reason why the Defence should\n\nnot be required to be filed on the basis of a similar compromise order, or a similar\n\nundertaking, even before the original stay application is heard. Yet, as I have mentioned,\n\nit has been the practice not to require the Defence to be filed pending the hearing of the\n\noriginal stay application.25.    Secondly, and more importantly, I was of the view that it was\n\nillogical to require the Defence to be filed, with all the follow-up steps which will be\n\ntaken, when a defendant is exercising his right of appeal.26.    I was not persuaded by the argument, which I have heard before,\n\nthat should a defendant succeed in his appeal, the plaintiff can be ordered to pay all the\n\ncosts of the steps taken so far and hence there is no prejudice to the defendant.27.    In my view, there is prejudice to the defendant. The point is\n\nthat while a defendant is seeking to stay the proceedings, whether by way of original\n\napplication or an appeal, the defendant should not be required to meet the\n\nplaintiff’s claim on the merits. A defendant is entitled to focus his attention on\n\nthe appeal for a stay and not be distracted by running two contradictory courses of action\n\nat the same time.28.    Thirdly, should a defendant eventually succeed in his appeal, he\n\nmay never be required to meet the plaintiff’s claim on the merits as the plaintiff\n\nmay, for his own reasons, then decide not to pursue his claim in the alternative\n\njurisdiction.29.    Fourthly, until all avenues of appeal in relation to a stay\n\napplication are exhausted, our courts are not properly seized of the matter (see again\n\npara 30 of the judgment of Karthigesu JA which I have cited in para 12 above).30.    If not for the oral request for an extension of time to file the\n\nDefence which was acceded to and the manner in which the Defendant’s application for\n\nan extension of time was drafted, I would have granted the Defendant an extension of time\n\nto file her Defence until after the outcome of her appeals. However, in the light of these\n\nfactors, I ordered her to file her Defence within a certain time frame on the undertaking\n\nof Plaintiffs’ Counsel not to treat this as a submission to the jurisdiction of the\n\nSingapore court, but I ordered a stay of all other steps in the present action pending the\n\noutcome of her appeals. I also made a consequential order to ensure that she did not try\n\nto take undue advantage of her right to appeal to the Court of Appeal. If her request for\n\nfurther arguments was not successful, she was to file the Notice of Appeal, if any, within\n\na shorter time frame than the usual period should she wish the stay order to continue to\n\napply. This did not mean that the time to file the Notice of Appeal was reduced. The usual\n\ntime frame remained, but if she wanted the stay order to continue to apply, she had to\n\ndecide sooner, rather than later, whether she was going to appeal to the Court of Appeal.31.    I also granted the parties liberty to apply and made other\n\nconsequential orders on costs.Sgd:Woo Bih LiJudicial CommisionerCopyright © Government of Singapore."
    }
}