{
    "case_title": "Wan Kim Hock v Public Prosecutor",
    "ncitation": "[2002] SGHC 296",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Introduction": "The appellant was\n\nconvicted on one charge of criminal breach of trust under s 408 of the Penal Code, Cap\n\n224. He appealed against his conviction and sentence. I dismissed his appeal and now give\n\nmy reasons.",
        "Background": "2        The appellant was the\n\nfinance administration manager of Stoval Technologies (‘Stoval’). He had two\n\nother staff and a part-time assistant under him as well as the Human Resource Department\n\nto support him. He was placed in charge of the petty cash account in August 2000 when\n\nKaren, one of Stoval’s accounts executives, resigned. He remained in charge of the\n\npetty cash account until he resigned in December 2000.",
        "Prosecution’s case": "3        In early December 2000, a\n\nnew accounting software was installed at Stoval. As a result, Choo Len, another of\n\nStoval’s accounts executives, discovered some discrepancies in the petty cash\n\naccount. She informed Alex, the chief executive officer and managing director of Stoval.4        Choo Len was then\n\ninstructed to verify the problem. Upon receiving confirmation that there were indeed\n\ndiscrepancies, Alex confronted the appellant. The appellant immediately told Alex that he\n\nwas resigning and handed over a hand-written resignation letter.5        Thereupon, Alex asked that\n\nthe appellant hand over the petty cash account to another member of his staff. A few hours\n\nlater, the appellant prepared a four-page statement of accounts for the petty cash account\n\nwhich showed a positive balance of $1012.68. After deducting some transportation payments,\n\nthere was a balance of $984.56. However, this balance was missing and the appellant\n\nproposed that the company deduct it from his salary.6        Alex did not accept the\n\nappellant’s proposal and appointed Kelvin, an accountant, to check the statement of\n\naccounts. By early 2001, Kelvin discovered that there was in the statement of accounts a\n\nS$10,000 payment voucher that was not approved or signed by any of Stoval’s\n\ndirectors. In addition, there was also a S$5,000 cheque due and payable into the petty\n\ncash account which was not reflected in the statement of accounts prepared by the\n\nappellant.7        The matter was referred to\n\nStoval’s board of directors who decided that a police report should be made. Kelvin\n\nthen made a police report which resulted in the appellant’s arrest.",
        "The appellant’s defence": "8        The appellant, in his\n\ndefence, admitted that there was a shortfall of $15,000 in the petty cash account. He\n\ndenied however that he had taken the money. He claimed that the shortfall had arisen\n\nbecause he had been too busy to update the petty cash account on a daily basis and thus\n\nthere were petty cash payments which had been made but had not been recorded.9        The appellant further\n\nclaimed that he had been forced to resign by Alex as a result of his having informed\n\nJohnny, another of Stoval’s directors, that Alex had withdrawn $200,000 from the\n\ncompany’s funds. Furthermore, the appellant claimed that he had been allowed by Alex\n\nto take the balance in the petty cash account for his personal expenses.",
        "Decision below": "10        At the conclusion of the\n\ncase, the trial judge accepted the evidence given by the prosecution’s witnesses as\n\nshe found them to be straightforward and truthful and their evidence to be consistent and\n\ncorroborated. In comparison, she rejected the appellant’s defence as she found the\n\nappellant to be evasive and untruthful.11        In addition, she found\n\nthat the appellant had fabricated evidence to support his allegations that monies had been\n\npaid out which clearly demonstrated his dishonest intention to conceal his conversion of\n\nthe missing sums. She thus convicted the appellant on the charge.12        In passing sentence, the\n\ntrial judge took into account the appellant’s lack of antecedents, the quantum of\n\nmoney involved, the appellant’s attempts to cover up his misdeeds and his lack of\n\nremorse or restitution and sentenced him to a term of imprisonment of 14 months.",
        "Appeal against conviction": "13        The appeal against\n\nconviction turned entirely on the trial judge’s finding that the appellant had\n\ndishonestly misappropriated or converted the petty cash to his own use. In particular, the\n\nappellant challenged the findings of the trial judge that:(a) the prosecution witnesses’ evidence was consistent;(b) the appellant had resigned after being confronted by Alex;(c)    the balance in the petty cash account was missing; and(d)    the omission of the two cheques in the statement of accounts was\n\n    deliberate.14        Lastly, the appellant also\n\nappealed against his sentence as being manifestly excessive.",
        "The law on an appeal against findings of fact": "15        It is trite law that an\n\nappellate court should be slow to overturn the trial judge’s findings of fact, in\n\nparticular where these findings depend on an assessment of the credibility and veracity of\n\nthe various witnesses, unless these findings can be shown to be plainly wrong or against\n\nthe weight of the evidence.16        I have previously stated\n\nthis inPP v Azman bin Abdullah(1998) 2 SLR 704and it bears remembering\n\nthat:It is well-settled law that in any appeal against a finding of fact, an\n\n    appellate court will generally defer to the conclusion of the trial judge who has had the\n\n    opportunity to see and assess the credibility of the witnesses. An appellate court, if it\n\n    wishes to reverse the trial judge’s decision, must not merely entertain doubts\n\n    whether the decision is right but must be convinced that it is wrong.17        With this in mind, I will\n\nnow examine the arguments raised at appeal.",
        "(a)    Whether the prosecution witnesses’ evidence\n\nwas consistent": "18        The appellant sought to\n\nraise several inconsistencies in the prosecution witnesses’ evidence to rebut the\n\ntrial judge’s finding that their evidence was consistent. However, I found that the\n\ninconsistencies that the appellant sought to rely on in his appeal were minor and did not\n\naffect the crux of the case against the appellant. In contrast, I found that the\n\nappellant’s testimony was riddled with material inconsistencies. For example, the\n\nappellant indicated that the missing money could have been payments to major big\n\nsuppliers; yet, when questioned, he was unable to name any such suppliers.",
        "(b)    Whether the appellant had resigned after being\n\nconfronted by Alex;": "19        The appellant challenged\n\nthis finding on the basis that it was inherently improbable that he would become so\n\nunhappy as to resign, merely because Alex had questioned him about the petty cash account.\n\nI was unable to accept this contention. Instead, common sense dictated to me that, rather\n\nthan being inherently improbable, the appellant’s immediate resignation was strongly\n\nindicative of his guilty conscience and his desire to depart immediately from the scene of\n\nthe crime.20        Furthermore, I found the\n\nappellant’s explanation for his resignation difficult to accept. He was unable to\n\nshow why Alex would have been so displeased, as to demand his resignation, over the minor\n\nmatter of the appellant informing Johnny about the cashing of the cheque when there was no\n\nevidence that there was anything improper about the transaction.",
        "(c)    Whether the balance in the petty cash account was\n\nmissing": "21        The appellant argued that\n\nthis finding was against common sense because, if this was true, Alex would simply not\n\nhave allowed the appellant to leave. I found this argument to be without merit. On the\n\nfacts, the appellant had left only after agreeing for the company to deduct the balance\n\nowing from his salary. As such, there was no reason why Alex would not have let him leave.\n\nFurthermore, Alex had wanted to conduct further investigations into the petty cash account\n\nand this would clearly have been easier without the appellant being present.22        As for the\n\nappellant’s story of being allowed to take the monies in the petty cash account, I\n\nwas plainly incredulous. It was inconceivable that Alex would have allowed the appellant\n\nto have taken the entire amount remaining in the petty cash account, thereby emptying out\n\nthe entire petty cash account to the possible detriment of Stoval. This conclusion was\n\nreinforced when viewed against the backdrop of the events which had led Alex to confront\n\nthe accused in the first place.",
        "(d)    Whether the omission of the two cheques in the\n\nstatement of accounts was deliberate": "23        The appellant repeated his\n\narguments that he had used in the Court below that his omission was the result of\n\nnegligence. Like the trial judge, I found this argument to be of little merit. The\n\nappellant was an experienced accountant with about 25 years of experience. It was\n\nunimaginable that he would be so overworked as to not have the time to maintain the petty\n\ncash account given that it was not a difficult task involving only the preparation of\n\npayment vouchers and getting them either approved or signed. Furthermore, there was no\n\nsupporting evidence that any other aspect of financial management was similarly ignored by\n\nthe appellant.24        As such, given the ample\n\nevidence supporting the trial judge’s finding of facts, I found no reason to\n\ninterfere with any of the trial judge’s findings or her conclusion that the appellant\n\nhad dishonestly misappropriated or converted the monies in the petty cash account to his\n\nown use.",
        "Appeal as to sentence": "25        The appellant first argued\n\nthat the trial judge had wrongly taken into account the fact that he had claimed trial and\n\ncitedKuek Ah Lek v PP(1995) 3 SLR 252in support.26        I found the\n\nappellant’s argument to be flawed. The case ofKuek Ah Lekdoes not stand for\n\nthe proposition that the Court can never take into account the fact that the appellant had\n\nclaimed trial. Rather it indicates that where the appellant claims trial for a valid\n\nreason such as a viable defence, he should not be prejudiced for doing so.27        However, in this appeal,\n\nthe situation was different. The appellant had subjected the prosecution witnesses to an\n\nexhaustive and extensive cross examination in a failed attempt to find supporting\n\nevidence. In addition, he even accused one of the prosecution witness of wrongdoing. In\n\nview of such a defence, it must have been correct for the Court to take into account the\n\nfact that he had claimed trial.28        Secondly, the appellant\n\nsought to draw fromSoong Hee Sin v PP(2001) 2 SLR 253,a case where the\n\naccused was sentenced to a term of imprisonment of nine months, a sentencing tariff to\n\nillustrate that the sentence was manifestly excessive. I found that this argument did not\n\nlend much strength to his appeal. The process of sentencing is a matter of law that\n\ninvolves manifold factors such that no two cases would ever be totally identical for the\n\npurposes of sentencing. Thus, while past cases are clearly helpful in providing guidelines\n\nfor the Court, that is all that they are, mere guidelines. In sentencing the offender, the\n\nCourt must look to each case on its unique facts.29        In any case,Soong Hee\n\nSincan be easily distinguished. First, that was a case in which the accused\n\nmisappropriated a lesser sum of S$10,485.22 as opposed to S$15,000 in the present appeal.\n\nSecondly, the accused there had pleaded guilty immediately.30        Lastly, I noted that in\n\nmitigation, it could only be said of the appellant that he had no previous antecedents.\n\nThis factor while normally forceful must be balanced against the numerous aggravating\n\nfactors such as the appellant’s failure to make restitution, his lack of remorse\n\nthroughout the entire trial and the fact that he had fabricated evidence in an attempt to\n\nescape liability.31        As such, I found that the\n\nsentence imposed was not manifestly excessive especially when all the factors were\n\ncollectively taken into consideration.",
        "Conclusion": "32        For the reasons given\n\nabove, I was of the opinion that there was no merit in the appeal. Thus the appeal against\n\nconviction and sentence was dismissed and the sentence imposed by the trial judge was\n\naffirmed.Sgd:YONG PUNG HOWChief JusticeCopyright © Government of Singapore."
    }
}