{
    "case_title": "Roberto Building Material Pte Ltd & Others v Oversea-Chinese Banking Corporation Limited & Another",
    "ncitation": "[2002] SGHC 291",
    "coram": "Lai Kew Chai J",
    "sections": {
        "Parties": "2\n\n        The 1stplaintiff (\"the\n\ncompany\") is a company incorporated in Singapore. Its primary business is the supply\n\nof building materials, tiles in particular, to local and foreign construction companies.\n\nThe 2nd, 3rdand 4thplaintiffs are directors of the\n\ncompany. The 2nd, 3rdand 4thplaintiffs collectively own\n\n100% of the paid up of $5 million of the company. Prior to the receivership of the\n\ncompany, the 2ndplaintiff, Mr Tan Heng Yong, was in control of the business of\n\nthe company. The 3rdand 4thplaintiffs are the wife and brother\n\nrespectively of Mr Tan Heng Yong.3\n\n        The 1stdefendant,\n\n(\"OCBC\") is an established bank in Singapore, appointed the 2nddefendant (\"Mr Don Ho\") on 22 April 2000 April 2000 to be the Receiver and\n\nManager (\"R&M\") of the company in respect of the property, assets and\n\nundertakings charged under a Deed of Debenture dated 8 May 1999.",
        "The factual matrix": "4\n\n        The factual matrix was not substantially\n\ndisputed and in my view it is accurately set out in the closing submissions of OCBC as\n\nfollows. Sometime in November 1995, Four Seas Bank Ltd granted banking facilities of $31\n\nmillion to the company. As security, the company executed a first mortgage over the\n\nproperty at 7 Tai Seng Drive, Singapore (\"the mortgaged property\") which was\n\nbuilt to house the company’s business operations. The banking facilities were also\n\npersonally guaranteed by the Mr Tan Heng Yong, 3rdand 4thdefendants pursuant to a joint and several letter of guarantee dated 13 March 1996. On 12\n\nMay 1998 Four Seas Bank Ltd was merged with OCBC; it is not disputed that all rights and\n\ninterests of Four Seas Bank Ltd were vested in OCBC.5\n\n        In May 1998 the sums owed by the company stood\n\nat $33,100,000.00 which was about $2 million above the limit of $31 million. In June and\n\nJuly 1998, at the request of OCBC, the company managed to reduce the outstanding sums to\n\nabout $31 million.6\n\n        Subsequently, OCBC required the liabilities to\n\nbe reduced by a further $3 million by way of a monthly reduction of $600,000.00 for 5\n\nmonths, commencing 31 August 1998. The company accepted this requirement and stated that\n\nit was committed to lowering its borrowing by a further $3 million, but requested that the\n\nmonthly reductions should start on 30 September 1998 instead of 31 August 1998. OCBC\n\nagreed to this request. The company also requested that there be no further reduction of\n\nthe credit line. However, OCBC expressly declined to give any such commitment.7\n\n        On 16 December 1998 the company appointed Price\n\nWaterhouse (\"PW\") as its financial consultant to conduct a financial evaluation\n\nof the company. On 5 March 1999, OCBC\"s Mr Martin Chua attended a meeting with\n\nrepresentatives of PW. PW reported that there were major operational and financial issues\n\nin relation to the company’s business, including an excessive level of stocks and\n\nlack of proper cash flow management.8\n\n        OCBC concluded that the company should provide\n\nfurther security in addition to the mortgage over the mortgaged property. As the company\n\nwas holding vast quantities of stocks and a high level of uncollected receivables, the\n\nmost obvious and appropriate form of additional security the company could provide was to\n\ngrant a fixed and floating charge over the assets of the company in favour of OCBC. The\n\ngrant of the fixed and floating charge was also recommended by PW.9\n\n        At a meeting on 6 March 1999, OCBC informed the\n\ncompany that it required the company to execute a debenture giving fixed and floating\n\ncharges over its assets and undertaking in favour of OCBC. OCBC also emphasized to Mr Tan\n\nHeng Yong of the company that he needed to urgently look into improving the cash flows of\n\nthe company and that the company’s high levels of stock had to be reduced. The\n\ndebenture was executed by the company on 5 May 1999.10\n\n        On 1 April 1999 OCBC internally decided on a\n\nstrategy in relation to the management of the company’s account. It was decided that\n\nthe company would restructure the banking facilities granted to the company subject to the\n\ncompany committing to take the action steps recommended by PW.11\n\n        Contemporaneously or thereabouts, PW’s\n\nFinancial Evaluation Report dated 31 March 1999 had made the following recommendations:(a)    Implementation of new\n\n    inventory holding policies to reduce the level of inventory and avoid stock obsolescence;(b)    implementation of\n\n    additional credit controls to reduce the bad and doubtful debts;(c)    a fixed and floating charge\n\n    over the company’s remaining assets should be granted to OCBC to enhance security\n\n    cover and avoid penalty interest being payable; and(d)    certain initiatives were to\n\n    be put in place to generate additional funds of $3.9 million which were to be used to\n\n    repay OCBC.12\n\n        At a meeting on 5 May 1999 Mr Tan Heng Yong of\n\nthe company and representatives of PW and OCBC discussed PW’s recommendations that\n\nthe company should look into improving the cash flows for the business through a stock\n\nreduction programme and a more stringent credit control policy to recover the\n\ncompany’s receivables. PW informed the company that OCBC would consider restructuring\n\nthe banking facilities in due course if the company continued to take steps recommended by\n\nPW and reasonably met the targets and/or objectives set, when there were stock reductions\n\nand improved collection of receivables.13\n\n        On the evidence, in May and June 1999,\n\nOCBC’s intention was to monitor the situation and, if the company implemented the\n\nrecommendations of PW and reduced the outstanding sums by at least $950,000 by the end of\n\nthe September 1999 through run down of old inventory and collection of overdue\n\nreceivables, OCBC would consider restructuring of part of the overdraft facility into a\n\nterm loan in the latter part of 1999. This strategy was recorded in OCBC’s credit\n\nstrategy memorandum dated 1 June 1999. As recommended by PW, the company executed a\n\ndebenture on 5 May 1999 in favour of OCBC to improve the security cover to OCBC.14\n\n        I now come to the company’s failure to\n\ncomply with the PW recommendations. At the next meeting on 4 June 1999, PW’s\n\nrepresentatives had a discussion with OCBC’s officers prior to the arrival of Mr Tan\n\nHeng Yong and advised that the company’s stocks had actually increased and that,\n\nalthough the amount owed by debtors had decreased, such decreased was attributable to\n\nwrite-offs rather than actual collections. When Mr Tan Heng Yong joined the meeting, he\n\nwas informed that OCBC was not happy with the progress of the stock reduction and was\n\nshocked to hear that, instead of stock reduction, there had been new purchases of $3.8\n\nmillion. The representatives of OCBC reminded Mr Tan Heng Yong that OCBC would not\n\ncontinue to support the company if no significant reduction in stocks was made, and told\n\nthe company that OCBC wanted the stocks to be reduced by at least $750,000 per month\n\ncommencing June 1999.15\n\n        On 29 June 1999, OCBC’s officers had a\n\nmeeting with PW and was informed that the company would be purchasing another $3 million\n\nin stocks. This was contrary to the reduction of $750,000 per month required by OCBC and\n\nadvice to the company at its previous meeting. On 1 July 1999 OCBC concluded that the\n\ncompany was not serious in implementing the PW recommendations and OCBC suspended the\n\ncredit line of the company.16\n\n        Mr Tan Heng Yong and OCBC’s officers met\n\non 5 July 1999. He asked if OCBC would support the company and look into the restructuring\n\nof the banking facilities. OCBC’s officers replied that it had yet to see the company\n\nimplementing the recommendations of PW. According to Ms Goh Hooi Khim, the then Head of\n\nthe Non-Performing Asset Management Unit of OCBC, Mr Tan Heng Yong then asked whether OCBC\n\nwould agree to another bank taking over the company’s banking facilities and OCBC\n\nofficers replied that OCBC would be happy for the company to do so. Mr Tan on the other\n\nhand claimed that it was a requirement of Ms Goh. I am persuaded to accept Ms Goh’s\n\nversion: the contemporaneous minute reflected this and this was consistent with a letter\n\nof 16 July 1999 written by OCBC. A time frame of 6 months was indicated. By letter of 16\n\nJuly 1999 OCBC granted the company till 30 September 1999 to provide OCBC with\n\nsatisfactory evidence of a commitment from another financial institution for the full\n\nrefinancing of all amounts owing by the company to OCBC.17\n\n        In August, 1999 another piece unsatisfactory\n\nnews, hardly capable of inspiring confidence in any banker, came to the notice of OCBC.\n\nThe company’s Directors’ Report and Audited Financial Statements for the year\n\nended 31 March 1998 were issued. In the report of the company’s auditors, Ernst &\n\nYoung, on the company’s financial statements, it was stated that the auditors could\n\nnot satisfy themselves as to the stock quantities and their value as at 31 March 1998 and\n\nthe adequacy of the provision for stock obsolescence by other audit procedures. It was\n\nalso pointed out that the company had incurred a net loss of $4.8 million for the year\n\nended 31 March 1998 and its current liabilities exceeded its current assets by $13.2\n\nmillion, and that these factors raised substantial doubt that the company would be able to\n\ncontinue as a going concern. The Notes to the Accounts further stated that $469,293.00 in\n\nbad debts had been written off and a substantial provision of $5.5 million had been made\n\nfor doubtful debts.18\n\n        The company was reminded in late September,\n\n1999 to reduce the levels of inventory and the receivables and was informed that OCBC was\n\nwilling to consider restructuring the banking facilities only if the company took steps to\n\naddress the issue. By 30 September, 1999 the company failed to procure alternative\n\nrefinancing and sought an extension to 30 November 1999. OCBC agreed.19\n\n        On or about June 1999 the company appointed Mr\n\nFrancis Lee from Corporate Venture Pte Ltd as its consultant. His mandate was to rescue\n\nthe company and in his meeting with OCBC he indicated that he was studying the\n\ncompany’s financials before he could work towards obtaining a firm commitment from\n\npotential bankers or investors. On 9 November 1999, Mr Tan Heng Yong met with\n\nrepresentatives from PW and OCBC and again they requested for extension of time to procure\n\nalternative re-financing. OCBC informed the company verbally through Mr Tan Heng Yong and\n\nin a letter that refinancing had to be secured by 31 December 1999. By 31 December 1999,\n\nhowever, the company failed to provide any evidence and the company did not give any\n\nexplanation for its failure to do so.20\n\n        In early 2000 two developments placed\n\nOCBC’s security in the mortgage in jeopardy. On 15 January 2000 OCBC received a\n\nletter from the Inland Revenue Authority of Singapore (\"IRAS\") that there was\n\noutstanding property tax of $884,102.91 in respect of the mortgaged property and that, if\n\nno payment of the tax arrears of $664,862.91 was received by 21 January 2000, action would\n\nbe taken to sell the mortgaged property. On 22 February 2000 OCBC also received another\n\nletter from Jurong Town Corporation (\"JTC\"), the lessor of the mortgaged\n\nproperty, that if the sum of $366,766.53 in arrears of rent was not paid within 48 hours,\n\nJTC would assume that OCBC was forfeiting its rights as mortgages and legal proceedings\n\nwould be instituted against the company to recover all sums due and to take possession of\n\nthe mortgage property. As JTC was legally entitled to forfeit the lease and extinguish\n\nOCBC’s security over the mortgaged property OCBC had no alternative but to pay the\n\noutstanding rent arrears of $366,766.53.21\n\n        The company failed to keep their commitments.\n\nIt had written to PW on 26 December 1999 indicating that it would be receiving the sum of\n\n$1,061,984.49 by the end of January 2000 and the sum of $1,973,169.04 by the end of March\n\n2000 and that it would forward these sums directly to OCBC. ON 6 March 2000 the company\n\nwrote to OCBC and informed OCBC that it was expecting the sum of $150,000 on or about 15\n\nMarch 2000 from one of its customers. The company also provided OCBC a schedule of\n\nexpected collections of its receivables for the period from 4 February 2000 to 31 March\n\n2000. Apart from two payments totaling $66,000.00 the company failed to make any of the\n\npayments promised. In the circumstances, OCBC wrote to the company firmly indicating that\n\nif the company failed to pay the sum of $2,998,840.31 being the total collections\n\nindicated by the company less the payments by 31 March 2000, failing which OCBC would have\n\nno alternative but to take steps to protect their interests. The company failed to comply\n\nwith the notice.22\n\n        When the company failed to pay the promised\n\nsums, OCBC decided to enforce its rights as mortgagee and appoint a receiver and manager.\n\nThe reasons behind the decision was recorded in an internal memorandum. By letters dated 3\n\nApril 2000 to the company OCBC made demands against the plaintiffs for the outstanding sum\n\nof $32,921,485.06 as at 31 March 2000. It gave the plaintiffs 14 days to make payment. Not\n\nunexpectedly, the company and the individual guarantors, namely the 1st, 2nd,\n\n3rdand 4thplaintiffs, failed to pay.23\n\n        By letter of 11 April 2000 Ernst & Young\n\n(\"EY\"), who had been appointed as the company’s auditors in March/April\n\n1998, informed OCBC that DTZ Debenham Yie Leung (\"DTZ\") had been appointed to\n\nsell the mortgaged property and that there was a potential purchaser. By a further letter\n\nof 17 April 2000 EY informed OCBC that DTZ found two prospective purchasers for the\n\nmortgaged property, namely Singapore Telecommunication Ltd and Chelsfield plc, acting on\n\nbehalf of Global Switch s.a.r.l. EY informed OCBC that the company had advised it that\n\nChelsfield was scheduled to revert with an offer for the mortgaged property on Thursday,\n\n20 April 2000. However, OCBC did not receive any offer from Chelsfield plc on 20 April\n\n2000 nor any other serious indication of interest.24\n\n        On 22 April 2000 (Saturday), OCBC exercised its\n\nrights under the debenture and appointed the 2nddefendant, Mr Don Ho Mun-Tuke.25\n\n        The plaintiffs alleged in this case that OCBC\n\nhad been so recklessly indifferent that such reckless indifference amounted to bad faith\n\non its part. They further made the crucial allegation that the appointment of the receiver\n\nand manager caused Chelsfield plc to loose complete interest in the mortgaged property.\n\nThis basic allegation of the plaintiffs was not at all borne out by the evidence. The\n\ntruth of the matter was that according to Mr Shaun Poh of DTZ, who were marketing the\n\nmortgaged property for the company, Chelsfield plc bought a neighbouring building instead.\n\nChelsfield plc was in Singapore to buy more than one industrial building. In my judgment,\n\nthe appointment of the receiver and manager did not derail the prospective sale to\n\nChelsfield plc; at the worst, the appointment might have depressed the price, but that was\n\nnot the basis of the complaint of the plaintiffs.26\n\n        The evidence disclosed that appointment of the\n\nreceiver and manager was made after all relevant considerations were taken into account.\n\nIn my view, OCBC had no viable alternative and had to protect its own interest. On behalf\n\nof the plaintiffs, attention was drawn to an internal e-mail of 26 April 2000 sent by Mr\n\nGregory Pau to Ms Goh Hooi Kim. That e-mail contained an analysis of the issues by Mr Pau\n\nand he engaged in scenario planning when he stated that OCBC would still recover if the\n\nsale price was to fall as low as $23 million. Upon this narrow basis, the submission was\n\nmade that OCBC did not care if it \"spooked\" the prospective sale so long as it\n\nobtained $23 million for the mortgaged property.27\n\n        Mr Francis Lee, in giving evidence for the\n\nplaintiffs, testified that on 24 April 2000 he met with Mr Don Ho and suggested that OCBC\n\nwithdrew the appointment of the receiver and manager to enable the prospective sale of the\n\nmortgaged property to Chelsfield plc to materialize. He also suggested that Mr Don Ho\n\ncould be constituted a ‘Special Accountant’ with special powers to protect the\n\ninterests of OCBC. OCBC took legal advice and rejected the suggestion. It was seen as an\n\nprivate arrangement which did not satisfy OCBC’s desire to seek protection under the\n\nstatutory scheme of receivership and it was not prepared to be a party to such an\n\nalternative arrangement. In any case, Mr Lee’s suggestion had a rather short\n\nlife-span because the company and the other plaintiffs by their solicitors’ letter of\n\n27 April 2000 offered the payment of $1 million to OCBC by cashier’s order if OCBC\n\nwould in return terminate the receivership for a period of 45 days in order to secure the\n\nsale of the mortgaged property to Chelsfield plc’s principal, Global Switch. OCBC\n\nexplained that it was not prepared to undertake that exposure.28\n\n        Following his appointment as receiver and\n\nmanager, Mr Don Ho examined the financial state of affairs of the company and considered\n\nthe future course of the receivership. Very quickly, he came to the conclusion that the\n\ncompany was a loss-making concern, as it had been for a few years preceding his\n\nappointment. The management accounts made up to 30 March 2000 showed that the company had\n\nnet book current liabilities amounting to $3,592,714.68. The audited accounts and the\n\ndraft audited accounts for the years 1998 and 1999 showed that the company had made losses\n\nof $4,819,198.00 and $4,574,089.00 respectively. Further, the company’s sales orders\n\nwere declining and from October 2000 onwards, the sales of the company did not even match\n\nthe overheads of the company. According to PW’s Information Memorandum the following\n\nwere the financial data of the company:(a)    though the stock had a book\n\n    value of $20.7 million, a provision of $4.6 million had to be made for stock obsolesce;(b)    $5.1 million or 42% of the\n\n    total trade debts of $12.1 million were doubtful debts and had to be provided for against\n\n    the backdrop of poor credit controls and poor recoverability of export sales;(c)    there were receivables\n\n    amounting to $2.2 million (half of which had been outstanding by more than 720 days) owed\n\n    by Roberto Building Material (Brunei) Sdn Bhd and Roberto Cambodia Co Ltd [Mr Tan had a\n\n    personal interest in these debtors as he was prepared to provide a personal guarantee for\n\n    the outstanding amounts];(d)    the company’s turnover\n\n    had declined significantly from $42.7 million for year ended 31 March 1998 to a projected\n\n    $27 million for the ensuing financial year ended; and(e)    trust receipts had been\n\n    overdue since September 1997 and the total amount of $14.3 million was owing on such\n\n    overdue trust receipts.29\n\n        It is settled law that the receiver is not\n\nobliged to carry on business. He can decide instead to close it down. In making these\n\ndecisions he is entitled to have regard to the interests of the debenture holder. As\n\nstated inMedforth v Blake[2000] Ch 86 at 93: \"Provided he acts in good\n\nfaith, he is entitled to sacrifice the interests of the mortgagee in pursuit of that\n\nend\". The same principle applies in the case of the debenture holder. There is no\n\nevidence of any lack of good faith on the part of Mr Don Ho. He sold the stocks according\n\nto expert auctioneer advice at public auctions. Mr Tan gave such assistance as he could.\n\nMr Don Ho wound up the business of the company as efficiently as he could. It was further\n\nalleged that he had failed to realize payment of concluded contracts for the sale of tiles\n\nto one Top Treasure International Ltd (\"Top Treasure\") of US$1.2 million and\n\nUS$1.8 million dated 18 April 2000. The plaintiffs further alleged that Mr Don Ho failed\n\nto realise payment on an outstanding letter of credit of $1,982,400.00. The two contracts\n\nwere not disclosed by Mr Tan and Mr Don Ho did not know anything about them at the\n\nmaterial time. I am of the view that Mr Tan must bear responsibility if the contracts were\n\nvalid and enforceable. As for the letter of credit, the credit would only be available if\n\nthe company had delivered the tiles to the warehouse nominated by the accountee of the\n\nletter of credit. No such delivery by the company had been effected for the simple reason\n\nthat the alleged buyers did not nominate the warehouse to which delivery of the tiles\n\ncould be made. As this pre-condition was not satisfied, there was no question of Mr Don Ho\n\nhaving failed to negotiate the letter of credit. Nor could Mr Don Ho be criticised for not\n\ntaking any legal action. Mr Tan’s reliability as an ally in any such litigation was\n\nin doubt and it was reasonable to have entertained such doubts. To say the least, Mr Tan\n\nwas in a state of denial so far as the parlous financial affairs of the company were\n\nconcerned.30\n\n        Turning to the plaintiffs’ case against\n\nOCBC, it has been pared down substantially at the trial. In summary, there were three\n\ncomplaints. First, OCBC had acted with reckless indifference to the rights and interests\n\nof the plaintiffs when it decided to appoint the receiver and manager. Alternatively, its\n\ndecision was outside the range of decisions a reasonable commercial man would have made.\n\nOn either or both bases, OCBC did not act in good faith. The second complaint was that in\n\nserving the letter of demand on 3 April 2000 and appointing the receiver and manager on 22\n\nApril 2000, OCBC did not give the company reasonable time to repay the sums owed to it.\n\nThis complaint raises the important issue whether the law in Singapore is predicated upon\n\nthe stricter and more certain ‘mechanics of payment’ test or a more malleable\n\nconcept of ‘reasonable time’ which should be defined by reference to all the\n\ncircumstances. Thirdly, the plaintiffs alleged that in choosing to appoint Mr Don Ho as\n\nthe receiver and manager OCBC was liable to the plaintiffs for not appointing a competent\n\nand qualified person possessing the special skills required to run and manage the\n\ncompany’s business which was highly specialised.31\n\n        I turn to the first complaint. It was common\n\nground that a mortgagee or security holder, in exercising his powers under the mortgage or\n\nsecurity, owes a general duty of good faith. It was also common ground that there was no\n\ngeneral duty of reasonable care to consider or have regard to the interests of the\n\nmortgagor or its guarantors. A useful summary is in the judgment of the Privy Council inDownsview\n\nNominees Ltd v First City Corporation Ltd[1993] AC 295, 312:\"Several centuries ago\n\n    equity evolved principles for the enforcement of mortgages and the protection of\n\n    borrowers. The most basic principles were, first, that a mortgage is Security for the\n\n    repayment of a debt and, secondly, that a security for repayment of a debt is only a\n\n    mortgage. From these principles flowed two rules, first, that powers conferred on a\n\n    mortgagee must be exercised in good faith for the purpose of obtaining repayment and\n\n    secondly that, subject to the first rule, powers conferred on a mortgagee may be exercised\n\n    although the consequences may be disadvantageous to the borrower.\"32\n\n        The duty to exercise his powers in good faith\n\napplies to a debenture holder when appointing a receiver and manager.In Shamji v\n\nJohnson Matthey Bankers Ltd[1991] BCLC 36, it was alleged that on the day that the\n\ndebenture holder appointed a receiver or on the day before, the borrower had informed the\n\ndebenture holder that another bank was prepared to provide funds of 14,600,000 to\n\npartially discharge the debt of 22 million. The guarantor of the loan sued the debenture\n\nholder and applied to amend his statement of claim to incorporate the following\n\ncontentions:(a)    the debenture holder was\n\n    under a duty of care to consider all relevant matters before appointing any receiver and\n\n    manager;(b)    no reasonable banker would\n\n    have refused to allow negotiations with the other bank to continue with a view to that\n\n    bank discharging the liability of 14,600,000 and to postpone until that date appointing\n\n    a receiver and manager;(c)    the debenture holder owed\n\n    the guarantor of the loan a duty of care to take reasonable steps to ensure that its\n\n    recovery against the corporate borrower was maximised and so its recovery against the\n\n    guarantee was minimized; and(d)    the debenture holder, in\n\n    failing to consider the information as to the refinancing, breached its duty of care in\n\n    that the likely recovery against the corporate borrower would be less than the sum\n\n    available from the refinancing.33\n\n        The trial judge in refusing the amendments drew\n\na clear line between a mortgagee or security holder exercising the power to appoint a\n\nreceiver on the one hand and a mortgagee or receiver exercising the power to sell the\n\nproperty under mortgage on the other hand. He noted that the former situation involved a\n\nconflict of interests between those of the mortgagee on the one hand and those of the\n\nborrower on the other. The mortgagee or security holder has to take steps to protect its\n\ninterest whereas the mortgagor or borrower would attempt to retain possession of the\n\nproperty or business charged under the security. It must follow that that the mortgagee or\n\nsecurity holder is entitled to have regard only to his own interests. In the latter\n\nscenario, both the mortgagee and the mortgagor share the common interest of wanting to\n\nsecure the highest possible price that the market would pay for the property or business\n\nmortgaged or charged. The trial judge said: \"The appointment of a receiver seems to\n\nme to involve an inherent conflict of interest. The purpose of the power is to enable the\n\nmortgagee to take the management of the company’s property out of the hands of the\n\ndirectors and entrust it to a person of the mortgagee’s choice. That power is granted\n\nto the mortgagee by the security documents in completely unqualified terms.It seems to\n\nme that a decision by the mortgagee to exercise the power cannot be challenged except\n\nperhaps on grounds of bad faith. There is no room for the implication of a term that the\n\nmortgagee shall be under a duty to the mortgagor to \"consider all relevant\n\nmatters\" before exercising the power.\"34\n\n        I was told that Hoffmann J (as he then was) had\n\nearlier made pronouncements to the like effect in theRe Porters Oils Ltd[1986] 1 WLR 201, 206: \"The debenture holder is under no duty to refrain from exercising his\n\nrights merely because to exercise them may cause loss to the company or its unsecured\n\ncreditors. He owes a duty of care to the company but this duty is qualified by being\n\nsubordinated to the protection of his own interest.\"35\n\n        With regard to the concept of good faith, the\n\nfollowing passage of Sir Richard Scott inMedforth v Blake[1999] 3 WLR 922 bears\n\nreminder:\"I do not think that the\n\n    concept of good faith should be diluted by treating it as capable of being breached by\n\n    conduct that is not dishonest or otherwise tainted by bad faith. It is sometimes said that\n\n    recklessness is equivalent to intent. Shutting one’s eyes deliberately to the\n\n    consequences of what one is doing may make it impossible to deny an intention to bring\n\n    about those consequences. Thereapart, however, the concepts of negligence on the one hand\n\n    and fraud or bad faith on the other ought, in my view, to be kept strictly apart. Equity\n\n    has always done so. The equitable doctrine of ‘fraud upon the power’ has little,\n\n    if anything to do with fraud. Lord Herschell inKennedy v De Trafford[1897] AV 180\n\n    gave an explanation of a lack of good faith that would have allowed conduct that was\n\n    grossly negligent to have qualified notwithstanding that the consequences of the conduct\n\n    were not intended. In my judgment, the breach of good faith should, in his area as in all\n\n    others, require some dishonestly or improper motive, some element of bad faith, to be\n\n    established.\"36\n\n        As I had found earlier, the matters relied on\n\nby the plaintiffs to ground their allegations of bad faith on the part of OCBC when\n\nappointing the receiver and manager were insufficient. OCBC had to appoint as a matter of\n\nlast resort; its security was being seriously jeopardised.37\n\n        I turn next to the duty on the part of OCBC to\n\ngive reasonable time to the company to effect payment. Otherwise, it could not be said\n\nthat the company had failed to comply with the demand. Without that default, the power to\n\nappoint a receiver under the debenture could not have arisen and any appointment could not\n\nhave been valid. In the context of this case, there was some dispute on what was meant by\n\na reasonable time. Based on the Canadian case ofMister Broadloom Corporation (1968)\n\nLtd v Bank of Montreal(1979) 25 OR (2d) 198, which was approved by the Supreme Court\n\nof Canada inRonald Elwyn Lister Ltd v Dunlop Canada Ltd(1982) 135 DLR (3d) 1, it\n\nwas submitted on behalf of the plaintiffs that what constituted a reasonable time for the\n\npurposes of a demand by a debenture holder depended on seven factors: (a) the amount of\n\nthe loan; (b) the risk to the creditor of losing his money or security; (c) the length of\n\nthe relationship between the debtor and the creditor; (d) the character and reputation of\n\nthe debtor; (e) the potential ability to raise the money required in a short period; (f)\n\nthe circumstances surrounding the demand for payment; and (g) any other relevant factors.\n\nThe plaintiffs rely onMoase Produce Ltd v Royal Bank of Canada(1986) 50 Nfld\n\n& PEIR 168. But that case is miles away from the facts in this case. The facts in that\n\ncase are self-evidently entirely exceptional. The bank had approved the debtors’\n\nrepayment plan two days before the demand was served. There was only half an hour between\n\nthe service of the demand and the seizure of the debtor’s assets by the receiver. The\n\ndebtor had not defaulted on any of its loans at the time the receiver was appointed. All\n\nthese things happened against the background that the bank had applied pressure on the\n\ndebtor to execute an acknowledgement waiving its right to have reasonable time to pay and\n\nthe debtor had executed the acknowledgement under duress.38\n\n        As to the position under English law, which is\n\ndealt with inCripps (Pharmacenticals) Ltd v Wickenden[1973] 1 WLR 944 andBank\n\nof Baroda v Panessar[1987] 1 Ch 335, it is conveniently summarised in Lightman &\n\nMoss, The Law of Receivers and Administrators of Companies para 4-040 as follows:\"Under English law, a series\n\n    of first instance decisions have determined that a debenture-holder in respect of an\n\n    ‘on demand’ facility need not give the company a reasonable time to pay before\n\n    appointing a receiver. The company is merely to be allowed the necessary time during\n\n    banking hours to implement the mechanics of payment by collecting or arranging for the\n\n    transfer of the money from its bank or some other ‘convenient place’. The\n\n    company is not entitled to time to raise such money either from its bank or other sources\n\n    unless such a right is expressly conferred or must necessarily be implied to give business\n\n    efficacy to the loan agreement.\"39\n\n        The Canadian approach, as has been pointed out\n\nin English and Australian cases, suffers from the difficulties and uncertainties in the\n\nformulation of what is unreasonable time in a commercial matter. The implementation of the\n\n‘mechanics of payment’ test, which requires a short but adequate period,\n\ncommends itself to the test of a ‘reasonable time depending on all the circumstances\n\nof the case’. The latter test is imprecise and obviously capable of great controversy\n\nin implementation. To the creditor, the danger or risk of underestimating what is\n\nreasonable time is considerable; the consequences of such underestimation would mean the\n\ninvalidity of any appointment of a receiver.40\n\n        On the evidence, there was no doubt in my mind\n\nthat the time given by OCBC to the company and the guarantors was entirely sufficient for\n\nthem to have arranged repayment. That they failed to do so is no warrant for concluding\n\nthat for that reason the time was not sufficient.41\n\n        In relation to the third complaint, I have to\n\nsay that this was the most unmeritorious assertion. Mr Don Ho is a Certified Public\n\nAccountant and an ‘approved liquidator’ as defined under section 4(1) of the\n\nCompanies Act. As such he was qualified to be appointed a receiver and manager. He had\n\nacted in several cases as receivers and manager. He acted competently throughout the\n\nperiod of the receivership and management. In none of the instances complained of by the\n\nplaintiffs could I find any evidence that Mr Don Ho had fallen short of the standards and\n\nduty of care which he ought to have observed.42\n\n        It was therefore in these circumstances and for\n\nthese reasons that I dismissed the claims of the plaintiffs against both defendants.Sgd:Lai Kew ChaiJudgeCopyright © Government of Singapore."
    }
}