{
    "case_title": "Tan Kok Ing v Ang Boon Aik and Others",
    "ncitation": "[2002] SGHC 215",
    "coram": "Woo Bih Li JC",
    "sections": {
        "Introduction": "1.\n\n        There were two applications which I heard in\n\nthis action (‘the High Court action’). The first application was Summons for\n\nFurther Directions Entered No 600910 of 2002. This was filed by the Third and Fourth\n\nDefendants. The second application was Summons for Further Directions Entered No 600911 of\n\n2002 filed by the First and Second Defendants. The primary relief sought by each\n\napplication was identical i.e that the Plaintiff’s claim be struck off and his action\n\nbe dismissed, alternatively, that his damages be assessed at $0.2.        \n\nAfter hearing arguments, I allowed each application with costs by ordering that the\n\nPlaintiff's damages be assessed at $0. I also made consequential orders. The Plaintiff has\n\nappealed against my decision. I now give my written reasons.",
        "Background": "3.        The\n\nFirst Defendant is the steersman of SG611, a bumboat. The Second Defendant is the owner of\n\nSF611. The Third Defendant is the steersman of SP633F, another bumboat. The Fourth\n\nDefendant is the owner of SP633F.4.        The\n\nPlaintiff Tan Kok Ing was a passenger in SF611 on 24 November 1991 when there was a\n\ncollision between SF611 and SP633F (‘the first accident’). The Plaintiff alleged\n\nthat he suffered injuries, the most significant of which was injury to his neck and spine.5.        On\n\n27 October 1993, Mr Tan commenced his action in DC Suit No. 9633 of 1993. This action was\n\nsubsequently transferred to the High Court as Suit No 991 of 1994 i.e the High Court\n\naction. On 10 September 1996, interlocutory judgment was entered with damages to be\n\nassessed.6.        The\n\nDefendants then complained that Mr Tan was dilatory in pursuing his action and had failed\n\nto comply with various orders. Indeed, the First and Second Defendant s filed an\n\napplication on 6 April 2001 to strike out Mr Tan's claim, while the Third and Fourth\n\nDefendants applied for similar relief on 19 April 2001. On 25 June 2001, the court\n\ndeclined to strike out Mr Tan's claim but costs were awarded in favour of the Defendants.7.        On 2\n\nJune 2002, the First and Second Defendants again applied to strike out Mr Tan's claim for\n\nfailure again to comply with another order of court. On 8 January 2002, Mr Tan applied to\n\nbe allowed to file and serve a further list of documents and for an extension of time to\n\nfile the Affidavit-of-Evidence-in-Chief (‘AEIC’) of his expert and his own AEIC.8.        On\n\n16 January 2002, both applications were heard together by AR Phang Hsiao Chung. The court\n\nagain declined to strike out Mr Tan's claim but awarded costs to the First and Second\n\nDefendants. However, AR Phang made various orders including an order that the parties were\n\nto file and serve a further list of documents, if any, by 6 February 2002. There was also\n\nan unless order i.e. that if the Plaintiff should default, his damages would be assessed\n\nat $0.9.        Mr\n\nTan filed and served a further list of documents by 6 February 2002. He was apparently one\n\nminute late in his service, but no issue was taken by the Defendants on this.10.        The\n\nFirst and Second Defendants appealed against AR Phang’s order of 16 January 2002 and\n\nthe Third and Fourth Defendants appealed against the extension of time granted by AR Phang\n\nto Mr Tan. Both appeals were heard by me on 27 March 2002. After hearing arguments, I\n\ndismissed both appeals and made various orders. One of the orders I made was at the\n\nrequest of Mr Tan’s counsel. This was to extend time for service of Mr Tan’s\n\ndocuments to 7 February 2002 to avoid any argument arising from the late service of one\n\nminute. There is no appeal against my orders made that day.11.        \n\nHowever, there was subsequently an important development. Mr Charles Ezekiel, Counsel for\n\nthe Third and Fourth Defendants said he happened to see another Counsel Ms Adeline Chong\n\none morning. He was inspecting a court file and noticed that Ms Chong was inspecting the\n\ncourt file in relation to the High Court action. He asked her why she was doing so and she\n\nsaid that she was acting for a defendant in a motor accident on 11 July 1997 (‘the\n\nsecond accident’). In the second accident, Mr Tan was a passenger in a pick-up which\n\nwas involved in a collision with another vehicle that day. Mr Tan had filed his claim\n\narising from the second accident in the Magistrate's Court in 2000 (‘the MC\n\naction’). Eventually Mr Ezekiel obtained a copy of Mr Tan's AEIC filed in the MC\n\naction and some other medical reports in respect of Mr Tan’s condition after the\n\nsecond accident. By then, it was late April 2002 and Mr Joseph Tan, Counsel for the First\n\nand Second Defendants in the High Court action, came to learn about the second accident\n\nand the MC action from Mr Ezekiel.12.        As\n\na result, the two applications I have mentioned in my introduction were filed on 22 May\n\n2002. For the First and Second Defendants, this was their third application to strike out\n\nMr Tan’s claim and for the Third and Fourth Defendants, this was their second\n\napplication.",
        "The reasons for the two\n\napplications": "13.        The\n\ncrux of the two applications was Mr Tan’s omission to disclose two important\n\ndocuments or sets of documents which the Defendants discovered only after they learned of\n\nthe MC Action.14.        The\n\nfirst was a letter dated 16 September 1997 from one of Mr Tan’s previous employers\n\nMarunda Utama Engineering Pte Ltd (‘Marunda’). In summary, that letter accused\n\nhim of irresponsible conduct in failing to keep in touch with Marunda after the second\n\naccident and after Marunda’s last conversations with him on 29 and 30 August 1997,\n\neven though several attempts had been made to contact him. I need only cite two paragraphs\n\nfrom that letter which was signed by Rachel Wong, a director of Marunda:‘I am shattered by your care\n\n    free attitude towards the company during your absence from work. I have always regarded\n\n    you as a responsible person and that you would have concern for the work progress in the\n\n    company. During your months of absence from duties, you have demonstrated a complete\n\n    care-free attitude as we have not received a single phone call from your end as to your\n\n    concern on projects handled by you. You have no doubt painted the impression that you are\n\n    both physically impaired in movement and speech. An attitude which up until today I find\n\n    it hard to digest. We hereby will not be giving you a one month notice or salary in lieu\n\n    of.In short, our company had\n\n    analyzed the whole situation, including your performance and had to come to the conclusion\n\n    to discontinue your service with immediate effect from 1st Sept 97.’15.        The\n\nsecond document is actually a set of documents i.e. the medical reports on Mr Tan’s\n\ncondition after the second accident.16.        The\n\nDefendants’ position was that the termination letter from Marunda was relevant\n\nbecause in Mr Tan's AEIC in the High Court action, he was suggesting that he had to leave\n\nMarunda because of his injuries arising from the first accident. The Defendants also said\n\nthat as the injuries Mr Tan complained of in relation to the second accident were similar\n\nto the first accident, the medical reports after the second accident were obviously\n\nrelevant.17.        The\n\nDefendants relied on O 24 r 16(1) of the Rules of Court which states:‘Failure to comply with\n\n    requirement for discovery, etc. (O.24, r.16).16. (1) If any party who is\n\n    required by any of the foregoing Rules, or by any order made thereunder, to make discovery\n\n    of documents or to produce any documents for the purpose of inspection or any other\n\n    purpose fails to comply with any provision of that Rule or with that order, as the case\n\n    may be, then, …, the Court may make such order as it thinks just including, in\n\n    particular, an order that the action be dismissed or, as the case may be, an order that\n\n    the defence be struck out and judgment be entered accordingly.’18.        \n\nRelying onManilal & Sons (Pte) Ltd v Bhupendra K J Shan[1989] SLR 1182, they\n\nsubmitted that Mr Tan knew that the documents were relevant and that his failure to\n\ndisclose the documents was deliberate or was so negligent as to be wilful.19.        To\n\nreinforce their submission, the Defendants stressed that not only did Mr Tan have separate\n\nlaw firms representing him in each action, he had also consulted different doctors.\n\nIndeed, his doctors in respect of the second accident appeared to be unaware of the first\n\naccident, even though his alleged injuries from each accident were similar. There was no\n\nreference in the second set of medical reports to the first accident. The use of separate\n\nlaw firms and different doctors was not innocent.20.        \n\nAside from deliberate or wilful failure, the Defendants argued that Mr Tan had in any\n\nevent failed to comply with the unless order of 16 January 2002 made by AR Phang. They\n\nargued that the fact that I had granted an extension of time on 27 March 2002 for service\n\nof documents was to meet the concern of Mr Tan’s Counsel to avoid any argument about\n\nhis service of a further list of documents one minute late, as mentioned above, and did\n\nnot make the unless order of AR Phang any less peremptory.21.        \n\nThirdly, the Defendants argued that there was a serious risk that a fair trial was not\n\npossible, even though Mr Tan was now prepared to disclose the medical reports in respect\n\nof the second accident and to undergo a medical examination by the Defendants’\n\nmedical expert, because of the time lapse of about five years between the date of the\n\nsecond accident and the applications before me.",
        "Mr Tan’s explanation and\n\nsubmission for him": "22.        Mr\n\nMuthu Kumaran, Counsel for Mr Tan, did not dispute that the alleged injuries arising from\n\nthe second accident were similar to those arising from the first accident. He also did not\n\ndispute that the documents omitted from disclosure were relevant and should have been\n\ndisclosed by Mr Tan.23.        Mr\n\nTan’s explanation was that as he was separately advised by two different firms of\n\nsolicitors, he was unaware of the relevance of the documents until the Defendants\n\ncomplained about the non-disclosure. Mr Tan said that he had not mentioned the second\n\naccident and the MC action to his first firm of solicitors because, aside from not\n\nrealising its relevance, he was also embarrassed to tell the first firm that he had\n\nanother legal case but did not ask them to handle it. He stressed that when he was asked\n\nin interrogatories in the MC action about any previous accident, he had disclosed the\n\nfirst accident and the High Court action openly.24.        He\n\nalso said that when the matter came to light, he had been advised by Mr Kumaran that as\n\nthe two actions were different, he could not disclose documents obtained in discovery in\n\nthe MC action until the two actions were consolidated, a step which he was in any event\n\nundertaking.25.        \n\nFurthermore, as regards the termination letter from Marunda, he claimed that he no longer\n\nhad a copy in his possession although he did not deny having received it after it was sent\n\nto him. He claimed he then saw a copy of it when the defendants in the MC action disclosed\n\nit. However, it was not disputed that he should have disclosed the existence of the letter\n\nas a document which had once been in his possession, even if he genuinely no longer had it\n\nin his possession.26.        Mr\n\nKumaran stressed that although Mr Tan was a marine engineer at the time of the first\n\naccident, his highest academic qualification was ‘O’ levels, which he had\n\nobtained after studying in night classes. All further qualifications were obtained from\n\ntechnical courses. There were medical reports from different doctors because, for example,\n\nMr Tan had been taken to a different hospital at the time of the second accident and the\n\nprivate practitioner he was relying on in the MC action was someone appointed by his\n\nsolicitors in that action.27.        \n\nRelying on the Litigation Library on Disclosure, Mr Kumaran submitted that the omission by\n\nMr Tan was not deliberate and was not continuing. It was due to ignorance.28.        As\n\nfor the unless order made on 16 January 2002, Mr Kumaran's position was that it was\n\npermissive and not mandatory. Also, the order pertained to documents which were created\n\nafter the prior list was filed and not to those which should have already been covered by\n\nthe prior list. Hence the unless order did not apply to existing documents.29.        Mr\n\nKumaran also submitted that it was not too late to have a fair trial because Mr Tan was\n\nprepared to disclose the documents, if he could do so legally, and to undergo a medical\n\nexamination by the Defendants’ expert.",
        "My reasons": "30.        The\n\ndocuments in question were not only relevant. They were material. Although Mr Tan only had\n\n‘O’ Level qualifications, he had undergone and passed various courses which\n\ndemonstrated that he was not the simpleton that he wanted me to believe.31.        I\n\nnoted also that Mr Tan gave no reason why he chose to instruct another firm of solicitors\n\nwhen he already had one firm acting for him in respect of the first accident. While it is\n\nthe right of any litigant to instruct whoever he wishes in respect of different causes of\n\naction, the situation before me called for an explanation. He had said he was embarrassed\n\nto tell the first firm of solicitors about the second accident but he did not say why he\n\nchose different solicitors for the second accident in the first place.32.        As\n\nfor the doctors, it may well be that he was brought to a different hospital at the time of\n\nthe second accident and the second firm of solicitors had used a different doctor from\n\nprivate practice as his expert. However, this begged the question why he did not even tell\n\nthe second set of doctors about his first accident when the alleged injuries from the\n\nsecond accident were similar to those from the first.33.        As\n\nregards Mr Tan's purported ignorance of the relevance of the documents, this was laid to\n\nrest when Mr Ezekiel pointed out during arguments to an affidavit of Edna Ngo filed on 28\n\nFebruary 2002 for Mr Ezekiel’s clients in support of an earlier application. She had\n\nmentioned in paragraphs 15 and 18 of her affidavit her concern about the delay in Mr Tan's\n\npursuit of his action and in particular the difficulty of finding out the reason why\n\nMarunda had terminated Mr Tan’s employment and whether Mr Tan had had a subsequent\n\naccident between the date of the first accident and the pending assessment of damages.\n\nThese concerns turned out to be prophetic. Mr Tan must have read Ms Ngo's affidavit.\n\nIndeed, Mr Kumaran did not suggest otherwise. Yet, Mr Tan continued to avoid disclosing\n\nthe documents.34.        As\n\nregards Mr Tan’s alleged candid response to interrogatories in the MC action, I am of\n\nthe view that he responded ‘candidly’ because he knew it was dangerous for him\n\nto lie when faced with a specific question about any other accident he had suffered.\n\nIndeed, when faced with that interrogatory, and since he chose to answer it, he must have\n\nrealised by then, if not earlier, the importance of one accident to the other and vice\n\nversa. His answer to the interrogatories in the MC action was on 20 March 2002 and yet\n\nwhen Mr Kumaran appeared before me on 27 March 2002, Mr Tan still had not told Mr Kumaran\n\nabout the second accident and the medical reports pertaining thereto.35.        \n\nThere was no doubt in my mind that Mr Tan was aware of the relevance and materiality of\n\nthe documents. In my view, Mr Tan's choice of different solicitors and his failure to\n\ndisclose to either of them the other accident and the failure to disclose to the different\n\nsets of doctors the other accident was deliberate. The fact that he filed his two actions\n\nin different courts was suspicious, to say the least.36.        \n\nAccordingly, I concluded that the omission to disclose the documents was deliberate. I did\n\nnot agree that the omission must be continuing before a court can act on the default. If\n\nso, every defaulter can quickly offer to make disclosure once his deception has been\n\ndiscovered. Each case depends on its own facts and on the facts before me, Mr Tan’s\n\nconduct satisfied me that he was culpable.37.        I\n\nwas also satisfied that Mr Tan was in breach of the unless order of 16 January 2002. I\n\nagreed that my order of 27 March 2002 did not change AR Phang’s unless order into a\n\nnon-peremptory order. Indeed, Mr Kumaran did not seriously contend that my said order had\n\nthat effect. As for the effect of AR Phang’s order, I was of the view that while it\n\nmay have been primarily intended to apply to documents created subsequent to the prior\n\nlist of documents, it was wide enough to also cover any relevant document not previously\n\ndisclosed. Furthermore, while the order did not compel Mr Tan to file a further list of\n\ndocuments, if there was no other relevant document, he was obliged to do so if there was\n\nany relevant document not yet disclosed.38.        I\n\nalso did not accept the explanation that Mr Tan could not disclose documents he had\n\nobtained during discovery in the MC action. The medical reports in respect of the second\n\naccident were in his possession. He did not obtain them from the other side. While he\n\npurportedly obtained a copy of the termination letter from the other side in the MC action\n\nduring discovery, this would in any event have jogged his memory that he once had the\n\nletter in his possession but no longer had it.39.        As\n\nMr Joseph Tan, Counsel for the First and Second Defendants, had submitted, the Plaintiff\n\nMr Tan had exhibited a copy of the termination letter in his affidavit of\n\nevidence-in-chief affirmed on 30 January 2002 in the MC action. Furthermore, in another\n\naffidavit of Mr Tan, affirmed also on 30 January 2002, to support an application to\n\ntransfer the MC action to the District Court, Mr Tan had said that he intended to file a\n\nsupplementary list of documents in the MC action which would include the termination\n\nletter. By then, he could not have forgotten about its existence or its relevance. Yet\n\nwhen he filed his further list in the High Court action on 6 February 2002, pursuant to AR\n\nPhang’s order, he still made no mention of the existence of the termination letter.40.        In\n\nany event, it is not as though Mr Tan had sought advice on these documents from Mr Kumaran\n\nprior to any complaint by the Defendants and that his omission was due solely to Mr\n\nKumaran’s advice. He had sought Mr Kumaran’s advice after his omission had been\n\ndiscovered. His reference to that advice was a red herring.41.        As\n\nfor the argument that there was a serious risk that a fair trial would no longer be\n\npossible, there was no evidence from the Defendants’ medical expert asserting this.\n\nIn the circumstances, I did not rest my decision on this ground although the long delay\n\ndid not assist Mr Tan’s cause.Sgd:WOO BIH LIJUDICIAL COMMISSIONERSINGAPORECopyright © Government of Singapore."
    }
}