{
    "case_title": "Cheng Siah Johnson v Public Prosecutor",
    "ncitation": "[2002] SGHC 84",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The facts": "2 The agreed statement of facts tendered by the prosecution stated\n\nthat, on 25 May 2001 at or about 1.45 am, Johnson was arrested with other persons in\n\nVelvet Underground Disco Pub (‘Velvet’) on suspicion of consuming drugs. At the\n\nCentral Narcotics Bureau Headquarters two samples of urine were taken from him and were\n\nmarked and sealed in his presence. These urine samples were subsequently found to contain\n\ntraces of Ketamine.3 Johnson was formally charged with consuming a controlled drug on 25\n\nJune 2001. He pleaded guilty to the charge on 13 November 2001 and sentencing was\n\nadjourned to 18 December 2001 for his then counsel to prepare a written mitigation before\n\nsentence. There was a further application for a postponement of sentencing on 18 December\n\n2001, before the plea of guilt was retracted on 27 December 2001. The matter thereafter\n\nproceeded to trial and four witnesses, namely, Narcotics Officer Mohd Fazuri Bin Isnin\n\n(‘DW2’), his fiance Eileen Tan (‘DW3’), Chua Eng Hwee\n\n(‘DW4’) and Lim Siah Boon (‘DW5’) were called for the defence. The\n\ndefence was twofold: the appellant did not consume Ketamine intentionally or knowingly\n\nbecause (1) his drink had been spiked; (2) he had drunk from glasses which did not belong\n\nto his party. The defence also attempted to draw a linkage to one \"Lim Kee Ling\"\n\nwhom it claimed could be responsible for spiking Johnson’s drinks.",
        "The appellant’s version of facts": "4 Johnson testified that on 24 May 2001, he had arranged to meet DW3,\n\nDW4 and two other friends, Rudolf and Fabian, outside the entrance of Velvet at about\n\n11.30 p.m. When the group was assembled, all five of them proceeded into Velvet which was\n\ndescribed as being \"packed shoulder to shoulder\". They found space at a long\n\nrectangular table of about 15 feet long and stationed themselves there. Johnson remembered\n\nthat there were about 10 to 15 jugs on the table with about 20 to 30 glasses \"huddled\n\ntogether\". He ordered a first round of drinks: two jugs of beer and a jug of bourbon\n\ncoke and the group subsequently left for the dance floor.5 Upon their return, Johnson claimed that there were a lot more drinks\n\non the long table and the drinks \"were in a mess and mixed up\". He remembered\n\none incident when he asked DW3 to identify their drinks and was told that their jug was at\n\nthe left hand side of the long table, away from where they were standing. Subsequently, he\n\nclaimed that he saw someone from a small round table, about three feet away, taking a\n\ndrink from that jug. The people at this particular table had apparently placed some of\n\ntheir drinks on the left-hand side of the long table, about one foot away from\n\nJohnson’s, because their table was too small to contain all their drink. At that\n\ntime, Johnson stated that he had already taken a few sips or almost one-half of a mug of\n\nbeer. He told DW3 of his mistake and asked for a new mug of beer. Johnson also testified\n\nthat, throughout that night, about eight to ten friends had offered him drinks. He had\n\naccepted them because it felt it would be rude not to. In particular, one Lim Kee Ling and\n\n‘SB’ (‘DW5’) whom he knew as \"hi and bye friends\", were\n\nseated at the small round table and had offered him a glass of beer and a bottle of\n\nCorona. He drank the entire glass of beer and about three quarters of the bottle of\n\nCorona.",
        "The version of facts of the appellant’s witnesses": "6 DW2 was the investigation officer in charge of the case. He testified\n\nthat 37 people were arrested on 25 May 2001. Seven of them were found to have controlled\n\nor prohibited drugs in their urine samples. Amongst them, Lim Kee Ling, DW5 and the\n\nappellant were charged with consuming Ketamine. Lim Kee Ling had absconded after being\n\ncharged, one other was acquitted of the charge and a stern warning was given to him whilst\n\nanother one and the appellant claimed trial.7 DW3 testified that there were already \"10 to 15 mugs\" and\n\nabout 15 glasses of beer on the long table when they arrived. She stated that, as the\n\nnight went on, the table became very messy and Johnson had difficulty differentiating\n\ntheir drinks from the rest on the table, such that it became a \"guessing game\"\n\nat times. She stated that there were several occasions when she noticed Johnson \"pick\n\nup a mug and put it back immediately, pick up another mug next to it, put it back\n\nimmediately and pick up a third mug next to it, look around and in the end drink from\n\nit\". She emphasised one particular incident when Johnson had asked her to identify\n\ntheir jug of beer. He then took the jug and poured some of the beer from the jug into a\n\nmug that he took from the table. Subsequently she had wanted to pour a drink for a friend\n\nfrom that same jug but was told by Johnson that it had been moved to the small round\n\ntable. She further stated that she went over to the small round table and was told by\n\nsomeone that the jug belonged to them but had only been placed on the long table because\n\nthere was no space on their table. This person was a friend of \"Kee Ling\" and\n\nDW5. DW3 testified that she was offered a full mug of beer but, as she disliked drinking\n\nbeer, she passed it to DW5 instead. Kee Ling then picked up another mug of beer and these\n\ntwo mugs were then shared between Kee Ling, DW5 and Johnson.8 DW3 also stated that the occupants of the small round table had\n\nplaced jugs of beer, about six or seven mugs and a few Coronas on the long table. These\n\ndrinks were grouped together with their drinks on the long table and, except for the\n\nCoronas, the drinks were otherwise indistinguishable from each other.9 DW4 testified that Johnson had ordered Vodka with Ribena for the\n\nfirst round of drinks. Many jugs of drinks and glasses had been left on the long table by\n\npeople who were dancing, standing and sitting. However these did not include the drinks of\n\nthe people around the small round table which remained on their table. According to DW4,\n\nas the night progressed, they were unable to differentiate which were their drinks. He and\n\nJohnson simply grabbed whatever drinks were by their side without knowing exactly what\n\nthey were drinking. DW4 also testified that more than four or five people from the small\n\nround table, both men and women, had offered Johnson drinks.10 DW5 was the friend of Chan Choon Chye. On the night of 24 May 2001,\n\nat around midnight, he went alone to Velvet. He had a glass of whisky with friends at the\n\nsmall round table before moving to the long table where he saw Chan Choon Chye. At the\n\nlong table, a friend of DW3 formally introduced him to Johnson for the first time. DW5\n\ntestified that Johnson had offered him a drink from the glasses that were already on the\n\nlong table. Both of them then drank from the same glass. Other than this glass of beer, he\n\nremembered drinking from a common jug using straws with other friends. Although DW5 tested\n\npositive for Ketamine, charges were dropped against him and he was discharged after a\n\nstern warning.",
        "The decision of the court below": "11 The district judge was unable to find that the defence had succeeded\n\nin rebutting the presumption in s 22 of the Misuse of Drugs Act (Cap 185) on a balance of\n\nprobabilities. He did not believe that Johnson, as a 30 year old businessman who had been\n\nfrequenting pubs since he was 20, had never realised the dangers of taking other\n\npeople’s drinks. From the numerous shifts in position from his evidence-in-chief and\n\nthe hesitant way in which he explained why drugs were found in his urine samples,\n\nvacillating between alleging that he had drunk from a glass that he had been offered to\n\nadmitting that he could have drunk from a glass that he had picked up from the table, the\n\ndistrict judge concluded that his testimony was not to be believed. Neither did Johnson\n\noffer any such explanation in his s 122(6) cautioned statement taken one month after the\n\nincident on 25 June 2001.12 The district judge also noted several material inconsistencies\n\nbetween the testimonies of Johnson, DW3, DW4 and DW5. In his view, the attempt by the\n\ndefence to draw a \"linkage\" between Johnson and Lim Kee Ling failed as\n\nJohnson’s evidence that both DW5 and Lim Kee Ling had offered him drinks was debunked\n\nby DW5 who had testified that it was Johnson who had offered him a drink. There was also\n\nno credible reason why Lim Kee Ling would have wanted to spike Johnson’s drinks.",
        "The appeal": "13 Before me, counsel for the appellant argued that the district judge\n\nhad erred in the following respects:(1) Failing to give any or sufficient weight to the s 122(6) statement\n\n  and to the s 121 statement of the appellant(2) Failing to attach any weight to the fact that DW5 who had shared a\n\n  drink with the appellant and was tested positive for Ketamine had his charge withdrawn(3) Failing to consider all the circumstances of the case including the\n\n  fact that it was common practice for patrons of nightclubs to share drinks(4) Failing to consider the contention that Lim Kee Ling could have\n\n  spiked the appellant’s drinks(5) Concluding that DW3’s, DW4’s and DW5’s testimonies\n\n  in support of the appellant were less likely to be believed because they had failed to\n\n  offer themselves as witnesses to the authorities prior to the trial.",
        "The statutory presumption in s 22 of Misuse of Drugs Act": "14 Before turning to each ground of appeal proper, I shall make some\n\npreliminary observations about s 22 of the Misuse of Drugs Act. The provision is in the\n\nfollowing terms:Presumption relating to urine tests 22 – If any controlled drug is found in the urine of a person as a result of both\n\n  urine tests conducted under section 31, he shall be presumed, until the contrary is\n\n  proved, to have consumed that controlled drug in contravention of section 8(b).15 I had previously inVadugaiah Mahendran v PP[1996] 1 SLR 289\n\nheld that the statutory presumption in s 22 was two-fold in that proof of the primary fact\n\nby the prosecution i.e. a controlled drug was found in the urine as a result of both urine\n\ntests in s 31, triggered the actus reus of consumption and the mens rea required for the\n\noffence. The burden of proof hence fell upon the defence who would have to disprove either\n\nelement on a balance of probabilities. It was insufficient if the appellant merely raised\n\na reasonable doubt. It may be that, in most circumstances (when s 31 is read together with\n\ns 16), the defence would find it virtually impossible to rebut the presumption of\n\nconsumption and would have to rely solely upon evidence to disprove intention or knowledge\n\nof consumption. Therein lies the reason why the defence of ‘spiking’ and\n\nunknowingly consuming the drinks of strangers are so commonly utilised in cases of this\n\nkind. These are allegations that are extremely easy to make but which are almost\n\nimpossible to debunk. Although it is not the law that a commonly used defence will not be\n\naccepted, a judge may be obliged to approach such a defence with greater caution and\n\ncircumspection than usual in the absence of any other credible evidence:PP v Hla Win[1995] 2 SLR 424. In this way, importing a statutory presumption into s 22 may well have\n\nthe effect of imposing a minimum degree of care upon patrons of nightclubs to be wary of\n\nsharing drinks with others.",
        "The weight to be given to the s 122(6) and s 121 statements of the appellant": "16 Counsel for the appellant argued that the district judge failed to\n\ngive any or sufficient weight to the fact that the appellant had in his s 122(6) statement\n\ndeclared that he was innocent of consuming any form of drugs. The district judge was also\n\nwrong in faulting the appellant for not making any specific mention of his defence that he\n\ndid not consume the drugs knowingly because of a mix-up of glasses or jugs of beer. He\n\nrelied uponTeo Keng Pong v PP[1996] 3 SLR 329for the proposition that a\n\nsubmission that a prima facie case could not be answered by a bare denial could not be\n\naccepted. The prosecution replied that the appellant’s bare denials in his statements\n\nhad to be viewed in the context that the appellant never once mentioned the defences\n\nraised later at the trial and that he had pleaded guilty earlier. Both factors raised\n\ndoubts as to the genuineness of his defences. I shall deal with both arguments briefly.17Teo Keng Pongsupra. was a case that was very different from\n\nthe one at hand. It was one when the usual burden of proving beyond reasonable doubt at\n\nthe end rested upon the prosecution. Conversely, when the burden was on the defendant to\n\nrebut the statutory presumption, a bare denial (or a declaration of innocence) without any\n\nexplanation or mention of his defence would be manifestly inadequate in rebutting the\n\npresumption and consequently little weight would be accorded to it. I agreed with the\n\nprosecution that a failure to mention any part of the defence in the s 122(6) statement\n\nordinarily entitles a court to draw adverse inferences via s 123 Criminal Procedure Code\n\nor s 116 of the Evidence Act. However, I disagreed with the suggestion that a retraction\n\nof a plea of guilt necessarily cast doubts upon the validity of a defence. It is trite law\n\nthat the trial judge has the discretionary power to allow an accused person to change his\n\nplea at any time before sentence or before the court isfunctus officio, and if\n\nthere is a reasonable doubt as to the validity or unequivocality of the plea of guilty,\n\nthe trial judge will have to allow the accused person to retract his plea of guilty and\n\norder a re-trial (seeLee Weng Tuck v PP[1989] 2 MLJ 143,Ganesun s/o Kannan v\n\nPP[1996] 3 SLR 560). The trial must provide the accused person with a fresh\n\nopportunity to answer the charges against him and the prior retraction of a plea of guilt\n\nshould rightly not affect his ability to discharge his evidential burden at the criminal\n\ntrial of the offences charged. On the facts of this case, the judge had allowed the\n\nappellant to retract his plea of guilty on 27 December 2001 prior to sentencing. The judge\n\nwould obviously not have permitted the appellant merely at whim to change his plea, but\n\nmust have been satisfied that there were valid and sufficient grounds for allowing him to\n\ndo so. I was hence of the view that it would be wrong in the circumstances and in the\n\nabsence of any other reason to infer from the outset that his defence could not be\n\nbelieved.18 These arguments aside, one fundamental aspect of the statements\n\nseemed to be ignored by the parties. It was this: both the s 122(6) and s 121 statements\n\nwere recorded by narcotics officers. It had been established in cases such asChai\n\nChien Wei Kelvin v PP[1999] 1 SLR 25,Sim Ah Cheoh v PP[1991] SLR 150 andTan\n\nSiew Chay v PP[1993] 2 SLR 14that s 122(5) CPC is not applicable to narcotics\n\nofficers. Rather, the admissibility of the appellant’s statements fall to be tested\n\nby s 24 of the Evidence Act (Cap 97). That section makes it clear that in order for such\n\nstatements to be admissible as evidence, they had to be (1) confessions and (2) not made\n\nunder any inducement, threat, or promise, which in the opinion of the court would have led\n\nthe maker of the statement to believe that he would gain some advantage or avoid some evil\n\nof a temporal nature in reference to the proceeding against him. I was unable to read the\n\ns 121 and s 122(6) statements here as amounting to confessions. In his s 121 statement,\n\nthe appellant merely described how the urine samples were obtained from him whereas his s\n\n122(6) statement had the following sentence: \"I’m really innocent of consuming\n\nany form of drugs. I’ll try my best to prove myself…\" Admissibility of a\n\nstatement is a precursor to a court’s determination of its probative value and the s\n\n121 and s 122(6) statements of the appellant were not admissible via s 24 of the Evidence\n\nAct. Therefore the parties erred in admitting the statements as evidence and the district\n\njudge ought not to have considered them in coming to his decision.",
        "The weight to be attached to fact that DW5 had his charge withdrawn": "19 The defence took issue with the fact that DW5, who testified to\n\nhaving unknowingly consumed Ketamine in largely similar circumstances as the appellant,\n\nhad his charge withdrawn against him and was let off with a stern warning. I was unable to\n\nsee the relevance of this. First, while DW5 testified that he had shared a drink with the\n\naccused, this was not the only drink which he had consumed throughout the night. The drug\n\ncould have been found in some other drink. DW5 also admitted that he could not be sure if\n\nit was that drink which he had shared with the appellant that was tainted. Even accepting\n\nthat it was possible that that drink had been spiked, I noted that it was actually Johnson\n\nwho had offered the mug of beer to DW5. This gave rise to the possibility that Johnson\n\ncould in fact have been the one who had ‘spiked’ the drinks. There was a further\n\ndiscrepancy: DW5 had testified that the mug of beer was from Johnson’s side of the\n\nlong table whereas Johnson’s case was that the drinks actually belonged to the small\n\nround table. Secondly, I agreed with the district judge when he held that in any criminal\n\nprosecution, each case had to be adjudged on the basis of the evidence adduced at the\n\ntrial. It is not the role of the courts to engage upon idle speculation as to what should\n\nor might have been. Thirdly, it is axiomatic that the courts will not interfere in matters\n\nconcerning the exercise of prosecutorial discretion:Arjan Singh v PP[1993] 2 SLR 271. The power to institute, conduct or discontinue any proceedings for any offence is\n\nvested in the Attorney-General by the Constitution of the Republic of Singapore, see\n\nArticle 35(8) of the Constitution and s 336 CPC. This is an absolute discretion and one\n\nwhich I believe is carefully exercised. It is widely acknowledged that the prosecution has\n\nno interest in prosecuting innocent or unmeritorious claims. In fact, the reality often is\n\nthat the prosecution only prosecutes when it is satisfied that there is more than a\n\nreasonable prospect of success. Therefore, I was of the view that, in the absence of\n\ncredible evidence, the defence could draw no assistance from the fact that a charge\n\nagainst DW5 had been withdrawn in establishing the innocence of the appellant.",
        "The contention that Lim Kee Ling could have spiked the drinks": "20 I moved on to consider the appellant’s contention that he had\n\ndrawn a \"linkage\" to one Lim Kee Ling whom he claimed was responsible for\n\nspiking his drinks. His reasoning was this: Lim Kee Ling and the appellant had shared the\n\nsame drinks and the former was on the run after his urine was tested positive for Ketamine\n\nand, if he had been produced, his evidence in court might have corroborated the\n\nappellant’s evidence.21 I was unable to see any such \"linkage\" between the\n\nappellant and Lim Kee Ling. The appellant admitted that he and Lim Kee Ling were friends.\n\nDW3 confirmed this when she testified that Lim Kee Ling and the appellant were\n\nacquaintances in the disco scene and had known each other for a few months prior to the\n\nincident. All the witnesses also agreed that the appellant was very friendly and\n\nwell-liked by everyone. In fact on the material night, DW4 had teased him about the number\n\nof people who had offered him drinks and the widening of his circle of friends. There were\n\nno arguments or unhappiness between the appellant and Lim Kee Ling or anyone else. As\n\nsuch, I could find no discernible motive as to why anyone, much less Lim Kee Ling, would\n\nhave wanted to implicate the appellant by spiking his drinks. More importantly, the\n\nevidence that Lim Kee Ling had shared drinks with the appellant and DW5 was pro-offered by\n\nonly the appellant and DW3. DW5 contradicted this when he testified that he shared a drink\n\nwith the appellant and not with both of them. No evidence was also led as to whether DW5\n\nknew Lim Kee Ling. There were also discrepancies between the testimonies of the appellant\n\nand DW3. He had stated that Lim Kee Ling and DW5 were seated at a small round table having\n\na birthday celebration and they offered him a glass of beer and a bottle of Corona.\n\nConversely, DW3 testified that when she went to the small round table to inquire about the\n\njug, she was offered a glass of beer but passed it to DW5 instead (who together with the\n\nappellant and Lim Kee Ling were standing near her). Lim Kee Ling also took another glass\n\nof beer and both glasses of beer were then shared between the three of them. The defence\n\nfailed to adduce other additional evidence or call further witnesses to establish that the\n\nappellant had indeed shared drinks with Lim Kee Ling. In addition, the burden was on the\n\nappellant to find Lim Kee Ling and, in his absence, it would be highly speculative to\n\nassert that his evidence would have corroborated the appellant’s evidence.",
        "The evidence of DW3, DW4 and DW5": "22 The trial judge had noted that both DW3 who was the appellant’s\n\nfiance and DW4 who had known the appellant for about eight to ten years did not go to\n\nthe authorities to give any statements on behalf of the accused before the trial date. He\n\nfelt that their failure to approach the authorities before the trial coupled with their\n\nclose relationship with the appellant meant that their evidence was suspect. I doubt that\n\nsuch an adverse inference could be drawn against them. It was undisputed that none of them\n\nwere ever approached by the police or the narcotics officers to provide statements. The\n\nsituation would be different if they had been asked for statements prior to the trial but\n\nhad refused to give them or having given them then refused to testify at the trial: s\n\n116(g) Evidence Act.23 However, there were numerous material discrepancies between the\n\nevidence of the appellant, DW3, DW4 and DW5. In particular, I noted that DW4 had initially\n\ntestified that the appellant had ordered jugs of Vodka with Ribena when they first arrived\n\nat Velvet, whereas both the appellant and DW3 claimed that they had ordered jugs of beer\n\nand bourbon coke. When told by defence counsel of the earlier evidence of the appellant\n\nand DW3, DW4 became evasive and said that he could not remember. This cast doubt on the\n\ntypes of drinks that were ordered that night, which was relevant towards the issue of\n\nwhether there was actually a mix-up of drinks and glasses as alleged by the appellant. DW4\n\nalso stated that all the drinks of the other group were placed on the small round table.\n\nThis was contrary to the evidence of the appellant and DW3 who stated that the appellant\n\ncould have drunk from the glasses and jugs belonging to the small round table which were\n\nplaced on their side of the long table.24 Similarly, DW5’s evidence was irreconcilable with that of the\n\nappellant and DW3. He had stated that he was at the long table with Chan Choon Chye\n\nwhereas both the appellant and DW3 claimed that he was with Lim Kee Ling at the small\n\nround table. He further stated that it was the appellant who had offered him a drink\n\nrather than the other way round. This was also contrary to DW3’s evidence that it was\n\nshe who had given DW5 a mug of beer. I also found the testimonies of the appellant and DW3\n\nwith respect to the ‘incident’ to be questionable. First of all, their\n\ntestimonies suggested that this ‘incident’ occurred in entirely different\n\ncircumstances. DW3 said that it was she who had asked the appellant where their jug of\n\nbeer was when she wanted to pour a drink from it for one of her friends. On the other\n\nhand, the appellant said that he told DW3 of the mix up when he saw someone from the small\n\ntable pouring the drinks into his own glass. Secondly, the appellant was silent on the\n\nentire sequence of events about DW3 going to the small round table and inquiring about the\n\n‘missing’ jug. He said that he had asked the waitress for a new mug of beer\n\ninstead, whereas DW3 said that he did no such thing. These inconsistencies cumulatively\n\nraised doubts as to the appellant’s defence that there was a mix-up of drinks at the\n\nlong table causing him to drink from someone else’s glass or that he had been offered\n\na ‘spiked’ drink. On these grounds, I found no reason to interfere with the\n\njudge’s finding that the appellant was not a credible witness.25 I have stated the reasons why the defence failed to draw a\n\n\"linkage\" with Lim Kee Ling and why it was irrelevant that DW5 had his charge\n\nwithdrawn. I was hence of the view that the appellant had not furnished any evidence to\n\nshow that the drinks were spiked. In addition, I also found it telling that, of the entire\n\nparty of five (the appellant, DW3, DW4, Rudolf and Fabian) only the appellant had tested\n\npositive for Ketamine. This was despite the evidence of the appellant, DW3 and DW4 that\n\nall four of them, save for DW3, had difficulty in distinguishing their drinks and had\n\nsimply grabbed whatever drinks were at their side. The material inconsistencies between\n\nthe evidence of the appellant and his witnesses also raised suspicions as to the validity\n\nof his defences. With respect to the point that the judge had failed to consider the fact\n\nthat it was common for patrons of night clubs to share drinks, the sole issue was whether\n\nthe appellant had provided sufficient evidence to rebut the presumption in s 22 of the Act\n\non a balance of probabilities. This was regardless of what the practice at nightclubs was.\n\nConsidering all the evidence that had been adduced on behalf of the appellant (excepting\n\nthe s 121 and s 122(6) statements), I found that he had failed to disprove the presumption\n\nof consumption on a balance of probabilities.",
        "The appropriate sentence": "26 Consumption of Ketamine is viewed as a serious offence because of\n\nits harmful effects on the minds, bodies and lives of those who consume it. What is\n\nparticularly worrying is that, despite the continued efforts of the authorities, the use\n\nof such ‘designer’ or ‘club’ drugs remains on the rise amongst youths.\n\nThe profile of the typical drug abuser is also changing, more of them are young and more\n\nof them are also female. It has also been brought to my attention that the number of\n\nfirst-time drug abusers caught for using Ketamine almost doubled last year. This is a\n\nsocial problem that can escalate to uncontrollable proportions if left unchecked.27 It is the responsibility of the courts to send a strong message to\n\nthe public that such drug offences are taken very seriously:Chua Poh Kiat v PP[1998] 2 SLR 713. Bearing in mind the gravity of the offence and the maximum limits of\n\npunishment as prescribed by s 33 of the Act, I did not consider that the sentence of 18\n\nmonths’ imprisonment was so manifestly excessive as to justify it being reduced. In\n\nthe premises, both appeals against conviction and sentence were dismissed and the\n\nappellant was ordered to commence his term of imprisonment immediately.Appeal dismissedSgd:YONG PUNG HOWChief JusticeCopyright © Government of Singapore."
    }
}