{
    "case_title": "Lim Chuan Huat and Another v Public Prosecutor",
    "ncitation": "[2002] SGHC 2",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Whether the individual charge against each appellant was duplicitous": "Duplicity14 A charge alleging that the accused committed two or more distinct offences is\n\nduplicitous and contravenes s 168 of the CPC. The object behind s 168 is to ensure a fair trial and\n\nto see that the accused is not overwhelmed by having to defend several unconnected charges, or\n\ndistinct offences lumped together in one charge. This is to save the accused from being embarrassed\n\nin his defence as well as to prevent the court from being unduly influenced by the different\n\nevidence tendered against the accused on different charges. The exceptions referred to in s 168 are\n\nconfined to the rule on joinder of charges and do not apply to duplicity: seeSee Yee Poo v PP[1949] 1 MLJ 131andChuan Hoe Engineering Pte Ltd v PP[1996] 3 SLR 544. In this connection,\n\nI agreed with the appellants contention that both their respective charges were bad for\n\nduplicity. This was because each of these various occasions which the appellants were charged\n\nwith, for voluntarily causing hurt to the victim, clearly constituted a distinct offence for which a\n\nseparate charge should have been preferred.15 The cases ofChuan Hoe Engineering v PP,See Yee Poo v PPandRamachandran\n\nv PP[1972] 2 MLJ 183, all of which were cited by the appellants in support of their above\n\ncontention, also stand for the legal proposition that, so long as each of these offences could have\n\nbeen the subject of a separate charge, and could have been proceeded with at one trial, the\n\nduplicity is merely an irregularity which can be cured by s 396 of the CPC. This is provided the\n\naccused was not prejudiced in his defence and there was no failure of justice occasioned by the\n\nirregularity. A failure of justice is considered to have occurred where the duplicity caused\n\nconfusion in the mind of the trial judge so that he did not consider the evidence in respect of each\n\nalleged offence separately.16 On the facts of the present case, I was of the opinion that there was no\n\nfailure of justice occasioned by the duplicitous nature of the appellants charges. This was not a\n\nsituation where I did not know, and could not ascertain, what offence the trial judge convicted the\n\nappellants of. On the contrary, I found that the trial judge had clearly directed his mind in\n\nkeeping the evidence against each alleged offence separate when convicting the appellants of their\n\nrespective charges. This was evident from his detailed grounds of decision which ran into some 274\n\nparagraphs. Not only did I find that the trial judges grounds of decision demonstrated an\n\nawareness of the necessary ingredients of the appellants respective charges, I was of the further\n\nopinion that the trial judge recognised the fact that there was only sufficient evidence to make out\n\nthe portion of the charge against Tan and Lim for voluntarily causing hurt to the victim on 10 and\n\n11 June 1999 respectively (see below). In this connection, he accepted the evidence of the victim\n\nthat Tan assaulted her in the manner laid out in her charge on 10 June 1999 and that Lim assaulted\n\nher in the manner specified in his charge on 11 June 1999. He also accepted the evidence of Dr Chow\n\nthat the injuries found on the victims body were unlikely to be self-inflicted, and that the\n\nbruises on the victims shoulders, palms, forearms and breasts were likely to be attributed to\n\ncaning and that the bruise on the victims left cheek was consistent with pinching or punching.\n\nFrom the trial judges grounds of decision, he did not appear to have relied on any evidence\n\nrelating to the victims bare allegation of the various other incidents of assault in convicting\n\nTan and Lim of causing hurt to the victim on 10 and 11 June respectively.17 In relation to whether the appellants were prejudiced in their defence by the\n\nduplicity contained in their charges, I found that they were not so prejudiced. This was not a\n\nsituation where the appellants had a specific defence corresponding to each of the specific\n\nincidents of assault alleged by the victim. Instead, both Lim and Tan had only one defence viz.\n\ncompletely denying ever assaulting the victim at any time whatsoever and maintaining throughout the\n\nduration of their trial that the victims injuries were self-inflicted. In this respect, I was of\n\nthe opinion that the duplicity contained in individual charges of the appellants did not occasion a\n\nfailure of justice and could be cured by s 396.",
        "Bad drafting of charge": "18 Notwithstanding that the latent duplicity contained in charges can be cured by\n\ns 396, I was of the further opinion that the manner in which the individual charges were drafted was\n\nin breach of s 159(1).19 Section 159(1) of the CPC mandates that the charge shall contain particulars\n\nas to : (i) the time and place of the alleged offence, and (ii) the person (if any) against whom, or\n\nthe thing (if any) in respect of which, the offence was committed, as are reasonably sufficient to\n\ngive the accused notice of the matter with which he is charged.20 In relation to the charges, I found the phrase various occasions\n\nambiguous. It shed no light at all on the exact number of occasions each appellant had allegedly\n\ncaused hurt to the victim. The manner in which the charge was drafted also left the reader in doubt\n\nas to how each appellant had allegedly caused hurt to the victim. It was also unclear whether the\n\nnature of hurt inflicted by the appellants differed between each of these various occasions or\n\nwhether it was always the exact combination of acts as stipulated in the appellants charges.\n\nTaking Lim as an example, did he always cause hurt to the victim by hitting her on her back,\n\nshoulders and hands with his hands and a cane, or were there instances where he had only used a cane\n\nto hit the victim on her palms?21 Notwithstanding that charges against the appellants breached s 159, s 162 CPC\n\nprovides that:No error in stating either the offence or the particulars required to be stated\n\n  in the charge and no omission to state the offence or those particulars shall be regarded at any\n\n  stage of the case as material unless the accused was in fact misled by that error or omission.22 The object behind the concern of whether an accused is misled by errors in his\n\ncharge is to safeguard the accused from being prejudiced in his defence. It is only in situations\n\nwhere the accused have been so misled, that the errors are considered material and go towards the\n\nvalidity of his charge.23 In the present case, I found that the appellants were not misled by the errors\n\nin their respective charges, and therefore did not consider the errors to be material. Given that\n\nthe victim was the first prosecution witness, all the alleged incidents would have been mentioned\n\nduring her examination-in-chief. The notes of evidence reveal that the victim gave specific evidence\n\nthat Tan had voluntarily assaulted her on 10June 1999 in the exact manner as stipulated\n\nin Tans charge. She also gave specific evidence that Lim had struck her on 11 June 1999 in the\n\nexact manner specified in Lims charge. However, the victims evidence in relation to the various\n\noccasions other than 10 and 11 June 1999 was that the incidences of assault did occur but she\n\ncould not remember the exact details. Hence, the victims evidence in relation to the incidents of\n\nassault, save those which occurred on 10 and 11 June 1999, were nothing more than bare allegations.\n\nIt was also clear from the notes of evidence that the victim did not confuse the incidents which\n\nhappened on 10 and 11 June with the other incidents of assault of which she had trouble recalling\n\nthe details. Therefore, not only were Lim and Tan specifically aware of the incidents of assault\n\nwhich the victim was alleging, but they were also afforded the opportunity to cross-examine the\n\nvictim as well as to lead their own evidence on these incidents.24 The charge for voluntarily causing hurt under s 321 of the Penal Code\n\ncomprises three elements :Farida Begam d/o Mohd Artham v PP[2000] 4 SLR 610. They are\n\nnamely(i) that the accused intended to cause hurt or knew that his/her actions were\n\n  likely to cause hurt;(ii) the victim was hurt within the definition of s 319 of the Penal Code\n\n  (ie the victim suffered bodily pain, disease or infirmity); and(iii) the accuseds action caused the hurt in question.25 From the notes of evidence it was clear that the prosecution did not have\n\nsufficient evidence to prove the second and third elements of the charge in relation to all the various\n\noccasions of assault referred to in the charge. This was especially since the prosecutions\n\ncase was premised solely on the testimony of three witnesses. They were namely, the victim, Dr Chow\n\nwhose report only documented the 12 injuries (see para 10 above) and the investigating officer who\n\nrecorded the first information report (whose evidence was not relevant for present purposes). In\n\nsuch a situation, the appellants could hardly be said to have been misled. This was because they\n\nwould have known by the time the victim had given her evidence that the prosecution only had\n\nsufficient evidence to make out the elements of the charge against Tan for causing hurt to the\n\nvictim on 10 June 1999, and against Lim for causing hurt to the victim on 11 June 1999. In other\n\nwords, the appellants knew full well the charges they had to meet and were not left in doubt at\n\ntrial as to what they were being charged with.26 I note that the ambiguity and latent duplicity contained in the appellants\n\ncharges resulted directly from the use of the phrase various occasions. This was an\n\ninexcusable error on the part of the prosecution especially since it could have been easily avoided\n\nby more careful drafting. It was fortuitous for the prosecution that the facts of this particular\n\ncase lent themselves to a relatively straightforward application of s 162 and s 396 of the CPC. Had\n\nthe evidence been less clear, or the appellants had specific defences corresponding to a particular\n\nincident, the ambiguity and latent duplicity contained in the charges would have resulted in an\n\nillegality. However, as I found the appellants knew the case they had to meet and were not placed in\n\na position of embarrassment, they were not hindered or in any way prejudiced by the form of their\n\ncharges which could be cured by s 162 and s 396 of the CPC.",
        "Whether the appellants could and should have been jointly tried": "27 The appellants second ground of appeal was that the trial judge had erred\n\nin trying both appellants together in a joint trial. They submitted that, in so doing, the trial\n\njudge had essentially failed to consider the evidence in respect of each appellant separately and\n\nthat this failure caused the trial judge to rely on prejudicial evidence.",
        "Whether the offences were committed in the same transaction": "28 Section 176 of the CPC permits a joint trial where more than one person is\n\naccused of the same offence or of different offences in the same transaction. In the case ofTse\n\nPo Chung Nathan v PP[1993] 1 SLR 961the Court of Appeal had to decide whether the first and\n\nsecond accused, who were convicted on similar but separate charges of importing 2178.0 g and 2190.3g\n\nof diamorphine, committed the offences in the same transaction and could thereby be jointly\n\ntried pursuant to s 176. Chao JA in delivering the decision of the Court of Appeal said at page 969\n\nthat:Ratanlal on Criminal Procedure Code (1985 Ed) at p 225 states that `the real\n\n  and substantial test for determining whether several offences are connected together so as to form\n\n  the same transaction depends upon whether they are so related to one another in point of purpose,\n\n  or cause and effect, or as principal and subsidiary acts as to constitute one continuous action.Mitra on the Code of Criminal Procedure (16th Ed) states the tests in similar\n\n  vein as follows at p 1385:The tests to decide whether different acts are part of the same transaction\n\n    are proximity of time, unity of place, unity of purpose or design and continuity of action. It\n\n    is not necessary that all of them should be present to make the several incidents parts of the\n\n    same transaction. Unity of place and proximity of time are not important tests at all, but themain\n\n    test is unity of purpose. If the various acts are done in pursuance of a particular end in\n\n    view and as accessory thereto, they may be treated as parts of the same transaction.As to\n\n    what is the same transaction must depend upon the facts and circumstances of each particular\n\n    case. It is not the distance nor the proximity of time which is so essential in order to\n\n    consider what is `the same transaction` as the continuity of action and purpose. The expression\n\n    `same transaction` must be understood as including both the immediate cause and effects of an\n\n    act or event, and also its collocation, or relevant circumstances, the other necessary\n\n    antecedents of its occurrence, connected with it, at a reasonable distance of time space, cause\n\n    and effect.For a joint trial under s 239, identity of purpose is sufficient. Community of\n\n    purpose in the sense of conspiracy is not in any way necessary, though if it is present, its\n\n    presence will be a further element supporting a finding that the offences are committed in the\n\n    same transaction.Where the prosecution case alleges association and community of purpose\n\n    among the accused, their joint trial is permissible. For s 223 it is enough if the different\n\n    offences are committed in the course of the same transaction. The criterion which makes a joint\n\n    trial allowable is what the prosecution case is, not what the result may be.Under common law the position seems to be similar and we would just quote a\n\n  passage of the Court of Criminal Appeal inR v Assim[1966] 2 QB 249 at p 261:Where, however, the matters which constitute the individual offences of the\n\n    several offenders are upon the available evidence so related, whether in time or by other\n\n    factors, that the interest of justice are best served by their being tried together, then they\n\n    can properly be the subject of counts in one indictment and can, subject always to the\n\n    discretion of the court, be tried together",
        "Whether a joint trial caused prejudice to the appellants": "33 Since the appellants could be jointly tried under s 176 of the CPC, the next\n\nconsideration was whether the appellants should have been jointly tried. In other words, whether\n\nthere was any prejudice caused to the appellants in being tried together. The appellants supported\n\ntheir contention that they had in fact been prejudiced by the following reasons. First, the trial\n\njudge did not make any distinction between the acts of Lim and Tan in the period prior to 10 and 11\n\nJune 1999. Secondly, the trial judge did not keep the evidence applicable only to each appellant\n\nseparately. They claimed that this was evident from his failure to make a clear finding as to which\n\nappellant inflicted which injuries and on which date. Finally, there was confusion and doubt in the\n\ntrial judges findings as to what would be the relevant and admissible evidence that implicated\n\nwhich of the two appellants.34 I found the appellants contentions to be misconceived. From my reading of\n\nthe trial judges grounds of decision, he did not appear to rely on alleged incidents of assaults\n\nby the appellants prior to 10 and 11 June in finding Tan and Lim guilty of their respective charges.\n\nFurther, the fact that the trial judge failed to specifically state which injury was inflicted by\n\nwhom and on which date did not necessarily mean that the trial judge imported into the case of one\n\nappellant, evidence admissible only against the other. In fact, I found that the manner in which the\n\ntrial judge organised the evidence in his grounds of decision showed that he considered the evidence\n\nof each appellant separately. Furthermore, a reading of his grounds of decision revealed that the\n\ntrial judge did not use the evidence of the wifes act of assault on the maid as evidence in\n\nconvicting the husband, nor vice versa. The victims evidence in respect to who inflicted what\n\ninjuries on which days was also extremely clear. This was partly because the appellants did not\n\nassault the victim jointly but individually on two different days. In addition, they also assaulted\n\nher on a different part of her body causing corresponding injuries to those parts of her body. The\n\nonly common manner in which they had hurt the victim was by caning her on her palms. According to Dr\n\nChows evidence, this in all probability resulted in the bruising of the victims hands as well\n\nas the bruises on her forearms and the reddening of the skin around her breasts. The victim also\n\nconceded that the bruises to her forearms and breasts were probably caused by the tip of the rattan\n\ncane hitting her breasts and forearms while she was being caned on her palms. This is because\n\nwhenever she was caned on her palms, she was told to hold up her palms to chest level.35 In this connection, other than the injuries on her hands, forearms and her\n\nbreasts, the cause of the victims injuries could clearly be attributed to her corresponding\n\nperpetrator simply by observing where the injuries in question were located on the victims body.\n\nFor example, the bruise on the victims left cheek could only be attributed to Tan who had pinched\n\nher on her left cheek, whereas the bruises on the victims shoulders was a result of Lim caning\n\nher on her shoulders. In this respect, it is difficult to see how the trial judge could have\n\nconfused the evidence of the appellants in finding that the elements of the offence of voluntarily\n\ncausing hurt had been made out against them.36 Based on the above, I found that the appellants had not been prejudiced by\n\nbeing jointly tried and that their conviction should not be set aside.Appeal on Sentence37 The facts of this case presented a rather interesting point of law  whether\n\na distinction could be drawn between a confusion in the mind of the trial judge in considering the\n\nevidence which went towards establishing the ingredients of the charge in finding a conviction, and\n\nthat which went towards affecting the trial judges discretion in sentencing. A failure of justice\n\nis occasioned only in the former viz. where the confusion in the mind of the trial judge as to the\n\nevidence to be considered goes towards the conviction and not in the latter. The fundamental issue\n\nat a criminal trial is the establishment of guilt. Hence, there can only be a failure of justice\n\nwhere the error in question (e.g the trial judges error of confusing the evidence) goes towards\n\nhis conclusion of the guilt of the accused. However, where the error in question is irrelevant for\n\nthe purposes of determining guilt and only affects the sentence, then is it an irregularity that can\n\nbe cured. The proper remedy for such an irregularity is however not by the application of s 396 of\n\nthe CPC, but by way of s 261 of the CPC which gives the High Court the jurisdiction to maintain a\n\nsentence or set aside a sentence that is manifestly excessive or inadequate in the circumstances of\n\nthe case.38 Hence, while I found that the trial judge had erred in taking into\n\nconsideration the unsupported allegations of the victim that she was consistently abused by her\n\nemployers in sentencing the appellants, I was disinclined to reduce the sentence as I did not\n\nconsider the sentence to be manifestly excessive. While it may be socially acceptable to some for\n\nparents to chastise their children by gently caning them with a rattan cane, using the same\n\npunishment on a maid who is employed in her professional capacity to assist in domestic chores is\n\nanother issue altogether. It is not only humiliating for the maid to be treated and punished like a\n\nchild by having her ears pulled, cheeks pinched and palms caned with a rattan, such acts are also\n\ncruel and uncivilised and should not be condoned by the society in which we live in today.Conclusion39 For the reasons above, I dismissed the appellants appeal against conviction\n\nand upheld the sentence imposed by the trial judge.",
        "Appeals dismissed.": "Sgd:YONG PUNG HOWChief JusticeCopyright © Government of Singapore."
    }
}