{
    "case_title": "Tan Kok Ing v Tan Swee Meng & 3 Others",
    "ncitation": "[2002] SGHC 166",
    "coram": "Woo Bih Li JC",
    "sections": {
        "Order 89 rule 4 of the Rules of Court": "8.        Before I deal with the\n\nrequirements in s 53, I refer to O 89 r 4 of the Rules of Court, on which some reliance\n\nwas placed by Mr Cosmas Gomez, Counsel for Mr Tan. This rule provides:‘Transfer of proceedings within the Subordinate\n\n  Courts (O.89, r.4)4. (1) Where a Subordinate Court is satisfied that\n\n  any proceedings in that Court ought to be tried in some other Subordinate Court, it may\n\n  order the proceedings to be transferred to the other Court.(2) Any order under paragraph (1) may\n\n  be made by the Court on its own motion or on the application by summons of any party to\n\n  the proceedings.(3) Where an order under paragraph\n\n  (1) is made by the Court on its own motion, the Registrar must give notice of the transfer\n\n  to every party to the proceedings.’Mr Gomez was suggesting that this provision would enable\n\nthe Magistrate’s Court to effect the transfer without Mr Tan having to satisfy the\n\nrequirements in s 53.9.        On the other hand, Ms Linda\n\nPhua, Counsel for the First and Second Defendants, submitted that rule 4 provides the\n\nprocedure for a transfer only if one of the requirements in s 53 is satisfied and that\n\nrule 4 should not be read in isolation.10.        I was of the view that O\n\n89 r 4 is not a provision on procedure only. However I agreed that it should not be read\n\nin isolation. If rule 4 were interpreted to mean that any Subordinate Court has an\n\nunfettered discretion to order a transfer of proceedings from a Magistrate’s Court to\n\na District Court so long as the court ordering the transfer is satisfied that the transfer\n\nought to be effected, then s 53 would be otiose. It will then effectively override s 53.\n\nIn my view, subsidiary legislation cannot override primary legislation and rule 4 must be\n\nread subject to s 53.11.        I found support in the\n\nMalaysian case ofKee Chai Heng v Ketua Polis Daerah Kuala Muda[1999] 2 MLJ 671.\n\nIn that case, the plaintiff had filed an action against the defendant for negligence for\n\nfailing to ensure that he was not harmed whilst under police custody. The action was\n\ncommenced in the Sessions Court. The Sessions Court however, on its own initiative, was of\n\nthe view that the claim was within the jurisdiction of a lower court, i.e the\n\nMagistrate’s Court. It then ordered that the case be transferred to that court.12.        On appeal, the High Court\n\n(Alor Setar) ruled that the Sessions Court did not have the power to do so. This was\n\nbecause para 3(2) of the Third Schedule of their Subordinate Courts Act 1948 gave it power\n\n‘to transfer any proceedings to another court of co-ordinate jurisdiction’ only.13.        However, O 47 r 1 of the\n\nMalaysian Subordinate Courts Rules 1980 provided that:‘\n\n                                                        \n\n    ORDER 47TRANSFER OF PROCEEDINGS1. Where the Judge of any Court is satisfied that any\n\n    proceedings in that Court can be more conveniently or fairly tried in some other Court he\n\n    may order the proceedings to be transferred to other Court.’14.        Notwithstanding O 47 r 1,\n\nthe Malaysian High Court concluded that this provision must be read subject to para 3(2)\n\nof the Third Schedule of their Subordinate Courts Act as the former was ‘merely a\n\nsubsidiary legislation whereas the SCA is an Act of Parliament’ (see p 671 at I of\n\nthe report).",
        "Does the fact that Mr Tan’s claim may exceed the\n\njurisdiction of the Magistrate’s Court show that some important question of law or\n\nfact is likely to arise?": "15.        Mr Gomez submitted that\n\nthe mere fact that Mr Tan’s claim may exceed the jurisdiction of the\n\nMagistrate’s Court showed that an important question of law or fact was likely to\n\narise. He relied on two cases.16.        InManakau City Council\n\nv Nicoll Management Co Ltd[1998] DCR 722, the application to transfer a case from the\n\nDistrict Court in Auckland to the High Court was based on s 43(2) of the District Courts\n\nAct 1947 which applies where the value or property or relief claimed in issue does not\n\nexceed $50,000. Under that provision, a judge may order the proceeding to be transferred\n\nto the High Court, if in the judge’s opinion, some important question of law or fact\n\nis likely to arise or a question of title to any hereditament is likely to arise otherwise\n\nthan incidentally. In that case, the application was based on some question of law or\n\nfact. Judge R L Johnson enumerated various factors which he said must be taken into\n\naccount in such an application:(a) The nature and complexity of the case;(b) The general or public importance of the case;(c) The amount in issue;(d) The likely length of the hearing and the financial\n\n    resources of the parties;(e) Novelty of any point of law raised.17.        Mr Gomez relied on factor\n\n(c) and said that this factor alone could satisfy one of the requirements in s 53. There\n\nwas no need to establish that Mr Tan’s claim was complex.18.        The next case which Mr\n\nGomez relied on wasPatterson and others v Ellis and another[1957] 1 WLR 857. In\n\nthat case, the relevant provision was s 44(2)(b) of the County Courts Act which allowed a\n\ntransfer of proceedings in a County Court to the High Court if ‘(b) the judge\n\ncertifies that in his opinion some important question of law or fact is likely to\n\narise’.19.        In the court of first\n\ninstance, Judge Gordon Clark held that ‘important’ must mean that the point\n\naffects a number of outside interests or a point of law which affects other cases.20.        However, the English Court\n\nof Appeal held that it was too narrow a construction to conclude that the point of law\n\nmust affect other cases or that it must be something in the nature of a test case or that\n\noutside interests must be affected. If the difficult question of law or fact arose as\n\nbetween the parties only, a court could still conclude that important questions of law or\n\nfact are likely to arise.21.        Mr Gomez argued that\n\ntherefore it was not necessary for Mr Tan’s claim to affect other cases and it was\n\nsufficient if an important question of law or fact is likely to arise as between the\n\nparties.22.        Ms Phua submitted that in\n\nbothManakauandPatterson, the application to transfer the proceedings was\n\nnot based on the mere fact that the quantum may exceed the lower court’s\n\njurisdiction.23.        She added that if an\n\naction could be transferred for that reason alone, that would require a mini-hearing first\n\nto establish the quantum, where the claim was for unliquidated damages like in the present\n\ncase. She found support for this proposition in the Malaysian case ofKee Chai Hengwhich\n\nI have mentioned above. She cited p 671 where the High Court (Alor Setar) said:‘What I have just said above concerns a clear cut\n\n    situation. It might be that in many case the situation is not one that is clear-cut (such\n\n    cases might be common among claims involving unliquidated damages). In such cases, in\n\n    order to avoid unnecessary delay and costs, it is, to my mind, prudent (sic) or the\n\n    sessions court not to entertain the uncertainty and embark on an exercise - more so on its\n\n    own motion - of determining, before the trial even begins, whether the total sum of the\n\n    damages likely to be recovered by the plaintiff would be less than or exceed RM25,000. The\n\n    sessions court should proceed with the trial of the case before it. After all, the\n\n    sessions court is competent to hear such cases: as a general rule, what is within the\n\n    civil jurisdiction of the magistrate’s court is also within the jurisdiction of the\n\n    sessions court. Moreover, in many such cases, the extent of the damages that should be\n\n    awarded could only be determined with certainty after having the benefit of hearing the\n\n    whole evidence and submissions.’24.        However, in that case, the\n\naction had been filed in the Sessions Court and the Sessions Court judge, on his own\n\ninitiative, took the view that the claim was within the jurisdiction of a lower court i.e\n\nthe Magistrate’s Court and he was minded to transfer it to the Magistrate’s\n\nCourt. It was in that context that the Malaysian High Court said that the Sessions Court\n\nshould not embark on an exercise to determine the quantum even before the trial begins.\n\nAfter all, the Sessions Court had jurisdiction to proceed with the trial.25.        In the case before me, Mr\n\nTan wanted to do the opposite, i.e to transfer his case from a lower court, i.e the\n\nMagistrate’s Court, to a higher court, i.e the District Court. Accordingly, the\n\npassage cited by Ms Phua did not apply to the case before me.26.        In any event, I was of the\n\nview that there is no question of making a mini-inquiry first. If a plaintiff subsequently\n\ntakes the view that the quantum of his damages may exceed the jurisdiction of the court in\n\nwhich he has commenced his action, then he must apply to transfer his action to a higher\n\ncourt as soon as possible. So long as there is some reasonable basis for his view, it is\n\nnot for the court hearing the application to embark on an inquiry to assess the quantum\n\nbefore deciding whether to transfer the action or not.27.        Whether the plaintiff\n\nsucceeds in his application is another matter.28.        Ms Phua also submitted\n\nthat the District Court did not make its decision on the basis that the parties must show\n\nsome importance of law or fact to other parties. Hence,Pattersonwas not relevant.29.        Ms Phua also contrasted s\n\n53 with s 24(1) of the Subordinate Courts Act. Section 24(1) states:‘Transfer of counterclaim from District Court to\n\n    High Court24. (1) Where, in an action founded on contract or tort\n\n    in a District Court, any counterclaim or set-off and counterclaim of any defendant\n\n    involves a matter beyond the jurisdiction of the District Court, any party to the action\n\n    may apply to the High Court, within such time as may be prescribed by Rules of Court, for\n\n    an order that the whole proceedings, or the proceedings on the counterclaim or set-off and\n\n    counterclaim, be transferred to the High Court.’30.        Ms Phua’s point was\n\nthat s 24(1) specifically enables a transfer to be made in the situation where the quantum\n\nin the counterclaim or set-off and counterclaim involves a matter ‘beyond the\n\njurisdiction’ of the lower court, but no such words are found in s 53 when they could\n\neasily have been included if that was Parliament’s intention.31.        As regards the question\n\nwhether Mr Tan could use s 24(1), he could not because that provision applied to a\n\ntransfer from the District Court to the High Court and not from the Magistrate’s\n\nCourt to the District Court. Secondly, it applied only where the amount in the\n\ncounterclaim or set-off and counterclaim is beyond the lower court’s jurisdiction and\n\nnot where the amount in the main claim itself is beyond that jurisdiction. Thirdly, under\n\ns 24(1), the application is made to the High Court and not to the District Court.32.        Another provision that\n\nshowed a contrast to s 53, was s 38 which states:‘General power to transfer from District Court\n\n    to High Court38. Where it is made to appear to the High Court, on\n\n    the application of a party to any civil proceeding pending in a District Court, that the\n\n    proceeding by reason of its involving some important question of law, or being a test\n\n    case, or for any other sufficient reason, is one which should be tried in the High Court,\n\n    it may order the record to be transferred to the High Court.’33.        The words ‘or for any\n\nother sufficient reason’ do not appear in s 53. Also under s 38, the application is\n\nto transfer a civil proceeding in a District Court to the High Court. The application must\n\nalso be made to the High Court.34.        Ms Phua also drew my\n\nattention to s 52(1) and the provisions referred to therein but it is not necessary for me\n\nto elaborate on them in my Grounds.35.        Ms Adeline Chong, Counsel\n\nfor the Third and Fourth Defendants, submitted that when the court inManakauraised the amount in issue as one of the factors to be taken into account, this was in the\n\ncontext of s 43(2) of their District Courts Act 1947 which applies where the value of the\n\nproperty or relief claimed in issue does not exceed NZ$50,000.",
        "My Decision": "36.        I was not certain whether\n\nthe reference inManakauto the amount in issue as being one of the factors to be\n\nconsidered was because of the limit to the jurisdiction of the District Courts Act under s\n\n43(2) thereof. In any event, that is neither here nor there because there is a limit to\n\nthe jurisdiction of our Magistrate’s Court as well.37.        Besides, it was clear that\n\nthe amount in issue was not the sole or the most important factor inManakau.38.        In any event, it was my\n\nview that the amount in issue per se is not a relevant factor in determining whether\n\n‘some important question of law or fact is likely to arise’ under our s 53. A\n\nfortiori, the quantum in itself does not constitute an ‘important question of law or\n\nfact’.39.        I was of the view that in\n\norder for the question of law or fact to be ‘important’ for the purpose of s 53,\n\nit should affect more than the immediate interests of the parties. It should be applicable\n\nto others as well. A distinction should be drawn between ‘important’ and\n\n‘difficult’. Accordingly, I prefer the decision of Judge Gordon Clark and\n\nrespectfully differ from the decision of the English Court of Appeal inPatterson.40.        Even if I were wrong on\n\nthis point, I reiterate that even if the amount in issue may be beyond the jurisdiction of\n\nthe Magistrate’s Court, that in itself does not show that an ‘important question\n\nof law or fact is likely to arise’.41.        I agreed that if that was\n\nParliament’s intention, s 53 would have used similar words as are found in s 24 i.e\n\n‘involves a matter beyond the jurisdiction’ of the Magistrate’s Court.42.        I also agreed that s 38\n\ngives the High Court a wider discretion than s 53 gives to the Magistrate’s Court.\n\nHence, I have, on other occasions, applied the words ‘or for any other sufficient\n\nreason’ in s 38 to a situation in which the amount in dispute in the District Court\n\nmay be beyond the jurisdiction of that court. However, those words are not found in s 53\n\nwhich applies to an intended transfer from the Magistrate’s Court to the District\n\nCourt.43.        I would add that para 10\n\nof the District Court’s Grounds of Decision states, inter alia, that Mr Tan should\n\napply to the High Court, as opposed to the Magistrate’s Court, for the transfer of\n\nhis action to a more appropriate forum. It also states that this view is supported by the\n\nMalaysian case ofKee Chai Heng.44.        It is true that the\n\nMalaysian High Court inKee Chai Hengsaid that only the High Court has the power\n\nto transfer a civil case from a Sessions Court to a Magistrate’s Court and vice\n\nversa. However, while reliance was placed by the court there on para 12 of the Schedule to\n\nthe Courts of Judicature Act, the judgment did not elaborate in detail on the provisions\n\nof that Schedule vis--vis their Subordinate Courts Act. Accordingly, I was unable to\n\nderive more assistance from that case on this point.45.        On the other hand, I have\n\nrecently ruled in Originating Summons No 687 of 2002Chiltern Park Development Pte Ltd\n\nv Ong Pang Wee & othersthat the Singapore High Court has no power to transfer an\n\naction from the Magistrate’s Court to the High Court, or, for that matter, from the\n\nMagistrate’s Court to the District Court. I reached this conclusion after considering\n\nour Supreme Court of Judicature Act (Cap 322) and various provisions in our Subordinate\n\nCourts Act.46.        As I said in my judgment\n\nin theChiltern Parkcase, the power given to the High Court in Clause 10 of the\n\nFirst Schedule of the Supreme Court of Judicature Act is to be read subject to any written\n\nlaw and the Subordinate Courts Act is such a written law. It seems to me that the only\n\nprovision in respect of the transfer of an action from the Magistrate’s Court to the\n\nDistrict Court is s 53. I will elaborate.47.        One possible argument is\n\nthat s 53 is an enabling provision for a Magistrate’s Court to transfer an action in\n\nthe Magistrate’s Court to the District Court and does not circumscribe the powers of\n\nthe High Court as given in Clause 10 of the First Schedule of the Supreme Court of\n\nJudicature Act. So, the High Court can order a transfer from the Magistrate’s Court\n\nto the High Court or to the District Court.48.        While that is an\n\nattractive argument, it seems to me that that is not the scheme under the Subordinate\n\nCourts Act which envisages that an action in the Magistrate’s Court can only be\n\ntransferred to the District Court and only an action in the District Court can be\n\ntransferred to the High Court. There is no question of a double-jump i.e the transfer of\n\nan action in the Magistrate’s Court to the High Court.49.        As for the question\n\nwhether the High Court has the power to order the transfer of an action in the\n\nMagistrate’s Court to the District Court, I am of the view that it does not.\n\nOtherwise the requirements in s 53 would be otiose. The result would be that any litigant\n\nwho seeks a transfer of an action in the Magistrate’s Court to the District Court can\n\nby-pass s 53 and apply to the High Court instead and need not meet any of the requirements\n\nin s 53 about ‘some important question of law or fact’.50.        The District Court also\n\ndoes not have such a power i.e to transfer an action in the Magistrate’s Court to the\n\nDistrict Court, for the same reason. It would render s 53 otiose.51.        I understand that my\n\ndecision in theChiltern Parkcase is on appeal to the Court of Appeal.Sgd:WOO BIH LIJUDICIAL COMMISSIONERSINGAPORECopyright © Government of Singapore."
    }
}