{
    "case_title": "Industrial & Commercial Bank Ltd v P. D. International Pte Ltd",
    "ncitation": "[2002] SGHC 269",
    "coram": "S Rajendran J",
    "sections": {
        "Admissibility of Cheang’s\n\naffidavit": ":16.        \n\nThese proceedings were commenced by way of originating summons. Proceedings by way of\n\noriginating summons are generally heard on the basis of the affidavits filed by the\n\nparties. This is provided for in Order 38, rule 2(2), the material parts of which read:\"In any cause or matter\n\n    begun by originating summons … evidence shall be given by affidavit …\"That rule then goes on to\n\nstipulate:\"but the Court may, on the\n\n    application of any party, order the attendance for cross-examination of the person making\n\n    any such affidavit, and where, after such an order has been made, the person in question\n\n    does not attend, his affidavit shall not be used as evidencewithout the leave of the\n\n    Court.\"(Emphasis added.)In the present case, the parties\n\nhad, prior to the commencement of this hearing, applied for leave to cross-examine each\n\nother’s witnesses and such leave had been granted.17.        \n\nCheang had sworn her affidavit on 20 December 2001. Evidence was led that shortly\n\nthereafter she had been retrenched by ICB and had returned to her hometown in Ipoh.\n\nEvidence was also led that when asked to attend this hearing, Cheang, citing family\n\ncommitments, had refused to attend.18.        Mr\n\nVinodh Coomaraswamy, who appeared for PDI, submitted that as the crucial issue in this\n\ncase was the intention of the parties when they signed the Security Memorandum, it was\n\nimportant that he cross-examine Cheang not only because the testimony in her affidavit\n\ndiffered materially from the testimony of Poh but also to elicit information material to\n\nhis client not alluded to in her affidavit. He therefore urged the court, in the exercise\n\nof its discretion under Order 38 rule 2(2), to reject her affidavit since she was not\n\npresent for cross-examination.19.        Mr\n\nCoomaraswamy was not able to cite any direct authority on the principles that should guide\n\nthe court in exercising that discretion. He, however, drew the attention of the court to\n\nthe case ofUMBC Finance Ltd v Woon Kim Yan[1990] 3 MLJ 360where the Malaysian\n\nSupreme Court held that the discretion to admit the affidavit of a person not called as a\n\nwitness at the trial should not be exercised if the evidence was strongly contested or\n\nwhere the evidence related closely to the credibility of the witness. Mr Coomaraswamy\n\nsubmitted that although that case related to the calling of witnesses at a trial begun by\n\nwrit, the approach taken by the court in that case would, nevertheless, be a relevant\n\nguideline.20.        Mr\n\nHri Kumar, who appeared for ICB, also adopted the guidelines enunciated inUMBC Finance\n\nLtd. Mr Kumar accepted that the more contentious the contents of the affidavit, the\n\nless likely it would be that the court would exercise its discretion to admit that\n\naffidavit in evidence without cross-examination. Mr Kumar submitted that on that criterion\n\nthere was nothing particularly contentious about the contents of the affidavit of Cheang.\n\nThe most \"contentious\" part of her affidavit, he submitted, was paragraph 5\n\nwhere she said:\"I did not, at any time,\n\n    represent to any of the Defendants’ representatives in any of our discussions and/or\n\n    meetings that the deposit of the Twinwood shares were meant to secureonlythe MEP\n\n    facilities … It was not within my authority to vary the terms of the Security\n\n    Memorandum.\"Paragraph 5, Mr Kumar submitted,\n\ndid not contain anything dramatically different from the evidence of Poh. He submitted\n\nthat, to the contrary, Cheang’s affidavit was consistent with Poh’s evidence in\n\nthat, like Poh, she too states that the discussions centred on the securing of MEP’s\n\nfacilities. There was therefore considerable common ground between the affidavits of\n\nCheang and Poh. On the question of PDI not being able to question Cheang on matters not\n\ncovered in her affidavit, Mr Kumar pointed out that all the documents (including internal\n\ndocuments) prepared by Cheang in connection with the deposit of the Twinwood shares had\n\nbeen produced to the court and those documents spoke for themselves.21.        I\n\nwas satisfied that there was nothing particularly contentious in the affidavit that had\n\nbeen sworn to by Cheang and I noted Mr Kumar’s submission that all relevant\n\ndocuments prepared by Cheang were available in evidence. ICB had also adduced satisfactory\n\nevidence to explain why they were not able to procure Cheang’s attendance. Mr\n\nCoomaraswamy’s complaint that because of the failure to call Cheang for\n\ncross-examination he will not be able to elicit information material to his clients that\n\nhad not been covered in Cheang’s affidavit was a valid complaint but was not by\n\nitself sufficient reason to exclude Cheang’s affidavit which – as Mr Kumar\n\nsubmitted – did not contain any seriously contentious matter.22.        In\n\nthe circumstances, I was inclined to grant ICB the leave it sought to use Cheang’s\n\naffidavit as evidence. However, since the evidence as it unfolded in the course of\n\ncross-examination of the witnesses for both sides may have a bearing on the matter, I felt\n\nthat it would be prudent not to make a final order until the close of the case.\n\nI therefore directed that pending a final ruling the case proceed on the basis that\n\nthe affidavit was admissible.23.        \n\nHaving now heard all the evidence and the submissions of the parties, I see no reason to\n\nalter that initial ruling. The fact that Cheang’s affidavit was admitted without PDI\n\nhaving the opportunity which they sought to cross-examine her on matters not covered by\n\nher affidavit is a matter that I can take into account in assessing the overall merit of\n\neach party’s case.",
        "Rectification": ".24.        In\n\norder to succeed in its application to rectify the Security Memorandum, PDI must establish\n\neither –(a) that there was a common\n\n    mistake in the terms set out in the Security Memorandum; or(b) that PDI was unilaterally\n\n    mistaken in respect of the terms of the Security Memorandum and ICB was aware of\n\n    PDI’s mistake but did nothing to draw PDI’s attention to that mistake.In this case PDI was not alleging\n\nunilateral mistake. Their defence was that it was never intended by either party that the\n\ndeposit of the Twinwood shares would cover PDI’s liability to ICB. PDI was, as\n\nMr Coomaraswamy expressly confirmed, relying only on common or mutual mistake.25.        The\n\nonly witness who gave direct evidence on behalf of PDI on the discussion that took place\n\nwith Cheang of ICB prior to the execution of the Security Memorandum was Poh. Evidence was\n\nled that Yap, the other person who participated in these discussions, had left the employ\n\nof PDI and had refused to co-operate.26.        \n\nPoh’s evidence was to the effect that at the time of the negotiations leading to the\n\ndeposit of the Twinwood shares, only MEP’s account was in default and the discussions\n\nhe had with ICB related to regularising only that account. To quote from his affidavit:\"11. It is crucial to note\n\n    that all my discussions with Ms Jean Cheang were conducted purely on the basis that\n\n    the MEP facilities were in excess and had to be secured by further securities. This was\n\n    because it was the only issue which was discussed and to which we directed our sole\n\n    attention. There was no discussion of the facilities extended by the Plaintiff to us or\n\n    our other subsidiaries apart from MEP.\"Poh’s claim that the\n\ndiscussions with ICB centred only on providing security for MEP’s liabilities\n\naccorded, as noted earlier, with Cheang’s testimony on the matter.27.        Mr\n\nKumar submitted that the fact that the discussions with ICB centred on the provision of\n\nsecurity for the MEP account was not, by itself, evidence that ICB did not intend that the\n\nsecurities provided by PDI would also constitute security for other liabilities of PDI to\n\nICB. He pointed out that the standard form that ICB used for such deposits – the\n\nSecurity Memorandum – clearly envisaged that the securities provided would also be\n\nsecurity for the Mortgagor’s (ie PDI’s) other liabilities to ICB. He submitted\n\nthat Cheang’s discussion with Poh relating to the deposit of the Twinwood shares was\n\nclearly in the context of that standard form. Mr Coomaraswamy, however, submitted that the\n\ndiscussions were only about obtaining additional security for the MEP account and that the\n\ncommon intention of both parties at the time of the discussion was to provide additional\n\nsecurity for that account and no more. He submitted that in requiring PDI to execute the\n\nstandard Security Memorandum form Cheang had overlooked the fact that that form in its\n\nfine-print contained terms making the deposit not only security for all of the\n\n\"borrower’s\" (ie MEP’s) liabilities but also security for all of the\n\n\"mortgagor’s\" (ie PDI’s) liabilities to ICB.28.        The\n\nquestion that I have to decide is therefore whether at the relevant time the parties\n\nintended to secure only the MEP account and nothing more or whether they also intended to\n\nsecure PDI’s liabilities to ICB in respect of other accounts.29.        It\n\nwas not in dispute that a party seeking rectification of a document will be required to\n\nshow \"convincing proof\" not only that the document to be rectified was not in\n\naccordance with the parties’ true intention at the time of its execution but also\n\nthat the document in its proposed form would accord with that intention (see: Kok Lee Kuen\n\n& Anor v Choon Fok Realty Pte Ltd & Ors[1996] 2 SLR 572;Chitty on\n\nContracts(1999 Ed) at 326/327).30.        It\n\nwas not in dispute that the reason why the Twinwood shares came to be deposited with ICB\n\nwas that the MEP account exceeded the stipulated margin limit as a result of the decline\n\nin the value of the ADL shares that had previously been deposited to secure the MEP\n\nfacilities. It is against that background that the evidence in this matter has to be\n\nevaluated. Poh’s evidence in effect was that he (on behalf of PDI) agreed to\n\ndeposit the Twinwood shares with ICB as a temporary measure to give PDI and MEP time to\n\nresolve the finances of MEP. It was also his evidence that Cheang assured him that when\n\nthe MEP account was settled ICB would return the Twinwood shares to PDI.31.        As\n\nCheang was not available for cross-examination, Poh’s version of what transpired at\n\nthe discussions between them could not be put to her. Cheang’s evidence as contained\n\nin her affidavit also did not sufficiently delve into the details of the discussions she\n\nhad with PDI. However, as part of the discovery process, ICB had disclosed its internal\n\ndocuments relating to the deposit. Mr Coomaraswamy took me through these documents in some\n\ndetail. What was particularly interesting was the contents of two internal documents dated\n\n12 December 1997 and 17 December 1997.32.        In\n\nthe memo of 12 December 1997, Cheang informed the President of the United Overseas Bank\n\n(\"UOB\") – the parent bank of ICB – that MEP’s account with ICB\n\nhad fallen into excess and she made the following request:\"To allow a 3-month period\n\n    for Borrower to repay the above shortfall of $2,016,700 andregularise the account…Borrower will deposit about 20m\n\n    newly listed Twinwood shares (SESDAQ) worth approximately $5.6m (40% advance margin =\n\n    $2.24m) with our Bankpending regularisation of the account. However, these shares\n\n    belong to the borrower’s parent, PD International PL (‘PDI’) which, as a\n\n    promoter of the Twinwood listing, is under a one year moratorium period not to\n\n    dispose these shares. The same condition will apply to the shares deposited with us.Borrower is actively seeking\n\n    financing from other banks against pledging of these Twinwood shares.We will\n\n    progressively release the above deposited shares to these banks as funds generated from\n\n    these new loans are utilised to regularise our account.\"(Emphasis added.)In the further memo to the\n\nPresident UOB dated 17 December 1997, Cheang stated:\"Further to our memo dated\n\n    12/12/97 (copy attached for reference), MEP has deposited a single share certificate for\n\n    25,763,016 Twinwood Engineering Ltd shares with us on 17/12/97 to provideadditional\n\n    security comfort… These shares belong to PD International Pte Ltd,\n\n    MEP’s 100% holding company.Meanwhile, we have advised them\n\n    to obtain funds to regularise this account within 3 weeks.In view of the short term,\n\n    we will not send the share script for splitting.\"(Emphasis added.)On this memo of 17 December 1997,\n\nin response to a handwritten query from senior management, appears the following\n\nhandwritten note of Cheang: \"The shares are depositedwith usfor only a\n\nshort term pending obtaining funds from other finance Cos to cover excesses (in cash).\"33.        The\n\npicture that emerges from these internal documents is that ICB was seeking to hold the\n\nTwinwood shares only until such time as the MEP account was regularised. It appears to\n\nhave been expressly envisaged at that time that the Twinwood shares would be released when\n\nthe MEP account was regularised. These internal documents are not consistent with the\n\nTwinwood shares being held as security for any purpose other than in connection with the\n\nMEP account. The internal documents therefore add considerable support to Poh’s\n\nversion of the discussions he had with Cheang34.        In\n\nhis affidavit, Poh had stated that Cheang had assured him that ICB would hold the Twinwood\n\nshares as collateral and would not enforce the collateral. Mr Kumar submitted that no\n\nbanker would give such an assurance and invited the court not to give credence to\n\nPoh’s testimony. Whilst as a general proposition I would agree that no responsible\n\nbanker would give such an assurance, I would have to consider the context in which this\n\nassurance was allegedly given before concluding that Poh’s testimony should be\n\nrejected. When questioned on the context, Poh’s response was:\"She said that if I give the\n\n    Twinwood shares, it would be easy for her to put up a paper to management to help me.\n\n    I told her the shares were under moratorium. She said it does not matter and asked me\n\n    to give the Twinwood shares to her and she assured me that when the MEP account is settled\n\n    she will return the Twinwood scrips.\"Given the contents of the\n\ninternal memos and given that the Twinwood shares were at that time subject to a\n\nmoratorium on sale, it is entirely possible that Cheang may have given an assurance along\n\nthose lines .35.        The\n\nSecurity Memorandum was sent to PDI for signature and it remained with PDI for a few days\n\nbefore it was signed and returned. PDI therefore had time to study the terms in the\n\nSecurity Memorandum before executing it. Mr Kumar submitted – relying on the case ofTaylor\n\nBarnard Ltd v Tozer & Anor(1984) 1 EGLR 21 – that if it was reasonable to\n\nexpect the other party to check the draft of the agreement, rectification will not be\n\nallowed.36.Taylor Barnardwas a case where two solicitors were negotiating the terms of a lease\n\nwhere, in the usual way, one solicitor would send a draft for the consideration of the\n\nother who would then return the draft with suggested modifications and the process would\n\ngo on until the draft was settled. Where an agreement is reached on that basis, it would\n\nobviously be very difficulty for a party to obtain rectification of the document on the\n\ngrounds of mistake as the nature of the negotiation required the checking of every draft.\n\nThat, however, was not the fact situation here. PDI and ICB had had discussions with\n\nICB about the deposit of Twinwood shares as further security for the MEP until the MEP\n\naccount was regularised. After agreement was reached ICB sent the Security Memorandum to\n\nPDI for execution. Unlike the situation inTaylor Barnard, the Security Memorandum\n\nwas not sent to PDI as a draft that was to serve as a basis for further negotiations. The\n\nprinciple inTaylor Barnardtherefore had little or no application in this case.37.        \n\nPoh’s evidence in this case was substantially supported by ICB’s internal\n\ndocumentation. It was also consistent with the terms of the Board resolutions of PDI\n\nreferred to at paragraphs 5 and 6 above which resolutions, as has been noted, were drafted\n\nby ICB for PDI’s execution. These Board resolutions refer specifically to the\n\nTwinwood shares being security for the MEP account.38.        I\n\nam satisfied that PDI has shown convincing proof that the Security Memorandum that was\n\nsigned did not accurately reflect the intention of either ICB or PDI. Having arrived at\n\nthat decision, it becomes unnecessary for me to consider the alternative defence\n\nraised that as ICB knew that the Security Memorandum was executed in excess of the\n\nrelevant director’s authority as stated in Board resolutions, the Security\n\nMemorandum was to that extent unenforceable against PDI.39.        As\n\nI am satisfied beyond reasonable doubt that the Security Memorandum was signed under a\n\ncommon mistake, I dismiss with costs ICB’s claims in the Originating Summons and\n\ngrant PDI’s application to rectify the Security Memorandum by deleting the phrase\n\n\"and/or the Mortgagor\" in cll 1.1, 8.1 and wherever else that phrase appears.Sgd:S. RAJENDRANJudgeCopyright © Government of Singapore."
    }
}