{
    "case_title": "Public Prosecutor v Muhamad Hasik bin Sahar",
    "ncitation": "[2002] SGHC 105",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "THE STATEMENT OF FACTS": "4. The deceased was a student of the Institute of Technical Education\n\nat Ang Mo Kio. He was also a national youth soccer player.5. On 30 May 2001, at about 10.15 pm, he and his two friends, Shariff\n\nand Imran, attended a party at the \"Rootz\" discotheque in the Riverwalk Galleria\n\nlocated at Upper Circular Road. They left the discotheque at about 3 am on 31 May 2001 and\n\nwent to a nearby restaurant for supper.6.    In the meantime, the Accused and his seven friends named in the\n\ncharge were at the \"Seven\" Discotheque at Mohammed Sultan Road celebrating\n\nSyamsul’s birthday. All eight persons are members of the \"369\" secret\n\nsociety of the \"18\" group also known as the \"Sio Koon Tong\" secret\n\nsociety. When the discotheque closed at about 3 am on 31 May 2001, the group proceeded to\n\na nearby coffee shop along River Valley Road for snacks and drinks.7.    At the coffee shop, Norhisham, Syamsul and Sharulhawzi decided to\n\nlaunch a surprise attack on a rival gang, \"303\", operating in the Boat Quay\n\narea. The group then proceeded to plan the attack. Sharulhawzi asked Fahmi and Ridzwan to\n\ngo ahead of the group in a taxi to the \"Rootz\" discotheque to check whether the\n\nrival gang members were there. Sharulhawzi gave Ridzwan $20 for the taxi fare.8.    At about 4.20 am, the two \"scouts\" arrived at the\n\ndestination and confirmed by mobile telephone the presence of the members of the said\n\nrival gang. They were also instructed to be ready to get two taxis as the get-away\n\nvehicles for the entire group.9.    The other six members of the group (including the Accused) then\n\nproceeded in two taxis to Boat Quay. When they were ready to attack, Sharulhawzi informed\n\nFahmi by mobile telephone to flag down two taxis and direct the vehicles to Boat Quay to\n\npick up the other six members.10.    At around 4.30 am, the deceased and his two friends left the\n\nrestaurant and started walking along South Bridge Road towards the City Hall Mass Rapid\n\nTransit Station. As they were walking past a pub (\"Bernie Goes to Town\") located\n\nalong that stretch of road near the Singapore River, the group of six was walking in the\n\nopposite direction along the other side of the road. The six then crossed the road and\n\naccosted the three friends from behind. Norhisham, Syamsul and Sharulhawzi brought out the\n\nknives which they had kept on their bodies.11.    Norhisham asked the three friends in Malay which gang they\n\nbelonged to but before they could answer, they were set upon by the six. The Accused saw\n\nthe deceased’s friend, Shariff, stabbed in the back by Syamsul. The Accused threw\n\nsome punches at Shariff’s head. As the deceased’s two friends ran for their\n\nlives, the Accused, Fazely and Khairul Famy chased them. The deceased’s two friends\n\nmanaged to escape from their attackers.12.    The Accused, Fazely and Khairul Famy, having failed to catch up\n\nwith the deceased’s two friends, then returned to where the deceased was lying on the\n\nsteps of the \"Bernie Goes to Town\" pub. He had collapsed after being attacked by\n\nthe other three armed gang members who continued to stab and slash him although he was not\n\nputting up any resistance. Khairul Famy shouted to the three armed members in Malay to\n\nmove aside. The Accused, Fazely and Khairul Famy then moved in to kick and to punch the\n\ndeceased repeatedly in the face. Fazely also used a \"belt-chain\" to whip the\n\ndeceased’s body.13.    After the attack, the group of six looked around for the two\n\nget-away taxis but they were not able to locate them. They then managed to flag down two\n\nother taxis and left the scene for a rented flat in Tampines. While fleeing, one of them\n\nchanted the gang’s slogan. The remaining two gang members were informed by mobile\n\ntelephone to meet at the said rented flat.14.    At the said flat, the group of six cleaned themselves. When the\n\nother two returned to join them, they all talked about the assault on the deceased.15.    At about 4.39 am, a member of the public called the police to\n\ninform them about the deceased who was lying on the pavement along South Bridge Road,\n\nbleeding profusely. The police arrived at the scene shortly thereafter and called for an\n\nambulance. The deceased was brought to the Singapore General Hospital where he passed away\n\nat about 5 am.16.    The post mortem report stated that the deceased had 13 stab\n\nwounds and certified the cause of death as \"stab wounds to the neck and chest.17.    Shariff suffered a 1.5 cm knife wound at the right side of his\n\nchest. He was hospitalized and then discharged on 2 June 2001. Imran did not sustain any\n\ninjury.18.    On 15 June 2001, the Accused was arrested. This was followed by\n\nthe arrest of Fazely on 25 June 2001. Khairul Famy, who had fled to Batam, was arrested by\n\nthe Indonesian police and brought back to Singapore on 11 September 2001. These two gang\n\nmembers are standing trial in another High Court.19.    Ridzwan and Fahmi pleaded guilty in the Subordinate Courts on 22\n\nNovember 2001 to a charge under section 147 Penal Code and were sentenced to three years\n\nimprisonment and to receive six strokes of the cane. The remaining three gang members who\n\nwere armed are still at large.",
        "ANTECEDENT": "20.    The Accused was convicted on 6 August 1996 on a charge of\n\nvoluntarily causing hurt with dangerous weapons or means under section 324 read with\n\nsection 34 Penal Code. He was sentenced to undergo reformative training.",
        "PROSECUTION’S SUBMISSIONS ON SENTENCE": "21.    The Prosecution argued that the Accused should be sentenced\n\nto undergo life imprisonment as the attack was pre-meditated and vicious. It was also\n\ndirected at persons who were not members of any secret society and not known to the\n\nAccused and his gang members. The facts showed that the Accused was an active participant\n\nin the ruthless and senseless attack on a totally defenceless victim. It was submitted\n\nthat the Accused was part of a mob which would \"loot and shoot completely innocent\n\nbystanders without giving a hoot\", echoing my words quoted on appeal inPP v\n\nTan Kei Loon Allan[1999] 2 SLR 288(at paragraph 15), where the Court of Appeal\n\nenhanced the sentence imposed by me.22.    The attack took place at a location which was a \"favourite\n\nwatering hole for locals, expatriates and tourists alike\". Statistics from the\n\nCriminal Investigation Department showed that there were 42 cases of rioting along the\n\nstretch from Boat Quay to Clarke Quay for the years 2000 and 2001.23.    The Prosecution also tendered the deceased’s father’s\n\nVictim Impact Statement where he stated that he forbade his other children from going out\n\nat night for fear that they too might be attacked for no apparent reason. It was submitted\n\nthat public roads should be kept safe.24.    It was also argued that public interest outweighed the mitigating\n\neffect of the Accused’s plea of guilt here and that the relative youth of the Accused\n\nshould not be the main factor excluding him from being considered for life imprisonment\n\nwhere the circumstances warranted the imposition of such a sentence. The acts constituting\n\nthe offence, the motives behind them and their consequences should also be examined[PP\n\nv Ng Kwok Soon(Criminal Case No. 58 of 2001) – unreported]. The Accused had\n\nalso denied any involvement when he was questioned by the police.",
        "THE MITIGATION": "25.    The Accused was 21 years old at the time of the offence and is\n\nnow 22. He received education up to Secondary 1 and then dropped out of school. He was\n\nunemployed all along, living with his parents and his siblings in a four-room HDB flat in\n\nTampines. He is the second eldest in his family. He has a steady girlfriend since 1995 and\n\nwas planning to marry her.26.    The previous conviction in 1996 arose out of a fight amongst\n\nfriends and was not related to gang disputes.27.    He was introduced to Norhisham by the latter’s brother in\n\n1998. He turned to Norhisham for advice and for financial assistance. Norhisham would\n\nalways foot the bill whenever they went out for meals or for drinks. He therefore felt a\n\nsense of loyalty to Norhisham.28.    In January 2001, after the Accused and his friends were assaulted\n\nby a group along Orchard Road, Norhisham told him to join his gang so that nobody would\n\nbully him anymore. He became a member of the gang upon Norhisham’s insistence but\n\nnever knew about nor participated in any gang activities other than going drinking at\n\nnightspots with the gang once or twice a week.29.    He had gone for the birthday celebrations on 30 May 2001 without\n\nany inkling that there would be a fight later. Any planning concerning the attack was done\n\nby the 3 armed gang members only and that was only when they were at the coffee shop after\n\nthe celebrations. He was not around when Sharulhawzi gave the directions to Fahmi and to\n\nRidzwan. Those three armed gang members were the leaders and the principal offenders that\n\nearly morning. Having agreed to go along to fight the rival gang, he was afraid to pull\n\nout as he felt obligated to Norhisham and because he had been warned before of the\n\nconsequences of being a traitor. Although the Accused suspected that Norhisham was\n\ncarrying a knife, he did not know for sure until the latter took it out just before the\n\nattack. He did not know the other two also each had a knife. He was unarmed.30.    It was Norhisham who directed the group of six to cross the road\n\ntowards the victims and it was he who started the attack after posing the question to the\n\nvictims. The Accused merely started chasing Shariff when instructed to do so by Syamsul.\n\nThe fatal attack took place when he was doing so.31.    He did not cause any fatal or serious injuries to the deceased.\n\nHe played a minor role and, at the most, was responsible only for the minor bruises and\n\nabrasions suffered by the deceased.32.    The group returned to the rented flat in Tampines as some of them\n\nwere staying in that flat. It was not a case of meeting there for a debrief after a\n\nmilitary operation.33.    Although the Accused was legally liable for the combined actions\n\nof the group, it was submitted that the court should consider their individual roles when\n\nsentencing each of them. Reliance was placed onPP v Ravindran[1993] 1 MLJ 45where Visu Sinnadurai J in the Malaysian High Court, in a case involving section 304 Penal\n\nCode, said (at page 50) :\"It should be emphasized that whilst public interest plays an\n\n  important role in sentencing practice, there are other important factors which a court\n\n  needs to consider in imposing a particular sentence. Whilst it is recognized that no two\n\n  cases may be the same, the exercise of the court’s discretion should be in accordance\n\n  with certain accepted principles or guidelines so as not to have too great a disparity in\n\n  sentences for the same offence.\"The judge then went on to consider factors such as a discount or credit\n\nfor a plea of guilt, comparison of sentences in other cases for a similar offence,\n\ndisparity of sentences amongst the accused persons and other mitigating factors relevant\n\nto the particular case.34.    The Accused here has pleaded guilty. This showed his remorse. He\n\nhas also saved much public time and expense.35.    The sentences imposed in cases involving section 304(a) Penal\n\nCode and which did not concern accused persons who were mentally unstable ranged from six\n\nto ten years imprisonment. InPP v Tan Kei Loon Allan(cited earlier), life\n\nimprisonment was not imposed although the accused in that case was the only one armed with\n\na dangerous weapon and was the one who inflicted the fatal injuries. The attack in that\n\ncase was also in a public place, the accused was a member of a secret society, there was\n\nno provocation and the deceased was outnumbered.36.    The culpability of the Accused in the present case was lower than\n\nthat in the other cases in that he was not the gang leader and was not the one who thought\n\nof and planned the attack, he was not armed at all and was not the one who inflicted any\n\nof the fatal injuries. It was argued thatPP v Ng Kwok Soon, where I\n\nsentenced the accused to life imprisonment on a charge of attempted murder under section\n\n307(1) Penal Code, could be distinguished on its facts.37.    It was further submitted that the statistics provided by the\n\nProsecution showed an overall decrease of about 10% in the number of rioting cases at Boat\n\nQuay and at Clarke Quay between 2000 and 2001. There was also a decrease of 60% in cases\n\ninvolving gangs between those two years.38.    In the circumstances, it was argued that life imprisonment was\n\nnot appropriate here.",
        "THE DECISION OF THE COURT": "39.    In sentencing the Accused to life imprisonment on 9 May 2002, I\n\nsaid the following :\"1. Sulaiman Bin Hashim was a promising young man who had gone out\n\n  with 2 friends to enjoy some night life on 30 May 2001. He ended up suffering a morning\n\n  death in the early hours of 31 May 2001. Why did he die so suddenly and tragically? The\n\n  inane but true answer is - eight members of a gang agreed, after some birthday\n\n  celebrations, to launch a surprise attack on another gang with which neither Sulaiman nor\n\n  his two friends had any connection. The attackers did not even know the three unfortunate\n\n  friends.2.    The admitted facts showed that the attack was premeditated and\n\n  carefully planned. An advance party was sent into enemy territory at the Boat Quay area to\n\n  confirm the presence of the rival gang’s members. Weapons were carried. The Accused\n\n  suspected that at least one of the gang members was carrying a knife and certainly knew\n\n  that three of them had knives with them before the attack. The retreat after the incursion\n\n  into the Boat Quay area was also mapped out.3.    The attack was totally unprovoked. It was not the uncontrolled\n\n  reaction of persons who had been suddenly abused or assaulted. The attackers did not seem\n\n  interested in finding out whether the unfortunate threesome were indeed rival gang\n\n  members. It seems to me that the predators were merely spoiling for some violent action\n\n  and the prey happened to be outnumbered by two to one. The horrendous acts that early\n\n  morning were indiscriminate and senseless.4.    When the Accused, after losing the deceased’s two friends who\n\n  managed to escape, returned to where the deceased was, the latter had already collapsed\n\n  helplessly onto the ground. Far from being shocked by his fellow assailants’ use of\n\n  the knives and their continued stabbing and slashing at the defenceless victim, the\n\n  Accused wanted some of the appalling action for himself and joined in kicking and punching\n\n  the face of a man who was obviously not able to offer any resistance. 13 stab wounds were\n\n  found on the victim, seven of which were at the vulnerable head and neck regions.5.    Although the attack was in the very early hours of the morning, it\n\n  was nevertheless in a public area popular with locals and foreigners alike. Our streets\n\n  and public places must be kept safe by day and by night for law abiding people. There must\n\n  be no curfew at certain localities or during certain hours imposed by any gang. Gang\n\n  fights and running street battles have absolutely no place in a civilized society.6.    InPP v Tan Kei Loon Allan[1999] 2 SLR 288, the\n\n  Court of Appeal, after noting that life imprisonment now meant incarceration for the\n\n  remainder of a convicted person’s natural life with only the possibility of parole\n\n  after 20 years, sounded the following cautionary note :\"37. In that respect, we are of the view that the courts must now\n\n    exercise caution before committing a young offender to life imprisonment. Contrary to\n\n    traditional reasoning, in similar cases involving a youthful offender on the one hand and\n\n    an older offender in the other, the youthful offender sentenced to life imprisonment would\n\n    now be subject to a longer period of incarceration than an older offender, assuming they\n\n    both lived to the same age.\"There, the Court of Appeal was dealing with an 18 year old male\n\n  convicted of an offence under section 304(a) Penal Code (who also happened to be a member\n\n  of the Sio Koon Tong secret society like the present Accused). The Court of Appeal also\n\n  did not think it desirable to set a benchmark sentence for the offence of culpable\n\n  homicide under section 304(a) Penal Code. The sentence in that case was enhanced from 7\n\n  years imprisonment and 9 strokes of the cane to 10 years imprisonment and 15 strokes of\n\n  the cane.7.    InPP v Ng Kwok Soon(Criminal Case No. 58 of 2001),\n\n  in sentencing a 50 year old man to life imprisonment for attempted murder under section\n\n  307(1) Penal Code, I said :\"33. … However, the guidelines inNeo Man Lee v PPrelating to accused persons of unstable character did not mean that persons not suffering\n\n    from mental disorder should not be sentenced to imprisonment for life. One must still\n\n    examine the acts constituting the offence, the motives behind them and their consequences....42. … The Accused’s clean record, his plea of guilt and his\n\n    cooperation with the police would have earned him some merit if I could impose caning as\n\n    well … but, as I have stated, the Accused was not liable to be caned due to his\n\n    age.\"8.    The Accused was 21 years old at the time of the offence. He turned\n\n  22 in February this year. He has pleaded guilty and that shows some remorse on his part,\n\n  belated as it is. However, I have heard nothing that suggests that he felt remorse or even\n\n  unease during the two weeks or so after the incident. Indeed, as the Prosecution has said,\n\n  he denied any involvement when questioned by the police. He has a conviction under section\n\n  324 read with section 34 Penal Code for the offence of voluntarily causing hurt by\n\n  dangerous weapons or means and was sentenced to undergo Reformative Training. He was 16\n\n  years old then. The degree of his culpability in this episode may be lower than that of\n\n  Norhisham, Syamsul and Sharulhawzi but I disagree with Defence Counsel’s description\n\n  of it as a \"minor role\".9.    In the light of all that I have stated above, it is my view that\n\n  the lower tier of up to 10 years’ imprisonment is not appropriate for the Accused on\n\n  the facts of this case. He has clearly not learnt his lesson from his previous experience\n\n  in court. He has committed another offence involving physical violence, now with more\n\n  devastating consequences. He is relatively young but was hardly a juvenile at the time of\n\n  the offence. Those who feel victorious in being vicious and who have no qualms about the\n\n  annual celebration of one’s birth culminating in the untimely death of another will\n\n  have to spend all subsequent birthdays within prison walls until such time as they are\n\n  eligible for parole. There, hopefully, they will begin to learn to appreciate and value\n\n  another human being’s life.10.    The Accused is sentenced to life imprisonment with effect from\n\n  the date of his arrest on 15 June 2001. In view of the mitigating factors, he will not be\n\n  subject to the maximum 24 strokes of the cane but is to receive 16 strokes of the\n\n  cane.\"Sgd:TAY YONG KWANGJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}