{
    "case_title": "Nicholas Kenneth v Public Prosecutor",
    "ncitation": "[2002] SGHC 279",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Undisputed facts": "2        In DAC No 15228, Kenneth\n\nwas charged with five offences. The first charge alleged that he had kidnapped N, a\n\nnine-year old girl, at about 10:30 pm on 22 May 2001, an offence punishable under s 363 of\n\nthe Penal Code (Cap 224). By the second charge, he was accused of using criminal force\n\nwith intent to outrage N’s modesty, by touching her chest region including her breast\n\nwith his hand, contrary to s 354. By the third charge, Kenneth was accused of another\n\noffence under s 363 for kidnapping Q, a five-year old girl, on 20 December 2001, at about\n\n10:30 pm. Fourthly, he was charged with using criminal force with intent to outrage her\n\nmodesty, by inserting his finger to her vulva and causing fear of instant hurt to Q, an\n\noffence punishable under s 354A(2)(b) of the Penal Code. Kenneth pleaded guilty to all of\n\nthese offences. Finally, he also consented to having the fifth charge brought against him\n\ntaken into consideration. That charge alleged that he voluntarily caused hurt to Q by\n\nslapping her on the face, an offence punishable under s 323 of the Penal Code.3        In her grounds of decision,\n\ndistrict judge Lim set out the facts relating to the four charges which Kenneth pleaded\n\nguilty to as follows:The statement of facts for the first and second\n\n    charges4        On 22 May 2001, at\n\n    about 10.00 p.m., [N] had left her flat to go to the provision shop to buy some bread. As\n\n    she was leaving the shop and walking home, Kenneth approached her and told her that he had\n\n    arranged with her father for her to follow him. [N] agreed as she was unaware that Kenneth\n\n    had deceived her and was abducting her. They walked towards the bus stop and boarded a\n\n    bus. Whilst in the bus, Kenneth used his hand to touch her chest and breast. She felt\n\n    uneasy and tried to move away but failed. During the journey, he also gave her a few\n\n    tablets to consume. She felt drowsy and passed out. When she regained consciousness, she\n\n    found herself stranded at MacRitchie Reservoir. A passer-by found her and alerted the\n\n    police. Kenneth was subsequently arrested on 27 December 2001.The statement of facts for the third and fourth\n\n    charges5        On 20 December\n\n    2001, [Q]’s mother was selling durians at a makeshift stall at Redhill Close. [Q] and\n\n    her elder sister played in the vicinity whilst accompanying their mother. Subsequently [Q]\n\n    became separated from her elder sister and was left alone. At about 10.30 p.m., Kenneth\n\n    approached her and forced her to follow him, carrying her on his shoulders. She cried for\n\n    help but to no avail. Kenneth brought her to Redhill MRT station and boarded the MRT to\n\n    Pasir Ris where he brought her to his home. He made [Q] lie beside him on the bed, removed\n\n    her clothes, fondled her groin area and inserted his finger to her vulva. He then\n\n    masturbated himself and ejaculated in her presence. The next morning, he brought her to\n\n    the MRT station and they took the MRT to Redhill, where they alighted. He then left her by\n\n    herself and disappeared. [Q] walked to the hawker centre in the vicinity of Redhill Close\n\n    and a stranger brought her home.4        In DAC No 15227, Kenneth\n\npleaded guilty to kidnapping Z, a seven-year old girl, on 25 December 2001, at about 1 am,\n\ncontrary to s 363 of the Penal Code. District judge Chionh set out the facts relating to\n\nthis offence, in her judgment, as follows:3 …..The victim, [Z], is 7 years old. On 24\n\n    December 2001, she was at Singapore General Hospital (SGH) with [Z’s father] and\n\n    other family members. They were visiting the victim’s grandmother who was then warded\n\n    in Ward 46. At about 11 pm that day, the victim and her father fell asleep on the couch at\n\n    the visitors’ waiting area outside Ward 46.4        At about 1 am on 25\n\n    December 2001, the accused came to Ward 46. He carried the victim out of the ward and took\n\n    her home in a taxi. Once home, he took her into his room where she fell asleep on his bed,\n\n    next to him.5        Sometime later that\n\n    morning, the accused brought the victim back to SGH in another taxi. The victim\n\n    subsequently met her father in the vicinity where she was dropped off by the accused.5        Kenneth also pleaded guilty\n\nto a charge of having two prohibited publications, a \"Playboy\" magazine and a\n\n\"Penthouse\" magazine, in his possession, contrary to s 6(2) of the Undesirable\n\nPublications Act. The police found the magazines in his house when they searched it on 29\n\nDecember 2001.6        The facts relating to all\n\nthe offences that Kenneth was charged with were not in dispute. For the purposes of these\n\nappeals, I adopted the facts as set out in the judgments of both the district judges.",
        "The decisions below": "7        Both of the district judges\n\nfound that Kenneth was a great danger to society at large. Consequently, they were of the\n\nview that the maximum period of preventive detention, ie 20 years, was the appropriate\n\nsentence in their respective cases.8        District judge Lim\n\nreasoned, in her grounds of decision, as follows:… It is clear from Kenneth’s antecedents that\n\n    he is indeed a menace to society. Now 49 years old, his criminal career began in 1972 and\n\n    he has chalked up a total of 19 offences, not including the present offences before me.10        Indeed his\n\n    history of kidnapping and molesting young children is very disturbing. His first offence\n\n    for outraging modesty began in 1980, and in 1986 he had already garnered a string of\n\n    kidnapping offences with outraging of modesty and criminal intimidation. He repeated his\n\n    criminal acts again when he was dealt with for another string of offences in 1993 for\n\n    outraging the modesty of children under the age of 14 and was sentenced to eight\n\n    years’ preventive detention and eight strokes of the cane. Shortly after his release\n\n    from preventive detention, he committed similar offences again, which formed the charges\n\n    before me….It is clear that the previous term of preventive detention had not\n\n    deterred him from repeating such heinous activities and he continues to pose a grave\n\n    threat and danger to the public at large, especially to young children. Indeed, the\n\n    preventive detention report also found Kenneth to be at high risk of sexual offending.9        District judge Chionh gave\n\nthe following reasons for sentencing Kenneth to a period of 20 years’ preventive\n\ndetention. In her judgment:15        In the\n\n    present case, apart from the accused’s plea of guilt, there were no mitigating\n\n    factors. The alleged misery of his childhood as well as his emotional and mental problems\n\n    did not hold any real mitigatory value. Moreover, any mitigatory value due to his plea of\n\n    guilt was far outweighed by the element of public interest. Having considered the\n\n    accused’s previous record as well as the facts of the present offences, I was of the\n\n    view that he was a menace to society. The preventive detention report, which found the\n\n    accused to be at high risk of sexual re-offending, confirmed my view. Indeed from the\n\n    report, it was clear that the accused lacked any sort of remorse or insight insofar as his\n\n    criminal activities were concerned: according to the prison psychiatrist, he attempted to\n\n    minimise the consequences of his actions, and instead, blamed \"alcohol and his\n\n    hallucinations\".16        In short, preventive\n\n    detention was plainly called for in the interest of protecting the public – and\n\n    especially young females – from the accused. Bearing in mind the fact that the\n\n    accused committed the present offences shortly after his release from eight years’\n\n    preventive detention, I decided that the maximum period of preventive detention was\n\n    warranted.10        Furthermore, district\n\njudge Chionh ordered that the sentence which she imposed on Kenneth commence on the same\n\nday as the sentence imposed by district judge Lim, ie 12 August 2002.11        Kenneth was sentenced to\n\nthree strokes of the cane for each of the four charges before district judge Lim to\n\nreflect the severity of the offences which he committed. District judge Chionh also\n\nsentenced Kenneth to three strokes of the cane on the kidnapping charge before her for the\n\nsame reason.",
        "The appeal": "12        Kenneth appealed against\n\nthe sentences of preventive detention meted out to him in both cases. He claimed that he\n\nwas remorseful and promised not to re-offend. Furthermore, he asked the Court to consider\n\nhis appeal favourably because of his age, the fact that he was doing church work and as\n\nhis family needed him.13        The prosecution submitted\n\nthat the total sentence of 20 years’ preventive detention and 15 strokes of the cane\n\nimposed by the district judges was not manifestly excessive, taking into account the\n\naggravating manner in which the offences were committed, Kenneth’s previous\n\nantecedents, his propensity to commit sexual offences against young and vulnerable girls\n\nand the need to protect the general public from such a menace to society.",
        "The law": "14        At the outset, it was\n\nnecessary to consider a novel point of law that was raised as a result of the factual\n\nmatrix of these appeals. Kenneth had been sentenced by district judge Lim to 20\n\nyears’ preventive detention on 12 August 2002 which ran from the date of the order.\n\nThus, he was already undergoing a sentence of preventive detention when he appeared before\n\ndistrict judge Chionh later in the same day. She decided that, in such circumstances, the\n\ncourt had to order that the two sentences of preventive detention that were meted out to\n\nKenneth must run concurrently. The issue that had to be decided was whether the court was\n\nlimited to ordering that a subsequent sentence of preventive detention should run\n\nconcurrently with the other sentence of preventive detention that the accused was\n\nundergoing.15        The only provision in the\n\nCriminal Procedure Code (CPC) that deals with the commencement of subsequent sentences\n\nwhen the accused is serving another sentence is s 234(1). Thus, it was necessary to\n\nconstrue the ambit of this section to resolve the issue before me. It reads:When a person who is an escaped convict or is undergoing\n\n    asentence of imprisonmentis sentenced to imprisonment the latter sentence of\n\n    imprisonment shall commence either immediately or at the expiration of the imprisonment to\n\n    which he was previously sentenced as the court awarding the sentence directs. (my\n\n    emphasis)16        The principles governing\n\nthe interpretation of statutes are as follows: s 9A(1) of the Interpretation Act makes it\n\nimperative that the court adopts a purposive construction of a provision, and not merely a\n\nliteral interpretation. That section reads:In the interpretation of a provision of written law, an\n\n    interpretation that would promote the purpose or object underlying the written law\n\n    (whether that purpose or object is expressly stated in the written law or not) shall be\n\n    preferred to an interpretation that would not promote that purpose or object.17        InConstitutional\n\nReference No 1 of 1995[1995] 2 SLR 201, I delivered the judgment of the Constitution\n\nof the Republic of Singapore Tribunal and elaborated on how statutory interpretation\n\nshould be carried out, in the following words, at p 210:It is well established …that a purposive\n\n    interpretation should be adopted in interpreting the Constitution to give effect to the\n\n    intent and will of Parliament. The principle to be applied is that the words of the Act\n\n    are to be read in their entire context and in their grammatical and ordinary sense,\n\n    harmoniously with the scheme of the Act, the object of the Act and the intention of\n\n    Parliament: EA Driedger,Construction of Statutes(2nd Ed, 1983) p 8718        The court also decided\n\nthat, by s 9A(1) of the Interpretation Act, a purposive construction of a statutory\n\nprovision should be adopted over a literal interpretation that does not support the\n\npurpose and object of the written law, even if the wording of the statute is not ambiguous\n\nor inconsistent. At p 211 of my judgment, I quoted with approval the following judgment of\n\nDawson J inMills v Meeking(1990) 169 CLR 214:…. the approach required by s 35 [which correspondswith s 9A(1)] needs no ambiguity or inconsistency;it allows a court to consider\n\n    the purposes of an Act in determining whether there is more than one possible construction.\n\n    Reference to the purposes may reveal that the draftsman had inadvertently overlooked\n\n    something which he would have dealt with had his attention been drawn to it and if it is\n\n    possible as a matter of construction to repair the defect, then this must be done. (my\n\n    emphasis)This approach has been followed in numerous local cases, notably, the\n\ndecisions of the Court of Appeal inL & W Holdings Pte. Ltd. v Management\n\nCorporation Strata Title Plan No 1601[1997] 3 SLR 905and of the High Court inPP\n\nv Knight Glenn Jeyasingam[1999] 2 SLR 499.19        Bearing these principles\n\nin mind, I considered the construction of s 234(1) of the CPC. In my view, on a literal\n\nreading of the subsection, s 234(1) does not apply when the accused is a person undergoing\n\na sentence of preventive detention as it only refers to offenders who are undergoing a\n\n\"sentence of imprisonment\". A sentence of preventive detention is not a\n\n\"sentence of imprisonment\", even though persons sentenced to preventive\n\ndetention are often, in practice, detained in prison. InYusoff bin Hassan & Ors v\n\nPP[1992] 2 SLR 1032, I drew a distinction between the two sentencing options for the\n\nfollowing reasons: first, s 12(2) of the CPC, the provision which empowers the court to\n\norder a sentence of preventive detention states that such sentences are passed \"in\n\nlieu of any sentence of imprisonment\"; secondly, there are different rules relating\n\nto the nature and termination of custody for sentences of imprisonment and preventive\n\ndetention. Sentences of imprisonment are governed by the Prisons Act and its regulations,\n\nwhile sentences of preventive detention are governed by the Criminal Procedure (Corrective\n\nTraining and Preventive Detention) Rules. There is usually a one-third period of remission\n\nfor sentences of imprisonment, but not for terms of preventive detention. Consequently, a\n\nliteral reading of s 234(1) would mean that the court is not empowered to order that a\n\nsentence of preventive detention should start at the expiration of another such sentence\n\nthat the accused is undergoing.20        Hence, the literal reading\n\nof s 234(1) reveals that the draftsman had overlooked the provision of rules to deal with\n\nthe issue of when a subsequent sentence of preventive detention should commence if the\n\naccused is already serving another sentence of preventive detention. Section 12(2) of the\n\nCPC is also silent on this issue. It states that the court may order a term of preventive\n\ndetention of not more than 20 years in one trial but does not deal with a situation where\n\nthere are two separate trials in which sentences of preventive detention are warranted.\n\nFurthermore, an examination of the rest of the CPC showed that there are no specific\n\nprovisions addressing this issue.21        In these circumstances, it\n\nwas my duty to consider the purpose of s 234(1) in the context of the CPC as a whole to\n\ndetermine if there was more than one possible construction of the section and, if so, to\n\nrepair the defect in drafting. By s 234(1), the court is given an option to order that an\n\noffender effectively serve out the entire length of imprisonment over and above another\n\nsentence that he is serving if such a sentence is warranted in the circumstances of a\n\nsubsequent trial. In my view, the intention of Parliament in passing s 234(1), was to\n\nensure that the courts have the power to ensure that the aggregate sentence that is\n\nimposed on an offender through multiple trials is reflective of the seriousness of the\n\noffences that formed the basis of subsequent trials when an offender is already serving a\n\nsentence. In other words, I took the opinion that Parliament did not intend to tie the\n\nhands of the court, such that it canneverorder consecutive sentences of\n\npreventive detention in whatever circumstances, even if a longer aggregate sentence is\n\nnecessary, to reflect the extent to which an offender is a menace to society and the\n\nseverity of the offences which formed the basis of the subsequent trial. Accordingly, a\n\nconstruction of s 234(1) that fulfils the intention of Parliament is that the section\n\napplies equally to offenders who are serving a sentence of imprisonment or preventive\n\ndetention so that the court has the same options in determining the commencement of\n\nsubsequent sentences in both cases.22        By s 9A(1) of the\n\nInterpretation Act, it was necessary for me to adopt the purposive construction of s\n\n234(1) over the literal interpretation of the subsection, which does not promote the\n\nobjects of the subsection. The purposive construction of s 234(1) is consistent with\n\nlogic, the intention of Parliament and the context of the words in s 234(1). On the other\n\nhand, the literal interpretation of s 234(1) restricts the court’s options in\n\nsentencing and leads to an absurd result. An illustration of the absurdity which may arise\n\nfrom a literal reading of s 234(1) is this: A person, who has a history of committing\n\nsexual offences, has been tried, convicted and sentenced to preventive detention of 15\n\nyears for three offences of outrage of modesty. He has just started serving his sentence\n\nwhen the police subsequently discover that he was responsible for a string of serious\n\nsexual offences, for example rape. He is convicted for the subsequent offences, which of\n\nthemselves warrant the maximum sentence of preventive detention of 20 years. By a literal\n\nreading of s 234(1), the court does not have the power to order that the latter sentence\n\nrun after the expiration of the first sentence and it is effectively limited to ordering\n\nslightly more than an additional five years of preventive detention. Such a sentence does\n\nnot truly reflect the extent to which the offender is a menace to the public, based on the\n\nconvictions in the subsequent trial. The offender effectively obtains a\n\n\"discount\" on the actual period of preventive detention that he would otherwise\n\nhave to serve on the facts of the second trial, on account of the fact that he is already\n\nundergoing preventive detention.23        At this juncture, I turned\n\nto consider the counter arguments which may be raised against the purposive interpretation\n\nof s 234(1). I noted that, although district judge Chionh ruled that she was not empowered\n\nto order that the sentence which she imposed on Kenneth run at the expiration of the\n\nsentence of preventive detention he was undergoing, she did not give reasons to support\n\nher decision. Nevertheless, I found that there were two potential sources of concern in\n\nadopting the purposive interpretation of s 234(1). First, that the courts would be\n\nempowered by a purposive reading of the subsection to impose longer aggregate sentences of\n\npreventive detention in excess of 20 years and that such sentences, which have never been\n\nimposed previously, may be too crushing. Secondly, another concern was that strategic\n\ndecisions as to whether a string of offences should be prosecuted in a joint trial or\n\nseparate trials, which should not affect sentencing, would influence the maximum aggregate\n\nsentence of preventive detention that a court can order. This is an incidental result of\n\nthe purposive interpretation of s 234(1) which empowers the court to order an aggregate\n\nsentence that far exceeds the maximum limit of 20 years that can be imposed in a joint\n\ntrial, if the prosecution of the offences are heard in separate trials.24        I was of the view that\n\nthese concerns should not prevent me from adopting the interpretation of s 234(1) that\n\nfulfills the intention of Parliament due to the supremacy of s 9A(1) of the Interpretation\n\nAct. In any case, the concerns did not detract from the need for the courts to have the\n\npower to order that sentences of preventive detention meted out in separate cases run\n\nconsecutively, so that it may be exercised in cases which warrant it. The concerns\n\nactually relate to the consequences of the potential wrongful exercise of such a power and\n\nnot its existence. However, the potential harm that may occur in the exercise of the power\n\ncannot be a good reason for the total rejection of this power. The solution should be a\n\ncareful application of the power to the facts, such that consecutive sentences of\n\npreventive detention are only imposed in appropriate cases. Undoubtedly, in the exercise\n\nof their powers, the courts would apply caution and balance sentencing objectives to\n\nensure that the aggregate sentence passed is not any more or less than a sentence that is\n\nreflective of the extent to which the offender is a menace to society.25        Insofar as the concerns\n\nstemmed from the notion that the courts should not be empowered to sentence offenders to\n\nan aggregate term of preventive detention in excess of 20 years, they must be rejected as\n\nsuch a notion is without legal premise. Section 12(2) does state that the maximum sentence\n\ninone trialis 20 years. The power to impose an aggregate sentence of more than 20\n\nyears when there are multiple sentences of preventive detention ordered inseparate\n\ntrialsis in no way inconsistent with the CPC.26        In conclusion, it was my\n\nduty to \"repair the omission\" which resulted from the draftsman’s failure\n\nto provide rules for the commencement of subsequent sentences of preventive detention when\n\nan offender is already serving a sentence of preventive detention. I adopted the purposive\n\ninterpretation of s 234 of the CPC and ruled that the section also applies to persons who\n\nare undergoing a sentence of preventive detention. Accordingly, a court that is faced with\n\nsentencing an offender who is already undergoing a sentence of preventive detention has\n\nthe same options as if the offender is undergoing a sentence of imprisonment, i.e. it can\n\norder that the subsequent period of preventive detention commence on the date of the\n\njudgment or at the expiry of the earlier sentence of preventive detention. In exercising\n\nits powers, the court would only order that sentences of preventive detention run\n\nconsecutively if it was necessary to reflect the extent to which he is a threat to the\n\ncommunity.",
        "The appropriate sentence in this case": "27        Kenneth started his life\n\nof crime in 1972 when he was about 19 years old. He had a disturbing history of kidnapping\n\nand molesting young children. In 1980, he was first convicted of and fined for one charge\n\nof outrage of modesty. Subsequently, in 1986, he was convicted of two charges of\n\nkidnapping, with a further charge taken into consideration, one charge of outrage of\n\nmodesty and one charge of criminal intimidation, with another taken into consideration. A\n\ntotal sentence of 12 months’ imprisonment was imposed on him. After his release, he\n\ndid not keep away from his criminal activities for long. In 1993, he was hauled back to\n\ncourt to face eight counts of outraging the modesty of a child under the age of 14,\n\ncontrary to s 354A(2)(B) of the Penal Code. He was convicted on four of the charges and\n\nthe rest of the charges were taken into consideration. At that stage, he had already\n\nqualified for a sentence of preventive detention as he was found to be a menace to society\n\nand the judge imposed a sentence of eight years’ preventive detention on him, in\n\naddition to eight strokes of the cane.28        The period of\n\nincarceration for preventive detention obviously did nothing to deter him from committing\n\nhis most recent string of similar offences which formed the basis of the present charges\n\nagainst him. Barely two months after his release from preventive detention in March 2001,\n\nKenneth struck again by kidnapping and molesting N. In December 2001, he repeated his\n\nabominable pattern of crime by kidnapping and molesting yet another two young and\n\nvulnerable girls, Q and Z just days apart from each other. Kenneth’s record of\n\nkidnapping and outraging the modesty of young and vulnerable victims was the clearest\n\nillustration of his recalcitrant nature.29        The preventive detention\n\nreport and the various medical reports on him also supported the conclusion that Kenneth\n\nwas incorrigible. In the preventive detention report, he was found to have a high risk of\n\nsexual re-offending. In the medical reports, the doctors concluded that he had \"an\n\nabnormal sexual drive directed at pre-adolescent girls\" and he suffered from\n\n\"deviant sexual behaviour\". In the latest report dated 16 May 2002 by a\n\npsychiatrist on Kenneth, he was described as a person who \"never got his act together\n\nas an adult and was a \"basket case\" collecting psychiatric and social\n\ndisabilities….\".30        Kenneth’s repeated\n\nre-offending showed that he was beyond redemption. He was completely unable to exert any\n\nform of self-control over his sexual behaviour. Such a failure would invariably find\n\nexpression in the heinous crimes of kidnapping and molesting young girls. Undoubtedly, he\n\nposed a great threat to society, particularly as his targets were young girls who were\n\nunable to fend for themselves. His crimes had already caused many families and young girls\n\nto suffer a great deal of trauma. As he demonstrated no ability to control himself, it was\n\nnecessary to sentence him to a suitably long period of preventive detention to take him\n\nout of circulation for as long as it was necessary for the protection of society.31        Both district judges Lim\n\nand Chionh decided that the offences that Kenneth had committed and which formed the basis\n\nof the charges before them individually warranted the imposition of the maximum sentence\n\nof 20 years’ preventive detention.32        Kenneth submitted that\n\nthis Court should consider the following factors, ie his age; the hardship that his family\n\nwould suffer due to his incarceration; his church work; his claims of remorse and his\n\npromise that he would not re-offend. After considering Kenneth’s numerous antecedents\n\nand his medical reports, I was unconvinced that he would not re-offend or that he felt\n\ngenuine remorse about his crimes. In any case, in meting out sentences of preventive\n\ndetention, the primary consideration is the need to put away persons who are deemed to be\n\na menace to society for the safety of the community at large:Yusoff bin Hassan & 4\n\nOrs v PP.Consequently, in light of the manifest need to protect the public from him,\n\nthe factors mentioned by Kenneth could not be used to reduce the terms of preventive\n\ndetention that were imposed on him.33        After a review of all the\n\nrelevant facts in relation to MA 211 of 2002 and the reasons given by district judge Lim\n\nin imposing 20 years’ preventive detention on Kenneth, I ruled that the district\n\njudge had ample reasons to support her decision, that he was such a menace to society that\n\nhe should be locked away for 20 years in preventive detention, and I upheld her decision.34        However, I did not agree\n\nwith district judge Chionh’s decision to sentence Kenneth to 20 years’\n\npreventive detention that would run concurrently with his earlier sentence, such that he\n\nwould effectively serve only 20 years’ preventive detention. By the offences that\n\nKenneth pleaded guilty to in the first trial, his conduct already warranted a maximum term\n\nof 20 years’ preventive detention. Over and above those offences, he kidnapped\n\nanother young and vulnerable victim, Z, which proved that he was such a great menace to\n\nthe public that he should be locked away for more than the 20 years in aggregate for the\n\ncommunity’s protection. This was particularly because Kenneth was only 49 years old\n\nat the time of these appeals. An aggregate sentence of only 20 years would mean that he\n\nwould be released when he is 69, an age when he would still be capable of harming more\n\nvictims. Accordingly, I ordered that the sentence imposed on Kenneth for MA 210 of 2002\n\nwould commence only at the expiration of the sentence of 20 years’ preventive\n\ndetention that he was undergoing. However, I reduced the sentence that he must serve for\n\nthe offences in DAC 15227 to ten years since he had only been found guilty of one more\n\noffence of kidnapping. This meant that the aggregate sentence of preventive detention that\n\nKenneth must serve would be 30 years and that he would be taken out of circulation until\n\nhe is 79 years old with a probably reduced libido.",
        "Conclusion": "35        For the above reasons, I\n\ndismissed the appeal in MA 211 of 2002. However, I allowed the appeal in MA 210 of 2002\n\nand reduced the term of preventive detention imposed on Kenneth from 20 years to ten\n\nyears. Furthermore, I ordered that the sentence of ten years’ preventive detention\n\nwould only commence on the expiration of the sentence in MA 211 of 2002, ie the aggregate\n\nperiod of preventive detention would be 30 years. I also ordered that the sentences of\n\nthree and twelve strokes of the cane in MA 210 and MA 211 of 2002 respectively, were to\n\nremain.Sgd:YONG PUNG HOWChief JusticeRepublic of SingaporeCopyright © Government of Singapore."
    }
}