{
    "case_title": "Public Prosecutor v MW",
    "ncitation": "[2002] SGHC 144",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "ANTECEDENTS": "14.        The\n\nAccused has no criminal record.",
        "THE PROSECUTION’S SUBMISSIONS": "15.        The\n\nProsecution highlighted three aggravating factors in this case:(1)         the Accused is the natural father of\n\n  the victim;(2)         he had a warped motive in committing\n\n  the rapes;(3)         the effect of the offences on the\n\n  victim could be seen in the report dated 29 October 2001 by\n\n  Dr                  \n\n  Bernardine Woo of the Child Guidance Clinic which stated:\"(The victim) has been having recurrent thoughts\n\n      about the abuse and has been feeling sad since the abuse. She feels anxious when males are\n\n      physically close to her and has difficulty trusting others. She also suffers from loss of\n\n      self esteem.Intellectual assessment done by our psychologist, Ms\n\n      Joyce Leong, on 23.10.01 revealed an IQ of 55, which suggests that she is currently\n\n      functioning within the Mildly Retarded range of intelligence.(The victim) is sad and has difficulty trusting others\n\n      since the abuse. Her mother is supportive and understanding of her difficulties. She is\n\n      fairly consistent in her account of events and understands the nature of the abuse. She is\n\n      fit to give testimony in court. …\"16.        The\n\nProsecution also referred to the sentences in eight previous cases of rape perpetrated by\n\nfathers against their daughters for my guidance. It was submitted that the offences here\n\nshould attract imprisonment terms of more than the statutory minimum of eight years.",
        "THE MITIGATION": "17.        The\n\nAccused said he has pleaded guilty to the Charges. He regretted his actions and pleaded\n\nfor leniency. He tendered his apology to his daughter and sought her forgiveness. He\n\npromised that he would never repeat such offences.",
        "THE SENTENCES": "18.        In\n\nsentencing the Accused, I made the following remarks:\"Mr Mesdi bin Hussain,1.    You have committed a grave crime\n\n    against your own flesh and blood and have done a great injustice to your family. Sexual\n\n    offences committed against one’s own family members often have repercussions well\n\n    beyond the trial. The victim may feel bad because her father has been sent to prison\n\n    because of her complaint. Other family members may unjustly blame the victim for causing\n\n    the incarceration of their provider. I certainly hope this will not be the case here as\n\n    the wrongdoing here was yours and yours alone. Further, when the father is finally\n\n    released from prison, the daughter may have to meet him within family circles again and\n\n    perhaps re-live the pain of the rapes. Such offences must therefore be punished severely.2.    You said in a statement made to the\n\n    police that you raped your daughter to exact revenge on your wife for the misery she had\n\n    caused you. How could your 13 year old daughter be responsible in any way for any alleged\n\n    misconduct of her mother? The consequences of adult conflict must never be visited upon\n\n    any child. Since the innocent child has only the voice of the law to speak for\n\n    herself/himself, the law must speak clearly and loudly to fathers who sexually abuse their\n\n    children by imposing severe sentences.3.    You have pleaded guilty and spared\n\n    your daughter the agony of having to recount the embarrassing episodes in Court and of\n\n    having to testify against her father. You also have no criminal record. These are\n\n    mitigating factors in your favour.4.    Bearing in mind the sentences\n\n    imposed in the cases listed by the Prosecution in the Bundle of Cases, the effect of the\n\n    rapes on your daughter and the points I have made above, I now sentence you as follows:\n\n    for each of the three Charges on which you have been convicted, 12 years imprisonment and\n\n    12 strokes of the cane. The sentences for the First and Second Charges are to run\n\n    consecutively. The sentence for the Third Charge is to run concurrently with the other\n\n    two. You will therefore receive a maximum of 24 strokes of the cane and 24 years\n\n    imprisonment with effect from the date of your arrest, 5 December 2001.\"Sgd:TAY YONG KWANGJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}