{
    "case_title": "Ng Sylvia v Oon Choon Huat Peter and Another",
    "ncitation": "[2002] SGHC 25",
    "coram": "Lee Seiu Kin JC",
    "sections": {
        "The background facts": "3 The Plaintiff works as a childcare teacher. The first Defendant is a\n\nmarine surveyor. The second Defendant is the elder sister of the first Defendant. She is a\n\nretired nurse.4 The Plaintiff had known the first Defendant since she was 16 years\n\nold. On 24 March 1990, they registered their marriage at the Registry of Marriages.\n\nAccording to the first Defendant, they did not live together for about three years until\n\nafter the customary tea ceremony and wedding dinner on 16 October 1993. He also claimed\n\nthat they did not consummate the marriage until around July 1993. This was disputed by the\n\nPlaintiff who claimed that the marriage was consummated shortly after registration of\n\nmarriage. This concerns the issue whether the Property or a share in it, acquired by the\n\nfirst Defendant after registration of marriage, constituted a matrimonial asset for the\n\npurposes of s 112(10)(b) of the Women’s Charter. The first Defendant had submitted\n\nthat notwithstanding the registration, the marriage had not been consummated at the time\n\nof acquisition of the asset and the customary tea ceremony had not been performed. Nor was\n\nthe marriage celebrated by way of the wedding dinner. He argued that in the eyes of his\n\nfamily, the Plaintiff was not yet his wife and therefore the marriage was not\n\n\"valid\" until these customary practices were carried out, or they had lived\n\ntogether as man and wife, or the marriage was consummated. I held that these matters were\n\nnot relevant for the purposes of s 112 of the Women’s Charter as the term\n\n\"marriage\" there did not refer to the customary marriage but to one that is\n\nsolemnized and registered in accordance with the Charter. However as this part of my\n\ndecision is not appealed against, I need not give my detailed grounds on this issue.5 After the registration the couple did not live together. The first\n\nDefendant continued to reside with his mother and siblings at the family home at 85 Jalan\n\nGelenggang. The Plaintiff continued to live with her parents at an HDB flat at Ang Mo Kio.\n\nIn July 1992 they purchased the Ang Mo Kio flat from the Plaintiff’s parents. However\n\nthey did not move into it immediately and it was tenanted out.6 On 28 January 1993, a Toto ticket in the possession of the first\n\nDefendant won the first prize which amounted to $1,232,659. The cheque for this sum was\n\nmade out in the first Defendant’s name. He then went to open a new savings account\n\njointly with his brother, Oon Choon Khiang, and deposited the cheque in that joint\n\naccount. On 17 April 1993, the Property was purchased for $750,000. Payment was made in\n\ncash from the money in the joint account. The property was registered in the name of the\n\nfirst Defendant. It was quickly tenanted out.7 The customary tea ceremony and wedding dinner were held on 16 October\n\n1993. The couple moved into the Ang Mo Kio flat that day. Their three children were born\n\non 5 May 1994, 25 September 1996 and 10 May 2000. Unfortunately the marriage went downhill\n\nafter the Plaintiff discovered in December 1999 that the first Defendant was having an\n\naffair with a night club hostess. This was aggravated by the first Defendant when he\n\nbrought her to their matrimonial home in February 2000 - by that time they had swapped the\n\nAng Mo Kio flat for another HDB flat in Tampines. Attempts at reconciliation were made but\n\nto no avail. On 3 July 2000, the Plaintiff told the first Defendant that she wanted a\n\ndivorce. The first Defendant moved out of the Tampines flat on 12 July. On 13 July the\n\nfirst Defendant entered into a sale and purchase agreement with the second Defendant in\n\nwhich he sold his interest in the Property to her. The transaction was completed two days\n\nlater. The Defendants had alleged that the first Defendant had borrowed various sums of\n\nmoney from the second Defendant over the years and this had accumulated to around\n\n$270,000. These loans were to repay his substantial gambling debts. They claimed that the\n\nsale and purchase agreement was entered into in repayment of this sum. However I was not\n\nsatisfied with the evidence given by the Defendants in respect of these loans and made the\n\nfinding that this was a sham transaction and that the second Defendant held the Property\n\non trust for the first Defendant in respect of his share of it. Again, this is not\n\nappealed against and I need not give my detailed grounds on this issue.",
        "The sole issue": "8 The sole issue in this appeal is whether the Property is a\n\nmatrimonial asset in its entirety or whether only one quarter of it is matrimonial asset.\n\nI now set out the evidence of the parties.9 The Plaintiff said that the first Defendant had purchased the winning\n\nToto ticket in January 1993 out of money belonging to them jointly as husband and wife.\n\nDuring that period the first Defendant had been collecting and using the rental proceeds\n\nfrom the Ang Mo Kio flat. After the win the first Defendant had used part of the prize\n\nmoney to purchase the Property. This was registered in his sole name. At the time the\n\nPlaintiff had asked for it to be registered in their joint names but he had told her that\n\nthis was not necessary, assuring her that she had an equal share in it. The Plaintiff also\n\nclaimed that she had made contributions, financial and otherwise, towards the Property.\n\nShe had paid for the agent’s commission to procure a tenant. She had paid for some of\n\nthe furnishing expenses and made the rental deposit refund upon expiry of the tenancy. She\n\nhad also attended to the renovation of the Property, and the washing and cleaning of the\n\napartment.10 This is the evidence of the Defendants. The first Defendant is the\n\nyoungest in a family of six brothers and two sisters. Prior to the tea ceremony in October\n\n1993 he lived with his mother, sister and some of his brothers at 85 Jalan Gelenggang. The\n\nfamily operated an electrical and plumbing contracting business in which some of the\n\nbrothers (but not the first Defendant) were partners. The family members regularly\n\npurchased tickets for the Singapore Sweep, 4-D draws and Toto. They would pool their money\n\nprior to each draw and purchase tickets as a syndicate. One of them would be deputed to\n\npurchase the tickets and those interested would notify that person of his or her intention\n\nto participate in the syndicate. The purchaser would collect their contributions and go to\n\nbuy the tickets. Sometimes the contribution would be collected after the tickets were\n\npurchased. The understanding was that any prize money would be shared equally among the\n\nfamily members. It was a loose arrangement between close knit family members based on\n\ntrust. This practice was well established long before the first Defendant married the\n\nPlaintiff.11 According to the Defendants, sometime in January 1993 the first and\n\nsecond Defendants and their brothers Woon Choon Ngee and Oon Choon Khiang agreed to form a\n\nsyndicate for the next Toto draw. The first Defendant proceeded to purchase $60 worth of\n\ntickets, one of which contained the winning combination for the first prize in the ensuing\n\ndraw. The jubilant delegation that went to collect the cheque comprised the first\n\nDefendant, the Plaintiff, the second Defendant and Oon Choon Khiang. The cheque was made\n\nout in the first Defendant’s name for convenience. They then went to the Bedok branch\n\nof OCBC Bank and opened a savings account in the joint names of the first Plaintiff and\n\nOon Choon Khiang. The cheque was deposited into that account. The Defendants say that they\n\nhad initially wanted to deposit the cheque in an account in all four of their names.\n\nHowever on the suggestion of the second Defendant, they deposited it in the joint names of\n\nOon Choon Khiang and the first Defendant.12 Thereafter they decided to invest part of the proceeds in property\n\nas the property market was very active at the time. They asked their brother Oon Choon\n\nKiat to look for a suitable property. With his help they eventually settled on the\n\nProperty in April 1993. At first they intended to register the Property in all four of\n\ntheir names. But Oon Choon Kiat said that it would be better to register it under just one\n\nname. They agreed. Oon Choon Khiang said that he would like to maintain his eligibility to\n\nbuy an HDB flat and therefore he did not want to register the Property in his name. As for\n\nthe second Defendant, she said that she was contemplating marriage and was afraid that her\n\nfuture husband might think that the Property belonged to her solely; she therefore\n\ndeclined to have it registered in her name. The fourth co-owner, Woon Choon Ngee similarly\n\ndeclined on the ground that he had intention to upgrade his HDB flat and wanted to remain\n\neligible for the subsidy. This left the first Defendant as the most convenient person for\n\nthe task. The understanding between them was that they would each have an equal\n\none-quarter share in the Property. The purchase price was $750,000 and this was paid in\n\ncash from the funds in the joint OCBC account. Stamp fees and legal fees of about $30,000\n\nwas also paid from the joint account.13 The first Defendant denied that he had told the Plaintiff at the\n\ntime of the purchase that she had an equal share in the Property as alleged by her. He\n\nsaid that the Plaintiff had never claimed any share in the Property while they were living\n\ntogether as husband and wife. The very first time that she had claimed such share was\n\nafter she had commenced the divorce proceedings. The first Defendant also denied that the\n\nPlaintiff had contributed financially towards the Property. He pointed out that she had\n\nstated that she was jobless and had no income from 1996 to 1999, during which period the\n\nfirst Defendant was the sole provider for the family. As for improvements to the Property,\n\nthe first Defendant said that around July 1993, after completion of the purchase, he and\n\nhis brothers Oon Choon Kiat and Oon Choon Khiang re-painted it before renting it out.\n\nAbout 2 years later they did further work on it. These were electrical and plumbing works,\n\ncarried out by Oon Choon Kiat and Oon Choon Khiang. They also installed air conditioners\n\nand carried out re-painting. The first Defendant maintained that all payments or expenses\n\nmade in respect of the Property were shared equally by the four co-owners. Similarly the\n\nrental proceeds were shared equally between themselves. However given the close family\n\nrelationship, they did not keep accounts of such receipts.",
        "Conclusion": "14 From the evidence I concluded that the first Defendant was a bit of\n\na rogue. He was the youngest and his father had died before he was born. As such, he was\n\ntreated like a prince by his brothers and sisters and in the process became extremely\n\nspoilt. He left the task of fending for the three children, whom he sired, entirely to the\n\nPlaintiff while he squandered away a small fortune in gambling and the proverbial wine,\n\nwomen and song. He was blessed with doting siblings – especially the second Defendant\n\nwho continued to indulge him - and good fortune in the form of the Toto win. Unfortunately\n\nfor all concerned he did not make full use of his endowments, and chose the soft path much\n\nto the chagrin of the Plaintiff and the misfortune of his children. I had concluded that\n\ninsofar as his evidence relating to the sale and purchase of the Property to the second\n\nDefendant was concerned, there was no truth in it and the transaction was a sham to avoid\n\ngiving the Plaintiff a share of it.15 However it was quite another matter in respect of the question\n\nwhether he had only a one-quarter share in the Property or owned it wholly. In that aspect\n\nof the evidence I could clearly tell that his evidence was truthful. More importantly, his\n\nthree brothers who gave evidence, Woon Choon Ngee, Oon Choon Khiang and Oon Choon Kiat,\n\nimpressed me with their demeanour in the witness box. Their evidence substantially\n\ncorroborated that of the first Defendant. There was overall consistency in their versions\n\nand although there were minor discrepancies in some details, I attributed them to the fact\n\nthat the events had taken place more than eight years ago. The Defendants’ version\n\nwas also supported by extrinsic facts. First is the fact that the cheque was deposited in\n\na joint account in the names of the first Defendant and Oon Choon Khiang. If the ticket\n\nwere owned by the first Defendant solely, then it would not be likely that he would put it\n\nin a joint account with his brother instead of his wife, the Plaintiff, who was also\n\npresent at the time. When asked why she did not question this, the Plaintiff merely said\n\nas follows:\"… I wanted to hand over my NRIC, but 1stDefendant refused to put my name in account. He told me that it was the same, the money\n\n  did belong to me.\"When asked why Oon Choon Khiang’s name was in the account if the\n\nmoney belonged to the first Defendant and her, she simply said that she did not know.16 Second is the fact that only three other siblings claimed a share of\n\nthe prize. The syndicate that was formed for each draw varied on each occasion. The\n\nevidence was that the eldest brother did not participate but the syndicate sometimes\n\ncomprised all seven of the remaining siblings. If the first Defendant had wanted to dilute\n\nhis share, he could have asserted that more people were part of the syndicate.17 Finally I found the Plaintiff’s evidence in this respect to be\n\nrather hesitant and her version was certainly not consistent with the extrinsic facts. In\n\nthe circumstances I believed the Defendants’ evidence in this respect and disbelieved\n\nhers and found that the first Defendant had only a one-quarter share of the Property.Sgd:LEE SEIU KINJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}