{
    "case_title": "G Ravichander v Public Prosecutor",
    "ncitation": "[2002] SGHC 167",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The Facts": "G Ravichander returned to\n\nhis flat at Block 55 Lorong 5 Toa Payoh late in the evening of 1 April 2001. According to\n\nhis girlfriend, one Mahaletchimy d/o Pitchay Jaganathan, who lived with him, she refused\n\nto open the door to let him into his own home as she felt afraid that he would pick a\n\nfight with her. Evidently irritated at this, Ravichander began to scold her and shout at\n\nher.2        Ravichander broke the\n\nwindow in an attempt to gain entry into his own house. He placed the broken glass shards\n\non the parapet of the fifth storey corridor. These pieces of glass fell five storeys onto\n\na car parked below, damaging its windscreen.3        Police officers summoned to\n\nthe scene by Mahaletchimy arrived at approximately 11:35 p.m. that night. At first only\n\none officer attended to the dispute, but as he assessed the subject to be aggressive, he\n\ncalled for back-up. They found Ravichander in the corridor outside his flat scolding and\n\nshouting at Mahaletchimy. Ravichander’s left hand was bleeding, apparently sustained\n\nwhilst breaking the window. According to SSgt Loh Mun Chun, Mahaletchimy was inside the\n\nunit crying. She appeared to be frightened. SSgt Loh and SSgt Mohd Hirwan also testified\n\nthat they had seen Ravichander pointing at Mahaletchimy and shouting \"I will murder\n\nyou\" in a loud and aggressive manner. He also said that even if he were to be\n\narrested and convicted, he would still murder Mahaletchimy after his release from prison.\n\nWhen Ravichander ordered his girlfriend to strip so that she would not take any of his\n\nthings from his flat, she started to lift up her blouse but were stopped by the police\n\nofficers.4        The three police officers\n\ncould not persuade Mahaletchimy to open the grill gate to let them in until they had taken\n\nRavichander away into custody.",
        "The Charges": "5        Two charges were levelled\n\nagainst Ravichander. The first, DAC No. 54152/2001, read as follows:You, G Ravichander, male/35 years, NRIC No. S1761784B are charged that\n\n  you, on the 1stday of April 2001, at or about 11.32 p.m., at the corridor\n\n  outside unit #05-158, Blk 55 Lor 5 Toa Payoh, Singapore, did commit Criminal Intimidation\n\n  by threatening one Mahaletchimy d/o Pitchay Jaganathan with death, by stating the words\n\n  \"I will murder you\", intending thereby to cause alarm to the said Mahaletchimy\n\n  d/o Pitchay Jaganathan and you have thereby committed an offence punishable under section\n\n  506 of the Penal Code, Chapter 224.6        The second charge, MAC No.\n\n11143/2001, read as follows:You, G Ravichander, male/35 years, NRIC No. S1761784B are charged that\n\n  you on the 1stday of April 2001, at or about 11.32 p.m., at the 5thfloor corridor of Blk 55 Lor 5 Toa Payoh, Singapore, did cause an act so rashly as to\n\n  endanger human life and the personal safety of others when you placed broken glass\n\n  fragments onto the parapet of the said corridor, causing them to fall to the ground\n\n  thereby causing damage to a motorcar bearing registration number SCG 9408B and you have\n\n  thereby committed an offence punishable under section 336 of the Penal Code, Chapter 224.7        Ravichander pleaded guilty\n\nto MAC 11143/2001, but claimed trial to DAC No. 54152/2001 in the District Court. He was\n\nfound guilty of the second charge and was sentenced in respect of both offences to a term\n\nof seven years’ corrective training. For MAC 11143/2001, he was also ordered to pay\n\n$687.20 as compensation, in default of which he would have to serve three days’\n\nimprisonment.8        Before this Court,\n\nRavichander appealed against the conviction under the s 506 charge of aggravated criminal\n\nintimidation, as well as against the sentence of corrective training. I dismissed both\n\nappeals but in view of the specific circumstances of this case I decided to enhance the\n\nterm of corrective training to the maximum of 14 years. I now give my reasons for my\n\ndecision.",
        "Appeal against Conviction": "9        The main plank of the\n\nappeal against conviction rested on Mahaletchimy’s denial, made in court, that\n\nRavichander had ever threatened to kill her, as well as Ravichander’s own testimony\n\nthat he had never said those words that constituted the charge against him. In effect, the\n\nsubmission was that no threat had been uttered and therefore the offence of criminal\n\nintimidation as defined in s 503 of the Penal Code could not be made out. Counsel argued\n\nthat the district judge was wrong in disregarding the totality of the evidence proffered\n\nby the couple that totally exonerated Ravichander of the alleged offence. He also\n\nsubmitted that the judge had placed too much weight on the testimonies of the police\n\nofficers even though they were directly contradicted by the victim and the accused.10        I had no difficulty\n\nwhatsoever in dismissing that line of argument. In my opinion, the district judge was\n\ncorrect in according little weight to both Ravichander’s as well as\n\nMahaletchimy’s evidence. On the other hand,the police officers who testified\n\nfor the prosecution had absolutely no reason to lie under oath. There was also nothing\n\nthat could impugn the consistency in the evidence that they presented in Court and no\n\nsuggestion at all of any collusion between them. In fact, SSgt Loh, SSgt Mohd Hirwan as\n\nwell as Cpl Hirman were called to the scene as a result of a call by Mahaletchimy to the\n\npolice. Their testimonies was therefore worthy of the weight ascribed to them by the\n\ndistrict judge.11        Ravichander had said in\n\ncourt that he did not threaten the victim. He had accidentally cracked the glass window\n\nwhile trying to open it to speak to Mahaletchimy who was hiding inside the flat. He had\n\nspoken to the police officers but they had \"hammered\" him. Unfortunately,\n\nRavichander had failed to raise even this simple defence in his cautioned statements to\n\nthe police when faced with the two charges against him. Instead he chose to say nothing.\n\nFurthermore, Ravichander could not shed any light as to why the police officers at the\n\nscene that night would want to fabricate evidence against him.12        As for Mahaletchimy, the\n\ndistrict judge had rightly noted that her sister was Ravichander’s bailor.\n\nMahaletchimy had spoken to Ravichander prior to the trial, and being his girlfriend and an\n\ninterested witness, her evidence was to be treated with caution. In my view, just because\n\na victim turns hostile on the stand and proffers evidence in favour of the accused person\n\ncannot of itself prove the accused person’s innocence of the charge facing him. In\n\nany case it is not unusual for victims or other prosecution witnesses to turn hostile in\n\ncourt. They may do so for any of a number of reasons. For example, they may fear the\n\nrepercussions, real or imagined, of testifying against the accused, or they may have\n\nchanged their minds about pursuing justice through the criminal courts. Another\n\npossibility could of course be that the accused is really innocent. The bottom line is\n\nthat the victim’s testimony is but a part of the totality of evidence that the trial\n\ncourt must weigh in order to decide if the prosecution has proven its case beyond\n\nreasonable doubt.13        Defence counsel’s\n\nnext point was to the effect that even if the threatening words \"I will murder\n\nyou\" were indeed uttered by Ravichander, the victim could not have apprehended those\n\nwords as a threat. According to Counsel, Mahaletchimy could only speak Tamil while the\n\noffending phrase was said in English. Ravichander was also drunk at the time and anything\n\nhe might have said was said in the heat of a domestic spat that was aggravated by the\n\ninterference of the police officers.14        I could not accept such an\n\nargument. Apart from that bare assertion, made only at the appellate stage, there was no\n\nevidence whatsoever that suggested that Mahaletchimy could not understand what Ravichander\n\nwas saying to her. The angry words were directed straight at her and I found it hard to\n\nbelieve that Ravichander would have chosen to speak in a language that she could not\n\nunderstand. The fact that the three police officers, namely SSgt Loh, SSgt Hirwan and Cpl\n\nHirman, could communicate with Mahaletchimy did seem to suggest that her linguistic skills\n\nwere not as limited as was suggested by Counsel. In any event, it was clear from\n\nRavichander’s aggressive behaviour that he had intended to alarm his victim. The\n\nshouting, the vulgarities, and the attempt to break the window, coupled with the threat to\n\nmurder the victim, made audaciously in front of three law enforcers, shook the victim. In\n\nfact, Mahaletchimy was so afraid that she even called the police to intervene.15        In the result, I dismissed\n\nthe appeal against conviction.",
        "Appeal against Sentence": "16        Having failed to convince\n\nthis Court that the conviction under the s 506 charge was not sound, Counsel next embarked\n\non an attempt to persuade me that the term of seven years’ corrective training was,\n\nin his words, a \"crushing sentence\". Whilst Ravichander may have a track record\n\nof numerous previous convictions, he was not a recalcitrant as this was only his first\n\nconviction for aggravated criminal intimidation.17        I disagreed. In fact, I\n\nfelt that a seven year sentence of corrective training would be inadequate for a character\n\nlike Ravichander.18        The principal aim of\n\ncorrective training is, as the name suggests, to reform the prisoner who is sentenced to\n\nundergo that regime. Under s 12(1) of the Criminal Procedure Code, the Court must be\n\n\"satisfied that it is expedient with a view to his reformation and the prevention of\n\ncrime that the offender should receive training of a corrective character for a\n\nsubstantial period of time\". InKua Hoon Chua v PP[1995] 2 SLR 386at 389, I\n\nsaid:... the principal aim of corrective training is to turn an offender\n\n  away from the easy allure of crime by putting him through a regime of discipline and by\n\n  providing him with certain work skills.19        InPP v Wong Wing Hung[1999] 4 SLR 329at 333, I also made the following remark:… corrective training is only appropriate and suitable where the\n\n    offender shows that he is capable of reform and can be corrected, so to speak, and\n\n    prevented from committing further crime.20        That reform is the\n\nmotivation behind corrective training is underscored by rules 3 to 5 of the Criminal\n\nProcedure (Corrective Training and Preventive Detention) Rules, which I lay out in full:Training in Changi Prison.3. The purposes of training and treatment of\n\n  convicted prisoners while serving sentence of corrective training shall be to establish in\n\n  them the will to lead a good and useful life on discharge, and to fit them to do so and\n\n  shall include —(a) the provision of work which will so far as practicable help them to\n\n    earn their living after release, with technical training in skilled trades for suitable\n\n    prisoners;(b) special attention to education;(c) the exercise of personal influence on the character and training of\n\n    individuals by members of the prison staff; and(d) the provision of every opportunity for the development of a sense\n\n    of personal responsibility.Aftercare.4. From the reception of a prisoner in the prison in which he is to\n\n  serve his sentence, consideration shall be given to the provision to be made for his\n\n  welfare and supervision after release.Release on licence.5. A prisoner sentenced to corrective training shall become eligible\n\n  for release on licence after he has served two-thirds of his sentence of corrective\n\n  training.21        Ravichander is no stranger\n\nto the criminal justice system. In April 1984, he was convicted of theft and jailed for a\n\nmonth as he could not pay the $500 fine. In December that very same year, he was again\n\ncharged and convicted of theft, and fined $2000. In 1987, he was fined $1000 for mischief.\n\nA year later, he served an eight-week default jail sentence for possession of drugs. On 12\n\nSeptermber 1989, Ravichander was tried and convicted for rioting with a deadly weapon and\n\nsentenced to six months’ imprisonment. His victim died. This only got worse when he\n\nwas released as he was charged for culpable homicide not amounting to murder and sentenced\n\nto seven-years’ imprisonment. His criminal record was peppered with a whole string of\n\ndrug consumption offences in 1993, 1995 and 1997 for which he received sentences ranging\n\nfrom two months’ imprisonment plus fine, to 3 years’ imprisonment. In 1998,\n\nRavichander was convicted of disorderly behaviour and fined $500. He was also charged for\n\nusing indecent, threatening, abusive or insulting words and behaviour against a public\n\nservant and fined $1000. In September 1998 and June 2001, he was convicted of disorderly\n\nbehaviour and fined $1500 and sentenced to two weeks’ imprisonment respectively.22        With such an illustrious\n\ncriminal career behind him, one might be forgiven if one had mistaken Ravichander as a\n\npotential candidate for preventive detention. However, the district judge, having called\n\nfor a report from the Prison’s Department, formed the view that he was suitable for\n\ncorrective training instead. I saw no reason to disturb this finding. The question I asked\n\nmyself was whether the seven-year term was one that was manifestly excessive.23        It must be reiterated that\n\nthe sentencing frameworks for corrective training and normal imprisonment are different.\n\nThis is because the aims of each type of punishment as well as the actual conditions under\n\nwhich they are carried out are not the same. As such, the factors to be considered in\n\ndetermining the length of corrective training differ from those relevant for determining\n\nsentences of imprisonment.24        When determining what a\n\nsuitable sentence is for imprisonment, the Court is guided, amongst other things, by the\n\ngravity of the offence, the antecedents of the prisoner, and any mitigating or aggravating\n\ncircumstances that may exist. Policy considerations may also play a role.25        On the other hand, when\n\ndetermining what a suitable term is for corrective training, the Court should keep in mind\n\nthat this form of punishment, though in substance very similar to imprisonment: seeR v\n\nMccarthy[1955] 2 All ER 927, should not be treated as a lesser form of preventive\n\ndetention. Those undergoing corrective training must first be capable of reform, while\n\nthose sent in for preventive detention are hardened criminals. Sending hardened criminals\n\nthrough the corrective training regime would not only dilute the programme’s aims but\n\nalso endanger the reformative path of more promising prisoners.26        More importantly, when\n\nsentencing a person to corrective training, normal sentencing principles such as the\n\ngravity of the offence, tariffs, mitigating and aggravating factors, while still relevant,\n\ndo not take centre-stage. Rather, the critical factor to be considered is the amount of\n\ntime that the Court feels is required to enable real reform to be attempted. Lord Goddard\n\nCJ’s comments in the case ofR v Barrett[1949] 2 All ER 689 are instructive:Since a person of 21 years or over who is in need of training …\n\n  can no longer be sent to Borstal, it is a good thing, no doubt, to send him for corrective\n\n  training. If his record shows that his tendency is to lead a criminal life, it is as well\n\n  to make the sentence of corrective training of substantial length and to bear in mind that\n\n  the usual remission will be granted if the prisoner behaves himself. In such cases, it is\n\n  of little use giving a sentence of a length which will not enable real reform to be\n\n  attempted.27        Provided that the prisoner\n\nis capable of reform, a longer period of corrective training might be imposed if his\n\nantecedents reveal a more disturbing downward trend. On the other hand, if a prisoner only\n\nhas a few previous infractions which are not very serious, and which do not reveal a\n\ndangerous frequency of recurrence, then a shorter period may be imposed since it might be\n\nthought that this would suffice to reform him.28        In light of the\n\naforementioned considerations, and given the nature of Ravichander’s antecedents, I\n\nwas of the firm opinion that the seven-year term of corrective training was manifestly\n\ninadequate to enable real reform to be attempted. As such, I substituted for it the\n\nmaximum term of 14 years corrective training.",
        "Appeal against conviction and sentence dismissed.": "Sentence enhanced to 14 years’ corrective training.Sgd:YONG PUNG HOWChief JusticeCopyright © Government of Singapore."
    }
}