{
    "case_title": "Han Min v First Commercial Bank and Others (First Commercial Bank, Third Party)",
    "ncitation": "[2002] SGHC 108",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The plaintiff’s case": "10. The plaintiff is a Chinese national and resident. He was born in\n\n1968, so he was about 32 years old when the events occurred. He was educated in the\n\nChinese medium. After completing school he obtained a diploma in Enterprise Management\n\nfrom Shenzhen University in 1987. He was taught basic English in school and university,\n\nbut he had largely forgotten it because he did not use it. He had invested well in the\n\nstock market in China and accumulated some wealth.11. He visited Singapore in August 1999 and was impressed with what he\n\nsaw, and intended to settle himself and his family here. In July 2000 he applied for\n\npermanent residence for himself and his family. He engaged Dr Choong Chow Siong\n\n(\"Choong\") of Choong Management Consultants Pte Ltd to advise and assist in the\n\napplication. He was informed that he could participate in an investment scheme with the\n\nEconomic Development Board under which he would have to invest $1.5m within three months\n\nof obtaining in-principle approval of his application. To demonstrate the seriousness of\n\nhis intention, the plaintiff stated in his application that he would make the investment\n\nwithin half a month of the in-principle approval. He was also considering buying a family\n\nhome and had viewed some apartments with a housing agent.12. When he was preparing to remit his funds to Singapore, a business\n\nassociate in China, Mdm Long Qiong Zhen recommended that he remitted them to the First\n\nCommercial Bank. Mdm Long was also a business associate of Hu Hua and recommended the bank\n\nbecause of Hu Hua’s close connections with it.13. The plaintiff made the first two remittances to the bank before\n\ncompleting the formalities for opening an account. He followed that up by coming to\n\nSingapore on 22 August. Hu Hua whom he had met in China through Mdm Long received him with\n\nwarm hospitality. He hosted a dinner for him, put him up in a suite at Raffles Town Club\n\nand arranged for a secretary and a car to take him to the bank.14. When he went to the bank the next morning, he was received and\n\nattended to by Cheng Jung-Sen (\"Cheng\") and Wu Tzyy-Arng (\"Wu\"), both\n\nAssistant Vice-Presidents and Deputy General Managers of the bank. He signed some\n\ndocuments which Cheng explained to him and left. In the afternoon he returned to the bank\n\nafter he was informed by Hu Hua that he needed to sign further documents. Cheng suggested\n\nthat he put his money in fixed deposit. When he expressed concern over his access to the\n\nfunds, Cheng assured him that he would still have access to the funds if they were placed\n\nin renewable monthly deposits. He accepted the advice and signed a fixed deposit\n\nagreement.15. The next morning Hu Hua told him to go to the bank again and sign\n\nsome more documents. When he arrived at the bank Cheng produced another document for him\n\nto sign which Cheng explained would make it possible for future remittances to be placed\n\nin fixed deposits without his attendance at the bank. He signed the document and left the\n\nbank without being given a copy of it. At that time the blank spaces in the document were\n\nnot filled except for his signature and his Singapore address. (This document is the first\n\nmemorandum of 24 August).16. On 25 September the plaintiff made another visit to the bank. His\n\nintention was to convert his Hong Kong currency deposits to Singapore currency, and to\n\ntransfer them to the United Overseas Bank (\"UOB\") where he also had an account.\n\nCheng attended to him and told him that the bank can convert the deposits for him at an\n\nattractive exchange rate. After verifying the rates he took up the suggestion and\n\ninstructed the deposits be converted, thereafter $4m was to be retained in the bank and\n\nthe balance $110,311.22 transferred to his account at UOB. He confirmed his instructions\n\nby signing on the deposit slips for the four deposits. He also signed another document\n\nwhich Cheng said was required to facilitate the conversion. (This document is the second\n\nmemorandum of 25 September). No copies of these documents were given to him.17. He returned to China on 30 September. Just before he left, he asked\n\nhis friend Kenny Cai Wen Xing (\"Cai\") to check with the bank on the conversion\n\non his behalf. On 6 October Cai telephoned and informed him that he had been to the bank\n\nand obtained a document which appeared to be a pledge.18. On hearing this, he decided to come to Singapore to investigate. On\n\n9 October, he went to the bank with Choong and they saw Cheng. He informed Cheng that he\n\nwanted to withdraw his deposits but was told that he could not do that because they had\n\nbeen pledged to secure loans given to Hu Hua. Cheng gave him two copies of the document he\n\nsigned on 24 August, with some of the blanks filled up.19. Later that day he went to Cai’s house, which was also his\n\nSingapore address for his account with the bank. Cai gave him some documents the bank had\n\nsent there, including the deposit slips he signed on 25 September, each bearing a red\n\nstamp that was not there before. Cai also handed to him the document he collected from the\n\nbank on 6 October. This was a copy of the document he signed on 25 September (the second\n\nmemorandum).20. On the following day he consulted Choong on the documents and was\n\ntold that the stamp on the deposit slips indicated that they were pledged. That afternoon\n\nthey went to the bank again. They met with Cheng and Wu and asked to see the second\n\nmemorandum. After waiting for about 45 minutes, they were given a copy of the second\n\nmemorandum with the spaces previously left blank now filled in. He asked to see the\n\ndocument but it was not produced. Instead the copy was certified as a true copy and handed\n\nto him. When they insisted on inspecting the original, Wu told them it was not possible\n\nbecause the document was being examined by officers of the Monetary Authority of Singapore\n\nat that time – a reason subsequently acknowledged to be untrue.21. He was unhappy over the lien, and when the bank uplifted his\n\ndeposits because KYGC failed to repay its loans, he commenced these proceedings.",
        "The bank’s case": "22. The bank’s response to the plaintiff’s complaints was\n\nquite remarkable, particularly for an establishment such as a bank. When the\n\nplaintiff’s solicitors at that time Joo Toon & Co, wrote to the bank and stated\n\nthat the memorandum of 24 August had relevant details left blank when it was signed, the\n\nbank’s solicitors Chee & Teo replied on 24 October to deny that in clear terms\n\n–Our clients’ banking practice do not allow customers to sign\n\n  blank documents.Your client’s allegation of signing on a ‘blank\n\n  document’ is untrue. The Memorandum of Lien containedimportant details such as\n\n  Name of the borrower and date which were insertedbefore your client executed the\n\n  same.(Emphasis added)23. The bank retracted from this position later. Wu explained that the\n\nposition was taken because the bank misunderstood a blank document to be a blank piece of\n\npaper when it instructed Chee & Teo on the matter. This explanation did not accord\n\nwith the fact that the plaintiff was not complaining of signing on blank sheets, and the\n\nreply referred specifically to a memorandum of lien.24. After the action was commenced the bank referred to the execution\n\nof the two memoranda in its defence, then it amended it substantially. In the amended\n\ndefence it reversed itself on the events leading to and following the execution of the two\n\nmemoranda.25. In the defence filed on 6 December 2000, the bank pleaded in\n\nconnection with the events of 24 August that (i) the memorandum was signed by the\n\nplaintiff \"in escrow\" with the particulars to be filled in later, (ii) Cheng and\n\nWudid not explainthe contents, meaning and effectof the document to the\n\nplaintiff because he did not request for it and (iii) it was \"not the bank’s\n\nusual practice to give customers copies of the forms which they had signed unless\n\nspecifically requested for by the customers\", andno copy was givento the\n\nplaintiff because he did not request for it. In the amended defence filed on 21 February\n\n2001, the bank pleaded that (i) the memorandum was signed in blank, (ii) Wu produced the\n\nmemorandum andexplained its nature, contents and effects and (iii) the plaintiff\n\nwasgiven a copyof the document because he had asked for it.26. In relation to the events of 25 September and the second memorandum\n\nthe bank pleaded in its defence thatno copy of the memorandum was givento the\n\nplaintiff because he had not requested for it. In the amended defence, however, the\n\nposition taken was thata copy of the memorandum was givento the plaintiff upon\n\nhis request, and that \"Cheng/Wu\" explained it to the plaintiff before he signed\n\nit.",
        "The issues": "27. Many issues were raised in the pleadings and the submissions, in my\n\nview too many. Some were not developed or followed up in the closing submissions and\n\nothers were dealt with at length which were not really germane to the basic dispute or its\n\ndetermination.28. Keeping the focus on the dispute, I see the issues to be –(i) whether the plaintiff read and understood the memoranda on his own,(ii) whether the memoranda were properly explained to him when he\n\n  signed them,(iii) whether copies of the memoranda were given to him when he signed\n\n  them,(iv) whether he had agreed to pledge his deposits to secure KYGC’s\n\n  facilities, and(v) whether the bank had reason to obtain the pledges without his\n\n  knowledge.",
        "Whether the plaintiff read and understood the memoranda on his own": "29. The plaintiff had the memoranda before him when he signed them. If\n\nhe could read them on his own, he would have known what he signed without explanation from\n\nanyone.30. The plaintiff said that he could not read them with his limited\n\nknowledge of English, but counsel for the bank contended that with eight years’\n\ninstruction on the language in school and university, the plaintiff would be able to read\n\nthe memoranda. The memoranda were not written in simple English but in typical legal\n\nmanner which a person conversant in English with no legal training may find difficult to\n\nunderstand.31. There was really nothing to suggest that the plaintiff was more\n\nconversant in English than he claimed. He dealt with Cheng and Wu in Mandarin, and wrote\n\nto the bank in Chinese, and there was no evidence that he had conversed or corresponded\n\nwith anyone in English. In any event, there was little incentive for the plaintiff to try\n\nand read and understand the memoranda on his own when the bank officers had explained them\n\nto him. (The dispute is not whether explanations were given, but whether proper\n\nexplanations were given).",
        "Whether the memoranda were properly explained to the plaintiff": "The first memorandum32. The bank stated in its defence that it was not explained to the\n\nplaintiff, then it asserted in the amended defence that \"Cheng/Wu\" had explained\n\nit. The bank’s evidence created further confusion because Wu said at one stage that\n\nhe explained the nature of the document, then he said he did not explain it. Cheng on his\n\npart deposed that he explained the nature of the document to the plaintiff.33. The plaintiff’s complaint was that he did not know that he was\n\nsigning a pledge. If Cheng and Wu explained the nature of the memorandum to the plaintiff,\n\nwhy did the bank state in its defence that there was no explanation? Wu could only say\n\nthat there was miscommunication of the instructions because they did not explain the\n\nentire lien, only the natureof it. This did not accord with the defence that\n\nneither he nor Cheng explained thecontents, meaning and effectof the document, if\n\nthey both had explained itsnature. If the plaintiff was told of the nature of the\n\nmemorandum, he would have known that it was a pledge, and that should have been pleaded.",
        "The second memorandum": "37. The plaintiff’s case is that he did not have a copy of this\n\nmemorandum until Cai obtained a copy of it from the bank on 6 October.38. In its defence the bank defence agreed that he was not given a\n\ncopy, but turned around in its amended defence and asserted that a copy of the lien was\n\ngiven to him.39. In his affidavit of evidence-in-chief Cai deposed that the\n\nplaintiff had asked him on 30 September to go to the bank to check on the conversion of\n\nthe plaintiff’s deposits. He did not go to the bank till 6 October. When he went to\n\nthe bank Cheng referred him to Ms Tan Bee Kuan (\"Ms Tan\"). Ms Tan brought out a\n\nfile and showed him a deposit slip bearing the notation $4m and the interest rate.40. He noticed another document in the file, a blank document bearing\n\nthe plaintiff’s signature, which Ms Tan said was a guarantee. He asked for, and was\n\ngiven a copy of it. (The document exhibited by Cai in his affidavit of evidence-in-chief\n\nis a blank Memorandum of Lien on Fixed Deposits with the blanks empty except for the\n\nplaintiff’s signature and Wu’s signature as witness. This document with the\n\nother blanks filled in is the second memorandum.)41. That evening a friend told him it was a pledge or guarantee of some\n\nsort. He telephoned the plaintiff and told him about the document. The plaintiff’s\n\nresponse was that he had not signed any pledge or guarantee and that he would bring\n\nforward his trip to Singapore to find out more.42. Ms Tan agreed that Cai saw her on 6 October. She deposed in her\n\naffidavit of evidence-in-chief that \"I showed him the Memorandum of Lien of Fixed\n\nDeposit with particulars filled in dated 25thSeptember 2000\" and informed\n\nhim that it was for the plaintiff to pledge his deposit to KYGC, and \"(a)fter seeing\n\nthe said document he said he did not require a copy of it anymore.\"43. In her evidence in court she was less certain about the document\n\nshe showed him. She said she took out the lien from a file and showed it to Cai. She did\n\nnot look at the date of the lien and believed it to be the one dated September. She knew\n\nthat the plaintiff had signed an earlier memorandum and asked Cai which memorandum he\n\nwanted, but Cai was undecided and wanted to check with the plaintiff. (This account\n\ncontradicted her affidavit and the amended defence that Cai did not want a copy.)44. Her evidence was also inconsistent with the amended defence which\n\nstated that she had taken a file, not just one document, and showed it to Cai. When this\n\nwas brought to her attention her response was that she had objected to this part of the\n\namended defence, but nothing was done about it.45. Questions rose from her evidence. Why did she take out one\n\nmemorandum when she knew there to be two of them? Why did she or Cai not do the reasonable\n\nand sensible thing and take copies of both documents? If Cai wanted to seek the\n\nplaintiff’s further instructions, why was that not stated instead of saying and\n\npleading that he did not want a copy of the document? If she objected to the mistake in\n\nthe amended defence, why was that ignored?",
        "Whether copies of the memoranda were given to the plaintiff": "The first memorandum35. The bank reversed its position on whether a copy of the first\n\nmemorandum was given to the plaintiff. Cheng’s explanation was that initially he\n\ncould not recall very clearly whether he had given it, but he remembered that later. Again\n\nthis did not tie in with the defence which was positive in its terms that the plaintiff\n\ndid not ask for a copy and was not given one.36. The plaintiff also contributed to the confusion. The List of\n\nDocuments filed on 16 January 2001 by his original solicitors, Joo Toon & Co included\n\na blank copy of the first memorandum, but no such document was produced for inspection.\n\nTheir successors explained that the document was listed in error and pointed out the\n\nplaintiffs’ position before and in the commencement of the action on 9 November 2000\n\nhad been consistent that he was not given a copy of the document, but no clear explanation\n\nwas offered as to how the mistake occurred.",
        "Whether the plaintiff agreed to pledge his deposits to secure KYGC’s facilities": "46. The plaintiff’s case is that he did not know of KYGC and had\n\nnot agreed to pledge his deposits to secure its facilities. KYGC is a company controlled\n\nby Hu Hua in which the plaintiff had no interest, and with which he had no dealings. The\n\nplaintiff and Hu Hua had agreed to go into a joint venture to invest in the stock market\n\nin China with funds to be provided by Hu Hua. The venture was conceived during the\n\nplaintiff’s visit to Singapore in August. It did not involve KYGC in any way, and was\n\naborted in the following month.47. There appears to be very little reason or purpose for the plaintiff\n\nto pledge his deposits for the benefit of KYGC. He had earmarked part of the funds to\n\nsecure permanent residence for himself and his family, and he would need funds to buy a\n\nhouse. By pledging the deposits, his funds cannot be used for either purpose.48. He was anxious that his funds were not tied up. Cheng confirmed\n\nthat the plaintiff wanted to be assured that he would be able to withdraw the deposits\n\nwhen he needed to. Yet Cheng’s evidence was that when the plaintiff visited the bank\n\non 25 September to withdraw all his funds and was advised that he could only withdraw the\n\nthird and fourth deposits, he gave instructions to pledge all four remittances.49. Cheng’s account of the plaintiff’s behaviour was quite\n\nextraordinary. He started off wanting to withdraw all his money, and when told he could\n\nonly withdraw a part of it, he not only decided not to withdraw what he can, but proceeded\n\nto pledge the balance as well.",
        "Whether the bank had reason to obtain the pledges without the plaintiff’s knowledge": "50. Underlying the allegations and disputes is the question why the\n\nbank would obtain the plaintiff’s pledges by stealth as he alleged. A bank would want\n\nto keep its customers, and would not do anything to antagonise them unless there is some\n\ncause for it.51. To deal with this question it is necessary to examine Hu Hua’s\n\nand KYGC’s relationship with the bank. Hu Hua evidently presents himself very well to\n\npeople he met. He created a favourable impression on the plaintiff. Mr Lin Hann-Chyi, the\n\nbank’s General Manager testified that he was happy to have him as a client, and\n\nconsidered his company as a customer of great potential as Hu Hua had declared his\n\nintention to locate his financial centre in Singapore.52. KYGC sought facilities from the bank by an application form dated\n\n11 February 2000. The application submitted was for US$5m secured overdraft and US$50m for\n\ntrust receipts. Added to these in handwriting was an application for $200,000 unsecured\n\noverdraft which was inserted on Cheng’s instructions.53. The bank made two offers in response to this application. The first\n\nwas on 21 February offering US$5m in secured overdraft and the same amount in trust\n\nreceipts. The second offer of 22 February was for the same facilities and an additional\n\nline of $200,000 unsecured overdraft.54. Ms Tan Bee Kuan (the same officer who dealt with Cai), a Special\n\nGrade Clerk with 20 years service with the bank processed the application. She had written\n\nin the additional facility into KYGC’s application form on the instructions of her\n\nmanager. She wanted KYGC to submit a new application for all three lines, but the company\n\ndid not return the form that she despatched to it for that purpose. She had also requested\n\nfor the financial statements of KYGC and a board resolution accepting the offered\n\nfacilities.55. Of the documents required, she only received the board resolution,\n\nand only in July. She nevertheless processed the application without the absent documents,\n\nand prepared a credit report on 17 July in which she concluded that the company was\n\ntechnically insolvent with current liabilities exceeding current assets by $998,705.56. Nevertheless the unsecured line was offered. Not only that, it was\n\nallowed to be operated by KYGC even before the offer was made or accepted, when the\n\ncompany drew five cheques on the line between 17-21 February.57. Ms Tan was questioned on these unusual happenings -Q: So this would be a unique case because there was non-compliance,\n\n  unsecured credit line of $200,000, yet the account was activated for several months?A: I can’t answer the question. You must ask my manager.Q: In your recollection, has there been any other case beside KYGC of\n\n  an unsecured loan, where documentation is not complete, no financial statements or credit\n\n  report, yet the loan is activated?A: No.Q: The full $200,000 was utilised before your credit report?A: Yes.Q: Wouldn’t you, with your 5 years experience regard this as an\n\n  unusual experience?A: I rather not answer. I cannot say it is usual or unusual. It is a\n\n  rare occurrence.58. A picture emerges of a favoured client being accorded special\n\ntreatment. This setting lends credibility to the plaintiff’s complaint that the bank\n\nmisled him into signing the two memoranda so that KYGC can draw on its secured line. The\n\nbank’s revolving positions and the bank officers’ evidence did little to dispel\n\nthat.59. The plaintiff’s complaints raise serious charges against the\n\nbank which must be considered carefully. I took into account all the evidence,\n\nparticularly the plaintiff’s reasons for sending his funds to Singapore, his\n\nrelationship (actually the absence of it) with KYGC, and the bank’s case on the\n\nexecution of the memoranda and the management of the KYGC account before arriving at my\n\nfindings.",
        "My findings": "60. After examining and reviewing the matters carefully, I find that\n\nthe plaintiff had proved on a balance of probabilities that he was not aware that the\n\ndocuments he executed were pledges, and that he had been misled by the bank officers.61. I accept that the plaintiff was not able to read and understand the\n\nmemoranda on his own. I do not accept that either Cheng or Wu had explained the true\n\nnature of the documents to him, or had given him copies of them. Between the accounts of\n\nCheng and Wu and that of the plaintiff, I prefer the plaintiff’s evidence on the\n\nexplanations given. I find that the plaintiff had not intended or agreed to pledge his\n\ndeposit to secure KYGC’s facilities.62. In the result I declare that the memoranda are not binding on the\n\nplaintiff and I order that his deposits are to be restored together with such interest\n\nwhich would have accrued had they not been uplifted. I leave it to the parties to compute\n\nthe quantum of interest, and if they cannot agree, the matter is to be referred back to\n\nme. The plaintiff shall also have his costs from the bank, and I order that they be taxed\n\nfor two counsel.63. As the plaintiff had proceeded against KYGC and Hu Hua on the basis\n\nthat the memoranda were binding, these claims are dismissed. There shall be no costs to\n\nthe defendants who had absented themselves.64. Finally, Hu Hua’s claim against the bank is dismissed with costs for two\n\ncounsel to be taxed.Sgd:Kan Ting ChiuJudgeCopyright © Government of Singapore."
    }
}