{
    "case_title": "Ong Leong Chuan v Ong Heng Chuan and Others",
    "ncitation": "[2002] SGHC 126",
    "coram": "Belinda Ang Saw Ean JC",
    "sections": {
        "Prayers 2 and 3 of the application": "7. Prayer 2 of the Plaintiff’s application was for an order to\n\ncompel the 3rdDefendant, Boon Chuan, to observe Clause 8 of the Compromise\n\nAgreement and to transfer 380,000 shares in the 4thDefendant to the Plaintiff\n\nas he had made part payment in the sum of $190,000 for those shares in accordance with the\n\nterms of Clause 7.8. Clauses 7 and 8 read as follows:\"7. The plaintiff shall purchase from the 3rddefendant, and the 3rddefendant shall transfer, 380,000 shares in Tong Guan\n\n        which had been allotted to the plaintiff pursuant to the October 1999 Rights Issue but\n\n        which had not been subscribed for by him, for a total consideration of $380,000 to be paid\n\n        to the 3rddefendant as follows:a.     as to $190,000 within 8 weeks of this order;\n\n        andb.    as to the balance of $190,000 on the completion of\n\n        the sale of all his shares in the company to the 1stto 3rddefendants or any of them as  they may so decide. This payment shall be set-off\n\n        against the sale proceeds of the plaintiff’s shares.Provided that if the plaintiff shall default in the payment of the sum\n\n        of $190,000 to the 3rddefendant within the prescribed period of 8 weeks from\n\n        the date of this Order, the plaintiff shall be deemed to have declined to purchase the\n\n        said 380,000 shares from the 3rddefendant, and he shall have no claim\n\n        whatsoever on the said shares.  The sale of all his shares to the defendants or such\n\n        of them pursuant to clause 1 shall accordingly be less the 380,000 shares.8.    On receipt from the plaintiff of the sum of\n\n        $190,000 the 3rddefendant shall transfer the 380,000 shares to the\n\n        plaintiff who shall  thereupon execute a transfer of those shares in escrow and\n\n        deliver the transfer form(s) and the share certificate(s) to his solicitors M/s Hee Theng\n\n        Fong & Co., to be held by the said solicitors as stakeholders pending completion of\n\n        the sale and purchase. The transfer forms shall be prepared by the company secretary of\n\n        Tong Guan.\"9. Clause 7(a) does not stipulate the mode of payment. Payment could be\n\nmade in any commercially acceptable form.10. The effect of a stipulation as to time depends on the true\n\nconstruction of Clause 7. The proviso to Clause 7 deals with the consequence of a default\n\nin payment. If there is non-payment by the appropriate time specified, the Plaintiff is\n\ntreated as having declined to purchase the 380,000 shares.11. If part payment for those 380,000 shares were made in accordance\n\nwith Clause 7(a), then the provisions of Clause 8 would come into play.12. At the material time, M/s Hee Theng Fong & Co represented the\n\nPlaintiff. It is evident from the firm’s letter of 5 October 2002 that the due date\n\nfor payment of $190,000 pursuant to Clause 7(a) was undeniably 20 September 2000: see\n\nexhibit marked \"OBC-26\" to affidavit of Boon Chuan filed on 18 March 2002 in\n\nOriginating Summons no. 100 of 2002. At the hearing, the Plaintiff argued for the date of\n\nthe Tomlin Order to be 27 July 2000 so that the last day for payment would fall on 21\n\nSeptember 2000. I agreed with Counsel for Boon Chuan, Mr. Andy Chiok, that the last day\n\nfor payment under Clause 7(a) was 20 September 2000. I should mention that in Skeletal\n\nArguments prepared in support of the Plaintiff’s request on 8 May 2002 for further\n\narguments, he conceded that the last day for payment of $190,000 was 20 September 2000.13. Relevant to the computation of time in Clause 7(a), is naturally\n\nthe date of the Tomlin Order which I decided was 26 July 2000. The Plaintiff is not\n\nappealing against this part of the order.14. On 20 September 2000, M/s Hee Theng Fong & Co tendered a cheque\n\nno. 341525 drawn on United Overseas Bank Limited (\"UOB\") in favour of Boon Chuan\n\nfor $190,000 in purported performance of Clause 7(a). M/s Michael Khoo & Partners\n\nreceived the cheque after office hours. The cheque was presented for payment the next\n\nworking day. The cheque was dishonoured and Boon Chuan learned about that on 27 September\n\nor thereabouts. On 29 September, M/s Michael Khoo & Partners gave notice of dishonour\n\nto M/s Hee Theng Fong & Co.15. It transpired that the next day, after the cheque was tendered on\n\n20 September 2000, the Plaintiff deposited into Boon Chuan’s bank account $190,000 in\n\ncash. The Plaintiff did that because he was not allowed to operate his UOB account as it\n\nwas subject to a mareva injunction order dated 9 February 2000 made in Suit no. 1632 of\n\n1999: see 8 of 4thaffidavit of Boon Chuan filed on 18 March 2002 in\n\nOriginating Summons no. 100 of 2002.16. Mr. Chiok submitted that the cash payment was unknown to M/s\n\nMichael Khoo & Partners and Boon Chuan. They learned about it from M/s Hee Theng Fong\n\n& Co’s letter dated 30 September. Mr. Chiok argued that given the dishonoured\n\ncheque and circumstances of the cash payment, the Plaintiff never intended to pay for the\n\nshares when the cheque was tendered on 20 September. He must have known that it would not\n\nbe cleared.17. It was unnecessary for me to find that the Plaintiff knew that the\n\ncheque would be dishonoured; had represented and induced the 3rdDefendant to\n\nbelieve that the cheque would be honoured when it was given and accepted on 20 September.\n\nOn legal principles, the Plaintiff’s purported payment by cheque was bad. In law,\n\nwhen the UOB cheque was offered for payment on 20 September, it amounted to a conditional\n\npayment of the amount of the cheque. Since the UOB cheque was not met on presentation, it\n\ndid not constitute payment as required before time expired on 20 September. With the\n\ndishonour, payment was void ab initio. SeeTan Chong Keng v Vincent Lim Bak Keng[1986] 2 MLJ 327at 328;Marreco & Others v Richardson(1908) 2 KB 584\n\nat 593;DPP v Turner(1974) AC 357 at 367-368.18. The cash payment on 21 September 2000 was one day late. It was\n\ndeposited in Boon Chuan’s bank account outside the period of eight weeks specified in\n\nClause 7(a).19. The exchanges of correspondence showed that Boon Chuan never\n\naccepted the cash payment on 21 September. In fact through his lawyers, he returned the\n\nmoney, which the Plaintiff steadfastly refused to accept. As the matter stands, Boon\n\nChuan’s cheque for $190,000 in favour of the Plaintiff is with M/s Hee Theng Fong\n\npending resolution of this issue: see exhibit \"BC-15\" to 6thaffidavit of Boon Chuan filed herein on 6 May 2002.20. In the absence of timely payment, by virtue of the proviso to\n\nClause 7, the Plaintiff is deemed to have decided not to purchase the 380,000 shares.\n\nConsequently, Boon Chuan was under no obligation to sell the 380,000 shares to the\n\nPlaintiff nor was he required to observe the provisions of Clause 8. I therefore dismissed\n\nprayers 2 and 3 of the application.",
        "Prayers 4 and 5 of the application": "21. By these two prayers, the Plaintiff sought to enforce the\n\nprovisions of Clause 10.22. Clause 10 reads as follows:\"10. Upon delivery of the share transfers and share certificates\n\n        to the plaintiff’s solicitors pursuant to clause 5, the defendants shall, subject to\n\n        the consent of the financial institutions concerned, procure the plaintiff to be\n\n        discharged from all guarantees signed by him and financial obligations undertaken by him\n\n        in connection with facilities granted to Tong Guan and its subsidiaries wherein monies\n\n        utilised from such facilities were duly authorised and used for the business of Tong Guan\n\n        and its subsidiaries (\"the said monies\"). The defendants (except the 3rddefendant) shall procure Tong Guan and its subsidiaries to indemnify the plaintiff in\n\n        respect of any claim that may be made in respect of the said monies. \"23. In a related application, summons-in-chambers entered no. 600081 of\n\n2002, which came up for hearing on 5 April 2002, I ordered the share certificates and duly\n\nsigned blank share transfer forms envisaged in Clause 5 be held by M/s Kumar & Loh as\n\nstakeholders in place of M/s Hee Theng Fong who had ceased to act for the Plaintiff.24. Both Mr. Kumar, Counsel representing 1stand 2ndDefendants, and Mr. Chiok contended that the events giving rise to the operation of Clause\n\n10 had not arisen in that the Plaintiff had not yet fully complied with Clause 5 as\n\nvaried.25. Mr. Kumar informed the court that M/s Kumar & Loh as\n\nstakeholders had not received from the Plaintiff all the share certificates and duly\n\nsigned blank share transfer forms. Mr. Kumar’s position was that certificates for\n\n380,000 shares remained outstanding whereas by Mr. Chiok’s reckoning, the\n\ncertificates should be for 180,000 shares.26. For the purpose of this application, I was satisfied that so long\n\nas there were outstanding share certificates and duly signed blank share transfer forms to\n\nbe handed over to the stakeholders, the application was pre-mature. There was no need for\n\nme to deal with Boon Chuan’s challenge to the Plaintiff’s statutory declaration\n\non missing certificates representing 300,000 shares or the actual number of share\n\ncertificates still to be handed over to the stakeholders. I accordingly dismissed prayers\n\n4 and 5.",
        "Prayer 6 of the application": "27. By Clause 11, the shares are to be valued by M/s Ernst & Young.\n\nThe parties were required to sign an appointment letter. Failing the appointment of M/s\n\nErnst & Young, under Clause 11 the court would appoint an independent valuer.28. The Plaintiff in prayer 6 of his application wanted an order\n\nappointing an independent valuer because the 1stto 3rdDefendants\n\nhad not signed the appointment letter.29. Mr. Kumar informed the court that the Plaintiff had just signed the\n\nappointment letter and that he would be meeting the 1stand 2ndDefendants to collect their signatures. Thereafter, the appointment letter would be handed\n\nover to Mr. Chiok for Boon Chuan’s signature. In the circumstances, there was no\n\ndisagreement as such to trigger the operation of Clause 11.30. I dismissed prayer 6 of the application as it was made\n\npre-maturely.31. Only Mr. Chiok pressed for costs. Since there was no particular\n\ncircumstance warranting a departure from the normal order that the unsuccessful party pays\n\nthe costs, I awarded Boon Chuan costs fixed at $800. The amount of costs fixed at $800 was\n\nmore than fair and reasonable for an application, which was argued for over an hour.Sgd:BELINDA ANG SAW EANJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}