{
    "case_title": "International Factors Leasing Pte Ltd v The Personal Representative of Tan Hock Kee & Others",
    "ncitation": "[2002] SGHC 270",
    "coram": "Woo Bih Li JC",
    "sections": {
        "The default interest of 18% per\n\nannum": "5.        The\n\nterms of the loan to the First and Second Defendants are set out in a Term Loan Agreement\n\ndated 29 September 1995. Under clause 8.4, if there is a default in payment, Tan Hock Kee\n\nand THK Realty are liable to pay interest at 18% per annum (‘the Default\n\nInterest’), over and above the principal sum and the usual interest payable if there\n\nwas no default.6.        \n\nBefore me, the Defendants’ position as stated in the written submission of Mr Hri\n\nKumar, their Counsel, was still that the Default Interest was a penalty and hence\n\nunenforceable. The written submission also pointed out that as IFL did not adduce any\n\nevidence on the principal amount due, the Assistant Registrar gave IFL’s Counsel the\n\noption of adjourning the hearing to file a further affidavit or for interlocutory judgment\n\nto be entered. As IFL opted for the latter, it was not open to IFL to complain about the\n\nAssistant Registrar’s orders.7.        Mr\n\nSean Lim, Counsel for IFL, said that while he did select the second option, he also did\n\nsubsequently apply to adduce further evidence, to which the Defendants’ Counsel did\n\nnot object. Accordingly, further affidavits were filed on behalf of IFL. The material\n\naffidavit is the third affidavit of Doreen Chia Lee Yoon, an Assistant Vice President of\n\nIFL. What she did was to exhibit a calculation of the sums due under each of the two\n\naccounts on the basis that the Default Interest is not applied at all by IFL.8.        In\n\nresponse, Mr Kumar submitted that while he did not object to the application of IFL to\n\nadduce further evidence, he had reserved the Defendants’ position. However, as\n\nregards the new calculation exhibited in Doreen Chia’s third affidavit which did not\n\ninclude any Default Interest at all, Mr Kumar said he had no response.9.        As\n\nIFL had been allowed to adduce further evidence in the face of no objection by Mr Kumar,\n\neven though he reserved the Defendants’ position, I was of the view that Mr Kumar\n\ncould no longer insist that IFL should not appeal against the Assistant Registrar’s\n\norder. Furthermore, since Mr Kumar did not have any response to the new calculation, I\n\nallowed the appeal and granted IFL summary judgment for the sums based on the new\n\ncalculation. This was on 28 June 2002. At the same time, I adjourned the rest of the\n\nappeal for both Counsel to consider what submissions they wished to make as to whether the\n\ninterlocutory judgment should still stand in respect of the balance of IFL’s claim or\n\nunconditional leave should be granted to the Defendants for that balance. I also allowed\n\nthe Defendants to make an oral application for stay of execution at the adjourned hearing.10.        \n\nHowever, by the time the appeal was fixed for further hearing on 22 July 2002, Mr Kumar\n\nhad raised an argument in respect of the new calculation. He submitted that the new\n\ncalculation showed that the Defendants had made an excess payment of about $5,800 on one\n\noccasion which was applied by IFL to pay the next interest payment due. He submitted that\n\nIFL was not entitled to do that and should have applied the excess payment towards\n\nreducing the principal whereupon all the interest calculated thereafter would be\n\nconsequently reduced and hence the sums claimed, even under the new calculation, were\n\nexcessive.11.        Mr\n\nLim’s response was that the allegation of an excess payment was on the basis that no\n\nDefault Interest was chargeable. If it was, then there was no excess payment. However,\n\neven if no Default Interest was chargeable, it did not follow that IFL was obliged to\n\napply the excess towards reducing the principal. He pointed out that under the terms of\n\nthe term loan, payment of principal was not allowed unless certain conditions were\n\ncomplied with. For example, the borrowers had to pay a pre-payment fee and give three\n\nmonths’ prior notice in writing or pay three months’ interest in lieu of such\n\nnotice. Furthermore, pre-payments had to be in multiples of $100,000. These terms applied\n\nto another ‘over-payment’ as well, which he drew to my attention.12.        \n\nUpon hearing this submission, Mr Kumar conceded that when payments were made, there was no\n\nintention to make any capital pre-payment but he argued that this meant that the terms\n\nrelied upon regarding pre-payment by Mr Lim did not apply. Notwithstanding this\n\nconcession, Mr Kumar maintained that the excess should be used to reduce the principal.13.        In\n\nmy view, if the Default Interest is not enforceable, and this resulted in some\n\nover-payments, it did not follow that the excess must be used to reduce the principal.\n\nOtherwise, that would be tantamount to effecting a capital pre-payment which, firstly, was\n\nnever intended and, secondly, did not comply with the terms applicable to a capital\n\npre-payment. If Mr Kumar was right, a borrower could easily circumvent any term on capital\n\npre-payment by simply paying more than what was due, without paying the requisite fee and\n\ngiving the requisite notice, or interest in lieu of notice. In my view, IFL had already\n\nacted reasonably and correctly by applying the excess to reduce the next interest amount\n\ndue in its new calculation.14.        \n\nHowever, Mr Kumar had raised another point i.e whether the borrowers should have been\n\ngiven interest on the excess in the interim. My tentative view was that they were not\n\nentitled to such interest and, even if they were, that was a matter for a counterclaim.15.        I\n\nwould add that the arguments about the excess being used to reduce the principal or,\n\nalternatively, earning some interest would not have resulted in a significant reduction in\n\nthe monies to be paid by the Defendants, even if either of the arguments were successful.\n\nIt seemed to me that the strategy of the Defendants was simply to prevent or delay IFL\n\nfrom obtaining judgment for any sum. Had I accepted either one of these arguments, I would\n\nnevertheless have allowed IFL to come up with another calculation showing the slightly\n\nreduced sums as a result of the successful argument and granted judgment on those reduced\n\nsums.16.        In\n\nthe circumstances, I did not rescind or vary my earlier order. As for the balance, IFL was\n\nprepared to agree that the Defendants be granted unconditional leave to defend, and I so\n\nordered.",
        "Alleged breach of duty as\n\nmortgagees": "17.        The\n\nDefendants then alleged that IFL had breached its duty as mortgagee to claim a set-off or\n\ncounterclaim so as to support their oral application for a stay of execution pending the\n\ndisposal of their claims against IFL. Their allegations were really in the nature of\n\ncounterclaims.18.        The\n\nFirst Defendant Tan Hock Kee had mortgaged properties at 538 to 556 (even numbers only)\n\nGeylang Road, Singapore (‘the Properties’) to IFL as security for the loan. The\n\nProperties were rented to one Wong Choi Tim (‘Wong’) and Chua Tiong Tiong\n\n(‘Chua’) for 12 months from 1 February 2000. At the end of the tenancy, Wong and\n\nChua continued to occupy the Properties on a month to month tenancy. It was only on or\n\nabout 12 June 2001 that IFL took legal possession of the Properties.19.        The\n\nfirst complaint by the Defendants was that within three days of taking legal possession,\n\nIFL entered into a sale and purchase agreement dated 15 June 2001 (‘the S&P\n\nAgreement’) to sell the Properties to MKTV Karaoke Lounge Pte Ltd (‘MKTV’)\n\nfor $12 million. MKTV was a company owned or controlled by Chua. Chua is also known as\n\n‘Ah Long San’, a well-known illegal moneylender operating in Geylang. At the\n\nmaterial time, he had been facing corruption charges involving members of the Singapore\n\nPolice Force.20.        The\n\nDefendants also alleged that IFL should not have entered into the S&P Agreement with\n\nMKTV when the Third Defendant Tan Hock Keng had received phone calls from property agents\n\nthat they had interested buyers to purchase the Properties at around $12 million. On this\n\npoint, the Defendants produced a letter dated 11 June 2001 from a company known as Lay\n\nSeong Enterprises Pte Ltd to Tan Hock Keng offering to purchase the Properties at a price\n\nof $11.8 million. The offer was valid for three weeks.21.        The\n\nDefendants maintained their allegation even though they (including the beneficiaries of\n\nthe estate of the First Defendant Tan Hock Kee) had signed a letter of consent for IFL to\n\nsell the Properties at a price of $12 million. They alleged that the name of the buyer in\n\nthe letter of consent was left blank and they had assumed that the buyer would be Chua,\n\nnot MKTV.22.        The\n\nDefendants alleged that MKTV was in fact an insolvent company as its accounts showed that\n\nits liabilities far exceeded its assets. Indeed, MKTV was unable to complete the purchase\n\nwithin the eight weeks as envisaged under the S&P Agreement and sought an extension of\n\ntime to complete by 31 December 2001. Although the Defendants consented to the extension\n\nof time, they alleged that they did not suspect that anything was amiss and, so, had\n\ninsisted on late completion interest being imposed.23.        The\n\nDefendants also suggested that IFL’s entry into the S&P Agreement was suspicious\n\nand pointed out that there was a conflict of interest on the part of IFL because IFL had\n\nalso agreed to furnish 100% financing to MKTV.24.        On\n\n18 October 2001, MKTV informed IFL that it would not proceed with the purchase. On hearing\n\nthe news, Jenny Pang, who is Tan Hock Keng’s assistant, allegedly asked one C K Wong\n\nof IFL why IFL was not taking legal action against MKTV and was allegedly told that MKTV\n\nonly had a paid-up capital of $2. This conversation was denied by C K Wong who exhibited a\n\nsearch of MKTV showing it to have a paid-up capital of $400,000.25.        The\n\nsecond complaint was that the S&P Agreement only provided for a deposit of $120,000\n\nwhich was paid. This was only 1% of the purchase price of $12 million instead of the usual\n\n10%. Had IFL insisted on the usual 10%, the higher sum would have further reduced the\n\noutstanding loan.26.        The\n\nthird complaint was that under the S&P Agreement, IFL had agreed to renovate the\n\nProperties for between $1 million to $1.5 million and this would have prejudiced the\n\nDefendants’ ability to redeem the mortgages.27.        The\n\nfourth complaint was that IFL had refused to use a related company of THK Realty to do the\n\nrenovation works and thereby minimise the costs thereof.28.        The\n\nfifth complaint was that IFL had failed to collect rent from MKTV who was using the\n\nProperties, even though the completion of the S&P had been extended.29.        The\n\nsixth complaint was that IFL had failed to take steps to protect the Properties because\n\nwhen MKTV vacated the Properties on or about 5 November 2001, MKTV had ripped out whatever\n\nit wanted and left parts of the false ceiling dangling and there was debris left all over\n\nthe place.30.        The\n\nseventh complaint was that IFL failed to take any step to rent out the Properties or\n\nunreasonably hindered the Defendants’ attempts to find a tenant. In particular, the\n\nDefendants alleged that they had secured a prospective tenant who was interested in\n\nrenting the first floor of the Properties for $55,000 per month but IFL insisted that the\n\nprospective tenant renovate the Properties to IFL’s specifications and the renovation\n\nmust cost up to $1.15 million.31.        The\n\neighth complaint was in relation to the sale of 14 Lorong 15 Geylang which was also\n\nmortgaged to IFL as security. It was alleged that the manner in which IFL, through its\n\nagents, had sold the property resulted in a loss of $400,000 as there was an interested\n\npurchaser by the name of Yeo Eng Tiong who was prepared to pay more than the price at\n\nwhich this property was actually sold. However he was unsuccessful as he did not have a\n\ncashier’s order for the deposit.32.        In\n\nresponse to the Defendants’ allegations, IFL pointed out that it was the Third\n\nDefendant Tan Hock Keng himself who informed IFL that Chua was interested in buying the\n\nProperties. The Defendants also knew that Chua would use one of his companies to buy the\n\nProperties and Chua wanted some renovations to be done. Accordingly, IFL had sought and\n\nobtained the Defendants’ consent to the sale. As regards the omission to state the\n\nname of the buyer in the consent, IFL’s contention was that the Defendants knew it\n\nwould be one of Chua’s companies and if the identity of the buyer was as important as\n\nthe Defendants were suggesting, they would not have signed the consent form without\n\ninsisting on the name of the buyer being inserted in the consent form.33.        \n\nIndeed, IFL pointed out that the Defendants did not give any reason why it was important\n\nto them that Chua be the buyer and not one of his companies when they themselves were\n\ncurrently saying negative things about Chua himself.34.        As\n\nregards the allegation that Lay Seong Enterprises Pte Ltd had allegedly made an offer of\n\n$11.8 million, IFL pointed out that Tan Hock Keng had admitted in his second affidavit,\n\nparagraph 7, that he did not communicate this offer to IFL.35.        As\n\nregards the allegation that MKTV was a $2 company only, IFL pointed out that two of the\n\nprospective purchasers which were subsequently recommended by the Defendants, i.e Rickson\n\nBuilding Construction Pte Ltd and Grazza Pte Ltd, were themselves $2 companies. IFL’s\n\npoint was that if IFL had refused to enter into the S&P Agreement with MKTV, the\n\nDefendants would be the first to cry foul against IFL.36.        I\n\nwould add that although the Defendants said they did not suspect anything was amiss when\n\nthey agreed to an extension of time being given to the purchaser to complete the sale, the\n\nletter containing their consent to the extension clearly identified MKTV as the purchaser.\n\nSo much for their purported ignorance about MKTV being the purchaser. What the Defendants\n\nwere interested in was that MKTV should be charged late completion interest at 10% per\n\nannum, as stated in that consent.37.        As\n\nfor suspicion arising from the fact that IFL was financing MKTV’s purchase, Mr Lim\n\npointed out that Tan Hock Keng’s second affidavit, para 7, showed that he knew that\n\nIFL was financing MKTV’s purchase. Mr Lim also submitted that there was no conflict\n\nin IFL financing the purchase as the Defendants had wanted the purchase to go through.38.        \n\nWhen Mr Lim pointed out that the Defendants knew that IFL was financing MKTV’s\n\npurchase, Mr Kumar advanced another argument. He submitted that they did not know that IFL\n\nwas intending to furnish 100% financing. If there was 100% financing, then a 10% deposit,\n\ninstead of 1%, could have been paid. This pertains to the second complaint about a deposit\n\nabout 1% only. However, Mr Lim pointed out that in Tan Hock Keng’s first affidavit,\n\npara 11, he had admitted that he knew that IFL was intending to furnish 100% financing. It\n\nseemed to me also that it did not necessarily follow that just because the intention was\n\nto obtain 100% financing, MKTV would be prepared to pay a 10% deposit especially if the\n\ndeposit was to be paid first before the conditions for the 100% financing were met. On the\n\n1% deposit, IFL said that that was all that MKTV was prepared to put up and if IFL had\n\nrefused to sell unless a higher deposit was paid, it would again be the Defendants who\n\nwould complain.39.        As\n\nregards the third complaint about IFL agreeing under the S&P Agreement to renovate the\n\nProperties between $1 million to $1.5 million, IFL said that because the Properties were\n\ndilapidated and the property market was depressed, the Defendants agreed to the condition\n\nabout renovation but reduced the quantum to $1 million. I would add that the consent to\n\nthe S&P Agreement signed by the Defendants did mention renovation works to be done by\n\nIFL estimated to be $1 million.40.        As\n\nregards the fourth complaint, IFL said it did not refuse to appoint contractors selected\n\nby the Defendants but simply informed them that IFL would obtain various quotations and\n\nthe Defendants’ contractors would be free to submit their bid.41.        As\n\nregards the fifth complaint about IFL failing to collect rent from MKTV pending completion\n\nof the purchase, Mr Lim said that IFL had sued Chua for the rent (Chua being the tenant\n\nand MKTV being the occupant) and had obtained judgment and a Writ of Seizure & Sale on\n\none of his properties.42.        As\n\nregards the sixth complaint about IFL allowing the tenant/occupant to damage the\n\nProperties, IFL said that MKTV was occupying the first floor of the Properties under the\n\ntenancy granted to Chua before IFL took legal possession. IFL was given physical\n\npossession only after the occupant had moved out by which time it was too late to stop the\n\noccupant from causing damage when it was moving out.43.        As\n\nregards the seventh complaint about IFL not agreeing to rent out the first floor to a new\n\ntenant at the rent of $55,000 a month, IFL said that that amount was not sufficient to pay\n\ninterest on the outstanding loan. IFL wanted renovations to be done for the first floors\n\nand the second floors as the latter was in a dilapidated condition. In any event, IFL had\n\nbeen taking active steps to sell the Properties including applying to sub-divide them.44.        As\n\nregards the eighth complaint regarding the sale of 14 Lorong 15 Geylang, IFL gave its\n\nversion as to why its agent did not accept an offer by Yeo Eng Tiong who did not have a\n\ncashier’s order with him for the deposit. IFL also pointed out that Yeo was\n\nacquainted with Tan Hock Keng as both were co-directors in Pilecon Pte Ltd and Yeo was\n\nalso a director in Five Star Book Binding Pte Ltd, which was Tan Hock Keng’s company.\n\nYeo was also one of two shareholders and directors of Rickson Building Construction Pte\n\nLtd, one of the new interested purchasers with a paid up capital of $2 only. Accordingly,\n\nYeo’s evidence must be treated with caution.45.        Mr\n\nLim stressed that, aside from the alleged loss of $400,000 in respect of the sale of 14\n\nLorong 15 Geylang, the Defendants did not quantify their counterclaims although directed\n\nto do so by the Assistant Registrar. There were also other creditors who were pursuing\n\ntheir claims against the same Defendants or some of them. He submitted that it would be\n\nunfair to hold IFL back with a stay of execution.46.        Mr\n\nLim also relied on various contractual provisions to support the argument that there\n\nshould be no stay:(a) Clause 13.3 of the Term Loan\n\n    Agreement (found in Doreen Chia’s first affidavit p 38) states:‘all sums payable by the\n\n      Mortgager and/or the Borrower under this Agreement shall be paid (i) … (ii) …\n\n      (iii) without deduction or withholding (except to the extent required by law) on account\n\n      of any other amount, whether by way of set-off counterclaim or otherwise.’(b) A similar provision is found\n\n    in clause 11 of IFL’s standard Memorandum of Mortgage (found in Doreen Chia’s\n\n    first affidavit p 60).(c) A similar provision is found\n\n    in clause 16 of the guarantee of the Third to Fifth Defendants:‘16 All payments …\n\n      shall be made without set-off or counterclaim and without any deduction or withholding\n\n      whatsoever.’47.        Mr\n\nLim drew my attention to two cases. The first isP.H. Grace Pte Ltd & Ors v\n\nAmerican Express International Banking Corporation[1987] 1 MLJ 437. In refusing to\n\ngrant a stay of execution on a judgment against guarantors, Justice L P Thean, delivering\n\nthe judgment of the Court of Appeal, cited the judgment of Parker LJ inContinental\n\nIllinois National Bank & Trust Company v Papanicolaou(The Times July 15, 1986).\n\nParker LJ said:‘… Irrevocable letters\n\n    of credit and bank guarantees given in circumstances such that they are the equivalent of\n\n    an irrevocable letter of credit have been said to be the life blood of commerce.\n\n    Thrombosis will occur if, unless fraud is involved, the Courts intervene and thereby\n\n    disturb the mercantile practice of treating rights thereunder as being the equivalent of\n\n    cash in hand.We can see no relevant\n\n    distinction between the guarantee in that case and the guarantees presently under\n\n    consideration. The purpose of both was to ensure immediate payment if the principal debtor\n\n    did not pay. Indeed the present cases make it the more necessary that the court should not\n\n    interfere, for here the parties have specifically provided both in the loan agreement and\n\n    the guarantees that payment should be made free of any set-off or counterclaim. It would\n\n    defeat the whole commercial purpose of the transaction, would be out of touch with\n\n    business realities and would keep the bank waiting for a payment, which both the borrowers\n\n    and the guarantors intended that it should have, whilst protracted proceedings on the\n\n    alleged counterclaims were litigated.We do not doubt that the court has a discretionto grant a stay but it should in our view be \"rarely if ever\" exercised, as Lord\n\n    Dilhorne said in relation to claims on bills of exchange. Guarantees such as this are the\n\n    equivalent of letters of credit and only in exceptional circumstances should the court\n\n    exercise its power to stay execution.The fact that a counterclaim which was likely to\n\n    succeed existed would not by itself be enough, as Lord Justice Buckley pointed out. It\n\n    might be that the existence of such a counterclaim coupled with cogent evidence that the\n\n    bank would, if paid, be unable to meet a judgment on the counterclaim would suffice, but\n\n    nothing of that nature arises here. This is a simple case where no ground for granting a\n\n    stay can be shown.’[Emphasis added.]48.        \n\nThean J then added (at p 442):‘True it is that in the\n\n    instant case, there is no such clause specifically providing that the payment should be\n\n    made free of any set-off or counterclaim, but if one examines the passage quoted above, it\n\n    would be apparent that that does not form an essential part of theratio decidendiof that case. That it serves only to strengthen the Court of Appeal’s view is clear\n\n    from the preceding words on which it is predicated: \"Indeed the present cases make it\n\n    the more necessary …\". Were a stay to be granted in these circumstances, it\n\n    would, in our view, make nonsense of the \"whole commercial purpose of the\n\n    suretyship\" - \"you would lose your guarantor at the very moment you most need\n\n    him\" (per Lord Simon inLep Air Services Ltd. V. Rolloswin Investment Ltdat\n\n    page 355). This is more so when, as in the instant case, it was not contended that the\n\n    amount for which summary judgment was granted was not due.’49.        Mr\n\nKumar submitted that in that case our Court of Appeal was of the view that there was still\n\na discretion whether to grant a stay of execution or not even if there was a contractual\n\nclause providing that payment should be made free of any set-off or counterclaim. However,\n\nit seemed to me that even if this were so, Parker LJ had said that the fact that a\n\ncounterclaim was likely to succeed would not by itself be enough to justify a stay\n\nvis--vis guarantors and this view was implicitly adopted by our Court of Appeal. I would\n\nadd that, on the facts in that case, our Court of Appeal was inclined to granting a stay\n\nvis--vis the mortgagor but the mortgagor had been wound up.50.        The\n\nsecond case which Mr Lim referred to wasCitibank NA v Lee Hooi Lian & Anor[1999] 4 SLR 469. In that case, Justice Goh Joon Seng dismissed a mortgagor’s\n\napplication for a stay of execution based on her counterclaim in view of contractual\n\nprovisions similar to the ones before me. Goh J relied onHong Kong and Shanghai\n\nBanking Corp v Kloeckner & Co AG[1990] 2 QB 514and Coca Cola Financial Corp v\n\nFinsat International Ltd[1996] 2 Lloyd’s Rep 274 and he did not seem to think\n\nthat there was a discretion to grant a stay in view of the contractual provisions although\n\nhe did not say so specifically. On the other hand, it appears that theAmerican Expresscase might not have been cited to him.51.        In\n\nthe case before me, I was of the view that even if I still had a discretion to grant a\n\nstay of execution, notwithstanding the contractual provisions, I should not do so. As\n\nParker LJ had said, the existence of a counterclaim would not by itself be enough where\n\nguarantors seek a stay. Moreover, as Mr Lim had submitted, the Defendants had not\n\nquantified the rest of their counterclaims. It seemed to me that the reason they did not\n\ndo so was because the quantum of all their counterclaims would still be substantially less\n\nthan IFL’s claim. Thirdly, while I do not go so far as to say that there is no merit\n\nwhatsoever in all of the counterclaims, the nature of many of the allegations made by the\n\nDefendants did not engender confidence in their bona fides. For example, the Defendants\n\nhad complained about IFL dealing with Chua when it was Tan Hock Keng who introduced Chua\n\nto IFL. They had complained about IFL selling the Properties to MKTV when the Defendants\n\nhad consented to an extension of time to complete knowing that MKTV was the purchaser.\n\nThey had complained about MKTV allegedly being a $2 paid-up company when the new\n\npurchasers they had introduced were also $2 paid-up companies.52.        As\n\nfor Mr Kumar’s submission that IFL still had a mortgage on the Properties and perhaps\n\non another property as well, I was of the view that this was not a strong factor in favour\n\nof a stay of execution. It would be almost tantamount to compelling IFL to sell any\n\nproperty which was mortgaged to it before taking enforcement proceedings.53.        Mr\n\nKumar also submitted that if there was no stay, the Defendants would be made bankrupt or\n\nwound up and they would not be in a position to pursue the counterclaims. This would\n\neffectively shut out the Defendants and/or hinder the fair prosecution of their\n\ncounterclaims. Mr Kumar relied on the judgment of Justice Yong Pung How (as he then was)\n\ninInvar Realty Pte Ltd v Kenzo Tange Urtec Inc & Anor[1990] 3 MLJ 388where\n\nYong J said, at p 391:‘The Court of Appeal inSheppards\n\n    v Wilkinsonrecognized that a counterclaim may be used by a party as a defence to a\n\n    claim in certain instances. The court stated that a defendant ought not to be shut out\n\n    from defending unless it was very clear indeed that he had no case in the action under\n\n    discussion. There might be either a defence to the claim which was plausible or there\n\n    might be a counterclaim pure and simple. To shut out such a counterclaim would be an\n\n    autocratic and violent use of O 14. The court had no power to try such a counterclaim on\n\n    such an application, but, if they thought it so far plausible that it was not unreasonably\n\n    possible for it to succeed if brought to trial, it ought not to be excluded. If the\n\n    counterclaim was for a less sum than that claimed, then judgment might be signed, if there\n\n    was no real defence, for so much of the amount of the claim as was not covered by the\n\n    counterclaim. But if the counterclaim overtopped the claim and was really plausible, then\n\n    the rule which had been often acted upon at chambers, of allowing the defendants to defend\n\n    without conditions, was the right one. There were however circumstances which might call\n\n    on the court to act differently. If it was clear that the claim must succeed and there was\n\n    really no defence to it, and the plaintiffs would only be put to expense in proving their\n\n    claim, then there ought to be judgment on the claim, but the matter must be so dealt with\n\n    that the defendants who had a plausible counterclaim must not be injured; and that would\n\n    be done by staying execution on the judgment until the counterclaim had been tried.The Court of Appeal was unanimous\n\n    in endorsing that the proper order must be for judgment to be entered for the plaintiffs,\n\n    with a stay of execution pending trial of the counterclaim or further order. The reasoning\n\n    seems clear that the claim by the plaintiffs and the counterclaim by the defendants must\n\n    be taken separately. If there is no defence to a claim other than a plausible\n\n    counterclaim, then judgment must be entered on the claim. To prevent injury to the\n\n    defendants and to prevent an autocratic and violent use of O 14 by shutting out the\n\n    defendants, a stay of execution on the judgment must be granted, pending the trial of the\n\n    counterclaim or until further order. The overriding consideration is that if the claim is\n\n    undisputed other than by means of a counterclaim, the claimant must not be put to the\n\n    expense of proving his claim, even if no great expense would be incurred in proving that\n\n    claim at a trial.’54.        \n\nHowever, after that passage, Yong J also said that the principles cited inSheppards v\n\nWilkinsonhave been applied with approval in several cases, which he mentioned. One of\n\nthese cases was theAmerican Expresscase which I have dealt with above. As I have\n\nsaid, in theAmerican Expresscase, the Court of Appeal was of the view that,\n\ngenerally speaking, a stay of execution should not be granted at least vis--vis\n\nguarantors. I did not think that the judgment of Yong J meant that, as a general rule, a\n\nstay of execution should be granted once there was a counterclaim so as to prevent an\n\nabuse of the summary judgment procedure or to avoid shutting out the counterclaim.55.        \n\nBesides, the facts inInvar Realtywere different from those before me. There, the\n\nplaintiff was a developer and the first and second defendants were the architect and civil\n\nand structural engineer respectively. There were defects in the building concerned but the\n\nsecond defendant had a counterclaim for its fees of about $179,000. The plaintiff admitted\n\nabout $116,000 was due to the second defendant and on that basis, the second defendant\n\nsought summary judgment for the lower figure. As Yong J said, at p 389:‘The issues on these two\n\n    appeals are (1) whether the registrar was right in giving the second defendants summary\n\n    judgment for $116,585.07 on their counterclaim and (2) whether the registrar was right in\n\n    dismissing the plaintiffs’ application to amend their defence to the\n\n    counterclaim.’56.        The\n\nargument on the first issue was whether summary judgment should be entered against the\n\nplaintiff at all in view of the plaintiff’s claim and not whether there should be a\n\nstay of execution, if summary judgment was granted against the plaintiff.57.        \n\nEach case must depend on its facts and in view of the facts before me, I declined to order\n\na stay.Sgd:WOO BIH LIJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}