{
    "case_title": "Management Corporation Strata Title Plan No 2192 v Regenthill Properties Pte Ltd",
    "ncitation": "[2002] SGHC 26",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "The plaintiffs are a body corporate constituted under the Land Titles (Strata) Act (Cap 158), as the management corporation of the condominium building known as `Regent Park Condominium` (hereinafter referred to as `the condominium`). The defendants were the developers of the condominium.On 6 January 1997, the temporary occupation permit (`TOP`) for the condominium was issued and the subsidiary proprietors of the subdivided building started paying contributions to the management fund set up by the defendants. The certificate of statutory completion was issued on 2 December 1997 and the plaintiffs were constituted on 20 April 1998; the plaintiffs held their first annual general meeting on 6 May 2000.In early January 2001, the plaintiffs and the defendants exchanged correspondence through their respective solicitors; on 11 January 2001, the plaintiffs` solicitors wrote to the defendants demanding documents pursuant to s 37(4) of the Land Titles (Strata) Act (Cap 158, 1999 Ed) (`the Act`). By a fax dated 22 January 2001, the defendants` solicitors replied asking for particulars of the documents required to be handed over and attached therewith a list of the documents the defendants had already handed over to the plaintiffs on 5 June 2000.On 7 February 2001, the plaintiffs` solicitors replied with a list of those documents which had not been handed over to the plaintiffs. Reminders were sent by the plaintiffs` solicitors on 12 March 2001 and 10 April 2001. By a fax dated 11 April 2001, the defendants` solicitors informed the plaintiffs` solicitors that their clients were arranging for the following documents to be transferred over to the plaintiffs:(1)Term contractors` servicing record/reports including correspondence:(a)Lift maintenance2 files(b)Security2 files(c)Cleaning1 file(d)Landscape1 file(e)Swimming pool2 files(f)Pest control1 file(g)Healthcare services1 file(h)Fire protection1 file(i)Security system1 file(j)Intercom system1 file(k)Air-con maintenance1 file(l)Refuse removal1 file(2)Correspondence between subsidiary proprietors/residents and MCST (1 file)(3)Correspondence between government agencies and MSCT (1 file)(4)Notices and circulars to residents (1 file)(5)Record of residents` card charges (1 file)(6)Record of complaints (1 file)On 23 April 2001, the plaintiffs` solicitors wrote to the defendants` solicitors requesting the documents which formed the subject matter of this originating summons; I will revert to the list of documents later. On 25 April 2001, the defendants` solicitors replied to inquire under what provision(s) of the law the defendants were required to produce such documents to the plaintiffs. The plaintiffs` solicitors replied on 19 June 2001 to say the request was made pursuant to ss 37 and 65 of the Act.On 22 June 2001, the defendants` solicitors replied stating that in their view ss 37 and 65 of the Act were not applicable and there was no explicit duty on the defendants` part to hand over the accounting records,priorto the formation of the plaintiffs. By their letter dated 10 July 2001, the plaintiffs` solicitors maintained that the defendants were trustees of the plaintiffs and referred to s 10(2) of the Buildings and Common Property (Maintenance and Management) Act (Cap 30, 2000 Ed) (`the Management Act`).On 12 July 2001, the defendants` solicitors wrote to the plaintiffs` solicitors stating that they were writing to the Commissioner of Buildings for clarification as to whether the defendants were obliged to hand over the accounting records. However, the unhelpful reply from the Commissioner of Buildings (dated 24 July 2001) was, that this was a matter of legal interpretation best left to the solicitors to advise their clients on. On 27 July 2001, the plaintiffs` solicitors wrote requiring  the defendants` solicitors to furnish the documents requested by 30 July 2001, failing which the plaintiffs would commence proceedings, as the matter had been pending since January.On 7 August 2001, the defendants` solicitors replied, stating that the defendants would, out of goodwill, allow the plaintiffs to inspect the accounting documents at their premises but that the documents could not be transferred over as the property in the documents remained vested in the defendants. This was not acceptable to the plaintiffs; hence, this originating summons was filed on 14 August 2001.",
        "The documents in question": "The documents requested in the plaintiffs` solicitors` letter of 23 April 2001 and in the originating summons are as follows:(1)Accounting documents(a)Payment vouchersTOP till May 1998(b)Journal vouchersTOP till March 1998(c)Cash bookTOP till April 1998(d)Cheque buttsTOP till 19 October 1999(e)Schedules (Notes of balance sheet)TOP till March 2000(f)Bank statements - Multi-linkTOP till October 1999(g)Bank statements - CurrentTOP till April 1998(h)Bank correspondenceTOP till June 2000(i)Financial statementsTOP till March 1998(j)Invoice/statementTOP till March 2000(k)Official receiptsTOP till May 1998(l)Accounts receivable - interest computationTOP till June 1999(m)Audit reports / Adjustment reportTOP till April 1998(n)Income tax fileTOP till Y/A 1997(o)Fixed deposits slip/statementsTOP till May 1998(p)Documents under ss 54 & 59 of the ActTOP till June 2000(q)Bank-in-slipsTOP till May 1998(2)Final defects listThe issueThe only issue in this case is whether the defendants were obliged, on a true interpretation of s 37(4) of the Act, to hand over to the plaintiffs the accounting documents as well as the final defects list.",
        "Preliminary objections": "Before I deal with s 37(4) of the Act, I need to address two (2) preliminary objections which the defendants raised. First, they referred to O 7 r 3(1) of the Rules of Court which states:Every originating summons must include a statement of the questions on which the plaintiff seeks the determination or direction of the Court or, as the case may be,a concise statement of the relief or remedy claimedin the proceedings begun by the originating summons withsufficient particulars to identify the cause or causes of actionin respect of which the plaintiff claims that relief or remedy. [Emphasis is counsel`s.]The defendants contended that the plaintiffs had failed to provide sufficient particulars with regard to the relief sought as the originating summons did not identify the specific documents, which were required of the defendants. Instead, they submitted, this originating summons only stated very vaguely and broadly the documents which the plaintiffs wanted and, on this ground alone, the application ought to be dismissed.I was unable to agree with this contention. In my view, the plaintiffs, in listing down the types of accounting documents which they required, had given sufficient particulars to identify thecause of actionin the originating summons. It would be most unreasonable to require the plaintiffs to further itemise every single specific document in the categories which they had listed, as the plaintiffs could not be expected to be able to identify specific documents which were not in their possession.The second objection which the defendants made was, that the application was premature. Sections 37(8) and 65(2) of the Act provide penal sanctions to be imposed if there was any contravention of ss 37(4) and 65(1) respectively. In this regard, s 39 of the Interpretation Act (Cap 1, 1999 Ed) states that:The imposition of a penalty by any written law, in the absence of express provision to the contrary, shall not relieve any person from liability to answer for damages to a person injured.The defendants submitted that s 39 on the Interpretation Act allows one to bring a civil action despite the imposition of a penaltyonlywhen there are damages. They further submitted that the plaintiffs neither suffered any damage nor alleged that they did. Hence, the plaintiffs had no right to bring an action under ss 37(4) and 65 of the Act and their application should accordingly be dismissed.In my view, s 39 of the Interpretation Act is merely a clarification provision which makes it clear that even when there is an imposition of penalty, civil recovery is not necessarily denied. However, it does not mean that only when there are damages, would one be allowed to bring a civil action. Section 37(4) of the Act imposes a duty on the proprietor of the land to hand over certain documents to the management corporation. In this case, the cause of action lies in requiring the delivery-up of documents which the plaintiffs believed to fall within the ambit of s 37(4). Section 39 of the Interpretation Act should not be used to limit the positive obligation found in s 37(4) of the Act to deliver up documents required by the management corporation; otherwise, the provision would be rendered otiose when it was meant for the party entitled to the documents, ie the management corporation to sue for the same. The plaintiffs need not show that damages have been suffered before they can bring this application.",
        "The law": "Having dealt with the preliminary objections, I will now turn to the law. Section 37(4) of the Act provides:The proprietor of the land comprised in a strata title plan shall deliver to the management corporation at its first annual general meeting -(a) all plans, specifications, certificates (other than certificates of title for the lots), diagrams and other documents obtained or received by him and relating to the parcel or building; and(b) if they are in his possession or under his control, any notices or other records relating to the subdivided building,other than any such documents which exclusively evidence rights or obligations of the proprietor and which are not capable of being used for the benefit of the management corporation or any of the subsidiary proprietors, other than the proprietor.One of the well-established rules of statutory interpretation is the rule of ejusdem generis. The defendants argued that because of the rule of ejusdem generis, the ambit of s 37(4) of the Act must be read subject to the preceding words `all plans, specifications, certificates (other than certificates of title for the lots), diagrams ... relating to the parcel or building ...`. The accounting documents which the plaintiffs requested did not fall within the section since they were not ejusdem generis with the aforementioned class of documents.Whether on a literal or purposive interpretation, I did not agree with the defendants that s 37(4) should be read such that accounting documents are excluded completely from its ambit.On a plain reading of s 37(4)(a) alone, it does seem that the phrase `other documents` should be read ejusdem generis with the class of documents mentioned in that paragraph. This does not, however, mean that theentires 37(4) is limited only to that class of documents. Sub-paragraph (b) thereof speaks of any noticesor other recordsrelating to the subdivided building. In my opinion, accounting documents, if they relate to the subdivided building and are in the possession or under the control of the proprietor of the land, could fall under the phrase `other records` under s 37(4)(b).On a purposive interpretation, it is hard to envisage that Parliament, in enacting the section, intended only for documents such as plans, certificates and diagrams and other documents ejusdem generis with this class of documents to be handed over to the management corporations. Under the Act, upon the formation of a management corporation, the same takes over control, management and administration of the common property as well as its records and accounts. In order to properly exercise its powers and perform its duties and functions, a management corporation would need to have possession of necessary records relating to the subdivided building, including accounting records.Therefore, it was my opinion that the accounting documents did fall within the purview of s 37(4)(b) of the Act. Hence, it was incumbent on the defendants to deliver up to the plaintiffs those records relating to the building unless the documents solely related to the rights or obligations of the defendants and, were  not capable of being used for the benefit of the plaintiffs or any of the subsidiary proprietors, other than the defendants themselves. It is noteworthy that when a management corporation is formed, the developer would gradually drop out of the picture, leaving the entire management of the subdivided building to the management corporation. However, upon issuance of the TOP and even before the formation of the management corporation, the subsidiary proprietors would have started paying monthly contributions to the developer. In such a context, it is important that there should be transparency and openness; the accounting documents requested would be useful in ensuring accountability on the part of the developer, of the monthly contributions collected, once TOP has been issued. I am further supported in my interpretation of s 37(4) of the Act by s 10(2) of the Management Act which states:A developer shall hold all moneys in the maintenance fund on trust for the owners and purchasers of all the flats in the development.As trustee of the maintenance fund, a developer would have to be accountable to the owners and purchasers of all the flats in a condominium for the moneys in the maintenance fund. As representative of the owners and purchasers of all the flats in the condominium, the properly constituted management corporation has a right to ensure such accountability on the part of the developer.The defendants submitted that s 10(2) of the Management Act has to be read as a whole with the rest of the section and, sub-s (5) thereof read with s 199(2) of the Companies Act (Cap 50, 1994 Ed) support their contention that they could not part with physical possession of the documents. Section 10(5) of the Management Act states:The developer shall -(a) cause proper books of accounts to be kept in respect of all sums of money received for and all payments out of the maintenance fund, specifying the matters in relation to which the receipts and expenditure take place;(b) appoint an auditor to audit the maintenance fund annually;(c) file with the Commissioner a certified true copy of the audited accounts within 28 days of the accounts being audited;(d) permit the Commissioner, or any person authorise by him to act on his behalf, at all reasonable times full and free access to accounting and other records of the maintenance fund and permit the Commissioner or the person to make copies or make extracts from those accounts or other records; and(e) furnish a certified true copy of the accounts to the Commissioner at such intervals as may be required by the Commissioner.The defendants had argued that there is nothing in the above section that says that the developer has to part with physical possession of the accounting documents. On the contrary, they remained accountable to the Commissioner and s 10(5)(d) requires the Commissioner to be given full and free access to the documents by the developer. If a developer does not allow the Commissioner to have access to the documents, they would be exposed to a penalty under s 10(6). This being the case, the defendants cannot then hand over the documents to the plaintiffs. The defendants argued that even the Commissioner, who is entitled to full and free access to the accounting documents, is only allowed to make copies or extracts from such documents.However, a plain reading of s 10(5) of the Management Act makes it patently clear that it does not impose any obligation on the developer to keep the accounts continually or exclusively. Section 10(5) merely requires the developer to have proper accounts in respect of the maintenance fund and to file the audited accounts with the Commissioner. The Commissioner is empowered under the section to verify the accounts. However, it is my view that the developer only remains accountable to the Commissioner for the period of which he (the developer) is in charge of the moneys in the maintenance fund; s 10(4) of the Management Act states:Where a management corporation for the development has been constituted in accordance with section 33 of the Land Titles (Strata) Act, the surplus moneys in the maintenance fund after payment of all the expenditure which may be properly charged to the maintenance fund shall be transferred to the management corporation.All the remaining moneys in the maintenance fund have to be transferred over to a management corporation upon its formation. Thenceforth, it would be the management corporation who would be managing the funds for the benefit of the subsidiary proprietors or residents of the condominium. It seems rather nonsensical to say that the developer has to continue to keep proper accounts of a fund of which he is no longer in control and that the Commissioner could verify such accounts. In the overall scheme of things, I am inclined to agree with the plaintiffs that s 10(5) of the Management Act imposes an obligation on the developer to prepare accounting records during the period of which he has control over the maintenance fund and, such accounting records are to be transferred over to the management corporation pursuant to s 37(4) of the Act, at the first annual general meeting after its formation.I turn now to s 199 of the Companies Act, which requires a company, its directors and managers to keep accounting and other records; s 199(2) provides:The company shall retain the records referred to in subsection (1) for 7 years after completion of the transactions or operations to which they respectively relate.such records to be kept at the registered office of the company or such other place as the directors think fit.The defendants submitted that since the TOP for the condominium was issued on 6 January 1997, the seven-year period would only end on 7 January 2004. I do not think that s 199 of the Companies Act is applicable in this instance. Section 199 requires companies to keep accounting records ofthe companies` transactions and operationsfor seven years. In this case, the plaintiffs are not asking for the accounting documents which belong solely to the defendants, showing the internal accounts of the company and which are only of use to the defendants themselves. Rather, they want accounting records whichpertainedto moneys collected by the developer from the subsidiary proprietors since the TOP date. The moneys collected could/should only be used solely and exclusively for maintaining, cleaning, repairing and insuring the common property, which duties have since been taken over by the management corporation. Section 37(4) of the Act, being a specific provision governing the handing over of certain documents by the developer to the management corporation to enable it to take over the  management duties, overrides the general provision in s 199 of the Companies Act.Before I deal with the accounting documents and the final defects list in greater detail, I should add that it was brought to my attention by the plaintiffs that certain documents (after the TOP date) relating to the condominium, which ought to have been were not, disclosed by the defendants. These documents related to the following very substantial expenses:(a)Contract on cleaning services:$93,252(b)Contract on security:$154,758(c)Water and electricity bills:$90,548(d)Contract on management fees:$44,193(e)Contract on staff costs:$53,989(f)Printing/stationery and postages:$9,470I ordered the documents relating to the above items to be disclosed by the defendants.",
        "The accounting documents": "My orders with respect to the list of accounting documents enumerated in [para ]9 above are as follows:",
        "A.ITEMS (A), (B), (C), (J), (K), (L), (O) AND (Q)": "The above items were to be disclosed and handed over by the defendants to the plaintiffs. Save for (o), delivery-up was restricted to the period after TOP (6 January 1997). This was because the maintenance fund was only established and moneys collected from the subsidiary proprietors/residents, after the TOP was issued. Item (c) was to be handed over as soft copies/printouts as the defendants only had computerised records of the cash book, which were compiled from other financial documents such as bank statements. Item (o) was restricted to photocopies since the original fixed deposit slips are required by the defendants for purposes of withdrawal and or renewal of the fixed deposits.",
        "B.ITEM (D)": "This item did not need to be disclosed because the defendants no longer had possession of the cheque butts which were discarded after the accounts were audited.",
        "C.ITEMS (E), (M) AND (P)": "Items (e) and (m) had already been disclosed by the defendants in exh SLH-4 of the affidavit of Soh Lian Heng. Item (p) consisted of documents under ss 54 and 59 of the Act which had already been handed over to the plaintiffs.",
        "D.ITEMS (F), (G), (H), (I) AND (N)": "These were not required to be disclosed because they either did not exist or were consolidated with the company`s other accounts such that the plaintiffs did not have a right to the documents.",
        "E.FINAL DEFECTS LIST": "This item clearly did not fall within the ambit of s 37(4) of the Act. The defects list issued by the architect under the building contract is a document which exclusively evidences the rights of the defendants under the building contract between the contractor and the defendants. In any case, the defendants had disclosed a copy of the maintenance certificate issued by the architect dated 24 March 2000, confirming that all apparent defects and outstanding works in the condominium had been made good to the satisfaction of the architect.Outcome:Order accordingly.Copyright © Government of Singapore."
    }
}