{
    "case_title": "Wong Kwei Cheong v ABN-AMRO Bank NV",
    "ncitation": "[2002] SGHC 111",
    "coram": "S Rajendran J",
    "sections": {
        "Service of Statutory Demand": "8.    As referred to earlier, the Statutory Demand in this case was not\n\nserved personally on Wong. Instead, notice of the Statutory Demand was advertised in the\n\nStraits Times. The question that arose was whether such advertisement was good service of\n\nthe Statutory Demand and, if not, whether the Statutory Demand ought to be set aside on\n\nthat ground.9.    One Basiruddin, a clerk employed by M/s Rajah & Tann, had\n\ntestified on behalf of the Bank that he made three attempts to serve the Statutory Demand\n\non Wong at the last place of residence of Wong known to the Bank, namely, No.16A Dunlop\n\nStreet, Singapore 209345. On all three occasions Basiruddin had found the premises locked.\n\nA property search conducted by M/s Rajah & Tann indicated that the registered\n\nowner of No.16A Dunlop Street was a company known as Yilin Investments Pte Ltd. In view of\n\nthe fact that Wong was not shown to be the registered owner of No.16A Dunlop Street,\n\nBasiruddin did not either post the Statutory Demand on the door of No.16A Dunlop Street as\n\nenvisaged in r 96(4)(a) or forward the Statutory Demand by prepaid post to that address as\n\nenvisaged by r 96(4)(b) of the Bankruptcy Rules. Basiruddin testified that\n\nsubsequently he tried, unsuccessfully, to effect service of the Statutory Demand on three\n\nother occasions at three other possible addresses of Wong.10.    Mr Chua Eu Jin, who appeared for the Bank, submitted that these\n\nattempts by Basiruddin to effect personal service of the Statutory Demand on Wong were a\n\nsufficient compliance by the Bank of its obligations (under r 96(1) and (2) of the\n\nBankruptcy Rules) to take all reasonable steps to bring the Statutory Demand to\n\nWong’s attention and to take all reasonable steps to effect personal service of the\n\nStatutory Demand. Mr Chua submitted that as personal service could not be effected after\n\nso many attempts, the Bank was \"entitled\" to effect substituted service and the\n\nBank \"elected\" to advertise a notice of the Statutory Demand in the Straits\n\nTimes of 23 July 2001.11.    Mr Chua, in making that submission, appears to have overlooked\n\nthe requirements of r 96(4) which provides:\"(4). Substituted service under paragraph (3) may be effected in\n\n  the following manner:(a) by posting the statutory demand at the door or some other\n\n  conspicuous part of thelast known place of residenceor business of the debtor or\n\n  both;(b) by forwarding the statutory demand to the debtor by prepaid\n\n  registered post tothe last known place of residence, business or employment of the\n\n  debtor;(c) where the creditor is unable to effect substituted service in\n\n  accordance with sub-paragraph (a) or (b)by reason that he has no knowledge of the last\n\n  known place of residence, business or employment of the debtor, by advertisement of\n\n  the statutory demand in one or more local newspapers, in which case the time limited for\n\n  compliance with the demand shall run from the date of the publication of the\n\n  advertisement; or(d) such other mode which the court would have ordered in an\n\n  application for substituted service of a petition in the circumstances.\"(Emphasis added.)It is apparent from r 96(4)(c) that the creditor may advertise the\n\nStatutory Demand only where, by reason of his not knowing the last place of residence,\n\nbusiness or employment of the debtor, he is unable to effect substituted service in\n\naccordance with sub-paragraphs (a) and (b) of r 96(4).12.    It is clear from the notice of demand advertised in the Straits\n\nTimes and from the evidence of Basiruddin that the Bank knew the last known place of\n\nresidence of Wong to be No.16A Dunlop Street. As the last known place of residence was\n\nknown to the Bank, the Bank should have effected substituted service under r 96(4)(a)\n\nand/or (b). This the Bank failed to do. On a plain reading of r 96(4)(c), the Bank would\n\nhave the option of advertising the Statutory Demand under r 96(4)(c) only if the Bank\n\nhad no knowledge of the last known place of residence, business or employment of Wong. The\n\nBank did not therefore have the option under r 96(4)(c) to effect substituted service by\n\nadvertising the Statutory Demand in the newspapers. I therefore found that service of the\n\nStatutory Demand on Wong had not been effected in accordance with the requirements of r 96\n\nof the Bankruptcy Rules.13.    In this context, I would note that the fact that Wong was not the\n\nregistered owner of the premises was not in any way indicative that Wong was not resident\n\nat the premises. The company that owned the premises may have belonged to Wong, or even if\n\nit did not, Wong could be residing at the premises by leave and licence of that\n\ncompany or of a tenant of those premises. In any event, even if Wong was in fact no\n\nlonger residing at that address, it would not detract from the fact that that was the last\n\nknown place of residence of Wong insofar as the Bank was concerned.14.    The Bank was, under r 96(1) the Bankruptcy Rules, obliged to take\n\nreasonable steps to bring the Statutory Demand to the attention of Wong. Mr Lim pointed\n\nout that one of the more obvious things that the Bank could have done to comply with that\n\nrequirement was to notify Wong’s solicitors (M/s Wee Tay & Lim) of the Statutory\n\nDemand and enquire whether they would accept service on behalf of Wong. The Bank, Mr Lim\n\nsubmitted, was at that time fully aware that M/s Wee Tay & Lim were acting for Wong\n\n– there had even been meetings between the Bank and M/s Wee Tay & Lim – but\n\ndespite this close contact, neither the Bank nor the Bank’s solicitors had attempted\n\nto contact M/s Wee Tay & Lim before advertising the Statutory Demand. Mr Lim\n\nsubmitted that by advertising the Notice of Statutory Demand without (a) informing\n\nM/s Wee Tay & Lim of the Statutory Demand; and (b) complying with\n\nr 96(4)(c) of the Bankruptcy Rules, the Bank had abused the process of the court.\n\nThere was merit in these submissions of Mr Lim. As the Bank knew that M/s Wee Tay &\n\nLim were acting for Wong, one would have expected the Bank to try to communicate the\n\nStatutory Demand to Wong through M/s Wee Tay & Lim.15.    Even assuming that the Bank was justified in effecting\n\nsubstituted service by way of advertisement, what r 96(4)(c) required the Bank to do was\n\nadvertise the Statutory Demand in the newspapers. The Bank did not do that. What the\n\nBank did was advertise a notice of that Statutory Demand. Mr Chua submitted that the Bank\n\ndid not advertise the Statutory Demand because to do so would be considerably more\n\nexpensive than advertising a notice of that Demand. That may well be so but if a creditor\n\nwants to take advantage of the provisions in the Bankruptcy Rules relating to substituted\n\nservices, that creditor would have to comply with the procedures specified. The Rules did\n\nnot authorise the creditor to vary the procedure laid down on the grounds of costs or on\n\nany other grounds. In this case the Bank, by advertising a notice of the Statutory Demand\n\nand not the Statutory Demand itself, had not complied with r 96(4)(c) of the\n\nBankruptcy Rules.16.    The effect of non-compliance with the requirements of r 96\n\nrelating to the service of statutory demands is specifically dealt with in r 108(6)\n\nof the Bankruptcy Rules which reads:\"The courtshall dismiss the petitionif it is not\n\n  satisfied that the creditor has discharged the obligations imposed on himby rule 96.\"(Emphasis added.)The same mandatory direction is again reflected in r 127(c) which\n\nprovides:\"The courtshall dismiss a creditor’s petitionwhere\n\n  –…(c) in a case where the petition is based on a statutory demand, the petitioning creditorhas\n\n  not discharged the obligations imposed on him by rule 96.\"(Emphasis added.)Mr Lim submitted that, in the light of the clear directions in rr\n\n108(6) and 127(c), the court acting under r 98(2)(e) of the Bankruptcy Rules ought to set\n\naside the Statutory Demand. Rule 98(2)(e) provides:\"(2) The court shall set aside the statutory demand if –(e) the court is satisfied, on other grounds, that the demand ought to\n\n    be set aside.\"There was merit in that submission. If the Bankruptcy Rules direct that\n\napetitionfor bankruptcy founded on a Statutory Demand ought to be set aside if\n\nthat Statutory Demand has not been served in compliance with r 96, then an\n\napplication that such a Statutory Demand should be set aside should,a fortiori, be\n\ngranted.17.    Mr Chua, however, drew the attention of the court to\n\ns 158(1) of the Bankruptcy Act which provides:\"No proceedings in bankruptcy shall be invalidated by anyformal\n\n  defect or by any irregularity, unless the court before which an objection is made to\n\n  the proceedings is of the opinion that substantial injustice has been caused by the defect\n\n  or irregularity and that the injustice cannot be remedied by any order of that\n\n  court.\"(Emphasis added.)Mr Chua submitted that non-compliance with the service requirements in\n\nr 96 was a formal defect or an irregularity and as there was no evidence before the court\n\nof any injustice to Wong as a result of such defect/irregularity, the court ought not to\n\nset aside the Statutory Demand.18.    The language of rr 108(6) and 127(c) of the Bankruptcy Rules\n\n– that the court shall dismiss the petition if r 96 was not complied with – is\n\nquite unequivocal. Such peremptory language in the Bankruptcy Rules was, in my view, clear\n\nindication that the intention behind the Rules was to make compliance of the rules\n\nrelating to service mandatory. In that context, for the court to treat non-compliance with\n\nr 96 as an irregularity or a formal defect that can be cured under s 158(1) of the\n\nBankruptcy Act would be to negate the peremptory nature of the rr 108(6) and 127(c).\n\nI agree with the submission of Mr Lim that were the court to take such a view, parties\n\nmight be encouraged not to comply with mandatory provisions in the Bankruptcy Rules and\n\nthen hide under the umbrella of s 158(1) should their non-compliance be later discovered.19.    The failure on the part of a debtor to comply with the terms of a\n\nStatutory Demand gives rise to a statutory presumption under s 62 of the Bankruptcy Act\n\nthat the debtor is unable to pay his debt. However, one of the conditions that must be\n\nsatisfied before such a presumption arises is that the Statutory Demand should have been\n\nserved on the debtor \"in the prescribed manner\". It would be useful to set out\n\nthe material portion of s 62:\"62. For the purposes of a creditor’s petition, a debtor\n\n  shall, until he proves to the contrary,be presumed to be unable to pay any debt within\n\n  the meaning of section 61(1)(c) if the debt is immediately payable and–(a) (i) the petitioning creditor to whom the debt is owned hasserved\n\n  on him in the prescribed manner, a statutory demand.\"(Emphasis added.)The \"prescribed manner\" in which Statutory Demands are to be\n\nserved is r 96 of the Bankruptcy Rules.20.    As the Statutory Demand in this case was not served in accordance\n\nwith the manner prescribed in r 96, the statutory presumption in s 62 cannot arise. The\n\nproper service of a Statutory Demand is therefore a matter of fundamental importance in\n\nthe operation of the Bankruptcy Act. To cure a defect in the service of a Statutory Demand\n\nby recourse to s 158(1) of the Bankruptcy Act would, in my view, amount to a re-writing of\n\ns 62(a)(i) of the Bankruptcy Act. I do not think s 158(1) was intended to have such\n\nfar-reaching consequences. In any event, such a re-writing of s 62(a)(i) would cause\n\nsubstantial injustice to Wong. The procedural defect in the service of the Statutory\n\nDemand on Wong was therefore a matter that could not be cured under s 158(1) of the\n\nBankruptcy Act. The Statutory Demand in this case had, accordingly, to be set aside.21.    For the above reasons, I dismissed with costs the Bank’s\n\nappeal against the orders made by the AR.Sgd:S. RAJENDRANJudgeCopyright © Government of Singapore."
    }
}