{
    "case_title": "Fortune Realty Pte Ltd v Lim Sai Kang and Another",
    "ncitation": "[2002] SGHC 59",
    "coram": "Judith Prakash J",
    "sections": {
        "The facts": "3. By an agreement dated 7 July 1997, the vendors agreed to sell and\n\nthe purchasers agreed to purchase unit 33 at the price of $967,300. The sale and purchase\n\nagreement was in the standard form approved by the Controller of Housing since the\n\ndevelopment was still under construction at that time. The relevant provisions of the\n\nagreement are as follows:‘1 The Vendor shall sell and the Purchaser shall purchase free\n\n  from encumbrances all that estate in fee simple in part of the land comprising the\n\n  townhouse described in the First Schedule (hereinafter referred to as the building unit)\n\n  in the housing project now being erected or erected by the Vendor upon the land described\n\n  in the First Schedule and known as FORTUNE VIEW (hereinafter called the housing\n\n  project)……8(1) The Vendor shall forthwith erect in a good and workmanlike manner\n\n  the building unit and the housing project together with all the common property thereof in\n\n  accordance with the specifications described in the Second Schedule and in accordance with\n\n  the plans approved by the Building Authority and other authorities, which specifications\n\n  and plans have been accepted and approved by the Purchaser as the Purchaser hereby\n\n  acknowledges.…19 (1) No error or mis-statement as to the description of the area of\n\n  the building unit shall annul the sale or entitle the Purchaser to be discharged from the\n\n  purchase.(2) Any error or mis-statement as to the description of the area of the\n\n  building unit shall give the Purchaser an entitlement to an adjustment of the purchase\n\n  price in accordance with this clause.(3) If on completion of resurvey by the Government it is found that the\n\n  area of the building unit ascertained by the resurvey is less than the area mentioned in\n\n  the First Schedule (\"the scheduled area\"), there shall be an adjustment of the\n\n  purchase price for the difference (if any) in excess of 3% of the scheduled area\n\n  calculated at the rate the Purchaser paid for each square metre of the building unit.…THE FIRST SCHEDULE ABOVE REFERRED TOALL THAT townhouse on the - Storey of the building known as – in\n\n  the housing project known asFORTUNE VIEWnow being erected or erected on part of\n\n  the land in the District of Toa Payoh in the Republic of Singapore estimated to contain a\n\n  floor area of150square metres being part of the Government Resurvey Lot\n\n  No. 497-68 of Mukim 17 which said townhouse is provisionally known asNo. 33\n\n  Sommerville Walk, Fortune View Singapore 358198…DESCRIPTION OF HOUSING PROJECT(a) General description: 12 units of 2 storey Townhouse\n\n  with Attic and Basement Car Park.…(e) Description of common property:Barbecue PitsChildren’s PlaygroundWater FountainGuard House(f) Description of parking spaces: Basement Car Park.’4. Attached to the agreement were four plans relating to the\n\ndevelopment made up of the first storey plan, the second storey plan, the attic storey\n\nplan and a site plan. On each of the storey plans, the boundaries of Unit 33 as it would\n\nexist on that storey were hatched in red. Although a plan to the basement existed, that\n\nplan was not attached to the agreement. The accessory lot MK17-A13C therefore was not\n\nshown on any of the annexed plans.5. It should be noted that the plans attached to the agreement were\n\ncopies of sections of four of the plans making up the full set of building plans that had\n\nbeen submitted by the purchasers to the Chief Planner for approval pursuant to the\n\nBuilding Control Act 1989. The full set comprised nine individual plans each dated January\n\n1996. These were the plans approved by the Chief Planner and therefore the plans which had\n\nto be followed in the construction of the development. The nine individual plans bore the\n\nfollowing titles: Site and Location Plan, Basement Floor Plan, 1stStorey Plan,\n\n2ndStorey Plan, Attic Floor Plan Section 1-1, Roof Plan, Elevations 1 and 2,\n\nElevations 3 and 4 Section D-D, Section A-A, B-B and C-C. On the right hand side of each\n\nof the plans, there was a description of the project. This originally read:‘Proposed erection of 12 units of 2-storey townhouses, each with\n\n  an attic and basement car park on Lot 49768 Mk 17 at No 33 Sommerville Walk.’The basement plan showed a lot marked as ‘Private Car Park’\n\nlocated next to the MEH Room but there was no indication that this lot was intended to\n\nbecome an accessory lot for unit 33. It should also be noted that subsequently the\n\napproved plans were amended and thereafter the endorsement at the side of the plans was\n\nchanged to read:‘Proposed erection of 11 units of 2-storey townhouses, each with\n\n  an attic and basement car park and 1 unit of 2 storey townhouse with an attic on Lot 49768\n\n  Mk 17 at No 33 Sommerville Walk.’6. The development was duly completed and possession of unit 33 was\n\ntaken by the purchasers. In June 2000, the vendors’ solicitors informed the\n\npurchasers’ solicitors that the duplicate SSCT in respect of Unit 33 had been issued\n\nand gave the purchasers 14 days notice to complete the purchase. Forwarded under cover of\n\nthat letter was a photocopy of the SSCT.7. Three days later, the purchasers’ solicitors wrote back and\n\nstated that there was a shortfall of 12 square metres or eight percent in the floor area\n\nof Unit 33. Since under clause 19(3) of the agreement, there is to be an adjustment of the\n\npurchase price for a difference in area in the building unit in excess of three percent,\n\nit was claimed that the vendors were liable for the shortfall in area. The\n\npurchaser’s solicitors calculated the amount payable for the shortfall by multiplying\n\nthe rate of $6,448.67 per square metre by 7.5 square metres (5%) and obtained the sum of\n\n$48,365.02. Taking into account the final payment due from the purchasers of $19,346, the\n\ntotal amount payable by the vendors for the shortfall in area was $29,019.02.8. The vendors’ response was to say that there was no shortfall in\n\narea and that the difference of 12 square metres between the 138 square metre area of the\n\ntownhouse unit as surveyed and the 150 square metre area mentioned in the first schedule\n\nof the agreement was taken up by the area of the car park lot. The purchasers did not\n\naccept this reply. Their stand was that it was not provided in the agreement that the\n\nestimated floor area of 150 square metres of Unit 33 was to be inclusive of the car park\n\nlot. They maintained that there had been a shortfall in the area and that they were\n\nentitled to an abatement in the purchase price of Unit 33 as provided for in the\n\nagreement. Battle was joined.",
        "Description of the development": "9. Before I go on to discuss the arguments, a description of the\n\ndevelopment might be helpful. The development contains 12 townhouse units and stands two\n\nand a half storeys above the ground, the half storey containing the attics of this unit.\n\nIt also has a basement which contains 11 family rooms, 12 car park lots, a management\n\noffice and a mechanical room. Ten of the townhouses are essentially three and a half\n\nstorey units, two and a half storeys being above ground level and the third storey being a\n\nbasement storey which contains a family room and a private car park lot. The owners of\n\nthese units have access to their respective car park lots directly from their units via\n\ntheir family rooms. The owners of these units have each been issued with a subsidiary\n\nstrata certificate of title which contains only one lot. This is because the lot\n\nincorporates the space used for the car park since that space is contained within the same\n\nvertical column that comprises the family room, first storey, second storey and attic of\n\neach such townhouse.10. At my request, a copy of the sale and purchase agreement for one of\n\nthe three and a half storey townhouses was adduced in evidence. This agreement was made in\n\nrespect of the unit known as No. 53 Sommerville Walk, Fortune View, Singapore. Attached to\n\nthat agreement were extracts from five of the building plans in respect of the development\n\nnamely the Site Plan, the Basement Storey Plan, The 1stStorey Plan, The 2ndStorey Plan and the Attic Storey Plan. Although the copy of the agreement that was adduced\n\ndid not contain any red hatching, it did appear from this copy that in the original, the\n\nboundaries of unit 53 were delineated in each of the storey plans including the Basement\n\nStorey Plan. As far as this last plan was concerned, the rectangular lot so delineated in\n\nthe basement was clearly divided into a family room, a staircase and a private car park,\n\nall with interconnecting doors.11. The eleventh unit is also a three and a half storey structure with\n\na family room in the basement. Its car park lot is not, however, immediately adjacent to\n\nthe family room but slightly outside it. Access to the car park lot can still be had\n\nthrough the family room. The owner of the unit steps through a door from the family room\n\ninto the basement and then walks a few steps to his car park lot. The subsidiary strata\n\ncertificate of title held by this owner is similar to the SSCT in that it contains two\n\nlots viz the main lot for the living area and an accessory lot representing the car park\n\nlot.12. The twelfth unit, that belonging to the purchasers, does not have a\n\nbasement family room and there is no car park lot directly under the unit. To get access\n\nto their car, the purchasers have to walk down into the basement from outside their\n\ntownhouse and to the lot which is situated a short distance away from the entry to the\n\nbasement.13. It should also be noted that, according to the purchasers, when\n\nthey first viewed the site of the development and the sale documents with a view to\n\npurchasing a unit they specifically chose unit 33. This was because they did not want a\n\nunit with a basement and unit 33 was the only unit without a basement. They were, however,\n\nconcerned that they should nevertheless have some parking space and although they were\n\nreassured by the agent that there would be a car park lot for the property, when the\n\noption to purchase was issued, Mr Lim made sure that the remark ‘One basement parking\n\nlot entitled for unit no. 33 Sommerville Walk’ was written on to the option before it\n\nwas signed by the vendors.",
        "The arguments": "14. The vendors contended that there was no shortfall in the area of\n\nthe property. They said that they had been obliged to deliver a unit which\n\n‘contain[ed] a floor area of 150 square metres’ pursuant to the description of\n\nthe property in the first schedule of the sale and purchase agreement and that they had\n\nmore than complied with this requirement in that the area of the two lots contained in the\n\nSSCT in fact totalled 151 square metres.15. In the vendors’ view, resolution of the issue before the court\n\ndepended upon the interpretation of the words ‘floor area’. They pointed out\n\nthat there was no reported case giving a definition of that term but asserted that the\n\n‘Guidelines for Filing of Schedule of Strata Units’ issued by the Commissioner\n\nof Buildings suggested that ‘floor area’ is equivalent to ‘title\n\narea’. Clause 1.5 of these Guidelines states:‘Floor area in connection with share value allotments shall mean\n\n  the Title Area excluding void(sic)’.The term ‘Title Area’ is not defined in the Guidelines but\n\ncounsel contended that it was obvious that this term meant the total area shown in a\n\nsubsidiary strata certificate of title which, in the case where that title encompassed\n\nboth a lot and an accessory lot, would mean the aggregate area of both lots.16. These Guidelines also deal with accessory lots. Clause 7 states\n\nthat an accessory lot should not be allotted any share value and that strata lots with\n\naccessory lots shall be so indicated in the schedule filed with the Commissioner of\n\nBuildings. The vendors produced the schedule of strata units which they had filed with the\n\nCommissioner of Buildings in respect of the development and pointed out that it did\n\nindicate that in respect of unit 33 there was both a main lot and an accessory lot.17. The vendors emphasised that the SSCT for unit 33 indicated that the\n\narea of the primary lot was 138 square metres and that of the accessory lot was 13 square\n\nmetres. They pointed out that under the Land Titles (Strata) Act (Cap 158), neither an\n\naccessory lot nor any right, share or interest therein can be dealt with independently of\n\nthe lot to which it is made appurtenant (see s 15(1)). Since the accessory lot cannot be\n\ndealt with independently, they argued that the title area of unit 33 must include the area\n\nof the car park lot, giving a total floor area of 151 square metres. Unit 33 was\n\nconstructed in accordance with plans approved by the competent authorities and under\n\nclause 8 of the sale agreement the purchasers had accepted and approved such plans and\n\nwere therefore bound by the same. There would be an unfair result if the purchasers were\n\nallowed to claim an abatement of the price because this would mean that, effectively, they\n\nwould be obtaining the accessory lot for free.18. The purchasers argued that the relevant time to consider the\n\nshortfall was when the contract to purchase unit 33 was made that is in June 1997 when the\n\noption to purchase was issued by the vendors and accepted by the purchasers. At that time,\n\nthere were three important documents: the brochure, the price list and the option to\n\npurchase. No show unit was then available for inspection and the purchasers had to rely on\n\nthese documents to know what they would be buying. From the documents, they formed the\n\nview that out of the 12 townhouse units in the project, 11 had private car park lots and\n\nthe twelfth, unit 33, had no private car park lot. Also, it did not have a basement room\n\nas it was perched on top of the driveway into the basement.19. The purchasers maintained that when they saw the brochure, they\n\nknew the design of the units on sale and that only one of these did not have a basement\n\nand did not have a private car park lot. When they purchased unit 33, they knew that the\n\nother units had basement car park lots. The purchasers chose unit 33 because they did not\n\nwant a basement and were aware therefore that they would not obtain a family room with an\n\nattached car park. The purchasers were assured that there would be a place for them to\n\npark their car in. Since they knew, however, that unit 33 did not come with its own\n\nprivate car park lot, they insisted on the statement that they were entitled to a car park\n\nbeing written into the option form.20. The purchasers argued that they did not get what they had\n\ncontracted to purchase – they had contracted to purchase a townhouse with two and a\n\nhalf storeys and having a total area of 150 square metres. They did not get this. Instead,\n\nthey got a townhouse with an area of 138 square metres and an accessory lot. They referred\n\nto clause 19 of the agreement and the phrase ‘area of the building unit’ found\n\nin that clause. Their contention was that that term meant the area described in the first\n\nschedule which stated a floor area of 150 square metres. Further, attached to the\n\nagreement was a plan with the unit to be purchased demarcated in red. The car park lot was\n\nnot demarcated in this plan as part and parcel of unit 33 purchased pursuant to the\n\nagreement. Since even the plans attached to the sale and purchase agreement did not\n\ninclude the car park lot as being part of unit 33, there was, in June 1997, no single\n\ndocument that came from the vendors that showed that unit 33 would have a parking lot as\n\npart of its title area. They purchasers had been short-changed and were entitled to a\n\nrebate.",
        "The decision": "21. I have two preliminary comments. First, the events of June 1997 are\n\nonly of marginal relevance to the issue. What the purchasers saw then, what brochures were\n\ngiven to them as part of the sale process and what their intentions were in choosing unit\n\n33, cannot dictate the decision. What I am called upon to do here is to determine whether\n\nthe purchasers have been given what they contracted to buy under the agreement. If they\n\nhave any claim against the vendors arising out of misrepresentation or collateral contract\n\nor any other basis, that will have to be aired in separate proceedings. My task here must\n\nbe bounded by the terms of the parties’ contract and that means that I have to\n\nconstrue the agreement and the agreement only. This leads to the second preliminary\n\ncomment ie that the ‘Guidelines for Filing of Schedule of Strata Units’ cannot\n\nbe resorted to for an understanding of the agreement. The Guidelines were not referred to\n\nin the agreement and there is no reason, legal or factual, to connect the contents of one\n\ndocument to the other.22. The purchasers rely on clause 19(2) of the agreement which entitles\n\nthem to an adjustment of the purchase price if there is an error or mis-statement as to\n\n‘the description of the area of the building unit’. The question is then what is\n\nmeant by ‘the building unit’. To determine this, we have to look first at clause\n\n1 which sets out what the vendors were selling and what the purchasers were buying.23. By clause 1, the vendors undertook to sell and the purchasers\n\nundertook to purchase that ‘part of the land comprising the townhouse described in\n\nthe First Schedule (hereinafter referred to as the building unit) in the housing project\n\nnow being erected … upon the land described in the First Schedule and known as\n\nFORTUNE VIEW’. At this stage therefore, the term ‘building unit’ refers to\n\nthe following: (1) a townhouse that is (2) described in the First Schedule and (3) is part\n\nof a housing project called Fortune View being erected upon land described in the First\n\nSchedule. Taking these elements in turn, what do they tell us about what is being sold?\n\nThe first element of the definition, the term ‘townhouse’ does not, as far as I\n\nam aware, bear any specific legal meaning so as to indicate to a purchaser any specific\n\nfacilities that he would obtain when purchasing any such unit. The only thing the\n\npurchaser would be sure of would be that what was being offered for sale was a residence\n\nrather than a commercial building. The third element simply identifies the location of the\n\nproperty sold ie that it is within the housing project called Fortune View. It is the\n\nsecond element which directs us to the First Schedule in order to identify more precisely\n\nwhat the building unit comprises.24. The First Schedule is set out in full in 3 above. It does not use\n\nthe phrase ‘the building unit’ but refers to the property as the\n\n‘townhouse’. It contains three pieces of information about the townhouse sold,\n\nto wit the geographical/surveyed location of Fortune View within Singapore, secondly, the\n\nestimated floor area of the townhouse ie 150 square metres and, thirdly, the provisional\n\naddress of the unit. The estimated floor area is hardly helpful in ascertaining exactly\n\nwhat has been purchased as it gives an aggregate area only without any elaboration of what\n\nrooms or areas within the housing project make up those 150 square metres. The third piece\n\nof information, the provisional address, does not give us this information either.25. One has therefore to look into the other clauses of the agreement\n\nto see if they hold any clue as to the design of the building unit and how the area of 150\n\nsquare metres is arrived at. In this respect, the only clause that gives some indication\n\nas to what comprises the building unit is clause 8(1) which imposes an obligation on the\n\nvendors to erect the building unit and the housing project and all the common property in\n\naccordance with the specifications described in the Second Schedule and in accordance with\n\nthe plans approved by the Building Authority. The Second Schedule contains some details on\n\nthe physical structure of the project and the building unit but it does not state how many\n\nrooms the building unit has nor what the area of each room is. The only clue one gets is\n\nfrom the general description of the housing project which is ‘12 units of 2-storey\n\nTownhouse with Attic and basement Car Park’. It is not clear from this description,\n\nhowever, whether the term ‘basement car park’ refers to a basement in the\n\nhousing project where cars can be parked or whether it refers to an individual car park\n\nlot for each unit.26. The other document to which the reader is referred by clause 8(1)\n\nis the set of approved plans for the project and the building unit. As mentioned in 4\n\nabove, only four out of the nine plans were attached to the agreement. On three of these,\n\nthe first storey, the second storey plan and the attic floor plan, the boundaries of unit\n\n33 as it would exist on that storey were hatched in red. The fourth plan, the site plan,\n\ncontained no hatching and could not have done so as it did not indicate the individual\n\nunits. The basement floor plan was not attached. If it had been attached, the area of the\n\ncar park lot intended for unit 33 could have also been hatched. Whilst the plans attached\n\nwere not specifically referred to in either clause 1 or the First Schedule which purported\n\nto be the sections of the agreement describing the property bought and sold, I think it is\n\nlegitimate to refer to those plans to amplify the description given in those sections\n\nsince, as I have noted, those descriptions are of little help in determining what is\n\nintended to constitute the 150 square metre area of the building unit.27. If one looks at the copies of the plans annexed to the agreement\n\nalone, one would have to conclude that unit 33 comprised a first floor, a second floor and\n\nan attic only. There is no indication on those plans that a car park lot was to be part of\n\nunit 33. Even the full set of plans submitted to the Chief Planner in 1996 does not\n\nexpressly indicate that a car park lot was supposed to be part of unit 33. Additionally as\n\nnoted above, the amended description of the project on that full set distinguishes between\n\nthe 11 townhouses which each have an attic and a basement car park and the one unit which\n\nhas only an attic and which is called ‘No. 33 Sommerville Walk’. That would\n\nappear to be a clear reference to unit 33. So, even if the purchasers had gone to look at\n\nthe plans in the Chief Planner’s office they would not have realised that the private\n\ncar park lot next to the mechanical room was intended to be part of the property being\n\nsold to them.28. Whilst the documents preceding the sale and purchase agreement are,\n\nstrictly, irrelevant to the task of construing the agreement, the option does assist me in\n\nmy understanding of what the purchasers believed they were buying when they exercised it\n\nand committed themselves to enter the agreement. The description of the property in the\n\noption was simply ‘Townhouse (A3 Type) (2 Storey) (with attic) (marked) in the sale\n\nbrochure as Townhouse No. 33’. This description conformed to the description in the\n\napproved plans and did not indicate that there was to be a car park lot as part of the\n\ntownhouse. The very fact that the purchasers felt it necessary to ask the vendors to write\n\nthe remark ‘One basement parking lot entitled for unit no. 33 Sommerville Walk’\n\ninto the option shows that they did not know that the car park lot was an integral part of\n\nthe townhouse that they were buying. By that remark they wanted the reassurance that there\n\nwould be a space within the basement for their car.29. Although the agreement was in the standard form prescribed by the\n\nHousing Developers Rules, this standard form does not prescribe how the property being\n\nsold is to be described in the First Schedule or what specifications have to be included\n\nin the Second Schedule. The manner of description is entirely up to the developers/vendors\n\nand their solicitors. In this case, the description of unit 33 could very well have\n\nspecified that it comprised a 2-storey townhouse with an attic and also embodied a car\n\npark lot in the basement. Not only was no such description given but the plans annexed to\n\nthe agreement gave no indication whatsoever that the car park lot would be part of unit\n\n33. The purchasers were not the drafters of the agreement and had no control over the\n\nlanguage used or the description given or the plans annexed to the agreement. In this\n\nsituation, thecontra profiterendumrule must apply so that any ambiguity in the\n\ndescription is resolved in favour of the purchasers.",
        "Conclusion": "30. For the reasons given above, I have come to the conclusion that\n\nwhen the vendors contracted to sell a townhouse estimated to contain a floor area of 150\n\nsquare metres to the purchasers, they were contracting to sell a residential unit of an\n\narea of 150 square metres derived from the two and a half storeys of living space\n\nindicated in the plans attached to the agreement. They were not contracting to sell a\n\nresidential unit of that area made up by aggregating the living space and the car park\n\nlot. I must therefore hold that there was a shortfall in the area of the property known as\n\n33 Sommerville Walk, Fortune View, Singapore. Since I have held against the plaintiffs,\n\nthey must bear the defendants’ costs of this action.Sgd:JUDITH PRAKASHJUDGEThis does not merit reporting.Copyright © Government of Singapore."
    }
}