{
    "case_title": "HH Media-Tech Pte Ltd v Kim Yong Hyun",
    "ncitation": "[2002] SGHC 282",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The claim": "20.        Consequently, the\n\nplaintiffs commenced these proceedings against the defendant in April 2002, claiming the\n\naforementioned two (2) sums, an account of profits made from sales of television\n\ncomponents and kits to the plaintiffs' customers and to customers solicited by the\n\ndefendant.21.        In the (lengthy) defence\n\nand counterclaim which he filed to the plaintiffs' statement of claim, the defendant\n\nalleged that:-(i) the agreement provided that the plaintiffs would bear the entire\n\n    research and development (R& D) costs of the components;(ii) in consideration for (i), the parties agreed that the plaintiffs\n\n    could sell the components to the plaintiffs' customers as well as to the parties' mutual\n\n    customers;(iii) all intellectual property rights, including design of the\n\n    components, would be retained by the defendant through DSM as his agent;(iv) the plaintiffs would arrange the logistics and bear the costs, of\n\n    selling to the parties' mutual customers;(v) DSM would incorporate a development fee of about US$3.00 into each\n\n    television set or components sold by DSM to the plaintiffs;(vi) all profits derived from sales to the parties' mutual customers\n\n    would be shared equally between the plaintiffs and DSM.22.        The defendant asserted he\n\nwas instrumental in introducing IEP (as well as Silk Road) to the plaintiffs. He contended\n\nthat the plaintiffs lost IEP as a customer due to poor service. The defendant asserted he\n\nhad never agreed that IEP would be the plaintiffs' exclusive customer, nor had he agreed\n\nthat the plaintiffs were solely entitled to sell TV kits to the plaintiffs' customers and\n\nhe could not, without the plaintiffs' consent or, that he was not permitted to solicit any\n\nwork from the plaintiffs' customers relating to design, development and or sale of\n\nmicro-processor ICs.23.        The defendant did not\n\ndispute the advances made to him by the plaintiffs save for three (3) amounts namely,\n\nS$20,000 (given in October 2000), US$31,367.36 (by way of a letter of credit in favour of\n\nMitsubishi (Mitsubishi) in August 1999) and S$10,000 (given in February 2000). He\n\ncontended however that the advances made by the plaintiffs were in any case set-off\n\nagainst discounts DSM had given (for micro-processors ICs) at the request of Tang,\n\ntotalling US$177,456.52 (for which he furnished a breakdown).24.        The defendant alleged it\n\nwas the plaintiffs who were in breach of the agreement by failing to provide funding for\n\nR&D after February 2000. Even so, he alleged that he continued to supply the\n\nplaintiffs with TV kits for the purpose of selling to IEP as well as to Silk Road.25.        The defendant\n\ncounter-claimed against the plaintiffs for:-(i) discounts he had given to the plaintiffs on micro-processors sold\n\n    by DSM;(ii) an account of profits derived from sales of TV kits/components the\n\n    plaintiffs made from IEP and other customers;(iii) failing to take delivery of components ordered by the plaintiffs\n\n    under the plaintiffs' purchase order no. HH/366//10/100 dated 1 December 2000 and under\n\n    the defendant's tax invoice D1-21003HH dated 29 January 2001;(iv) the sum of US$300,000 for loss of development fees resulting from\n\n    the aborted contracts between the plaintiffs and IEP as well Silk Road Manufacturing.(v) the sum of US$43,775 (inclusive of 3% GST) for the cost of\n\n    developing software, micro-processor and chassis, under DSM's offer sheet no. 0S2002HH\n\n    dated 17 January 2000.The defendant quantified his claim under item (ii) at US$460,198.85.26.        In its Reply and Defence\n\nto Counterclaim, the plaintiffs:-(i) said it was at IEP's repeated requests that it was mutually agreed\n\n    between Tang and the defendant that the price of components would be reduced so as to make\n\n    the plaintiffs' price of TV kits more competitive with those manufactured by China and\n\n    Korea. The defendant continued to receive his development fee;(ii) averred that as there were no new components to be developed after\n\n    February 2000, there was no need for further loans to be extended to the defendant for R\n\n    & D;(iii) contended that it was the defendant's delay in delivering\n\n    components that caused the plaintiffs to be unable to comply with IEP's delivery schedule\n\n    for television kits. The defendant then took advantage of the situation to approach IEP\n\n    direct to solicit for orders of TV kits incorporating the components;(iv) denied the various heads of the defendant's counterclaim.",
        "The plaintiffs' case": "27.        I start my review by\n\nreferring to the testimony of Tang (PW1), who, with his sister Tang Boon Ser (Shirley)\n\nwere the plaintiffs' two (2) witnesses.28.        Tang (who is known to the\n\ndefendant as Victor Tang) has had experience in special export business in electrical\n\ngoods and in electronics since 1982. He exported Sony and Akai TV sets and radio-cassettes\n\nto African countries, India and Pakistan. However, those export sales comprised assembled\n\nsets, not what he and the defendant did under the agreement.29.        Cross-examined, Tang\n\ntestified that he understood from the defendant that the plaintiffs' profit margin on each\n\nTV kit could be as high as US$10-$12. In reality however, the plaintiffs only made US$2 or\n\nless per kit, on top of all the commercial risks they had to bear, whilst the defendant,\n\nwho was only responsible for the technical aspects, received a development fee of US$3.00\n\nper kit regardless of what the plaintiffs made or lost.30.        Tang's attention was\n\ndrawn to a draft agreement (2AB6-7) he had handed to the defendant sometime at end 1999\n\nbut which was back-dated to 12 May 1998. He explained that the plaintiffs' auditors had\n\nbeen chasing him to regularise the loans the company had made to the defendant; so his\n\ngeneral manager drafted the document for discussion between the parties. However, the\n\ndefendant refused to sign as the draft agreement contained a clause stating that the\n\nintellectual property arising out of the defendant's R&D work would belong to the\n\nplaintiffs. As a result, the plaintiffs stopped their advances to him in February 2000.\n\nWhen he testified, the defendant's explanation for not signing was that the terms of the\n\ndraft did not reflect what the parties had agreed. Tang said he had also chased the\n\ndefendant to sign a loan agreement to no avail. He agreed with counsel for the defendant\n\nthat the micro-processors for the TV sets had to be purchased from the defendant/DSM as\n\nonly the defendant had access to the chip from Mitsubishi. Tang pointed out that the\n\nplaintiffs were totally dependent on the defendant as, if there was even one (1) component\n\nmissing, the entire TV kit would not work.31.        As for the three (3)\n\nadvances made by the plaintiffs which the defendant disputed, Tang's testimony was as\n\nfollows:-",
        "(i) $20,000 paid to the defendant in October 1998": "The defendant had called him (frequently) to say he (the defendant)\n\nneeded the money urgently. Tang instructed Shirley to arrange to pay the amount to the\n\ndefendant. Shirley then had a sum of US$20,000/- which she was changing into Singapore\n\ndollars. Shirley in turn instructed the plaintiffs' production manager John Khoo Kim Huat\n\n(Khoo) to change the foreign into local currency (S$33,720) with a moneychanger and to\n\ndeliver S$20,000 therefrom to the defendant. Shirley and Khoo's affidavit corroborated\n\nTang's evidence in this regard. Khoo deposed that he had been instructed to obtain the\n\ndefendant's signature to the plaintiffs' payment voucher when he handed over the S$20,000.\n\nHowever, the defendant had refused to sign the payment voucher on 2 October 1998. After\n\nKhoo had telephoned Shirley (who then checked with Tang), he was told to hand over the\n\ncash without the need for the defendant to sign the payment voucher, which instruction\n\nKhoo complied with. This item is no longer in issue as at the trial, the defendant\n\nconceded the claim. Consequently, by agreement between the parties, Khoo was not called to\n\ntestify.(ii)sum of US$31,367.36 paid on 5 August 1999Tang explained that this advance related to the first order from IEP.\n\nThe defendant had ordered key components from Mitsubishi for which he did not pay.\n\nInstead, the defendant represented to Mitsubishi that the plaintiffs would make payment,\n\nby a fax dated 18 June 1999, resulting in Mitsubishi amending their invoice to substitute\n\nthe plaintiffs' name for DSM's. Mitsubishi then looked to the plaintiffs for payment. When\n\nTang called the defendant on Mitsubishi's invoice to the plaintiffs, he was told that the\n\ndefendant was cash-strapped and the plaintiffs were requested to settle the said invoice\n\non the defendant's behalf. Consequently, the plaintiffs treated their payment to\n\nMitsubishi as a loan to the defendant.",
        "(iii) cash of $10,000/- handed to the defendant in February 2000": "This amount was personally handed over by Tang to the defendant, at the\n\nplaintiffs' office. Tang testified he remembered it clearly as it was the only time he had\n\nhanded cash to the defendant. Tang pointed out that the defendant's contention that the\n\nplaintiffs' advances were investments in R&D is not sustainable because the defendant\n\ndid not work exclusively for the plaintiffs. Moreover, the plaintiffs' agreement was with\n\nthe defendant personally, not with DSM or any of his other companies. Further, DSM had\n\ndesign contracts with other companies (such as Toshiba Electronics).",
        "The defendant's counterclaim": "60.        The defendant's claim for\n\ndiscounts is clearly unsustainable, in the light of his own admissions under\n\ncross-examination, as set out in para 46 above.61.        As for the defendant's\n\nother claims:-(i) share of profits arising from plaintiffs' sale of TV kits —\n\n    apart from his bare assertion (which I do not believe), the defendant had no evidence to\n\n    support this claim. The parties' course of dealings certainly did not suggest any profit\n\n    -sharing arrangements, bearing in mind that the agreement did not constitute a\n\n    partnership;(ii) loss of US$300,000 development fees — this claim is\n\n    completely unfounded. The defendant did not produce one iota of evidence in support\n\n    thereof. It was Tang's testimony which I accept, that if the plaintiffs did not fulfil a\n\n    customer's order, then no development charge was payable to the defendant. Considering it\n\n    was his own conduct which caused the plaintiffs to lose the outstanding order of 75,000\n\n    (not 70,000) TV kits from IEP, the defendant had the gall to claim US$210,000 relating to\n\n    the unfulfilled order. Similarly, his claim for US$90,000 relating to Silk Road's\n\n    purported order is also dismissed;(iii) claim for US$460,198.85 for cost of components ordered by the\n\n    plaintiffs — it was part of the agreed facts between the parties when trial\n\n    commenced, that the plaintiffs' purchase order no. HH/366/PO/10/00 had been cancelledat\n\n    the invitation of the defendantand the defendant then issued credit note no.\n\n    CN21003HH in the plaintiffs' favour for the cancelled order. How then can he mount this\n\n    claim? The fact that the defendant's closing submissions did not address this claim\n\n    reinforces my finding.(iv) DSM's offer sheet no. 0S2002HH for US$43,775 — this claim is\n\n    equally unmeritorious and is hereby dismissed. I believe Tang's testimony that he/the\n\n    plaintiffs had not seen this document before the trial; it was concocted by the defendant.\n\n    I had pointed out to counsel for the defendant (N/E 85) that it was illogical to suggest\n\n    to Tang (para 21supra) that the plaintiffs had made asecondpart-payment\n\n    of US$25,500 towards this offer sheet, when the plaintiffs never made afirstpart-payment at all. Apart from counsel's suggestion to Tang, no evidence was adduced from\n\n    the defendant to connect DSM's invoice DI-2008HH (at 2AB250) for US$25,500 to this offer\n\n    sheet. Further, no evidence was tendered to prove the plaintiffs' payment of the invoice.In contrast to the plaintiffs, the defendant did not, prior to the\n\ncommencement of these proceedings, make any demand of the plaintiffs for any item he now\n\ncounterclaims. Such omission lends credence to my belief that his claims are false.Conclusion62.        Accordingly, there will\n\nbe judgment for the plaintiffs as claimed with costs to be taxed on the standard basis,\n\nunless otherwise agreed. The defendant's counterclaim is dismissed with costs.Sgd:LAI SIU CHIUJUDGECopyright © Government of Singapore.",
        "(b)    loss of development fees": "34.        The defendant had claimed\n\nUS$210,000 and US$90,000 for loss of the orders of IEP and Silk Road for 70,000 and 30,000\n\ntelevision kits respectively. Tang also questioned the bona fides of this claim; the\n\ndefendant had taken away IEP's business from the plaintiffs when there was an outstanding\n\norder of 75,000 TV kits. As the letter of credit never came from IEP for this order, the\n\nplaintiffs did not issue a purchase order for nor did the defendant develop, any kits for\n\nthis order. The same explanation applied to Silk Road; their order for 30,000 kits was\n\nnever formally placed with the plaintiffs and in turn with the defendant because, the\n\ncompany's letter of credit (which covered an earlier completed order of 10,000 sets) had\n\nlapsed by then. Similarly, the plaintiffs had never placed any order with the defendant as\n\nshown in his offer sheet no. 0S2002HH. Indeed, Tang saw it for the first time in court. It\n\nwas also unlike the defendant not to have asked for advance payment from the plaintiffs\n\nfor this order. However, when he was cross-examined, it was put to Tang that the\n\nplaintiffs had actually made an advance payment of US$25,500/- (see 2AB 250) on or about\n\n18 February 2000, towards the aforesaid offer sheet.",
        "(c)    account of profits": "35.        Tang pointed that that\n\nthe profits due to the defendant had already been disbursed between the parties and\n\nnothing more was due to the defendant, over and above the US$3/- he charged and which the\n\nplaintiffs paid, for each component.",
        "The defendant's case": "36.        I move now to consider\n\nthe defendant's testimony. Besides himself, the defendant called another witness, Ahmed\n\nIbrahim (Ibrahim) from IEP, for his case. By agreement between the parties, the calling of\n\ndefendant's third witness (Jeon Young Sek), was dispensed with, as the plaintiffs had\n\nconceded the only fact stated in his affidavit of evidence-in-chief namely, that he\n\nintroduced IEP to the defendant sometime in July 1998.37.        In his written testimony\n\n(para 6), the defendant set out his own version of the terms of the verbal agreement he\n\nhad reached with Tang, these were:-(i) the plaintiffs would provide the defendant with R&D funding of\n\n    S$50,000-$60,000 per month;(ii) in exchange for funding, the plaintiffs would be allowed to sell\n\n    the TV kits to the plaintiffs'/the parties' customers;(iii) the plaintiffs would purchase components for the TV kits based on\n\n    a list provided by the defendant;(iv) DSM would charge a development fee of US$3/- per kit to cover\n\n    DSM's operating costs such as staff salaries and other overheads;(v) the plaintiffs would be responsible for sale logistics including\n\n    packing, storage and shipping;(vi) profits from sales of TV kits/components would be shared equally\n\n    between the plaintiffs and DSM;(vii) intellectual property rights arising from the R&D would\n\n    remain with the defendant.38.        The defendant claimed\n\nthat he, together with 3-4 other engineers often worked 12-13 hours per day developing the\n\nmicro-processors for the TV kits. He acknowledged that the plaintiffs made several\n\npayments to him/his various companies some of which the plaintiffs requested him to repay\n\nimmediately. The defendant listed out (in para 11 of his affidavit) the dates and amounts\n\nhe/his companies had received from the plaintiffs, between 8 May 1998 until 25 May 2000.\n\nHe added that it was agreed between him and Tang that two (2) payments made by the\n\nplaintiffs namely $60,000 (paid to Duplex in March 1999) and $51,890.19 (paid to DSM in\n\nMay 1999) would be set-off against DSM's invoice no. IC5T90004466 for US$101,890.18. The\n\nset-offs formed part of the agreed facts between the parties before trial commenced. There\n\nis therefore no need to dwell on the items further.39.        Other facts agreed\n\nbetween the parties before trial commenced included the following:-(i) the plaintiffs' purchase order no. HH/366/PO/10/00 dated 1 December\n\n    2000 was cancelled on the invitation of the defendant;(ii) DSM issued a credit note no. CN-21003HH dated 19 June 2001 for the\n\n    sum of U$166,342.90 in favour of the plaintiffs for the plaintiffs' cancelled purchase\n\n    order;(iii) the defendant/DSM did not issue any pro forma invoice for the\n\n    plaintiffs' oral order of an additional 30,000 units of the same components ordered in\n\n    their cancelled purchase order.40.        I turn now to the\n\ndefendant's testimony on the two (2) advances of the plaintiffs which remain disputed:-",
        "(i)    $10,000 cash in February 2000": "In his written testimony, the defendant merely deposed that to the best\n\nof his knowledge and recollection, the plaintiffs never made this payment either to him or\n\nto DSM. Cross-examined (N/E17), he maintained he could not recall receiving the money at\n\nTang's office; he had 'no idea'. It was pointed out to the defendant by counsel for the\n\nplaintiffs that, after disputing (in his pleadings and affidavit evidence) receiving cash\n\nof $20,000 from the plaintiffs in October 1998, the defendant did avolte faceand\n\ninstructed his lawyers to admit to the claim in October 2002. Consequently, counsel\n\nquestioned the defendant whether the same could be said of this loan - it was extended to\n\nthe defendant but he had no recollection of it. No satisfactory answer was given by the\n\ndefendant in this regard.",
        "(ii)    payment to Mitsubishi of US$31,367.36": "In para 15 of his affidavit, the defendant had this to say of the\n\nclaim:-I confirm that the plaintiffs had paid for the\n\n    electronic components on DSM's behalf. However this formed part of the plaintiffs' funding\n\n    of the R&D works. Further or in the alternative, I am liable to pay the said sum in\n\n    light of my defence of set-off and counterclaim a set out below, I will elaborate on them\n\n    in greater detail below.Such a confusing statement is no answer to the plaintiffs' claim on its\n\nmerits.41.        Although he repeatedly\n\nmaintained that the sums paid to him periodically by the plaintiffs were for R&D\n\nfunding (save for 6 items), the defendant testified that he nevertheless returned\n\nUS$331,890.18 and S$10,000 to the plaintiffs, because Tang requested him to do so.42.        The defendant admitted\n\nunder cross-examination that he charged the plaintiffs more than US$3/- per TV kit. In\n\nthis regard, reference was made to the plaintiffs' purchase order no. HH/PO/10/00 dated 20\n\nOctober 2000 (1AB197) wherein the defendant charged the plaintiffs US$3.65 per chip\n\nwhereas his purchase price from Mitsubishi was US$2.75 (see 3AB18). He admitted his profit\n\nin actual fact was about US$4.86 per TV kit. However, he denied counsel's suggestion that\n\nhis profits from the plaintiffs were between US$663,390 and US$799,890 (see 1AB197A) from\n\nsuch mark-ups. He defended his mark-up on the basis that heavy investment was required for\n\nhis/his company's R&D. He also asserted that the aforesaid purchase order was for a\n\nmicro-processor different from others he had developed for the plaintiffs earlier. No\n\nevidence was produced to substantiate this contention. Based on US$3 per kit, the\n\ndefendant conceded his profit could be about US$409,500, based on the total number\n\n(136,500) of micro-processors he supplied to the plaintiffs throughout their relationship.\n\nHowever, the defendant pointed out that the sum had to be divided by 37 months, which\n\nmeant the monthly profit was only $11,067.57. The figure of US$409,500 should be\n\ncontrasted with the plaintiffs' profit which, calculated at US$2/- per kit based on Tang's\n\nand Shirley's unchallenged testimony, would amount to US$273,000; this approximates ? of\n\nthe profits made by the defendant, who unlike the plaintiffs, did not have to bear any of\n\nthe attendant commercial risks.43.        No documents were\n\nproduced in court to show that the defendant had even once asked the plaintiffs for an\n\naccount of his 50% share of profits before he filed his counterclaim; neither was it\n\nstated in his affidavit of evidence-in-chief. Even so, the defendant insisted he had\n\nrepeatedly asked Tang orally but to no avail; Tang's excuse to him was that the profits\n\nwere not high, the plaintiffs were in financial difficulties and, the profits were needed\n\nto cover the plaintiffs' expenses.44.        The defendant did not\n\ndeny selling micro-processors direct to IEP. This was also confirmed by IEP's\n\nrepresentative (Ibrahim) who testified. However, he denied it was part of the agreement\n\nbetween himself and the plaintiffs that he could not sell direct to IEP or to any of the\n\nplaintiffs' other customers.45.        Although he acknowledged\n\ncancelling the plaintiffs' purchase order HH366/PO/10/00 by DSM's credit note no. 21003HH,\n\nthe defendant contended that DSM was still keeping the goods under the cancelled purchase\n\norder. He denied he cancelled the plaintiffs' order because he was unable to fulfil the\n\norder, due to these remarks in the said credit note:'The good are not able to be delivery'The defendant claimed to have placed orders with suppliers for\n\ncomponents based on the cancelled purchase order, referring to his purchase order to\n\nMitsubishi dated 23 October 2000 (at 3AB18). However, counsel for the plaintiffs pointed\n\nout that the plaintiffs' said purchase ordercame later(1 December 2000). The\n\ndefendant explained the discrepancy by saying (N/E 47) that was how business was done\n\n– he would normally pre-order as he was aware of the plaintiffs' requirements,\n\ndespite the financial risks involved. Time was also needed to source for what they wanted.\n\nFor the same reason, the defendant pre-ordered components for the plaintiffs' tentative\n\norder (which did not materialise), of 30,000 TV kits from Silk Road. Such pre-orders,\n\nplaced months in advance of the plaintiffs' purchase orders (see 3AB9) resulted in his\n\nclaim of US$460,198.85. I did not find the defendant's explanation at all convincing not\n\nto mention that before the plaintiffs' writ of summons was filed, he had never once\n\nbroached this claim with them.46.        In relation to his\n\nalleged discounts to the plaintiffs, for which he counter-claimed US$177,456.52, the\n\ndefendant admitted under cross-examination (N/E 82) that his invoices did not reflect such\n\ndiscounts; neither were there any other documents which recorded the discounts, nor was\n\nthere any agreement between himself and the plaintiffs that, the discounts were to be\n\nrepaid to him.47.        It was not easy to\n\nunderstand the defendant's evidence which was translated from the Korean language; his\n\nattempts to speak in English did not help. His recollection of events and dates was also\n\npoor. At times, his oral testimony contradicted either his own affidavit or the documents\n\nin court, as exemplified in the preceding paragraph; in those instances he would resort to\n\noral orders from the plaintiffs or verbal agreements reached with Tang, to explain the\n\ndiscrepancy. At other times, his oral evidence was something new; it was either not\n\npleaded in his defence/counterclaim or not reflected in his written testimony. Further,\n\nboth from his pleadings and from his testimony (oral and written), it was clear that the\n\ndefendant made and could see, no distinction between himself and his companies (including\n\nDSM) when it came to advances taken from and dealings with, the plaintiffs. The advances\n\nhe took were either for his own purposes or for his company, depending on the need.48.        As earlier stated (para\n\n36), the defendant's (only) other witness was Ibrahim (DW2), the custom clearance\n\ndepartment manage of IEP. Ibrahim corroborated the defendant's claim that the defendant\n\nwas instrumental in introducing the plaintiffs to IEP. He also supported the defendant's\n\nclaim that the plaintiffs lost IEP as a customer because of poor service. Ibrahim\n\ncomplained there were late shipments or partial deliveries from the plaintiffs, resulting\n\nin the stoppage of production of TV sets by IEP and causing the latter to lose potential\n\nsales of approximately 75,000 TV sets in the second half of 2000. Further, due to\n\ninaccurate shipping documents, IEP had to pay double (import) taxes in many instances,\n\nreferring to specific bills of lading as examples. Notwithstanding IEP's complaints,\n\nIbrahim alleged that the plaintiffs did nothing to address the problems. As a result, IEP\n\ndecided to cease business with the plaintiffs and instead dealt with DSM direct, with\n\nwhose services IEP was happy. Under cross-examination, Ibrahim agreed that while he was\n\naware of the delay in the plaintiffs' shipment, he did not know the reasons therefor nor\n\nwho was responsible either for the delay or the short-shipments. Consequently, his\n\ntestimony did not help to advance the defendant's case.49.        It would be appropriate\n\nat this juncture to refer to the plaintiffs' version of the reasons for the delay and\n\nshort shipments to IEP. Tang had testified (N/E22) it was impossible to fulfil IEP's order\n\nwithin the 45 days stipulated under their letters of credit, because the plaintiffs had to\n\nbuy components from 20-50 suppliers, bearing in mind they had to depend on the defendant\n\nto first come up with the buying list. In such cases, the plaintiffs would ask IEP to\n\nextend the expiry dates of the letters of credit issued to the plaintiffs, at the latter's\n\ncost. If for one example, IEP decided to change the picture tube, it necessitated the\n\nplaintiffs starting all over again to source for parts, causing an inevitable delay.\n\nFurther, it was impossible to count each and every component packed for shipment. If IEP\n\ncomplained of short shipment of any parts, the plaintiffs accepted the complaint at face\n\nvalue and would ship the short-supplied components (at their own cost) to IEP\n\nsubsequently, resulting again in delay.50.        Shirley also dealt with\n\nthe issue of delay in her testimony. In her affidavit (paras 30-50), she deposed that the\n\nfault largely lay with the defendant. She identified three (3) purchase orders of the\n\nplaintiffs namely, HH55/PO/3/2000, HH65/PO/3/200 and HH/86/PO/3/2000 as examples. The\n\ndefendant was paid in advance as he had requested but, although he issued an invoice\n\n(0005/1042/HHPL) and delivery order (0005/1042/HHPL) giving a delivery date of 6 May 2000,\n\nhe did not meet the deadline. Instead, deliveries for these orders were only made on 19\n\nMay, 31 May and 12 July 2000. Indeed for one micro-processor DSM 225-050SP, the 10,000\n\nunits ordered were not delivered until October 2000, after confirmation by IEP on 24 July\n\n2000; the defendant did not deny this allegation.51.        Shirley alleged that at\n\nother times, the defendant made mistakes either in the components the plaintiffs needed to\n\nprocure or, in the pricing. She said the resultant to-ing and fro-ing between the\n\nplaintiffs, the defendant and suppliers was very time-consuming. Further, 1999-2000 was a\n\nsupplier's market which meant that changes to components list caused further delays in\n\ngetting the components from suppliers, who were all overloaded and could not cope, with\n\norders. For all the problems the plaintiffs encountered with the components list, the\n\nplaintiffs' expected profit of US$5/- per chassis never materialised, it was less than\n\nUS$2/-.52.        With regard to IEP's\n\ncomplaint of paying double import duties, Shirley explained that because of delay on the\n\npart of the defendant, the plaintiffs decided on one occasion to ship the bulk of the\n\ncomponents first (for an order for 18,000 sets), before expiry of IEP's letter of credit,\n\nwhilst waiting for the remaining items to be supplied. She understood from IEP\n\nsubsequently that the plaintiffs' shipment posed problems with the Egyptian customs\n\nauthorities. She blamed the defendant and said IEP was aware that the fault did not lie\n\nwith the plaintiffs.53.        Shirley deposed in her\n\naffidavit that the defendant lost interest in the joint business with the plaintiffs and\n\nit became increasingly difficult to contact him; the defendant would push responsibilities\n\nto his engineer H W Lee. He would not assist the plaintiffs even where he or his engineer\n\ncommitted errors although he continued to demand and to receive, advance payment from them\n\nfor his purchase of components made on the plaintiffs' behalf.",
        "The findings": "54.        I have set out in the\n\npreceding paragraphs the sum total of the testimony adduced from the four (4) witnesses\n\nwho testified. Arising therefrom, I have arrived at the findings set out in the following\n\nparagraphs. I start by saying that I much prefer the testimony of the plaintiffs as given\n\nby the two (2) Tang siblings, as opposed to the defendant's. I have no doubt that Tang and\n\nhis sister Shirley were truthful in their testimony. Earlier (para 47), I had made certain\n\nobservations on the defendant's testimony. I now add one further adverse comment to those\n\nobservations -- the defendant did not come across as either convincing or truthful.",
        "The plaintiffs claim": "55.        On a preponderance of the\n\nevidence adduced, I find that the plaintiffs have discharged the burden and proved that,\n\nthe advances they made to the defendant and or DSM from time to time were not and could\n\nnot have been for purposes of R&D. Details of the loans were set out in Shirley's\n\naffidavit of evidence-in-chief. Counsel's cross-examination of her did not cast doubt on\n\nany of the figures. In reality, the plaintiffs made the loans to accede to the defendant's\n\ndemand that they not he, bear the cost of components the defendant had to procure in order\n\nto develop the micro-processor the plaintiffs needed for the TV kits, wellbeforethe defendant invoiced them. The monies advanced could not have been for R&D as the\n\ndefendant claimed since, he repaid a large part thereof, which evidence he did not deny.\n\nThe defendant's explanation that he refunded the loans at Tang's request is incredible. If\n\nindeed they were payments for R&D, he wasnot at all obligedto repay the sums,\n\nregardless of what demands the plaintiffs/Tang made and the reasons therefor.56.        On the first disputed\n\nloan, the documents (including the defendant's own fax dated 18 June 1999 to Mitsubishi at\n\n1AB47) proved that the plaintiffs paid on the defendant's behalf in August 1999, the sum\n\nof US$31,367.36 which he owed to Mitsubishi. In any event, the defendant did not put\n\nforward any credible defence (save on the question of set-off) to this claim.57.        As for the second\n\ndisputed loan, I also find on a balance of probabilities, that Tang did hand cash of\n\nS$10,000 to the defendant in February 2000; again the defendant's testimony (that he could\n\nnot recall this loan) was unconvincing. Consequently, I award the plaintiffs judgment for\n\nthe total outstanding sums of US$156,367.37 and S$110,000, with interest at 6% from date\n\nof the writ (2 April 2002) until date of this judgment.58.        Turning next to the\n\nplaintiffs' other claim for an account of profits, I entertain little doubt that the\n\ndefendant deliberately went out of his way to cut them out from further dealings with IEP\n\n(which he had introduced to the plaintiffs), resulting in their losing the company's\n\noutstanding order for 75,000 units of TV kits, which he then supplied.59.        Where IEP is concerned,\n\nit would not matter whether it was the understanding between the parties that the\n\ndefendant would not approach the plaintiffs' customers direct. I find that the defendant\n\ntook away the plaintiffs' order of 75,000 TV kits units. It is also my view that it must\n\nbe an implied term in the agreement between the parties based onThe Moorcocktest\n\nthat, the defendant would not approach let alone 'poach', the plaintiffs' customers. What\n\nthe defendant did was reprehensible, his conduct reflecting him as a person without morals\n\nor scruples. Accordingly, the defendant must account to the plaintiffs for the profits he\n\nmade in fulfilling IEP's order(s) and orders placed by Silk Road Manufacturing, if any.\n\nThe Registrar shall hold an inquiry in that regard and the costs of such inquiry shall be\n\nreserved to the Registrar."
    }
}