{
    "case_title": "Korea Jonmyong Trading Co v Sea-shore Transportation Pte Ltd & Another",
    "ncitation": "[2002] SGHC 276",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "2.\n\n        On 15 February 2001, JY agreed to purchase\n\n\"3,000 metric tonnes +/- 5%\" of high speed diesel of Indonesian origin from SST\n\nat USD215 per metric tonne. The contract provided for the cargo to be shipped to JY in\n\nFebruary 2001 and Nampo was nominated as the port of discharge.3.\n\n        SST entrusted the task of procuring the\n\nIndonesian high speed diesel to one Mr Danny Moorthy (\"Danny\"), who did not\n\nsucceed in obtaining the required quantity of cargo. Only 400 metric tonnes of high speed\n\ndiesel were loaded at Surabaya while slightly more than 900 metric tonnes of the said oil\n\nwere loaded at Pulau Kambing. The vessel that carried the cargo to DPRK, namelyMT\n\nPrincess Sarah,had her share of problems. Time was lost as she had to be repaired\n\nbefore she sailed from Indonesia. She then deviated to the Philippines and she finally\n\nreached Nampo, the port of discharge, on 17thJune 2001.4.\n\n        JY did not expect their cargo to arrive as late\n\nas 17thJune 2001. They also did not know thatMT Princess Sarahdid not\n\nhave the agreed quantity of high speed diesel on board because SST had furnished them with\n\nbills of lading which showed that more than 3,000 metric tonnes of the cargo had been\n\nshipped. Apart from being shocked at the shortfall of cargo, they alleged that the limited\n\nquantity of high speed diesel oil that was delivered to them at Nampo was not of the same\n\nquality as that specified in their contract with SST.5.\n\n        SST asserted that the problem of a shortfall in\n\nthe cargo delivered at Nampo could have been minimised had Danny, who was on board theMT\n\nPrincess Sarah,been allowed to return to Indonesia to load more high speed diesel.\n\nHowever, Danny could not leave the DPRK as he was accused by the North Koreans of having\n\ncommitted a number of offences. Among other things, he was accused of having firearms and\n\nsatellite phones in his possession without declaring them to the authorities.6.\n\n        According to JY, Danny, who faced a long term\n\nof imprisonment if he was convicted of the offences in question, offered the DPRK Central\n\nPublic Prosecutors’ Authority the sum of USD230,000 as \"apology money\" if\n\nhe was allowed to leave DPRK. SST’s Deen was made aware of Danny’s problems with\n\nthe DPRK authorities by Kosa, their agent in Nampo, and by Mr Kwon Chang Hyok\n\n(\"Kwon\"), JY’s manager. Danny also spoke to Deen about his predicament. In\n\ndue course, Deen arranged for a total of USD230,000 to be transferred to JY in late 2001\n\nand early 2002 to secure Danny’s release. JY asserted that after they received the\n\nUSD230,000, they transferred the \"apology money\" to the relevant government\n\nauthority.7.\n\n        Subsequently, JY claimed from SST damages in\n\nrelation to, inter alia, their loss of profits and sums which they paid to third parties,\n\nto whom they sold the high speed diesel that SST failed to deliver. They asserted that the\n\ntotal loss to date amounted to USD1,515,494.50. When SST failed to pay the amount claimed,\n\nJY commenced the present action. SST denied liability to JY and added that if they are\n\nliable in damages to JY, the USD230,000 paid by them to secure Danny’s release must\n\nbe taken into account as it was in fact a partial refund of the money which JY paid to\n\nthem for the high speed diesel oil ordered in February 2001.",
        "Claim against second defendant\n\nwithdrawn": "8.\n\n        During the trial, JY withdrew their claim\n\nagainst Deen on terms which were recorded in a consent order dated 10 October 2002. As\n\nsuch, this judgment will only concern JY’s action against SST.",
        "SST admits breaching the contract": "9.\n\n        SST admitted at the trial that they breached\n\ntheir contract with JY by failing to deliver the agreed quantity of high speed diesel. It\n\nwas then agreed that if the claim for consequential losses under JY’s sub-contracts\n\nwith third parties and SST’s alleged set-off of USD230,000 are not taken into\n\naccount, SST would pay JY USD600,200 as damages for breach of contract. Judgment was thus\n\nentered in JY’s favour for this amount. Interest at the rate of 6% per annum is\n\npayable with respect to this judgment sum as from the date of the writ.10.\n\n        As a result of the narrowing of differences\n\nbetween JY and SST, the only remaining issues left to be resolved were JY’s claim for\n\nlosses suffered under their sub-contracts with third parties in the DPRK and SST’s\n\nclaim in relation to a set-off. These will be considered below.",
        "JY’s claim for losses under\n\ntheir sub-contracts with third parties": "11.\n\n        Although JY initially asserted that they\n\nsuffered losses under a number of sub-contracts with third parties in the DPRK, they opted\n\nto claim only the loss under their sub-contract with Sasan Farm (\"Sasan\"), a\n\nlarge rice farm in the Pyongyang area. JY’s case is that they breached a contract to\n\ndeliver 1,000 metric tonnes of high speed diesel to Sasan because of SST’s failure to\n\ndeliver the agreed amount of high speed diesel to them. Sasan complained to the DPRK\n\nCentral Public Prosecutors’ Authority, claiming that JY owed them USD1,290,800 for\n\nthe cost of additional manpower and USD1,507,840 for a shortfall in rice production. The\n\nCentral Public Prosecutors’ Authority ordered JY to pay USD620,000 to Sasan. JY\n\nsought to recover this sum as well as legal expenses incurred in relation to Sasan’s\n\nclaim from SST.12.\n\n        SST asserted that this claim by JY is invalid\n\nbecause of the rule on remoteness of damage, which was summed up by Alderson B inHadley\n\nv Baxendale(1854) 9 Exch 341, 354-55 in the following oft-cited words:Where two parties have made a\n\n    contract which one of them has broken, the damages which the other party ought to receive\n\n    in respect of such breach of contract should be such as may fairly and reasonably be\n\n    considered as either arising naturally, i.e. according to the usual course of things, from\n\n    such breach of contract itself, or such as may reasonably be supposed to have been in the\n\n    contemplation of both parties, at the time they made the contract, as the probable result\n\n    of the breach of it.13.\n\n        JY’s claim for consequential losses in\n\nrelation to their contract with Sasan does not rest on solid ground. For a start, it was\n\nnot established that JY made known the special circumstances of their contract with Sasan\n\nto SST. Admittedly, JY’s manager, Kwon, initially claimed that SST’s Deen knew\n\nabout JY’s sub-contract with Sasan Farm. In paragraph 28 of his affidavit of\n\nevidence-in-chief, he stated as follows:During the extensive discussions\n\n    between the Plaintiff and the 1stDefendant prior to the execution of the\n\n    Contract, namely between 15 January 2001 to 16 February 2001, Jon and I had long and\n\n    detailed discussions with Deen on various issues and topics relating to the role of the\n\n    Plaintiff in DPRK and its customers including :-….(c) details of the\n\n    Plaintiff’s contractual obligations (except price) to third parties in DPRK,\n\n    including … [Sasan]14.\n\n        However, Kwon’s position shifted when he\n\nwas cross-examined. He said as follows:Q. Did you tell the defendant you\n\n    had a sub-contract?A. I said I have lots of\n\n    contracts, one of which was Sasan. Itold him in generalandsometimes I\n\n    put in the name of Sasanas one of my sub-purchasers.Q. You did not tell him every\n\n    detail?A.I did not tell him every\n\n    detail.Q. What did you tell him about\n\n    the Sasan contract?A. I said I have a contract with\n\n    Sasan. I did not mention Sasan every time.15.\n\n        In contrast, Deen steadfastly maintained that\n\nhe was unaware of JY’s sub-contract with Sasan and the ramifications of this\n\nsub-contract. When cross-examined, he said as follows:Q. Did the plaintiffs discuss who\n\n    their customers were?A. Never.Q. Did you try to find out more\n\n    about the sub-sale of oil in North Korea?A. The only thing they said was\n\n    they can get Russian oil but they want to try and get oil from this area.Q. Did you discuss the domestic\n\n    market and who controls the prices?A. No. ….16.\n\n        Mr Ameer Sadique Mohamed Zaheer, a former sales\n\nexecutive of SST, who said that he was present during most of Deen’s meetings with\n\nthe North Koreans, also knew nothing about JY’s sub-contract with Sasan. He impressed\n\nme as a truthful witness. When cross-examined, he said as follows:Q. Did you recall conversations\n\n    about JY’s sub-sale to a farm?A. No.Q. During the extensive\n\n    discussions, did you hear any talk about a sale of oil to a farm?A. No.Q. Was there any discussion on\n\n    market conditions and the plaintiffs’ duties?A. In the meetings I attended,\n\n    none of these was discussed.17.\n\n        I hold that it was not established that SST\n\nwere aware of JY’s sub-contract with Sasan or of the terms of that sub-contract. The\n\neffect of a party not knowing the special circumstances surrounding the other contracting\n\nparty’s sub-contract with third parties must be viewed in the light ofHadley v\n\nBaxendale,where Alderson B said as follows:Now, if the special circumstances\n\n    under which the contract was actually made were communicated by the plaintiffs to the\n\n    defendants, and thus known to both parties, the damages resulting from the breach of such\n\n    a contract, which they would reasonably contemplate, would be the amount of injury which\n\n    would ordinarily follow from a breach of contract under these special circumstances so\n\n    known and communicated. On the other hand, if these special circumstances were wholly\n\n    unknown to the party breaking the contract he, at the most, could only be supposed to have\n\n    had in his contemplation the amount of injury which would arise generally, and in the\n\n    great multitude of cases not affected by any special circumstances, from such a breach of\n\n    contract.18.\n\n        The principles laid down inHadley v\n\nBaxendalehave been restated in subsequent cases, includingVictoria Laundry\n\n(Windsor) Ltd. v Newman Industries Ltd[1949] 2 KB 528 andKoufos v C Czarnikow[1969] 1 AC 350, where the House of Lords did not agree on a single reformulation of the rule on\n\nremoteness of damage.The combined effect of all the cases on remoteness of damage\n\nwas summed up inChitty on Contracts,28thed, p 1291, in the following\n\nterms:A type or kind of loss is not\n\n    too remote a consequence of a breach of contract if, at the time of contracting (and on\n\n    the assumption that the parties actually foresaw the breach in question), it was within\n\n    their reasonable contemplation as a not unlikely result of that breach.19.\n\n        If all the cases on remoteness of damage are\n\ntaken into account, there can be no doubt that JY’s loss under their sub-contract\n\nwith Sasan is too remote a consequence of SST’s breach of the contract to supply JY\n\nwith 3,000 metric tonnes of Indonesian high speed diesel. In any case, what actually\n\ntranspired in the investigations in relation to Sasan’s claim against JY is not\n\nknown. The DPRK Central Public Prosecutors’ Authority furnished no grounds for\n\nrequiring JY to compensate Sasan USD620,000. Although a representative from Sasan, Mr Nam\n\nJong Ok, filed an affidavit of evidence-in-chief, and was listed as a witness in the\n\npresent action against SST, JY chose to close their case without calling him as a witness.\n\nAs such, SST’s counsel was denied the opportunity to question Mr Nam, whose answers\n\ncould have shed more light on the ramifications of Sasan’s petition to the Central\n\nPublic Prosecutors’ Authority. After having taken into account all the circumstances\n\nof the case and the evidence of the witnesses, I have no hesitation whatsoever in\n\ndismissing JY’s claim for consequential losses under their sub-contract with Sasan.SST’s claim regarding a set-off20.\n\n        I now turn to SST’s assertion that they\n\nare entitled to set-off USD230,000 from the amount payable by them to JY for breach of\n\ncontract. As has been mentioned earlier on, Deen arranged for the transfer of USD230,000\n\nto JY in late 2001 and early 2002 to secure the release of Danny, who was then being\n\ninvestigated by the DPRK Central Public Prosecutors’ Authority. SST contended that\n\nthis sum was actually a partial refund by them of the money paid by JY for the high speed\n\ndiesel and that it should be taken into account for the purpose of computing the damages\n\npayable. JY disagreed and asserted that the question of a set-off of the USD230,000 does\n\nnot arise because this sum was Danny’s \"apology money\" with respect to the\n\ncriminal charges faced by him. JY referred to Order No 572 of the DPRK Central Public\n\nProsecutors’ Authority dated 12 November 2001, which is the following terms:The Central Public\n\n    Prosecutors’ Authority of DPRK have investigated into the matters concerning [Danny],\n\n    the Captain of MT \"Princess Sarah\" which called at Nampo Port on 17thJune 2001, … and discovered and confirms the following criminal and illegal behaviour\n\n    committed by [Danny] and his crew.-    Captain has\n\n    organised illegal international voyage by being involved in chartering a vessel without\n\n    Nationality Certificate …-    Captain did not declare\n\n    weapons, ammunition and satellite phones and concealed 3 pistols, ammunition, knives and 2\n\n    sets of satellite phones.-    Captain used\n\n    satellite phones from time to time and without permission even shot 1 bullet in the Nampo\n\n    Port area, thus violating the safety of the country and being afraid of his crime, he\n\n    threw away 1 pistol into the sea-    Captain and\n\n    his crew violated public order in the Nampo area sea bathing resorts, insulting ladies and\n\n    gentlemen there and destroying some of the resort facilities, thus several protests were\n\n    made from several diplomats and the local people.All the above criminal and\n\n    illegal behaviour have been clearly proved by … scientific and objective evidence.\n\n    Therefore, the Central Public Prosecutors’ Authority informed [Danny] that he would\n\n    be charged for minimum 10 years’ imprisonment under … Article 116 of the\n\n    Criminal Law of the Republic.[Danny] confessed and recognised\n\n    his crimes and the correctness of the law of the Republic but suggested that as he eagerly\n\n    wished to return to his family in Singapore, he wished a compound in which he would pay\n\n    USD230,000.00 for his apology and not … be prosecuted.… [T]he Central Public\n\n    Prosecutors’ Authority decided to accept his apology amount … and … orders\n\n    as follows:1. [Danny] to arrange remittance\n\n    of transfer of apology amount of USD230,000.00 to the Credit Bank of Korea, Pyongyang in\n\n    favour of [JY] not later than end of December 2001.2. [JY] to arrange transfer of\n\n    this amount immediately upon credit to the national treasury account with the Foreign\n\n    Trade Bank of DPRK.21.\n\n        Danny, who denied that he had committed many of\n\nthe offences referred to in the Order of the DPRK Central Prosecutors’ Authority,\n\nadmitted that he had breached the DPRK’s laws in relation to possession of firearms\n\nand satellite phones. Deen accepted that he had been informed about Danny’s\n\npredicament by SST’s Korean agent, Kosa, and that he had been urged to help secure\n\nDanny’s release. Contemporaneous documents with respect to the transfer of the\n\nUSD230,000 from Deen’s account indicate that the money was paid to secure\n\nDanny’s release. On 24 December 2001, Danny’s wife, Jenny, wrote to JY as\n\nfollows:Please be informed that I am\n\n    trying my best to look for financial help for my husband (Capt. Danny Moorthy) and will be\n\n    able to remit the balance money to you by end December 2001.Please bear with me during this 1\n\n    week period and arrange to send my husband back to Singapore once you receive my\n\n    remittance.22.\n\n        On 21 January 2002, Deen wrote to JY’s\n\nKwon as follows:The Captain’s wife came to\n\n    our office this morning crying and desperately seeking our help in releasing her husband\n\n    from your custody. She says that so far she had borrowed the money from your relatives and\n\n    friends to arrange for the US$200,000/- and now she needs to settle this amount by Chinese\n\n    New Year. (14/02/2002). She says it would be better for her husband to be released earlier\n\n    (before Chinese New Year) so that he can help her in settling the debts.Though the original amount asked\n\n    by you was US$200,000/- and now you are asking for further US$30,000/- she says she will\n\n    try somehow to get the loan by the end of this week.Please try to arrange to get her\n\n    husband released by this week as she is anxious for his safe return.23.\n\n        SST contended that the above-mentioned letters\n\nfrom Danny’s wife, Jenny, and Deen were written because they were told that Danny\n\nwould only be released if the USD230,000 was forwarded to JY on the basis that it was in\n\nrespect of Danny’s release from custody. What is strange is that when cross-examined,\n\nDanny admitted that his wife had tried to borrow money to secure his release. JY’s\n\ncounsel, Mr Andre Arul, rightly pointed out that if the USD230,000 in question was\n\nintended to be a partial refund of the purchase price paid by JY to SST, there was no\n\nreason for Danny’s wife to try and raise money to secure his release.24.\n\n        What SST is in fact alleging is that JY is\n\nguilty of fraud and that the DPRK Central Public Prosecutors’ Authority is colluding\n\nwith JY to defraud them. SST submitted that it should not be overlooked that the\n\n\"apology money\" was transferred to JY’s account. Apart from the fact that\n\nfraud was not pleaded by SST, it is pertinent to note that Mr Yun Jun Hi, the officer in\n\nthe Central Public Prosecutors’ Authority who took charge of the investigation\n\nregarding Danny’s breach of the DPRK’s laws, testified that the \"apology\n\nmoney\" had, for convenience, been paid into JY’s account because that company\n\nhad the requisite foreign exchange account and had prior dealings with SST. He also\n\nconfirmed that JY had transferred the USD230,000 in question to the relevant government\n\nauthority. It ought to be borne in mind that inAksionairnoye Obschestvo A M Luther v\n\nJames Sagor & Co[1921] All ER 138, 146, Warrington LJ said:It is well settled that the\n\n    validity of the acts of an independent sovereign government in relation to property and\n\n    persons within its jurisdiction cannot be questioned in the courts of this country:\"Every sovereign State is\n\n      bound to respect the independence of every other sovereign State, and the courts of one\n\n      country will not sit in judgment on the acts of the government of another done within its\n\n      own territory\"perClarke J, delivering\n\n    the judgment of the Supreme Court of the United States of America inOetjen v Central\n\n    Leather Co …(1917) 246 US Rep at p 303.25.\n\n        It is for SST to prove their assertion that\n\nthey were entitled to a set-off with respect to the USD230,000 \"apology money\".\n\nAs they failed to do so, the said sum cannot be deducted from the damages payable to JY\n\nfor their breach of contract.",
        "Costs": "26.\n\n        As has been mentioned, SST accepted that JY are\n\nentitled to the sum of USD600,200 for breach of contract if they had no right to set-off\n\nthe USD230,000 paid by them to JY in late 2001 and early 2002. JY are entitled to costs as\n\nfar as their claim for USD 600,200 is concerned.27.\n\n        Different considerations arise with respect to\n\nthe costs in relation to JY’s claim for consequential losses and SST’s alleged\n\nset-off. JY’s counsel pointed out that the alleged set-off occupied more time than\n\ntheir claim for loss suffered under their sub-contract with Sasan. However, it must be\n\nborne in mind that JY started off with three claims for consequential losses and a number\n\nof representatives of those who entered into sub-contracts with JY filed affidavits of\n\nevidence-in-chief. None of these representatives appeared in court to give evidence. After\n\ntaking all circumstances into account, I order that with respect to JY’s claim for\n\nconsequential loss under their sub-contracts and SST’s claim regarding a set-off, the\n\nparties shall bear their own costs.Sgd:TAN LEE MENGJUDGECopyright © Government of Singapore."
    }
}