{
    "case_title": "Tapematic SpA v Wirana Pte Ltd and Another",
    "ncitation": "[2002] SGHC 5",
    "coram": "Woo Bih Li JC",
    "sections": {
        "Paragraph 31 of the Amended Statement of Claim": "21.        The thrust of Tapematic’s claim\n\nagainst Wirana was that Umar Zen had the authority, actual or apparent, of Wirana to act\n\nin all matters in relation to the letters of credit. Paragraph 31 of the Amended Statement\n\nof Claim contained the Particulars of this assertions. It states:‘31. At all material times the 2ndDefendant had the\n\n    authority, actual or apparent, of the 1stDefendant to act in all matters in\n\n    relation to the letters of credit.PARTICULARS(a)    The 2ndDefendant had informed the\n\n    Plaintiff in or around the months of January and February 2000 that he had arranged for\n\n    the1stDefendant to apply for theissuance of the 1stand 2ndletters of credit by Standard Chartered Bank.(b)    The 1stletter of credit was applied\n\n    for by the 1stDefendant on or about 8 December 1999 and subsequently issued by\n\n    Standard Chartered Bank on 9 December 1999.(c)    The 2ndletter of credit was applied\n\n    for by the 1stDefendant on or about 28 January 2000 and subsequently issued by\n\n    Standard Chartered Bank on 1 February 2000.(d)    After the preliminary cargo receipts were signed\n\n    by Mr. Pritam Singh from KBEI and then transmitted to the 2ndDefendant via\n\n    facsimile, the Plaintiffs requested the 2ndDefendant to procure the 1stDefendant to issue to the Plaintiffs the Wirana cargo receipts signed by its authorized\n\n    signatory Mr. Raj Kumar Singh. On 24 February 2000 the Plaintiffs received the 2 Wirana\n\n    cargo receipts both dated 11 February 2000 and signed by Mr. Raj Kumar Singh.’",
        "Contentions for Wirana": "22.        Mr Toh Kian Sing, counsel for Wirana,\n\nsubmitted that for there to be actual authority, there must be a consensual agreement\n\nbetween the principal and agent. He cited Bowstead & Reynolds on Agency, Sixteenth\n\nEdition 1996, at p 103 to 104.23.        He submitted that just because Umar Zen\n\nhad told Tapematic that letters of credit would be issued in its favour and this was done\n\non the application of Wirana, it did not make Umar Zen the agent of Wirana.24.        As for the cargo receipts, Mr Toh\n\nsubmitted that Tapematic were unable to say that these documents were received from\n\nWirana. Furthermore, the documents were received after the alleged representation about\n\nRaj Kumar Singh on 11 February 2000.25.        As for apparent authority, Mr Toh\n\nsubmitted that it was established law that there must be a representation from the\n\nprincipal to the third party that the agent had authority to do what he did. There is no\n\nconcept of a self-authorising agent.26.        For this proposition, Mr Toh cited:(a)Freeman & Lockyer v Buckhurst Park\n\n    Properties[1964] 2 QB 480(b)Tribune Investment Trust v Soosan Trading[2000]     3 SLR 405, which approvedThe Ocean Frost, Armagas Ltd v Mundogas SA[1986] 1 AC\n\n    717.27.        The act of applying for letters of credit\n\ncould not be considered as a representation by Wirana that Umar Zen was its agent to make\n\nrepresentations about Wirana’s authorised signatory. Also, the letters of credit\n\nthemselves did not mention Umar Zen.28.        Mr Toh also submitted that the parties\n\nhad gone through discovery and interrogatories and yet Tapematic were in no better\n\nposition than when its Statement of Claim was filed.29.        He relied on the judgment of Justice Lai\n\nSiu Chiu inThomas & Betts (S.E. Asia) Pte Ltd v Ou Tin Joon & Anor(Unreported, 27 February 1998) where the judge said at paragraphs 22 to 24:‘22.    …. The particulars given by the\n\n    plaintiffs were at best vague and sweeping. It seemed to me that the plaintiffs were\n\n    merely trying to frame their claim in the widest possible terms without the requisite\n\n    particulars.23.    It is a clear rule of pleading that ‘every\n\n    pleading must contain the necessary particulars of any claim’ (O 18 r 12(1) of the\n\n    RSC). In the absence of providing adequate particulars, and in the absence of any\n\n    explanation as to why these particulars were inadequate, I was constrained in finding that\n\n    there were insufficient facts in the pleadings to support the cause of action.I did\n\n    not think it fair that a plaintiff should be allowed to allege first, and then through the\n\n    process of discovery or interrogatories, hope to substantiate those allegations later -\n\n    that would be tantamount to ‘fishing’which any court would vigilantly guard\n\n    against in balancing the interests and rights of the parties concerned.24.    Consequently, on the face of the pleadings, I\n\n    concluded that no reasonable cause of action was disclosed. Alternatively, it would at\n\n    least be open to argument that the pleadings were so speculative, harassing, oppressive\n\n    and uncertain that striking out could also have been justified on the basis that this\n\n    constituted an abuse of process of court. I accordingly struck out the cause of action\n\n    based on the implied term.’[Emphasis added.]30.        Mr Toh submitted that the present case\n\nwas a stronger one for striking out because inThomas & Betts, discovery and\n\ninterrogatories had not yet been completed.31.        He also submitted that the further and\n\nbetter particulars supplied by Tapematic did not advance its case on agency.32.        Mr Toh further submitted that\n\nTapematic’s assertion about Umar Zen amounted to an alleged agent, Umar Zen, making a\n\nrepresentation of another agent’s, Raj Kumar Singh’s, authority. Tapematic could\n\nnot validly make such an assertion unless Umar Zen had actual authority to do so which he\n\ndid not. Mr Toh citedBritish Bank of the Middle East v Sun Life Assurance Co of Canada[1983] 2 Lloyd’s Rep 9 for this proposition.33.        As for the cargo receipts,\n\nTapematic’s case was based on the premise that these were forgeries. Therefore it\n\ncould not rely on these same documents to establish agency.34.        As for an argument that Wirana’s\n\napplication to strike out was made late in the day, Mr Toh submitted that when\n\nWirana’s application was filed, the affidavits of evidence-in-chief had not yet been\n\nexchanged.35.        Furthermore, the application was filed\n\nafter discovery and interrogatories. If it had been filed earlier, it would have been met\n\nwith the argument that discovery and interrogatories were pending.36.        As for yet another request by\n\nTapematic’s solicitors for further discovery, this was dated 24 July 2001 and made\n\nafter the application to strike out had been filed. It was sent to Mr Toh’s firm on\n\nthe eve of the hearing of the application to strike out. Mr Toh was suggesting that it was\n\nnot a bona fide request for further discovery.Tapematic’s contentions37.        Mr Ashok Kumar, counsel for Tapematic,\n\nsubmitted that both Wirana and Umar Zen were asserting that they had no knowledge of Raj\n\nKumar Singh. Both also denied sending the cargo receipts to Tapematic.38.        Furthermore, Wirana was saying that it\n\nhad dealt with Ramdas Nair, not Umar Zen, and Ramdas Nair had said he was an agent of\n\nWirana. However, Ramdas Nair also claimed he did not know Raj Kumar Singh.39.        As regards actual authority, he submitted\n\nthat Umar Zen had informed Tapematic that the letters of credit would be issued and they\n\nwere indeed issued. These were issued upon the application of Wirana. When Tapematic\n\nreminded Umar Zen about the cargo receipts, two cargo receipts carrying the Wirana\n\nletterhead and signed by Raj Kumar Singh were sent to Tapematic.40.        Mr Kumar also submitted that the issue of\n\nactual authority should be resolved at a proper trial.41.        As for apparent authority, Mr Kumar did\n\nnot dispute that there is no concept of a self-authorising agent. However, there could\n\nvery well be a holding out or representation of the authority of Umar Zen by conduct.42.        He put his argument this way:‘43.    This \"holding out\" by way of\n\n    conduct on the part of Wirana is supported by the particulars in paragraph 31 of the ASOC.\n\n    Wirana has put Umar Zen in a position where he appears to be authorized to make the\n\n    representations; to put it another way, Wirana has acquiesced or permitted Umar Zen to\n\n    negotiate or liase with the Plaintiff on all matters in relation to the letters of credit,\n\n    which would include of course the identity of the authorised signatory of Wirana for the\n\n    cargo receipts.44.    The two LCs were applied for by Wirana after Umar\n\n    Zen had assured the Plaintiffs that he would make all necessary arrangements. This is not\n\n    denied by Wirana who has admitted on oath that they applied for the LCs for a commission.\n\n    Negotiations on the draft terms of the letters of credit were also conducted between\n\n    Plaintiffs and Umar Zen.45.    Accordingly, it is submitted that there was this\n\n    holding out by Wirana clothing Umar Zen with apparent authority. When the question as to\n\n    who Wirana’s authorised signatory for the cargo receipts was (sic) came up, it was\n\n    therefore entirely reasonable for the Plaintiffs to rely on Umar Zen’s\n\n    representations that Raj Kumar Singh was the authorised signatory for Wirana. Cargo\n\n    receipts carrying Wirana’s letterhead and signed by Raj Kumar Singh did arrive in\n\n    accordance with Umar Zen’s representations. It is the Plaintiff’s case that\n\n    Wirana is therefore bound by Umar Zen’s representations by virtue of their holding\n\n    him out as their agent.’43.        Mr Kumar pointed out that the cases\n\nrelied on by Mr Toh were after full trial.44.        He also relied on certain parts of the\n\njudgment of Tay Yong Kwang JC inHSBC v Jurong Engineering[2000] 2 SLR 54.45.        In paragraph 63 thereof, Tay JC said:‘63    As a general rule, for a principal to be\n\n    bound under the doctrine of apparent authority, the representation as to the agent’s\n\n    authority must emanate from the principal himself -Freeman & Lockyer v Buckhurst\n\n    Park Properties. In relation to corporations, where representations can only be made\n\n    through agents, the translation of the general rule has produced the consequence that in\n\n    order for a corporation to be bound under the doctrine of apparent authority, the\n\n    representation as to the authority of the agent must be made by some other intermediate\n\n    agent within the corporate structure, who has actual authority to do the very act that he\n\n    represents the other person has having authority to do. The decision of the English House\n\n    of Lords in the case ofBritish Bank of the Middle East v Sun Life Assurance Co of\n\n    Canada (UK) Ltd[1983] BCLC 78 illustrates this rule. ….’46.        In paragraph 68 and 70 thereof, Tay JC\n\nsaid:‘68    There is, however, a narrow exception to the\n\n    general rule stated above: if the company has expressly authorised the agent to make\n\n    representations on its behalf, then any representation made by that agent that he himself\n\n    has authority to do an act is a good representation for the purposes of conferring\n\n    apparent authority on the agent to do that act, even if he has been expressly prohibited\n\n    to do it, and even if it is not something that agents in his position usually have power\n\n    to do. The leading authorities on this exception are the two English cases ofThe\n\n    Raffaella; Soplex Wholesale Supplies Ltd and PS Refson & Co Ltd v Egyptian\n\n    International Foreign Trading Co[1985] 2 Lloyd’s Rep 36 andFirst Energy (UK)\n\n    Ltd v Hungarian International Bank Ltd[1993] 2 Lloyd’s Rep 194.70    Similarly, inFirst Energy (UK) Ltd v Hungarian\n\n    International Bank Ltd, the English Court of Appeal held that in certain\n\n    circumstances, an agent hadapparent authority to communicate his principal’s\n\n    approval for him to enter into a particular transaction on behalf of the principal,\n\n    even though the third party was aware that the agent did not normally have authority to\n\n    enter into such transactions. …. The Court of Appeal pointed out that such apparent\n\n    authority arose from HIB having placed J in the position of senior manager. As senior\n\n    manager, J had usual authority to sign and send letters on behalf of HIB and therefore had\n\n    apparent authority to represent by letter that he had obtained authorisation from HIB to\n\n    make an offer on their behalf. The Court of Appeal stressed that their judgment was\n\n    consistent with the reasonable expectations of the parties, and that, in the\n\n    circumstances, it was unrealistic to have expected First Energy to have checked with\n\n    HIB’s Head Office in London as to whether an employee as senior as J had obtained\n\n    necessary approval to make the offer. The Court of Appeal was able to distinguishArmagas\n\n    Ltd v Mundogas SA, for in that case, Lord Keith had not said as a matter of law that\n\n    an apparent authority to communicate approval could never arise where there was no\n\n    authority in the agent on his own to enter into the transaction.’47.        Mr Kumar submitted that there should be a\n\ntrial vis--vis Wirana to establish who sent the cargo receipts and the identity of Raj\n\nKumar Singh.48.        He also referred to an oral response from\n\nan officer of SCB, one Peter Tan, who allegedly said that he had dealt with one Raj Kumar\n\nSingh of Wirana in relation to the two letters of credit but when a formal Answer to\n\nInterrogatories was filed, Peter Tan said he dealt with one Raj Bhan Singh.49.        Mr Kumar said that he had asked for\n\nfurther discovery by a fax dated 24 July 2001. If further discovery was obtained, he might\n\nbe able to file further particulars to strengthen Tapematic’s case.50.        Mr Kumar’s last point was that the\n\napplication to strike out was taken at a very late stage. By the time it was heard, the\n\naffidavits of evidence-in-chief had been exchanged. He relied onHalliday v Shoesmith[1993] 1 WLR 1 and Civil Practice in Singapore and Malaysia by Pinsler 2001 p XVI 2.",
        "My decision": "51.        Although Mr Toh had submitted that actual\n\nauthority must emanate from some consensual agreement between the principal and agent, it\n\nis clear from Bowstead & Reynolds on Agency, which he relies on, that actual authority\n\ncan be express or implied. A principal need not specifically tell the agent that the agent\n\nhas the authority to do each and every step. That would be unrealistic. It suffices if the\n\nagent is appointed to carry out a function or activity for the principal and the step is\n\nreasonably incidental to the function or activity.52.        In the case before me, Umar Zen was\n\nneither an officer or employee of Wirana.53.        The crux of the issue was whether by\n\nengaging in discussions with Umar Zen, whether directly or through Ramdas Nair, regarding\n\nthe issue of letters of credit and by applying for the same to be issued, Wirana had\n\nappointed Umar Zen as its agent with actual authority for Umar Zen to make representations\n\nto Tapematic about the authority of a supposed officer of Wirana. I will refer to this\n\npurpose as ‘the purpose in question’.54.        I was of the view that the said\n\ndiscussions with Umar Zen and the applications for letters of credit could not, without\n\nmore, possibly mean that Umar Zen had been appointed as agent of Wirana for the purpose in\n\nquestion. Otherwise, it would mean that the mere discussion by an intended applicant of\n\nletters of credit with a broker or intermediary about the issuance of letters of credit\n\nand the consequent application for the same would in every case make that person an agent\n\nof the applicant for the purpose in question. The fact that the letters of credit had been\n\nissued did not advance Tapematic’s case any further.55.        As regards apparent authority, there was\n\nno representation from Wirana to Tapematic about Umar Zen.56.        The fact that Umar Zen had informed\n\nTapematic that he had arranged for the issuance of the letters of credit did not\n\nconstitute a representation from Wirana. There was clearly no holding out by Wirana even\n\nif it knew that Umar Zen was liaising or negotiating with Tapematic on the letters of\n\ncredit.57.        The mere fact that Wirana had applied for\n\nthe issuance of the letters of credit after Umar Zen had informed Tapematic that he would\n\nmake the necessary arrangements also did not constitute a representation from Wirana to\n\nTapematic.58.        It was irrelevant whether Ramdas Nair was\n\nan agent of Wirana because there was also no representation from Ramdas Nair to Tapematic.59.        Although the cases cited by Mr Toh were\n\ndecisions after a full trial, it did not mean that an allegation about the status of a\n\nperson as agent could not be struck out in appropriate circumstances.60.        As for the case ofHSBC v Jurong\n\nEngineering, the person who made the representation was an officer of the corporate\n\ndefendant. The facts in that case were different.61.        As regards suggestions by Mr Kumar that\n\nthe cargo receipts could possibly emanate from Wirana, I was of the view that this was\n\ncontrary to the premise on which Tapematic’s case was founded.62.        Tapematic’s case was premised on the\n\nbasis that the cargo receipts were not issued by an authorised signatory of Wirana and\n\nhence its allegation of misrepresentation from Umar Zen as agent of Wirana. That being the\n\ncase, there was no reason to have a trial to allow Tapematic a chance to establish that\n\nthe cargo receipts in fact emanated from Wirana.63.        The same point applied to the latest\n\nrequest for discovery by Tapematic’s solicitors dated 24 July 2001. The documents for\n\nwhich discovery was sought were between SCB and Wirana. They were sought with a view to\n\nuncovering the authorised signatory of Wirana which was a non-issue.64.        In my view, this latest attempt at\n\nfurther discovery was a desperate manoeuvre to shore up Tapematic’s claim against\n\nWirana.65.        Notwithstanding earlier discovery and\n\nanswers to interrogatories, Tapematic was still in no better position than when it\n\ninitiated the action.66.        As for the last argument about the late\n\nfiling of the application to strike out, O 18 r 19(1) of the Rules of Court provides that:‘The Court mayat any stageof the proceedings order to be\n\n    struck out … any pleading …’[Emphasis added.]While an application to strike out a pleading should be made as soon as\n\npossible, a late application was not doomed to failure.67.        The case ofHalliday v Shoesmith[1993] 1 WLR 1 relied on by Mr Kumar was one in which the application to strike out was\n\nmade at the commencement of the trial and on the facts there the application was not\n\nallowed.68.        In the case before me, the further and\n\nbetter particulars furnished by Tapematic were couched with the qualification that there\n\nwere pending discovery and/or interrogatories. Even when Wirana’s solicitors sought\n\nfurther and better particulars, after discovery and answers to interrogatories were\n\nprovided, they were met with the response that Tapematic would be serving some more\n\ninterrogatories and would request for further and better particulars.69.        I accepted Mr Toh’s argument that\n\nhad the application to strike out been made earlier, it would have been faced with the\n\ncounter argument that it was premature.Sgd:WOO BIH LIJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}