{
    "case_title": "Ong Jane Rebecca v Lim Lie Hoa and Others (No 2) (Lim Lie Hoa, Third Party)",
    "ncitation": "[2002] SGHC 227",
    "coram": "Choo Han Teck JC",
    "sections": {
        "Civil Procedure": "– Claims for interim payments – Whether\n\nany basis before the inquiry to speculate how much money is left in the estate –\n\nWhether claims must be made after the inquiryCivil Procedure– Mareva injunction – Application for\n\ndischarge – Whether possibility of some not insubstantial amount of money in the\n\nestate which the first defendant had control over – Whether preservation order to be\n\nmaintainedCivil Procedure– Third Party Notice – Setting aside\n\n– Whether wrong to encourage a writ action within the narrow scope of an inquiryCivil Procedure– Application for opposing accountants to\n\nexchange reports and for inquiry to be conducted by an arbitrator – Whether hearing\n\nwould be delayedFactsThe original dispute was in\n\nrespect of the assets of the estate of Ong Seng King. The outstanding matter is the\n\ninquiry to determine the estate in question and the second defendant’s share of the\n\nestate. The inquiry was scheduled to commence on 21 October 2002 but in the meantime, the\n\nparties filed eight summonses-in-chambers.Held, dismissing all but one summonses-in-chamber:(1) The first three applications for interim payments were dismissed\n\nbecause until the inquiry is done, there was no basis to speculate as to how much money is\n\nleft in the estate. Moreover, it is a circuitous exercise to ask whether there is money in\n\nthe estate when the whole purpose of the inquiry is precisely to determine that very\n\npoint. Any claim must be made after the inquiry is concluded (see  2).(2) In view of the refusal to allow interim payment, the fourth\n\napplication to stop any interim payment became redundant, save for the question of costs\n\nwhich was reserved to the Registrar (see  3 and 7).(3) The fifth application to discharge a Mareva injunction imposed\n\nearlier by this court against the first defendant was dismissed as, on the little\n\nevidence, there might be some not insubstantial sums of money in the estate in which the\n\nfirst defendant had control over. A preservation order should be maintained, subject only\n\nto any variation or other orders that the Registrar conducting the inquiry may make (see\n\n 4).(4) The seventh application to set aside the Third Party Notice taken\n\nout by the second defendant against the first defendant was allowed. The notice was\n\ntechnically flawed in that it did not satisfy the requirements under O 16 of the Rules of\n\nCourt. Moreover, the inquiry could not be expanded to cover related but obviously\n\nindependent action that the second defendant might have against the first defendant.\n\nNothing can be more calamitous, legally and procedurally, than to encourage a writ action\n\nwithin the narrow scope of an inquiry (see  5).(5) The eighth application taken out by the first defendant for an\n\norder that the accountants for the main opposing camps exchange reports and for the\n\ninquiry to be conducted by an arbitrator was dismissed as it had come too late. It would\n\nonly have the effect of delaying the hearing (see  6).Legislation referred toRules of Court 1997, O 16JudgmentGROUNDS OF DECISION1.        The original dispute in\n\nrespect of the assets of the estate of Ong Seng King, had been heard and judgment handed\n\ndown on 16 July 1996 by Justice Chao Hick Tin. The outstanding matter is the inquiry\n\nordered by Justice Chao, principally, to determine the assets of the estate in question\n\nand the second defendant's share of the estate. The plaintiff's interest in the assets of\n\nthe estate hinges on the half share of the second defendant's entitlement of the estate\n\nthat was granted to her in the July 1996 judgment. The inquiry has been scheduled to\n\ncommence on 21 October 2002. In the meantime, parties filed eight summonses-in-chambers\n\nbefore me. I dismissed all but one, and now give my grounds in one compendious judgment.2.        The first three\n\napplications were for interim payments. Two were made by the second defendant (one as\n\ntrustee and administrator of the estate) and the third was by his former wife, the\n\nplaintiff. The second defendant's application as a beneficiary was made on virtually the\n\nsame basis as that of the plaintiff. Both have set out the grounds as to why they need the\n\nmoney. In the case of the plaintiff, the court had previously ordered interim payments\n\namounting to at least $3,000,000. She now wants another $1,200,000, mainly to enable her\n\nto engage a senior counsel to assist her at the inquiry. She also wanted a sum of 5,000\n\na month to cover her living expenses. I accept that the assistance of senior counsel will\n\nbe helpful to the inquiry, apart from the assumed benefit to the plaintiff herself, and\n\nalso that she might well require funds, but that is not a sufficient ground in itself to\n\nmake an order for a further interim payment. The two applicants here submitted that\n\naccording to Price Waterhouse Coopers' Interim Report of 21 March 2000 there is a sum of\n\n$12,477,556 due to the second defendant (of which the plaintiff would be entitled to\n\nhalf). This report is being challenged by the first defendant. I note that some interim\n\npayments have already been made to the plaintiff, but circumstances are different at this\n\nmoment. Until the inquiry is done I have no basis to speculate as to how much money is\n\nleft in the estate. Secondly, as the inquiry is due to commence soon, it is, therefore, a\n\ncircuitous exercise to ask whether there is money in the estate when the whole purpose of\n\nthe inquiry is, precisely, to determine that very point. So far as the second defendant's\n\napplication to be paid in his capacity as trustee of the estate, I am of the view that in\n\nprinciple, he may be right, but under the present circumstances, he must make his claim\n\nafter the inquiry is concluded. The three applications for interim payments were therefore\n\ndisallowed.3.        The fourth application was\n\na joint application by the third and fourth defendants (the brothers of the second\n\ndefendant, and all three are sons of the first defendant) to stop any payment that might\n\nbe made to the plaintiff and second defendant. In view of my refusal to allow interim\n\npayments, this application is redundant save for the question of costs, which I shall\n\nrevert shortly.4.        The fifth application was\n\nan application by the first defendant to discharge aMarevainjunction imposed by\n\nthis court on 22 February 2002 pursuant to an application by the second defendant. The\n\nsixth application was by the third and fourth defendants to vary theMarevainjunction granted by this court on 29 April 2002 also pursuant to an application by the\n\nsecond defendant. The second injunction was granted to ensure that the first defendant\n\ndoes not move assets belonging to the estate that may have been transferred from her\n\ncontrol to the third and fourth defendants, and thereby rendering the injunction against\n\nher under the 22 February order ineffective. The history of this case, and I mean the\n\nentire case from the first shot fired in the original Originating Summons up to the\n\npresent applications before me, the relationship of two main parties in opposition, namely\n\nthe plaintiff and the first defendant (the second defendant appears to have switched\n\nalliance), have been acrimonious, and mutual suspicion continues to govern their every\n\nconduct, each with the other. On the little evidence (by way of affidavits) before me, I\n\ncan only conclude that there may be some not insubstantial (but undefined) sums of money\n\n(or assets with value) in the estate and in which the first defendant has control over. If\n\nthat is correct, then given the present situation, I am of the view that a preservation\n\norder should be maintained, subject only to any variation or other orders that the\n\nRegistrar conducting the inquiry (and the parties may be reminded that the inquiry is less\n\nthan 30 days away), may make. For these reasons, the applications to discharge or vary theMarevainjunctions were dismissed.5.        The seventh application\n\nwas an application to set aside the Third Party Notice taken out by the second defendant\n\nagainst the first defendant. Technically, the Third Party Notice is flawed in that it does\n\nnot satisfy the requirements under O 16 of the Rules of Court, and no directions have been\n\ntaken out by the second defendant so far that may identify the precise nature and purpose\n\nof that application. Nonetheless, it must not be forgotten that the scheduled inquiry as\n\nordered, and the terms of the inquiry, cannot be expanded to cover related but obviously\n\nindependent action that the second defendant might have against the first defendant or any\n\nother party. The inquiry is specifically to ascertain the size and value of the estate,\n\nand the share that the second defendant may be entitled. The inquiry is not the forum for\n\nany action concerning a breach of trust, a wrongful failure to administer the estate, or\n\nthe wrongful use of estate funds. What is left under the present Originating Summons, as I\n\nhave recitedad nauseamis to inquire into the assets of the estate. My point is\n\nreinforced by the expression of intent by Mr. Arul to join the fourth defendant as the\n\nsecond Third Party. Nothing can be more calamitous, legally and procedurally, than to\n\nencourage a writ action within the narrow scope of an inquiry. The application to set\n\naside the Third Party Notice was therefore allowed.6.        The eighth application was\n\ntaken out by the first defendant for an order that Arthur Anderson and Price Waterhouse\n\nCoopers (the accountancy experts for the main opposing camps respectively) exchange their\n\nreports and for the inquiry to be conducted by an arbitrator. The first part of this\n\napplication is superficially attractive, but it seems to me to have come too late. An\n\nexchange of reports at this stage, given the history of this case, is likely to spawn\n\nfurther applications such as may stymie the inquiry. The parties must stand by its\n\nrespective reports and, if any further directions are required, to be issued by the\n\nRegistrar conducting the inquiry. The second part of this application also appears\n\nattractive. I am of the view, however, that a direction for the inquiry to be conducted by\n\nan arbitrator at this stage will similarly delay the hearing; so that call has also come a\n\nlittle late, but nonetheless, the parties may still, by consent, proceed to arbitration on\n\ntheir own accord even though realistically, the prospect of that is dismally dim.7.        Costs of all the\n\napplications are reserved to the Registrar.Sgd:Choo Han TeckJudicial CommissionerCopyright © Government of Singapore."
    }
}