{
    "case_title": "Re Baring Futures (Singapore) Pte Ltd (in compulsory liquidation) and another action",
    "ncitation": "[2002] SGHC 15",
    "coram": "Lai Kew Chai J",
    "sections": {
        "Cases referred to": "In re Pacific Coast Syndicate, Ltd [1913] 2 Ch 26 (refd)Norglen v Reeds Raines Prudential [1999] 2 AC 1 (refd)Re Atlantic Computer Systems plc [1992] Ch 505 (refd)Rowland & Ors v Gulfpac Limited [1999] Lloyd’s Rep Bank 86 (refd)",
        "Legislation referred to": "Companies Act (Cap 50) ss 172, 210JudgmentGROUNDS OF DECISIONOn 20 November 2001 I\n\ngranted leave to the Liquidators (\"BFS Liquidators\") of Baring Futures\n\n(Singapore) Pte Limited (in Liquidation) (\"BFS\") to convene a creditors’\n\nmeeting to agree, with or without modification, a scheme of arrangement as detailed in the\n\ndocument described as \"Proposals in Relation to A Scheme of Arrangement Under Section\n\n210 of the Companies Act (Cap 50)\" which is hereinafter referred to as \"the\n\nSingapore Scheme\". This was one of the predecessor steps which the BFS Liquidators,\n\nas required, had taken as they intended to make as soon as practicable interim dividend\n\npayments to certain creditors of BFS after having satisfied themselves that they had in\n\nplace the provisions of funding (which I shall in a moment describe in greater detail)\n\nsufficient to pay for and, in addition, meet any adverse costs orders, whether on the\n\nstandard or indemnity basis, which may be incurred by or made against BFS in its trimmed\n\ndown action (\"Auditors action\") against Deloitte & Touche Singapore\n\n(\"D&T Singapore\"). The Auditors action is shortly to continue before Justice\n\nEvans-Lombe in London, UK. It was envisaged that if the proposed Singapore Scheme was\n\napproved in all material respects at the creditors’ meeting I would resume hearing on\n\nthe eve of the New Legal Year 2002 to sanction the Singapore Scheme.2 A meeting of creditors of BFS was duly convened on 6 December 2001. A\n\nrepresentative of D&T Singapore attended the meeting. He informed the chairman and\n\nthose present that D&T intended to appeal against the BFS Liquidators’ rejection\n\nof D&T Singapore’s indemnity costs claim as well as their contribution claims\n\nagainst BFS which they had asserted against BFS in the Auditors action. The extent of the\n\nindemnity costs of D&T was stated to be S$42,459,135.57. The amount was the value\n\nwhich was attributed to D&T Singapore’s vote. D&T Singapore’s\n\ncontribution claim was regarded as not a provable debt in liquidation because BFS’s\n\ncontribution claim, an unliquidated claim in tort, was not specified in D&T\n\nSingapore’s first Proof of Debt. However, there was an indication in the first Proof\n\nof Debt that the total debt due was approximately S$3.86 billion.3 The Singapore Scheme was duly approved by a majority in number\n\nrepresenting three-fourths in value of the creditors present and voting either in person\n\nor by proxy. D&T Singapore’s proxy voted but on a without prejudice basis.4 On 7 December 2001 D&T Singapore filed the second Proof of Debt.\n\nIn an annexure to the prescribed Proof of Debt Form, they stated that they were appointed\n\nauditors of BFS in or about October 1986 and remained as auditors of BSF until about July\n\n1994. In particular, they were the auditors of BFS’s financial statements for the\n\nfinancial year ended 30 September 1992 and for the 15 month period ended 31 December 1993.\n\nThey further asserted that, among other terms, under their appointment, the terms of which\n\nincorporated the Articles of Association of BFS, they are entitled to an indemnity out of\n\nthe assets of BFS against all losses or liabilities which they may have incurred in the\n\nexecution of the duties of their office as auditors.5 Article 110 provides as follows:\"Every Director or other officer of the Company shall be entitled\n\n  to be indemnified out of the assets of the Company against all losses or liabilities\n\n  (including any such liability as is mentioned in the Act), which he may sustain or incur\n\n  in or about the execution of the duties of his office or otherwise in relation thereto,\n\n  and no such Director or other officer shall be liable for any loss, damage or misfortune\n\n  which may happen to or be incurred by the Company in the execution of the duties of his\n\n  office or in relation thereto. But this Article shall only have effect in so far as its\n\n  provisions are not avoided by the Act.\"6 D&T Singapore submitted that any such contractual claim for costs\n\nwill also be a claim in respect of which they are entitled to be paid in full, in priority\n\nto other creditors and in priority to costs and expenses incurred in the liquidation\n\n(other than those incurred in getting in, maintaining and realizing the assets).\n\nAlternatively, they claim priority as an expense of the liquidation in priority to other\n\ncreditors.7 As the BFS Liqudators joined issues with these submissions, I also\n\nhad before me two motions filed under the winding up petition. Under one motion, D&T\n\nSingapore are seeking an order that the decisions of the BFS Liquidators in rejecting the\n\ntwo Proofs of Debts filed in November and December last year be reversed and the further\n\norder that they be admitted in full. As noted earlier, D&T Singapore relied on the\n\ncontractual indemnity under Article 110 and they asserted that the liabilities they\n\nincurred were in respect of costs of defending proceedings brought by Baring PLC\n\n(\"PLC\") and Bishopscourt (BS) Limited (\"BSL\") in the High Court of\n\nEngland, Chancery Division and by the Singapore Public Accountancy Board\n\n(\"PAB\"). D&T Singapore observed that judgment was given in their favour in\n\nboth cases, although the BFS Liquidators contended that, in the absence of full disclosure\n\nof the PAB proceedings, it must be inferred that on the totality of the evidence there was\n\nevidence that the PAB had found D&T Singapore negligent, though not grossly negligent,\n\nwhich was probably the reason why they were found not guilty of any professional\n\nnegligence.8 I return to the Singapore Scheme for which sanction is sought from\n\nme. BFS Liquidators had also sued Coopers & Lybrand, Singapore for damages for\n\nnegligence. That action was settled. The settlement arrived at by all interested parties\n\ncontemplated making an interim distribution to the creditors of BFS, PLC and BSL mainly\n\nfrom the payment of 65 million by Coopers & Lybrand firms and from the existing\n\nassets of BFS, PLC and BSL. To continue to fund the litigation against D&T Singapore\n\nthe creditors have agreed to put in place 2 escrow accounts from which monies can be drawn\n\nby BFS, PLC and BSL. They are described as the Litigation Escrow Account and the Costs\n\nEscrow Account.9 For D&T Singapore, counsel postulated to me for consideration\n\nthis scenario. If the trial judge in the Auditors action in London exercises his\n\ndiscretion to award D&T Singapore its costs against BFS on the standard basis, and on\n\nthe assumption that Singapore courts finally determine that D&T Singapore as auditors\n\nare entitled to an indemnity under Article 110, counsel pointed out that the difference\n\nbetween the costs as awarded by the trial judge in the Auditors action and the full amount\n\nof costs they will have incurred would be \"in excess of 5 million\". I was told\n\nthat this figure is based on the assumptions that standard basis costs will be recovered\n\nat the rate of 75% of the gross costs and that under the indemnity D&T Singapore will\n\nrecover 90% of its gross costs.10 It should be noted that there were canvassed before me conflicting\n\nsubmissions of both parties in relation to the contractual claim of D&T Singapore\n\nunder Article 110. The BFS Liquidators adopted a root and branch counter-attack. They\n\nasserted, in the first place, that Article 110 was not even incorporated into the contract\n\nof engagement between D&T Singapore and BFS. Secondly, as a matter of strict\n\nconstruction, they contended that Article 110 did not entitle D&T Singapore to an\n\nindemnity in respect of its costs of the Auditors Action or the PAB proceedings. The\n\nprincipal submissions were (i) that those costs were not \"losses or liabilities\n\nsustained or incurred in or about the execution of (their) duties to the company or\n\notherwise in relation thereto\"; and (ii) that it was on the evidence never intended\n\nby the parties that Article 110 would provide an indemnity for such costs. In support of\n\nthe first named principal submission, they relied on the dicta of Rix J. (as he then was)\n\ninRowland & Ors v Gulfpac Limited[1999] Lloyd’s Rep. Bank 86, at 93col.\n\n1 where he stated: \"But costs incurred as an expense, …., or in England as part\n\nof the directors’ own English proceedings, are costs incurred in defending or\n\nprosecuting actions and are not, it seems to me, costs incurred or sustained in or about\n\nthe execution of a director’s duties to Gulpac or otherwise in relation\n\nthereto.\" On the other hand, counsel for D&T Singapore, especially in their\n\nsupplemental submissions, countered with some force that the words were clear and apt to\n\nconfer an indemnity for D&T Singapore costs if they successfully defend against the\n\nclaims for negligence, which is in line with the indemnity permitted under section 172(2)\n\nof the Companies Act.11 In relation to the treatment of the contractual claim of D&T\n\nSingapore as a matter of priority in the distribution out of the assets of the company,\n\ncounsel for D&T Singapore asserted that the contractual claim would fall within the\n\nprinciple of the estate costs rule as set out inIn re Pacific Coast Syndicate, Ltd[1913] 2 Ch 26 which was recently followed without discussion by the House of Lords inNorglen\n\nv Reeds Raines Prudential[1999] 2 AC 1, per Lord Hoffmann at p.20. Alternatively, and\n\nin any event, they submitted that the contractual claim would rank as an expense of the\n\nliquidation. They pointed to the \"critical feature\" of the claim which was that\n\nthe Auditors action was commenced by the BFS Liquidators after BFS was in liquidation.\n\nThey relied on the reasoning of Nicholls LJ (as he then was) inRe Atlantic Computer\n\nSystems plc[1992] Ch 505 at p 522 where he reasoned that in a case where a debt had\n\nbeen incurred for the benefit of the insolvent estate \"it is just and equitable that\n\nthe burden of the debt should be borne by those for whose benefit they insolvent estate is\n\nbeing administered.\"12 For the reasons which follow shortly, I have decided in the exercise\n\nof my discretion to defer determination of the indemnity and the super-priority or,\n\nalternatively, the expense claims of D&T Singapore until three events have come to\n\npast: viz, (1) BFS’s claims against D&T have been settled, or where a final\n\nnon-appealable judgment on D&T Singapore’s liability has been entered; (2) actual\n\nliability of BFS to D&T Singapore in respect of the costs of the BFS action has been\n\nfinally determined; AND (3) the Costs Escrow Account of 26 million has been exhausted\n\nand proven insufficient to meet the actual costs claims (whether decided on a standard or\n\nindemnity basis) of D&T Singapore. In the circumstances of this case, I feel\n\nuncomfortable exercising my discretion and granting reliefs where there are a number of\n\ncontingencies and where the taxed costs may be significantly below the funding already in\n\nplace. The appeals of D&T Singapore against the rejection of their two Proofs of Debt\n\nare also in consequence deferred for determination until after the abovementioned issues\n\nin relation to the alleged indemnity has been made. They are inextricably intertwined.13 The first of these reasons has to do with an analysis of the\n\nfigures. The following conclusions seem to me justified. If the settlement is implemented,\n\nthe amount of provision for D&T Singapore’s costs is 26 million. As at 5\n\nNovember 2001, D&T Singapore’s alleged estimated costs until end of trial are\n\napproximately 28.5 million and interest. As of that date, they would have spent 22\n\nmillion and they are incurring costs at the rate of 1 million a month. At this present\n\nburn rate, D&T Singapore will only hit 26 million at the end of February 2002. As of\n\ntoday, I am confident that until the end of February 2002 BFS still has sufficient cover\n\nto continue litigation against D&T Singapore.14 The Vice-Chancellor Sir Andrew Morrit, Head of the Chancery Division\n\nof the Royal Courts of Justice had recently overruled D&T’s objections and\n\nallowed interim distribution. The reason was, inter alia, the amount of costs claimed by\n\nD&T Singapore will probably be taxed down anyway. The Vice-Chancellor described the\n\ncosts of the litigation estimated by D&T Singapore as of \"quite astonishing\n\nsize’ and the London Liquidators of PLC and BSL had provided \"compelling\n\ncriticism of the amount of [D&T Singapore’s] costs and strong reasons for\n\nbelieving that the amount claimed will not be recovered to anything like that extent on a\n\ndetailed assessment.\". I also respectfully adopt the other material reasons of the\n\nVice-Chancellor.15 I accordingly sanction the Singapore Scheme as approved by the\n\nrequisite majority in value of the creditors. With the implementation of the settlement,\n\nthe estate will be allowed to be capitalized so that the BFS Liquidators have access to\n\nthe Costs and Litigation Escrow Accounts and can continue litigation until the point is\n\nreached where the liquidators are of the view that there would be insufficient funding to\n\ncover D&T Singapore’s costs and therefore have to consider terminating the BFS\n\naction against D&T Singapore and paying them the inevitable costs award or when BFS\n\ngets further funding from its creditors before continuing the said action. Last but not\n\nleast, and as the Vice-Chancellor had pointed out in his judgment, D&T Singapore have\n\nalternative routes to secure or provide for its costs even if the scheme is approved. I\n\nhave no reason to doubt that such alternative routes are available if the costs estimates\n\nof D&T Singapore are shown to be meritorious in London.16 Near the end of the hearing on 7 January 2002, counsel for the BFS\n\nLiquidators informed of the matters set out in the submissions and applied pursuant to\n\nsection 272(1)(d) of the Companies Act for sanction of the 7 netting off Deeds on\n\ncontribution liability and costs incurred in relation to the contributing proceedings. I\n\nhave considered the draft order which I now approve. Counsel for both parties are directed\n\nto settle the draft orders in accordance with my rulings herein and submit them to me for\n\napproval as soon as practicable.Sgd:Lai Kew ChaiJudgeCopyright © Government of Singapore."
    }
}