{
    "case_title": "China Airlines Limited v Philips Hong Kong Limited",
    "ncitation": "[2002] SGHC 131",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "2.        The facts giving rise to\n\nthe issue are straightforward. The respondents, Philips Hong Kong Ltd, shipped 1000\n\ncellular digital spark transceivers as cargo from Singapore to Hong Kong by China Airlines\n\nLtd, the appellants. The transceivers were put in nine cartons, and these were, in turn,\n\npacked as one single package or pallet, with a total weight of 154 kgs. A single air\n\nwaybill was made out by the respondents where against the item \"No of Pieces\n\nRCP\" the figure \"1\" was inserted and the gross weight was stated to be 154\n\nkg. No mention was made that the 1000 transceivers were packed in nine cartons.3.        When the package arrived in\n\nHong Kong, it was found to have been tampered with. Four cartons containing 440\n\ntransceivers, and weighing 60 kgs, were missing. The total value of the missing\n\ntransceivers is US$74,360.",
        "The applicable provision": "4.        It is common ground that\n\nthe carriage was subject to the amended Convention and Article 22(2) thereof reads as\n\nfollows:-(a)     in the carriage of\n\n  registered baggage and of cargo, the liability of the carrier is limited to a sum of 250\n\n  francs       per kilogramme, unless the passenger or\n\n  consignor has made, at the time when the package was handed\n\n  over              to the\n\n  carrier, a special declaration of interest in delivery at destination and has paid a\n\n  supplementary sum\n\n  if                  \n\n  the case so requires. In that case the carrier will be liable to pay a sum not exceeding\n\n  the declared sum,\n\n  unless             he proves\n\n  that that sum is greater than the passenger’s or consignor’s actual interest in\n\n  delivery at destination.(b)     In the case of loss, damage\n\n  or delay of part of registered baggage or cargo, or of any object\n\n  contained               \n\n  therein, the weight to be taken into consideration in determining the amount to which the\n\n  carrier’s liability\n\n  is                   \n\n  limited shall be only the total weight of the package or packages concerned. Nevertheless,\n\n  when the\n\n  loss,                  \n\n  damage or delay of a part of the registered baggage or cargo or of an object contained\n\n  therein, affects\n\n  the                  \n\n  value of other packages covered by the same baggage check or the same air waybill, the\n\n  total weight of\n\n  such               \n\n  package or packages shall also be taken into consideration in determining the limit of\n\n  liability.5.        The dispute between the\n\nparties is as to how the limit of liability under Article 22(2)(b) is to be computed in\n\nthe fact situation here. The appellants argued that the cartons within the pallet should\n\nbe the basis upon which the limit of liability would be computed and this would give a\n\nfigure of $2,974.80. On the other hand, the respondents contended that the correct basis\n\nis the pallet and not the sub-package (i.e. the cartons) and on this basis the amount\n\nwhich the respondents would have to be compensated would be $7,635.32. In the court below,\n\nKan Ting Chiu J ruled in favour of the respondents.6.        Article 22(2) of the\n\noriginal Convention did not have sub-article 2(b), which was inserted by the Hague\n\nProtocol. Sub-article 2(b) was introduced to answer one of the problems inherent in\n\nArticle 22 of the original Convention as to how the limit of liability was to be computed\n\nwhere only part of the registered baggage or cargo was damaged or lost. The sub-article\n\nclarifies the position by providing that the total weight of the \"package or packages\n\nconcerned\" is to be taken in computing the limit of liability. The author (Rex C\n\nTester) of the publication,Air Cargo Claims, explains the application of this\n\nprovision with this illustration (at p 83) :-Sub-article 2(b) provides that the weight to be taken\n\n  into account in determining the limitation is the total\n\n  weight            of the package or\n\n  packages concerned. Thus, under the unamended Convention, if 1 kilo were missing from\n\n  a               10\n\n  kilo package, liability would arise on 1 kilo; under Warsaw/Hague, if 1 kilo were missing\n\n  from a 10\n\n  kilo              \n\n  package, then liability would arise on 10 kilos. Clearly, this is of considerable\n\n  importance, as it represents\n\n  an              \n\n  improvement for claimants.7.        While sub-article 2(b) is\n\nof tremendous help in resolving many of the problems relating to the computation of limit\n\nof liability, it does not appear to have done so completely, or so it seems from the\n\ncontentions of the appellants. We would have thought that sub-article 2(b) is clear\n\nenough, and that the basis for computation is, in every instance, the package. This must\n\nnecessarily refer to the package which is for all to see and would have been so recorded\n\nin the air waybill. The appellants’ contention would require us to look into the\n\npackage to see whether there is any sub-packaging, and if so, then the weight of the\n\nlatter should be used as the basis for the computation of the limit of liability, in so\n\nfar as goods within that sub-package are concerned.",
        "Cases under the Hague-Visby Rules": "8.        We would at this juncture\n\ndeal with an argument based on the approach taken by the courts in carriage of goods by\n\nsea governed by the Hague Rules and the Hague-Visby Rules. A parallel was sought to be\n\ndrawn. A good illustration of the point is the caseThe \"River Gurara\"[1998] 1 Lloyd’s Rep 225 which concerned the application of the Hague Rules where in\n\nArticle 10 r 5, the material part of which provided that \"neither the carrier nor the\n\nship shall in any event be or become liable for any loss … to … goods in an\n\namount exceeding 100 per package or unit …\"9.        The cargo in question was\n\ncontainerised. But the bill of lading (B/L) did specify the number of \"bales\" or\n\n\"parcels\" or \"bags\" or \"carton\" or \"pallets\" in\n\neach container. At first instance, Colman J held in favour of the cargo-owners to the\n\neffect that it was the number of items described on the B/L as being within the container,\n\nrather than the number of the containers themselves, that was the basis for calculating\n\nthe limit in respect of the cargo loss. While the Court of Appeal upheld this decision, it\n\ndid not do so on the same ground.10.        Phillipps LJ noted that a\n\nhuge metal container stuffed with goods which would normally be made up of individual\n\npackages was not naturally described as a package. He then went on a review of the US\n\ncases on the issue. In some jurisdictions the \"functional economics test\" was\n\nadopted, namely, whether the contents of the container could have feasibly been shipped in\n\nthe individual packages or cartons in which they were packed by the shipper (seeThe\n\nKulmerland[1973] 2 Lloyd’s Rep 428). But this test was not accepted in other\n\njurisdictions. InHayes Leger Associates Inc v M.V. Oriental Knights765 F 2d 1076\n\n(1985) the court held that where the B/L disclosed the number of packages in a container,\n\nthe limit of liability applied to each of those packages. But where the B/L only listed\n\nthe number of containers and not the number of packages within each container, then the\n\nliability limitation applied only to the containers.11.        This latter approach was\n\napparently also adopted by the courts in Canada, Holland, France and Sweden. While noting\n\nthe desirability of uniformity in the interpretation of an international convention,\n\nPhillips LJ was unable to accept the approach advanced inHeyes Leger Associates.\n\nHis reasons were (at p.233):-\"The Hague Rules limitation provisions were\n\n  designed to prevent shipowners imposing on shippers\n\n  unrealistically           low limits of\n\n  liability. If the parties are permitted to agree their own definition of\n\n  ‘packages’, shipowners will,\n\n  by            applying that\n\n  definition to containers, succeed in evading the minimum limit of liability that the Hague\n\n  Rules aimed            to secure.12.        While Mummery LJ agreed\n\nwith the approach of Phillips LJ, the third member of the quorum, Hirst LJ, like Colman J\n\nbelow, took the American and Canadian approach.13.        In contrast, and\n\nreflecting the US-European approach, isStandard Electrica S.A. v Hamburg\n\nSudamerikanische Dampfschiffahrts-Gesellschaft[1967] 2 Lloyd’s Rep 193, a\n\ndecision of the US Court of Appeals (Second Circuit). There, seven pallets were lost, and\n\neach contained six cartons. The issue there was whether the pallets or the cartons\n\nconstituted ‘packages’ for the purpose of limitation. All relevant documents,\n\nincluding the B/L, regarded each pallet as a package. The court held that the pallets\n\nconstituted packages for limitation purposes. Chief Judge Lumbard said (at 195):-\" … we think that such characterisations are\n\n  entitled to considerable weight in that the parties each had the\n\n  same            understanding as to\n\n  what constitute a ‘package’ and reflect the meaning given to that term by the\n\n  custom and             usage\n\n  of the trade.\"14.        Be that as it may, we note\n\nthat there are two features which differentiate the regime under the Hague and Hague-Visby\n\nRules and that under the Warsaw Convention, original or amended. In the former the\n\nlimitation is expressed as a particular amount per package while under the latter it is\n\nexpressed as a specified amount per kilogram per package. Under the former, it is in the\n\ninterest of the carrier/shipowner to limit the number of packages being carried. So the\n\nlarger the package the more beneficial it would be for the carrier/shipowner. But under\n\nthe latter, the situation is in the reverse, the smaller the size of the package, the\n\nbetter it would be for the air-carrier, as that would mean that if an object in a package\n\nis damaged or lost, the applicable limit of liability would be lower.15.        Second, in the Hague-Visby\n\nRules, there is a specific deeming provision (Article IV, rule 5[c]) touching on\n\ncontainerisation to consolidate goods (absent in the amended Convention):-Where a container, pallet or similar article of\n\n  transport is used to consolidate goods, the number of packages\n\n  or            pieces enumerated in\n\n  the bill of lading as packed in such article of transport shall be deemed the number\n\n  of              packages\n\n  or units for the purposes of this paragraph as far as those packages or units are\n\n  concerned. Except\n\n  as             aforesaid such\n\n  article of transport shall be considered the package or unit.This deeming provision, if applicable inThe River\n\nGurara,would have provided the answer for that case.16.        Like the judge below, we\n\ndo not think it is necessary to rely on the construction given by the courts to the Hague\n\nand/or Hague-Visby Rules to construe the provision in the Warsaw Convention, original or\n\namended. The approach taken by the majority inThe River Gurara, would appear to\n\nassist the appellants and that by the US-European cases, the respondents. The one feature\n\ncommon to both regimes is that they use the simple English word \"package\".",
        "Purposive interterpretation": "17.        The appellants aver that\n\nin arriving at his conclusion the judge below did not have sufficient regard to the\n\nobjects of Article 22 and the Convention. Reliance is placed on the decision of this Court\n\ninYusen Air & Sea Services (S) Pte Ltd v Changi International Airport Services Pte\n\nLtd[1999] 4 SLR 135to argue that a purposive interpretation should be given to\n\nArticle 22. InYusen Air, the issue was whether the term \"carrier\" in\n\nArticle 22 of the original Convention should be interpreted to cover the carrier’s\n\nservant and agents when they acted in furtherance of the contract of carriage so that the\n\nservant and agents would also enjoy the limit of liability prescribed therein. This court\n\nruled that it did and, having reviewed the authorities, including those from foreign\n\njurisdictions, said –\"We find a common feature in these cases: it is a\n\n  recognition of the commercial reality that, if a plaintiff\n\n  is              permitted\n\n  to sue the carrier's agents or servants to recover the full extent of his loss, the\n\n  carrier would\n\n  indirectly             have to\n\n  be responsible for such losses through the provision of indemnities to its agents or\n\n  servants acting\n\n  in              \n\n  furtherance of the contract of air carriage. This would be contrary to one of the main\n\n  objects of the\n\n  Warsaw             Convention,\n\n  that is, to protect air carriers from claims beyond the prescribed limits.\"18.        We concur that the amended\n\nConvention should, like the original Convention, also be given a purposive interpretation.\n\nBut taking that approach alone does not necessarily lead one to the result contended by\n\nthe appellants. The object of Article 22 is to set a limit as to the liability of the\n\ncarrier and it prescribes a formula as to how the limit is to be arrived at. While we\n\nstated inYusen AirandSingapore Airlines Ltd v Fujitsu Microelectronics\n\n(Malaysia) Sdn Bhd[2002] 1 SLR 241that the Convention, both original and the\n\namended, seeks to protect the carrier, by setting limits as to its liability, we do not\n\nthink that that means that any conceivable manner of construction which would reduce the\n\nlimit of the carrier’s liability should be adopted. That is not what the amended\n\nConvention provides. Neither is that the case under the original Convention. The\n\nConvention seeks to strike a balance between the interest of the carrier and those of the\n\npassengers/consignors.19.        The literal meaning of\n\n\"package\" includes a wrapper, case, bag, envelope and anything that holds things\n\ntogether. It can be large or small. It could include a \"container\" or a\n\n\"pallet\". There is really no technical meaning to it. Clearly, the word\n\n\"package\" must be construed in the light of the provisions of the amended\n\nConvention as a whole. There is nothing in Article 22(2)(b) to indicate that\n\n\"size\" is a factor in relation to a package. In our opinion, the construction\n\nwhich a court gives to the word \"package\" must be reasonable and fair, and it\n\nmust also promote certainty.20.        Counsel for the parties\n\nhave informed us that though they have carried out an extensive search, including foreign\n\njurisdictions, there is a dearth of authorities on the issue. InData Card Corporation\n\nv Air Express International Corporation[1983] 2 Lloyd’s Rep 81, a single air\n\nwaybill was issued in respect of a consignment which was described as comprising eight\n\npackages with a gross weight of 3,132.5 kg, consisting of calendering/embossing machines.\n\nOne of the packages was dropped while being off-loaded at Heathrow Airport and the machine\n\ntherein was damaged.This case concerned the interpretation of Article 22 of the\n\noriginal Convention.The argument there was whether the calculation of limit of damage\n\nshould be based on the weight of that one package or on the weight of the total\n\nconsignment and the court ruled that it was the former. It must also be borne in mind thatthe air waybill did refer to eight packages. Thus the case is really of no\n\nassistance.",
        "Containerisation": "21.        The problem, involving\n\nseveral shipments assembled in a container by a freight forwarder and covered by just one\n\nair waybill, identified by several writers, including the author R H Mankiewicz in\"The\n\nliability regime of the international air carrier\", Deventer 1981 No. 152, do not\n\narise here.22.        The authors,Giemulla\n\nand Schmid on Warsaw Convention(Supp 13),made the following observations:-In the meantime this regulation has gained immense\n\n    practical importance, owing to the common practice of transporting goods in containers. As\n\n    regards the determination of damages, the problem is to determine, whether the package\n\n    concerned is to be viewed as a separate shipment in itself or just as a single part of a\n\n    shipment.  Against the background of Articles 18 and 22 which have been created to\n\n    provide compensation on the basis of actual loss, the following will have to be taken into\n\n    consideration if the carrier had to pay damages for the value of the entire shipment, he\n\n    might possibly be held responsible for damage which in actual fact did not occur. There\n\n    would be no justification for determining damages on the basis of the total weight of a\n\n    container where only part of its contents was in fact affected. The purpose of packing\n\n    single packages into containers is to facilitate transport, for example, by ensuring the\n\n    single parts of so calledcollective consignmentsare forwarded, and to provide\n\n    better protection of the individual package. The fact that single packages are collected\n\n    in a container does not give additional value to the consignment, which would be lost in\n\n    the event of damage to the whole package.Although a distinction between ‘total package’\n\n    and ‘single package’ was inserted for the first time by the Hague Protocol, this\n\n    regulation is used by US courts in interpreting the Convention. Furthermore, in their\n\n    opinion the single package is decisive in the determination of damages, where a separate\n\n    air waybill has been prepared in respect of it. In a case in which part of a shipment of\n\n    hard disk drives was damaged, by contrast, the US District Court determined damages on the\n\n    basis of the weight of the entire shipment. The court pointed out that the consignee had\n\n    had to examine all parts of the shipment in order to sell them at normal market prices.\n\n    This also applies if only one single package of a total consignment (here, computers) was\n\n    damaged.US jurisprudence also supports this\n\n    view by drawing an analogy with Article 2 of ‘The Hague – Visby Rules’\n\n    (Maritime Transport Law) which contains regulations to the same effect23.        Similarly, the authors ofShawcross\n\n& Beaumont on Air Law (4thEdn) Vol 1at viii (p.604) also made these\n\nremarks (relied upon by the appellants):-In the case of a container carried under a single air\n\n  waybill but comprising a consolidated consignment made up\n\n  of       goods belonging to several different persons, the\n\n  effect of these rules is that the relevant weight is that of\n\n  the              damaged\n\n  items only, subject to the possibility that the value of other items in the container may\n\n  also be affected in         which case the weight\n\n  of those items may also be taken into consideration. Nothing seems to turn, for\n\n  this             purpose, on\n\n  the extent of the particulars as to the container’s contents included in the air\n\n  waybill; it\n\n  seems             \n\n  incorrect to hold, as a Dutch court has done, that the ‘packages concerned’ will\n\n  be those damaged insofar\n\n  as              they are\n\n  separately identified in the air waybill (the implication being that if no details are\n\n  given the goods carried           \n\n  under an air waybill are to be treated as a single whole).24.        It seems to us that the\n\ncomments of Giemulla & Schmid that \"there would be no justification for\n\ndetermining damages on the basis of the total weight of a container, where only part of\n\nits contents was in fact affected\" were made in the context where goods of several\n\nconsignors were stuffed in a single container by a freight forwarder, and in respect of\n\nwhich one air waybill was issued denoting only one item. The authors could not have\n\nintended the comments to apply where all the goods in a container belonged to one\n\nconsignor, irrespective of whether those goods were placed in smaller packages. It is\n\nunderstandable why the point was taken that an owner of goods, which formed a part of the\n\ncargo in a container, should not be allowed to enjoy the benefit of consolidated freight\n\nin so far as determining the limit of liability is concerned.25.        The Dutch District Court\n\ncaseWorld Airlines v Nieuw Rotterdamreferred to by Shawcross & Beaumont (only\n\nas described by T M Kolle in an article published inAir Law Vol viii, 1983as a\n\ncopy of the report of the case was not obtainable by counsel) involved a carrier receiving\n\nfrom a freight forwarder, aconsolidatedfreight consignment, a container weighing\n\n1,382 kg, consisting of 64 crates of which ten belonged to a consignor, Edax. The ten\n\ncrates weighed 359 kg. Only one joint air waybill was issued to the forwarder on which was\n\nstated \"consolidated freight … consisting of 64 cartons\". On arrival in\n\nAmsterdam, between 4 to 6 crates of Edax were damaged. The point in issue was whether it\n\nwas the container as a whole or just the damaged crates which should be regarded as the\n\n\"package concerned\" for the purpose of calculating the maximum liability of the\n\ncarrier. The carriage was governed by the amended Convention. The court ruled that as the\n\nair waybill specified the number of cartons, and what was in the container was\n\nconsolidated freight, the relevant weights to be taken into account for reckoning the\n\nlimit of liability were those of the damaged cartons and not the weight of the entire\n\ncontainer. In coming to its conclusion the court applied the rationale in the Hague-Visby\n\nRules relating to the limit of liability for sea carriage in containers.26.        In any case, we are not\n\nhere dealing with a situation where goods of several consignors were stuffed by a freight\n\nforwarder in one container and declared by the forwarder to be simply one item. Here, no\n\ncontainerisation was involved. The goods in question belonged entirely to the respondents\n\nand they were placed in cartons for a more secured carriage.27.        We will, therefore, not\n\nexplore any further as to the difficulties that consolidated freight, carried in a\n\ncontainer, may pose. Whether there is a need for the international community to enact\n\nsomething similar to Article IV, rule 5(c) of the Hague-Visby Rules is a matter for the\n\nappropriate international organisation to pursue.",
        "Was there an error?": "28.        The appellants next rely\n\non Article 11(2) of the amended Convention to argue that what is stated on a B/L is not\n\nconclusive:-The statements in the air waybill relating to the\n\n  weight, dimensions and packing of the cargo, as well as\n\n  those              \n\n  relating to the number of packages, areprima facieevidence of the facts stated;\n\n  those relating to the\n\n  quantity,              \n\n  volume and condition of the cargo do not constitute evidence against the carrier except so\n\n  far as they both have           \n\n  been and are stated in the air waybill to have been, checked by him in the presence of the\n\n  consignor, or relate to           the\n\n  apparent condition of the cargo.29.        Thus the statement as to\n\nthe number of packages on an air waybill is onlyprima facieevidence of the same.\n\nThat must be so. Obviously, if there is a clear error as to the number of packages that is\n\nwritten on an air waybill, the carrier must be allowed to adduce evidence to show what was\n\nthe true number of packages which were consigned to the carrier. Otherwise, it would mean\n\nthat even if the carrier were able to demonstrate that what was written was clearly in\n\nerror (be it due to a clerical mistake or other causes) the carrier would nevertheless\n\nhave to indemnify the consignor for a package or packages that were never consigned for\n\ncarriage. Similarly, the carrier should be allowed to prove an error as to what was\n\nrecorded as the weight of a package.30.        But it is altogether\n\nanother matter to say that there is an error in the description of a package just because\n\nthe goods in that package were packed in nine smaller packages. The carrier and/or its\n\nagent would have seen that there was this one big package, measuring 120 x 100 x 68 cm.\n\nThat was the basis upon which the contract of carriage was entered into. Where is the\n\nerror? One need not have a highly imaginative mind to appreciate that the approach\n\ncontended for by the appellant carrier would give rise to uncertainty and or unnecessary\n\ncontroversies. What then would have been the position if the articles (every one of which\n\nwas placed in a box) were just stacked therein without being held together in some kind of\n\nsmaller packages like boxes or cartons? Are we therefore to say that where an article\n\ntherein is damaged, the computation of the limit of liability is to be based on the weight\n\nof that box containing the article and nothing else? If that is to be the approach, then\n\nit would be clearly inconsistent with the express terms of Article 22(2)(b) which provide\n\nthat where an object in a package is damaged, the weight to be taken into consideration to\n\nreckon the limit of liability is the total weight of the package. Why should it make a\n\ndifference whether or not the transceivers were placed in cartons or boxes for better\n\nprotection during carriage?31.        There can also be\n\ncontroversy as to what would constitute a package in the sense contended by the\n\nappellants. Say, if the boxes containing the transceivers were not placed in cartons but\n\ntied together extensively, would that constitute packages? What if some were placed in\n\ncartons but some were not? Article 22(2)(b) also applies to a check-in baggage of a\n\npassenger. Suppose a passenger checks-in a big bag and he puts in the bag an article which\n\nhe bought in a foreign land with its original packaging and that article was found missing\n\non arrival. Is it to be said that the limit of liability is to be reckoned only from the\n\nweight of the box containing the article and not the entire bag, which would include his\n\nclothing and other personal belongings which were never boxed?32.        While we recognise that\n\ncontroversies can never be eliminated, whichever approach is adopted, we are of the view\n\nthat the approach taken by the court below and which we endorse, reasonably promotes\n\ncertainty and is also in line with the object of the amended Convention. To allow opening\n\nup of a package to see what is the packaging inside is certainly more likely to encourage\n\ndisputes. After all, upon receipt of a \"package\" for carriage, whether it be a\n\ncheck-in bag of a passenger or cargo, the carrier knew the extent of its maximum liability\n\nin respect of that package. In the words of the authors Giemulla & Schmid, the purpose\n\nof the Convention, in establishing liability limits, is to \"enable the carrier to\n\ncalculate his risk.\" This object will not be undermined by our decision.33.        Article 22(2)(b) refers to\n\na package or packages and not to sub-package. We should not be concerned with\n\nsub-packaging which does not appear to the eye and never formed the basis for the contract\n\nof carriage. While an air waybill is made out by the consignor, the carrier or its agent\n\nhas the right to accept or reject the consignment. Every air waybill is made out in 3\n\noriginal parts. The first part is for the carrier and it must be signed by the consignor.\n\nThe second part is for the consignee and it must be signed by the consignor and the\n\ncarrier. The third part is for the consignor and it must be signed by the carrier after\n\nthe goods have been accepted (see Article 6 of the amended Convention). As far as carriage\n\nof cargo is concerned, the contract is concluded at the time the consignment is accepted.34.        Under Article 7 the\n\ncarrier has the right to require the consignor to make out separate air waybills when\n\nthere is more than one package. Furthermore, there can be no doubt that a carrier has the\n\nright to set the weight limit for each package if it were concerned about the question of\n\nlimit of liability. It is a matter which lies within its discretion. In this way the\n\ncarrier could set the maximum extent of its liability for loss or damage of a package. In\n\nits Case, the appellants seem to be suggesting that there could be difficulties in\n\neffecting control in this manner. There is no evidence of that. One should not equate\n\ncommercial consideration or expedience with impracticality or impossibility.35.        At this juncture, we must\n\nrefer to a pertinent recent case which was cited to us by the respondents. But we should\n\npoint out that it was a decision of an English County Court:Electronics Discount\n\nCentre Ltd v Emirates Skycargo(judgment of 8 April 2002). There the plaintiff\n\nconsigned four cartons of 600 mobile telephones, with a total weight of 301 kg. During\n\ncarriage 110 mobile telephones went missing from three of the four cartons. The total\n\nweight of the missing mobile telephones was only 55 kg. But the total weight of the three\n\ncartons was 213.5 kg. The court there took judicial notice of the fact that each of\n\nthe mobile telephone would have been packed in a smaller box, which would also have\n\ncontained a manual, guarantee card and possibly a battery charger. The carrier argued that\n\nfor the purpose of Article 22(2)(b), there were in fact 600 packages instead of four\n\npackages and that the correct weight of the cargo for the purposes of determining\n\nlimitation under that Article was 55 kg, namely, the total weight of the 110 missing\n\nmobile telephones.36.        The Deputy District Judge\n\nruled that the relevant moment to consider the number of package or packages was at the\n\ntime the parties entered into the contract of carriage. As the contract provided that\n\nthere were \"4 pieces\", he found that the \"package or package\n\nconcerned\" in Article 22(2)(b) were the four cartons. The carrier did not even know\n\nthat there were 600 mobile telephones in the four cartons, only that they contained\n\n\"electronic equipment\". He was not impressed with the carrier’s argument\n\nthat this approach would lead to some surprising results in that for example the value\n\npaid per mobile telephone lost would depend on the number of telephones lost from each of\n\nthe four cartons.37.        Like the Deputy District\n\nJudge inElectronics Discount Centre, we agree that such an anomaly is inevitable\n\nas the amended Convention by providing for a fixed sum of compensation (based on weight)\n\ndoes not take into account the real value of the goods, subject, of course, to the proviso\n\nthat a consignor cannot claim for more than the losses he actually suffers.",
        "Judgment": "38.        In our judgment, whether\n\nit is the literal interpretation or the purposive interpretation which we should apply to\n\nArticle 22(2)(b), the answer, on the facts of this case, remains the same: the computation\n\nof the limit of liability should be based on the package as a whole. The answer could have\n\nbeen different if the consignor had indicated that in that one big package there were,\n\nsay, some nine sub-packages. However, we express no definite opinion on this as it does\n\nnot arise here. What we would say is that we do not think the approach we endorse herein\n\nwill give rise to any real mischief and if there should be any, the remedy lies entirely\n\nin the hands of the carrier.39.        It is true, as the\n\nappellants contend, that Article 22 is a compensation provision. They also argue that this\n\nArticle is not intended to unjustly benefit the consignor and that where only a part of\n\nthe cargo is lost, the carrier is entitled to bring evidence to show the weight of the\n\nlost cargo. But we are unable to see how there could be any unjust benefit or unjust\n\nenrichment. We would reiterate that a consignor can never recover more than his actual\n\nloss. As the learned author, Tester, states in his work (see 6 above), the amended\n\nConvention improves the position of the consignor. It merely provides for a higher cap on\n\nthe compensation due to the consignor and nothing more. Of course, if this cap is more\n\nthan his actual loss, the consignor is only entitled to be compensated up to the actual\n\nloss. Here we would quote from the Grounds of Judgment of the court below:-18.     This argument arises from a\n\n    fallacy. Article 22(2) sets the limit to the compensation payable. It says that for lost,\n\n    damaged or delayed cargo, the compensation shall not exceed 250 francs per kilogramme of\n\n    the package or packages concerned. It does not fix the compensation at 250 francs per\n\n    kilogramme of the package or packages lost, damaged or delayed.19.     Article 22 does not enable a\n\n    consignee to recover more than its loss. If a consignee suffered a loss of 1,000 francs as\n\n    a result of the loss, damage or delay of its goods in a consignment of 50 kilogrammes, it\n\n    cannot recover 12,500 francs. The most it can recover is 1,000 francs, and less if the\n\n    compensation is   reduced by limitation. This is evident in the present case.\n\n    The value of the lost transceivers is US$74,360.  The plaintiff limits its claim to\n\n    $7,635.32, while the defendant contends that it should be limited \n\n    to             $2,974.80. The\n\n    defendant may argue that the plaintiff’s claim is subject to a lower limitation (if\n\n    the number of packages is taken as 9), but it is overstating the case to complain that the\n\n    claim would result in an unjust benefit to the plaintiff.40.        With respect, we think the\n\narguments of the appellants in the circumstances of this case, if accepted, would bring us\n\nright back to the position before the amendments were made to Article 22(2) by the Hague\n\nProtocol: compensate based on the weight of what is missing/damaged and nothing more.41.        In the premises, we agree\n\nwith the opinion of the court below. The appeal is dismissed with costs. The security for\n\ncosts, with any accrued interest, should be released to the respondents’ solicitors\n\nto account of the respondents’ costs.Sgd:YONG PUNG HOWCHAO HICK TINTAN LEE MENGCHIEF JUSTICEJUDGE OF\n\n    APPEALJUDGE"
    }
}