{
    "case_title": "L.K. Ang Construction Pte Ltd v Chubb Singapore Private Limited",
    "ncitation": "[2002] SGHC 309",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "Whether there was a binding\n\nsub-contract": "27.\n\n        It was not disputed that a signed sub-contract\n\nwas contemplated and that no such agreement was signed. The plaintiff contended that a\n\nsub-contract came into being on 18 Jan 2002, while the defendant’s position was that\n\nthere was no sub-contract till it was signed.28.\n\n        A review of the contemporaneous documents will\n\nhelp to determine which position is correct. The starting point is the defendant’s\n\ntender offer dated 18 Oct 2001 in the form furnished by the architect. The offer was\n\naddressed to the employer and stated that9) If our tender is accepted we\n\n    undertake to enter into a Sub Contract with the Main Contractor in accordance with The\n\n    Conditions of Sub-Contract;… …11) We agree that until a formal\n\n    agreement is prepared and executed this tender together with the Letter of Acceptance\n\n    thereof by the Employer shall constitute a binding contract between us.29.\n\n        The defendant was informed by the M&E\n\nconsultant that its bid was accepted. The consultant informed the defendant in its letter\n\nof 5 Dec 2001Letter of IntentWe refer your tender submission\n\n    on 20thSeptember 2001 and are pleased to inform that we intend to appoint you\n\n    as the Nominated Sub Contractor for the above caption subject to the following terms and\n\n    conditions:1. Nature of SubcontractWith the issuance of this Letter\n\n      of Intent, the Architect shall forthwith be nominating you as the Nominated Subcontractor\n\n      to the Main Contractor.Subject to the reasonable\n\n      objection by the Main Contractor to the nomination, you shall upon his acceptance of the\n\n      nomination become his Nominated Subcontractor and shall enter into a Subcontract Agreement\n\n      with him in accordance with the terms and conditions of the Subcontract, construed\n\n      consistently with the requirements of the Main Contract insofar as they concern the Works\n\n      under this Subcontract.The Form of Subcontract shall be\n\n      the Conditions of Subcontract for use in conjunction with the SIA Main Building Contract\n\n      (Articles and Conditions of Building Contract, Sixth Edition, 1999) issued by the\n\n      Singapore Institute of Architects.The identity of the main\n\ncontractor was not disclosed in this letter.30.\n\n        The architect also informed the plaintiff of\n\nthe selection of the defendant. In its letter of 6 Dec 2001 it instructed the plaintiff to\n\nenter into a nominated sub-contract and issue a letter of award to the defendant.31.\n\n        In compliance with the instruction the\n\nplaintiff wrote to the defendant on 18 Jan 2002 thatWe refer to the enclosed\n\n    Architect’s Instruction No. A 01 dated 6 December 2001 and are pleased to appoint you\n\n    as the Nominated Sub-Contractor for the Fire Protection Installation Work for the\n\n    above-mentioned project.… …The formal contract will be\n\n    issued to you in the near future.You shall take this letter as\n\n    instruction to proceed with the preparation of the works for the timely delivery according\n\n    to our project schedule. Please note that the terms and conditions of your Sub-Contract\n\n    shall be same as the Main Contract as far as your scope of works and shall be strictly\n\n    followed.32.\n\n        Two points stand out in these documents. First,\n\nthere was the consistent reference to the execution of a formal contract, and no\n\nindication of the formation of a sub-contract between the plaintiff and the defendant at\n\nany time before that.33.\n\n        Second, the defendant’s tender offer in\n\nthe form furnished by the architect provided that until the execution of a formal\n\nagreement, the tender and the employer’s letter of acceptance constituted a binding\n\ncontract between it and the employer. Consequently when the letter of 5 Dec 2001 was\n\nissued, there was a binding agreement between the defendant and the employer which was to\n\nbe replaced by a sub-contract between the defendant and the plaintiff when the formal\n\nagreement is executed. If there was also a sub-contract between the defendant and the\n\nplaintiff prior to the execution of the formal agreement, the defendant would have similar\n\ncontracts with the employer as well as the plaintiff at the same time. This cannot be the\n\nintention of the parties.34.\n\n        The plaintiff argued that the M&E\n\nconsultant’s letter was not the Letter of Acceptance, that it was no more than a\n\nletter of intent (as the letter was captioned) by the M&E consultant which was not\n\nstated to be written on behalf of the employer.35.\n\n        This argument ignored some important facts. The\n\nletter was issued by the M&E consultant specifically in response to the\n\ndefendant’s tender submission. Furthermore the letter referred to \"this letter\n\nof award\" and \"this Letter of Award\". Counsel did not venture to suggest\n\nwhat was awarded if it was not the sub-contract for the FPI works. The letter can only be\n\nfairly construed as a letter of acceptance. If it was not, it would appear that the\n\ndefendant’s tender offer was never accepted by the employer, and that was not\n\nconsistent with the plaintiff’s own case.36.\n\n        Nevertheless the plaintiff’s case is that\n\nthere was a contract between itself and the defendant despite the absence of the formal\n\nagreement. It argued that by 18 Jan the terms of the sub-contract were settled, and there\n\nwere no further terms to be resolved, and when the plaintiff appointed the defendant as\n\nthe sub-contractor, a contract was formed. This argument overlooked the fact that the\n\nletter of 5 Dec identifying the form of sub-contract was not from the plaintiff. It was\n\nissued by the M&E consultant on behalf of the employer, with no reference to the\n\nplaintiff. Although the parties in the tendering process were aware of the form of the\n\nsub-contract to be entered into, there was nothing which points to an agreement between\n\nthe plaintiff and the defendant to enter into the sub-contract between themselves in that\n\nform.37.\n\n        The plaintiff also submitted thatIn respect of building contracts,\n\n    the entering into a formal contract in the future does not prevent a contract from being\n\n    formed if the material terms are settled and work commences at the site. In building\n\n    contracts the parties often provide that a formal contract will be executed in the future.\n\n    Unlike conveyancing practice for instance, the building contract will come into effect\n\n    once all the terms have been settled and work commences at the site.38.\n\n        That is partly correct. The requirement for\n\nsigning a formal contract may be just that – a formality. But it may be more than\n\nthat, and it is necessary in each case to consider all the circumstances to decide if an\n\nagreement has come into being without the formal document. However it is wrong to contend\n\nwithout such consideration that an agreement willcome into effect, as it is wrong\n\nto say that it will not.39.\n\n        We should not apply contractual rules\n\ndifferently to different activities. Parties engaged in all activities should conduct\n\ntheir affairs in compliance with the rules, and should not expect that the rules be\n\nadapted for them. The parties had intended that there was to be a signed agreement. They\n\nhad not stated expressly or impliedly that there was to be a sub-contract before or\n\nwithout a signed agreement, or that the execution of the agreement was a matter of\n\nformality only.40.\n\n        Counsel submitted that the parties to a\n\nbuilding contract may be more concerned with the execution of the contracted works than\n\nthe contract document, and are apt to delay or overlook the execution of the contract.\n\nEven if that were so, the rules do not have to be applied differently. There are existing\n\nrules which can assist an aggrieved and deserving party, particularly the rules of waiver\n\nand estoppel. If indeed the parties had acted on the basis that there was a concluded\n\ncontract, neither of them should be allowed to evade liability because the formal\n\nagreement was not signed.41.\n\n        But that was not the plaintiff’s case, and\n\nwaiver and estoppel were not raised. If they were pleaded, was either established? The\n\ndefendant was informed that it was selected on 5 Dec. On 18 Jan the plaintiff appointed\n\nthe defendant as its nominated sub-contractor. On 18 Feb, the defendant requested for a\n\nchange in the payment terms. It did not make any representation to the plaintiff that it\n\nwould enter into a sub-contract with it. To the contrary, it gave notice that without the\n\nchange it would not enter into the sub-contract, and no sub-contract was forwarded for it\n\nto execute. There can be no waiver or estoppel in the circumstances, or anything which\n\nrendered the execution of an agreement unnecessary.42.\n\n        On the evidence before me, I find that there\n\nwas no binding sub-contract between the plaintiff and the defendant. With this finding,\n\nthe claim for damages for breach of contract fails. I will add that even if there was a\n\nsub-contract and it was wrongly repudiated by the defendant, there were shortcomings in\n\nthe plaintiff’s presentation of its claims.43.\n\n        The plaintiff’s claim was particularised\n\nasCost of Replacement Sub-Contract\n\n    Works            $223,388.00Cost of works carried out on\n\n    behalf of Defendants        $     \n\n    2,400.00Cost of rectification works\n\n                                       \n\n    $     4,380.00Less:Original Sub-Contract sum of\n\n    Defendants’ works    $183,388.00$   46,780.0044.\n\n        It transpired at the hearing that the scope of\n\nthe replacement sub-contract was identical to that offered to the defendant. That is not\n\nright because the defendant had carried out some of the FPI works. The replacement\n\nsub-contract ought not include those works, and the plaintiff cannot claim the difference\n\nin the two contracts from the defendant.45.\n\n        There was no evidence of the works alleged to\n\nhave been carried out on behalf of the defendant, and no explanation why this sum should\n\nbe treated as an additional item to the sub-contracted works. There was no confirmation by\n\nthe architect, M&E consultant, quantity surveyor or any other party to confirm that\n\nthose works were works which the defendant should have executed. Besides showing a claim\n\nby Air & Air Engineering Pte Ltd for $2,400 submitted to the plaintiff for approval,\n\nthere was no evidence that the work was done or that the claim was approved or paid.\n\nSimilarly with regard to the claim for $4,380 for rectification works, there was only a\n\nfax message from the replacement sub-contractor referring to the work which required\n\nrectification, with a quotation therefor submitted to the plaintiff. There was no\n\nconfirmation that these were proper rectification works, or that they were executed, or\n\nthat the amount of $4,380 was reasonable or paid. The claims were not properly proved.",
        "Conclusion": "46.\n\n        The plaintiff’s action succeeds on libel,\n\nbut fails on breach of contract. I will defer my order on costs pending the assessment of\n\ndamages.Sgd:Kan Ting ChiuJudgeCopyright © Government of Singapore."
    }
}