{
    "case_title": "Public Prosecutor v Steven Ang Keng Leong and Others",
    "ncitation": "[2002] SGHC 57",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "1STCHARGE": "on the 27thday of June\n\n  2001, in a motor car bearing registration number SBQ 8587 H, along Yishun Avenue 2,\n\n  Singapore, did traffic in a controlled drug specified in Class ‘A’ of the First\n\n  Schedule to the Misuse of Drugs Act, Chapter 185, to wit, by having in your possession for\n\n  the purpose of trafficking 37.08 grams of diamorphine at the said place, without any\n\n  authorisation under the said Act or the regulations made thereunder and you have thereby\n\n  committed an offence under section 5(1)(a) read with section 5(2) of the Misuse of Drugs\n\n  Act, Chapter 185, and punishable under section 33 of the aforesaid Act.That you,BALA MURUGAN A/L KRISHNAN",
        "2NDCHARGE": "on the 27thday of June\n\n  2001, sometime before 3.40 p.m., did engage with one Steven Ang Keng Leong and other\n\n  unknown person(s) in a conspiracy to do a certain thing, namely, to traffic in a\n\n  controlled drug specified in Class ‘A’ of the First Schedule to the Misuse of\n\n  Drugs Act, Chapter 185, and in pursuance of the said conspiracy and in order to the doing\n\n  of that thing, an act took place on the 27thJune 2001 at the bus stop in front\n\n  of Block 289 Yishun Avenue 7, Singapore, to wit, you provided 37.08 grams of diamorphine\n\n  to the said Steven Ang Keng Leong for the purpose of trafficking, and you have thereby\n\n  abetted the commission of the offence of trafficking in the said drugs and committed an\n\n  offence under section 5(1)(a) read with section 12 of the Misuse of Drugs Act, Chapter\n\n  185, and punishable under section 33 of the aforesaid Act.",
        "AMENDED": "on the 27thday of June 2001, in a motor\n\n  car bearing registration",
        "3RDCHARGE": "number SBQ 8587 H, along Yishun\n\n  Avenue 2, Singapore, did abet one Steven Ang Keng Leong to traffic in 37.08 grams of\n\n  diamorphine, a controlled drug specified in Class ‘A’ of the First Schedule to\n\n  the Misuse of Drugs Act, Chapter 185, to wit, by intentionally aiding the said Steven Ang\n\n  Keng Leong in conveying him to Yishun in the said motor car belonging to you in order for\n\n  him to take possession of the said drugs for the purpose of trafficking, and you have\n\n  thereby committed an offence under section 5(1)(a) read with section 5(2) and section 12\n\n  of the Misuse of Drugs Act, Chapter 185, and punishable under section 33 of the aforesaid\n\n  Act.\"2 They shall be referred to as B1, B2 and B3 respectively.",
        "THE PROSECUTION’S CASE": "3 On 27 June 2001, officers of the Central Narcotics Bureau\n\n(‘CNB’) proceeded to People’s Park Complex and later to the nearby Block 12\n\nYork Hill as well to conduct surveillance on B1. At about 3 pm, B1, clad in a white\n\nt-shirt and a pair of shorts, was seen walking from the said Block 12 towards the carpark\n\nwhere a white Nissan Sunny bearing registration number SBQ 8587H, owned and driven by B3,\n\nwas waiting. After B1 got into the front passenger seat, the car moved off and was trailed\n\nby the surveillance team to the Yishun housing estate.4 Sometime after 3.20 pm, SGT Lim Meng Huat, who was keeping watch at\n\nthe void deck of Block 289, Yishun Avenue 7, saw B1 walking towards the bus stop in front\n\nof the said block. The bus stop was directly opposite the factory occupied by Hellermann\n\nTyton where B2 was working. Other surveillance officers spotted the white Nissan Sunny\n\nwith B3 in the driver’s seat waiting a short distance away along Yishun Avenue 6 next\n\nto Block 289, near the junction where Yishun Avenue 6 and Yishun Avenue 7 intersect. In\n\nthat position, B3 would not have been able to see the said bus stop.5 Soon after B1 arrived at the bus stop, B2 was seen walking along the\n\nvoid deck of Block 289 towards the bus stop, carrying a haversack. When he reached the bus\n\nstop, B2 placed the haversack on the seats there and sat down. B1 stood close to him and\n\nthey appeared to be having a short conversation.6 B2 then walked away from the bus stop and B1 picked up the haversack.\n\nB1 then made a call using his handphone. Shortly thereafter, B3 drove his car from where\n\nhe was waiting to the junction, turned left into Yishun Avenue 7 and stopped at the bus\n\nstop to pick up B1. B1 made some hand gestures to B3 to open the boot of the car. B1 then\n\nplaced the haversack into the boot, got into the car and B3 drove off.7 As B2 was making his way across the pedestrian crossing at the\n\njunction of Yishun Avenues 6 and 7 towards his place of work, he was arrested by a team of\n\nCNB officers. About five minutes later, at about 3.45 pm, the car that B1 and B3 were in\n\nwas intercepted near the traffic junction of Yishun Avenues 1 and 2, some 3.7 km away from\n\nthe said bus stop, by another team of CNB officers. While the officers managed to arrest\n\nB3 from the driver’s side, the front passenger door remained locked although a CNB\n\nofficer kept knocking on the window after identifying themselves as government officials.\n\nIn the end, the CNB officer had to use an instrument to break the window and had to pull\n\nB1 out of the car as he refused to do so and was putting up a struggle. After they were\n\narrested, B1 and B3 were kept apart from each other.8 SSSGT Ang Oon Tho of the Special Task Force then arrived with his\n\nteam of officers. He brought B1 to the boot of the white Nissan Sunny and upon seeing the\n\nhaversack inside the boot, asked B1 in Hokkien about the contents of the haversack. B1\n\nsaid that it contained drugs. SSSGT Ang opened the haversack and saw several bundles in\n\nnewspaper wrapping.9 A while later, SSSGT Ang questioned B1 inside the white Nissan Sunny.\n\nB1 chose to speak in Mandarin. When asked what was inside the haversack, B1 said it\n\ncontained drugs but when asked what was inside the newspaper wrapping, he said he did not\n\nknow. Subsequently, the haversack was found to contain 10 packets of substance later\n\nanalyzed to contain a total of 37.08 grams of diamorphine, the subject of the charges.10 SGT Henry Chong questioned B3 in a CNB staff car and recorded an\n\noral statement from him in Hokkien. In that statement, B3 said he drove to the Chin Swee\n\nRoad area to fetch ‘Ah Leong’ (B1) who asked him to send him to Yishun \"to\n\ntake something for somebody\". B1 did not tell B3 what the thing was. They were on\n\ntheir way to People’s Park Centre, the place B1 asked B3 to send him to, when they\n\nwere intercepted by the officers. The CNB officers retrieved a red pouch containing a\n\nstraw of heroin, a straw of \"Ice\" and 3 Roche 15 tablets from B3’s waist\n\npouch. B3 admitted that those items were his. A total of $1,214 was also recovered from B3\n\n– $814 in his waist pouch and $400 in his wallet.11 At about 4.30 pm, they left Yishun for the CNB Headquarters in the\n\nPolice Cantonment Complex (‘PCC’) with B1 and B3 in separate vehicles. At the\n\nPCC, B3 was left in the white Nissan Sunny with some CNB officers standing guard. SGT\n\nHenry Chong then asked B3 what the money found on him was for. B3 replied that the money\n\nwas to be handed over to B1 to purchase heroin from him. B3 was then brought for a urine\n\ntest and that showed his urine to be positive for opiate and amphetamine.12 In the meantime, SSSGT Ang and some other officers left with B1 for\n\nPeople’s Park Complex # 24-906. A lady claiming to be the tenant of that unit opened\n\nthe door for them. B1 showed the officers his bedroom but it was locked.13 They then left for People’s Park Centre #25-05. B1 told the\n\nofficers the padlock’s combination numbers and that the key to the main door was on\n\ntop of the circuit box. They entered the unit and when SSSGT Ang asked B1 whether he had\n\nany drugs to surrender, B1 told him there were some underneath the cupboard’s drawer.\n\nTwo black plastic bags each containing 35 sachets of heroin were found. There was also a\n\nblack plastic bag containing some empty sachets.14 Between two mattresses, the officers found a black pouch containing\n\nsome empty sachets, a ‘Tanita’ weighing scale and a black plastic bag containing\n\nfive sachets of heroin. B1 admitted that all the items found belonged to him, including a\n\nbunch of nine keys which he said could be used to gain access to People’s Park\n\nComplex #24-906.15 SSSGT Ang then recorded another oral statement from B1 who spoke in\n\nMandarin. In that statement, B1 admitted that the drugs found inside his bedroom belonged\n\nto him and said that half of the drugs were for his own consumption and \"half gave to\n\npeople\". A straw of heroin and an Erimin-5 tablet were also found in B1’s wallet\n\nkept in the right pocket of his shorts.16 B1 was then brought back to the said #24-906. After gaining access\n\ninto the flat and the bedroom using the bunch of nine keys seized earlier, the CNB\n\nofficers found a UOB bank account book belonging to B1 on top of the cupboard. The group\n\nthen returned to PCC.17 In the carpark of PCC, the officers conducted a search of the white\n\nNissan Sunny in the presence of the three accused persons and the haversack was retrieved.\n\nThe officers did not note the contents of two carton boxes which were also in the boot.\n\nThe haversack and all the items seized earlier were handed over to the Investigating\n\nOfficer, ASP Toh Soon Teck.18 B1 later underwent a urine test which showed his urine to be\n\npositive for opiates. He was then brought to one of the offices in CNB where ASP Toh\n\nweighed the seized drug exhibits in the presence of all three accused persons. At about\n\n10.20 pm, B1 was brought to Block 2 Jalan Kukoh #02-145, his purported address, but the\n\nofficers were told by a woman there that she was the owner of the flat and that B1 was not\n\nstaying at that address. B3 was escorted by another team of officers to his home in Toa\n\nPayoh Lorong 5 but nothing incriminating was found in the flat there.19 SSG Subramaniam was one of three officers who arrested B2 while he\n\nwas walking along the pedestrian crossing back to his place of work. He testified that B2\n\nwas very calm when he was arrested after the officers had identified themselves as CNB\n\nofficers. B2 did not ask why they were arresting him for the 40 minutes or so that they\n\nwere with him and he did not tell B2 the reason. He denied that he informed B2 that he was\n\nbeing arrested for drug trafficking and that B2 explained that he had handed over to B1 a\n\nbag of clothes. He denied then telling B2 in Tamil that he was going to face the death\n\npenalty for drug trafficking. He did not know for sure whether B2 had spoken to the other\n\ntwo officers. Of the other two officers, one was not sure whether anyone told B2 the\n\nreason for his arrest while the other was certain B2 was not told the reason.20 At about 4.20 pm, some 40 minutes after B2 had been arrested, INSP\n\nHerman Bin Mohamed Hamli arrived at the junction of Yishun Avenues 6 and 7 with three\n\nother officers. The officers brought B2 to his place of work and retrieved some personal\n\nbelongings from B2’s locker there. INSP Herman then questioned B2 outside the\n\nfactory. B2, speaking in English, when asked what he was doing before his arrest, said\n\nthat he had gone out of the factory to buy drinks and was returning when he was arrested\n\nat the junction. He denied having handed over anything to a male Chinese earlier. He was a\n\nMalaysian who travelled in and out of Singapore everyday. The handphone found on him\n\nbelonged to his wife who was working in Woodlands.21 In cross- examination, INSP Herman said that B2 asked him,\n\n\"What happened, why?\". When told that he was arrested for a drug offence, he\n\nkept asking in English, \"Why, why?\". B2 looked a bit stressed and worried about\n\nwhy he was arrested before he was questioned by INSP Herman.22 Sulaiman bin Kasan, a production supervisor at Hellermann Tyton,\n\nsaid he saw B2 reporting for work on 27 June 2001 at sometime past 2 pm but did not know\n\nhis movements thereafter. He did not assign B2 any work that would require him to leave\n\nthe factory and neither did B2 inform him that he was going out.23 Veejespara Rau s/o Sellan’s and B2’s wives are sisters. In\n\nJanuary 2001, B2’s wife, a Malaysian, asked Veejespara to apply for a handphone for\n\nher use. He did so with StarHub and B2’s wife paid him in cash for the handphone\n\nbills. That handphone had the number 93854464.24 Sugu A/L Krishnan, a Malaysian, said he did not know B2. Sugu was\n\nthe owner of a motorcycle bearing registration number JGA 6493 which he bought in Johor on\n\n3 March 2001. He used it to travel to and from Singapore as he was working here in March\n\n2001. After March 2001, he and his father used the motorcycle within Johor. He lent it to\n\none Yokeswaran A/L Krishnan in September 2001 for 2 weeks and the borrower used it to\n\ntravel to and from Singapore. On 2 January 2002, he sold the motorcycle as he could not\n\nmaintain the monthly instalment payments. In cross examination, Sugu said the motorcycle\n\nwas a dark blue Honda EX-5 model. He was not known by the name Sivadas (mentioned by B2 in\n\nhis statements to the Investigating Officer) and neither did he know anyone by that name.25 The representative from StarHub provided the call records of\n\n93854464, the number of the handphone used by B2, and 90233123, the number of the\n\nhandphone used by B3, for 26 and 27 Jun 2001. As StarHub did not levy any charge for\n\nincoming calls from within Singapore, the records captured only outgoing calls from the\n\nsaid handphones. If the said handphones received an incoming call which was not answered,\n\nit would be diverted to StarHub’s voicemail number (1302) and be recorded as an\n\noutgoing call. Where international calls were concerned, there would be repeat entries as\n\nthere were two charges – one for airtime and the other for IDD rates.26 B1 used handphones bearing numbers 90437302 and 93447661 and a pager\n\nwith the number 93244893. The handphones used M1 pre-paid cards and no records were kept\n\nfor such pre-paid card numbers. The Investigating Officer was however able to retrieve\n\nfrom the handphones’ call register records of calls made from those handphones to\n\nthose used by B2 and B3 and vice versa.27 ASP Toh Soon Teck recorded a statement from B1 pursuant to Section\n\n122 (6) Criminal Procedure Code between 12.10 am and 12.50 am on 28 June 2001. B1 said in\n\nthat statement that the ten packets of heroin in the haversack belonged to the Indian man\n\n(B2) and that B3 was ‘not aware of this matter’. B1 also said he did not get to\n\nsee the drugs and did not know or expect that there were so many packets in the haversack.\n\nHe thought there would only be one packet.28 In the long statement recorded on 4 July 2001, B1, known also as\n\n‘Ah Leong’ to his family and friends, said that on 27 June 2001, he woke up at\n\naround noon in his friend’s flat in Block 12 York Hill. He had gone to the flat the\n\nnight before to consume heroin with his friend. Shortly thereafter, B3, his friend and a\n\nfellow drug addict, called him on his handphone, telling him that he wanted to take\n\n‘stuff’ from him. He understood ‘stuff’ to mean one sachet of heroin.\n\nB1 asked B3 to pick him up at York Hill.29 When B3 arrived in the white Nissan Sunny about an hour later, B1\n\ntold him to drive to Block 288 in Yishun. There, B3 stopped his car at the roadside while\n\nB1 called his friend, ‘Ah Seng’ to tell him that he had arrived in Yishun. B1\n\nwas then told to proceed to the bus stop nearby to collect the drugs from a male Indian.\n\nB1 had ordered one packet of one pound of heroin a few days earlier and had been told on\n\n26 June 2001 (the day before the arrest) to go to Yishun the next day.30 B1 then alighted from B3’s car and walked towards the bus stop.\n\nHe did not tell B3 what he was doing. B3 did not know that B1 was there to collect the\n\nheroin. About three minutes later, B2 walked towards the bus stop and placed the haversack\n\non one of the seats there. They did not speak to each other but B1 knew that the haversack\n\nwas meant for him. B2 then left immediately.31 B1 picked up the haversack and called B3 over the handphone to drive\n\nup to the bus stop. When the car arrived at the bus bay, B1 signalled to B3 to open the\n\nboot. B1 then walked to the boot and placed the haversack inside. He then told B3 to drive\n\nhim to People’s Park Centre.32 Throughout the whole episode, B3 did not ask what B1 was doing or\n\nwhat he had placed in the boot.33 When the white Nissan Sunny was intercepted by the CNB officers,\n\nB1’s front passenger door was locked as the car had an automatic locking system. A\n\nshort while after their arrest, they were brought to the rear of the white Nissan Sunny\n\nand, upon being questioned, B1 said the haversack was his.34 On 5 July 2001, B1 continued with his statement. He explained that\n\nthe 75 sachets of heroin seized from his rented flat #25-05 People’s Park Centre were\n\nmeant to be delivered to his clients. Each sachet weighed 8 grams and he would normally\n\nsell 20 or 30 sachets in each transaction, charging $2,800 for 20 sachets and $3,300 for\n\n30 sachets. B3 would purchase one or two sachets, costing $160 to $200 per sachet, from\n\nhim from time to time. He was willing to sell B3 one or two sachets at a time because he\n\nwas his friend. ‘Ah Seng’ was the one who introduced the buyers to B1.35 B1 went on to say that he obtained heroin from ‘Ah Seng’\n\non 3 or 4 occasions, each time buying one ‘liap’ or packet at $5000. ‘Ah\n\nSeng’ would call B1 about once a week to deliver the heroin to him at the said flat.\n\nIt was only on 27 June 2001 that ‘Ah Seng’ told him to collect the heroin from\n\nYishun.36 B1 rented the flat at $1,300 per month about two months before his\n\narrest. He had paid the landlord a deposit of $600. He had moved out of #24-906\n\nPeople’s Park Complex.37 In his further statement on 10 July 2001, B1 said he used the said\n\nflat to store and to re-pack the heroin that he bought into sachets of 8 grams. He would\n\nalso consume about half a sachet himself daily, using the electronic weighing scale.38 B1 then explained that he got to know B3 about one month before\n\ntheir arrest through an introduction from a fellow drug addict. He had five or six drug\n\ntransactions with B3. B1 said B3 had never driven him anywhere to deliver or to collect\n\nheroin. B3 only drove him between People’s Park Centre and York Hill as a favour on\n\nthose occasions he purchased heroin from him.39 On 27 June 2001, he asked B3 to drive him to Yishun \"out of\n\nconvenience\" because B3 called him just as he was going to Yishun to collect the\n\nheroin. However, B1 did not tell B3 the purpose of going to Yishun and neither did B3 ask.\n\nThey did not speak to each other along the way there. It was only when they were about to\n\nreach Yishun that B1 spoke to ‘Ah Seng’ by handphone in a normal tone in the car\n\nabout the place of collection. When they arrived at Block 288, B3 stopped the car and B1\n\nmerely told him to wait in the car for him. Similarly, after B1 had collected the\n\nhaversack and returned to the car, B3 did not say anything.40 B1 did not take note of the weight of the haversack as he was\n\nnervous then and wanted to get back into the car quickly.41 B1 ended his statement by saying that he used to support his\n\naddiction by selling illegal VCDs as well as by trafficking in heroin. When he got to know\n\n‘Ah Seng’, he began to deal in larger amounts of 20 to 30 sachets. He made a\n\ntotal of $6,000 to $8,000 in profits from his drug trafficking activities but gambled them\n\naway in illegal horse betting.42 In his Section 122 (6) Criminal Procedure Code statement taken on 28\n\nJune 2001, B3 admitted that he was a drug addict but denied trafficking in drugs. He said\n\nthat B1 did not tell him what he was going to do on 27 June 2001, that he only realized\n\nthat the haversack contained ten packets of heroin after his arrest and he felt cheated by\n\nB1.43 In his long statement of 4 July 2001, B3 said that on 27 June 2001,\n\nhe woke up at about 1 pm and called B1 to ask if he had ‘the stuff’. B3 intended\n\nto buy 5 sachets of heroin from B1 for $800. B1 told him to go to Block 12 Chin Swee Road\n\n(it should be York Hill).44 When B3 arrived at York Hill at about 2 pm, he informed B1 by\n\nhandphone and B1 told him he would be going down to meet him soon. On the previous four or\n\nfive occasions when B3 was there, he also waited in his car for B1.45 About five minutes later, B1 walked up to B3’s car, got into\n\nthe front passenger seat and told B3 to drive to Yishun without specifying the exact\n\ndestination. B3 thought B1 wanted to go to Yishun to pass some heroin to his clients as he\n\nhad driven him around for such a purpose before. B1 was not carrying any bag with him. B3\n\nthought he had hidden the heroin in his shorts.46 When they were travelling along Yishun Central, B3 heard B1 talking\n\nto someone in Malay over his handphone, asking the other party where he was and which\n\nblock and which flat he was in. B1 then told him to go to Block 288. B3 drove to Block 289\n\nand stopped at a junction whereupon B1 suddenly told him to wait for a while as he\n\nalighted from the car. B1 made a call and then walked towards Block 289. B3 parked his car\n\nby the roadside.47 About ten minutes later, B1 asked him to drive his car to the bus\n\nstop. At the bus stop, B1 gestured to B3 to unlock the boot. B1 placed the haversack he\n\nwas now carrying into the boot, boarded the car and told B3 to drive to the\n\n\"centre\" which B3 understood to be People’s Park Centre as he had collected\n\nheroin from B1 there before. On the way back to town, the car was intercepted by the CNB\n\nofficers.48 B3 went to say that during the trip to Yishun, he suspected that B1\n\nwas either delivering heroin to or collecting heroin from someone. He made no attempt to\n\nask B1 as he depended on him for his supply of heroin and was afraid B1 might get angry.49 Two days before their arrest, B3 drove B1 from Chin Swee Road to\n\nQueensway Shopping Centre. There, B1 alighted and B3 waited a long time for him. When B3\n\ncalled B1, he told him to leave first. A similar incident happened a few days earlier. B3\n\nsaid he suspected B1 had gone there to deliver heroin on both occasions. He had driven B1\n\naround in his car on more than ten occasions and did not expect him to pick up such a\n\nlarge amount of heroin on 27 Jun 2001.50 B3 was introduced to B1 about two months before their arrest. He had\n\npurchased heroin from B1 on over ten occasions. He used to buy one or two sachets and was\n\ncharged $200 to $250 per sachet. As he increased each purchase to five sachets later, B1\n\nsold to him at a preferential rate of $160 per sachet. He would share the five sachets\n\nwith three or four friends.51 In a further statement on 11 July 2001, B3 said he had an\n\nuncomfortable feeling when he saw B1 at the bus stop with the haversack. He felt that B1\n\ncould be cheating him by doing something bad without telling him. B1 appeared very nervous\n\nand uttered the words, \"back to centre\" twice. At that time, he did suspect that\n\nthe haversack might contain a large amount of heroin but could not do anything as the\n\nthought had just occurred to him. He had intended to ask B1 on the way back to town what\n\nwas inside the haversack but was intercepted and arrested before he could do so.52 B3 had assumed that after sending B1 to Yishun and back, he could\n\npurchase the five sachets of heroin after B1 had completed whatever he had planned to do\n\nthere. He added that on the two previous trips to Queensway Shopping Centre , B1 told him\n\nto leave first and that he could collect the heroin from him later at People’s Park\n\nCentre. He therefore believed that B1 had gone there to replenish his stock of heroin. On\n\n27 June 2001, he thought that B1 would also tell him to leave first and to collect the\n\nheroin later. He thought B1 was going to collect 20 to 30 sachets of heroin. As he needed\n\na new supply of heroin, B3 agreed to drive B1 to replenish his stocks but he never\n\nexpected the quantity involved to be so large.53 B3 said he maintained his addiction through money earned from\n\ngambling and from being a runner for illegal horse betting bookmakers for almost half a\n\nyear. He stopped being a renovation worker when he became a runner.54 Bennet Tan, a certified interpreter attached to CNB, was the Hokkien\n\ninterpreter for B3 when he made his statements to the Investigating Officer. It was put to\n\nhim by counsel for B3 that the last three lines of paragraph 33 of B3’s statement\n\nwhich stated :\"About 6 months ago, I stopped working as a renovation worker to\n\n  be a runner for illegal bookies until I was arrested.\"should read as :\"6 months ago, I started becoming a runner\".Bennet Tan could not recall if B3 had made such a statement but\n\nmaintained that he would not have interpreted it that way if B3 had not said so.55 Shown a photograph of B2, B3 said he had never seen him before.56 In his Section 122 (6) Criminal Procedure Code statement made on 27\n\nJune 2001, B2 said he did not know anything about the drug transaction. He claimed that he\n\nhad gone to a shop and was walking back to his place of work when he was arrested by three\n\nCNB officers. He denied having given ten packets of heroin to any male Chinese and claimed\n\nhe did not know B1.57 In his long statement of 3 July 2001, he said he left his home in\n\nJohor Baru at about 12.30 pm on 27 June 2001 and took a bus to Singapore. He was carrying\n\na haversack containing a pair of pants and a shirt. He arrived at the bus stop near his\n\nplace of work at about 2 pm. As he was walking along Yishun Avenue 7, a friend called\n\nSivadas, a male Malaysian Indian man of about 23 years of age, passed by on his\n\nmotorcycle, a Honda EX-5 bearing Malaysian registration number JGA 6493 (B2 said he was\n\nnot sure if this was the number). Sivadas stopped and spoke to B2 who asked him what he\n\nwas doing there. Sivadas replied that he had gone there to look for his friend in order to\n\nhand over a bag but could not locate his friend. He asked B2 to keep the bag for a while,\n\npromising to go back later to collect it from him. B2 asked him how much later that would\n\nbe as he had to report for work at 3 pm. Sivadas then told B2 that he would be back to\n\nlook for B2 at the same place and take back the bag. He then handed a haversack placed on\n\nhis motorcycle to B2. B2 found the haversack a bit heavy but did not open it because it\n\nbelonged to others. Sivadas then left on his motorcycle.58 B2 reported for work at about 2.10 pm and placed the haversack\n\nhanded over by Sivadas together with his own haversack in his locker which he then locked.\n\nAt about 3.30 pm, Sivadas called B2’s handphone. B2 asked him why he did not go back\n\nto retrieve the haversack from him and was told by Sivadas that he was in Johor Baru and\n\nthat Sivadas’ friend would call B2 on his handphone to arrange to take the haversack.\n\nB2 had given Sivadas his handphone number about two months earlier. However, he did not\n\nhave Sivadas’ contact numbers. Whenever he met Sivadas, it was by chance. He knew\n\nSivadas about three or four years ago while they were playing soccer in Johor Baru.59 A few minutes later, B2 received a call from a male person who spoke\n\na little Malay, identifying himself as Sivadas’ friend. He asked B2 where he was and\n\nB2 asked him to meet at the front of his place of work, giving him the name of the\n\ncompany. The male caller said he could not read and was already at the bus stop at Block\n\n288. He asked B2 to meet him immediately at the bus stop together with the haversack. He\n\ndid not tell B2 his name or how B2 could identify him.60 B2 then asked his colleague to cover his duties while he took the\n\nhaversack across the road to where the bus stop was. As he was walking, he called back the\n\nmale person to ask how he could recognize him. That person told him he was in a light\n\ncoloured t-shirt and was standing at the bus stop in front of Block 288.61 When B2 reached the bus stop, he placed the haversack on one of the\n\nseats and sat down. The male Chinese was still standing. He thanked B2 and told him he\n\ncould go back to work. B2 did not know B1’s name and was meeting him for the first\n\ntime. B2 did not know B3 at all. B2 then made his way back to work but was arrested as he\n\nwas crossing the junction.62 B2 had been working in that company for about two years as an\n\nassistant technician. His working hours were from 3 pm to 11 pm. He would commute each day\n\nbetween Johor Baru and Singapore.63 In a further statement made on 5 July 2001, B2 said he did ask\n\nSivadas what was in the haversack as it felt a bit heavy. Sivadas told him it contained\n\nclothing only but did not say whose it was. As he believed Sivadas and since it was not\n\npolite to look into other people’s bags, B2 did not open the haversack. He did not\n\nsuspect there was anything illegal in the haversack.64 He went on to say that he left the haversack on the seat at the bus\n\nstop because that was what B1 told him to do.65 In yet another statement made on 9 July 2001, B2 said that was the\n\nonly occasion he saw Sivadas in Singapore. He had met him only in Johor Baru when he and\n\nothers would meet to play soccer during weekends. Sivadas would join in the game once a\n\nmonth or once in two months. Despite knowing him for three or four years, B2 did not know\n\nSivadas’ occupation or place of work and did not have his contact numbers or his\n\naddress. He did him the favour of safekeeping and then delivering the haversack because he\n\nwas a soccer teammate.66 B2 went on to say that Sivadas and the male Chinese only called him\n\nonce each. Similarly, he called the male Chinese only once and that was when he was\n\ncrossing the road to go to the bus stop to meet him. There were no other telephone calls\n\nbesides those on or before 27 June 2001.67 The Investigating Officer testified that one ‘liap’ in\n\nnarcotics jargon meant one pound or about 460 grams and the street value would be about\n\n$5,000. He agreed that the two boxes in the boot of B3’s car contained tools.",
        "THE CASE FOR B1": "68 B1, 33 years old, confirmed the truth of the contents of the\n\nstatements he had given to the Investigating Officer. He explained that Block 288 was\n\nmentioned in the statements because that was the arranged meeting place although when he\n\nmade the call when he was in Yishun, he was actually at Block 289.69 He had three or four transactions with ‘Ah Seng’ over the\n\ntwo months that he knew him and each time, the amount he bought was one ‘liap’\n\nwhich meant ‘bundle’ to him. He did not know how heavy that was but knew that he\n\ncould re-pack it into 60 or more sachets of 8 grams each. Each ‘liap’ cost\n\n$5,000. He had never purchased more than that and ‘Ah Seng’ would always deliver\n\nit to him at People’s Park Centre. He would pay ‘Ah Seng’ subsequently.\n\nPrior to 27 June 2001, the last transaction was about one or two weeks ago and he had not\n\npaid ‘Ah Seng’ yet for that ‘liap’. The 75 sachets found in his flat\n\nwere what remained from the previous two transactions.70 A few days before 27 June 2001, he ordered one ‘liap’ from\n\n‘Ah Seng’. On 26 June 2001, ‘Ah Seng’ called to say he had the one\n\n‘liap’ available. ‘Ah Seng’s’ telephone number was probably a\n\nprivate one as it would not appear in B1’s handphone when he called B1. When B1\n\ncalled ‘Ah Seng’, he would be instructed to delete the number which would appear\n\nas an outgoing call in B1’s handphone. B1 could no longer remember his telephone\n\nnumber. ‘Ah Seng’ told B1 to go to Yishun the next day to collect the one\n\n‘liap’ from someone. When B1 asked him why he had to go and collect the heroin\n\nthis time, ‘Ah Seng’ merely replied that he had made some arrangement.71 At about 8 pm on 26 June 2001, B1 received a call from B2. This was\n\nthe first time they spoke over the telephone. B2 spoke in Malay and they discussed the\n\narrangement in Yishun. After calling ‘Ah Seng’, B1 realized that B2 was the\n\nfriend of ‘Ah Seng’. On 27 June 2001, B1 also spoke to B2 about their meeting\n\nlater in the afternoon.72 At about 2.21 pm on 27 June 2001, B1 called B3 who had paged him\n\nearlier. B3 wanted to buy heroin from B1. B1 told him he was at York Hill. When B3 arrived\n\nand they were on the way to Yishun, B1 spoke to B2. They also spoke over the handphone\n\nwhile B1 was waiting for B2 at the bus stop. When B2 arrived, if they did speak to each\n\nother, it would have been only a very brief conversation.73 After B2 had left the haversack at the bus stop, B1 called B3 to\n\npick him up and when the car arrived, B1 put it in the boot without opening it to look at\n\nthe contents as he was very nervous and wanted to leave as soon as possible. In his mind,\n\nhe was collecting only one ‘liap’. He was stunned when he realized after his\n\narrest that there were several other packets in the haversack.74 Cross-examined by counsel for B2, B1 agreed that he met B2 for the\n\nfirst time at the bus stop and that their conversation the day before did not touch on the\n\ncontents of the haversack that was to be delivered. In fact, they talked about the meeting\n\nplace only. B1 disagreed that B2 told him that he had been asked by a friend to deliver\n\nthe haversack to him.75 Cross-examined by counsel for B3, B1 agreed that when B3 went to\n\nYork Hill in the afternoon of 27 June 2001, he had no idea that they were going to Yishun.\n\nThe telephone conversation that B1 had in the car did not mention any drugs. B1 agreed\n\nthat he asked B3 to wait along Yishun Avenue 6 as he did not want B3 to know what he was\n\ndoing at the bus stop. It was the same case when B3 drove him to Queensway Shopping Centre\n\non two previous occasions, which were not for drug transactions in any case. B3 did not\n\nask him at any time why they were going to Yishun.76 Referred by the Prosecution to the statements from his UOB bank\n\naccount between February and June 2001, B1 acknowledged that there were deposits ranging\n\nfrom $10 to 1840 and that multiple deposits could be seen on most days. B1 explained that\n\nhe was a gambler and therefore there were many movements of money into and out of his\n\naccount. He also deposited money by way of the cash deposit machine which could accept\n\nonly a certain amount of cash each time and hence the multiple deposits on any particular\n\nday. He agreed that some, not most, of the deposits and withdrawals were related to drug\n\ntrafficking. Around June 2001, his UOB ATM card was stuck in the machine when he was using\n\nit but he did not get a replacement. Instead, he used his POSB ATM card.77 B1 disagreed with the suggestion that the large amounts in the\n\ndeposits and the withdrawals showed that he could not be buying only one ‘liap’\n\nof heroin each time. He agreed that the 75 sachets found in his flat would amount to more\n\nthan one ‘liap’ but wanted to get another ‘liap’ for future use. He\n\ndenied that he had been buying in the region of 10 ‘liaps’ each time.78 When ‘Ah Seng’ delivered the one ‘liap’ on\n\nprevious occasions, he would place it inside a plastic bag. B1 was not surprised on seeing\n\nthe haversack on 27 June 2001 as he thought that there was only one ‘liap’ in\n\nit. He did not give much thought to the weight then.",
        "THE CASE FOR B3": "79 B3 testified that five or six days before 27 June 2001, he started\n\nto buy five sachets at a time from B1 for the first time. On the way to Yishun, B1 was\n\nspeaking in Malay over the handphone and all he heard were things like where he was, which\n\nblock and the number 288. ‘Heroin’ or ‘drugs’ was not mentioned. When\n\nB3 stopped along Yishun Avenue 6, B1 suddenly opened the door and got out, telling him to\n\nwait for him there. He could not see the bus stop and did not know what B1 was up to.80 When he was driving B1 around on previous occasions, he also did not\n\nknow what B1 was doing at the destination. He mentioned in his statements that he\n\nsuspected that B1 was delivering or collecting heroin because he had thought about it\n\nafter their arrest while making the statements and surmised, on hindsight, that could be\n\nwhat B1 was doing.81 At the time of his arrest, $800 out of the $814 found in B3’s\n\nwaist pouch was meant for the purchase of five sachets of heroin at $160 each. The rest\n\nwas for his expenses.82 What he told the Investigating Officer in paragraph 33 of his\n\nstatement was that he started work as a runner for illegal bookmakers about six months ago\n\nand did not have much work to do as a renovation subcontractor. His busy days as a runner\n\nwould be Wednesdays, Saturdays and Sundays which were horse-racing days. 27 June 2001 was\n\na Thursday and he was not doing any renovation work that day either. He therefore had a\n\nlot of time to spare that day.83 Counsel for B1 and for B2 elected not to cross-examine B3. Upon\n\nquestioning by the Prosecution, B3 had to concede that 27 June 2001 was a Wednesday, a\n\nhorse-racing day, and not a Thursday. However, he added that it was not every horse-racing\n\nday that he would be busy. In any event, he could always communicate by telephone. He\n\nwould contact B1 whenever he needed to buy heroin and also when he had horse-racing tips.\n\nHe called B1 a number of times on 26 June 2001 as he had such tips for 27 June 2001 but\n\nonly managed to speak to him once.84 B3 explained that the doors of his car would lock automatically once\n\nthe car started moving. When that happened, only the driver’s door could be opened\n\nfrom outside.85 When he was driving B1 to Yishun, he thought that B1 was delivering\n\ndrugs to someone. After B1 took the haversack, B3 then suspected he was collecting heroin\n\nsupplies. He knew B1 to be a drug trafficker only and nothing else.",
        "THE CASE FOR B2": "86 B2’s account of the events was essentially the same as what he\n\nhad said in his statements except that he now said that it was on 26 and not 27 June 2001\n\nthat he met Sivadas along Yishun Avenue 7. Sivadas did not return to collect the haversack\n\nfrom him that day. Instead, Sivadas called him at about 8 pm and told him he was busy and\n\ntherefore unable to see B2 to get the haversack back. He told B2 he would give him his\n\nfriend’s telephone number and he asked B2 to contact the friend to arrange to collect\n\nthe haversack.87 B2 called the friend’s telephone number soon thereafter. He\n\nidentified himself as Sivadas’ friend and told the friend to collect the haversack\n\nwhich Sivadas had left with him. However, the friend, who was speaking in Malay, said he\n\ndid not understand B2. B2 then told him he was in Yishun and ask him to collect the\n\nhaversack from him there. A little later, the friend called B2 to ask his location and B2\n\ntold him to go to Yishun. The friend said he would collect the haversack that night but\n\ndid not turn up. B2 left the haversack in his locker in the workplace when he left for\n\nhome that night.88 On 27 June 2001, B2 returned to his place of work. He called\n\nSivadas’ friend before he started work but the call went unanswered. He attempted to\n\ncall him several more times. At about 2.10 pm, the friend called. He told B2 he was busy\n\nthe previous night but would collect the haversack that day. At 2.20 pm, B2 called the\n\nfriend to go to Yishun quickly.89 At around 3.20 pm, the friend called B2 who told him the name of his\n\nemployer company. However, the friend said he did not know how to read and how to go to\n\nthe company’s location and would go to Block 288 and then call B2 which he did about\n\nten minutes later, saying he was at the bus stop there. B2 then took the haversack and\n\nwalked across the road to meet him. On the way there, B2 called him to ask him about his\n\nattire. When B2 reached the bus stop, B1 was there alone. B2 placed the haversack on the\n\nseat and sat down. B1 approached B2 and asked whether he was the one who called him. After\n\nthat, he told B2 he would take the haversack, thanked him and told him he could leave. B2\n\nthen left the haversack on the seat and walked away. That was the first time he met B1. He\n\ndid not see B3 until after their arrest.90 When B2 was being arrested by the 3 CNB officers, they told him he\n\nhad trafficked in drugs and SSGT Subramaniam, speaking in Tamil, kept mentioning\n\n‘death by hanging’. B2 was frightened and stunned.91 Later, when INSP Herman arrived, B2 asked him why they had arrested\n\nhim and was told that it was in connection with drug trafficking. The Inspector asked him\n\nwhether he had handed over anything to the Chinese. B2 denied having done so. He lied as\n\nhe was frightened by the mention of the death sentence, thinking there was something\n\ndangerous in the matter. He was even more terrified when he was shown the drugs later.92 In his statements, he did not say that Sivadas handed him the\n\nhaversack on 26 June 2001 as he had realized that it contained drugs and he was frightened\n\nto say he had kept it for a day, remembering what the CNB officers had said about the\n\ndeath sentence.93 Counsel for B1 and for B3 did not cross-examine B2. In\n\ncross-examination by the Prosecution, B2 agreed that he first came to know about the\n\nStarHub handphone records at the preliminary inquiry in this case held on 8 January 2002.\n\nWhen he was giving the long statements, he was still in fear and he told the Tamil\n\ninterpreter about it but was not taken seriously. He denied that he had to re-think the\n\ndate in his statements after finding out about the handphone records. He said he had told\n\nhis counsel about the inaccuracies before the preliminary inquiry.94 Gunasigaram A/L Ramalu, who lives in Johor Baru but works in\n\nSingapore, testified that he has known B2 for some seven to eight years. He is very close\n\nto B2’s younger brother. He confirmed that he and B2 had been playing soccer together\n\nfor four or five years on Sundays and public holidays. Sivadas would also join them but\n\nnot regularly. He confirmed that Sivadas had a dark blue Honda EX-5 motorcycle. He has\n\ntried looking for Sivadas but was unable to locate him. The last time he saw Sivadas was\n\nin October or November 2001.95 Murugan A/L Suppiah also lives in Johor Baru but works in Singapore.\n\nHe has known B2 for about five years. They played soccer together. Sivadas also joined\n\nthem but he was not as regular as they were. He testified that Sivadas had two\n\nmotorcycles, one of which was a Honda EX-5. He has also tried to locate Sivadas without\n\nsuccess.",
        "THE DECISION OF THE COURT": "96 B1’s evidence showed quite clearly he was a trafficker in\n\nheroin on and before 27 June 2001. The only contention in his case was whether he had\n\nordered and was therefore expecting only one packet or ‘liap’ of heroin that\n\nday. If he ordered only one packet each time, it was strange that he had to replenish his\n\nstock when he had 75 sachets or more than one packet of heroin on the day of his arrest.\n\nIt was quite unbelievable that his supplier would have made such an egregious error,\n\nknowing his past record of orders of heroin. Even if his supplier had made a $45,000\n\nmistake, surely the bulk and the weight difference between one packet and ten packets\n\nwould have been so plainly obvious at sight and, at any rate, when he held the haversack.\n\nHe should be quite accustomed to what one packet weighed and the haversack was clearly ten\n\ntimes heavier than the norm. He nonchalantly took the haversack and placed it in the boot\n\nof B3’s car because he knew what it was he had taken delivery of – ten packets\n\nof heroin. There was therefore no indication of any surprise on his part about the size\n\nand the weight of the haversack and he saw no need whatsoever to even verify its contents\n\nin the car on the long journey back to town. The heroin was obviously in his possession\n\nfor the purpose of trafficking. I therefore had no doubt that B1 was guilty as charged and\n\nconvicted him accordingly.97 B3 was 43 years old at the material time. He did not appear to me to\n\nbe a simpleton or someone under B1’s control. If all he wanted to do on 27 June 2001\n\nwas to collect 5 sachets of heroin from B1, he would have at least asked him when he could\n\nexpect to get the drugs. Yishun was not a stone’s throw away from York Hill. I found\n\nit incredible that he would simply head for Yishun without asking why they were suddenly\n\nrequired to go there and for how long. He knew B1 was a trafficker who had no other\n\nvocation. He even admitted in his statements that he suspected B1 was either delivering or\n\ncollecting drugs. When B1 called for him after taking delivery of the haversack, he seemed\n\ntotally lacking in curiosity that B1 was now carrying a haversack and putting it in his\n\ncar and asking him to return to town. There was no evidence at all that he even asked B1\n\nwhat the trip to Yishun was all about and what it was that he had collected.98 Further, there were a number of calls between B1 and B3 the day\n\nbefore. If the reason for those calls was to tip off B1 about the horse races the next\n\nday, it was indeed strange that B3, a runner, would be so completely calm and\n\ndisinterested about the impending races later that day when suddenly told by B1 to make\n\nthat trip to Yishun.99 The whole sequence of events pointed inescapably to the fact that B3\n\nknew about the trip to Yishun before he went to York Hill and what its purpose was. Hence\n\nthere was no need for any question to be asked by B3 throughout the long drive. He was a\n\nknowing participant in the trip to Yishun to collect the ten packets of drugs and to bring\n\nthem back to town. There was active complicity on his part in the way explained by the\n\nthen Court of Criminal Appeal inTan Siew Chay &Ors v PP[1993] 2 SLR 14. B3 was therefore guilty as charged and I convicted him on his charge.100 Insofar as B2 was concerned, I agreed with the Prosecution that the\n\nnew ‘spin’ he put on his long statements was necessitated by the StarHub\n\nhandphone records and the call register details in B1’s handphone which emerged only\n\nafter the preliminary inquiry and in the course of trial respectively. His claim that B1\n\ncalled him only once and that he called B1 only once (see paragraph 26 of his long\n\nstatements) could not stand in the light of the new evidence and he therefore had to\n\n‘modify’ the date of the events. I had no doubt that he was not telling the\n\ntruth in court about this and that he was not labouring under any fear about having kept\n\nthe haversack overnight. His omission to state the fact that he was in constant\n\ncommunication with B1 on 26 and 27 June 2001 must be evidence of his guilt.101 What was even more telling was B2’s response first to INSP\n\nHerman’s questions and then to the Investigating Officer’s. If he was so stunned\n\nand frightened about the death penalty, one would have thought his immediate reaction\n\nwould be to say that he thought he was delivering clothes on behalf of a friend. Instead,\n\nhe went on to cook up the story of having gone out of his workplace to buy some drinks and\n\nto deny having met B1. That could not have been the mind of an utterly shocked and\n\nfrightened person. It was rather the reaction of a person who knew what he had just\n\ndelivered and was seeking to totally dissociate himself from the meeting at the bus stop.102 Further it was incredible that B2 could not have asked B1 to cross\n\nthe road and meet him just outside the factory which was directly across the road opposite\n\nthe bus stop where B1 was. After all, B2 was working. Why was he so willing to leave his\n\nplace of duty to hand over a bag of clothes to someone he did not even know ? Obviously it\n\nwas because the ‘bag of clothes’ contained something important - $50,000 worth\n\nof heroin.103 As pointed out inLai Kam Loy & Ors v PP[1994] 1 SLR 787, direct evidence of a conspiracy would rarely be available. Here, the actions of\n\nB1 and B2, the many telephone conversations coupled with the fact that B2 did not want to\n\ndisclose them, the fact that B1 had ordered and was taking delivery of heroin and the fact\n\nthat B2 had denied twice about any involvement with the haversack or with B1 all clearly\n\nindicated their concert in the pursuit of a common object or design, that is, the handing\n\nover by B2 to B1 the drugs in question for the purpose of trafficking.104 Even if a person called Sivadas existed, it would make no\n\ndifference to the findings that I have made. Wherever or whomever B2 took the haversack\n\nfrom, it was not a bag of clothes and B2 knew this. Indeed, Sivadas would have to be an\n\nextraordinary supplier of drugs if he was able to ‘dump’ $50,000 worth of heroin\n\nwithout somehow ensuring that the drugs would end up at the intended destination. In the\n\nresult, I also found that the charge against B2 had been proved beyond reasonable doubt\n\nand I convicted him on his charge.105 As all 3 charges carried the mandatory death sentence, I sentenced the 3 accused\n\npersons accordingly.Sgd:TAY YONG KWANGJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}