{
    "case_title": "Re Nicholas William Henric QC and another application",
    "ncitation": "[2002] SGHC 74",
    "coram": "Tay Yong Kwang JC",
    "sections": {
        "The applications": "These two originating motions were heard before me together. They concern applications to admit two Queen`s Counsel (`QC`), Mr William Henric Nicholas QC and Mr Martin Lee Chu Ming QC, as advocates and solicitors pursuant to s 21 of the Legal Profession Act (Cap 161, 2001 Ed) for the purpose of appearing as counsel for Dr Chee Soon Juan, the defendant in two High Court actions. Suit 1459/2001 is the action commenced by Mr Lee Kuan Yew and Suit 1460/2001 is the action commenced by Mr Goh Chok Tong.",
        "The affidavits": "In his affidavit filed in support of Mr William Henric Nicholas QC`s admission, Dr Chee states:1. I am the defendant in this suit. I wish to have the applicant to be my counsel in the present suits, and in all proceedings including interlocutory or appeal proceedings connected therewith, until final disposal thereof.2. The plaintiffs are claiming that I have allegedly spoken and published defamatory words of and concerning them. I refer the court to the plaintiffs` amended statements of claim.3. The applicant William Henric Nicholas QC was appointed one of Her Majesty`s Counsel on 2 September 1981.4. The applicant does not ordinarily reside in Singapore or Malaysia, but intends to come to Singapore for the purpose of appearing in the present cases.5. The applicant William Henric Nicholas has special expertise for the purpose of the cases, in that he is an advocate specialising in defamation in all the states and territories of Australia excluding Tasmania.6. The cases are extremely complex defamation matters, involving factual and legal issues of publication and republication; qualified privilege, contextual truth, comment and justification; there are also counterclaims in defamation, and third party claims.7. The nature of the issues in the case and the identity and positions of the plaintiffs are further powerful reasons why it is proper and necessary for me to engage the services of leading counsel from outside of Singapore. I believe that the applicant  with his expertise and experience will be in the best position to assist the court in coming to a just and fair decision.8. In the premises, I respectfully pray for an order in the terms of this motion.In his affidavit filed in support of Mr Martin Lee Chu Ming QC`s admission, Dr Chee states (paras 1, 2, 4, 6, 7 and 8 of this affidavit are identical to the corresponding paragraphs of the above affidavit and need not be reproduced):3. The applicant was called to the Bar of Hong Kong in 1966 and holds Her Majesty`s patent as Queen`s Counsel, entered in 1979....5. The applicant has special expertise for the purpose of the cases, in that he is an advocate specialising in defamation. He has won a landmark decision from the Court of Final Appeal of Hong Kong on 13 November 2000, setting a precedent in the common law system for the refinement of the definition of defamation (Cheng and Lam vs. Tse, Final Appeal No. 12 of 2000 (Civil), on appeal from CACV No. 170 of 1998).The previous applicationThree months ago, an application to admit Mr Stuart Littlemore QC for the purpose of appearing as counsel for Dr Chee in the same two actions was dismissed by Lai Kew Chai J. The judgment in that application is reported at [2002] 1 SLR 296.",
        "The two High Court actions": "I shall summarise below the averments in the pleadings filed in the two High Court actions in issue.",
        "SUIT NO 1459 OF 2001": "Amended statement of claimThe plaintiff is the Senior Minister and the former Prime Minister of Singapore. On 25 October 2001, the plaintiff was returned unopposed as a Member of Parliament in the 2001 General Elections. The defendant is the Secretary-General of the Singapore Democratic Party (`SDP`) and was a candidate in the same elections.Between late 1997 and early 1998, a financial assistance package for Indonesia and a Singapore-Indonesia Bilateral Trade Finance Guarantee Scheme were disclosed to and discussed in the Singapore Parliament. No funds were ever disbursed by Singapore under a standby facility of US$5bn. These matters were reported extensively in the local press between November 1997 and August 1998.On 28 October 2001, at an election rally held at Nee Soon Central, the defendant spoke and published certain defamatory words concerning the plaintiff in the presence of members of the public and the print and broadcast media. These words related to an alleged loan of S$17bn given by Singapore to Indonesia. Some of the words or their gist were republished in the Business Times on 29 October 2001. It was pleaded that the republication was the natural and probable result of  the original publication by the defendant and/or that it was intended or authorised by the defendant. The defendant was therefore alleged to be liable for the said republication.The amended statement of claim went on to aver that the defamatory words, in their natural and ordinary meaning, meant and were understood to mean that the plaintiff was dishonest and unfit for office because he concealed from Parliament and the public and/or deliberately misled Parliament in relation to a S$17bn loan made to Indonesia and his continued evasion of the issue was because he had something discreditable to hide about the transaction.On 31 October 2001, the plaintiff, through his solicitors, issued a letter of demand to the defendant demanding that he publish at his expense an apology and undertaking in terms of the plaintiff`s draft, which was enclosed, with appropriate prominence in the Straits Times and the Today newspapers by 3 November 2001, read out the apology at a SDP rally no later than 10pm on 2 November 2001, compensate the plaintiff by way of damages and agree to indemnify the plaintiff in respect of costs. The plaintiff required the defendant`s written confirmation that he would comply with the said demands and provide an offer of damages no later than 10am on 2 November 2001.On 31 October 2001, the defendant read out the apology at a SDP rally at Jurong East. He also published the apology in the 1 November 2001 editions of the Straits Times and the Today newspapers.It was further averred that by the terms of the apology, the defendant had admitted the defamation but had not furnished an offer of damages.The plaintiff claimed aggravated damages, relying on certain matters, particulars of which were spelt out in the pleading.The plaintiff also averred that a compromise in the terms of the letter of demand had been entered into and that, in consideration thereof, he had impliedly agreed not to ask for full damages that he would otherwise be entitled to. He alleged that the defendant breached the compromise by not paying him damages and costs and/or by not making an offer of damages.The plaintiff therefore claimed damages to be assessed and costs on an indemnity basis.",
        "Defence and counterclaim": "The defendant denied the allegations of fact in 17 named paragraphs of the amended statement of claim. He also did not admit the allegations contained in nine named paragraphs. He further denied that the words complained of, in their natural and ordinary meaning, were understood to be or were capable of being defamatory of the plaintiff. He also pleaded qualified privilege, fair comment on a matter of public interest and justification.The defendant averred that any apology or compromise achieved by the plaintiff was null and void in that it was the product of duress and intimidation.In his counterclaim, he alleged that the plaintiff published in or about November 2001 certain words which were defamatory of him in that they conveyed the meaning that he was guilty of violent criminal conduct as a politician, that he was dishonest and guilty of the crime of fraud, that he was not a sincere politician but was the stooge of foreign persons whom he allowed to manipulate him, that he was a person who should be exposed to the public as dishonest and was a person of bad character.The words were republished in the Sydney Morning Herald and The Age newspapers on 10 November 2001 and on the websites of the said newspapers to readers throughout Australia, Singapore and the world. The defendant averred that the plaintiff was liable for those republications which were the natural and probable result of his publication.The defendant claimed damages to be assessed and costs on an indemnity basis.",
        "Reply and defence to counterclaim": "The plaintiff denied that the defendant was entitled to rely on qualified privilege, fair comment or justification. He averred that the publication of the defamation was motivated by malice on the part of the defendant and provided particulars for saying this.In response to the counterclaim, the plaintiff admitted that he spoke the words pleaded by the defendant but denied that they accurately represented the full extent and true sequence of what was said. The pleading then quoted certain words published in the 10-11 November 2001 edition of the Sydney Morning Herald newspaper and in the 10 November 2001 edition of The Age newspaper. He denied that the words published in those newspapers were republications of his words and/or that they were the natural and probable result of the publication of the plaintiff`s words to the journalists and/or that he was liable for such alleged republication.The plaintiff then proceeded to state the natural and ordinary meaning of the words complained of by the defendant and to plead justification, followed by a list of matters in support thereof. He further averred that even if the words had the meanings stated by the defendant, they were true in substance and in fact. Fair comment was also pleaded. Particulars were again given.",
        "Third party proceedings": "On 25 January 2002, the defendant was granted leave to issue third party notices against the Straits Times, The New Paper, Channel News Asia, Television Corporation of Singapore and Today claiming an indemnity and contribution in respect of the plaintiff`s claim against him.",
        "Order 14 application": "Order 14 proceedings by the plaintiff in this suit are also pending.",
        "SUIT NO 1460 OF 2001": "Amended statement of claimIn this action, the plaintiff, the Prime Minister of Singapore, is suing the defendant for having spoken and published certain allegedly defamatory words on 28 October 2001 at the Hong Kah West hawker centre, in the course of campaigning for the 2001 General Elections. Those words were in relation to the alleged S$17bn loan to Indonesia. Some of the words complained of or their gist were prominently republished by the print and broadcast media. The plaintiff averred that the republication was the natural and probable result of the defendant`s original publication or that it was intended and/or authorised by him. Particulars were furnished to support this averment.In the evening of that day, the defendant spoke and published certain allegedly defamatory words concerning the plaintiff again. That was at an election rally in Nee Soon Central. The defendant`s words were prominently republished by the broadcast media. Some of the words or their gist were also prominently republished in the Business Times of 29 October 2001. Again, the plaintiff averred that the republication was the natural and probable result of the original publication by the defendant or that it was intended and/or authorised by him. Particulars were also provided.The plaintiff averred that the words uttered by the defendant at the Hong Kah West hawker centre meant, in their natural and ordinary meaning, that the plaintiff was dishonest and unfit for office because he concealed from Parliament and the public and/or deliberately misled Parliament in relation to a S$17bn loan and that the plaintiff`s continued evasion of the issue was due to the fact that he had something discreditable to hide about the transaction.On 30 October 2001, the plaintiff issued a letter of demand in terms similar to that of the plaintiff in the other suit. On 31 October 2001, the defendant read out the apology at a SDP rally at Jurong East and published it in the 1 November 2001 edition of the designated newspapers. The defendant has not made an offer of damages.The plaintiff also claimed aggravated damages on several grounds, providing particulars in support of his claim. He also pleaded that a compromise in the terms of the letter of demand had been entered into between him and the defendant and that the defendant breached the compromise by not paying damages and costs or making an offer of damages.The plaintiff claimed damages to be assessed and costs on an indemnity basis.",
        "Defence": "In his defence, the defendant stated that he denied the allegations of fact in 21 specified paragraphs of the amended statement of claim. He did not admit the allegations of fact contained in 12 identified paragraphs of the same. He also denied that the matters complained of in four named paragraphs were understood to be or were capable of being defamatory of the plaintiff.The defence went on to plead qualified privilege, fair comment on a matter of public interest and justification. It was also averred that any apology or compromise achieved by the plaintiff was null and void in that it was the product of duress and intimidation.",
        "Reply": "The plaintiff denied that the defendant could rely on qualified privilege, fair comment and justification. He further averred that the defendant`s publication of the words on both occasions was motivated by malice. Particulars were provided in support of this. He further denied the defendant`s allegation regarding the compromise.",
        "Law on admission of Queen`s Counsel": "Section 21 of the Legal Profession Act provides:(1) Notwithstanding anything to the contrary in this Act, the court may, for the purpose of any one case where the court is satisfied that it is of sufficient difficulty and complexity and having regard to the circumstances of the case, admit to practise as an advocate and solicitor any person who -(a) holds Her Majesty`s Patent as Queen`s Counsel;(b) does not ordinarily reside in Singapore or Malaysia but who has come or intends to come to Singapore for the purpose of appearing in the case; and(c) has special qualifications or experience for the purpose of the case....(3) Any person applying to be admitted under this section shall do so by originating motion verified by an affidavit of the applicant or of the advocate and solicitor instructing him stating the names of the parties and brief particulars of the case in which the applicant intends to appear.(4) The originating motion and affidavit or affidavits shall be served on the Attorney-General, the Society and the other party or parties to the case.(5) At the time of the service, the applicant shall pay the prescribed fee to the Attorney-General and the Society for their costs incurred in the application.(6) Before admitting a person under this section, the court shall have regard to the views of each of the persons served with the application....(10) In this section, \"case\" includes any interlocutory or appeal proceedings connected with a case.`Society` here means the Law Society of Singapore (see s 2(1) of the Act).There are many decisions on this particular provision of law. A good starting point would be to refer to the summary of the principles inRe Howe Martin Russell Thomas QC[2001] 3 SLR 575. There, Yong Pung How CJ, in considering and dismissing the application to admit the QC for a patent infringement action in the High Court, said:3 The applicant also showed to the court his very impressive credentials. It was obvious that the requirements of special qualifications and experience under s 21(1) of the Act were not in issue.4 InRe Oliver David Keightley Rideal QC[1992] 2 SLR 400at 402D, Chan Sek Keong J (as he then was) very accurately pointed out that the amendment in 1991, Act No 10 of 1991, to s 21 was aimed at specifying some guidelines in the ad hoc admission of Queen`s Counsel. The objective of the amendment was to help develop a strong core of good advocates at the local Bar, by `the imposition of more stringent conditions for the admission of Queen`s Counsel to appear in our courts, but, at the same time, to continue to allow litigants to avail of their services in appropriate cases`. InPrice Arthur Leolin v A-G[1992] 2 SLR 972at 975E, I stated that:`The objective of the amendment was to help the development of a strong core of good advocates at the local bar by restricting access to Queen`s Counsel only in the more difficult and complex cases.`5 The amendment to s 21 of the Act thus requires the court to take into account two additional requirements: (1) that the case must be of sufficient difficulty and complexity; and (2) the circumstances of the case.6 Again, I took the opportunity to clarify this inRe Caplan Jonathan Michael QC (No 2)[1998] 1 SLR 440at [para ]11:`At the first stage, the applicant must demonstrate that the case in which he seeks to appear contains issues of law and/or fact of sufficient difficulty and complexity to require elucidation and/or argument by a Queen`s Counsel. Such difficulty or complexity is not of itself a guarantee of admission, for the decision to admit is still a matter for the court`s discretion. At the second stage, therefore, the applicant must persuade the court that the circumstances of the particular case warrant the court exercising its discretion in favour of his admission. Finally, he has to satisfy the court of his suitability for admission.`7 Our courts have had a decade in dealing with s 21(1) of the Act. As it was quite rightly pointed out by Lai Kew Chai J inRe Flint Charles John Raffles QC[2001] 2 SLR 276at [para ]9, the local Bar has matured and is acquitting itself commendably. Lai J has put this elegantly:`There has been forged and carefully nurtured, particularly over the last ten years, a body of Senior Counsel, potential senior counsel and an impressive group of  young advocates and solicitors, both in the public service and in the private sector, with excellent academic credentials and a right attitude. The process continues during which opportunities must be judiciously offered and challenges thrown, though never at the expense of justice to any litigant before our courts.`8 It is in this context that the court has then to analyse the nature of the suit to consider if it merits an ad hoc admission of a Queen`s Counsel....10 As I stated inPrice Arthur Leolin v A-G[1992] 2 SLR 972at 975H, the onus is on the applicants to show in an affidavit the specific issues for which admission is sought and persuade the court that they are complex and difficult.The affidavits in support of the two applications merely assert that these cases are extremely complex defamation matters without explaining how they are so. The issues listed are general in nature and case law and legal writing on such issues must abound both here and in other common law jurisdictions. It seems to me that the cases here only require the application of established principles to the facts. As Chan Sek Keong J (as he then was) said inRe Oliver David Keightley Rideal QC[1992] 2 SLR 400at 402G-H:With reference to the first requirement, it is the judge, and not the parties, or their counsel, or other interested parties, who has to be satisfied that a case is of sufficient difficulty and complexity. The considered views of instructing solicitors on the issues raised are relevant and should be given their proper weight, but mere assertions that cases or issues are difficult and complex are of no assistance to the court in discharging its duty. It is therefore incumbent on counsel to identify the issues to the judge hearing the application and his views on the applicable law. A case may be difficult and complex in relation to the facts as well as the law.I should add here that the stand of counsel for the plaintiffs in the two High Court actions has been and still is that he would not oppose any application to admit QC but would leave the question of admission to the court. He does wonder why two QC are required by the defendant.The fact that there is a counterclaim in one of the actions here and that there are third party proceedings in both cases is certainly not novel. These are essentially procedural matters and even if they add to the number of parties and causes of action, they do not necessarily increase the complexity of the case. It has not been shown to me how the counterclaim and the third party proceedings have raised the issues to such level of difficulty and complexity that the admission of one QC is warranted, let alone two QC.In the circumstances, I am not satisfied that the two cases are of sufficient difficulty and complexity to warrant the admission of QC.The other factor mentioned in the affidavits is `the identity and positions of the plaintiffs are further powerful reasons why it is proper and necessary for me to engage the services of leading counsel from outside of Singapore`. By this, Dr Chee appears to be implying that no local lawyer is able and willing to act for him. There are presently more than 3,000 practising advocates and solicitors and more than 20 of these are Senior Counsel. While I need not be convinced of the absolute absence of any local counsel capable of taking on or willing to take on  the cases here (seeRe Caplan Jonathan Michael QC (No 2)[1998] 1 SLR 440), no evidence has been proffered on this point to assist me in the balancing exercise.The applications for admission therefore also fail at the `second stage`.I shall now address the points raised by the Attorney General. I agree that s 21 contemplates an application by a QC and not the litigants in the case in question. It also assumes that there is an instructing solicitor on record but does not make that a necessary feature of every application. There is no requirement in our law that QC must appear only on instructions from a solicitor. Indeed, a QC is admitted under s 21(1) `to practise as an advocateandsolicitor`. The Legal Profession Act does not prohibit a litigant from acting in person (see s 34(e)). Accordingly, if a litigant chooses to act in person, he or the QC in question may affirm the affidavit specified in s 21(3). The litigant acting in person may also address the court in the way an instructing advocate and solicitor may. If the litigant chooses to affirm the affidavit, he cannot claim to have no or insufficient knowledge of what is required of him in ad hoc admissions.There is no legal impediment to the admission of more than one QC for any one case under s 21. However, the onus to satisfy the requirements of that section would necessarily become that much heavier. Whether both QC, if admitted, would be allowed their costs for getting up the case and for their attendance in court is something the party involved would have to persuade the court (see O 59 r 19 of the Rules of Court).On the question of special qualifications or experience of the QC, I agree with both the Attorney General and the Law Society that the affidavits here are quite scanty in particulars. However, in the circumstances here, I am prepared to assume that, if it were necessary to call for further details as to their qualifications and experience, both QC would be able to furnish them. In the light of what I have said earlier, there is no need to do this here.I am told that the prescribed fee pursuant to s 21(5) read with the Legal Profession (Fees for Ad Hoc Admission) Rules (Cap 161, R 14, 1994 Ed) has not been paid to the Attorney General and the Law Society of Singapore in these applications. The said fee has also not been paid to the Attorney General in the earlier application in respect of Mr Stuart Littlemore QC. I am also informed that Dr Chee gave his personal undertaking that he would make the payment to the Attorney General in that earlier application. The prescribed fee to be paid by an applicant to the Attorney General and the Law Society is $1,000 each. It should have been paid at the time of service of these applications.I shall concern myself only with the fee payable in the applications before me. Dr Chee does not deny the non-payment in each case and has undertaken before me that he will try his very best to pay the prescribed fee. He has asked that I waive the fee but I do not think that is something the law permits the court to do. I have indicated to Dr Chee that I was willing to hear him in these applications but would be ordering him to make the payment within one month from today. I think it proper that he should be ordered to make the payment personally as he is appearing before the court on behalf of the QC seeking admission and he should  have ensured that payment was made, especially after having been told about this in the earlier application in January. I am therefore ordering Dr Chee to pay to the Attorney General and to the Law Society of Singapore the prescribed fee of $1,000 each in respect of each of the present applications within one month from today.For the reasons given, both applications are dismissed.Outcome:Applications dismissed.Copyright © Government of Singapore."
    }
}