{
    "case_title": "Show Theatres Pte Ltd (in liquidation) v Shaw Theatres Pte Ltd and another application",
    "ncitation": "[2002] SGHC 61",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Whether the transaction was at an undervalue": "11.    Whether or not the transaction was at an\n\nundervalue will next be considered. The liquidator noted that no valuation report had been\n\nproduced to justify the price paid by ST for the shares and that in Chinatown Point’s\n\naudited balance sheet as at 31 March 1997, the Book Net Tangible Assets showed that the\n\nshares in question were worth only around $0.96 per share. Furthermore, the investment in\n\nthe Chinatown Point shares was totally written off in ST’s financial statements as at\n\n31 March 1998.12.    InMcDonald and Anor v Hanselmann[1998] 28 ACSR 49, 53, where transactions at an undervalue were considered by the Supreme Court\n\nof New South Wales, Young J rightly said that value is not a matter to be decided in a\n\nvacuum and that the relevant question is \"whether there was a bargain of such\n\nmagnitude that it could not be explained by normal commercial practice\". It is also\n\npertinent to note that regulation 6 of the Companies (Application of Bankruptcy Act\n\nProvisions) Regulations 1995 provides that the court shall not make an order referred to\n\nin section 98 of the Bankruptcy Act in respect of a transaction at an undervalue if it is\n\nsatisfied that the company which entered into the transaction did so in good faith and for\n\nthe purpose of carrying on its business; and that at the time it did so there were\n\nreasonable grounds for believing that the transaction would benefit the company.13.    Shaw contended that the price of $1.20 per share\n\nwas fair, reasonable and commercially justifiable because of the benefits which ST\n\nexpected to derive from the purchase of Chinatown Point shares. Shaw’s counsel, Mr\n\nTan Kok Quan SC, pointed out that Shaw, which owned 65% of ST, had to provide ST with much\n\nof the funds required for the purchase of the shares. More importantly, it must be noted\n\nthat it was Eng Wah’s nominee director on the ST Board, Mr Goh Keng Beng, and not\n\nShaw’s nominee directors on the ST Board, who negotiated the purchase of the\n\nChinatown Point shares from Shaw. Eng Wah must have considered it in ST’s interest to\n\npurchase the Chinatown shares from Shaw. In his affidavit dated 25 July 2001, Mr Goh, who\n\nconfirmed that the shares were purchased after he had discussions with the management of\n\nEng Wah, added as follows:5. …. I was appointed by [ST] to negotiate on behalf of the\n\n  Company.6. [I]t was agreed that it was in the best interest of the Company to\n\n  purchase 500,000 shares of Chinatown Point at S$1.20 per share from the Respondents….8. In arriving at the conclusion that the price of S$1.20 was fair and\n\n  reasonable, I had taken into account the commercial benefits that could be obtained by the\n\n  Company at that time….12. As [ST] wanted to have the benefit of participating in the\n\n  operation of Choa Chu Kang Cineplex, it was necessary for the company to become a\n\n  shareholder of Chinatown Point….14.    …. It was a pure commercial decision on the part of [ST]\n\n  with a view to future benefits. The purchase was approved by the Directors of the Company.14.    After taking all circumstances into account,\n\nincluding the fact that Eng Wah viewed the transaction at arm’s length as it had to\n\nprovide part of the funds required by ST for the purchase of the 500,000 Chinatown Point\n\nshares from Shaw, I hold that the transaction was not at an undervalue. ST entered into\n\nthe transaction in good faith and for the purpose of carrying on its business and at the\n\ntime it did so, there were reasonable grounds for believing that the transaction would\n\nbenefit the company. As such, the liquidator’s claim with respect to the Chinatown\n\nPoint shares is dismissed with costs.C. REPAYMENT OF SHAREHOLDERS’ LOANS15.   SIC No 601420 of 2001, which concerns the repayment by\n\nST of shareholders’ loans to Shaw and Eng Wah will next be considered. It is common\n\nground that ST borrowed money from Shaw and Eng Wah and that it paid Shaw $375,000 on 6\n\nAugust 1999 and Eng Wah $125,000 on 28 September 1999. It was not disputed that ST was\n\ninsolvent when these shareholders’ loans were repaid.16.    The liquidator contended that the question of an\n\nunfair preference arises because the money borrowed by ST from Shaw and Eng Wah should not\n\nhave been paid ahead of the sums claimed by the company’s other creditors. As for\n\nwhat is an \"unfair preference\", section 99(3) of the Bankruptcy Act provide as\n\nfollows:For the purpose of this section and sections 100 and 102, an individual\n\n  gives an unfair preference to a person if –(a) that person is one of the individual’s creditors or a surety\n\n  or guarantor for any of his debts or other liabilities; and(b) the individual does anything or suffers anything to be done which\n\n  (in either case) has the effect of putting that person into a position which, in the event\n\n  of the individual’s bankruptcy, will be better than the position he would have been\n\n  in if that thing had not been done.17.    Shaw and Eng Wah contended that they were not\n\nobliged to return to ST the amounts repaid to them in 1999 for three reasons. First, the\n\nrepayment of the loans fell within the ambit ofQuistclose Investments Ltd v Rolls\n\nRazor Ltd[1970] AC 567. Secondly, the Companies (Application of Bankruptcy Act\n\nProvisions) Regulations 1995, on which the liquidator relied for questioning the validity\n\nof the repayment of the shareholders’ loans, are ultra vires the Bankruptcy Act.\n\nThirdly, the loans were repaid outside the relevant time referred to in section 100 of the\n\nBankruptcy Act for impugning transactions on the basis of an undue preference.",
        "The Quistclose case": "18.    InQuistclose Investments Ltd v Rolls Razor\n\nLtd, R Ltd, a company facing financial problems, negotiated with a financier for a\n\nloan of 1m. It was suggested that the loan might be made on condition that R Ltd found a\n\nsum of around 209,719 to pay an ordinary share dividend that had already been declared.\n\nQuistclose agreed to lend R Ltd this sum on condition that it was to be used to pay the\n\ndividend in question. Quistclose’s cheque was paid into a separate account opened\n\nspecifically for the agreed purpose of the loan. Before the dividend was paid, R Ltd went\n\ninto voluntary liquidation. Quistclose claimed that it was entitled to a refund of the\n\namount loaned on the ground that it was loaned for the sole purpose of enabling R Ltd to\n\npay the dividend in question. It was evident that the mutual intention of the parties and\n\nthe essence of the bargain was that the money loaned should not become part of the assets\n\nof the company, but should be used exclusively for payment of a particular class of\n\ncreditors. It was held that Quistclose was entitled to the money loaned to R Ltd.19.    A modern formulation of theQuistcloseprinciple\n\nmay be found inRe Goldcorp Exchange Ltd[1975] 1 AC 74, 100, where Lord Mustill\n\nsaid:[I]t is necessary to show either a mutual intention that the moneys\n\n  should not fall within the general fund of the company’s assets but should be applied\n\n  for a special designated purpose, or that having originally been paid over without\n\n  restriction the recipient has later constituted himself a trustee of the money….20.    Shaw and Eng Wah asserted that their position is\n\nsimilar to that in theQuistclosecase. In May 1997, ST’s Board of Directors\n\nwas informed that it was necessary for the company to call on its shareholders to provide\n\n$2.6m for various purposes, one of which was to enable ST to provide a loan of $500,000 to\n\nChinatown Point. On 29 May 1997, a resolution was passed asking the shareholders to\n\nprovide an unsecured interest-free loan in proportion to their shareholdings. For the loan\n\nto Chinatown Point, Shaw gave ST $375,000 while Eng Wah, which owned the rest of the\n\nshares, gave ST $125,000. Shaw and Eng Wah said that after the loan of the $500,000 was\n\nmade to ST, Chinatown Point ceased to exist. As such, ST did not loan the money to\n\nChinatown Point. They contended that the sum did not form part of ST’s general funds\n\nand that it ought to be returned to them as the agreed purpose of the loan was not carried\n\nout.21.    The liquidator, who took a different view, argued\n\nthat there was no mutual intention on the part of ST and its shareholders that the money\n\nloaned to ST should be used for a designated purpose, failing which it should be returned.\n\nAdmittedly, Mr Yap Bock Seng, ST’s secretary and chief accountant, noted in his paper\n\nto the directors that there were a number of items in respect of which funding was\n\nrequired from ST’s shareholders. One of the items listed was a \"provision for\n\nloan to Chinatown\" totalling $500,000. Counsel for the liquidator, Mr Lee, rightly\n\nargued that if the $500,000 referred to in Mr Yap’s paper falls within the ambit of a\n\ntrust such as that upheld in theQuistclosecase, Shaw and Eng Wah can argue that\n\nall the sums mentioned in Mr Yap’s paper are also within the ambit of theQuistclosetype of trust. This cannot be the case. He also noted that the alleged purpose of the\n\n$500,000 loan was not mentioned in the director’s resolution dated 29 May 1997, which\n\nmerely referred to a lump sum of $2.6m required as a loan from the shareholders.22.    Mr Lee pointed out that there was no evidence\n\nthat the $500,000 loaned by Shaw and Eng Wah to ST had been placed in a fixed deposit that\n\nwas separate from ST’s other funds pending its release to Chinatown Point. He also\n\nsaid that if the $500,000 had been intended as a loan from ST to Chinatown Point, it\n\nshould have been returned to Shaw and Eng Wah as soon as it was evident that its purpose\n\ncould not be achieved. However, Shaw and Eng Wah did not demand that the $500,000 be\n\nrefunded to them until two years later. By that time, ST was insolvent. Mr Lee contended\n\nthat in the circumstances of the case, noQuistclosetrust had been created. I\n\nagree and hold that the $500,000 is a normal loan made by Shaw and Eng Wah to ST. As such,\n\nit should not have been repaid to Shaw and Eng Wah in priority to the other unsecured\n\nloans and liabilities of ST. The first defence of Shaw and Eng Wah thus fails.",
        "Whether the Companies (Application of Bankruptcy Act Provisions) Regulations 1995 are\n\ninvalid": "23.    The assertion by Shaw and Eng Wah that the\n\nCompanies (Application of Bankruptcy Act Provisions) Regulations 1995 (\"CABAR\")\n\nare ultra vires the Bankruptcy Act will next be considered. The CABAR were made by the\n\nMinister for Finance pursuant to section 411 of the Companies Act. Counsel for Shaw and\n\nEng Wah, Mr Tan, asserted as follows in his written submissions:[T]he Bankruptcy Act does not come within the portfolio of the Minister\n\n  for Finance. If the meaning of the word \"associate\" as determined by the\n\n  Bankruptcy Act is sought to be modified or amended, it must be done by the Minister for\n\n  Law pursuant to an enabling section in the Bankruptcy Act, if any….[T]he Prime Minister … had directed that … the Minister for\n\n  Law [be] responsible for … the Official Assignee and Public Trustee’s Office\n\n  ….As such, it is submitted that … the Minister for Finance had no\n\n  authority to make regulations pursuant to section 411(g) of the Companies Act toamend\n\n  the provisions of the Bankruptcy Act.24.    Mr Tan’s argument raises a number of issues\n\nwhich need not be considered as the question of ultra vires does not arise in this case.\n\nSection 329(1) of the Companies Act incorporates some provisions of the Bankruptcy Act,\n\nwhich concerns the insolvency of individuals, as part of the law relating to companies in\n\nliquidation. In doing so, it does not amend the Bankruptcy Act. Evidently, some\n\nRegulations are needed to give effect to section 329(1) of the Companies Act and the CABAR\n\nserve this purpose. Regulation 3 of the CABAR provides thatfor the purpose of section\n\n329 of the Companies Act, sections 98, 99, 100, 102 and 103 of the Bankruptcy Act\n\nshall be read subject to the modifications set out in regulations 4 to 9 and such textual\n\nand other modifications as may be necessary for their application to a company which is\n\nbeing wound up. By introducing the CABAR, the Minister of Finance enabled section 329(1)\n\nof the Companies Act to operate properly in the context of companies in liquidation. As\n\nsuch, he acted within the scope of section 411(g) of the Companies Act, which provides\n\nthat the Minister may \"make regulations for or with respect to all matters or things\n\nwhich by this Act are required or permitted to be prescribed otherwise than by rules or\n\nwhich are necessary or expedient to be prescribed for giving effect to this Act\". In\n\nview of the aforesaid, the second defence advanced by Shaw and Eng Wah was rejected.Relevant time25.    Whether the shareholders’ loans were repaid\n\nbefore the relevant time referred to in section 100 of the Bankruptcy Act will next be\n\nconsidered. In the case of an unfair preference given by ST to an associate, the relevant\n\ntime is two years before the presentation of the winding-up petition. In any other case,\n\nthe relevant time is six months. As the shareholders’ loans were repaid in August and\n\nSeptember 1999, more than six months before the winding-up petition was presented in\n\nOctober 2000, the liquidator’s claim against Shaw and Eng Wah will fail if they are\n\nnot ST’s associates.26.    To determine whether or not a company is an\n\nassociate of another company, the provisions of the Bankruptcy Act and the CABAR must be\n\nconsidered. Shaw and Eng Wah contended that attention should be focussed on regulation 5\n\nof the CABAR, which provides as follows:In addition to the provisions of section 101 of the Bankruptcy Act by\n\n  which the question whether a person is an associate of another person is to be determined,\n\n  a company shall be regarded as an associate of another company if –(a)    the same person has control of both companies, or a person has\n\n  control of one company and persons who are his associates, or he and persons who are his\n\n  associates, have control of the other company; or(b)    a group of 2 or more persons has control of each company, and\n\n  such groups either consist of the same persons or could be regarded as consisting of the\n\n  same persons by treating (in one or more cases) a member of either group as replaced by a\n\n  person of whom he is an associate.27.    Mr Tan submitted that as the liquidator did not\n\nfurnish any evidence of the requisite control referred to in regulation 5 of the CABAR,\n\nShaw and Eng Wah cannot be regarded as ST’s associates.28.    In contrast, the liquidator’s counsel, Mr\n\nLee, relied on regulation 4 of the CABAR, which provides as follows:Any reference to an associate of a person or an individual who has been\n\n  adjudged bankrupt (except any such reference to section 101 of the Bankruptcy Act) shall\n\n  be read as a reference toa person connected with a company… against\n\n  which a winding-up order has been made….(emphasis added)29.    Mr Lee next relied on regulation 2 of the CABAR,\n\nwhich provides that a \"person connected with a company\" means, inter alia, a\n\nperson who is a director of the company or\"an associate of such a director\".\n\nIn his written submissions, he put his clients’ position as follows:Pursuant to section 101(4) of the Bankruptcy Act, a person is an\n\n  associate of an individual whom he employs or by whom he is employed and, for this\n\n  purpose, any director of a company shall be treated as employed by that company. Since the\n\n  directors of [ST] are also directors of either Shaw Theatres (in the case of Shaw Vee\n\n  Chung, Harold and Shaw Vee King) and Eng Wah (in the case of Goh Keng Beng), Shaw Theatres\n\n  and Eng Wah would be ‘associates’ of at least a director of the company.\n\n  Applying the definition in regulation 2 of the [CABAR], Shaw Theatres and Eng Wah would\n\n  then be persons connected with [ST] and accordingly, ‘associates of [ST]\" for\n\n  the purpose of section 100(b) of the Bankruptcy Act.30.    While a person who is connected with a company\n\nincludes an associate of a director of that company, note must be taken of regulation 2 of\n\nthe CABAR which provides that the word \"associate\" as used in the Regulations,\n\nunless the context requires otherwise, means \"an associate of a person or company as\n\ndetermined in accordance with section 101 of the Bankruptcy Act as modified by regulation\n\n5\". In his informative article onThe Avoidance Provisions of the Bankruptcy Act\n\n1995 and their Application to Companies[1995] SJLS 597, 636, Mr Lee explained the\n\nambit of section 101 and its application to companies in liquidation in the following\n\nsuccinct terms:The scheme of section 101 of the Bankruptcy Act is that it lists\n\n  certain situations in which apersonor acompanyis an associate of anindividual.It is clear that the word ‘individual’ here, as in the other relevant\n\n  provisions, refers to the debtor who is subsequently adjudged a bankrupt. Presumably,\n\n  then, when it is sought to apply the section to companies, the word ‘individual’\n\n  must be taken to mean a reference to the company which is being wound up or under judicial\n\n  management, as the case may be.31.    Section 101(4) of the Bankruptcy Act provides as\n\nfollows:A person is an associate of an individual whom he employs or by whom he\n\n  is employed and for this purpose, any director or other officer of a company shall be\n\n  treated as employed by that company.32.    If the word \"individual\" is replaced by\n\nthe word \"company\", section 101(4) provides as follows:A person is an associate of [a company …] he employs or by whom he\n\n  is employed andfor this purpose, any director or other officer of a company shall\n\n  be treated as employed bythatcompany.(emphasis added)33.    As Mr Lee rightly pointed out in his article onThe\n\nAvoidance Provisions of the Bankruptcy Act 1995 and their Application to Companies,\n\nthe word \"company\", when used in place of \"individual\" in section\n\n101(4) of the Bankruptcy Act, refers to the \"company which is being wound up\".\n\nThe words \"for this purpose\" and \"that\"company make it\n\nclear that section 101(4), when read in the context of companies in liquidation, merely\n\nprovides that a director of a company that is being wound up is an associate ofthatcompany. Whether this is the result intended when the provisions of the United Kingdom\n\nInsolvency Act, on which section 104 of the Bankruptcy Act and the CABAR are modelled,\n\nwere incorporated into the Bankruptcy Act and the CABAR is an interesting question.\n\nWhatever may be the UK position, I cannot, in the face of the clear words of section\n\n101(4) of the Bankruptcy Act, accept the liquidator’s argument that that this\n\nstatutory provision results in Shaw and Eng Wah being associates of ST. The words of\n\nsection 101(4) will be gravely distorted if they are to have the added effect of making a\n\ncompany that is being wound up an associate of another company solely on the ground that\n\nthey have one common director.",
        "Conclusion": "34.As Shaw and Eng Wah cannot be regarded as\n\nassociates of ST on the basis of section 101(4) of the Bankruptcy Act, the relevant time\n\nunder section 100 of the Bankruptcy Act with respect to the repayment of the\n\nshareholders’ loans is six months. Since the ST’s repayment of the\n\nshareholders’ loans to Shaw and Eng Wah was made more than six months before the\n\npresentation of the petition to wind up ST, the liquidator’s claim in SIC 601420 of\n\n2001 is dismissed with costs.Sgd:TAN LEE MENGJudgeCopyright © Government of Singapore."
    }
}