{
    "case_title": "Tan Chin Seng and Others v Raffles Town Club Pte Ltd (No 2)",
    "ncitation": "[2002] SGHC 110",
    "coram": "MPH Rubin J",
    "sections": {
        "O Co. v M Co.": "[1996] 2 Lloyds LR 347 (folld)",
        "Fuji Photo Film Co Ltd v Carr’s Paper Ltd and others": "[1989] RPC 713 (refd)",
        "G.E. Capital Corporate Finance Group Ltd v Bankers Trust Co. and": "Others\n\n[1995] 1 WLR 172 (folld)",
        "Manilal & Sons (Pte) Ltd v Bhupendra KJ Shan (t/a JB International)": "[1989] SLR 1182 (refd)",
        "Marks and Spencer plc v Granada TV and Another": "(unreported) (refd)",
        "Standard Chartered Bank v Ssangyong Cement (Singapore) Limited": "(S\n\n1173/1991, unreported) (refd)",
        "The Patraikos 2": "[2001] 4 SLR 308(refd)",
        "Thorpe v Chief Constable of the Greater Manchester Police": "[1989] 2 All ER 827 (folld)Legislation referred toRules of Court O 24 r 5JudgmentGROUNDS OF DECISION1.    This is an appeal by the defendants against\n\nthe order of the learned Assistant Registrar of the Supreme Court made on 23 April 2002,\n\nrequiring the defendants to provide the plaintiffs with a number of documents by 5 p.m. on\n\n7 May 2002. Failure to comply with the order would have resulted in the plaintiffs\n\nentering judgment against the defendants. The background to the present appeal is provided\n\nbelow.2.    The plaintiffs, a group of about 4,895 disgruntled\n\nmembers of a proprietary social club, have brought this action against the club, the\n\ndefendants herein, based on actionable misrepresentation and breach of contract. The\n\npurpose of this action, as stated in the plaintiffs’ statement of claim is to seek\n\ndeclaratory orders and compensation for the said alleged actionable misrepresentation and\n\nbreach of contract, reportedly contained in a set of documents which the plaintiffs term\n\nas a ‘common law prospectus’, promising lavish reception and facilities to all\n\nselected and accepted by the defendants as members of the club.3.    The plaintiffs allege that the defendants issued\n\nand caused to be despatched to members of the public the said common law prospectus.\n\nAccording to the plaintiffs, the said common law prospectus comprised:(a) a letter of invitation dated 9 November 1996;(b) a document giving general information in the form of questions and\n\n  answers; and(c) a brochure.4.    The plaintiffs further aver in their statement of\n\nclaim that the said prospectus contained, inter alia, the following highlights either by\n\nexpress representation or by way of necessary implications:(a) It was planned that the Club would have nearly 600 car park lots\n\n  for the use of the members.(b) \"Raffles Town Club members will enjoy unparalleled privileges\n\n  and facilities\".(c) \"The Club’s exclusive and limited memberships will be\n\n  fully transferrable\".(d) The Club would be constructed to have a total built-up area in\n\n  excess of 400,000 sq. ft. catering for the \"business entertainment, networking,\n\n  socializing, personal and family leisure requirements\" of each successful\n\n  subscription for the duration of the membership. The Club would have \"separate\n\n  formal, casual, sporting, children’s and family facilities\" for the successful\n\n  subscribers.(e) A supplementary card would be issued to the spouse or fianc of\n\n  the member allowing full membership privileges and benefits at no additional cost. This\n\n  was intended to convey the meaning and message that each subscriber would receive two\n\n  licences for the price of one.(f) The Club would be \"without peer in terms of size, facilities\n\n  and sheer opulence\".(g) There would be two classes of individual members:(i) first, a limited number of exclusive transferable founder members\n\n    at S$28,000 (exclusive of GST) available to the credit-card holding customers on a\n\n    first-come-first-served basis. This class of founder members would be selected from those\n\n    who submitted their applications not later than 30 November 1996. Based on \"priority\n\n    applications\", this class of members were called \"founder members\"; and(ii) the second class of members would be selected from those not\n\n    selected from the priority applications and from fresh applications submitted in response\n\n    to a public launch to be made after 30 November 1996. The allotment price for this class\n\n    of members was to be S$40,000. This class of members will hereafter be called \"second\n\n    class members\".5.    In paragraphs 10 to 14 of the statement of claim,\n\nthe plaintiffs outlined how they understood the said representations and their grievances.\n\nInsofar as is material, the said segment reads as follows:10. The Plaintiffs and other members of the Class understood the\n\n  representations to mean that the total number of members at any given time would be\n\n  limited such that at any given time no member and the supplementary card-holder would be\n\n  shut out from or be unable to use the facilities of the Club, including the car parks in\n\n  the manner or up to the standard as represented in the prospectus. Such limitation was\n\n  also to be inferred from the holding-out and the representations (a) that the Club would\n\n  be \"without peer in terms of size, facilities and sheer opulence\", (b) that\n\n  there would be \"a limited number of exclusive individual founder member\n\n  memberships\" and (c) as to the number of car park lots and the total built-up area.\n\n  Further, the representations were to be understood, implied or inferred in the light of\n\n  the provisions of the Building Control Act, the regulations made thereunder as construed\n\n  and applied by the consultant architects engaged by the Defendant for the construction of\n\n  the Club.11. Additionally or alternatively, the representations and the\n\n  holding-out set out above became terms of the contractual licences spawned by the\n\n  acceptance of the Plaintiffs and other members of the Class.12. The Plaintiffs and other members of the Class on the faith of the\n\n  representations as set out above and the contents of the prospectus as a whole subscribed\n\n  to and became the founder members. Each of them paid the subscription in the sum of\n\n  S$28,000. All made their applications not later than 30 November 1996. In addition, they\n\n  paid monthly subscriptions and deposits for the Food and Beverage Account.13. The representations as set out above turned out to be untrue, false\n\n  and misleading.Particularsa. The Club in fact accepted 19,000 members each of whom had paid\n\n    S$28,000. The acceptance was communicated by the Defendant to the successful applicants in\n\n    December 1996. There was no public launch of $40,000 for the second class members.b. The Club was opened in March 2000 and not end of 1998 as promised\n\n    and was woefully inadequate shockingly short of the representations to cater for and\n\n    accommodate the huge number of members and the supplementary card-holders.c. Not all facilities stated in the prospectus were available to the\n\n    members.d. The Defendant dreadfully failed to realise the representations set\n\n    out above with the result that the Plaintiffs and the other members of the Class were\n\n    unable to realise the aspirations and representations conveyed by the prospectus.e. The membership became virtually useless.14. Additionally or alternatively, by reason of the matters set out in\n\n  paragraph 13, the Defendant was in breach of the contract of the terms as asserted above.6.    In the result, the plaintiffs, alleging loss and\n\ndamage, seek declaratory orders and damages.7.    The defendants, in the defence filed by them\n\nwithout prejudice to their rights to apply to the court to strike out the plaintiffs’\n\nclaim resist the claim and aver that the plaintiffs are not entitled to the remedies\n\nsought by them. Insofar as is material, paragraphs 10 and 13 of the defence require\n\nreproduction and they are as follows:10. Insofar as Paragraph 10 of the Statement of Claim alleges that the\n\n  Plaintiffs and other members of the Class understood that there were certain\n\n  representations made, and that these representations were understood to mean such\n\n  allegations as are contained in paragraph 10 of the Statement of Claim, the\n\n  Plaintiffs’ state of mind and the stage of mind of the members of the Class is not\n\n  within the Defendant’s knowledge. Consequently, no admission is made thereto.13. The Defendants further aver that the Club is a proprietary club,\n\n  providing facilities and amenities for the use of its members, who, in turn, have no\n\n  interest in the club property and/or income. The Plaintiffs and the members of the Class\n\n  applied to become members of the Club, by submitting the application forms. That is an\n\n  offer by the Plaintiffs and the members of the Class. The Defendant accepted the offer.\n\n  Plaintiffs and members of the Class thereby became members of the Club. The contract\n\n  between the parties is as set out in the said application forms and acceptance. The terms\n\n  of the contract are as set out in the said application form, which, as stated earlier is\n\n  an offer by the Plaintiffs and the members of the Class.8.    Further particulars were provided by the\n\nplaintiffs pursuant to an order of Court dated 4 March 2002 and they are too long to be\n\nentered upon here.9.    As mentioned by me at the outset, the appeal\n\nbefore me is confined only to the order made by the Assistant Registrar on 23 April 2002,\n\nrequiring the defendants to provide the plaintiffs a host of documents by 7 May 2002,\n\nfailing which the plaintiffs are entitled to enter judgment against the defendants. In\n\norder to comprehend the issues raised by the parties in regard to the present appeal, it\n\nwould be helpful at this stage to reproduce a schedule submitted by counsel setting forth\n\nthe description of the documents ordered to be produced by the defendants and the position\n\nof the defendants in this appeal in relation to the said documents. The said schedule\n\nreads as follows:Order of Court of the Assistant RegistrarS/No.DescriptionAppealing/Not Appealing1.Any one document of a date before 6\n\n    November 1996 recording a decision (whether of the Board, Raffles Town Club\n\n    (\"RTC\"), Raffles Town Club Pte Ltd (\"RTCPL\") and/or Raffles Town Club\n\n    Ltd (\"RTCL\"), its directors or its representatives) on the number of Raffles\n\n    Town Club members to be taken in the 1stoffering ending 30 November 1996 and\n\n    for the fee of S$28,000.The Defendant is appealing against this\n\n    order.2.Any one document of a date before 6\n\n    November 1996 recording a decision (whether of the Board of RTC, RTCPL and/or RTCL, its\n\n    directors or its representatives) on the number of Raffles Town Club members to be taken\n\n    in the 2ndoffering after 30 November 1996 and for the fee of $40,000.The Defendant is appealing against this\n\n    order.3.Any one document of a date after 30\n\n    November 1996 but before 31 March 1997 recording (whether by the Board of RTC, RTCPL\n\n    and/or RTCL, its directors or its representatives) the number of applications received and\n\n    determining the number of applications to be accepted from the applications made in the 1stoffering ending 30 November 1996 and for the fee of $28,000.The Defendant is appealing against this\n\n    order.4.Any one document or documents dated\n\n    1 January 1996 and before 31 September 1997 recording (whether by the Board of RTC,\n\n    RTCPL and/or RTCL, its directors or its representatives) the criteria for approving\n\n    applications in:(i) the 1stoffering ending 30 November 1996; and(ii) the 2ndoffering starting 1 December 1996,limited to documents where there is a material change in position from\n\n    the previous document in time.The Defendant is appealing against this\n\n    order.5.Any and/or all application forms submitted\n\n    after 30 November 1996 and before March 2000 approved for membership at the fee of\n\n    $28,000.The Defendant is appealing against this\n\n    order.6.Any one document recording the number of\n\n    applications approved after 30 November 1996 and before March 2000 for membership at the\n\n    fee of $40,000 or such sum as may be higher than $28,000.This is not being appealed.7.Any one document reflecting the membership\n\n    numbers during the following periods:(i) 30 December 1996(ii) 31 March 1997(iii) 31 January 1999(iv) 31 March 2000(v) 31 March 2001(vi) 31 March 2002The Defendant is appealing against this\n\n    order8.A copy of any invitation to membership\n\n    issued in the month of November 1996, whether jointly with another bank or financial\n\n    institution or by the Board of RTC, RTCPL and/or RTCL, its directors or its\n\n    representatives or by Europa Country Club, other than the invitation letters already\n\n    disclosed.This is not being appealed9.Any one document or documents dated after\n\n    1 January 1996 but before 31 September 2001 reflecting (whether by the Board of RTC,\n\n    RTCPL and/or RTCL, its directors or its representatives or agents such as architects):(a) (i) the final building plan/design submission to the Building\n\n    Control Authority;(ii) any material amendments to this final submission document thereafter;(b) (i) the decision shortly before June 2001 of using $100,000,000 for\n\n    additional facilities; and(ii) the implementation plan for the use of this additional S$100,000,000For the documents in category (a), these\n\n    are not being appealed.For the documents in category (b), the Defendant is appealing against\n\n    this order.10.Copies of correspondence(a) from members raising complaints; and(b) the club management’s replies, in relation to the in inadequacy and over-crowding\n\n    of the RTC coffee-house, Chinese restaurant, car-park and swimming pool for the period\n\n    March 2000 to July 2001.The Defendant is appealing against this\n\n    order.11.Any documents relating to the use of the\n\n    presidential or executive suites of RTC by a non-member person or body corporate in\n\n    relation to which period and for what fee, for the period March 2000 to March 2001.The Defendant is appealing against this\n\n    order.12.The Defendants are to produce for\n\n    inspection the originals of Item 106 – 129 of their List of Documents identified as\n\n    \"F & B Daily Sales and Cost of Sales Analysis\" with liberty for the\n\n    Plaintiffs to take copies at their cost.The Defendant is appealing against this\n\n    order.10.    An addendum to the foregoing schedule is perhaps\n\nappropriate at this stage. It is an agreed position between both counsel that in regard to\n\nitem 7 of the said schedule, the last four documents listed there, i.e., documents\n\nreflecting the membership numbers for the periods: (iii) 31 January 1999; (iv)\n\n31 March 2000; (v) 31 March 2001; and (vi) 31 March 2002 were never requested by\n\nthe plaintiffs but yet were ordered to be produced by the Assistant Registrar. During the\n\nhearing before me, counsel for the plaintiffs made it known to the Court that the\n\nplaintiffs were not asking for them to be produced.11.    Before I touch upon the arguments and conclusions\n\nreached by me, it would also be useful to make reference to the chronology of events in\n\nrelation to this discovery process. It reads as follows:Chronology of Discovery of DocumentsDateEvent18.01.02Summons for directions– Parties to file List of Documents by 01.03.0228.02.02Defendant filed SIC application to extend\n\n    time for filing of List of Documents04.03.02Hearing of Defendant’s SIC for\n\n    extension of time– extension to 18.03.02 granted by Assistant Registrar01.03.02Plaintiffs’ filed List of Documents18.03.02Defendant’s filed List of Documents\n\n    (3 arch lever files)21.03.02Plaintiffs’ solicitors inspected\n\n    documents in Defendant’s List of Documents22.03.02Plaintiffs’ solicitors wrote to\n\n    Defendant requesting for documents listed in Schedule25.03.02Defendant’s solicitors wrote to\n\n    Plaintiffs’ solicitors disputing relevancy of documents of categories 1-3 and 5-7 of\n\n    Schedule. Defendant’s solicitors said Category 4 too wide.02.04.02Plaintiffs’ filed SIC 968 of 2002 for\n\n    discovery of documents listed in Schedule03.04.02Defendant’s filed Supplementary List\n\n    of Documents (30 arch lever files)10.04.02Hearing of SIC 968 of 2002,\n\n    Defendant’s requested extension to file affidavit in reply, hearing adjourned to\n\n    17 April 200217.04.02Hearing of SIC 968 of 200219.04.02Hearing of SIC 968 of 200222.04.02Hearing of SIC 968 of 200223.04.02Order made by Assistant Registrar12.    In the appeal before me, in the main, the\n\nsubmission by the counsel for the appellants was that in the absence of a plea of\n\nfraudulent misrepresentation, a party is not entitled to ask for documents to evince the\n\nother party’s frame of mind. He further submitted that the court should not allow\n\nwide-ranging discovery where the party’s purpose is to fish for possible claims, as\n\ndiscovery in such a case may be oppressive. He added that the over-riding test in respect\n\nof discovery is relevance and this does not appear to be case in relation to the\n\nplaintiffs’ requests.13.    Counsel for the plaintiffs argued that the\n\ndocuments ordered are relevant to the issues and matters in question in the action; they\n\nare documents which the plaintiffs may or will rely on; they are documents which could\n\nadversely affect the defendant’s case or support the plaintiffs’ case; they are\n\ndocuments which may lead the plaintiffs to a train of inquiry resulting in the plaintiffs\n\nobtaining information which may adversely affect the defendant’s case or support the\n\nplaintiffs’ case; and above all they are necessary for disposing fairly of the cause\n\nor matter or as necessary for saving costs. Reliance was placed on O 24 r (5) of the\n\nRules of Court which provides:5.–(1) Subject to Rule 7, the Court may at any time, on the\n\n  application of any party to a cause or matter, make an order requiring any other party to\n\n  make an affidavit stating whether any document specified or described in the application\n\n  or any class of document so specified or described is, or has at any time been, in his\n\n  possession, custody or power, and if not then in his possession, custody or power, when he\n\n  parted with it and what has become of it.(2) An order may be made against a party under this Rule\n\n  notwithstanding that the party may already have made or been required to make a list of\n\n  documents or an affidavit under Rule 1.(3) An application for an order under this Rule must be supported by an\n\n  affidavit stating the belief of the deponent that the party from whom discovery is sought\n\n  under this Rule has, or at some time had, in his possession, custody or power, the\n\n  document, or class of document, specified or described in the application and that it\n\n  falls within one of the following descriptions:(a) a document on which the party relies or will rely;(b) a document which could –(i) adversely affect his own case;(ii) adversely affect another party’s case; or(iii) support another party’s case; and(c) a document which may lead the party seeking discovery of it to a\n\n    train of inquiry resulting in his obtaining information which may –(i) adversely affect his own case;(ii) adversely affect another party’s case; or(iii) support another party’s case.(4) An order under this Rule shall not be made in any cause or matter\n\n  in respect of any party before an order under Rule 1 has first been obtained in respect of\n\n  that party, unless, in the opinion of the Court, the order is necessary or desirable.",
        "Decision": "14.    In my view, whether a class of documents as a\n\nwhole would be relevant and should be produced for the purposes of discovery must depend\n\nupon the court’s evaluation that the documents sought would contain such information\n\nthat might enable the plaintiffs to advance their own case or damage that of the\n\ndefendants. Colman J inO Co. v M Co.[1996] Vol. 2 Lloyd’s LR 347 at 351\n\nobserved:[T]he document or class of documents must be shown by the applicant to\n\n  offer a real probability of evidential materiality in the sense that it must be a document\n\n  or class of documents which in the ordinary way can be expected to yield information of\n\n  substantial evidential materiality to the pleaded claim and the defence to it in the broad\n\n  sense which I have explained. If the document or class cannot be demonstrated to be\n\n  clearly connected to issues which have already been raised on the pleadings or which would\n\n  in the ordinary way be expected to be raised in the course of the proceedings, if\n\n  sufficient information were available, the application should be dismissed.15.    Still on this subject, it was held by the Court\n\nof Appeal in England, inThorpe v Chief Constable of the Greater Manchester Police[1989] 2 All ER 827, that it would not order discovery of material which would be used\n\nsolely for cross-examination of a witness as to credit since it would be oppressive if a\n\nparty was obliged to disclose any document which might provide material for\n\ncross-examination as to his credibility as a witness.16.    The cause of action as put forth by the\n\nplaintiffs is based on actionable misrepresentation and breach of contract. In this\n\nregard, the plaintiffs, in fact 4,895 of them in all, by and large rely on a so-called\n\ncommon law prospectus. Let me now deal with the nature of the documents requested and\n\nordered to be produced.17.Items 1 to 4 of the schedule: Documents\n\nrequested are in relation to decisions of the defendants’ board taken (a) before 6\n\nNovember 1996, (b) after 30 November 1996 but before 31 March 1997, and (c) after\n\n1 January 1996 but before 31 September 1997, on the criteria for approving membership\n\napplications as well as the number of members to be taken in for the fee of $28,000 in the\n\nfirst offering and for $40,000 in the second offering.18.    In my view, the decision of the board as to the\n\ncriteria to be adopted by them and the number of members they intended to recruit cannot\n\nbe a basis for any actionable misrepresentation or breach of contract and in this respect\n\nno material is placed before me to warrant an inference that the said documents might\n\nenable the plaintiffs to advance their case or damage that of the defendants. One can\n\nimagine that in any commercial venture there is bound to be discussions and decisions as\n\nto how the said venture should proceed to obtain optimum returns. In a dynamic and fluid\n\ncorporate environment, decisions are made and unmade to provide for contingencies. On the\n\nquestion how the criteria contemplated and decisions taken by the defendants’ board\n\nwould enhance the plaintiffs’ case, or damage that of the defendants, there was very\n\nlittle forthcoming from the plaintiffs.19.Item 5: The document here relates to\n\napplication forms to the club submitted after 30 November 1996 and before March 2000\n\napproved for membership at the fee of $28,000. Quite apart from the fact, the applicants\n\nmight well object to their personal particulars disclosed to all and sundry, in my view,\n\nthese application forms have little relevance to the representations allegedly made to the\n\nplaintiffs and breach spoken of. The request covers not only the period the alleged\n\nrepresentations were supposedly made in the said common law prospectus but also the\n\nensuing four years. Again, I was not persuaded as to the relevance how this group of\n\ndocuments might advance the case of the plaintiffs or damage the case of the defendants.\n\nCases referred to by the plaintiffs’ counsel (Manilal & Sons (Pte) Ltd v\n\nBhupendra KJ Shan(t/a JB International)[1989] SLR 1182,The Patraikos 2[2001] 4 SLR 308,Standard Chartered Bank v SSangyong Cement (Singapore) LimitedS1173/1991 unreported), all of them do not detract from the principle that in general\n\nwhere there is an order of court for discovery, a party is obliged to make discover all\n\ndocuments relevant to the matters in the action and what these matters are would depend on\n\nthe pleadings.20.Item 6: Documents ordered to be produced\n\nunder this item are not the subject of appeal before me.21.Item 7: As mentioned by me earlier (see\n\npara 10 infra), documents in respect of membership numbers as on 31 January 1999,\n\n31 March 2000, 31 March 2001 and 31 March 2002, although not asked for by the\n\nplaintiffs, were still ordered to be produced by the Assistant Registrar. During arguments\n\nbefore me, plaintiffs’ counsel informed me that he was not pressing for these\n\ndocuments. As for membership numbers as on 30 December 1996 and 31 March 1997, I was not\n\ninclined to disturb the order below as it would appear that the number of members in\n\nrespect of the periods mentioned are germane to the issues to be addressed in this case.22.Item 8: The document ordered is a copy of\n\ninvitation to membership in the month of November 1996 by the defendants and their\n\nassociates. This is indeed a relevant document and at any rate that there is no appeal by\n\nthe defendants in respect of this document.23.Item 9: There are two categories of\n\ndocuments, categories (a) and (b), ordered to be produced under this head. The defendants\n\nare not appealing against category (a) documents which relate to building plans and\n\ndesigns. The subject of appeal under this item is confined to documents grouped under\n\ncategory (b) only. They pertain to decisions made by the defendants or their associates\n\nshortly before June 2001 to use $100,000,000 for additional facilities and the\n\nimplementation of the plan using the said sum. In relation to these documents, I am\n\ninclined to agree with the defence contention that any decision that may have been made in\n\nthe course of the year 2001 cannot have any bearing or relevance to the alleged\n\nrepresentations made in the year 1996.24.Item 10: The documents ordered under this\n\nhead relate to members’ complaints and management replies concerning the inadequacy\n\nand overcrowding in the club’s facilities for the period March 2000 to July 2001. The\n\nfirst observation in regard to this request is that the plaintiffs, comprising a united\n\ngroup of 4,995 members, would by themselves, have been able to produce the letters of\n\ncomplaints they wrote to the management and the replies they might have received without\n\nhaving to pass the burden to the defendants. In any event, the complaints and the response\n\nare not shown to me to be of relevance to the issues to be decided.25.Item 11: The documents ordered relate to\n\nthe use of the presidential or executive suites of the club by a non-member or body\n\ncorporate and the fees charged for such use for the period March 2000 and March 2001. What\n\nlight, the documents requested would throw on the issues to be determined, I was not made\n\naware of. In any event, in my evaluation, this request is clearly an endeavour to unsettle\n\nthe defendants and has little relevance to the issues at hand.26.Item 12: Under this head, the defendants\n\nare required to produce for inspection the originals of item 106 – 129 of their List\n\nof Documents identified as \"F & B Daily Sales Analysis\" with liberty for the\n\nplaintiffs to take copies at their cost. I was told that the defendants that they on their\n\nown disclosed and produced these documents with certain parts blanked out. The blanked\n\nparts relate to how much money is charged and paid. The defendants’ contention is\n\nthat those parts are not relevant at all to the issues to be decided. The plaintiffs’\n\ncounsel’s reply is that inasmuch as the defendants have disclosed the documents to\n\nthe plaintiffs, the latter must bare all. InG.E. Capital Corporate Finance Group Ltd\n\nv. Bankers Trust Co. and Others[1995] 1 WLR 172, it was held by the Court of Appeal\n\nin England that a party giving discovery of a document is not obliged to disclose any part\n\nwhich is irrelevant to the issues in the case. In that case, the plaintiff had blanked out\n\nfrom the documents in a list served on the defendants passages considered irrelevant. The\n\njudge in the first instance ordered the complete documents to be disclosed since it had\n\nnot been alleged that they were irrelevant. The plaintiff appealed and the court of appeal\n\nallowed the appeal holding that the judge had applied the wrong test. Hoffmann LJ (as he\n\nthen was) observed at p.175 H that the irrelevant parts can be covered without destroying\n\nthe sense of the rest or making it misleading. In the case before me, counsel for the\n\nplaintiffs did not address me on the relevance of the blanked parts except to venture that\n\nhe would like to know whether the covered parts are relevant or not.27.   InMarks and Spencer plc v Granada TV and Another(unreported), a transcript of which is provided by the defendants’ counsel, Ebsworth\n\nJ, commented at page 4 of the transcript (last paragraph) \"[I]t is incumbent upon\n\na party making an application for a discretionary order, such as specificdiscovery,\n\nto ensure that which is sought is within the proper limits of relevance and sufficiently\n\nspecific to be the subject of the affidavit which is required to be sworn. If it is too\n\nwide then it is both extremely onerous for the opposing party and will add to, rather than\n\nsave costs by including matters which are not relevant. In those circumstances, as Aldous\n\nJ pointed out in Fuji Photo Film Co Ltd v Carr’s Paper Ltd and others [1989] RPC 713,\n\nthe court is entitled to refuse to make an order at all.\"28.    In my opinion, the very rationale for the\n\ndiscovery process, provided for in the Rule referred to, is relevance. If it is too wide,\n\ntoo onerous or oppressive then the courts are likely to reject the request. In my\n\ndetermination, the discoveries sought are too wide, extremely onerous and appear to lack\n\nthe essential ingredient of relevance.29.    Having considered all the arguments and the\n\nlearning referred to, I am of the view that discoveries requested and ordered, save for\n\nmatters conceded and not appealed against appear to straddle the realm of fishing. In my\n\ndetermination, most of the documents requested appears to have little or no relevance to\n\nthe issues to be decided except for the purposes of expanding the armoury of the\n\nplaintiffs, which the plaintiffs are now trying to assemble at the expense of the\n\ndefendants. When the appeal was in train before me, it was made apparent to me that the\n\npresent grievance by the plaintiffs arises from a disclosure obtained by the court in a\n\nprevious case where the membership numbers of the defendants surfaced. Having determined\n\nthat the categories documents sought by the plaintiffs are extremely wide and bear little\n\nrelevance to the issues, the following orders were made by me at the end. They are as\n\nfollows:(1) Appeal is allowed save for paragraph 1(7) of the Notice of Appeal\n\n  dated 25 April 2002;(2) In relation to paragraph 1(7) of the Notice of Appeal dated 25\n\n  April 2002, the Defendant shall give the Plaintiffs by 21 May 2002 either a document or\n\n  furnish best particulars of the:(a) number of members as at 30 December 1996; and(b) number of members as at 31 March 1997;(3) Order the Defendant, by 5.00 pm on 21 May 2002 to comply with the\n\n  orders made by the Assistant Registrar on 23 April 2002 which are not being appealed\n\n  against and the orders made herein.The Defendant to use its best endeavours to comply with the above\n\n  orders.In default, the Plaintiff may apply to Court to enter judgment against\n\n  the Defendant upon giving 48 hours’ notice to the Defendant;(4) There be liberty to apply; and(5) By consent, costs of the appeal and below be costs in the cause.Order accordingly.Sgd:MPH RUBINJudgeCopyright © Government of Singapore."
    }
}