{
    "case_title": "The Rainbow Spring",
    "ncitation": "[2002] SGHC 255",
    "coram": "Belinda Ang Saw Ean JC",
    "sections": {
        "(i)    The jurisdictional issue - In personam test in\n\ns4(4) of the Act": "7.        It is common ground that\n\nthe claim falls within s3(1)(h) of the Act. It is also common ground that the court only\n\nhas jurisdiction to entertain an action in rem if the Plaintiff satisfies s4(4) of the\n\nAct.8.        It is not in dispute that\n\nthe burden is on the Plaintiff to establish that RSSL is the likely person to be liable in\n\npersonam on the claim. As to the standard of proof, Selvam JC (as he then was) in The\"Opal 3\"[1992] 2 SLR 585stated that in applying the in personam test in\n\ns4(4) of the Act, all that is needed is an arguable case. See The\"St\n\nElefterio\"[1957] 1 Lloyd’s Law Rep 283 and The\"Wigwam\"[1982-1983]\n\nSLR 188. Justice Chua’s decision in The\"Wigwam\"was affirmed by the\n\nCourt of Appeal. (See unreported decision dated 14 September 1984 in Civil Appeal no. 89\n\nof 1982). Admiral has only to show that it has an arguable case, even though it may have a\n\ndifficult case in fact or law. If the Plaintiff discharges the burden, the action would\n\nproceed to trial.9.        The sole question, which I\n\nhave to consider, is whether it is arguable that RSSL would be liable in personam. If the\n\nplaintiff’s case on jurisdiction is plainly unarguable in that it is bound to fail,\n\nthe in rem writ would be set aside. The present case is no different from the rest where\n\nthe substance of the underlying claim is factually inseparable from the basis of\n\njurisdiction.10.        Counsel for the\n\nDefendant, Mr. Toh Kian Sing, urged the court to adopt the robust approach taken in The\"AA\n\nV\"[2001] 1 SLR 207where 15 affidavits were filed. Judith Prakash J said:\"….if the evidence before me convincingly established that\n\n    the defendants were not party to those contracts then I would have to hold at this early\n\n    stage that the admiralty jurisdiction of the court had not been properly invoked.\"[p218]11.        On the first page of the\n\ncharterparty, Oriental is named as ‘Owners\" of the \"RAINBOW SPRING\".\n\nThe \"owning company\" is stated to be Oriental in the Description Clause (Clause\n\n74) which incorporated Charterer’s completed Questionnaire. On page 3, there is a\n\ncompany stamp of RSSL where Tam Kwong Lim(\"Tam\"), who is president and director\n\nof RSSL, had signed the document on behalf of RSSL. The signature of Tam as RSSL\n\nrepresentative/director viewed in isolation is unqualified.12.        Counsel for the\n\nPlaintiff, Ms Magdalene Chew, advances the proposition that a party who signs a contract\n\nin his own name is deemed to have contracted personally unless it is clear he executed it\n\nas agent only. The general principle is set out inScrutton on Charterparties(20thEdition) Art 19 p45:\"Where a person signs the charter in his own name without\n\n    qualification, he is prima facie deemed to contract personally and, in order to prevent\n\n    this liability from attaching, it must be clear from the other portions of the\n\n    charterparty that he did not intend to contract personally.\"13.        Counsel further submits\n\nthat if nonetheless there is ambiguity on the face of the charterparty as to identity of\n\nthe contracting party, extrinsic evidence is admissible as an aid in identifying the\n\ncontracting party:Chitty on Contracts(28thed) Vol. 1 12-120.14.        Ms Chew said that on\n\nconstruing the entire document, RSSL was clearly the contracting party. Ms Chew referred\n\nme to some of the clauses in the charterparty. For example, Clause 72 which provides:\"Owners to have the option to sell the vessel together with\n\n    charterparty subject to Charterer’s approval of new ownership, which should not be\n\n    unreasonably withheld.\"The Defendant is the only party who would have the right to\n\n\"sell\" the vessel. Therefore, the word \"Owners\" in Clause 72 is\n\nclearly referable to the Defendant as registered owner of the vessel and not Oriental.15.        Clause 40 states that\n\nWest of England is \"Owners’ P&I Club\". Again the word\n\n\"Owners\" there is referable to RSSL. During negotiations for the charter, West\n\nof England had at the behest of RSSL commented on the terms of the charter. West of\n\nEngland also handled the off-hire dispute and dispute over prices of bunkers applicable at\n\ntime of redelivery. Furthermore, West of England communicated with the Plaintiff on these\n\ndisputes as if the charter was with RSSL. West of England only disclosed that Oriental was\n\nnot its member at the setting aside stage.16.        There are some documents\n\nemanating from the Defendant which showed the time charterparty dated 8 January 1998 to be\n\nbetween Admiral and RSSL. For example, the Notice of Assignment of earnings dated 29 April\n\n1999 was addressed to Admiral and signed by Tam for RSSL.17.        Woo Man Fong\n\n(\"Woo\"), the general manager of the Defendant, asserts in his affidavit that the\n\nDefendant’s rubber stamp on the charterparty was due to a clerical mistake. Kingstar\n\nShipping Ltd (\"Kingstar\"), the vessel’s agent, kept the Defendant’s\n\nrubber stamp in its office and the wrong stamp was used.18.        Woo also asserts that the\n\nPlaintiff was fully aware at the time of the arrest that the contracting party was\n\nOriental. He cites in support the Plaintiff’s voyage instruction to the master dated\n\n22 April 1998 where Oriental was expressly referred to as head owner and Admiral as time\n\ncharterer. The Notice of Assignment of earnings dated 8 February 1998 named Oriental as\n\nthe contracting party. Ms Chew had earlier drawn my attention to a contrary position\n\nappearing in the Notice of Assignment of earnings dated 29 April 1999. The Defendant also\n\nreferred to the Protocol of Delivery to evidence delivery of the vessel by Oriental to\n\nAdmiral. However, that document is unreliable in that not only is it incomplete as the\n\nblank spaces were not filled in but the document alludes to a bareboat charterparty dated\n\n25 November 1997 between Admiral and Oriental. Further, the Protocol of Delivery was not\n\nsigned by Admiral.19.        The inconsistencies in\n\ndocuments are dismissed as clerical mistakes by the Defendant. As for West of England\n\npursuing a claim ostensibly on behalf of RSSL, the explanation put forward by Fiona\n\nCaldwell McCoig on behalf of West of England is that she was assisting the manager, Hang\n\nWoo Ship Management Ltd, who is also a member.20.        In addition, it is said\n\nthat Admiral’s P&I Club, Assuranceforeningen SKULD (Gjensidig) Den Danske\n\nAfdeling (\"Skuld\"), and American lawyers M/s Lambos & Junge have in\n\ncorrespondence acknowledged and treated Oriental as the contracting party. Furthermore, on\n\n11 October 2001 Skuld appointed John Schofield as arbitrator in respect of the dispute\n\nunder the charter between Admiral and Oriental.21.        I have in the foregoing\n\nparagraphs mentioned the main points in the case on either side. Fortuitously for the\n\nDefendant, in the present case the jurisdictional fact in dispute could be decided despite\n\nthese apparent conflicting evidence, arguments and counter arguments. Of decisive\n\nimportance is whether I accept the contrary view of the Defendant that the fixture was\n\nconcluded by exchanges of correspondence before the formal charter was drawn up and\n\nsigned.22.        Negotiations for the\n\ncharter took place over two months. The faxes/telexes culminating in the fixture were\n\nexchanged between Plaintiff’s brokers, Rodskog Shipbrokers Limited\n\n(\"Rodskog\") and the vessel’s agent, Kingstar. By a fax dated 8 January\n\n1998, Kingstar informed Rodskog that the contracting party in the charterparty was to be\n\n\"Oriental Shipway Inc\". In that fax, Kingstar stated:\"PLS NOTE OWRS ON C/P SHALL BE \"ORIENTAL\n\n    SHIPWAY INC.\"23.        On 9 January 1998,\n\nRodskog replied and confirmed by telex the final terms as acceptable to charterers:\"VERY PLEASED WE ARE NOW CLEAN FIXEDCHARTERERS LOOKING FORWARD TO A PLEASANT COOPERATION WITH OWNERS AND\n\n    VESSELWE HAVE NOTED OWNERS STYLE FOR C/P BEING \"ORIENTAL SHIPWAY\n\n    INC\" (WHERE REGISTERED PSE) BUT PLEASE FULL STYLE/ADDRESS OF MANAGERS TO WHOM HIRE\n\n    STATEMENTS ETC SHALL BE MAILED…\"24.        The phrase used to\n\nconclude the contract was\"VERY PLEASED WE ARE NOW CLEAN FIXED\".\n\nThe expression \"clean fixed\" in chartering parlance is used to signify a binding\n\ncharterparty contract or concluded fixture.25.        The unchallenged evidence\n\nshows: Oriental was named as contracting party and agreed by the Plaintiff. I am satisfied\n\nthat there was no contract between the Defendant and Plaintiff. It is plain that the\n\nPlaintiff’s case is unarguable and the writ of summons is therefore set aside.\n\nConsequently, the arrest is set aside on this ground and not on the ground of\n\nnon-disclosure.26.        Having answered the main\n\nissue in favour of the Defendant, it is unnecessary to deal with the bareboat charter\n\npoint raised at the hearing of this appeal.The Plaintiff’s Appeal",
        "(i)    Non-disclosure of material facts": "27.        Counsel for the Defendant\n\nsubmits that the Assistant Registrar was right and the arrest should be set aside because\n\nthe arrest was procured as a result of non-disclosure of material facts. The disclosure of\n\nthe charterparty itself was grossly inadequate to present to the court the true picture.\n\nHe contends that all or some correspondence and documents which show that the charterparty\n\nwas between Admiral and Oriental should have been disclosed. In particular, the fax dated\n\n8 January 1998 from Kingstar to Rodskog (pp 18 to 19 of Woo’s 2ndaffidavit); telex dated 9 January 1998 from Admiral to RSSL (p 34 of Woo’s 1staffidavit); fax dated 13 January 1998 (p 20 of Woo’s 2ndaffidavit); telex\n\ndated 16 January 1998 from Kingstar to Rodskog (p 35 of Woo’s 1staffidavit); Notices of Assignment dated 2 February 1998 (pp 50, 51 and 53 of Woo’s 2ndaffidavit); Sailing instructions from Seaside Navigation (pp 43 and 45 of Woo’s 2ndaffidavit); Skuld’s fax dated 16 May 2001 (p 55 of Rasmussen’s 2ndaffidavit) and Skuld’s fax of 31 May 2001 (pp 36 and 38 of Woo’s 2ndaffidavit).28.        Counsel for the Plaintiff contends on the\n\nauthority of The\"Varna\"[1993] 2 Lloyd’s Rep 253 that there is no\n\nduty to disclose the documents. In that case, the English Court of Appeal held that O75 r\n\n5(1) of the English Rules of the Supreme Court expressly bestowed the power to issue a\n\nwarrant of arrest on the plaintiff thereby effectively removing the discretion vested in\n\nthe court as to whether or not to issue a warrant of arrest. According to Ms Chew, Order\n\n70 r 4(1) of our Rules of Court was amended in 1997 and is in line with the English\n\nposition. The\"Damavand\"[1993] 2 SLR 717was a decision before 1997. And\n\nin The\"AA V\", the court’s attention was not drawn to the changes to\n\nthe Rules of Court and decision of The\"Varna\".29.        The decision of The\"Varna\"turned largely on amendments made to the Order 75 r 5(1) of the\n\nEnglish Rules of Supreme Court. With the amendments, the Praecipe for Warrant of Arrest\n\nwas revoked by RSC (Amendment No.2) 1981 (S.I. 1981 No. 1734).30.        Even though the language\n\nof our Order 70 r 4 (1) is similar to Order 75 r5(1) of the English Rules, the phrase\n\n\"the plaintiff may issue a warrant in Form 156\" in Order 70 r 4 (1) when read in\n\nconjunction with Form 156 and r 4(2)(a) does not confer a power on the plaintiff to issue\n\nthe warrant of arrest. It is the court that issues the warrant of arrest (Form 156)\n\nfollowing the filing of a Praecipe for Warrant of Arrest (see Order 70 r 4(2)(a)). A\n\nsensible reading of Order 70 r (4)(1) is that it is only after the writ is issued that the\n\nplaintiff may initiate issuance of a warrant of arrest. By Order 70 r 4(3), the warrant of\n\narrest will not be issued unless there is an affidavit complying with the particulars\n\nrequired by r 4 (6) and (7). Order 70 r 4(3) provides that even if there is non-compliance\n\nwith r 4(6) and (7), the court may in its discretion issue the warrant. Conversely, a\n\nfailure to comply with the rules could render the warrant of arrest a nullity as\n\nKulesekaram J so held in The\"Courageous Colocotronis\"[1978-1979] SLR 337.31.        In Singapore, the issue\n\nof a warrant of arrest is a discretionary remedy and, as on any ex-parte application for a\n\ndiscretionary remedy, full disclosure of material facts is required. The requirement that\n\nthere be full and frank disclosure of material fact on an application for arrest is\n\nclearly established.32.        Although I have ruled in\n\nfavour of the Defendant on the jurisdictional issue, for the reasons below, I am of the\n\nview that there is no material non-disclosure. The materiality of the non-disclosure\n\ncomplained about is neither premised nor dependent on the success of the Defendant’s\n\ncontention that the charter was concluded by exchanges of correspondence. Even if I have\n\nfound that there has been material non-disclosure, I have a discretion to uphold the\n\nwarrant of arrest:The Fierbinti[1994] 3 SLR 864at 879.33.        The Defendant’s\n\nposition is that a binding fixture was made before the formal charter was drawn up and\n\nsigned. If a contract is to be found from the correspondence the whole of that which\n\npassed between the parties must be taken into consideration. SeeHussey v Horne-Payne(1874) 4 App. Cas. 311. In the present case, the Plaintiff sued on the charterparty having\n\ntaken the view that the signed charter constituted the binding contract. Given the\n\nPlaintiff’s case as put forward and without reference to the further point whether it\n\nis likely to succeed or not, it was not unreasonable for Admiral to have excluded the\n\npre-fixture documents because of the parol evidence rule. To that extent, the Plaintiff\n\ncould not be criticised for making no disclosure of pre-fixture correspondence.34.        The charterparty was\n\nindeed the working document for the parties over the 4-year relationship. I also have\n\nregard to the passage of time since its formation in 1998 and the conduct of the parties\n\nin the context of this charter in the ensuing years. RSSL was set up to own the vessel and\n\nOriental to operate the vessel. Tam is a director of RSSL. Mr. Tam is also a director and\n\nshareholder of Oriental and Kingstar. It is not the Plaintiff’s case that the\n\ncorporate arrangement was a sham or faade or that Oriental was RSSL’s nominee. But\n\nMs Chew in her submissions said that the Plaintiff throughout the period of charter dealt\n\nwith Tam. Also over the 4-year relationship, the Defendant’s slipshod documentation\n\nhas created confusion. The situation was further compounded and complicated by the\n\ninvolvement of West of England as explained. It is clear that in the present case there\n\nare extenuating circumstances. Against this background and context, there is Peter\n\nRasmussen who particularly deposed in 6 of his affidavit in support of the arrest that\n\nAdmiral’s solicitors (not the American lawyers) had advised that it has a good claim\n\nagainst the Defendant.35.        For these reasons, I do\n\nnot consider a case has been made out to justify setting aside of the arrest on the ground\n\nof non-disclosure of material facts. Accordingly, Counsel for Defendant’s submission\n\nmust fail.36.        I note that the Assistant\n\nRegistrar in this case, set aside the warrant of arrest but not the in rem writ.\n\nOrdinarily, where the very existence of jurisdiction cannot be challenged or survives an\n\nattack in that the jurisdiction requirements of the Act are satisfied and the writ not set\n\naside and, there being at the same time no complaint that rules 4(6) and (7) have not been\n\ncomplied with, non-disclosure should seldom be the sole ground for setting aside the\n\nwarrant of arrest. In such a situation, assuming that the matters in question are material\n\nand ought to have been disclosed, the court in exercise of its discretion ought not to set\n\naside the warrant of arrest purely on the basis that the claimant had failed to disclose\n\nmatters in obtaining the warrant of arrest.37.        I would in passing\n\nmention Ms Chew’s contention that the affidavit leading the warrant of arrest need\n\nonly specify the matters set out in Order 70 r 4(6) and (7). Whilst this is often the case\n\nwith most arrest affidavits, the obligation under Order 70 r 4(6) and (7) is not so\n\nnarrow. Depending on the circumstances, a mere statement in purported compliance with\n\nOrder 70 r 4(6) and (7) may not be enough. It is incumbent on the deponent of the\n\naffidavit to make sure that he has a basis or reasonable ground for his statement of\n\nbelief as to the statutory requirements and where necessary to support the statement made\n\nin his affidavit. As Clarke J in The \"Tjaskemolen\"[1997] 2 Lloyd’s\n\nRep 465 said, and I completely agree with his remark, that how much detail is required in\n\nthe affidavit will depend upon the facts of a particular case. After all, the aim of the\n\nrequirements of r 4(6) and r 4(7) is twofold: (i) to enable the court to assess whether,\n\non the facts of the particular case, it has in rem jurisdiction under the Act; and (ii) to\n\nenable the defendant or prospective defendant, or other persons interested in the vessel,\n\nto identify the basis upon which and the claim in respect of which the property has been\n\narrested: The \"Tjaskemolen\"at p468. See also The\"Lloyd\n\nPacifico\"[1995] 1 Lloyd’s Rep 54 at p55; The\"Courageous\n\nColocotronis\"[1978-1979] SLR 337.",
        "Wrongful Arrest": "38.        For the same reasons\n\nexplained earlier in this decision, it could not be said that the arrest of the vessel was\n\nso obviously groundless as to amount to mala fides or crassa negligentia implying malice.\n\nA weak case for a plaintiff is not gross negligence: The\"Euroexpress\"[1988] SLR 67. Of significance is the fact that Admiral pursued the arrest on the back of\n\npositive legal advice. Bokhary JA in The\"Muale\"[1995] 2HKC 769 at 774\n\nobserved that whilst he was not prepared to go so far as to say that the fact that the\n\nplaintiff proceeded under legal advice is invariable a good answer to a claim for wrongful\n\narrest, he said that such advice is at least a relevant factor to be taken into\n\nconsideration. The Defendant has thus failed to establish mala fides or crassa negligentia\n\nin this case. Accordingly, the decision of the Assistant Registrar on wrongful arrest is\n\nreversed.39.        It follows from the\n\nsetting aside of the in rem writ and warrant of arrest that the security provided by West\n\nof England is to be returned to the Defendant for cancellation. The Plaintiff is to pay\n\nthe Defendant the costs of the appeal fixed at $10,000. I have in fixing the quantum of\n\ncosts taken into account the outcome of the Plaintiff’s appeal.Sgd:BELINDA ANG SAW EANJUDICIAL COMMISSIONERCopyright © Government of Singapore."
    }
}