{
    "case_title": "Public Prosecutor v Oh Hu Sung",
    "ncitation": "[2003] SGHC 248",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Background": "2          The respondent, a Korean national, was originally charged with voluntarily causing grievous hurt under s 325 of the Penal Code (Cap 224) by stepping on and fracturing the wrist of a Bangladeshi national who worked for him.  The Notes of Evidence revealed the following.  On 19 July 2003, when the s 325 charge was read to the respondent by the Korean interpreter in Court No 26, he pleaded guilty.  At this point, the Prosecuting Officer informed the court that he was proceeding on a reduced charge of voluntarily causing hurt under s 323 of the Penal Code.  The new charge was then read to the respondent, who pleaded guilty again.  He indicated that he was aware of the consequences of his plea.  The Prosecuting Officer then read out the statement of facts, which the respondent admitted without qualification.  He was subsequently convicted and sentenced to three months’ imprisonment (“the first order”). 3          About two hours later, counsel for the respondent appeared before the district judge while mentions were still being heard and asked for the matter to be re-mentioned.  Counsel informed the district judge that he was applying for the plea to be rejected under s 217(2) of the Criminal Procedure Code (Cap 68) (“CPC”), as the respondent had pleaded guilty by mistake. 4          Counsel for the respondent clarified two points before the district judge.  First, he contended that the respondent had pleaded guilty by mistake because he had thought that he would only get a fine if he pleaded guilty.   Second, counsel explained that the respondent did try to raise objections to some parts of the statement of facts before his case was mentioned.  Also, there were now some indications of provocation, contrition and punishment to be considered.  The victim had been fully compensated, and the respondent had apologised. 5          The district judge rejected the counsel’s first point, finding that the respondent’s plea of guilt had been valid, unequivocal and voluntary.  However, the other facts raised by counsel led the district judge to conclude that the sentence of three months’ imprisonment appeared excessive.  The Prosecuting Officer was himself sympathetic to the respondent’s case.  Therefore, the district judge rejected the plea of guilt, fixed the matter for mention and fixed bail (“the second order”). 6          After the district judge had completed his cases for the day, he conducted his own research as to the propriety of the second order.  He decided that s 217(2) of the CPC had no application on the facts because he had beenfunctus officioafter sentence was pronounced.  Therefore, on 22 July 2003, the case was re-mentioned, and the district judge informed the parties of his research.  Counsel for the respondent disagreed and argued that s 217(2) of the CPC could still apply, and requested for time to prepare submissions on this point.  The Prosecuting Officer supported counsel’s application for time. 7          Having considered counsel’s submissions, the district judge remained convinced that he had beenfunctus officioafter sentence was pronounced, and therefore had no power to make the second order.  Believing that the second order was made in error of law, he brought the present application to the High Court to exercise its revisionary powers pursuant to s 268 of the CPC, to set aside the second order in favour of the original conviction and sentence, or to make any other order which may be just and appropriate in the circumstances.",
        "The issues": "8          The issues that I had to deal with in the course of this criminal revision were as follows: (a) whether the district judge had beenfunctus officioafter sentence was pronounced; (b) whether s 217(2) of the CPC could still apply; and (c) the appropriate order to make, taking into account all the circumstances of this case.",
        "Principles governing revision": "9          The revisionary powers of the High Court are conferred by s 23 of the Supreme Court of Judicature Act (Cap 322) and s 268 of the CPC which states: The High Court may in any case, the record of proceedings of which has been called for by itself or which otherwise comes to its knowledge, in its discretion exercise any of the powers conferred by sections 251, 255, 256 and 257. 10        Section 268(1) provides that the High Court, in exercising its powers of revision, can exercise powers similar to those of an appellate court.  This includes the power to alter or reverse any order made in the court below: s 256(d). 11        The principles governing the exercise of the High Court’s revisionary powers were laid down inAng Poh Chuan v PP[1996] 1 SLR 326at 330: … various phrases may be used to identify the circumstances which would attract the exercise of the revisionary jurisdiction, but they all share the common denominator that there must be some serious injustice… generally it must be shown that there is something palpably wrong in the decision that strikes at its basis as an exercise of judicial power by the court below. 12        There is no doubt that if the district judge had beenfunctus officioafter sentence was passed, and s 217(2) of the CPC did not apply, then the second order would clearly be wrong in law, and the appropriate subject of a criminal revision.",
        "Power to alter or review judgments": "13        It is established law that generally, a judge isfunctus officioafter sentence is pronounced:Jabar v Public Prosecutor[1995] 1 SLR 617;Ganesun s/o Kannan v Public Prosecutor[1996] 3 SLR 560.  However, the power of the subordinate courts to alter or review judgments is also regulated by s 217 of the CPC, which states as follows: (1) No court other than the High Court, when it has recorded its judgment, shall alter or review the judgment. (2) A clerical error may be rectified at any time and any other mistake may be rectified at any time before the court rises for the day. 14        I first analysed this provision in detail inChiaw Wai Onn v Public Prosecutor[1997] 3 SLR 445.  The accused in this case had been convicted and sentenced to 12 months’ imprisonment by the district court.  On appeal, I affirmed his conviction and enhanced his sentence with a fine of $80,000.  However, I revoked this order on the same day when I realised that I had exceeded my jurisdictional limit in imposing the $80,000 fine.  Instead, I substituted the fine with a further sentence of six months’ imprisonment, bringing the total to 18 months’ imprisonment. 15        The substitution of sentence raised a legal point concerning whether the High Court in its criminal appellate capacity could alter the judgment.  In the course of deciding the issue, I considered the interpretation and scope of s 217 of the CPC. 16        After examining the history of the provision and considering various cases, I concluded that s 217(1) laid down a general prohibition against the alteration of judgments by the subordinate courts, while s 217(2) was an excepting proviso that prescribed the limited circumstances in which the subordinate courts could alter or review their judgments. 17        Section 217 of the CPC has remained substantially the same as when it first appeared in the CPC in 1900 as s 266, which read: No court other than the Supreme Court when it has recorded its judgment shall alter or review the same.Provided thata clerical error may be rectified at any time and that any other mistake may be rectified at any time before the Court rises for the day. [Emphasis added.] 18        Although the words “provided that” were subsequently omitted in the 1920 reprint of the revised edition of the 1910 CPC, I took the view that the change did not in any way affect the role of s 217(2) as a proviso to the general prohibition in s 217(1).  I then observed, at paragraph 64: The effect of an excepting or qualifying proviso, according to the ordinary rules of construction, is to except out of the preceding portion of the enactment, or to qualify something enacted therein which but for the proviso would be within it.  Such a proviso cannot be construed as enlarging the scope of an enactment when it can be fairly and properly construed without attributing to it that effect: seeDuncan v Dixon[1890] 44 Ch D 211;Corp of the City of Toronto v AG for Canada[1946] AC 32andMullins v Treasurer of the County of Surrey[1880] 5 QBD 170. 19        I subsequently applied this construction of s 217 inVirgie Rizza V Leong v Public Prosecutor, CR 2/1998, MA 264/1997, HC, an unreported judgment dated 15 April 1998.  Here, the accused was charged with overstaying in Singapore after the expiry of her visit pass, an offence under s 15(1) of the Immigration Act (Cap 133).  She pleaded guilty after the charge was read and explained to her in Tagalog and she was told of the nature and consequences of the plea.  She admitted to the statement of facts without qualification, and was convicted and sentenced to five months’ imprisonment and a fine of $3,000.  However, on the afternoon of the same day, her lawyer asked the district judge to allow her to retract her plea of guilt, as she had pleaded guilty while ignorant of a possible defence, and also as a result of threats by immigration officers while in custody.  The district judge held that he had beenfunctus officiounless s 217(2) of the CPC applied.  I endorsed his reasoning, noting at paragraph 10: A trial judge has a discretion to allow an accused to retract a plea of guilt, which must be exercised judicially and for valid reasons:Ganesun s/o Kannan v PP[1996] 3 SLR 560at p 563.  But this discretion only exists as long as the court is notfunctus officio, and the court isfunctus officioafter sentence is passed:Ganesun(supra).  Accordingly, the district judge was correct in stating thathe had no power to alter the conviction and sentence unless s 217 of the CPC applied. [Emphasis added.] 20        Two other instructive cases on the effect of s 217 wereLim Teck Leng Roland v Public Prosecutor[2001] 4 SLR 61andPublic Prosecutor v Lee Wei Zheng Winston[2002] 4 SLR 33.  In both, I accepted that s 217(1) lays down a general prohibition against the alteration of judgments by the subordinate courts, while s 217(2) is an exception to this general prohibition, prescribing the limited circumstances in which the subordinate courts can alter or review their judgments. 21        Thus, it was clear from the authorities that while the general rule is that the court isfunctus officioafter sentence is pronounced, s 217(2) of the CPC is an exception to this general prohibition against the alteration of judgments.  The district judge rejected counsel’s submissions and authorities on the point as they dealt with alterations in sentence, and not a conviction.  However, this should not make any difference.  There was no reason to restrict “judgment” in s 217 to orders on sentence. 22        Therefore, I was unable to agree with the district judge when he took the view that s 217(2) of the CPC had no application because he wasfunctus officioafter sentence was pronounced.  On the contrary, if the requirements of s 217(2) were satisfied, the court was fully entitled to alter or review its judgment, whether or not sentence was pronounced.  Therefore, I next considered if s 217(2) applied on the facts of this case.",
        "Scope of s 217(2) of the CPC": "23        Section 217(2) provides for judgments to be altered in two different scenarios.  “Clerical errors” can be corrected “at any time”, while “any other mistake” may only be rectified “before the court rises for the day”.  It was not contended by the respondent that there was any clerical error in this case.  Therefore, for the section to apply, the respondent must show that there was a mistake that came within the scope of the words “any other mistake”, and that these were rectified before the court had risen for the day. 24        InChiaw Wai Onn, supra, andChuah Gin Synn v Public Prosecutor[2003] 2 SLR 179, I held that the court rose for the day only when it ceased to sit for business, when the working day of the court had ended.  On the facts of this case, the second order was clearly made before the court had risen for the day.  Therefore, the only issue I had to decide was whether there was a mistake within the meaning of s 217(2).",
        "“Any other mistake”": "25        I considered the meaning of “any other mistake” in s 217(2) inVirgie Rizza V Leong(supra).  Counsel for the accused in that case argued that her plea of guilt was mistaken for two reasons.  First, she had been deceived by one Leong into believing that she could lawfully remain in Singapore, and thus had pleaded guilty while ignorant of a possible defence.  Also, she had pleaded guilty because she had been told by immigration officers “not to talk too much” or her sentence might be increased. 26        In considering what suffices as a “mistake” under s 217(2), I was prepared to hold that it includes errors by a party as well as by the court.  I also commented, at paragraphs 11 and 12: Section 217(2) must be intended to allow the court to correct a decision whenever there has been a clear mistake; it does not say who should have caused the mistake andthere is no reason to exclude errors originating from the parties.The court is in a position to make a sound decision only if the parties correct present the facts (and often, in practice if not in theory, the law).  If after judgment it emerges that there has been amistake, either of fact or law, the court should be able to rectify it before it rises for the day, and this may extend to altering a conviction or sentence if there was a failure of justice. Nonetheless, in my view s 217(2) was not applicable in the present case, because it was not sufficiently clear that there was a mistake.  The appellant had earlier admitted without qualification the statement of facts.  Later when counsel was present she told a different story without much supporting evidence… Such disputes cannot be resolved without a detailed consideration of evidence, and there was no clear “mistake” that could bring s 217(2) into operation.Section 217(2) does not contemplate a court hearing and deciding a disputed issue as to whether a mistake was made; it should apply only if the mistake was obvious to the court or admitted by all parties.In other situations a party aggrieved by the alleged mistake should appeal or seek criminal revision.  [Emphasis added.] 27        It is clear that “mistake” in s 217(2) is construed expansively.  It clearly encompasses more than mere clerical errors, for otherwise the first limb of the subsection would be otiose.  It also goes beyond mere accidental slips and omissions:Chiaw Wai Onn, supra.  “Any other mistake” in s 217(2) includes not only mistakes by the court (as was the case inMonteiro v Public Prosecutor[1964] 1 MLJ 338, where the judge had found the accused guilty before his counsel addressed the court), but also unilateral mistakes by the parties.  It covers not only errors of law but also errors of fact. 28        However, such a wide construction is clearly open to abuse by accused persons, who could seek to use s 217(2) as a backdoor to overturn convictions.  The principle of finality of proceedings, as encapsulated in s 217(1), should generally be observed unless it is clear that a miscarriage of justice will otherwise result.  Accused persons should not be permitted merely at whim to change their pleas, and the court must take care not to encourage such responses, where no valid and sufficient grounds have been shown.  Therefore, the condition I set down inVirgie Rizza V Leong— that the mistake must be obvious to the court or admitted by all parties — should be strenuously observed before s 217(2) can apply.",
        "No obvious mistake in this case": "29        The grounds on which the respondent relied in support of his argument that there was a mistake were as follows: (a) he was not provided with a Korean interpreter at the police station; (b) he was induced into pleading guilty by the investigating officers; (c) he disagreed with the statement of facts but the Korean interpreter had not conveyed his version of the facts to the judge; (d) the accused was provoked by the victim but this was not conveyed to the judge; and (e) the accused did not fully understand the nature and consequences of the plea, as he thought he would only be punished with a fine. 30        The principles upon which the court should permit an attempt to retract a plea of guilt are firmly settled.  Section 180(b) of the CPC states that if the accused understands the nature and consequences of his plea and intends to admit without qualification the offence alleged against him, he may plead guilty to the charge and the court may convict him on it.  The common law has evolved three procedural safeguards before a plea of guilt can be regarded as the basis for a conviction (Ganesun s/o Kannan v Public Prosecutor, supra; followingLee Weng Tuck v Public Prosecutor[1989] 2 MLJ 143): (a) an accused should plead guilty by his own mouth and not through his counsel; (b) the onus lies on the judge to ascertain whether the accused understands the true nature and consequences of his plea; and (c) the court must establish that the accused intends to admit without qualification the offence alleged against him.",
        "Ground (A): No interpreter at police station": "31        With regard to the respondent’s complaint that he was not provided with a Korean interpreter at the police station, counsel for the respondent failed to show how this nullified his plea in any way.  There was no evidence that the respondent had even requested for an interpreter at the police station.  In any case, he was provided with a Korean interpreter in court, who had explained the nature and consequences of his plea to him.",
        "Ground (B): Induced into pleading guilty by investigating officers": "32        This argument can be disposed of quickly.  The respondent did not produce a shred of evidence to justify his claim that the police officers involved in his case had induced him to plead guilty.  In such circumstances, the respondent’s bare allegation could carry little, if any, weight.",
        "Grounds (C) and (D): Disagreement with statement of facts and provocation": "33        These two grounds basically challenged the respondent’s unqualified admission of the statement of facts in court.  Again, there was nothing in evidence to support the respondent’s assertion that he had objections which the Korean interpreter did not convey to the district judge.  The respondent did not offer any reasons to explain why the interpreter would choose to omit any material facts.  The respondent had admitted to the statement of facts without qualification before the district judge.  As I noted inKoh Thian Huat v Public Prosecutor[2002] 3 SLR 28at paragraph 21: As the SOF has now become an integral part of criminal procedure in Singapore (Mok Swee Kok v PP[1994] 3 SLR 140at 146), it is my view that, when an accused has unqualifiedly admitted to the contents of the SOF, these facts should not thereafter be readily open to dispute.  Permitting otherwise may unduly prolong the proceedings or possibly even undermine the soundness of the conviction. 34        In the absence of any compelling explanation for the respondent’s failure to raise any objections in court, or any other evidence to support his allegation that the interpreter had omitted to mention material aspects of his version of facts, the respondent cannot now dispute his unqualified admission to the statement of facts.  In any case, challenging the statement of facts now would involve a detailed consideration of the evidence, which would clearly bring any possible mistake outside the realm of an obvious one as envisioned by s 217(2):Virgie Rizza V Leong, supra.",
        "Ground (E): Did not understand nature and consequences of plea": "35        There was no evidence to support the respondent’s claim that he did not understand the nature and consequences of his plea.  The Notes of Evidence stated clearly that the charge was read and explained to the respondent in Korean, and he indicated that he understood the nature and consequences of his plea.  The district judge found that the appellant’s initial plea was valid, unequivocal and voluntary, and this finding was firmly supported by the evidence.  Therefore, the respondent could not rely on this in support of his argument of a mistake.",
        "Conclusion on this issue": "36        In this case there was no obvious mistake in the first order made, so s 217(2) did not apply and the district judge wasfunctus officioat the time he made the second order.  As the second order was made in error of law, I exercised my revisionary powers under s 268 of the CPC to set aside the second order and reinstate the conviction.",
        "Sentence": "37        The only remaining issue I had to consider was whether the sentence of three months’ imprisonment imposed by the district judge should also be reinstated, or whether the court should make such other order as may be just and appropriate in the circumstances. 38        InRathakrishnan s/o Muthia Ramiah & Anor v Public Prosecutor, MA 156/95, DC, an unreported judgment dated 17 June 1995, the two accused persons had assaulted a foreign worker under their charge by fisting him on his face and stomach and kicking him on his back.  The victim suffered tenderness at the central abdomen, mild tenderness over the left cheekbone and left lumbar region and two three-cm scratch marks on the left lumbar region.  Both were sentenced to two months’ imprisonment each. 39        In the case before me, the victim’s injuries were more serious, as he suffered a scaphoid fracture on his right wrist.  A major aggravating factor here was the fact that the victim had been a foreign worker under the respondent’s charge.  The use of violence is a serious problem that must be condemned, especially when the aggressor is in a position of authority with respect to the victim.  The sentence imposed in such cases must send offenders the message that such violent conduct will be severely dealt with. 40        Although this was the respondent’s first offence of causing hurt in the seven years that he had been in Singapore, he was not a stranger to our courts, having been convicted of dangerous driving under s 64(1) of the Road Traffic Act (Cap 276) in 1998.  However, I stress that I did not take this previous conviction into account in sentencing him for the present offence, as it was a completely unrelated charge. 41        The court inGoh Chee Wee v Public Prosecutor, MA 226/2002, DC, an unreported judgment dated 23 September 2002, noted that the benchmark sentence in s 323 offences where serious injury is caused is a term of imprisonment of between three and nine months.  The respondent could not point to any compelling mitigating circumstances in this case to justify a more lenient sentence.  The fact that he is a professional was no excuse, especially since the victim was his subordinate, whom he was expected to take care of.  Also, any potential difficulties caused to his family could not carry much weight, for it is trite law that any hardship caused to the offender’s family as a result of his imprisonment has little mitigating value, save in very exceptional or extreme circumstances:Ng Chiew Kiat v Public Prosecutor[2000] 1 SLR 370. 42        In these circumstances, the respondent was actually fortunate that the Prosecuting Officer decided to reduce the charge against him from one of causing grievous hurt under s 325 of the Penal Code, for that would have carried a punishment of up to seven years, and also a possible caning.  Therefore, I found that the district judge’s first order sentencing the respondent to three months’ imprisonment was entirely appropriate on the facts, and should also be reinstated.",
        "Ancillary matters": "43        After I set aside the second order and reinstated the district judge’s first order for conviction and sentence, counsel for the respondent applied for an extension of time to appeal against sentence.  The usual procedure for any appeal is for the notice of appeal to be filed within ten days from the judgment: s 247(1) CPC. Under s 250(1) of the CPC, I have the power to permit an appeal that is filed out of time, upon such terms as may be desirable. 44        However, I was unable to see why counsel required me to exercise my powers under s 250(1) in this case. Time certainly could not run from the date of the district judge’s first or second orders, because pending the outcome of this criminal revision, there was no sentence to appeal against.  In any event, I was of the view that an appeal against sentence on the facts before me would be an exercise in futility.  When deciding on the appropriate order to make in this criminal revision, I had already carefully considered all the facts and circumstances of this case.  In particular, I concluded that the sentence of three months’ imprisonment was not only not manifestly excessive, but was amply justified by the facts.  Therefore, any appeal against sentence now would simply be a waste of the respondent’s, and this court’s, time. 45        Finally, the respondent also requested that his sentence be deferred by two weeks, for him to make arrangements for his family. I rejected this request, and agreed with the DPP that the respondent had already been given ample time to settle his affairs.  He had been out on bail from the time the district judge made the second order rejecting his plea of guilt and fixing the matter for mention.  Having had more than ten weeks to arrange his private affairs, I saw no reason to give him any more time. Application allowed; order for conviction and three months’ imprisonment reinstated."
    }
}