{
    "case_title": "Sia Leng Yuen also known as Xie Ning Yun v Ko Chun Shun Johnson (No 2)",
    "ncitation": "[2003] SGHC 194",
    "coram": "MPH Rubin J",
    "sections": {
        "Issue": "1          In this appeal, the only issue for determination was whether a successful defendant in a set of  legal proceedings should have his taxed costs held in escrow, until the determination of a second set of proceedings against him by the same plaintiff, based on the same facts. The facts that gave rise to this issue can be summarized as follows.",
        "Brief facts": "2          A sum of US$2million was loaned by Johnson Ko Chun Shun (‘Ko’) to Sia Leng Yuen also known as Xie Ning Yun (‘Sia’), upon the latter’s request. This loan was evidenced by a promissory note dated 4 January 2001. The security for the loan was said to be 50 membership certificates in a certain country club known as Blue Canyon Country Club. This security was provided by Sia. 3          Insofar as is material, cl 3 of the said promissory note provided, amongst other things, as follows: The Debtor also HEREBY PLEDGE (sic) as collateral security for the whole debt, fifty golf lifetime memberships of Blue Canyon Country Club together with Membership Certificates for the sum of United States Dollars 2,000,000 (the “Security”) as detailed in Schedule 1 annexed. In the event of default of any single instalment payment, the Debtor HEREBY AUTHORISE (sic) the said Mr Ko and/or CIC and/or any nominated third party forthwith either by auction private treaty transfer or otherwise to sell or dispose of the said Security without further delay. Proceeds of such sale or disposal shall be applied to reduce the said sum of United States Dollars 2,000,000 and interest thereon at the rate of 15 percent per annum calculated from the date of default rendering to Mr Sia any surplus which may be forthcoming from such sale and disposal.  … 4          There was apparently a default on the part of Sia in honouring the  loan repayment terms. As a result, Ko proceeded to issue a statutory demand under section 62 of the Bankruptcy Act 1995, dated 31 August 2001 (‘the first statutory demand’)  against Sia for the full amount of the debt plus interest, totalling US$2,197,260.27. The said first statutory demand did not include any reference to the value of the security provided by Sia. 5          Sia, then applied to the court in OSB 600118 of 2001 to set aside the said first statutory demand, contending that the said demand did not  comply with Rules 94(5), 94(6), 98(2) (c), (d) and (e) of the Bankruptcy Rules. The relevant segments of Rule 94 and 98 of the Bankruptcy Rules are reproduced below: 94.-(1)   A statutory demand shall be in Form 1 and shall be dated and signed by the creditor himself or by a person authorised to make the demand on the creditor’s behalf. (2)  The statutory demand shall state the actual amount of the debt that has accrued as of the date of the demand. (5) If the creditor holds any property of the debtor or any security for the debt, there shall be specified in the demand – (a)            the full amount of the debt; and (b)            the nature and value of the security or the assets. (6)            The debt of which payment is claimed shall be the full amount of the debt less the amount specified as the value of the security or assets. 98            (2)            The court shall set aside the statutory demand if – (c) it appears that the creditor holds assets of the debtor or security in respect of the debt claimed by the demand, and either rule 94 (5) has not been complied with, or the court is satisfied that the value of the assets or security is equivalent to or exceeds the full amount of the debt; (d) rule 94 has not been complied with; or (e) the court is satisfied, on other grounds, that the demand ought to be set aside. 6          When the application concerning the first statutory demand came up for hearing before the Assistant Registrar, he dismissed Sia’s application, holding that the statutory demand did comply with the requirement of r 94(5) (b) of the Bankruptcy Rules. 7          Sia appealed and his appeal was heard by Lee Seiu Kin JC (as he then was). In allowing Sia’s appeal and setting aside the statutory demand, Lee Sieu Kin JC said at para 13 of his judgment: …            In the present case, Ko has valued the security as “nil”. This means that in order to comply with the SD, Sia would have to pay the full sum of the debt claimed. On the one hand, Ko has held, and is holding, on to the security which was valued at US$2 million in the promissory note. And on the other hand he has valued it as “nil”, without providing reasonable evidence thereof. Further, although pursuant to the promissory note, he is entitled to sell the memberships in the event of default, he has not done so.It would appear that Ko: (a) does not wish to sell the memberships to reduce the amount owed; (b) values them in the SD to be of zero value; (c) has not produced any cogent evidence for the basis of this valuation; and (d) yet does not wish to return the membership certificates to Sia so that the latter can sell them to raise money to repay at least part of the debt. It does not seem fair to me that Ko can have his cake and eat it in this manner. Rule 98(2)(c) requires the court to set aside the SD if r 94(5) has not been complied with. Even if it can be argued that there has been compliance, r 98(2)(e) gives the court the discretion to set aside the SD on other grounds. If Ko had in the SD given a value to the security that Sia had considered reasonable, the latter might have elected, or been placed in a position, to pay the balance to satisfy the debt. If Ko had considered the security to be worthless, he ought to have returned them to Sia so that the latter would be given the opportunity to use them to raise funds to repay the debt or part of it. For Ko to hold on to them in the present circumstances is, in my view, unfair and justifies the court exercising its discretion under r 98(2)(e) to set aside the SD.[Emphasis added] 8          Lee Sieu Kin JC also awarded costs before him and below fixed at S$11,000 to be paid to Sia by Ko. There was however a stay pending appeal in relation to the costs order made. Ko then appealed to the Court of Appeal. On 2 May 2003, the Court of Appeal, in dismissing the appeal of Ko ordered that (1) the stay of execution on the order of costs made below be lifted; (2) the security for costs of $10,000 paid by Ko into Court be released to Sia; and (3)Ko pay Sia forthwith the costs of the appeal be taxed or agreed. [Emphasis added]",
        "The second proceedings": "9          Before making payment of whatever costs payable in respect of the failed first set of bankruptcy proceedings, Ko went forward to issue a fresh statutory demand (‘the second statutory demand’) against Sia, on 8 May 2003. Under the second statutory demand, Ko presently claimed against Sia for a sum of US$728,308.08 and interest thereon. Sia again applied to court for a stay of the second proceedings until Ko had paid all the costs of the previous proceedings in relation to the first statutory demand. Sia’s application was heard by the Assistant Registrar on 7 July 2003. The result was the following order: …            The action will be stayed unless the petitioning creditor pays all previous costs and the costs of today’s proceedings to the solicitor of the applicant, to be held in escrow until the bankruptcy proceedings are completed; …            Applicant is to file for taxation hearing if necessary by 11 July 2003; … …            Costs of $800 to the applicant. 10        Sia felt aggrieved by the inclusion of the proviso in the said order that the costs“be held in escrow until the bankruptcy proceedings are completed”and consequently filed an appeal. 11        Sia’s appeal was heard by me on 29 July 2003 and further arguments were presented on 12 August 2003. After hearing arguments, I concluded that the imposition of the escrow provision in the order made below was, first and foremost, not in accord with the current of authority. InJames M’Cabe (Pauper) v The Governor And Company of The Bank Of Ireland[1889] 14 App Cases 413, the House of Lords held that where a plaintiff having failed in one action brings a second action for the same cause of action, the second action must be stayed, until the costs in the first action have been paid. 12        Lord Herschell in his speech (at pages 415 and 416) made the following observations: The only question remaining is whether the order was right in so far as it stayed the proceedings in the second action until the costs in the first action had been paid. Now, my Lords, I find that it was laid down in a recent case in the Court of Appeal,Martinv.Earl Beauchamp(1), that “the rule is established that where a plaintiff having failed in one action commences a second action for the same matter the second action must be stayed until the costs of the first action have been paid;” and even although the actions were not between precisely the same parties or persons suing in the same capacity, the case was held to be within the rule inasmuch as the plaintiff there was “suing substantially by virtue of the same alleged title.” It cannot be denied that in the present case the parties are the same, and that the plaintiff is “suing substantially by virtue of the same alleged title;” and therefore I think that the present case has been properly disposed of in accordance with that rule, which I apprehend is not in any respect confined to the Courts in England but applies as well to the Courts in Ireland, arising as it does out of the inherent power which resides in the Court to prevent a second suit being brought upon the same cause of action until the costs incurred in the first action have been paid. It is impossible for us to interfere with that which the Court of Appeal have done, which was entirely within their jurisdiction, and which I can see no reason to doubt has been right. My Lords, I come with the less regret to this conclusion because, as far as I can see, if the appellant here were allowed to sue he would really gain no advantage by doing so, for from all that I have heard to-day I have been unable to see that he would be likely to make out any sort of case against the present respondents, or to obtain any benefit from the litigation which he has commenced against them. I move your Lordships that the appeal be dismissed. 13        Lord Fitzgerald in the same case (at page 416) observed: My Lords, I concur in everything which my noble and learned friend on the woolsack has stated, and I should only add, from my experience of the practice in Ireland, where I was for a long time upon the bench, that as long as I can recollect it has been part of the inherent jurisdiction, and never doubted, of every Court in Ireland to stay proceedings in an action before it, where a prior action has been brought substantially asserting the same rights against the same parties in the same or another Court, until the costs of that prior action have been paid. It was quite a matter of course, and a part of the jurisdiction of the Court, and never quarelled with. That is exactly what the Master of the Rolls has done, and that is what the Court of Appeal has affirmed. 14        InHines v Birkbeck College and Another(No 2) [1991] 3 WLR 557, the Court of Appeal in England, applied the principles stated by the House of Lords inM’Cabe. Nourse LJ, delivering the judgment of the Court of Appeal said at pages 556 and 557: In regard to the third question, the factual position, as stated by Mervyn Davies J, was that the university had taxed its costs of the first action in May 1988 in the sum of £9,548.71 and the college in September 1988 in the sum of £7,805.52, so that the total sum owing amounted to £17,354.23. However, the plaintiff did not attend the taxations and on 13 December 1989 he obtained an order setting aside the taxation certificates. When the matter was before the judge the hearing of the plaintiff’s objections to the certificates had not been completed, so that the precise sums owing were unknown. On 10 August 1990 the costs were finally certified at £6,485.80 in the case of the college and £8,236.98 in the case of the university as against the sums of £6,000 and £7,500 respectively which the judge would have ordered to be paid into court as the condition for the cesser of the stay. This development meant that it was no longer open to the plaintiff to argue in this court that there was no basis for ordering a stay of the second action until the costs of the first action had been taxed. The authorities referred to by the judge includedMorton v Palmer(1882) 9 QBD 89,Martin v Earl Beauchamp(1883) 25 Ch D 12,Re Wickham Marony v Taylor(1887) 35 Ch D 272 andM’Cabe v Bank of Ireland(1889) 14 App Cas 413. The second and fourth of these were cases where the plaintiff, having failed in one action, brought a second action for the same matter. InM’Cabe’s case Lord Herschell said (at 415): ‘The only question remaining is whether the order was right in so far as it stayed the proceedings in the second action until the costs in the first action had been paid. Now, my Lords, I find that it was laid down in a recent case in the Court of Appeal,Martinv.Earl Beauchamp(25 Ch D 12 at 15), that “the rule is established that where a plaintiff having failed in one action commences a second action for the same matter the second action must be stayed until the costs of the first action have been paid;” and even although the actions were not between precisely the same parties or persons suing in the same capacity, the case was held to be within the rule inasmuch as the plaintiff there was “suing substantially by virtue of the same alleged title.” Having cited that passage from Lord Herschell’s speech, Mervyn Davies J said: ‘In the light ofM’Cabe v Bank of IrelandI conclude that when a plaintiff is ordered to pay the costs of an action and then brings a second action against the same defendant concerning the same subject matter then, on application by the defendant for a stay, the stay will be ordered as of course,unless no doubt there are some wholly exceptional circumstances. I certainly see no exceptional circumstances in this case, so that it is appropriate to order a stay.’ [Highlight added] Before this court the plaintiff sought to argue for a less stringent rule, for which purpose he relied mainly onMorton v PalmerandRe Wickham. However, each of those cases was concerned with the question whether a stay should be granted until the payment of costs which had been ordered to be paid in the same action. I can well see that a different rule may apply where there has been no final disposal of the action. This is not a state of affairs with which we are concerned.M’Cabe’s case is clear and binding authority for the rule to be applied where an action has been finally disposed of and the costs of it have not been paid. In my view the judge correctly extracted the principle of that decision and it cannot be said that he erred in applying it to the present case. I would therefore affirm his decision of the third question. 15            Counsel for Ko tried to argue that there were special circumstances in this case to warrant the adoption of a less rigid approach, as has been envisaged by Mervyn-Davies J, inHines v Birkbeck. In this connection, paras 31 to 34 of his submission  read as follows: …        Here, the Applicant has been validly served with a fresh Statutory Demand. The primary debt remains undisputed. Again, the value of the security has been put in issue by the Applicant. He has not put in evidence that his financial circumstances have changed such that he would not be made bankrupt. The grave risk that moneys paid to the Applicant will be irrecoverable exists and remains. …        Secondly, the sentence quoted and relied on by the Applicant inHines v Birkbeck College[1991] 3 WLR 557, since in saying that they were bound byM’Cabe, they were also bound by the rule inM’Cabethat there is a residual discretion as Nourse LJ stated, “unless no doubt there are some wholly exceptional circumstances”. …        The following facts must be emphasised as exceptional: - the financial state of the Applicant; - the grave risk that the costs paid would be dissipated and irrevocable; - the protracted litigation has repeatedly been brought about by the Applicant’s own intransigience and unreasonable behaviour, e.g. taking out the SIC 3747 of 2003 and the present appeal before the costs were even quantified; and - the Applicant borrowed US$2 million from the Respondent in January 2001 and not a single cent has been paid back despite repeated demands. 34.        In summary, we submit that the learned Assistant Registrar’s escrow condition be continued as part of the stay order. 16        I must say presently that the argument by Ko’s counsel that once the costs had been paid out to Sia, it would be dissipated and irrecoverable, was in the realm of speculation, perhaps intended to forestall Sia from receiving what the Court of Appeal had clearly ordered to be paid forthwith in respect of the previous set of proceedings. 17        In any event, the statement by Ko’s counsel in his submission that Sia had put the value of security in issue was found by me to be both ironic and significant. If, as being suggested by counsel, the value of the security given by Sia was again going to be a subject matter of substantial contention in the next round of hearings, the likelihood of the second statutory demand meeting a similar fate as that of the first statutory demand could not be ruled out. InWong Kwei Cheong v ABN-AMRO Bank NV[2002] 3 SLR 594, Rajendaran J set aside a statutory demand when it became apparent to the court that the debt was being disputed on substantial grounds. He held that it was not the function of the bankruptcy court to conduct a full hearing if there was a substantial dispute arising over the subject matter. I share the same views. 18        Costs, as defined inBlack’s Law Dictionary(6th Edn), refer to ‘a pecuniary allowance, made to the successful party (and recoverable from the losing party), for his expenses in prosecuting or defending an action or a distinct proceeding within an action’. It is no more than just a reimbursement of expenses incurred and resources laid out. In my view, exceptional circumstances should be shown to the court to delay or postpone such an element of reimbursement. The phrase ‘exceptional circumstances’ import a high standard of persuasion. A general averment such as the one foisted by Ko would not be enough. In the application at hand, apart from a general statement that once the money had been paid out it would not be recoverable, no other factors were brought to my attention to justify the imposition of the escrow provision.  Moreover, the escrow provision appeared to militate against the express phraseology of the order of the Court of Appeal in relation to the first statutory demand which required ‘payment forthwith’. In the premises, I allowed the appeal of Sia with costs and set aside the escrow provision in the order below. Sia was also awarded costs of $1,100 in relation to the appeal and further arguments before me. Order accordingly."
    }
}