{
    "case_title": "United Engineers (Singapore) Pte Ltd v Northern Elevator Manufacturing Sdn Bhd",
    "ncitation": "[2003] SGHC 158",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The Award": "7          The dispute between the parties which went to arbitration arose from an agreement dated 15 April 1995 made between the Applicants and the Respondents wherein the latter were engaged as the Applicants' specialist sub-sub-contractor for the design, manufacture, supply and delivery of passenger and cargo lifts to two (2) blocks of warehouses at Pandan Crescent/East Coast Highway in the lump sums of $1,992,000/- and $1,931,000/-. 8          In the arbitration proceedings, the Applicants claimed damages from the Respondents for defective and or negligent design of the goods lifts as well as the sum of $1,586,804.67 for the Respondents' failure to supply parts, materials and equipment for the lifts.  The Respondents disputed the Applicants' claim and counter-claimed inter alia for the (unpaid) balance due under the sub-contract. 9          The arbitration proceedings were in two (2) parts, the first hearing (between November 1999 and April 2000) dealt with the issue of liability while the second part determined the question of damages.  The Arbitrator delivered his first interim award on 21 December 2001 wherein he found that the 18 kg guide rails and corresponding safety devices provided by the Respondents were undersized.  He accordingly awarded the Applicants the cost of replacing the undersized guide rails and safety devices (inclusive of mounting brackets for safety devices) which sum was to be assessed. 10        The second hearing of the arbitration dealing with quantum was held in September 2002 after which the Arbitrator delivered his second award on 23 January 2003.",
        "The arguments": "11        Counsel for the Applicants pointed out that the arbitration proceedings were governed by the old Arbitration Act Cap 10 (the old Act) as the Arbitration Act 2001 (the new Act) only came into operation on 1 March 2002; reliance was placed on the saving provisions under O 69 r 16 of the Rules of Court.  The provisions which govern the right of appeal in the old Act are found in the following subsections of s 28:- (2)        subject to subsection (3), an appeal shall lie to the court on any question of law arising out of an award made on an arbitration agreement; and on the determination of such an appeal the court may by order (a)        confirm, vary or set aside the award; or (b)         remit the award to the arbitrator or umpire for reconsideration together with the court's opinion on the question of law which was the subject of the appeal, and where the award is remitted under paragraph (b) the arbitrator or umpire shall, unless the order otherwise directs, make his award within 3 months of the date of the order. 12        She agreed that the court must also be satisfied that the appeal comes withinThe Nemaguidelines applied by our appellate court inHong Huat Development Co (Pte) Ltd v Hiap Hong & Co Pte Ltd[2000] 2 SLR 609.  TheNemaprinciples were laid down by the House of Lords inThe Nema: Pioneer Shipping Ltd v BTP Tioxide[1982] AC 724 and inThe Antaios: Antaios Compania Naviera SA v Salen Rederierna AB[1985] AC 191. 13        The guidelines laid down by Their Lordships inThe Nema(and applied inThe Antaios) on how leave should be granted in relation to the UK provision equivalent to our s 28 are as follows:- (i)          where the construction of a 'one-off' contract or clause was in issue, the discretion was to be strictly exercised and leave to appeal normally refused unless the judge was satisfied that the construction given by the arbitrator was 'obviously wrong'. (ii)         where however, what was in issue was the construction of a standard contract or clause a less guarded approach was adopted.  In such a case, the judge must be satisfied of two further (2) requirements before considering to grant leave to appeal:- (a)         that the resolution of the question of construction would add significantly to the clarity, certainty and comprehensiveness of the law; and (b)         there was strong prima facie evidence that the arbitrator had gone wrong in his construction. 14        Counsel submitted that the Applicants' case satisfiedThe Nemaprinciples and leave to appeal ought to be granted for the following reasons:- (i)         the Arbitrator was wrong to accept the unit rate of SCY's invoice for the provision of guide rail brackets to a 18 kg lift when he had already found that the 18 kg guide rails and safety devices provided by the Respondents were undersized and had to be replaced with a 33 kg guide rails and safety devices.  Elevator Service had quoted a lump sum (with breakdown) of $845,000/- for 16 goods lifts based on rectification of the guide rail system of 33 kg.  Their quotation was the lowest of three (3) received by the Applicants and was in line with the method statement recommended by the Applicants' professional engineer Kok Peng Koon in his affidavit dated 2 June 2002; (ii)         the Arbitrator had under-compensated the Applicants when he assessed and awarded them damages based on the Respondents' estimates, when another contractor had been engaged by the Applicants to carry out rectification works; (iii)       The Arbitrator was also inconsistent in his findings. Consequently, the question of law to be determined was whether on the facts set out in his second award, there were any grounds upon which the Arbitrator could properly at law have assessed damages in the manner he did.  The question of law involved the Arbitrator's exercise and application of general principles governing award of damages.  Hence, the appeal is not of a 'one-off' nature. 15        Counsel for the Respondents on the other hand opposed the Notice of Motion and submitted that no leave to appeal should be granted to the Applicants.  In the affidavit filed by the Respondents' managing-director Koay Teng Cheang (Koay) to oppose the application, Koay alleged that the Applicants had failed to identify the question of law for determination and that the above proposition of law was actually a question of fact disguised as a question of law.  Koay further alleged that the Applicants had misled the court as in their first affidavit (of Ronnie Chew Woi Cham) filed in support of the Notice of Motion, they had said that the Arbitrator had awarded the Respondents a sum of $79,207.02 in respect of the cost of replacement of the centre pair of undersized guide rails and safety devices for 16 goods lifts including the mounting brackets for the safety devices.  Koay pointed out that the Arbitrator had actually awarded the Applicants the sum of $320,699.12 for rectification and replacement of the Respondents' defective works but because of the latter's counterclaim, the net sum due to the Respondents was $79,207.02.  This error was conceded and corrected by Ronnie Chew in his second affidavit filed for the Notice of Motion. 16        Counsel also raised a preliminary objection to the Notice of Motion.  She asserted that the application was filed late.  She pointed out that the Arbitrator had given notice (by Lee & Lee's letter) on 16 January 2003 to both parties' counsel stating that the second interim award would be ready on Thursday 23 January 2003 for collection.  The Applicants' Notice of Motion filed on 13 February 2003 was out of time.  She relied on the Court of Appeal's decision inHong Huat Development Co (Pte) Ltd v Hiap Hong  & Co Pte Ltd[2002] 2 SLR 609 for her contention that the Applicants should have filed their application by 6 February 2003 i.e. within 21 days from 16 January 2003, as required under O 69 r 4(2) of the Rules of Court.  The appellate court had held that under O 69 r 4(2) an award was made and published to the parties when the Arbitrator gave notice to the parties that the award was ready for collection, and not when they had notice of the actual contents of the award.  Consequently she argued, the Applicants needed to first apply for an extension of time to file their Appeal. 17        Howover, the Applicants' case did not fall within the principles enunciated inThe Nemaso as to warrant the court exercising its discretion in granting them leave to do so.  Even if the Applicants' case came withinThe Nemaprinciples, the court should not grant them leave to appeal as there was nothing wrong in the Arbitrator's award to indicate that he had'obviously gone wrong'citing my previous decision inJaya Offshore Pte Ltd v World Marine Co Ltd[1997] 2 SLR 109 in support. 18        Counsel for the Applicants submitted that time ran from 23not16, January 2003.  The first paragraph of Lee & Lee's aforementioned letter states:- I am pleased to inform the parties that I have completed the final draft of the 2ndinterim award today and expect to be able to publish the same at noon on Thursday, 23 January 2003. Counsel for the Applicants pointed out that had she gone to collect the Award from the Arbitrator on 16 January itself, she would not have received it as it would not have been ready.  Consequently, she counted 21 days from 23 January 2003 and which expired on 14 February 2003, whereas she had filed the Notice of Motion a day earlier.  On a plain reading of Lee & Lee's letter, I could not disagree with counsel's interpretation.  The Final Award was in any case dated 23, not 16 January 2003. The decision 19        I granted the Applicants leave to appeal as I was of the view that the Arbitrator had erred in law on the amount of damages he awarded on their claim.  It would be useful at this stage to set out the Arbitrator's interim as well as his final, awards. The relevant portions of the first award dated 21 December 2001 states:- (i)         The Claimants' claim for damages in respect of the delayed completion of the installation of lifts for Block A for 35 days, from 31 May 1996 to 5 July 1996 is dismissed; (ii)         the Claimants' claim for damages for breach of warranty pursuant to Clause 10 of the Special Conditions of Sub-Contract  is also dismissed; (iii)        The Respondents are liable to the Claimants only for the cost of replacement of the centre pair of undersized guide rails and safety devices, including the mounting brackets for the safety devices, which damages are to be assessed by me and thereafter published in the Final Award.  Save as aforesaid, the Claimants' claims for damages for other aspects of defective and/or negligent design are dismissed; (iv)        apart from the total value of $920,189.21 agreed between the parties for some items of contra charges, and the withdrawal of items totalling $55,715.19 by the Claimants, the Respondents are to reimburse the Claimants the aforesaid sums of $132,315.76 and $25,857.56 for the remaining items of contra charges.  The total value of contra charges payable by the Respondents to the Claimants is therefore $1,078,362.53; (v)        the Respondents' amended counterclaim of $25,525/- for salaries, allowances and airfares of their technicians who carried out testing and commissioning work that was outside the scope of their work pursuant to the Claimants' request is allowed; (vi)        there shall be a stay of execution on the amount of $1,452,743.59 being the undisputed remaining sum due from the Claimants to the Respondents under the Sub-Contract and the aforesaid sums of $1,078,362.53 and $25,525/- all of which, together with the said amount of damages to be assessed by me shall be incorporated in a Final Account that will be drawn up and included in the Final Award. 20        In the final award dated 23 January 2003, the Arbitrator had awarded the  following sums to the Claimants:- (i)         $64,000/- for labour for replacement works of the lifts; (ii)         $72,367.53 for the guide rails and fishplates; (iii)        $57,360/- for car rail brackets and fastening items; (iv)        $23,900 for modification of brackets; (v)        $57,600 for safety gears complete with mounting brackets; (vi)        $40,671.60 for car guide shoes. 21        The Arbitrator set out the statement of account between the parties as follows:- (Undisputed) balance due from Claimants to Respondents               $1,452,743.67 Deduct: Contra charges                                                                               $1,078,362.53 374,381.14 Add: Amount due from Claimants to Respondents under counterclaim25,525.00 399,906.14 Deduct Cost of replacement works comprising:- Professional Engineer's fees for load test               4,800.00 Labour for replacement works                           64,000.00 33 kg/m guide rails and fishplates                       72,367.52 Car rail brackets c/w fastenings                          57,360.00 Cost of modifying car c/w combination               23,900.00 brackets Safety gears c/w mounting brackets                   57,600.00 Car guide shoes                                                40,671.60320,699.12 Net amount due from Claimants to Respondents                                      $79,207.02 I should mention that the Applicants have no quarrel with the Arbitrator's decision disallowing certain items they had claimed. 22        I should also point out that the counterclaim sum in the above statement is incorrect; it should be $1,452,743.59not$1,452,743.67.  Be that as it may, it is a minor error and correcting it would affect all the other figures in the  statement. 23        It would also be useful to set out paras 44-52 of the Arbitrator's final award in full, although I had only remitted back to him for computation, the figures in his paras 46, 47, 50 and 52. The paragraphs read as follows:- 44          Mr Koay exhibited in his affidavit a quotation dated 11 April 2002 from Savera, China-Beijing (Item B of exhibit KTC-1) for the supply of 33 kg/m guide rails and fishplates, and explained that the quoted price, CIF Penang, meant delivery to Penang via Singapore (NE 36, 40).  According to Mr Koay's calculations (RE-6) 232 pieces of guide rails and 208 pieces of fishplates were required, as compared to Mr Kok's quantities of 223 and 208, respectively (CWC-1).  The conversion rate of US$1.00 to S$1.78 as at 18 June 2002 given by Mr Koay was not disputed. 45          Even after considering Mr Tan's explanation that his unit rate of $550 for guide rails included a mark up, that it included fishplates, transport, freight etc, and that it was from a different source (Savera, Spain) (NE28), I find this unit rate to be excessive in the absence of further relevant details. 46          I accordingly assess the sums of S$68,806.56 (S$296.58 x 232 pieces) and S$3,560.96 for the guide rails and fishplates respectively. The total sum is S$72,367.52. 47          Mr Tan said that the quoted unit rate of S$450.00 per set for this locally produced item was theSingapore price to site(N/E 28).  According to Mr Kok's computation, 478 pieces (239 sets) were required (CWC-1). 48          Mr Koay, on the other hand, only confirmed thatthe figuresin exhibits RE-6 and RE-7 'are true and correct ' (N/E 30) – the description in his letter for this item being'The costings for car guide brackets c/w fastening items (rail clips, bolts & nuts, shims) @ S$150.00/set x 232 sets = S$23,200/-'; also attached to the letter were his computations for the quantities of brackets and fastening items.  He also indicated that it was cheaper to fabricate the mounting brackets referred to in exhibit RE-6 at the Respondents' factory and to send the same to Singapore by truck (N/E 32). 49          During Mr Tan's cross-examination, he was reminded that his earlier quotation (exhibit C-7) was S$420.00 per set for'car rail brackets and combination car/cwt rails brackets', whereas'Sin Ching Yong Engineering's invoice for guide rail mounting brackets is S$240.00' (N/E 29).   He explained that he might have left out something in his earlier quotation, and that there was no comparison with the latter rate because the quality had also to be considered; he did not elaborate further on these matters. 50          In the absence of  any explanation as to how the respective unit rates were derived, I assess the sum of S$57,360.00 (S$240 x 239 pieces) for this item. 51          Apart from the unit rate of S$350.00 per set quoted by ES-1 (Elevator Service) (CWC-4), and what Mr Koay said with regard to exhibit RE-6 (see above item), there were no explanations as to how the respective unit rates for this item were derived. 52          It is not disputed that this item was for the modification of brackets.  Bearing this in mind, coupled with the comparison of the quoted prices for the preceding item, it appears to me that ES-1's quoted unit rate of $350.00 per set is excessive.  I accept that the Respondents' costing of $100.00 per set is reasonable, and accordingly assess the sum of S$23,900 (S$100.00 x 239 pieces) for this item. 24        It is to be noted from the above paragraphs that the Arbitrator did not accept the quotations and quantities stated by the Applicants' witnesses, he preferred the figures put forward by the Respondents in particular by their managing-director Koay.  Whilst it is not/should not be the function of a court sitting in an appellate capacity to interfere in the findings of fact made by a lower court or tribunal, there was reason for the court to depart from the rule here and direct the Arbitrator to reconsider his computation of the sums awarded to the Applicants. 25        In an earlier paragraph (no. 7) in his final award, the Arbitrator said:- Nature of compensation 7          InRuxley Electronics & Construction Ltd v Forsyth(1995) 73 BLR 1, the House of Lords had to consider the appropriate compensation for the loss.  In this regard, the present case is distinguishable.  By the Interim Award, I awarded and directed that'the Respondents are liable to the Claimants only for the cost of replacement of the centre pair of undersized guide rails and safety devices, including the mounting brackets for the safety devices, which damages are to be assessed by me' 26        It would be pertinent to refer to the facts of that case, in the light of the Arbitrator's comment that it wasdistinguishablefrom the present.  There, the respondent contracted with the appellants for the construction of a swimming pool which specifications were, that the pool should be 7 feet 6 inches deep at its deepest end; the completed pool was only 6 feet 9 inches at its deepest end.  The appellants commenced proceedings for their unpaid account; the Respondent claimed to set off the alleged cost of rebuilding the pool to the correct depth.  The trial judge held that the shortfall in depth did not decrease the value of the pool.  It would not be possible to break out the bottom of the pool and excavate to the required depth.  The only way of increasing the depth of the pool was to demolish the existing pool altogether and start again at a cost of £21,560.  The Respondent had no intention of building a new pool.  To spend £21,560 on a new pool would be unreasonable as the cost would be wholly disproportionate to the advantage if any, of having a pool 7 feet 6 inches deep as opposed to the lesser depth.  Accordingly, the trial judge rejected the counterclaim for the cost of rebuilding the pool but awarded the sum of £2,500 as general damages for loss of pleasure and amenity.  The Court of Appeal allowed Respondent's appeal and awarded him the sum of £21,500 being the estimated cost of rebuilding the pool [(1994) 66 BLR 23].  In allowing the Appellants' appeal and restoring the order of the trial judge, the House of Lords held:- (i)          the proper application of the general principle that where a party sustains loss by virtue of breach of contract he is so far as money can do it, to be placed in the same situation in respect of damages as if the contract had been performed was not the monetary equivalent of specific performance but required the court to ascertain the loss the plaintiff had in fact suffered by reason of the breach; (ii)         the cost of reinstatement was not the only possible measure of damage for defective performance under a building contract and is not the appropriate measure where the expenditure would be out of all proportion to the benefit to be obtained, even if the alternative measure of value, diminution in value, would lead to only nominal damages because there was no diminution in value; (iii)        while the court was not concerned with what a plaintiff might do with damages if awarded, the plaintiff's intentions were relevant to the question of reasonableness which arose at the stage of considering whether damages should be awarded.  The judge's findings of fact as to Mr Forsyth's intentions to the effect that he had no intention of rebuilding the pool were relevant because they showed that he had lost nothing except the difference in value, if any; (iv)        the judge had been entitled to make an award for loss of pleasure and amenity on the grounds that the contract was one for the provision of a pleasurable amenity. 27        I am in full agreement with the Arbitrator if bydistinguishablein his para 7, he meant that the decision inRuxley Electronicshas no application to the facts of our case. Certainly, we are not concerned with loss of amenities.  However, I would respectfully disagree with the Arbitrator if he meant that the compensatory nature of damages at law does not apply to the Applicants.  That stance would be untenable, given the Arbitrator's findings that the Respondents had breached the contract with the Applicants by providing 18 kg instead of, 33 kg guide rails and safety devices.  Consequent on the Arbitrator's finding, the Applicants should be reinstated to the position they would have been, if the Respondents had provided what was contracted; this he failed to do. 28        As an example, I refer to two (2) of the items assessed by the Arbitrator.  He had awarded the Applicants $64,000 for labour content for replacement works of 16 lifts.  In that regard he had accepted the evidence of Elevator Service's Mr Chan (para 43 of his final award) that the labour charge would be $4,000 per lift.  Yet he then proceeded to reject the Applicants' claim (in para 45) based on the quotation of Elevator Service, of $550 unit rate for the supply of both guide rails and fishplates preferring instead, the testimony and quotation of the Respondents'  Koay, of $296.58 (US$166.62) for guide rails and $17.12 (US$9.62) for fishplates or a total of $183.74 for both items.  In so doing, the Arbitrator overlooked the following factors:- (i)         Elevator Servicenotthe Respondents would be carrying out the rectification works ordered; (ii)         Elevator Service's quotation was the lowest of several which the Applicants invited and received from, reputable lift manufacturers/installers.  There was no basis to suggest that this company's quotation dated 13 June 2002 was not genuine or, the prices stated therein inflated; (iii)        he relied on the quotation to the Respondents from Savera China-Beijing for the rates used in his assessment even though:- (a) Elevator Service did not state their supply would come from this source and, (b) Savera's quotation was CIF Penang, not Singapore.  The submission of counsel for the Respondents (see para 6.3) thatThe Respondents will provide for the costs of transportation from Penang to Singapore for the auxiliaries items, hence the costs of transportation is not mentionedis untenable and should have been rejected; it was based on the incorrect premise that the Respondents would be the supplier which they were not. 29        Next, there is the Arbitrator's award of $57,360/- based on SCY's invoice price of $240 (x 239 pieces) for brackets and fastening items.  Counsel for the Applicants pointed out that SCY's unit price was for 18 kg, not 33 kg lifts.  I further note that the invoice was dated 12 February 1996 and not current.  Indeed, the Applicants had tendered SCY's invoice for their claim for backcharges against the Respondents, for the supply of parts, materials and equipment.  Consequently, the Arbitrator should not have relied on SCY's outdated invoice. Even if the Arbitrator thought (in his para 49) that Mr Tan from Elevator Service had not satisfactorily explained the increase of $30/- from an earlier quotation of $420/- as against the company's subsequent quotation of $450/- per set, for car rail brackets and combination car cwt rails brackets, he could have held Elevator Service to their earlier lower pricing and used the same.  Quality as Mr Tan opined, would make a difference in pricing. 30        The Arbitrator should also have appreciated that it was in the Respondents' self-interest to quote as low a price as possible for the rectification works required.  He should not have relied on the self-serving quotation dated 6 August 2002 which they sent to their solicitors, where the Respondents stated that their charges would be $150 per set for 232 sets of car guide brackets whilst bracket mountings and fastenings wouldcostanother $100 per set for 232 sets;   the prices quoted were chargedat cost.Elevator Service would have included a profit element in their quotation to the Applicants.  I note that in the Applicants' Reply submissions on quantum of damages (para 13), their solicitors had pointed out that when Koay was cross-examined as to whether he would charge a job at cost, the latter had refused to answer even when directed to do so by the Arbitrator; Koay merely said he would not take on the job, a most telling comment. 31        Consequently, the Arbitrator would appear to have under-compensated the Applicants as their counsel submitted, going against the principle that  damages for contractual claims should be compensatory (but not punitive) in nature. 32        It was for the foregoing reasons that I directed that the sums set out in paras 46, 49, 50 and 52 of the Arbitrator's final award should be remitted back to him for re-computation."
    }
}