{
    "case_title": "Moguntia-Est Epices SA v Sea-Hawk Freight Pte Ltd",
    "ncitation": "[2003] SGHC 231",
    "coram": "Judith Prakash J",
    "sections": {
        "Background": "2          On 27 January 2000, Sea-Hawk Freight Pte Ltd, the defendants in this action, issued two bills of lading each acknowledging shipment of a container of white pepper on board the bargeIntan 6at Pankal Balam/Pangkalpinang, Indonesia for carriage to Singapore.  The barge was towed by the tugASL Progress.  En route the barge sank and the cargo was lost.  The defendants were the contractual carriers but they were not the owners of the barge nor of the tug.  The barge was owned by Sindo-Damai Marine Pte Ltd (‘Sindo’) and the tug by Capitol Marine Pte Ltd (‘Capitol’). 3          The barge sank on 1 February 2000.  The cargo should have been delivered in Singapore in early February 2000.  As the bills of lading were subject to the Hague Rules, any claim for loss of cargo against the defendants as contracting carriers had to be filed within one year from the date on which delivery should have been effected ie by early February 2001. 4          There was some doubt after the barge sank as to the ownership of the cargo.  It had been shipped by an Indonesian concern, PT Putrabali Adyamulia (‘Putrabali’) who had agreed to sell the cargo to Moguntia-Est Epices S.A., a French company and the plaintiffs herein.  After the sinking the plaintiffs disputed their liability to pay for the cargo.  Therefore, pursuant to the sale and purchase contract which followed a standard form issued by the International General Produce Association Ltd (‘IGPA’), Putrabali commenced arbitration proceedings against the plaintiffs before the IGPA in London for the price of the cargo. 5          Putrabali preserved its position against the defendants by starting an admiralty action against them in this court on 25 August 2000.  That action is Adm 414 of 2000.  On 3 January 2001, the plaintiffs filed the writ in this action for a similar purpose.  Some time before that date, Putrabali had obtained an award in its favour and the plaintiffs had been ordered to pay it the contract price of the cargo together with interest.  The plaintiffs lodged an appeal against the award and it was while awaiting the hearing of the appeal that they started this action.  The plaintiffs’ action was based on the same two bills of lading as were relied on by Putrabali in Adm 414 of 2000. 6          The appeal came on for hearing on 30 January 2001.  The plaintiffs argued that Putrabali was in breach of the shipment clause of the sale contract and/or that as buyers they had not been provided with a reasonable/usual contract of carriage. 7          The plaintiffs’ intention in starting this action was to safeguard their interests in the event that they failed in their appeal against the arbitral award.  Thus, they did not want to take any further step and thereby incur costs unless and until the appeal failed.  No action therefore was taken to serve the writ on the defendants.  The court, however, initiated a pre-trial conference as part of its case management process and, on 7 February 2001, the plaintiffs were ordered to serve the writ on the defendants by 21 March 2001 failing which the action would be dismissed. 8          The plaintiffs were still concerned not to incur costs.  Their then solicitors therefore had a conversation with the defendants’ solicitors regarding the service of the writ and the further conduct of the action.  The defendants’ solicitors agreed to accept service of the writ.  Service was effected on 20 March 2001.  In their letter accompanying the writ, the plaintiffs’ solicitors wrote to the defendants’ solicitors: Hence, as spoken, we enclose herewith, by way of service, a copy of the said Writ for your attention and confirm our agreement to hold our respective hands in the proceedings pending settlement negotiations.  We further confirm that upon service of a notice of intention to proceed by you, the abovecaptioned action will proceed in accordance with the usual time limits provided by the Rules of Court. In the meantime, we look forward to receiving a settlement proposal from you soon. It is not in dispute that the parties never commenced negotiations and no offers were put forward by either the plaintiffs or the defendants. 9          On 10 April 2001, the plaintiffs obtained a favourable award from the Board of Appeal of the IGPA which held that the plaintiffs were not obliged to pay for the cargo.  Thereafter, the plaintiffs made no efforts to move this action forward. 10        From the defendants’ perspective, the plaintiffs’ action dropped off the horizon.  They were busy dealing with the other claims that had arisen from the sinking of the barge: 20 cargo owners had made claims against the tug and Capitol, three had claimed against the owners of the barge, Sindo, and ten (excluding the plaintiffs here) had claimed against the defendants themselves.  A number of the claims against the defendants were being handled by Messrs Allen & Gledhill.  They had filed Adm 404 of 2000 on behalf of Putrabali and their other clients and were actively pursuing the suit. 11        In view of their financial condition, the defendants considered it in their best interests to settle all these claims.  The settlement process was rather complicated since there were three different parties being claimed against.  Eventually, there was an agreement between Sindo, Capitol and the defendants to contribute to a common fund to settle all the claims.  In February 2002, M/s Allen & Gledhill were insisting on payment of the settlement amounts owing to their various clients and the defendants were faced with the decision whether or not to make their contribution to the settlement fund.  At that stage, they were concerned about the status of this action.  They were advised that the action may have already been automatically discontinued by operation of law since the last step in the proceedings had taken place on 7 February 2001.   They considered that as this action had lain dormant for so long and was already discontinued, if not likely to be discontinued soon, it was prudent to accept the offer from M/s Allen & Gledhill’s clients. 12        After receiving confirmation from Sindo and Capitol as to the amounts of their contribution, the defendants sent their contribution to the settlement to M/s Allen & Gledhill.  This was done on 20 February 2002.  The money was to be released to the claimants in exchange for the original bills of lading and executed release and discharge documents.  It turned out some claimants including Putrabali were not able to return the original bills of lading.  After some negotiation it was agreed that these parties would provide the defendants with an indemnity in the sum of $27,500 per bill of lading against the eventuality of a claim being brought by someone else who was holding such bill of lading.  The claims, including Putrabali’s, were then settled.  In December 2002, Allen & Gledhill furnished the defendants with the executed release documents. 13        On 14 May 2003, the defendants’ solicitors received a letter from the plaintiffs’ solicitors informing them of the plaintiffs’ intention to reinstate the action.  What had happened was that the plaintiffs had suffered a major reversal of fortune in their long running case with Putrabali.  On 17 January 2003, Putrabali had obtained leave to bring an appeal in the High Court of England against the award granted by the Board of Appeal of the IGPA.  This appeal was heard on 24 March 2003 before Judge Havelock-Allan Q.C.  A draft judgment was released in mid April indicating that the appeal would be successful.  The actual judgment in favour of Putrabali was issued on 19 May 2003.  The judgment set aside the award granted by the Board of Appeal of the IGPA and directed that the Board should assess the measure of damages due from the plaintiffs to Putrabali for non-payment of the contract price of the cargo. 14        On 12 June 2003, the plaintiffs filed an application asking for an order that this action be reinstated pursuant to O 21 r 2(8).  The application was heard by the assistant registrar on 25 June and was dismissed.  The plaintiffs’ appeal is now before me.",
        "The proper approach to O 21 rr 2(6), (6B) and (8)": "15        The automatic discontinuance provisions and the accompanying provisions for extension of time and reinstatement have not, as far as I am aware, been considered so far in any decision in Singapore.  As these are fairly new provisions, it is helpful to set them out here. Discontinuance of action, etc., without leave (O. 21, r. 2) … (6) Subject to paragraph (6A), if no party to an action or a cause or matter has, for more than one year (or such extended period as the Court may allow under paragraph (6B)), taken any step or proceeding in the action, cause or matter that appears from records maintained by the Court, the action, cause or matter is deemed to have been discontinued. … (6B) The Court may, on an application by any party made before the one year referred to in paragraph (6) has elapsed, extend the time to such extent as it may think fit. … (8) Where an action, a cause or a matter has been discontinued under paragraph (5) or (6), the Court may, on application, reinstate the action, cause or matter, and allow it to proceed on such terms as it thinks just. 16        On the hearing of the appeal, it was not disputed that the action herein had been automatically discontinued.  As r 2(6) provides for the one year period to run from the last step in the proceedings that appears in the records of the court, the automatic discontinuance would have taken place on 7 February 2002.  This is because the last recorded step was the pre-trial conference held on 7 February 2001 and one year from then ended on 6 February 2002.  The date of service, 21 March 2001, does not figure in this calculation since service of the writ is not, and was not in this case, recorded in the court’s records.  Thus, the application for reinstatement was filed approximately 28 months after the last step in the proceedings and 16 months after their discontinuance. 17        The main issue before me is in what manner the court should exercise the discretion given to it by sub-rule (8) to reinstate a discontinued action since the rule itself does not indicate the considerations which are relevant to such a decision.  Although Singapore courts have not, apparently, had the opportunity to consider how an application for reinstatement of proceedings in this circumstance should be dealt with, I do not have to proceed in a vacuum.  Guidance can be gained from English cases on equivalent (though not identical) provisions in the English County Court Rules.  There is also a lengthy analysis of the Singapore provisions and the possible ways in which they may be applied in an article by Lim Hui Min ieAutomatic Discontinuance under Order 21 Rule 2 – First Dormant, then Dead[2001] S.A.L.J. 150.  She considers that the court would rarely grant reinstatement as otherwise ‘the effectiveness of the automatic discontinuance provision in culling dormant suits and inducing plaintiffs to prosecute their actions with reasonable diligence will be severely undermined’.  The Singapore White Book at ¶ 21/5/16 is also helpful.  Its view, based on a comparison with the English approach, is that reinstatement will only be allowed in exceptional circumstances. 18        In the case ofRastin v British Steel plc & Other Appeals[1994] 2 All ER 641 the English Court of Appeal had to consider the proper approach to an application to reinstate an action in an English County Court after such action had been automatically struck off because the plaintiff had failed to request a hearing date within the period specified by O 17 r 11(9) of the County Court Rules.  Bingham MR who delivered the judgment of the court took a stringent view of the situation.  He pointed out that delay had long been recognised as the enemy of justice and the order in question was one in a long series of measure aimed to curb delay and promote the expeditious trial of cases.  The order recognised that the protection of the public interest in such expedition could not be left exclusively to the plaintiffs’ advisers and that the court had to control the time table.  Generous time limits were given to the plaintiff and therefore failure to act within those periods ‘will not ordinarily be explicable or excusable by sudden forgetfulness, temporary indisposition, pressure of work or the vagaries of the post. … it is plainly incumbent on a plaintiff seeking a retrospective extension of time to persuade the court that its discretion should be exercised in his favour’ (at p 647).  Thereafter, Lord Bingham set out the applicable rules: A retrospective application to extend time should not succeed unless the plaintiff (in which expression we include his advisers) is able to show that he has, save in his failure to comply with r 11(3)(d) and (4), prosecuted this case with at least reasonable diligence.  That does not mean that there is no room to criticise any aspect of his conduct of the case but that overall he is innocent of any significant failure to conduct the case with expedition, having regard to the particular features of the case.  The plaintiff’s failure to comply with the rule can never be justifiable, but he must in all the circumstances persuade the court that it is excusable.  If he is able to show that an extension of time for the requisite period, if sought prospectively, would in all probability have been granted, that will help him, and the more technical his failure the more readily it will be executed.  If, but only if, the plaintiff can discharge these burdens should the court consider the interests of justice, the positions of the parties and the balance of hardship in a more general way.  If it appears that the defendant might be expected to suffer significant prejudice if the action is reinstated which he would not have suffered if the plaintiff had complied with the rule, that will always be a powerful and usually a conclusive reason for not exercising discretion in the plaintiff’s favour.  The absence of such prejudice is not, however, a potent reason for exercising discretion in the plaintiff’s favour.  At this stage, but not before, it is relevant to consider matters such as the availability of an alternative remedy to the plaintiff if the action is not reinstated, the expiry of the limitation period and any admission of liability or payment into court that there may have been. (at pp 647-8) 19        The above rules were reconsidered and simplified three years later by Saville LJ inBannister v SGB plc[1997] 4 All ER 129, another set of appeals relating to the proper method of dealing with the consequences of automatic discontinuance and automatic directions provided for in the County Court Rules.  At ¶ 21.14 of his judgment, Saville LJ set out the following summary of the guidelines to be applied by the court when it considers an application for reinstatement: (1)        has the plaintiff satisfied the court that (apart from his failure to request a date for the trial) he is innocent of any significant failure to conduct the case with expedition between the trigger date and the guillotine date, having regard to the particular features of the case?  If he has not, then reinstatement should be refused; (2)        has the plaintiff satisfied the court that in all the circumstances his failure to apply for a date is excusable, ie should be forgiven?  If he has not, then again reinstatement should be refused; (3)        has the plaintiff satisfied the court that the balance of justice indicates that the action should be reinstated?  If not then once again reinstatement should be refused. 20        In my view, the above guidelines can be applied to an application under our O 21 r 2(8) except that the first must be modified.  In the English situation, the plaintiff has to apply for a date of hearing within a prescribed period from a certain date which is what the guideline refers to as the ‘trigger date’.  Between the trigger date and the guillotine date (ie the last date of the period within which the application has to be made), many other steps may be taken in the action.  In our case, the trigger date is the date of the last step in the action as it appears in the court records (and this may be a step taken by the plaintiff or by the defendant) and the guillotine date is the day before the anniversary of the trigger date.  Between the trigger date and the guillotine date there would be no action whatsoever so there is no way in which a plaintiff can satisfy the court that he is innocent of any significant failure to conduct the case with expedition between the trigger date and the guillotine date. 21        I agree that reinstatement applications have to be carefully scrutinised and that granting such an application should be the exception rather than the rule.  Through rigorous case management, the courts in Singapore have been able to ensure that litigation is carried on with despatch and efficiency.  These efforts should not be undermined by being indulgent towards dilatory parties.  On the other hand, sub-rule (8) recognises that there will from time to time be circumstances in which it is right to reinstate an action that has been automatically struck off.  In those rare situations, the court will exercise the power granted by the sub-rule.  For Singapore purposes, the guidelines should be reformulated as follows: (1)        has the plaintiff satisfied the court that he is innocent of any significant failure to conduct the case with expedition prior to the trigger date having regard to the particular features of the case.  If he has not, then reinstatement should be refused; (2)        has he satisfied the court that in all the circumstances his failure to take any step in the action since the trigger date (and this would include his failure to apply for an extension of time) is excusable, ie should be forgiven?  If he has not, then again reinstatement should be refused; (3)        has the plaintiff satisfied the court that the balance of justice indicates that the action should be reinstated?  If not once again reinstatement should be refused. Bearing the above in mind, I turn to consider the arguments and facts in this case.",
        "Arguments and analysis": "22        The plaintiffs accepted that they had to demonstrate that exceptional circumstances existed which justified the reinstatement of the action.  They argued that these circumstances were made out on two grounds.  First, that there was an agreement between the plaintiffs and the defendants for a moratorium after service.  Secondly, that the plaintiffs’ right of suit against the defendants was influenced by the arbitration proceedings between them and Putrabali and, because of the different decisions rendered in those proceedings, there were periods of time during which the plaintiffs had no right of suit against the defendants and therefore were not in a position to progress this action. 23        In relation to the first ground, I do not think that it has much substance.  I have quoted the pertinent paragraph of the plaintiffs’ solicitors’ letter of 20 March 2001 in relation to the ‘hold hands’ agreement.  That was simply an agreement for a temporary stay of court action while the parties negotiated.  It was not by any means an agreement by the defendants that the automatic discontinuance provisions should be displaced.  As the defendants submitted, the word ‘moratorium’ connotes and has been used to suggest a suspension of time running for the purposes of the Limitation Act and in this context must refer to the running of time for the purpose of O 21 r 2(6).  The correspondence, however, does not mention the automatic discontinuance rule and it appears unlikely that the parties had this rule in mind in March 2001.  The plaintiffs were then awaiting the outcome of their appeal against the arbitration award.  If the appeal had been dismissed, they would have wanted to proceed either with active negotiations or with the action.  At that time they cannot have thought that they would not be taking any further steps in the action for such a prolonged period that O 21 r 2(6) would come into play.  If the plaintiffs did not have it in mind, it is impossible that the defendants would have contemplated that by agreeing to hold hands they were agreeing to a moratorium which would displace that rule.  In any event, there is nothing in the rule to indicate that parties can suspend its operation by agreement and such an interpretation of the rule would, in my view, run counter to its rationale.  I note that inBannisterat ¶ 21.26 onwards, the court clearly rejected the argument that the conduct of the parties, including any express or implied agreement, can be a ground of reinstatement, even if it gives rise to injustice. 24        As regards the plaintiffs’ second ground, I will consider that as I consider the application of the guidelines in ¶ 22 to this application.  This is because whilst the plaintiffs did not use the guidelines in formulating their arguments, I have held that these provide the proper framework within which the application is to be considered. 25        The first matter to be considered is whether the plaintiffs were innocent of any significant failure to conduct the case with expedition up to the trigger date or in other words whether they acted with reasonable diligence and expedition in their conduct of the case prior to 7 February 2001.  The relevant facts here are that the writ was filed on 3 January 2001 about one month before the time bar period expired; that between issue date and 7 February 2001 when the pre-trial conference was held, the plaintiffs did not serve the writ; and that up to 30 January 2001, the plaintiffs were disputing Putrabali’s claim and no arbitration award had been issued.  I do not think that their failure to serve the writ before 7 February was a significant failure to conduct the case with expedition bearing in mind that up to 30 January, their position vis-à-vis Putrabali had not yet been determined and that they had had to file the writ to preserve time.  I am aware that it has been observed that if a writ is filed towards the end of a limitation period it behoves a plaintiff to be even more concerned with expediting the case thereafter.  In this case, however, the limitation period was a relatively short one of one year rather than the more usual six years that applies to tortious and contractual claims under the general law.  Once the plaintiffs were ordered to serve the writ within a specific period they did so. 26        The plaintiffs having surmounted the first hurdle, I now have to consider whether they have satisfied me that in all the circumstances their failure to take any further step in the action between service and automatic discontinuance on 6 February 2002 was excusable.  The plaintiffs had two reasons for doing nothing after 20 March 2001.  The first was the so-called moratorium agreement.  As I have stated that was not a good reason since they cannot really have believed that they had an agreement to extend time indefinitely.  In any case, while the parties were supposed to ‘hold hands’ in order to negotiate, the plaintiffs did not make any overtures in that regard to the defendants and therefore cannot have regarded ongoing negotiations as a reason for not prosecuting the action. 27        The second reason the plaintiffs did nothing was that on 10 April 2001 the award against them had been set aside and therefore they had no interest in the cargo and had basis on which to make a claim.  This situation did not change until the High Court of England allowed Putrabali’s appeal in May 2003.  The plaintiffs argued that between April 2001 and May 2003 they were between a rock and a hard place in regard to this case in that until Putrabali’s appeal was allowed, they had no legal basis on which to make a claim against the defendants and as such they were not in a position to prosecute the action and yet if the action lapsed, time bar would set in against them.  If they had made an application prior to 6 February 2002 for an extension of time under r 2(6A), they would also have had difficulty as their title to sue the defendants was then in great doubt. 28        The affidavit filed on behalf of the plaintiffs in support of the application does not discuss the circumstances in which Putrabali obtained leave on 17 January 2003 to appeal to the High Court against the award of the Board of Appeal of the IGPA.  No details are given of when Putrabali first made its application for such leave.  From a perusal of the draft judgment of Judge Havelock-Allan Q.C. (a copy of which was exhibited to an affidavit filed on behalf of the plaintiffs) it appears that it was early in May 2001 that Putrabali filed its application for permission to appeal against the said award.  For some reason the leave application was not heard until February 2002.  Assuming that those dates are correct (and the plaintiffs have not given me any information which casts doubt on them), the plaintiffs would have been aware from June 2001 onwards that the proceedings between themselves and Putrabali were not concluded and that there was a possibility that the award in their favour might be set aside.  That being the case, it behoved the plaintiffs to at least consider making an application for an extension of time in order to preserve the current action.  No evidence was placed before me that they thought about it and that there was any particular reason why such application was not made.  There is no evidence that the plaintiffs addressed their minds to this action at all between April 2001 and 6 February 2002.  Even after February 2002, no thought seems to have been spared to this action.  The next trigger point was ten months later in January 2003 when leave was granted.  At that stage the plaintiffs could have applied for reinstatement of this action.  They did not do so.  They only filed the application three weeks after Judge Havelock-Allan Q.C.’s  judgment was rendered. 29        The plaintiffs have not furnished me with sufficient facts to determine that their failure to do anything for 16 months after the action was automatically discontinued and for 24 months from June 2001 (Putrabali having asked for leave to appeal in May 2001) was excusable.  No one has explained what was considered and when, and why nothing was done prior to June 2003.  The affidavits simply state the sequence of events.  No doubt the plaintiffs’ title to sue was in issue for all of that period.  Whilst that would have prevented them from prosecuting the action, it did not prevent them from applying for an extension of time under sub-rule 2(6A).  They did not apply either because they did not think about it or because they had chosen not to preserve this action.  As the plaintiffs are asking the court to exercise its discretion in their favour, they must furnish me with sufficient facts on which to do so. 30        In my judgment therefore, the plaintiffs have failed to surmount the second hurdle and this action should not be reinstated.  Even if I had been of a different mind and had found their inaction excusable, I would not have reinstated the suit because, in my view, the justice of the case is against reinstatement.  First, the defendants have been prejudiced.  Thinking that the action was automatically discontinued or, at the least, dormant, they settled Putrabali’s claim.  Even though they have an indemnity from Putrabali that they can call on if the plaintiffs’ claim continues and is successful, that indemnity is limited and may be difficult to enforce.  Thirdly, the defendants obtained contributions from Capitol and Sindo to the settlement with Putrabali and other claimants and they may therefore have compromised their rights against those parties.  Fourthly, reinstatement of the action would mean that the defendants would lose an accrued defence of time bar.  Finally, there is some doubt as to whether the plaintiffs, notwithstanding the judgment against them in favour of Putrabali, do have title to sue the defendants.  Judge Havelock-Allan Q.C. observed in his judgment that when Putrabali commenced its action in Singapore against the defendants or, at the latest when it compromised that action, it elected to treat the plaintiffs’ rejection of the shipping documents as bringing the sale contract to an end.  That meant that Putrabali could deal with the documents and the goods as it pleased and its remedy against the plaintiffs was an action for damages for failure to pay the price.  It was no longer open to Putrabali to claim the price of the goods and the bills of lading which they had to offer in return for the price were bills that no longer conferred any contractual rights against the carrier.  On that view of the law, the plaintiffs would not acquire any title in the goods even after paying Putrabali damages and, therefore, any action which the plaintiffs might prosecute against the defendants would be fatally flawed.  Overall, the balance of justice is with the defendants, not the plaintiffs.",
        "Conclusion": "31        For the reasons given above, the plaintiffs’ appeal fails and is dismissed with costs to be taxed if not agreed.  Alternatively, if both parties are agreeable they may appear before me for costs to be fixed."
    }
}