{
    "case_title": "IBM Singapore Pte Ltd v UNIG Pte Ltd",
    "ncitation": "[2003] SGHC 71",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "IBM’S Case": "2 In early 2000, UNIG conceptualised an e-marketplace system for the operation of a construction exchange to allow participants to carry out business transactions on-line. This was to be called CXHub with its website at www.cxhub.com. UNIG evaluated several vendors in the information technology field with the assistance of its consultant, I-Sprint Innovation Services Pte Ltd. UNIG eventually decided on IBM as the vendor to supply the requisite hardware and software. IBM was to supply, customise and install its software, Websphere Commerce Suite Marketplace Edition (\"WCS MPE\"), for the CXHub. Although UNIG established a subsidiary known as Construction Exchange Pte Ltd to operate the CXHub website, the relevant agreements were entered into between IBM and UNIG. 3 The Lease Agreement dated 30 September 2000 concerned the provision of hardware and software to UNIG. Under this agreement, UNIG was to pay IBM $73,240.53 monthly for a period of 36 months between 30 September 2000 and 30 August 2003. UNIG defaulted on the payment schedule from 30 July 2001 after having paid the said amount for ten months together with an upfront payment for the Goods and Services Tax (\"GST\") of $79,099.77. IBM therefore claimed under this agreement the arrears for 14 months (between 30 July 2001 and 30 August 2002), interest at 2% per month (as provided in the agreement), the twelve monthly payments due in the future (between 30 September 2002 to 30 August 2003) and the costs of the repossession of its hardware (which took place in January/February 2002). These added up to $2,038,548.54. 4 The said Lease Agreement expressly provided that it was not cancellable and that UNIG’s obligations were absolute, unconditional and irrevocable. It was not to be affected by any right of set off or defence of any kind whatsoever. The Lease Agreement also had an \"entire agreement\" clause and excluded liability for special, incidental or indirect damages or for any consequential economic damages, including loss of profits. Various cumulative remedies were available to IBM under this agreement upon UNIG’s default. IBM could recover the items leased, recover all payments and other amounts due and becoming due and recover costs incurred in such repossession and collection of monies payable under the agreement. 5 The Services Agreement dated 12 October 2000 concerned the provision of services by IBM for the installation, customisation and implementation of the WCS MPE software for the CXHub. The contract amount was $2.5 million (without GST), out of which 20% was payable on achieving the stipulated first milestone, another 20% on achieving the second and 25% and 35% on achieving the third and the final milestones respectively. Only $1.03 million (inclusive of GST) in respect of the first two milestones was paid by UNIG although the last two milestones were achieved on 3 February 2001 and 23 March 2001. IBM therefore claimed the unpaid amount of $1.545 million (inclusive of GST) for the original scope of works set out in the Statement of Works. It also claimed another $28,940.94 in respect of variation works requested by UNIG. IBM claimed that it implemented all deliverables and met the contract schedule set out in the Statement of Works. The invoices for these two amounts were issued on 19 and 20 November 2001 respectively and should have been paid within 30 days from the dates of the invoices, as provided in the Service Agreement. Accordingly, interest at 2% per month on the unpaid amounts was claimed with effect from 20 and 21 December 2001. 6 The events leading to the above agreements began in April/May 2000 when CXHub was conceived during the \"dot.com\" frenzy. Business-to-business (\"B2B\") e-marketplaces were then relatively new. The market leaders were Ariba, CommerceOne and i2, with Ariba’s products being the most mature. There was no such thing as a comprehensive B2B e-marketplace in 2000. That concept was at any rate a matter of degree. 7 UNIG’s consultant, I-Sprint, reported in May 2000 that Ariba and i2 could only demonstrate some generic functionalities required to support a B2B exchange in the internet and that the short-listed vendors (Ariba, i2 and IBM) satisfied some of the basic criteria, with Ariba’s products being the most comprehensive. UNIG sent out its Request for Proposal (\"RFP\") on 3 June 2000 to the short-listed vendors who were asked to respond by 12 June 2000. This document was prepared by the consultant. 8 The consultant also went to the said vendors’ headquarters in the United States to assess their products between 7 and 15 June 2000. The consultant’s Trip Report of 22 June 2000 stated that Ariba had the most complete, mature and proven solution and was at least six to nine months ahead of IBM in terms of product features. The report also stated that IBM’s architects were able to demonstrate a relatively clean pre-production version of their software but noted that the initial release of the WCS MPE 4.1 would not have a reverse auction module. 9 On 21 June 2000, past the deadline, IBM sent its Response to RFP to UNIG. The Response declared IBM as being able to offer comprehensive solutions that facilitated all aspects of B2B trade and supply chain integration. It also described its WCS MPE as a comprehensive e-marketplace platform designed to support the five critical \"Cs\" of B2B marketplaces – content, commerce, coordination, community and connectivity. The Response invited UNIG to participate in the Limited Availability Program (\"LAP\") from late June, with the expectation of upgrading to the General Availability MPE software when it became available in September 2000. It proposed a Phase 0 during which the customer would provide details of the functional requirements of the system to IBM. A \"gap analysis\" would then be carried out to determine to what extent the software would be able to meet those needs \"out of the box\" and what customisation was required or desired. A Technical Compliance Response set out IBM’s responses to the specific technical matters raised in UNIG’s RFP in a question/answer mode. Such responses were descriptive in nature and many answers were qualified or conditional as further detailed discussions were contemplated. 10 Such discussions did take place between UNIG and I-Sprint on one side and IBM on the other over the period between 23 and 30 June 2000. Clarifications were sought and the contract price was negotiated, with UNIG asking IBM to put a cap to the price. IBM informed UNIG at the discussions that it would be getting only the English version and not the multi-language one. 11 On 30 June 2000, I-Sprint informed IBM via email that the top management of UNIG would like IBM to confirm/commit to several matters in writing. One of these matters was: \"To cap the software customisation and implementation cost to S$2.5 million and commitment to bring this cost to below S$2.0 million on a best effort basis after completion of Phase 0 and to deliver all requirements specified in our RFP within 6 months from 1 July 2000.\"That same day, the Managing Director of IBM responded to that particular request as follows:\"… I am pleased to provide the following:…To cap the software customisation and implementation price to S$2.5 million, and commitment to bring this price down accordingly to the scope after completion of Phase 0 -–detailed study, and to deliver all requirements specified in our RFP within 6 months from the date of sign-off by UNIG at the end of phase 0.\" It was agreed by both parties at the trial that the words \"in our RFP\" in IBM’s reply meant \"in our Response to RFP\". 12 On 3 July 2000, UNIG’s consultant issued its Final Report. The report noted that IBM’s product required a lot of customisation and may not be as robust and stable as Ariba’s but the latter’s product cost much more than IBM’s $4.7 million. UNIG decided to give the job to IBM. The LAP was signed but was backdated to 30 June 2000 by mutual agreement. 13 Phase 0 took place over a period between 15 July and 14 September 2000. Intensive meetings were held every day among representatives from UNIG, I-Sprint and IBM. The management of UNIG attended some of these sessions. IBM presented the \"look and feel\" and the functions of its software and discussed the details of the customisation needed. Email was exchanged and telephone calls were made between the parties. 14 All those meetings culminated in the signing of the Lease Agreement and the Services Agreement which included the Statement of Works and that represented the sign-off at the end of Phase 0 and the beginning of the implementation phase. At all times, the understanding was that the Statement of Works detailed all the contractual requirements. This was made explicit by the \"entire agreement\" clauses found in both agreements which made no reference to the RFP or the Response to RFP. 15 The Lease Agreement had the following clause set out in bold, capital typeface: \"THIS AGREEMENT, ANY APPLICABLE SUPPLEMENT, ATTACHMENTS OR ADDENDA ARE THE COMPLETE EXCLUSIVE STATEMENT OF THE AGREEMENT REGARDING EACH LEASE OR FINANCING TRANSACTION. THESE DOCUMENTS SUPERCEDE ANY PRIOR ORAL OR WRITTEN COMMUNICATIONS BETWEEN THE PARTIES. …[UNIG] may not modify or change the terms of this Agreement without [IBM’s] prior written consent.\" 16 The Services Agreement had the following clause in capital typeface: \"THE PARTIES ACKNOWLEDGE THAT THEY HAVE READ THIS AGREEMENT, ANY STATEMENT(S) OF WORK AND CHANGE AUTHORIZATION(S), UNDERSTAND THEM, AND AGREE TO BE BOUND BY THEIR TERMS AND CONDITIONS. FURTHER, THE PARTIES AGREE THAT THIS AGREEMENT, ANY STATEMENT(S) OF WORK AND CHANGE AUTHORIZATION(S) ARE THE COMPLETE AND EXCLUSIVE STATEMENT OF THE AGREEMENT BETWEEN THE PARTIES, SUPERSEDING ALL PROPOSALS OR OTHER PRIOR AGREEMENTS, ORAL OR WRITTEN, AND ALL OTHER COMMUNICATIONS RELATING TO THE SUBJECT.\" 17 In addition, the Statement of Works contained the following in bold, capital typeface: \"[UNIG] ….. AGREE THAT THE REFERENCED AGREEMENT AND THIS STATEMENT OF WORK ARE THE COMPLETE AND EXCLUSIVE STATEMENT OF THE AGREEMENT BETWEEN THE PARTIES, SUPERSEDING ALL PROPOSALS OR PRIOR AGREEMENTS, ORAL AND WRITTEN, AND ALL OTHER COMMUNICATIONS BETWEEN THE PARTIES RELATING TO THE SUBJECT MATTER HEREOF.\" 18 The implementation period of the project began from 12 October 2000. UNIG paid the contractual amounts under the Lease Agreement, defaulting from the 30 July 2001 monthly payment onwards. In July 2001, before the default took place, UNIG requested the release of its Banker’s Guarantee and IBM consented to that. On 15 October 2001, IBM withdrew from the CXHub project. On 30 November 2001, IBM’s solicitors put UNIG on notice to pay the outstanding amounts due under the Lease Agreement. When no payment was made, IBM terminated the Lease Agreement on 7 January 2002 due to UNIG’s repudiatory breach and repossessed some of its hardware. IBM could not repossess the others that day as they had been relocated by UNIG. 19 On 22 January 2002, both parties launched their respective actions against each other about one hour and thirteen minutes apart.",
        "UNIG’S Case": "20 UNIG’s defence was essentially one of set off and counterclaim. It argued that the agreements included the RFP and the Response to RFP. In its RFP, UNIG stated its requirements for an integrated e-market solution which, among other things, must: (1) enable B2B commerce amongst a multitude of buyers and sellers through a unified e-marketplace;(2) provide collaborative features for the building construction industry;(3) be a thin-client, component-based architecture based on open technology standards;(4) be portable across multiple hardware platforms;(5) be robust and scalable; and(6) be capable of having its functionality extended and enhanced. In the Further and Better Particulars filed on 19 August 2002, UNIG elaborated on the meaning of the terms used above. 21 By its Response to RFP, IBM represented to UNIG that the WCS MPE was: (1) a comprehensive e-marketplace platform;(2) a high-performance software;(3) able to establish a fully functional and scalable e-market quickly and effectively;(4) built based on open industry standards. 22 UNIG alleged that IBM, by its letter of 30 June 2000 (referred to in paragraph 11 above), represented and undertook to deliver all requirements as specified in the RFP within 6 months from the date of sign-off of Phase 0 and UNIG agreed to purchase IBM’s e-marketplace solution in reliance on the representations which turned out to be false. 23 UNIG alleged that IBM breached the agreements by not providing the features and functions spelt out in the RFP and/or the Response to RFP and/or which were expected of a comprehensive e-marketplace platform for the construction industry. These included parametric search capability, a reverse auction function, multi-language support, support for Macintosh systems and the ability to attach multiple files and file sizes (of up to 50 Mb) appropriate to the construction industry. UNIG also claimed that the software supplied by IBM did not perform satisfactorily in its print report capability. It further alleged the software did not have housekeeping tools, something reasonably expected of a comprehensive e-marketplace platform for the construction industry. 24 According to UNIG, parametric search capability was the ability to allow a user to filter and/or narrow the object of a search by specifying multiple attribute values or value ranges, such as product attributes, product categories and/or descriptions. It alleged that IBM’s software was unable to carry out searches based on multiple attribute values. 25 Reverse auction referred to an open auction format that allowed users to procure goods and services at the lowest possible price through a dynamic process of decreasing incremental bidding by interested sellers. In practical terms, both buyers and sellers would be able to view information and/or bids in real time. IBM’s solution did not provide for such an auction format. 26 Multi-language support was the ability to support multiple languages (double byte) on a single homogeneous solution platform. In practical terms, that meant there would be no need to duplicate any part of the e-marketplace solution deployment throughout Asia in order to support multiple languages. The languages which were meant to be supported included English, Chinese, Japanese and Korean. IBM’s solution required a separate e-marketplace deployment for each language. 27 The solution was supposed to allow users using Macintosh computers with web browsers such as Internet Explorer and Netscape to access and use it. However, the solution did not perform as required or expected when such computers were used. 28 The solution should allow users to attach more than one soft-copy file of construction industry documentation including those associated with the calling and awarding of a construction tender such as tender specifications, engineering drawings and images. Before December 2000, the solution did not allow for the attachment of more than two files at one time for a Request for Quotation (\"RFQ\") transaction. It was only upon UNIG’s submission of a Request for Change that IBM proceeded to install this feature. 29 The solution also did not have the ability to allow users to select, format, paginate, distribute and allow viewing of and/or printing of information contained in, generated by and/or presented by the solution, including audit trails. In practical terms, that meant that the user was unable to select the contents of a report to be printed and was restricted to printing whatever appeared on the screen. 30 Housekeeping tools would allow the solution to manage the resources that were being utilised, including the ability to monitor, view and organise the allocated and available disk space. It would also be able to delete or thrash unwanted files. 31 The software provided by IBM was unstable and unpredictable. There were intermittent outages and errors in the function relating to tenders. The solution was unable to handle multiple users. It also could not interface and integrate with other software and external systems which conformed with open industry standards. It was unable to port to other platforms. 32 There was delay in the completion and delivery of the contracted works. On or about 4 August 2000, the modifications and customisations required were agreed upon completion of Phase 0 and were eventually incorporated as Annexure F in the Services Agreement. IBM was therefore obliged to deliver a solution satisfying all the requirements in the RFP and the Response to RFP within 6 months from 4 August 2000, i.e. by 4 February 2001. IBM failed to do so. IBM also failed to provide a product roadmap for its software. In September 2001, UNIG discovered that the WCS MPE had been deferred or suspended from IBM’s product roadmap. By a letter of 20 September 2001, UNIG demanded that IBM submit a plan on the rectification of the various breaches but there was no response from IBM. 33 UNIG averred that the breaches amounted to a repudiatory breach of the agreements entitling UNIG, which accepted the repudiatory breach on 27 November 2001, to terminate the agreements. This was because UNIG had been deprived of substantially the whole benefit of the agreements and the works carried out by IBM were worthless. Following that, it was agreed that IBM would remove its hardware from UNIG’s premises. 34 UNIG counterclaimed against IBM for damages amounting to $3.78 million for loss of projected profits for the year 2001 suffered by CXHub Singapore ($3.06 million), CXHub Malaysia ($0.03 million) and CXHub China ($0.69 million). 35 UNIG also claimed the costs of engaging a third party quality assurance specialist, Alliance Software Process Engineering Consultancy Pte Ltd (\"ASPEC\") to assist in ensuring the smooth implementation of CXHub. These expenses amounting to $103,000 (including GST) were paid to ASPEC on a time and material basis between November 2000 and April 2001. ASPEC was said to have assisted in the areas of project schedule and issue management, carrying out of User Acceptance Tests, documenting the functional description of the CXHub modules and recommending process improvement and problem-solving. 36 UNIG also claimed for the return of all monies paid to IBM. It further argued that if it was liable to IBM for the unpaid amounts under the two agreements, the interest of 2% per month charged amounted to a penalty in law and the clause relating to such interest was therefore not enforceable by IBM.",
        "The Decision of the Court": "37 The RFP and the Response to RFP dealt with requirements and expectations at a generic level. They were not the offer and acceptance elements of a contract. The document originating from UNIG, as its name implied, was essentially a request for information sent to software vendors. Responses to that request could vary in the amount of details furnished. They could also contain some \"hype\" or self-promotion by the responding companies in the hope they would be short-listed or selected to engage in further and more detailed discussions. What those companies set out in their Response to RFP could of course amount to representations. It would be up to them to limit the legal ramifications arising from their Response to RFP. Equally, it was up to the originator of the RFP to disregard any Response to RFP that was too guarded or qualified in its terms. 38 Once the parties agreed to engage in discussions, details were worked out and specifics were gone into at length. It would not be surprising if a customer like UNIG, during the course of discussions, decided to have things not originally specified in the RFP or to update or modify parts of its original plan. Similarly, it would be no surprise if UNIG decided to abandon specified features as the discussions proceeded because of a change in its vision of the CXHub or due to cost constraints. Therefore, while it was true that IBM gave an assurance on 30 June 2000 on its ability to deliver what was contained in its Response to RFP and such assurance could amount to a representation, we must still examine the events thereafter which could qualify or even supersede the terms of engagement. 39 The contracts that were ultimately signed contained the \"entire agreement\" clauses set out earlier. UNIG could not deny that those clauses effectively erased any legal consequences that could have arisen from the Response to RFP or the discussions and negotiations that had taken place. The contractual relationship between the parties was now circumscribed by the signed agreements and by those alone. Further, UNIG was not relying on implied terms in its case and there was no universally accepted concept of a comprehensive e-marketplace (for the construction industry or otherwise) against which IBM’s system could be measured. In any event, UNIG failed to show that IBM breached any of the undertakings set out in the Response to RFP or in the agreements. 40 The RFP required \"advance search capabilities based on product attributes, product categories, description, keywords or other parametric values\". It is axiomatic that descriptions such as \"advanced\" are matters of degree and are not absolute values in themselves. Further, what was considered advanced six months ago could very well become rather dated today. With each step forward in technology, expectations rise. With experience, people realise that some feature could have been better. The truth remained that during Phase 0, the search functions were discussed and reduced to writing. Various fields and keywords could be searched simultaneously. UNIG approved the search functions. IBM delivered a system with such search capabilities. It appeared that UNIG was now asking for something not clearly specified in the agreements. 41 The RFP specified that the system must support \"forward and reverse auctions\" and IBM responded by stating that, \"depending on the detailed requirements, the functionality of a reverse auction can be fulfilled through the exchange and/or the RFQ sub-system\" and that its solution could support \"forward auction as in standard auction, reverse auction as in used in RFQs and exchanges\". It was a qualified response as IBM would not know the exact auction requirements contemplated. UNIG had the advice of its consultant at all times and was advised that a reverse auction function would have to be customised. No such function was set out in the Services Agreement and UNIG’s sign-off of the User Acceptance Test for the auction module was unqualified. 42 The RFP stated that \"the system must be designed to cater to multi-language (double-byte) currencies and times zones as it would be used throughout Asia\". IBM responded by stating that \"timeframes of the availability of the NLV versions differ though most major languages and currencies (including the euro) would be supported\". \"NLV\" is National Language Version. Clearly, further discussions on this feature would be necessary in the light of such a response. IBM did not claim it had a single platform that could host non-English languages. It only had the English language single-byte version available. The Statement of Works agreed upon subsequently expressly stated that the implementation would be based on the US English version of the WCS MPE only and that the scope of works did not include the migration of the WCS MPE to the multi-language version and the implementation of other NLVs. 43 The issue relating to the attachment of multiple files concerned the RFQ (Procurement) module. While the Statement of Works did provide for the requirement to attach multiple files, the number of file attachments was not specified during Phase 0. In any event, UNIG’s request for change was implemented by IBM which did not charge the costs of such change (some $9,500) to UNIG. The requirement as to file size was mentioned only in the Statement of Works and it was provided there that total file attachments were to be limited to less than 50 MB, that drawing attachments were envisaged to be between 1.3 and 1.5 MB and that drawings would be submitted manually via CD-ROM. UNIG was targeting large tenders of more than $1 million and it was envisaged that such tenders could involve drawings exceeding 1000 MB. The system could handle large files but there were inherent limitations as to how much data could be transmitted over the Internet. At any rate, the issue of file size attachment could be solved by adjusting the default time-out value which was essentially a matter of system administration. 44 Where Macintosh users were concerned, UNIG did not mention such in its RFP and IBM’s Response to RFP, unlike Ariba’s, merely identified the browser (Internet Explorer and Netscape) and not its versions or the hardware and operating system requirements. If, as UNIG alleged, the construction industry had a high percentage of Macintosh users, that was not made known to IBM. It was not disputed that Macintosh had a negligible share of the business computer market. Businesses which use Macintosh machines would in all likelihood have personal computers anyway. Macintosh machines were used mainly for drawings and drawings were meant to be submitted via CD-ROM. Macintosh users could access the CXHub although they could experience browser problems relating to the presentation of the pages. 45 The complaint about print report capability arose only in May 2001 and related to the tender module. The RFP did not expressly require the formatting of reports. The Statement of Works did not provide for such customisation. The sign-off of the User Acceptance Test for the tender modules was not qualified by a complaint about the lack of such capability which could be provided anyway by purchasing specialised software. 46 No reference to housekeeping tools was made in the RFP, the Response to RFP or the Statement of Works. The system provided was able to delete or thrash unwanted files and to monitor, view and organise the allocated and available disk space of the individual users. The lack of such tools did not hinder the use of the system anyway as they would be required only in the long term and could be incorporated into the system when required. 47 UNIG alleged that IBM’s solution could not operate on other platforms that supported Java, an open standards and open source development language. These included platforms such as Sun Solaris, Windows NT and Linux. IBM’s Response to RFP clearly stated that its WCS MPE version 4.1 covered only its hardware RS/6000 which used its AIX operating system. No promise was made that the solution would be able to run on other platforms. The software was built on open standards. Openness and the ability to interface with other systems were a question of degree and did not imply that no costs would need to be incurred. The evidence led by UNIG on the alleged inability of the CXHub system to interface with other systems in respect of two incidents (involving Singalab and Buildfolio) was, at the least, consistent with the fault lying on those other systems sought to be integrated. 48 IBM did not promise UNIG a product roadmap although UNIG did ask for one. IBM eventually withdrew WCS MPE version 4.2 on 13 September 2002 but that decision was due to the lack of global demand for such software and not to any alleged inherent defect in it. IBM had other customers who were still using WCS MPE version 4.1. Even though the product had been withdrawn from the market, IBM would have been able to support CXHub if UNIG had agreed on a maintenance contract. 49 It would be highly unusual for a complex system like the CXHub to be completely bug-free during implementation and even during operation. This was particularly so for a software known to be still in its development stage. There were errors and outages during production but they were noted and rectified. Part of the problems was caused by UNIG’s insistence on rolling out module by module instead of the complete system. By May 2001, the problems were fixed and the system was stable. There was only one incident of outage between June and November 2001. From July 2001, the system was running smoothly for 99.8% of the time. Any allegation that the system might still crash after all the fixes had been made would be pure speculation. Not every bug or error in software would amount to a repudiatory breach of contract [Anglo Group Plc v Winther Browne & Co Ltd[2000] ITCLR 559]. One must look at the overall impact on the operation of the programme. 50 The Statement of Works at Appendix F provided that the period of implementation would be 28 weeks. This would mean that the said period commenced from the date of execution of the Services Agreement on 12 October 2000 and not, as UNIG argued based on IBM’s letter of 30 June 2000, from the date the Phase 0 discussions concluded (on 4 August 2000). There was no \"sign-off\" after Phase 0 by UNIG other than the execution of the Services Agreement. Some modules were late but that was caused in part by requests for change submitted by UNIG. Whatever delay there was could not have been substantial or material to the operation of the CXHub. In January/February 2001, the management of UNIG stated in a press release that the construction portal was fully functional and allowed for e-transactions to be made. In March 2001, UNIG’s Chief Technology Officer stated in a video clip that the CXHub, through a very close partnership with IBM, \"brought the site from concept to life within six months. I think we’re very satisfied\". This statement was drafted by the Chief Technology Officer himself even if, as he said, it was a mere public relations statement made upon IBM’s request. 51 Time was not stated to be of the essence in the agreements and no notice was given to IBM requiring completion of the works within a reasonable time [National Skin Centre (Singapore) Pte Ltd v Eutech Cybernetics Pte Ltd[2002] 1 SLR 241]. Where no such notice was given, the delay alleged must be such as to frustrate the contract [Chua Chay Lee & Others v Premier Properties Pte Ltd[2000] 4 SLR 177]. 52 The minutes of meetings of UNIG’s board of directors showed that the poor revenue position was due to the global economic woes, the state of the construction market and of the technology sector and not to any alleged non-performance by IBM of its contractual obligations. There was no record of any loss of confidence by users or of threats to terminate membership in the CXHub. 53 It was therefore clear to me that IBM was not guilty of breaches of contract and certainly not guilty of such repudiatory breach as would have entitled UNIG to terminate the agreements. A substantially working system, at the very least, was provided by IBM and there could be no valid ground for UNIG to claim a total failure of consideration. 54 UNIG’s claim for loss of profits amounting to $3.78 million for 2001 was largely based on revenue projections in its business plan prepared in early 2000. Subsequent events (such as those mentioned in paragraph 52 above) have shown such projections, particularly in dot.com ventures, to be unduly optimistic. The Joint Venture and Shareholders’ Agreement dated 2 August 2000 for the Construction Exchange Pte Ltd, the operator of CXHub and subsidiary of UNIG, nevertheless projected a profit of only $357,000 for 2001. The Malaysian operation has ceased and there appeared to be no activity in the China operation, despite UNIG’s claim about China being a huge potential source of income for its CXHub. In any event, the Services Agreement limited IBM’s liability for actual direct damages to $200,000 and excluded liability for special, incidental or indirect damages or for economic consequential damages (including loss of profits or savings). UNIG, which owned 50% of that subsidiary, was also not entitled to claim such losses as they would be losses of the subsidiary and not of UNIG. 55 The amount of $103,000 (inclusive of GST) paid to ASPEC was in respect of work done in developing criteria for and conducting the User Acceptance Tests. UNIG lacked in-house information technology personnel and would have needed to incur those costs anyway if it wanted to have the system running. Those costs would only have been completely wasted if the system provided by IBM was in fact not a functioning system at all and, as indicated earlier, that was hardly the case. Further, it was the subsidiary which engaged ASPEC and to which the invoices were directed. UNIG therefore did not even incur those costs. 56 The contractual provision on interest charges for late payments could hardly be a penalty clause in the circumstances of this case. The doctrine of penalties was directed at inequality of bargaining power between apparently willing contracting parties [seeHong Leong Finance Ltd v Tan Gin Huay & Anor[1999] 2 SLR 153]. UNIG’s list of shareholders included City Development Limited, Far East Organisation and other major companies in the construction industry. Its management comprised experienced businessmen who would not hesitate to ask for written undertakings by IBM, as evidenced in the correspondence of 30 June 2000 referred to earlier. UNIG also negotiated on price and other terms, such as the limitation of liability which was increased from $100,000 to $200,000 at its request. UNIG was therefore quite capable of holding itself up and meeting IBM as equals. 57 It followed that IBM had proved its case against UNIG and that UNIG’s counterclaim must fail. I gave judgment for IBM as claimed save for the amount of $997 claimed as costs incurred for the re-possession of the hardware as those costs would have to be incurred even if the Lease Agreement had been allowed to run its full course. I dismissed UNIG’s counterclaim and awarded IBM the costs of the entire proceedings with the direction that there was to be only one set of costs in respect of the two consolidated suits."
    }
}