{
    "case_title": "Public Prosecutor v S",
    "ncitation": "[2003] SGHC 70",
    "coram": "Woo Bih Li J",
    "sections": {
        "My Decision": "12 Although the accused was a juvenile as defined under the Children and Young Persons Act (Cap 38), the nature and the circumstances surrounding the commission of the offences were serious. 13 According to the Statement of Facts, which the accused accepted, the accused had been entrusted by his parents to look after his siblings as he was the eldest child. He would often beat them with belts and a broomstick. When he sexually abused the three victims, he would threaten to beat them with a belt or a broomstick and on occasions, he would carry out his threat. I need refer only to two occasions of sexual abuse by the accused. 14 On one occasion in 2001, the accused had pulled A into his bedroom and raped her despite her protests. On another occasion in mid-June 2002, the accused had inserted his penis into A’s anus. Although A was in pain and cried out to the accused to stop, he told her to hold on tight to a pillow. 15 The Statement of Facts and the charges showed the accused to be a deviant who used force or the threat of force to abuse his siblings sexually in various ways. This was not a case where he had acted on impulse on one occasion only. In the circumstances, I was of the view that this was not an appropriate case for the accused to be sent to a home only, and that he should be sent to prison. 16 On the term of imprisonment, the Court of Appeal has said inChia Kim Heng Frederick v Public Prosecutor[1992] 1 SLR 361that the starting point for a charge of rape under s 376(1) of the Penal Code is ten years’ imprisonment for a contested case. A court should then consider any mitigating factors of which a plea of guilty is one and which would merit a reduction of one-quarter to one-third of the sentence. Other factors such as the victim’s youth, the accused’s position of responsibility and trust towards the victim, and perversions or gross indignities forced upon the victim would justify a longer sentence. 17 However, I noted that a charge under s 376(2) of the Penal Code was more serious. Section 376(2) prescribed a minimum imprisonment of not less than eight years and not more than 20 years with caning of not less than 12 strokes. Under s 376(1), there is no minimum term of imprisonment while the maximum term is 20 years. Furthermore, under s 376(1), an accused is only liable to a fine or caning i.e caning is not mandatory although that is usually part of the sentence meted out. 18 As for an offence under s 377 of the Penal Code, the Court of Appeal inLim Hock Hin Kelvin v Public Prosecutor[1998] 1 SLR 801upheld consecutive sentences of ten years each for four charges under s 377 involving anal intercourse. However that was a worse case than the case before me in that the accused there was a paedophile, there were five victims and the accused had had previous convictions for similar offences. 19 InAdam bin Darsin v Public Prosecutor[2001] 2 SLR 413, the Court of Appeal said that anal intercourse was a more serious offence than fellatio. Where the fellatio was an act performed on the victim, an appropriate sentence would be in the region of five years, subject to any mitigating or aggravating circumstances. In the case before me, the charges under s 377 involved acts of anal intercourse as in the case ofLim Hock Hin Kelvin. 20 As for an offence under s 354 of the Penal Code, Chief Justice Yong Pung How had said inNg Chiew Kiat v Public Prosecutor[2000] 1 SLR 383that nine months’ imprisonment and caning is warranted for acts of molest involving intrusion of the victim’s private parts. However, this was not restricted to cases where there was an intrusion of the victim’s private parts. InToh Kok How v Public Prosecutor[1995] 1 SLR 735, the accused was sentenced also to nine months’ imprisonment and three strokes of the cane for using his knuckles to press onto the right breast of the victim. On the other hand, Yong CJ also said inNg Chiew Kiatthat there were offences under s 354 which were relatively minor for which a fine would suffice. Ultimately, the appropriate sentence would depend on the nature of the act of molest as well as the circumstances surrounding the commission of the offence. 21 In the case before me, the accused committed the offence under s 354 by pushing his penis between the thighs of C, a male sibling, until the accused ejaculated. 22 I took into account the fact that the accused was in a position of responsibility and trust vis-à-vis the victims but he was not their parent and he was of a young age. I also took into account the fact that he had sexually abused not one but three of his siblings in various ways on various occasions over a number of years. 23 In the circumstances, I sentenced the accused as follows: (a) On the third charge under s 377 of the Penal Code, seven years’ imprisonment (b) On the fourth charge under s 376(2) of the Penal Code, ten years’ imprisonment and 12 strokes of the cane (c) On the fifth charge under s 376(2) of the Penal Code, ten years’ imprisonment and 12 strokes of the cane (d) On the sixth charge under s 377 of the Penal Code, seven years’ imprisonment (e) On the seventh charge under s 354 of the Penal code, eight months’ imprisonment and three strokes of the cane. 24 The sentences of imprisonment for the fourth and fifth charges were to run consecutively from the date of arrest i.e 2 August 2002. The other sentences were to run concurrently with the consecutive sentences. The aggregate term of imprisonment was 20 years. The number of strokes of the cane was limited to ten strokes in view of s 230 of the Criminal Procedure Code. The caning was to be done with a light rattan as provided under s 229(4) of the Criminal Procedure Code."
    }
}