{
    "case_title": "Re Econ Corp  Ltd",
    "ncitation": "[2003] SGHC 288",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "1          Econ Corporation Limited (the Company) is a public company.  It was incorporated on 1 April 1975 under its original name Econ Piling Pte Ltd and changed to its present name on 25 September 2000, when it converted to a public company limited by shares. 2          The Company is a wholly owned subsidiary of a public company listed on the main board of the Stock Exchange of Singapore Limited (SGX), namely Econ International Limited (EIL). EIL owns more than 40 associates and or subsidiaries.  The parent company and its numerous subsidiaries and associates are commonly referred to as the Econ group.  The principal business of the Company is that of general contracting; it spearheads the engineering and construction arm within the Econ group and accounts for 87% of the group's turnover. 3The Company holds an unlimited class A1 licence for both general building and civil engineering as well as an unlimited L6 licence for piling, awarded by the Building and Construction Authority of the Ministry of National Development.Over the years, the Company has undertaken numerous projects in the public and private sectors including water reclamation works and MRT (mass transit railway) lines for government bodies and other employers.As at November 2002, the Company was ranked the second largest local contractor.The Company's current directors are Chew Tiong Kheng, Joseph Sin and Geoffrey Yeoh Seng Huat.These three (3) persons also hold directorships in EIL (together with Heng Chiang Meng and Michael Hwang) as well as in other companies within the Econ group.According to information disclosed in the Explanatory Statement which accompanied the scheme of arrangement documents presented to the Company's creditors on 27 May 2003, the chairman holds 38,597,000 shares or 6.96% in EIL.He is also a creditor of the Company for the sum of $314,000.Joseph Sin and Geoffrey Yeoh are also shareholders of EIL albeit holding considerably less shares (0.09% and 0.19% respectively) than the chairman. 4          The 1997 Asian financial and economic crisis had a severely adverse effect on the construction industry in Singapore as a whole, and on the Company in particular.  The Company incurred significant losses on its projects in India and it faced cash flow problems in Singapore which were exacerbated by losses accumulated over the years, resulting in the Company's liabilities ($228m) exceeding its assets.  Currently, the Company is facing demands from its trade and other creditors (such as banks) which it is unable to meet.  I should add that EIL is in the same predicament.  Proceedings have been commenced against the Company in the Subordinate Court and High Court by various creditors, arising out of its inability to meet its outstanding obligations. 5          On 9 April 2003, the Company held an emergency meeting with its bankers and other financial institutions, to discuss options to ensure the continued financial viability of the Company and the Econ group.  Its main bank creditors unanimously agreed that the Company should seek protection from its creditors, to ensure that its efforts to restructure its debts would not be thwarted. 6          At a subsequent meeting held on 10 April 2003 with members of the informal steering committee that had been established (from amongst its principal creditors) to represent the Company's creditor banks/financial institutions, those present agreed on the salient features that should be incorporated in the proposed restructuring scheme for the Company's debts. 7          The Company applied to court on 25 April 2003 for leave to present a scheme of arrangement of debts, under s 210(10) of the Companies Act Cap 50 (the Act).  Rubin J refused to grant the application as he was of the view that the Company had not set out any details of the scheme it intended to propose to creditors.  However, the Company was granted leave to make a further application. 8          Subsequently, with the assistance of KPMG Business Advisory Pte Ltd (KPMG), the Company drew up a preliminary scheme to be proposed to its creditors as follows:- (i)         payment of cash of $5,000 to each creditor or 3% of an approved claim whichever is higher; (ii)        issuance of 7 year redeemable loan stock up to 25% of the approved claim of each participating creditor; (iii)       issue of EIL shares up to 72% of the approved claim of each participating creditor, subject to the approval of the relevant authorities. (Hereinafter the above scheme will be referred to as \"the original scheme\"). 9          On 2 May 2003, the Company applied to court for leave to convene a meeting for the creditors to consider and if deemed fit, to approve the original scheme.  Kan J granted the Company leave on 7 May 2003 to convene a meeting pursuant to s 210(10) of the Act, which he directed must be held on or before 18 June 2003; he further granted a stay of all proceedings against the Company. 10        On 27 May 2003, the Company tendered a formal scheme of arrangement to its unsecured creditors (with an Explanatory Statement) in which some changes were made to the original scheme; participating creditors would now receive the following:- (i)         cash of $4,000 or 3% of the participating creditor's approved claim whichever is the higher, with payment being stretched over 24 months from the effective date of sanction by the court; (ii)        redeemable stock comprising 15% of their approved claim within 3 months from the effective date, to be redeemed at the end of 3 years; (iii)       EIL shares at $0.09¢ per share up to 47% of the approved claim amount within 12 months from the effective date. (Hereinafter the above scheme will be referred to as \"the revised scheme\"). 11        The Company filed notice of a meeting on 17 May 2003 and on 17 June 2003 it convened a meeting (the meeting) of its unsecured creditors, to consider the revised scheme.  Of the 967 creditors who were present at the meeting, 858 voted in favour and 96 voted against, the revised scheme.  The value of the admitted claims of those who voted in favour was $176,902,724.87 or 89%.  I should point out that the actual scheme approved by the Company's supporting creditors departed somewhat from the revised scheme.  The terms of the approved scheme read as follows:- (i)         creditors whose claims were less than or equal to $4,000 would be paid in full within 12 months whereas other creditors would be paid the equivalent of 3% of their claims within 24 months; (ii)        loan stocks redeemable in 3 years amounting to 15% of the participating creditors' claims will be issued within 3 months after the scheme is sanctioned by the court.  However, if the cash flow does not allow for redemption of loan stocks, the shortfall will be met by the issuance of EIL shares; (iii)       creditors will be issued with EIL shares (within 12 months of the scheme becoming effective) amounting to 47% of their claims at a value of S$0.09¢ per share (after a share value reduction exercise to bring EIL's share value to S$0.01¢ per share) in consideration for which the participating creditors would irrevocably and absolutely assign their rights in respect of 82% of their claims to EIL.  The shares issued would be subject to a moratorium on trading over a staggered period (up to 12 months). (Hereinafter the above scheme shall be referred to as the \"approved scheme\", the full details [together with the minutes of the meeting] are to be found in the 2ndand 3rdaffidavits filed by Geoffrey Yeoh on 26 June and 15 July, 2003 respectively). 12        As the percentage (89%) of approving creditors far exceeded the 75% requirement under s 210(3) of the Act, the Company applied to court by way of summons in chambers 3935 of 2003 (the application) on 26 June 2003 for inter alia, sanction of the scheme.  After one adjournment (which I granted at the Company's request to enable it to file a reply to opposing creditors' affidavits), the application came on for hearing again before me.  Lengthy arguments were canvassed by the Company as to why the application should be granted and, by opposing creditors as to why it should not.  The Company inter alia, accused the opposing creditors of being 'sour grapes' and having hidden agendas whilst the opposing creditors alleged that the Company's conduct as well as the approved  scheme, lacked bona fides and transparency and, certain creditors who attended the meeting should have been separately classed from other unsecured creditors.  Suffice it to say, it was one of the most hotly contested applications of this nature that has come before this or any, court.  I should also mention that after the meeting, five creditors (3 of whom were represented by Wong Partnership) who had supported the approved scheme changed their minds.  These were: Goldbell Engineering Pte Ltd, Goldbell Leasing Pte Ltd, Chua Chuan Leong & Sons Pte Ltd, Degussa Pte Ltd and W.R. Grace Singapore Pte Ltd.  Conversely, six (6) creditors who had initially opposed the scheme changed their minds after the meeting and decided to support the same; they were Allington Engineering & Trading Pte Ltd, C & P Marine Pte Ltd, Jack Huat Engineering & Construction Pte Ltd, Lim Kim Huat Building Construction Pte Ltd, MKH Building Construction Pte Ltd and Plus Link Environmental Pte Ltd.",
        "The issues in dispute": "13        The Company through its executive director Geoffrey Yeoh (Yeoh) filed seven (7) affidavits.  Some of his affidavits were filed in support of the application while others were a response to affidavits filed by opposing creditors.  I should point out that Yeoh's 5thaffidavit was filed after the adjourned hearing with a direction by me that it should address the opposing creditors' complaint that there had been a lack of information specifically on three (3) issues, which formed the main bone of contention between the parties:- (i)         the losses incurred by EIL; (ii)        the transfer of the Company's machinery to Tat Hong Heavy Equipment Pte Ltd (Tat Hong); (iii)       the transfer of the Company's machinery to any other creditors/third parties since 1 January 2003. Since both parties' arguments addressed the above issues in considerable detail, it would be appropriate to elaborate on the items at this stage.",
        "(i) EIL's losses": "14        The opposing creditors (in particular Supermix Concrete Pte Ltd (Supermix) and Jurong Readymix Concrete Pte Ltd [Jurong]) complained that at the meeting, the management deliberately withheld information on EIL's losses from the attendees.  Had the creditors known of the whopping losses, those who voted for may well have voted against, the approved scheme.  Yeoh however denied there had been non-disclosure.  He pointed out that in his first affidavit (filed on 2 May 2003), he had exhibited (inGYSH-6)the accounts of the Econ group (which would include the Company's) as part of the Annual Report of EIL for 2001-2002.  Further, in his 4thaffidavit (filed on 24 July 2003) he had exhibited (inGYSH-7) the financial statements dated 28 June 2002 of the Company for the financial year ended 31 March 2002; the Company's profit and loss statement showed losses of $7,924,603 as against $1,067,309 for 2001. 15        The opposing creditors had referred to press reports by EIL giving profit warnings: in the Business Times of Friday 27 December 2002 (where the Econ group said its losses had increased to $32m from $6m in the previous year with EIL's share being $19.6m [after losses of $50.7m from the previous year]) and, in the Straits Times of 1 July 2003 where it was reported that EIL's losses had risen 985% from $12.8m to $138.9m since its last financial year.  At the meeting itself, the creditors were informed that the Company's losses approximated $123m for the year ended 31 March 2003.  In fact, when EIL's full year financial results were released on 30 June 2003 (seeGYSH-2in Yeoh's 5thaffidavit), the losses had ballooned to $138m.  Since the Company is the main operating arm of the Econ group, the losses of EIL were largely attributable to the Company's operations since EIL does not hold any construction licence or undertake any construction projects itself.  Yeoh explained that contrary to the creditors' allegation, the full year's accounts of EIL were not withheld.  They had to be and were, reviewed by the auditors on Friday 27 June 2003 before release.  As such, the accounts could not be presented at the meeting held ten (10) days earlier.  On the next business day after 27 June 2003, namely on Monday 30 June 2003, EIL's financial statements were released to the public.",
        "(ii) transfer of machinery/equipment to Tat Hong": "16        At the meeting, the Company had confirmed to the attendees that there had been no sale of equipment to Tat Hong. After the meeting, the solicitors for Supermix wrote to the Company's solicitors to inquire if there had been any sales to Tat Hong since 30 October 2002.  In their solicitors' reply dated 30 June 2003 the Company revealed it had entered into three (3) sale and purchase agreements with Tat Hong, dated 8 August 2002, 20 May 2003 and 31 May 2003 respectively. 17        Yeoh explained that the August 2002 sale was prompted by the Company's need for funding of ongoing projects.  In order to generate cash, the Company sold 18 units of crawler cranes to Tat Hong for $3.48m which payment was received from Tat Hong by 10 October 2002.  The Company also sold another 10 units of used cranes to Tat Hong and then leased them back from Tat Hong Plant Leasing Pte Ltd (THPL) by five (5) agreements, the earliest being dated 16 August 2002 and the latest being dated 1 May 2003. 18        A director of Tat Hong namely Ng Sun Ho (Ng) filed an affidavit after the adjourned hearing, to answer allegations contained in an affidavit filed by a director of Supermix, Goh Siew Huat (Goh).  Tat Hong had supported the approved scheme at the meeting.  Ng explained that for the sale and purchase agreement dated 8 August 2002, Tat Hong had granted the Company buy-back options for all the machinery sold thereunder.  However, the options lapsed by reason of the Company's default in paying rental under the `lease agreements.  Consequently, Tat Hong terminated the leases.  The parties then entered into a fresh lease agreement dated 1 May 2003. 19        Ng revealed that full payment was made by Tat Hong to the Company, save that a set-off was effected for current and future rentals due to THPL under the lease agreements, as well as for the ancillary costs of repair for the machinery sold by the Company to Tat Hong, under the agreements dated 20 May and 31 May, 2003.  Ng deposed that no set-off was made for rental which had accruedpriorto May 2003.  Ng denied the opposing creditors' allegation that Tat Hong had bought the machines from the Company at an undervalue.",
        "(iii)  transfer of machinery/equipment to parties other than Tat Hong": "20        In his 5thaffidavit, Yeoh revealed that an arrangement similar to THPL's was entered into with the Company's main earthworks contractor Kok Tong Construction Pte Ltd (Kok Tong).  Nine (9) units of used equipment were sold to Kok Tong on 1 April 2003 for $1,019,200 but the payment was set-off against amounts owed to Kok Tong who had threatened to stop work on the Company's ongoing projects otherwise. 21        Besides Kok Tong, the Company sold equipment/machinery to other third parties which details were furnished (seeGYSH-20) in Yeoh's 5thaffidavit.  As with THPL and Kok Tong, Yeoh revealed that the company did not receive payment from some of the buyers as the sale proceeds were set-off against amounts owed to these buyers; otherwise they had threatened to stop work on or cease supplying materials to the Company for, ongoing projects.  One such  purchaser wasTiong Woon Crane & Transport Pte Ltd (Tiong Woon) who bought a crawler crane for $46,800/- on 15 January 2003.  Counsel (Winston Kwek) for Supermix informed the court that in the course of discovery (from the Company/its solicitors) after the meeting, his colleague found that the Company's original invoice no. 02/02093 for this sale differed materially from the copy exhibited in Yeoh's 5thaffidavit.  The exhibited copy (at p 324) contained the following handwritten words:- (1)        Contra AP invoices -- $24,417.50 (2)        Contra amt due from EIPL to Tiong Woon -- $22,382.50 whereas in the original invoice, the following handwriting was overridden on the  typed words: (1)        S$30,000 to offset against payment due Tiong Woon (2)        Balanced to issue cheque to Econ Corporation Limited soonest. 22        Although the Company had intended to use the net sale proceeds of $1.8m received from Tat Hong as cash distribution to its creditors under the approved scheme, it could not as the monies were urgently required for funding current projects.  Yeoh deposed that the receipt and disbursement of funds from Tat Hong were monitored by KPMG  (the Company's business advisor and proposed scheme administrator), to ensure that no preferential payment was made to any unsecured creditor whose debt ought to be covered by the approved scheme.",
        "The Company's case": "23        Counsel urged the court not to follow the decision inWah Yuen Electrical Engineering Pte Ltd v Singapore Cables Manufacturers Pte Ltd[2003] SGCA 23, relied on heavily by the opposing creditors; the Company set out in a schedule attached to its Reply Submissions the differences (12) between the facts here and inWah Yuen's case.  Equally,Re Halley's Departmental Store Pte Ltd[1996] 2 SLR 70did not apply.  The Court was reminded that an overwhelming majority (in value) of unsecured creditors had voted in favour of the approved scheme.  Counsel alleged that the opposing creditors (in particular Supermix and Jurong) were driven by collateral motives, which is elaborated on below. 24        Supermix had obtained judgment against the Company on 3 April 2002 (in Suit No. 1510 of 2002) for $1,500,439.37.  On 4 April 2003, Supermix through their solicitors served a statutory demand on the Company under s 254 of the Act.  On 24 April 2003, Supermix took out garnishee proceedings against the Housing Development Board, Public Utilities Board (PUB) and Land Transport Authority for their judgment debt.  The garnishee order nisi against PUB was made absolute on 6 May 2003.  In Yeoh's 6thaffidavit, he charged that Supermix made the nisi order absolute without informing the court that the Company had an application under s 210 of the Act (coupled with a stay of all proceedings) fixed for hearing on 7 May 2003, which application had been served on them on 5 May 2003.  Instead, Supermix surreptitiously appliedex-parteto the Assistant Registrar on 6 May 2003, to move forward the hearing date for PUB to Show Cause from 9 to 6 May 2003; they applied to make the order nisi absolute that day itself. 25        The Company's application to set aside the Garnishee Order Absolute was dismissed on 23 May 2003.  On appeal to a judge in chambers, the Company's appeal was allowed by Lai Kew Chai J on 8 July 2003 and the Garnishee Order Absolute was set aside.  At a further hearing on 21 July 2003 granted at Supermix's request, Lai J rescinded his earlier orders and allowed the Garnishee Order Absolute to stand on condition Supermix furnished a banker's guarantee to the Company for the sum of $1.505m garnished from PUB.  As at 21 August 2003, Supermix had failed to furnish the security ordered by Lai J.  Supermix stood to gain if the approved scheme was scuttled -- they would be able to keep the garnished amount, which would otherwise be paid to creditors, under the cash distribution portion of the approved scheme.  Hence, their opposition to the application.  The court was told that Supermix adopted inconsistent stands.  In relation to hearings to set aside the Garnishee Order Absolute, it argued that the Company was not insolvent.  It canvassed the opposite argument for the application and contended that the Company should be wound up instead.  I should mention that Supermix has a pending claim against the Company in Suit No. 1464 of 2002, for damages for breach of contract, which Supermix has estimated to be in the region of $5m. 26        Notwithstanding their objections to the scheme of arrangement, counsel pointed out that representatives (their finance manager and solicitor) of Supermix asked no questions at the meeting.  It wasafterthe meeting that their solicitors raised several queries in their correspondence with the Company's solicitors. 27        The Company informed the court that four (4) named creditors (including Jurong) and'other unsecured creditors'placed an advertisement in the Straits Times of 21 May 2003 inviting creditors to attend a meeting on 23 May 2003 to consider the proposed scheme of the Company.  The Company was told by some friendly attendees that the 23 May meeting was to orchestrate opposition to the company's proposed scheme.  The Company's request for the identities ofthe other unsecured creditorsinvolved was not answered by the opposing creditors who were also silent as to what transpired at the meeting.  Relying on the following passage from the New Zealand Court of Appeal's decision inCommissioner of Inland Revenue v Chester Trustee Services Ltd[2003] 1 NZLR 395(at para 58): …The wishes of creditors will be given weight only if they have reasons which relate to their position as creditors, and are not motivated by collateral purposes. the Company argued that the objections of the opposing creditors should be disregarded as they had ulterior motives. 28        The Company submitted that the criteria to be satisfied before a court sanctions a scheme of arrangement is that laid down in the following passage fromBuckley on the Companies Act(11 ed vol. 1 at pp 473-474):- In exercising its powers of sanction the court will see, first, that the provisions of the statute have been complied with, second, that the class was fairly represented by those who attended the meeting and that the statutory majority are acting bona fide and are not coercing the minority in order to promote interests adverse to those of the class whom they purport to represent, and thirdly, that the arrangement is such as an intelligent and honest man, a member of the class concerned and acting in respect of his interest, might reasonably approve. The court does not sit merely to see that the majority are acting bona fide and thereupon to register the decision of the meeting, but, at the same time, the court will be slow to differ from the meeting, unless either the class has not been properly consulted, or the meeting has not considered the matter with a view to the interests of the class which it is empowered to bind, or some blot is found in the scheme. The above comment was made in relation to s 425 of the English Companies Act which is the equivalent of our s 210. 29On 4 June 2003,the Company had met certain creditors (including Jurong and United Central Engineering Pte Ltd) to answer queries they had raised.  Further, the Company also held one-to-one dialogue sessions with creditors when asked and where the need arose. 30        The third test propounded inBuckley'snamely whether 'the arrangement contemplated is a reasonable arrangement such as that which a man of business would reasonably approve'  (seeRe English, Scottish and Australian Chartered Bank(1893) 3 Ch 385) was also satisfied.  InRe Alabama, New Orleans, Texas & Pacific JunctionRailway Company(1891) 1 Ch 213, the Court of Appeal held (on a petition presented under s 2 of The Joint Stock Companies Arrangement Act 1870):- In exercising the power of sanctioning a scheme of arrangement conferred on it by the Act, the Court will not only ascertain that all the statutory conditions have been complied with, but will also consider whether the class of creditors summoned to the meeting was fairly represented by those who attended, and whether the statutory majority who approved of the scheme were acting bona fide or were seeking to promote interests adverse to those of the class whom they professed to represent, and generally whether the arrangement is such as a man of business would reasonably approve. 31        Whether a scheme is reasonable is a question of degree which is determined by reference to other alternatives.  If the application was not granted, the only other alternative would be a compulsory liquidation of the Company in which scenario creditors would obtain a return of 3% instead of what they would receive (65% return) under the approved scheme.  Moreover, under the approved scheme, the debts owed by the Company to its related companies (as well as to the chairman) would be subordinated; this would not be the case if the Company was wound up, as all unsecured creditors would rankpari passu. 32        It is not a valid argument against sanction by the court, that the approved scheme differed from the revised scheme, taking the cue fromRe Ferro Constructions Pty Ltd2 ACLR 18 where, the Australian court approved a scheme of arrangement even though there were differences between the scheme approved at the meeting and the scheme as originally considered by the court, when it was asked to authorise the meeting of creditors being called.",
        "Classification of creditors": "33        The Company submitted that the proper test on classification of creditors is that formulated by Bowen LJ inSovereign Life Assurance Co v Dodd[1892] 2 QB 573where, in relation to s 2 of the Joint Stock Companies Arrangement Act 1870 he said (at p 583): The word \"class\" is vague, and to find out what is meant by it we must look at the scope of the section, which is a section enabling the Court to order a meeting of a class of creditors to be called.  It seems plain that we must give such a meaning to the term \"class\" as will prevent the section being so worked as to result in confiscation and injustice, and thatit must be confined to those persons whose rights are not dissimilaras to make it impossible for them to consult together with a view to their common interest (emphasis added). Applying the dissimilarity test to the facts of this case, the contingent creditorswhose rights were similarto those of the other creditors, should not be separately classed, as contended by the dissentients. 34        Further support for the above proposition was to be found in the Hong Kong case ofRe Industrial Equity (Pacific) Ltd[1991] 2 HKC 364where, in considering and granting a petition for approval of a scheme of arrangement under s 166 of the territory's Companies Ordinance Cap 32 (equivalent to our s 210), Nazareth J overruled the objections of a minority shareholder in the subject company and held: It is the different rights of shareholders and creditors, rather than theirinterests, that determines whether or not they constitute different classes.  The meaning of a class of members in s 166 is confined to those persons whose rights are not so dissimilar as to make it impossible for them to consult together with a view to their common interest; in other words, it was to be determined by dissimilarity of rights, not dissimilarity of interests. Nazareth J had cited with approvalRe Alabama New Orleans Texas & Pacific Junction Railway(supra) as well asSovereign Life Assurance Co v Dodd(supra). 35        The Company pointed out that its contingent creditors are essentially issuers of performance bonds for its on-going projects.  CitingRe Hawk Insurance Co Ltd[2001] 2 BCLC 480, counsel submitted that, unsecured creditors whose liabilities are contingent, does not in itself mean that they must necessarily be classified differently from other unsecured creditors; it depends on whether the contingent creditors have different rights under the scheme.  InRe Butterworth Products & Industries Sdn Bhd[1992] 1 MLJ 429, the Malaysian High Court held that a contingent creditor was no different from judgment creditors, as their respective rights under s 176 (equivalent to our s 210) of the Malaysian Companies Act 1965 were not dissimilar. 36        Consequently, the objections of Supermix, that the Company's contingent creditors are interested in the continued existence (as opposed to liquidation) of the Company cannot be a valid ground to constitute the contingent creditors a different class.  The fact that an overwhelming majority of creditors voted for the scheme is also evidence that they were interested in preserving the Company, not in its liquidation. 37        The Company argued that the second contention of Supermix, that the inter-company creditors should be separately classed is also not sustainable, relying on the decision of the Hong Kong appellate court inUDL Argos Engineering & Heavy Industries Co Ltd[2001] 1184 HKCU 1.  The same submission was made by the Company (citingRe BTR plc[2000] 1 BCLC 740) in relation to the other argument put forward by Supermix -- that creditors for claims of less than $4,000 should be separately classed on the basis they would obtain full recovery of their debts.  Accepting Supermix's argument would mean that there would be many different classes of creditors, given that creditors whose claims exceed $4,000 have varying rates of recovery. 38        The Company submitted that even if the contentions of Supermix were accepted by the court, the fact remained that the scheme still had the approval of the requisite majority of creditors under s 210 of the Act.  Counsel suggested that the court take the \"discount\" approach adopted inRe Jax Marine Pty Ltd[1967] 1 NSWLR 145, which was reiterated inUDL Argos Engineering & Heavy Industries Co Ltd.  Adopting the \"discount\" approach, the court could adjust the votes to take into account those creditors who had changed their minds after the meeting.  In that regard, the value of the claims of 6 creditors who had decided to support the scheme were about $1.9m as against less than $35,000 for the claims of 5 creditors who had decided to oppose the scheme, after the meeting.  Even if the court were to disregard the claims of contingent creditors, the votes of the remaining creditors who supported the approved scheme would still exceed 75%.  In Yeoh's 5thaffidavit (see exhibitGYSH-22), the Company set out various scenarios in which certain categories of creditors were excluded from voting on the revised scheme.  One such scenario (schedule F) showed the exclusion of: (i) creditors owed less than $4,000; (ii) contingent creditors except those whose liabilities had crystallised; (iii) inter-company debts and (iv) HSBC's claim of $1.5m.  The votes in favour of the revised scheme still exceeded 75%.  I should add that Wong Partnership put forward their own scenarios (6) which showed that had the creditors been classified in accordance with their submissions, the percentages of votes in favour of the approved scheme ranged from 70% to 78%. 39        The Company argued that the complaint of non-disclosure was unfounded.  In any event, the test is not transparency but whether the creditors had sufficient information on which to make an informed decision. Moreover, there was factually no non-disclosure. The timing of the release of information pertaining to EIL's losses had been adequately explained in Yeoh's 5thaffidavit.  In any case, the information when released did not have a material impact on the price of EIL's shares, which hovered around $0.03¢ to $0.04¢, before and after, the meeting, whereas under the approved scheme the share price was fixed at $0.09¢. 40        The impugned transactions with the Tat Hong group of companies were not preferential in nature but necessitated by the Company's financial position.  Besides THPL, Sprayed Concrete Services Pte Ltd (Sprayed Concrete) as well as Jurong had received payments on outstanding invoices before the meeting; Sprayed Concrete had threatened to stop work on its tunnelling sub-contract otherwise.  The payments to Sprayed Concrete were raised and addressed, at the meeting.  Despite the payments, Sprayed Concrete opposed the scheme of arrangement.  If Supermix did not object to the payments made to Jurong, then it cannot contend that similar payments made to other creditors were preferential in nature.  In any case, such payments were closely monitored by KPMG since April 2003; there has been no suggestion of bad faith or incompetence on their part. 41        The allegation of Supermix, that Tat Hong changed its mind on  opposing  the scheme of arrangement by reason of the Company's payments, was incorrect.  The first two (2) sale and purchase agreements with Tat Hong were dated 8 August 2002 and 20 May 2003, which dates werebeforethe creditors met amongst themselves andbeforethe meeting.  It did not make sense for Tat Hong to have had a change of heart between 23 May and 17 June, 2003; they had consistently supported the Company's scheme of arrangement. 42        Counsel defended the Company's attempts to persuade opposing creditors (such as Thyssen Hunnebeck Singapore Pte Ltd) to change their votes, after the first adjourned hearing of the application.  He saw nothing wrong in the Company's making efforts to garner support for the approved scheme.  It should be contrasted with the dissentients' efforts to gather support to oppose the scheme of arrangement, by calling a meeting of creditors on 23 May 2003, and refusing to disclose what transpired thereat. 43        Even if the impugned transactions were considered dubious, the Company urged the Court to focus on the benefits of the approved scheme.  If the application is not granted, there would not be a viable alternative to enable the Company to continue as an on-going concern.  There would be no legitimate advantage for the creditors should the Company be wound up instead.",
        "The submissions of the opposing creditors": "44        There is no doubt that Supermix would stand to gain (to the tune of $1.505m) should the application be refused.  I had told their counsel therefore that it would be difficult for me to believe/accept that Supermix (apart from their own interests) had altruistic motives in opposing the application.  However, that does not mean that I should totally disregard/reject the arguments they canvassed. 45        I start by referring to the arguments put forth by the opposing creditors (9) represented by Wong Partnership.  As some of their objections to the approved scheme have been dealt with earlier in the Company's submissions, I will only focus on those arguments not referred to previously. 46        Counsel made much of the fact (as did counsel for Supermix) that the Company had refused to give discovery/full discovery in response to Jurong's letters and the letters of Rajah & Tann, written before and after the meeting.  As I am of the view that letterspostthe meeting are academic on the issue of informed consent, I will turn my attention to Jurong's letters writtenbeforethe meeting.  The writer of both letters was Jurong's director Lena Tan, who subsequently filed an affidavit to confirm that certain creditors had changed their minds about supporting the approved scheme. 47        In their letter dated 6 June 2003, Jurong questioned the Company on the profit-sharing arrangements regarding its joint venture projects with Lum Chang Building Contractors Pte Ltd (Lum Chang) and NCC International AB.  Jurong queried the Company on contingent liabilities of $121m due on performance bonds.  Jurong wanted to know to what extent novation of the joint venture contract to Lum Chang (in return for 10% management profit to the Company from the project and in exchange for full funding by Lum Chang), would affect the provisions for contingent liabilities.  Questions were also asked about the Company's trade debts ($17.5m), remaining jobs on its order books and why all creditors were classified together.  Jurong further expressed unhappiness over the 'haircut' creditors were being asked to accept in exchange for shares in EIL, not to mention the unattractive pricing of the shares to be issued; Jurong complained that the pricing seemed to suggest that the Company was putting the interests of shareholders of EIL ahead of those of its creditors. 48        Jurong's second letter to the Company dated 13 June 2003 was sentafterthe Company had met with its representatives on 6 June 2003. I note from this second letter that the Company did answer Jurong's queries but Jurong wanted more information arising from the Company's answers.  Jurong also asked for confirmation that since 7 May 2003, the Company had not paid any unsecured creditor on their claims.  I note from the minutes of the meeting (GYSH-6of Yeoh's 2ndaffidavit) that Yeoh answered Jurong's new query as follows:- I forgot to mention one thing. There was a letter sent to us.  There was a question of whether the directors have made special payments to any \"unsecured creditor\" after the filing date.  To our knowledge, no preferential payments were made.  We have worked with KPMG who were monitoring the payments in accordance with the scheme.  We made conscious efforts to ensure that this was done. 49        The Company replied to Jurong on 16 June 2003 and that where it had not answered Jurong's queries, it would do so at the meeting.  At Jurong's request, their letter dated 13 June 2003 as well as the Company's reply, were displayed on the notice board at the entrance to the venue for the meeting. 50        At the meeting Yeoh invited questions from attendees after he had briefed creditors on the revised scheme and the reasons therefor. The question and answer session continued after lunch.  The vote was taken after Yeoh and KPMG's representative had responded to queries from Jurong (Lena Tan). 51        Wong Partnership (Mr Yeo) pointed out that under cl 7.1 of the revised scheme, the issue of EIL shares is conditional upon EIL entering into a scheme of arrangement to be proposed.  Consequently, information pertaining to EIL's financial health was highly material. Yet at the meeting, it wasaftervoting was over that creditors were told (by KPMG) that EIL itself would require a scheme.  He rejected Yeoh's excuse that the information on EIL's accounts was price-sensitive.  If so, the Company should have adjourned the meeting until after the public release of EIL's accounts. 52        The court's attention was drawn to proceedings in Adm in Rem No. 149 of 2003 in which ASL Shipyard Pte Ltd sued inter alia, the owners (Econ Corporation International Limited [ECIL]) of the mtKeasin 41(the vessel).  Yeoh had filed an affidavit in that suit wherein he deposed that the Company is the third mortgagee of the vessel, for a loan of $12.388m extended to ECIL on the vessel and seven (7) other vessels.  Yeoh's affidavit exhibited a statutory mortgage as well as a deed of covenants, both dated 9 May 2003.  Counsel viewed the mortgage transaction as highly suspicious, bearing in mind that seven (7) days earlier, the Company had filed these proceedings on the basis it was insolvent.  Yet, the loan cannot be traced in the Company 's financial statements for the years ending March 2002 or 2003.  Further, at the meeting, the Company produced its balance sheet which showed a \"nil\" amount for the item \"net amount due from related companies\". 53(a)    Mr Yeo contended that three (3) of the four (4) machines sold to Tat Hong (under the sale agreement dated 31 May 2003) for $155,000 were at an undervalue of $65,000 as Toplis & Harding (exhibitGSH-7in Goh's 4thaffidavit and para 12) had valued those machines at $220,000.  Counsel criticised the Company's conduct in obtaining a valuation report (from Dovebid (S) Pte Ltd) as at 13 August 2003afterthe first adjourned hearing and after opposing counsel had raised the issue.  It seemed to suggest that the Company did not have a valuation done at time of sale.  The machines were sold under the agreement dated 20 May 2003 for $2m whereas Tat Hong had insured the cranes for $2,520,000, a difference of $500,000.  Apart from getting the machinery at a bargain price, Tat Hong leased them back to the Company at $55,500 rent per month under an agreement dated 26 May 2003, and two (2) days later, the purchase price was offset against rental (for May and June 2003) due to THPL. (b)        The dissentients questioned the Company's rationale in selling the machines in August 2002, leasing them all back from Tat Hong for 12 months at about $72,400 rent per month, having those lease agreements terminated on 6 May 2003 and entering into a fresh rental agreement on 9 May 2003 at a  higher rental of about $110,000 per month.  The timing of the 2003 sales was also highly suspect.  Mr Yeo voiced his suspicions that the sale agreement of 20 May 2003 may have been backdated.  He further questioned Yeoh's omission in not disclosing the rental documents in his 5thaffidavit; they were exhibited in Ng's affidavit.  I should add that the cranes sold to Tat Hong are  the subject of a pending claim by Gammon Skanska Pte Ltd, who contended that the machines had been charged to them by the Company, pursuant to a subcontract.  He alleged the Company'scosy arrangementwith Tat Hong enabled the latter to buy cranes at an under value and to squeeze the Company for higher rental when it could not pay a lower rental. 54        Counsel for Ssangyong (Kuah Boon Theng) pointed out that that as at 6 May 2003 Tat Hong said it was owed $600,000.  The Company's debt to THPL (as at 16 May 2003) was stated to be $872,495 despite the purported set-off of  May and June 2003 rental due to THPL against the sale price.  The increase in the Company's debt would suggest that no genuine set-off was effected. 55        In his 5thaffidavit, Yeoh justified the Company's sales on the basis that two (2) of the cranes for boring machines were more than 20 years old, whilst the boring machines (2) had become excess to the Company's requirements due to the sale of the two (2) cranes.  Their counsel submitted the sales were to free assets in order to get much needed cash for the Company. 56        The opposing creditors had also questioned the sale of equipment to Kok Tong pointing out that the total sale price ($1,019,200) was set-off against Kok Tong's outstanding invoices (since February 2001) which total was coincidentally the same (seeGYSH-20at pp 322 and 368/9 of Yeoh's 5thaffidavit) as the sale price. 57        Goh of Supermix had ascertained from Sprayed Concrete (one of those creditors who were paid) that the Company settled its outstanding invoices up to 16 April 2002 only. 58        With regard to their contention that contingent creditors should be separately classed from other creditors, the opposing creditors submitted that the rights of the former are indeeddissimilar from those of the other unsecured creditors.  Mr Yeo pointed out that unless the performance bonds are called upon, no liability arises against the bond issuers.  Over time, as projects were completed, these contingent liabilities would be reduced progressively.  This can be seen from Yeoh's 1staffidavit where, the figure of $115m stated to be  contingent liabilities, was reduced to $71m in the audited accounts for year 2003 exhibited in his 5thaffidavit and further reduced to about $40m in Yeoh's 4th(exhibit GYSH-9) affidavit where about $31m in guarantees/bonds had been released by end July 2003.  As the contingent creditors may never be liable at all, they should not be classed with creditors who were out-of-pocket, having provided services or materials to the Company.  The same argument on separate classification was canvassed for related party debts. 59        Mr Yeoh thought it suspicious, that HSBC's performance bond (of $10,646,790 in favour of the Public Utilities Board) was released a dayafterthe meeting, suggesting that the timing could not have been coincidental.  HSBC is one of the creditors who supports the approved scheme. 60        The dissentients also brought the court's attention to the claim of Plus Link Environmental Pte Ltd (Plus).  Plus (who was one of the creditors who opposed the scheme of arrangement initially but subsequently changed its mind) had filed a Proof of Debt in the amount of $396,656.42, which Proof the company admitted for the purposes of voting at the meeting.  However, in its own application to court (in Originating Summons No. 1125 of 2003) for s 210 scheme of arrangement, Plus had disclosed the Company as owing only $65,702. The Company's (unsatisfactory) response to this discrepancy was, it has no control over what a creditor puts in a Proof of Debt. 61        As for the vast discrepancy between the unaudited and audited accounts of the Company, even if the Company's explanation that it could not pre-announce the results of its parent company's accounts before release to SGX on 30 June 2003 is to be believed, it had not explained why the two sets of figures were so far off the mark, bearing in mind the Company's accounts comprised a substantial portion of EIL's accounts.  If the Company could not release price-sensitive information on EIL's accounts to its creditors on 17 June 2003, it should have applied to court for an extension of time on Kan J's order and, postpone calling a meeting of its creditors to a dateafter18 June 2003; the creditors would not have objected.",
        "Wah Yuen Electrical Engineering Pte Ltd v Singapore Cables Manufacturers Pte Ltd": "62        In the light of the heavy reliance placed by the dissentients onWah Yuen's case and the Company's contention that it does not apply, it would be appropriate to look at the case in some detail at this juncture. 63        Like the Company, Wah Yuen Electrical Engineering Pte Ltd (Wah Yuen) was a construction company; well known for building condominiums.  However, by the time (April 2003) it appealed against Rajendran J's refusal to sanction its proposed scheme of arrangement, it had become insolvent.  In January 2002, Wah Yuen applied to court under s 210 of the Act for leave to convene a meeting of its creditors for the purpose of considering a scheme of arrangement. 64        At the meeting of creditors that was convened thereafter, Wah Yuen tendered a revised scheme of arrangement.  It envisaged an investor injecting funds into the company for distribution to participating creditors in exchange for an assignment of their admitted claims to the investor.  As in our case, claims by related parties and directors (termed 'the related parties' by the Court of Appeal) were fully subordinated to those of the rest of the participating creditors.  Coincidentally, the court-appointed Scheme Administrator was also from the KPMG group (KPMG Corporate Structuring Services).  KPMG opined that Wah Yuen's estimated realisable value vis-á-vis each creditor in a liquidation scenario was 0.4% as opposed to 15% under the scheme.  The creditors' meeting was adjourned to enable creditors to consider the revised scheme. 65        At the adjourned meeting, of the 92 creditors present and voting, 75 (constituting 81.52%) voted for and 17 voted against, accepting the revised scheme.  Wah Yuen then applied to court for sanction of the revised scheme. 66        The application was opposed by Singapore Cables Manufacturers Pte Ltd (the respondents). It contended that the votes of Wah Yuen's three (3) related creditors should be disregarded for the purpose of determining whether the statutory majority under s 210(3) of the Act had been satisfied. In any case, Wah Yuen had not been sufficiently forthcoming with information that was necessary for a meaningful evaluation of the proposed scheme. 67        Rajendran J accepted the respondents' arguments and refused to sanction the revised scheme. Wah Yuen appealed.  After considering the following (5) issues:- (a)         whether the admitted claims of the company's related parties should be excluded or disregarded in determining whether the statutory majority under s 210(3) of the Act has been satisfied; (b)         whether the 36 creditors who stood to recover more than 15% of their claims should have been sub-divided into separate classes for voting purposes; (c)         whether the company had been less than forthcoming in furnishing the information requested by Singapore Cables, and, if so, whether the court should refuse to sanction the scheme on the ground that such conduct evidenced bad faith on the part of the company in promoting the scheme; (d)        whether the scheme was a fair and reasonable one; and (e)         whetherRe Halley's Departmental Store Pte Ltdshould be followed the Court of Appeal dismissed Wah Yuen's appeal. 68        In relation to issue (a), the appellate court noted that the amounts owed to Wah Yuen's directors went up dramatically between 1999 and the second creditors' meeting, from $161,188 to $4,316,254.10.  As for issue (b), the Court felt that the respondents' argument to sub-divide the creditors into separate classes based on minor differences in the percentages they stood to recover, was unrealistic and impractical.  Relying on the authority cited by the Company (UDL Argos Engineering & Heavy Industries Co Ltd v Li Oi Lin & Ors, see para 37supra), the appellate court said (at para 21): ……..If Singapore Cables were correct, at least 12 classes of creditors would have to be given separate meetings, each of which would be attended by anything from 1 to 14 creditors.  Just as the court must be careful not to empower the majority to oppress the minority by allowing the company to put everyone in the same class, it must be careful not to enable a small minority to thwart the wishes of the majority by fragmenting the creditors into small classes. 69        The Court of Appeal however added (at para 23): What did cause us more concern however, was whether Wah Yuen should at least have put the 14 who stood to recover 100% of their claims, as well as the three whose claims were subordinated to the rest of the creditors, into separate classes for voting purposes.  Prima facie, it seemed to us that the rights of these two groups of creditors were so dissimilar from the remaining creditors that they could not sensibly consult together with a view to their common interest.  We did not find it necessary, however, to come to a definitive view on this because Wah Yuen's lack of transparency over its related party debts was sufficient reason not to sanction the proposed scheme of arrangement. 70        Holdings no. 3 and 4 in the judgment encapsulates the Court of Appeal's views on issue (c): 3           It was an independent principle of law that the creditors should be put in possession of such information as was necessary to make a meaningful choice. Although the related parties' votes were counted for purposes of determining whether the statutory majority was reached, the court treated the votes with reserve because the appellant had not been sufficiently transparent about the circumstances in which the related party debts were incurred.  The court also refused to approve the scheme because the creditors had not been provided with enough information to assess whether the returns under the proposed scheme were in fact greater than what they could expect in a liquidation;4           Since the respondent had already established that the creditors had not been able to meaningfully assess the proposed scheme, it was not necessary for it to also prove that the relate parties had acted in bad faith. The Court distinguishedRe Halley'scase (para 23supra) where Selvam J declined to sanction the company's scheme of arrangement because it was supported by a major creditor whom he treated with reserve, as the creditor was a substantial shareholder in the debtor company and both companies had common directors/shareholders.  It would therefore be in their common interest to act in concert and support the scheme. 71        In the concluding paragraph of its judgment, the Court of Appeal said:- ……As discussed above, it is an independent principle of law that the creditors must be put in a position to make an informed choice.  On the face of it, the proposed scheme was certainly an attractive one because it offered the creditors an estimated realisable value of 15% as opposed to 0.4% in a liquidation scenario.  The creditors were assured of payment because the funds came from an external investor as opposed to the struggling company itself.  The related parties even went so far as to give the other creditors priority by subordinating their claims to theirs.  Unfortunately, the creditors were not in a position to ascertain whether the scheme was in fact as attractive as it appeared because of Wah Yuen's lack of transparency. 72        The Company had taken pains (in their written submissions) to point out the differences which their counsel said, distinguishedWah Yuenfrom its case. I accept that the following are some of the main differences:- (i)          the current directors of the Company hold less than 8% of the shares in EIL; (ii)        the Company is not a family-owned company; (iii)       the executive directors are not related to one another; (iv)        the related companies in the Econ group are related by reason of corporate shareholdings of EIL, not due to personal shareholdings of the directors; (v)         after the approved scheme is sanctioned, the Company's creditors would become its majority shareholders through their 60% shareholding in EIL. (vi)        the debts owed to related companies are equally compromised and assigned to the new shareholders of EIL; (vii)       unlike the respondents Singapore Cables, Supermix stood to gain if the approved scheme was scuttled. However, there are also numerous similarities between this case andWah Yuen, which I shall elaborate on below.",
        "The decision": "73        The tests applicable for sanction of such schemes of arrangement as spelt out in the cases cited on the Company's behalf are not in dispute; we are concerned with their application here.  Having considered the correspondence as well as all the affidavits filed, I am of the view that the complaint of the opposing creditors that, the Company's conduct lacked transparency and that it withheld material information, is not unfounded.",
        "(i) the price of EIL shares at $0.09¢ under the approved scheme": "74        At the outset of the hearing, Mr Yeo had rightly conceded that the higher price ($0.09¢ per share) at which EIL shares would be issued to his clients and other unsecured creditors as against the prevailing market price ($0.03¢-$0.045¢) was a commercial decision which has no bearing on whether the court should sanction the approved scheme.   If the majority of creditors choose to accept the price plus the issuance of loan stock based on 15% of their approved claims, all the opposing creditors would be bound thereby to accept the decision of the majority, even if it meant taking a 'haircut' twice, as Lena Tan of Jurong contended.",
        "(ii) late disclosure of EIL's audited accounts": "75        Far more serious was the opposing creditors' allegation that the Company withheld information of EIL's extensive losses and, had that been known at the meeting, the voting would have gone the other way.  Yeoh had denied there was wilful non-disclosure.  He asserted that the Company did its best to provide the best financial update it could, given the time constraints imposed by the court as well as the fact that the accounts of EIL were not finalised as at the date of the meeting.  Even if I accept Yeoh's explanation that the information was price-sensitive as at 17 June 2003, the Company could/should have applied to court for an extension of time, to hold the meeting,after27 June 2003.  The creditors could hardly have objected.  Further, as the Company’s activities account for 87% of the Econ group’s turnover and its performance would greatly affect EIL financially, there is merit in the opposing creditors' argument that Yeoh could have been more accurate in the financial forecasts he made to the attendees at the meeting. 76 (a)   There were disturbing features in the accounts of the Company.  In the unaudited balance sheets exhibited in Yeoh’s 1staffidavit, debts due to related parties were stated to be $25m.  In Yeoh’s 2ndaffidavit, that liability had increased to $33m.  In his 1staffidavit, the Company's liabilities exceeded its assets by $42.2m, in his 2ndaffidavit that deficit had widened to $70.886m, in a matter of 7 weeks.   In his 3rdaffidavit (which Yeoh filed to supplement his 2ndaffidavit), related party debts were revised to $28.8m.  The audited accounts of the Company for 31 March 2003 shown in Yeoh’s 5thaffidavit (p 124 ofGYSH-5) reflected about $5m owing from related parties/companies.  The corresponding figure for 2002 was $20m.  The opposing creditors rightly questioned this drastic swing of $30m in a matter of 12 months.  Conversely, the assets of the Company were reduced by $100m between 2002 and 2003.  Whilst revenue remained the same for 2002-2003, the cost of sales increased by $69m or 35.6%. (b)        In the Company's unaudited accounts for 2003, there was nothing owed to EIL.  In the audited accounts the 'nil' figure changed to $23m.  I was also not satisfied with the Company's explanation that the $12.388m loan extended to ECIL and secured by a mortgage on the vessel mtKeasin 1,were an accumulation of prior loans made and not advanced on or about 9 May 2003 and, that it had been factored into the audited accounts for 2002 and 2003. (c)        Had the Company released its 2003 audited accounts to the creditors, they would have been in a better position to question any discrepancies in the figures when compared with those in the unaudited accounts.  Consequently, Yeoh's argument that Jurong and other opposing creditors did not question him is not a valid answer to the creditors’ complaint.  Questions were not asked because the creditors could not as, they lacked the necessary and relevant  information to do so.  Mr Hwang had submitted that Supermix was not entitled as of right to the documents its solicitors had requested of the Company, as this is not an exercise in discovery.  I respectfully disagree.  The opposing creditors are entitled to know the state of the Company's finances as well as that of the parent company (EIL) before they decide whether the returns under the scheme of arrangement proposed are in fact greater than what they can expect to recover in a liquidation.",
        "(iii) sale of machinery/equipment to Tat Hong and other buyers with set-off arrangements": "77        I cannot fathom the Company’s rationale for disposing of its equipment  to Tat Hong, leasing them back, having those leases terminated for failing to pay the rent and entering into fresh leases at even higher rental which it can ill afford.  It simply makes no commercial sense.  It is noteworthy that Yeoh did not, in his 5thaffidavit, exhibit copies of the rental agreements made with THPL; they were found in Ng's affidavit filed on Tat Hong's behalf; I do not believe the omission was accidental.  The machinery sold to Tat Hong under the agreement dated 20 May 2003 appeared to be at an undervalue of $500,000 (based on Tat Hong’s own insured value), while those sold under the agreement dated 31 May 2003 were at an undervalue of $65,000.  Until pressed by the opposing creditors, Yeoh did not furnish the information found in exhibitGYSH-20of his 5thaffidavit, which disclosedallthe assets/machinery the Company had disposed of, since January 2003. 78        The fact that the Company procured a valuation report only after the sales to Tat Hong certainly suggests that the opposing creditors’ complaint is justified.  In his 5thaffidavit (para 41) Yeoh deposed that KPMG were satisfied that the sale priceswere at a fair value, relying on a valuation report (GYSH-7) which wasnotexhibited; if he meant that done by Dovebid dated 13 August 2003, it is irrelevant.  With respect, KPMG arenotconstruction machinery valuers or appraisers but accountants/financial advisers, I wonder how Yeoh can rely on their expertise in this regard. 79        The set-off arrangements made with Tat Hong, Tiong Woon and Kok Tong, of the prices of machinery sold by the Company, against their outstanding claims are highly questionable.   Even if the reason for such preferred payments is, that the Company was at the mercy of suppliers and subcontractors who demanded cash payment in exchange for current services or deliveries of materials (such as concrete in the case of Sprayed Concrete), there was no justification for the Company to allow Tat Hong to set-off its purchase price for some machinery, against rental due toanother(albeit related) company THPL.  Indeed, the entire leasing arrangement with THPL smacks of an elaborate charade between the Company and Tat Hong, to enable Tat Hong to recover as much of their outstanding claims as possible, before they participate in the approved scheme.  In the case of Kok Tong, the Company even allowed it to set-off theentirepurchase price for the machines it bought, against the Company’s total indebtedness ($1,019,200) sinceFebruary 2001.If indeed (as Yeoh asserted in his 5thaffidavit )KPMG monitored the receipt and disbursement of funds to ensure that no preferential payment was made to any unsecured creditor whose debt ought to be covered by the scheme,then KPMG would appear to have been remiss in this regard.  It also belies Yeoh's assurance to the creditors at the meeting, that the directors had not made any special payments to any unsecured creditorafter the filing date.  He did not reveal that such payments (by way of set-offs) had been madebeforethe Company filed these proceedings, assuming that the suspicion of Mr Yeo, that the sale agreement with Tat Hong dated 20 May 2003 was backdated, is unfounded.",
        "(iv) classification of creditors": "80        It is remarkable that the same line of argument raised by Wah Yuen in their appeal was made by the Company.  Mr Hwang had argued (para 38supra)that even if the court accepted the opposing creditors' arguments that different creditors should be separately classified, the threshold under s 210(3) of the Act would still have been crossed.  Wah Yuen's counsel had submitted (by producing calculations) that the company would still have obtained the requisite 75% vote, even if related parties had voted on less favourable terms or, the quantum of related party debts had remained unchanged.  In this regard, I would like to refer to the following extract from the judgment:- 17         We were left unimpressed by this submission.  In our opinion, it was always possible to cobble together some hypothetical scenario to show that the percentage requirements in s 210 could have been met. Those scenarios, however, were just that — hypotheticals — and they did nothing to allay the real concerns that the changes in the related party debts had provoked. I fully endorse the above comment.  There is no certainty that the creditors would still have voted in the way they did (even allowing for those creditors who had changed their minds/votes after the meeting) had they been apprised of the latest  audited accounts of the Company/EIL and, had they (apart from those owed $4,000 or less) known of the sale and set-off arrangements made privately with Tat Hong, Tiong Woon, Kok Tong and the like.  I would imagine some if not all of the creditors, would have been outraged by the special treatment accorded to selected creditors of the Company.  The discrepancy between the amounts in its Proof of Debt and Plus' own submission to court (in Originating Summons No. 1125 of  2003) suggests that, votes of creditors based on values in Proofs of Debt accepted by the Company may not be accurate. What if it was not an isolated incident?  The fact that Plus was one of the creditors who changed its mind and decided to support the Company's scheme of arrangementafterthe meeting, lends credence to the opposing creditors' complaint that some amongst them may have been 'bought' by the Company. 81        By parity of reasoning with the Court of Appeal's decision inWah Yuen'scase, I would accept the argument of the opposing creditors that creditors whose claims are $4,000 or less, should have been classed separately.  These creditors had interestsdissimilarto the others.  They had priority and would be paid in full whereas in a winding-up, their claims would rankpari passuwith those of other unsecured creditors. 82        Similarly, I am of the view that contingent creditors should also have been separately classed for voting purposes; I disagree with the contrary view of the Malaysian court inRe Butterworth Products & Industries Sdn Bhd(para 35supra).  The liabilities and rights of contingent creditors would not arise unless and until calls are made on the performance bonds they issued on the Company's behalf.  Even then, they would not be creditors unless the Company defaults on the indemnities it would have issued to these creditors in turn.",
        "(v) no viable alternative to the scheme of arrangement?": "83        The company had indicated that liquidation with a realisable return of 3%, would be the only other alternative should the scheme of arrangement not be sanctioned, for which the return would be 65%.  In the light of my findings above particularly on the state of the Company's accounts, I am a little sceptical of this prediction.  I would also refer to the following passage from the judgment inWah Yuen'scase: 37         In any case we withheld our approval for the proposed scheme of arrangement because we found that the creditors were not in a position to assess the fairness and reasonableness of the scheme.  At the appeal hearing, counsel for Wah Yuen emphasised repeatedly that KPMG had assessed the company's estimated realisable value vis-a-vis each creditor to be 15% under the scheme, as opposed to 0.4% in a liquidation scenario.  In our opinion, this was an attempt to borrow the respectability of the KPMG name to clothe the figures with an aura of authority.  In reality, the estimated realisable value vis-a-vis each creditor in a liquidation scenario was not reliable because it was based on unaudited information………. ……………………………. This meant that creditors could not determine whether the returns under the proposed scheme of arrangement werein factgreater than what they could expect in a liquidation. It may well be that a proper verification of the related party debts would reveal that the related party debts did exist to the extent currently represented.  In such a scenario, the returns to the creditors in a liquidation would be larger than that currently estimated. It was also possible that Wah Yuen could have made preferential payments to its related parties. These payments could be clawed back in a liquidation and channelled to other creditors. I should point out that liquidation is not the only other alternative if the application is not granted.  Mr Yeo gave notice that the opposing creditors intend to apply to court to place the Company under judicial management pursuant to s 227A of the Act.",
        "Conclusion": "84        In the light of the number of disquieting features I have highlighted surrounding the Company's scheme of arrangement and, the fact that the 89% vote at the meeting may not have been obtained with the informed consent of the unsecured creditors who participated in the same, I decline to sanction the approved scheme. 85        Consequently, the application is dismissed.  I shall hear parties on the issue of costs on another day, after they have applied to the Registrar for a mutually convenient date."
    }
}