{
    "case_title": "Than Stenly Granida Purwanto v Public Prosecutor",
    "ncitation": "[2003] SGHC 200",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The facts": "2          The appellant is an Indonesian national. Sometime early in January 2003, he befriended a fellow Indonesian, one “Sri Pashan”, while he was on a social visit to Singapore. Sri Pashan offered the appellant a job, which was to assist him (Sri Pashan) in purchasing electronic goods in Singapore for resale in Jakarta, Indonesia. The appellant showed interest in the proposition and gave his contact details to Sri Pashan. Subsequently, in mid January 2003, Sri Pashan contacted the appellant in Jakarta and they, together with four other Indonesians, planned to come to Singapore to make fraudulent purchases at shops in Singapore. It was agreed that the appellant would receive 10% of the profits from the resale of the illegally procured items. 3          On 27 January 2003, the appellant and his five accomplices arrived in Singapore. The next day, Sri Pashan handed several counterfeit credit cards to the appellant and instructed him to use these cards to carry out the planned purchases. The appellant agreed and kept the cards. 4          Pursuant to their conspiracy to cheat, the appellant and his accomplices embarked on a frenzied shopping spree. Their first fraudulent purchase was made on the night of 28 January 2003 at Mustafa Centre located at 145 Syed Alwi Road. There, the appellant’s accomplice, one “Ali”, committed the offence of cheating by using a counterfeit credit card to purchase a gold bracelet valued at $1,445.14. Both the appellant and Ali collected the jewellery and left the shop. 5          The following day, on 29 January 2003, the appellant, Sri Pashan, Ali and one “Fransica” continued their shopping spree at two shops in Sim Lim Square located at 1 Rochor Canal Road. At M/s Active Foto & Electronics, the appellant committed three offences of cheating by making three purchases: a Sony video camera valued at $2,652, another Sony video camera worth $2,545 and a Panasonic projector priced at $2,920. On all three occasions, the appellant used a counterfeit Mastercard credit card in the name of Kevin L to pay for the items. 6          The group then proceeded to Dynasty Audio and Camera Pte Ltd, another electrical goods shop in Sim Lim Square. There, the appellant and Ali picked out a Nikon digital camera valued at $1,559, which was again paid for by the appellant using the same counterfeit credit card. 7          That same evening, the four of them went down to IMM Building and attempted to make another set of fraudulent purchases there. However, the appellant’s luck finally ran out and he was arrested at Aspial Corporation when the police were called in by a vigilant storekeeper. At the time of arrest, a total of 12 counterfeit credit cards were found on him.",
        "The appeal against sentence": "8          The appellant appealed against his sentence on the basis that it was wrong in law and manifestly excessive. In support of this, counsel for the appellant advanced the following grounds: (a)  The district judge erred in finding: (i)         that the offences were grave and serious in nature;(ii)        that a deterrent sentence was warranted in the circumstances; and(iii)       that there were several aggravating factors in this case; (b)  the district judge had failed to take sufficient account of the mitigating factors in the appellant’s favour; and (c)the sentence was out of line with previous similar cases. 9          It is well established that an appellant court will generally not interfere with the sentence passed by a trial court unless it is satisfied that there was some error of fact or principle, or that the sentence imposed was manifestly excessive or unjust:Tan Koon Swan v PP[1986] SLR 126,Gan Hock Keong Winston v PP[2002] 4 SLR 299. With this principle in mind, I turned to the appeal at hand.",
        "Whether the district judge erred in concluding that the offences were grave and serious in nature": "10        Counsel for the appellant submitted that the district judge, in coming to the conclusion that the offences committed were graveper se, had failed to appreciate the varied range of culpabilities and degree of seriousness of the offences under consideration. It was further submitted that a sentencing court, being cognisant of the gravity of the particular offence committed, should have regard to the “trite common law principle of parsimony” and select the least severe sentencing option that is commensurate with the gravity of that specific offence. 11        I was of the opinion that these arguments were without merit. It was clear from the judgment below that the gravity of the offence was but one of the factors that the district judge took into account in sentencing the appellant. A sentencing court has the discretion as well as the obligation to take into account all the circumstances of the case. This obviously includes the severity of any offence, which can generally be inferred from the stiff sentences prescribed by the law. Furthermore, I was of the view that the appellant’s concern that the district judge had failed to appreciate the distinct merits of his case was unfounded. It was apparent from the grounds of judgment that the sentence of 6½ years was reached only after a thorough examination of all the evidence before the court. 12        I was similarly unconvinced by counsel’s argument regarding the applicability of the so-called common law principle of parsimony. I noted that this principle has never been expressly articulated by our courts. In my view, a sentencing judge’s discretion should not be unduly fettered to selecting the least severe sentencing option. The more pertinent consideration is whether the judge has arrived at a fair and just sentence, having carefully assessed all the evidence before him. I was of the opinion that this was the case here.",
        "Whether the district judge erred in concluding that a deterrent sentence was warranted in the circumstances": "13        Counsel for the appellant also contended that the district judge had erred in concluding that a deterrent sentence was justified in the circumstances, especially when the prosecution had failed to address the court on sentence. I did not agree with counsel’s submission. As I noted inMeeran bin Mydin v PP[1998] 2 SLR 522, a deterrent sentence is granted entirely within the court’s discretion. I reiterate that there is no requirement in law for the prosecution to request for deterrence before a court may consider it in the exercise of its discretion. 14        Furthermore, I was of the view that the district judge had properly exercised his discretion in this case. He was mindful of the fact that offences involving the fraudulent use of credit cards involved deception of financial institutions and business establishments. In view of the potential injury that such offences may cause to Singapore’s credibility as a reputable financial centre, I was likewise drawn to the conclusion that a deterrent sentence was in order here.",
        "Whether district judge erred in concluding that there were several aggravating factors in this case": "15        Another contention raised by counsel was that the district judge erred in considering the following aggravating factors in sentencing: First, as mentioned above, the serious nature of the offences committed by the appellant. Secondly, the fact that the offences were committed deliberately and with great skill, which indicated that the appellant operated as part of a sophisticated international criminal syndicate. Thirdly, the appellant’s active role in the execution of the credit card scam. And lastly, the substantial amount involved in all the offences. Involvement of an international criminal syndicate 16        Counsel for the appellant challenged the district judge’s finding that the appellant was part of an international criminal syndicate capable of committing credit card fraud on a large scale and reasonably skilled at avoiding detection. Having examined the evidence before me, I came to the same conclusion as the district judge. Several factors supported this observation. First, the criminal conspiracy was devised in Indonesia, while the offences were committed in Singapore. Secondly, the offences displayed a high level of organisation and meticulous planning characteristic of such organised crimes. An example of this was the distinct roles played by the appellant and the other accomplices in the commission of the offences – Sri Pashan supplied all of the counterfeit credit cards, while the appellant and the other accomplices made fraudulent purchases using these cards by posing as genuine tourists or customers. Thirdly, the group moved with much speed and efficiency. In less than 24 hours (the first purchase was made on 28 January 2003 at 8.37pm while the last purchase was made before the appellant was arrested on 29 January 2003 at 3.27pm), they chalked up nine successful purchases totalling $14,630.46 without detection. I have no doubt that they would, in all likelihood, have continued their fraudulent activities at IMM Building and other places if not for the vigilance of the storekeeper there. For these reasons, I declined to disturb the district judge’s finding in this regard. Appellant’s active role 17        Another consideration for the district court was the appellant’s active role in the commission of the offences. Counsel sought to downplay the appellant’s involvement, contending that he was a mere assistant to Sri Pashan. Although the appellant was not the mastermind, I was unable to accept that his participation was minor. On the facts, it was clear that the appellant had greater responsibilities than the other accomplices. As pointed out by the prosecution, the appellant always took part in the selection of the items to purchase, and presented the counterfeit credit cards for payment in all but one of the nine successful purchases. Further, the appellant was given the task of safekeeping all the counterfeit credit cards, which explained why a total of 12 such counterfeit cards were found on him at the time of his arrest. 18        I also found it significant that the appellant had a sizeable stake in the outcome of the scam. As mentioned above, the understanding among the accomplices was that the appellant would receive 10% of the profits from the resale of the items. I noted that this was a substantial amount, given that the criminal partnership had at least six members. Losses incurred 19        The district judge also considered the substantial value involved in all the offences ($14,630.46 including the charges taken into consideration) as an aggravating factor in this case. Counsel for the appellant contended that this amount was small and that it should instead have been regarded as a mitigating factor in the appellant’s favour. I rejected this argument as frivolous. The losses incurred, which would have to be borne either by the shop owners or the credit card issuers, were by no means insignificant. This was especially so since the losses were incurred within a short span of less than 24 hours. 20        In light of my observations above, I was of the view that the district judge was justified in taking into consideration all of these aggravating factors in sentencing the appellant.",
        "Whether the district judge failed to take sufficient account of the mitigating factors in the appellant’s favour": "21        Counsel for the appellant drew the court’s attention to several mitigating factors which he felt were not sufficiently considered by the district judge: (a)        that the appellant had pleaded guilty to the charges at the first opportunity; (b)        that he did not take the said items nor obtain any benefits; (c)        that he is a foreigner and will be deported and banned from re-entry into Singapore and hence, no longer pose a threat to society; and (d)        that he is the sole breadwinner of the family and that undue hardship will be caused to the family as a result of his long imprisonment. 22        Once again, I was of the opinion the appellant’s contentions were unmeritorious. In my view, the district judge gave due consideration and accorded the proper weight to each and every factor listed above. The appellant failed to raise any novel issues with respect to any ground of appeal. This would have been sufficient for me to dismiss the appellant’s arguments. Nevertheless, for the sake of completeness, I have briefly dealt with each of the factors listed above. Appellant’s plea of guilt 23        The district judge was mindful of the fact that the appellant had pleaded guilty at the very first opportunity. While this is generally acknowledged as having some mitigating value, an offender’s plea of guilt has to be balanced against other considerations, such as the dominant public interest consideration of general deterrence:PP v Tan Fook Sum[1999] 2 SLR 523. Moreover, as noted by the district judge, in respect of the charge of possession of counterfeit credit cards, the appellant was caught red-handed with the forged credit cards upon his arrest and whilst attempting another fraudulent card transaction. It is settled law that in such a case, the discount for a plea of guilt would have to be less:Wong Kai Chuen Philip v PP[1990] SLR 1011. That the appellant had not obtained any benefits from the commission of the offence 24        Counsel for the appellant maintained that the court should give more consideration to the fact that the appellant had not benefited from the commission of his crimes. As I had earlier noted inLai Oei Mui Jenny v PP[1993] 3 SLR 305, this was a mitigating factor that carried little weight. The fact that the appellant had missed out on collecting his share of the profits because of his timely arrest should not necessarily warrant a reduction in sentence. As noted by the district judge, it would be more precise to state that, had the appellant obtained any monetary benefits from his criminal enterprise prior to his arrest, this would undoubtedly have been an aggravating factor against him. That the appellant would no longer pose a threat to society once deported from singapore 25        In my opinion, the fact that the appellant would be banned from re-entering Singapore after his release from prison was not a legitimate mitigating factor. The dominant public interest in this case calls for general deterrence, in order to provide for effective protection of the public against credit card fraudsters. Potential hardship to appellant’s family 26        It is well settled that any hardship caused to the offender’s family arising from his imprisonment has little mitigating value except in very exceptional or extreme circumstances:Ng Chiew Kiat v PP[2000] 1 SLR 370. In this case, the appellant has failed to draw attention to any exceptional circumstances that warrant special consideration by the court.",
        "Whether the sentence was out of line with previous similar cases": "27        In sentencing the appellant, the district judge referred to two cases for guidance:Ong Tiong Poh v PP[1998] 2 SLR 853andPPv Yun Chau Swe(MA 298/ 2002, unreported). Substantial imprisonment terms (of up to two years on each charge) were meted out in both cases and in my view, they serve to highlight the tough stance taken by the courts against such offenders. 28        Counsel for the appellant relied on the same case ofPP v Yun Chau Sweand two other unreported casesPP v Chin Fong Kiew(DAC No 53692/ 2002 & Ors) andPP v Wong Kian Chung(DAC No 0440/2003 & Ors) that deal with the offence of possession of forged valuable security to argue that the appropriate sentence for the appellant should be less than five years’ imprisonment. In all three cases, a sentence of two years’ imprisonment was imposed for each charge under s 474 read with s 467 of the Penal Code for the possession of forged valuable security. Instead of supporting the appellant’s contentions, these three cases reinforced my opinion that the sentence meted out by the district judge was within acceptable limits set out by the law and hence not manifestly excessive. The slightly higher sentence imposed on the appellant in this case was justifiable, in light of the aggravating factors highlighted above and the greater number of additional charges that were taken into consideration in sentencing. In this case, a total of 11 similar counts of conspiracy to possess counterfeit credit cards and five similar counts of conspiracy to cheat were taken into account for the purpose of sentencing. I have already stated inPPv Mok Ping Wuen Maurice[1999] 1 SLR 138 that this would justify the imposition of longer custodial sentences than would otherwise be imposed. 29        In any case, it bears repeating that, while past cases are no doubt useful guidelines, they are not by any means binding on sentencing courts. Indeed, care must be taken to ensure that they do not hamper a trial judge’s discretion to pass sentences in accordance with all the facts of a particular case:Gan Hock Keong Winston v PP(supra). The issue to be determined by an appellate court is whether the sentence passed by the trial judge was manifestly excessive given the particular facts of the case, and not whether it was out of line with previous similar cases.",
        "Conclusion": "30        For the reasons above, I dismissed the appeal against sentence and upheld the decision of the district judge. Appeal against sentence dismissed."
    }
}