{
    "case_title": "Anwar Siraj and Another v Ting Kang Chung and Another",
    "ncitation": "[2003] SGHC 64",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The case for the applicants": "3          The Applicants are the owners of a house at 2 Siglap Valley.  They contracted with the Second Respondent to demolish and reconstruct the said house for the sum of $1.2 million.  The agreement was signed on 30 December 1999 and the completion date for the project was 9 January 2001.  The contract was the standard one used by the Singapore Institute of Architects (“SIA”) and provided that in the event of a dispute, it shall be referred to arbitration.  If the parties to the arbitration could not agree on an arbitrator, the President of the SIA would appoint one for them.4          A dispute did arise around July 2001 and the Second Respondent referred it to arbitration.  The President of the SIA subsequently appointed the First Respondent as the arbitrator.5          The First Respondent convened a meeting of the parties on 11 March 2002.  At that meeting, directions were given for the filing of the Points of Claim, Points of Defence and Counterclaim, Points of Reply and Defence to Counterclaim.6          On 14 March 2002, the arbitrator attended a site meeting with the parties and the alleged defects were pointed out to him.  By 11 June 2002, the pleadings as directed were filed.  The Applicants then applied to file a Statement of Reply regarding the Counterclaim and were permitted to do so.  The parties were also directed to exchange documents by 25 June 2002.7          In their pleadings, the Applicants claimed that the alleged shoddy workmanship caused delamination of tiles, water seepage, flooding of the basement, dampness on the walls and other serious defects.  As a result of these alleged problems, they emphasised in a letter written by their solicitors to the arbitrator on 12 June 2002 that the hearing should be conducted as early as possible.  Although the arbitrator had stated in his letter of 10 June 2002 that he would convene a meeting on a convenient date, nothing was heard from him after the Applicants’ solicitors’ letter of 12 June 2002.  They then wrote to the arbitrator again on 31 July 2002 and on 15 August 2002 to ask that a meeting be convened.  They did not receive any response from him.  The convening of such a meeting for directions was becoming critical as the Second Respondent refused to carry out any rectification works unless directed to do so by the arbitrator.  The Applicants listed various other correspondence to the arbitrator requesting meetings on different matters to which no response was obtained.  These letters covered the period between 12 June 2002 (when the letter mentioned above was sent) and 7 November 2002 (when letters were sent enquiring about the specific issues on which the arbitrator was seeking expert advice and the name of the expert in question).8          The arbitrator then fixed a meeting on 29 August 2002.  One of the directions given that day was that the Second Respondent serve on the Applicants the documents set out in its list of documents.  The Applicants had already filed their bundles of documents with the arbitrator.  The Second Respondent had yet to do so.  The Applicants were anxious to have the documents so that they could file their witnesses’ affidavits of evidence-in-chief.  In the meantime, the situation in their house was worsening.  Although they volunteered to accompany the Second Respondent’s solicitor to his office for inspection of the documents, the said solicitor said he did not have the documents with him.  The Applicants were thus compelled to buy the documents set out in the list so as to avoid delay.  The Applicants submitted that the failure by the arbitrator to insist that the Second Respondent serve all the relevant documents at no cost to the Applicants was glaring and reflected very badly on his competence.9          At the said meeting of 29 August 2002, the Applicants also applied for security for costs as their counterclaim was for almost $1 million while the Second Respondent’s claim against them was for only about $300,000 and the company’s paid up capital was only in the region of $400,000.  The solicitors for the Second Respondent objected and wanted a formal application taken out and supported by affidavit evidence.  Both Respondents ignored the informal nature of arbitration proceedings.10        At any rate, such a formal application was lodged.  It was heard on 23 September 2002.  “Just not to be outdone and more out of pique”, the Second Respondent also took out an application for security for costs against the Applicants.  The decision on both parties’ applications was adjourned by the arbitrator.11        On 30 October 2002, the Applicants wrote to the arbitrator to enquire about the outcome of the said applications.  They were surprised to receive a letter dated 31 October 2002 from him stating that he had faxed the parties a letter on 11 October 2002 as neither party had received that letter.  The letter of 11 October 2002 read:“Reference the hearing on 23.9.2002.Please be informed that I will need to consult an expert to advise on the quantum of a security    for costs and damages.The fees chargeable by the expert is to be shared equally by the claimants and the respondents.”It appeared to the Applicants that the arbitrator had decided on awarding security for costs and damages and needed advice only on the quantum.12        They were further puzzled by another letter dated 30 October 2002 from the arbitrator in which he stated:“I should clarify that I intend to appoint an expert to advise me in relation to procedural matters relating to the arbitration, which would include the security for costs application that has been made before me.”The Applicants wrote to the arbitrator to ask him whether counsel could assist him in any difficulty he may have on procedural matters, drawing his attention to the fact that expert assistance was sought only on specific issues. They were concerned that the costs of the arbitration would increase with the addition of an expert.13        The arbitrator replied on 13 November 2002 stating he had not previously decided to award security for costs and damages and had not delegated this duty to another person.  He also stated he had since made his decision on the applications and had sent notice of the decision to the parties without having consulted anyone on the applications.  He said he intended to consult the expert solely on procedural issues as and when the need arose.  The expert in question was Richard Tan, his solicitor in the present application before the Court.  In another letter of the same date, the arbitrator set out his decision on the applications as follows:“With regard to the application for security for cost and damages, having heard the parties’ arguments, I rule and direct that the parties’ applications are to be dismissed with costs in any event.”14        In the Applicants’ view, the arbitrator was not diligent or competent as he displayed complete lack of knowledge of arbitration law and practice.  He also did not understand the principles on awarding costs as he ought not to have awarded any costs upon dismissing both applications.  His order on costs would mean that one party may have to pay the other’s costs if the latter’s bundles of documents filed and time spent on the matter exceeded the former’s.15        The Applicants argued that the fact that the arbitrator had not set out his qualifications and experience as an arbitrator meant that he possessed none.  If he had attended any of the courses on arbitration law and practice conducted by the Singapore Institute of Arbitrators and the London based Chartered Institute of Arbitrators, he would not have committed the blunders complained of nor displayed such “utter incompetence”.16        The Applicants also alleged that the arbitrator had shown “definite bias” in the Second Respondent’s favour.  He allowed the Second Respondent to file its pleadings and its list of documents outside the prescribed time frame without asking the reasons for the delay and without penalising that party in costs.  When that party wanted its expert to be present at the site inspection, the Applicants asked to be satisfied about his credentials before allowing him access into their house.  However, the arbitrator said he saw no objection to his presence without hearing the Applicants out.  This was despite a circular sent by the SIA to all architects to warn them about persons masquerading as experts and demanding access to properties.  The Applicants’ architect’s request for the curriculum vitae of the so-called expert was not met until very much later.17        As with the correspondence, the Applicants also set out in a schedule the matters they complained of against the arbitrator and which they said showed a definite bias on his part.  Those matters included the complaints about the delay in providing documents, about the arbitrator allowing the objection to audio-taping of the preliminary meeting, allowing the Second Respondent to attend the proceedings without having paid its share of the arbitrator’s fee, “escalating” the formality of the applications for security for costs and allowing the Second Respondent’s solicitors’ request for an adjournment to read the Applicants’ solicitors’ submissions on the said applications when 15 minutes would have sufficed. The Applicants also complained that the arbitrator fixed the arbitration hearing for only the three days (instead of five) indicated by the Second Respondent without asking why the other two days were not suitable for that party and without attempting to arrange for another two days of hearing.  He also allowed allegedly fictitious documents to be included in evidence without hearing the Applicants’ objections.  Further, the arbitrator concealed the fact that he had received a copy of a written judgment of Lee Seiu Kin JC in a related application which was faxed to him by the Second Respondent.",
        "The case for the first respondent": "18        The First Respondent is the current President of the SIA.  He was appointed the arbitrator here on 12 December 2001 and held a preliminary meeting on 11 March 2002 at which directions for the filing of pleadings were given.  After the exchange of pleadings, he issued directions by a letter dated 10 June 2002 on the exchange of the list of documents by 25 June 2002.  That date was subsequently extended to 9 July 2002.  Around this period, the parties to the arbitration started exchanging correspondence concerning the manner in which the Second Respondent had prepared its list of documents.  Some letters were sent to the arbitrator setting out the Applicants’ dissatisfaction with the list but no specific application for relief was contained in those letters.19        A second preliminary meeting was held on 29 August 2002.  Further directions were given for the Second Respondent to provide copies of all its documents to the Applicants upon payment of photocopying charges.  This would have taken care of the Applicants’ complaints about the difficulty in identifying the documents in the Second Respondent’s list.  The Applicants’ solicitors’ letter the next day recorded the directions given without raising any complaint that the arbitrator had refused to deal with any particular issue.  Several other letters were written in September 2002 by the said solicitors without any such complaint.20        The First Applicant decided to represent himself on 18 September 2002. He then wrote a four-page letter making some complaints about the Second Respondent’s documents but made no allegation about any outstanding matter not having been dealt with at the 29 August 2002 meeting.  He did say he wanted an interim award of costs and damages for the other party’s failure to file documents and that he would be making certain applications at the next meeting.21        The next meeting on 23 September 2002 was concerned primarily with the applications for security for costs and damages.  Other than those, no specific application was made.  At the adjourned meeting on 30 September 2002, besides the said applications, the arbitrator also discussed the question of hearing dates.22        On 1 October 2002, he promptly wrote to the parties about his available dates in November of that year.  After hearing from the parties’ solicitors on their available dates, he notified them on 9 October 2002 that the first set of hearing dates would be for three days between 20 and 22 November 2002.  On 12 November 2002, he notified the solicitors of his available dates in December 2002 for the other two days of hearing required.23        Although several letters were written by the solicitors and by the First Applicant between 1 and 10 October 2002, no complaints were made therein.  It was only in the First Applicant’s letter of 28 October 2002 that he began to refer to the earlier letters saying that “critical” matters needed to be discussed/resolved immediately without specifying what he was applying for.24        On 13 November 2002, the arbitrator wrote to invite the First Applicant to state clearly the outstanding matters that he wanted dealt with and to inform him that he could raise them at the commencement of the hearing proper on 20 November 2002 if he wished.25        Given the contentious nature of the proceedings, the arbitrator indicated he would seek legal advice on procedural issues, something permitted by Article 10.3 of the SIA Arbitration Rules.  Article 5.1 of the said rules provided that the arbitrator had the widest discretion allowed by law to ensure the economical and final determination of the dispute but did not impose a duty to ensure that the proceedings be carried out in the most economical way possible.26        The arbitrator’s letter of 11 October 2002 did not indicate that he had made up his mind on liability and only required advice on the quantum.  He was then considering the need to consult an appropriate expert on the quantum should he decide to award security for costs in principle.  He sent a copy of that letter on 31 October 2002 to the parties after learning that they had not received it.  His letter of 30 October 2002 was to clarify that he intended to appoint an expert to advise on procedural issues.27        The Applicants’ objections to the Second Respondent’s expert for the site inspection were in fact made known to the arbitrator.  That was why he replied in his letter of 4 July 2002 that he did not see why the presence of the expert should be objectionable as he would be an expert witness in the dispute. The expert could be cross-examined at the hearing. The arbitrator’s decision not to make another site inspection was something within his prerogative.  The parties could adduce evidence of the defects at the hearing proper in any event.28        An arbitrator was not obliged to convene a meeting every time one was requested by one of the parties.  It was within his discretion to decide that certain interlocutory matters could be dealt with at the hearing proper instead of convening unnecessary meetings which would lead to wastage of time and increased expenditure.29        The arbitrator did not collaborate with the Second Respondent in the dispute. Where the alleged fictitious document was concerned, it was up to the opposing party to make the necessary submissions on its admissibility or the weight to be given to any document.  He did not call for nor communicate with the Second Respondent in respect of the Grounds of Decision of Lee Seiu Kin JC and the notes of arguments.  Those documents were unsolicited and were sent to him without his knowledge that a copy had not been given to the other party at the same time.  In any event, the documents were placed before the arbitrator and arguments were made by both sides on them subsequently at the applications for security for costs.   He was not biased in favour of the Second Respondent.30        The arbitration hearing was scheduled to take place between 20 and 22 November 2002.  This Originating Motion was filed on 20 November 2002. The Applicants’ complaints could have been raised and dealt with at the scheduled hearing.  Their subjective conduct showed that no serious grounds existed for them to say that their confidence in the arbitrator’s ability to conduct the proceedings fairly or competently had been destroyed.",
        "The case for the second respondent": "31        The Applicants moved into the property in issue since April 2001. The arbitrator was appointed by the President of the SIA on 12 December 2001 after the parties could not agree on an arbitrator.  A fee of $2,000 was required to be paid to the arbitrator.  The Second Respondent paid its half share on 28 December 2001 and sought a meeting with the arbitrator for directions on preliminary matters.  However, the Applicants did not pay their share.  On 30 January 2002, the Second Respondent paid the other half share.  A preliminary meeting was then held on 11 March 2002.32        The site inspection was held on 14 March 2002.  All pleadings were exchanged by 11 June 2002. The Second Respondent did request a two-week extension of time to file its list of documents.  The arbitrator granted the request and the Second Respondent complied within the extended time frame. Following discovery of documents, affidavits of evidence-in-chief were exchanged by 5 October 2002.  On 9 October 2002, the first set of hearing dates was confirmed.  There was therefore only a period of about eight months between the first meeting and the hearing dates. About a week before the hearing was to commence on 20 November 2002, the Applicants informed all concerned that they would be taking out the present application in Court and warned the arbitrator not to proceed further or face injunction proceedings.33        In the evening before the meeting of 29 August 2002, the Applicants gave notice by letter of their intention to apply for security for costs.  At the meeting the next day, the Second Respondent objected to a hearing on the said application as it did not have sufficient notice or the opportunity to respond.  Arguments were made and the arbitrator informed the Applicants to make a formal application supported by affidavit evidence so that the Second Respondent could respond thereto.  The Applicants served their application on the Second Respondent’s solicitors on 17 September 2002 and insisted on a hearing on 23 September 2002.  Despite the Second Respondent’s objections, the arbitrator did not change the hearing date.  The First Applicant (then acting in person) served his affidavit about two hours before the hearing and, although indicating he wanted to withdraw it, nevertheless wanted to refer to the matters therein in his submissions.  The Second Respondent therefore objected and it was in those circumstances that the hearing was adjourned one week to 30 September 2002.34        The bundles of documents were filed properly.  The Second Respondent’s solicitors had earlier requested the Applicants to identify the documents they were complaining about so that they could look into the complaints but no details were received from the Applicants except for six documents for which the Second Respondent rendered an explanation.  The direction that the Applicants serve their bundle of documents on the Second Respondent was due to the fact they had served a copy thereof on the arbitrator without serving a copy on the other party.   There were no fictitious documents.  Final Account and Final Claim documents were completed on 27 September 2002 and therefore bore that date.  The arbitrator had to settle the Final Account in the dispute.35        The Applicants’ requests for meetings were not accompanied by a clear indication of their purpose or the remedies sought.  The arbitrator did not shut them out in any event as shown by his letter of 13 November 2002 inviting them to identify the critical matters to be addressed and the specific applications they wished to make, with such applications being submitted at least one day before the hearing proper.36        The applications for security for costs raised issues of law and it would be better for the arbitrator, who was not legally trained, to consult a lawyer.  It was clear that he was not abdicating or delegating his duties to the legal expert.37        Between October 2001 and January 2002, the parties were involved in a series of Court proceedings in which the Second Respondent was seeking an injunction against payment on its performance bond.  Many affidavits had to be prepared and studied.  Because of such distraction, the Second Respondent overlooked the initial payment of $515 due to the SIA.38        The arbitrator did not ask for the written judgment in the related application in Court.  A copy was requested from the Second Respondent’s solicitors by one John Chung of Khattar Wong & Partners on behalf of a lecturer at the university who was following the case out of academic interest.  Due to the similarity in the names of the solicitor making the request and the arbitrator (also known as John Ting), a secretary in the law firm faxed a copy of the document to the arbitrator.  It was exhibited anyway in the Second Respondent’s affidavit of 20 September 2002 filed for the applications for security for costs.  There was no secret communication between the Second Respondent and the arbitrator.",
        "The decision of the court": "39        Sections 17 and 18 of the pre-1 March 2002 Arbitration Act provide:“17.      (1)        Where an arbitrator or umpire has misconducted himself or the proceedings, the court may remove him.(2)        Where an arbitrator or umpire has misconducted himself or the proceedings, or an arbitration or award has been improperly procured, the court may set aside the award.18.        (1)        The court may, on the application of any party to a reference, remove an arbitrator or umpire who fails to use all reasonable dispatch in entering on and proceeding with the reference and making an award.(2)        An arbitrator or umpire who is removed by the court under this section shall not be entitled to receive any remuneration in respect of his services....”.40        “Misconduct” is “such a mishandling of the arbitration as is likely to amount to some substantial miscarriage of justice” [Halsbury’s Laws of England (4thEdition Reissue) Volume 2, paragraph 694].  The nature of such mishandling is a question of fact and of degree and depends on the circumstances of the case.  However, making an erroneous finding of law or of fact or making procedural errors by themselves do not amount to misconduct.41        The arbitrator is, subject to any procedure otherwise agreed between the parties as applying to the arbitration in question, master of his own procedure and has a wide discretionary power to conduct the arbitration proceedings in the way he sees fit, so long as what he is doing is not manifestly unfair or contrary to natural justice (see the Handbook of Arbitration Practice, 3rdEdition).   A subjective lack of confidence in the arbitrator by one party is not a sufficient ground to remove him.  The test is an objective one and there must exist real grounds for which a reasonable person would think there is a real likelihood that the arbitrator could not or would not fairly determine the issue on the basis of the evidence and the arguments to be adduced before him [Hagop Ardahalian v Unifert International S.A. (The ‘Elissar’)[1984] 2 Lloyd’s Rep 84].42        It is therefore plain that the Court’s supervisory role is to be exercised with a light hand and that arbitrators’ discretionary powers should be circumscribed only by the law and by the parties’ agreement.43        Looking at the complaints raised by the Applicants, it was clear that any allegation relating to the lack of impartiality on the part of the arbitrator was wholly misplaced.  The fact that an arbitrator seems to be constantly ruling in favour of one party is equally consistent with the merits being on that party’s side.  The Applicants must show that his decision was likely to have been coloured by something which should have no part at all in a fair decision-making process.  Taking bribes and having a personal interest in the outcome of the proceedings would be obvious and extreme examples.   It appeared to me that the arbitrator was completely above board in all his dealings with the parties.  I accepted that there was nothing sinister in his receiving a copy of the judgment in question and that there was no secret communication between him and the Second Respondent.  It was a Court document known to the parties anyway and not some one-sided piece of information slipped surreptitiously into the mind of the arbitrator.44        While obvious incompetence may amount to misconduct justifying the removal of an arbitrator (Halsbury’s Laws of Singapore, Volume 2, paragraph 20.090), I did not think that was a fair label to place on the arbitrator here.  Even if he could be said to be a little unsure about the applications for security for costs, that would not amount to incompetence.  Indeed, an arbitrator who is extremely confident and decisive may be accused unfairly by some of having made up his mind without considering the arguments of the parties.  He could not be faulted in ruling that the proper way was for the Applicants to take out a formal application even if this would mean slightly more expenses to be incurred. After all, one must remember these arbitration proceedings were not being conducted in the most amicable fashion by the parties.  Similarly, doing something permitted by the parties’ agreement, such as taking legal advice on procedural matters, could hardly be evidence of incompetence.45        “Reasonable dispatch” is also a matter of degree to be determined according to the particular facts of the case.  While the lack of response between the Applicants’ letters of 12 June 2002 and of 15 August 2002 was somewhat puzzling, the overall picture showed the arbitration process was proceeding on an even keel and at a reasonable speed, considering its very contentious nature.  Again, an arbitrator who moves the proceedings along at a breakneck speed may well be accused of misconduct in subordinating fairness to speed.46        I was of the view that the Applicants failed to make out their case against the arbitrator here.  I therefore dismissed their Originating Motion.  For the reason alluded to in the foregoing paragraph (about the lack of response for two months or so), I thought it fair that the costs payable by the Applicants to the arbitrator should be 90% of the total.  The Applicants were also ordered to pay the costs of this application to the Second Respondent.  Even if I had ordered the arbitrator to be removed, I would not have granted the order to transfer the proceedings for trial before the Court.  Instead, I would have ordered that he be substituted by another arbitrator so that the agreement of the parties on the chosen tribunal may be carried out. I was of the view that the Applicants failed to make out their case against the arbitrator here.  I therefore dismissed their Originating Motion.  For the reason alluded to in the foregoing paragraph (about the lack of response for two months or so), I thought it fair that the costs payable by the Applicants to the arbitrator should be 90% of the total.  The Applicants were also ordered to pay the costs of this application to the Second Respondent.  Even if I had ordered the arbitrator to be removed, I would not have granted the order to transfer the proceedings for trial before the Court.  Instead, I would have ordered that he be substituted by another arbitrator so that the agreement of the parties on the chosen tribunal may be carried out.Copyright © Government of Singapore."
    }
}