{
    "case_title": "The \"Dilmun Fulmar\"",
    "ncitation": "[2003] SGHC 270",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "The Dispute": "4          The Plaintiffs’ case is that the Defendants have renounced the Settlement Agreement by their failure to pay the second and last instalment payments. In re-arresting the “Dilmun Fulmar”, the Plaintiffs were pursuing their original claim which was a claim falling under s3(1)(l) and (m) and the in rem action was brought pursuant to s4(4) of the High Court Admiralty Jurisdiction Act (Cap. 123). Their Counsel, Mr. Gerald Yee, submitted that the Plaintiffs’ right to re-assert the original claim and sue in rem was preserved by Clause 10 of the Settlement Agreement. It permitted the Plaintiffs to re-arrest the “Dilmun Fulmar” or any sister ships and/or to claim for the entire sum of $1,154,916.78 and contractual interest at 1% per month or part thereof. Clause 10 read with Clauses 7 and 8 supported the Plaintiffs’ contention that the original claim was suspended and could be revived in the event of non-payment of any of the instalments. 5            Counsel for the Interveners, Mr. Michael Lai, argued that the Plaintiffs’ original claim had been compromised and the second arrest was on account of the Plaintiffs’ claim based on the Settlement Agreement. The Writ was for a cause of action different from a claim under the Settlement Agreement. Accordingly, the in rem action and the second Warrant of Arrest should be set aside on the ground that the court had no jurisdiction in rem in respect of the actual claim sought to be made by the Plaintiffs in these proceedings. The re-arrest was not in respect of a claim that fell within s3(1)(l) or (m) of the Act. The alternative ground of challenge was that the second arrest was an abuse of the court process because the Plaintiffs already had adequate security for the claim made.",
        "The Settlement Agreement": "6          It would be convenient to set out the relevant terms of the Settlement Agreement. In the Recital, the claim amount stated therein was $1,154,916.78. It stated that the in rem action commenced in May 2001 was to recover this amount. The relevant Clauses read as follows: “ 1. Pan-United agrees to accept the total sum of S$310,000 inclusive of interest of S$25,000 and S$25,000 as legal costs (hereinafter referred to as “the Settlement Sum”) in full and final settlement of their claim in Admiralty in Rem no.600215 of 2001. 2. The Settlement Sum is to be paid by Castle Shipping in three (3) instalments as set out herein. 3. The S$140,000 remitted by Castle Shipping on 1800 hours on 14 August 2001 (Singapore time) shall be deemed to be the first instalment of the Settlement Sum. 4. …. 5. …. 6. Upon receipt of the first instalment of the Settlement Sum in the sum of S$140,000, Pan-United shall forthwith release the“Dilmun Fulmar” from arrest in Admiralty in Rem no. 600215 of 2001. 7. Upon receipt of all three (3) instalments of the Settlement Sum, Pan-United shall forthwith discontinue their action in Admiralty in Rem No.600215 of 2001. 8. Upon receipt of all three (3) instalments Pan-United irrevocably releases and discharges the vessel “Dilmun Fulmar” her master, owners, operators, managers, charterers and Castle Shipping including their successors and assigns from all and any claim, demand or otherwise arising out of the subject matter of Admiralty in Rem no. 600215 of 2001 (including but not limited to any claim for legal costs and expenses). 9. Upon executing this Settlement Agreement, Castle Shipping irrevocably releases and discharges Pan-United, their successors and assigns from all and any claim, demand or otherwise arising out of the repairs and all other services carried out by Pan-United to the “Dilmun Fulmar” 10. In the event that the first instalment is not received by Pan-United by 1800 hours 14 August 2001 (Singapore time) and/or in the event that any of the two (2) instalments are not paid by Castle Shipping by the date provided therein, this Agreement and the release of the “Dilmun Fulmar”shall not prejudice Pan-United’s rights to proceed against Castle Shipping and/or to re-arrest the “Dilmun Fulmar” or any of her sister ships and/or to claim for this said sum of S$1,154,916.78 and contractual interest at 1% per month or part thereof. 11. … 12. …   ” 7          The issue raised by this appeal touched on the true construction and effect of the Settlement Agreement.  In coming to my decision to set aside the Writ and Warrant of Arrest, I had to construe the accord. Generally, an agreement of compromise would discharge all original claims and counterclaims unless it expressly provides for their revival in the event of breach: seeFoskett on The Law and Practice of Compromise (5thed) para 8-07; Chitty on Contracts, vol. 1 (28thed) para 23-015. The Settlement Agreement was worded in such a way that there was by its terms an immediate binding compromise of the claim amount of $1,154,916.78. By Clause 1, the Plaintiffs agreed to accept a sum of $310,000 inclusive of interest and legal costs in full and final settlement of a larger claim. The consideration was the Defendants’ promise to pay the settlement sum in three instalments by certain dates. The further consideration was the release by the Defendants (which took effect upon the execution of the Settlement Agreement) of the Plaintiffs from all claims that the Defendants have or may have against the Plaintiffs in respect of the repairs. The Settlement Agreement was also worded in such a way that if the compromise agreement was broken, the Plaintiffs could assert their former rights. Clauses 7, 8 and 10 are consistent with this interpretation. 8          Clause 10 recognises that the non-payment of any of the instalments would go to the root of the Settlement Agreement so as to evince an intention no longer to be bound by it. In my view, Clause 10 simply spells out or recites the general rule of contract law that upon a repudiatory breach by one party, the other party has a right to elect whether or not to affirm that agreement or to treat it as wholly discharged.",
        "The nature of the claim on re-arrest": "9          Mr. Yee submitted that the Plaintiffs re-arrested the vessel on the basis of their original claim. In my view, the Plaintiffs’ conduct was overwhelmingly inconsistent with the facts, documentary evidence and pleadings, all of them bore hallmarks of unequivocal conduct affirming the Settlement Agreement thereby precluding recourse to the original claim. Despite the Defendants’ failure to make payment of the second and final instalments, it was clear on the evidence that the Plaintiffs had nonetheless affirmed the Settlement Agreement after the repudiatory breach i.e. failure to pay the outstanding instalments. The re-arrest was to enforce the Settlement Agreement to recover the outstanding instalments of $170,000. 10        A few months before the second arrest, the Plaintiffs filed their Statement of Claim on 15 February 2002. In there the Plaintiffs sought payment of $170,000 and contractual interest at the rate of 1% per month. I would mention that the Indorsement of Claim on the second Warrant of Arrest dated 29 July 2002 and the affidavit leading the arrest said different things. The former stated that the Plaintiffs’ claim was for the sum of $874,274 being the balance of the cost of repairs carried out to the “Dilmun Fulmar” in the months of October-November 1999 as evidenced by the Plaintiffs’ invoice PAN99/0440 dated 26 November 1999. On the other hand, the affidavit leading the re-arrest referred to the Settlement Agreement, the payment of the first instalment of $140,000 and the Defendants’ default on the balance of sum of $170,000. Mr. Yee in his affidavit deposed that as at 25 February 2002, the sum of $170,000 was due and owing to the Plaintiffs. The affidavit concluded that the aid and process of the court was required to enforce the remainder of the Plaintiffs’ claim by the re-arrest of the “Dilmun Fulmar”. 11        After the second arrest, security was immediately demanded from the Interveners on 31 July 2002 based on a principal claim figure of $630,274. When queried, the Interveners’ former solicitors were told that the Plaintiffs had made a mistake and the principal claim amount should be $170,000 and not $630,274 as previously demanded. The Plaintiffs’ solicitors in a fax dated 1 August 2002 wrote:  “..the sum due is in fact S$170,000 as stated in the Settlement Agreement together with interest thereon up to 23rdJanuary 2002..”. The Plaintiffs in their skeletal submissions said that the Plaintiffs had elected to claim and were claiming the sum of $170,000. 12        The Statement of Claim was amended on 20 December 2002, some 5 months after the re-arrest. To all intents and purposes it remained a claim under the Settlement Agreement. It again was an acknowledgement by the Plaintiffs, this time in their amended pleadings, that their claim arose out of the compromise they entered into with Castle Shipping. 13        Mr. Ng Sing Chan, the General manager of the Plaintiffs, affirmed an affidavit on 6 February 2003 to oppose the setting aside application. I found the affidavit self-serving. He deposed that the Plaintiff’s claim against the Defendant as pleaded in the Amended Statement of Claim re-filed on 20 December 2002 was for monies due and owing for repairs carried out and for the supply of equipment to the “Dilmun Fulmar” during October to November 1999. He asserted that full payment remained due and owing but notwithstanding this right to claim the full balance, he was prepared to accept $170,000 to resolve the matter and thus instructed his solicitors to claim $170,000. He acknowledged that the claim was for $170,000 but denied that it arose out of the Settlement Agreement entered into with the Defendants. There was no explanation as to where the figure of $170,000 had come from if it was not from the Settlement Agreement. He also denied that the Plaintiffs in re-arresting the vessel were seeking to sue on the Settlement Agreement or to enforce the same. 14        In my view, the claim in these proceedings was one to enforce the Settlement Agreement and the Plaintiffs’ excuses were tissue paper thin. Their contention that they were re-asserting the action for the repairs and material supplied to the vessel for which the Writ was served on the vessel was wholly illusory. The Writ and second Warrant of Arrest did not reflect the true cause of action consistent with the one affirmed by the Plaintiffs. 15        It was therefore wrong to have proceeded to enforce the Settlement Agreement under the guise of the original claim. There was no claim of $1,154,916.78 as stated in the Settlement Agreement or $874,274 as stipulated in the second Warrant of Arrest outstanding under the tax invoice at the time of the re-arrest. Neither was there a claim for $630,274 as initially put across to the Interveners’ solicitors after the re-arrest, which was later withdrawn as a mistake. The Statement of Account as at January 2002 (an exhibit to Yee’s affidavit in support of the second arrest) was for a figure of $170,000 plus interest at 1% per month. That figure of $170,000 and 1% interest could only have come from the Settlement Agreement.  It would have been in the Plaintiffs’ interests  to affirm the Settlement Agreement because of the release they secured from the Defendants. As to why the Plaintiffs had to resort to the Writ filed in these proceedings, the answer is obvious. The Writ was good against the present owners only in respect of the original claim. It was not disputed that the Writ would survive the change in the ownership of the vessel since at the time the Writ was issued the Defendants were still the beneficial owners of the “Dilmun Fulmar”. 16        As stated, the original cause of action following the affirmation of the Settlement Agreement had been superseded and the court had no jurisdiction in respect of the original claim. The Settlement Agreement gave rise to a new cause of action for which a fresh action had to be started in order to sue on the compromise. SeeGreen v Rozen& Ors[1955] 1 WLR 741. The claim to enforce the Settlement Agreement was not a claim that is within s3(1)(l) or (m) of the Act. The cause of action was for money due under the Settlement Agreement, namely the instalments that fell to be paid. The Plaintiffs had no right to enforce the terms of the Settlement Agreement in these proceedings. In any case, the cause of action on the Settlement Agreement arose after the date of issue of the Writ. It was not a matter that could be cured by an amendment. 17        For all these reasons, the re-arrest in these circumstances was mala fide and an abuse of the court process. The re-arrest was therefore wrongful. Having reached this conclusion, it is not necessary to discuss the alternative ground of whether the re-arrest was an abuse of the process of the court as the Plaintiffs have adequate security.",
        "Result": "18        In the circumstances, I dismissed the Plaintiffs’ appeal and allowed the Defendants’ appeal. The security that was furnished for the release of the vessel from arrest was ordered to be returned to the Defendants. I also ordered that there be an inquiry as to damages for wrongful arrest. Finally, the Plaintiffs were ordered to pay the Defendants the costs of both appeals and the hearing below to be taxed if not agreed."
    }
}