{
    "case_title": "Re Lion City Holdings Pte Ltd",
    "ncitation": "[2003] SGHC 43",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Asad's arguments": "6          Asad, in his affidavit of 23 October 2002, stated that he had co-operated with the liquidators and answered their queries to the best of his ability through the many letters exchanged between them.  His answers at the examination would be no different from what he had already stated in writing.  It appeared to him that his answers had not been useful enough for the liquidators in their claim against him which had already been quantified at for more than $11 million.7          Further, the liquidators had or ought to have sufficient information of the company’s affairs from him or from the other directors.  They obtained the Statement of Affairs from one of the directors (Yusuf Jumabhoy) soon after the winding up but waited almost two years before taking out the application for examination. The liquidators have not explained this delay. The liquidators issued a letter of demand against Asad based on the information provided by that director and then commenced action in Suit No. 450 of 2002.8          The action commenced by the liquidators on 18 April 2002 was not disclosed to the Court on 23 April 2002 when their ex parte application for examination was heard.   No statement of claim was filed in that action and the writ of summons was not served.  Its validity has expired. The liquidators were using section 285 Companies Act to buttress their case and to gain an unfair advantage over Asad.  It was not a case of prudent liquidators seeking information on whether to sue.  Instead, it was a fishing expedition to seek admissions and to obtain information of wrongdoing by giving Asad the opportunity to incriminate himself.  What the liquidators wanted was essentially a rehearsal of the cross-examination of Asad.",
        "The liquidators' arguments": "9          The liquidators’ application for examination was filed nearly three months before the writ of summons was issued.  They denied the allegation that they were merely fishing for information for ulterior purposes. Although Asad had not been uncooperative, there were still numerous areas regarding the company’s affairs in which they needed clarification from him. They had not already asked all the questions relating to the company’s affairs and Asad had certainly not answered all questions fully.  For instance, the liquidators in their letter of 26 July 2001 raised  three queries concerning Asad’s wife, the company’s fixed assets and another company called Scotts Weitnauer Retailing Pte Ltd.   In Asad’s response of 17 September 2001, he stated that he would be reverting to the liquidators on two of the issues.  Since then, they had not heard from him regarding any of those three issues.10        The quantification of the claim was based solely on the Statement of Affairs as was the standard practice of all liquidators. It was also incumbent on the liquidators to ensure that there was a sound basis for any claim set out in the Statement of Affairs.  The application for examination was part of that process.  They were particularly concerned about two transactions in 1996 in which Asad, through a company owned or beneficially owned by him, purchased the company’s shares in two other entities at what appeared to be a significant undervalue.11        The only motivating factor for the filing of the action was to ensure that any claim which the company had against the directors was not time-barred after six years.  The liquidators did not possess sufficient information at present to facilitate any decision regarding Suit No. 450 of 2002.  If the answers provided by Asad at the examination satisfied them that there was no cause of action against him, they would discontinue the said proceedings.  They were willing to furnish the documents necessary for Asad to refresh his memory and had in fact done so.12        It was never their intention to conceal from the Court the fact that action had been commenced.  The thought just did not cross the liquidators’ minds as it was only meant as a protective writ of summons.  Their solicitors would apply to renew its validity if it became necessary.",
        "The decision of the court": "13        Section 285 Companies Act is in the following terms:“285.    (1)  The Court may summon before it any officer of the company or person known or suspected to have in his possession any property of the company or supposed to be indebted to the company, or any person whom the Court considers capable of giving information concerning the promotion, formulation, trade dealings, affairs or property of the company.(2)        The Court may examine him on oath concerning the matters mentioned in subsection (1) either by word of mouth or on written interrogatories and may reduce his answers to writing and require him to sign them, and any writing so signed may be used in evidence in any legal proceedings against him.(3)        The Court may require him to produce any books and papers in his custody or power relating to the company, but where he claims any lien on books or papers the production shall be without prejudice to that lien, and the Court shall have jurisdiction to determine all questions relating to that lien.(4)        An examination under this section or section 286 may, if the Court so directs and subject to the Rules, be held before any District Judge named for the purpose by the Court, and the powers of the Court under this section and section 286 may be exercised by that Judge.(5)        If any person so summoned, after being tendered a reasonable sum for his expenses, refuses to come before the Court at the time appointed, not having a lawful excuse, made known to the Court at the time of its sitting and allowed by it, the Court may cause him to be apprehended and brought before the Court for examination”.14        InRe Sasea Finance Ltd (in liquidation)[1998] 1 BCLC 559, the company went into liquidation with no assets and owing several million pounds to its creditors.  It was part of a group of companies which carried on business in a fraudulent way.  In 1993, the liquidators sought copies of any relevant documents that its auditors might possess to enable them to conduct the liquidation.  The liquidators lacked funds and did not return to this matter until June 1996 when they issued a protective writ alleging negligence against the auditors in their audit of the company. This was to prevent any action from being time-barred. It was served three days before its validity expired in October 1996. Service of the statement of claim was postponed by consent. On 21 November 1996, the liquidators applied for an order under section 236 of the Insolvency Act 1986 (the broad equivalent of our section 285 Companies Act) against the auditors.  The application was resisted on the grounds that the liquidators had failed to show a reasonable requirement for the documents and that the application was oppressive in all the circumstances.15        Sir Richard Scott VC dismissed the liquidators’ application after stating:“The liquidators accept, indeed they assert, that they could not have pleaded a viable negligence case against (the auditors) at the date, 26 June 1996, when the writ was issued.  They needed information, which they hoped to obtain via the s 236 application, in order to plead a case.  By first issuing the ‘protective’ writ and then applying under s 236 and obtaining a postponement of their obligation to serve a statement of claim until information pursuant to the s 236 order had been obtained, the liquidators have succeeded in securing for themselves, in effect, an extension of the limitation period of indefinite duration.  A tactic of this sort may well be justified in some cases; for example, cases in which there is reason to believe that respondents have secreted away assets of the company or in which respondents are obstructing attempts by liquidators to discover what has happened to the assets of the company.  But in a case such as the present, in which the liquidators’ intention is simply to bring a negligence action against the company’s auditors, the tactic comes close, in my opinion to abuse of process.  And, in my view, it crosses the line between legitimate tactic and abuse of process once the liquidators know what happened, know what was done and what was not done, and simply want to improve upon an intended negligence case against auditors by extracting from them damaging admissions or unconvincing justifications.  That, in my judgment, is the point that has been reached in this case.  In the circumstances of this case I regard the application for answers to be given to the interrogatories as oppressive and the application for time for service of statement of claim to be further extended until after the answers have been received as constituting an abuse of process”.16        Asad’s solicitors submitted that the facts of that case were similar to the present as the liquidators had received information from “one camp” (Yusof’s) and also from Asad himself.  It was also submitted that once litigation had been instituted (the crossing of the Rubicon), an examination under section 285 should not be allowed because that provision conferred an extraordinary jurisdiction which had to be exercised with caution and which should not be used to confer special advantages on a party in ordinary litigation simply because he happened to be a liquidator (per Robert Walker inRe Atlantic Computers plc[1998] BCC 200).  It was argued that the present case was unlike that inPeter Chi Man Kwong & Anor v Ronald Lee Kum Seng[1984-1985] SLR 227 where our Court of Appeal allowed an order for examination to stand in a case where a company had colossal debts amounting to $51 million and all accounting records and its principal officers and employees had disappeared.17        Halsbury’s Laws of England, Fourth Edition (1996 Reissue), Volume 7(3) at paragraph 2439 sets out compendiously the principles that apply in an application under the English equivalent of our section 285.  The court’s power to order an examination is discretionary and must be exercised after carefully balancing the liquidator’s need to carry out his task and the need to avoid making an order which is wholly unreasonable, unnecessary or oppressive to the person concerned.  The factors which could be taken into account in exercising the discretion include:(1)        whether the order is sought against those under a duty to co-operate with the liquidator already;(2)        the views of the liquidator are to be given great weight;(3)        the liquidator is entitled not only to general information but to specific information concerning possible claims against specific persons;(4)        the mere fact that the liquidator has commenced or is about to commence proceedings against the respondent is not an absolute bar to the making of an order;(5)        the risk that a respondent might expose himself to liability is merely a factor to be taken into account; the risk of exposure to a fraud claim is not conclusive;(6)        the fact that a respondent may have to answer questions which expose him to a criminal liability is not decisive;(7)        an oral examination is likely to be more oppressive than the other possible orders under the statutory provision.18        The liquidators are under a duty to try and obtain as full a picture as possible of the company’s affairs.  The person sought to be examined was the managing director of the company and should be well placed to fill in the gaps in the liquidators’ knowledge.  It would be wrong to discharge the order for examination simply on the basis that Asad asserted he had already disclosed what he knew.  The liquidators are entitled to dispute that assertion or at least to test any professed lack of knowledge.  Otherwise directors who answer every question with “I do not know anything about that” would be able to claim that they have already said what they are able to.  The case for  examination is even stronger here as Asad has not even said anything about the three issues raised by the liquidators in their letter.19        The difficulties of the liquidators are compounded here by the rival factions within the board of directors.  They should not appear to be taking sides by acting on the words of one faction without making reasonable enquiries from the other.20        They had to commence the action on the little that they knew as a precautionary measure because of the time-bar.  Whether they would succeed in renewing the writ of summons or not and the consequences if they do not need not concern me at present. After all, an order for examination against a respondent is not premised on the liquidators’ ability to sue him subsequent to the examination.  The liquidators are entitled to information which will enable them to give a fuller picture to the creditors and to the Court eventually, irrespective of whether or not any legal action could then be commenced.  I note from the Court records that the validity of the writ of summons in Suit No. 450 of 2002 has been extended to 17 April 2003 by an order of Court given on 12 December 2002.21        Further, the District Judge concerned directed that a list of the questions proposed to be asked by the liquidators be given to Asad before the examination and the liquidators will be complying with that direction.  The liquidators have given Asad the documents they would be relying on at the examination in order that he may refresh his memory and check facts.  Far from being unreasonable or oppressive, the liquidators appear to be making every effort to make the matter as painless as possible for Asad.22        I accept that the liquidators were under a duty to make full and frank disclosure of all material matters in their ex parte application.  The fact that they had commenced Suit No. 450 of 2002 was indeed a material matter that ought to have been told to the Court.  However, I am satisfied with the liquidators’ explanation that they had absolutely no intention of concealing that fact from the Court, bearing in mind the route (set out in paragraph 2 above) that the application took before it was granted.  Of course, one might argue that since the writ of summons was commenced only five days before the adjourned hearing, it ought to have been fresh in the solicitors’ mind when they went before the judge on 23 April 2002.  It was unfortunate that it was overlooked but I am confident that the judge, if told about the writ of summons, would have accepted the explanation that it was only a protective writ.  I therefore did not think the order obtained ex parte should be set aside on that ground.23        Accordingly, I dismissed Asad’s application to set aside the order made on 23 April 2002.  I ordered that the costs of the application before Rajendran J, of the application before me and of the examination to be conducted be in the discretion of the District Judge.Copyright © Government of Singapore."
    }
}