{
    "case_title": "Lim Yee Ming v Ubin Lagoon Resort Pte Ltd and Others (Adventure Training Systems Pty Ltd, Third Party)",
    "ncitation": "[2003] SGHC 134",
    "coram": "Lai Kew Chai J",
    "sections": {
        "Agreed Facts": "8          Amongst the facilities offered by the Operators at the resort was the Ubin Adventure Centre where the Operators had recently begun conducting adventure and recreational activities for their customers.9          Ivy was at the material times an employee of Trans-Link Express Pte Ltd. They were a paying customer of the Operator at the resort on Pulau Ubin and had engaged their services to conduct the adventure and recreational activities for employees such as Ivy.10        I was told and it was accepted by parties concerned without further enquiry that the Operators were covered by a Public Liabilities Insurance Policy issued by QBE Insurance (International) Ltd (“QBE”) who appointed the firm of solicitors Madhavan Partnership to act for the Operators in the second suit. The Managers as well as a sister company of the Operators were at all material times named as the insured under the said policy.11        On 15 December 2000, Ivy and other employees of Trans-Link Express Pte Ltd were taking part in the ‘Team Pyramid Challenge’ at the Ubin Adventure Centre, pursuant to the agreement with the Operators. The final challenge, which the participants of the ‘Team Pyramid Challenge’ were supposed to participate in, was an activity called the ‘Flying Fox’, which involved by belaying a descent from the top of the 24m-high tower.12        Ivy was in the same group as Kwok Kam Wing Barry (“Barry”), Jack Joshua Tan Kiang Heng (“Jack”), Fredrick Ngnasegkar (“Frederick”) and a lady from an overseas office called Debbie. An instructor of the Ubin Adventure Centre, Ben Choo Chee Keong (“Ben”) was assigned to be in charge of the group.13        When Ivy’s group was going up the tower, it started to rain heavily. Ben told the group that they could not carry on and that he had to lower them to the ground using the lowering equipment, which, as stated earlier included a stop descender and the prussic loop.14        Frederick was the first person in the group to be lowered by Ben using the lowering equipment. The descent was uneventful and, in my judgment, Ben successfully executed it.15        While Ivy was being lowered by Ben, she suddenly dropped from a height of approximately 10 metres without warning or restraint, falling heavily to the ground. As a result of the fall, Ivy suffered severe injuries including being paralysed from the waist down. She also lost bladder and bowel control. She was hospitalized from 15 December 2000 to 15 March 2001. All parties agreed that the incident would not have occurred under ordinary circumstances and in the absence of negligence. No negligence is alleged against Ivy by any of the defendants in both suits.16        The issue on liability is whether negligence could be attributed to any of the defendants solely or contributed to by any other of the defendants in both suits.",
        "The Background": "17        The building of the Adventure Training facility, as noted earlier, was carried out under a written agreement on 28 July 1999 and entered into between the Managers and the Contractors. The Contractors commenced work in August 1999. They informed the managers that the training facilities were practically completed on 11 April 2000. Prior to the practical completion date, the various structures and facilities were progressively handed over to the Managers. The Contractors could not hand over the whole site because as of 11 April 2000 the Managers’ other contractors and agents had not completed the ground works for the parachute jump.18        Under the agreement the Contractors provided the Managers 6 pieces of the Pyramid Rescue Kit. The Contractors had in turn purchased the said rescue kit from the Suppliers. The 6 Pyramid Rescue Kits were delivered to the Managers on 12 May 2000, apparently in good order and condition.19        Pursuant to the said agreement, the Contractors arranged for the Suppliers to provide 10 of the Managers’ and Operators’ staff a 12-day comprehensive “train the trainer program”. Under the program it was intended to teach and train 10 of the Managers’ and Operators’ staff (who may be referred to as “the trainers” or the “instructors”) in the proper use of the equipment, which the Contractors sold to the managers. The training included safety procedures.20        In April 2000 the Contractors arranged for Mr Richard Hope, the Managing Director and representative of the Suppliers, to conduct the training program. The training was conducted in May 2000.21        The issues of fact turn on the questions whether the incident was due entirely to Ben’s error or did the Contractors and Suppliers contribute to its occurrence or whether the Contractors and the Suppliers were singly liable or contributorily liable for the incident by reason of the defective stop descender or the prussic loop and their training of the Operators staff in the use of both equipment.",
        "The Operators’ version": "22        Ben, an employee of the Operators, told the court that on 15 December 2000 twenty of the staff of Trans-Link Express Pte Ltd proceeded to the Team Challenge Pyramid for the team building exercise. They were divided into 4 groups of 5 participants each. Ben and 3 of the other instructors briefed them. He was in charge of Group 3. Each group was taught how to use the Team Challenge Pyramid colour strops. These strops were to prevent a participant from falling from the pyramid. When a group has successful climbed to the top of the pyramid, each participant would descend to the ground by using the ‘flying fox’, a belaying system.23        According to Ben, at about 1330 hours, it started to rain at the adventure center. At about 1500 hours the rain was very heavy and instructions were given to cease all activities on the pyramid. There was thunder and lightning. When the instructions to stop all activities were given, Group 3 were in the second level resting cage of the pyramid. That was about 9.5 metres above the ground. Ben had to use the rescue kit, which comprised amongst others the stop descender and the prussic loop) to activate the emergency descent.24        Ben prepared Frederick for the descent by clipping the steel karabiner onto Frederick’s safety harness. The karabiner is attached to a belaying rope, which is held by the stop descender.  The stop descender was in turn attached to the pyramid structure. At the other end of the belaying rope was attached the prussic loop. The other end of the prussic loop was attached to a steel karabiner which was in turn clipped onto the instructor’s harness. The prussic loop is a back-up jamming cord which served the same function of the stop descender, i.e. to stop and regulate the participants descent while being lowered to the ground by the instructor. The rope used for the stop descender was a 9mm diameter static rope.25        By design, and as Ben stated in para 6 of his affidavit evidence, where the stop descender fails to jam the static rope, the prussic loop has to be pulled to an acute angle and the knot of the prussic loop would immediately tighten around the static belaying rope and jam the belaying rope, thereby stopping a participant’s descent.26        Ben lowered the first participant, Frederick, by controlling the stop descender. Ben in evidence said that without applying any pressure from him on the lever of the stop descender, the static rope was locked by the stop descender. The rope could not move, and Frederick could not descend. By gently squeezing the lever of the stop descender ‘co-ordinated with the sliding of the prussic loop through the static rope’, Frederick was lowered to the ground by Ben basically gently pressing the lever of the stop descender and paying out the static rope through the knot of the prussic loop.27        After Frederick was lowered to the ground, Ben began to prepare the stop descender and the prussic loop. The static rope had to be pulled through the stop descender, with the tail end of the rope getting longer until the optimum length was achieved. He told Ivy to relax and sit back on her safety harness. She was told to hold the ‘figure 8’ knot using both her hands. She was also instructed to spread both legs to shoulder-width apart and to lock both knees.28        Following Ben’s directions, Ivy bent her body to a seating position. After lifting her 2 feet off the Jacob’s Ladder to descend, Ben saw that the static rope suddenly began to run right through the stop descender. Ben throughout the trial insisted that without any movement or pressure on the lever of the stop descender, the stop descender failed to lock and jam the static rope. Ben said that the prussic loop, which was by design a back-up jamming device, also failed to jam and stop the rope from sliding through.29        Each of the staff of the Operators who had witnessed the incident filed a report of the incident. An Incident Report was filed. It was alleged that the stop descender failed to hold up Ivy when the lever was not pressed.30        On 17 December 2000 the Contractors’ Mr Russell Moy came to Ubin Adventure Centre in response to the report of the incident by Gabriel Soh. Both he and Gabriel Soh proceeded to test and investigate the rescue kit. Many permutations were tested, including while the 9mm rope was wet and when dry. 9mm and 11mm ropes were used. Dry and wet ropes were used. The preliminary conclusion of Russell Moy was that the stop descender could not work with the 9mm ropes or that the stop descender was defective. According to Gabriel Soh, it was found that the stop descender and prussic loop had failed in all cases.31        Mr Russell Moy, experienced in dealing with adventure equipment, stated in his letter of 18 Dec 2000 that he had “observed several demonstrations by the Ubin Resort Staff with the descender in every possible orientation and had both wet rope and dry ropes supplied with the rescue kits. The descender failed completely in all cases. We noted that the rope was inserted correctly to the diagram shown on the descender. When set the system up with 11mm rope and the system worked with no failure. We also observed  the prussic knot in the system as a backup, this worked when operated correctly.” Unfortunately, the Contractors failed to call Russell Moy as a witness and there was no explanation at all for his absence from the witness stand. The Contractors had recorded the tests on video tapes. Again unfortunately, those tapes were produced and said to be blanks.32        On 9 January 2001, Mr Richard Delaney of the Suppliers came to Ubin Adventure Centre to investigate the stop descender and the prussic loop. He conducted tests. Gabriel Soh said in evidence that Mr Delaney confirmed that his conclusion was also that the 9mm rope used would and had failed to activate the stop descender. He had used a video camera during the tests to record the events on video tape. On his return to Australia, Mr Delaney was supposed to furnish a written report to the Managers and Operators his findings and conclusions. Despite a written  reminder from the Contractors dated 23 December 2001, Mr Delaney who investigated into the matter failed to submit his report to the Operators, Managers and the Contractors.33        On the second day of the trial, Ben gave a demonstration of how he had used the stop descender and the prussic loop on the day in question. Both equipment, which were used during the incident, were produced for inspection. The stop descender used is the SRTE (Single Rope Technique Equipment) model known as D1a. It is described as a single rope stop descender. The belaying rope is passed through a metal camming device. When the lever is not pressed, the camming device could pressed against the loaded belaying rope and prevent it from slipping through. To release the rope from the camming friction, the lever should be gently pressed. The more the lever is squeezed the faster the descent would be. On page 25 of the manufacturer’s manual, it is advised that “(t)he right hand of the instructor must control the tail end of the rope at all times”. The left hand of the instructor gently squeezes the lever to start the descent.34        Ben demonstrated that his left hand was on the stop descender and his right hand was holding the prussic loop. He told me that when Ivy fell his right hand was still holding prussic loop. He did not move away his right hand. His right hand was holding on to the knot of the prussic loop and on that scenario the tail end of the static rope could continue to pay out. If he had let go his right hand, the knot of the prussic loop would have tightened when the prussic loop is pulled and if the tail end of the rope is pulled the descent would have stopped. It should be borne in mind that the prussic loop is locked onto Ben’s harness by means of a karabiner. It was all very sudden. Ivy fell within a matter of a second or so.35        Ben and Gabriel Soh, the Head of the adventure center and Assistant General Manager of the Operators overseeing the training of the instructors, told me during the demonstration that Richard Hope, the director of the Contractors who trained the instructors of the Operators on the use of the rescue kit, had repeatedly assured the instructors that the stop descender would be 100% effective. Gabriel Soh further told the court that during the tests he required a fail-safe mechanism to be put in place in addition to the stop descender. On 17 December 2000 whilst the tests were conducted in the presence of Mr Richard Hope, the stop descender again failed and Gabriel Soh had a free fall. Fortunately, one of the instructors had acted as the belayer who would break any free fall. That instructor broke the fall like breaking the fall of a mountain climber.36        Mr Lee Tuck Hume, the Assistant Operations Manager of the adventure center and an instructor at the center, gave evidence on the training by Mr Richard Hope. He said that he and 8 other instructors, including Ben, attended the training sessions conducted in May 2000. They were taught that after the static rope had been fitted through the stop descender, the tail end of the rope should be directed downwards. Mr Richard Hope also taught them that if there was a slack in the prussic loop, it was acceptable and could be continued to be used. They were told that when there was rapid descent, the running static rope would drag the prussic loop knot up to be in contact with the stop descender. As a result, they were taught, that the running static rope would be stopped. Ben in cross examination confirmed the evidence of Lee Tuck Hume in material respects. Mr Omar Rosli, Ms Denise Oi and Ms Chua Hwee Bin, who were instructors of the Operators and trained by Mr Richard Hope, confirmed the evidence of Mr Lee Tuck Hume’s evidence. Ms Chua, however, qualified her confirmation by saying  that she could not remember whether Mr Hope said it was alright for the prussic loop to have a slack or that the running of the static rope would drag the prussic loop up to be in contact with the stop descender. If these were in fact taught by Mr Richard Hope, they would be entirely wrong.37        The demonstrations in court showed conclusively that an instructor should with his right hand hold the knot not too tightly when the static rope was paying out during a descent and that the knot and the tail end of the rope should be held firmly by the right hand if descent was to be stopped. I had tested the use of the prussic loop in simulated conditions. It was quite easy simply to tighten the grip of the right hand on both the knot and the tail end of the rope. Those actions would effectively without much difficulty stop a descent. Ben in cross examination confirmed these observations. It was also demonstrably shown that, alternatively, the instructor could let off the knot of the prussic loop and the tail end of the rope and the prussic loop on being dragged up would become taut because the knot would tighten its grip around the tail end rope. It must be noted that the prussic loop must be short enough for it to tighten before the knot of the prussic loop reaches and abuts the stop descender.38        Mr Matthew Scott gave expert evidence for the Operators and Managers. He was a Manager involved in the business of constructing adventure equipment and providing adventure skills training. His credentials as an expert were not challenged. He observed that the stop descender was supplied to the Operators and Managers fully assembled. He opened it to examine it. He found that there was a pivot bolt nut, which could be adjusted and set to correspond with the belay rope to be used. He found that the stop descender in question would best suit a rope with a diameter of 11mm. He examined the stop descender with the manufacturers’ instruction manual. In fact, the Managers and Operators were not given a copy by the Contractors and Suppliers.39        The belay rope supplied with the stop descender to the Managers and Operators was of 9mm diameter. Mr Scott opined that the combination might not be capable to function in controlling the descent of an adult person using the rescue kit.40        Mr Scott was informed by Mr Gabriel Soh that the staff of the Operators and Managers were trained to use the stop descender with the tail end of the rope directed downwards. Mr Scott was of the view that this method of using the stop descender was incorrect because the tail end of the rope must be in the opposite direction to the load to increase the friction between the stop descender and the rope.41        In August 2001 Mr Scott observed tests conducted with the same equipment and under simulated conditions. For comparative purposes, a separate stop descender set to maximum friction and a 11mm rope diameter rope was also tested. The tests were carried out at the same Team Challenge Pyramid at the Ubin Adventure Centre. The tests were completed over a period of 12 hours. The tests results were exhibited. Under trial condition “D”, where the condition of the 9mm rope was wet, all 20 tests except one presented ‘unacceptable slippage descent rate’. It meant that it was unsafe and almost certain injury would ensue. In contrast the results of Trial Condition “C”, where a WET rope of 11mm was used, all 9 tests showed that the descent had stopped with slight slip and it was safe. Only 1 test was ‘void’ because the lever of the stop descender was squeezed too long.42        Mr Scott expressed the expert views that the incident occurred might have resulted from the factory setting of the pivot nut inside the stop descender. It was not set to maximum friction. Alternatively, the accident might have arisen because the belay rope of 9mm diameter was used in conjunction with the stop descender which was not set to maximum friction. He was of the opinion that the downward direction of the tail end rope, instead of being directed opposite the direction of the person being lowered, might also have contributed to the incident. In other words, he said that the tail end rope should have been directed through the karabiner and back down. Moreover, the wet condition of the rope as a result of the heavy rain might also have been a contributing factor.43        When asked if the 9mm rope could be used safely, Mr Scott replied that it depended on the instructor’s skills in operating it. He emphasized that it ‘scared’ him to use a 9mm rope. He never used it. He stressed that the most important thing was to have the brake hand on the tail end rope. When suggested to him that Ben could have wrongly threaded the rope up after he had lowered Frederick, Mr Scott dismissed this suggestion, saying and demonstrating that it was well-nigh impossible to thread it back in the then prevailing circumstances.",
        "The Suppliers’ & Contractors’ version": "44        Though the Contractors and Suppliers put forward substantially similar versions of what had happened, the Contractors seek recourse against the Suppliers if and to the extent the stop descender and the prussic loop were found defective or if the training of the Operators’ instructors was found to be defective. Mr Richard Hope, a director of the Suppliers. He trained the staff of Ubin Resort Adventure Centre. At the time of training, he had 20 years experience in the outdoor adventure and training industry. His qualifications as a trainer were impressive.45        In 1999 he was contacted by Mr Russell Moy and/or Mr Chew Ang Yew of the Contractors and asked to prepare a quotation for the supply of a ‘rescue kit’ to the resort and to train staff of the resort, who would later become instructors in the use of the equipment installed in the resort when conducting the resort’s training programs for its customers. The aim of the training programs was to provide all the resort instructors with the essential skills and information to conduct safe and successful programs in the areas of Challenge Rope Courses, Team Challenge Pyramid, Flying Fox and Abseiling. The quotations were submitted and the Managers issued the purchase orders in April and May 2000. Apart from the quotations and the purchase orders, there was no formal contractual arrangement between the Suppliers and the Contractors.46        Mr Hope said that in putting together the rescue kit he had regard to the manufacturers’ information relating to the stop descender, the situations likely to be faced by persons using the adventure courses at the resort and the fact that the instructors would need to carry the rescue kits on their backs, which accordingly had to be as light as possible. The rescue kit comprised, among others, the backpack, pliers, knife, rescue pulley double sheave, rescuemate pulley, stop descender, 9mm rope cum mantel (33 m per rescue pack), 4 karabiners, prussic cord large, prussic cord small, tube tape 2 m length, figure 8 descender and 2 lobster claws. The stop descenders were purchased from SRTE Australia, Single Rope Technique Equipment.47        The stop descender was supplied with a booklet from SRTE containing the manufacturers’ information and instructions about, inter alia, the stop descender. Mr Hope, however, did not supply the Managers a copy of the booklet. As a result the Operators did not have a copy and their employees, the instructors at the resort, did not have the opportunity to study them.48        At page 24 of the booklet, it is stated that generally the rope according to the specifications should flow freely through the stop descender. However, it was noted that when conditions are at their worse, wet and muddy, descending may be extremely slow and difficult on stiff or larger diameter ropes. The manufacturers therefore suggested that the users’ repelling tactics should be modified accordingly. It was emphasized that the ‘HANDLE’ is the primary control mechanism-“squeezed to GO—let go to STOP. Then followed the important advice to “(h)old the Tail End of the Rope at all times not only for balance but as your secondary control mechanism.” The instructions went on to recommend the use of a Safely Belay at all times.49        Mr Hope referred to the booklet to confirm that the stop descender was suitable for use with ropes between 9mm and 12mm, provided that an adjustment is made to the stop descender to suit the rope used. He said he told the manufacturers about his intention to use the stop descender with a 9mm rope. The internal camming mechanism should be adjusted to a 9mm rope. In this case, Mr Scott found that the stop descender was not set to maximum. In response to this observation, Mr Hope referred to the comments of some staff (unidentified and not called as a witness) that at worst was that the load on the rope may creep and not free fall. The point is that as long as the size of the rope was between 9-12mm, the stop descender should not fail, regardless of the rope adjustment setting from maximum to minimum friction.50        Mr Hope explained that he decided to include the prussic loop because he took a conservative view as to the safety of persons in belaying situations. But it was imperative to set the length of prussic loop having regard to the height of the person belaying and the position of the stop descender. He should have said in his affidavit evidence that it was important to ensure that the small prussic rope (the knot) wrapped round the larger rope (tail end of the static 9mm rope) did not come in contact with the stop descender. He also claimed that he always taught the person using the prussic loop that he must at all times keep a brake-hand upon the rope.51        Against this, Ben and several instructors gave evidence that Mr Hope did not teach them about these at all. Mr Hope told them that the stop descender would stop the fall once the handle was released. Ben, Lee Tuck Hume, Omar Rosli, Jaime Chua and Denise Oi all gave the following evidence. They were taught that the double fisherman’s knot of the prussic loop was to be tied. The two ends of the prussic loop would stick out from the knot about 1 to 1 ½ inches. All instructors were required to prepare the prussic loop in the same way to get the same length. These witnesses also told me that there were no instructions to vary the prussic length according to each instructor’s height or for any other factor. They also said that in a rapid descent they were told to take their hands off the stop descender and the prussic loop. They were assured that the stop descender would work every time. Mr Hope had given the instructors training manuals. In none of the 6 manuals was it mentioned that the prussic length should be varied from person to person. On 17 December 2000 during the tests both Mr Russell Moy and Richard Delaney found that the instructors were still using  the prussic loop in the way they were taught. Mr Moy noted that “the prussic did not work because the lanyard was too long and therefore the prussic knot simply rested on the stop descender not allowing it to get tight and grip the rope.” Mr Delaney observed that “Ubin staff set the PL too long and this meant that it came in contact with the Stop Device. For a prussic knot to “grab” the rope, it should not be in contact with anything but the rope.”52        Mr Richard Delaney, a consultant of the Suppliers, gave evidence. He said that the stop descender is functional and safe when used correctly in accordance with manufacturers’ instructions. As long as the diameter of the rope is within the manufacturer’s specifications, the stop descender is functional and safe. What the rope adjustment setting does is to change the friction setting for the SD lever, making it easier to squeeze with varying rope diameters. The functionality and safety of the Rescue Kit should be evaluated in its totality and not its component parts in isolation. He was of the view that the Rescue Kit as a whole was functional and safe.53        Mr Richard Delaney referred to his preliminary views in his report of 18 April 2001. On hindsight he believed by the time he gave affidavit evidence in September 2002 ‘went beyond the basis for those views’. The reasons were these. First, the tests were not conducted in a scientific manner but rather to observe the resort staff demonstrating the lowering procedure. Secondly, only one test was conducted for each of the loads of 50 kg, 65 kg and 80 kg and the test methods might have been inconsistent. Lastly, he had not tested the stop descender with an 11mm rope.54        He opined that the cause of Ivy’s fall was probably ‘operator’s error’. Ben had successfully lowered Frederick who was 86 kg. He surmised that Ben might have accidentally squeezed the lever fully, instead of in a controlled manner and before his brake-hand was in a ready position. When he saw Ivy falling he panicked and did not let go the lever of the stop descender and grab the tail end of the rope. He said: “With the prussic set too long, it also fails to arrest the descent”.  The prussic, if it abutted the stop descender, would also not stop the fall. He further postulated that after lowering Frederick, Ben retrieves the rope and threads the stop descender incorrectly. He then attempts to lower Ivy. If threaded incorrectly, the rope would run freely through the stop descender and provide minimum friction.55        In my judgment there was no wrong threading of the rope. The lever of the stop descender, as shown in the demonstration, would remain stiff. The lever would not budge from the open position because of the force of the load on the rope. Secondly, the force required at the brake-hand to prevent descent would increase three-fold. Thirdly, if the rope was soaked, as indeed was the rope on the rainy day in question, the force on the brake-hand would be even greater. This was due to the fact that wet rope generates less friction. Fourthly, the descent of Ivy, if the rope was wrongly threaded, would have become a very slow process. Fifthly, if the rope had been wrongly threaded, it would have been discovered by Lee Tuck Hume. He was the first person to have checked the stop descender after the incident. Finally, I accept Ben’s evidence that he found, as was demonstrated in court, it was easier to squeeze the lever of the stop descender to retrieve the rope after lowering Frederick.",
        "Findings of Court": "56        Having regard to all the evidence seen and heard in court, I find that the cause of Ivy’s free-fall was not due to any error on the part of Ben. Ivy was suspended on her harness and the stop descender initially held her up. Ben then press the stop descender and released but Ivy then had a free fall. This was due to the stop descender being unable to stop the very wet 9mm rope from slipping through it, resulting in Ivy falling to the ground. I accept Mr Scott’s evidence that the 9mm rope with the factory setting was incompatible and this was aggravated by the fact that the rope was very wet by the time it was used to lower Ivy. In the case of Frederick, he was successfully lowered because Ben controlled the lever and the rope had just been taken out of the rescue kit, where it was kept dry, and in the short time it was threaded through the stop descender it could not have been too soaked with rain.  By the time the rope was used on Ivy it was too soaked in rain water. I had no reason to believe that Ben would not have controlled the lever of the stop descender in just the same manner as he had controlled it for the descent of Frederick.57        Ivy would not have fallen if the prussic loop had been operated by Ben in the manner it should have been operated. Ben did not ensure that the length of the prussic loop was sufficient for it to be so taut that the knot could grab the tail end rope effectively stopping the descent of the rope. But Ben was not at fault. He was taught by Mr Hope to hold on to the knot so that the tail end rope could pay out as the loan descended and that if he let go his right brake hand the knot would go up to the stop descender thereby stopping the descent. The manufacturers instructed, and this was amply proven during the demonstrations to and by the court, that an operator of the lowering system must ‘hold the Tail End of the Rope at all times…as (your) secondary speed control mechanism’, only allowing the paying out of the rope gradually through the knot in the process of controlling the descent. In the event that the right brake hand is taken off the tail end rope, the prussic loop (of the right and  sufficient length) would have become taut and the knot would have tightened and ‘grabbed’ the tail end rope, thereby preventing the tail end rope from further slipping through the stop descender in its descent. In my view, it is very clear on the evidence that Mr Hope did not teach the instructors of the Operators adequately. In consequence, the secondary fail-safe system also failed. The Suppliers, as the suppliers of the stop descender and the training of the instructors through Mr Hope, must be entirely to blame for the incident. They unquestionably owed a duty of care to Ivy and to the Managers and Operators of the resort. The scope of the duty of care is concomitant with the implied terms, which I am setting out in the following paragraph.58        Contractually, as between the Contractors and the Managers,  there was a implied term of their agreement that the Contractors were required to design and supply the stop descender and the prussic loop which were fit for the purposes of the Ubin Adventure Centre instructors. In my view, there was also an implied term that there shall be proper and adequate training and instructions on the operation of both the stop descender and the prussic loop. In my judgment, the Contractors had breached those implied terms of the agreement. The stop descender had a pivot bolt nut setting which was incompatible to function effectively with the 9mm rope supplied during wet weather usually encountered in Pulau Ubin. As regards the training, Mr Hope failed to instruct and to ensure that each instructor knew it was important to adjust the length of the prussic loop to achieve ‘grabbing’ of the tail end rope in a free fall as a secondary control mechanism.59        Similarly, as between the Contractors and the Suppliers, those implied terms are applicable and there had been similar breaches of those terms.",
        "Quantum of Damages": "60        I now turn to the quantum of damages payable to Ivy. Parties have agreed on the sum of  $82,544.97 as special damages and  other items which I will set out later. There remains three heads of claims: (a) the compensation for pain and suffering and loss of amenities; (b) post-writ to pre-trial loss of earnings; and (c) future loss of earnings.",
        "Ivy’s injuries & background": "61        As stated earlier, Ivy suffered multiple rib fractures from the 4thto 9thribs on her right chest and a fractured dislocation of the T8 vertebra and the burst fracture of the T12 vertebra resulting in paralysis from the waist down and the loss of bowel and bladder control.62        In April 1994 Ivy graduated from Ngee Ann Polytechnic with a diploma in accounting. She chose that profession so that she could start working earlier to earn money to take care of her parents and contribute to the household expenses as soon as possible. She kept her sights to become a qualified accountant. She studied part time and achieved her goal of passing the Association of Chartered Certified Accountants (“ACCA”) examinations within 5 years. It was a credible performance, seeing the very low passing rate for the ACCA examinations. Showing her drive, she left her first job after 5 years and joined a larger organisation to upgrade herself. She was confirmed in her new job within a year and was promoted with a 28% increase in salary. At the time of her most unfortunate and serious injuries, she was holding the post of Senior Accounts Executive with an annual remuneration of more than $40,000. She became a Certified Public Account just about a month before the incident when she was 26 years of age.63        Ivy did not just work on “numbers”. In Trans-Link, she was leader of her Wits team. When she was with her first employers, Toys “R” Us, she set up the Novell Network System, the server network for all individual personal computers in the firm. In her 6 years of working, her base salary increased by more than 230%. In Ngee Ann Polytechnic, for a total of 24 subjects she obtained 7 As, 10Bs, 6 Cs and 1 D for the examination she took in Ngee Ann Polytechnic.64        Mr Chan Ket Teck, a partner of PricewaterhouseCoopers, gave evidence as an expert witness for Ivy’s claim for loss of earnings. Mr Chan’s credentials were not in issue. In his report, he set out 3 possible scenarios for the career progression and remuneration of an accountant with similar qualifications and experiences to those of Ivy, namely (a) Scenario (1) a competent performer, i.e. an accountant whose performance meets the minimum expectation of the job; (2) A praiseworthy performer, i.e. an accountant of above average performance; and (3) an outstanding performer, i.e. an accountant who is a high flyer with excellent performance. Mr Chan advisedly projected that it is highly probable that Ivy would have proven to be between a praiseworthy to an outstanding performer. In making the computations, Mr Chan had not taken into account any annual salary increment into account. For the entire 15 year period, the employer’s CPF contribution is based on the current rate of 16% of the employee’s salary, with a maximum contribution of $11,500 on ordinary wages per year.65        Mr Chan recognized that Ivy’s prospective career path post the accident would depend on several factors, including the economic situation, the industry she would be employed in, the nature of the company she is working for and the most importantly her performance. For scenario 1, which would be the slowest career progression and minimum salary for an accountant whose performance meets the minimum expectation of the job. Such a person would have been engaged as a Senior Accountant at a base annual salary of $40,000 in January 2001. After a 4 year period, he would have been promoted to Accounting Manager at an annual salary of $55,000. After 5 years, he would be promoted to Finance Manager at an annual salary of $70,000. Mr Chan opined that over a period of 15 years, such a person would likely earn a total remuneration of $1,168,000 (amount is rounded).66        In scenario 2, Mr Chan had in mind an accountant of above average performance, with initiative and the ability to work independently and be responsible for strategic planning, development and management of the business. Such a person would progress from being Senior accountant to Accounting Manager in 3 years and after 3 years he would be promoted to the post of the Finance Manager at the annual salary of $95,000. He would probably move to the post of Financial Controller after 4 years, at an annual salary of $130,000. The next corporate grade would be Chief Finance Officer at a salary of $165,000 which could be reached within the next 4 years. In this scenario, he would have earned a total remuneration of $2.3 million  (in round figures).67        In scenario 3 is the case of an outstanding performer who is a high flyer with excellent performance. He is also innovative, highly motivated and would ultimately lead a team of finance and treasury professionals to support the Chief Executive Officer in steering the company to achieve its business plans in Singapore and the region. Such a person would be a Senior Accountant for 2 years, then Accounting Manager at the annual salary of $80,000, and after 2 years further promoted to Finance Manager at an annual salary of $110,000. He would then have moved on to Financial Controller after 3 years, at an annual salary of $160,000. The next corporate grade would be Chief Finance Officer at an annual salary of $200,00 which could be reached within 3 years. Within 4 years the high flyer could be promoted to the senior Chief Finance Officer, such as Regional Chief Finance Officer, at an annual salary of $250,000. Such a high flyer would have earned $3.35 million (in round figures) over 15 years from January 2001.68        On the basis of Ivy’s track record of progression in her employment Mr Chan opined that Ivy is an above average performer. He said that Ivy “would earn a total remuneration between $2.3 million and $3.4 million (including bonuses, allowances and CPF contributions over the 15 years following her accident.69        Mr Kaka Singh, who practice as an auditor but who has substantial experience about careers in the accountancy profession, gave evidence for the Managers, Operators, Contractors and Suppliers. He disagrees with Mr Chan and does not think that Ivy is such an above average person based on her ACCA pass rate. He is of the view that Ivy is an average/competent accountant. But both of them agreed on what an average/competent accountant could earn.70        Parties opposing Mr Chan’s opinion contended that a number of factors militate against the 3 scenarios postulated by him. The very poor economic outlook was not sufficiently considered. Mr Chan relied on the report of Watson & Whyte regarding salary levels. Unlike the broad based report of the Ministry of Manpower, Watson & Whyte’s statistics included those from comparatively higher salaries paid by multi-nationals. There were also prospects of a need for fewer accountants in Singapore. Mr Kaka Singh is of the view that the basis of promotions every 3 to 4 years is too optimistic.71        In cross examination, Mr Chan confirmed that in a cohort of say 300 accountants only 10% make it to Chief Financial Officer. He also confirmed that only 1% rise to the rank of partnership in his firm.72        Counsel for the Suppliers noted that Ivy’s past earnings after 6 years of employment was in the range of $2,700 per month. This ranked about the bottom 25% quartile of the accountants as per MOM’s survey. That Ivy took 5 years to obtain her ACCA is commendable but it was pointed out that top accountant students obtain such qualifications within 2 ½ years. Mr Kaka Singh also referred to the fact that Ivy has no background experience of working in any large accounting firm. Without such experiences, Ivy’s chances of becoming a CFO or a Financial Director of a  large corporation are remote. Mr Kaka Singh also referred to the average performance of Ivy in her Diploma in Accounting and in her school and polytechnic life.73        It was submitted by counsel for the Operators that all considered Ivy would probably rise to the ranks of a Manager at an annual salary of $80,000.74        In my judgment Ivy will be a moderately above the average accountant. She is slightly better than the average accountant. Though she has drive, the opportunities may be harder to come by. Her prospects are constrained by her past working experience and limited exposure and by the accountancy world she will be facing in Singapore, with all the chances and changes of a globalised mature economy.75        The case ofChan Heng Wah v Peh Thiam Choh[1986] 2 MLJ 175 illustrates a helpful approach when assessing the probable earning prospects of an average professional. The damages for ‘lost years’ of a 20 year old 2ndyear medical student were to be assessed. The court was invited to assess damages on the average of a Medical Officer’s salary and Superscale A salary in Government. The court declined because of the high degree of speculation that the plaintiff would attain Superscale D1 or Superscale S. The Court found that the plaintiff could rise to the level of a Registrar. The multiplicand was calculated at $66,494.34 taking into consideration the annual pay of a Registrar less tax liability and adding CPF benefits.76        Reference was referred as a matter of interest (and not as a matter of reliance by counsel for the Operators) to the so-called ‘median approach’ of the courts. InLai Chi Kay v Lee Kuo Shin[1981] 2 MLJ 167 the future lost earnings of a young 24 year old Hong Kong 4thyear medical student was assessed by the Court as the average between the maximum and minimum in the salary scale for government doctors in Hong Kong. The multiplier awarded was 15.77        It was pointed out to the court that Ivy is mentally active and alert. She can do accounting related work from home if she is minded to. The possibilities for home-based work are growing, with internet and e-mail facilities. Alternatively, she is capable of giving tuition to students up to Junior College level. I agree.78        Taking all factors into consideration, and doing the best, I would assess her future earning prospect as $80,000 per annum. There must be deducted tax liability and added the employer’s CPF benefits.79        I now come to assess the damages for pain and suffering. Ivy suffers from, as noted earlier, lower limb paralysis with loss of sexual function, bladder and bowel dysfunction. InCheng Chay Choo v Wong Meng Teck[Oct 1992] K S Rajah JC awarded $120,000 for a similar below the waist paralysis. InNg Song Leng v Soh Kim Seng Engineering & Trading Pte Ltd[1997] [unreported] this court awarded $160,000 to a 29 year old man who had complete paralysis below waist and in addition he had partial paralysis of his upper limbs. I would award Ivy $130,000 for pain and suffering.80        As for the multiplier, Ivy’s counsel submits it should be higher than 18, relying onTeo Seng Kiat v Goh Hwa Teck[2003] 1 SLR 333. InNg Song Leng v Soh Kim Seng Engineering & Trading Pte Ltd(supra) I provided 15 years as the multiplier. It seems to me that we have to be careful to hold the line or damages would escalate. The multiplier should be 15 years.81        Ivy is seeking damages of an unspecified amount for future medical complications. There was also no agreement on Ivy’s pre-trial loss of earnings from November 2001 to date of trial, January 2003. Ivy is seeking more than $2,700 per month on the basis that she would have had a promotion or salary increase between Nov 2001 and Jan 2003. More evidence and submissions are required on these issues.82        Subject to the issues reserved above, the damages payable to Ivy are as follows:(a) Pain and suffering                            $  130,000.00(b) Loss of Future Earnings       (parties to work out the figures)(c) Future Medical Expenses                 (to be assessed)(d) Future nursing care (lump sum)        $100,800.00 (agreed)(e) Wheel chair (lump sum)                   $  12,600.00 (agreed)(f) Mattress (lump sum)                         $    3,770.00 (agreed)(g) Commode etc (lump sum)                $    6,060.00 (agreed)(h) Special damages                              $   82,544.97 (agreed)(i) Pre-trial earnings & CPF                           (to be assessed)83        There will be judgment accordingly. Parties are to work out the arithmetic and settle the draft orders, including the appropriate orders as to costs. Parties are directed to attend a hearing before me to finalise the outstanding matters.Plaintiff’s claim is allowed with costs.Copyright © Government of Singapore."
    }
}