{
    "case_title": "Lam Hong Leong Aluminium Pte Ltd v Lian Teck Huat Construction Pte Ltd and Another",
    "ncitation": "[2003] SGHC 53",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "1.         Lam Hong Leong Aluminium Pte Ltd (the plaintiffs) are specialist aluminium cladding contractors.  Lian Teck Huat Construction Pte Ltd (the first defendants) are building contractors whose managing-director is Chew Joon Huat (Chew) the second defendant. 2.         By a letter dated 6 April 2000 (the Letter of Award) from the first defendants to the plaintiffs, the first defendants agreed to employ the plaintiffs as subcontractors to design, supply, fabricate and install aluminium cladding to the external walls of a building situated at No. 80, Genting Lane, Singapore, known as Ruby Industrial Complex (the Building); the Building comprises of two (2) 11 storey blocks, one called Tannery and the other Genting.  The Letter of Award accepted the plaintiffs' (revised) quotation dated 14 January 2000 (the quotation) save that the sum stated in the quotation  was $1,228,155 whereas the four (4) sums stated in the Letter of Award totalled $1,102,875.  Except for the first item ($918,675/-) which rate (at $135 per sq. m) was subject to ‘as built’ quantity measurements, the figures set out in the Letter of Award were stated to be lump sums.  The plaintiffs in turn subcontracted fabrication of the panels to Vanson Engineering (S) Pte Ltd (Vanson), a company related to them by common shareholders; installation of the panels was subcontracted to yet another party.  The first defendants had themselves been awarded the main contract for the refurbishment of the Building (the project) by the management corporation of the Building namely MCST No. 736 (the MC).  The refurbishment work included changing/replacing the existing windows, plastering and painting works.  The first defendants employed other subcontractors besides the plaintiffs.  However, the plaintiffs' subcontract was by far the biggest portion (about 50%) of the project.  The architects appointed by the MC for the project were Dang Design Architects & Associates (the Architects). 3.         The main terms of the subcontract as reflected in the Letter of Award and quotation are as follows: (i)         the plaintiffs would abide by the master building programme (49 weeks) of the first defendants under the main contract, which commencement date was 3 March 2000; (ii)        the completion dates for the subcontract and main contract works were set at 10 February 2001 and 10 March 2001, respectively; (iii)       the plaintiffs would provide shop-drawings commencing four (4) weeks from the Letter of Award; (iv)       the defendants would pay the plaintiffs on progress claims within 30 days of submission less 5% retention monies which will only be released upon completion (2.5%) and upon expiry of the maintenance period (the balance 2.5%); (v)        if the first defendants were late in paying the progress claims, they would be liable to pay the plaintiffs an additional 1% of the claimed amounts; (vi)       the plaintiffs were required to enter into a subcontract with the first defendants on the same terms and conditions as those in the main contract between the MC and the first defendants; (vii)      in the event completion was delayed, the plaintiffs would pay to the first defendants liquidated damages at $500 per day; (viii)      any costs incurred by the first defendants in correcting defective works or in taking measurements to ensure performance of the works within the contracted period would be deducted from sums payable to the plaintiffs or charged to them in the event such costs exceed sums due and owing to the plaintiffs; (ix)       the first defendants would provide inter alia, external scaffolding, a crane and gondola(s) to enable  the plaintiffs to hoist materials to designated areas at each storey; (x)        the plaintiffs' acceptance of the Letter of Award would be treated as the official instruction to proceed. 4.         Notwithstanding item (vi) above, no subcontract as such was ever executed between the parties, let alone on the terms and conditions set out in the main contract.  Neither were the plaintiffs shown the main contract or told its terms and or conditions.  The main contract between the first defendants and the MC incorporated terms and conditions prescribed by the Singapore Institute of Architects (SIA). 5.         The first defendants' master programme was faxed to the plaintiffs on 6 June 2000; the plaintiffs were required to commence work on that day itself (on the Genting block) and complete the works by March and April, 2001 respectively, for Genting and Tannery blocks.  The plaintiffs responded (on 20 June 2000) with their own installation programme, which showed a starting date of 7 June 2000 for the Genting block.  The plaintiffs received no response from the first defendants to their installation programme; neither did they receive any other installation programmes from the latter.  Consequently, the plaintiffs commenced work on the Genting block in accordance with their own installation programme. 6.         The plaintiffs commenced submission of shop drawings for the Genting block on 19 May 2000 followed by those for Tannery block on 5 June 2000.  Final submissions for the Genting block were made on 18 October 2000.  The plaintiffs submitted their colour chart on 11 May 2000 and the Architects selected four (4) colours on 7 July 2000, followed by another two (2) on 14 July 2000.  The plaintiffs followed up with submission of colour samples (2) on 28 July 2000.  The Architects confirmed the colour location of the panels on 6 September 2000 for Genting block.  In the quotation (see 6AB 3 item [g]), the plaintiffs had estimated that submission of shop drawings would commence four (4) weeks after the award, procurement of materials would take 6-8 weeks after approval of shop drawings, followed by another 7-8 weeks for fabrication and installation. 7.         According to the plaintiffs, they completed installing aluminium panels on the Genting block by end March 2001, save for those panels located at windows, tie-backs of the scaffolding and at the scaffolding's platform at the first storey.  The plaintiffs were unable to install those panels due to the first defendants' outstanding rectification works at those areas.  As for Tannery block, the plaintiffs completed installing the panels by end May 2001 except for those areas similar to Genting block, where the first defendants' rectification works were outstanding.  The plaintiffs claimed they could install the remaining panels only after the first defendants had dismantled the obstructing scaffolding. 8.         The plaintiffs submitted two applications for extensions of time (EOT) for the duration of the subcontract, the first by a letter dated 10 July 2001 (see 1AB 34) followed by a subsequent letter dated 31 October, 2001; however, the first defendants did not respond to either request and no EOT was granted to the plaintiffs.  According to the plaintiffs, the EOT applications were necessitated by the first defendants' late approval of shop drawings, colour confirmation, confirmation of reference levels and setting-out data.  In any case the plaintiffs contended, the completion dates were revised repeatedly at site meetings with the Architects so much so that up to the trial dates, no completion date was actually set.  No delay certificates were ever issued to the plaintiffs for late completion. 9.         Another factor which contributed to the delay encountered by the plaintiffs was the slow, irregular and haphazard inspections conducted on their completed works by the only clerk-of-works employed by the MC.  The plaintiffs relied on the many letters they wrote to the first defendants in that regard, between September and November 2001. 10.       Despite a term in the contract requiring progress claims to be paid to the plaintiffs within 30 days of submission, the plaintiffs complained that the first defendants did not pay promptly sums which were due.  Indeed, the plaintiffs claimed, the first defendants failed to make any payment after 10 August 2001 when the 8thprogress claim was paid.  Further, the the first defendants consistently failed to pay the progress claims in full.  As at 25 December 2000, the plaintiffs' progress payments totalled $246,522.15 but the first defendants only paid $50,000; no further payments were made in January and February 2001.  The plaintiffs' subsequent progress claims, namely 12th(dated 27 August 2001), 13th(dated 25 September 2001) and 14th(dated 25 October 2001) were never paid on their due dates or at all. 11.       As a result, See Choon Howe Jeffrey (See) a director of Vanson met the second defendant on 19 February 2001; the latter promised payment soon.  When the promised payment did not materialize, the plaintiffs wrote to the first defendants on 7 March 2001 to request for payment of $150,000 by 9 March 2001.  The deadline for payment came and went; the first defendants did not make any payment. 12.       Concerned about the first defendants’ non-payment which was causing cash-flow problems for the plaintiffs/Vanson, See discussed with the plaintiffs the possibility of obtaining a guarantee of payment from Chew for the outstanding progress claims which, as at 21 March 2001, totalled $529,875.  The plaintiffs agreed with his suggestion and See was tasked with obtaining the guarantee from Chew. 13.       On or about 5 April 2001, See met Chew and requested a personal guarantee from him.  Chew agreed and provided the plaintiffs with a guarantee (the first guarantee) on the first defendants' letterhead in the following terms: 5 April 2001 Dear Sir, Proposed refurbishment works to Genting and Tannery blocks of Ruby Industry Complex, MCST No. 736, 80, Genting Lane, Singapore I, Chew Joon Huat, NRIC No. S/1218091/H, the Managing Director of Lian Teck Huat Construction Pte Ltd, hereby guarantee the payment for the above-mentioned project will pay you accordingly as per our letter of award ref: LTH/GL/jo/2099-00, dated 6/4/2000. Yours faithfully Lian Teck Huat Construction Pte Ltd Signed:… Chew Joon Huat 14.       Noticing that the document was on the first defendants' letterhead, See was afraid Chew would renege on his payment obligation.  Consequently, in mid-April 2001, See met Chew again and procured a fresh guarantee (the second guarantee) from him in the following terms: 22 April 2001 I, Chew Joon Huat (NRIC S1218091/H) assure will pay to Lam Hong Leong Aluminium Pte Ltd all progressive payments according to the Lian Teck Huat's Certificate for the Aluminium Works in Contract no. LTH/GL/jo/2099-00. Signed by: … Chew Joon Huat 23 April 2001 When cross-examined, See revealed he had instructed Chew on the wording required for the first guarantee and the latter then typed it out.  In essence, he had told Chew to give the plaintiffs a letter to the effect that if the first defendants could not pay, Chew would.  See could not explain why the second guarantee bore two dates, nor could he remember whether he obtained the document on 22 or 23 April 2001.",
        "The claim": "15.       Notwithstanding the first and second guarantees however, Chew did not pay the progress claims due and owing by the first defendants.  Two (2) cheques which the first defendants issued in purported payment of the 12thprogress claim and outstanding sums, dated 28 September 2001 and 5 November 2001 in the sums of $100,000 and $50,000 respectively, were dishonoured when presented for payment  by the plaintiffs.  Consequently, the plaintiffs commenced these proceedings on 27 November 2001, claiming the sums of $502,810.69 and $12,571.48. 16.       After filing the writ/statement of claim, the plaintiffs applied for and obtained, summary judgment against the first defendants in the sum of $100,000 on 30 January 2002.  The amount of the plaintiffs' claim to be tried (pursuant to the Order of Court dated 30 January 2002 granting unconditional leave to defend to both defendants) was thereby reduced to $325,810.69.",
        "The defence and counterclaim": "17.       In their defence, the defendants did not dispute the terms of the plaintiffs' employment as subcontractors.  They relied on cl 13.1.b. of the Letter of Award which states: 5% of the value of work done will be retained for each payment made for their contention that certification by them (which the plaintiffs disputed) was a prerequisite to payment of the plaintiffs' progress claims. 18.       Chew denied that he had agreed to be personally liable for the plaintiffs' claims, pointing out that he had executed the first guarantee as the company's managing-director on the first defendants' letterhead.  At best Chew contended, the first guarantee constituted a non-binding letter of comfort.  In the alternative, Chew pleaded that no consideration was provided by the plaintiffs for the first guarantee.  In any event, the first defendants were not in default of payment at the material time. Chew repeated these defences for the second guarantee.  He had a further alternative defence for the first guarantee; he contended it was revoked by the second guarantee. 19.       As at end-October 2001, when the plaintiffs presented their 14thprogress claim, the defendants contended that the plaintiffs were only entitled to payment in the amount of $285,836.33 and even then, payment was subject to the plaintiffs' installing the then outstanding 406 panels and replacing/rectifying installed panels which had been rejected by the MC's clerk-of-works. 20.       The defendants alleged that the plaintiffs failed to carry out installation of the panels in a workmanlike manner in accordance with specifications or, with due diligence; insufficient manpower exacerbated the delay. The delay entitled the first defendants to impose liquidated damages at $500 per day with effect from 11 February 2001, totalling $182,500 as at the date of the defence (11 February 2002). They alleged that the delay caused the first defendants to be late in turn on the main contract and resulted in payment to them of $276,483.34 being withheld by the MC.  The delayed works also caused the first defendants to incur additional costs in maintaining a boom, a gondola and scaffolding at the site, amounting to $193,507.93.  The first defendants further alleged that the plaintiffs stopped work on or about 6 November 2001 and failed to return to the site until the close of that month. 21.       As for the two (2) dishonoured cheques, the first defendants averred they actually stopped payment on those cheques because of the plaintiffs' persistent slow progress and also because the clerk-of-works frequently rejected their completed works. 22.       The first defendants counter-claimed against the plaintiffs:- (i)         $182,500 by way of liquidated damages (as at 9 February 2002); (ii)        further liquidated damages at $500 per day payable by the first defendants to the MC; (iii)       the sum of $193,507.93; (iv)       the sum of $150,000 being the proceeds of the first defendants' two (2) cheques; (v)        the sum of $276,483.34 withheld by the MC; (vi)       damages for breach of contract.",
        "The evidence": "",
        "(i) the plaintiffs' case": "23.       The plaintiffs called three (3) other witnesses for their claim besides See (PW2).  Their other witnesses were their contracts manager Lee Eng Cheng (Lee), Roger Tan Kia Hock (Tan) a quantity surveyor and Ng Hock Wah (Ng) the project manager of Vanson.  From the outset, I had informed counsel that I would only determine the issue of liability for both the claim and counterclaim.  Consequently, the evidence of Tan (who was called as an expert) would only be considered in so far as it touched on the issue of delay.  His report assessing the value of the work done by the plaintiffs would not be relevant for present purposes.  It is only if the plaintiffs succeed on their claim that Tan's valuation would become relevant, for purposes of assessment by the Registrar, of the quantum due to them. 24.       Lee's testimony focussed on rebutting the defendants' allegation of delay on the plaintiffs' part.  Lee (PW1) relied heavily on documents to support his contention that the plaintiffs had proceeded diligently on the subcontract works.  In particular, Lee referred to the plaintiffs' letters to the defendants applying for EOT (which was his responsibility) voicing dissatisfaction with the inspections carried out by the clerk-of-works and, highlighting the fact that other subcontractors of the first defendants caused delays which hindered the plaintiffs' works. 25.       In relation to the outstanding (406) panels to be installed by the plaintiffs, Lee's testimony posed a 'chicken-and-egg situation'.  On the one hand, the clerk-of-works refused to allow the first defendants to dismantle the scaffolding until all the dented and badly scratched panels were replaced.  On the other hand, unless the scaffolding was dismantled, the plaintiffs could not install the remaining panels.  As at the date (13 August 2002) he affirmed his affidavit of evidence, Lee deposed that the plaintiffs could not proceed to install the panels for the main entrance canopy at the existing guardhouse, nor the new canopies at the Genting and Tannery blocks, as the first defendants' own works had not been completed. 26.       As for the plaintiffs' progress claims, Lee deposed it was the practice to base their claims on actual quantities of panels supplied and installed.   However, between 23 December 2000 and 8 August 2001, the first defendants consistently paid less than what the plaintiffs claimed.  The plaintiffs had written to the first defendants on many occasions to protest against such underpayment, but to no avail.  The plaintiffs' numerous requests to the first defendants for copies of the Architects' certificates and for joint site measurements also went unheeded until 3 January 2002, when the measurements for the Genting block were finally taken. Thereafter, the defendants claimed to be busy when the plaintiffs requested site measurements to be taken on 11 January 2002 of the Tannery block.  Lee testified that the joint site measurements of the Genting block showed 4,129.4 sq. m of aluminium panels had been installed against the contract quantity of 3,925 sq. m; the excess of 204.4 sq. m was therefore payable to the plaintiffs which, based on $135 per sq m, amounted to $27,594/- 27.       Lee relied on the Architects' certificates of payment to the first defendants to support his contention that the plaintiffs had substantially completed their works.  Indeed, the plaintiffs' works were amongst the highest percentages of completed works as compared with that of the other subcontractors.  The plaintiffs were not responsible for prolonging the main contract, contrary to the defendants’ allegation.  Consequently, there was no basis for the first defendants to counterclaim liquidated damages, losses and damages.  He pointed out that the terms of the plaintiffs' quotation which formed part of the Letter of Award, specifically excluded scaffolding, gondola, hoisting and general site preliminaries which were to be provided by the main contractor (the first defendants) at no extra charge.  For aluminium cladding at curved areas, the first defendants had to provide a gondola to the plaintiffs.  In any case, other subcontractors used the scaffolding besides the plaintiffs.  For other areas, the plaintiffs could not use the scaffolding but had to utilize other means of access to install the panels.  As such, the first defendants' counterclaim for additional rental of machinery was unfounded. 28.       Cross-examined, Lee said he was aware that under the SIA contract, a pre-condition for EOT applications was that they had to be submitted within 28 days of the occurrence of a delay factor.  He agreed that the plaintiffs' second application for EOT (made on 31 October 2001) was made well after 28 days of the occurrence of delay factors; the plaintiffs had requested 293 days' extension from the original completion date of 10 February 2001.  It should be noted however, that Lee never saw the main contract or its conditions, before the trial.  Lee said he relied on the project manager's (Ng's) feedback as well as his own site visit (in June 2001) for the necessary information to formulate EOT applications.  Consequently, he had little/no personal knowledge of the contents stated in his applications.  However, as he monitored payments from the first defendants, he was fully aware of their tardiness in paying.  Although he acknowledged the first defendants were only liable to provide scaffolding and a gondola for the plaintiffs' installation of panels for the duration of the contract, Lee asserted that if completion was delayed due to no fault of the plaintiffs, they should not be responsible for the additional cost of extended usage of those facilities. 29.       I turn next to Ng's testimony.  Being the project manager, Ng (known as Frankie Ng) was an important witness for the plaintiffs as he was on site (almost every day) for the entire project and attended most site meetings and inspections.  Ng (PW3) testified that the first defendants did not manage the project personally; they did not have a full-time project manager but only an assistant project manager (Leo Chin Jeow), who was assigned to the project on a full time basis only in September 2001.  Ng said he was assisted by See and he dealt mostly with the first defendants’ site project coordinator Cammy Tay Boon Jia (Cammy Tay). 30.       Cross-examined, Ng agreed that installation of panels had to be done on both blocks concurrently as the contract period was only ten (10) months.  With fabrication being done at Vanson's factory, the plaintiffs only needed workers to install the panels at site; the required manpower was 6-8 workers with each panel needing two (2) workers who could install between 150-200 panels a day.  As the plaintiffs installed more than 7,000 panels, that meant it took two (2) months to complete the installation process, barring unforeseen circumstances. 31.       When shown photographs (exhibitsD1andD2) which the defendants had taken, Ng confirmed that they showed the status of work at the site as at December 2001 and March 2002.  He blamed the first defendants for the plaintiffs' omission to carry out rectification works and for the delay in completion.  He disagreed that delay was mainly due to insufficient manpower being deployed for installation purposes although after 25 November 2001, the plaintiffs only had on average 1-3 workers at site (which Ng claimed was adequate to complete the outstanding works at tie-back areas and for inspection).  It was highlighted to him that for three (3) weeks in November 2001, the plaintiffs did no work.  Ng denied it was due to work stoppage – it was because the plaintiffs' workers were doing inspection of the panels at the factory together with the clerk-of-works.  Even though the inspection records (see 7AB 31-150) produced by the first defendants showed no inspections being done in November but only in September, 2001, Ng explained (N/E 62) it could be that those records were not in running order and may also not be exhaustive.  However, counsel then pointed out that site memoranda numbered 88 to 90 all dated November 2001 reflected inspections of painting not cladding, works having been conducted.  The only site memorandum (no. 91) dated 21 November 2001 relating to cladding works recorded that it was at a standstill. 32.       I should also point out that exhibitsD1andD2showed scaffolding at both blocks (second storey to the roof).   In fact, the scaffolding for Genting block was only removed in February 2002 whilst that for Tannery block was still up as at the date of trial.  In the course of Ng's cross-examination, it emerged that scaffolding was preferred by the MC/the first defendants to a boom lift for purposes of carrying out rectification/works, the reason being scaffolding took up less space particularly car-parking space, not to mention that a boom lift also had height constraints. 33.       In relation to shop drawings, Ng readily admitted that the plaintiffs were late in their submission.  Indeed as at 27 August 2002 (when he testified), the plaintiffs' shop drawings for the canopy had still not been approved.  One reason for the delay was due to numerous re-submissions having to be made by the plaintiffs.  However, Ng denied such re-submission was due to the plaintiffs' drawings not being in compliance with the contract and hence not approved by the Architects; he claimed it was requested by the Architects.  In this regard, counsel drew Ng's attention to the minutes of a site meeting dated 2 February 201 (at 3AB 79) where the Architects had recorded (in item 2.1) that the plaintiffs' previous submission of shop drawings for the main and lobby entrance canopies were skimpy and lacked details.  It was further recorded that the Architects were issuing a third reminder to the plaintiffs to visit the Architects' office to clarify and resolve all specialist and manufacturers' details; a deadline of9 February 2001was also imposed for completion and submission of all shop drawings.  Ng admitted that the plaintiffs did not comply with that deadline.  He further admitted the first defendants' allegation (N/E99) that the plaintiffs had removed 406 panels from the site (in early November 2001) without their consent but, added that some were returned to the site subsequently. 34.       Further cross-examination of Ng adduced evidence which showed the plaintiffs encountered problems with setting out the lines required for panel alignment before installation.  Ng disagreed with counsel that the setting out exercise was also delayed due to the plaintiffs' failure to take into account alignment of the existing windows, claiming that was outside the plaintiffs' area of responsibility.  Indeed, he suggested that the windows should be aligned in conformity with the plaintiffs' setting out lines not vice-versa, even if that meant that the window openings have to be changed.  Ng maintained that scaffolding was still up as at March/April 2002 not only because the plaintiffs' works were not approved by the clerk-of-works, but also those of other trades.  Pressed further on this point, Ng clarified his testimony to say the rectification works carried out by other trades had yet to be approved as at March/April 2002.  From a logistics viewpoint, unless the works/rectification work of other trades had been approved, it was unlikely that the clerk-of-works would have given the plaintiffs the green light to do installation. 35.       My view of Ng's testimony is, that the plaintiffs were late in completion of their works for a number of reasons some of which were attributable to the first defendants and, some to other parties.  I shall elaborate on this topic in my findings below. 36.       When shown photographs (at 7AB 343-344) which reflected damage done by the plaintiffs to plastering, painting and other works of other trades in removing installed panels for re-coating, Ng disagreed his company was at fault.  He justified damage to the plastering on the ground that the plaintiffs had to chip/hack away the plastering because the windows were not aligned.  I should add that Ng did not dispute that the clerk-of-works could reject panels which were discoloured, dented and scratched.  Letters of the plaintiffs were produced (in 6AB99-106) which showed they requested the first defendants for permission to remove 250 pieces of panels from the Tannery block in May 2002, for purposes of rectification.  Ng disagreed the high number of rejected panels reflected poorly on the plaintiffs' workmanship.  He further disagreed with counsel's suggestion that the reason for the clerk-of-works' slow and haphazard inspection was due to the plaintiffs' own haphazard requests for such inspections to be carried out. 37.       Counsel drew Ng's attention to the Architects' letter dated 22 November 2001 giving notice that liquidated damages would be imposed on the first defendants retrospectively, from 1 June 2001.  That was followed by the imposition of liquidated damages on the first defendants with a corresponding deduction of $182,500 ($500 x 12 months) from the Architects' interim certificate of payment dated 15 August 2002.  In a subsequent interim certificate dated 22 April 2002, the Architects made further deductions of $204,298.29 and $76,368 respectively, for 239 rejected/defective panels and cladding materials not delivered to site.  Like Lee, Ng admitted that the plaintiffs removed from site 406 panels in November 2001 without the first defendants' consent but, claimed some of those panels were returned to site subsequently.  In re-examination, he explained the panels were taken away as they were scratched/damaged and had to be rectified, this was partly because the plaintiffs had no storage space at site resulting in the panels being exposed to the elements.  Ng did not deny that the deductions made by the Architects related to the plaintiffs' works but, he disagreed that the Architects withheld payment from the first defendants between July 2001 and April 2002, due to the plaintiffs' continued delay in completing the cladding works.  Ng further denied that the plaintiffs were responsible for the Architects' imposition of liquidated damages on the first defendants. 38.       The plaintiffs' expert witness Tan (PW4) did not visit the site in connection with preparing his analysis of the delay in completing the cladding and canopy works.  He reasoned that site inspections/visits were unnecessary because one of his terms of reference was to assess the value of work as at 25 October 2001.  He relied on information furnished by the plaintiffs, records of meetings and reports, the Architects' certificates and correspondence between the parties, in the preparation of his report. 39.       Tan attributed the delay in completion to: (i)         the late approval of shop drawings, colour scheme selections, setting-out information causing the plaintiffs' tentative commencement date for fabrication (and installation later) of 1 July 2000 to be pushed back by three (3) months; (ii)        obstructions at site by scaffolding, late removal of tie-backs by the first defendants; (iii)       additional works being required for windows and openings which had been constructed out of tolerance; (iv)       disputes on protracted (and ad hoc) inspections and quality of the installed panels, with the clerk-of-works; (v)        adverse/inclement weather conditions; (vi)       the delayed works of other subcontractors; (vii)      the delayed works of the first defendants. 40.       Tan opined that installation for Genting and Tannery blocks appeared to be substantially completed by May 2001 and July 2001 respectively, as confirmed by the minutes of meeting held on 6 July 2001 done by the Architects which recorded that installation of panels for Genting and Tannery blocks was 96% and 95% respectively. 41.       Tan randomly analyzed site memoranda from no. 14 (dated 15 February 2001) to no. 73 (dated 21 September 2001) and concluded that some criticism of the plaintiffs' cladding and other works as defective were unjustified/unfair; indeed, some of the defective works were not the plaintiffs' at all and or was less serious than what was recorded.  Tan added that the comments of the clerk-of-works went beyond the requirements of the subcontract and the latter's demands were unreasonable; the clerk-of-works demanded replacement of panels which had minor scratches when the Architects (in October 2001) clarified that only panels which were dented and contained major scratches needed to be replaced.  He referred to the lack of storage space at site as a factor for damage to the panels and opined that was why panels which had been fabricated could not be immediately installed – they had to be first delivered to site, space permitting.  I should mention that the alleged lack of storage space was specifically denied by the first defendants' assistant project manager Leo Chin Jeow (N/E257) who complained that the panels were placed at the staircase area instead of in storage spaces (which he did not specify).  Tan's report stated that more than 50% of the panels for Genting block were delivered to site by March 2001. 42.       Although the first defendants did not grant the plaintiffs any EOT, Tan noted that the first defendants themselves applied for EOT from the Architects, on 11 July 2001.  He further noted that the first defendants' works (which were independent of the plaintiffs' works) for the lift lobby areas were incomplete as at 8 March 2002.   Tan further opined that the plaintiffs were entitled to EOT, based on cll 2.12 and 2.13 of the Letter of Award, largely due to the factors set out in para 39 above as well as the first defendants' failure to pay the plaintiffs' their progress claims promptly.  While the first defendants could have granted EOT to the plaintiffs based on adverse/rainy weather, Tan acknowledged that the first defendants did not have the contractual power to grant EOT in the following circumstances:- (i)         for late finalization of the requirements and shop drawings by the Architects and the MC; (ii)        prolonged inspections by and demands in excess of contract requirements by, the clerk-of-works; (iii)       delay in dismantling of the scaffolding. 43.       Tan concluded that it was not unreasonable of the plaintiffs to have completed the cladding works by October 2001 instead of by the contractual deadline of 10 February 2001.  Further, the delay in the completion of the works under the main contract was not the plaintiffs' fault.  Tan blamed the first defendants for not constructing the steel structures for and handing over the canopies to, the plaintiffs to complete the cladding works, a situation which persisted until end July 2002.  Consequently, the plaintiffs were not/are not liable for liquidated damages. 44.       As for the value of the plaintiffs' works, Tan assessed the plaintiffs' claim under progress claim no. 14 in the sum of $1,116,027.92 to be reasonable, noting that the first defendants themselves had submitted to the Architects a claim for $1,130,434.66, against which the Architects had certified payment in the amount of $1,311,184 under the main contract on 19 July 2001; the figure was subsequently increased to $1,393,560 on 2 April 2002 (before deduction of $204,298.25). 45.       Under cross-examination, Tan agreed with the sequence of work -- that other trades had to complete their works first (plastering, painting) before the plaintiffs could install the panels.  He did not determine the number of workers which needed to be deployed on site by the plaintiffs in order to complete the subcontract within 10 months.  Tan conceded the plaintiffs would be at fault if they were late in their submission of shop drawings or had to make re-submissions, to the Architects.  He pointed to the first defendants' EOT applications of, 23 days for late delivery of materials and 43 days for colour selection, as factors which would have delayed the completion date to end May 2001, not taking into account other delays caused by the first defendants. 46.       Tan testified the Architects had noted in the minutes of the site meeting dated 6 July 2001 (see 3AB107) that for Genting block, the plaintiffs had delivered 100% for materials, had done 96% for installation and, 99% for the roof.  As for Tannery block, the percentages were 95%, 40% and 98% respectively for materials, installation and the roof.  However, counsel for the defendants pointed out that those minutes merely reflected what the plaintiffsreportedto the Architects, not what wascertifiedby the Architects as the actual work done.   Counsel drew Tan's attention to the Architects' certificate no. 13 dated 19 July 2001 (3AB309) which showed 95%  done for cladding, 88% for materials delivered and 20% for the entrance canopy.  Indeed, as at 22 April 2002, under Architects' certificate no. 14B, 14.38% of cladding work was outstanding.  Tan explained that certification by architects for payment purposes was/is usually conservative, in order to avoid overpaying contractors.  A discrepancy of 5%-7% between the plaintiffs' percentages and the Architects' was not excessive.  He opined that panels were considered as part of cladding work if delivered to site, the reason being that actual installation forms a small percentage of and was the last part of, cladding work; costs would have been incurred by the plaintiffs to buy materials, paint the panels and install runners and mullions upon which the panels were mounted.  The panels were custom-made and specially coloured.  Consequently, they could not be used for other projects.  Even if the installed panels were not to the Architects' satisfaction, Tan was of the view that the plaintiffs should still be paid as there was a defects warranty period during which the plaintiffs would have to rectify whatever works rejected by the Architects.",
        "The defendants' case": "47.       I start my review of the defendants' case by looking at the written testimony of Chew (DW1) who alleged that the plaintiff's works were still not completed, even 1½ years after their completion date (10 February 2001).  Chew claimed to be on site every day and if not, his site supervisor (Ong Eng Guan) would be.  He admitted that the first defendants had works outstanding under the main contract comprising of the entrance canopy at the guardhouse and, the first storey lift lobbies of both blocks; he claimed they could not carry out those works because of the slow progress of the plaintiffs.  Chew asserted that not only were the plaintiffs not entitled to their claim, they had in fact been overpaid; they were in breach of contract and were liable for liquidated damages.  The plaintiffs' subcontract constituted a major part of the project and its completion was critical; any delay on their part would and did, affect other trades (including external plastering and painting).  Chew blamed the plaintiffs for the MC's loss of confidence in the first defendants, prompting the Architects not only to impose liquidated damages on but also to withhold payment due (since July 2001) to his, company causing cash flow problems. 48.       As for the guarantees, Chew claimed that the first guarantee was given after persistent requests from the plaintiffs, in order to persuade them to expedite their already delayed works.  It was not his intention thereby to personally guarantee payment by his company - why should he when the first defendants were then not in default of their obligations to the plaintiffs?  It was merely a non-binding comfort letter to reassure the plaintiffs that the first defendants would stand by the contract and pay the plaintiffs accordingly.  If indeed the first guarantee was/is valid, it was actually given by the first defendants, being issued on the company's letterhead.  Chew further pointed out that there was no consideration provided by the plaintiffs for the document.  In any case, it was cancelled/revoked by the second guarantee.  Chew similarly regarded the second guarantee as a non-binding letter of comfort. 49.       I move next to the testimony adduced from Chew in cross-examination.  Chew claimed that liquidated damages were imposed on the first defendants for their failure to complete the panels, for scaffolding and for not rectifying defective works.  He confirmed that the first defendants did not apportion the liquidated damages between the plaintiffs, his company and the aluminium subcontractor Gey Huat Metal Works (Gey Huat).  One would have thought that even if Gey Huat wasseldom late(according to Chew (N/E 155), they were still late nonetheless.  There was no basis to impose liquidated damages only on the plaintiffs, if other subcontractors as well as the first defendants, were guilty of delay.  Counsel for the plaintiffs drew Chew's attention to Architects' certificate no. 13 (3AB309-310) showing that as at 19 July 2001, some of the first defendants' own works were seriously behind schedule or, were not done at all.  Chew denied that it was the first defendants not the plaintiffs, who were responsible for the delay, even though he admitted that the first defendants were late in confirming the dimensions of the steel structures without which measurements, the plaintiffs could not fabricate and install, the panels.  Chew did not dispute receiving various letters from the plaintiffs between April and November 2001 in that regard.  His excuse was, upon receipt of the plaintiffs' first letter dated 23 April 2001 (1AB26), he had raised the matter with the Architects but was told that those works were not the critical part of the works; the first defendants were asked to concentrate on other works which were more important from a safety point of view.  He understood from the Architects that work relating to the canopy even if slow, was acceptable.  He did not write to inform the plaintiffs but had told them at a site meeting (which date he could not recollect). 50.       Chew confirmed that he did not give copies of the first defendants' certificates of payment to the plaintiffs although the quantity surveyor may have done so.  He agreed that the first defendants consistently under-certified/underpaid the plaintiffs on their progress claims.  He conceded that as at 31 December 2001, the defendants had been paid in excess of $2.162m (see their progress claim no. 20 at 4AB108) of which 50% comprised the plaintiffs' works.  Yet, his company had only paid the plaintiffs about $589,000 by November 2001, which he justified on the basis that the plaintiffs' completed works had not been inspected or accepted by the Architects.  When it was pointed out to him that the first defendants received payment in April 2002 of $46,000 (contrary to his claim that the company was not paid after July 2001), Chew explained that the money was meant for purchase of materials.  Frankly, I cannot see why this explanation alters the fact that the first defendants were paid for the project after July 2001, contrary to Chew's evidence, regardless of the purpose.  On their part, the plaintiffs apparently were still working at the site (as at the trial dates), despite not being paid since January 2002 (after obtaining summary judgment). 51.       Chew maintained that the plaintiffs were bound by the terms and conditions applicable to the first defendants under the main contract notwithstanding that they did not know nor were they shown a copy of the document, in any casethey didn't ask for it(N/E 149).  Chew's written testimony (para 24) had stated that the plaintiffs had been paid by the first defendants a total of $150,000 after July 2001 even though both cheques (one for $100,000 and the second for $50,000) were dishonoured when presented for payment by the plaintiffs.   I took him to task (N/E 171) on his explanation – he claimed he had told the plaintiffs not to present the cheques for payment, because there was no progress of work(N/E 170). 52.       Chew also revealed that the first defendants were successful in their application for EOT (43 days) but he did not inform the plaintiffs even though he was aware they had applied for EOT twice.  As liquidated damages were imposed by the Architects from 1 June 2001, this meant that the completion date had effectively been extended to 31 May 2001, more than three (3) months from the first defendants' completion date of 10 March 2001.  Consequently, if (according to Chew), the full benefit of the EOT was passed onto the plaintiffs, the first defendants cannot impose liquidated damages on the plaintiffs (if they are liable)before 1 June 2001. 53.       The defendants' site supervisor Ong Eng Guan (Ong) also testified.  Ong (DW2) said he was full-time at the site right from the beginning (assisting the site coordinator Cammy Tay) until he was transferred to another site on 15 September 2001, after which Leo Chin Jeow took over.  He also stood in for Cammy Tay at site inspections whenever she could not attend.  Ong was responsible for marking out the first set of reference lines against both blocks.  These were to be used by the plaintiffs to mark out their own reference lines before they proceeded to fabricate the panels for installation.  He had seen the plaintiffs marking their own reference lines for the two (2) blocks.  However, he subsequently noticed that some of the installed panels were misaligned, especially in areas where there were window openings, at the lower panels for each floor.  He had informed and shown the areas affected to Cammy Tay.  He claimed that the plaintiffs rectified the misalignment by using angle/flat bars to cover the gaps between the panels and the windows.  The plaintiffs' rectification works caused a delay in installation of the panels. 54.       Ong agreed with counsel for the plaintiffs that due to the age of the Building, the window openings werenot that straight(N/E 177) vertically, thus lending credence to the plaintiffs' complaint that the windows were not aligned with the panels, when they plotted and followed plumb-lines.  Indeed, Ong blamed the plaintiffs (and not Gey Huat) not only for the misalignment problem but, for the overall delay in completion of the project.  He asserted that if the plaintiffs' panels had been properly aligned with the windows, the problem would not have arisen.  He claimed ignorance when asked whether he was aware that Gey Huat's windows were out of alignment, even though the plaintiffs had written to the first defendants on 23 March 2001 to complain. 55.       Ong added that Gey Huat had completed installing the windows by May 2001.  When counsel drew his attention to letters (2) from his company, the first dated 25 July 2001 (at 4AB 393) and the second dated 3 August 2001 (4AB395) wherein the first defendants had asked the MC to confirm installation schedules of windows for Tannery and Genting blocks respectively, Ong lamely said the dates could not be right and, the schedules came from the MC.  Yet he disagreed when counsel and the court pointed out that Gey Huat had not even completed their works by August 2001, contrary to his claim that they had done so by May 2001.  Indeed, the first defendants themselves had written to Gey Huat on 17 July 2001 (4AB389) stating the latter had not completed their work.  Ong however maintained that the only outstanding work on Gey Huat's part after May 2001 was to clean the installed windows (in preparation for a joint inspection) and touch-ups. 56.       In his written and oral testimony touching on the sequence of work, Ong had said plastering could be done by the first defendants only after panel installation was completed.  He claimed that by March 2001, his company had completed plastering although he alleged the plaintiffs had not then completed installation of the panels.  While he agreed with counsel that the clerk-of-works was not satisfied with his company's plastering works as at July 2001, Ong said that did not apply to the cladding areas.  Counsel then referred Ong to a site memorandum of the clerk-of-works dated 9 July 2001 expressing dissatisfaction with the first defendants' plastering works at the ground floor of the Tannery block.  Ong attributed the problem to the plaintiffs whom he claimed damaged the plastering whilst installing panels.  When reminded by the court of his earlier testimony (stating that plastering at cladding areas was satisfactory), Ong changed his testimony yet again, claiming one side of the cladding works did touch the plastering, requiring re-plastering to be done.  It took persistent questioning on counsel's part before Ong would admit that the first defendants were themselves late in completing their work.  Even then, he only agreed that part of the steel structures at the main entrance were not erected when he left the site. 57.       It was obvious from the stance he adopted throughout his testimony, that Ong was quick to lay blame for any form of delay by any party, squarely on the plaintiffs, however illogical and baseless.  The same comment would apply to Cammy Tay's testimony which I turn to next. 58.       Cammy Tay (Cammy) was assigned to the project from the start until her resignation from the first defendants’ employment in mid-July 2001, when the company's contracts manager (S. Narayanasamy) took over.  She was also the first defendants' quantity surveyor besides being their project coordinator.  Like Ong, Cammy (DW3) did not have a good word to say about the plaintiffs.  She complained that unlike her company, the plaintiffs did not have a full-time site supervisor to identify problems which may occur and to supervise their workers.  Cammy alleged that Ng (PW3) was only the plaintiffs' part-time site supervisor who in any case, was unable to resolve problems which arose in the course of the plaintiffs' works.  The situation did not improve when Ronnie Wong and later See (PW2) took over from Ng, as the last two (2) were not full-time on site either. 59.       Because of the lack of a full-time site supervisor, Cammy alleged that the plaintiffs could not take any/effective action             whenever her company noticed defects in installation of the panels and required rectification works to be carried out.  Lacking a supervisor, the plaintiffs would pass the first defendants' complaints from one person to another.  It was only when the clerk-of-works rejected the panels, that the plaintiffs would agree to rectify the defects.  The plaintiffs' defective works included misalignment of panels and usage of non-standard screws, nuts and washers. 60.       Like Ong, Cammy put the blame squarely on the plaintiffs for the panels being misaligned with the new aluminium windows.  She pointed out that it was clear from the plaintiffs' own drawings submitted to the first defendants, that the heights of the two blocks were uneven.  This unevenness in the heights would have been ascertained if the plaintiffs had taken proper measurements on site.  When the plaintiffs installed the panels, they were unable to keep to the new reference lines they had agreed with the first defendants they would follow.  Hence the resultant misalignment, where the panels overhung the façade openings by more than what they should have been, requiring the plaintiffs to incorporate more aluminium parts namely angle and flat bars, to correct the misalignment. 61.       Cammy asserted that Gey Huat's method of installing the windows was to do it from within the Building and, the windows must be flushed with the internal walls of the unit in which the windows were installed.  After Gey Huat had completed the casement windows for the Genting block, it was discovered that the exterior window ledges were visibly uneven in width even though the windows were installed flushed with the interior walls.  She considered this misalignment problem as inherent in the existing building structure; it had nothing to do with the windows being defective or incorrectly installed, as the plaintiffs had alleged.  In any case, after Gey Huat had done rectification works (on the slight misalignment of the casement windows), the plaintiffs were late in starting their part of the rectification works. 62.       Cammy complained that the plaintiffs were perpetually behind schedule on the first defendants' master programme, indeed from the very beginning.  Despite being pressed by her company to expedite their works and to submit a schedule to catch-up with the master programme, the plaintiffs neither provided a schedule nor increased their manpower, beyond the average 7 workers she saw on site.  However, in re-examination, she revealed that the plaintiffs did provide the first defendants with a catch-up programme around February 2001. 63.       Cammy also rebutted the plaintiffs' allegations that inspection of completed works was irregular and haphazard.  There was a set method of inspection and, had the plaintiffs complied therewith, the many re-inspections that took place for the same areas/locations and for the same defects, would have been unnecessary. 64.       The plaintiffs' alleged late submission of details drawings was another complaint by Cammy; she alleged she had to press them in February 2001 followed by three (3) reminders, before they forwarded the drawings to her company. 65.       In cross-examination, counsel for the plaintiffs took Cammy through the site memoranda and meetings of site minutes to demonstrate that it was not only the plaintiffs but also the first defendants, who were guilty of delay in works as well as in submission of drawings.  Counsel also extracted from Cammy an admission that Gey Huat did not use plumb lines to ensure that the windows were vertical; she said Gey Huat was only required to make sure the dimensions of the windows were at 90º angles.  She admitted that the plaintiffs had complained about misalignment of the windows in January and March 2001, which complaint she promptly passed to Gey Huat to resolve.  Cammy also admitted that the first defendants' internal certification of the plaintiffs' works (nos. 1 to 11 save for no. 9) did not measure but were based purely on contract, quantities even though she knew cladding works were subject to measurements. 66.       The first defendants also called S Narayanasamy (known as Nara) to testify.  Nara (DW4) was assigned to the project from its start until his resignation from the first defendants' employment in June 2002.  He became more involved with the project after Cammy's resignation in mid-July 2001 and before Leo Chin Jeow joined the first defendants.  Nara testified that he would be on site 3-4 times a week for 3-4 hours on each occasion and he attended all site meetings. 67.       Like Ong and Camy, Nara had a litany of complaints against the plaintiffs and their works/workmanship, all of which do not bear repeating.  He exhibited to his affidavit photographs (see 7AB 302-329) he had taken in December 2001 to substantiate his complaints.  The defendants also produced photographs taken between February and June 2002 (7AB 331-349) which purportedly showed the plaintiffs’ incomplete and defective works.  Nara relied on the presence of scaffolding as the basis for his allegation that the plaintiffs had failed to carry out rectification works, even though he acknowledged there were other works which needed scaffolding.  Like Ong and Cammy, Nara claimed that the plaintiffs were slow, delayed their works and, did not respond to complaints/reminders from the first defendants.  He alleged the plaintiffs had wrongly fabricated 44LandTshaped panels installed between 2ndand 11thstoreys which, contrary to contract specifications to be fabricated as one (1) piece, had been fabricated by the plaintiffs in two (2) pieces and then welded together.  This discrepancy was only discovered after the scheduled completion date and caused a delay of some six (6) weeks.  Nara also made much of the fact that the plaintiffs failed to ensure that their works could pass the stringent inspections of the clerk-of-works.  He blamed the plaintiffs for the frequent re-inspections of their works which he contended were necessary.  Cross-examination of Nara however, revealed he did not personally attend the inspections conducted by the clerk-of-works; he was told by either Cammy or Leo Chin Jeow. 68.       In cross-examination, Nara drew a fine distinction between preparatory work (submission of drawings) and actual construction, seeming to suggest that the former work done by the plaintiffs did not count as part of the installation process for the panels.  However, he agreed that fixing of mullions and brackets formed part of  installation.  Nara acknowledged that the Architects had decided to add a planter box at the termination area at the first storey staircase/lift area, requiring re-submission of detailed drawings by the plaintiffs, and necessitating re-fabrication of panels in late  September 2001 (see 1AB54).  Nara also acknowledged that defective windows would affect plastering and in turn, panel installation and painting works. 69.       Contrary to the first defendants' repeated allegation that scaffolding could not be removed until after the plaintiffs had rectified defective works, Nara agreed that scaffolding was not even erected at the entrance, which canopy comprised part of the first defendants' scope of works.  His excuse for his company's omission to carry out those works was novel - if the works on the upper floors were not completed, there wasno logic to do lower levels(N/E 220), an explanation which itself defies logic; I can see no correlation between works on the upper and the first, floors.  Even if the plaintiffs were late in rectifying defective panels on the upper floors resulting in scaffolding not being removed for those levels, their omission would not affect the first defendants' construction of steel structures for the entrance canopy without which, the plaintiffs could not install the panels.  He disagreed that the plaintiffs' works were independent, he asserted that they must be ready to do the cladding immediately after the first defendants erected the steel structures, which they were not.  Counsel for the defendants referred Nara to photographs (AB261-262) taken in December 2001 which appeared to show that the canopy had been erected.  The plaintiffs' letter dated 28 November 2001 (at 1AB142) however showed that as at that date, the first defendants had failed to confirm to the former the dimensions and radius of curves of the canopy without which, the plaintiffs could not fabricate the panels to be installed thereon. 70.       On the inspections of the plaintiffs' works, Nara said the first defendants did not accede to the plaintiffs' proposal of 24 January 2002 (1AB 244) to use a Bronto Skylift S54 which equipment would give access to all areas via the carpark. Yet, the first defendants adopted the proposal as their own and forwarded it to the Architects on 30 January 2002 (see 4AB51).  Although he did not deny that his company endorsed the plaintiffs' proposal, Nara contended that it did not mean the first defendants accepted it, an untenable argument which I reject outright. 71.       The first defendants' assistant project manager Leo Chin Jeow (Leo) was their last witness.  Leo (DW5) succeeded Ong Eng Guan as site supervisor, after joining the first defendants in September 2001, well after the project was underway.  Consequently, he could only testify to events which transpired after 8 September 2001.  Leo criticized the plaintiffs no less than his colleagues.  I found nothing new in Leo's testimony which was not already covered in the evidence adduced from Cammy and Nara.  Like the first defendants' other two witnesses, Leo was not prepared to find fault with Gey Huat or hold then responsible for delays in the project (N/E264); he blamed the plaintiffs instead.  He complained that most but not, all the plaintiffs' panels were properly installed -- some were uneven, others not flushed while those near the roof crown protruded out.  He had written to the plaintiffs on 15 September 2001 (1AB48) to say they did not have a full-time site supervisor and had insufficient manpower at site (this was denied by the plaintiffs).  I note however that the complaint on lack of manpower was also addressed to Gey Huat on the same day (see 4AB407). 72.       Some of Leo's complaints against the plaintiffs were unjustified.  As an  example, I refer to his allegation  (para 37 in his affidavit) that their workers did not take steps to protect the roofing membrane whilst cutting panels on the roof crown of Tannery block, leaving the panels' sharp edges to rest on the roofing membrane.  Cross-examined (N/E 261), Leo admitted no damage was caused.  Indeed, counsel suggested to him that the damage was actually caused by the first defendants' own workers. 73.       Further cross-examination revealed that Leo was sometimes not even aware of the exchange of correspondence between his company and the plaintiffs.  One instance was his ignorance of the plaintiffs' letters in March and June 2001 stating they had completed their works.  He was however aware that the plaintiffs had requested for inspection schedules in late November 2001 (1AB141) for both blocks.  Leo also admitted that the first defendants' own works were not fully completed as at August 2002 (N/E 250-251) whereas by then, the plaintiffs' works at Genting (but not Tannery) block, were completed.  Even so, Leo acknowledged that the uncompleted portion of the plaintiffs' works for Tannery block only related to the lower floors, in particular the 9thstorey on the north-east elevation; defective panels which had been directed to be removed by the Architects were yet to be replaced by the plaintiffs or, they were unable to remove rejected panels due to the absence of scaffolding.  Apparently, the defective panels for Tannery block had been rejected by the clerk-of-works in late January 2002.  Leo clarified that none of the rejected panels were affected by tie-backs.  He admitted some panels were rejected due to stains/splattering from the first defendants' plastering works.  He defended his company by pointing out that the panels would not have been affected by plastering at all if the plaintiffs had provided protective covering as they were supposed to.  Moreover, some panels were patchy not because they were affected by splattering from plastering works but, because the plaintiffs usedScotch-Britewhich is abrasive, instead of a wet cloth, to clean the panels.  Leo added that the plaintiffs' recommendation that the patchy panels be buffed instead of being replaced was accepted by the Architects but, after buffing, the panels still appeared patchy in strong sunlight, hence the MC and the Architects insisted on the replacement.  He denied that rust from the tie-backs affected the panels.  In any case, the scaffolding for the Tannery block was galvanised scaffolding which would not/did not rust.   However, under further cross-examination, Leo agreed that even if there was protective covering for the panels, the same would have to be removed for purposes of inspection and, if re-plastering of surrounding areas was required, the risk of staining to the panels therefrom would still arise. 74.       Although Nara had defended the inspections by the clerk-of-works, Leo agreed he himself had written to the Architects in July 2002 (at 5AB12/16) to register his company’s unhappiness at the way the clerk-of-works conducted inspections.",
        "The issues": "75.       A number of issues arise for determination in this dispute, namely: (i)         apart from the Letter of Award and the quotation, are the terms of the main contract between the first defendants and the MC imported into and form, part of the contractual provisions between the parties? (ii)        who were responsible for the delays in the project, at various stages? (iii)       are the plaintiffs liable for liquidated damages if their works were the cause of the delay? (iv)       attendant to (iii) above, what were the completion dates applicable to the plaintiffs’ subcontract vis-à-vis the first defendants’ main contract? (v)        Is Chew liable to the plaintiffs on the first and or second guarantees if they succeed on their claim?",
        "The findings": "",
        "(i) on the facts": "76.       A determination of the above issues can only be made after I have made my findings on the facts for both the plaintiffs’ claim and the defendants’ counterclaim, which I shall now proceed to do. 77.       It was admitted by the plaintiffs that they did not commence installation of the panels until 6 September 2000, a delay of three (3) months from their own installation programme date of 7 June 2000.  However, I accept the testimony of the plaintiffs’ expert (Tan), that the actual installation process forms a small portion of the cladding process; installation is preceded by fabrication of panels and fixing of mullions and brackets.  Consequently, the fact of actual installation being three (3) months later than the plaintiffs’ commencement date is not necessarily proof they were late in commencing their work. 78.       The more crucial factor to decide is, were the plaintiffs entitled to follow their own programme’s completion date rather than the date (10 February 2001) stated in the master programme of the first defendants?  There is even doubt on that date since Chew and Cammy Tay, under cross-examination, gave another date (4 April 2001) whilst the latter also gave a third date (10 January 2001).  Counsel in his closing submissions (paras 51-56) for the plaintiffs, submitted that the court should disregard the defendants’ dates not only because of the contradictory evidence of their two (2) witnesses but also because of Tan’s testimony - that it should be end-May 2001.  Counsel further submitted that as the first defendants failed to respond at all let alone, reject the plaintiffs’ installation programme where the completion date was revised to 3 May 2001, his clients should not be held to the completion date of 10 February 2001; I agree. 79.       It was totally unreasonable of the first defendants not to reply to the plaintiffs’ fax of 20 June 2000 if indeed they disagreed with the plaintiffs' installation programme for the two (2) blocks.  Whilst I accept that silence does not amount to tacit consent, the plaintiffs had specificallyasked for the first defendants' commentsin their letter.  If the first defendants chose to remain silent, I do not think the plaintiffs should be faulted for believing their revised schedule was accepted by the first defendants or at the very least, not objected to. 80.       At this stage, I would also comment on the dearth of letters emanating from the first defendants as compared with the prolific correspondence from the plaintiffs.  There were very few letters from the first defendants and or Chew in the documents before the court; neither did they reply to the plaintiffs' frequent letters.  What the defendants did was to rely heavily on third party documents such as the Architects’ certificates, site memoranda, records of inspections, manpower reports and, minutes of site meetings - indeed, the defendants' reliance on the same in their final submissions (see paras 16, 29, 30, 31, 33 as examples) was on the basis that the documents contained the gospel truth; such a premise is misconceived.  Those documents may have been marked as part of the agreed bundles before the court but, the basis of such marking is only to dispense with formal proof as to the makers thereof.  The contents in those documents were not agreed/admitted.  The defendants failed to call either the clerk-of-works (Victor Choo) or the architect (Mrs Dang) even though their evidence was crucial on the issue of the plaintiffs' defective works and on the dispute concerning the causes of and the parties responsible for, delay.  Consequently, any submissions which the defendants made on the plaintiffs' defective works and their omission to rectify the same, on their inadequate and or lack of manpower, relying on the documents referred to earlier cannot be given any weight.  There was no evidence before the court from the makers of those documents.  Equally, I dismiss as hearsay and inadmissible, the defendants’ allegation that they were not allowed by the clerk-of-works to dismantle the scaffolding until after the plaintiffs had carried out rectification works; the allegation was not proven. 81.       The plaintiffs had conceded that as at February 2001, not all of their shop drawings had been approved by the Architects but, Ng had explained (in re-examination) that shop drawings were not crucial for progress of work but rather, for termination details between installed panels and plastered walls and windows.  I further note that inspection of the plaintiffs' panels for the Genting block took place between March and November 2001.  The plaintiffs' repeated requests to the first defendants to fix a date for site measurements for the Tannery block went unheeded. 82.       There can be no dispute that the Architects' decision to add a planter box to the first floor staircase area contributed to the plaintiffs' delay.  As late as 11 December 2001 (1AB155), the plaintiffs were still pressing the first defendants for the Architectural drawings for the planter box, followed by their request on 21 December 2001 (1AB176) for an Architects' Instruction for the variation.  Notwithstanding that it was clearly a variation, Leo (when cross-examined) had steadfastly refused to accept it as such.  Although Ng had admitted in cross-examination that details for the planter box had been given to the plaintiffs in early 2002, the plaintiffs' delay in not commencing work immediately thereafter must be seen in the context of the first defendants' refusal/failure to obtain an Architects' instruction, without which the plaintiffs would not be paid for the additional work, even though it was a variation. I refer in this regard to the quotation which item (j) underTerms and Conditionsstates:- Variation work will only commence on receipt of written instruction and acceptance of our quotation. 83.       There was also a wide discrepancy between the plaintiffs' figures and those of the first defendants, on the actual quantities of panels installed.  The plaintiffs asserted they had installed 7,634.44 sq m whereas the first defendants (relying on the Architects' interim certificate dated 22 April 2002) maintained the plaintiffs only installed 4,747 sq m.  A joint site inspection (for Genting block) which took place on 3 January 2002 confirmed 4,747 sq. m were installed.  The defendants however, did not take into account the panels installed by the plaintiffs in the Tannery block; they relied on the plaintiffs' failure to rectify the panels rejected by the clerk-of-works as the basis for not recognizing the plaintiffs' installation for the Tannery block.  That stand is unreasonable as can be seen from the next paragraph. 84.       Notwithstanding the plaintiffs' failure to rectify defective panels for Tannery block, it is noteworthy that the defendants themselves had claimed for the plaintiffs' work at 100% and 99% respectively, for materials and labour for the plaintiffs' works  in their progress claim no. 23 dated 3 April 2002 (3AB 42).  Those percentages  were reflected in the Architects' certificate no. 14 dated 22 April 2002 wherein the first defendants were paid 100% and 95% respectively, for materials and labour relating to cladding works.  It is equally telling that in the same progress claim, the first defendants stated they had not finished work at the entrance canopy at the existing guardhouse (save for 58%), at the lift lobbies (41% completed for Genting block, 38% for Tannery block) and for the canopy at the first storey lift lobby (10% done).  They further stated that they had completed 99% of the external painting and plastering works.  Consequently, the defendants cannot blow hot and cold; they cannot make a claim on the Architects on the basis that the plaintiffs have completed 100% of the cladding works in order to obtain payment and yet, in the next breath, deny it when the plaintiffs make the same claim, bearing in mind also Chew's admission that the plaintiffs' cladding works comprised half the scope of works under the main contract.  I should point out however, that all the percentages set out above were reduced (by 5% in the plaintiffs' case), in the Architects' certificate no. 15 dated 15 August 2002 (for work done as at 15 July 2002).  Indeed, the Architects certified no work had been done for the canopy at the first storey lift lobby.  However, as the architect (Mrs Dang) did not testify, it serves no purpose to speculate on her reasons for reducing the percentages set out in her earlier certificate no. 14.  Not calling the architect to testify also meant that there was no evidence before the court as to why she required the plaintiffs to make re-submissions let alone that it was due to their first submission of shop drawings being inadequate or incorrect (as the defendants alleged).  Neither could the first defendants rebut Ng's testimony that re-submission was required because additional details were required by the architect. 85.       Ong and Cammy Tay had admitted the plaintiffs' complaint that the first defendants did not have a fulltime project manager on site, albeit they had site supervisors in the persons of Nara and Leo.  They counter-alleged that the plaintiffs did not have a fulltime site supervisor.  I reject this complaint outright as unfounded, since it is contrary to the evidence adduced in court.  What is plainly obvious is, that all five (5) witnesses of the defendants suffered from lack of credibility.  On a number of occasions, their bald allegations were not only uncorroborated but, were inconsistent with documents before the court.  Some instances of such evidence are as follows:- (i)         their tendency to blame the plaintiffs for all and any problems/delays in the project regardless of who was responsible and even when the first defendants were at fault (staining of the installed panels by plastering works); (ii)        their blatant bias in defending Gey Huat their window subcontractor, when the latter were clearly responsible for misalignment of the windows with the plaintiffs' panels and were also guilty of delay (together with the first defendants); (iii)       unfounded allegations against the plaintiffs such as their causing damage to roofing membrane; (iv)       denying the clerk-of-works was difficult and his inspections stringent, when they themselves (Leo) had raised the same complaint to the Architects in the last week of July 2002; (v)        alleging the plaintiffs had wrongfully fabricatedLandTshaped panels in 2 pieces instead of one (1) piece without an iota of evidence to prove the specification or support the allegation; (vi)       preventing the plaintiffs from carrying out rectification works by not  dismantling the scaffolding and refusing to consider the plaintiffs' proposal to use a boom lift instead; yet adopting the plaintiffs' request of a boom lift as their own proposal to the Architects on 30 January 2002. 86.       Chew himself was a most unreliable witness as can be seen from the following instances: (i)         his inconsistent testimony on the completion dates applicable to the plaintiffs; (ii)        his slow payments coupled with, deliberate and consistent under-certification with consequential underpayment, on the plaintiffs' progress claims despite being paid by the MC promptly, on the first defendants' progress claims; (iii)       his gall in asserting that the plaintiffs had been overpaid and their work was only worth $285,836.33, when his company was paid $1,941,612.46 (even as at 30 October 2001) for their progress claim no. 13 (4AB104); 50% thereof representing the plaintiffs' works meant $970,806.23 should have been paid to the plaintiffs instead of only $589,900 ($572,718.45 plus 3% GST) as at the commencement of these proceedings (iv)       he failed to inform the plaintiffs that their progress claims were and needed to be 'certified' by the first defendants first, before payment; (v)        he omitted to inform the plaintiffs that the first defendants had applied for and had been granted by the Architects, 43 days EOT until 31 May 2001, based on one of the reasons (late colour confirmation) used by the plaintiffs for their own EOT.  Yet, he contended he gave the entire 43 days EOT to the plaintiffs.  In this regard, I note that as late as 24 July 2002 (5AB13), Leo was still writing to the Architects for EOT, due to8thstorey star-dust problem; (vi)       holding the plaintiffs to the first defendants' obligations in the main contract when the plaintiffs were never asked to sign a subcontract similar in terms to nor were they shown a copy of, the main contract. 87.       My dim view of Chew's credibility is reinforced by the fact that he had to be castigated (N/E 171) for deposing to an outright lie in para 24 of his affidavit, which he would not even admit - that the first defendants had paid the plaintiffs $150,000 in July 2001 when, he well knew the two cheques issued to them were dishonoured upon presentation.  Chew was also found to be untruthful in his claim that his company was not paid by the MC after July 2001, as he was confronted with a payment of $46,000 made to the first defendants in April 2002.  He was equally untruthful in his version of how and why the first and second guarantees were issued to the plaintiffs; I prefer See's version as being more credible and consistent with the plaintiffs' case - that they wanted a guarantee from him to ensure Chew would pay them, if his company failed to do so.  I find that he was less than honest in his dealings with the plaintiffs. 88.       On the whole, I prefer the testimony of the plaintiffs' witnesses, they came across as more credible and objective.  Lee, See and Ng were neither self-defensive nor self-righteous in their testimony.  Unlike the defendants' witnesses, where these persons or the plaintiffs were at fault, the admissions were readily made without the truth having to be forced out from them in repeated cross-examination or, only when confronted with contradicting documents. 89.       As for the testimony of the plaintiffs' expert, I note that Tan's report and analysis were wholly based on information furnished by the plaintiffs and or obtained from selective documents they gave to him, save for the photographs of the defendants he was shown.  As was pointed out to him by the court (N/E 141), that meant hemayonly have had a one-sided picture.  In addition (which he admitted quite candidly), Tan had no means of verifying the accuracy of what was stated in the plaintiffs' documents or what was told to him, nor whether there were other relevant documents (such as records of inspections) which had not been disclosed to him.  Neither did Tan visit the site to verify site conditionsbeforehe testified.  One example of Tan's disadvantage in this respect concerned the problem of the misalignment of the windows; he was not aware of the exact nature of the problem.  Neither was he told by the plaintiffs that they had approached the Architects for approval of their proposed method of work, when he disagreed with counsel that the scaffolding could not be dismantled from the Building, until after the plaintiffs had carried out rectification works (although this turned out to be untrue).  Tan was also not told that by Architects' certificate no. 15 (dated 15 August 2002) liquidated damages of $182,500 had been imposed on the first defendants for 12 months' (365 days') delay. 90.       However (and this was one of the plaintiffs' closing submissions), Tan was the only expert witness before the court, as the defendants chose not to call any expert witness themselves.  Some credence therefore must be given to Tan's testimony, despite the shortcomings.  I hasten to add that I am not suggesting that Tan was biased in the plaintiffs' favour.  He was as objective as he could be, based on the documents presented to him for review by the plaintiffs.",
        "(ii) the law": "91.       I turn my attention next to the legal issues arising out of the dispute.  First, whether the terms of the main contract between the first defendants and the MC were incorporated into the contract between the plaintiffs and the first defendants notwithstanding that the plaintiffs never signed a subcontract with the company.  The evidence of Chew clearly showed the plaintiffs were not even shown the main contract documents.  In his concluding submissions, counsel for the plaintiffs submitted that his clients could not be so bound, citing the following extract from the authoritative textbookHudson's Building and Engineering Contracts(11 ed vol 2 at  1357 para 13-100:- (a) Incorporation of main contract terms This can give rise to considerable difficulties, since the incorporation is often loosely expressed in the most general terms and without any  precise or careful consideration of the consequences.  Each case must be separately considered to determine the precise purpose and extent to which it is desired to incorporate the term or terms of the main contract.  It follows from the absence of privity between the owner and the subcontractor that, without incorporation, the terms of the main contract, even though well known to both parties, cannot bind the subcontractor. 92.       Counsel for the defendants on the other hand, in his submissions (para 47), contended that the fact the plaintiffs relied on the lack of issuance of a Delay Certificate under cl 24(1) and the plaintiffs' application for EOT (albeit not in compliance with cl 23[2]) showed that the plaintiffs acknowledged those terms from the main contract, had been incorporated into their subcontract.  Consequently he argued, the plaintiffs were liable for the consequences of delay and for liquidated damages under the main contract. 93.       I reject the defendants' submissions; I accept the argument of counsel for the plaintiffs based on the above passage he cited fromHudson'stextbook.  The defendants' argument is misconceived.  The defendants were seeking to recover from the plaintiffs, liquidated damages of $182,500 imposed on the first defendants by the Architects.  The MC's entitlement to impose liquidated damages is subject to, the issuance of a Delay Certificate by the Architects against the first defendants, under cl 24(1) of the main contract, without which the MC is not entitled to impose liquidated damages under cl 24(1) thereof.  The first defendants' entitlement to impose liquidated damages on the plaintiffs is separately governed by cl 2.1 of the Letter of Award, which I will set out below.  In this regard, it was wrong of counsel to confuse the plaintiffs' witness Lee, by inquiring whether the latter was familiar with the terms and conditions of the SIA (which governed the main contract), by referring to extracts (6AB9C) from the main contract.  The fact that Lee confirmed those documents formed part of the main contract and he was familiar with SIA terms and conditions (for EOT applications) did not amount to admissions, as the defendants contended in their closing submissions (para 45), such that the plaintiffs were thereby bound by those terms and conditions.  Lee's answers in cross-examination should not be taken out of their context. 94.       If, as I have ruled, the plaintiffs are not bound by the terms and conditions of the main contract, how then can they be bound by cl 23 therein on the pre-requisites for a valid EOT application?  Neither can the plaintiffs be bound by the contractual deadlines which governed the main contract, including the provisions for EOT. 95.       I turn next to the vexed question of what is the completion date for the plaintiffs' subcontract.  In their closing submissions (para 55) the plaintiffs contended that the completion date of 10 February 2001 under cl 2.1 of the Letter of Award did not apply, due to the conflicting testimony of the defendants' witnesses on the applicable date as well as, the first defendants' failure to challenge the plaintiffs' counter-proposal on the installation programme; time was therefore at large.  This meant that the plaintiffs were only required to complete the cladding works within a reasonable time according to recognised principles of law.  Based on Tan's opinion that various factors (not caused by the plaintiffs but partly caused by the first defendants) delayed completion, that would be end-May 2001 by which deadline the plaintiffs had already completed their works (in March 2001).  It further followed the plaintiffs submitted, that liquidated damages under cl 2.1 of the Letter of Award cannot be imposed. 96.       Chew had revealed (under cross-examination) that the first defendants had been granted EOT (see para 52supra) by the Architects up to 31 May 2001, which extension he claimed he passed onto the plaintiffs.  That being the case, even if I reject their counsel's argument that time was at large, the fact remains that the plaintiffs could not be said to be late, if they completed their worksafter10 February 2001 butbefore31 May 2001.  In any case, if the plaintiffs' obligation (in the absence of a fixed completion date), was only to complete the subcontract works within a reasonable time (which would appear to be the position at law, according toHudson's Building & Construction Contractsat p 1146 para 10-040), then there was no defined date from which liquidated damages could begin to run. 97.       Based on my earlier comments in para 84 above, I find that the plaintiffs have proven on a balance of probabilities, that they had completed the works under the subcontract by end March and end May, 2001 respectively, for Genting and Tannery blocks.  They did not replace certain panels which the clerk-of-works had rejected (at window and other areas) or install panels at tie-back areas and at the scaffolding’s platform on the first storey because either: (i) they could not, due to obstructions from scaffolding or (ii) they were waiting for the first defendants to carry out rectification works first.  In this regard, there is no dispute that the plaintiffs took away 406 panels from the site, some for rectification, although Ng testified a number of the same was returned subsequently.  An indication of the actual quantity that was taken away appears in the Architects’ certificate no. 15 (see 6AB113) which gave a figure of 375. 98.       On a preponderance of the evidence and, accepting Tan’s testimony on the extent of work done by the plaintiffs, I find that the plaintiffs have succeeded in their claim.  Although this trial was only to determine liability, I note that in so far as the Genting block is concerned, it is common ground that the measured quantities totalled 4,129.4 sq m against the contract quantity of 3,925 sq m and, against the plaintiffs' claim of 4,150.15 sq m (their progress claim no. 14).  As such, the first defendants are liable to pay the plaintiffs the difference of 204.4 sq m at $135 per sq m, in accordance with the Letter of Award, which stipulated that final quantities are subject to as built measurements of the installed panels.  The plaintiffs are entitled to claim an additional $27,594 ($135 x 204.4) for the panels installed at Genting block. 99.       It is also common ground that the plaintiffs requested but the first defendants did not arrange for, joint site measurements of panels installed at the Tannery block.  In their progress claim no. 14 dated 25 October 2001 (6AB108), the plaintiffs had claimed 3,484.29 sq. m for panels installed at Tannery block.  Adding 3,484.29 to the undisputed quantity (4,129.4) installed at Genting block gives a total of 7,613.69 sq m.  If the Architects’ certificate no. 15 is accepted, it appears to support the plaintiffs’ quantification.  The certificate stated the plaintiffs had completed 95% of installation.  Based on 7,613.69 sq m, that meant 380.68 sq m of panels were not installed, which may or may not equate the Architects' figure of 375. 100.     On the issue of liquidated damages, I refer to the following extract from cl 2.1 of the Letter of Award:- In the event of any delay due to your default, you are required to reimburse us for all losses, damages and expenses (including liquidated damages of $500/day) incurred by us a a result of your delays, clause 11(5) of the conditions of subcontract applies.  You are to provide a works programme within fourteen (14) days of this letter of acceptance. Based on the wording alone, the first defendants' claim for liquidated damages must fail.  Before they can impose liquidated damages on the plaintiffs, the first defendants must first prove that delay in completion was due to the plaintiffs' default.  The plaintiffs however had proved, on a balance of probabilities, that the first defendants and or Gey Huat were themselves guilty of delay.  The first defendants have neither proved nor apportioned, the period of delay, between themselves, Gey Huat and the plaintiffs.  The plaintiffs never signed a subcontract with the first defendants, hence cl 11(5) of a non-existent contract cannot apply.  The counterclaim against the plaintiffs for reimbursement of liquidated damages imposed by the MC and for further liquidated damages at $500 per day (under the Letter of Award) are both without merit. 101.     In the light of my assessment of the evidence of the first defendants' witnesses and of Chew, it would be equally unsafe to accept their testimony on the plaintiffs’ alleged breaches and on the other claims (see para 22 above) contained in the defendants' counterclaim, in the absence of independent supporting evidence.  None of the allegations relating to the plaintiffs' unsatisfactory workmanship have been proven, nor the claims consequent on the plaintiffs’ alleged delay.",
        "(iii) the guarantees": "102.     I turn my attention now to the first and second guarantees.  I have already indicated (para 87 above) that I preferred See's version as to why he obtained the first and then the second, guarantee, from Chew.   It would make nonsense of the purpose of any guarantee, if I were to accept Chew's explanation (repeated in the defendants' closing submissions) - that both amounted to a letter of comfort only although I accept that, the second guarantee did revoke the first.  Accepting Chew's explanation means the plaintiffs might just as well not have asked for either guarantee in the first place.  I agree with  the plaintiffs' submission and approve of and adopt the reasoning from, the following extract ofImperial Steel Drum Manufacturers Sdn Bhd v Wong Kin Heng[1997] 2 SLR 695 (at pp 709-710 para 49):- I accepted the submission of Mr Kumar.  It made no commercial sense for the plaintiffs to supply drums worth over a million dollars to Automatic when Automatic was RM$2 company.  The plaintiffs had all along wanted the undertaking of the defendant that he would be personally liable for the debt.  For some reason, the plaintiffs failed to obtain this undertaking prior to the commencement of delivery; it was only when the chairman of the plaintiffs company met the defendant on 2 April 1991 that the defendant gave the undertaking.  As in thePournarascase[Hyundai Shipbuilding v Pournaras[1978] 2 Lloyd's Rep 502, the commercial purpose of the guarantee was that the plaintiffs get their money from the defendant if they cannot get it from Automatic.  To give the letter of 2 April 1991 any other construction would be to nullify its purpose. 103.     The relevant extract from the letter dated 2 April 1991 in the above case reads as follows:- … Please be informed that I will ensure that Automatic Packaging & Services Sdn Bhd of 14 Jalan Hijau Muda Enam, Taman Pelangi, 80400 Johore Bahru, pay up all debts due to you. As explained to you, my land and other property in Pasir Gudang is more than sufficient to meet all debts and that my cash flow problem now is only temporary. I have since paid you M$70,000 in cash. As for the balance sum of M$1,016,257.14 and all interest accrue to you computed on the basis of BLR plus 2%. I will make payments to you without fail according to the attached schedule marked 'A'. Thank you for your indulgence. Yours faithfully … Wong Kin Heng 104.     I see very little difference between the wording in the two (2) guarantees and the above letter dated 2 April 1991 of the defendant Wong Kin Heng inImperial Steel Drum'scase.  Chew's explanation for giving the first guarantee is also untrue.  He claimed that the first guarantee was given to the plaintiffs to persuade them to expedite their delayed works and, there was no reason for him to be personally liable as the first defendants were then not in default of their obligations.  Such an audacious explanation only shows him up to be an unscrupulous character.  In reality, the first defendants had consistently breached the payment terms in the quotation by, paying late and considerably less, to the plaintiffs than what they claimed.  The court's approach to guarantees is, that they should be given a reasonable, business meaning and should not be construed so as to render the guarantee ineffective or illusory (seeO' Donovan's The Modern Contract of Guarantee3rded at p 217); they are not to be interpreted in accordance with the subjective intention of the parties (Chew in this case).  On such an objective interpretation, the first and the second guarantees cannot be construed other than as guarantees by Chew that, if the first defendants do not/did not pay the plaintiffs, then he would do so. 105.     As for the defence of lack of consideration for the guarantee, it is trite law that forbearance to sue for a past debt is one form of good consideration; another consideration was the plaintiffs’ continuing to work on the project (despite not being paid by the first defendants) which they did, right up to the trial dates.   It is not for the court to inquire into the value of the consideration given so long as it is not illusory, which it was not in this case .",
        "Conclusion": "106.     Accordingly, I award final judgment to the plaintiffs against the first defendants in the sum of $27,594 for work done on the Genting block plus, an additional charge of 1% per month or 12% per annum, on the amount from January 2002 until payment, as stipulated under the quotation for late payments; the plaintiffs shall also have their costs.  In addition, there will be interlocutory judgment for the plaintiffs for panels installed on the Tannery block with the value to be assessed by the Registrar; the costs of such assessment shall be reserved to the Registrar, who shall also determine the number of defective panels or panels not yet installed, which values should then be set-off and deducted from, the value of the plaintiffs’ claim as assessed.  There shall be no stay of execution on the sum of $27,594 pending assessment of the plaintiffs' claim for the Tannery block. 107.     I further hold that Chew is liable to the plaintiffs on the second guarantee.   In the event that the first defendants fail and or refuse to pay the judgment sum of $27,594 and the sum due to the plaintiffs when assessed, for work done on Tannery block, Chew shall pay. 108.     It follows from para 101 above, that the first and second defendants' counterclaim against the plaintiffs is dismissed with costs."
    }
}