{
    "case_title": "Public Prosecutor v Pok Raymond",
    "ncitation": "[2003] SGHC 18",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The statement of the facts": "5. The Accused was an assistant engineer employed by Sony Precision Engineering Centre (Singapore). In August or September 1999, AL came across a message posted by the Accused on an Internet chat room asking any girl to pose as his temporary girlfriend for a few hours and engage in petting with him in return for money. AL was curious and responded. She eventually agreed to the deal but informed the Accused there was to be no sexual intercourse. The rendezvous was set at the Yishun MRT station.6. When they met on the appointed date, the Accused asked AL to follow him to a block of flats where they took the lift to one of the highest floors. At a staircase landing, they sat down and began kissing and petting. The Accused then put on a condom and told AL to perform oral sex on him by pushing her head towards his penis. AL complied. Later, AL lay down and he got on top of her. They became aroused and engaged in sexual intercourse. When it was over, the Accused gave AL about $400 as promised. This formed the subject of the charge under section 140 (1)(i) Women's Charter.7. After that first encounter, the Accused contacted AL again. They met at the East Coast Park beach where AL sat on his lap and they kissed. He wanted AL to perform oral sex on him but she did not want to and resisted. He then put his hand behind her head and pulled it towards his penis. She gave in and took him in her mouth reluctantly. This was the fellatio charge.8. After that, the two of them met each other regularly. Sometimes, they would have sexual intercourse in the Accused's home. On one occasion, he requested to have anal intercourse with her and she consented. This was the subject of the other section 377 Penal Code charge.9. In February 2001, when AL ended the relationship with the Accused, he became very angry and began to call her persistently. When she refused to rekindle their relationship, he sent her SMS (short message service) messages claiming he had recorded on video tape the two of them having sex. When AL still rebuffed his sexual advances, he threatened to make the said video tape available on the Internet and to her parents and her school.10. About a year later, LL, then 14 years old, was surfing the Teens' Channel, an Internet chat room for teenagers. She came across a message posted by the Accused, posing as a teenager, stating he would pay $500 to any girl willing to be his temporary girlfriend. Feeling curious, LL responded, calling herself Claire. The Accused followed up by saying his girlfriend had left him recently and he wanted to show his friend he could have another girlfriend quite quickly. He told LL that the temporary girlfriend must be willing to engage in kissing. Initially, LL rejected his offer but after much persuasion, agreed to meet him. They exchanged their mobile telephone numbers.11. On the appointed day, 16 March 2002, LL went to meet the Accused at the Boon Lay MRT station. At around 10 am, he walked up to her. He was wearing a cap and sunglasses. After confirming she was the Claire he had contacted, he led her to a multi-storey carpark which was some distance from the station. While they were walking, he took out a red packet from his pocket and showed her a $50 note inside. He then walked ahead of her and did something with his bag before putting the red packet back in his pocket. He had actually taken out the $50 note and replaced it with a piece of paper without LL knowing it.12. They took the lift to the highest level of the multi-storey carpark. At a staircase landing there, the Accused placed some newspapers on the floor and told her to sit down. He then sat down beside her and gave her the red packet which she put into her bag. He next leaned forward to kiss her lips. She pushed him away as she found it disgusting. He told her they had to kiss to prove to his friend who was watching them from the staircase above that they were a \"couple\". Despite that, LL refused to engage in kissing. He then asked her to lie down on the floor. Again she refused to do so but he explained they had to act like they were kissing to convince his friend. He got on top of her and kissed her neck. She felt uncomfortable and tried to move away from him.13. The Accused then stood up and lowered his jeans and his underpants. He wanted to take off LL's panties but she stopped him and held on to her panties. Nevertheless, the Accused pushed her hand aside and removed her panties. She was shocked and frightened and did not know what to do as she thought they would only be kissing. She also feared for her safety as she believed his friend was nearby watching them. Without her consent, the Accused proceeded to penetrate her vagina. He withdrew his penis subsequently and ejaculated onto her thigh.14. The Accused then dressed up and claimed he had to meet a friend. He told LL to go home by herself and left her alone in the carpark. Still in a state of shock, she tried to gather her thoughts. She then remembered the red packet in her bag. When she took it out, she found nothing more than a piece of paper inside and realized that the Accused had deceived her. This episode was the fifth charge in the series.15. A few days later, the Accused called LL's mobile telephone and, pretending to be a friend of hers, asked her whether anything had happened to her lately. She could recognize his voice and told him it had nothing to do with him.15. The next day, he called LL again. This time, he said he had some photographs of her lying down on the landing with \"that guy\". She disbelieved him and asked him to describe her clothing in the photographs. When he managed to do so accurately, LL began to suspect it was the rapist himself. She asked him how he managed to get the photographs and was told he had purchased them over the Internet. He then told her if she wanted them back, she had to meet him at the Astro Hotel in Joo Chiat Road.16. One week after the rape at the multi-storey carpark, LL went to the said hotel as arranged and went up to a room on the second level as instructed. When the door of the room opened and the Accused told her to go in, she did not dare to enter as it was dark inside and she could not see who was in the room. He then pulled her inside and closed and locked the door. He told her to sit on the bed but she did not want to as she still could not make out his face. She asked him to switch on the lights but he refused as he said he did not wish to be recognized by her. LL then asked him whether he was the one who had raped her but he denied it. When he went near the toilet where there was some light, she recognized him and was shocked and afraid. She kept saying he was the rapist but he kept denying it.17. She then asked the Accused to hand the photographs over to her but he said she had to have sexual intercourse with him first. She refused and pleaded for the photographs but he remained adamant about the terms. When she still refused to have sex with him, he told her that if she left the room, he would post the photographs on the Internet. LL felt completely helpless and asked him to show the photographs first. He then claimed he had kept them with a friend in case she led the police to the hotel. He then stripped the confused LL and proceeded to penetrate her without her consent. He withdrew his penis after some time and ejaculated onto her stomach. After cleaning himself with some tissue, he gave LL $20 to take a taxi home. This rape formed the subject of the sixth charge.18. The same scenario was to be replayed two more times in the same hotel in April and in May 2002 with LL hoping on each occasion that she would obtain the photographs but she never did. These were the two other instances of rape taken into consideration for the purpose of sentencing.19. LL was found to be suffering from chlamydia, a sexually transmitted disease. Apart from the Accused, she did not have sexual intercourse with any male person.20. The final charge of rape followed much the same pattern. This time, it was the 13 year old HQ who noticed the Accused's posting in the teenagers' chat room asking for a temporary girlfriend in exchange for money. When she established contact with him out of curiosity, she was told he was feeling very sad as his girlfriend had left him. Again he mentioned that the temporary girlfriend he wanted had to engage in kissing and petting. HQ agreed to meet him as she was curious about the Accused's looks. She told him her mobile telephone number.21. One Saturday afternoon in March 2002, HQ went to wait for the Accused at the Boon Lay MRT station. He called her mobile telephone and told her to meet him at the void deck of a certain block of flats.22. When she went there, the Accused was wearing a cap and sunglasses. He was also carrying a bag. He led her to the same multi-storey carpark referred to earlier and they went up to one of the highest levels together. They sat down and talked for a while at a staircase. Suddenly, the Accused turned and kissed HQ on her lips. He then took out a video camera and started to film her despite her objections, telling her there was no tape in it. He then touched her breasts, unbuttoned her blouse and lifted up the t-shirt underneath. HQ was so shocked by his actions she was lost as to what to do.23. The Accused then told HQ to lie down. When she did, he pulled down her shorts and her panties. He then aimed his video camera at her body and told her to lift up her blouse to cover her face. She complied with his instructions out of fear as she did not know what he was going to do next. When her face was thus covered, the Accused inserted his penis forcefully into her vagina without her consent while continuing to film her. She felt the pain of penetration for about ten minutes before the Accused withdrew from her. He then told her to dress up and gave her $50 to take a taxi home.24. In June 2002, HQ was told by the Accused over the telephone that he had her nude photographs. He wanted her to have sex with him and, if she refused, would post those photographs on the Internet and circulate them in her school. He also warned her not to call the police or he would carry out the same threat. HQ asked him to prove he had such photographs by sending them to her via email. The next day, she was shocked to see an attached picture of her raising her t-shirt to expose her chest.25. Following that, the Accused kept pestering HQ for sex in exchange for the photographs. She was not able to cope with his harassment and, on 6 July 2002, she went with a friend to lodge a police report.26. On 14 July 2002, HQ went to meet the Accused at Joo Chiat Complex so as to assist the police in arresting him. He was arrested there that day. In the course of the investigations, it was discovered that the Accused had sought medical attention for a sexually transmitted disease on 15 May 2002.",
        "Antecedents": "27. The Accused’s only antecedent was a conviction on three charges (with two more taken into consideration for sentencing) by a General Court Martial of the Singapore Armed Forces on 14 December 2001 for military offences committed during national service. He was fined $800 in respect of each of the three charges. The offences included an attempt to peep into a ladies’ toilet when there was a female using it then, entering a female officer’s bunk to search for undergarments and possessing computer material with obscenity stored therein. This, the Prosecution submitted, showed he had a propensity to re-offend in sex crimes as some of the offences there were of a sexual nature.",
        "The prosecution's submissions on sentence": "28. Relying on judicial guidelines enunciated inChia Kim Heng Frederick v PP[1992] 1 SLR 361,Lim Hock Hin Kelvin v PP[1998] 1 SLR 801,Tay Kim Kuan v PP[2001] 3 SLR 567,PP v Soh Lip Yong[1999] 4 SLR 281 andAdam bin Darsin v PP[2001] 2 SLR 412, the Prosecution urged me to impose a sentence that would \"send a clear warning to all potential offenders that sexual assaults on children and young persons will not be tolerated and will be accorded the gravest punishment the law sanctions\". The Prosecution also submitted that the Accused already had a sexually transmitted disease on 15 May 2002 (the date he sought medical attention) and most probably knew he had it by the time he raped LL for the fourth time on 11 May 2002.",
        "The mitigation plea": "29. The Accused is from a family of modest means. His father is a bus driver while his mother works as a production operator. He has two sisters, one older than him by two years and the other younger than him by two years. He had a good relationship with his family members. They were totally shocked by the offences committed by him as he had always been sensible and obedient.30. The Accused was awarded a diploma in Electronics, Computer and Control Engineering at a local polytechnic. He worked hard and performed well in the course. He then performed national service responsibly.31. In December 2000, he joined Sony Precision Engineering Centre as an Assistant Engineer. He was rated as a very hardworking employee and a quick learner.32. Recently, he got to know a Thai undergraduate through the Internet, visited her frequently in Bangkok and maintained a healthy relationship with her. She travelled here after learning of his arrest to give him her moral support.33. The accused was deeply in love with AL, his first girlfriend, before she ended the relationship with him. \"What began as a commercial relationship became a sincerely affectionate one\". Their sexual encounters were all consensual and were part and parcel of the relationship they once had. This was confirmed by AL during the investigations and she was none the worse after her relationship with the Accused ended. It was also argued that all the girls involved in the charges were informed of the Accused’s intention to have intimacy from the outset and accepted his offer of payment readily. There was therefore no position of responsibility and trust that he had abused. No violence was used. He did not prey on young victims. He had relationships with older women too.34. Only the sixth charge involving LL contained the element of blackmail. The threat of the Accused was an empty one anyway as he did not take any nude pictures of her. LL’s fear was therefore an unreasonable one as his threat was a mere bluff. Further, he said in his statement to the police that he would not have posted HQ’s picture on the Internet even if she rebuffed him. HQ returned to the chat room after the incident to demand an explanation why she was not fully paid and threatened him with assault. This was denied by the Prosecution which explained that HQ was in fact looking for the Accused as he had disappeared suddenly after the rape. She did not threaten him with assault. She did not know how to deal with him at that time and only managed to pick up the courage after some time to report the matter to the police.34. It was also submitted that the Accused co-operated with the police by volunteering information during the investigations. This showed \"his deep contrition and regret\" over the incidents. Further, he instructed his counsel to dispense with the attendance of the girls even at the Preliminary Inquiry so as not to inconvenience or traumatise them or their families. He suffered from depression while awaiting trial and was currently on medication.35. The Accused went to see a doctor only when he realized something was wrong with him on 15 May 2002. He did not know that he had a sexually transmitted disease at the time of the sexual encounters with LL.36. He pleaded guilty and was deeply remorseful. He was still young while his parents were getting on in years and may not be able to see him again outside prison. His conviction by the General Court Martial had no bearing on the present offences.",
        "The decision of the court": "37. The Accused is certainly not unintelligent. Unfortunately, he has used his intelligence for improper purposes. Indeed, he is a very resourceful con-man. He knows the Internet chat room is very fertile ground for his exploits. His use of trickery and threats shows him to be a man who understands the psyche of young girls quite well. He first used money to lure the young girls out and then resorted to blackmail to attempt to have them as his virtual sex slaves. In order to do all this, there had to be forward planning. Where the third girl was concerned, he went to the very first rendezvous prepared with a video camera.38. Blackmail does not exist only when the blackmailer has the ability to carry out his threats. It is sufficient that the person at the receiving end believes and is in fear as a result of the threats to disseminate intimate pictures of her, especially through an ubiquitous medium like the Internet.39. The victims were very young girls, perhaps a little too precocious for their own good. However, the law exists to protect young persons of vulnerable minds from adult predators like the Accused. At any rate, the precocity of their foolish actions is completely outmatched by the atrocity of the Accused’s fiendish acts.40. Whether it was done with or without his knowledge, the fact remains that the Accused caused one of the girls to suffer from a sexually transmitted disease and that aggravates the crime.41. The first two of the Court Martial offences indicated he could be a menace to females in general.42. The Accused has indicated his intention to admit all the Charges at a very early stage and has pleaded guilty in this Court. By doing so, he has spared the three girls the embarrassment of having to recount the unhappy episodes which, I am sure, they would very much like to forget.43. Bearing in mind the sentencing guidelines and principles enunciated in the cases cited by both parties and bearing in mind all the circumstances of this case, I now sentence Mr Raymond Pok as follows:1st, 2ndand 3rdCharges - 2 years imprisonment per Charge5thand 6thCharges - 10 years imprisonment and 10 strokes of the cane per Charge9thCharge - 13 years imprisonment and 16 strokes of the cane.The imprisonment terms for the 5thand the 9thCharges are to run consecutively with effect from 14 July 2002, the date of arrest and remand. The rest of the sentences are to run concurrently with these two sentences. The Accused is to be subject to a maximum of 24 strokes of the cane.Copyright © Government of Singapore."
    }
}