{
    "case_title": "Mohammed Aziz Bin Ibrahim and Another v Pertubohan Kebangsaan Melayu Singapura",
    "ncitation": "[2003] SGHC 282",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "2.         PKMS, known in English as “Singapore Malay National Organisation”, is a political  party.  The plaintiffs have been members of PKMS for a very long time.  The first plaintiff joined PKMS in 1983 while the second plaintiff has been a PKMS member since 1984. 3.         The first plaintiff is also a tenant of PKMS.  He rented 218C Changi Road, Singapore 419773, from PKMS for $6,000 per month and operates a food court on the said premises.  Clause 3(x) of the lease for this commercial unit provided that the lease is to be surrendered if he is no longer a member of PKMS.  The first plaintiff contended that he was expelled from the party because PKMS wanted to end the tenancy in question.  This allegation was denied by PKMS, whose counsel claimed that the first plaintiff instituted these proceedings to protect his lease and that the lease was more important to him than his party membership.  These and other accusations hurled by the parties against one another need not be considered in this judgment for the simple reason that the only issue before the court is whether or not the rules of natural justice were observed when the plaintiffs were expelled from PKMS on 9 June 2003. 4.         Although the plaintiffs’ complaint relates to their expulsion from PKMS on 9 June 2003, this was not the first time an attempt was made to expel them.  The plaintiffs pointed out that on 1 November 2002, Mr Muhamad Ali Aman, the secretary general of PKMS, sent each of them the following letter: With reference to PKMS Executive Council Special Meeting held on 29/10/02, a decision to terminate your membership with PKMS with immediate effect was made by the Council. The decision is made due to the following: 1.         As a director of Merdeka Holdings, you failed to wind-up the company within the period until 31/10/02 as directed by PKMS Executive Council. 2          The statement of accounts of Merdeka Holdings and its subsidiaries could not be approved by the Executive Council as it contained many questionable and dubious [information]. 3.         [Y]ou have failed to give an accurate report on Merdeka Holdings payment of rents and its existing arrears to PKMS. 4.         As the person in charge of the investment of $45000.00 in FZ Buana, you have failed to obtain the balance of the shares amounting to $40,000.00. In accordance with article (21) of the PKMS Articles of Association, you can submit an appeal against this decision before it is submitted to the cabinet committee for a final decision.  You are also required to reply within seven (7) days from the date of this letter. 5.         The plaintiffs were not informed of the above-mentioned charges against them and were given no opportunity to defend themselves before the decision was taken to terminate their membership of PKMS. They consulted their solicitors, who wrote to PKMS on 2 December 2002 to point out that basic rules of natural justice had not been observed before the decision to terminate the plaintiffs’ membership was taken.  In the final two paragraphs of their letter, the plaintiffs’ solicitors stated: Our clients are long standing members of the Society …. They do not wish to commence legal proceedings to assert their legal rights and instead would prefer to resolve matters amicably.  To this end, they have instructed us to inform you to revoke your decision and declare the same null and void. Kindly let us know in writing by 10.12.2002 that you have revoked your decision …. 6.         PKMS did not respond to the plaintiffs’ solicitors’ letter. Subsequently, on 21 May 2003, the plaintiffs were summoned to appear before the party’s Disciplinary Committee on 23 May 2003 to answer a number of very serious charges, which will be referred to later on in this judgment.  What needs to be noted now is that on 23 May 2003, the plaintiffs’ solicitors replied to this letter and pointed out that the rules of natural justice had again not been observed.  On this occasion, the plaintiffs’ solicitors complained that their clients had only been given two days to respond to a number of very serious charges, which were devoid of particulars.  It was made clear that as the rules of natural justice had been breached and the plaintiffs had previous commitments, they would not be able to attend the hearing of the disciplinary committee that evening.  PKMS did not reply to the plaintiffs’ solicitors’ letter. 7.         On 23 May 2003, PKMS’ Disciplinary Committee met and considered the plaintiffs’ case in their absence.  The Disciplinary Committee decided that the membership of both the plaintiffs should be terminated.  On 29 May 2003, Mr Muhamad Ali Aman, the secretary general of PKMS, wrote to the plaintiffs to summon them to appear before the party’s Supreme Council.  This letter will be referred to in greater detail later on.  What needs to be noted now is that no reference was made in this letter to the Disciplinary Committee’s deliberations on 23 May 2003 or to the charges faced by the plaintiffs when they were summoned to appear before the Disciplinary Committee. 8.         On 5 June 2003, the plaintiffs’ solicitors wrote to PKMS to complain that the rules of natural justice had not been complied with as the letter of 29 May 2003 requiring the plaintiffs to appear before the Supreme Council did not contain any particulars of the allegations made against them.  It was also stated that the plaintiffs would not be appearing before the Supreme Council.  PKMS did not reply to this letter. 9.         On 9 June 2003, the Supreme Council of PKMS discussed the charges against the plaintiffs in their absence.  On 10 June 2003, a letter was despatched to the plaintiffs to inform them that they had been expelled by the Supreme Council on the previous day for violating Article 18(7) of the PKMS constitution. 10.       On 17 June 2003, PKMS’ solicitors demanded that the first plaintiff vacate No 218C Changi Road.  In their reply on 26 June 2003, the plaintiffs’ solicitors alleged that the decision to expel the plaintiffs was fundamentally flawed and that the question of an appeal against the decision did not arise because the charges against the plaintiffs contained no particulars.  It was also asserted that the plaintiffs had been expelled only because PKMS wanted to terminate the tenancy agreement for their commercial unit in Changi.  Subsequently, ugly incidents occurred at the said commercial unit.  The plaintiffs accused PKMS of breaking the water pipe that supplied water to the food court and of turning off the water pipe after the supply of water to the food court had been restored.  PKMS claimed that the rental for the food court had not been paid. 11.       On 16 July 2003, the first plaintiff obtained an interim injunction to protect his rights with respect to his tenancy until the question of the validity of his expulsion had been resolved by the courts.  On 21 July 2003, PKMS informed the plaintiffs that the party’s Supreme Council had decided to announce “their automatic expulsion from PKMS by virtue of Article 18 sub-section 6 of the PKMS Constitution”. Article 18(6) of the PKMS constitution provides as follows: A member who takes up a legal action against the PKMS over any issue or over his membership rights without first observing all the PKMS rules shall automatically have his membership in the PKMS stripped of. 12.       Needless to say, questions arise as to whether or not the plaintiffs had instituted legal proceedings against PKMS without “first observing all the PKMS rules” and why the plaintiffs were not given an opportunity to present their case before being expelled pursuant to Article 18(6) of the PKMS constitution.  However, these will not be considered as the plaintiffs’ application only concerns the decision of the PKMS Supreme Council on 9 June 2003.",
        "Whether the rules of natural justice were breached": "13.       The rules of natural justice ought to be followed before a member of an association is expelled.  In essence, this means that a member must have notice of the charges of misconduct which justify the termination of his membership and he must be given an opportunity to be heard by an unbiased committee.  When considering the application of the rules of natural justice in the present case, it is worthwhile noting the following oft-cited words of Tucker LJ inRussell v Duke of Norfolk & Ors[1949] 1 All ER 109, 118: There are, in my view, no words which are of universal application to every kind of inquiry and every kind of domestic tribunal.  The requirements of natural justice must depend on the circumstances of the case, the nature of the inquiry, the rules under which the tribunal is acting, the subject-matter that is being dealt with, and so forth.  Accordingly, I do not derive much assistance from the definitions of natural justice which have been from time to time used, but, whatever standard is adopted, one essential is that the person concerned should have a reasonable opportunity of presenting his case. 14.       While the plaintiffs asserted that the decision to expel them from PKMS on 9 June 2003 is null and void because the rules of natural justice had not been observed, PKMS contended that they had been given ample opportunities to be heard by the Disciplinary Committee and by the Supreme Council and they cannot complain if they chose not to appear before the two bodies. 15.       PKMS’ handling of the expulsion issue left much to be desired from the very start.  To begin with, when the first decision to terminate the plaintiffs’ membership was made on 1 November 2002, the plaintiffs were not given any notice whatsoever of charges against them nor they were given any right to be heard at the meeting at which the termination of their membership was considered.  During the trial, PKMS took the position that the plaintiffs had not been expelled in November 2002 because the decision to expel them at that time was not confirmed by their “cabinet”. 16.       As for the decision to expel the plaintiffs on 9 June 2003, PKMS contended that this must be viewed in the context of their Disciplinary Committee’s deliberations on 23 May 2003.  The letter of 21 May 2003 inviting the plaintiffs to appear before the Disciplinary Committee was worded as follows: The Supreme Council … on 17th May 2003 has decided that you are to appear before the PKMS Disciplinary Board on 23rd May 2003 at 9.00 pm…. You are to answer to the following: 1.         Being the “Director” of Merdeka Holdings and entrusted by PKMS, you were dishonest in the management of the following: (a)        Did not submit the financial report of Merdeka to the PKMS Supreme Council from the year 1995 to 2002 as required. (b)        Not seeking the approval of the PKMS Supreme Council for payments of allowances, bonuses and others apart from the salary scale set out for the directors. (c)        Investing $45,000.00 from Merdeka into the company FZ Buana where you have an interest. (d)        Was dishonest until arrears amounting to $32,000.00 in rent is due to PKMS. 2.         Failed to deliver and being irresponsible to settle arrears amounting to $32,000.00 as promised during the PKMS Supreme Council Meeting after unit 218C was rented out to you. 3.          Failed to respect the PKMS representative(s) by not co-operating to sign the transfer of trustee(s) when you are no longer one. 4.         Was dishonest in making payment from the MCST fund for renovation works in the interest of the company, Merdeka. Please be informed that if you fail to appear for the meeting for your defence, then the disciplinary Board shall proceed without hearing you. 17.       The plaintiffs’ solicitors asserted that the notice given to the plaintiffs on 21 May 2003 to appear before the Disciplinary Committee on 23 May 2003 was bad for two reasons.  First, insufficient particulars of the charges faced by the plaintiffs were furnished.  Secondly, the plaintiffs were given insufficient time to prepare their defence. The allegation of inadequacy of notice is not without substance.  As a general rule, a person who is told to appear before a Disciplinary Committee must be given sufficient time to effectively prepare his defence.  Considering the number of serious charges levelled against the plaintiffs, they should have been given more time to prepare their defence.  It ought to be noted that the letter of 21 May 2003  was posted to the plaintiffs and not handed over to them personally.  As such, to expect them to be ready to mount their defence by 23 May 2003 is really a tall order.  I hold that on 21 May 2003, the plaintiffs were given inadequate notice of the meeting of the Disciplinary Committee on 23 May 2003 and that PKMS breached the rules of natural justice by depriving them of a reasonable opportunity to prepare their defence against the numerous charges faced by them. 18.       The plaintiffs could have turned up at the meeting to ask for more time to prepare their case.  Even if they ought to have attended the meeting in question, the Disciplinary Committee should have been conscious of the injustice caused by the failure to give the plaintiffs sufficient time to prepare their case.  It should not have proceeded with the inquiry in the absence of the plaintiffs. 19.       In view of the breach of the rules of natural justice, the deliberations of the Disciplinary Committee, which decided that the plaintiffs should no longer be members of PKMS, were seriously flawed and should not have been relied upon by the Supreme Council of PKMS. 20.       Apart from the fact that the PKMS Supreme Council erred in taking into account the recommendations of the Disciplinary Committee, the notice to the plaintiffs to appear at a meeting of the Supreme Council on 9 June 2003 was also open to attack.  The letter of 29 May 2003 was worded as follows: Please be informed that you are required to appear before the 6th Special PKMS Supreme Council Meeting on 9 June 2003 at 8.30 pm at the PKMS meeting room. You are required to make your defence as regards the violations of the PKMS Articles of Association, namely Article 18 sub-section 7, that all members of PKMS shall at all times:- (b)        Comply with the rules and regulations of PKMS. (c)        Abide by and respect all decisions of PKMS. The violations were committed  by you whereby you had in the past, held  a position in PKMS.  We hope to have your co-operation in this matter. 21.       As has been mentioned, on 5 June 2003, the plaintiffs’ solicitors wrote to PKMS to complain that the latter’s letter of 29 May 2003 did not contain particulars of the allegations made against their clients.  This contention is justified as a person who is charged with having not complied with the rules and regulations of PKMS and with failing to abide by and respect decisions of PKMS cannot be certain as to what he has to defend himself against.  PKMS claimed that the plaintiffs must have known that the members of their Supreme Council were meeting on 9 June 2003 to consider the charges considered by the Disciplinary Committee and referred to in their letter of 21 May 2003.  However, the plaintiffs contended that they did not know that the Disciplinary Committee had  proceeded with the hearing on 23 May 2003 and no reference was made in PKMS’ letter of 29 May 2003 to the meeting of the Disciplinary Committee or to the deliberations of that committee. 22.       Notwithstanding the valid protest of the plaintiffs’ solicitors, the PKMS Supreme Council proceeded to consider the case against the plaintiffs in their absence and took the decision to expel them from the party for breaching Article 18(7) of the PKMS constitution.  There can be no doubt that this decision is totally unacceptable as it was taken in blatant violation of the rules of natural justice.",
        "Whether the plaintiffs have exhausted their internal remedies": "23.       PKMS contended that even if the rules of natural justice had been breached, the plaintiffs were not entitled to come to court to complain about their expulsion until they had exhausted their internal remedies.  They pointed out that the plaintiffs had not complied with Art 18(5) of the PKMS Constitution, which provides as follows: A member or party who is unhappy with a disciplinary action taken against him may appeal to the Supreme Council. 24.       Whether a member of an association must exhaust his internal remedies before coming to court has been discussed in innumerable cases.  PKMS’ counsel relied onWhite v Kuzych[1951] 2 All ER 435, where the Privy Council decided that a member of a Canadian trade union, who complained that the rules of natural justice had not been observed before he was expelled,  was bound by his contract to appeal to a higher body within the organisation before coming to court to seek a declaration that he had not been validly expelled. However, that decision has been justified in subsequent cases on the basis that the trade union member in question had undertaken to abide by the following oath: I promise that I will  not become a party to any suit at law or in equity against this union or the federation, until I have exhausted all remedies allowed to me by the said constitution and bye-laws. 25.White v Kuzychwas followed in a Malaysian case,Tharmalingam v Sambanthan[1961] 27 MLJ 63, which concerned the expulsion of a member of the Malaysian Indian Congress by the party’s president.  In that case, Thomson CJ said that as a matter of construction, the provisions of the constitution of the Malaysia Indian Congress obliged the member in question not to pursue his remedy in the courts until all remedies under the party’s constitution had been exhausted. 26.       It is pertinent to note that inAnnamunthodo v Oilfields Workers’ Traders Union[1961]  AC 945,  Lord Denning, who delivered the opinion of the Privy Council, referred to the “special circumstances” inWhite v Kuzych.  Evidently, he was referring to the express oath of the trade union member in question.  Subsequently, inLawlor v Union of Post Office[1965] 1 All ER 353, where the plaintiffs sought to restrain the executive council of a trade union from acting on a decision to expel them from the union, Ungoed-Thomas J said that the facts inWhite v Kuzychdiffered from those in the case before him because the plaintiffs were not contractually bound by an express provision in the union bye-laws to exhaust their domestic remedies before resorting to the courts.  As such, he granted the plaintiffs the order sought by them. 27.       The question of exhaustion of internal remedies was also considered by FA Chua J inVisvasam v Singapore Toddy Tappers’ Union[1965-1968] SLR 820.  In that case, the plaintiff who had been expelled from the union, claimed that he had no opportunity to defend himself before he was expelled.  He sought a declaration that the expulsion was improper and an injunction restraining the defendants from acting upon the decision to expel him. The defendants contended that as the plaintiff had not exhausted the internal remedies available to him by appealing to the annual or extraordinary general meeting, he should not be granted the relief sought by him.  Chua J, who was satisfied that the rules of natural justice had not been observed, added that as there was no contractual provision case requiring the plaintiff to exhaust internal remedies available to him before coming to the courts, he was entitled to the relief sought. 28.       A similar approach was adopted by Warren Khoo J inChiam See Tong v Singapore Democratic Party[1994] 1 SLR 278.  In that case, the plaintiff, a member of Parliament, claimed that he had been wrongfully expelled by his party.  It was found that the rules of natural justice had not been complied with before the plaintiff was expelled.  As for the defendants’ contention that the plaintiff’s claim should be dismissed because he had not exercised the right of an expelled member to appeal to the ordinary party conference, Warren Khoo J pointed out thatWhite v Kuzychwas distinguishable because no member of the defendant political party had taken an oath that he would not institute legal proceedings until the remedies provided for under the party’s constitution had been exhausted. 29.       I hold that as a matter of construction, the plaintiffs in the present case are not required to exhaust their internal remedies before instituting legal proceedings.  Apart from the fact that the plaintiffs rightly pointed out that as they did not have adequate notice of the charges considered by the Supreme Council, they had difficulty framing an appeal, it ought to be noted that  PKMS took a rather unfair position regarding the plaintiffs’ right of appeal under Art 18(5) of the PKMS constitution. The final paragraph of their letter of 10 June 2003 to the plaintiffs regarding their expulsion was worded as follows: In accordance with Article 18, sub-section  5, you have till Monday, 16th of June 2003 to file an appeal.  Please be informed that we will not entertain any appeal from you after the stipulated date. 30.       Nowhere in Art 18(5) of the PKMS constitution is there a requirement that such an appeal has to be made within 6 days.  I thus hold that the fact that the plaintiffs have not appealed to the PKMS Supreme Council does not bar their claim in the courts.",
        "Conclusion": "31.       As the expulsion of the plaintiffs on 9 June 2003 was in breach of the rules of natural justice,  the plaintiffs are entitled to a declaration that the decision of the PKMS Supreme Council to expel them on 9 June 2003 is null and void.  As such, they did not cease to be PKMS members on that day.  The plaintiffs are entitled to costs."
    }
}