{
    "case_title": "Purwadi v Ung Hooi Leng",
    "ncitation": "[2003] SGHC 211",
    "coram": "S Rajendran J",
    "sections": {
        "Step in the proceedings.": "15        Even if the order for substituted service that was obtained was bad by reason of Ung not being in Singapore at the material time, the question arises whether by applying for leave to file her defence/enter appearance, Ung had waived that irregularity.16        Counsel for Purwadi submitted that by applying, at the initial stage, for leave to file her defence/enter appearance instead of applying to set aside the order for substituted service, Ung was indicating a willingness to “enter the fray” and was necessarily waiving any irregularity as to service.  InDevelopment & Commercial Bank v Aspatra[1995] 3 MLJ 472, Peh Swee Chin FCJ succinctly summarised the law on such waiver as follows:A person cannot approbate and reprobate, so that if a person becomes aware of an irregularity of service and then subsequently takes a further step in the action which could be only useful if the service had been good, the said irregularity is waived.I accept that summary of the law and I accept the submission of counsel for Purwadi that Ung, in seeking leave to file her defence/enter appearance, was clearly waiving any irregularity that may have existed and was submitting to the jurisdiction of the court.",
        "Merits": "17        The criterion that a court will use in setting aside a default judgment is summarised as follows in the Singapore Civil Procedure (2003 edition) at 131:The discretionary power of the court to set aside a default judgment which has been entered regularly is unconditional, and the court should not lay down rigid rules which deprive it of jurisdiction.  The purpose of the discretionary power is to avoid the injustice which may be caused if judgment follows automatically on default.The primary consideration in exercising the discretion is whether the defendant has merits to which the court should pay heed, not as a rule of law but as a matter of common sense, since there is no point in setting aside a judgment if the defendant has no defence, and because, if the defendant can show merits, the court will notprima faciedesire to let a judgment pass on which there has been no proper adjudication.  [Emphasis added]The merits of the defence is a matter that has to be considered when exercising the discretion to set aside a default judgment.  The learned Asst Registrar had, in her judgment – which I have quoted above – found that the defences raised had no merit.  It will suffice to say that I agree with the learned Asst Registrar’s findings.  Ung, in my view, has not shown merit in the defences she raised.18        Subsequent to the hearing before the Asst Registrar, Ung filed a further affidavit stating, for the first time, that she had left cheques signed in blank with one Ho Seng Chuan – who conducted trades in the stock market on her behalf – for Ho Seng Chuan to settle contra losses incurred by him on her behalf.  It would appear that Ung, in this affidavit, was resiling from the suggestion in her earlier affidavit that the cheque had been forged by Purwadi.  The failure by Ung to disclose the role of Ho Seng Chuan in her earlier affidavits and her admission in the further affidavit that the cheque was in fact signed by her (and therefore not a forgery) reflect adversely on Ung.  In an application to set aside a default judgment, full and frank disclosure of all relevant facts is expected from the applicant.19        For the above reasons, I dismissed with costs both the appeal against the Asst Registrar’s decision and the application in SIC 5481/2003.Defendant’s appeal in RA 291/2003 dismissed with costs.Defendant’s application in SIC 5481/2003 dismissed with costs.Copyright © Government of Singapore."
    }
}