{
    "case_title": "Choy Kok Meng v Public Prosecutor",
    "ncitation": "[2003] SGHC 150",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Background": "2The charges related to incidents that happened on 6 August 2001.  Makanah had been working for Choy for about 11 months. Her routine for the preceding few months to the incidents consisted of doing the household chores from six to about ten in the morning, after which Choy would bring her to his office.  She would stay there for the rest of the day and be brought back to Choy’s house only late at night.  The first three charges related to incidents which happened in Choy’s house (“house incidents”), while the other two related to incidents which happened in his office (“office incidents”).The house incidents3          Makanah testified that she was mopping the floor in the master bedroom of Choy’s house at around 9 am when Choy told her to speed up her work. She looked at him and continued her mopping.  Choy then kicked her on her right thigh, just below the buttock.  This comprised the subject matter of the first charge.4          About 20 minutes later, Makanah was going to the kitchen to change and shower.  Choy again told her to hurry.  He then scolded her angrily and kicked her on her left calf in the kitchen.  This incident comprised the second charge.5          Subsequently, at around 10 am, Choy stood at the doorway and again told Makanah to hurry.  Makanah had previously been instructed by Choy’s wife to clean the sofa and was in the process of doing so.  Being confused, she decided to continue cleaning the sofa.  Choy yelled at her again and then came up to her.  He pushed a coffee table against her shins.  This incident constituted the third charge.6          After the incidents, Makanah was brought to Choy’s office.The office incidents7          The fourth incident happened at around 3.30 pm.  Makanah testified that she was cleaning the walls with a sponge which had a plastic handle.  She informed Choy that the sponge was damaged.  Choy took the sponge and spoke to his wife about it.  He apparently got angry after that and slammed the sponge into Makanah’s left jaw. Choy then threw the sponge into a pail of water.  This was the subject of the fourth charge.8          The final incident occurred around 4.30 pm.  Makanah testified that she had been instructed by Choy to clean the photocopier.  Choy was displeased with how she was doing it and punched her once at the rear of the right shoulder.  This was the subject of  the fifth charge.9          Makanah continued her cleaning after this.  She testified that she was left alone in the workshop area of the office at around 7 pm, when Choy and his wife left for dinner.  She was locked inside and became hungry.  At around 8 pm, she started banging on the shutters and cried for help.  A neighbour heard her and informed the security guard, who called both Choy and the police.  Choy arrived at the office a short while later.  The police arrived soon after and interviewed both Makanah and Choy.10        Makanah was interviewed by one Sgt Kamaruzaman.  He spoke to her in basic Malay.  She told Sgt Kamar that she had been hit by a “kitchen utensil” on the face and also kicked by Choy.  Sgt Kamar testified Makanah’s face appeared reddish.  A fruitless search was conducted for the “kitchen utensil”.11        Makanah was later examined at about 1 am the next morning 7 August 2001 by one Dr Quek.  Dr Quek testified that Makanah complained of pain on her face and back.  His examination found bruises on Makanah’s left jaw and the back of her right thigh.  Photographs taken by the police hours after the medical examination also revealed  bruises on Makanah’s left calf and back.",
        "The defence": "12        Choy’s defence was one of alibi for the house incidents, and of bare denial for the office incidents.  For his alibi, Choy alleged that he had left the house before 9 am to send his son to a kindergarten. In support of this, he produced the attendance register of the kindergarten, which showed that his son was signed in at 8.45 am on 6 August 2001.13        However, forensic examination of the register revealed that Choy had signed over an “ABS” notation for his son on that day.  It was undisputed that “ABS” was entered on the register to signify the child’s absence on the particular day.  The magistrate thus found that this part of his evidence had been falsified.14        In addition, the magistrate also found that Choy’s credibility was impeached as his version of the events on the morning of the house incidents given in court differed from what he had set out in his statement to the police.15        The other two main witnesses for Choy were his wife (“Ghee”) and her sister (“Vivien”).  Both testified that they were in the office at the time of the office incidents, and also that the incidents did not happen.  The magistrate also found both their credibilities impeached as their version of events given in court differed materially from what they had given in their police statements.",
        "The finding below": "16        The magistrate found Makanah to be a truthful witness.  He rejected the defence’s contention that she had inflicted the injuries on herself to frame the accused.  He also found that Choy’s lies concerning his alibi were deliberate and constituted corroborative evidence against him, following the guidelines enunciated inR v Lucas (Ruth)[1981] QB 720 and applied inPP v Yeo Choon Poh[1994] 2 SLR 86.17        In addition, the results of Dr Quek’s medical examination were found to be corroborative evidence of Makanah’s account.  Accordingly, the magistrate convicted Choy on all five charges.",
        "The appeal": "18Choy’s appeal focused primarily on the magistrate’s acceptance of Makanah’s accountin toto.  He argued that the magistrate did not pay enough heed to the possibility that Makanah had had both motive and opportunity to frame Choy by self-inflicting her injuries and that the evidence adduced in the trial below did not support a finding of guilt on his part.",
        "The law on appeals": "19        It is trite law that an appellate court should be slow to disturb a lower court’s findings of fact, and only do so when it is convinced that the finding was wrong: seeLim Ah Poh v PP[1992] 1 SLR 713,PP v Azman bin Abdullah[1998] 2 SLR 704.  This is especially where it hinged on the trial judge’s assessment of the credibility and veracity of the witness:Yap Giau Beng Terence v PP[1998] 3 SLR 656.20        In this case, as correctly noted by the magistrate, it was essentially Makanah’s word against Choy’s, with some corroborative medical evidence.  The magistrate had decided, based on Makanah’s demeanour in court, that she was a credible witness whose account was supported in some aspects by the medical evidence.  The burden on Choy here was a particularly heavy one, which I found that he did not discharge.21        Choy had prepared detailed submissions challenging key aspects of the evidence adduced by prosecution below.  It was his contention that the evidence in the case was not sufficient to support  the magistrate’s finding of his guilt.  I set out below the salient aspects of his challenge.The medical evidence22        The results of Dr Quek’s examinations were unchallenged and evidenced three injuries on Makanah – on her left jaw, rear right thigh and back.  In addition, subsequent photographs showed a bruise on her left calf.23        These injuries were consistent with the incidents described in the first, second and fourth charges.24        Choy’s challenge here was that the injuries could have been self-inflicted, the possibility of which was also admitted by Dr Quek.  Choy contended that the magistrate had failed to pay sufficient heed to this.25        I found this to be without merit.  Dr Quek had remarked in trial that it was unlikely for the injuries to be self-inflicted, especially the bruise on the rear thigh, as “the physics is wrong, the angle is not right”. Furthermore, the magistrate had found Makanah to be a truthful witness, whose account of the incidents squared with the injuries found.  The mere possibility of these injuries being self-inflicted did not cast any reasonable doubt on either the prosecution’s case or the magistrate’s findings.26        With regard to the bruise on the left calf, Choy pointed to the fact that it appeared only after the medical examination.  He also drew attention to the bruise on Makanah’s back, which was documented in the medical examination but was not the subject of any charge against him.  Choy argued that this was highly suspicious and supported his contention that Makanah had inflicted the injuries on herself and had made up the incidents.27        I was unconvinced by this argument.  The prosecution has the sole discretion concerning charges preferred against an accused.  No questions were directed at Makanah concerning her back injury, nor to Dr Quek on whether a bruise must develop within a fixed period of time.   On the basis of the evidence before him, it could not be said that the magistrate was obviously wrong in his conclusions that the bruises were the result of the incidents documented in the charges.Makanah’s complaints on the day of the incident28        Choy pointed here to Makanah’s complaints to Dr Quek during the medical examination.  Makanah had only mentioned the pain on her face and her back – no mention was made of the other parts of her body.  Choy contended that this cast doubt on Makanah’s account, since she knew that she was being examined for signs of assault and should have mentioned all the relevant areas specified in the five charges.29        Makanah’s explanation for not mentioning other parts of her body was that she believed that the doctor had “checkedeverything” and thus she did not bother to raise any further injuries.30        The only other instance of Makanah’s complaints of her injuries before investigation was to Sgt Kamar on 6 August 2001.  She mentioned that she was hit on the face and had also been kicked. This corresponded to the incidents mentioned in the first, second and fourth charges.31        My perusal of the evidence showed that Makanah had mentioned the incidents contained in the first, second and fourth charges to either Sgt Kamar or Dr Quek, or both.  In addition, Dr Quek’s evidence was that Makanah only complained about the parts of her body that were experiencing pain at that time. She was focussed on merely informing Dr Quek about where she was hurting at that moment, which would have been her immediate concern.  However, lack of complaint, or pain, does not mean a lack of assault on that part of her body.32        It was in relation to the third and fifth charges where the prosecution case was weakest.  There was no evidence of medical injuries on Makanah’s shins or shoulder and also no complaint by her prior to investigations.  In essence, the magistrate’s finding that these two charges were made out was based solely on his finding that she was a truthful witness and that her account was to be believed.33        Where a conviction is to be based solely on the word of the complainant, the correct approach to be taken was set out by me inKwan Peng Hong v PP[2000] 4 SLR 96, where I emphasised that extreme caution must be taken in examining the complainant’s evidence.  However, I also held that there must be an evidential basis for suggesting that the complainant’s evidence was unreliable.34        While this approach was not explicitly stated by the magistrate in his grounds of decision, it was clear that he had scrutinised in great detail all of the witnesses’ evidence.  The defence was also essentially discredited in totality, which was a key factor in his decision.35        Having gone through the evidence in great detail, and bearing in mind the guidelines enunciated inAzman bin Abdullah, I found no basis to say that the magistrate was clearly wrong in his conclusion.  In the result, I found Choy’s conviction on the third and fifth charges to be correct.",
        "Conclusion": "36        Choy raised other points of appeal in his submission, but I did not find that they added substantially to his case.  The crux of this case was found in the respective balancing of credibilities between the complainant and Choy.  The magistrate had decided in favour of the complainant in this case; and  I could find nothing in the evidence to convince me that he had erred in this instance.37        In the result, I dismissed the appeal against conviction.Appeal dismissed.Copyright © Government of Singapore."
    }
}