{
    "case_title": "Rosaline Singh v Jayabalan Samidurai (alias Jerome Jayabalan)",
    "ncitation": "[2003] SGHC 313",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Division of matrimonial assets": "6.         The appellant was satisfied with having a 50% share of the matrimonial home, which was valued at $350,000.  What she was dissatisfied about was that the District Judge awarded her only 35% of the other matrimonial assets.  When considering the division of matrimonial assets, one should first refer to s 112 of the Women’s Charter (Cap 353).  S 112(1) of the said Charter provides as follows: The court shall have power, when granting or subsequent to the grant of a decree of divorce, judicial separation or nullity of marriage, to order the division between the parties of the proceeds of the sale of any matrimonial asset or the sale of any such asset and the division between the parties of the proceeds of the sale of any such asset in such proportions as the court thinks just and equitable. 7.         S 112(2) of the Women’s Charter adds as follows: It shall be the duty of the court in deciding whether to exercise its powers under subsection (1) and, if so, in what manner, to have regard to all the circumstances of the case, including the following matters:- (a)        the extent of the contributions made by each party in money, property or work towards acquiring, improving or maintaining the matrimonial assets; (b)        any debt owing or obligation incurred or undertaken by either party for their joint benefit or for the benefit of any child of the marriage; (c)        …. (d)        The extent of the contributions made by each party to the welfare of the family, including looking after the home or caring for the family or any aged or infirm relative or dependant of either party; (e)        …. (f)        …. (g)        The giving of assistance or support by one party to the other party (whether or not of a material kind), including the giving of assistance or support which aids the other party in the carrying on of his or her occupation or business; and (h)        …. 8.         S 112 of the Women’s Charter has been considered in innumerable cases.  InLim Choon Lai v Chew Kim Heng[2001] 3 SLR 225, the Court of Appeal reiterated that the division of matrimonial assets is not an exact science and each judge would have his own view as to what would be a just and equitable division in a particular case.  In that case, LP Thean JA, who delivered the judgment of the court, likened the process of division of matrimonial assets to that of assessment of damages or losses.  He summed up the principles to be borne in mind for the purpose of division of matrimonial property in the following terms at p 231: In determining a ‘just and equitable’ division of matrimonial assets under s 112(1) of the Women’s Charter, the court must, as directed by s 112(2), have regard to all the relevant circumstances of the case at hand, and in particular the matters enumerated in that subsection, in so far as they are applicable, and on that basis determine what a ‘just and equitable’ division should be.  The matters enumerated there comprise both financial and non-financial contributions made by the parties.  Where financial contributions are concerned, the court must, of course, take into account the sums contributed by each party; these are the matters specifically mentioned in paras (a) and (b) of s 112(2).   However, this does not mean that the court should engage in a meticulous investigation and take an account of every minute sum each party has paid or incurred in the acquisition of the matrimonial assets and/or discharge of any obligation for the benefit of any member of the family, and then make exact calculations of each party’s contributions.  The court must necessarily take a broader view than that.  As for the non-financial contributions, they also play an important role, and depending on the circumstances of the case, they can be just as important.  At the end of the day, taking into account both the financial and non-financial contributions, the court would adopt a broad-brush approach to the issue and make a determination on the basis of what the court considers as a ‘just and equitable' division. 9.         If the above-mentioned principles are borne in mind in relation to the division of the parties’ matrimonial assets excluding the matrimonial home (the “other matrimonial assets”), the District Judge’s decision cannot be faulted.  After a thorough consideration of the allegations made by both parties against each other, she ruled that the other matrimonial assets were worth $654,003.  She noted that the appellant, who has been a housewife since 1971, had not contributed financially towards the acquisition of the other matrimonial assets and that her contribution related to caring for the children and looking after the home.  After making it clear that she had considered all the relevant circumstances under s 112 of the Women’s Charter, including the length of the marriage and the financial and non-financial contributions of the parties, she held that the appellant was entitled to 35% of the other matrimonial assets. 10.          It ought to be noted that when the other matrimonial assets were divided by the District Judge, the respondent owed the Inland Revenue Department and credit card companies a large amount of money.  These debts were not taken into account when the District Judge calculated the amount which the respondent might still have in his hands for the purpose of dividing the other matrimonial assets.  It should also be noted that while the District Judge had no sympathy for the respondent, who claimed to be living on an overdraft because he had lost a large sum of money by gambling, she accepted that there is no evidence that he had hidden some of his assets, as had been alleged by the appellant.  After taking all circumstances into account and bearing in mind that two judges can come to different conclusions on the division of matrimonial assets in a particular case, I saw no reason to overturn District Judge’s decision on the division of the other matrimonial assets.  As such, I affirmed her decision.",
        "Claim for maintenance": "11.         The appellant’s claim for monthly maintenance will next be considered.  She claimed that she was entitled to $1,000 per month as maintenance and she sought an order for lump sum maintenance.  However, as has been mentioned, the District Judge made no order for maintenance. 12.         As far as maintenance is concerned, the relevant part of s 114 (1) of the Women’s Charter provides as follows: In determining the amount of any maintenance to be paid by a man to his wife or former wife, the court shall have regard to all the circumstances of the case including the following matters: (a)        the income, earning capacity, property and other financial resources which each of the parties to the marriage has or is likely to have in the foreseeable future;(b)        the financial needs, obligations and responsibilities which each of the parties to the marriage has or is likely to have in the foreseeable future;(c)        the standard of living enjoyed by the family before the breakdown of the marriage;(d)        the age of each party to the marriage and the duration of the marriage;(e)        any physical or mental disability of either of the parties to the marriage;(f)        the contributions made by each of the parties to the welfare of the family, including any contribution made by looking after the home or caring for the family …. 13.           InLee Yong Chuan Edwin v Tan Soan Lian[2001] 1 SLR 377, the Court of Appeal noted that for the purpose of determining the appropriate amount of maintenance, the division of the parties’ matrimonial assets and the financial resources which the parties have or are likely to have in the foreseeable future could be taken into account.  The District Judge noted that after the division of matrimonial assets, the appellant had $402,709.  This amount was much more than what her former husband, who is heavily indebted to the Inland Revenue Authority and a number of banks, had in his hands.  The District Judge accepted that in view of the respondent’s age and circumstances, it would not be easy for him to find employment in the future.  Apart from the fact that the appellant was very much better off than the respondent after the division of matrimonial assets, it should not be overlooked that the appellant is already over 67 years of age.  While arguing that the appellant was entitled to lump sum maintenance, her counsel referred toOng Chen Leng v Tan Sau Poo[1993] 3 SLR 137andYow Mee Leng v Chen Kai Buan[2000] 4 SLR 466.  However, in both those two cases, the lump sum maintenance was computed on the basis that maintenance was payable until the former wife was 67 years old.  The 67 years was arrived at as a compromise between the average life expectancy of a Singaporean woman, namely 70 years, and the usual retirement age of a Singaporean male worker, namely 65 years.  While this does not mean that the appellant in this case, who is already over 67 years of age, is, without more, barred from claiming maintenance, her age should be taken into account with all other facts when determining whether any maintenance order ought to be made. 14.       If all the facts in this case are closely examined, it is understandable why the District Judge did not order the respondent to pay the appellant any maintenance.  As no strong argument was advanced to show that the District Judge had erred, I affirmed her decision on this matter.",
        "Costs": "15.       As for costs, although the appellant’s appeal was dismissed, the parties agreed that no order for costs should be made."
    }
}