{
    "case_title": "Ang Leng Hock v Leo Ee An",
    "ncitation": "[2003] SGHC 240",
    "coram": "Joyce Low Wei Lin AR",
    "sections": {
        "Introduction": "1.         The plaintiff, Ang Leng Hock (‘Ang’) is presently 45 years old.  He was involved in a road traffic accident on 29 January 1999 with Leo Ee Ah (‘Leo’). Ang sued Leo for the damages allegedly suffered by him as a result of the accident and obtained interlocutory judgment in his favour for 95% of the damages to be assessed. Ang made five broad areas of claims: (1) pre-trial loss of earnings; (2) future loss of earnings or loss of earning capacity; (3) general damages for pain and suffering; (4) future medical expenses’, and (5) miscellaneous special damages apart from pre-trial loss of earnings, i.e. loss of use of the motorcycle, cost of its repair and transport expenses.",
        "Assessment of each claim": "Pre-trial loss of earnings 2.         Prior to his accident, Ang was working as an independent sub-contractor. He ran the outdoor catering business of Grand Court Vegetarian Restaurant Pte Ltd (‘GC’). He was also doing some despatch work for Smith & Nephew Pte Ltd (‘SN’) on an ad-hoc basis. After the accident, he was issued a medical certificate which stated that he was unfit for work for 50 days. Subsequently, he was given another medical certificate which certified that he was only fit to do light duties for a further 20 days. 3.         Ang still works for SN to this date. However, he stopped working for GC after he met with the accident. The company found replacements for him and adjusted to his departure. Meanwhile, he turned his attention to running his own coffee shop business called “68 Kopitiam”. The business was registered on 15 January 1999 and it commenced operations sometime in September or October 1999. In July 2003, he terminated the lease of the coffee shop prior to its expiry because it was allegedly chalking up losses. 4.         In determining the quantum of Ang’s pre-trial loss of earnings, three issues had to be resolved. First, what Ang’s average monthly income from his work with GC had been. Secondly, whether it was possible for him to return to his former job with GC. Lastly, if that were not possible, what his income could have been if he had worked to mitigate his losses. 5.         With respect to the first issue, as Ang was an independent sub-contractor with GC, he did not receive a fixed salary. In his affidavit, he exhibited documents relating to his income prior to the accident. One set of documents was his income tax declaration forms for the years ending 1997 and 1998. In those forms, he reported his income to be $17,818 and $16,800 respectively. He also exhibited a letter dated 22 June 1999 by Gwee Tsu Sun (‘Gwee’), the managing director of GC, detailing the payments that GC made to him from 1996 to 1998. According to that letter, he received an average of $30,060.02 monthly. In his affidavit, Ang claimed that his average monthly profit was approximately $4509, i.e. 15% of what GC paid him.  He testified repeatedly that he had under-declared his income to the Inland Revenue Authority of Singapore to evade tax. 6.         The defence challenged Ang’s claim on the basis that there were no salary or payment records to prove it. Gwee provided the reason for the absence of records. He testified that he left all accounting matters and all the payment records to his accountant, Robert Xie, who had since passed away. Robert Xie was the one who came up with the figures provided in Gwee’s letter dated 22 June 1999, in the course of business. 7.         I found that both Ang and Gwee were honest and consistent in their testimonies.  Both withstood cross-examination.  I believed that Ang made an under-declaration of his income tax declaration forms and that his average monthly income for 1996 to 1998 was $4509. 8.         On the second issue, I found that it was not possible for Ang to return to his previous job. I accepted the evidence of both Dr. Tho Kam Sen (‘Dr Tho’) and Dr. Yeo Khee Quan that Ang was not fit to work in jobs which required him to lift heavy loads as a result of the accident, due to the injury to his left clavicle.  It was not disputed that Ang had to lift heavy loads often in his former job with GC. As such, it was clear that Ang could not resume that job after the accident. More importantly, I found that Ang could not return to his former job because he would not have the opportunity to do so as Gwee found replacements for Ang. I accepted the evidence of Ang and Gwee that once someone else had taken over Ang’s job, it was not good business practice in their circle to ask that person to leave so that Ang could resume his old job. 9.         With respect to the last issue, the actual quantum of profit or loss from the coffee shop business would establish the sum that Ang earned in mitigation of his losses. However, there was no reliable evidence in relation to those figures. The only figures before the court were those in Ang’s income tax declaration forms which he had also admitted to reporting falsely, by under-declaring the profits of his business.  I considered that Ang had a low education level and some experience with the food and beverage industry. I accepted the submission of his counsel that he could have worked as a food and drinks assistant to mitigate his losses after the accident and upon the expiration of his first period of medical leave on 19 March 1999.  Such a worker would earn an average of $784 per month, according to statistics compiled by the Ministry of Manpower in theirReport on Wages in Singapore 2002. Hence, for the period after 19 March 1999 to the date of the trial, I assessed that his loss of earnings per month to be ($4509 - $784) less 9 % to take into account income tax payable =  $3389.75 10.       In the premises, I assessed Ang’s damages for pre-trial loss of earnings in the following manner: (a) for the period from the date of the accident, i.e. 29 January 1999, to the expiration of his first period of medical leave, i.e. 19 March 1999, which was approximately two months – ($4509 less 9% to take into account income tax payable, i.e. $4103.19) x 2 months = $8206.38 (b) for the period after 19 March 1999 to the date of trial on 9 October 2003, which was approximately 55 months – $3389.75 x 55 months = $186,436.25 Total: $186,436.25 + $8206.38 =$194,642.63 11.       I did not award Ang any damages for loss of earnings in respect of his job at SN. This was because he did not prove that he suffered any loss of earnings as a result of the accident. During the first 70 days after the accident, Ang was certified as being unfit for riding a motorcycle. After the expiration of that period, he resumed his despatch work with SN and there were no indications that he was unfit for that job. Future loss of earnings or loss of earning capacity 12.       Ang’s loss of earnings per month subsequent to the trial would not differ from his loss of earnings per month for the period after 19 March 1999 to the date of the trial since there would not be a change of the factors affecting the quantum of loss. To arrive at the multiplier, I considered that Ang was already 45 years old at the time of assessment and that his previous job relied heavily on manual labour. He would have to carry very heavy loads of up to 30 kilograms and his ability to do so would naturally diminish with age. Taking these factors into consideration, I was of the view that a multiplier of 6 would be fair. Hence, Ang’s future loss of earnings was calculated as: [$3389.75 x 12 months] x 6 years =$244,062 13.       I found that Ang’s disability that causes him to be unable to lift heavy loads would not hamper him in the job market, as the disability was very limited. Hence, I did not award any damages for loss of earning capacity to him. General damages for pain and suffering 14.       As a result of the accident, Ang suffered a fractured left clavicle, a crack fracture at the 2ndand 3rdmetatarsal head left foot and a sprain in his right wrist. At the time of the trial, he was no longer suffering from any pain in relation to his left foot and right wrist. The fracture in his left clavicle had united with a deformity and acrmio-clavicular joint arthritis developed, causing him to suffer from pain and stiffness of the left shoulder. 15.       I awarded Ang damages for pain and suffering for his upper limb injuries at $13,000. In doing so, I considered the cases ofChinnathurai Raja v Kesavan Engineering & Construction Pte Ltd(unreported, DC Suit No. 6981 of 1997) andKu Sai v Lim Kheng Hock(unreported, DC Suit No. 131 of 1997). In both cases, the courts awarded a sum of $13,000 for pain and suffering for upper limb injury involving the fracture of the clavicle. I also awarded Ang a sum of $3,000 for pain and suffering resulting from acrmio-clavicular joint arthritis, which was the figure awarded for pain and suffering due to osteoarthritis inAw Ang Moh v OCWS Logistics Pte Ltd(unreported, Suit No. 960 of 1996). Furthermore, I assessed Ang’s damages for pain and suffering that were related to the fractures in his left foot, the sprain in his right wrist and lacerations to be $4,000.  Consequently, the total award for damages for pain and suffering was$20,000. Future medical expenses 16.       I accepted Dr. Tho’s findings that Ang’s fractured left clavicle triggered the development of acrmio-clavicular joint arthritis which needed to be treated with medical supplements for the rest of his life, costing $600 per year, to reduce stiffness and increase the mechanical strength of his shoulder. I took into account Ang’s present age of 45 years and his estimated life expectancy to arrive at a multiplier of 20 to calculate the damages for future medical expenses. The award under this head was $600 per year x 20 years =$12,000. Miscellaneous 17.       I awarded Ang damages of$1,000for the cost of repairs for his motorcycle, as this was the sum agreed by the parties. As for damages arising for loss of use of the motorcycle, I assessed this to be $30 per day x 4 days =$120as the repair bill stated that the length of time needed for the repairs was 4 days. Ang was also entitled to compensation for transport expenses, as he had been certified unfit to ride a motorcycle up to 70 days after his accident. I awarded him a sum of $15 x 10 trips =$150, factoring the length of time that he could not ride a motorcycle and the overlap between this head and that of the loss of use of the motorcycle.",
        "Conclusion": "18.       In conclusion, I assessed the damages suffered by Ang to be: (a)   Pre-trial loss of earnings                                             $194,642.63 (b)   Future loss of earnings                                               $244,062 (c)   General damages for pain and suffering                      $20,000 (d)   Future medical expenses                                           $12,000 (e)   Cost of repairs                                                          $1,000 (f)   Loss of use of motorcycle                                          $120 (g)  Transport expenses$150 Grand total$471,974.63  19.       I awarded interest at 6% per annum from date of service of writ to date of judgment on all general damages, save damages awarded for loss of future earnings as that is a future loss.  Interest on special damages incurred before the date of trial was awarded at 3% per annum from the date of the accident to the date of the trial. 20.       The usual consequential orders will apply. I will hear the parties on costs."
    }
}