{
    "case_title": "Mah Chee Kok v Cheng Chee Kim",
    "ncitation": "[2003] SGHC 277",
    "coram": "Ching Sann AR",
    "sections": {
        "Undisputed facts": "The plaintiff was 25 years of age at the time of the accident and working as a foreman in the construction industry. Interlocutory judgment was entered for the plaintiff at 85% liability against the defendant on 23 June 2003.",
        "The Plaintiff’s claim": "2          The plaintiff claimed for damages under the following heads: Special damages (i)Pre-trial loss of earnings$25,245.33(ii)Medical expenses$492.70(iii)Transport expenses$300.00 General damages  (iv)Pain and suffering$89,000.00(v)Loss of future earnings$242,568.00(vi)Future medical expenses$10,000-$12,000(vii)Future transport expenses$300",
        "Decision": "3Having heard all the evidence and reviewed submissions from counsel for both parties, the following award is made: General damages",
        "Pain and suffering": "4          The plaintiff’s claim of $89,000.00 for pain and suffering, was divided into the following heads: (a)Closed fracture of the left lower fibula$15,000.00(b)Disruption of ankle sydesmosis and ruptured deltoid ligament$16,000.00(c)Close fractures of the 2nd, 3rd, 4thand 5thright metatarsals$12,000.00(d)Comminuted fracture of the navicular and cuboid bones and Lisfranc injury of the tarso metatarsal joint of the foot$22,000.00(e)Secondary osteoarthritic changes at the mid tarsal joints$12,000.00(f)Non-surgical scars$6,000.00(g)Surgical scars$6,000.00 Defence counsel, on the other hand, argued that although there were several components to the injuries, there were in fact only two major injuries, namely to the left ankle and the right foot. Taking a global approach to quantification, he submitted $11,000 for the injury to the left ankle, $12,000.00 for the injury to the right foot, and $2,500.00 for the scars. 5          I agreed with defence counsel’s submission. There was an element of overlapping in the present case as the injuries sustained by each foot related largely to the same part of the body. Furthermore, the amount submitted by plaintiff’s counsel for each component injury was far too high.  At the same time, I was of the view that the amounts submitted by defence counsel did not give sufficient weight to the fact each main injury did consist of various component injuries, and, more importantly, that the plaintiff had suffered injuries to both feet. On that basis, after taking into account the authorities cited by both counsel, I awarded $19,000.00 for the injury to the left ankle, and $27,000.00 for the injury to the right foot. As for the scars, I found the plaintiff’s claim to be excessive, given that there were only three significant surgical and non-surgical scars, the rest being very small in size. As such, I awarded $3,500.00 in total for the scars, resulting in a total award for pain and suffering of$49,500.00.",
        "Loss of future earnings / Loss of earning capacity": "6          The plaintiff’s claim of $242,568.00 for loss of future earnings was arrived at by using a multiplier of 18 years and a multiplicand of $1123.00 per month. The multiplicand was in turn obtained by using the plaintiff’s previous monthly income of $2300.00 per month, deducting monthly expenses of $850.00, and then further deducting $327.00, being the amount the plaintiff could earn as a nursery worker in Malaysia. This amount of $327.00 was the only figure of any certainty canvassed by the parties in the course of the proceedings. Although defence counsel made several suggestions as to alternative employment for the plaintiff, and the plaintiff in cross-examination suggested that he could work as a cashier or a manager in a games arcade, no reliable figures, if any at all, were adduced in respect of these forms of employment. 7          I was unable to accept the plaintiff’s argument that he would only be able to earn $327.00 per month hereafter, and that loss of earnings should be calculated using this figure. As was made patently clear during cross-examination, the plaintiff had carpentry skills, was trained as a signalman, had experience as a renovation worker, and could bend re-bar. There was hence no basis for his claim that he would only be able to work as an unskilled labourer. In addition, I found the claims made by the plaintiff as to his ability to work to be highly inconsistent. Plaintiff’s counsel objected to the various modes of employment suggested by defence counsel on the basis that they all required manual hard work involving prolonged walking and standing, which the plaintiff claimed that he would not be able to do following his injuries. This dismissal stood in sharp contrast with the plaintiff’s own position that he would be able to work in a nursery, where he would be required to squat often and carry heavy objects, work which would be even more strenuous than the alternative work suggested by the defence counsel. 8          In this connection, I noted, that the plaintiff’s own expert witness, Dr Thiagarajan, had taken the view that with the help of insoles, he would be able to walk for one-and-a-half to two hours on level ground without pain. There was also the fact that the plaintiff’s previous employment was as a construction foreman, as opposed to a constructor worker. Although the plaintiff claimed in his affidavit of evidence in chief that he did heavy manual labour throughout the day, this did not appear to be the case. Ms Lian Choo Fung, a witness from Sembcorp Engineers and Constructors Pte Ltd, the plaintiff’s most recent employer, testified that while the plaintiff would be required to be on site and would have to undertake manual work, such work was only undertaken for short periods, when the plaintiff was required to demonstrate to his workers what needed to be done. 9          In light of the fact that the figure of $327.00 put forward by the plaintiff was unacceptable, and that there were no other figures available for consideration, I concluded that there was insufficient data from which loss of future earnings could be calculated with sufficient certainty. Defence counsel had in fact suggested that in light of such  prevailing uncertainty, the proper mode for the award of damages should be loss of future earnings, which he calculated at $52,800.00, based on a multiplicand of $400.00 per month and multiplier of 11 years. I disagreed with defence counsel’s submission insofar as I was of the view that it was not appropriate to use a multiplier-multiplicand approach in calculating loss of earning capacity. This was because one of the reasons for awarding loss of earning capacity as opposed to loss of future earnings is that there was no available evidence of the plaintiff’s earnings to enable the court to properly calculate future earnings–Teo Sing Keng & SBSv Sim Ban Kiat[1994] 1 SLR 634. 10        In determining a suitable award for loss of earning capacity, I took into account the plaintiff’s youth, the fact that he was not merely a construction worker but held a position of some responsibility, and the fact that his injuries would necessarily rule out some of the activities he had to do in his line of work. In the circumstances, I took the view that an award of$55,000.00for loss of earning capacity was appropriate.",
        "Future medical expenses": "11        The question of whether the plaintiff was entitled to future medical expenses turned on whether he was likely to undergo arthrodesis on his right foot in the future. The cost of such surgery was estimated by Dr Thiagarajan at $10,000 to $12,000 in a private hospital. Defence counsel, on the other hand, relied on the view of his expert witness, Dr Teh Peng Hooi, that arthrodesis was undesirable as the chances of success were low. As such, if an award was made, it ought to reflect the lack of likelihood of the surgery, and on that basis, he hence submitted $2,000.00. I agreed with the defendant’s submission that the chances of such surgery being successful was low, and that the plaintiff might never undergo it. However, I was of the view that an award ought nevertheless to be made under this head as neither Dr Thiagarajan nor Dr Teh could say for a certainty that it would never take place. In the circumstances, I awarded future medical expenses of$4,000.00. Special damages",
        "Pre-trial loss of earnings": "12        The plaintiff’s claim for pre-trial loss of earnings was arrived at by applying his average salary of $2,300.00 per month to the time he was out of work, being eight months and 24 days at the time of trial. To this total was added the sum of $4956.00, for which he had been mistakenly overpaid by one of his employers, and which he had been obliged to repay. The sum of $4956.00 was not contested by the defence. 13        As for the remaining claim of $20,240.00, the defendant rightly pointed out that the plaintiff had forgotten to deduct his monthly expenses of $850.00 when making the calculation. In addition, he argued that there had been insufficient mitigation on the part of the plaintiff in that he had only made two attempts at finding a job, and then only at jobs which he was clearly over-qualified for. Plaintiff’s counsel, on the other hand, argued that credit had to be given for the time, without medical leave, for which he had to recuperate. Given that the accident had occurred in May 2002, I found that it was not unreasonable for the plaintiff to be given full credit for lost earnings up to May 2003, viz $7250.00. However, I felt that there was insufficient mitigation after that period. In light of the lack of sufficiency of evidence regarding the plaintiff’s loss of earnings, as discussed in the preceding section, I was of the view that a nominal award should be given for the period from June 2003 to the date of trial. In the premises, I assessed the plaintiff’s total pre-trial loss of earnings at$15,000.00.",
        "Medical and transport expenses": "14            Medical expenses were agreed between the parties at$492.70. 15        As for transport expenses, two claims were made, viz for pre-trial transport expenses and future transport expenses. There appeared to be some confusion the part of the plaintiff on this score. His statement of claim claimed $300.00 for pre-trial transport and for future transport to be assessed. Plaintiff’s counsel’s written submissions, on the other hand, made no claim for pre-trial transport and $300.00 for future transport. The defendant for his part submitted $250.00 for pre-trial transport and nothing for future transport. In light of the difficulty in obtaining receipts for such expenses, I awarded$300.00for pre-trial transport. As for future transport, I failed to see how the plaintiff had made out this claim and hence made no award. Summary 16        In summary, the total award made to the plaintiff is as follows: Special damages: $15,000.00.00 + 492.70 + $300.00 = $15,792.70 General damages: $49,500 + $55,000 + $4000 = $108,500.00 Total award =$124,292.70 And interest on $15,792.70 at 3% from the date of accident to the date of trial, and on $49,500.00 at 6% from that date of service of the writ to the date of trial. Usual consequential orders."
    }
}