{
    "case_title": "Law Society of Singapore v Wong Sin Yee",
    "ncitation": "[2003] SGHC 197",
    "coram": "Chao Hick Tin JA; \n      Lai Siu Chiu J; \n      Tay Yong Kwang J",
    "sections": {
        "The Background": "2  On 26 December 1998, at about7:30pm,Mr Mok Gok Keong (“Mok”) was driving his car alongwith his wife,  Mdm Chou Siew Kee (“Mdm Chou”) as the front passenger.  His vehicle was travelling on the second lane from the left, the first lane being a bus lane.  Traffic was then very heavy.  Wong, who was then driving his car in the first lane, cut into Mok’s lane notwithstanding that Mok had sounded his horn in warning.  Having gotten into the second lane, Wong suddenly braked, causing Mok to brake as well, in order to avoid a collision.  Both drivers alighted from their vehicles to assess the situation.  Wong asked Mok why the latter had hit his vehicle and demanded compensation.  As far as Mok was concerned, he did not think that there was any contact between the two vehicles.  Both drivers then returned to their cars to remove them to the side of the road, so as not to cause obstruction to traffic.  Having done so, the two drivers continued their argument along the five-foot way. 3  As Mok refused to compensate Wong, the latter used his handphone to call the police, who apparently told him that as there was no personal injury, they should settle the matter between themselves.  Mok then asked his wife Mdm Chou to call her father for advice.  As Mdm Chou was using her handphone to do so, Wong rushed forward, gesticulating with his handphone in his left hand, and shouted at her saying “why call your father, call Lee Kuan Yew or the F..ing police.”  At that point, sensing that harm might come to her, Mok told his wife to return to the car.  He  then turned away from Wong intending not to aggravate the situation.  At that instant, Wong pulled Mok’s hair from behind and used the handphone which he was holding in his left hand to hit Mok on the mouth before releasing the latter.  Wong then clenched both his fists and challenged Mok to a fight.  The latter refused.  On witnessing  all that, Mdm Chou came out of the car and asked Wong for his identity card to obtain his particulars.  Wong refused and uttered obscenities.  Both parties then left the scene. 4  Mok immediately went to the Central Police Station to make a report.  He was then referred to thefor a medical examination.  The doctor noted a one cm haematoma and superficial abrasion on Mok’s right inner lower lip. 5  Wong was subsequently charged before aon two counts.  One was for causing alarm to Mdm Chou by uttering the insulting words, an offence punishable under s 13A(1)(a) of the Miscellaneous Offences (Public Order & Nuisance) Amended Act (Cap 184, 1996 Edn),  and the other was for causing hurt to Mok, an offence punishable under s 323 of the Penal Code. 6  At the conclusion of the trial, Wong was convicted on both charges.  He was fined $2,000 on the first charge and sentenced to three months’ imprisonment on the second charge.  The latter was enhanced to a term of one year’s imprisonment and a fine of $1,000 (in default six months’ imprisonment) on the cross-appeal of the Public Prosecutor.  Wong’s appeal against conviction (on a point of law) was dismissed. 7  Following Wong’s conviction and the dismissal of his appeal, two charges were eventually brought against him by the Law Society as follows:- Charge I You, Mr Wong Sin Yee, Male 41 years, NRIC No. S1328846A, an advocate and solicitor of the Supreme Court, are charged that you, on 31 January 2001, were convicted in the Subordinate Courts for an offence of voluntarily causing hurt under Section 323 of the Penal Code (Chapter 224) and you have thereby been convicted of a criminal offence implying a defect of character which makes you unfit for your profession within the meaning of Section 83(2)(a) of the Legal Profession Act (Chapter 161). Charge II You, Mr Wong Sin Yee, Male 41 years, NRIC No. S1328846A, an advocate and solicitor of the Supreme Court, are charged that you, on 31 January 2001, were convicted in the Subordinate Courts for an offence of causing alarm under Section 13A(1)(a) of the Miscellaneous Offences (Public Order & Nuisance) Amended Act, 1996 Edition (Chapter 184), and you have thereby been convicted of a criminal offence implying a defect of character which makes you unfit for your profession within the meaning of Section 83(2)(a) of the Legal Profession Act (Chapter 161). (alternatively) You, Mr Wong Sin Yee, Male 41 years, NRIC No. S1328846A, an advocate and solicitor of the Supreme Court, are charged that you, on 31 January 2001, were convicted in the Subordinate Courts for an offence of causing alarm under Section 13A(1)(a) of the Miscellaneous Offences (Public Order & Nuisance) Amended Act, 1996 Edition (Chapter 184), and you are thereby guilty of such misconduct unbefitting an advocate and solicitor as an officer of the Supreme Court or as a member of an honourable profession within the meaning of Section 83(2)(h) of the Legal Profession Act (Chapter 161). 8  By virtue of s 83(6) of the Act, it was not permissible for Wong to re-open the issues behind the convictions even though he tried to do so before the Disciplinary Committee (“DC”).  The DC found that a member of the legal profession should demonstrate, first, an unquestionable standard of honesty and integrity and second, a high level of self-restraint.  In this case, the charges did not impugn his honesty or integrity but his total lack of self-restraint.  Having regard to the circumstances surrounding the assault charge, and the sentence meted out in relation thereto, the DC held that what he did constituted a defect in character which rendered him unfit for the profession. 9  As regards the second charge involving the use of abusive language, the DC concluded that as this charge involved only a single use of the “F” word, and the punishment imposed by the court was only $2,000, the conduct was not of sufficient gravity to render him unfit for the profession; rather, it was conduct unbefitting an advocate and solicitor.  The DC felt that a penalty imposed under s 93(1)(b) should suffice.  However, it decided to defer imposing the precise penalty on this charge until the conclusion of the present proceedings in relation to the assault charge.",
        "Should order be made absolute?": "10  Following the findings of the DC, an order was obtained by the Law Society requiring Wong to show cause why he should not be dealt with under s 83(1) of the Act.  This show cause proceeding only concerned the first charge relating to voluntarily causing hurt. 11  As mentioned above, the DC found that his conviction for an offence under s 323 of the Penal Code implied a defect of character which made him unfit for his profession within the meaning of s 83(2)(a) of the Act. 12  We would, at the outset, make it quite clear that conviction of criminal offence does notper seimply a defect of character rendering an advocate and solicitor unfit for his profession. It is the nature of the offence, and the circumstances under which it was committed, and in turn the punishment imposed, which are likely to be determinative.   It is difficult to generalise; nor is it possible to lay down any rigid objective yardstick.  Just to illustrate the difficulty, while traffic offences generally do not give rise to such an implication, it is not necessarily so in every case.  Those involving recklessness may, not must, be viewed differently. However, an offence need not be committed by an advocate and solicitor in his professional capacity before it may imply a defect of character which makes him unfit for his profession: seeLaw Society of Singapore v Tham Yu Xian Rick[1999] 4 SLR 168 at 176;Re Weare, A Solicitor[1893] 2 QB 439 at 442 andLaw Society of Singapore v Amdad Hussein Lawrence[2000] 4 SLR 88 (theft of goods by a solicitor from a supermarket).  The offence must be of such a nature that it is expedient for the protection of the public and the preservation of the good name of the profession to remove the solicitor from the roll or from practice:Re Knight Glenn Jeyasingam[1994] 3 SLR 531 at 537. 13  As far as Wong’s present misconduct was concerned, his counsel did not contest that what he did constituted cause of sufficient gravity for disciplinary action to be taken under s 83 and that it implied a defect of character within the meaning of s 83(2)(a).  While the concept of defect of character is often associated with dishonesty or fraudulent acts, that is not necessarily so in every case.  The word “character” is wide and  encompasses the total quality of a person’s behaviour as revealed in his habits of thought and expression, his attitudes and interests, his actions and his philosophy of life.  This has to be contrasted with the occasional instances of carelessness. 14  The way in which the DC viewed the misconduct was as follows:- “To belong to an honourable profession … a member has to possess (a) an unquestionable standard of honesty and integrity and (b) a high level of self-restraint.  The first quality is irrelevant to these proceedings.  … Applying the test inHussein Lawrence’scase … we find that the conviction of the respondent for that assault … does imply a defect of character rendering him unfit for the profession.  The nature of the assault including the circumstances … and the sentence of one (1) year imprisonment clearly satisfy that test.” 15  Wong’s conduct showed that he is an abusive person who is prone to violence.  He behaved like a gangster rather than a member of the legal profession.  Instead of observing the law, he took the law into his own hands and became a road bully. Whatever the cause which gave rise to the altercation that evening, there could be no justification for resorting to violence.  This is all the more so where the evidence pointed to him as the aggressor, as the trial court found.   Such behaviour constitutes a defect of character and renders him unfit to be an advocate and solicitor.  We, therefore, concurred with the determination of the DC that the misconduct here came within s 83(2)(a).  We should add that in 1992 he also committed an offence of causing hurt under s 323, although on that occasion the offence did not arise out of a motor incident. 16  We would, however, hasten to add that it does not follow that, in every instance where a solicitor is convicted of a s 323 offence of simple hurt, it must necessarily imply a defect of character warranting action under s 83(2)(a).  The circumstances under which the altercation arose, leading to the assault, are critical.",
        "Appropriate penalty": "17  We now turn to the question of the proper penalty to be imposed on Wong for the misconduct.  InTham Yu Xian Rickthe court declared that disciplinary action under s 83 serves three functions, namely, (a) punishment of the errant solicitor for his misconduct; (b) deterrence against similar defaults by other like-minded solicitors in the future; and (c) protection of public confidence in the administration of justice.  The punishment which this court can impose on Wong under s 83(1) of the Act ranges from censure to suspension of up to five years or striking off. 18  If a charge against a solicitor involves proven dishonesty, he will almost invariably be struck off the roll:v Law Society[1994] 2 All ER 486 andLaw Society v Lau See-Jin Jeffrey[1999] 2 SLR 215.  Even  where a solicitor did not act dishonestly, but if by his conduct he is shown to have fallen below the required standards of integrity, probity and trustworthiness, he can still be struck off the roll if his lapse indicates that he lacks the qualities of character and trustworthiness which are the necessary attributes of a person entrusted with the responsibilities of a legal practitioner. 19  As far as the present misconduct is concerned, no dishonesty was involved.  Neither was there anything which put into question his probity or trustworthiness.  His fault lay in his inability to exercise restraint over his own violent temperament or disposition.  In coming to our decision on the appropriate punishment, we took into account the following considerations. 20  First, Wong was severely punished for the assault charge, having been sentenced to the maximum permissible imprisonment term for  the offence even though the injury caused to the victim was really quite trivial, namely, a one cm haematoma and superficial abrasion on the right inner lip.  It is pertinent to note that inRe Weare, A Solicitor[1893] 2 QB 439 at 445 Lord Esher MR said “… the court (has) a discretion and must inquire into what kind of a crime it is of which he has been convicted, andthe court may punish him to a less extent than if he had not been punished in the criminal proceeding”.  This passage was cited with approval inTham Yu Xian Rick. 21  Secondly, he duly served his prison term and behaved well in prison, earning remission and an earlier than normal release.  Furthermore, on his own volition,  he also sought counselling for his bad temper. 22  Thirdly, before us, through his counsel, he admitted his wrong, accepted that the show-cause action should be made absolute and expressed remorse for what he did. 23  Fourthly, the misconduct was not committed in the course of the discharge of his professional duties.  While we have earlier said that in order for a misconduct to be disciplinable under the Act it is not necessary that the act be done in the course of his professional duties, the court held inRe Mohamed Jeffry Muljee[1994] 3 SLR 520 at 523 that it would be an aggravating factor if the misconduct were to have been committed in his professional capacity.  In this sense, the present misconduct would not attract any aggravation. 24  Fifthly, since his release from prison one and half years ago, he has not resumed practice. 25  InLaw Society of Singapore v Singam Dennis Mahendran[2001] 1 SLR 566, the charge against the respondent was that he had carried on a sexual relationship with a client who came to him for legal assistance to divorce her then husband.  The relationship between them lasted for a period of some six months from the filing of the petition until the decree absolute.  In the context of that case, this court held that, in determining the appropriate penalty, there were two primary considerations.  First, the protection of the public and, second, the interest and reputation of the legal profession.  In the light of both these considerations, the court there  suspended the respondent from practice for three years. 26  In the present case, Wong’s deplorable behaviour had nothing to do with his professional work, and thus, the first consideration alluded to inSingam Dennis Mahendrandid not come into the picture.  However, what he did certainly affected the standing and reputation of the legal profession.  Lawyers should uphold the law and should not behave in the manner he did.  We noted his counsel’s submission that he had already been very severely punished for the offence and that a penalty of censure, or a very short period of suspension, should be sufficient to drive home the point.  Still, an appropriate sanction must be imposed to signal the disapproval of the court.  We accept that there should be some proportionality between the harm done (tainting the reputation of the profession) and the punishment to be imposed. 27  Taking all the circumstances into account, it was our view that a suspension of two years from practice would be the appropriate punishment.  We also ordered him to pay the costs of the Law Society."
    }
}