{
    "case_title": "Kwa Ban Cheong v Kuah Boon Sek and Others",
    "ncitation": "[2003] SGHC 132",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "The Background Facts": "8  I begin with a narration of the facts which are not disputed. It is also beneficial to repeat in some details the Grounds of Decision of Singh JC in the previous action. 9  In 1976, QHS transferred a total of 360 shares in his Company, Quah Hiang Soo Co Pte Ltd, to four of his sons in equal share. By a Board Resolution dated 10 March 1976 (“Directors’ Resolution”), it was resolved that the Shares be transferred and new share certificates be issued to the 1stto 3rdDefendants and QBC. In the same Directors’ Resolution, Quah Koon Ann (the Plaintiff’s father) and Tan Hee (QHS’s wife) also transferred their respective shareholdings in the Company to their own children. 10  QHS duly executed share transfers forms on 22 March 1976 and stamp duty was paid on the transfers. The Company accordingly issued new share certificates to the 1stto 3rdDefendants and QBC. The new share certificates were signed by QHS. 11  The existence of the Note came to light after the death of QHS. The English translation reads: “I am entitled to 360 of the [Company’s] shares at $100 per share. I entrust the said shares to the joint management of Kuah Boon Liat, Quah Boon Chee, Kuah Boon Sek, Quah Boon Lui and 2/3 of all future dividends shall be distributed to the children of Kuah Khoon Loon and 1/3 to the children of Wong Tuck Yoke as supplement forthe schooling expenses of the children. Lest word of mouth bears no evidence, this document is hereby made as proof.”",
        "Suit No 1277 of 1997 and the Decision of Amarjeet Singh JC": "12  On 25 June 1997, Lin Ke, one of the children of Kuah Khoon Loon brought an action in the High Court of Singapore against the Defendants. He claimed a declaration that by reason of the Note, the Defendants held the Shares on trust for the benefit of the children of Kuah Khoon Loon and Wong Tuck Yoke. Lin Ke also prayed for an Inquiry as to all dealings of the Defendants concerning the Shares and as to what has become of the Shares, an account of the dividends in respect of the Shares and accrued interest. Although not pleaded, Counsel for Lin Ke submitted that if it is adjudged that the trust should fail for uncertainty, a resulting trust would arise in which case the Shares should revert to the estate of QHS to be distributed according to intestacy laws. 13  The Defendants denied that they held the Shares as trustees pursuant to the Note. It is said that QHS divested himself of all rights and interests in the Shares and the Shares were absolutely and unconditionally transferred to the Defendants. They became the legal and beneficial owners of the Shares as of 10 March 1976. 14        The Note and Directors’ Resolution were adjudicated upon by Singh JC. At the beginning of his Grounds of Decision, Singh JC identified the case before him. He said it raised issues of whether the divestment of the Shares constituted a gift or an entrustment. On the evidence, he found that QHS had absolutely and validly divested himself of the Shares by making a gift of them to the 1stto 3rdDefendants and QBC on 10 March 1976. The intention to transfer the Shares identified by their certificate numbers was recorded in the Resolution which QHS signed in his personal capacity and as Director. This is evident from the use of the words “as well” in the Grounds of Decision. Singh JC said: “QHS’s intention to transfer the shares to the Defendant[s] is unequivocally expressed in the said Company’s formal resolution which he signed as its Director as well.” The Resolution is evidence of QHS’s intention to give the Shares to his sons and also his approval as director to the transfer of Shares from QHS to the 1stto 3rdDefendants and QBC.  The intention to give was followed by the execution of transfer forms by QHS. 15  On the Note, Singh JC held: “ I construed the note of 12 March 1976 made very soon after the resolution which was passed i.e. on 10 March 1976…. I am satisfied on reading the note..that the note nowhere states that the children of Kuah Khoon Loon (including the Plaintiff) and Wong Tuck Yoke have been given the beneficial interest in the shares. The reasonable interpretation is that the note entrusts the shares to the joint management of the Defendants in respect of payment of the future dividends received in respect of the said shares and to use and pay the dividends as a supplement for the schooling expenses of the aforesaid children. In my opinion, if QHS had wanted to revoke the gift of shares to the Defendants and instead bequeath or make a gift of the same shares to the children of Kuah Khoon Loon (including the Plaintiff) and Wong Tuck Yoke just two days later he could have simply said that in the note. ….QHS’s intention therefore showed that the children should only be paid the dividends as long as they pursued their studies. The restriction would have been totally unnecessary if the children (including the Plaintiff) were the intended beneficiaries of the 360 shares. If they were, the dividends would be theirs to receive at all times i.e. even after they had finished their schooling or education…” 16  He found it strange that QHS had proceeded with the transfer and registration of the shares in the names of the 1stto 3rdDefendants and QBC if the note was intended to revoke the gift of shares to them. He also noted that QHS lived for some five years (i.e. till 1981 (sic)) after making the Note on 12 March 1976. QHS was on the board of the then Industrial & Commercial Bank and was also one of its shareholders. The Judge inferred from that appointment that he was no doubt as such a good and intelligent businessman. The Judge concluded: “Therefore, as far as I can perceive there would have been no uncertainty in QHS’s intention as expressed in the note of 12 March 1976 as submitted by the Plaintiff’s Counsel. I accordingly rejected Counsel’s submission that a resulting trust arose vesting the 360 shares of QHS in his estate for distribution according to intestacy law.” 17  Singh JC also noted that Letters of Administration in respect of the estate of QHS were granted to the 2ndDefendant and QBC on 27 February 1981. In the Schedule issued under s38(2) of the then Estate Duty Act (Cap. 137) under the heading “Property in respect of which the Grant is made” was a category entitled “Gifts”. The list of “Gifts” mentioned amongst other things, the Shares transferred to the 1stto 3rdDefendants and QBC i.e. 90 shares each.",
        "Preliminary Issues": "",
        "Is the present action an abuse of process?": "18  Counsel for the Plaintiff, Mr. Winston Quek, argued that there is no abuse of process. The present action cannot be viewed as a collateral attack on the earlier judgment of Singh JC and decision of the Court of Appeal because the plaintiff in Suit No. 1227 of 1997 and in the present case is different. 19  On the Directors’ Resolution, he submitted that the Directors’ Resolution is void because at the material time QHS was not a director of the Company and could not sign the Directors’ Resolution. Because of that, there was no quorum for the resolution to be passed. In his submission, he said that the 2ndDefendant knew that QHS had resigned as director of the Company. The resignation was not brought up in the earlier proceedings. Even though it is not the Plaintiff’s case or alluded to in the Plaintiff’s affidavit of evidence-in-chief, Mr. Quek surmised nevertheless that it was in the Defendants’ interest to keep quiet about the resignation. It is worth noting that the Plaintiff withdrew at the trial his pleaded case that the signature of QHS on the Directors’ Resolution was obtained fraudulently or was a forgery. 20  Counsel for the Defendants, Ms Sim Bock Eng, submitted that to proceed with the trial would be to retry the case that was before Singh JC. She referred toAshmore v British Coal Corporation[1990] 1 WLR 763 to illustrate the point that the doctrine of abuse of process can still apply even if the litigant in the previous suit is not the same. 21  The Plaintiff claimed that he did not know that the Shares were gifts to the 1stto 3rdDefendants and QBC until 12 March 1996. The previous action was started in 1997. The Court of Appeal affirmed the decision of Singh JC in 1999. The Plaintiff commenced the present action in 2002. 22  On the alleged invalidity of the Directors’ Resolution which is the only new issue in the present case, the allegation of fraud having been abandoned by the Plaintiff, Ms Sim submitted that it is not material at all to the transfer. Consent of the board of directors to the transfer was not required by Article 28 of the Memorandum and Articles of Association of the Company as the 1stto 3rdDefendants and QBC were already shareholders of the Company at the time of the divestment of the Shares. Moreover, the Company is not disputing the transfer which has long been completed. In 1997, there was a reduction of the Company’s capital and excess capital of approximately $20.8 million was distributed amongst the shareholders which included the Defendants and Plaintiff. Besides, lack of quorum is a procedural irregularity and would not invalidate transactions carried out pursuant to the Resolution: s392 Companies Act (Cap.50). Ms. Sim in her submission said that the Directors’ Resolution is valid and remains accepted by the Company. 23  Much of Mr. Quek’s arguments turned on cause of action estoppel and issue estoppel and the need for parties in previous and present proceedings to be the same. On this basis, cause of action estoppel or issue estoppel cannot be applied here against the Plaintiff since he was not a party to the previous action against the Defendants. 24  Auld LJ inBradford & Bingley Building Society v Seddon (Hancock & Ors)[1999] 4 All ER 217 explained the distinction between res judicata and abuse of process. He explained: “ In my judgment, it is important to distinguish clearly between res judicata and abuse of process not qualifying as res judicata. …The former, in its cause of action estoppel form, is an absolute bar to relitigation, and in its issue estoppel form also, save in ‘special cases’ or ‘special circumstances’…..The latter, which may arise where there is no cause of action or issue estoppel, is not subject to the same test, the task of the court being to draw the balance between the competing claims of one party to put his case before the court and of the other not to be unjustly hounded given the earlier history of the matter.” [p.225] …. “Although the courts have continued to speak of the rule variously as res judicata in ‘its wider sense’ ….it is quite distinct from res judicata which, save in special circumstances in the case of issue estoppel, is an absolute bar to relitigation. Thus, Lord Wilberforce delivering the opinion of the Board inBrisbane City Council v A-G for Queensland[1979] AC 411 at 425, said that its ‘true basis’ [i.e. the rule in Henderson v Henderson] is abuse of process – ‘and it ought only to be applied when the facts are such as to amount to an abuse otherwise there is a danger of a party being shut out from bringing forward a genuine subject of litigation.’ [p.226] 25  The starting point of the doctrine of abuse of process is the well-known rule inHenderson v Henderson[1843] 3 HARE 100. The principle was recently reformulated by the House of Lords inWilliam Johnson v Gore Wood & Co(a firm)[2001] 2 WLR 72.  The House of Lords held that it would be wrong to hold that simply because a claim or a defence could have been raised in earlier proceedings it should have been, so as to render the raising of it in later proceedings necessarily abusive. What is required to ascertain whether an action is an abuse of process is a broad, merits-based judgment which takes account of private and public interests and all the facts of the case. 26  The doctrine of abuse of process is based on public policy.  Lord Bingham explained the public policy justification for the doctrine thus: “the underlying public interest is that there should be finality in litigation and that a party should not be twice vexed in the same matter.” [p.90] Lord Millett regarded the doctrine “as a procedural rule based on the need to protect the process of the court from abuse and the defendant from oppression”.[p.118] 27  Given the nature of the rule, it would be unwise to try and define fully the circumstances which can be regarded as an abuse of the process or to fix the categories of abuse. Each case must depend upon all the relevant circumstances.  Lord Bingham inJohnson v Goresaid that as one cannot comprehensively list all possible forms of abuse, it is therefore not possible to formulate any hard and fast rule to determine whether, on given facts, abuse is to be found or not. 28  The Court of Appeal inBradford & Bingleyheld that to establish abuse some additional element such as a collateral attack on a previous decision, dishonesty or successive actions amounting to unjust harassment, besides mere relitigation, is required. Differing from the Court of Appeal, Lord Bingham said: “I would not accept that it is necessary, before abuse may be found, to identify any additional element such as a collateral attack on a previous decision, but where those elements are present the later proceedings will be much more obviously abusive, and there will rarely be a finding of abuse unless the later proceeding involves what the court regards as unjust harassment of a party… [I]t is in my view preferable to ask whether in all the circumstances a party’s conduct is an abuse rather than ask whether the conduct is an abuse and then, if it is, to ask whether the abuse is excused or justified by special circumstances. Properly applied, and whatever the legitimacy of its descent, the rule has a valuable part to play in protecting the interests of justice.” [p.90] 29  The power is to be exercised with caution before striking out or dismissing any proceedings on the ground of abuse of process of the court. This is a drastic step as it will deprive a litigant of the opportunity to have either his claim or defence tried by the court:North West Water Ltd v Binnie & Partners (a firm)[1990] 3 All ER 547 at 553.   The onus of proving an abuse of process lies firmly on the party alleging it: Lord Millett inJohnson v Goreat 118; Sir David Cairns inBragg v Oceanus Mutual Underwriting Association (Bermuda) Ltd and Anor[1982] 2 Lloyd’s Rep. 132 at 138. 30  It is clear from the authorities that a collateral attack on a final decision can, in a proper case, be an abuse of process and the defendant sued in that situation is entitled to have the proceedings dismissed as an abuse of process. The court can find an abuse of process by an attempt to relitigate an issue already decided although the matter is not strictly res judicata for example because the parties to the two sets of litigation are not identical. The Plaintiff inHunter v Chief Constable of the West Midlands Police and Others[1982] AC 529 was one of the “Birmingham Six”. At his trial, he and other accused had alleged that their alleged confessions were induced by violence. The trial judge held that the confessions were voluntary. Hunter, in his civil proceedings sued the police officers for damages for assault based on the alleged violence. The House of Lords held that the statements of claim should be struck out as an abuse of process as it was an attempt to relitigate an issue that had been previously decided by a court of justice. 31  The court can, in a proper case, find abuse of process by an attempt to relitigate an issue which has for real or practical purposes been decided in earlier proceedings. InNanang International Sdn Bhd v The China Press Bhd[1999] 2 MLJ 681, the plaintiff sued the defendants for defamation in respect of an article published by the defendants. The plaintiff’s earlier suit against three different defendants involving the same defamatory article was dismissed. Whilst the defendants in the two suits were different, the plaintiff was relying on the same evidence as the basis of its complaint. Justice Kamalanathan Ratnam pointed out that irrespective of whether the second action involves different parties, the doctrine of issue estoppel has been given a wider construction and extended to preclude a party to an earlier action from relitigating in a second action with identical issue of fact, law or mixed fact or law which have been determined against him in the earlier action.  He accepted the reasoning of Drake J inNorth West Waterwho held that where an issue had for all practical purposes been decided in a court of competent jurisdiction, it would be an abuse of process to allow the issue arising out of identical facts and on the same evidence to be relitigated in separate proceedings between different parties. 32  In principle the doctrine is applicable even where the plaintiff in the second action is not the same plaintiff as the first. In such a situation, it may be easier for him to rebut the charge that his proceedings are an abuse of process than it would be for the original plaintiff to do so. In my judgment, the doctrine of abuse of process is applicable where the same defendant (like the Defendants in the present case) are sued twice by different plaintiffs on the identical issues which have already been determined in the earlier action. As Lord Bingham said inJohnson v Gore,an important purpose of the rule is to protect a defendant against the harassment necessarily involved in repeated actions concerning the same subject matter. In the present action, the same Defendants are being sued for the same Shares and litigation would involve reopening a question that has been adjudicated upon in previous proceedings against the same Defendants. 33  Applying the guidance given inJohnson v Gore, it is clear that the present action is an attempt to relitigate issues (like adjudicating upon the same Note and Directors’ Resolution) which have been fully investigated and decided in a previous action. It is a collateral attack on the first action as the title to the Shares has already been determined there. I am satisfied that there is no real difference between the issues in the present action and that already decided and the evidence which may be called on in the present action. In my view, the Defendants are by the present action vexed twice and are unfairly harassed by being subjected to the present action involving the same matter. 34  Would the sole allegation of an invalid Directors’ Resolution merit the case proceeding to trial? I believe not. It is at best an argument not raised in the previous action. It is not “fresh evidence” that subsequently came to light. The allegation that the Directors’ Resolution is invalid is a non-starter for the reasons canvassed by Ms. Sim with whom I agree. I agree with Ms Sim that the lack of quorum is a procedural irregularity. The irregularity could not and did not affect the intention of QHS to divest the Shares. There is nothing in this alleged argument to materially affect and change the case. 35  In addition, the Plaintiff is blowing hot and cold with that single argument. I accept the contention of Ms Sim that it is not for the Plaintiff to now argue that the Directors’ Resolution is invalid since Quah Koon Ann during his lifetime approved the transfer of the some 500 shares in the Company to the Plaintiff and his siblings. The very same 500 shares were reflected in the Schedule issued under the then s38(2) of the Estate Duty Act (Cap. 137) to the Letters of Administration dated 17 August 1981 as gifts made by the deceased Quah Koon Ann in his lifetime to the Plaintiff and his siblings and reported as such by the Plaintiff as co-administrator of his father’s estate. 36  In addition, I am of the view for the reasons explained below that the decision of Singh JC operates in rem. It binds the Plaintiff. Accordingly, the Plaintiff’s action against the Defendants is without merit. 37  For these reasons, relitigation of the issue in the present action must not be allowed as it will constitute an abuse of the process of the court.",
        "Does the decision of Singh JC operate in rem or in personam?": "38  Apart from abuse of process, a separate and independent ground why the Plaintiff’s action must fail is because the decision of Singh JC operates in rem.  Every judgment in rem is conclusive and binding upon the world at large and is not limited in its binding effect to those who were parties to the proceedings and their privies.  LP Thean JA delivering the judgment of the Court of Appeal inPayna Chettiar v Low Meng Seng & Ors[1998] 2 SLR 289 at 299 said: “In particular, a judgment in rem declaring the rights and title to a property to all the world is one which all persons are bound to observe and comply with.” 39  An exposition of the relevant principles on judgment in rem is found in paragraph 251 ofSpencer Bower, Turner and Handley, The Doctrine of Res Judicata(3rded). It reads: “To establish that a decision operates in rem and determines the status of a thing, all other conditions of a valid res judicata estoppel must be satisfied.” 40  At paragraph 19, the authors set out the constituents of res judicata estoppel. They are: (i)         the decision was judicial in the relevant sense; (ii)        it was in fact pronounced; (iii)       the tribunal had jurisdiction over the parties and the subject matter; (iv)       the decision was (a) final, and (b) on the merits; (v)        it determined the same questions as that raised in the later litigation; and (vi)       the parties to the later litigation were either parties to the earlier litigation or their privies, or the earlier decision was in rem. 41  The central and fundamental question as that sought to be controverted in the present litigation is in whom, since 10 March 1976, is the property in the Shares vested. As stated, the question of title was finally determined in the previous action. The decision of Singh JC is a pronouncement of a court of competent jurisdiction on Shares in a Singapore incorporated Company after a trial on the merits. Singh JC whose decision was affirmed by the Court of Appeal held that the Shares belonged to the 1stto 3rdDefendants and QBC. The dismissal of the action was based on that finding. In the result it is a judicial pronouncement that settled title to the Shares or the legal and beneficial interest of the Defendants in the Shares. In my judgment, the consequence of the decision operates in rem and is conclusive against the Plaintiff. Accordingly, the Plaintiff’s action failed at the outset."
    }
}