{
    "case_title": "Lim Mong Hong v Public Prosecutor",
    "ncitation": "[2003] SGHC 161",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Background": "2          Lim was the sole proprietor of Cosmos Optical and Metal Engineering (‘Cosmos’), a firm that manufactured optical instruments and photographic equipment and conducted research and experimental development on electronics.3          In mid 1995, he was approached by Tan Hong Hwa (‘Tan’) and Yip Cheng Long (‘Yip’), to invest in a new project.  This project was Tan’s and Yip’s brainchild and it involved the development of an intelligent universal mounting flash unit (‘Flash Project’).4          Lim expressed his interest and the three of them signed a Memorandum of Intention on Co-operation (‘Partnership Agreement’) to jointly develop the Flash Project as partners in August 1995.5          Subsequently in mid-October 1995, Lim and Dr Lo S. Nian (‘Dr Lo’), a business colleague of Lim at Cosmos, applied, on behalf of Cosmos, to the National Science and Technology Board (‘NSTB’) for a Research and Development Assistance Scheme grant (‘NSTB grant’) to develop the Flash Project.6          They were successful in their application and they accepted the offer of the NSTB grant on 2 November 1995.  Under the NSTB grant, Cosmos was entitled to recover 70% of its manpower costs used for the Flash Project from NSTB.  Dr Lo was appointed as the principal investigator of the Flash Project.7          Pursuant to his appointment, Dr Lo drafted quarterly reports to update NSTB on the progress of the Flash Project.  These reports were reviewed and submitted to NSTB by Lim.  These reports stated, inter alia, that Tan and Yip were employees of Cosmos working on the Flash Project as engineers and that they were paid monthly salaries of $4,320 and $3,420 respectively with a year end bonus of one month’s salary each.  On the basis of these reports, NSTB disbursed funds to Cosmos equivalent to 70% of Tan’s and Yip’s declared salaries.",
        "Prosecution’s case": "8          The prosecution’s case was simple.  Tan and Yip were, in fact, partners with Lim.  They were not employees.  More importantly, they were not paid monthly salaries of $4,320 and $3,420 respectively.  Instead, their remuneration was far less (about $1000 - $2000 per month).  Furthermore, the prosecution alleged that Lim had concocted a scam to make fictitious contributions to Tan’s and Yip’s Central Provident Fund (‘CPF’) accounts to conceal the fact that they were paid less than the amount declared in the quarterly reports.9          The prosecution’s case was based primarily on the evidence given by Tan and Yip.  Their testimony was that Yip had started work at Cosmos soon after the signing of the Partnership Agreement.  Tan, however, only joined Cosmos on a full time basis in mid June 1996 due to his work commitments.  They received by way of shareholder or partnership fees about $1000 to $2000 monthly.  These were evidenced by cheques and payment vouchers.10        Around June 1996, Tan bought a flat.  Soon after, Lim approached him and expressed his concern that Tan would not be able to meet his instalment payments and living expenses given the low remuneration that he was receiving.  Lim informed Tan that since business was good, Cosmos would be contributing to Tan’s CPF account to help tide him over this period.  This sum of money would only be repayable when the business turned profitable from his share of the profits.  Tan agreed as he believed that his partner was acting with good intentions and wanted him to work hard on the project.11        Lim then asked him to inform Yip that similar arrangements would be made for him.  Yip did not oppose the arrangement either, despite being suspicious of Lim’s motive, as the arrangement did not cause him any loss.  In any case, since it was structured as a loan, he assumed that there was nothing wrong with the matter.12        Accordingly, Cosmos credited $8,640 and $10,080 into Tan’s CPF account while crediting $6,840 and $7,980 into Yip’s CPF account in June and December 1996 respectively.13        However, these CPF contributions created problems for both Tan and Yip when they had to submit their 1996 income tax returns.  Tan thus approached Lim for assistance and Lim told him to leave his tax forms with Wen Lin Ying (‘Wen’), an assistant engineer at Cosmos who was responsible for book keeping matters, who would help him fill them up.  Tan happily complied and submitted his tax documents to Wen.14        Yip was in a similar quandary when it came round to submitting his income tax  returns.  He left his pre-signed income tax documents with Tan who submitted them to Wen as well.  Wen subsequently declared Tan and Yip’s monthly income from Cosmos as being $4,320 and $3,420 respectively.15        After receiving the notice of tax assessment, Tan approached Wen about the additional income tax that he and Yip would have to pay.  Wen told him that Lim said that Cosmos would be responsible for the additional taxes.  At this time, Cosmos was already paying the income taxes of several of the staff at Cosmos.  Tan informed Yip about this.16        As things turned out, Cosmos did not pay Tan’s or Yip’s income tax.  Instead, Tan and Yip paid their income tax themselves.  They did so as the amount involved was rather small (less than $1000 each) and as they were worried that Lim might be displeased if they raised the matter and ask them to repay all the CPF contributions received.  Furthermore, they did not want to jeopardise the partnership.17        In early June 2000, Tan accidentally found out about the NSTB grant.  He confronted Lim and Lim claimed that most of the moneys were taken by Dr Lo and used to off-set Cosmos’ substantial losses caused by Dr Lo.18        Tan continued to express his displeasure over the NSTB grant issue which culminated in his dismissal in late June 2000.  After his dismissal, Tan then told Yip about the NSTB grant and Yip too felt unhappy over the matter.  As a result and since Tan had been dismissed, Yip decided to leave Cosmos as well.19        They went to Lim’s office to negotiate for compensation.  They confronted Lim with the NSTB grant documents and demanded a share of the profits at $100,000 each as they were leaving Cosmos.  They compromised at $75,000 each but Lim required them to sign some documents.  Both Tan and Yip refused to accede as the documents contained false representations and the negotiations collapsed.  Tan and Yip then reported the matter to the authorities.20        Based on their  testimony, the prosecution contended that Lim had deceived NSTB into believing that Tan and Yip were being paid higher salaries than they were actually being paid, thereby dishonestly inducing NSTB into paying over the additional sums of $14,294, $14,154, $1638 and $630 after the respective quarterly reports were submitted.  These four sums formed the basis of the four charges under s 420 of the Penal Code.",
        "Defence’s case": "21        Lim stalwartly denied the prosecution’s allegations.  He contended that he had withdrawn from the partnership agreement at the end of 1995.  As such, Tan and Yip were, at all material times, employees of Cosmos and were being paid the salaries declared.  Furthermore, they were fully aware of the NSTB grant and the real reason why the compensation negotiations had collapsed was because he had discovered that Tan and Yip were setting up a rival business.  Lastly, he alleged that Tan and Yip had falsely accused him to take revenge and to apply pressure on him to prevent him from taking legal action against them.22        Lim’s case was supported by his own evidence as well as the evidence given by Teng Khin Eng (‘Teng’), Cosmos’ financial officer, Wen and Roy Lim, Lim’s son.",
        "Appeal against conviction": "23        The thrust of Lim’s appeal was that the trial judge’s findings were against the weight of the evidence and were the result of incorrect and/or improper assessment of crucial parts of the evidence.  In addition, counsel for the appellant argued most strenuously that the district judge had erred in his assessment of the credibility of the witnesses, in particular that of Lim, Teng and Wen.24        Having perused the evidence, which was analysed in great detail in the comprehensive judgment of the trial judge, it was apparent that this was a classic example of a case whose outcome depended almost entirely on whose testimony the trial judge believed.25        In such a situation, it is clear that an appellate court is in a far less advantageous position to decide on an issue of credibility than the trial judge who had not just heard the evidence in full but had also the opportunity of observing the witnesses as the evidence was given, in particular the pauses, hesitations and other meaningful body language that could not have been captured in the transcript of the oral evidence nor the grounds of decision.  I was further mindful that the reversal of a trial judge’s finding of facts would, in a case of white collar crime where the culprit is usually careful to cover his tracks with a smoke-screen of false documentation and the destruction of relevant documentation, be especially difficult since the intangible evidence is so important and can really only be fully appreciated by the trial judge.26        This is trite law and for authority I need merely refer to my earlier decision inPublic Prosecutor v Poh Oh Sim[1990] SLR 1047where I stated that:It is also well-settled law that, when a trial judge makes findings of fact based on the credibility of witnesses whom he has had the opportunity to see and assess, an appellate court will generally defer to the conclusion which the trial judge has formed.An appellate court, if it wishes to reverse the trial judge` s decision, must not merely entertain doubts whether the decision is right but must be convinced that it is wrong. (emphasis added)27        In addition, I was guided by the words of Lord Shaw in Clarke v Edinburgh and District Tramways Co [1919] SC (HL) 35 that:When a judge hears and sees witnesses and makes a conclusion or inference with regard to what is the weight on balance of their evidence, that judgment is entitled to great respect, and that quite irrespective of whether the judge makes any observation with regard to credibility or not. I can of course quite understand a Court of Appeal that says that it will not interfere in a case in which the judge has announced as part of his judgment that he believes one set of witnesses, having seen them and heard them, and does not believe another. But that is not the ordinary case of a cause in a court of justice. In courts of justice in the ordinary case things are much more evenly divided, witnesses without any conscious bias towards a conclusion may have in their demeanour, in their manner, in their hesitation, in the nuance of their expressions, in even the turns of the eyelid, left an impression upon the man who saw and heard them which can never be reproduced in the printed page. What in such circumstances, thus psychologically put, is the duty of the appellate court? In my opinion, the duty of an appellatecourt in these circumstances is for each judge of it to put to himself, as I now do in this case, the question.Am I - who sit here without those advantages, sometimes broad and sometimes subtle, which are the privilege of the judge who heard and tried the case - in a position, not having those privileges, to come to a clear conclusion that the judge who had them was plainly wrong?If I cannot be satisfied in my own mind that the judge with those privileges was plainly wrong, then it appears to me to be my duty to defer to his judgment. (Emphasis added)28        To this end, the trial judge, who had all these advantages, had summed up the evidence adduced by the defence as “contradictory and inherently incredible” while his impression of the defence witnesses was that “[they] have revealed themselves to be biased and unreliable.”  Having examined the evidence for myself with the able assistance of both counsel, I was of the view that the trial judge’s findings were neither against the weight of the evidence nor plainly wrong.  The inferences that counsel for the appellant had asked me to draw were far from being irresistible.  As such, I dismissed the appeal against conviction.Admission of printout29        I only wish to comment on one additional area.  This related to a hotly contested issue both at trial and at appeal, namely the admissibility of a particular document termed the “Incoming and Payment Analysis” Printout.  This document was created by Wen in Microsoft Excel and the figures in it were obtained by Wen manually copying data from Cosmos’ accounting software.  The data in Cosmos’ accounting software was itself entered by part time staff.30        The relevant portion of this printout reflected the sums of $8,640 and $10,080 paid to Tan’s CPF account in June and December 1996 respectively; and the sums of $6,840 and $7,980 paid to Yip’s CPF account in June and December 1996 respectively, as loans.31        This printout thus supported the prosecution’s case that the CPF contributions were a sham designed by Lim to conceal the fact that he had failed to pay Tan and Yip the salaries declared.  Accordingly, the prosecution sought to adduce it at trial in support of their case.32        Not surprisingly, the defence objected.  The reason for their objection was simple: it was an out of court statement that was adduced in Court, not to show that it had been made, but to show that the facts asserted within were true and thus would prima facie be hearsay:Ang Jwee Herng v Public Prosecutor[2001] 2 SLR 474.33        While this may be so, the printout also fell squarely into the ambit of s 34 Evidence Act (‘EA’), which provides that:Entries in books of accounts when relevant34.        Entries in books of accounts regularly kept in the course of business are relevant whenever they refer to a matter into which the court has to inquire, but such statements shall not alone be sufficient evidence to charge any person with liability.34        Before me, counsel for the appellant conceded that the printout would constitute entries in books of accounts regularly kept in the course of business.  As such, it would fall within this recognised exception to hearsay.  It must however be noted that s 34 EA expressly provides that such statements cannot be sufficient evidence alone to charge any person with liability.  I shall return to this point later in my judgment.35        In addition to being admissible under s 34 EA, being a computer output as defined in s 3(1) EA, it must cross an additional hurdle and meet the requirements laid down by s 35 EA.  The relevant portion of s 35 EA states:Evidence of computer output35. — (1) Unless otherwise provided in any other written law, where computer output is tendered in evidence for any purpose whatsoever, such output shall be admissible if it is relevant or otherwise admissible according to the other provisions of this Act or any other written law, and it is —(a)        expressly agreed between the parties to the proceedings at any time that neither its authenticity nor the accuracy of its contents are disputed;(b)        produced in an approved process; or(c)        shown by the party tendering such output that —(i)         there is no reasonable ground for believing that the output is inaccurate because of improper use of the computer and that no reason exists to doubt or suspect the truth or reliability of the output; and(ii)        there is reasonable ground to believe that at all material times the computer was operating properly, or if not, that in any respect in which it was not operating properly or out of operation, the accuracy of the output was not affected by such circumstances.36        The object of s 35 EA is clear.  The Minister for Law, Professor Jayakumar, at the second reading of the Evidence (Amendment) Bill stated that the amendments “strike a balance between guaranteeing the reliability of evidence produced by such technologies and ensuring that the admissibility of such evidence is not hampered by complicated conditions and procedures.”  This is achieved by requiring those who wish to adduce computer output into evidence to establish that it will be safe for the Court to rely on such evidence.37        In other words, s 35 EA protects against the admission of extrinsic hearsay by requiring proof of the accuracy of computer output.  This is just one of the ways that our laws of evidence have adapted to the realities of modern business practices.  Computers today play a pervasive role in society and with the increase in computerisation of records, it is unsurprising that more and more computer output will, especially in white collar crime, be presented as evidence.38        In applying s 35 EA to this appeal, there were three points that I noted.  First, s 35 EA applies to all forms of computer output and it makes no difference whether the document is real evidence or hearsay evidence.  It is every bit as important that a computer printout tendered should be reliable whether or not it contains hearsay.  To this, I would note that the distinction drawn by Chan Sek Keong J (as he then was) inPublic Prosecutor v Ang Soon Huat[1991] 1 MLJ 1andAw Kew Lim & Ors v Public Prosecutor[1987] SLR 410between real evidence and hearsay evidence is no longer relevant given that the wording of s 35(1) EA now states… where computer output is tendered in evidencefor any purpose whatsoever… (emphasis added)39        In any case, even if the real evidence distinction did apply, s 35 EA would still apply as the printout could not be regarded as real evidence because it involved, as so aptly put by Taylor LJ inR v John Eric Spiby[1990] 91 Cr App R 186, “the intervention of the human mind.”40        Second, the prosecution’s duty in s 35(1)(c) EA is an affirmative duty as evidenced by the wording of the provision that:… shall be admissible if it is relevant or otherwise admissible according to the other provisions of this Act or any other written law, andit is… (c) shown by the party tendering such outputthat(emphasis added)41        Thus this duty cannot be discharged without adducing evidence that the computer was working properly.  I was mindful that the nature of the evidence necessary to discharge this burden must necessarily and inevitably vary from case to case.  Hence while, s 35(6) EA provides that the requirements of s 35(1)(c) EA can be met by a certificate signed by the appropriate person, this to my mind is not an exclusive mode of proof.  As such, the prosecution is free to tailor their proof to facts of the case.  It may be that it is not necessary to call an expert and it may be sufficient (as it was in this case) to call a witness who is familiar with the computer in the sense that that witness can attest to the fact that the computer is working properly:Reg v Shephard[1993] AC 380.  This all depends on the complexity and nature of the computers involved.42        Third, the first two requirements of s 35(1)(c) EA are phrased in the negative.  Indeed, the Explanatory Statement to the Evidence (Amendment) Bill states that the condition was ‘deliberately phrased in the negative to facilitate proof.’  To my mind, this does however appear rather strange as it is, in practice, more difficult to prove a negative than to show a positive.  Nevertheless, this is not new to the Court as we face similar tests in the arena of negative hearsay.43        With these three points in mind, I examined the reasoning of the trial judge who had held that the prosecution had met the requirements of s 35(1)(c) EA and I found no reason to disturb his finding.  That having been done, I turned to the issue of the weight to be accorded to the printout.44        The starting point as to weight must be s 36(4) EA which provides that:36 (4)   In estimating the weight of any computer output admitted under section 35, regard shall be had to all the circumstances from which any inference can reasonably be drawn as to the accuracy or otherwise of the output and, in particular —(a)        whether or not the information which the output reproduces or is derived from was supplied to the relevant computer, or recorded for the purpose of being supplied to it, contemporaneously with the occurrence or existence of the facts dealt with in that information, if such contemporaneity is relevant;(b)        whether the supplier of the information or any person involved in the processing of such information had any incentive or motive to conceal or misrepresent the information so supplied.45        This provision imposes a positive test, in that regard must be had to the accuracy of the output.  This is in contrast to the approach taken by the first two limbs of s 35(1)(c) EA which impose a negative test to show that no reasonable ground exists for believing that the output is inaccurate.  Furthermore, the gist of the two sub-provisions indicates that the Court must direct its mind, not only to the accuracy of the computer output, but also to the authenticity of the information contained within.  I was thus of the view that the trial judge had erred in according full weight to the printout as he had failed to consider that the prosecution had not adduced sufficient evidence to establish the authenticity of the information contained within it (which is unsurprising given the context and type of the offence).46        Instead, I am of the view that the printout could only, at best, form corroborative evidence and could not be used as the sole basis for the appellant’s conviction.  A similar conclusion was earlier derived from the operation of s 34 EA which itself provides that such evidence shall not by itself be sufficient to convict.  This difference in weight to be accorded did not however affect my decision since the trial judge had, in any case, only used the printout to corroborate the testimonies of Tan and Yip.  I now turn to the appeal on sentence.",
        "Appeal as to sentence": "47        The appellant in his Notice of Appeal had stated that he was appealing against both his conviction and sentence.  The Petition of Appeal however merely stated that the sentence imposed was crushing and not in keeping with the appellant’s record or prospects.  At appeal, I took the opportunity to clarify the matter and counsel for the appellant declined to make any oral submissions on this point.48        Notwithstanding that, I still turned to consider whether the sentence imposed was manifestly excessive given the circumstances.  I first noted that NSTB is a public institution administering public funds.  The Courts generally adopt a harsh approach in cheating cases when the victim is a Government department or agency.  This is done not out of cronyism but rather to safeguard our national resources:Xia Qin Lai v Public Prosecutor[1999] 4 SLR 343.  Secondly, this was not a one off offence committed on the spur of the moment, but an elaborate scam created to take advantage of a scheme designed to enhance Singapore’s competitiveness.  This too demanded a deterrent sentence:Public Prosecutor v Tan Fook Sum[1999] 2 SLR 523.49        With these two pointers in mind, I turned to the sentence imposed by the trial judge and found that the total sentence imposed on Lim of a term of imprisonment of 16 months could not be said to be manifestly excessive.  As such, I dismissed his appeal against sentence.Appeal against conviction and sentence dismissed.Copyright © Government of Singapore."
    }
}