{
    "case_title": "Chong Long Hak Kee Construction Trading Co v IEC Global Pte Ltd",
    "ncitation": "[2003] SGHC 234",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The Decision of the Court": "8          S 6 (1) Arbitration Act provides: ‘Where any party to an arbitration agreement institutes any proceedings in any court against any other party to the agreement in respect of any matter which is the subject of the agreement, any party to the agreement may, at any time after appearance and before delivering any pleading or taking any other step in the proceedings, apply to that court to stay the proceedings so far as the proceedings relate to that matter.’ 9          Paragraph 20.035 ofHalsbury’s Laws of Singapore, Volume 2, 2003 Reissue makes the following statements: ‘……. A step taken in the proceedings would nullify the party’s right to seek a stay under the statutory provision and is not merely a matter for the exercise of the court’s discretion to grant a stay. ….. There is no definitive rule as to what amounts to a ‘step in the proceedings’.  It is generally accepted that any step which affirms the correctness of the proceedings or demonstrates a willingness or intention to defend the substance of the claim in court instead of arbitration may be construed as such.  Clear examples of such steps would be filing of a defence on the merits of the claim ……… Where, however, such applications are made with the expressed reservation that a stay application will be made on the basis of the arbitration agreement, the right could be preserved. However, requests made to the plaintiffs for extension of time for filing a defence; a request for particulars of the claim or to file a defence; filing affidavits in opposition to the continuation of an interim injunction; commencement of an action for the principal purpose of obtaining a mandatory order for delivery up of goods, have been held not to be ‘steps in the proceeding’.’ 10        InYeoh Poh San & Anor v Won Siok Wan[2002] 4 SLR 91, after the defendant was served with a writ of summons in Malaysia, she entered an appearance here and applied for an order that the proceedings be stayed or dismissed or discontinued on the ground of multiplicity of proceedings orforum non conveniens.She failed in that application.  Woo Bih Li JC held that when a plaintiff’s solicitor was aware that a defendant had filed an appeal against a refusal to order a stay, he should not insist on the filing of the Defence pending the hearing of the appeal. The judge was of the view that this principle applied to an application for a stay on any grounds and was not confined to a challenge based on absence of jurisdiction. He held that to insist on the filing of the Defence would be wrong because it would defeat the very purpose of the appeal. If the plaintiff’s solicitor insisted on the filing of the Defence, the defendant’s solicitor should apply for an extension of time to file the Defence pending the outcome of the appeal and an extension of time should generally be granted so as not to render the appeal nugatory. 11        On the present facts, the 48-hour notice by the plaintiff’s solicitors was given only after the period for the service of the Defence had lapsed and no application for a stay had been taken out despite what was said at the PTC. The 48-hour notice was therefore entirely justifiable.  S 6 (1) Arbitration Act implies that an application for stay should be filed before the time for serving a Defence has lapsed, failing which judgment in default of Defence may be entered by the plaintiff.  What the defendant ought to have done was to file its application for a stay immediately and not file such an application and the Defence at the same time. Nevertheless, the defendant did make it clear in its Defence that it was not intending to defend the claim in Court. 12        The Malaysian High Court case ofTing Ung Tuang v Lau Tiong Ik Construction Sdn Bhd[2001] 6 MLJ 318does not stand for the proposition that a Defence must be filed in every case. The defendant in the Malaysian case entered conditional appearance (a concept no longer applicable in our Rules of Court) in a suit and allowed such appearance to become unconditional while commencing a fresh action by way of originating summons for a stay under the Arbitration Act. Judgment in default of Defence was therefore entered in the suit. In refusing to set aside the default judgment, the learned judge there held that the dilemma faced by the defendant could have been avoided if an application had been filed to either stay the proceedings or to set aside the same on the ground that the Court did not have jurisdiction in view of the agreement to arbitrate. That way, the judge continued, if the plaintiff took objection to the application, arguments could have been presented to the Court on the true scope, purpose and ambit of a conditional appearance. 13        The defendant was careful enough to reserve its right to apply for a stay in its Counterclaim by incorporating paragraph 1 of the Defence. A Counterclaim is a separate matter from the plaintiff’s claim [Order 15 rule 2 (3)] although the rules [Order 15 rule 2 (1)] require a Counterclaim, if made, to be added to the Defence. In a Counterclaim, the defendant takes on the mantle of a plaintiff.  The defendant here would therefore be evincing an intention to sue on the subject matter covered by the arbitration clause if no reservation to apply for a stay had been stated in its Counterclaim as well. 14        However, the defendant undermined itself by its action of giving its own 48-hour notice to the plaintiff in respect of its Counterclaim in the period between the Assistant Registrar’s decision and this appeal. That notice put it beyond doubt that it was serious in pursuing its Counterclaim in Court and not by way of arbitration as the Counterclaim pertained to matters covered by the arbitration clause.  The 48-hour notice militated against the defendant’s solicitors’ arguments of an ‘unequivocal, clear and consistent’ intention to arbitrate the matters in dispute as the Counterclaim and the Defence were intertwined. The service of the 48-hour notice by the defendant was clearly a step in the proceedings within the meaning of s 6 (1) Arbitration Act and thereby nullified the defendant’s right to apply for a stay. 15        The defendant’s application for a stay under the Arbitration Act therefore failed and must be dismissed.  I dismissed the appeal with costs fixed at $1,000 to be paid by the defendant to the plaintiff. Defendant’s appeal dismissed with costs."
    }
}