{
    "case_title": "Law Society of Singapore v Ganesan Krishnan",
    "ncitation": "[2003] SGHC 22",
    "coram": "Chao Hick Tin JA; \n      Tan Lee Meng J; \n      Yong Pung How CJ",
    "sections": {
        "The facts": "2 Mr Ganesan was an Advocate and Solicitor of the Supreme Court of Singapore of some 25 years’ standing, having been called to the Bar on 19 January 1977. At all material times, he was practising as a sole proprietor under the name ‘G Krishnan & Co’.  3 The present disciplinary proceedings arose out of a complaint made to the Law Society of Singapore (‘the Law Society’) by Mr Abdul Rahim bin Japri and his wife, Mdm Ayatti Binti Kepol. Mr Ganesan was initially charged with grossly improper conduct under s 83(2)(b) of the Act for falsely certifying that the complainants had appeared before him on 7 December 2000 to sign a power of attorney and that he had verified their identities when they had in fact not appeared before him. The power of attorney was in favour of Poh Keng Ann (Poh), a servant or agent of DK Credit Pte Ltd (‘DK Credit’) and gave Poh the power to act as attorney in regard to the sale of the complainants’ Housing and Development Board (‘HDB’) flat. According to the complainants, they had borrowed a total sum of $21,000 from DK Credit, a licensed moneylender, by putting up their flat as security. DK Credit appointed a housing agent to sell the complainants’ HDB flat. The complainants, however, subsequently only received about $21,000 from the sale of the flat when the sale proceeds were in fact $117,425. On enquiry, they were informed by the HDB that a power of attorney had been lodged, the execution of which had been witnessed by Mr Ganesan. It authorised Poh to collect the sale proceeds of the flat. The complainants’ position was that they had signed all loan and sales documents at the office of DK Credit and had never appeared before Mr Ganesan.  4 The charge against Mr Ganesan, however, was later amended to one of conduct unbefitting a solicitor pursuant to s 83(2)(h) of the Act based on answers that Mr Ganesan’s then counsel, Mr Hassan Almenoar, provided on 25 January 2002 to a letter dated 7 December 2001 from counsel for the Law Society, Mr Wong Siew Hong. In his letter, Mr Almenoar admitted on Mr Ganesan’s behalf that Mr Ganesan had failed to advise the complainants to seek independent legal advice when they appeared before him to execute the power of attorney. The Law Society accepted that the complainants had indeed appeared before Mr Ganesan and reformulated the charge as follows:  That you, Krishnan Ganesan, are guilty of conduct unbecoming of an advocate & solicitor in the discharge of your duties as an advocate & solicitor, contrary to s 83(2)(h) of the Legal Profession Act (Cap 161, 2000) in that you, whilst you were acting for one DK Credit Pte Ltd in preparing a power of attorney which was subsequently lodged in the Registry of the Supreme Court of Singapore as Power of Attorney No 8994 of 2000, failed to advise Mr Abdul Rahim bin Japri and Mdm Ayatti Binti Kepol, the donors of the power of attorney, to seek independent legal advice on the purport and implication of the said power of attorney. 5 Mr Ganesan pleaded guilty to the charge based on an agreed statement of facts that read as follows: (i) The respondent, Ganesan Krishnan, is an advocate & solicitor of 25 years’ standing - having been called to the Bar on 19 January 1977. (ii) The respondent’s client in this case is DK Credit Pte Ltd (hereinafter \"DK\"), a licensed moneylender. The respondent has acted for DK in a number of other transactions and DK had instructed GK [ie Mr Ganesan] to prepare a power of attorney from the complainants Mr Abdul Rahim bin Japri and Mdm Ayatti Binti Kepol in favour of one Poh Keng Ann, to empower the said Poh Keng Ann to sell the complainants’ Flat HDB Flat (sic) at 29 Balam Road #11-13 Singapore 370029 and to receive the monies from the sale. The respondent knew that the said Poh Keng Ann is (sic) a representative of DK. (iii) Mr Abdul Rahim bin Japri and Mdm Ayatti Binti Kepol appeared before the respondent on 7 December 2000 and executed the power of attorney which had been prepared by the respondent, and which was subsequently lodged in the Supreme Court of Singapore as Power of Attorney No. 8994 of 2000. (iv) The respondent, bearing in mind that the transaction involved an HDB flat and that DK Credit is a licensed moneylender, ought to have advised Mr Abdul Rahim bin Japri and Mdm Ayatti Binti Kepol to seek independent legal advice but had failed to do so. As such he is guilty of conduct unbecoming of an advocate & solicitor in the discharge of his duties as an advocate & solicitor, contrary to s 83(2)(h) of the Legal Profession Act (Cap 161, 2000).",
        "The Law Society’s submissions before the Disciplinary Committee": "6 The Law Society acknowledged that the damages and losses allegedly suffered by the complainants had yet to be quantified. Investigations by the police as well as the Registrar of Moneylenders were still pending. To its knowledge, the complainants had not initiated civil proceedings.  7 Nevertheless, the Law Society put forward five main submissions why Mr Ganesan should be made to show cause.  8 First, the Disciplinary Committee was obliged to refer the matter to the court of three Judges upon Mr Ganesan’s admission of guilt:Law Society of Singapore v Arjan Chotrani Bisham[2001] 1 SLR 684.  9 Second, Mr Ganesan had breached r 27 of the Legal Profession (Professional Conduct) Rules.  10 Third, Mr Ganesan failed to adhere with what the Law Society deemed would be good and prudent practice when preparing a power of attorney. Based on the authority ofRoyal Bank of Scotland v Etridge[2001] 3 WLR 1021, the Law Society submitted that  as a general guideline, it would be good practice for the solicitor preparing the Power of Attorney to have at the very least, a private consultation with the donor to ascertain the background of the case before him. If the facts of the case is such that the solicitor feels that independent legal advice is appropriate, he ought to advise the donor. If the donor declines this suggestion, then that advise (sic) ought to be put in writing and the donor signs, in the presence of an independent witness, that this advice has been brought to his or her attention and that he or she waives this right. This, the Law Society submitted, would also be consistent with the spirit of r 28 of the Legal Profession (Professional Practice) Rules (sic).  11 Fourth, the Law Society submitted that Mr Ganesan knew or should have known that DK Credit was taking security over an HDB flat, especially since the documents filed by Mr Ganesan showed that he had acted for DK Credit in some 16 transactions over a period of some three months. The Law Society assumed that these transactions must have been of a similar nature. Mr Ganesan knew or should have known that the present transaction was questionable because HDB flats could not be used as security for debts (s 50et seqof the Housing and Development Act (Cap 129).  12 Fifth, Mr Ganesan knew or should have known that DK Credit was seeking to take security in the name of its nominee, Poh, in contravention of s 8 of the Moneylenders Act (Cap 188, 1985 Ed). This would suggest that Mr Ganesan had abetted a criminal offence.",
        "Counsel for Mr Ganesan’s submissions before the Disciplinary Committee": "13 Before the Disciplinary Committee, Mr Almenoar made three submissions. First, he submitted that r 27 of the Legal Profession (Professional Conduct) Rules had no application on the facts of the case. Second, he contended thatLaw Society of Singapore v Arjan Chotrani Bisham[2001] 1 SLR 684 did not stand for the proposition that the Disciplinary Committee was obliged to refer the case to the court of three Judges. Third, the Disciplinary Committee should ignore any imputations of dishonesty because the charge contained no such allegation. Mr Almenoar further submitted a plea in mitigation.",
        "The Disciplinary Committee’s determination": "14 The Disciplinary Committee dismissed the Law Society’s submission that it was obliged to refer the matter to the court of three Judges on the basis that this option was only one of three offered by s 93(1) of the Act. It accepted Mr Almenoar’s submission that r 27 of the Legal Profession (Professional Conduct) Rules had no application on the facts of the case. It also refused to consider any allegations of fraudulent or dishonest behaviour because they did not form part of the charge, the Law Society’s case or the agreed statement of facts until Mr Wong made his closing submissions.  15 In deciding what sanction to impose, the Disciplinary Committee was uncomfortable with confining itself purely to the agreed statement of facts because \"it was short on facts which might go to the conduct of the respondent and were relevant to the charge\". Before the Disciplinary Committee, Mr Almenoar conceded that it was permissible for the Committee to look at everything before it, but with special emphasis on the agreed statement of facts and the plea in mitigation. The Disciplinary Committee nevertheless went on to consider whether this was right in principle because it clearly could not take into account allegations that had not been tested by cross-examination. It was of the opinion that none of the cases dealing with the status of an agreed statement of facts precluded it from also considering the unchallenged facts:Public Prosecutor v Banphanuk & Anor[1995] 2 SLR 225;Ganesun s/o Kannan v Public Prosecutor[1996] 3 SLR 560;Mok Swee Kok v Public Prosecutor[1994] 3 SLR 140;Public Prosecutor v Liew Kim Choo[1997] 3 SLR 699.  16 On that basis, it perused the documents before it and made the following findings of fact: (i) It is common ground that the complainants took a loan from DKC [ie DK Credit]; (ii) DKC was known to the respondent as a registered moneylender; (iii) the respondent had acted for DKC on a number of occasions; (iv) the respondent was acquainted with Poh, and knew him to be a servant or agent of DKC; (v) the complainants were brought to see the respondent by Poh; (vi) the respondent took instructions from Poh in the course of preparing the power of attorney, which related to the sale by the complainants of an HDB flat; (vii) the respondent was acting for DKC in \"the matter which led ultimately to the complaint\" against the respondent; (viii) the respondent knew that by the terms of the power of attorney Poh was authorised to receive and give a good receipt for all monies accruing to the complainants as a consequence of the sale of their flat; (ix) the respondent regarded himself as acting for the complainants in the matter of the preparation and execution of the power of attorney, since his bill was addressed to the complainants, although payable by DKC; (x) the respondent was being less than candid when, in response to its request for an explanation, he stated in his letter of the 5 July, 2001 to the Inquiry Committee: In fact, shortly after the complainant’s letter of 6.2.2001 to me, one of them Abdul Rahim spoke to me on the telephone. I informed him that I only attended to the execution of the power of attorney and that as I did not act for him in the sale of the property, I do not have any documents to be able to forward to him. In this carefully crafted paragraph, the respondent was seeking to give the impression, which was not the fact, that his sole role in the transaction between the complainants and DKC was to witness the execution of the power of attorney by the complainants. This finding is fortified by the first paragraph of the respondent’s written explanation to the Law Society which read ingenuously (sic): The above person (ie the complainants) were brought to me, I understand, by the Attorney (sic) Poh Kay Keong to sign the power of attorney before me. In fact, the respondent knew perfectly well that the complainants had been produced before him by Poh, and that Poh was the servant or agent of his client DKC, for which company the respondent was also acting. (xi) The respondent knew, or ought to have known, that implications might arise in the transaction between the complainants and DKC under section 8(1)(b) and/or section 8(1)(c) of the Moneylenders Act (Cap 188) given that the moneylending transaction was between the complainants and DKC whereas the power of attorney from the complainants was in favour of Poh.  Section 8(1)(b) and (c) of the Moneylenders Act is in the following terms:-  8(1) If any person – (a) ……….. (b) carries on business as a moneylender without holding a licence or, being licensed as a moneylender, carries on business as such in any name other than his authorised name or at any place other than his authorised address or addresses; or (c) in the course of business as a moneylender enters as principal or agent into any agreement with respect to any advance or repayment of money or takes any security for money otherwise than in his authorised name. (xii) The respondent was in a position of conflict. He was not free to advise the complainants that DKC, by causing Poh to accept appointment under the power of attorney, was arguably guilty of an offence under the Moneylenders Act, and that the complainants’ transaction with DKC might be compromised.  17 Accordingly, the Disciplinary Committee found Mr Ganesan’s admission of guilt fully warranted and determined that cause of sufficient gravity existed for disciplinary action.",
        "Was there due cause under s 83(2)(h) of the Act?": "18 At the show cause stage, Mr Ganesan had replaced his counsel, Mr Almenoar, with one Mr Zaheer K. Merchant. In his written and oral submissions, Mr Merchant advanced essentially four arguments before this court: (i) that the Disciplinary Committee’s findings went beyond the charge;(ii) that the Disciplinary Committee should not have concluded that Mr Ganesan knew or should have known that the transaction was suspicious;(iii) that the Disciplinary Committee erroneously concluded that the Moneylender’s Act had been potentially breached; and(iv) that the Disciplinary Committee had failed to consider documents that exonerated Mr Ganesan. 19 On behalf of the Law Society, Mr Wong argued that the contention that Mr Ganesan was not aware of a conflict of interest was untenable. Bearing in mind that the transaction involved a moneylender and that the power of attorney empowered its servant or agent to sell an HDB flat and receive the proceeds of sale, Mr Ganesan ought to have asked DK Credit what the proposed transaction entailed, if only so that he could advise it of the legality of the transaction. Mr Ganesan ought to have known that the transaction was potentially compromised by illegality because a solicitor of his experience should have been aware of the legislative regime governing moneylending transactions and the disposal of HDB flats. At the very least, Mr Ganesan ought to have enquired of the complainants if they had sought independent legal advice and disabused them of any impression that they may have had that he was protecting their interests.  20 We took issue with several of Mr Merchant’s submissions because they amounted, in effect, to bold attempts to withdraw Mr Ganesan’s plea of guilt before this court. Mr Merchant, however, denied any intention to qualify Mr Ganesan’s plea. In any case, it was unnecessary to examine whether it was permissible for a solicitor to withdraw his plea of guilt before a court of three Judges because we were of the opinion that Mr Merchant’s submissions were entirely without merit. We will deal with each of them in turn.",
        "Whether the Disciplinary Committee’s findings went beyond the charge": "21 Mr Merchant objected to the Disciplinary Committee’s determination that Mr Ganesan knew or ought to have known that the transaction was potentially tainted by illegality on the ground that this was inconsistent with the expressed intention of the Disciplinary Committee to \"cast aside all imputations of fraud or dishonesty levelled against the respondent in the closing submission of counsel for the Law Society\". The charge against Mr Ganesan, he argued, did not even allege fraudulent or grossly improper conduct. 22 We were of the opinion that the Disciplinary Committee was justified in refusing to consider whether Mr Ganesan was in fact fraudulent or dishonest because that was not the basis of the charge. It was not precluded, however, from having regard to whether Mr Ganesan knew or ought to have known of potential illegality for the purpose of determining whether there was a conflict of interest, because that was relevant to the issue of whether Mr Ganesan should have advised the complainants to seek independent legal advice. A finding that Mr Ganesan knew or ought to have known that the transaction was suspicious was not necessarily the same as a finding that he was in fact fraudulent or dishonest.  23 Mr Merchant further argued that the only issue before the Disciplinary Committee was whether Mr Ganesan had explained the power of attorney to the complainants. Indeed, this had been the basis of one of Mr Wong’s submissions before the Disciplinary Committee. Had the Disciplinary Committee addressed its mind to the issue, it would have found that Mr Ganesan had duly explained the purport and implication of the power of attorney to the complainants.  24 Mr Merchant was clearly wrong on this point. While it was true that one of Mr Wong’s submissions before the Disciplinary Committee was that Mr Ganesan should have explained the document to the complainants, this was ultimately not what the Disciplinary Committee had to decide. What Mr Ganesan had been charged with was a failure to advise the complainants to seek independent legal advice, not a failure to explain the purport and implication of the power of attorney. In fact, Mr Merchant at one point in his written submissions contradicted himself by describing the charge as \"one of failing to advise the complainants to seek independent legal advice\".  25 In any case, even if Mr Merchant’s contentions were correct, Mr Ganesan could not have discharged his duty to explain the purport and implication of the power of attorney properly when he was, as he claims, oblivious to the fact that the transaction was potentially tainted by illegality.",
        "Whether the Disciplinary Committee was wrong in concluding that Mr Ganesan knew or should have known that the transaction was suspicious": "26 Mr Merchant submitted that Mr Ganesan had no knowledge of the relationship between DK Credit and Poh, and the relationship between Poh and the complainants. He argued that the Disciplinary Committee failed to have regard to Mr Ganesan’s position in his letter dated 25 January 2002 to Mr Wong that he never ascertained the relationship between Poh and the complainants. Indeed, he contended that Mr Ganesan performed a purely ministerial function in witnessing the execution of the power of attorney. 27 We found this submission to be completely contrary to the agreed statement of facts which stated that Mr Ganesan acted for DK Credit on a number of occasions. It was inconceivable that he could not have known that it was a licensed moneylender. Further, it was agreed that Mr Ganesan knew that Poh was a representative of DK Credit. By Mr Ganesan’s own admission, Poh brought the complainants to his office to execute the power of attorney. The agreed statement of facts further stated that the power of attorney empowered Poh to sell the complainants’ HDB flat and receive monies from the sale. Seen in this light, Mr Merchant’s submission that Mr Ganesan was innocent of any knowledge that would at least put him on notice of the nature of the transaction was disingenuous.  28 While it may be true that Mr Ganesan did not actually enquire into the relationship among the three parties, this was no excuse to a charge of misconduct. As this court had occasion to observe inLaw Society of Singapore v Khushvinder Singh Chopra[1999] 4 SLR 775 at 792-793, it was \"no answer to a charge of misconduct that the solicitor thought it was not misconduct or if he failed to appreciate the unsatisfactory or objectionable nature of his conduct\".",
        "Whether the Disciplinary Committee erroneously concluded that the Moneylenders Act had been potentially breached": "29 It was not apparent from the Disciplinary Committee’s report whether it regarded s 8 of the Moneylenders Act as being potentially infringed because DK Credit had taken security over the complainants’ HDB flat other than in its authorised name or because DK Credit had entered as principal into an agreement with respect to the repayment of money other than in its authorised name. We therefore considered both possibilities in the alternative.  30 Before this court, Mr Merchant directed his efforts at establishing that DK Credit had taken neither a mortgage nor a pledge over the complainants’ HDB flat. He argued that all DK Credit expected was repayment from the proceeds of sale of the flat and nothing more.  31 With respect, this was an exercise in semantics. While we agreed that DK Credit had taken neither a mortgage nor a pledge over the property, we nevertheless found that the factual scenario was consistent with that of a charge. The agreed statement of facts stated that the power of attorney empowered Poh to sell the complainants’ flat and to receive the monies from the sale. Further, Mr Merchant in his own written submissions stated that \"the complainants at all stagesagreed to and knewtheir flat would have to be sold to pay the loan,agreed to and knewDK would have conduct of the sale,agreed to and knewDK would receive the proceeds of the sale and repay them the balance\" (emphasis his own).  32 This arrangement potentially contravened s 8(1)(c) of the Moneylenders Act because the security was granted not to DK Credit itself, but to Poh, a servant or agent of the company.  33 Although the next point was not the focus of submissions before this court, we found that the fact that DK Credit was arguably taking a charge over an HDB flat was an additional fact that should have alerted Mr Ganesan as to the legitimacy of the transaction. This was because s 50 of the Housing and Development Act prohibits any flat which has been sold by the Board to be sold, leased, mortgaged or disposed of without the prior written consent of the Board.  34 Even if a charge did not exist over the complainants’ flat, the Disciplinary Committee’s determination could be upheld on another ground. Section 8(1)(c) of the Moneylenders Act prohibits any person in the course of business as a moneylender from entering as principal or agent into any agreement with respect to the repayment of money otherwise than in his authorised name. The agreed statement of facts stated that the Power of Attorney empowered Mr Poh to sell the complainants’ flat and to receive monies from the sale. DK Credit was thus in potential breach of s 8(1)(c) of the Moneylenders Act by extracting the power of attorney in its representative’s name.  35 There was sufficient basis, therefore, for the Disciplinary Committee to find that Mr Ganesan should have advised the complainants to seek independent legal advice. By his own admission, Mr Ganesan regarded himself as acting on behalf of the complainants in the execution of the power of attorney. This was evidenced by a copy of a bill addressed to the complainants (but payable by DK Credit) from Mr Ganesan dated 8 December 2000. This bill charged the complainants for acting on their behalf in the execution of the power of attorney. Further, again by his own repeated admissions, Mr Ganesan did advise the complainants of the purport and implication of the power of attorney. This was evident from his letter of explanation to the Inquiry Committee dated 5 July 2001, his affidavit of evidence-in-chief before the Disciplinary Committee and the plea in mitigation submitted by Mr Almenoar. Mr Ganesan, however, was not in a position to advise the complainants of the true position because he was in a position of conflict.  36 Before the Disciplinary Committee, the case proceeded on the basis that Mr Ganesan was in breach of either r 27 or r 28 of the Legal Profession (Professional Conduct) Rules. The Disciplinary Committee properly found that r 27 could not apply because there was no evidence that Mr Ganesan’s interests were adverse to that of the complainants. While the Committee did not expressly reject the application of r 28, we found that this provision did not fit neatly on the facts because it applied in the context of potential conflict of interests, rather than actual conflict of interests. What did fit neatly on the facts was r 30(1) of the Legal Profession (Professional Conduct) Rules which states:  An advocate and solicitor or any member of his law firm or any director or employee of the law corporation of which the advocate and solicitor is a director or an employee shall decline to advise a person whose interests are opposed to that of a client he is representing on any matter and shall inform such person to obtain independent legal advice. 37 While the Disciplinary Committee did not consider r 30, we were of the opinion that Mr Ganesan would not be prejudiced by a finding that he was in breach of this provision because it would be completely consistent with the charge.",
        "Whether the Disciplinary Committee failed to consider documents that exonerated Mr Ganesan completely": "38 Lastly, Mr Merchant submitted that the Disciplinary Committee had failed to consider three documents which could completely exonerate Mr Ganesan as they demonstrated that there were separate arrangements between Poh and the complainants and that Poh was to be repaid from the sale proceeds of the flat. The first document recorded a loan amounting to $26,000 from Poh to the complainants. The second document was a letter of undertaking in favour of Poh recording the receipt of $40,000. In both letters, the complainants undertook to repay the sum of money from the proceeds of sale of their flat. The third document was a letter of authority giving Poh the authority to retain certain sums for various entities and persons out of the sale proceeds.  39 The Disciplinary Committee had refused to consider these documents even though they appeared in Mr Ganesan’s bundle of documents because it was not apparent whether he was aware of them when the complaint against him was made or whether he procured them subsequently. The Committee was not taken to these documents by Mr Wong and Mr Ganesan was not cross-examined upon them.  40 We found it inappropriate to rely on any of these documents to any degree. First, Mr Merchant’s submission that the documents exonerated Mr Ganesan was inconsistent with Mr Ganesan’s plea of guilt, a plea that Mr Merchant ultimately maintained.  41 Secondly, the submission that the loans were strictly between Poh and the complainants was completely contrary to the agreed statement of facts, as well as Mr Merchant’s own written submissions. At the risk of repetition, the agreed statement of facts stated that the power of attorney was conferred upon Poh as a representative of DK Credit, while Mr Merchant’s own written submissions elsewhere accepted that the power of attorney was procured in respect of a loan transaction between DK Credit and the complainants.  42 Thirdly, and in any case, the documents failed to exonerate Mr Ganesan. The loan amounts recorded in the first two documents were inconsistent with the loan amount of $21,000 recorded in the complaint. It was therefore not right to rely on either of them in the absence of cross-examination. In so far as the letter of authority was concerned, it raised one’s suspicions rather than allayed them because it gave Poh the authority to retain a sum of $15,360 on behalfDK Credit Pte Ltd(emphasis added). This undermined Mr Merchant’s contention that the transaction was solely between the complainants and Poh.",
        "The appropriate penalty": "43 The question in this case was the extent to which Mr Ganesan conducted himself in a manner \"as would render him unfit to remain as a member of an honourable profession\":Re Weare[1893] 2 QB 439;Law Society of Singapore v Arjan Chotrani Bisham[2001] 1 SLR 684 at 690.  44 The penalty which this court may impose upon Mr Ganesan under s 83(1) of the Act ranges from censure to suspension of up to five years and to striking off. With respect to disciplinary sentencing, this court has repeatedly adopted the guidance laid down by the English court of Appeal inBolton v Law Society[1994] 2 All ER 486 at 491-492 (see egLaw Society of Singapore v Arjan Singh Chotrani Bisham[2001] 1 SLR 684 at 691;Law Society of Singapore v Singham Dennis Mahendran[2001] 1 SLR 566 at 575;Law Society of Singapore v Heng Guan Hong Geoffrey[2000] 1 SLR 361 at 369):  Any solicitor who is shown to have discharged his professional duties with anything less than complete integrity, probity and trustworthiness must expect severe sanctions to be imposed upon him by the Solicitors Disciplinary Tribunal. Lapses from the required high standards may, of course, take different forms and be of varying degrees. The most serious involves proven dishonesty, whether or not leading to criminal proceedings and criminal penalties. In such cases the tribunal has almost invariably, no matter how strong the mitigation advanced for the solicitor, ordered that he be struck off the Roll of Solicitors … If a solicitor is not shown to have acted dishonestly, but is shown to have fallen below the required standards of integrity, probity and trustworthiness, his lapse is less serious but it remains very serious indeed in a member of a profession whose reputation depends upon trust. A striking-off order will not necessarily follow in such a case, but it may well. The decision whether to strike off or to suspend will often involve a fine and difficult exercise of judgment to be made by the tribunal as an informed and expert body on all the facts of the case. Only in a very unusual and venial case of this kind would the tribunal be likely to regard as appropriate any order less severe than one of suspension. 45 In mitigation, Mr Merchant urged this court to consider that Mr Ganesan pleaded guilty and was genuinely remorseful and contrite as to his act. He further submitted that Mr Ganesan’s error was merely a technical mistake committed without any dishonest intention. Lastly, he asked this court to consider that Mr Ganesan had hitherto practised for 25 years without incident.  46 Mr Merchant’s submissions did not attract the sympathy of this court. This court has held that considerations which usually weigh in mitigation of punishment have less effect on the exercise of the disciplinary jurisdiction than on sentences imposed in criminal cases as show cause proceedings are primarily civil and not punitive in nature:Law Society of Singapore v Tham Yu Xian Rick[1999] 4 SLR 168 at 179;Law Society of Singapore v Wee Wei Fen[2000] 1 SLR 234 at 243.  47 While it was true that Mr Ganesan did plead guilty at the first available opportunity, the sincerity of his purported remorsefulness was undermined by Mr Merchant’s attempts at several points in his submissions to exonerate Mr Ganesan of any wrongdoing whatsoever.  48 Mr Merchant would have us believe that Mr Ganesan was but an innocent man who had the misfortune of finding himself ensnared in a tussle over sale proceeds when he had not profited from the transaction beyond his $320 legal fee. Mr Merchant had the audacity to suggest that Mr Ganesan was \"at most\" negligent and had caused the complainants to suffer \"at most\" a loss of $96,341.30 (the difference between the alleged sale proceeds of $117,425.18 and the $21,083.88 the complainants ultimately received). The complainants should have sought their redress from DK Credit or Poh, not Mr Ganesan.  49 The fact that it was even possible for Mr Merchant to cast the situation in this light underscored the need for this court to send a strong message that Mr Ganesan’s behaviour was completely intolerable. The purpose of these disciplinary proceedings must not be confused with that of a civil suit. InLaw Society of Singapore v Ravindra Samuel[1999] 1 SLR 696 at 699-700, this court emphasised three objectives for the imposition of penalty against an errant advocate and solicitor: (i) punishment of the solicitor for the default; (ii) deterrence against similar misconduct by like-minded solicitors in the future; and (iii) protection of public confidence in the legal profession and the administration of justice.  50 Far from being a mere technical mistake, Mr Ganesan’s behaviour constituted a failure to adhere to elementary principles of professional conduct. The fact that Mr Ganesan could remain oblivious to suspicious features of the transaction despite his 25 years of experience bore testimony to his incompetence. In his submissions, Mr Merchant emphasised repeatedly that Mr Ganesan did explain the purport and implication of the power of attorney and that there was no evidence that the complainants did not know what they were signing. With respect, Mr Merchant missed the point completely. Quite apart from the fact that Mr Ganesan may have given the complainants the false impression that he was protecting their interests, Mr Ganesan was not in a position to advise them that the transaction was potentially compromised by illegality. Had Mr Ganesan been cognisant of the conflict of interest and of his duties as a member of an honourable profession, he could have put the complainants in a position to avert the disaster which ultimately befell them by advising the complainants to seek independent legal advice.  51 According to the guidance inBolton v Law Society[1994] 2 All ER 486, the minimum punishment that was appropriate was a term of suspension, unless the case was \"very unusual and venial\". The facts of this case revealed nothing \"very unusual and venial\" and, having considered all the facts and arguments, we were of the opinion that a suspension from practice for a period of three years was the appropriate order. We also ordered that Mr Ganean bear the Law Society’s costs"
    }
}