{
    "case_title": "Luzon Hydro Corp v Transfield Philippines Inc",
    "ncitation": "[2004] SGHC 204",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1By this motion, the applicant, Luzon Hydro Corporation (“Luzon”), sought an order that the Third Partial Award dated 18 February 2004 (“the Award”) and made in the arbitration proceedings between itself and the respondent, Transfield Philippines Inc (“Transfield”), be set aside pursuant to s 24 of the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the Act”). The grounds of the application were primarily that the arbitral procedure was not in accordance with the agreement of the parties and that a breach of the rules of natural justice had occurred in connection with the making of the Award by which the rights of Luzon had been prejudiced. 2I dismissed the motion with costs. Luzon has appealed.",
        "Background facts": "3The parties to this motion are both incorporated in the Philippines. Luzon is the owner of a power station on the Bakun River in the Philippines. In March 1997, it employed Transfield to design, construct, commission, test, complete and hand over the power station to it. The project involved the construction of a tunnel under a mountain in order to channel water to the power station for the generation of electricity. By cl 20.4 of their contract, the parties agreed that all disputes arising out of or in connection with the contract would be submitted for arbitration in Singapore in accordance with the Rules of Conciliation and Arbitration of the International Chamber of Commerce (“ICC”) by a tribunal of three arbitrators appointed in accordance with those Rules. The contract is expressed to be subject to Philippines law. 4Disputes arose between the parties in mid-2000. In November 2000 Transfield served a request for arbitration to the Secretariat of the International Court of Arbitration. Luzon subsequently served an answer and a counterclaim. The disputes between the parties were extremely complex in terms of factual detail, expert evidence, calculation of amounts claimed and legal issues. Luzon claimed to be entitled to liquidated damages whilst Transfield claimed numerous extensions of time that had not been allowed by Luzon. Transfield also claimed that it was owed large sums of money under the contract whilst Luzon claimed that there were many technical design and construction defects in various parts of the project. 5The International Court of Arbitration appointed Dr Michael Pryles (Chairman), Dr Clyde Croft QC and Mr Neil Kaplan QC to form the arbitral tribunal and terms of reference were entered into between the parties and the arbitrators for the conduct of the arbitration. Clause 5 of the terms of reference provides: 5.EXPERTS 5.1The parties agree that the Arbitral Tribunal may appoint an expert on Philippine law to assist the Arbitral Tribunal. 5.2The Arbitral Tribunal may appoint other experts in accordance with Article 20(4) of the ICC Rules of Arbitration. 5.3The parties agree to pay the reasonable fees and expenses of any expert or experts appointed by the Arbitral Tribunal. Clause 11.6 of the terms of reference provides: The parties shall not be bound by strict rules of evidence and may adduce evidence in any form permitted by the Arbitral Tribunal. The Arbitral Tribunal shall decide the relevance, cogency and weight to be given to evidence. 6In March 2002, the arbitral tribunal ordered that the arbitration proceedings be divided into three parts with two hearings to be held on liability issues and a third hearing to be held to determine issues of quantum. In November that year, the parties agreed that the first liability hearing should take place in Melbourne rather than Singapore but that the change of venue would not displace the jurisdiction of this court to deal with any application arising out of any award. 7On 5 November 2002, the parties and the arbitral tribunal agreed to engage one Mr Rohan D Shorland as an expert to assist the arbitral tribunal. A written Engagement of Expert was concluded. Clauses 5 to 9 of this document provide: 5.Mr Shorland will perform such work as the Arbitral Tribunal directs from time to time. 6.Where the Arbitral Tribunal seeks a written report from Mr Shorland: (a)the Arbitral Tribunal shall notify the parties of the matter upon which Mr Shorland is to report, and (b)Mr Shorland’s written report will be provided to each party in addition to the Arbitral Tribunal. 7.The Arbitral Tribunal shall give each party reasonable opportunity to comment on each of Mr Shorland’s written reports and may allow a party to adduce evidence, or further evidence, in relation to any matter contained in a report if it considers it reasonable and appropriate to do so in all the circumstances. 8.At the request of a Party, the parties shall be given an opportunity to question Mr Shorland on his written reports, including his expertise to give the report. 9.Mr Shorland shall attend the hearing at such times as the Arbitral Tribunal directs and shall read such documents produced in or for the Arbitration, including witness statements and expert reports and transcripts of evidence, as the Tribunal directs. 8The first hearing on liability was conducted in Melbourne over a period of six weeks during February and March 2003. Mr Shorland was present for the entirety of the hearing. He was given copies of all the witness statements. He asked questions of expert witnesses on eight occasions. On the last day of hearing, the chairman of the tribunal described the ongoing role of Mr Shorland after the completion of the hearing: The next point I wanted to mention is Mr Shorland’s role. Mr Shorland will be assisting us, as the parties know. The procedure to be followed, the protocols to be followed in relation to matters upon which we seek Mr Shorland’s opinion are set out in the engagement letter for Mr Shorland, but we will also be seeking Mr Shorland’s assistance in relation to some administrative matters. After the conclusion of the hearing we have asked Mr Shorland to go through the transcript and to collate evidence on technical issues. We are simply seeking references to relevant technical evidence and its collation under appropriate heads. So we will be asking him to do that. That will take some time. We are also going to ask him to collate references in the witness statements to the issues listed by the tribunal in our sheet and in perhaps other matters which we give him, but these are purely of an administrative nature. So he will attend to that. That will take some time. In due course thereafter we will be seeking Mr Shorland’s opinion on one or more technical issues. In accordance with the protocols agreed with the parties, the instructions to Mr Shorland will be in writing, will be shown to the parties and the parties will be shown a copy of Mr Shorland’s opinion. You will be given an opportunity to respond to that opinion, if you wish. 9Following the first liability hearing, Mr Shorland rendered invoices on a monthly basis for work done during the period between May 2003 and December 2003. These invoices totalled €102,900.75. The parties had no other contact with Mr Shorland and no idea as to what tasks were being undertaken by him. On 14 October 2003, the chairman of the tribunal wrote to the parties and informed them that the tribunal had found it unnecessary to seek any written opinion from Mr Shorland but that he had assisted the tribunal by: (a)identifying all the expert evidence; (b)identifying technical matters referred to by witnesses of fact; (c)identifying technical issues in the submissions; (d)highlighting transcript references to technical matters; (e)collating the above into appropriate categories and issues; (f)reminding the Tribunal of technical terms and equations as expounded in the evidence; and (g)responding to technical queries of the Tribunal. The chairman also stated that in addition, Mr Shorland would review the draft Award to ensure that the terminology employed by the tribunal was appropriate for technical matters. 10When the Award was completed it comprised 470 pages and contained detailed reasoning in support of its conclusions. The tribunal granted Transfield extensions of time amounting to 310 days and determined that it was entitled to recover certain items in its claim for outstanding payments. The tribunal rejected other extension of time claims and various other claims made by Transfield. Luzon was successful in its counterclaim in respect of certain items involving the design of certain tunnels. The tribunal rejected, however, many of Luzon’s contentions on the extension of time claims and on the tunnel claims.",
        "The application": "11Luzon was extremely dissatisfied with the Award. It considered that the tribunal had failed to make findings in relation to crucial evidence relevant in deciding whether an extension of time should have been granted by Luzon. It also considered that extensions of time had been awarded to Transfield in circumstances where there was no entitlement to the same because Transfield had admitted that it had recovered the delay in respect of which the extension had been claimed. Luzon was concerned that the tribunal had failed to consider each of the defences raised by Luzon to Transfield’s claims for extensions of time and had failed to make an award in relation to those defences. These concerns of Luzon could not, however, be grounds for setting aside the Award as they arose from the merits of the case as determined by the tribunal and, under the Act, there is no appeal against any determination on the merits of an arbitration proceeding. 12Luzon also considered the possibility that the tribunal had not been properly constituted or had not exercised its functions diligently. Luzon’s solicitors requested copies of all correspondence between the tribunal and Mr Shorland in relation to the subject matter of the dispute between the parties, and also asked for all written reports from Mr Shorland. These were not supplied. 13Considering the amount of time spent by Mr Shorland after completion of the hearing (486 hours) and the description of the work undertaken as revealed in his invoices, Luzon was concerned that the task of reviewing the evidence and determining the relevance of the evidence had been delegated to Mr Shorland. It considered that there was a strong basis for concluding that Mr Shorland had: (a)carried out tasks which were tasks that ought properly to have been carried out by the tribunal; and (b)reported to the tribunal in his role as an expert in circumstances where Luzon was not given the opportunity to comment as required by the ICC and Model Law Rules and the terms of Mr Shorland’s engagement. Under Art 34(1) of the Model Law read with s 24(b) of the Act, the High Court has the power to set aside an award if, among other things, the arbitral procedure was not in accordance with the agreement of the parties or a breach of the rules of natural justice occurred in connection with the making of the award by which the rights of any party have been prejudiced. These were the grounds that Luzon relied on. 14Luzon argued that Mr Shorland’s involvement in the preparation of the Award was far greater than the parties had agreed to under the terms of his employment. He had not only done purely administrative work but he had also taken an active part in the hearing by asking questions which arose out of his personal expertise and experience. Further, the description of the work he had done as contained in the invoices he had rendered showed that he had reviewed evidence, had responded to questions from various members of the tribunal, had carried out research in response to questions from the tribunal and had had meetings with members of the tribunal following which he had carried out further work on the evidence. All this proved his role was not the purely administrative one of collating evidence but that he had been actively involved in analysing the evidence as well. The tribunal might have stated that it did not find it necessary to seek a written opinion from Mr Shorland as an expert but in stating that Mr Shorland had “responded to technical queries” it did admit that it had sought expert oral advice from Mr Shorland. Mr Shorland’s views should have been summarised in a written form and given to the parties to comment on. 15Luzon pointed out that under the terms of engagement, the parties had envisaged that the expert would give written reports and asked whether the parties were entitled to know what Mr Shorland had said to the tribunal. Luzon submitted that it was clear from the first four items of the tribunal’s letter of 14 October 2003 (see [9] above) that the tribunal had been relying on Mr Shorland to point it in the right direction and had effectively abdicated its responsibility to him as the technical expert. Yet, it had not informed the parties of the advice given by Mr Shorland so that they could make submissions on the same. This was clearly a breach of natural justice. 16I did not find much substance in Luzon’s complaints. Whilst Mr Shorland had indeed spent many hours dealing with the evidence given in the arbitration, there was little reason to believe that he had gone beyond the bounds of assisting the tribunal in sorting out the evidence and understanding technical terms and identifying which part of the evidence was relevant to the various issues that were being considered by the tribunal. That he took as much time as he did to complete the tasks listed in the tribunal’s letter of 14 October 2003 was not surprising in view of the amount of evidence that had to be dealt with. The hearing took six weeks and there were 35 factual witnesses (of whom nine were also called as experts), 22 expert witnesses and the agreed bundles comprised in excess of 83 lever arch folders. The documents comprising the parties’ statements of their claims and counterclaims were also prolix. There were a number of exchanges of very complex closing submissions as well. As his invoices show, Mr Shorland did not only have to sort out the evidence, he also had to deal with queries from various members of the tribunal in relation to technical matters and the evidence, as the members themselves worked through the documentation and the evidence. 17The tribunal’s letter of 14 October 2003 set out clearly the tasks it had assigned to Mr Shorland and also indicated that the tribunal had not found it necessary to seek any written opinion from him. The terms of engagement provided that if a written opinion was sought, copies of the same would be given to the parties and their submissions on it would be received. As no such opinion was sought or given, there was nothing to put before the parties for their respective responses. After receipt of the letter of 14 October 2003, neither party raised any objection to its contents nor did either of them make any comment or raise any questions at all in relation to it. Transfield submitted that the letter should be accepted at face value and the integrity of the tribunal should not be questioned. I agreed. Luzon was questioning the truth of this letter on the basis of the description of the work done by Mr Shorland as shown in his bills and the number of hours spent on such work. I considered that such suspicions did not provide a sufficient basis for implying that the tribunal had not been telling the truth when it listed the types of assistance given by Mr Shorland. The panel of arbitrators consisted of professional and independent men and their integrity could not be impugned on such flimsy grounds. 18As Transfield submitted, Mr Shorland’s description of the work that he did for the tribunal was brief and as open to an interpretation that supported what the tribunal said as to an interpretation that supported Luzon’s criticisms. For example, Mr Shorland said that on 1 May 2003, he spent eight hours dealing with “Evidence in respect of Q3.2/3.3”. Why should this statement be interpreted as meaning that Mr ZShorland was giving the tribunal expert advice on the answer to that question? The statement could, as Transfield argued, mean many other things including collation of evidence, pointing out which witnesses dealt with this question and indicating who agreed with whom and who disagreed with whom on this point. Another example was Mr Shorland’s description “Review of closing submissions generally” when explaining how he occupied eight hours on 3 June 2003. Why should this description be read as meaning that he was giving advice to the tribunal? He could simply have been explaining technical terms and the technical evidence which the submissions were based on. I agreed that unless there is strong and unambiguous evidence of irregularity in the manner in which the arbitration was conducted, no aspersions should be cast on what the tribunal did or said that it did. Luzon’s case depended on my giving the worst possible interpretation to descriptions that could equally easily be interpreted in an innocuous fashion. 19The Engagement of Expert envisaged multiple roles for Mr Shorland. Under its terms, parties were only entitled to a copy of Mr Shorland’s written report. In this case there was no written report. The engagement did not provide that parties could have a copy of other communications between the tribunal and Mr Shorland. These were confidential in the same way that communications between members of the tribunal itself would be confidential. The tribunal had made it quite clear on the last day of hearing that Mr Shorland would be assisting substantially in administrative matters and that these would take some time. Luzon did not object at that time to Mr Shorland performing such an administrative role. Whilst the tribunal had originally envisaged the need to seek a written report from Mr Shorland, it later found such a report unnecessary. This was clearly explained to the parties by the letter of 14 October 2003 and that letter also made it clear that the work performed was of an administrative nature rather than of a judicial nature. Prior to the receipt of the Award, neither party had suggested that Mr Shorland was doing anything other than performing proper services for the tribunal. 20Both parties had agreed to the appointment of Mr Shorland as an expert technical assistant for the tribunal. At the time they had recognised the value to the arbitration proceedings of having someone versed in technical matters to help sort out the complex mass of technical evidence that an arbitration of this nature would invariably produce. There was no evidence that Mr Shorland had done anything other than play the role he was required to play. Luzon may not have been happy with the contents of the Award. It may have considered that in the light of the evidence properly construed, the tribunal’s conclusions were flawed. Whatever its grounds for dissatisfaction and however well founded they may be (a matter that was not, and could not be, argued before me) Luzon had to accept the tribunal’s decision, as under the Act there was no avenue for appeal. I could not permit it to mount what appeared to be a “back-door” appeal by attacking the manner in which the tribunal had made use of Mr Shorland when there was no evidence but only speculation that Mr Shorland had overstepped his bounds."
    }
}