{
    "case_title": "Public Prosecutor v Boon Yu Kai John",
    "ncitation": "[2004] SGHC 136",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Close of the Prosecution’s case": "11        At the end of the Prosecution’s case, the trial judge was mindful that the evidence would only have to be approached with minimal evaluation at this stage of the trial. She noted that the respondent had admitted that he made the telephone calls to the police and called upon the respondent for his defence. However, the respondent elected to remain silent. There were no other witnesses for the Defence.",
        "The defence": "12        Counsel for the respondent rightly submitted that three elements had to be proved in order to convict the respondent on the charge, namely that: (a)        the respondent did transmit or cause the message to be transmitted; (b)        the message was false; and (c)        the respondent knew that the message was false. 13        It was not disputed that the respondent made the telephone calls to the police. However, counsel contended that the second and third elements of the charge had not been proved beyond a reasonable doubt. First, he claimed that the evidence before the court was insufficient to warrant the conclusion that the message was false. Second, based on the evidence of Dr Sim, counsel contended that the respondent genuinely believed in the truth of his message.",
        "The decision below": "14        The trial judge held that the Prosecution had not proved its case beyond a reasonable doubt as the second and third elements of the charge had not been established. On the second element, while the trial judge did not rule explicitly as to whether the message was false, she seemed to be of the view that it was more likely to be true than false. 15        She ruled that the following information, which Dr Sim had obtained from the respondent and his parents about their grievances with Mdm Wong, was hearsay: (a)        The respondent did not claim to have witnessed Mdm Wong and her gang taking photographs of his mother but his mother had told him so; (b)        The respondent’s mother believed that Mdm Wong was out to kill her and that Mdm Wong had been harassing their family for the last ten years; and (c)        The respondent’s father similarly believed that Mdm Wong had been harassing their family for the past ten years. Thus, the aforementioned information did not go towards proving the truth of the events which had taken place. 16        However, the trial judge held that, since the respondent’s parents shared his belief about Mdm Wong’s attempt to murder his mother on the morning in question, it would be harder for the Prosecution to prove its case against the respondent. She also noted that the police had not been able to prove, conclusively, the existence of Mdm Wong and that the Prosecution had conceded that there was bad blood between the respondent’s family and Mdm Wong some 20 years ago. 17        As for the third element, the trial judge disagreed with the Prosecution as to the extent to which the respondent’s delusional disorder affected his perception of the events on the morning in question. She found that the respondent lacked the requisitemens reafor the offence, not because of his delusional disorder, but because he genuinely believed in the truth of the information that he gave the police. Accordingly, she acquitted and discharged the respondent.",
        "The appeal": "18        At the outset, I was mindful that, as an appellate judge, I should be slow to disturb a lower court’s findings of fact unless they were clearly reached against the weight of the evidence or they were plainly wrong:Lim Ah Poh v PP[1992] 1 SLR 713;PP v Chong Siew Chin[2002] 1 SLR 117. This was especially so with findings of fact which hinged on the trial judge’s assessment of the credibility and veracity of witnesses:Yap Giau Beng Terence v PP[1998] 3 SLR 656;PP v Hendricks Glen Conleth[2003] 1 SLR 426. In the present case however, there was no issue as to the credibility and veracity of witnesses. The evidence before the court mainly comprised the unchallenged evidence of Dr Sim with respect to the mental condition of the respondent, as well as established facts derived from the statement of agreed facts. In such a case, it is settled law that an appellate judge is as competent as the trial judge to draw any necessary inferences from the established facts and the circumstances of the case:Soh Yang Tick v PP[1998] 2 SLR 42;Awtar Singh s/o Margar Singh v PP[2000] 3 SLR 439. 19        With these principles in mind, I examined the substantive issues on appeal. 20        The relevant provision of the Act in this appeal reads: 45.Any person who transmits or causes to be transmitted a message which he knows to be false or fabricated shall be guilty of an offence and shall be liable on conviction — (a) in the case where the false or fabricated message contains any reference to the presence in any place or location of a bomb or other thing liable to explode or ignite, to a fine not exceeding $50,000 or to imprisonment for a term not exceeding 7 years or to both; and (b) in any other case, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both. As set out at [12] above, the three elements to be proved in order to convict the respondent under s 45(b) of the Act are, namely, that he transmitted or caused the message to be transmitted, that the message was false, and that he knew that the message was false. 21        It was common ground that the first element of the offence had been established. However, the appellant disputed the trial judge’s implicit finding that the second element of the offence was not established. The appellant contended that theactus reusfor the offence,vizthat the respondent transmitted a false message, had been established. 22        Regarding the third element of the offence, the appellant agreed with the trial judge that it had not been established as the respondent lacked the requisite mental element for the offence. Thus, the appellant did not dispute that the respondent should be acquitted. However, the appellant contended that the absence of the requisite mental element was due to the respondent’s unsoundness of mind and not, as the trial judge found, because he genuinely believed in the truth of his message. The appellant contended that the respondent’s act was an offence but for his unsoundness of mind. As such, the trial judge should have stated specifically that the respondent had committed the offence under s 45(b) of the Act, as required under s 314 of the CPC.Section 314 of the CPC provides that: Whenever any person is acquitted upon the ground that at the time at which he is alleged to have committed an offence he was by reason of unsoundness of mind incapable of knowing the nature of the act alleged as constituting the offence or that it was wrong or contrary to law, the finding shall state specifically whether he committed the act or not. 23The appellant further contended that the trial judge had failed to report the case for the order of the Minister and to have the respondent kept in safe custody pending the Minister’s order, pursuant to s 315 of the CPC, which provides that: (1) Whenever the finding states that the accused person committed the act alleged, the court before which the trial has been held shall, if that act would but for incapacity found have constituted an offence, order that person to be kept in safe custody in such place and manner as the court thinks fit and shall report the case for the orders of the Minister. (2) The Minister may order that person to be confined in a mental hospital, prison or other suitable place of safe custody during the President’s pleasure. 24        I shall now deal with each of these arguments in turn.",
        "Whether the second element of the offence was established": "25        Counsel for the respondent contended that, just because the respondent’s mother had not been murdered, as the respondent had claimed she would be, it did not follow that the message was untrue. He contended that further investigations should have been conducted so as to prove conclusively whether the message was true or false. 26        I was not persuaded by counsel’s contentions. In my view, it was plain from the established facts of the case that the message was false. The offence in this case revolved around the message given by the respondent to the police, as reflected in the charge against the respondent. As far as could be seen from the evidence before the court, the message was patently untrue. The respondent’s message was very specific. It involved a green Corolla with a certain licence plate number, a woman in a yellow dress and a murder suspect who could apparently be found in the market situated at Commonwealth Drive. Yet, it was indubitable that the policemen who were despatched to the scene on the morning in question did not find the slightest hint of the case as reported by the respondent. There was no sign of the car, the alleged murder suspect and the alleged murder target. There were also no incidents in the vicinity of the location provided by the respondent, which could be conceivably linked to the alleged murder attempt. More significantly, the respondent himself failed to come forward to the police and identify himself as the complainant. Instead, he made three further calls to the police to check if they had responded to his first telephone call. 27        In my opinion, the events of that morning in themselves evidenced that the falsity of the respondent’s message had beenprima facieestablished. It would then be in the respondent’s interest, as the maker of the message, to cast light on the whole incident and give his version of events. The absence of the alleged incidents at the location provided by the respondent certainly called for some explanation which he was in the position to give, and it was imperative that he did so. Yet, he chose to offer none. Neither did he call upon any witnesses on his behalf. 28        Since the respondent had elected to remain silent, the court was entitled to draw such inferences from his refusal to give evidence as appeared proper under s 196(2) of the CPC:Chai Chien Wei Kelvin v PP[1999] 1 SLR 25As Lord Diplock said inHaw Tua Tau v PP[1980-1981] SLR 73at [21]: What inferences are proper to be drawn from an accused’s refusal to give evidence depend upon the circumstances of the particular case, and is a question to be decided by applying ordinary commonsense … In my considered opinion, the respondent’s decision to remain silent was highly incriminating and greatly undermined the Defence’s case. 29        At this point, I should also make reference to the complaint letters and threatening notes which were sent to the HSA for handwriting analysis.The HSA analyst had opined that the threatening notes and complaint letters were, in all likelihood, authored by the same person. To my mind, this further weakened the respondent’s case as itaffirmed the hollowness of his message to the police, regardless of whether the various letters and notes had been penned by the respondent himself or by a family member.Moreover, the fact that the respondent suffered from delusional disorders about being persecuted was also borne out by Dr Sim’s evidence, which was not disputed by the Defence. 30        Drawing the threads of the entire picture together, and as a matter of common sense, the irresistible inference from the respondent’s refusal to give evidence was that the message was false. In such circumstances, I was unable to agree with the trial judge’s finding on the second element of the offence. Accordingly, I found that theactus reusfor the offence had been established.",
        "Whether the trial judge’s reasoning in finding that the third element of the offence was not established was flawed": "Whether the trial judge was entitled in law to reject Dr Sim’s reasoning that the respondent did not have the requisite mens rea due to his mental disorder 31        The trial judge accepted Dr Sim’s evidence that the respondent did not possess the requisitemens reafor the offence. However, she seemed to disregard his reasoning in coming to his conclusion. While Dr Sim’s evidence established that the respondent did not know his message was false only because he was labouring under a mental disorder, the trial judge held that the respondent’s mental disorder did not affect the way in which he perceived the events of the morning, leading to his telephone calls to the police. She found that the respondent lacked the requisitemens reabecause he honestly believed in the truth of the message. 32        The appellant argued that the trial judge had contravened the principle enunciated by the Court of Appeal inSaeng-Un Udom v PP[2001] 3 SLR 1in so rejecting Dr Sim’s reasoning. The appellant relied on that case for the proposition that a judge is not entitled to reject unopposed and sound expert evidence on a matter which is outside the learning of the court, and to substitute it with his or her own opinion on the matter. 33        I disagreed with the appellant’s contentions. I was of the opinion that as a matter of law, the trial judge was entitled to form her own conclusion as to why the respondent lacked the requisitemens rea. As I previously held inNg So Kuen Connie v PP[2003] 3 SLR 178, the issue of whether an accused had the requisitemens reafor an offence is not something which falls within scientific information outside the experience and knowledge of a judge. Instead, it is a finding of fact to be inferred from the available evidence and surrounding circumstances. Implicit in this principle is that the judge’s basis for finding the existence of the requisitemens reaor lack thereof, isa fortioria finding of fact to be inferred from the existing circumstances as well. 34        InNg So Kuen Connie v PP, I had in fact distinguishedSaeng-Un Udom v PPas a clear case where the pathological expert evidence was strictly outside the learning of the court. In such a case, the judge should defer to the opinion of the expert. The matrix of the present appeal is similar toNg So Kuen Connie v PPas it also deals with a finding of whether an accused possessed the requisitemens reafor an offence, which in itself encompasses the accompanying reasoning behind such a finding. Accordingly,Saeng-Un Udom v PPwas not helpful to the case at hand. 35        It would be fitting to reiterate the Court of Appeal’s warning inChou Kooi Pang v PP[1998] 3 SLR 593at [17] that: A chief and justified concern of the courts is that the fact-finding process should not be surrendered to professionals such as psychiatrists, but should remain the province of the courts. This is especially palpable in cases where there is conflicting medical opinion but perhaps less so in cases like this, where there is a sole psychiatrist giving unchallenged expert evidence. Nevertheless, it should be borne in mind that Dr Sim’s role in this case was not to usurp the trial judge’s fact-finding role but rather, to assist the court in its finding of fact. As such, it could not be said that the trial judge erred in law when she arrived at her finding by a different reasoning from Dr Sim’s. Whether the trial judge’s basis for finding that the respondent lacked the requisite mens rea was supported by the available evidence and surrounding circumstances 36        Contrary to Dr Sim’s expert evidence, the trial judge found that the respondent had honestly believedin the truth of the messageand that it was not sufficiently established that his belief stemmed from his unsoundness of mind. While the trial judge was not bound by DrSim’s reasoning in finding that the respondent lacked the requisitemens rea, I found that the available evidence and circumstances of the case did not amply support the reasons behind her finding. Instead, what could beevinced was that it was clearly the respondent’s delusionsthat exonerated him from having the requisitemens rea, as his delusions prevented him from recognising the falsity of his message. 37Dr Sim’s unequivocal evidence in his report and in court was that the respondent was mentally unsound at the time of the alleged offence. More importantly, he asseverated that it was this unsoundness of mind that led the respondent to believe that it was not wrong or contrary to the law to give his message to the police. In court, Dr Sim testified as follows: Q:         What was accused’s diagnosis? A:         He was suffering from mild mental retarded and delusional disorder (D/D) … D/D is a major psychiatric illness and a formofpsychotic disorder that is characterised by fixed, firm delusions about things which happen around them. This unsoundness of mind was based on fact thatpatient suffer[sic]from psychiatric illness and that led to him not thinking that it was wrong or contrary to the law to do what he did. … Q:         … accused did not know that 999 calls he made to police were false? A:         Yes … was in the context of D/D that the event happened. [emphasis added] 38        These parts of Dr Sim’s evidence made it difficult for me to agree with the trial judge that the respondent’s delusional disorder scarcely affected his belief in the truth of his message. Furthermore, the trial judge had omitted to give any weight to these critical parts of Dr Sim’s evidencein her grounds of decision. To my mind, since the trial judge had purported to rely on Dr Sim’s evidence, albeit with a focus only on certain parts, it was evident that she found him to be a sound and reliable witness. I surmise that if she had given due weight to the part of Dr Sim’s evidence that established the link between the respondent’s psychiatric disorder and his belief, she would have deferred to the expert opinion. 39        In light of Dr Sim’s unchallenged evidence, I perused the other evidence on record to ascertain if there was anything to render his evidence untenable. However, upon taking into account the entirety of the case and the evidence before me, I could find no other evidence to displace Dr Sim’s evidence. In fact, I found that the evidence lent undeniable support to Dr Sim’s finding that the respondent’s belief in the truth of his message and his inability to see that he was acting contrary to the law, stemmed from his delusional disorder. 40        Another point brought to my attention was that the trial judge had been too hasty in assuming that hearsay information from the respondent’s parents, mentioned above at [15], could hypothetically support her finding that the respondent did not have the requisitemens rea. The trial judge had stated in her grounds of decision at [31] and [32] that: I must make it clear that I regard this information as hearsay, given that neither the accused nor his parents did take the stand … As such, it did not affect my determination regarding themens reaof the accused at the time of the commission of the alleged offence. Nonetheless, even if I did not regard this information as hearsay, the conclusion that can be drawn from Dr Sim’s report is this: that the impression that the accused has regarding the said Mdm Wong’s attempts to murder his mother, is not unique to him. It is shared by his mother and father who live with him. … The scale between truth and delusion would be tipped against the Prosecution if the accused’s belief that the said Mdm Wong is out to harm his mother … is shared by the other members of his household as well … 41        However, it should not be the case that just because the respondent’s parents shared his belief that Mdm Wong was out to harm his mother, the accuracy and truth of that belief would automatically be bolstered. After all, the trial judge was not, at any point, equipped with the opportunity to assess the veracity and credibility of the respondent’s parents. Furthermore, Dr Sim had noted in his report that the respondent’s parents shared his delusions of being harmed and persecuted by Mdm Wong. Thus, I concluded that the information could not lend credence to the trial judge’s finding that the respondent believed in the truth of his message in spite of his delusions. 42        Itwas clear that the respondent’s belief that it was not wrong or unlawful to make the telephone calls to the police was inextricably linked to his unsoundness of mind.He knew the nature of his act and it was his unsoundness of mind thateradicated the presence of the requisitemens reaon his part. As such, I agreed with the appellant that the respondent should be acquitted on the ground of his mental disorder as he did transmit a false message to the police, which would have constituted an offence but for the fact that he was found to be by reason of unsoundness of mind, incapable of knowing that his act was wrong or contrary to law.",
        "The implications of acquitting the respondent on the ground of mental disorder": "43        The appellant argued that upon the court finding that an accused committed theactus reusof an offence but acquitting him by reason of his unsoundness of mind, ss 314 and 315 of the CPC would come into play. 44        As this was the first case of its kind before me, I found it helpful to look to a number of Indian decisions where ss 314 and 315 have been dealt with at length. Section 314 of the CPC is inpari materiawith s 334 of the Indian Code of Criminal Procedure 1973 (“the Indian Code”). Section 315 of the CPC is substantially the same as s 335 of the Indian Code, save that s 335 extends a wider discretion to the Indian courts to order delivery of the acquitted person to his relative or friend. 45        The position under ss 314 and 315 is very clear. Under the Indian equivalent of s 314, it is uncontroversial that the court must give a specific finding as to whether the accused committed the act charged against him, as has been affirmed inDaljit Kaur v State(1968) Cri L J 1090. As for s 315 of the CPC, a plain reading of the provision evinces that when an accused person is found to have committed the act as charged but is acquitted according to s 314 of the CPC, the procedure prescribed under s 315 is mandatory. There is nothing complex about this procedure and it is clear that it must be followed upon acquittal:Kuttappan v State of Kerala(1986) Cri L J 271;Elkari Shankari v State of Andhra Pradesh(1990) Cri L J 97. 46        In this case, since s 314 had been satisfied, the steps to be taken under s 315 would follow. I noted that under s 315, it is the court before which the trial has been held that shall order the acquitted person to be kept in safe custody in such place and manner as the court thinks fit and shall report the case for the orders of the Minister. I therefore remitted the case to the trial judge for her to take the necessary steps pursuant to s 315 of the CPC. Appeal allowed."
    }
}