{
    "case_title": "Thia Tong Mui Phyllis v Yam Chor Hua",
    "ncitation": "[2004] SGHC 56",
    "coram": "Ho Su Ching AR",
    "sections": {
        "Medical Evidence": "5          The plaintiff called two medical experts, Dr Ngian Kite Seng and Dr James Lee while the defence called Dr W C Chang. All three doctors are orthopaedic surgeons in private practice. 6          In relation to the L4 veterbrae compression fracture, the doctors generally agreed that although fracture had healed with some residual decompression, the plaintiff is likely to suffer from a permanent residual backache in the lumbar region and recommended future sessions of physiotherapy. 7          As for the severe open fracture of the right tibia and fibula, the medical evidence was that the fracture has since united and the plaintiff has full range of motion of the right knee but a permanent loss of ankle dorsi-flexion.  Dr Chang was of the view that this loss of residual flexibility to the right ankle was of no great significance when looking at the ankle functionally and in terms of day to day activities. In relation to the local pain and tenderness that the plaintiff is still experiencing in her leg, the doctors were in agreement that the symptoms, which are caused by the intermedullary nail, would resolve upon its removal. 8       In relation to the close fracture of the left 1st metacarpal, Dr Chang who examined the plaintiff in April 2003, found the left thumb fracture to have united and the thumb to have a full range of motion. Dr Lee agreed with Dr Chang that there was a union of the fracture. However, he was unable to comment on the current thumb range motion as the last time that he measured the thumb range motion was in 2001. Dr Ngian did not give evidence in relation to this aspect of the plaintiff’s injury. 9          Regarding the left knee injury, all three doctors found the left knee to be unstable due to a tear of the posterior cruciate ligament (“PCL”) and recommended PCL reconstruction surgery. All the doctors held the similar view that the surgery would serve to stabilise the joint, lower the risk of osteoarthritis and prevent further damage.",
        "Loss of Earning Capacity": "10        It is trite law that an award for loss of earning capacity is made when at the time of the trial, there is ariskthat the plaintiff may lose his employment at some time in the futureandmay then be, as a result of the injury, at a disadvantage in getting another or an equally paid job. SeeTeo Sing Keng v Sim Ban Kiat[1994] 1 SLR 634. In other words, this award is to compensate the weakening of the plaintiff’s competitive position in the open market in the event that the plaintiff was to lose his current employment. 11        In light of this, I found it rather curious that the plaintiff even made a claim under this head as the evidence clearly shows that the risk of the plaintiff losing her current employment was not in issue. In fact, by her own evidence, the plaintiff agreed that she is still able to continue teaching despite her injury and that the risk of her losing her current job as a teacher in the future is negligible. 12        In any event, I was also of the view that the plaintiff’s grounds for making a claim under this head were unsustainable on the evidence. These grounds are namely that her ability to teach physical education and her career advancement is affected by her injuries and consequent disabilities. 13        While I agree that the plaintiff’s disabilities would hamper her ability to perform certain active sports like long distance running, jumping, rock climbing etc, I found that they do not disadvantage her in terms of her overall performance as a teacher. I am supported in this view by the fact that after the accident, she was promoted twice in a matter of 3 years and is now enjoying a salary that is nearly double that of her pre-accident pay. Surely, this must mean that her employers hold the view that, in spite of her disabilities, her overall performance is still of such a calibre as to merit the promotions. In fact, since the accident, the plaintiff has gone on to attain the highest grade possible for a teacher in her division. As the plaintiff explained, the next advancement in her career, assuming that she does not further her studies to obtain a degree, would be an appointment as the Head of Department. 14        In relation to this, the plaintiff claimed that she had good prospects to be promoted to the Head of Department and that her prospects have, as a result of the accident, diminished. I found this argument to be a non-starter. Quite apart from the fact the plaintiff’s claim that she had good promotional prospects was based on her own assessment of her ability and unsubstantiated by independent evidence, there was also no evidence that she would no longer stand a chance to be promoted to a Head of Department as a result of her injuries and consequent disabilities. 15        Based on these reasons, I made no award under this head.",
        "Future Medical Costs": "16        The plaintiff’s claim of $40,000 under this head comprises the following: (i)         PCL reconstruction for the left knee      $ 12,000 (agreed) (ii)        Removal of implant at right leg              $   5,000 (iii)       Physiotherapy for the back                    $   5,000 (iv)       Removal of implant in left thumb            $   3,000 (v)        Cosmetic Surgery for scars                   $ 15,000 17        The defendant agreed in principal to (ii) and (iii) but disputed the quantum claimed.  Items (iv) and (v) were disputed. 18        For item (ii), Dr Ngian’s estimate was $5,000 ($2,000 for surgical fee and$3,000 for hospitalisation). This was slightly above Dr Chang’s estimate of $2,200 to $2,900.  The difference in the estimate was because Dr Chang’s estimate is based on a 1-day stay in hospital whereas Dr Ngian’s estimate is based on a 3-day stay.  I was of the view that a 2-day stay in the hospital is reasonable and thus awarded the sum of$4,000. 19        In relation to item (iii), the plaintiff submitted that she was willing to claim based on Dr Chang’s estimate of 12 sessions of physiotherapy per year for 4 to 5 years.  However, she felt that the cost per session should be higher than Dr Chang’s estimate of $70.  This was because Dr Ngian had estimated the cost at $70 to $100 per session and Dr Lee at $100 per session. I accepted the plaintiff’s argument and awarded the sum of$5,000. 20        As for item (iv), Dr Chang recommended that implant can be left in situ permanently.  However, Dr Ngian, while agreeing that the removal of the implant can be an option if the patient has no complaints, recommended the implant to be removed in the plaintiff’s case.  He explained that given that the plaintiff is relatively young, the removal of the implant would guard against the risk of any complications should a subsequent injury occur in the same area.   I accepted Dr Ngian’s evidence and awarded the sum of$3,000for this item. 21        The defendant disputed the claim for cosmetic surgery on the basis that it does not improve the plaintiff’s medical well-being and was only a cosmetic consideration. It is not disputed that the plaintiff has large scars on her right shin, right thigh, right knee and right hip and multiple small scars over her right leg. While I agree that cosmetic surgery is not a medical indication, I found that the presence of these multiple scars to have a negative psychological impact on the plaintiff and that it affects her self-esteem. In the premises, I found the claim for cosmetic surgery to be reasonable. However, taking into account that the parties had agreed upon $4,000 for pain and suffering as a result of the scars, I awarded the sum of$11,000under this head.",
        "Transport Claim": "22        The basis for the plaintiff’s claim for the cost of a second hand car and expenses to upkeep the car is because the plaintiff can no longer ride her motorcycle as a result of the accident. According to the plaintiff, the loss of the ability to ride a motorcycle, which gave her the freedom to move around, represents an actual tangible loss to the plaintiff since she can no longer continue her usual mode of transportation. 23        I found this to be a disproportionate and groundless claim. Various authorities were cited in an attempt to support her claim but I did not consider them relevant nor helpful to the present case. It is interesting to note that the plaintiff claims to have difficulty commuting by public transport as a result of her injuries and yet could tell this Court that she can brisk walk alongside her students for up to 30 minutes when coaching the netball team. Be that as it may, the clear medical evidence from Dr Chang and Dr Ngian is that the plaintiff is fully able to travel by public transport.  In fact, Dr Chang was of the view that commuting by public transport (even if she were to stand during the journey) would cause less stress to her back than driving as driving in itself can be very stressful. True, the plaintiff is medically advised against riding a motorcycle and true, she can most certainly choose to commute by driving instead of taking a bus or taxi. But claiming against the defendant for the cost of her car and expenses to upkeep one is quite another matter. In so doing, she is asserting that driving a car and riding a motorcycle are perfect substitutes for each other and, more importantly, that she would have never stopped riding a motorcycle or eventually upgrade to a car had she not sustained the injuries. To make such an award would clearly be giving the plaintiff a windfall.",
        "Conclusion": "24        In conclusion, I assessed the damages to the plaintiff as : (i)         General damages for pain and suffering $ 62,000.00 (agreed) (ii)        Loss of earning capacity                                    no award (iii)       Medical expenses                                             $ 46,659.58 (agreed) (iv)       Other medical expenses                                    $   1,085.00 (agreed) (v)        Transport expenses                                           $        92.10 (agreed) (vi)       Loss of earnings during medical leave                $   3,916.83 (agreed) (vii)      Future medical procedures                                $ 35,000.00 (viii)      Transport claim for purchase of motorcar and related expenses                                         no award __________ Total$ 148,753.51 25        I awarded interest at 6% per annum from the date of service of writ to the date of judgment on general damages for pain and suffering. Interest on special damages incurred before the date of judgment was awarded at 3% per annum from the date of the accident to the date of the judgment. 26        The usual consequential orders will apply. I will hear parties on costs."
    }
}