{
    "case_title": "Merchant Ventures Pte Ltd v Chin Bay Ching",
    "ncitation": "[2004] SGHC 262",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "1          Merchant Ventures Pte Ltd (“the plaintiff”) is a Singapore company and Chin Bay Ching (“the defendant”) was at one time an investor in the plaintiff, which in turn invested in the construction of a golf course, country club and several bungalows (“the project”) in Zhuhai, Guangdong Province, China. 2          On 14 June 2004, the plaintiff filed Summons in Chambers No 3183 of 2004 (“the application”) praying,inter alia, for the following orders: (a)     an injunction requiring the defendant to retract two letters, one dated 8 November 2002 (“the first letter”) issued by his solicitors, M/s Rajah & Tann, and the other dated 16 September 2003 (“the second letter”) issued by Vijay & Co on the defendant’s behalf and addressed to the Executive Deputy Mayor (“the Mayor”) of the Zhuhai Municipal People’s Government, Guangdong Province, by issuing a letter to the Mayor within seven days of the date of the order on the terms set out in the schedule to the application and to provide a copy of the said letter and the Chinese translation to the plaintiff within the same period; (b)     an injunction restraining the defendant, whether by himself, or his solicitors, servants or agents, from further communicating with the Mayor, the Zhuhai Land Administration Bureau or such other relevant authorities of Zhuhai municipality or Guangdong Province, whether directly or indirectly, on any matters relating to the plaintiff, the plaintiff’s involvement in the project and the Land Usage Right Grant (“the Grant”) given to the project and all matters in connection thereto including, without limitation, revocation of the Grant and any or all right of compensation arising therefrom until the determination of the main action. 3          I granted an order in terms of the above prayers of the application. The defendant has now appealed against my decision (in Civil Appeal No 86 of 2004).",
        "The facts": "4          According to the pleadings in this suit (and in two other related suits), sometime in 1997, the plaintiff entered into a joint venture with Zhuhai City Jin Xing Industry & Commerce Company (“Jin Xing”) to develop the project through a joint venture known as the Zhuhai Pearl Golf and Country Club (“the Club”). 5          Pursuant to the joint venture with Jin Xing, the plaintiff invested into the project RMB18.9m, which was equivalent to S$4.2m, whilst Jin Xing secured the Grant in favour of the Club from the Zhuhai Municipal People’s Government and other relevant authorities (hereinafter referred to as “the Chinese authorities”). The Grant was subsequently revoked by the Chinese authorities in January 2003. The plaintiff has appealed against the revocation of the Grant and is currently in the midst of negotiations with the Chinese authorities on the appropriate compensation for the revocation. 6          Of the S$4.2m invested in the joint venture, the defendant contributed $1,948,301 whilst the remaining $2,591,556 came from one Tan Siak Meng (“Tan”). The defendant, however, denied that Tan had contributed this or any sum towards the investment. In support thereof, he relied on the plaintiff’s Statement of Claim where it was pleaded[1]that Tan was not reflected as a shareholder of the plaintiff, nor was his loan entered into the books of accounts of the plaintiff. Neither was Tan appointed a director of the plaintiff. 7          In October 2001, the defendant entered into negotiations with Tan, who claimed he could revive the project which had been put on “hold” by the Chinese authorities in or about 1998 due to delays. On 1 December 2001, following negotiations between Tan, the defendant and one Ong Sooi Eng (“Ong”), an agreement (“the agreement”) was reached whereby Tan agreed to purchase the defendant’s entire shareholding in the plaintiff for the sum of S$2.6m. Tan would also give the defendant a bungalow and two golf memberships in the Club. In consideration thereof, the defendant would transfer to Tan one of the defendant’s shares in the plaintiff and also issue to Tan or his nominee seven new shares in the plaintiff. Earlier, Ong had been issued one share in the plaintiff for helping to reinstate the project. 8          On or about 18 February 2002, the agreement was varied and it was agreed that Ong’s share would be transferred to Tan while the seven new shares would be transferred to Anchorage Capital Pte Ltd (“Anchorage”). Anchorage is a Singapore private exempt company and its two shareholders are Tan and one Ong Tee Siang. Tan and Anchorage agreed to deposit blank transfer forms with a third party (Tan Soo Kiat) in the event that Tan failed to comply with his agreement to pay the sum due and to transfer the bungalow and golf memberships to the defendant. The one and seven shares were transferred to Tan and Anchorage respectively by the defendant. 9          As things turned out, Tan failed to abide by the agreement and failed (together with Anchorage) to execute the blank transfer deeds despite demands by the defendant. Consequently, the defendant instituted proceedings against Tan and Anchorage in Suit No 1395 of 2002 (“the first suit”) on 19 November 2002. 10        Just before the writ in the first suit was filed, the defendant’s solicitors wrote the first letter to the Mayor, the material portion of which, translated into English, reads as follows: We wish to inform you that owing to the legal dispute over the shareholding among the members of the [plaintiff], we would like to request the authorities concerned through Your Honour to temporarily cease all consultations in respect of the use of land and other matters pertaining to the Zhuhai Mingzhu Country Club Project. ... Enclosed are our letters written on behalf of our client to Mr Tan Siak Meng and Singapore Anchorage Capital Private Limited. The first letter prompted the Chinese authorities to revoke the Grant in January 2003. 11        In June 2003, the first suit was amicably settled between the defendant and Tan by an exchange of letters dated 25 and 26 June 2003 between their solicitors (“the settlement”). Tan agreed to pay the defendant $1.95m (“the settlement sum”) to settle the defendant’s claim which sum would be paid by equal monthly instalments of $155,000 each with effect from 1 August 2003. The first suit would be discontinued upon full payment of the settlement sum. One of the terms of settlement was that the defendant would appoint a Chinese legal representative for the Club (called a “fa ren” in China) to withdraw the first letter. 12        Tan only paid the first instalment due on 1 August 2003 and refused to pay the further instalments, claiming that the defendant was in breach of the settlement terms. This prompted the defendant’s second set of solicitors to send the second letter to the Chinese authorities. The relevant extracts of the second letter read as follows: We act for Chin Bay Ching (Chin) in place of Messrs Rajah & Tann who were Mr Chin’s previous solicitors in his suit against Tan Siak Meng and Anchorage Capital Pte Ltd. In this Suit No 1395/2002/E, Chin had sued Tan Siak Meng and Anchorage Pte Ltd for the return of shares in Merchant Ventures Pte Ltd (MVPL) that belonged to him because Tan and Anchorage had breached agreed conditions. ... In these circumstances, we would like to put you on Notice that you may want to avoid any dealings with Mr Tan Siak Meng, Anchorage and MVPL or any party other than Chin concerning compensation until the matter is resolved. 13        On 1 October 2003, the defendant executed a deed of assignment with one Chuah Chong Eu (“Chuah”) whereby his claim for the balance $1,795,000 (“the assigned debt”) owed by Tan was assigned to Chuah in consideration of a payment of $300,000 by Chuah. Notice of the assignment was given to Tan on 4 October 2003 together with a demand for payment of the assigned debt, which notice received no response from Tan. 14        On 31 October 2003, Chuah commenced proceedings against Tan and Anchorage for the assigned debt in Suit No 1070 of 2003 (“the second suit”). On 9 February 2004, conditional leave to defend the action was granted to Tan and Anchorage. They failed to furnish security by the deadline imposed by the court with the result that final judgment was entered against them in the second suit on 24 February 2004. Their appeal to a judge in chambers was dismissed on 25 February 2004. 15        The Writ of Summons herein was filed on 5 February 2004 followed by the Defence on 12 March 2004 and the Reply on 26 April 2004. 16        In the Statement of Claim, the plaintiff alleged that the defendant had defamed the plaintiff by the second letter (which contents were untrue) and that the defendant was actuated by malice in sending it. In particularising its allegation of defamation (relying on the ordinary meaning of the words or by innuendo) the plaintiff pleaded that the contents of the second letter meant and/or were understood by the Mayor to mean that Tan and Anchorage were untrustworthy in business and/or were liable to dishonour their contractual obligations. By virtue of the plaintiff’s association with Tan and Anchorage, it consequently meant that the plaintiff was also untrustworthy in business, was liable to dishonour agreements and lacked the financial means and/or resources to complete the project. The plaintiff alleged its reputation had suffered as a result of the defendant’s libel. 17        In its particulars to support the allegation of malice, the plaintiff pleaded that the defendant fell out with Tan over the project and/or control of the plaintiff. The defendant knew or ought to have known that the second letter, read with the first, had or would have dire consequences for the Club’s negotiations with the Chinese authorities for reinstatement of the Grant or compensation for the revocation thereof and, consequently, on the plaintiff’s hopes of recovering or making good its investment in the project. 18        The plaintiff further alleged that the defendant had no legitimate interests in issuing the second letter, as he had divested his shareholdings (to Tan and Anchorage) followed by the settlement, and in any event he had assigned or intended to assign all his rights under the settlement to Chuah. The plaintiff alleged that the defendant’s predominant or collateral purpose was to injure Tan through the damage caused to the plaintiff. 19        In the Defence, the defendant raised the plea of justification. He claimed[2]that the first letter was written to protect the interests of all parties (including the plaintiff) who had invested in the project. He contended that it was written in good faith and without malice and was never intended to disparage the plaintiff or to cause harm to the Club, which was not mentioned in the contents of the first letter. 20        The defendant pleaded that after Tan and Anchorage had breached the terms of the settlement, he became apprehensive that the balance due to him under the terms of the settlement would not be paid. He feared that if compensation was paid by the Chinese authorities for the revocation of the Grant, such moneys would be in the control of Tan, Anchorage and/or the plaintiff, thereby depriving him of the balance due under the settlement. Because of such apprehension and in order to protect his legitimate interests, he instructed his solicitors to send the second letter, which purpose was to maintain the status quo until the matter was resolved between the defendant, and Tan and Anchorage. The defendant denied that his conduct was actuated by malice, that he had a collateral purpose to injure Tan and that he had caused any damage to the plaintiff. He averred that it was not in his interests to jeopardise the Club’s negotiations with the Chinese authorities. 21        The defendant admitted the making of the assignment to Chuah and that he had thereby relinquished his right to take legal action for the balance of the claim owed by Tan. He claimed that as at the date of the second letter, he had intended to take legal action against Tan. 22        In the Reply, the plaintiff pleaded that its solicitors had on 21 April 2004 demanded that the defendant retract the second letter but he had refused. The plaintiff contended that the plea of justification was not open to the defendant by reason of the assignment. 23        In support of the application, a director of the plaintiff, one Lim Tai (“Lim”), filed an affidavit wherein he deposed that the first and second letters had prejudiced the plaintiff as it had not received compensation from, nor had it been able to revive negotiations with, the Chinese authorities. 24        Lim pointed out that the first and second letters were not the proper mode of protecting the defendant’s interests at law. Although the defendant remained as the registered holder of one share in the plaintiff, he did not have thelocus standito correspond with the Chinese authorities in the manner he did in the first and second letters.",
        "The submissions": "25        Counsel for the plaintiff explained that the application was prompted by the Club’s letter dated 10 May 2004 to the plaintiff, which set out unequivocally the prejudicial effect of the two letters on the Club’s ability to recommence negotiations with the Chinese authorities. The Club in its letter urged the plaintiff to procure the withdrawal by the defendant of the second letter. However, the defendant had refused to accede to the plaintiff’s request as set out in its solicitors’ demand dated 21 April 2004. 26        Counsel urged the court to grant the mandatory injunction prayed for as damages would not be an adequate remedy. He said that apart from the direct losses (the invested sum of S$4.2m and the Club’s claim for RMB4.7m), the consequential losses were limitless if the defendant did not retract the two letters. He identified these losses as the sale of club memberships, bungalows and land tracts. Further, according to credit searches he had conducted on the defendant, it was unlikely that the defendant could pay the damages. The balance of convenience clearly lay with the plaintiff that the injunction should be granted. 27        Counsel for the defendant did not, in his counter arguments, raise anything new over and above what had been pleaded in his client’s defence. He merely relied on the plea of justification for the two letters in question, submitted that there was no urgency that required the granting of a mandatory injunction and said that the status quo should be maintained pending trial. However, counsel did not dispute that his client no longer had any legitimate interest to protect either in the plaintiff and/or in the project.",
        "The decision": "28        It was common ground that as at the date the defendant filed his Defence (12 March 2004), he no longer had any interest in the project although he still held one share in the plaintiff. His interest, if any, was in a monetary claim he then had against Tan for breach of the settlement. Even then, that interest was subsequently extinguished by the assignment to Chuah dated 1 October 2003. 29        The principles for the granting of a mandatory injunction were laid down sometime ago by our Court of Appeal inChuan Hong Petrol Station Pte Ltd v Shell Singapore (Pte) Ltd[1992] 2 SLR 729(“Chuan Hong”). In delivering the judgment of the court, Warren L H Khoo J (adopting the approach taken by Hoffmann J inFilms Rover International Ltd v Cannon Film Sales Ltd[1987] 1 WLR 670) held at 743, [88] and [89]: [A] fundamental principle is that the court should take whichever course appears to carry the lower risk of injustice if it should turn out to have been wrong at trial in the sense of granting relief to a party who fails to establish his rights at the trial, or of failing to grant relief to a party who succeeds at the trial. … … The strength of a party’s case (reaching a ‘high assurance’ or ‘clear case’ standard) is neither a necessary, nor is it a sufficient, condition for the grant of a mandatory injunction. In other words, a less rigorous test would be required where the withholding of a mandatory injunction may carry a greater risk of injustice than the granting of it. 30        Khoo J’s reference to the tests of “high assurance” or “clear case” were extracted fromLocabail International Finance Ltd v Agroexport[1986] 1 WLR 657where the English Court of Appeal (Mustill LJ), quoting in turn from Megarry J’s judgment inShepherd Homes Ltd v Sandham[1971] Ch 340at 351, was described in the headnote of the case to have held,inter alia, that: … the exercise of the discretion to grant a mandatory injunction in interlocutory proceedings should be approached with caution and only granted in a clear case where the court felt a high degree of assurance that at the trial it would appear that the injunction was rightly granted, a fortiori where the grant of the injunction would amount to the grant of the major part of the relief claimed ... 31        The principles in these English cases had earlier been applied by Chan Sek Keong J inHeysek v Boyden World Corp[1988] SLR 862, where a mandatory injunction was sought by and granted to the defendants on their counterclaim, pending trial. AfterChuan Hong, the same principles were subsequently applied by our Court of Appeal inSingapore Press Holdings Ltd v Brown Noel Trading Pte Ltd[1994] 3 SLR 151. 32        Applying to this action the principles culled from the various cases referred to earlier, it seemed to me to be very clear that the interests of justice weighed in favour of granting the injunction to the plaintiff. The injustice suffered by the defendant, if the injunction was granted and the plaintiff later failed at trial, was far less than the risk of injustice to the plaintiff if the mandatory injunction was not granted. 33        The principal reliefs claimed by the plaintiff in the Statement of Claim consisted of (a) the sum of S$4.2m; (b) damages; and (c) a mandatory injunction requiring the defendant to retract the first and second letters. It can be seen therefore that granting the mandatory injunction would not amount to the grant of the plaintiff’s entire claims and certainly would not have the effect of putting an end to this action. 34        I turn now to the defences of protection of own interests and justification pleaded by the defendant. I would first observe that preservation of own interests is not a valid defence at law to a claim in defamation. That only leaves the defendant with his plea of justification. In other words, the defendant would have to prove that the words complained of were true in substance and in fact. If he succeeded in this defence, it meant that the plaintiff would fail in its claim for damages. The defendant would then be held to have been justified as at 8 November 2002 (the date of the first letter) and as at 16 September 2003 (date of the second letter) in sending the two offending letters to the Chinese authorities. 35        However, subsequent events had overtaken the defendant’s dispute with Tan, even if the sending of the two letters was justified. It culminated in the assignment, which was followed by the second suit and then Chuah’s judgment therein against Tan and Anchorage. I note from the court’s records that execution proceedings have been set in motion by Chuah pursuant to the final judgment he had obtained on 24 February 2004 against Tan and Anchorage. Consequently, what prejudice would be caused to the defendant if he was ordered to retract the two letters before trial? None as far as I could tell. 36        On the other hand, as counsel for the plaintiff had submitted before me, the plaintiff would be severely prejudiced if there was no retraction of the two letters. It appeared from the letter dated 10 May 2004 from the Club to the plaintiff ([25]supra) that the Chinese authorities had in August 2003 reconsidered their decision on the revocation of the Grant and/or the issue of compensation for such revocation. Unfortunately, whatever hopes the plaintiff had in this regard were effectively dashed by the sending of the second letter. I viewed with considerable scepticism the defendant’s claim[3]that the second letter (as well as the first letter): was intended not only to protect the defendant’s legitimate interests and to maintain thestatus quountil the matter is resolved between the Defendant, Tan and Anchorage but also to protect the [plaintiff’s] interests as well as those of the other parties who had invested monies in the [plaintiff]. I make two observations in relation to the above pleading: first, it served no purpose to maintain the status quo when that status quo had been changed by the defendant. Second, the defendant’s action in sending the two letters was akin to a man shooting himself in the foot. It did not serve to protect the plaintiff’s or the defendant’s interests, but rather to extinguish whatever chances the Club may have had in reviving the project by having the Grant reinstated, or being paid compensation if the revocation of the Grant was not rescinded. 37        Consequently, I granted the plaintiff the mandatory injunction it had prayed for. Pending the outcome of his appeal, I granted on 19 October 2004 the defendant’s application for a stay of the orders I had made. [1]At para 4[2]In para 6[3]In para 27 of the Defence"
    }
}