{
    "case_title": "Trustee of the Estate of Ong Thiam Huat v Chan Hock Seng",
    "ncitation": "[2004] SGHC 232",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "2          The facts, shorn of details, are as follows. Ong Toh, a prosperous and traditional Chinese businessman, operated a sole proprietorship known as Chuan & Co since the 1940s. He was a very shrewd and successful businessman and he acquired a fortune through his business and the acquisition of properties. After Ong Toh decided that it was advantageous for tax purposes to convert Chuan & Co to a private limited company, Chan was instructed to undertake this task and CCPL was incorporated on 24 August 1973. Subsequently, Ong Toh incorporated other companies, including Chuan & Co Hardware Pte Ltd and Chio Leong Trading Pte Ltd. It was not disputed that he paid for the shares in all these companies and that he and/or his family members were the shareholders of the said companies. 3          Ong Toh was a domineering father and he made no distinction between his own assets and those of the companies he set up. Shares that were registered in the names of his children or grandchildren and properties that belonged to the companies he set up were freely transferred on his orders. Those who challenged his decisions faced severe consequences. One of his sons, Ong Chwee Huat, was publicly disowned by him through advertisements in newspapers. 4          CCPL’s three original shareholders were Ong Toh himself, his eldest son, Ong Kiat Huat (“Huat”), whose mother was Ong Toh’s first wife, and OTH, whose mother was Ong Toh’s second wife. In November 1990, Ong Toh transferred his shares in CCPL to his daughters, Mdm Ong Thiam Hong (“Mdm Thiam”) and Mdm Ong Kim Hong (“Mdm Kim”), whose mother was his third wife. He then resigned as a director of the company. 5          Although he resigned as a director of CCPL and no longer had any shares in that company, Ong Toh continued to deal with the company’s assets as if they were his own. During his lifetime, Ong Toh withdrew around $7.1m from CCPL and this was reflected in the accounts of CCPL as a debt to the company. According to Chan’s counsel, the alleged debt was merely the “accounting by-product of a systematic hollowing out by Ong Toh of CCPL’s assets starting in about 1983, 2 years after [his eldest son, Huat,] fell from grace”, apparently because he refused to accede to his father’s demand that he transfer some of his shares in CCPL to two of his half brothers. Huat, who held 30% of CCPL’s shares, said that he was in no position to protest against his father’s decisions on the disposal or transfer of CCPL’s assets and that he was kept in the dark about the said company’s affairs since 1981. 6          In May 1993, CCPL was put under voluntary liquidation. Chan, who was appointed the liquidator of the company, wrote to Ong Toh to pay up the debt of $7.1m on a number of occasions. Ong Toh was rather anxious that the said debt be written off and he gave instructions to OTH for this to be done. OTH took a number of steps to fulfil his father’s wish to have the $7.1m debt to CCPL written off. In early 1993, even before Chan was instructed to liquidate CCPL, OTH approved an accounting entry, called a “transaction batch list”, for the purpose of writing off Ong Toh’s debt. Secondly, on 17 August 1994, OTH and his two half sisters, Mdm Thiam and Mdm Kim, signed two documents to facilitate the cancellation of the debt. The first was a resolution authorising the liquidator to write off the debt or, alternatively, to offset Ong Toh’s debit balance against the respective shareholder entitlement of the three of them. It was in the following terms: We being all the contributories of CHUAN & COMPANY PTE LTD – (In Liquidation) do hereby pass the following resolution:- RESOLVED that the Liquidator of the Company be requested to write-off the debit balance of SIN$7,164,304.64 standing at the debit of the founder of the Company, Mr Ong Toh’s account at the book of the Company or alternatively to offset the debit balance to our respective entitlements pro-rata to our shareholdings in the Company. 7          In the second document, OTH and his two half sisters wrote to the liquidator to indemnify him against any loss or damage that he might suffer as a result of complying with their instructions to write off Ong Toh’s debt. It is noteworthy that their request to the liquidator to write off their father’s debt was described as “irrevocable”. 8          On 19 January 1995, OTH, Mdm Thiam and Mdm Kim signed a document in blank addressed to Chan. The document, which was termed an “Authority to Liquidator to Pay First & Final Return to Another Person”, was worded as follows: I hereby authorise and request you to offset a sum of dollars ... being ... of my entitlement of first and final returns declared in the above-named Company to Mr Ong Toh’s account with the Company. On the same day, OTH signed another letter authorising Chan to offset his own credit balance of $208,574.15 against Ong Toh’s account with CCPL. 9          Ong Toh passed away on 30 March 1995 before OTH completed the paper work required to have his debt to CCPL officially written off. OTH, who had confirmed on several occasions during Ong Toh’s lifetime that the latter’s debt to CCPL was to be written off, showed no interest whatsoever in recovering the said debt from Ong Toh’s estate for almost five years after Ong Toh’s death. During this period, Chan arranged for CCPL’s shareholders to meet on a number of occasions without success. No one showed up for a meeting scheduled on 31 December 1997 and only OTH’s proxy was present at a meeting of 24 December 1997, which had to be adjourned because there was no quorum. On 26 March 1999, no shareholder turned up for the meeting arranged by Chan. 10        Suddenly, on 18 February 2000, almost five years after Ong Toh’s death, OTH wrote to Chan to revoke the authority “to pay the First and Final Return to another person”. Notwithstanding all his earlier efforts to try and have his father’s debt to CCPL written off, OTH was not at all embarrassed to point out that as the remaining shareholder of CCPL, Ong Toh’s eldest son, Huat, had not signed the requisite resolution to cancel Ong Toh’s debt, the said resolution had no legal force even though he, Mdm Thiam and Mdm Kim had approved of it. Chan claimed that OTH changed his mind about writing off the amount recorded in CCPL’s books as Ong Toh’s debt because he got into financial difficulties, an allegation that was denied by OTH. 11        When Chan finally instituted Suit No 1310 of 2001 against the estate of Ong Toh to recover the said $7.1m debt, the trial judge ruled that his claim had become time-barred. An appeal to the Court of Appeal against the trial judge’s decision was unsuccessful.",
        "Whether Chan was negligent": "12        As the liquidator of CCPL, Chan’s duty was to recover debts owed to the company. Since it was recorded in CCPL’s books that Ong Toh owed the company around $7.1m, Chan’s task was to recover this amount from him or from his estate after his death. Chan’s counsel conceded that he would, without more, be liable to compensate OTH his share of the $7.1m that was not recovered from Ong Toh or his estate. This concession saved a lot of time as the parties then focused their attention on whether Chan’s claim, that he is not liable to OTH for negligence because the latter suffered no loss, has any merit.",
        "Whether OTH suffered any loss": "13        As has been mentioned, the main thrust of Chan’s defence is that OTH did not suffer any loss because whatever CCPL’s books may have stated, Ong Toh was not indebted to the said company as he owned all the company’s assets. A major obstacle in running this line of defence is that when Chan sued the estate of Ong Toh in Suit No 1310 of 2001, he asserted that the sum of $7.1m was indeed owed by Ong Toh to the company. Chan countered this by pointing out that he discovered from the affidavits filed by a number of Ong Toh’s children in Suit No 1310 of 2001 that Ong Toh actually owned all the shares in CCPL. He thus argued that even if he had filed an action against the estate of Ong Toh on time, that action would have failed because, according to a number of Ong Toh’s children, Ong Toh did not owe CCPL any money. 14        For the purpose of determining whether OTH has suffered any loss from Chan’s failure to sue the estate of Ong Toh before the debt in question became time-barred, the following words of Lord Evershed MR inKitchen v Royal Air Forces Association[1958] 2 All ER 241 at 251 are worth noting: In my judgment, assuming that the plaintiff has established negligence, what the court has to do in such a case as the present is to determine what the plaintiff has lost by that negligence. The question is: Has the plaintiff lost some right of value, some chose in action of reality and substance? In such a case it may be that its value is not easy to determine, but it is the duty of the court to determine that value as best it can. 15        Before the present trial commenced, one would have thought that it would not be easy for Chan to establish that he had no prospect of succeeding in his suit against the estate of Ong Toh if the suit had not been time-barred because the accounts of CCPL clearly showed that the latter was a debtor of that company. However, OTH effectively scuttled his own case from the very start when he gave contradictory evidence as to whether there was a debt owed by Ong Toh to CCPL. While he first insisted that Ong Toh owed the company money, he gradually shifted his position and declared time and again during cross-examinationand re-examinationthat whatever CCPL’s accounts may have stated, the true position is that his father did not owe CCPL any money because he had withdrawn his own money from the company. As this was a very strange position for a plaintiff in OTH’s shoes to adopt, it is necessary to consider in some detail his absolutely astonishing answers to questions put to him during cross-examination and, even more startling, during re-examination. 16        On the second day of cross-examination, the first question put to OTH by Chan’s counsel, Ms Josephine Chong, and OTH’s answer were as follows: Q:         Yesterday, you said that the $7.1m debt that your father withdrew from the company was actually his own money? A:         Yes. 17        After OTH conceded once again that Ong Toh withdrew his own $7.1m from CCPL, Ms Chong asked him to explain how his father could be sued for a non-existent debt. His reply, which was most telling, was as follows: Q:         If the $7m taken by your father from CCPL is his own money, how do you expect him to be sued for the debt? A:The $7.1m taken by my father is his own money. He loaned the money to the company. So he could take it.He loaned more than $7.1m to the company. If that is so, it is logical he could take his own money. His money is still recorded in the books of the company.If it is his money, I have no reason to sue. [emphasis added] 18        When next questioned by Ms Chong about the resolutions that he signed authorising the writing off of the debt, OTH again undermined the foundation of his claim when he said as follows: Q:         So when you signed the resolution authorising the writing off of your father’s debt of $7m,all you were doing was to regularise matters and reflect the reality of the situation? A:         Yes. [emphasis added] 19        Ms Chong then elicited the following answer from OTH with respect to what he knew when he instructed Chan to commence legal proceedings against Ong Toh’s estate: Q:         When you instructed the liquidator to commence proceedings against your father’s estate, you knew that this was not a real debt? A:         It was my father’s own money. 20        OTH’s response to a question as to what was on his mind when he revoked his authority to the liquidator to write off Ong Toh’s debt was also thoroughly unhelpful to his case. The relevant question and answer were as follows: Q:         In February 2000, when you revoked your authority to the liquidator to write off your father’s debt,were you trying to take advantage of CCPL’s accounts to get more of your father’s money from the estate? A:Yes. [emphasis added] 21        Lest there be the slightest of doubt as to OTH’s position regarding Ong Toh’s debt to CCPL after two days of intense cross-examination, Ms Chong’s final question and OTH’s final answer, which were as follows, are worth noting: Q:         In court today and yesterday, you admitted that the $7.1m taken by your father from CCPL was his own money? A:         Yes. 22        For convenience, OTH’s answers to questions put to him during cross-examination, may be summarised as follows: (a)        Regardless of what CCPL’s accounts stated, Ong Toh did not owe the company any money because he withdrew his own money from the company; (b)        When he (OTH) signed resolutions authorising the liquidator to write off Ong Toh’s debt, he was merely trying to regularise the true position; (c)        When the liquidator commenced proceedings against the estate of Ong Toh to recover the debt of $7.1m recorded in CCPL’s books as owed to the company, he (OTH) knew that the truth was that Ong Toh had withdrawn his own money from the company; and (d)When he (OTH) revoked his authority to the liquidator to write off his father’s debt, he was trying to take advantage of CCPL’s accounts to demand money from his father’s estate. 23        Any hope of salvaging OTH’s case during re-examination evaporated the moment the plaintiff’s counsel, Mr Nishith Shetty, embarked on his Herculean task. When Mr Shetty gave him a golden opportunity to clarify his position, OTH answered as follows: Q:         During cross-examination, you said that the $7.1m was your father’s money. Do you wish to clarify? A:The $7.1m was my father’s own money. Q:         It was not the company’s money? A:It was not the company’s money. [emphasis added] 24        Mr Shetty tried again but elicited the same response from OTH. The relevant questions and answers were as follows: Q:         In paragraph 5 of your affidavit, you said that your father took out $7.1m from the company? A:         Yes. Q:         Is that the company’s money or his own money? A:         His own money. Q:If the $7.1m is his own money, he does not have to pay back the company the $7.1m? A:Yes. [emphasis added] 25        Mr Shetty then went so far as to ask OTH why he said that his father owed CCPL money if he took the position that his father merely collected back his own money from that company. OTH gave the following very clear answers: Q:         Why do you say he owes the company money? A:         My evidence is based on the auditor’s report. From the audit report, my father owed this sum of money. Q:         Did your father owe the company this money or not? A:         No. 26        By then, any plaintiff’s counsel would have been driven to the depths of despair. Mr Shetty next asked OTH why he sued the liquidator if he believed that no debt was owed by Ong Toh to CCPL. Although OTH claimed to be a bit confused, he explained that his confusion had nothing to do with his assertion that Ong Toh took his own money back from the company. He said as follows: Q:         If your father did not owe the company this money, why did you sue the liquidator? A:         I am now confused. Q:         What was your confusion about? A:         From the audited accounts, it reflected a debt. If my father took his own money from the company, it is his own money but if he took company money, he has to pay back. My father took his own money from the company. 27        During the last part of his re-examination, it finally dawned on OTH that he had no case unless he altered his evidence altogether. Ignoring all that he had previously said during cross-examination and re-examination, he swiftly changed his evidence altogether and said that his father did not withdraw his own money from CCPL and that the latter owed the company $7.1m. Mr Shetty submitted that in view of this, OTH’s evidence must be regarded as conflicting. Having had the opportunity to listen to OTH and observe his demeanour, I have no hesitation whatsoever in holding that the evidence that he gave during the last part of re-examination was totally contrived. It was evident that he contradicted all that he had said during cross-examination and re-examination for more than two days so as to get his hands on a share of the $7.1m in question. 28        In the final analysis, it cannot be overlooked that the present action was commenced by OTH and continued by the trustee of his estate. As a plaintiff has the task of proving his case, it must be established that OTH had suffered a loss as a result of Chan’s negligence. In the light of OTH’s own evidence that whatever CCPL’s books may have recorded, his father did not owe CCPL any money, there can be no doubt that he had not even begun to discharge the burden of proving that he has a claim against Chan. Even if one is generous to OTH, and his evidence on the existence of the debt is regarded as contradictory, this does not take his case very far as no other credible evidence was furnished to support the assertion that he suffered a loss. I have not overlooked the fact that Mr Shetty asserted that the other shareholders of CCPL, namely Huat, Mdm Thiam and Mdm Kim, also took the view that Ong Toh owed CCPL money. However, a closer look at the evidence will show that their views do not assist OTH’s case. Admittedly, Huat asserted that Ong Toh owed CCPL money and that he was entitled to his share of the debt in question. However, he based his conclusion on what appeared in CCPL’s books as he admitted that he was kept in the dark about company affairs after 1991. More significantly, he clearly distanced himself from OTH’s claim and testified that he did not know about OTH’s deals with Ong Toh. When questioned by Mr Shetty, his answers were as follows: Q:         You expected [the liquidator] to recover the $7.1m debt? A:I expected him to recover my share.As for the other shareholders, I do not knowbecause I was kept in the dark about many things and sometimes when the company resolved things when the old man was alive, I did not know. [emphasis added] 29        As for Mr Shetty’s submission that Mdm Thiam and Mdm Kim “similarly asserted that the debt was repayable by the father and in fact obtained a cheque from the father to pay their share of the outstanding sum”, it is surprising that reliance should have been placed on the cheque that was allegedly signed by Ong Toh on 23 March 1995 to pay for his two daughters’ share of the outstanding sum recorded in CCPL’s books as his debt to the company. For a start, if the debt was owed by Ong Toh to the company, Mdm Thiam and Mdm Kim had no right to bypass the company and ask for a direct payment of a part of the debt to themselves. More importantly, it is very disturbing that in Suit No 306 of 2001, which was commenced by Mdm Kim against,inter alia, the executor of the estate of Ong Toh with respect to the cheque allegedly signed by Ong Toh on 23 March 1995, Dr Tham Meng Keat (“Dr Tham”), a consultant physician who was Ong Toh’s doctor at the material time, stated in his affidavit that his patient was not in a position to sign any cheque on 23 March 1995 as he was in a coma from early February 1995 and he remained in a coma until he passed away on 30 March 1995. As the dispute which resulted in the institution of Suit No 306 of 2001 was settled by the parties and Dr Tham, Mdm Thiam and Mdm Kim were not called as witnesses in the present action, one cannot, and especially when there is a serious allegation that the cheque in question was forged, accept the suggestion that Ong Toh had acknowledged his debt to CCPL by signing the said cheque on 23 March 1995 and handing it over to Mdm Thiam and Mdm Kim. 30        To sum up, as OTH effectively scuttled his own case and there was no other credible evidence to support his case, it is unnecessary for me to consider Chan’s defences to the claim. The claim against Chan is thus dismissed with costs."
    }
}