{
    "case_title": "Rukiah bte Ismail v Public Prosecutor",
    "ncitation": "[2004] SGHC 98",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The facts": "",
        "The charges": "2The appellant claimed trial to two charges in the court below: DAC 23488/2003 You Rukiah Binte Ismail, NRIC No S1503474B, are charged that you, sometime between June and July 2001, in Singapore, together with Chew Ai Wah and Rohaini Binte Mohd Isa, in furtherance of the common intention of you all, did cheat one John Lim, a Credit Approval Manager of Standard Chartered Bank (“SCB”), to wit, by deceiving him into believing that renovation works amounting to $22,000 were to be carried out at your residence located at Block 34 Jalan Bukit Ho Swee #09-868, Singapore, by Tiong Yi Li Construction Ptd Ltd, when in fact no such renovation was intended, and by such manner of deception you dishonestly induced the said John Lim to approve a renovation loan of $13,000, which sum was subsequently delivered to you by way of two SCB cashier’s orders number 539849 and 539850 made payable to the said Tiong Yi Li Construction Pte Ltd, and you have thereby committed an offence punishable under Section 420 read with Section 34 of the Penal Code, Chapter 224. DAC 23490/2003 You Rukiah Binte Ismail, NRIC No S1503474B, are charged that you, sometime between June and July 2001, in Singapore, together with Chew Ai Wah and Rohaini Binte Mohd Isa, in furtherance of the common intention of you all, did cheat one Loong Hui Ping, an Assistant Vice President of Overseas Union Bank Limited (“OUB”), to wit, by deceiving her into believing that renovation works amounting to $22,000 were to be carried out at your residence located at Block 34 Jalan Bukit Ho Swee #09-868, Singapore, by Tiong Yi Li Construction Ptd Ltd, when in fact no such renovation was intended, and by such manner of deception you dishonestly induced the said Loong Hui Ping to approve a renovation loan of $12,000, which sum was subsequently delivered to you by way of an OUB cashier’s order number 10559 made payable to the said Tiong Yi Li Construction Pte Ltd, and you have thereby committed an offence punishable under Section 420 read with Section 34 of the Penal Code, Chapter 224.",
        "The Prosecution’s case": "3The Prosecution based its case on the testimony of one Chew Ai Wah (“Joe”), a renovation contractor who had been in this line of business for some nine to ten years before he was convicted for cheating banks on behalf of some 20 clients. Joe was convicted and sentenced before the commencement of the appellant’s trial below. 4Sometime between April and June 2001, Rohaini bte Mohd Isa (“Rohaini”), a co-defendant with the appellant in the trial below, met Joe in Clementi. Joe was introduced to Rohaini by a mutual friend, “Ismail”. At their meeting, Joe told Rohaini that he was able to assist people in obtaining renovation loans from banks even if these people had no actual intention of renovating their homes. Joe further agreed with Rohaini that if she recommended such people to him, he would give her 5% of the bank loan, keeping 15% of it for himself. The remaining 80% would go to the person applying for the loan. 5Joe testified that in June 2001, Rohaini informed him that the appellant needed money and wished to apply for a renovation loan even though she did not intend to renovate her flat. Rohaini had explained to the appellant that Joe was a renovation contractor who was able to assist his customers in applying for renovation loans without renovating their homes, and that he would charge them a 20% commission from the loan amount. Joe asked Rohaini for details of the type of flat the appellant was living in, as well as for the appellant’s identity card number. He incorporated these details into a fictitious quotation. 6Joe called the appellant later in the day with the phone number given to him by Rohaini. After confirming with the appellant that she needed cash for her personal use and not for renovation purposes, he asked her to prepare all the necessary documents required to process the loan. The appellant told Joe that the documents were prepared and that Rohaini had already informed her that he would be charging a commission of 20%. Joe made an appointment to visit the appellant in her apartment. 7On the evening of 23 June 2001, Joe met the appellant in her apartment, where she gave him copies of the necessary documents. Joe advised her to apply for two loans and she agreed to do so. Joe filled in the two renovation loan application forms on the spot with the information provided by her. After doing so, he instructed her to check if the entries on the forms were correct before signing them. The appellant signed the forms as well as the quotation prepared by Joe. Joe claimed that he did not take any measurements of the appellant’s apartment nor inspect the apartment, since no renovation work was intended. 8Joe submitted the loan application forms the next day, together with the relevant supporting documents. Both loan applications were approved by the banks, Overseas Union Bank (“OUB”) and Standard Chartered Bank (“SCB”). The bank officers who approved the loans confirmed in the court below that they would not have done so if they had known that no renovation was intended. In approving the loans, they relied on the loan application form, the contractor’s quotation, documents relating to the appellant’s proof of income and proof of ownership of the apartment to be renovated, as well as a copy of the appellant’s identity card. 9In July 2001, Joe found out from the SCB phone-banking service that the SCB loan application had been approved. He waited at the void deck of the appellant’s apartment and intercepted the disbursement letter enclosing the SCB cashier’s orders from the postman. He then credited the cashier’s orders into his company’s account and paid the appellant $3,000 to $4,000 in cash. 10The appellant was later informed that the OUB loan had been approved. She informed Joe of this and met him at one of the OUB bank branches on 11 July 2001 to collect the cashier’s order. The appellant handed the cashier’s order to Joe, who credited it into his company’s bank account. He claimed to have paid $9,480 of the OUB loan amount to the appellant in cash on two or three occasions between July 2001 and August 2001.",
        "Close of the Prosecution’s case": "11At the end of the Prosecution’s case, the trial judge rightly found that there was evidence to establish the essential ingredients of the offence under s 420 of the Penal Code (Cap 224, 1985 Rev Ed). These ingredients, set out inGunasegeran s/o Pavadaisamy v PP[1997] 3 SLR 969and approved inChua Kian Kok v PP[1999] 2 SLR 542, are that: (a)The victim must be deceived; (b)There must have been an inducement such that the victim delivered any property to any person; and (c)There must be a dishonest or fraudulent intention on the part of the deceiving person to induce the victim to deliver the property. 12The first two requirements were satisfied. Both the bank officers were deceived into believing that renovation work would be carried out at the appellant’s apartment when no such work was in fact intended. This belief induced them to approve the loans to the appellant so that the cashier’s orders were issued and delivered. As for the third ingredient, s 24 of the Penal Code provides that anyone who “does anything with the intention of causing wrongful gain to one person or wrongful loss to another, is said to do that thing dishonestly”. This definition was satisfied by Joe’s testimony, since the appellant had intended to cause wrongful gain to herself by applying for the loans.",
        "The appellant’s case": "13The appellant refuted various aspects of Joe’s testimony. In particular, she denied having any part in any agreement to cheat the banks. She claimed that she had really intended to renovate her home and had shown Joe around the kitchen and two bedrooms of her apartment. Joe only drafted the quotation after she showed him around her apartment. He then brought it to her during his third visit to her apartment, when she signed it. She did not know that the banks would rely on the quotation when deciding whether to grant her a loan, and was unaware that the quotation would affect the bank’s assessment as to the quantum of the loan. 14The appellant said that she received a letter of offer from SCB informing her that she would receive a cheque from SCB in the name of her contractor in a few days. She never received the cheque. In July, she received a letter informing her that the OUB loan had been approved. She met Joe at the bank when she authorised the bank to hand over the cashier’s order to Joe, who then gave her $1,000. Joe also told her that he would check with SCB as to the status of the SCB cheque, and told her not to call the bank herself. On two separate occasions, he gave her a further $2,000 and $1,500 from the OUB loan. By this time, he had already cashed the SCB cheque. Roughly a month later, she called SCB herself and found that the cheque had already been issued and cleared. She then lodged a police report against Joe. However, although Joe had not paid her the remaining $5,100 of the OUB loan due to her, she did not make a police report in respect of this sum. 15In summary, the purport of the appellant’s evidence was a bare denial of any knowledge of Joe’s plan to cheat the banks. In response to Joe’s evidence implicating her in the scheme, she contended that Joe bore a grudge against her because she had reported him to the police. 16Rohaini, the co-accused, also refuted Joe’s version of events. She denied having met Joe at Clementi or having been part of any agreement to cheat the banks. She further disclaimed that she had agreed to introduce any persons, including the appellant, to Joe in exchange for a 5% commission.",
        "The decision below": "17The trial judge found the appellant to be an untruthful witness, noting that she was “not a simple and gullible person as she had made herself out to be”. In contrast, the trial judge found Joe to be a “credible and forthright witness” and accepted his version of events as true and correct. As the trial judge was satisfied beyond reasonable doubt that the appellant was guilty of the two charges, he convicted her. In sentencing, he took into consideration the fact that the appellant had no criminal antecedents. Nevertheless, he was of the view that the appellant’s lack of remorse, the active role she played in the scam, as well as the public interest, demanded a deterrent sentence. He accordingly sentenced her to six months’ imprisonment on each of the two charges, both to run concurrently.",
        "The appeal": "18As was the case in the court below, the issues before me in this appeal essentially hinged on the word of one witness, Joe, against that of another, the appellant. In this regard, I had to bear in mind that as an appellate judge, I should be slow to disturb a lower court’s findings of fact unless they were shown to be clearly wrong, reached against the weight of the evidence or unless the appellant showed me that the trial judge had not taken proper advantage of his having seen and heard the witnesses:Lim Ah Poh v PP[1992] 1 SLR 713,PP v Hla Win[1995] 2 SLR 424. This was especially so with findings of fact which hinged on the trial judge’s assessment of the credibility and veracity of witnesses:Yap Giau Beng Terence v PP[1998] 3 SLR 656. In order for me to reverse the sentence below, I could not merely entertain doubts as to the rightness of the decision, but must actually be convinced that it was wrong:PP v Poh Oh Sim[1990] SLR 1047,PP v Azman bin Abdullah[1998] 2 SLR 704. It was with these principles in mind that I turned to the substantive issues on appeal. 19The arguments canvassed by the appellant on appeal can be grouped into three main areas of contention.",
        "That the trial judge erred in rejecting the appellant’s version of events": "",
        "Intention to renovate the apartment": "20The trial judge found that the appellant was not telling the truth about her intention to renovate the apartment. He enumerated various factors which led him to this conclusion. First, the appellant had purportedly told Joe that she wanted the flooring of the two bedrooms, living room and kitchen done. She also wanted to redo the kitchen cabinets and to rewire and redo the lighting of the apartment. Joe drew up the draft quotation based on these instructions. When presented with the quotation, the appellant pointed out to Joe that there were unwanted items on the list. He told her that this was only a “rough estimation” and that once the loan was approved, he would sit down with her and work out a more accurate quotation. He also assured her that he had done this many times and knew what to do. Since she felt that the quotation was “more or less” in line with her intended renovations, she signed it. 21I was of the view that the trial judge was right to question the plausibility of the appellant’s version of events. Although this draft quotation comprised a list of 23 renovation items, only four items pertained to works that the appellant wanted. Moreover, the list did not include major items of renovation which the appellant said she wanted, such as flooring of the living room and two bedrooms, as well as rewiring and lighting of the apartment. Further, the cost of these four items amounted to $4,700, about one fifth of the total cost of all these works. I found it highly unlikely that any reasonable homeowner with a genuine intention of renovating her home would have accepted a quotation from her contractor, however experienced he may have been, which listed almost 20 superfluous renovation items, omitted other major required items and cost five times what she was intending to pay. 22The appellant admitted on cross-examination that she did not shop around for other quotations and had absolutely no idea how much she wanted to borrow from the bank. I found this curious in the light of her prior testimony that she was someone who was careful about money and about getting good deals. A person genuinely seeking to renovate her flat, especially someone who is careful about money, will surely try to obtain a few quotations in order to ascertain whether she is getting a good deal, and will almost certainly have an estimate of the size of the loan she wishes to apply for. 23Further, the trial judge disbelieved the appellant’s claim that she did not know and had no idea that the bank would rely on the quotation in deciding whether to grant the loan. I agreed with this finding. While the appellant could not be expected to understand the intricacies of the loan process, she knew that the quotation would be submitted to the bank in respect of her renovation loan application. The only plausible reason for this would have been that the bank needed the quotation in order to process the application. The appellant then argued that there was nothing wrong in submitting a draft quotation for a bank loan since the quantum of the loan granted would be based on her income and not the value of the quotation. In my opinion, this argument entirely missed the point, which was that someone genuinely intending to renovate her home might well submit a draft quotation to secure a bank loan, but would hardly submit a quotation so far removed from reality. 24Additionally, I considered that if the appellant had genuinely intended to renovate her home, it would then be reasonable to expect her to include an allegation in her police report that Joe had cheated her by failing to carry out any renovation work. Instead, the police report only mentioned the SCB cheque which Joe had cashed and failed to pay out to her. On this basis, I saw no reason to impugn the trial judge’s inference that the appellant did not possess a genuine intention to renovate the apartment, but that she was more interested in the loan money for other purposes.",
        "Credibility of Ivan’s evidence": "25The appellant’s 20-year-old son, Ivan Rahadi bin Nasrul (“Ivan”), testified that Joe had come to their apartment on a Saturday afternoon. At the time, he was in his room playing computer games. Joe stayed in the room for about a minute. Initially, Ivan said that he did not stop playing his computer game when Joe entered the room and did not do anything else apart from playing the computer game during the time that Joe was in the room. He then said that when Joe came in, he looked at Joe and saw Joe looking at the wall and the floor. When questioned about how he knew that Joe was looking at the wall and the floor if he was playing his computer game and his eyes were on the computer screen, he said that when Joe came in, he “looked at him until he left the room”. Although he was looking at Joe, they did not say anything to each other. Ivan also testified that the appellant wanted to cement the walls so they could be painted easily, but when questioned, said that he was “not so sure” that the appellant wanted to cement the walls. In re-examination, he again changed his answer to say that he knew that the appellant wanted to do something to the walls but he was not sure what exactly she wanted. 26The trial judge noted that Ivan’s evidence was “neither here nor there”. I agreed with this. Even if Joe had looked at the walls and the floor, that would not prove the appellant’s intention to renovate the apartment. Further, a contractor who genuinely intended to renovate the apartment and redo the flooring would surely do more than stand in the doorway of the room to take a cursory glance at the walls and the floor. At the least, he could be expected to enter the room and walk around it for a more thorough examination, or perhaps take some basic measurements. 27In my view, Ivan’s testimony was vacillating, inconsistent and lacking in credibility. As such, I agreed with the trial judge that very little weight, if any, should be placed on it.",
        "That the trial judge erred in impeaching the appellant’s credit by finding inconsistencies in the appellant’s statements to the police and her evidence in court": "28The trial judge also rejected the appellant’s story because of the material discrepancies between her police statement and her evidence in court, for which she was unable to give a reasonable and satisfactory explanation. There were three areas of discrepancy, which I will deal with in turn. 29First, the appellant stated in her police statement that she had agreed with Joe that if the renovation loan was approved, he would take a 20% commission if no renovation was carried out. On cross-examination, a similar question was asked, but this time, the appellant flatly denied that she had ever discussed splitting the loan money with Joe. 30When asked to explain the inconsistency between the two statements, the appellant denied that she had been asked such a question by the police or that she had given such an answer. I did not find this a very credible explanation given that her statement had been read back to her and she had declined to amend it. Instead, she confirmed it as true and correct by signing on each page. Counsel for the appellant then tried to get around this situation by arguing that her statement must be read in the context of all the statements she gave to the police, in which she maintained her intention to renovate her flat. As such, even if the appellant agreed to give Joe a 20% commission from the bank loan, this was not indicative of her guilt on the cheating charges. Again, I was not convinced by this assertion. There was no reason for the appellant to agree for Joe to take a 20% commission from the bank loan if the entire transaction was aboveboard. Moreover, the appellant’s statement to the police, which indicated that the loan moneys should be split 80%:20% with Joe, corresponded precisely to the distribution testified to by Joe in his examination-in-chief. 31Second, the police asked the appellant why Joe had to pay her any money from the OUB loan amount if renovation was at all intended. She replied that she did not really trust him and therefore decided to ask him for the money. In cross-examination, she denied having asked Joe for the money. As with the previous statement, the appellant denied that she had ever made the relevant statement to the police. Perhaps realising the futility of this argument, counsel for the appellant also submitted that such a statement, even if made, was not indicative of her guilt, since what she did with the moneys after the loan was granted was not conclusive of the fact that she had no intention of renovating the flat at the time she applied for the loans. I found this argument fallacious. As the trial judge noted, the appellant’s answer to the police lent credence to Joe’s version of the events, since there would be no reason for the appellant to ask Joe for the renovation money if she had in fact intended to renovate her home. 32Third, the appellant was asked by the police whether it was legal to obtain two renovation loans from two separate banks for only one renovation, and she replied that it was alright as long as she used the money to renovate her house. In court, she said that she had used the money to buy furniture for her flat after Joe had told her that it was alright to do so. The trial judge found that the appellant’s answer in her police statement contradicted her claim in court. I disagreed with the trial judge on this point. I did not think that a contradiction existed, as there was merit in the appellant’s argument that she was under the impression that purchasing furniture could be considered as renovation. To a layman, “renovation” of a house might merely entail “doing up” a house to make it look nice and this would include the buying of furniture as part of this process. Nevertheless, I found clear inconsistencies between the appellant’s police statement and her evidence in court on the totality of the evidence. As such, I found no reason to fault the trial judge for impeaching the appellant’s credit by virtue of her previous inconsistent statements under s 157 of the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”) and dismissed this ground of appeal.",
        "That the trial judge erred in accepting Joe’s version of events": "33Section 135 of the EA obviates the need for a court to warn itself of the danger of relying on accomplice evidence. Nevertheless, illustration (b) to s 116 of the EA provides that a court may presume an accomplice to be unworthy of credit and so treat his evidence with caution. The combined effect of s 135 and illustration (b) is that a court may convict an accused on the uncorroborated evidence of an accomplice, but should still treat the evidence with caution as the accomplice may be presumed to be unworthy of credit: Kwang Boon Keong Peter v PP[1998] 2 SLR 592. The court is merely required to scrutinise the accomplice’s evidence carefully. If the evidence is shown to be reliable from all the circumstances of the case, accomplice evidence should be given the same weight as any other evidence:Chua Poh Kiat Anthony v PP[1998] 2 SLR 713. 34The trial judge bore in mind the fact that Joe was an accomplice, but did not find his evidence unreliable, since he discerned no attempt by Joe to minimise his own involvement or exaggerate the appellant’s involvement. Instead, he found Joe to be a “credible and forthright” witness. I noted that this was a finding made with the benefit of having seen and heard Joe, and accorded it due weight. 35The appellant took issue with the trial judge’s treatment of the discrepancies in Joe’s evidence. She protested that his irregularities in evidence were not mere lapses in memory, but showed that Joe was lying in order to make out a more compelling case against her. I was not persuaded by her arguments. 36There were two main areas of discrepancy in Joe’s testimony. The first related to the dates and details of the administration of the loan applications. I agreed with the trial judge that these incongruities in Joe’s evidence could well be due to the fact that these incidents had taken place more than two years before the trial below, and that Joe’s memory of the details would inevitably have faded with the passing of time. Moreover, I was of the view that these variations in testimony pertained to minor and fairly unimportant details, which did not impinge on the overall picture which Joe painted of the appellant’s guilt. 37The second area of discrepancy in Joe’s testimony related to the way in which Joe had first met Rohaini. Joe testified that one Ismail from his police reservist camp had introduced Rohaini to him and that he had met Rohaini at a void deck in Clementi. Joe was unable to give Ismail’s full name or the name of the officer in charge of his camp unit, and the appellant pointed to this “evasiveness” as evidence that Joe did not want the court to find Ismail since the meeting had never taken place. I was not persuaded by this. Joe only served as a reservist for two weeks of each year and it was understandable that he might not be able to remember such minor pieces of information. 38When Ismail took the stand, he denied ever knowing Rohaini or introducing her to Joe. The appellant asserted that this was further evidence of Joe concocting lies to implicate Rohaini, since it would be more believable that Rohaini was involved in the scam if she had met Joe in his office rather than at a void deck. I was unable to follow the appellant’s line of reasoning in this regard. Furthermore, I was of the opinion that Ismail’s evidence should be viewed with caution since it might be motivated by his fear of being implicated in the scam. In any case, I found that the appellant was merely grasping at straws. Even if Joe’s evidence had been proved to be unreliable in these aspects, these details were immaterial to a finding of the appellant’s guilt. 39An overarching theme in the appellant’s submissions was that Joe had a motive to lie about her involvement in the cheating scam because he had an axe to grind with her. She testified that Joe had told her that if she made a police report against him, he would ensure that she went down with him. The trial judge dismissed this argument. Joe had already been dealt with and sentenced by the court for his role in the scam, and had nothing to gain by fabricating evidence against the appellant. There was no evidence that Joe wanted to wreak vengeance on the appellant. When questioned, Joe said that he had wronged her and that she had the right to demand her share of the loan amount from him. To my mind, the appellant had utterly failed to prove that there was any element of truth in her allegations against Joe. I therefore found no reason to overturn the trial judge’s finding in this regard.",
        "Conclusion": "40In closing, it may be useful to set out a portion of the judgment inTeo Ai Choo v Leong Sze Hian[1986] SLR 75at 79, [9], where the Court of Appeal said: In a case such as the instant case, where there were two directly contradictory versions the acceptance or rejection of which significantly depended on the oral testimony of the protagonists, the role of an appellate court is clear. We have to accord to the findings of fact of the trial judge the greatest respect and ought not to disturb them unless we are satisfied that the learned trial judge has reached a wrong decision and that in the context of this case “any advantage enjoyed by a trial judge by reason of having seen and heard the witnesses could not be sufficient to explain or justify the trial judge’s conclusion” … 41I found this observation very apposite to the situation before me. In essence, the appellant had signally failed to show me any evidence to overthrow the trial judge’s finding of fact that she knew what she was doing. As such, I dismissed the appeal against conviction. Appeal dismissed."
    }
}