{
    "case_title": "Keimfarben GmbH and Co KG v Soo Nam Yuen",
    "ncitation": "[2004] SGHC 145",
    "coram": "Judith Prakash J",
    "sections": {
        "Background": "1          Mr Soo Nam Yuen, the defendant in this action, was the plaintiff in a suit against Keim Mineral Paints Singapore Pte Ltd (“Keim Singapore”), his former employer, for wrongful termination of employment. He was successful in that action. To enforce the judgment granted to him, he issued a writ of seizure and sale against his employer’s assets. The seizure was carried out on 5 November 2001 and office equipment and substantial quantities of various types of paint were seized. The sheriff appointed 19 November 2001 as the date for the auction of the seized goods (“the first auction date”). On 12 November 2001 however, Keimfarben GmbH & Co KG (“Keimfarben”), the German manufacturer of the paint seized, put in a claim as owner of all the paint seized. The auction, therefore, had to be aborted. 2          The sheriff subsequently filed an interpleader summons for the court to determine who was entitled to the seized goods. In June 2002, the High Court directed that the interpleader summons be converted into a writ action. As a result, this action was started by Keimfarben in August 2002. It sought a declaration that it was the owner of the seized goods. Mr Soo counterclaimed for a declaration that the goods seized belonged to Keim Singapore. He also asked that Keimfarben be ordered to pay him damages. 3          The basis of Mr Soo’s claim against Keimfarben was that if it had not been for Keimfarben’s action in claiming title to the paint seized, the same would have been sold by public auction on the first auction date and the sale proceeds paid to Mr Soo. This auction had to be postponed until Keimfarben’s claim had been dealt with. The postponement caused Mr Soo loss. In his counterclaim, he particularised this loss as being the difference in the value of the seized goods on the first auction date and their value as at the date he obtained judgment against Keimfarben. In order to assess this loss, one of the orders asked for by Mr Soo in his counterclaim was that “a valuation be carried out to assess and determine the difference in value or costs of the seized paints and the seized office moveable property between 19thNovember 2001 and date of Judgment and the costs of such valuation to be paid by [Keimfarben]” (“the valuation order”). 4          The action was heard by Tay Yong Kwang J. On 11 April 2003, the judge dismissed Keimfarben’s claims and gave judgment in favour of Mr Soo on his counterclaim. A declaration was made that the goods seized by Mr Soo on 5 November 2001 were the property of Keim Singapore and thus the seizure was lawful. Further, the sheriff was directed to carry out the auction forthwith in order to effect the sale of the goods. The net proceeds of sale were to be paid to Mr Soo in part satisfaction of the judgment he had obtained against Keim Singapore. An order in terms of the valuation order was made and there was a further order for damages to be assessed. 5          The assessment of damages took place before the assistant registrar in November 2003. At its conclusion, Mr Soo was given judgment for the $450,355.35 claimed by him in the assessment which included interest. Keimfarben appealed against this award. I allowed the appeal and set aside the award. In its place, I awarded Mr Soo a sum of $5,000 as damages. Mr Soo has appealed against my decision.",
        "The basis of the original award": "6          The purpose of the assessment hearing was to obtain and test the evidence necessary to determine the value of the seized goods on the first auction date. 7          Mr Soo was the only witness at the assessment hearing. In his affidavit of evidence-in-chief, he stated that the public auction of the goods seized by the sheriff was held on 26 May 2003 (“the actual auction date”). All the goods were sold. The sum of $25,000 was received as proceeds from the sale of all the paint materials and the sum of $20,000 was received as proceeds from the sale of all the other moveable property. The total sum realised by sheriff was $45,000. 8          Mr Soo went on to say that after he had learnt of the first auction date, he wrote to a company called Sui Hup Industries Sdn Bhd in Selangor, Malaysia (“Sui Hup”) to enquire whether Sui Hup was interested in buying the paint materials to be auctioned. Sui Hup was the Malaysian agent for Keim Singapore. Mr J S Lim of Sui Hup replied on the same letter, offering to buy the paint and fixing the maximum unit prices that he was agreeable to. A copy of this letter was attached to Mr Soo’s affidavit. 9          Mr Soo then stated that he was claiming as damages, the difference in the prices of the paint materials between the first auction date and the actual auction date. If the auction had been conducted on the first auction date, the value of the paint would have been $416,650.80. This value was based on the list of the types and quantities of paint seized and the offer made by Sui Hup. Mr Soo said that Goods and Services Tax (“GST”) (which at 3% came up to $12,499.52) had to be added and that the total sum payable by Sui Hup would have been $429,150.32. The amount realised for the paint at the auction was $25,000 and when GST (at 4%) was added, the total amount was $26,000. The difference between the value of the paint on the first auction date and its value on the actual auction date was therefore $403,105.32. With interest calculated at the rate of 6% per annum on $429,150.32 for the period from the first auction date to the actual auction date, his total loss in respect of the paint was $442,161.85. 10        Mr Soo also dealt with his loss in respect of the other moveable property seized. These items realised $20,000 at the auction. GST of $800 had to be added to this figure. Mr Soo believed that if these items had been sold on the first auction date, a better price would have been realised. He estimated that the items had depreciated in value by 20% and accordingly his loss was $6,302.69 (20% of $20,800 divided by 365 days and multiplied by 553 days being the length of the period from the first auction date to the actual auction date). He also asked for interest on the total amount of $27,102.69 for the period. He stated, therefore, that his loss inclusive of interest at 6% per annum was $8,193.50. Adding up the figures for the paint and the other items, Mr Soo arrived at $450,355.35 as his total loss. 11        Counsel for Keimfarben in his submissions before the assistant registrar objected to the court relying on the letter from Sui Hup. He pointed out that the valuation order had been made for the purpose of determining the value of the seized goods as on the first auction date. Mr Soo had not complied with this order. He had not obtained any valuation of the seized goods. Instead, he tendered a document, the existence of which was not made known to Tay J at any time, and was asking the court to rely on that document as a valuation. The court had not been assisted by an expert valuer as it was entitled to be. The document from Sui Hup was just a fax and was very flimsy evidence of the value of the paint on the first auction date. Mr Soo had not substantiated the loss relating to the difference in the price of the paint nor had he given any expert evidence on how the value of the seized goods had depreciated over the relevant time period. 12        The assistant registrar rejected Keimfarben’s submissions. While she agreed that Mr Soo had not complied with the valuation order when he carried out an auction of the goods in May 2003 without conducting a fresh valuation, she found that Keimfarben had acquiesced in this non-compliance. She found that Keimfarben knew that the valuation had not been carried out. The valuation order directed Keimfarben to pay the cost of the valuation and therefore had there been a valuation, Keimfarben would have been consulted on the process and asked to pay the fees. It would have been kept abreast of matters relating to the enforcement of the order of court. Secondly, she did not agree that Mr Soo should have disclosed the existence of the Sui Hup offer to the judge hearing the interpleader summons in December 2001 or thereafter, or that he should have applied to sell the goods. Sui Hup had offered a price that was 50% to 60% lower than the list price of the goods and therefore, even if an application for sale had been made, it would not have succeeded. Finally, the assistant registrar found that the offer from Sui Hup was credible evidence of the price of the paint on the first auction date. The offer showed that Sui Hup had committed itself to paying the stated price and had appointed Mr Soo’s brother to act as its agent in the auction. As for the price of the moveable property, apart from arguing that Mr Soo should have carried out a valuation, his assessment of a 20% per annum depreciation in the value of the same between November 2001 and May 2003 was not challenged. The assistant registrar found that, in any event, this was a fair figure. As such, judgment was granted to Mr Soo for the claimed amount.",
        "The appeal": "13        The main issue in the appeal was the weight, if any, to be given to the Sui Hup offer. That was the only evidence that Mr Soo had produced of the value of the paint in November 2001. To me, that evidence was plainly hearsay and thus inadmissible. The maker of the offer was not present in court to confirm that the written offer produced had been made in those terms, on the date it was supposed to have been made or that it was a genuine offer from Sui Hup rather than from anybody else and that the prices indicated were what Sui Hup was indeed prepared and would have been able to pay had the auction proceeded on the first auction date. The written offer was hearsay because it was made by a third party and was tendered in order to establish the truth of its contents (iethat on the first auction date, the various types of paint seized had a market value equivalent to the prices offered for them by Sui Hup). 14        InEvidence, Advocacy and the Litigation Process(2nd Ed, 2003) by Jeffrey Pinsler, it is stated at p 69: It is a fundamental principle that evidence adduced to prove a fact must be reliable. Therefore, a witness who gives oral evidence must generally testify as to what he himself directly perceived, rather than to facts in issue or relevant facts which were perceived by other persons and which were recounted to him.Similarly, a document adduced to establish the facts it refers to in the absence of direct evidence would be generally inadmissible. This principle is embodied primarily by the hearsay rulewhich also seeks to ensure that only the best evidence is put before the court. This means that if only indirect evidence is available, it can only be admitted pursuant to an exception to the hearsay rule and only then if the party adducing the evidence can show why he is unable to secure direct evidence. [emphasis added] Section 61 of the Evidence Act (Cap 97, 1997 Rev Ed) (“the Act”) provides that all facts may be proved by oral evidence and s 62 states that oral evidence must be direct. The Court of Appeal inSoon Peck Wah v Woon Che Chye[1998] 1 SLR 234commented that in Singapore the rule against hearsay is reflected in s 62 of the Act. Further, s 32 of the Act makes it clear that in the absence of the maker in court, a written or oral statement of relevant facts can only be admitted if the party seeking to adduce that statement can bring it within one of the exceptions set out in s 32. 15        In the present case, only the written offer of Sui Hup was produced. As stated, it was hearsay. No attempt was made by Mr Soo to establish facts that would allow the operation of one or more of the exceptions set out in s 32, thus rendering the offer admissible despite the absence of the maker of the document. In any case, in view of the circumstances in which the offer was made, it would have been difficult for Mr Soo to bring the document within one of the classes set out in sub-paras (a) to (h) of s 32. The document could only have been admitted had the maker turned up to substantiate it. 16        Section 169 of the Act is also relevant in this connection. It states: The improper admission or rejection of evidence shall not be ground of itself for a new trial or reversal of any decision in any case if it appears to the court before which such objection is raised that, independently of the evidence objected to and admitted, there was sufficient evidence to justify the decision, or that, if the rejected evidence had been received, it ought not to have varied the decision. Thus, the fact that hearsay evidence may be improperly admitted will not be a ground for overturning a decision based on it, if there was sufficient admissible evidence to justify that decision. In this case, the difficulty was that the hearsay evidence relied on was the only evidence adduced to establish the value of the paint in November 2001. Without the Sui Hup offer, there would have been no evidence of such value. 17        Whilst Mr Soo was asked various questions about the Sui Hup offer by counsel for Keimfarben during the hearing and submissions were made as to the relevance and weight of the offer, counsel did not expressly object to its admission on the ground that it was hearsay. The parties appear to have regarded it as being admissible. I took a different view. I was also of the opinion that the failure to object to the Sui Hup letter on the ground of hearsay did not prevent an objection to it on that ground being made during the appeal before me. First, the appeal operated by way of a rehearing and my jurisdiction was supervisory and not appellate in the true sense. Second, as stated at p 157 ofEvidence, Advocacy and the Litigation Process(at [14]supra), as the provisions of the Act are mandatory, hearsay cannot be admitted even if there is a failure to object to it. If the trial court has wrongly admitted hearsay evidence, the appellate court may consider this ground of appeal even though no objection to it was made in the court below. 18        In my judgment, there was no evidence before the assistant registrar to support a finding that the paint was worth $416,650.80 (excluding GST) on the first auction date. There was no evidence before her at all as to the value of the paint on that date. There was no basis on which she could conclude that if the paint had been sold on the first auction date, it would have fetched anything more than the $25,000 that it fetched when sold on the actual auction date. There was not even any evidence that the quality of the paint would have depreciated between the two dates and that this would have affected its value. Thus, there was no basis on which Mr Soo’s claim for a loss of $403,105.32 in respect of the paint could be supported. 19        As regards his loss in respect of the other items seized, it was only Mr Soo’s estimate that these items had depreciated in value by 20% per annum during the period between the two auction dates. Mr Soo was a businessman dealing in paint. He was not in the business of selling the type of office equipment which comprised the other items seized. There was no evidence of any expertise on his part that would qualify him to give evidence on the yearly depreciation of such items during the period in question. I, therefore, could not accept his quantification of his loss in respect of those items either. It was held in the case ofThe Pioneer Glory[2002] 1 SLR 265that on the issue of the extent to which there has been a fall in the value of goods during a period of detention, it is necessary that the court acts with the assistance of expert witnesses. In this case, Mr Soo failed to provide the expert witnesses that the court needed in order to assess his claim and he had to bear the consequences of such failure. 20        For the above reasons, I set aside the award made by the assistant registrar. The only evidence available as to the value of the items seized was that adduced as to the sale prices obtained at the actual auction. On the basis that those same prices would have been obtained on the first auction date, (I noted that Mr Soo himself had bid for the paint at the actual auction, though on behalf of third parties) Mr Soo would have received $45,000 in November 2001 had the auction not been stopped by the lodging of Keimfarben’s claim. Mr Soo could have put that money to use. He had suffered a loss which I quantified as being $5,000 which was interest on $45,000 at the rate of 6% per annum for the period from the first auction date to the actual auction date, in addition to a sum of approximately $1,000 to represent the nominal depreciation in value of the seized items during that period. I therefore awarded him this amount instead of the sum awarded by the assistant registrar.",
        "Other comments": "21        The assistant registrar considered that Keimfarben had acquiesced in the failure to conduct a valuation. She inferred that because Keimfarben was liable for the cost of the valuation, it would have to be consulted and kept abreast of matters relating to the valuation and that since no consultation took place, it must have known that there had been no valuation. Yet, it did not inform Mr Soo that it would be objecting to the lack of a valuation. In this connection, I accept the submission of counsel for Keimfarben that there was nothing in Tay J’s order that made it necessary for Mr Soo to consult Keimfarben on matters pertaining to the valuation. To prove his damage, the order only required Mr Soo to conduct a valuation before he sold the goods. It was up to Mr Soo to send Keimfarben the bill for the valuation and the time that he chose to do so was also up to him. In these circumstances, it was not logical to infer that since Keimfarben had not been asked to pay for the valuation by the time of the auction, it should have known that no valuation had been effected. It was noteworthy that until 6 November 2003 (only 12 days before the hearing), when he filed his affidavit of evidence-in-chief for the purposes of the assessment, Mr Soo had not disclosed the existence of the offer from Sui Hup to Keimfarben. It could not have anticipated, therefore, that Mr Soo would rely on that offer rather than on a valuation for the purposes of the assessment. During the assessment, Keimfarben, through its solicitors, objected to and challenged the lack of the valuation. Also, the burden of proving his loss always lay on Mr Soo and Keimfarben did not have to prove anything. Rather, its role was to, as far as it was able, challenge Mr Soo’s evidence and it could do this in any way legally available to it. In these circumstances, there can be no issue of acquiescence on the part of Keimfarben. 22        It was clearly contemplated by the valuation order that the damages would be assessed on the basis of the expert valuation which would be effected pursuant to the order. It is worth emphasising that the valuation order was made in the exact terms asked for by Mr Soo in his counterclaim. When that counterclaim was drafted, his solicitors would have had regard to the law on assessment of damages and would have considered that the court would need the assistance of an expert to assess the damages. Having obtained an order in terms for the provision of such assistance, Mr Soo should have obtained the valuation and used it for purposes of the assessment instead of trying to rely on other evidence. 23        Finally, I should mention that at the commencement of the appeal hearing, counsel for Keimfarben made an application for further evidence to be admitted. The main evidence to be adduced was a further letter signed on behalf of Sui Hup but written by an officer of Keimfarben after he had had a discussion with Mr J S Lim on the circumstances which had led to the making of the Sui Hup offer. I dismissed that application on the basis that the evidence sought to be admitted was as much hearsay as the Sui Hup offer itself."
    }
}