{
    "case_title": "Roslan Bin Abdul Rani v Public Prosecutor",
    "ncitation": "[2004] SGHC 121",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Background": "2          The appellant and one Razali bin Yusoff (“Razali”), were arrested after an undercover sting operation by the Central Narcotics Bureau (“CNB”) involving a transaction (“the transaction”) for the sale of one sachet of heroin (“the drugs”) for $650 by Razali to two CNB undercover officers. The sachet of heroin was analysed by the Health Sciences Authority to contain 0.29g of the Class A controlled drug, diamorphine. Razali was subsequently charged and convicted for offences under the Act. It was the Prosecution’s case that the appellant had earlier sold the drugs to Razali. 3          The transaction was to take place between Razali and the two undercover CNB officers, Corporal Karathigayan (“PW5”) and Corporal Iskandar (“PW6”), near the Petir Light Rapid Transit (“LRT”) station at an arranged meeting on 27 February 2003. Unbeknownst to Razali, five other CNB officers were keeping watch on them. 4          Upon meeting PW5 and PW6, Razali told them that he had to collect the drugs and asked for payment, whereupon he was told to deliver the drugs first. Razali then walked towards the Petir LRT station, where he was observed by Sergeant Eugene Eng (“PW7”) and Corporal Michelle Tan (“PW8”) pacing near the entrance of the station for approximately 15 to 20 minutes. 5          Razali then went up onto the platform of the station, where he was seen by PW7 having a conversation with the appellant. Shortly thereafter, PW8 saw the appellant and Razali having another conversation near the exit of the station. Razali and the appellant then parted company. Both the appellant and Razali later confirmed that they had met at the station and had a short conversation, and that they had not met anyone else apart from each other. PW7 and PW8 testified that they had not managed to keep a continuous eye on Razali and/or the appellant, as they were watching them from a distance. 6          As Razali walked back to PW5 and PW6, PW8 observed the appellant pacing up and down near the roadside by the LRT station. Razali reached PW5 and PW6 and handed the drugs to them. At this point, the CNB officers moved in and arrested Razali. The appellant attempted to leave the scene, but the CNB officers gave chase and successfully apprehended him. 7          On the day of the arrests, there were 13 telephone calls between the appellant and Razali; nine were made from Razali’s mobile phone, and four were from the appellant’s. Eleven of these calls were made before the transaction took place. Records of the phone calls made by both the appellant and Razali (from their respective mobile phone service providers) were admitted into evidence as P9 and P2 respectively.",
        "The Prosecution’s case": "8          The gist of the Prosecution’s case was that the appellant had given the drugs to Razali for an agreed price of $600 when they met at the Petir LRT station. At the trial, Razali’s evidence formed the backbone of the Prosecution’s case. 9          Razali had been asked by one “Talib” (a police informant) to procure the drugs on the morning of 27 February 2003. Razali called the appellant on his mobile phone at 10.36am to inquire whether the appellant would be able to procure the drugs. At 6.21pm, Razali called the appellant again, and the appellant informed him that he might be able to “get the stuff” for Razali. At 7.11pm, the appellant called Razali to inform him that he was able to procure the drugs for $600. During this phone call, the appellant and Razali had arranged to meet at the Petir LRT station for the sale of the drugs. 10        Razali then called Talib to say that he was able to procure the drugs for $650, and asked to meet Talib at the Petir LRT station. Talib persuaded Razali to transact the deal with Talib’s friends instead. Razali agreed and met PW5 and PW6 at the Petir LRT station between 7.45pm to 8.00pm. As mentioned, Razali then left PW5 and PW6 to collect the drugs. Between 8.07pm and 8.20pm, there were four telephone calls between Razali and the appellant. Razali testified that he had called the appellant during this time to inform him that Talib’s friends had arrived for the drugs. The appellant replied that he was on his way and Razali went up to the LRT platform to wait for the appellant. 11        The appellant arrived and went to the ground level of the LRT station with Razali. There, the appellant passed Razali the drugs and asked for payment. Razali informed the appellant that payment had not yet been received, and walked back to PW5 and PW6 to collect the money while the appellant waited. As mentioned, Razali was arrested after he handed the drugs to PW5 and PW6. 12        There was a commotion upon Razali’s arrest and PW8 saw the appellant cross the road hurriedly in order to get away. PW7 gave chase and shouted “Police, don’t run”, but the appellant continued running. PW7 finally caught the appellant and handcuffed him after some resistance. PW8 and three other officers arrived at the scene to render further assistance and completed the arrest. 13        As such, the Prosecution contended that the appellant had committed an offence under s 5(1)(a) of the Act, which provides that it is an offence to traffic in a controlled drug. To “traffic” is to “sell, give, administer, transport, send, deliver or distribute”: s 2 of the Act.",
        "The Defence": "14        The appellant denied the charge. During police investigations, he maintained his innocence in both his long statement and cautioned statement. 15        He explained that he had met Razali by chance at the Petir LRT station. He had run from the CNB officers because he was late for work and was trying to catch a taxi. He denied that he had continued to run when told to stop, claiming that he did stop and did not resist arrest. 16        The appellant’s lawyer suggested that Razali was trying to “save” the true source of the drugs by placing the blame on the appellant, and proceeded to attack the inconsistencies in Razali’s evidence and the evidence of the CNB officers.",
        "The decision below": "17        The district judge recognised that the case against the appellant hinged upon the testimonies of the witnesses. After considering the following, he found that the Prosecution had proved its case against the appellant beyond reasonable doubt: (a)        The appellant’s evidence: The district judge concluded that there were several inconsistencies and improbabilities in the appellant’s testimony or version of events, which rendered it unsafe for his testimony to be relied upon. (b)        The appellant’s long statement:[1]The district judge accepted that the appellant was the author of all the information contained therein, and that he had been able to communicate effectively in English in the making of the statement. As such, the district judge rejected his attempt at trial to retract portions of the long statement that tended to expose discrepancies in his defence. (c)        Razali’s evidence: The district judge took cognisance of the fact that there were some discrepancies here but held that these were insufficiently material to discredit Razali’s testimony.",
        "The appeal against conviction": "18        The question before me was whether the district judge was right in preferring the Prosecution’s version to the appellant’s. In answering this question, I reminded myself of the principle that an appellate court is reluctant to overturn a trial judge’s finding of fact, especially where it hinges upon an assessment of the credibility and veracity of the witnesses, as it does not have the advantages of seeing and hearing the witnesses:Yap Giau Beng Terence v PP[1998] 3 SLR 656,Ameer Akbar v Abdul Hamid[1997] 1 SLR 113,Kong See Chew v PP[2001] 3 SLR 94. Interference would be warranted only if the district judge was plainly wrong in her assessment of the witnesses, thus rendering the verdict against the weight of the evidence:Garmaz s/o Pakhar v PP[1995] 3 SLR 701,Syed Jafaralsadeg bin Abdul Kadir v PP[1998] 3 SLR 788,PP v Victor Rajoo[1995] 3 SLR 417.",
        "The appellant’s credibility": "19        The district judge was aided in her decision by independent evidence in the form of the telephone records, which demonstrated that the appellant and Razali were in telephone contact throughout the day on 27 February 2003. The appellant’s incredible explanation for these calls was an important factor in the district judge’s assessment of his credibility. 20        The appellant had attempted to distance himself from Razali during the trial by testifying that they had only met by chance once in 2002 after a long break of ten years, and likewise that their next meeting on 27 February 2003 at the Petir LRT station was a complete coincidence. Yet, on 27 February 2003, there were 11 phone calls between them prior to the arrests. Seven of these calls were within an hour of their “chance” meeting. 21        According to the appellant, the majority of the calls focused on Razali’s employment prospects with the appellant’s company. I found it highly unlikely that such a numerous number of relatively short phone calls were required for this purpose. As such, I found it difficult (as did the district judge) to believe the appellant’s assertion that their meeting at the Petir LRT station was not arranged. 22        Also, the appellant’s long statement contained two major inconsistencies with his own version of events at trial. The appellant had stated in his long statement that “sometime [sic] I would run into [Razali] in Bukit Panjang as he also stay [sic] in the vicinity”. The appellant’s assertion at trial that their “chance” meeting was the second time he had seen Razali in ten years was inconsistent with this. The second inconsistency was his assertion in his long statement that, “I wish to say that on 27.02.2003, I did not receive or answer any call from [Razali].” However, at the trial, he admitted to the phone calls between Razali and himself upon being confronted by the telephone records. 23        The appellant tried to explain away the inconsistencies between his long statement and the version of events he presented at trial by simply stating that certain portions of the long statement were not made by him. He also claimed that most of the time during the recording of the long statement, he could not understand what the recording officer was saying to him in English. The district judge rightly rejected the appellant’s explanations. The appellant had admitted that he had made the long statement voluntarily and only started to claim that certain portions of it were inaccurate when cross-examined on the inconsistencies. The appellant’s colleagues also gave evidence that they had communicated with him in English on a daily basis. 24        I was therefore in full agreement with the district judge that the appellant was not a credible witness.",
        "Razali’s credibility": "25        Razali was the appellant’s accomplice. Illustration (b) to s 116 of the Evidence Act (Cap 97, 1997 Rev Ed) (“the EA”) states that “[t]he court may presume that an accomplice is unworthy of credit and his evidence needs to be treated with caution”. The district judge was mindful of this but nevertheless found Razali to be a credible witness whose evidence could be relied on. The law allowed the district judge to do this, as the presumption under illustration (b) to s 116 of the EA is not a mandatory but permissive one, and its operation depends on the totality of the circumstances. InChai Chien Wei Kelvin v PP[1999] 1 SLR 25at [52], I held: Whether or not the court should believe the evidence of the accomplice depended on all the circumstances of the case and the evidence must be tested against the objective facts as well as the inherent probabilities and improbabilities; but where the court did not discern any attempt by the accomplice materially to minimise his own involvement or exaggerate that of the accused and his evidence was found to be consistent as a whole and reliable on a review of the whole evidence, there was no reason why the evidence should be treated as unreliable. 26        I was of the view that it was a tenuous suggestion by the appellant that Razali would implicate him in order to shield his real drug supplier. The appellant himself had testified that he and Razali were on friendly terms and that there was no unhappiness between them. I was also of the view that Razali had no reason to minimise his own involvement in the offence, since he had already been convicted and sentenced at the time of the hearing for the appellant. 27        The district judge considered the discrepancies that arose in Razali’s evidence. These related mainly to the timings of the telephone conversations with the appellant and Talib concerning the transaction for the sale of the drugs. I agreed with the district judge that the questions of whether Razali had correctly recalled the timings of the calls during which the arrangements for the transaction were made, and whether he had correctly recalled the arranged meeting time as 7.00pm, were simply not critical to the key finding of fact that Razali had indeed arranged to meet the appellant on 27 February 2003 for the supply of drugs. 28        The approach of the district judge in this respect was consistent with the traditionally broad approach of our courts in assessing a witness’s credibility:Khoon Chye Hin v PP[1961] 1 MLJ 105,Samad bin Kamis v PP[1992] 1 SLR 340,PP v Kalpanath Singh[1995] 3 SLR 564andSundara Moorthy Lankatharan v PP[1997] 3 SLR 464,Lim Teck Chye v PP[2004] SGHC 72. InAng Jwee Herng v PP[2001] 2 SLR 474, I recognised and accepted that human fallibility in observation, retention and recollection was oftentimes inevitable in the evidence of a witness. The telephone records for 27 February 2003 show that there were 13 calls between the appellant and Razali, and 25 calls between the appellant and “Talib”. Taking into consideration the numerous other calls Razali made on the same day, some of which he admitted were also made in the course of sourcing for drugs, it was not surprising that Razali had confused the timings and the contents of individual phone calls under cross-examination. The district judge was therefore entitled to determine that Razali’s testimony was credible despite the discrepancies:Jimina Jacee d/oC D Athananasius v PP[2000] 1 SLR 205. 29        The appellant therefore failed to convince me that the district judge had been plainly wrong in regarding Razali as a credible witness.",
        "The credibility of the CNB officers": "30        The appellant also highlighted certain discrepancies in the CNB officers’ testimonies at trial. These related to the manner in which the appellant had been arrested on 27 February 2003. In brief, the alleged discrepancies were that: (a)        PW7 had stated that PW8 had assisted him to handcuff the appellant, whereas PW8 stated that PW7 had already handcuffed the appellant by the time she reached them; and (b)        PW7 had stated that the appellant had refused to be handcuffed, whereas he had also stated that upon identifying himself as a CNB officer, the appellant had allowed himself to be handcuffed. PW8 gave evidence that she did not observe any struggle. However, another CNB officer, Sergeant Kannan, gave evidence that when PW7 caught up with the appellant, the appellant put up a struggle and refused to be handcuffed. Sgt Kannan also saw PW8 assisting PW7 in handcuffing the appellant. 31        In relation to the first alleged discrepancy, I was of the view that PW7’s evidence and PW8’s evidence were not entirely inconsistent in view of the fact that PW7 had already handcuffed one of the appellant’s hands by the time PW8 caught up with him. In relation to the second alleged discrepancy, it was likely that having already been handcuffed on one hand, the appellant then stopped struggling while PW8 assisted PW7 to handcuff the appellant’s other hand in order to complete the arrest. The sequence of events leading up to the arrest would also have been fast-paced, and it was understandable for PW7 and PW8’s respective accounts to have diverged at some points. The appellant himself was not entirely certain of the manner in which he was arrested, or whether force had been used on him. It was therefore defensible for the district judge to have concluded that “the discrepancies in the testimonies of the CNB officers simply showed that they did not tailor their testimonies to give an identical account of what transpired on 27 February 2003”. 32        The district judge had one further reason to treat PW7 and PW8 as candid and credible witnesses. This was the fact that PW7 and PW8 had been entirely forthcoming about the fact that they did not manage to keep a continuous eye on Razali and the appellant at the Petir LRT station. As such, they were not perceived as witnesses who were disposed to embellishing their evidence in order to assist the Prosecution’s case. 33        I was therefore of the view that the CNB officers were not wrongly regarded as credible witnesses. 34        Thus, the district judge was fully entitled to prefer the version from the Prosecution in convicting the appellant. The appellant failed to show that the district judge’s findings of fact were against the weight of the evidence such that the verdict was unsafe and appellate intervention was warranted:Chua Yong Khiang Melvin v PP[1999] 4 SLR 87. Accordingly, I dismissed the appeal against conviction.",
        "The appeal against sentence": "35        No specific grounds were raised by the appellant in relation to his appeal against sentence. InOng Ah Tiong v PP[2004] 1 SLR 587, I reiterated that an appellate court may only interfere with sentence if it is satisfied that (a) the sentencing judge made the wrong decision as to the proper factual basis for the sentence; (b) there was an error on the part of the trial judge in appreciating the material placed before him; (c) the sentence was wrong in principle; or (d) the sentence imposed was manifestly excessive or inadequate:Tan Koon Swan v PP[1986] SLR 126,Lim Poh Tee v PP[2001] 1 SLR 674. 36        None of the conditions in the above limbs were present in this case. The offence of trafficking carries a minimum mandatory sentence of five years’ imprisonment and six strokes of the cane. The appellant had claimed trial. He had previously been sent to a drug rehabilitation centre and has antecedents. The sentence awarded of six years’ imprisonment and six strokes of the cane was in line with the relevant sentencing benchmarks. I therefore saw no reason to interfere with the district judge’s sentencing decision. 37        In the result, I dismissed the appeal against sentence. Appeals against conviction and sentence dismissed. [1]P15"
    }
}