{
    "case_title": "Ong Ah Tiong v Public Prosecutor",
    "ncitation": "[2004] SGHC 11",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The undisputed facts": "2          The appellant was the managing director of Hi-Star Multimedia Pte Ltd. He was the sole partner actively involved in running the business, the other two being sleeping partners. 3          On 25 March 2003, a sergeant from the Intellectual Property Rights Branch of the Criminal Investigation Department, together with a party of police officers, acted on information to raid Hi-Star Multimedia Pte Ltd. The appellant and two other accomplices were on the premises at the time. The premises were searched and the following articles seized: Number of pieces       Item 16,150                         PlayStation memory cards 2,541                           PlayStation game controllers 23,515                         Gameboy casings 255                              DVD ROMs 6,841                           Gameboy cartridges Unknown                     Nintendo packaging covers Unknown                     PlayStation packaging covers 4          The appellant admitted that he began to import these counterfeit articles some five to six years ago for sale in both local and overseas markets. He employed two men to assist in the sale of these items. The appellant did not deny knowing that the seized items were counterfeit articles or that he intended to trade in them.",
        "The decision below": "5          Altogether, six charges were brought against the appellant. He was convicted on the first three charges and admitted to the offences contained in the other three similar charges, which were taken into consideration for the purposes of sentencing. The first five charges related to the appellant’s offence of having counterfeit articles in his possession for the purpose of trade, as caught by s 49(c) of the TMA, which provides that: Any person who has in his possession for the purpose of trade or manufacture, any goods to which a registered trade mark is falsely applied shall … be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 for each goods or thing to which the trade mark is falsely applied (but not exceeding in the aggregate $100,000) or to imprisonment for a term not exceeding 5 years or to both. 6          The sixth charge dealt with the possession of infringing copies of copyrighted materials for the purposes of sale, in contravention of s 136(2)(a) of the Copyright Act (Cap 63, 1999 Rev Ed), which reads: A person who at a time when copyright subsists in a work has in his possession or imports into Singapore any article which he knows, or ought reasonably to know, to be an infringing copy of the work for the purpose of selling, letting for hire, or by way of trade offering or exposing for sale or hire, the article shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 for the article or for each article in respect of which the offence was committed or $100,000, whichever is the lower, or to imprisonment for a term not exceeding 5 years or to both. 7        The infringing articles covered by each charge were, respectively: 1st charge:   8,056 pieces of Nintendo game cartridges 2nd charge:  1,255 pieces of Sony Playstation 2 (“PS2”) game controllers; 5 pieces of Sony Playstation 1 (“PS1”) (non-analogue) game controllers; 5 pieces of PS1 (analogue) game controllers; 977 pieces of PS1 (dual shock) (analogue) game controllers and 16,151 pieces of PS1 memory cards 3rd charge:  1,255 pieces of PS2 game controllers; 5 pieces of PS1 (non-analogue) game controllers; 5 pieces of PS1 (analogue) game controllers 4th charge:   1,255 pieces of PS2 game controllers 5th charge:   250 pieces of Electronic Arts Inc game cartridges 6th charge:   171 copies of Sony Computer Entertainment Action Reply (2) (CD-Rom with relay card) and 79 copies of Sony Computer Entertainment DVD Region X (CD-Rom with card). 8          The trial judge noted that the circumstances in which the offences were committed were aggravating. The total number of infringing articles involved came up to 26,449 items, far exceeding those in the sentencing precedents before him. He found that as managing director and the only active partner of the company, the appellant had played a significant role in the commission of the offences. Moreover, the appellant was not just a small retailer, but a reasonably large-scale distributor of the counterfeit items, at the upper end of an organised operation that involved two accomplices working under him. Furthermore, the infringing articles involved popular items like Nintendo Gameboy cartridges and Sony PlayStation accessories. 9          For these reasons, the trial judge considered that the offences committed by the accused were grave in nature, as reflected in the maximum punishment prescribed by law for an offence under s 49(c) of the TMA. He considered the question of public interest as well as our government’s strong efforts to promote Singapore as a regional intellectual property centre, and concluded that a deterrent sentence was warranted in this case.",
        "The appeal": "10        Before adverting to the evidence that was before the trial judge and the additional arguments brought before me, I reminded myself of the limited function of an appellate court faced with an appeal against sentence. An appellate court may only interfere if it is satisfied that (a) the sentencing judge made the wrong decision as to the proper factual basis for sentence; (b) there was an error on the part of the trial judge in appreciating the material placed before him; (c) the sentence was wrong in principle; or (d) the sentence imposed was manifestly excessive:Tan Koon Swan v PP[1986] SLR 126,Lim Poh Tee v PP[2001] 1 SLR 674. 11        This appeal was brought on the fourth ground, that the sentence of 32 months imposed on the appellant was manifestly excessive in light of the trial judge’s failure to consider or consider adequately the facts of the case, all the mitigating factors and the relevant sentencing precedents. 12        I turn now to the issues raised upon appeal.",
        "Aggravating factors": "13        The appellant took issue with various aggravating factors that the trial judge noted when coming to his decision on sentence. 14        I accepted the appellant’s contention that the total number of infringing articles involved was only 25,234 and not the number of 26,449 arrived at by the trial judge. Nevertheless, I considered that this relatively slight difference in number was immaterial for sentencing purposes. 15        The appellant argued that there was no evidence supporting the conclusion that he was a large-scale distributor of the counterfeit items, as the items seized had been accumulated over a period of five to six years. I was not convinced by this argument. Regardless of the period over which the items were accumulated, the fact remained that a large number of items, which the appellant admitted to acquiring with the intention of selling, were amassed and found in his shop. In response to the appellant’s further argument that there was no evidence of him selling the items at the time of the raid, I can only point him to s 49(c) of the TMA under which he was charged. The section clearly states that the appellant was charged with possession for the purpose of trade, and the appellant himself admitted that there was that requisite purpose. 16        In addition to this argument, counsel told the court that the appellant intended to re-export the articles in order to recoup his losses. In my view, this could only be construed as an admission that the appellant had a recent intention to trade in the articles. Further, as the trial judge succinctly noted, Singapore is a prominent business hub with a reputation for upholding intellectual property rights. It is manifestly in the public interest to deter potential criminals who are inclined to use Singapore as a distribution centre or a base for transhipment of counterfeit products to neighbouring countries. I therefore agreed with the sentiments of the trial judge that the appellant’s intention of re-exporting the counterfeit items rather than of selling them in Singapore was not of any mitigating value whatsoever. 17        The appellant further alleged that there was no basis for the trial judge’s conclusion that the items involved were popular items, since they were old stock bought over two years ago, and were obsolete and not saleable. In my understanding, both the old Gameboy cartridges as well as the Sony PS1 memory cards and game controllers are backward compatible – that is, these older accessories can still be used in newer models of the Gameboy handheld and the Sony PlayStation. For this reason, although I accepted the premise that the industry dealing in counterfeit items is generally characterised by its ability to offer the newest and latest goods in its field ahead of the retail market, I was not convinced that the items in the appellant’s possession would have been entirely unsaleable. 18        The appellant also sold genuine electronic products in his shop and the trial judge found this arrangement to be a convenient cover for his illicit activities since it would make detection of the appellant’s offences more difficult. To my mind, this was a logical and reasonable inference to draw from the facts, and I found no reason to disturb the finding.",
        "Overlapping charges": "19        This court held inPP v Mok Ping Wuen Maurice[1999] 1 SLR 138 that it is in the court’s discretion whether or not to consider outstanding offences upon sentencing. If the court does consider them, then the effect of this is to enhance the sentence that would otherwise be awarded. The trial judge acted on this authority to justify the imposition of a longer sentence on the appellant. 20        On appeal, the appellant canvassed the argument that the trial judge had failed to consider the overlapping items in the second and third charges, as well as in the second, third and fourth charges. All these charges included 1,255 pieces of the PS2 game controller, which had three trade marks applied to each piece. The second and third charges dealt with infringement of the “PS” and “PlayStation” word marks, whilst the fourth charge dealt with infringement of the “Dual Shock” device mark. 21        In my opinion, this was a non-issue. Although the items in the second and third charges overlapped, the trial judge ordered the sentences for these two charges to run concurrently. There was therefore no reason for the appellant to argue that the overlap between the charges lengthened his sentence. Further, although the trial judge considered the other three outstanding offences when deciding on what sentence to award, it was not clear to me that the items in the fourth charge had a significant influence on the length of the sentences awarded. Rather, when I considered the sentencing precedents, I was of the view that the sentences awarded were not manifestly excessive even if the three outstanding offences had not been taken into consideration. As such, I found this argument to be wholly without merit.",
        "Sentencing considerations": "22        For the purposes of this appeal, I found it instructive to consider the legislative intention behind the punishment provisions for trade mark infringement. In his speech introducing the Trade Marks (Amendment) Bill, the Minister for Law explained that the Bill was meant to “provide greater protection for trade marks against infringement and against sale of counterfeit products” and to “provide more severe penalties for the sale of counterfeit goods to protect the rights of owners of those goods who have invested heavily in research, design, production and marketing”. Following the bill, s 73 of the Trade Marks Act (Cap 332, 1985 Rev Ed) was amended to prescribe a maximum punishment of a fine of up to $100,000, five years’ imprisonment or both. This was a significant increase from the previous penalty of a maximum fine of $2,000, one year’s imprisonment or both for the same offence. 23        The foremost consideration for a court in deciding on an appropriate sentence is that of public interest:PP v Tan Fook Sum[1999] 2 SLR 523,Sim Gek Yong v PP[1995] 1 SLR 537. The trial judge rightly recognised the government’s strong efforts to promote Singapore as a regional intellectual property centre and the concomitant need to clamp down on piracy of intellectual property. The trial judge also referred to this court’s holding inOh Cheng Hai v Ong Yong Yew[1993] 3 SLR 930 at 937, that a court determining a sentence under the TMA should have regard to “all the circumstances in which the offences were committed, including the nature and extent of the infringements, and the manner in which the infringements were carried out”. Upon scrutiny of the judgment below, I found that the trial judge did pay careful regard to all these factors before arriving at his decision that a deterrent sentence was warranted. 24        I was also of the opinion that in comparison with the sentences imposed in other cases of trade mark infringement, the sentence awarded to the appellant in this case was not manifestly excessive. I surveyed a range of previous sentencing decisions in trade mark infringement cases, some of which were examined by the trial judge and others of which were brought to my attention by the appellant. The trial judge concluded from his review of the cases that custodial sentences are the norm unless the quantity of infringing articles is quite small, which is patently not the case here. He also determined that the starting tariff for offences involving 1,000 infringing articles and above is a sentence of 12 months’ imprisonment and upwards. The appellant contested this, arguing that the cases showed that the starting tariff is in fact three to four months’ imprisonment per charge. 25        I do not think it necessary to reproduce the facts of each case for the purposes of this judgment. Suffice it to say that, when I considered the cases as a whole, I did not find any support for the appellant’s contention. Instead, I noted that a number of these cases had occurred some time back, and that the trend of the courts, especially the appellate courts, is to take a progressively more stringent stance on the infringement of intellectual property rights. Moreover, I am of the view that it is overly simplistic to determine the sentencing tariff by reference to the jail term awarded per charge. A charge may deal with just three infringing articles or with thousands of articles, as in the present case. It would hardly be just for the starting tariff to remain the same in both situations. Indeed, justice would be better served if the starting tariff is determined by reference to the number of infringing articles involved, which was the approach taken by the trial judge. Even so, examination of the cases shows that there is no “hard and fast rule” with regard to starting tariffs, which only goes to emphasise the point that various decisions made by the courts cannot be taken in isolation, but that it is still incumbent upon the sentencing court to have regard to all the circumstances of the case when deciding on the sentence:Oh Cheng Hai.",
        "Mitigating factors": "26        I found no reason to accept the appellant’s complaint that the trial judge failed to give adequate consideration to the mitigating factors in this case. The trial judge considered the fact that the appellant pleaded guilty at the first opportunity and that he was a first offender. However, it is also established law that no discount will be given to an offender who pleads guilty if he is caught “red-handed” or if considerations of public policy demand a deterrent sentence:Wong Kai Chuen Philip v PP[1990] SLR 1011. The trial judge correctly took into account the fact that the appellant was caught red-handed with the infringing articles by the raiding party, which would lessen any mitigating value in his plea of guilt. 27        The trial judge also noted that the appellant was ready to pay compensation to the rightful trademark owners and to make a public apology in the newspaper for his acts, accepting it as a genuine sign of remorse on his part. By the time I heard this appeal, the appellant had already started paying Nintendo and Sony Corporation the damages agreed upon. Again, however, any mitigating value in this act was qualified by the fact that the agreement to make compensation arose out of a civil suit instituted in the courts. Nevertheless, I found that the trial judge gave due weight to this mitigating factor and that there were no grounds on which his decision could be faulted.",
        "Conclusion": "28        In light of public policy, the general approach evinced in the sentencing precedents and the circumstances of the case, I found that the sentences meted out by the trial judge were not manifestly excessive. Accordingly, I dismissed this appeal. Appeal dismissed."
    }
}