{
    "case_title": "Loo See Mei v Public Prosecutor",
    "ncitation": "[2004] SGHC 42",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Facts": "",
        "The charge": "2          The appellant claimed trial to one charge of harbouring a Nepalese national, one Prem Kumar Palungwa (“Limbu”) who had unlawfully overstayed in Singapore for a period exceeding 90 days in contravention of s 15(3)(b) of the Act thereby committing an offence under s 57(1)(d) and punishable under s 57(1)(ii) of the Act. 3          Section 57(1)(ii) of the Act provides that any person who commits an offence of harbouring shall be punished with imprisonment for a term not less than six months and not more than two years and shall also be liable to a fine not exceeding $6,000.",
        "The Prosecution’s case": "4          The appellant is the registered lessee of a Housing and Development Board flat at Block 756 Yishun Street 76 #01-266 (“the flat”). On 19 February 2003, at about 6.50am, a team of immigration officers raided the flat and arrested 11 Nepalese men who were present in the flat. They were caught sleeping in the hall and in three rooms of the flat. Nine of these men were found to be immigration offenders while two of them possessed valid social passes. One of the immigration offenders arrested was Limbu. 5          Limbu was subsequently convicted for the offence of overstaying in Singapore from 1 March 2002 to 19 February 2003. He was sentenced to one month’s imprisonment and four strokes of the cane. 6          Evidence for the Prosecution was chiefly led by Limbu. He testified that he had entered Singapore sometime in January 2002 on a valid social visit pass. His attempts to obtain a student visa were turned down but he continued to stay in Singapore illegally after his pass expired sometime in March 2002. 7          Sometime towards the end of March 2002, Limbu met a fellow Nepalese man by the name of Run. At that time, Limbu was interested to get accommodation and Run brought Limbu to the flat on 1 April 2002. Limbu testified that when he went to the flat, he found all three rooms to be fully occupied with six Nepalese men staying there. Limbu decided to stay at the flat and it was agreed that he would pay rent of $150 per month to Run. Limbu stayed at the flat from 1 April 2002 until his arrest in February 2003. 8          Limbu testified that it was through Run that he met the appellant. The first time that Limbu met the appellant was sometime in September 2002 when he followed Run to Suntec City. At that meeting, Run paid the rent to the appellant and Run told Limbu that the appellant was the “house owner”. They were not formally introduced on that occasion and they did not talk to each other. 9          Subsequently, Limbu met the appellant on four other occasions. The first three were at the flat in the months of September and December 2002, and January 2003. On each of those occasions, the appellant went to the flat to collect rent. The first of these three meetings took place around 4 or 5 September 2002, between 6.00pm to 7.00pm. Limbu testified that on this particular occasion, the appellant went inside the flat and there were two or three other persons with him in the flat at that time. The appellant asked Limbu who he was and Limbu told her his name and that he was staying there. She did not ask about the other persons who were there. She also did not ask Limbu (or any of the other persons there) for their travel, immigration or identity documents. On this first occasion, Limbu was wearing only his shorts when he answered the door. 10        The other two occasions when the appellant went to the flat to collect rent took place under similar circumstances. Each time, the appellant would call the mobile phone that Run had passed to Limbu to arrange for a time to meet. Each time, Limbu identified himself and told her that Run was not in, so he would be the one paying the rent to her. 11        The final occasion when Limbu and the appellant met was sometime in February 2003 at the Yishun Mass Rapid Transit station. The purpose for meeting was again for her to collect the $800 rent from Limbu. 12        The only other witness for the prosecution was the investigating officer, one Christopher Roland Gomez (“Gomez”). He testified that when he asked Limbu whether he was able to contact the appellant and whether he knew the contact number of the appellant, Limbu was able to give the number “off-hand” to Gomez. It was through this number that Gomez managed to get in touch with the appellant. Gomez also said that when he contacted the arresting officer, the arresting officer told him that Limbu had the contact number of the appellant.",
        "The Defence": "13        The appellant’s defence at the trial below was that she was not aware of the presence of any of the Nepalese men except for one Top Bahadur Poon (“Top”). Top was one of the Nepalese men rounded up in the raid but he was found to be in possession of a valid social visit pass and was unconditionally discharged. 14        The appellant testified that she had rented out the flat to Top since 1 June 2000. At that time, Top had a valid student pass for the period from 21 August 2000 to 20 October 2001. After the expiration of the one-year tenancy, Top and the appellant agreed to extend the tenancy on a month-to-month basis. She also testified that Top had told her that after his student pass expired on 20 October 2001, he intended to continue his studies here. His subsequent attempts to get a student visa were not successful. Thereafter, by early 2002, he informed the appellant that he wished to do some business in the region and he wished to extend the lease. He also told the appellant that as he would be travelling extensively, he would be on a social visit pass. 15        The appellant also gave evidence about another Nepalese man called Ramkrishna Tinja Pun (“Ram”). Ram and Top were friends. They both approached the appellant to rent the flat. At that time, Ram had a valid student pass but subsequently, his attempts to renew his student pass were rejected. He then left the flat and the appellant consequently reduced the rent from $800 to $400 after Ram left. 16        The appellant said that she did not know that Limbu was staying at the flat. However, she did testify that on two occasions, she collected the rent from Limbu but on both these occasions, they met at Suntec City. These meetings would take place when she could not arrange for a time to meet with Top, and Top was the one who made plans for Limbu to pass her the rent at Suntec City instead. Prior to these two occasions, there could have been one or two occasions where she saw Limbu together with Top when he met her at Suntec City but she could not be sure. 17        She also testified that the last time that Top paid rent to her was in January 2003. On that occasion, Top met her at Suntec City and he paid the rent for two months. Thus, she denied meeting Limbu to collect rent for January and February (much less at the flat) because she had already been paid for two months in January 2003 by Top at Suntec City. 18        She also gave evidence about how often she went to the flat and what she had observed on those occasions. Her last visit to the flat prior to the raid was around December 2002. On that occasion, she had a quick look around the flat but she could not remember whether she checked the bedrooms. Under cross-examination, the appellant was again asked about how often she went into the flat to check and what she observed on each of these occasions. She testified that for the period from September to end December 2002, she went to the flat about two times. She did not go into any of the rooms on those occasions. When asked why it did not occur to her to check all the rooms to ensure that they were in order, in particular Bedroom 2 which was previously let out to Ram, she said that “there was no reason to”. Finally, she gave testimony that she did not visit the flat between January 2003 and the raid of the flat on 19 February 2003. 19        The appellant subsequently sought to adduce fresh evidence in the form of e-mails and a letter from DBS Bank evidencing a withdrawal of $800 from an automated teller machine (“ATM”) at Suntec City to refute Limbu’s allegation that she had met him at the flat on 4 or 5 September between 6.00pm and 7.00pm. She also called her company’s information technology (“IT”) manager, one Luw Bee Lay (“Luw”) to give testimony that the e-mails could not have been falsified and that they originated from the appellant’s desktop at the Suntec City office. The application to adduce fresh evidence was allowed by the trial judge. 20        Unfortunately for the appellant, instead of assisting her case, Luw’s testimony turned out to be detrimental to her case. Luw testified that she could not be sure whether the e-mails in question originated from the office desktop or the appellant’s laptop. More importantly, she expressed her discomfort in coming to court to give testimony because the appellant had spoken to her prior to her giving testimony. During this conversation, the appellant asked Luw to say that her (Luw’s) job scope involved not just IT but human resource as well. Also, the appellant told Luw what answers to give the court if she was asked about whether the appellant had a desktop or a laptop and how long it would take for her (Luw) to travel from Suntec City to her home in the Admiralty area (as an indication of how long it would take for the appellant to travel from Suntec City to the flat in Yishun). In short, Luw testified that she was practically drilled by the appellant. The appellant offered herself to be recalled to the witness stand to refute these allegations but the trial judge did not see a need to, since the appellant did not speak to her about the e-mails.",
        "The decision of the trial judge": "21        The trial judge found that the primary issue was one of fact: whether he accepted the evidence of Limbu that he had stayed in the flat with the appellant’s consent or knowledge and that she had collected rent from him. 22        He noted (at [31] of his grounds of decision,[2003] SGDC 296) that there was little, if any, corroborating evidence of Limbu’s testimony. Nevertheless, having had the opportunity to observe Limbu closely in the witness stand and being impressed with his testimony on the issue of the amount of rent paid, the trial judge accepted the veracity of his evidence. At [32], the trial judge held: I found him [Limbu] to be sincere and forthright as a witness. In addition, given that he had already been dealt with for his own offence of overstaying, there is no benefit for him in falsely implicating the Accused. Vengeance cannot possibly be his motive in testifying either as there is no reason for him to think that his arrest was actuated by the Accused. In short, there is absolutely no motive for him to wish harm to the Accused. 23        In contrast, the trial judge found that the appellant had every reason to deny the charges. On the issue of whether Top could have been the true harbourer, the trial judge made the following findings at [35]: One of the defences appears to be that it was Top who is the true harbourer. This has some support in the statement of the arresting officer where he was referred to as a “suspected harbourer”. However, I note from the testimony of the [investigating officer] that he was subsequently released unconditionally after investigations. In this context, I observed that the Prosecution had, in fact, offered all the other immigration offenders to the Defence as witnesses, but this offer was not taken up. While it may be said that it was no longer possible for the Defence to call Top as a witness, surely the same cannot be said of the other Nepalese men. I am aware that an Accused person’s failure to call a witness does not add to the Prosecution’s case as all the Accused needs to do is to raise a reasonable doubt –Mohamed Abdullah s/o Abdul Razak v PP[2000] 2 SLR 789. However, clearly this failure to call the other immigration offenders as witnesses leaves a serious gap in the Defence case. If indeed it was Top, and not the Accused who was the actual harbourer, then surely their evidence would be crucial. The Defence failure to call any of them as witnesses makes her version less likely to be believed. 24        In short, he was satisfied with Limbu’s truthfulness and he did not find the appellant’s version convincing. On the issue ofmens rea, the trial judge was satisfied that the appellant either knew or had reasonable cause to believe that Limbu was an immigration offender. First, Limbu’s demeanour and accent would have indicated to the appellant that he is Nepalese. Secondly, Limbu testified that when the appellant saw him at the flat, he was wearing T-shirts and shorts, a clear indication that he was residing in the flat. (One might add that on the first occasion, he was only wearing shorts when the appellant knocked on the door and it was in the midst of the conversation with the appellant that Limbu put on a T-shirt.) She also saw other people at the flat but made no inquiries. The trial judge concluded that it was “a clear failure to exercise any due diligence whatsoever”. Relying on the case ofPP v Koo Pui Fong[1996] 2 SLR 266,the trial judge found that the appellant was at least wilfully blind to Limbu’s immigration status and this gave rise to an inference that she had the requisite knowledge. He also found that the same evidence would have been capable of giving rise to an inference that the appellant had reasonable grounds for believing that Limbu was an illegal immigrant. 25        On the issue of sentencing, he noted that the benchmark sentence for such an offence is a 12-month imprisonment term, but giving the appellant credit for not raising any extravagant defences and for exemplary conduct at the trial (save for her attempt to influence Luw on immaterial points), he decided to sentence her to ten months’ imprisonment. The appellant appealed against conviction only.",
        "Issues arising in this appeal": "26        The appellant essentially challenged the trial judge’s acceptance of Limbu’s evidence over the appellant’s version of events. In that regard, counsel for the appellant presented five issues for my consideration: (a)        Whether it was safe to convict the appellant on Limbu’s evidence which was uncorroborated; (b)        Whether the trial judge was correct in finding that Limbu had “absolutely no motive” to falsely implicate the appellant; (c)        Whether the trial judge erred in rejecting the appellant’s version of events; (d)        Whether the trial judge was correct in finding that the evidence relating to the e-mails and ATM withdrawal were “neither here nor there”; and (e)        Whether the trial judge was correct in finding that the appellant’s failure to call the other immigration offenders as witnesses left “a serious gap” in the defence case. 27        As a question of law, the appellant also challenged the trial judge’s finding that the presumption under s 57(7) of the Act had been triggered and that the appellant did not rebut this presumption.",
        "Findings of fact based on credibility of witnesses": "28        This appeal was essentially a challenge against the trial judge’s findings of fact based on his assessment of the witnesses’ credibility. It is trite law that an appellate court will be slow to overturn such findings because it does not have the opportunity to observe the witnesses in the witness stand: seeYap Giau Beng Terence v PP[1998] 3 SLR 656. An appellate court may overturn such findings only if it is convinced that the findings are wrong, and not merely because it entertains doubts as to whether the decision was right:PP v Azman bin Abdullah[1998] 2 SLR 704. 29        Therefore, the threshold that the appellant had to cross to convince me to overturn the trial judge’s findings was high. With that in mind, I now proceed to deal with each of the issues raised by counsel.",
        "Whether it was safe to convict based on Limbu’s evidence": "",
        "Whether corroboration of Limbu’s evidence was required": "30        Counsel for the appellant pointed out that the Prosecution’s case rested on Limbu’s bare and uncorroborated allegations. The allegations of conviction based on uncorroborated evidence miss the point entirely. Under s 136 of the Evidence Act (Cap 97, 1997 Rev Ed), it is clearly stated:",
        "Number of witnesses": "No particular number of witnesses shall in any case be required for the proof of any fact. 31        While our law requires that the court puts its mind to the issue of corroboration where the witness involved is a child, a victim of a sexual offence or an accomplice, Limbu did not fall into any of these categories of witnesses. Therefore, corroboration of his evidence was not necessary. In any event, in his grounds of decision, the trial judge did make note of the fact that Limbu’s evidence was uncorroborated and the trial judge addressed this amply when he noted the following at [31] and [32] of his grounds of decision: 31         The [incontrovertible] evidence is that Limbu was staying at the Accused’s flat. He was in fact arrested there. Other than that, however, I must first point out that there is little, if any, corroborating evidence of Limbu’s testimony that he had paid the rent to the Accused, and that she knew he was an immigration offender. 32         Nevertheless, having had the opportunity of observing Limbu closely in the witness stand, I found him to be a straightforward person who gave clear and consistent evidence. His evidence passed the test of consistency and cogency. 32        Counsel for the appellant argued that the authorities arrested the other Nepalese at the flat and yet the Prosecution produced none of them to corroborate Limbu’s bare allegations. I found that there was absolutely no requirement for the Prosecution to do so. It must be remembered that the Prosecution has a discretion in deciding which witnesses to call, provided that there is no ulterior motive in its decision:Tan Ah Lay v PP[1994] SGCA 90. It is not up to the courts to dictate which witnesses the Prosecution has to call. If the Prosecution chooses to rely solely on a witness’s evidence and not call on other witnesses, then the Prosecution bears the risk of having the accused person acquitted because the court finds that the evidence of the sole witness was insufficient to prove the Prosecution’s case beyond reasonable doubt. Unfortunately for the appellant, that was not the case here. The trial judge was satisfied that the Prosecution had discharged its burden of proving its case beyond reasonable doubt based on Limbu’s evidence as well as some of the surrounding circumstances, such as the Gomez’s testimony that Limbu could recall the appellant’s telephone number off-hand. Therefore, I found the appellant’s allegations that the conviction was unsafe because it was based on the uncorroborated evidence from Limbu to be unmeritorious.",
        "Whether the trial judge was correct in finding that Limbu had “absolutely no motive” to falsely implicate the appellant": "33        Next, counsel argued that the trial judge erred in finding that the Limbu had “absolutely no motive” to implicate the appellant. In this regard, counsel pointed out that “the possible reasons for [Limbu] to falsely accuse the appellant include a desire to shield Top. … [Limbu] had no love for the appellant. Nepalese are well-known for their sense of camaraderie and loyalty to one another”. For this, counsel relied on my earlier decision inKhoo Kwoon Hain v PP[1995] 2 SLR 767. 34        I found counsel’s reliance onKhoo Kwoon Hain v PPto be wholly misguided. This is not the first instance that my decision inKhoo Kwoon Hainv PPhas been misunderstood by counsel. Counsel in two recent cases, namelyWong Tiew Yong v PP[2003] 3 SLR 325 andTan Puay Boon v PP[2003] 3 SLR 390, were also criticised by me for having placed false reliance onKhoo Kwoon Hain v PP. Seeing how oftenKhoo Kwoon Hain v PPhas been inappropriately relied on by defence counsel, I will take this opportunity to clarify the position and demonstrate why that case does not stand for the proposition suggested by counsel. 35Khoo Kwoon Hainv PPwas a sexual offence case. The accused there was a supervisor at a restaurant and the complainant was a waitress at the same restaurant. He was charged with aggravated outrage of her modesty. The evidence against the accused was led by the complainant. Apart from her complaints to her sister, and her police report, there was no corroboration of her evidence. 36        The relevant issue in that case for current purposes was whether the trial judge was correct in finding that the complainant had no reason to bring false evidence against the accused. There, the accused admitted that he did not know why the complainant would lie in court and falsely accuse him. The trial judge relied on this fact as a reason for disbelieving the accused. 37        I allowed the appeal in that case. One of the factors I took into consideration in allowing the appeal was the trial judge’s erroneous reasoning pertaining to the accused’s inability to explain why the complainant would have falsely accused him. The passage where I criticised the trial judge’s reasoning on this point can be found at 781, [70] and [71] of the report and merits quotingin extensoto demonstrate the context in which my criticism of the trial judge’s reasoning arose: 70         I should mention that the district judge also took the view that the complainant had no reason to bring false evidence against the appellant. The district judge relied on the fact that the appellant was unable to venture a reason why the complainant would lie in court. With the greatest respect, whether the appellant could venture a reason is neither here nor there. In my view,if a trial judge is going to rely on the fact that the complainant had no reason to falsely accuse the appellant, then this should be found as a fact based on credible evidence. There is no evidence at all on this.The burden of proving a lack of motive to falsely implicate the appellant is on the prosecution. Even though the prosecution was making a negative assertion, the burden of proof is still on it. It is not for the defendant to prove that the complainant had some reason to falsely accuse him. This is a fact that would be wholly within the complainant’s knowledge and nobody else’s. The defence therefore cannot be expected to prove this. It would be a circular argument to believe the complainant when she said that she had no reason to falsely accuse the appellant, and then say from that that the complainant is believed because she had no reason to falsely accuse the appellant. It is precisely because there can well be reasons why a complainant would make false allegations against an accused that it is often unsafe to convict in cases of sexual offences where there is no independent evidence to corroborate the complainant’s allegations. 71         Where a defendant is already greatly disadvantaged in a trial such as this, particular attention must be paid to where the burden of proof lies. A negative assertion by the prosecution must still be proven by the prosecution. Nothing in the Evidence Act shifts this burden to the appellant. The trial judge should therefore not have relied on the unproven assertion that the complainant had no reason to lie when assessing the complainant’s and the appellant’s credibility. [emphasis added] 38        My earlier judgment inKhoo Kwoon Hain v PP, as extracted in the above paragraphs, is best understood by appreciating that there were two parts in the judgment relating to the issue of witnesses falsely implicating an accused person. 39        First, when a trial judge wishes to make a finding that the complainant or prosecution witness had no reason to falsely implicate the accused, he must base such a finding on credible evidence. This is founded on the principle of common sense that any finding of a trial judge must be based on some credible evidence to support his or her decision in order for that finding to be sound. What amounts to credible evidence depends on the facts of each case. It must be remembered that inKhoo Kwoon Hain v PP, my main criticism levelled against the district judge was his reliance on the fact that the accused could not venture any reasons why the complainant would lie in court to falsely implicate him. That was clearly wrong because by focusing on that, he failed to consider whether there was credible evidence to show that the complainant could not have been lying. The same criticism cannot be levelled against the trial judge in the present case. He had expressly considered the undisputed fact that Limbu had been dealt with under the law, having been convicted and having served his sentence for overstaying in Singapore without a valid permit. The trial judge was entitled to rely on this, as he did, as a basis for finding that Limbu had no reason to falsely implicate the appellant here. 40        The second and more important aspect of my earlier decision inKhoo Kwoon Hainv PPwas my holding that the Prosecution bears the burden of proving that the complainant or Prosecution witness had no reason to falsely implicate the accused. Counsel, both in this appeal and in recent appeals, seized on this to argue that the Prosecution had not discharged its burden of showing that the prosecution witness could not have lied to implicate the accused. Here, counsel sought to impress upon me that the Prosecution had not discharged its burden because “we will never know if an agreement was struck between Limbu and Top” – one borne out of “camaraderie and loyalty to one another” – to shield Top from prosecution. 41        I found this argument to be fundamentally flawed because it failed to recognise that the burden placed on the Prosecution to show that the prosecution witness did not falsely implicate the accused is one of “beyondreasonabledoubt”. It did not have to prove this beyondalldoubt. To accede to counsel’s request to find that Limbu might have falsely implicated the appellant, on the frivolous conjecture that he may have wanted to shield Top from prosecution out of camaraderie and friendship, would be tantamount to demanding that the prosecution prove beyondalldoubt that Limbu had no reason to falsely implicate the appellant. That cannot be the state of the law. Here, the Prosecution did prove beyond reasonable doubt that Limbu had no reason to falsely implicate the appellant. In fact, the trial judge went out of his way to consider, and ruled out, the reasonably possible scenario that Limbu may have wanted to seek revenge because he thought that his arrest was actuated by the appellant. The trial judge also took into account the fact that Limbu had been dealt with under the law. Therefore, I found that the trial judge’s finding that there was “absolutely no motive” for Limbu to wish harm on the appellant by falsely implicating her was correct.",
        "Whether the trial judge erred in rejecting the appellant’s version of events": "42        Counsel for the appellant then proceeded to argue that the trial judge should not have dismissed the appellant’s version of events so readily in favour of Limbu’s version. Once again, counsel for the appellant failed to appreciate the fundamental principle that an appellate court is slow to reverse findings based on the credibility of witnesses. At the hearing, counsel tried to demonstrate that the appellant could not have rented out the flat to Limbu and the other Nepalese men as alleged because that would have been completely out of the appellant’s character. The fact that counsel was relying on arguments about how it would have been out of the appellant’s character demonstrated the weakness of the appellant’s case. In any event, I found that there were several loopholes in the appellant’s version of events which would justify the trial judge giving less weight to her evidence. 43        First, she claimed that she did not know Limbu and that she did not make contact with him. She asserted that on the two occasions that she met him to collect rent at Suntec City, it was Top who had arranged it for her. However, Gomez, an independent witness on all counts, gave testimony that Limbu could recall the appellant’s telephone number “off-hand” when he was asked about how to contact the appellant. From this, one could reasonably infer that Limbu did make regular contact with the appellant such that he could recall her number “off-hand”. This undermined the credibility of her version that she did not make contact with Limbu. If she did in fact meet him only at Suntec City as she alleged, and not at her flat, there would be no reason for her to lie about the regularity of their meetings. 44        Secondly, on her own evidence, she had extended the tenancy agreement with Top on a month-to-month basis after finding out that Top’s student visa had not been extended. Yet, in her own testimony and upon cross-examination, she testified that she did not go to the flat regularly to perform checks and that she would only go there when she was “in the area”. She knew that Top would be in Singapore on a social visit pass. I found that this would have been sufficient grounds for a reasonable landlord to step up checks at the premises to, at the very least, ensure that Top had the social visit pass as he told her he would. Yet, by her own evidence, she went to the flat only twice in the course of about six months from September 2002 to the date of the raid, 19 February 2003, and both occasions took place from September to December, with not a single visit to the flat from January to 19 February 2003. Surely, this (coupled with the trial judge’s other findings) justified the trial judge’s finding that the appellant failed to exercise proper due diligence to ensure that there were no illegal immigrants in the flat.",
        "Evidence relating to the e-mails and the ATM withdrawal": "45        The appellant emphasised at the trial and on this appeal that the evidence relating to the e-mails and the ATM withdrawal was sufficient to prove that Limbu was lying with regard to his testimony that he met the appellant on either 4 or 5 September 2002. She then argued that this would be sufficient to raise a reasonable doubt in the Prosecution’s case. 46        Even if I were to give the benefit of the doubt to the appellant, it would still be insufficient for me to allow the appeal. These arguments would have had greater force in either of the following two hypothetical scenarios: if Limbu had been very certain about the dates of meeting the appellant, or if her conviction turned on the meeting on 4 or 5 September 2002 alone. Both these scenarios did not apply on the facts of this appeal. Limbu’s evidence as to the dates were merely rough estimates. Even if one gave the benefit of the doubt to the appellant that she was in fact in her office on 4 or 5 September 2002, it could have been possible that she met Limbu on either 3 or 6 September. I found this minor inaccuracy as to the date of that particular meeting to be immaterial. Even if there had been a minor inaccuracy as to the date of this particular meeting, that would not have been sufficient to raise a reasonable doubt because it did not detract from the rest of Limbu’s testimony that he had met the appellant on other occasions. 47        Admittedly, the fact that Limbu did not give exact dates on those other occasions may, at first glance, prejudice the appellant because she could have been unable to adduce evidence to rebut those allegations. However, on further reflection, I found that the conviction was still safe, for two reasons. First, the error as to dates did not detract from the fact that Limbu could recall the appellant’s telephone number “off-hand” when Gomez asked for it. This gave rise to a strong inference that the appellant and Limbu must have had regular contact, thus refuting her (convenient) excuse that she did not make contact with Limbu. Secondly, the version put up by the appellant, that she had received the rent from Top in January for two months, is also unsupported by independent evidence, such as receipts. Therefore, taking the evidence as a whole, I found that even if one were to give the benefit of the doubt to the appellant on the issue of the dates of the meetings in September, that alone was insufficient to allow the appeal.",
        "The appellant’s failure to call Top and/or the other immigration offenders": "48        Counsel for the appellant also challenged the trial judge’s finding with regard to the appellant’s failure to call on Top and also his finding that the failure to call on the other immigration offenders (even though they were offered to the Defence) created a “serious gap” in the Defence’s case. The appellant submitted that it was for the Prosecution to adduce evidence (from Top or the other immigration offenders) to corroborate the bare allegations of Limbu and not for the appellant to call on them to prove her innocence. Further, the appellant submitted that Top was a material witness and that this court should draw an adverse inference against the Prosecution for failing to call Top and the other immigration offenders as witnesses. 49        I will first deal with the argument that the court should draw an adverse inference against the Prosecution for failing to call these witnesses. As I have alluded to above, the Prosecution has a discretion in deciding which witnesses to call, provided that there is no ulterior motive in its decision. The rationale of this principle was succinctly put across by the Court of Appeal decision inTan Ah Lay v PP([32]supra) and since it often slips the minds of defence counsel, I shall reiterate it here: To begin, the prosecution has an undoubted discretion whether or not to call a particular witness, provided that there is no ulterior motive in the decision. A witness who is available to, but not called by the prosecution should be offered to the defence. … We were of the view that the essence of the discretion and the duty is to ensure fairness of the trial and to the accused. The prosecution should not conceal material evidence or witnesses from the court. The duty may be discharged, in appropriate cases, by giving the particulars of such witnesses to the defence. 50        With these principles in mind, I found that the Prosecution’s approach in the conduct of the trial below could not be faulted. None of the immigration offenders including Top were needed to corroborate Limbu’s version of events because, as I have mentioned above, corroboration was not necessary. It was true that Top was not called as a witness, but I found that there was no ulterior motive in not calling Top. Top was found to have a valid social pass and on that count, the authorities were obliged to, and did, release him after his arrest at the flat. Further, the other immigration offenders were also offered to the appellant but she did not call on any of them to corroborate her version that Top was the true harbourer and not her. Unlike the case ofKhoo Kwoon Hain v PP, where the details of a material witness – one “aunty” – were not disclosed to the appellant there, I found that there was no similar concealment of evidence from the appellant on the facts of the present case. 51        The appellant complained that the Prosecution’s offer of Top to the appellant as a witness was merely lip service as Top could not be located despite her valiant attempts. Unfortunate though that may have been for the appellant, there was really little that this court could have done for her. In any event, her complaints were unfounded because the trial judge did realise that it was no longer possible for Top to be called by the Defence and so, the trial judge did not hold this against the appellant. 52        As for the other immigration offenders, the trial judge did find that the appellant’s failure to call them as witnesses created a serious gap in her defence. The trial judge’s reference to the failure to call the other illegal immigrants as witnesses arose in the context of the appellant’s defence that it was Top who was the true harbourer and not her. I found this to be a correct finding. The way counsel for the appellant raised this issue obfuscated the real crux of the matter, which was, the purpose for calling the other immigration offenders. As I have explained above, the Prosecution need not call on these immigration offenders to corroborate Limbu’s version of events. However, if the appellant wished to call on them to make her defence that Top was the true harbourer more believable, then the trial judge was plainly correct in finding that her failure to call on them, particularly since they were offered to her as witnesses, did create a serious gap in her defence. Finally, I also found that the trial judge was correct and sensible in his reasoning that the appellant’s failure to call on the other immigration offenders did not add to the Prosecution’s case, but only resulted in a failure to convince the court in raising a reasonable doubt. Consequently, I found that the appellant’s complaints on this issue had no merit. 53        Before I proceed to the final issue ofmens rea, I wish to deal with an argument raised by the Prosecution with regard to the appellant’s failure to call the other immigration offenders as witnesses. The Prosecution urged me to draw an adverse inference against the appellant, relying on the case ofPP v Nurashikin bte Ahmad Borhan[2003] 1 SLR 52. In that case, I allowed the Prosecution’s appeal for an offence of shoplifting. I found that the respondent’s failure to call her friend, one Natasha, as a witness to support her claim that it was Natasha and not her who stole the items, warranted the court to draw an adverse inference against the respondent under illustration (g) to s 116 of the Evidence Act. The relevant passage, which was the one that the Prosecution wished to rely on, can be found at [24] of my judgment: In my opinion, the respondent’s failure to call Natasha to the stand should have resulted in an adverse inference being drawn against her under illustration (g) to s 116 of the Evidence Act.I do not mean to suggest that a defendant’s failure to call a material witness will always result in an adverse inference being drawn against him.Illustration (g) to s 116 provides that: The court may presume that evidence which could be and is not produced would if produced be unfavourable to the person who withholds it. As apparent from the wording of the provision, it allows, but does not compel, the court to draw adverse inferences even if available evidence is not produced in court. In fact, the general rule is that the burden lies on the Prosecution to prove its case and no adverse inference can be drawn against the Defence if it chooses not to call any witness:Goh Ah Yew v PP[1949] 1 MLJ 150 andAbu Bakar v R[1963] 1 MLJ 288. There is however an important qualification to this general rule: if the Prosecution has made out a complete case against the defendant andyet the Defence has failed to call a material witness when calling such a witness is the only way to rebut the Prosecution’s case, illustration (g) to s 116 of the Evidence Act then allows the court to draw an adverse inference against the defendant:Choo Chang Teik v PP[1991] 3 MLJ 423 andMohamed Abdullah s/o Abdul Razak v PP[2000] 2 SLR 789. This is based on the commonsense notion that if the only way for the Defence to rebut the Prosecution’s case is to call a particular witness, then her failure to do so naturally raises the inference that even that witness’s evidence will be unfavourable to her. [emphasis added] 54        I did not find the present appeal to be an appropriate case to draw an adverse inference against the appellant and the trial judge rightly refrained from doing so. As I observed inNurashikin’scase, it is not in every case that an accused person’s failure to call on a witness results in an adverse inference being drawn against him or her. Much depends on the facts and circumstances on each case. There are various factors to take into account, some of which include the availability of the witness, the purpose for which the witness is to be called and the materiality of calling that witness. These factors are, of course, non-exhaustive. InNurashikin’scase, the materiality of calling Natasha was obvious: by a deduction of logic, if what the respondent there said was true, it would go towards exculpating the respondent. The same cannot be said of the appellant’s failure to call on the other immigration offenders in the present appeal. Without casting aspersions on her previous counsel’s conduct of her defence, perhaps more could have been done in contacting these immigration offenders which were offered to her. Be that as it may, one cannot logically deduce that the immigration offenders would have come forward to corroborate her story. Calling on the other immigration offenders was, in short, not theonlyway to rebut the Prosecution’s case. Furthermore, unlike inNurashikin’scase where all the elements of the offence had been proven against the accused person and it was up to her to rebut the complete case made out against her, the same cannot be said of the present appeal. The Prosecution, in order to prove its case beyond reasonable doubt, had to convince the trial judge that Limbu’s version of events was closer to the truth and this was contingent on the appellant’s ability to convince the trial judge that her version was to be believed. Bearing these in mind, I found that the trial judge was correct in stopping short of drawing an adverse inference against the appellant by finding that it merely created a serious gap in her defence.",
        "Whether the trial judge erred in finding that the requirement of mens rea was met": "55        Finally, the appellant argued that the trial judge erred in invoking the presumption ofmens reaunder s 57(7) of the Act. The crux of the appellant’s arguments on this issue was that the trial judge was wrong to prefer Limbu’s evidence over that of the appellant’s. Not only was this argument a variation on an old theme, it was also logically flawed. Once the trial judge had accepted the version of events as narrated by Limbu, the trial judge was entitled to find Limbu’s testimony to be true. The trial judge was then entitled to make the necessary inferences of “wilful blindness” and “failure to exercise due diligence”. There were ample facts to support such an inference. First, upon observation, one would have been able to tell that Limbu is a foreigner. Indeed, even the appellant conceded that she “guessed” Limbu was a foreigner. Next, upon accepting Limbu’s version of events, the trial judge was entitled to find that she had been wilfully blind. There were other Nepalese men in the flat who was residing in the flat, yet it did not occur to her to enquire about the immigration documents. Further, on her own evidence, she knew (at the very least) that Top was merely on a social visit pass, yet it did not occur to her to go to the flat on a more regular basis. To that end, one could rely on a passage from this court inPP v Koo Pui Fong([24]supra) where at 270, [15] I held: What then must an accused do before he can rebut the presumption of knowledge? This ultimately depends on the facts of the individual case, but in my view where a person has wilfully shut his eyes to the obvious, then that would be insufficient to rebut the presumption. A duty of due diligence is expected … 56        Here, in addition to her failure to exercise due diligence, the appellant had not adduced any evidence to rebut the presumption. Consequently, I found that there was no merit in the appeal on this point.",
        "Conclusion": "57        This was a straightforward case. The question was simply whether the trial judge was correct to believe one witness’s version of events over the other’s. The appellant had the uphill task of convincing me that the trial judge was plainly wrong in his findings of fact. Not only could she not demonstrate this, I found that the trial judge’s reasoning and conclusion were beyond reproach. As the appellant did not appeal against her sentence, I dismissed the appeal and upheld the sentence of ten months’ imprisonment. I also ordered her sentence to commence from 3 February 2004 in light of Chinese New Year. Appeal against conviction dismissed. Sentence upheld."
    }
}