{
    "case_title": "Euan Murugasu v Singapore Airlines Ltd",
    "ncitation": "[2004] SGHC 24",
    "coram": "Ho Su Ching AR",
    "sections": {
        "General Pain and Suffering and loss of amenities": "4          As a result of his injuries, the plaintiff testified that he now feels constant pain in his neck which becomes acute at time and that he is taking Vioxx (painkillers) almost on a daily basis to alleviate the pain. He also claims to experience some weakness in his right upper arm and intermittent episodes of numbness and tingling in his right arm. Having had the opportunity to observe the demeanour of the plaintiff under cross-examination, I had no reason to doubt that his complaints were genuine and found that they were borne out by the medical evidence. 5          The plaintiff called a total of 3 medical experts. Namely, (i)         Dr Tan Seang Beng – Senior Consultant, Orthopaedic Surgeon specialising in spinal injury, Head of Department at Singapore General Hospital and Kendang Kerbau Hospital; (ii)        Dr Peter T Singleton – Staff position in the Department of Orthopaedics at the University of Stanford and Clinical Professor at the School of Medicine, Stanford University; and (iii)       Dr Yee Woon Chee – Deputy Director Research at National Neuroscience Institute and Senior Consultant in Neurology, sub-specialising in neuro muscular diseases. 6          Dr Tan examined the plaintiff upon his return to Singapore in June 2000. He diagnosed the plaintiff as suffering from an acute disc prolapse at the C3/4 and possibly C4/5. Dr Tan reviewed the plaintiff at his clinic on 8 further occasions, the last being on 17 July 2003. In his final analysis, Dr Tan was of the view that although the plaintiff’s injury had stabilised, his symptoms of persistent neck pain as well as pain radiating down to his right shoulder have not improved in spite of intensive conservative measures and are likely to be permanent requiring treatment for the rest of his life. In addition, Dr Tan expressed the opinion that the plaintiff’s symptoms, which are consistent with his injury to the C3/4 cervical spine, are likely to interfere with his working ability in the future, especially with his ability to perform operations. 7          Under cross-examination, Dr Singleton stated that he found Dr Tan’s findings to be complete and was in agreement with his findings and assessment. Dr Singleton explained that the MRIs show an osteophyte impinging on the C3/4 nerve. This impingement would cause pain in anybody and that in the plaintiff’s case, his signs and symptoms are consistent with a C 3/4 cervical radiculopathy. When asked to comment on whether the plaintiff’s symptoms had improved from the first time he saw the plaintiff in October 2002 to his last visit on 15 September 2003 (approximately 3 years and 3 months post-accident), Dr Singleton stated that he found the plaintiff’s global assessment to be disappointing as despite therapy, medication and epidural injections, his progress had been minimal. Dr Singleton confirmed that it would be difficult for the plaintiff to do prolonged microsurgery due to the head positioning and that he would not be able to work without suffering increased pain and numbness in the digits of his dominant hand. He was also of the view that any activity which requires the plaintiff to keep his cervical spine flexed for prolonged periods of time would aggravate the plaintiff’s symptoms. 8          Dr Yee was called upon to give evidence on the various sensory tests that he performed on the plaintiff when he examined the plaintiff on 19 January 2002. Based on the findings of his tests, Dr Yee found a limitation of the right lateral flexion and rotation associated with increased neck pain. He also observed that there were subtle but clear evidence of mild sensory and motor deficits in the plaintiff’s right upper arm, which are within the right cervical C 5/6 segmental distribution. Overall, Dr Yee was of the view that although the deficits which he noted were not severe, it was unlikely to improve significantly over time, in particular, the loss of sensation noted in the right upper limb. 9          The defendant’s only medical expert, Dr W C Chang, an orthopaedic surgeon in private practice, disagreed with Dr Tan’s diagnosis. He was of the view that the plaintiff had asymptomatic pre-existing cervical spondylosis and that the injury to his neck accelerated his pre-existing condition causing a narrowing of his right C3/4 canal. Dr Chang was of the further opinion that as a result of the accident, the plaintiff’s neck is predisposed to accelerated degenerative cervical spondylosis. Under cross-examination, Dr Chang agreed that assuming the plaintiff never sustained any injuries in May 2000 and even if he were to get early symptoms of cervical spondylosis, it is unlikely that such symptoms would be as severe as what the plaintiff is now experiencing. Dr Chang was also of the view that the plaintiff’s signs and symptoms are unlikely to improve at this point of time and would interfere with his work as an ENT surgeon. 10        While there was a divergence of medical opinion as to the precise cause of these symptoms, what was clear is that all the medical experts were in agreement that his injuries was caused by the falling luggage and that his symptoms are consistent with an injury to the cervical spine. In fact, Dr Chang stated under cross-examination that he agreed with the opinion of Dr Singleton that the signs and symptoms that the plaintiff is experiencing are consistent with cervical radiculopathy to the C3/4 level of the spine. Furthermore, all the doctors were also of the unanimous view that the plaintiff’s symptoms are unlikely to improve significantly with time. 11        Based on the medical evidence, I considered the sum of$ 16,000to be a reasonable award under this head. In so doing, I took into account all the authorities cited by the parties, in particular the case ofKaruppiah Nirmala v SBS[2002] 3 SLR 415where $ 14,000 was awarded for cervical spine injuries and osteoarthritis. I was of the view that the disabilities suffered by plaintiff in this case are comparable with that suffered by the plaintiff in the present case.",
        "Pre-trial loss of earnings": "12        According to the defendants, the plaintiff is not entitled to claim pre-trial loss of earnings as he has failed to demonstrate that he was compelled to leave his previous employment at TTSH on account of his injuries. The defendants submitted that the fact that his injuries did not hinder his work as an ENT surgeon is evidenced by the fact that in the year following the accident (i.e 2001), there was a significant increase in the plaintiff’s workload as a surgeon. The defendants then speculated that it was on account of this significant increase in the caseload that the plaintiff, who was burdened with more work than before, thought it timely to leave active practice to pursue his “real career goal”.  According to the defendants, it is apparent from his Curriculum Vitae, that the plaintiff’s “true interests” and thus, his “real career goal” is in the field of research, development and training. 13        I found it difficult to accept the defendants’ submission on this point. Based on guidelines issued by the medical academy, it takes a total of 3 basic and 3 advance years of training to acquire the clinical and surgical skills of a general ENT surgeon. Thereafter, it takes another 2 to 3 years to acquire sub-specialist skills in ENT. The plaintiff embarked on his training to become an ENT surgeon from as early as 1990. He obtained his PhD in Auditory Physiology and Molecular Biology in 1997. In 1998 and 1999, under the sponsorship of the Ministry of Health, the plaintiff was sent to the UK & USA for sub-specialisation surgical training for the purposes of learning and mastering highly complex microsurgery in the area of Neutrology and skull-base surgery. In my view, his career path clearly supports the plaintiff’s stand that his primary intention was to be a doctor and surgeon and that, before the accident, his chosen field was microsurgery specialising in the area of Neutrology and skull-base ENT surgery. 14        After the accident, although the plaintiff continued to do surgical work, I accepted his testimony that he did so with much pain and discomfort especially when he was performing surgery that requires the use of an operating microscope. I also had no reason to doubt the plaintiff’s claims that he had a real fear that the pain and spasm would affect his surgical skills during operations and pose a risk to those patients whom he operated on. This is especially since in his chosen field of Neurotology and skull-base ENT surgery, a high level of concentration would be required as the surgeons are working with an error of less than one millimetre and any tremor in the hand would be magnified. The medical evidence also corroborated the plaintiff’s testimony in this regard. Dr Tan, Dr Singleton and Dr Chang all agreed that the plaintiff would have a limitation when looking down a microscope as it will require a full rotation of the neck. Dr Tan and Dr Chang were also of the view that given that microsurgery involves frequent movement of the neck to adjust the microscope, and since the plaintiff has a disability in this regard, his concentration can be affected when performing microsurgery. 15        In the circumstances, I found the plaintiff’s decision to move into the research field to be both a sound and responsible means of mitigating his loss. As the plaintiff explained under cross-examination: “ A lot of advancement in this area is directly related to the surgery itself. If I cannot function in my capacity as a surgeon, there is no real avenue for me to continue to develop. If I go out to private practice, all this goes out of the window, as there is no real room for sub-specialist surgery. The ENT society in Singapore only has about 50 members and in private practice to survive, you will require referrals but I am doubtful whether I will get them as most doctors in the ENT field are aware of my injury.” 16        Based on the foregoing, I was of the opinion that an award for pre-trial loss of earnings was appropriate. The plaintiff suggested a multiplicand of $ 60,000 a year. This was roughly the difference between the average remuneration of the consultant and senior consultant in 2002, and the plaintiff’s current remuneration from A*Star. This same multiplicand was suggested by the plaintiff for post-trial loss of earnings with a multiplier of 12 based on the plaintiff’s present age of 41 years old. 17        I found the suggested multiplicand to be high in light of the evidence that the difference between the average annual earnings of a consultant surgeon at TTSH in 2002 and the plaintiff’s current annual salary from A*Star is only $ 29,000. Taking this figure to be a more accurate reflection of the pre-trial loss and based on the pre-trial period of about 21.5 months (starting from the date that he joined A*Star in 1 May 2002), I awarded the sum of$ 52,000($ 29,000/12 x 21.5) for pre-trial loss of earnings.",
        "Future loss of earnings and/or Earning Capacity": "",
        "Future loss of earnings": "18        It was clear that the plaintiff had a bright and promising career as an ENT surgeon. Based on his curriculum vitae, the plaintiff clearly excelled in what he did. Throughout his medical career, the plaintiff had received various awards including the Lee Kuan Yew Scholarship in 1993. In 1999, his research paper was one of 4 out of 200 papers that were nominated for the Politzer Prize at the Otology 2000 meeting in Zurich. In my view, there was more than a fair possibility that had he remained at TTSH, he would eventually become a senior consultant surgeon. The question, as is always with all projections into the future, is when would this occur. 19        When the plaintiff left TTSH in May 2002, he has been practising as a consultant surgeon for about 3 years. Based on the letter from the National Healthcare Group on the estimated earnings of ENT surgeons, the difference in the average remuneration between a 6thyear consultant and a newly promoted senior consultant is only $ 20,000. In light of this, it would appear that a consultant surgeon would be eligible for promotion to a senior consultant in his 7thyear at TTSH. In the plaintiff’s case, this would be in May 2005. 20        Assuming that the plaintiff were to be promoted in his 10thyear (i.e May 2008) and that he would retire at 62 (i.e. 2025), he would have spent 4 years as a consultant and 17 years as a senior consultant i.e he would have worked for a total of 21 years in his job. Taking a multiplier of 12 and applying it to both periods proportionately, the first period would be 2 (i.e 4/21 x 12) and the second period would be 10 (i.e 17/21 x 12). 21        Given that the plaintiff’s remuneration from A*Star would in all probability increase with time and not remain static, the multiplicand for the two periods was derived by applying the same percentage difference (derived from difference between the plaintiff’s annual remuneration as a consultant surgeon in 2002 and at A*Star) to the annual average remuneration of a consultant surgeon and senior consultant in 2002. This works out to be approximately $ 28,600 and $ 41,000 (less the relevant deductions for tax) for the first and second periods respectively. 22        I therefore awarded the amount of$ 477,200(2 x $ 28,600 plus 10 x $ 42,000) as loss of future earnings.",
        "Loss of earning capacity": "23        It is trite law that an award for loss of earning capacity is to compensate the weakening of the plaintiff’s competitive position in the open market, in the event that the plaintiff were to lose his current employment. 24        In terms of research work, the main handicap that the plaintiff faces as a consequence of his injuries is an inability to keep his cervical spine flexed for prolonged periods of time without experiencing pain and discomfort. In other words, this would affect his ability to conduct microscopic research work. Given that the ENT field is such a highly specialised one and based on the plaintiff’s outstanding credentials, in my view the impact of the plaintiff’s handicap on his competitive edge in this niche market would be minimal if not negligible. I therefore, did not think that an award for loss of earnings capacity was appropriate and made no award under this head. Medical Expenses incurred in America 25        When the plaintiff went to Stanford in May 2002, he sought treatment in Stanford. As the plaintiff was not eligible for Stanford University’s medical coverage and his insurers, Blue Cross, refused to settle the plaintiff’s claims for medical expenses related to his neck injury as it was pre-existing, the plaintiff had to settle the expenses out of pocket. 26        The medical expenses included an injection procedure that was done on 14 August and follow-up consultation with the doctors in America. In view of the medical evidence that the plaintiff’s condition is likely to be permanent requiring treatment for the rest of his life, I found the expenses incurred in America to be reasonable and awarded the sum ofUS$ 6,922.10which was the amount claimed. Future Medical Expenses 27        The plaintiff claimed the following damages under this head : (i)         cervical disectomy and fusion surgery               $ 15,000 (ii)        injection procedure                                           $ 25,000 (based on 5 procedures) (iii)       conservative treatment at $ 1,200 per    $ 14,400 year for 12 years 28        As the defendants were quick to point out, there was no evidence to show any likelihood that the plaintiff would return to see the physiotherapist. On the contrary, the evidence suggests that the plaintiff would not require intermittent physiotherapy as it has not proven to be effective for him. The defendants also urged the court to disallow the costs of the injection treatments on the basis that the injection treatments only provide temporary relief as evidenced by his first treatment on 14 August 2003. As for the cervical fusion surgery, the defendants argued that this should be disallowed on the basis that the likelihood of such surgery being recommended and performed is remote. 29        I agreed with the defendants’ submission that the plaintiffs claim for physiotherapy and cervical fusion surgery should be disallowed. Indeed, it was precisely because the plaintiff’s symptoms have not improved with intensive conservative measures that the plaintiff has progressed to injection procedures that are a more aggressive form of treatment. In relation to the cervical fusion surgery, I am of the view that the evidence does not support any award for future surgery. It was clear that the plaintiff is adverse to the surgery at present because of his age and the risks involved. As for the future, the plaintiff stated that he would not discount the possibility of having to undergo surgery.  However, in my view this does not support a claim for the future costs of surgery. To use an oft-quoted phrase, “possibilities are not probabilities”. This is especially since the plaintiff’s own medical expert, Dr Tan, stated that notwithstanding what he considered to be a 30 to 40% chance of the plaintiff requiring spinal fusion surgery in the future, he would discourage the plaintiff from so doing as many patients who have undergone such procedure still suffer from neck pains. 30       Given that conservative methods of treatment like physiotherapy and acupuncture have not proven successful and the plaintiff’s symptoms have persisted, it would not be unreasonable for him to elect for injection treatment. Based on the medical evidence, a patient may need to go through a few courses of injection therapy before he is able to find one that is suitable. Hence, it would be premature to equate one unsuccessful experience with the injection procedure with the conclusion that needle therapy as a whole would not be beneficial. In the circumstances, I awarded the sum of$ 25,000for the injection procedure.",
        "Conclusion": "31        In summary, the total award made to the plaintiff was as follow: (i)         Pain and Suffering and lost of amenities             $   16,000.00 (ii)        Pre-trial loss of earnings                                    $   52,000.00 (iii)       Loss of future earnings                                       $ 477,200.00 (iv)       Singapore medical expenses                               $     1,753.51 and transport expenses (agreed) (v)        Medical Expenses in America                      US$      6,922.10 (vi)       Future Medical Cost                                         $    25,000.00 32        I awarded interest at 6% per annum from the date of service of writ to the date of judgment on general damages for pain and suffering. Interest on pre-trial loss of earnings and special damages incurred before the date of judgment was awarded at 3% per annum from the date of the accident to the date of the judgment. 33        The usual consequential orders will apply. Costs are to be agreed or taxed."
    }
}