{
    "case_title": "The \"MMM Diana\" ex \"Able Director\"",
    "ncitation": "[2004] SGHC 152",
    "coram": "Woo Bih Li J",
    "sections": {
        "Background": "1On 9 June 2004, an order was made by an assistant registrar pursuant to an application of the plaintiff, Chiba Marine Yokohama Co Ltd, that the defendants, who are the owners of the vesselMMM Dianaex Able Director, were to exchange affidavits of evidence-in-chief with the plaintiff within ten days, failing which the re-amended defence and counterclaim of the defendants was to be struck out and judgment entered against them for a certain sum, as well as interest and costs. I will refer to this order as “the Unless Order”. An “unless” order is legal parlance to describe an order which compels a party to do or refrain from doing something, usually within a time frame, and, unless he complies, a very serious consequence will follow. 2For reasons which I need not go into, the defendants failed to exchange all their affidavits of evidence-in-chief by the deadline stipulated or by the extension of time which both sides agreed to, although the defendants did do so thereafter. Consequently, the plaintiff submitted papers to obtain a default judgment pursuant to the Unless Order and obtained a judgment dated 24 June 2004 (“the Default Judgment”). 3The defendants then filed a notice of appeal to a judge in chambers in the High Court on 30 June 2004 to appeal against the Default Judgment and to set it aside. The appeal came up for hearing before me on 14 July 2004. I decided that the correct procedure was for the defendants to file an application to be heard by the registrar for an extension of time to comply with the Unless Order and to set aside the Default Judgment. I made no order on the appeal with costs to be paid by the defendants. I set out below, my reasons as this decision will affect parties beyond the present case.",
        "Arguments and my reasons": "4Mr Oon Thian Seng, counsel for the defendants, submitted that the appeal was the correct procedure, relying on a decision by Amarjeet Singh JC inChanghe International Investments Pte Ltd v Banque International A Luxembourg Bil (Asia) Ltd[2004] 4 SLR 449. 5Mr Oon also said that he had another matter in which his clients were ordered to provide further and better particulars by a deadline. They did so, or so he believed, but the other side contended that they had not. As a consequence, a default judgment was obtained by the other side pursuant to an “unless” order. Mr Oon then applied to the registrar to set aside that default judgment. However, on the hearing of that application, an assistant registrar drew Mr Oon’s attention to the said judgment of Singh JC and said Mr Oon should, instead, file a notice of appeal against that default judgment to a judge in chambers in the High Court. He did so and the appeal was heard by a judge without reservation. However, Mr Oon accepted that neither side had raised the point before the judge as to whether such a procedure was correct or not, presumably because the assistant registrar had already said that that was the correct procedure. 6Mr Derek Tan, counsel for the plaintiff, submitted that the facts inChanghe Internationalwere different from those in the case before me. He submitted that the correct procedure was for the defendants to file an application before the registrar to set aside the default judgment. He also submitted that inFuji Xerox Singapore Pte Ltd v Creative Circle Pte Ltd[2004] SGDC 137, that was the procedure adopted in the subordinate courts,ie,the application to set aside the default judgment was made to a court of concurrent jurisdiction as the court which made the “unless” order. However, Mr Tan accepted that the issue as to whether this was the correct procedure was not raised inFuji Xerox. 7I agreed that the facts inChanghe Internationalwere different from those before me. In that case, the plaintiffs defaulted on an “unless” order. Instead of filing the necessary papers with the Registry of the High Court to obtain an order dismissing the claim, the defendants there filed aninter partesapplication to seek such an order. When that application came up for hearing, the plaintiffs’ counsel appeared and presented his submission before an assistant registrar. His submission did not succeed and the assistant registrar made an order dismissing the claim (“the Dismissal Order”). The plaintiffs did not appeal. 8Subsequently, the plaintiffs engaged new solicitors. Their new counsel then made an application to the registrar to set aside the Dismissal Order. At the hearing of that application, the defendants’ counsel submitted that the plaintiffs should have appealed instead, and that the effect of the latest application was in fact an appeal to a fellow assistant registrar to overturn the Dismissal Order made by an assistant registrar. The assistant registrar who heard that latest application dismissed it on the point of jurisdiction without hearing the merits. The plaintiffs then appealed and Singh JC agreed with the decision below. He said at [4] that: Procedurally, the assistant registrar could not entertain the plaintiffs’ application and could not normally vary another assistant registrar’s order. He lacked jurisdiction to do so. 9It was this part of Singh JC’s judgment that Mr Oon was relying on when he submitted that an assistant registrar would have no jurisdiction to set aside the Default Judgment. 10In my view, when Singh JC said that an assistant registrar could not normally vary another assistant registrar’s order, this was in the context of an application for which an assistant registrar was effectively being asked to give a different ruling on a point which had already been argued before and decided by another assistant registrar. Indeed, it is not unusual for an assistant registrar to make an order extending a deadline imposed by an earlier order made by another assistant registrar or, for that matter, the same assistant registrar. There is no question of a lack of jurisdiction to do so and I did not see why there was a lack of jurisdiction because an “unless” order was involved. 11Likewise, if a judge makes an “unless” order and a party defaults in compliance thereof, the practice is for the defaulting party to make an application to a judge for an extension of time and, if a default judgment or order has been made, to set aside the same as well. The judge’s jurisdiction to do so has been accepted thus far. If Mr Oon were correct in his submission, such an application would have to be made to the Court of Appeal for want of jurisdiction by the judge. 12I was of the view that the substance of what the defendants were seeking was an extension of time so as to set aside the Default Judgment. Put in another way, there would be no legal basis to set aside the Default Judgment if no extension of time were granted. The deadline under the Unless Order would remain unless varied by an extension of time. 13The defendants’ alternative course of action might have been to appeal against the Unless Order itself. This they did not do and the time for doing so had passed. 14In the circumstances, I concluded that a registrar, including an assistant or deputy registrar, has jurisdiction to hear an application for an extension of time and to set aside the Default Judgment. It is only after a decision is made thereon that an appeal may be made to a judge against that decision. No order made on defendants’ appeal."
    }
}