{
    "case_title": "Wong Ah Chen and Another v Wong Yack Yoon and Another",
    "ncitation": "[2004] SGHC 235",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "1          On 11 February 2004, Wong Ah Chen and Goh Yew Pong (“the Applicants”) filed this originating summons (“the Application”) seeking the following orders: (a)            a declaration that the Applicants are owners of a one-half equal undivided share of Lot 1031N of Mukim 24; (b)            that Wong Yack Yoon and Ho Choon Mun (“the Respondents”) at their cost and expense do remove a white wall and an extension thereto within seven days from the date of the order herein; (c)            that the Respondents do deliver vacant possession of Plot “A” as per annexure “AA” of the Application, being the undivided one-half equal undivided share of Lot 1031N of Mukim 24; (d)            that boundary walls be constructed along the common boundary of Plots “A” and “B” as per annexure “AA” of the Application at the cost and expense of the Respondents. 2          The Application came up for hearing before me on 28 June 2004. I granted an order in terms of prayers (a) and (b) above with costs to the Applicants but adjourned prayers (c) and (d), pending clarification from the Singapore Land Authority (“SLA”). As the Respondents have filed a Notice of Appeal (in Civil Appeal No 56 of 2004) against my decision, I set out my reasons now.",
        "The facts": "3            Number 16 Lorong 1 Geylang, Singapore, now known as No 4 Jalan Ayer (“the Ground Floor Flat”), and No 16A Lorong 1 Geylang Road, Singapore, now known as No 4A Jalan Ayer (“the First Floor Flat”) are two self-contained flats which, together with the vacant land in front and at the rear, were constructed on Lots 419-11 and 419-18 of Mukim 24. These two lots are now comprised in Lot 1031N of Mukim 24 (“the Lot”). 4          The Respondents own the Ground Floor Flat while the Applicants own the First Floor Flat. The Applicants have occupied the Ground Floor Flat since 25 December 1994 as a residence. The first Applicant (who is 61 years of age) also conducts his acupuncture, massage therapy and Chinese medicine business at the Ground Floor Flat. 5          Before proceeding further, it is necessary at this juncture to trace the titles of the parties to the Lot and to their respective flats.",
        "The Applicants’ title": "6          By a lease dated 22 June 1958 (“the First Lease”), Melodies Limited (“the Lessors”) granted a lease to Yim Lei Shong (“the First Lessee”) of the Ground and First Floor Flats, for a term of 9,999 years from 1 January 1958, together with a one-half undivided share of and in the freehold of the land on and over which the flats were constructed. The flats were described in the First Lease as “the demised premises”. A copy of the First Lease was registered in the Registry of Deeds in Vol 1359 No 8. 7          Under the First Lease, the Lessors and the First Lessee undertook certain covenants. The relevant ones are contained in the following clauses: 3(11) The Lessee hereby covenant[s] with the Lessors as follows:- Not to assign this Lease without at the same time conveying to the purchaser for no further consideration the Lessee’s whole share in the freehold land on or over which the demised premises are constructed. 4(1) That the Lessee performing and observing the several covenants and stipulations herein on the part of the Lessee contained shall peaceably hold and enjoy the demised premises during the term hereby created without any interruption by the Lessors or any person lawfully claiming under or in trust for them. 4(2) Immediately after the completion of this Lease and of a similar Lease of the ground floor flat in the building the Lessors will convey to the Lessee for no further consideration a one half equal undivided share of and in the freehold estate in the land on which the building containing the demised premises is constructed. 8          The schedule to the First Lease stated: All that the flat on the first floor of the building known as No 16/16A, Lorong 1 Geylang Road, Singaporeand the vacant land in the front and at the rear thereoferected on land situate in the District of Kallang in the Island of Singapore being part of the land marked on the Government Resurvey Map as Lot 419-11 & 419-18 of Mukim XXIV and part of the larger piece of land comprised in Grant No 24 and more particularly delineated and edged red on the plan annexed hereto (subject to the rights in favour of the owner of the first floor flat herein before contained) which said flat is known as No 16A Lorong 1 Geylang Road aforesaid. 9             Contemporaneous with the First Lease, the parties executed an indenture (“the First Indenture”) whereby the Lessor conveyed to the First Lessee, in consideration of the First Lease, a one-half undivided share of and in the said land and premises (described in the First Schedule as No 16/16A Geylang Road) to hold the same unto the First Lessee in fee simple, subject to the existing Leases of 9,999 years, of the Ground and First Floor Flats in the said building. Clause 1 of the First Indenture went on to declare that the said leases “shall not merge in the freehold estate hereby conveyed”. A copy of the First Indenture was registered in the Registry of Deeds in Vol 1359 Nos 9 and 11 on 26 October 1959. 10        On 21 December 1994, the First Lessee executed in favour of the Applicants, as joint tenants in fee simple, an assignment and conveyance (“the Assignment”) of the premises and land described in the First and Second Schedules for the unexpired residue of the term of 9,999 years created by the First Lease. The First Schedule to the Assignment stated: All that flat situate on the first floor of the building known as Nos 4 and 4A, Jalan Ayer, Singapore, erected on the land more particularly described in the Second Schedule hereto which said flat is known as No 4A, Jalan Ayer Singapore. 11        The relevant extracts of the Second Schedule to the Assignment reads: ALL that one equal undivided half (½) share of and in the piece of land situate in the District of Kallang in the Republic of Singapore … and marked on the Government Resurvey Map as Lot 1031 of Mukim 24 which said piece of land forms part of the land comprised in Grant No 24 together with the benefit of but subject to the restrictive and other covenants and conditions in an indenture of Conveyance dated the 22ndday of June, 1959 ... and made between Melodies Limited of the one part and the [First Lessee] of the other part TOGETHER with the rights of way and other rights and easements appurtenant thereto AND TOGETHER ALSO with the building erected thereon and known as Nos 4 and 4A, Jalan Ayer, Singapore. 12        The Certificate of Title (“the CT”) issued to the Applicants on 12 October 2001 contained the following Memorial: The registered proprietor of each strata lot owns a share in MK24-1031N whilst the “Interest/Encumbrance” registered on the CT contained the following remarks: 1 Lease Volume 1359 Number 11 registered in the Register of Deeds on 26/10/1959 Part of MK24-1031N now known as Whole of MK24-U34843N Lease Volume 1359 number 11 registered in the Register of Deeds on 26/10/1959 Lessee Tenants in common in equal shares1            (Shares: ½)Wong Yack Yoon2            (Shares: ½)Ho Choon Mun Lease duration: 9999 years Commencement date: 01/01/1958 Subsidiary Certificate of Title Volume 48 Folio 157 issued on 12/10/2001 Lease Volume 1359 Number 8 registered in the Register of Deeds on 26/10/1959 Part of MK24-1031N now known as Whole of MK24-U34844X 2 Lease Volume 1359 Number 8 registered in the Registry of Deeds on 26/10/1959 Lessee Joint tenantsGoh Yew PongWong Ah Chen Lease duration: 9999 years Commencement date: 01/01/1958 Subsidiary Certificate of Title Volume 48 Folio 158 issued on 12/10/2001 13        The Subsidiary Certificate of Title (“the SCT”) registered in Vol 48 Folio 158 issued to the Applicants on 13 March 2002 contained the following particulars: Ref No: C/200115518 Pursuant to: Volume 1359 Number 8 This is to certify that the person described as proprietor hereto is the registered proprietor of the Private Leasehold Estate and Land … SUBJECT also to the encumbrances and interests registered or notified in this folio ... Estate and land description Private Leasehold Estate Land tenure: Leasehold Estate Lease duration: 9999 years Commencement date: 01/01/1958 Deed: LEASE Volume 1359 Number 8 Reversionary Estate Land Tenure: ESTATE IN FEE SIMPLE Strata Title No: Grant 24 State Title Date: 18/03/1852 Title District: KALLANG Reversionary Title: CT Volume 588 Folio 148 14        The SCT also contained the following particulars: Lot Area MK24-U34844X Particulars of Proprietor and Address Joint tenants: ID No: S0469175Z Name: Goh Yew Pong Address: 4A, Jalan AyerSingapore 389142 Citizen of Singapore ID No: S2126311G Name: Wong Ah Chen Address: 4A Jalan AyerSingapore 389142 Citizen of Singapore 15        The following Memorial appeared in the SCT: The within Registered Proprietor’s share in the whole of the land lot(s) MK24-1031N is 1 out of 2 shares. 16        The Applicants had engaged a registered surveyor Tang Tuck Kim (“the Surveyor”) to survey the land. The Surveyor confirmed in November 2003 that the Lot consisted of 2,095 sq ft, which area corresponded with that stated as 2,100 sq ft in the First Schedule to the Indenture. Converted to metric measurements, 2,095 sq ft is equivalent to 194.6m², as reflected in the area for the Lot stated in the CT.",
        "The Respondents’ title": "17        The first Respondent is the mother of the second Respondent. The Respondents’ title to the Ground Floor Flat can be traced back to an initial lease also dated 22 June 1959 (“the Second Lease”) granted by the Lessor to Phoon Ah Looi (“the Second Lessee”) for a term of 9,999 years, also from 1 January 1958. The schedule to the Second Lease contained the exact same wording as the schedule to the First Lease ([8]supra) save that the last few lines stated “which said flat is known as No 16 Lorong 1 Geylang Road aforesaid”, instead of referring to No 16A Lorong 1 Geylang Road. 18        By an indenture dated 11 July 1961 (“the Second Indenture”), Phoon Ah Looi sold her interest in the Ground Floor Flat to the first Respondent and one Kwan Ah Mei (“Kwan”). By a subsequent indenture dated 8 July 1978 (“the Third Indenture”), Kwan sold her interest in the Ground Floor Flat to the second Respondent. 19        The SCT of the Ground Floor Flat (MK24-U34843N) was registered in Vol 1359 No 11 whilst its reversionary estate contained the exact same particulars and registration numbers as for the First Floor Flat ([13]supra). 20        Like the First Floor Flat, the SCT issued for the Ground Floor Flat contained the following endorsements: CAUTION - AREA There is no area and plan reference shown for the within strata lot as the strata lot has not been surveyed CAUTION - TITLE SUBJECT to any interest which may have affected the land at the date of issue of the Certificate/s of Title described as follows: WHOLE of MK24-U34843N Certificate/s of Title: Volume 588 Folio 148 issued on 12/10/2001 Root lot/s: MK24-1031N Date of Cancelled Conveyance pursuant to which Certificate of Title is issued - 21/12/1994 (Volume 2685 number 125) 07/09/1999 (Volume 2781 Number 77) 21        Under the heading “Interest/Encumbrance” the following remarks appeared in the SCT: 1 Subject to the RESTRICTIVE COVENANTS contained in/referred to in Volume 1359 Number 9 registered in the Register of Deeds on 26/10/1959 2 Subject to the RESTRICTIVE COVENANTS contained in/referred to in Volume 1359 Number 12 registered in the Register of Deeds on 26/10/1959 Notified on 12/10/2001 3 DEED OF CAVEAT Volume 2780 Number 165 registered in the Register of Deeds on 08/09/1999 I should point out at this juncture that whilst the Applicants disclosed all their title deeds to the Lot, the first Respondent (who filed a substantive affidavit on the Respondents’ behalf) only exhibited the Second Lease and Second Indenture but not the CT or SCT. She relied instead on the Applicants’ documents to oppose their application. The SCT of the Respondents was only produced after my request for the same from their counsel.",
        "The dispute": "",
        "The Applicants’ version": "22        The Applicants alleged that soon after they moved in, the Respondents built a white wall just in front of the entrance leading to the First Floor Flat. Very often, the Respondents’ two cars would occupy most of the space in the front leaving inadequate room for the Applicants to park their car. However, in order to avoid confrontation, the first Applicant claimed that he would park his car immediately behind the Respondents’ wall, on the Applicants’ side of the Lot. However, due to the length of the wall, the back portion of his car extended into the main road and was hit by other vehicles. 23        Further, the Ground Floor Flat was occupied by Professional Safety Driving Centre (“the Driving School”), a driving school which had many cars which occupied the entire front portion of the Lot. On the few rare occasions when the first Applicant was able to find a parking spot, the driving school instructors would deliberately park their cars next to his, thus preventing him from moving his car until he called the police and they then moved their cars. 24        On 29 July 2003, the first Applicant moved his car from the front part of the Lot to a public car park as a film crew was doing some shooting there. Later, when he drove his car back, he found a pile of sand and bricks stacked at the spot where he used to park his car. He asked the Driving School’s representatives to remove the materials but they refused. Although he lodged a police report, the first Applicant deposed he was averse to a confrontation with the Respondents. Hence, he stopped parking his car at the front of the Lot thereafter. Instead, he parked at a nearby public car park which cost him $8.50 per day, between 8.00am to 5.00pm. If that car-park was full (due to customers patronising the food stall next to his flat), he had to park at a car park of the Housing Development Board, which was about a kilometre away. Between 29 July 2003 and 5 February 2004, the first Applicant deposed he incurred parking charges of about $1,402.50 25        The first Applicant added that in August 2003, the Respondents extended the white wall by building another white wall just in front of the entrance to the First Floor Flat. Although his solicitors gave notice to the Respondents to remove both walls as the structures caused obstruction and were a fire hazard, they refused. The walls also attracted bird droppings and flies and were a health hazard. 26        The first Applicant deposed he placed two sticks at the front of the entrance to the First Floor Flat to prevent obstruction from cars of the Driving School. However, the sticks were removed on 1 October 2003 and the Driving School parked its cars directly at the front of his entrance. He lodged a police report on the incident. 27        The first Applicant deposed to more unpleasant incidents between himself and the Respondents and/or the Driving School which finally prompted the Applicants to file the Application.",
        "The Respondents’ version": "28            According to the affidavit filed by the first Respondent, when she and Kwan purchased the Ground Floor Flat in 1961, there was an existing metal fence where the white wall and extension presently stood. When Kwan sold her interest to the second Respondent in 1978, the vacant land in front of the Ground Floor Flat was a garden. The first Respondent deposed that as a result of wear and tear, the existing metal fence was removed and a brick wall built in its place. At the same time, she decided to cement and tile the garden area in the front. In 1991, the Respondents decided to demolish the brick wall and they erected, in its place, a new white wall measuring about 8ft. 29        The first Respondent deposed that when the Applicants first moved in sometime in 1994, they did not own a car and raised no objections to the new white wall. The relationship between the parties was cordial. It was only between 1997 and 1999 that the Applicants acquired a car. Trouble started after the first Respondent rented out the Ground Floor Flat to the Driving School in March 2002. 30        In or about July 2003, the Respondents noticed that the Applicants’ daughter had acquired a new car which she parked behind the white wall. Initially, the daughter drove the car to work but later did not, choosing to take the MRT instead. The first Respondent alleged that without her consent or that of her son, the Applicants in August 2003 engaged contractors to demolish about 3ft of the white wall and to insert two metal poles into the ground in the vacant land directly in front of the Ground Floor Flat. She alleged that the metal poles encroached into the vacant land, exhibiting photographs in her affidavit in support thereof. 31        Police were called in September 2003 and although the first Applicant complained that the white wall encroached onto her property, the police pointed out that in fact it was the two poles which encroached onto the area of the Ground Floor Flat. The police advised her to remove the poles but the first Applicant refused. In fact, the first Applicant’s act in demolishing the wall caused the Respondents to suffer loss and damage as the Respondents had to engage contractors to extend the white wall by another 5ft and to remove the two metal poles. 32        The first Respondent alleged that the first Applicant’s acts of harassment caused the Driving School to prematurely terminate its lease two months before expiry, namely on 31 January 2004. She deposed that the first Applicant picked fights with and shouted at employees of the Driving School for parking their cars in the vacant land directly in front of the Ground Floor Flat. The first Applicant and or his daughter even parked their car right at the front door of the Ground Floor Flat, blocking entry to the same. The two metal poles inserted by the Applicants also made it difficult for the Driving School’s employees to park their cars.",
        "The arguments": "33            Counsel for the first Applicants relied on her clients’ title ([6] to [16]supra) traced back to the first Lease issued by the Lessors, for her submission that the Applicants had an equal right as the Respondents to use the front portion of the Lot in front of the Ground Floor Flat, but which the Respondents had attempted to deny them. 34  The Respondents, on the other hand, relied on cl 1 of the First Lease for their argument that the Applicants had no such right. The clause reads: In pursuance of the said Agreement and in consideration of the sum of fourteen thousand dollars ($14,000) now paid by the Lessee to the Lessors (the receipt whereof the Lessors hereby acknowledge) and of the covenants on the part of the Lessee hereinafter reserved and contained the Lessors HEREBY DEMISE unto the Lessee ALL THOSE the demised premises together with the full free right and liberty to pass and repass on and over the stairways and passages leading thereto and over the vacant land in front of the building for the purpose of access to and egress from the demised premises … Counsel for the Respondents argued that the Applicants’ right of way over the vacant land in front of the Ground Floor Flat only extended to the right to pass in order to gain access to and from the First Floor Flat. From a comparison of the Schedules to the First and Second Leases, he contended that it was clear that the vacant land, as demarcated by the white wall and extension thereof, belonged to the Respondents. 35        The Respondents went further to contend that the Applicants in fact did not need to even pass or repass the vacant land to gain access to the First Floor Flat as there was a side-gate located behind the white wall and extension which could give them access. They pointed out that they were not given similar rights to pass or repass over the vacant land in front by the Second Lease. They concluded it was because they owned the land. 36        As for the fact that the Surveyor had confirmed that the area of the Lot is 2,095 sq ft and corresponded with the area in the First Schedule of the First Indenture, the first Respondent had dismissed it (in para 42 of her affidavit) as merely “a measurement of the plot of land upon which Nos 4 and 4A Jalan Ayer Singapore were built” and “does not afford the parties any additional rights than what they are entitled to under the relevant leases”. 37        The first Respondent reiterated that the freehold interest which the parties have in respect of the plot of land on which the two flats were built, is subject to the terms and conditions contained in the First and Second Leases during the term of 9,999 years and emphasised that cl 1 of the First Indenture ([9]supra) of both parties clearly stated that the leases shall not merge in the freehold estate thereby conveyed.",
        "The decision": "38        From reading the affidavits filed, I concluded that each side was guilty of some if not all of the misconduct alleged by the other. It could not be said that one party was wholly innocent and the other party wholly guilty. What each side tried to do was to downplay its own wrongful conduct and, at the same time, highlight the other side’s wrongful acts. However, these observations had no relevance to and hence no bearing on my decision. 39        I had rejected the Respondents’ arguments on the legal position and ruled in the Applicants’ favour, as the Respondents’ stand reflected their misconception of what their title to the Ground Floor Flat encompassedvis-à-visthe Applicants’ title to the First Floor Flat. 40        There are two aspects to be considered in relation to the parties’ title: first, their leasehold interests in the Ground Floor and First Floor Flats and second, the conveyance to them of the common property comprised in the Lot. 41        By way of background, I should point out that originally the parties’ title to their flats was a common law title, registered under the Conveyancing and Law of Property Act (Cap 61, 1994 Rev Ed) (“the Act”). The title of the parties was brought under the Land Titles Act (Cap 157, 2001 Rev Ed) in October 2001. Following the conversion and pursuant to the Land Titles (Strata) Act (Cap 158, 1999 Rev Ed) (“the Strata Act”), the SCTs were issued for their respective flats. 42        The Strata Act first came into law on 15 May 1968, well after the Lessors granted the First and Second Leases. Consequently, when the Lessor wanted to transfer the common property at the front and rear of the Lot to purchasers of its flats such as the First Lessee, the only way it could be done in June 1958 was by way of a separate conveyance, as evidenced in the First Indenture. The First and Second Leases were granted for a term of 9,999 years. Logically therefore (and as was reflected in the schedule to the First Lease ([8]supra), the conveyance was subject to and could not be for a longer term than either Lease. Hence, both schedules of the First and Second Indentures state that “the said leases shall not merge in the freehold estate hereby conveyed”. 43            Counsel for the Respondents had conceded at the outset of the hearing that the area of 2,100 sq ft or 194.6m² stated on the CTs was more than the built-in areas of the First Floor or Ground Floor Flats. That being the case, the area of 2,100 sq ft of each flat in the building must include the vacant land at the front and at the rear of the Ground Floor Flat, over which the Applicants were given a right of way for access to and regress from the First Floor Flat. The difference between the built-in area of each flat and 2,100 sq ft or 194.6m² consisted of the common property. 44        My view is reinforced by the fact that the CTs of both parties were made subject to the (same) restrictive covenants contained in the First and Second Indentures registered on 26 October 1959 and both title deeds referred to the Lot as the root lot. That would mean that the covenant contained in cl 4(2) of the First and Second Leases ([7]supra) applies. Both parties’ title deeds also contained the same Memorial,vizthat their share in the Lot is one out of two. In this regard I had inquired of counsel for the Respondents that if his argument (that the Respondents own the vacant land in front and at the rear of their flat) was correct, why would the Memorial endorsed on his client’s SCT specifically state that the Respondents’ share (like the Applicants’) in the Lot was one out of two shares; he did not or could not give an answer. 45        An easement at law (which includes a right of way) is defined (inMegarry & Wade: TheLaw of Real Property(Sweet & Maxwell, 6th Ed, 2000) at para 18-042 as “either a right to do something or a right to prevent something”. The Respondents had argued (see [35] above) that the Second Lease did not contain a similar right of way for them over the vacant land in front of the Ground Floor Flat as that given to the Applicants in the First Lease. They interpreted that to mean they owned the vacant land. I accepted the submission of counsel for the Applicants that the Respondents’ argument is misconceived. They were not given a similar right of way because their flat was on the ground floor and it was unnecessary for them to have such a right. 46        Yet another misconceived argument by the Respondents pertained to the cancellation of certain words in the schedule to the First Lease ([8]supra). For ease of explanation, I append below the relevant extracts from the schedule: ALL THAT the flat on the first (/ground) floor of the building known as No 16/16A, Lorong 1 Geylang Road, Singaporeand the vacant land in the front and at the rear thereoferected on land situate in the District of Kallang in the island of Singapore being part of the land marked on the Government Resurvey Map…(subject to the rights in favour of the owner of the first floor flat herein before contained) which said flat is known as No 16A(/16) Lorong 1 Geylang Road aforesaid. Counsel for the Respondents pointed out that the deletions did not appear in the schedule to the Second Lease of his clients because his clients owned the vacant land in the front and at the rear of their flat. 47            Counsel for the Applicants countered that the First and Second Leases dealt with the 9,999-year term granted for the two flats and not the ownership of the vacant land, which was dealt with in the First and Second Indentures. I accepted this submission. The Respondents’ argument in [46] above showed their complete lack of understanding of theright of wayexpressly granted by way of cl 1 ([34]supra) in the First Lease and the Applicants’ownershipof the common property comprised in the Lot; the latter has nothing to do with the former. 48        Even on the Applicants’ right of way over the vacant land, counsel for the Respondents sought to put a restrictive interpretation, contending that it was limited to foot traffic to gain access to and regress from the First Floor Flat, and did not extend to parking their car there. As I could not find any words of limitation to that effect in the right of way granted in cl 1 of the First Lease ([34]supra), I rejected this argument. 49            Counsel for the Respondents added that if the Applicants’ easement extended to vehicular traffic (which he disputed), parking their car at the front on the vacant land would obstruct access by the Respondents to the Ground Floor Flat, which would not have been the intention of the Lessors or the First Lessee. I considered this argument a spurious excuse for the Respondents’ act of constructing and extending a wall and dismissed it without more. Again, this argument ignored the Applicants’ ownership of the common property in the Lot. 50        The Respondents’ counsel had relied on three cases for his argument that the Applicants’ right of way should be strictly construed. I turn now to his authorities starting with the local case ofLim Hong Seng v East Coast Medicare Centre Pte Ltd[1995] 2 SLR 685. There, the owner of a property known as Land A made a claim in adverse possession on Land B, which was part of a plot (Land C) which was adjacent to Land A. After commencement of proceedings, the plaintiff’s solicitors conducted further searches and discovered that an express grant of a right of way had been made when Land A was carved out of Land C. Judith Prakash JC dismissed the plaintiff’s claim based on adverse possession but declared that he had a right of way with or without motor cars and other vehicles. The court arrived at its decision by interpreting the wording in the 1933 conveyance which contained the grant creating the right of way. 51            Similarly, inLondon and Blenheim Estates Ltd v Ladbroke Retail Parks Ltd[1993] 1 All ER 307, the Chancery Court interpreted the words in a particular clause in a transfer document to determine whether a right of way in favour of the plaintiff purchaser had been created and, if so, the extent of that easement. 52        The above authorities cited by the Respondents, together with the third case ofBulstrode v Lambert[1953] 2 All ER 728, all touched on whether words contained in conveyancing documents created rights of way and if so, the extent of those rights. Even if the Applicants’ right of way to the First Floor Flat was restricted to foot traffic, their share (one out of two) in the Lot (which can only be the vacant land at the front and at the rear of the two flats) meant they had an equal right to use the common property and by parity of reasoning, an equal right to park their car at the vacant land as the Respondents. 53        It was apparent from the first Respondent’s affidavit and their counsel’s submissions, that the Respondents had completely disregarded and/or overlooked the Applicants’ ownership of the common property. The Application related to the Applicants’ ownership of the Lot; it had nothing to do with the First Lease and the easement created by it. 54            Accordingly, I granted prayers (a) and (b) of the Application but adjourned prayers (c) and (d) pending clarification from the SLA, for the reason that the title deeds of both parties stated that no survey had been conducted by the SLA to determine the area comprised in each party’s SCT."
    }
}