{
    "case_title": "Mopi Pte Ltd v Central Mercantile Corp (S) Ltd",
    "ncitation": "[2004] SGHC 41",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "2          The plaintiffs, Mopi Private Limited (“Mopi”), who market adhesive tapes, had made extensive use of the brand name “Hi-Bond” since 1978. Having spent a substantial amount on promoting the Hi-Bond mark and believing that they were the first in the market to do so, Mopi were taken aback when CMC tried to register “Hi-Bond” as a trade mark. A private investigator made a “trap purchase” of 72 rolls of masking tape bearing the “Hi-Bond” mark and 144 rolls of double-sided tape bearing the same mark from CMC on Mopi’s behalf. Mopi then commenced Suit No 637 of 2000 against CMC for acts of passing-off. Mopi sought damages as well as an injunction to restrain CMC from passing off or attempting to pass off products as “Hi-Bond” products. 3          In their counterclaim, CMC contended that they were entitled to sell Hi-Bond products and that Mopi had infringed their registered trade mark. They further alleged that Mopi had committed acts of passing off by selling products bearing the name “Hi-Bond” as well as four other trade marks, namely “Kawasaki”, “Senisui”, “Star” and “Nikko”. After the trial, Lai Siu Chiu J ruled that Mopi were in fact the wrongdoers. She thus dismissed their claim and ordered them to pay damages to CMC for acts of passing off. Damages were to be assessed by the assistant registrar. To date, this task has not been completed. 4          For the purpose of assessment of damages by the assistant registrar, Mopi voluntarily disclosed a number of their suppliers’ invoices. Mopi left the figures in the invoices intact but they blanked out the suppliers’ names. CMC sought an order that the names in the suppliers’ invoices be disclosed. This was not granted by the assistant registrar. CMC appealed against the assistant registrar’s decision. S Rajendran J allowed the appeal but he ordered CMC to give an express undertaking with respect to the disclosed documents in the following terms: The Defendant to undertake that it will after the conclusion and final completion of the assessment inquiry, including all appeals, (i)         not use or disclose the documents or information given in discovery by the Plaintiff for the assessment inquiry or the information contained therein to any third party except with the leave of the Court; and (ii)        return to the Plaintiff copies of all the aforesaid documents belonging to the Plaintiff and not to make or keep copies of the same. 5          Notwithstanding their express undertaking, and even before the assessment of damages in Suit No 637 of 2000 has been completed, CMC applied for leave to use the documents in question for the purpose of commencing civil and criminal proceedings against third parties, and more specifically against, among others, Mr Lim Yew Hin, Mopi’s director, and Mopi China Pte Ltd, a company related to Mopi. Their application was understandably strenuously resisted by Mopi.",
        "Whether or not leave should be granted": "6          At the outset, it ought to be noted that although CMC sought leave to use documents discovered during the trial and assessment of damages for the purpose of initiating and prosecuting civil and criminal proceedings against third parties, it was clear that they were only interested in the documents discovered during the assessment of damages. 7          It is trite law that a party seeking discovery of documents gives an implied undertaking that he will make use of the documents only for the purposes of the action in which they are disclosed. As such, documents obtained during discovery in a case cannot, without the leave of the court, be used in another case. InRiddick v Thames Board Mills Ltd[1977] QB 881at 895–896, Lord Denning MR explained in the following succinct terms why there is an implied undertaking to this effect by a person obtaining the documents: Discovery of documents is a most valuable aid in the doing of justice. The court orders the parties to a suit – both of them – to disclose on oath all documents in their possession or power relating to the matters in issue in the action. Many litigants feel that this is unfair. ... The reason for compelling discovery of documents in this way lies in the public interest in discovering the truth so that justice may be done between the parties. … Compulsion is an invasion of a private right to keep one’s documents to oneself. The public interest in privacy and confidence demands that this compulsion should not be pressed further than the course of justice requires. The courts should, therefore, not allow the other party – or anyone else – to use the documents for any ulterior or alien purpose. Otherwise the courts themselves would be doing injustice. 8          The so-calledRiddickprinciple has been adopted in Singapore on innumerable occasions. It has been held that it may be relied upon by third parties who are sued on the basis of documents obtained during discovery in another case (see, for instance,Sim Leng Chua v Manghardt[1987] SLR 205). 9          Admittedly, theRiddickprinciple is not an absolute one. InMicrosoft Corp v SM Summit Holdings Ltd[1999] 4 SLR 529 at [36], L P Thean JA reiterated that the implied undertaking not to use documents obtained during discovery in another case may be varied in appropriate situations. While the undertaking may be varied, courts should exercise the discretion to allow documents disclosed in one case to be used in another case with caution so as not to undermine the effect of the implied undertaking. InMicrosoft Corp v SM Summit Holdings Ltd (No 2)[2000] 1 SLR 343 at [31], Yong Pung How CJ said that an application to vary the implied undertaking will only be granted in “very exceptional circumstances”. In similar vein, inCrest Homes Plc v Marks[1987] AC 829at 860, Lord Oliver of Aylmerton made it clear that “the court will not release or modify the implied undertaking given on discovery save in special circumstances and where the release or modification will not occasion injustice to the person giving discovery” and inHalcon International Inc v The Shell Transport and Trading Co[1979] RPC 97at 121–122, Megaw LJ endorsed the view that disclosure of documents in other proceedings should only be authorised where there are “very strong grounds for making an exception to the general rule”. 10        In the present case, note must be taken of the fact that apart from the implied undertaking, CMC were also ordered by Rajendran J to furnish an express undertaking that they will not use or disclose the documents in question to any third party without the leave of the court. Furthermore, this express undertaking was strengthened by a further order that CMC were to return all copies of the said documents to Mopi and were not to make or keep copies of the same. The circumstances under which Rajendran J ordered Mopi to disclose the suppliers’ names cannot be overlooked. According to the notes of the assistant registrar at the hearing below, Mopi’s counsel, Mr Tony Yeo, put the position as follows: At the discovery stage for assessment of damages, we had applied for certain parts of the documents to be blanked out, but we left the numbers in, because [these were] important for [the assessment of damages]. Defendants’ submission was that [the blanked out information] was needed to know who the suppliers are,because if [the supplier] was a sister company, [this] might affect the calculation because those profits could have been shared, instead of all going to one party. [The assistant registrar] allowed the blanking out. Rajendran J felt that the assessing party should have full and frank disclosureto properly calculate the damages. We submitted then that we did not believe that was the only reason for the blanking to be removed because [we] believed it would be used for other proceedings, and [be] an abuse of process. Rajendran J saidRiddickapplied. But he ordered the [express] undertaking to allay our fears. [emphasis added] 11        It appears from the assistant registrar’s notes that Mr Yeo’s version of the arguments before Rajendran J was not contradicted in any way. At the hearing before me, Mr Yeo’s recollection of events, as recorded by the assistant registrar, was also not challenged. In the light of the arguments put to him, the undertaking that CMC was ordered to furnish by Rajendran J is rather telling. Although the judge accepted that theRiddickprinciple applied to the documents in question and there was already an implied undertaking that the documents could only be used for the assessment of damages in this case, he ordered CMC to furnish an express undertaking along the lines of theRiddickprinciple. More importantly, he ordered CMC to undertake to return copies of all these documents and not to make or keep copies of the same. Evidently, the judge intended that CMC were to have temporary custody of the suppliers’ invoices that were disclosed during the assessment of damages. If not, he would not have ordered CMC to return copies of all these documents to Mopi after the assessment of damages and not to make or keep copies of the same. To grant leave to CMC to use the said documents for another action against third parties would negate the effect of their undertaking to return all the said documents to Mopi. 12        CMC contended that they had a legitimate right to pursue those who infringed their trade mark and they relied onJade Engineering (Coventry) Limited v Antiference Window Systems Limited[1996] FSR 461. However, it should not be overlooked that when CMC argued their case for disclosure of the suppliers’ names in the invoices before Rajendran J, they were aware that such a disclosure would reveal that others might have infringed their trade mark. Although they knew that they had a right of action against these other persons, they led Rajendran J to believe that the suppliers’ names in the invoices were only required for the purpose of assessment of damages in order to ensure that the transactions in questions were at arm’s length and not between related companies. If not for this argument, there might have been no need to order the disclosure of the suppliers’ names at such a late stage when all that was left to be done was to assess CMC’s loss. Mopi took the view that the suppliers’ names were unnecessary for the purpose of assessment of damages and they made it clear to Rajendran J that they feared that CMC wanted to have the names for the purpose of instituting other legal proceedings. As the persons liable to be sued by CMC include Mr Lim Yew Hin, Mopi’s director, and Mopi China Pte Ltd, a company related to Mopi, one can understand why Mopi were so keen to blank out the names in the suppliers’ invoices. Although Mopi was unhappy about having to disclose the suppliers’ names, they were mollified when the judge ordered CMC to return all the suppliers’ invoices to them without making any copy of the same after the hearing on assessment of damages. Having got what they wanted on the basis that they were to return all the documents to Mopi after the assessment of damages, CMC sought in this appeal to alter the position altogether. In these circumstances, there were no exceptional or special circumstances or very strong grounds to justify the release of CMC from their implied and express undertaking not to use the documents discovered in Suit No 637 of 2000 for purposes unconnected with that action. 11        As I declined to exercise my discretion to grant CMC the leave sought by them, their appeal was dismissed with costs."
    }
}