{
    "case_title": "Ting Heng Mee v Sin Sheng Fresh Fruit Pte Ltd",
    "ncitation": "[2004] SGHC 43",
    "coram": "Vincent Leow AR",
    "sections": {
        "Introduction": "1          Mr Ting Heng Mee, the plaintiff, was riding his motorcycle with his wife as the pillion rider at about 12.30pm on 14 March 2002.  It was nothing unusual.  They were merely on their way to worship at the Chinese temple at Loyang Crescent.  There was no reason to suspect anything was going to happen as the weather was clear and the traffic was light.  As the plaintiff approached the junction of Loyang Loop, he suddenly lost consciousness.  When he next awoke, he found that he was in Changi Hospital.  He was subsequently informed that he had been in a traffic accident.  The plaintiff stayed in hospital for the next nine days before finally being discharged on 22 March 2002. 2          The plaintiff commenced an action against the defendant, Sin Sheng Fresh Fruit Pte Ltd, being the employer of the lorry driver that had hit the plaintiff.  Interlocutory judgment was subsequently entered against the defendant for 90% liability with damages to be assessed and costs plus disbursements to be reserved to the registrar. 3          The plaintiff suffered injuries mainly to his left arm, right leg and head.  The inpatient discharge summary from Changi Hospital summarised his injuries as: (1)     left elbow dislocation; (2)     degloving injury of the right foot; (3)     periorbital oedema – bilateral; and (4)     multiple abrasion/laceration of neck. 4          In addition to these injuries, the plaintiff also claimed for the following injuries: (1)     right knee hemathrosis; (2)     mild left hand radial/median nerve injury; (3)     fracture of the right 5thmetacarpal; (4)     right ear hearing loss; (5)     partial tear of the supraspinatus tendon with biceps tendinopathy on left shoulder; and (6)     amnesia and cognitive deterioration and impairment of spatial memory as well as impairment of short and long-term visual memory. 5          The plaintiff lastly made claims for: (1)     pre-trial and future loss of earnings/capacity; (2)     pre-trial and future nursing care; (3)     future medical expenses; and (4)     special damages. 6          The hearing before me was to assess the above claims.  At the hearing, the plaintiff called the following witnesses: (a)     Dr Adrian Tan (“Dr Tan” a neurologist) (b)     Mr Ting Heng Mee (the plaintiff) (c)     Mr Lee Loon Kwang (“Mr Lee” the plaintiff’s ex-employer) (d)     Dr Chan Beng Kuen (“Dr Chan” a doctor from Changi Hospital) (e)     Mr David Oon (“Mr Oon” a clinical psychologist) (f)     Dr Marc Tay (“Dr Tay” an eye doctor) (g)     Dr AB John (“Dr John” an ear doctor) 7          The defendants chose not to call any witnesses of their own.  After hearing the plaintiff’s witnesses, I made the following awards: (a)Left elbow dislocation:$6,000(b)Right knee hemathrosis:$1,500(c)Right foot degloving injury:$11,000(d)Mild left hand radial nerve palsy/mild left mediannerve injury:$1,500(e)Partial tear of the supraspinatus tendon with bicepstendinopathy on left shoulder:$13,500(f)Fracture of the right 5thmetacarpal:$1,200(g)Multiple abrasions:$7,000(h)Right occipital and posterior parietal lobe lesion:$20,000(i)Amnesia/cognitive deterioration/impaired spatialmemory/impairment of short and long-term visual memory:$25,000(j)Right ear hearing loss and deterioration of tinnitus:$4,000(k)Pre-trial loss of earnings:$8,400(l)Loss of earnings capacity:$2,500(m)Pre-trial nursing care:$3,300(n)Future medical care:$3,380(o)Special damages:$8,950.38Total:$117,230.38 8          I further awarded interest of 6% from the date of service of writ to the date of judgment for (a) to (j), and interest of 3% from the date of accident to the date of judgment for (k), (m) and (o): seeTeo Sing Keng & Anor v Sim Ban Kiat[1994] 1 SLR 634.  I would just clarify that my awards have not been adjusted to take into account the fact that the defendant is only 90% liable.  I now give my reasons for the amounts awarded.",
        "Background": "9          Before turning to the various heads of damages, I would by way of background just set out some of the more salient facts relating to the plaintiff.  The plaintiff was 68 years old at the date of the accident.  At that time, he was working as a barber at May Tokyo Unisex Hairdressing Salon (“May Tokyo”).  May Tokyo was located at Tampines, just a short distance away from his flat.  After the accident, the plaintiff’s employment was terminated and he has not worked since. 10        I now turn to consider the various heads of damages.  I shall start with the personal injuries before moving on to deal with the loss of earnings, nursing and medical care and special damages.",
        "The heads of damages": "",
        "(a)        Left elbow dislocation": "11        The plaintiff dislocated his elbow in the accident.  This was reduced and treated non-operatively.  As a result of the dislocation, the range of movement of this elbow was 5¡to 130¡.  This was a slight retardation from the normal range of movement of an elbow of 0¡to 130¡.  Dr Chan stated that the pronation and supination was full, but the plaintiff had mild medial collateral ligament laxity.  This, he explained, was normal after a dislocation of the elbow. 12        Mr Fazal referred me toLim Siam Tiang v Tay Tong Hwee Paul(unreported decision of the District Court in DC Suit No 686 of 1989), where the Court awarded $4,000 for the dislocation of the left elbow.  He submitted that this case was applicable to the present facts and conceded that the appropriate award would be higher to take into account the fact that that decision was rendered in 1990. 13        For his part, Mr Robert referred me toLim Kian Chuan v Kong Geok Lin(unreported decision of the District Court in DC Suit No 1451 of 1995) andHairulnizan bin Johari v Tan Quee Seng(unreported decision of the Magistrate Court in MC Suit No 9237 of 1988) where awards of $13,000 and $20,000 respectively were made.  I chose not to apply these two cases as they involved an award not only for the dislocation of the elbow, but also a fracture of the ulna and femur respectively.  Instead, I preferred the earlier authority cited as the injuries suffered were comparable and held that the appropriate amount to award was $6,000.",
        "(b)        Right knee hemathrosis": "14        In respect of this claim, Dr Chan explained that right knee hemathrosis means that there is blood in the right knee joint.  He stated that the cause could be from a fracture around the knee or a tear of the ligament.  However, Dr Chan stated that the x-ray of the right knee ruled out a fracture, but he had conducted no tests as to the integrity of the ligaments.  Dr Chan further opined that the plaintiff possessed a full range of movement of the right knee and that it was likely that his knee injury was minor. 15        Mr Robert referred me toLow Swee Tong v Liew Machinery Pte Ltd(1993) 3 SLR 89, where an assistant registrar had awarded $10,000 for hemathrosis of the knee.  On appeal to MPH Rubin JC (as he then was), this part of the award was not appealed against and Rubin JC thus made no determination as to its appropriateness. 16        Looking at the facts of the present case, I was unwilling to followLow Swee Tongas it was not clear from the case summary tendered what was the extent of the injury suffered.  It  did not state whether the award took into account the underlying fracture (if any).  Further, an award of $10,000 does not seem justifiable in the present case for what Dr Chan had stated as being essentially ‘a swollen right knee’ (see his medical report at PB 17) that does not give the plaintiff any problems.  As such, I was of the opinion that an award of $1,500 would more than adequately compensate the plaintiff for this injury.  In making this award, I took into account the decision (although it is not a Singaporean decision) ofLabaderan a/l Subramanian v Roslee bin Abdul Rahman & Anor(unreported decision of the Johor Bahru Sessions Court dated 6 March 2000) where the plaintiff suffered from knee hematoma and was awarded RM 1,000 for his injuries.",
        "(c)        Right foot degloving injury": "17        Dr Chan had explained that the degloving injury meant that the skin over the dorsum, the top of the foot, was torn and split.  He confirmed that this was a superficial injury as there was no damage to the deeper structures of the foot such as the tendons or the nerves.  However, Dr Chan stated that the degloving had caused tendons on the foot to be exposed and they must have healed with scarring.  This led directly to the plaintiff suffering stiffness in his second toe, weakness of the big toe, numbness over the first web-space of the right foot and the resultant difficulty in wearing shoes.  As a result of this injury, the plaintiff also suffered from hallux valgus with early crossing of the second toe. 18        At this juncture, both parties referred me to a number of cases, but it is only necessary for me to refer toYip Kok Meng Calvin v Lek Yong Han[1993] 2 SLR 139.  There, the plaintiff sustained, in the words of Judith Prakash JC (as she then was), a ‘degloving of the skin with no underlying damage to tendon or bone’ to the ‘dorsum of his right foot’.  In that case, Prakash JC awarded the plaintiff $8,000.  I would however note that Prakash JC noted that the plaintiff did not suffer any ‘serious residual disability’.  In contrast, the plaintiff here suffered from hallux valgus with the early crossing of the second toe.  As such, it is appropriate in this instance to award a total of $11,000 under this head to take into account the plaintiff’s residual disability and the fact that the decision was made in 1993.  This sum also included an award for any future medical expenses (including the non-surgical options stated by Dr Chan).",
        "(d)        Mild left hand radial nerve palsy/mild left median nerve injury": "19        In relation to radial nerve palsy, Dr Chan had explained that during an elbow dislocation, one of the nerves around the elbow such as the radial or median nerve can be injured.  This would give rise to some weakness in the wrist and hand.  Dr Chan further opined that the plaintiff’s radial nerve palsy had already resolved by the time the plaintiff saw him at follow-up.  Dr Chan noted that the plaintiff had complained of residual numbness in his left hand, but a further nerve conduction test showed that the median nerve was normal.  However, Dr Chan qualified his statement on the basis that test results may still be normal even with mild median nerve injury. 20        Mr Fazal referred me toKoh Lu Kuang v Abdul Jalil bin Kader Hussein(unreported decision of the District Court in DC Suit No 4293 of 1998) where the plaintiff had sustained right nerve palsy with facial asymmetry exposure keratitis of the right eye and had been awarded $500 for this injury.  In awarding $1,500 to the plaintiff, I took account of the fact thatKoh Lu Kuangdealt with a facial, rather than limb, injury and the loss of convenience arising from the numbness in the plaintiff’s left hand.  The contention by the plaintiff’s counsel that the award for this injury should be $4,000 each for the radial nerve palsy and the medium nerve palsy was not only excessive, but they also overlapped: seeSeah Yit Chen v Singapore Bus Services[1978] 1 SLR 530for the approach to be taken in assessing damages for overlapping injuries.",
        "(e)        Partial tear of the supraspinatus tendon with biceps tendinopathy on left shoulder": "21        Dr Chan explained that the plaintiff suffered partial tear of a tendon at the left shoulder.  This was treated with physiotherapy and steroid injection.  By the time the plaintiff returned to Dr Chan for a review, the pain had resolved and the plaintiff’s left shoulder movement was fairly good and painless.  He stated that the plaintiff’s gleno humeral movement was normal, his forward flexion (raising of arm) was slightly decreased, his internal rotation (bending of arm downwards from elbow) was decreased to 70¡from the normal movement of 90¡while his external rotation (bending of arm upwards from the elbow) was normal.  Further his supraspinatus and infraspinatus power (muscle power) was slightly diminished.  In conclusion, Dr Chan stated that the ‘limitation of stiffness was mild’, but noted that there was a 30% chance that the plaintiff may require surgery to relieve the pain in his shoulder. 22        Mr Robert referred me toNg Song Poh v Ong Chai Poh @ Ong Chai Pah(unreported decision of the District Court in DC Suit No 5279 of 1990) where the plaintiff suffered from a cut patella tendon with limitation of movement and was awarded $10,000.   In contrast, Mr Fazal referred me to a number of cases, but I felt that all these cases were not on point as they did not deal with a similar injury (instead they dealt,inter alia, with frozen shoulders or fracture of the scapula).  I further felt that Mr Fazal’s contention of $7,000 was low and awarded $13,500 to the plaintiff which took into account the cost of possible future surgery.",
        "(f)        Fracture of the right 5thmetacarpal": "23        Dr Chan stated that there was a healed minimal displaced fracture of the right 5thmetacarpal.  He further asserted that as the injury had healed by the time the plaintiff had complained to him of pain, he was unable to confirm that the fracture was due to the road traffic accident.  However, in response to Mr Fazal’s last query, Dr Chan stated that in the light of the severity of the plaintiff’s other injuries, it is more likely than not that the fracture was sustained during the accident.  In light of Dr Chan’s evidence and the fact that the defence has chosen not to call any expert witnesses of their own on this matter, I was of the opinion that the fracture of the 5thmetacarpal was caused by the accident and the defendants are thus liable for this injury. 24        As for the award, both parties referred me to a number of decisions and it would suffice here to refer toHarinder Singh v Stephen Tan Puay Guan(unreported decision of the Magistrate Court in MC Suit No 15276 of 1988) where the plaintiff suffered a simple fracture of the 5thmetacarpal bone and was awarded $2,500.  Given that the plaintiff here suffered only a ‘minimal displaced fracture’ (like a hairline fracture), I was of the opinion that the appropriate sum to award would be $1,200 and I was further of the opinion that the $6,000 that Mr Robert suggested was clearly excessive and unsupportable by any of the authorities that he had cited.",
        "(g)        Multiple abrasions": "25        The plaintiff had suffered abrasions to his left shoulder, right neck, right knee healed abrasion (6 cm by 3 cm), abrasion with keloid formation over anterior aspect of the right leg (12 cm by 2.5 cm), a 3 cm laceration above his left eyebrow and a transverse scar over the dorsum of his right foot (8 cm) and a healed keloid scar on his left forearm (5 cm).  Mr Fazal submitted that $2,000 was reasonable given the plaintiff’s age and the overlapping nature of these injuries.  It is pertinent to point out that the plaintiff’s age is irrelevant when one considers an award for pain and suffering.  It cannot be said that a 70-year-old man feels any less pain than a 20-year-old.  As for the overlapping nature of the injuries, I would just observe that the injuries here are to differing parts of the body (eyebrow, right neck, left shoulder, left forearm, leg , knee and foot) and it cannot be said that the injuries are so proximately close that it would be preferable to treat them as one injury: per Karthigesu J (as he then was) inLim Xueru & Anor v Lim Kai Meng[1993] 1 SLR 279.  At best, it can only be said that a small discount should be given for the injuries to the left shoulder and forearm.  Having reviewed the authorities on abrasions, lacerations and scars, I was of the opinion that the appropriate award to be made in the circumstances was $7,000.",
        "(h)        Right occipital and posterior parietal lobe lesion": "26        Dr Tan explained that the plaintiff suffered a cerebral contusion and this affected the occipital lobe which controls vision resulting in a visual field defect on the left side which meant that the plaintiff could not see the left side of his visual field.  Dr Tan further stated that this was a neurological problem and was not exacerbated by the plaintiff’s existing cataract problem. 27        Mr Robert referred me toRohaya bte Daud & Ors v Yahya bin Syed Hassan Alsagoff & Ors(unreported decision of the High Court in Registrar’s Appeal No 169 of 1995) where the plaintiff lost the vision of his right eye and was awarded $35,000 by an assistant registrar and this was upheld by Judith Prakash J on appeal.  Mr Fazal for his part referred me toYusof bin Darus v Singapore Bus Services (1978) Ltd(unreported decision of the High Court in Suit No 19 of 1997) where the plaintiff suffered from an injury to the right eye that resulted in visual defects (exact nature was unstated) and he was awarded $18,000.  I felt that neither authority was squarely on point, but it was important to note Dr Tay’s testimony that most patients with the plaintiff’s problem have learnt to live with the problem by tilting their head.  As such, having taken all the circumstances into consideration, I was of the opinion that the appropriate award here should be $20,000.",
        "(i)         Amnesia/ cognitive deterioration/ impaired spatial memory /impairment of short and long-term visual memory": "28        Mr Oon testified that it was his professional opinion that the plaintiff suffered from a severe impairment of his delay spatial memory, significant impairment of his short and long-term visual memory and mild deterioration of his cognitive abilities.  Further, the plaintiff also claims that he has pre and post-accident amnesia. 29        For his part, Mr Fazal submitted most vigorously that no damages should be awarded because there was no evidence to find on the balance of probabilities that the memory loss was caused by the accident.  In particular, he submits that the plaintiff had never complained to Dr Tan of memory loss.  Further, at discharge, the plaintiff had GCS 15 (Glasgow Coma Scale) which meant that the brain functioned normally in terms of alertness and reaction.  In addition, he relied on Dr Tan’s testimony that there was no evidence of damage to the temporal lobes and frontal lobes (which are the parts of the brain that control memory). 30        Mr Fazal also relied on Dr Chan’s testimony that the plaintiff’s head injury appeared to be superficial and that the plaintiff had never complained during any of the follow-up treatments of memory loss (in the six months after the accident). 31        Lastly, Mr Fazal sought to cast doubt on Mr Oon’s testimony by noting that Mr Oon had, under cross-examination, stated that if the plaintiff’s eyesight was as bad as the plaintiff had stated in his affidavit, then it would definitely have affected his assessment of the plaintiff’s performance in the tests that he conducted.  Moreover, Mr Oon had stated that he could not pinpoint that the memory loss was caused by the accident. 32        In my opinion, Mr Fazal’s challenge does not succeed.  Three points must be mentioned.  First, the fact that the plaintiff did not complain initially to his doctors is not necessarily fatal to his claim.  This must depend on the individual circumstances of the case.  Here, the plaintiff had suffered a rather traumatic accident that had resulted in serious injuries.  As such, it would not be out of one’s ordinary expectations for the plaintiff to have failed to notice his memory problem.  Further, the loss of memory may not have been so obvious in the first few months when the plaintiff was just recovering and resting at home.  It must be noted that neurological functioning can deteriorate over time – meaning that the fact that the plaintiff did not complain initially does not mean that complications would not develop subsequently.  As such, I discounted the fact that the plaintiff had only complained about his memory loss subsequently. 33        Second, the fact that there was no evidence of damage to the brain was not fatal to the plaintiff’s claim.  This is because no CT scan of the head was conducted.  As such, just as there was no evidence that there was damage to the brain, there was also no evidence that there was no damage.  On this note, I would just set out Mr Oon’s rather candid testimony which explains how he can determine that there has been memory loss even if there was no injuries to the brain: Q  :       Err, Mr Oon, I asked a neurologist (Dr Adrian Tan) to look at all the medical records and whether he sustained an injury that would affect his memory?  He said no, only his vision. A  :       Neuro-psychological tests tap the soft neurological science.  Meaning you get him to do things, to recall.  Not the hard neurological science which looks to the brain itself.  The injuries to the brain.  But unfortunately, this neurological science looks to memory, cognitive deterioration and true performance of the test. 34        Third, I was of the opinion that Mr Fazal’s attempts to cast doubt on Mr Oon’s testing methodology via an attack on the plaintiff’s eye sight failed.  Instead, I felt that Mr Oon’s testimony showed that he had carried out the tests admirably and with due care.  He had inquired about the plaintiff’s eyesight and ascertained that the plaintiff could see sufficiently clear for the purposes of his test and further ensured that the test objects were always placed directly in front of the plaintiff. 35        As for the quantum of damages to be awarded, I was referred to the case ofEr Hung Boon v Law Chyan En(unreported decision of the District Court in DC Suit No 1567 of 1997) where the plaintiff suffered from lapses in concentration span.  In addition, his immediate verbal memory, delayed verbal memory and recognition memory were impaired along with his immediate and delayed visual memory.  Further, his immediate recall of objects was impaired.  He was awarded $20,000 in respect of these injuries.  Having considered the matter fully, I was of the opinion that the appropriate award in this case would be $25,000 (inclusive of damages for pre and post-accident amnesia).",
        "(j)        Right ear hearing loss and deterioration of tinnitus": "36        The plaintiff was claiming for mild to profound sensory-neural hearing losses that worsened at high frequencies to his right ear and deterioration of tinnitus.  In relation to this claim, I would first highlight that the plaintiff had suffered for many years, prior to the accident, from left ear tinnitus (this is what Dr John stated in his medical report at PB 106 which I preferred over the plaintiff’s own testimony where he denied any form of hearing loss prior to the accident).  Second, I would observe that while Dr John did state that he could not say for sure whether this hearing loss was caused by the accident, he did state that this hearing loss was consistent with the plaintiff’s head injury which was worse on the right side due to the blood clot on the right side.  Third, it must be remembered that Dr Tan had stated that there was no damage to any part of the brain that would cause hearing loss while Dr Chan stated that it was most likely that the tinnitus was pre-existing.  Fourth, I would also highlight that the plaintiff only informed the doctors of his ear problem in September 2002 although the accident occurred in March 2002. 37        Relying on Dr Tan and Dr Chan’s testimonies, Mr Fazal submitted that this Court should not make any award for this head of claim as the plaintiff had failed to show that the hearing loss was caused by the accident.  I was unable to accept his contention.  Dr John is an Ear, Throat and Nose specialist while the other two doctors were not.  His opinion must surely carry more weight in relation to injuries of the ear.  Further, I observed that Dr Tan’s comments on the lack of brain damage did not mean that there was no hearing loss caused by the accident, merely that there was no brain damage.  The hearing loss need not be related to brain damage at all.  After all, there was a blood clot on the plaintiff’s temple and this could have caused the hearing loss.  As for Dr Chan’s comment, the fact that the tinnitus was pre-existing did not mean that it could not have been worsened.  In fact, it lent support to the plaintiff’s contention that the plaintiff’s pre-existing condition was aggravated by the accident.  As such, I was of the opinion that an award should be made. 38        I was then referred by Mr Robert toFauziyah bte Mansor v Abu Bakar bin Hussin(unreported decision of the High Court in Suit No 1685 of 1989) where the plaintiff suffered from decreased hearing in the right ear and was awarded $4,000.  In view of the plaintiff’s pre-existing tinnitus condition, I was of the opinion that an award of $5,000 was appropriate in all the circumstances.",
        "(k)        Pre-trial loss of earnings": "39        Mr Robert submitted that the plaintiff should be entitled to $19,550 based on a monthly income of $850 for 23 months.  I had two observations.  First, I could not see how, given his testimony in court, the plaintiff could sustain his claim for $850 per month.  Second, I found that a multiplier of 23 could not be justified.  I will explain further. 40        The plaintiff in his testimony stated that he earned $800 to $900 per month.  Mr Lee, his employer, confirmed this.  This was, however, unsupported by any physical evidence, although given the nature of his employment, I would add that this would not be fatal to his claim: seeTeo Sing Keng v Sim Ban Kiat[1994] 1 SLR 634for a similar scenario at 638.  This does not mean that the plaintiff was entitled to any amount that he alleges.  He must still on the balance of probabilities prove his income.  In this respect, the plaintiff contended that his employer’s CPF contributions of $80 per month substantiates his claim of earning $800 to $900 a month.  However, this assertion did not withstand the fire of cross-examination. 41        Under cross-examination, the plaintiff and Mr Lee both revealed that the $80 per month CPF figure was based not on his monthly earnings, but was an arbitrarily decided figure (they had simply taken $20 each weekend from the takings and contributed that amount to his CPF account).  Further, when I questioned the plaintiff as to his daily earnings, a rather different story emerged. 42        The plaintiff had stated that he charged $5 a child and $8 an adult.  He further stated that he attended to an average of 15-17 children and 13-29 adults a week.  Based on these figures and the plaintiff’s cut of 65 cents to the dollar, this worked out to a weekly income of about $116-$206.  Taking the median of this value, I estimated his yearly income to be about $8,372 and hence a monthly income of $697 which I rounded up to $700 for convenience. 43        As for the multiplier, I felt that the award for pre-trial earnings should be for 12 months as this represented the period where the plaintiff was completely unable to work on a full-time basis.  In making this determination, I was aware that Dr Chan had stated that the plaintiff should be able to take basic care of himself after six months.  Nonetheless, I felt that this did not mean that the plaintiff should only be entitled to an award for six months.  Instead, given the nature of his injuries, I was of the opinion that an award for the loss of 12 months of income was appropriate.  As such, I made an award for $8,400 under this head.",
        "(l)         Loss of future earnings/ earning capacity": "44        The plaintiff next claims for loss of future earnings.  In addition to relying on the wrong figure of $850 per month (as explained above), Mr Robert submits that I should award a multiplier of two years.  Two points need to be made.  First, the award for loss of future earnings operates only to compensate the plaintiff for any reduction in his current earning capacity and the mode of making this award is to determine the difference between his pre-accident and present income (after deducting income tax, if applicable). 45        In our current case, Dr Chan had stated that it was unlikely for the plaintiff to return to his job as a barber.  He however opined, despite not being an occupational therapist, that the plaintiff would be able to do some form of work which is essentially sedentary and does not require him to use his hands for either strength or precision work.  Notwithstanding these comments by Dr Chan, neither the plaintiff nor the defendants thought it fit to provide me with an estimate of what a person engaged in such sedentary work would earn.  As such, for lack of evidence, I was unable to determine the appropriate amount to award for loss of future earnings and thus I did not make any award: refer toOng Ah Long v Underwood[1983] 2 MLJ 324. 46        In any event, I was of the opinion that even if I could calculate the appropriate multiplicand, I would make only a very small award given that the multiplier would be very small.  This is because the plaintiff is 70 years old and our current retirement age is 65 years old.  On such an analysis,prima facie, it would appear that the multiplier should be zero.  Our Courts should however never be so fast in applying a broad rule to specific cases.  Each case must stand or fall by its own facts.  In this case, I would note that despite the injuries suffered, my appraisal of the plaintiff showed that he was a springy and energetic 70 year old man.  I did not doubt his testimony that he would work until he was 80 years old if he was able.  As such, I was of the opinion that a multiplier of 0.5 would be appropriate given the unpredictable nature of life and an analysis of the precedent cases especiallyKoh Lu Kuang v Abdul Jalil bin Kader Hussein(unreported decision of the District Courts in DC Suit No 4293 of 1998) andMa Hai Yong @ Mah Ah The(unreported decision of the High Court in Suit No 2023 of 1995).  However, for the reasons earlier stated, this point did not arise. 47        Instead, I felt that this would be an appropriate case to award for loss of earning capacity: as it falls within the second category as describedTeo Sing Keng & SBS v Sim Ban Kiat[1994] 1 SLR 634at 647.  In making my award, I took into account among other factors the age, skills, nature of disabilities, his trade, earnings that the plaintiff is likely to command:Chang Ah Lek & Ors v Lim Ah Koon[1999] 1 SLR 82.  I felt that the appropriate award to make for loss of earning capacity in all the circumstances would be $2,500.",
        "(m)       Pre-trial nursing care": "48        With regard to this head of claim, it is relevant to note that the plaintiff lived next-door to his son and his son’s family.  As a result of the accident, the plaintiff’s son sent his maid to take care of the plaintiff. The plaintiff now claims $750 times 23 months for this nursing care.  The defendants, however, contended that I should make only a token award of $100 times five months, if at all, because the maid was still primarily looking after the grandchildren, cooking and cleaning the plaintiff’s son’s house and was only incidentally looking after the plaintiff. 49        I am unable to agree that only a token sum should be awarded.  Dr Chan, under cross-examination, stated that in light of the amount of mild nerve injury, he would usually provide for 5-6 months after the accident for the plaintiff to recover from his injuries such that he would not require maid care.  Further, the fact that the maid did continue to look after the plaintiff’s son’s children or do his laundry was incidental to taking primary care of the plaintiff (because they lived next-door).  In addition, I did not agree that the maid’s primary responsibility was to look after the plaintiff’s son’s family. 50        I am also unable to agree with Mr Fazal when he contended that an award should not be made under this head because the maid was hired by his son and the levy and salaries were paid for by his son.  It is trite law that it cannot be said that no loss has been suffered merely because someone else has provided to or for the benefit of the plaintiff, the money or service to be valued as money, to provide for the needs of the plaintiff directly caused by the defendant’s wrongdoing.  After all, the loss is the plaintiff’s loss.  The question of who paid the money and whether the plaintiff is under a legal or moral obligation or liability to repay the money is irrelevant in so far as the defendant and his liability are concerned: seeAng Eng Lee & Anor v Lim Lye Soon[1986] 1 SLR 116. 51        At the last hearing, both parties were agreeable that a monthly sum of $550 would be a fair amount to award for the hire of a maid.  Thus, I was of the opinion that an appropriate award for nursing care would be $550 times six months:ie$3,300.  By logical inference, since I was of the opinion that six months of nursing care was sufficient, I dismissed the plaintiff’s claim for future nursing care.",
        "(n)        Future medical care": "52        I further made an award for future medical expenses as follows: (a)Hearing aid for both ears:$2,120(b)Batteries for (a) for 24 months:$280(c)Tanaken tablets for 12 months:$980Total:$3,380 53        I did not include awards for the plaintiff’s shoulder or foot as I had dealt with those under their respective headings already.",
        "(o)        Special damages": "54        I further made the following awards of $8,700.38 for medical expenses and $250 for transport expenses.  I also made certain orders as to costs.",
        "Conclusion": "55        Having reviewed the totality of my award, I was satisfied that the amount awarded represented an appropriate amount in the entirety of the circumstances.  I understand that the plaintiff is an old man and it was unfortunate that such an accident should befall him at a time when he should be enjoying the fruits of a lifetime of toil and labour and the company of his grandchildren.  What is fortunate however is that he has survived his ordeal and that he can get on with the rest of his life.  It is hoped that this sum of money can adequately compensate him for the pains of the past two years.  To otherwise dwell upon the unluckiness of the accident would be a great shame especially since Mr Ting can bask in the glow of a supportive extended family."
    }
}