{
    "case_title": "Chiam Kim Loke v Lee Wing Hoong and Another",
    "ncitation": "[2004] SGHC 37",
    "coram": "Tai Wei Shyong AR",
    "sections": {
        "Pain and Suffering and Loss of Amenities": "Fracture of Femur                                 $35,000 Amputation of Little Finger                    $25,000 (including 5thRay of Palm) Fracture of 4thMetacarpal                    $5,000 Osteoarthritis at the Knee and Hip        $12,000 Multiple Scars                                      $20,000 Sub-Total                                             $97,000  Loss of Pre-Trial Earnings                     $48,820 Loss of Salary Increment:                      $2,970 Loss of Bonus                                      $11,455.31 Loss of Earning Capacity                      $50,000 Loss of Future Earnings                        $50,000 Medical Expenses:                                $1,850 Transport:                                             $500 Delay of Long Service Award:  $30 Future Medical Costs                           $1,500 Clothing                                                $100 The defendants have now appealed against these awards.",
        "Pain and Suffering and Loss of amenities": "3          At the outset, I should say that the plaintiff’s injuries were in my view fairly severe.  This is evidenced by the fact that he was in fact on medical leave for a period of 2 years and 9 months after the accident.  The most serious injury was to the plaintiff’s right leg.  In the medical report of Changi General Hospital dated 23 September 1999, this was described as a  “severe open comminuted fracture of the right femur involving the condyle”.  Following initial treatment in Singapore with screws and an external fixator, the plaintiff had further procedures done in Malaysia, primarily to lengthen the length of the leg, which had shortened by 6 cm as a result of the fracture.  In the end, the length of the leg was partially restored (shortening was reduced to 1.5 cm to 2 cm).  The plaintiff now has difficulty walking (he does so with a pronounced “Trendelenburg” gait), running and squatting. According to a medical report produced by Dr P Thiagarajan, who gave evidence for the plaintiff, x-rays of the right femur showed severe deformity with osteoporosis involving the hip joint and the knee joint.  There was evidence of “S” shaped deformity of the lower femur consistent with the angulation of the lower end of the bone.  There was further evidence that the risk of osteoarthritis was substantial. 4          In relation to his right hand, the plaintiff had lost his little finger, and it was emphasized by counsel for the plaintiff that he had also had the “ray” of his palm amputated.  His 4thmetacarpal had also been fractured but had healed by the time of the hearing. 5          Further, the plaintiff was also severely scarred from the accident, with over 25 scars on his leg, hip and hand.  Those on his leg were observed by Dr Thiagarajan to be related to the use of the external fixator pin – there was evidence of residual dense scarring with deep pigmentation and puckering suggestive of past infection of the pin tracts.  In relation to the other scars, many were characterized by keloid formation. 6          A number of cases were cited by the solicitors for the plaintiff as precedents for damages to be awarded for pain and suffering.  I will mention only the more relevant ones.  InSwaran Singh v Lim Soon Lee(S 2409 of 1996), the plaintiff was awarded $30,0000 for a closed fracture of the right femur, $15,000 for osteoarthritis of the knee and ankle and $10,000 for multiple scars.  InGopal s/o Kunju Kannanv Sulaiman bin Kassim(S 332 of 1995), the plaintiff was awarded $32,000 for a closed comminuted fracture of the right femur.  InHaron Bin Ibrahim v Yep Wai San(DC Suit 1912 of 1993), the plaintiff had suffered amputation of left right and little finger at the knuckles and deep lacerations in the left middle finger with flexor tendons profundus and superficialis cut.  He was awarded $20,000 for pain and suffering for these injuries. 7          For their part, the defendants submitted that the awards under this head should be in a lower range.  For the injury to the leg, in the region of about $20,000 to $25,000.  For the amputation of the finger and the ray of the palm, figures in the range of $8,000 to $15,000 were proposed. 8          As I have noted above, my assessment of this case was that the injuries were serious.  The leg fracture was open and comminuted, and had obviously caused a great deal of pain and distress.  This was further compounded by the operations required to reduce the initial shortening of the leg, which was substantial.   I would add at this stage that a submission was made by the defendants that the plaintiff had failed to mitigate his losses by not following through with physiotherapy.  I did not accept this submission.  The plaintiff himself had given evidence that he had undergone physiotherapy and the thrust of his evidence was that he had discontinued it when it ceased to have any substantive effect.  I accepted that this was so and the medical evidence that generally physiotherapy was only helpful up to a point and in most cases would not be able to rehabilitate the patient completely.  In the circumstances, I found that the defence had failed to prove on balance that the plaintiff had failed to mitigate his losses. 9          Having regard to all the factors, I felt that damages in a higher range for each injury was justified and given that the cases cited to me were decided some time ago, I made the awards as detailed above.",
        "Loss of Earning Capacity and Loss of Future Earnings": "10        In relation to loss of earning capacity, when the plaintiff returned to work after the accident, he was no longer able to perform his job as an Operations Agent, which involved physical tasks such as carrying objects.  His employers, DHL International (S) Pte Ltd (“DHL”), had kindly re-deployed him to the position of a customs clearance agent, and at a slightly increased salary to boot.  However, I felt that if he were unfortunate enough to be thrown back into the labour market, his disabilities would constitute a serious impediment to him obtaining employment.  The plaintiff claimed an amount of $70,000 for loss of earning capacity and cited the case ofTan Cheng Lee v Lau Bin Keong and Another(DC Suit 1384 of 1988), where $30,000 had been awarded.  In that case, the plaintiff was a carpenter who as a result of the injuries his left hand could not carry heavy weight.  The 1stdefendant argued that the sum should be $40,000 and the 2nddefendant argued that it should be $30,000.  As the disabilities affecting the plaintiff were severe, I felt that an award of $50,000 was fair. 11        As for loss of future earnings, counsel for the plaintiff had argued strenuously that he would have been promoted in July 2000 within DHL had he not been injured.  However, the evidence on this point presented by the plaintiff was in my view insufficient to establish this on the balance of probabilities.  The plaintiff himself gave evidence that the prior to the accident he had not applied for promotion (which application was necessary in order to be promoted), and that he had been happy with his position up to that point.  Given that, I did not think that it was fair to assume that he would have had a change of heart in July 2000 and applied for a promotion had he continued in his previous position.  It was a further leap from that to say that he would on balance have obtained the promotion applied for, when there would have been other competing candidates. 12        However, I was prepared to accept that as he was new in his appointment as a customs clearance agent and was just learning the ropes, he was set-back in his promotion prospects in the long term due to the accident.  I note that the medical leave period alone was almost 3 years.  Taking a multiplier of 4 years and a multiplicand of $1,000 a month, and adding in a reasonable amount for loss of increments and night shift allowance, I thus awarded him $50,000 for loss of future earnings.",
        "Loss of Pre-Trial Earnings, Salary Increment and Bonus and Other Losses": "13        Having regard to the findings I have made above, the amounts claimed under these heads of damage were in my view reasonable and I thus awarded them.  In any event, most of the heads were not seriously contested by the defence once my findings were known to them."
    }
}