{
    "case_title": "United Engineers (Singapore) Pte Ltd v Lee Lip Hiong and Others",
    "ncitation": "[2004] SGHC 169",
    "coram": "Joyce Low Wei Lin AR",
    "sections": {
        "Factual background and issue presented": "2          The facts are as follows: United Engineers (S) Pte Ltd (‘United Engineers’) commenced the present action against Lee Lip Hiong (‘Lee’), Tan King Hiang and Sin Yong Contractors Pte Ltd (‘SYC’). In turn, SYC pleaded a counterclaim against United Engineers. The parties served the usual round of pleadings that ended with the replies served by United Engineers on 24 February 2004. Pursuant to O 18 r 20(1) of the Rules, pleadings in the action are deemed to be closed at the expiration of 14 days after the service of the reply. Therefore, the deemed closure of pleadings in the present action occurred on 9 March 2004. By O 14 r 14 of the Rules, no summons under O 14 shall be filed after the expiration of 14 days from the date that pleadings are deemed to be closed,iethe last day for the filing of an O 14 application was 23 March 2004. No such applications were taken out by then. However, United Engineers and SYC subsequently took out applications for extensions of time to file and serve O 14 applications in the present action. I heard the applications and reserved judgment. 3          In the meantime, SYC applied to amend their counterclaim. At the hearing, the court gave leave to amend and permitted United Engineers to file an amended Reply and Defence to the counterclaim (hereafter referred to as ‘the pleadings amendment order’).  United Engineers and SYC took the view that the pleadings amendment order reopened pleadings and revived their right to file O 14 applications. Consequently, they took out separate O 14 applications without waiting for my judgment on their previous applications for extensions of time to file the same. Lee took a contrary view. He filed the present application to set aside the O 14 applications on the basis that they are in breach of the Rules, specifically, O 14 r 14; and that they constitute an abuse of process because they were taken out while the applications for extensions of time had not been decided. 4          The main issue arising from this application is whether the pleadings amendment order revived the right of United Engineers and SYC (hereafter referred to collectively as ‘the respondents’) to take out O 14 applications.",
        "The relevant provisions of the Rules": "5          O 14 r 14 of the Rules limits the right of the respondents to take out an O 14 application. It provides that: No summons under this Order shall be filed more than 14 days after the pleadings in the action are deemed closed 6Pursuant to O 14 r 14, the time for filing an O 14 application starts to run from the time “pleadings in an action are deemed closed”. This is governed by O 18 r 20(1) of the Rules, which reads: The pleadings in an action are deemed to be closed – (a) at the expiration of 14 days after service of the reply or, if there is no reply but only a defence to counterclaim, after service of the defence to counterclaim, or (b) if neither a reply nor a defence to counterclaim is served, at the expiration of 14 days after service of the defence.",
        "A summary of the parties’ arguments": "7          Counsel for Lee, Ms Foo Yuk Lin, submitted that pursuant to O 18 r 20(1), the deemed closure of pleadings in an action is not affected by the pleadings amendment order. The rule fixes the date that pleadings are deemed to be closed with reference to the service of “reply”, “defence to counterclaim” or “defence”. She contended that these terms refer to the original pleadings in an action and not amended pleadings that are referred to differently as “amended reply”, “amended defence”, etc. Hence, the deemed closure of pleadings is not affected by the service of amended pleadings. She also argued that the rule is a deeming provision,iethe deemed closure of pleadings occurs by operation of law independently of the actual closure of pleadings. Consequently, even if a pleadings amendment order reopens pleadings in actuality, it would have no effect on the deemed closure of pleadings. 8          With respect to United Engineers’ O 14 application in the main action, she raised an additional point,ieas the amendment to the pleadings only affected the counterclaim pleadings, the close of pleadings in the main action, which is a separate and independent action in law from the counterclaim, would not be affected by such amendments. 9          The respondents did not submit on O 18 r 20(1). They relied principally on the Canadian decision ofFreeman v Parker[1956] OWN 561andChun Thong Ping v Soh Kok Hong and Anor[2003] SGHC 172, a decision of our High Court. Counsel for United Engineers, Mr Adrian Wong, submitted thatFreeman v Parkerwas authority for the principle that a pleadings amendment order reopens pleadings for all purposes unless the order explicitly limits the purposes of the reopening. He argued that, applyingFreeman v Parker, the pleadings amendment order in the present case, which contained no such express limitation, was reopened for all purposes, including the filing of an O 14 application. 10        Mr HT Sam, who appeared for SYC, submitted that the court should exercise its inherent powers to revive the respondents’ right to file O 14 applications because of the pleadings amendment order, on the authority ofChunThong Ping v Soh Kok Hong and Anor, and additionally,Freeman v Parker.",
        "Analysis": "11        The respondents’ right to take out an O 14 application starts to run from the time that pleadings in an action are deemed to be closed pursuant to O 18 r 20(1). The interpretation of O 18 r 20(1) is therefore the appropriate starting point. 12        In my view, Ms Foo’s argument, that the pleadings amendment order does not postpone the date that pleadings in an action are deemed to be closed pursuant to O 18 r 20(1), is correct. I agree with her that the words “reply”, “defence to counterclaim” and “defence” referred to the original pleadings in an action. I also agree that the rule is a deeming provision that fixes the date that pleadings are deemed to be closed, by operation of law, according to the date of service of original pleadings. 13        The literal reading of O 18 r 20(1) supports Ms Foo’s contentions.  In addition, I am of the view that such an interpretation is consistent with the purpose of the rule. The deemed closure of pleadings acts affects the operation of several rules. It is used as a reference point for the counting of time for the making of amendments to the writ or pleadings without leave (O 20 rules 1 and 3), for the taking out of summons for directions (O 25 r 1) and for the operation of automatic directions pursuant to O 25 r 8, apart from limiting time for the filing of O 14 applications. O 18 r 20(1) fixes the deemed closure of pleadings with certainty so that it can fulfil its function as a reference point for the counting of time (seeSingapore Civil Procedure, 2003 Edition, 18/20/3 and Pinsler,Singapore Court Practice, 2003 Edition, 18/20/3). The need for certainty is also illustrated by O 18 r 20(2), which expressly provides that the deemed closure of pleadings is not affected by a request for particulars. It should similarly not be affected by amendments. 14        My conclusion is fortified by the decision of the English Court of Appeal ofHackwell v Blue Arrow Plc and Anor, The Times, 18 January 1996. In that case, which Ms Foo cited, the plaintiff failed to request for a hearing date within one year from the deemed closure of pleadings as required by the English Rules and his claim was thus automatically struck out. The relevant rule governing the deemed closure of pleadings was O 18 r 20 of the English Rules of the Supreme Court 1965, which isin pari materiawith our O 18 r 20 of our Rules. In an application to reinstate the plaintiff’s claim, his lawyers argued that the delay in taking out a request for a hearing date was excusable because it was caused by their mistaken belief that the deemed closure of pleadings had been postponed by a pleadings amendment order. Walker J gave this argument short shrift. He categorised the mistake as a “total oversight” by the plaintiff’s lawyers. The Court of Appeal affirmed this finding on appeal. It is pertinent to note that even the plaintiff’s lawyers conceded that their belief that deemed closure of pleadings were affected by amendments was a mistake. In the present case, the respondents have also avoided arguing that the deemed closure of pleadings has been postponed by the amendments. This argument is not sustainable on the interpretation of O 18 r 20(1). 15        As I have concluded that pleadings amendment orders do not affect the deemed closure of pleadings, it was not necessary for me to consider the alternative argument that Ms Foo raise,iethat an amendment of pleadings in a counterclaim does not affect the deemed closure of pleadings in the main action. I turned to examine whetherFreeman v ParkerandChun Thong Ping v Soh Kok Hong & Anorsupport the respondents’ argument that the pleadings amendment order revived their right to take out an O 14 application regardless of O 18 r 20(1). 16        InFreeman v Parker, pleadings in the action were closed in November 1954 based on the service of the original set of pleadings. Some three months after that, the plaintiff obtained leave to amend her statement of claim. Subsequently, she served the amended statement of claim and a jury notice on the defendant. The defendant applied to strike out the jury notice. Pursuant to s 57 of the Judicature Act, a party may deliver a jury notice “not later than the fourth day after the close of pleadings”. The defendant argued that the notice was out of time as pleadings had closed in November based on the service of the original pleadings. Gale J refused the application and held: The moment the order [granting leave to amend the statement of claim] was made on 8 February, there was impliedly a reopening of the pleadings. It is true that the order is not explicit in this respect but I fail to see how any interlocutory amendment to the pleadings can be made without the pleadings being reopened…Unless some express direction is given, pleadings are not reopened in varying degrees. Frequently, of course, they are opened for limited purposes, but when that is so, the orders are explicit in that respect. 17        Mr Wong relied onFreeman v Parkerfor the proposition that the pleadings amendment order reopen pleadings for all purposes including the revival of the respondents’ right to take out an O 14 application because the order did not expressly limit the purpose for which pleadings reopened. I am of the view that his reliance onFreeman v Parkeris misconceived. In that case, time for the delivery of a jury notice starts to run from the actual closure of pleadings and hence the issue before the court was whether a pleadings amendment order affects the actual close of pleadings. In my view, although the case stands for the proposition that a pleadings amendment order postpones the actual close of pleadings, it is not authority for the principle that the deemed closure of pleadings is similarly postponed. The time for the filing of an O 14 application in Singapore, unlike that of a jury notice in Canada, runs from the deemed closure of pleadings. I have concluded earlier that even if a pleadings amendment order postpones the actual close of pleadings, its deemed closure pursuant to O 18 r 20(1) is not affected and hence, the right to file an O 14 application is not revived. Nothing inFreeman v Parkercontradicts this conclusion. 18        The decision inChun Thong Ping v Soh Kok Hong and Anordoes not take the respondents’ case any further. In that case, the second defendant obtained unconditional leave to defend upon the hearing of an O 14 application against him. The plaintiff appealed and applied separately to amend the statement of claim to add a new cause of action. The appeal and the application to amend came before Tay Yong Kwang J. His Honour held,inter alia, that if the plaintiff wished to proceed with his application to amend, he should not be allowed to proceed with an O 14 application until the defendant has had the opportunity to amend his defence. As the plaintiff wanted to proceed with his application to amend the statement of claim, leave was granted to him to withdraw his appeal. The court did not have to consider the relationship between an amendment of pleadings and the operation of the time bar in O 14 r 14 because such an issue was not before it at all. 19        The last argument that I had to consider was Mr Sam’s submission that the court should exercise its inherent powers to allow the respondents’ to file their O 14 applications, in light of the pleadings amendment order, regardless of O 14 r 14 and O 18 r 20(1).  Theremaypotentiallybe some argument for the use of the inherent powers of the court in a situation where the amendments change the character of the litigation such as to suggest for the first time that summary judgment would be appropriate although the time bar in O 14 r 14 has lapsed. 20        The present case, however, is far from such a situation. The pleadings amendment order permitted the amendment of the quantum of SYC’s counterclaim against United Engineers by a mere one cent, from $491,937.47 to $491,937.48 on the basis that there was a typographical error in the amount claimed. In Mr Sam’s own words, in his letter to Ms Foo dated 20 May 2004 and exhibited in Ms Foo’s affidavit in support of the present application, the amendment is “very minor and does not jeopardise or prejudice [Lee’s] defence or interest and is not relevant to [Lee’s] defence as the counterclaim is against [United Engineers]”. For these reason, Ms Foo did not object to the amendment. It is obvious that such an amendment did not change the nature of the litigation between SYC and United Engineers.A fortiori, it had no effect on the litigation in the main action. I am of the opinion that no injustice will result if I do not exercise the court’s inherent powers in the respondents’ favour. On the contrary, a manifest injustice will occur if the respondents’ O 14 applications are allowed to stand despite, what is in my view, a blatant attempt by them to circumvent the time bar in O 14 r 14, by filing minor and largely inconsequential amendments and then contending that these amendments revived their right to file O 14 applications.",
        "Conclusion": "21        For the above reasons, I concluded that the pleadings amendment order did not postpone the deemed closure of pleadings pursuant to O 18 r 20(1) which occurred on 9 March 2004. The O 14 applications taken out by the respondents were therefore filed in breach of O 14 r 14 because they were filed after the time bar lapsed on 23 March 2004. Accordingly, I set aside SIC 3182/04 in its entirety and struck out the prayer for summary judgment under O 14 in SIC 3091/04 but granted liberty to United Engineers to proceed on their alternative prayer in SIC 3091/04 for judgment pursuant to O 27. I also awarded costs in favour of Lee."
    }
}