{
    "case_title": "Herbst Ehud v Sampoerna Putera and Another",
    "ncitation": "[2004] SGHC 236",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The plaintiff’s claim": "2          The plaintiff’s claim against the first defendant is for the amount of US$250,000 pursuant to a refund agreement allegedly made by the second defendant as agent on behalf of the first defendant. Further or alternatively, he claims from the second defendant US$250,000 as damages for the second defendant’s breach of warranty of authority or pursuant to an alleged undertaking given by him. The plaintiff also claims an account of the sale of certain shares and, if appropriate, payment of any sum payable to him upon such sale and/or damages for breach of trust. 3          The first defendant is a prominent Indonesian businessman with controlling interests in the Sampoerna group of companies. The second defendant is said to be a member of the first defendant’s inner circle of advisors. At all material times, the first defendant held out the second defendant as his agent. 4          In 1998, the first defendant was asked by the Indonesian government to help improve the country’s agricultural sector. The plaintiff was then engaged by the Sampoerna group as a consultant in that matter. Through the plaintiff, who is an Israeli, an Israeli entity (“the Hovev group”) was identified and its business plan was presented to and approved by the first defendant in or about 1999. 5          The business plan envisaged that the first defendant, the Hovev group and the plaintiff would participate in a joint venture to establish and operate a farm business and a decorations business involving the manufacture of botanical decorations and handicrafts. Two separate companies would be established to operate these two businesses, with the plaintiff taking a 5% stake in one company and a 10% stake in the other. It was contemplated that the joint venture agreement (“JVA”) would be finalised by September 1999. 6          However, the JVA was not signed at all although several drafts of the JVA were prepared by the first defendant’s solicitors and circulated among the parties. This was because certain terms could not be agreed among the parties. 7          Pursuant to the business plan, two Indonesian companies, PT Sampoerna Agro (“PTSA”) and PT Indo Nature (“PTIN”) were established in December 1999 to operate the said businesses. For tax purposes, PTSA was held by two Mauritian offshore companies whose shares were in turn held by the second defendant in trust for the parties’ respective nominee companies. PTIN was structured and held in a similar manner. 8          In an e-mail dated 16 October 2001, the second defendant asked the plaintiff for US$250,000 as his capital contribution because the funds expected from the first defendant were delayed. Although the money was meant for PTSA and PTIN, the second defendant requested the plaintiff to make payment into a bank account with UBS AG, Singapore, in the name of Lexim Trading Ltd. The plaintiff refused to do so as the JVA had not yet been finalised and signed. 9          Since the second defendant kept pressing the plaintiff for payment, in November 2001, the plaintiff and the second defendant, acting as agent for the first defendant, agreed that the plaintiff would pay the US$250,000 (less certain agreed deductions) on condition that the whole amount would be refunded on demand if the JVA was not concluded (“the refund agreement”). The second defendant impliedly warranted to the plaintiff that he had been authorised by the first defendant to enter into the refund agreement. Accordingly, on 12 November 2001, the plaintiff e-mailed the second defendant to inform him that he would be remitting to the nominated account the amount of US$176,743 (being US$250,000 less US$73,257 then owing to the plaintiff) and that such remittance would be subject to the refund agreement. The remittance was then made. Both defendants did not refute the existence of the refund agreement. 10        The plaintiff was employed by PTSA as its marketing director from the date of the establishment of PTSA to 26 October 2002 when, for purely economic reasons, his employment was terminated. The notice of termination of service was given by the second defendant to the plaintiff personally at a meeting held in Lombok, Indonesia, on 26 October 2002. During that meeting, the plaintiff demanded the return of the US$250,000 but was told by the second defendant to withhold demanding for such refund while solutions for turning around the farm business were being considered. The second defendant also told the plaintiff that he had not disclosed the refund agreement to the first defendant as he feared he might otherwise lose his job. The second defendant undertook that if the first defendant refused to refund the said amount to the plaintiff, he would do so himself. 11        In consideration of that undertaking, the plaintiff agreed to withhold demanding for the refund of the said amount while solutions for turning around the farm business were being considered. When the plaintiff was asked in February 2003 about his ideas for turning the farm business around, he e-mailed the second defendant to confirm that his views given as a consultant would not prejudice his right to the refund. The second defendant confirmed this over the telephone. 12        The plaintiff then sent an e-mail containing his views to the second defendant. He emphasised in the e-mail that he was sending the document in reliance on the confirmation that his right to the refund would not be prejudiced. Following this, a Dutch company was engaged to do a feasibility study of the farm business for the purpose of attracting external investors. That study was completed in July 2003. 13        On 26 April 2003, in repudiation of the refund agreement and/or in breach of the undertaking given by the second defendant, the second defendant informed the plaintiff over the telephone that he was not entitled to a refund of the US$250,000. 14        Around the end of June or the beginning of July 2003, the second defendant sold the shares in PTSA and/or the farm business without the knowledge or consent of the plaintiff. To date, the plaintiff has not been paid the US$250,000 by the first or the second defendant despite his demands for payment. 15        The defendants reside in Singapore. The writ of summons was served on them here.",
        "The defendants’ case and grounds for asking for a stay of proceedings": "16        The joint venture was established exclusively in Indonesia from its inception in 1999. The plaintiff owned a beneficial stake in the joint venture through his indirect shareholding in PTSA and PTIN. To finance the joint venture’s businesses, the partners agreed to make financial contributions towards the initial capital outlay of PTSA and PTIN in return for their ownership interests. They also agreed to provide shareholders’ loans. The amount of capital that the plaintiff had to provide was agreed upon since August 1999. The joint venture started operations since 2000. In November 2001, the plaintiff was reminded to make his capital injection of US$250,000. For that purpose, the funds were remitted by the plaintiff, then in Hong Kong, to a Singapore bank account. 17        Although the partners originally envisaged that the joint venture would be formalised through the signing of a JVA, no such agreement was eventually signed. However, drafts were prepared by Indonesian solicitors and, later, by Singapore solicitors. Despite the absence of a signed JVA, there was no dispute that the plaintiff regarded himself as a joint venture partner. 18        The plaintiff was a shareholder, the deputy managing director and a member of the executive committees of PTSA and PTIN and was therefore aware of the difficulties in the businesses and the friction among the partners of the joint venture. From about May 2002, discussions took place among the partners to explore ways for the Sampoerna family to divest its interests in the joint venture. The Sampoerna family and the Hovev group eventually agreed that the beneficial stakes held by the Hovev group and the plaintiff in PTSA be transferred to the Sampoerna family in exchange for that family’s equity interest in PTIN. The plaintiff was invited to participate in the share exchange but he refused to do so. 19        The Sampoerna family eventually sold its entire shareholding in PTSA to a third party around June 2003. In the midst of these developments, the plaintiff’s appointment as deputy managing director of PTSA was terminated by the joint venture in or about September 2002 as a cost-cutting measure. 20        The plaintiff’s alleged condition in making the remittance was something that was not agreed to by the defendants. By November 2001, the other partners had already committed funds in the joint venture and had no reason to agree to the plaintiff’s alleged right of refund. 21        Bearing in mind the many issues that would arise out of the claim, the defendants submitted that the dispute was strongly connected to and should therefore be tried in Indonesia. The subject matter concerned the plaintiff’s equity interests in Indonesian companies and such must be determined by reference to the companies’ corporate documents which were only available from the companies’ registry in Indonesia and which would predominantly be in the Indonesian language. The corporate laws of Indonesia would come into play. 22        The events and discussions leading to the joint venture, its running and operations and eventual dissolution occurred entirely in Indonesia and the relief sought by the plaintiff were matters that had to be decided under Indonesian law. The alleged breaches also took place there. All the evidence and documents were in Indonesia. They bore no connection whatsoever to Singapore. Even on the plaintiff’s own case, his claim allegedly arose from what had transpired during discussions with the second defendant, some of which took place in Indonesia. 23        The defendants had at least five witnesses now residing in Indonesia with intimate knowledge of the operations of the joint venture. These five witnesses were not compellable witnesses in proceedings in Singapore. Further, Indonesian experts such as the auditors of PTSA and Indonesian lawyers would have to testify on ownership as well as trust issues relating to shares in Indonesian companies. Even if availability of witnesses was not a factor favouring Indonesia over Singapore, it would at least be a neutral factor. The parties to this action were not Singapore nationals nor were they domiciled here. The defendants worked in Singapore but were out of the country for three weeks in a month. 24        There would also be savings in costs of litigation in Indonesia because the documentary evidence pertaining to the joint venture and to PTSA and PTIN was in the Indonesian language. A trial in Singapore would necessitate the translation of the documents into English. The witnesses would have to travel and stay here for the trial as well. 25        The legal issues would have to be determined according to Indonesian law. These included the questions about the plaintiff’s rights in the absence of a signed JVA, the terms upon which the respective partners’ shares were held on trust, the rights of majority shareholders to carry out a sale of the company, whether the claims should be directed at the defendants instead of the two companies, whether the fact that the first defendant was a member of the Sampoerna family attracted personal liability on his part and the measure of damages should the plaintiff succeed in his action. These legal issues ought to be resolved by the courts of the country whose laws were the subject of contention. 26        The plaintiff’s professed fears of physical danger were unfounded. He resided, worked and travelled freely within Indonesia for some seven months in 2002 without anything untoward happening. The defendants had produced evidence from an Indonesian lawyer to show that people of all nationalities, including Israeli nationals like the plaintiff, had free and equal access to the courts in Indonesia and could be assured of a fair trial there.",
        "The decision of the court": "27        The Court of Appeal inEng Liat Kiang v Eng Bak Hern[1995] 3 SLR 97at 103, [20] said: A stay will only be granted on the ground of forum non conveniens, where the court is satisfied that there is some other available and appropriate forum for the trial of the action. The burden of proof rests on the defendant, and the burden is not just to show that Singapore is not the       natural or appropriate forum but to establish that there is another available forum which is clearly or distinctly more appropriate than the Singapore forum. The natural forum is that with which the action has the most real   and substantial connection, and the court will consider what factors there are which point in that direction. If the court concludes at that stage that there is no other available forum which is clearly more appropriate for the            trial of the action, it will ordinarily refuse a stay. If, however, the court concludes at that stage that there is some other available forum which prima facie is clearly more appropriate for the trial of the action it will ordinarily grant a stay, unless there are circumstances by reason of which justice requires that a stay should nevertheless be refused. The court in this respect will consider all the circumstances of the case. 28        This decision was followed by the Court of Appeal in the later decision ofOriental Insurance Co Ltd v Bhavani Stores Pte Ltd[1998] 1 SLR 253. 29        The defendants in the present case relied on the High Court decision inPraptono Honggopati Tjitrohupojo v His Royal Highness Tunku Ibrahim Ismail Ibni Sultan Iskandar Al-Haj[2002] 4 SLR 667at [28] for the proposition set out below: Above all, all the reported cases enjoin the courts to balance the competing justice between the parties. In this context, I would like to add a little allonge, that is, if the balance were to remain at the mid-point and tilts to neither side, the action must generally follow the defendant. With respect, the second statement above appears to contradict the principles stated by the Court of Appeal inEng Liat Kiang v Eng Bak Hern([27]supra). If the balance does not tilt to the forum preferred by the defendant, then he has failed to discharge his burden and the action should “follow the plaintiff” instead of “follow the defendant”,ie, it will not be stayed. 30        In the present case, the plaintiff is currently residing in Phuket, Thailand. The first defendant, an Indonesian citizen, has a residence in Singapore and divides his time among three cities, namely, Singapore, Jakarta and Surabaya. The second defendant has been residing in Singapore with his wife and two children for at least the last ten years. His children are schooling here. All three parties to this action should therefore feel entirely at ease if the trial is in Singapore. They would have no difficulty travelling here from wherever they might be and remaining for the duration of the trial. No additional costs will be incurred by the defendants in defending the claim here. 31        As I see it, the trial will focus on the conversations between the plaintiff and the second defendant and the conduct of the three parties at the material time. Essentially, the trial will be on factual matters. The joint venture and the two Indonesian companies would form the backdrop and any matters relating to the inception, the operation and the eventual failure of the joint venture would be within the knowledge of the three parties. It is therefore not necessary for the Indonesian witnesses of fact to be called to testify. The fact that the plaintiff was in Phuket and the second defendant was in Singapore when the latter allegedly communicated his repudiation of the refund agreement via telephone does not really tilt the balance of factors one way or the other as the focus would be on the conversation rather than the parties’ locations. However, the remittance was made to an account in Singapore. 32        The plaintiff claimed that he had sent an e-mail dated 12 November 2001 evidencing the refund agreement to the second defendant. He also claimed to have sent a copy of that e-mail to two potential witnesses who reside in Singapore. They are the chief financial officer of Transmarco Limited, a company listed on the Singapore Exchange and of which the second defendant is the managing director, and the second defendant’s then personal assistant. 33        The alleged breach of trust and the consequent claim for damages involve shares in the Mauritian companies and not the Indonesian companies of PTSA and PTIN. The governing law would be the law of Mauritius and not Indonesian law. This factor is therefore neutral when considering whether Singapore or Indonesia is the more appropriate forum. The circumstances leading to the sale of the shares would be within the knowledge of the defendants. The place of the sale, and therefore the alleged breach, was in Indonesia but that would not pose any difficulty where assessment of damages is concerned. As I have said, the parties are aware of the operations and financial situation of the businesses. 34        Even if the unsigned JVA is to feature in the defence, whether prominently or otherwise, it is not at all clear that it would have been governed by Indonesian law. On the contrary, the parties appeared to have intended the applicability of Singapore law as shown in the choice of law clause in the drafts prepared by the Singapore law firm. They have not contended that the JVA was not signed because of disagreement over the choice of law. It has therefore not been shown that questions of Indonesian law would arise for determination in the dispute. 35        In my opinion, the factors favour Singapore as the forum and the defendants have failed to discharge their burden of showing that Indonesia is clearly or distinctly the more appropriate forum for trying this dispute. 36        The plaintiff further argued that even if Indonesia was shown to be the more appropriate forum, a stay of proceedings should nevertheless not be granted because of the risk to his personal safety there. He relied on a travel advisory issued by Israel’s Counter Terrorism Bureau recommending “that all Israeli citizens avoid any visit/stay in Indonesia” because of “a concrete terror threat” posed to such citizens. This point is now academic in the light of my holding but I only need say that it would not have been unreasonable for a citizen of any country to decide to abide by a travel advisory issued by the government of his country regarding any place in this world. 37        For the above reasons, I dismissed the defendants’ appeal with costs and refused a stay of proceedings. Defendants’ appeal dismissed with costs."
    }
}