{
    "case_title": "Yeo Kwan Wee Kenneth v Public Prosecutor",
    "ncitation": "[2004] SGHC 44",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Background facts": "2          The incident took place at the members’ section of Zouk Discotheque (“Zouk”) on 24 November 2002. The victim, Ian, had gone to the members’ area at about 11.15pm the day before to meet up with some friends. 3          At approximately 1.15am on the day of the incident, the appellant arrived at Zouk with his girlfriend, Gyneth Tang Hui Ping (“Gyneth”). They proceeded to join a friend, Lewis, at his table in the members’ bar. 4          Soon after, at about 1.30am, an incident occurred at the members’ area between the appellant and Ian. While the parties disagreed on how the incident began, they did not dispute that there was some unhappiness between them and that it concerned Ian allegedly bumping into the appellant. The parties also did not dispute that at some point during the incident, the appellant was holding a glass in his hand and that Ian was hit on his arm and face by the glass. The appellant departed almost immediately after the incident and Ian was left bleeding profusely from a cut on his cheek.",
        "Prosecution’s version of the facts": "5          The Prosecution’s main witness was Ian. The crux of Ian’s evidence was that the appellant had deliberately swung a glass at him, injuring him in the process. 6          Ian testified that he first noticed the appellant slightly past 1.00am on the day of the incident at the members’ area. The appellant was seated about an arm’s length away from where he was standing. As the appellant appeared familiar, Ian tried to engage him in conversation by asking him if he was from Anglo Chinese School. 7          At about 1.20am, Ian made his way from the members’ bar to the toilet. As the area was jam-packed with club-goers, he had to “squeeze” his way past the crowd whilst leaving and returning to the members’ bar. When Ian returned from the toilet, the appellant accosted him and demanded to know why Ian had deliberately bumped into him repeatedly. Ian could not recall what he uttered in response but an argument soon ensued between them. 8          Ian testified that he was then struck by a glass object. When Ian noticed “something coming” towards him, he instinctively raised his arm in an attempt to shield himself, but the glass nevertheless shattered onto his arm and cut his cheek. The appellant then quit the scene immediately, without offering any assistance to Ian. 9          Ian was eventually brought to the Accident and Emergency Department of Raffles Hospital where he was attended to by one Dr Valentin Low (“Dr Low”) who was on duty that morning. Dr Low observed that Ian had sustained a half-moon-shaped, deep laceration just below the eye area. The wound was about 7cm long. Upon closer inspection, Dr Low found some glass particles in the wound. Dr Low recorded in his medical report that the closure of the wound was expected to be uncomplicated but that scarring was probably permanent. 10        The stitching up of Ian’s wound was performed by Ian’s father, Dr Tan, who was Dr Low’s colleague at the material time. Ian required more than 30 stitches with an operating time of three hours under local anaesthesia.",
        "Appellant’s version of the facts": "11        The appellant’s defence at the trial below was essentially one of accident. The appellant’s version of events was that Ian had pushed him while the appellant was holding a glass, and that he “flew backwards” into the crowd behind him. When the crowd propelled him forward, he lost his balance whilst trying to avoid a stool in front of him. As he tried to regain his balance, he merely came into bodily contact with “someone”. Unaware that anything was amiss, he soon left the scene. He recalled catching sight of Ian just before leaving but as far as he could observe, Ian appeared perfectly normal. The appellant further testified that he neither heard nor saw any glass breaking, and that he only noticed a cut on his hand after leaving the discotheque. The appellant only learned about Ian’s injury after reaching home, when his friend Lewis called to inform him about it. 12        The appellant’s version of events was largely corroborated by his girlfriend, Gyneth. However, she testified that she failed to witness any of the crucial happenings that followed immediately after the appellant fell into the crowd, as her view was obstructed by several people standing in front of her. Nevertheless, she testified that she did not hear any glass breaking and that it was only five minutes after the appellant had left the scene that she noticed that Ian’s face was bleeding.",
        "Decision of the court below": "13        Essentially, the trial judge was faced with two opposing accounts of the events leading up to the incident where Ian was injured. Ian’s evidence was that he had bumped into some people as he made his way to and from the toilet. When he returned to the members’ area, the appellant confronted him and a quarrel ensued. In contrast, both the appellant and Gyneth testified to Ian bumping into the appellant several times and the appellant initially trying to ignore Ian and avert an argument. Ian was the one who had initiated a verbal exchange between them and he had even bent over towards the appellant once to yell into his ear. They also testified that Ian had pushed the appellant just as the appellant was getting up from his seat. 14        Having considered the evidence carefully, the trial judge found Ian’s testimony on this part of the case to be vague and ambivalent. The judge preferred the testimonies of the appellant and Gyneth, as their accounts of the events up to this point were clear and consistent. The judge found as a fact that Ian had bumped into the appellant several times that day and that when Ian noticed the appellant staring at him, he became confrontational. The judge also accepted the defence case that Ian had shoved the appellant as he was getting up from his seat. In the trial judge’s view, Ian’s vagueness in his account of these events was an attempt to downplay the role he had in escalating what was originally an inconsequential matter into a serious incident. 15        Having established the backdrop to the incident that followed, the trial judge rightly identified the following ingredients of the offence that the Prosecution had to prove under s 325 of the Penal Code (read with ss 322 and 320 of the Penal Code): (a)        the hurt was caused voluntarily; (b)        the appellant intended to cause or knew that he was likely to cause grievous hurt; and (c)        the hurt so caused was grievous hurt (iepermanent disfiguration of the head or face, as defined in s 320(f) of the Penal Code). 16        Contrary to his earlier recollection of events, the trial judge found the appellant to be evasive and inconsistent when giving evidence as to how Ian’s injury was caused. Significantly, the appellant contradicted himself numerous times when questioned about crucial facts such as whether the appellant was holding a glass in his hand at the material time. 17        The trial judge also disbelieved the appellant’s testimony that he had lost his balance when he was pushed by the people behind him and that he had inadvertentlychargedtoward Ian as a result. The judge was of the view that even if the events had occurred in the manner described by the appellant, he would not have been sent “lunging” or charging uncontrollably at Ian. By his own account, he was not pushed with excessive force and could have regained his balance easily by taking one step forward. It was also inconceivable that the appellant neither heard nor saw the glass shattering nor remembered glass pieces dispersing from his right hand at the material time. The appellant’s testimony was particularly difficult to believe given that the glass had cut the appellant’s hand as well. The trial judge also found that the still shots from the discotheque’s closed-circuit television (“CCTV”) recordings (admitted in evidence as Exhibit P11), which had captured the incident from an angle at some two to three-second intervals, lent further weight to Ian’s claim that the appellant had swung his right arm at him and that Ian had taken evasive action to protect himself. 18        Inferring the appellant’smens reafrom his behaviour, the instrument employed in causing hurt, as well as the nature and location of the injury that resulted, the trial judge found that the appellant had voluntarily and intentionally swung a glass at Ian’s face. As there was permanent disfiguration of the face, the judge accordingly convicted the appellant on the charge.",
        "The appeal against conviction": "19        At the hearing before me, counsel for the appellant invited me to exercise my discretion to amend the present charge to the lesser charge of causing grievous hurtonprovocationunder s 335 of the Penal Code. In essence, counsel was urging me to make a finding that the facts of this case made out a successful defence of provocation. As I noted inToh Lam Seng v PP[2003] 2 SLR 346, provocation is not a general defence under the Penal Code. Further, the existence of the slightest provocation does not automatically take the offence out of s 325. To make out an offence under s 335 of the Penal Code, the appellant has to satisfy the legal requirements of grave and sudden provocation similar to that established by case law dealing with Exception 1 to s 300 of the Penal Code. In other words, the appellant was required to demonstrate that he was deprived of his self-control by the provocation and that the provocation was “grave and sudden” according to the standard of a “reasonable man”:PP v Kwan Cin Cheng[1998] 2 SLR 345,Seah Kok Meng v PP[2001] 3 SLR 135. 20        On the facts of this case, I was not convinced that the appellant had in fact lost his self-control due to provocation. Given that the appellant’s central defence in the trial below was that he had injured Ian accidentally, it was preposterous for him to contend on appeal that he had acted on provocation. In any event, I was of the view that whatever provocation there was in the circumstances could not be considered as “grave and sudden”. The instances of the alleged provocation were as follows: Ian had bumped into the appellant several times at the discotheque and he had asked the appellant a number of inane questions prior to the incident. Ian had also pushed the appellant once as the appellant was getting up from his seat. I was of the view that a reasonable person placed in a similar situation would not have been so provoked as to lose his self-control. It was to be expected that one would come into bodily contact with others in a crowded night spot. While it was understandable that it may have been unpleasant for the appellant to be persistently badgered by a complete stranger, the way in which the appellant retaliated was disproportionate to any provocation on Ian’s part. As such, I found that the appellant had failed to establish the defence of grave and sudden provocation. Accordingly, I declined to amend the charge preferred against the appellant. 21        In addition to the argument above, counsel for the appellant advanced the following grounds of appeal: (a)        that the trial judge erred in finding that the appellant had acted voluntarily; and (b)        that the trial judge erred in finding that the ingredient of grievous hurt in the form of “permanent disfiguration of the face” had been proven.",
        "Whether the trial judge erred in finding that the appellant had voluntarily caused the injury": "22        Counsel for the appellant contended that the trial judge erred in finding that the appellant had the requisite intention to cause grievous hurt. In support of the appellant’s submission that the injury was inadvertently caused, counsel contended that the trial judge erred in preferring the Prosecution’s version of events over the appellant’s on the material aspects of the case. Counsel also argued that the trial judge erred in placing too much weight on the stills captured by the CCTV camera tendered in court as evidence (Exhibit P11 and Exhibit P15). Lastly, counsel urged this court to find that the trial judge erred in concluding that the nature of the injury proved that the hurt was caused deliberately.",
        "Whether the trial judge erred in preferring the Prosecution’s version of events over the appellant’s": "23        The main thrust of the appellant’s appeal was that the trial judge erred in preferring the Prosecution’s version of events over his own regarding the material aspects of the case. This submission was an attack on the findings of fact made by the trial judge. 24        It is trite law that an appellate court will be slow to disturb a lower court’s findings of fact unless they are plainly wrong or against the weight of the evidence. In any appeal against a finding of fact, the appellate court, which does not have the advantage of hearing the witnesses and observing their demeanour, will generally defer to the conclusion of the trial judge who had the opportunity to assess the witnesses’ credibility:Yap Giau Beng Terence v PP[1998] 3 SLR 656. Thus, if an appellate court wishes to reverse the trial judge’s decision, it must not merely entertain doubts as to whether the decision is right but it must be convinced that it is wrong:PP v Azman bin Abdullah[1998] 2 SLR 704,Tuen Huan Rui Mary v PP[2003] 3 SLR 70. 25        Counsel for the appellant submitted that the trial judge erred in accepting Ian’s testimony on how the injury was caused, when she had already found the earlier part of his testimony unreliable. According to counsel, the same, if not more weight, should have been accorded to the appellant’s testimony which was characterised from the outset as “clear and consistent”. 26        I was of the view that this argument was devoid of merit for the following reasons. First, the trial judge, mindful of the fact that Ian had not been entirely truthful when giving evidence relating to the earlier chain of events, had scrutinised Ian’s evidence with great care and circumspection. The end result of this deliberation was that she was nonetheless inclined to believe Ian’s account of events regarding the actual incident. Secondly, there is in any event no rule of law that the testimony of a witness must be believed in its entirety or not at all. A court is competent, for good and cogent reasons, to accept one part of the testimony of a witness and reject the other:Sundara Moorthy Lankatharan v PP[1997] 3 SLR 464,Jimina Jacee d/o C D Athananasius v PP[2000] 1 SLR 205,Hon Chi Wan Colman v PP[2002] 3 SLR 558. In rejecting Ian’s evidence regarding the earlier sequence of events, the trial judge was simply recognising the inclination on Ian’s part to be less forthcoming about the unfavourable aspects of his case. More importantly, the trial judge had tested the two versions with the CCTV recordings in Exhibit P11 (digital copies of the recordings) and Exhibit P15 (hard copies of the recordings) before preferring Ian’s evidence over that of the appellant’s. The still shot at 1:28:06 hours clearly captured Ian, with his head lowered behind his arm, carrying out an evasive action. It also captured the appellant with his arm fully extended and outstretched towards Ian’s direction, at his head level. This extrinsic and objective evidence clearly corroborated Ian’s evidence that he “saw something coming” and took steps to protect himself. Given the circumstances, I was of the view that the trial judge was justified in her discriminate acceptance of the witnesses’ testimonies.",
        "Whether the trial judge erred in placing too much weight on the stills captured by the CCTV camera": "27        Counsel for the appellant submitted that the trial judge erred in placing excessive reliance on the stills captured by the CCTV camera. Counsel argued that due to their poor picture quality, different interpretations of the stills were possible and that this made it unsafe to rely on them to support a conviction. According to counsel, deriving a conclusive interpretation was particularly risky as the recordings were taken at two to three second intervals. To illustrate, counsel drew the court’s attention to several discrepancies between the investigating officer’s (“PW5”) annotation of the stills in Exhibit P15 and the findings of the learned trial judge. One such instance of divergence was in the interpretation of the stills in Exhibit P15 at 1:27:35 hours. PW5 had annotated that the still showed the appellant and the victim exchanging some words. This was in contrast to the trial judge’s finding that the alleged exchange of words was not apparent from the still. Similarly, while PW5 had indicated that the still at 1:28:01 hours showed the appellant pushing the victim away, the judge found that this was not the case. 28        Admittedly, the stills in Exhibit P15 were not of the highest quality, which made it impractical to derive a conclusive interpretation of the images captured therein. Be that as it may, I was of the opinion that this alone was insufficient to warrant their dismissal as entirely lacking in corroborative value. In my view, it was unreasonable to expect the trial judge and PW5 to arrive at the exact same interpretation from their respective examination of the stills. In particular, even if the stills were of good definition, it would be impossible to gather, from a still image, information such as whether the appellant and Ian were engaged in conversation. This was different from objectively inferring from the stills that the appellant’s arm was stretched out in Ian’s direction at the material time. 29        In any case, I was of the view that the instances of discrepancies identified by the appellant were immaterial to the Prosecution’s case. I noted that with respect to the critical shot taken at 1:28:06 hours, both the trial judge and PW5 were in agreement in their interpretation. Both concurred that the still showed the appellant’s arm extended in Ian’s direction and Ian raising his right arm to shield himself. It was also noteworthy that in the particular still, both Ian and the front part of the appellant’s outstretched right arm were brightly illuminated by an overhead spotlight. This made it easier to decipher the captured image. Furthermore, as the trial judge remarked, the digital copies of the still shots (Exhibit P11) were considerably “sharper and clearer” when viewed on a computer screen. Having personally looked at Exhibit P11 on a computer screen, I saw no reason to disturb the trial judge’s finding that the still at 1:28:06 hours was corroborative of Ian’s account of the events regarding the incident.",
        "Whether the trial judge erred in finding that the nature of the injury proved that the injury was intentional": "30        The evidence showed that Ian’s facial injury was a deep, horizontal, 6 to 7cm Y-shaped laceration. The trial judge found that the nature of the injury lent further weight to the Prosecution’s case that the injury was intentionally caused when the appellant swung a glass at Ian’s face. In the trial judge’s view, the appellant’s hand must have struck Ian with sufficient force to cause it to break and form a sharp cutting edge. Counsel for the appellant averred that the trial judge erred in arriving at this conclusion, as accidental injuries can sometimes be more serious than intentional ones. I did not agree with counsel’s submission. While there was no denying that accidental injuries can be severe, I was of the view that given the present factual matrix, the deep cut on Ian’s face was more consistent with a deliberate act on the appellant’s part. This was especially so in light of the appellant’s own evidence that the crowd behind him had not pushed him forcefully and that he could have easily regained his balance by taking one step forward. 31        Having affirmed the various findings of the trial judge, I likewise arrived at the conclusion reached in the proceedings below that the appellant had the requisite intention to cause grievous hurt.",
        "Whether the trial judge erred in finding that the ingredient of grievous hurt in the form of “permanent disfigurement of the face” had been proven": "32        Dr Low recorded in his medical report that the scarring on Ian’s face was “probably permanent”. At the trial below, Dr Low elaborated on this, saying that by this phrase he meant that the cut was deep enough such that when closure was completed, the probable end result of the healing process would be a remnant which could probably be seen in the future. Seizing upon the word “probably”, counsel for the appellant submitted that this was insufficient to prove the ingredient of “permanent disfigurement” beyond a reasonable doubt. In court, counsel conceded that this was not one of the appellant’s strongest arguments in this appeal. 33        I was of the view that it would be unreasonable to expect Dr Low to speak in absolute terms when giving an opinion about something that would come to pass in the future. I noted that Dr Low gave sound and cogent reasons for his opinion, describing the likelihood of a permanent scarring as “probable” based on the depth of the cut on Ian’s face. In any case, any lingering doubt in my mind as to the permanency of the scarring for the purpose of s 325 of the Penal Code was suitably dispelled when I surveyed the photographs of the victim taken some six months after the incident (Exhibits P12 to P14). I noticed a distinct and red Y-shaped scar, extending from the region near Ian’s nose towards his left ear. The trial judge also had the opportunity to observe Ian on the witness stand at around the same time that the photographs were taken. I was of the view that the trial judge’s direct observation in court of the prominent scar lent further weight to Dr Low’s prognosis. In view of the above, I saw no reason to disturb the trial judge’s finding that the permanent disfiguration of the face was proven beyond a reasonable doubt.",
        "The rule in Browne v Dunn": "34        In deciding whether the Prosecution had proven the fact of permanent scarring beyond a reasonable doubt, the trial judge took into account the fact that the Defence had failed to cross-examine Dr Low on his use of the word “probably”. In the trial judge’s view, the appellant “offended” the rule inBrowne v Dunn(1893) 6 R 67 by this failure. As Dr Low was not questioned on his prognosis, he was deprived of the opportunity to explain what he meant by that word. Counsel for the appellant vehemently argued that the trial judge had misconstrued the rule inBrowne v Dunn,as the Defence had no duty to cross-examine Dr Low on this issue. Counsel pointed out that the burden of proving the fact of permanent disfiguration rested on the Prosecution. 35        I could find no fault with the trial judge’s application of the rule inBrowne v Dunn. As I noted inLiza bte Ismail v PP[1997] 2 SLR 454, the central purpose of the rule inBrowne v Dunnis simply to secure procedural fairness in litigation. The rule ensures that contradictory facts are put to the witness during cross-examination to give the witness an opportunity to respond. Any testimony left unchallenged may be treated by the court as undisputed and therefore accepted by the opposing party:Arts Niche Cyber Distribution Pte Ltd v PP[1999] 4 SLR 111. Therefore, in this instance, if the appellant wished to contradict the evidence of Dr Low that the scarring was “probably” permanent, it was incumbent on the appellant to put his case to Dr Low so as to afford Dr Low an opportunity to explain his evidence. 36        The rule inBrowne v Dunnis only concerned with procedural fairness and does not in any way affect the burden of proof. There was no doubt that the appellant’s failure to cross-examine Dr Low did not result in a reversal of the onus of proof. Counsel’s criticism of the trial judge in this regard was misconceived as there was nothing to suggest that the trial judge considered the burden of proving the fact of permanent disfiguration to have shifted to the Defence simply because the rule inBrowne v Dunnhad been infringed. The appellant’s failure to put any contradictory case would only imply an acceptance of Dr Low’s opinion by the appellant. The onus unquestionably remained on the Prosecution to prove that the injury resulted in permanent scarring. In light of my observations earlier, I was of the view that the Prosecution had duly discharged this burden of proof. 37        For the reasons above, I was satisfied that the elements of the offence punishable under s 325 of the Penal Code were fully made out and dismissed the appellant’s appeal against his conviction.",
        "The appeal against sentence": "38        It is well established, on the authority ofTan Koon Swan v PP[1986] SLR 126, that an appellate court will generally not interfere with the sentence passed by a lower court unless it is satisfied that there was some error of fact or principle, or that the sentence imposed was manifestly excessive or unjust. With this principle in mind, I turned to the appeal at hand. 39        Counsel for the appellant maintained that the sentence imposed by the trial judge was manifestly excessive in view of the trial judge’s failure to take due account of all the mitigating factors in the appellant’s favour. 40        Counsel highlighted the following mitigating factors which he felt were inadequately considered by the trial judge. First, the appellant had communicated his remorse to Ian after the incident and had even offered to pay compensation. Second, the appellant could not have foreseen the consequences of his actions as Ian’s injury was caused by the breaking of the glass on Ian’s armbeforehitting Ian’s face. 41        I found these contentions to be of little merit. It was not disputed that the appellant left the scene immediately after the incident without giving any assistance to Ian. The appellant tried to justify his conduct by asserting that he was completely unaware that he had caused any injury then. As I stated above, I disbelieved the appellant’s explanation. Given that he had also sustained a cut to his hand, he must have at least known that the glass he was holding had broken. In my opinion, his abrupt departure without investigating what had happened to his glass only served to expose his guilty conscience. The facts indicated that the appellant initially did nothing, even after learning of Ian’s injury. It was only when the police informed the appellant of their intention to interview him regarding the incident that the appellant attempted to contact Ian. Given these facts, I was of the view that the appellant’s communication of remorse, as well as his willingness to offer compensation had little, if any, mitigating value. 42        I was similarly unmoved by counsel’s submission that the appellant could not have foreseen the full consequences of his actions. This argument appeared to suggest that Ian’s act of raising his arm to shield himself was unanticipated and that it had somehow contributed to his injury. Ian’s injury was not caused by the breaking of the glass on Ian’s arm but by the appellant’s unwarranted act of hurling the glass at Ian at around his head level. Had Ian not attempted to lessen the blow by raising his arm, a more grave injury might have resulted. As the trial judge noted, it was perhaps fortuitous that the glass missed Ian’s eye. Otherwise, Ian might have suffered from deprivation of sight. 43        However, despite making the above observations, I was nevertheless drawn to the conclusion that the sentence of 18 months’ imprisonment and three strokes of the cane was manifestly excessive in view of the numerous mitigating factors present in this case. 44        The trial judge duly considered the following mitigating factors: (a)        the favourable testimonials supplied by the appellant’s superiors at the Republic of Singapore Air Force (“RSAF”); (b)        the appellant’s volunteer work at the Sunlove Home; (c)        that the appellant was a first offender with no antecedents; (d)        that the appellant would probably lose his career in the RSAF as a result of his conviction; and (e)        that Ian was not totally blameless in the matter. While I essentially took into account the same factors considered by the trial judge, I was of the view that more weight should be given to the fact that this was an isolated incident largely promulgated by Ian’s own actions. In interfering with the sentence meted out by the court below, I took particular notice of the considerable role that Ian had in sparking off the whole incident. While there was no doubt that the aggravation provided by Ian was insufficient to establish the defence of grave and sudden provocation, I found it a relevant factor in determining the appropriate sentence in the circumstances. Additionally, I also took into account the fact that the appellant has been punished in other ways. As his conviction would prevent him from serving his bond with the RSAF, the appellant faced potential legal action from his employer. 45        Nevertheless, I recognised that the appellant’s reaction in this instance was far in excess of reasonable behaviour. There was no denying that the appellant had retaliated in a most disproportionate and violent manner. In view of this, I declined to interfere with the sentence of three strokes of the cane despite the urging of counsel for the appellant. 46        In the result, having considered all the circumstances of the case and looking at the totality of the evidence before me, I allowed the appeal and reduced the sentence to 12 months’ imprisonment and three strokes of the cane. Appeal against conviction dismissed. Appeal against sentence allowed."
    }
}