{
    "case_title": "Public Prosecutor v Chaw Aiang Wah",
    "ncitation": "[2004] SGHC 164",
    "coram": "V K Rajah JC",
    "sections": {
        "Facts": "4          A loss of face has in this case resulted in a loss of life. A few minutes of rage have caused permanent misery to at least two families: the victim’s and the accused’s. 5          The accused (“Chaw”) is a 27-year-old Malaysian. At the time of the incident, he was working as a kitchen assistant, as was the deceased. They did not know each other. 6On 24 October 2003, at about 11.00pm, the deceased and his friend, Ho Yuen Meng (“Ho”), decided to take a stroll in Chinatown. 7          On arriving, the deceased dropped into a provision store, the R M Muthu Store, located at the lift lobby of the People’s Park Complex. He intended to purchase a drink. Ho remained outside the store while the deceased went in. 8          Chaw was already in the store having a conversation on his mobile telephone with his girlfriend when the deceased entered. Inadvertently, Chaw bumped into the deceased while talking on the phone. They both then stared at each other. No words were exchanged. The deceased subsequently paid for his drink and returned to the lift lobby where Ho was waiting for him. 9          When Chaw emerged from the store the deceased confronted him, demanding to know why Chaw had been staring at him. Chaw replied that he had only looked at the deceased because of the accidental contact. He attempted to mollify the deceased, saying it was a minor matter that should not be blown out of proportion, especially since both of them were foreigners working in Singapore. The deceased took exception to this, claiming to be Singaporean, though this was untrue. In reality, he too was Malaysian. Chaw was taken aback and demanded whether this meant that a Singaporean could intimidate a Malaysian. Upon hearing the deceased’s affirmative response, Chaw became distressed. He started pacing the lift lobby agitatedly. 10        Ho suddenly noticed the handle of a knife inside a plastic bag Chaw was holding. This was a kitchen knife Chaw was bringing home to cut fruits. Ho, suspecting that Chaw might turn violent, urged the deceased to leave immediately. The deceased and Ho then began to walk away. Noticing this, Chaw asked them if they were leaving because they “had no guts”. On hearing this, the deceased turned back and walked towards Chaw. 11        Chaw had by then noticed two other male passers-by in the lift lobby. He shouted that Singaporeans were bullying Malaysians. As the two passers-by approached, Chaw told them that he had “bumped” into “two guys”, namely the deceased and Ho, and that they now wanted to assault him. One of the passers-by advised the parties not to exacerbate the matter any further; it was, after all, a storm in a teacup. 12        Chaw was by now enraged with the deceased and had worked himself into a frenzy. He took out a small bottle of “Tiger” beer and the knife from his plastic bag. Stricken by panic, the deceased turned on his heels and fled. Chaw immediately pursued him, chasing him along People’s Park Crescent towards Eu Tong Sen Street. Ho initially remained rooted to the ground, but eventually collected himself and ran after the deceased and Chaw. 13        While trying to catch up, Ho suddenly heard the sound of breaking glass. Upon approaching the deceased and Chaw, he saw the deceased approximately 20m away, lying on the ground with his back against the kerb. Chaw was crouching over the deceased. Ho saw Chaw plunging his knife into the back of the deceased’s neck two to three times. The deceased tried unsuccessfully to ward off the blows. 14        Ho was beside himself with anguish. Not daring to confront Chaw directly, he shouted “mata lai liao”, a combination of Malay and Hokkien words that meant “the police have arrived”. Chaw quickly stood up, looked at the deceased and fled from the scene. The deceased later passed away in hospital early in the morning of 26 October 2003. 15        Chaw returned to his flat, changed his clothes and wrapped the knife in some rags. Grabbing his passport, he hurriedly left the flat. Fearing that the police were on their way to apprehend him, he rushed to the open-air car park on the sixth floor of People’s Park Complex and jumped two storeys down to the adjacent rooftop of the Chinatown Mass Rapid Transit (“MRT”) station. Despite injuring himself in the process, he managed to reach ground level. He then hailed a taxi that took him to Johor Bahru. In the course of the journey, he threw away the knife. 16        On reaching Johor Bahru, with the help of his girlfriend’s brother, Chaw sought and received medical treatment for the injuries he had earlier sustained from jumping down two storeys. On 28 October 2003, persuaded by his girlfriend, he returned to Singapore and surrendered to the police. He has freely admitted his role in the incident. 17        Chaw initially faced a charge of murder pursuant to s 302 of the Penal Code (Cap 224, 1985 Rev Ed) (“PC”). This was subsequently reduced to a charge of culpable homicide not amounting to murder pursuant to s 304(a) of the PC to which he pleaded guilty. It is undisputed that the stab wounds to the deceased’s neck caused his death. One of the stab wounds in particular was found by the pathologist to have penetrated the left posterior neck muscles, causing extensive intramuscular haemorrhaging. The depth of the track was about 7cm. This wound was sufficient in the ordinary course of nature to have caused death. The pathologist opined that the knife had been used with “moderate force”.",
        "Sentencing considerations": "18        It is trite law that sentences normally reflect the classical principles of retribution, rehabilitation, deterrence and prevention:PP v Tan Fook Sum[1999] 2 SLR 523at [14]–[19]. These principles are to be evaluated against the backdrop of public interest and policy. Needless to say, the importance of each of these considerations will vary from case to case. Different facts merit different emphasis as these principles do not invariably complement each other. 19        In so far as deterrence is relevant it may be specifically focused on the offender and or generally serve to signify to the community at large that particular actions are offensive and violently conflict with acceptable norms of civil behaviour and good order. Culprits who resort to violent “self-help” to settle scores, real or otherwise, must be prepared to face deterrent sentences in view of the public interest in the prevention of such incidents. 20        The Prosecution drew my attention to the Court of Appeal decision inPP v Tan Kei Loon Allan[1999] 2 SLR 288(“Allan Tan’s case”). In that case, the accused fatally stabbed the deceased in a secret society gang fight incident in front of Dhoby Ghaut MRT station. The Prosecution relies on the case to fortify its quest for a deterrent sentence,inter alia, for the reason the attack took place in a public place. The Court of Appeal observed at [42]: Though the reason why the respondent assaulted the deceased is readily understood, it is not readily justified. The assault was committed, even if on a rival gang member, on a harmless one.It was an assault with a dangerous weapon in a public place. The victim was grossly outnumbered. [emphasis added] The circumstances of that case are, however, quite different. There was a possibility that the incident might have conflagrated into a fracas threatening members of the public. Not all assaults in a public place merit the same sentencing considerations. I am however constrained to observe that while the court in that case may have “understood” the reason triggering the accused’s assault, I cannot say I understand or see any reason, let alone justification for Chaw’s behaviour. While he might legitimately have felt aggrieved by the deceased’s behaviour, any response beyond an exchange of words, at most, was unnecessary. The deceased had “assaulted” him only verbally and never physically. Furthermore, he had not even been physically threatened. 21        The Prosecution also submits that there are aggravating factors that ought to be taken into account: (a)        Chaw gave chase when the deceased disengaged himself from the dispute. (b)        Chaw had an undue advantage – he possessed a knife and a beer bottle. (c)        The savageness of the attack – the deceased sustained four stab wounds on his neck in addition to defensive injuries on his hand. These are, I accept, legitimate factors to be considered in deciding on the appropriate sentence. 22        Counsel for Chaw, on the other hand, has stressed in mitigation that Chaw had surrendered voluntarily, had pleaded guilty at the first opportunity and was genuinely remorseful. He further asked the court to note that Chaw had no previous history of crime or, indeed, of violence and had flown into a rage because of the deceased’s taunting. Chaw, counsel claimed, did not initiate the “incident” and had merely reacted to grave provocation. It should be pointed that this last contention collides with reason, as the requirements for provocation under the PC are not even remotely satisfied in the instant scenario. 23        It is amply clear that Chaw could have walked away from trouble. While it is evident that the deceased’s conduct had unreasonably aggravated the incident despite Chaw’s attempts to placate him, the tables soon turned. The deceased took flight despite his initial aggression. Chaw unfortunately, had by then worked himself into a frenzy. He deliberately chose to run into trouble and ultimately to court tragedy. From being the initial victim, he became the relentless and remorseless aggressor. He manifested a savage determination to grievously injure the deceased. The injuries to the deceased were directed to his neck – a vulnerable area. The deceased’s frantic attempts to ward off the attack were cold-bloodedly brushed aside. 24        Considerations of retribution and deterrence are of particular importance in this case. Granting that Chaw’s counsel has referred to some salient mitigating factors, these alone cannot, in the final analysis, erase or even diminish the impact of the callous and wholly irrational attack. This case is, lamentably, an arresting example of “face rage”. Indeed, Chaw’s counsel himself submitted – as if this could entail palliative considerations – that “the accused had felt so belittled by the vulgarities and taunting” from the deceased. None of this can by any stretch of imagination remotely justify Chaw’s subsequent response. Such a savage assault must be denounced in the strongest possible terms, not just through words but through the sentence imposed. In my view, this incident clearly necessitates a deterrent sentence. 25        Section 304(a) of the PC prescribes a sentence of imprisonment for life or for a term not exceeding ten years and, in addition, a fine or caning. One has to bear in mind, though, that the range of circumstances involving such genres of culpable homicide can be extremely wide. Given the stark contrast today between a term of life imprisonment and a fixed term, considerable care and circumspection must be exercised in pronouncing the appropriate sentence. InAllan Tan’s case the court also instructively stated at [40]: In a situation in which the court is desirous of a sentence greater than ten years, but feels that a sentence of life imprisonment is excessive, we have no choice but to come down, however reluctantly, on the side of leniency. Otherwise, the punishment imposed would significantly exceed the offender’s culpability.It would, in our view, be wrong to adopt an approach in which the court would prefer an excessive sentence to an inadequate one.[emphasis added] 26        These observations inexorably emphasise that restraint should be exercised in choosing between a sentence of life imprisonment and a conventional fixed-term sentence. The spontaneity of this incident and Chaw’s crime-free history militate against the imposition of a life sentence. A sentence of life imprisonment would be inappropriate: it would be both disproportionate and crushing. 27        My attention was also drawn to the sentences meted out in some recent cases pertaining to s 304(a) of the PC. InPP v Mohamed Shaiful bin MohamedCriminal Case No 19 of 2001, the accused accidentally bumped into the deceased in a discotheque. The accused did not apologise. The deceased then asked the accused, “What is the problem?” The accused refused to apologise as he felt that it was an accident. The deceased then abruptly beckoned the accused towards him. The accused instead rushed to his locker and retrieved a knife that he had brought along for protection against rival gangs. A fight broke out between the accused, the deceased, and their friends. The deceased was armed with a metal pole during the fight. In the midst of the fight, the accused lunged at the deceased and stabbed him once in the abdomen and once in the chest. The accused had previously been ordered to undergo reformative training at the Reformative Training Centre for theft, rioting and assisting in the disposal of stolen property. The accused pleaded guilty and was sentenced to ten years’ imprisonment and 12 strokes of the cane. 28PP v Lai Kah SengCriminal Case No 5 of 2001 involved a dispute that broke out between the deceased and his neighbour. The accused advised the deceased that the police were nearby. The deceased retorted that he was the head of a secret society group, and told the accused not to frighten him with the word “police”. The accused was enraged and stabbed the deceased with a knife which he had kept in his letterbox. After the incident, the accused fled to Bangkok. Seven years later, he was apprehended for trying to re-enter Singapore with a forged passport. The accused’s criminal record included offences of robbery, theft and gaming in public committed more than ten years earlier. The accused pleaded guilty and was sentenced to eight years’ imprisonment and 12 strokes of the cane. 29        Each case comes with its own unique concatenation of circumstances. The sentences meted offer guidance but do not dictate adherence. The common and discernable thread in these cases is the disproportionate manner in which each accused responded to a perceived “insult”. I also note that the accused in the two cases cited had criminal antecedents. Nevertheless, I am constrained to take into account the aggravating factors which the prosecution has rightly identified and the need for a deterrent sentence for the reasons adverted to earlier (see [1]–[3] and [24]). In the circumstances, the appropriate sentence for Chaw is ten years’ imprisonment with 12 strokes of the cane. The custodial sentence shall be backdated to commence on 28 October 2003, being the date Chaw was taken into custody. 30        Those who easily take offence to perceived slights and choose to be unduly affronted ought to take notice that the law not only frowns upon intimidation but also on wholly disproportionate responses to such conduct. Accused convicted and sentenced."
    }
}