{
    "case_title": "Intercontinental Specialty Fats Berhad v Bandung Shipping Pte Ltd and Others",
    "ncitation": "[2004] SGHC 1",
    "coram": "Tai Wei Shyong AR",
    "sections": {
        "The Evidence of Mr Ramamoorthy": "4          Mr R Ramamoorthy is an Indian National working in India as a broker in edible oils with a firm called AR International.  Prior to his being called as a witness, counsel for the defendant, Mr Toh, made a preliminary objection to certain paragraphs of Mr Ramamoorthy’s affidavit of evidence-in-chief.  The objection was to paragraphs 8 to 12, which for convenience I set out below: “Opinion 8          Due to the nature of my business, I keep records of prices of RBD palm olein prevalant in various places in India.  Such places include Kandla, Bombay, Madras and Kakinada.  These records are kept in our daily rates register.  The prices were obtained from the market place during conversations with various traders. 9          The entries for 27 April 2000 to 1 May 2000 except for 30 April 2000 which was a Sunday are now produced and shown to me marked “RR-1”.  It can be seen from these entries that the prices of RBD palm olein in Kandla for the period 27 April 2000 to 1 May 2000 ranged from Rs. 211 to Rs. 220 per 10 kilograms.  I have calculated the average rate to be 214 per 10 kilograms, or Rs. 21,400 per metric ton.  This is equivalent to about US$349.73 per metric ton after deducting import duty of 32.6% and freight of US$20.00 per metric ton.  The exchange rate applied is 43.65.  [The calculation is 21,400 / 43.65 – 20.00]. 10        I would like to add that there is an organization known as the Tamil Nadu Oil And Seeds Association, which publishes a Market Report of the RBD palm olein in Chennai. 11        For the period 27 April 2000, to 1 May 2000, the prices of RBD palm olein in Chennai ranged from Rs. 210 to Rs. 215 per 10 kg or Rs 21,000 to Rs 21,500 per metric ton.  A copy of the Market Report dated 2 May 2000 that covers the period from 24 April 2000 to 29 April 2000 is now produced and shown to me marked “RR-2”.  There is no report for 30 April 2000 because it was a Sunday, and 1 May 2000 was a public holiday. 12        I would like to explain that prices in Kandla are not exactly the same as that in Chennai because the prices are determined by market forces of demand and supply.  However, the prices in these 2 places are comparable.  A summary of the prices for both Kandla and Chennai for the period of 27 April 2000 to 1 May 2000 is set out hereunder: …” 5          Mr Toh’s argument was that in paragraphs 8 and 9 Mr Ramamoorthy was seeking to repeat in court the out of court statements of the Palm Olein traders for their truth, and the statements were therefore inadmissible hearsay.   Mr Toh also objected to the report of the Tamil Nadu Oil And Seeds Association, on the basis that the maker of the report was not in court to admit it.  He cited several cases to me, but relied most heavily onSaga Foodstuffs Manufacturing (Pte) Ltd v Best Food Pte Ltd[1995] 1 SLR 739andThe Shravan[1994] 4 SLR 197.Saga Foodstuffswas a case on the tort of passing-off, and the relevant point alluded to by Mr Toh concerned the question of whether market survey results could be admitted to show the opinions and perceptions of respondents to the survey.  In that case, it was held that the survey report could be admitted since it was being admitted to show the opinions of the respondents, and not to prove the truth of the survey results.  Mr Toh relied on this case for the general proposition that where out of court statements were repeated in court for their truth, they offended the rule against hearsay and should not be admitted. 6The Shravanwas an admiralty matter which raised the issue of the proper assessment of the plaintiff’s losses based on the diminution in price from the market value of the goods.  That case, submitted Mr Toh, showed that the rule against hearsay applied to such an enquiry. 7          I had no doubt that the two propositions advanced by Mr Toh were correct propositions of law.  What concerned me was whether I should shut out Mr Ramamoorthy’s evidence even before he had had an opportunity to be heard.  In the end, I felt that to do so would be peremptory, and I thus reserved my ruling on the objection and allowed Mr Ramamoorthy to affirm his affidavit in court, and also for him to be examined under affirmation by counsel. 8          Mr Ramamoorthy’s evidence in court was essentially that since the importation in India of edible oils was opened to private companies in 1996  (previously being controlled by the Government through the State Trading Corporation), he had kept records of prices of RDB Palm Olein prevalent in various places in India, including Kandla, Bombay, Madras and Kakinada.  The prices for Kandla had been given to him by various traders operating in the market there, namely, Madhukant Agrotech and Adani Wilmar.  The entries were handwritten in a ledger book which was produced in court, but it was not admitted into evidence as such as Mr Ramamoorthy was not amenable to leaving it in the court’s possession.  Rather, photocopies of the relevant entries for 27 April 2000 to 1 May 2000 were admitted as part of his affidavit of evidence-in-chief.  No objection to this was taken by the defendant on this point. 9          The entries in the ledger for RDB Palm Olein in Kandla over the relevant period (excluding 30 April 2000 which was a Sunday and for which no price was quoted) showed a range of prices between Rs 211 per 10 kg and Rs 220 per 10 kg, and Mr Ramamoorthy (and consequently Mr Tay) had used an average price of Rs 214 for the purpose of calculating the plaintiff’s losses. 10        I further garnered from Mr Ramamoorthy’s testimony in re-examination that the Kandla market for Palm Olein was a daily market for which prices would be quoted by traders operating in the market. I set out the material part of his testimony in relation to this: “RXN by Mr Tan Q:        You say these were the traders that supplied you with the rates?  Prices of actual transactions they carried out? A:         Yes. Q:        For one of these traders to give you a price, do you know how many underlying transactions there are? A:         Everyday they quote a price, like coffee market in Malaysia.  Similarly, everyday you have a price quoted by importer. Q:        This is a price quoted by them? A:         By the traders. Q:        Do you know whether there are actual transactions? A:         Yes.  Every day the importers quote a price like FOB prices in Malaysia for palm olein.  Similarly, they open a price and trade. … Q:        Bring you back to para 8 of your affidavit – what do you mean by “the marketplace”? A:         Sometimes, particular markets, for example, Kakinada, it’s a port, like Kandla is a port, most of the importers have offices in Ahmabadad.  For Kandla its Hyderabad.  The controlling places are in the major cities. Q:        These people rely on the people on the ground? A:         No.  The Kandla prices are dependent on the prices given by the companies I gave you.  Adani Wilmar.” 11        After Mr Ramamoorthy had given his oral evidence, Mr Toh renewed his strenuous objection to the introduction of the prices.  He cited several more cases in support of his contention, and further relied strongly on the English case ofEnglish Exporters (London) Ltd v Eldonwall Ltd[1973] 1 Ch 415. 12        After hearing submissions from both parties, I admitted the evidence relating to the prices in Kandla (paragraphs 8 and 9 of Mr Ramamoorthy’s AEIC), however, I disallowed the evidence in relation to the price of Palm Olein in Chennai (paragraphs 10-12 of his AEIC), which was based on the market report of the Tamil Nadu Oil And Seeds Association.  Although there is an appeal only in relation to my decision to disallow the report, I shall explain both my decisions since the reasons are intertwined, and also in view of the strenuous submissions from both sides before me.",
        "The Admissibility of the Kandla and Chennai Prices - Hearsay": "13        It is trite law that whether a statement is inadmissible hearsay or not depends on thepurposefor which it is sought to be admitted, as the formulation of the basic rule by the great jurist Stephen bears out: A statement oral or written made otherwise than by a witness in giving evidence and statement contained or recorded in any book, document or record whatever, proof of which is not admitted on other grounds, are deemed to be irrelevant for the purpose of proving the truth of the matter stated.[1] 14        On this much there could be no disagreement between both the parties and indeed there was none.  Looking purely at the affidavit evidence therefore, Mr Toh’s objection appeared well founded – ie., if Mr Ramamoorthy was repeating the price given to him to establish that as a matter of fact, the price of Palm Olein was say, Rs 211 per 10 kg, in Kandla on a particular day, then it would appear that the court would be relying on the truth of the statements made to him.  However, taking into account Mr Ramamoorthy’s oral evidence as well, I did not think the matter could be so simply dealt with. 15        If the traders were informing Mr Ramamoorthy not of the price of Palm Olein as a matter of independent fact, but rather the pricethey were offeringfor Palm Olein at the time, then I do not think that their statements should be considered hearsay.  This is perhaps best illustrated by an example.  If a valuer were asked to form an opinion on the price of a house in a particular district, he could ask persons who had bought properties in that district in recent times for their transaction prices as a guide.  The houseowners’ statements in the form of “I bought my house for $X” would be hearsay if the valuer repeated them in court for the purpose of showing that the particular buyer indeed had bought his house for $X.  However, if the valuer had gone door to door and asked persons living in the district to offer him a price for their properties, he could I think repeat the offers of the houseowners in the form of “I will sell you my house for $Y” in court, without offending the hearsay rule.    The offer to sell for $Y is in itself a speech act, which fact the valuer is entitled to rely on to come to his opinion.  He is not relying on a 3rdparty’s reporting of anextraneousfact which the 3rdparty alone has experienced.   He is relating his own relevant experience to the court. When I put this example to Mr Toh during his submissions, he took the view that even the statements of the houseowners in the form of an offer to sell for $Y would amount to hearsay.  When asked why, he argued that if the court were to rely on thepricequoted by the witness, the court would necessarily be relying on the truth of the content of the statement. 16        I could not agree.  In order for a statement to be susceptible to the prohibition against hearsay, the statement must in the first place assert the existence of some fact.  Statements which do not assert the existence of any fact have no ‘truth’ content on which the rule can bite, and are therefore outside the operation of the rule.  A good example would be statements in the form of a question.  Questions cannot be subject to the hearsay prohibition because a question by its very nature does not assert the existence of any fact (although questions frequentlyassumethe existence of certain basic facts).  So too I think offers to buy or sell goods, as a legal category of statements, are not susceptible to be excluded as hearsay (although they may be excluded on other grounds, such as irrelevance). In the present context, I would add that the price or value of an offer has no “truth” content independent of the offer – the only fact that is being reported is the fact that an offer was madeat that price.  That being the case, I am unable to see why the valuer in my example could not legitimately come to court and say: “Mr Tan offered to sell me his house at $1M; Mr Lim offered me $1.2M; so I think a fair value of the house in question is $1.1M.”  If there were any doubt about the accuracy of the valuer’s reporting of the offers, Mr Tan and Mr Lim could be called to corroborate his evidence.  If they were not, then the question would be whether to draw an adverse inference against the valuer.  However, that would have no bearing on the evidential status of the statements. 17        This distinction I have drawn is borne out by the second case cited by Mr Toh, theEnglish Exporterscase.  This was a case which involved the determination of an interim rent by the evidence of experts, and it is worth quoting the judgement of Megarry J, sitting at first instance, at some length: Let me put on one side the cases in which exceptions to the rule excluding hearsay evidence have grown up…and confine myself to the admissibility of hearsay in chief and in re-examination in these valuation cases.  In such circumstances, two of the heads under which the valuer’s evidence may be ranged are opinion evidence and factual evidence.  As an expert witness, the valuer is entitled to express his opinion about matters within his field of competence.  In building up his opinions about values, he will no doubt have learned much from transactions in which he has himself been engaged, and of which he could give first-hand evidence.  But he will also have learned much from other sources, including much of which he could no first-hand evidence.  Textbooks, journals, reports of auctions and other dealings, and information obtained from his professional brethren and others, some related to particular transactions and some more general and indefinite, will all have contributed their share.  Doubtless much, or most, of this will be accurate, though some will not; and even what is accurate so far as it goes may be incomplete, in that nothing may have been said of some special element which affects values.  Nevertheless, the opinion that the expert expresses is none the worse because it is in part derived from the matters of which he could give no direct evidence.  Even if some of the extraneous information which he acquires in this way is inaccurate or incomplete, the errors and omissions will often tend to cancel each other out; and the valuer, after all, is an expert in this field, so that the less reliable the knowledge that he has about the details of some reported transaction, the more his experience will tell him that he should be ready to make some discount from the weight that he gives it in contributing to his overall sense of values…  No question of giving hearsay evidence arises in such cases; the witness states his opinion from his general experience… On the other hand, quite apart from merely expressing his opinion, the expert often is able to give factual evidence as well.  If he has first hand knowledge of a transaction, he can speak of that…So far as the expert gives factual evidence, he is doing what any other witness of fact may do, namely, speaking of that which he has perceived for himself.  No doubt in many valuation cases the requirement of first-hand evidence is not pressed to an extreme…it may be that it would be possible for a valuer to fill a gap in his first-hand knowledge of a transaction by some method such as stating in his evidence that he has made diligent enquiries of some person who took part in the transaction in question, but despite receiving full answers to his enquiries, he discovered nothing which suggested to him that the transaction had any unusual features which would affect the value as a comparable.  But basically, the expert’s factual evidence on matters of fact is in the same position as the factual evidence of any other witness… That being so, it seems to me quite another matter when it is asserted that a valuer may give factual evidence of transactions of which he has no direct knowledge, whether per se or whether in the guise of giving reasons for his opinion as to value.  It is one thing to say “From my general experience of recent transactions comparable to this one, I think the proper rent should be £X”:  it is another thing to say “Because I have been told by someone else that the premises next door have an area of x square feet and were recently let on such-and-such terms for £y a year, I say the rent of these premises should be £z a year.”  What he has been told about the premises next door may be inaccurate or misleading as to the area, the rent, the terms and much else besides.  It makes it no better when the witness expresses his confidence in the reliability of his source of information: a transparently honest and careful witness cannot make information reliable if, instead of speaking of what he has seen and heard for himself, he is merely retailing what others have told him. The other party to the litigation is entitled to have a witness whom he can cross-examine on oath as to the reliability of the facts deposed to, and not merely as to the witness’s opinion as to the reliability of information which was given to him not on oath, and possibly in circumstances tending to inaccuracies and slips ...” 18        In the present case, I was prepared to treat Mr Ramamoorthy’s testimony on the Kandla prices as evidence that the traders were offering the prices quoted.  In my view, his evidence in re-examination (which was not challenged as such) established that for the market of Palm Olein in Kandla, the traders were really price setters, that is to say, the traders were not reporting an independently existing market price, but rather dictating the price themselves.  It seemed to me that Mr Ramamoorthy was entitled to testify as to this, subject to any attack on the reliability of his recording of the evidence.  In this regard, I think that Mr Toh was quite right to cross-examine him rigorously as to the manner of his notations and the accuracy of the information.  However, to shut out the evidence completely would, in my view, not be correct in law.   The statements themselves were facts relevant to him coming to his opinion that Rs. 214 per 10 kg was an appropriate value to use in calculating the plaintiff’s loss, and the court was entitled to recognise those facts. 19        I hope it is evident from what I have said above why I disallowed the evidence in relation to the Chennai prices.  In relation to those prices, the report produced before me was clearly a report asserting independent facts – ie, the prices being offered by the traders in the Chennai market (assuming in the first place that the market in Chennai operated the same way as in Kandla).  The maker of the document was not in court, nor were the traders who had set the prices.  Furthermore, even if the document and the evidence consequent upon it was not hearsay, it was in my view irrelevant, because it related to an entirely different market from Kandla.  I therefore upheld the objection in relation to these prices. [1]Digest of the Law of Evidence, art 15."
    }
}