{
    "case_title": "Muhamad Ilyas Bin Mirza Abdul Hamid v Kwek Khim Hui",
    "ncitation": "[2004] SGHC 12",
    "coram": "Tai Wei Shyong AR",
    "sections": {
        "Background": "5          Before turning to the various heads of damage, it would be useful to set out briefly the background to the plaintiff’s claim.   The plaintiff is the youngest in a family of three sons, and was educated at Westlake Primary School from 1986 to 1991.  He was appointed Head Prefect in his final year there, and awarded the Outstanding Student Award in 1990.  In the PSLE examinations, he qualified for the Gifted Education Programme (GEP) and won a Mendaki Award and Scholarship. 6          He was posted to Raffles Institution for this Secondary Education from 1992 to 1995.  There, he was in the GEP and also qualified to study a foreign language – he chose French.  He eventually obtained 10 Distinctions in his GCE “O” Level Examinations and once again won a Mendaki Scholarship for his outstanding results.  He continued his studies at Raffles Junior College and unsurprisingly his results were excellent.  He achieved 4 “A”s for his GCE “A” Levels, distinctions in General Paper and French, and a Merit for Mathematics (Special Paper).  He also obtained very good scores in the SAT I and SAT II tests, including maximum scores for both Mathematics and Physics in SAT II. 7          In December 1997, the plaintiff commenced serving his national service at HQ Company, HQ 9 Division of the Singapore Armed Forces.  He later applied for and was a Scholarship by the Economic Development Board (EDB) in May 1999 to pursue a course of Electrical Engineering starting in the academic year 2000, at a university in the USA.  He was in the midst of making applications to various universities in October 1999, when he sustained the injuries which are the subject matter of this suit. In spite of the accident, he was offered a place at University of California (UC Berkeley) to pursue a course in Electrical Engineering and Computer Science, which he accepted. 8          He left for his studies in California in late 2000, however, he soon encountered difficulties with his academic work.  Towards the end of his second semester in April 2001, he enrolled in the “Disabled Students’ Program”.  He was granted accommodations of a heavily reduced course-load each semester, and also more time to sit for exams, but he was nevertheless unable to complete the course in the usual 3 year period.  In the result, the EDB terminated his scholarship and he had to pay S$156,027.79 in liquidated damages.   The hearing before me took place during the break between his 3rdand 4thyear at university.  As I understand his evidence, in order to graduate, he is required to complete a certain number of “lower” and “upper” division technical courses, and a certain number of “lower” and “upper” division elective courses.  After 3 years, the plaintiff has completed all the lower division technical courses required and 2 upper division technical classes.  He had also done most of his lower and upper division elective classes. 9          I now turn to consider the awards made under each head of damage.",
        "Pain and Suffering and Loss of Amenities": "10        The plaintiff had through his advocate and solicitor, Mr Lim, claimed a total of $131,000 for pain and suffering and loss of amenities.  Mr Lim had cited to me a number of authorities, but it is only necessary to refer to the more relevant ones.  InChua Seng Lee v Ang Teow Koon & Anor(Suit No. 2103 of 1996), the plaintiff, a 24 year-old hairstylist at the time of the accident, had sustained a crushed brain and had been in a coma for 4 months, as well as multiple face and skull fractures.  For this he was awarded $120,000.  InTeng  Kui Thai & Anor v Goh Chwee Kim(Suit No. 70 of 1993), the plaintiff, a 26-year old seamstress at the time, had suffered a comminuted fracture of the left maxilla and a comminuted fracture of both malar complexes.  For this she was awarded $20,000. 11        For his part, the defendant through his advocate and solicitor, Mr Rama, argued that the total under this head of damage should be $50,000.  Mr Rama too relied on a number of cases but I shall refer to only some of them.  InEr Hung Boon v Law Shyan En(DC Suit 1567/1997), the plaintiff was awarded $19,000 agreed damages for fractures of the left malar and the left mandible, superficial abrasions over the left elbow and the right dorsum of the right hand, swelling over the left cheek and loss of consciousness.   For memory impairment, $20,000 had been awarded.  According to the summary of the case presented to me by Mr Rama, the plaintiff in that case had in that case suffered lapses in concentration span, his immediate verbal memory, delayed verbal memory and recognition memory were impaired, his immediate and delayed visual memory were impaired, and also his visual recall of objects.  InYusuf Bin Darus v Singapore Bus Service (1978) Ltd(Suit 19 of 1997), the plaintiff had suffered a brain injury and skull fracture, for which he was awarded $50,000.  He also suffered a fracture to the left orbit, for which he was awarded $3,000, and fractures of 8 teeth, for which he was awarded $8,000.  In relation to the fracture of the plaintiff’s right malar, Mr Rama cited the case ofAB Rahman Bin Tahir v Johanizam bin Seram & Anor(DC Suit 5719/1997), where the Mr Rahman was awarded $10,000 for fracture of the Malar complex, and also the case ofSong Yong Chiat v The Personal Representative of Andre Tng Boon Liat & Anor[2000] MD para 287, where the plaintiff was awarded $5,000 for a fracture of the left malar. 12        With these authorities as a background, it would be helpful to summarise the plaintiff’s injuries in this case.  According to his Affidavit of evidence-in-chief, he has no recollection of what happened in the 3 weeks following his accident, from 6 October 1999 to 25 October 1999.  After the accident, he says that he had to re-learn many basic skills, including how to speak, but thankfully his memory improved over time.  It was, however, one of his major contentions before me that his memory did not ever regain its earlier capabilities – his counsel submitted before me that prior to the accident, he had had “photographic” memory, whereas after the accident, his memory was much poorer.  I shall deal with this point later.  The plaintiff also alleged that he had hearing and visual impairments, and had also developed an acne problem, as a result of the accident.  Further, he experienced sleeplessness and depression as a result of the difficulties he was facing. 13        In his evidence in chief, the plaintiff also complained that other cognitive skills had been affected.  For example, while he might be able to remember something, he would not be able to understand it.  Also, he said that while he was able to understand something, he might not be able to apply that knowledge.  It was these problems that he attributed to his difficulties in University, and his consequent inability to complete his course within the usual amount of time – which was 3 years.",
        "The Plaintiff’s Intellectual function": "14        Let me now address specifically the question of the plaintiff’s loss of intellectual function, which formed a major part of his case.   The extent of his loss in this respect, if any, would certainly affect the damages that should be awarded under this head, but the relevance of any injury would be far wider.  It will be seen that counsel for the plaintiff placed heavy emphasis on his loss of intellectual function in general, and loss of memory in particular, in his claim for loss of scholarship and loss of future earnings.  I therefore feel that this question should be dealt with in some detail. 15        Counsel for the plaintiff called 3 medical experts to give evidence.   First, counsel called Dr Robert G. Don, a specialist in rehabilitation medicine practising at Mt Elizabeth Medical Centre, to testify on the plaintiff’s behalf.   Dr Don had examined the plaintiff on 11 June 2002 for a medico-legal evaluation of the disabilities sustained in the accident, and subsequently produced a report dated 3 July 2002 (PB 89 etc).  Before turning to the issue of memory, it is worth, I think, noting certain preliminary observations made by Dr Don in his clinical examination of the plaintiff, which he noted in the report.  First, he noted that the plaintiff had no physical disability; gait was normal with no motor impairment in upper and lower limbs and no ataxia or in co-ordination.   Speech was normal, and he appeared to have no cognitive impairment during the interview; orbital, malar and mandible fractures had healed. 16        Dr Don’s conclusion was that although the plaintiff had recovered without any physical disability, it was likely that he had significant memory impairment resulting in serious learning disability with poor concentration span and difficulty in application of learned information so that it requires much greater effort on his part to learn.  There was no doubt, according to Dr Don, that he also suffered from an emotional and depressive state, which could occur after head injury.  He opined that the plaintiff was not likely to get much better. 17        In cross-examination, Dr Don agreed with counsel for the defendant, Mr Rama, that he had based his opinion on what he had been told by the plaintiff himself.  However, he said he had also based his opinion largely on the clinical findings of the hospital where the plaintiff had been admitted.   Dr Don was of the view that in this type of case, it was not possible for the plaintiff to get away without any residual disability, and that he would necessarily suffer some residual brain disability. 18        The Plaintiff next called Ms Shrimathi Swaminathan, a clinical psychologist working with The Psychiatric & Behavioural Clinic (Ang & Kong).  Ms Shrimathi had administered a number of tests on the plaintiff and had produced a report of her findings in a report dated 6 July 2002 (PB52 etc).  She noted in her report that the plaintiff had undergone surgery to mend a broken jaw and cheekbone, and that he had been seen by dental surgeons, ophthalmologists, neurologists and behavioural science practitioners in the months after the accident and recovered gradually but “tremendously”.   However, he had much difficulty in coping with academics contrary to his usual facility in fulfilling academic expectations.  He also experienced peculiarities in his behaviour since the accident.  Sometimes, his friends found him staring blankly at nothing, and sometimes they complained that he talked for several hours without them being able to understand what exactly he was trying to communicate.  His father mentioned that he had become quite insolent or rude to elders, irritable and impatient after the accident.   Ms Shrimathi herself observed that his mood was low and that he seemed depressed.  He did not express any suicidal ideation but became overcome with emotion as he talked about his difficulties.  He mentioned having very high expectations and demands for himself and feeling helpless. 19        In relation to the tests administered to the plaintiff, Ms Shrimathi concluded that his verbal IQ was “very superior”, attaining a score of 144, which placed him in the 99.8thpercentile.   His performance IQ was “High Average”, and his Full Scale IQ score was 136, placing him at the 99thpercentile.  Comparisons of the different index scores showed that his Verbal Comprehension and Working Memory were “Very Superior”, while his Processing Speed was only Average.  Significantly, however, her evidence was that the plaintiff’s memory, both immediate and delayed was only average.  Comparisons of the index scores on the Wechsler Memory Scale (3rdRevision) revealed a significant discrepancy between auditory and visual memory.  The plaintiff’s visual memory, that is, memory for faces and pictures of people, was not as good as his auditory memory.  Further, a comparison of the Wechsler Adult Intelligence Scale (3rdRevision) Full Scale intelligence score with the WMS-III memory index scores revealed a wide discrepancy.  The memory scores were far lower than would be expected on the basis of his current IQ scores, without consideration of his pre-morbid intellectual functioning.  Ms Shrimath’s final conclusion was that he had significant impairment in memory and therefore in learning leading to inability in meeting academic expectations to the extent that he could prior to the accident.  He was also emotionally distressed by the impairment.  She recommended that he undergo psychotherapy to cope emotionally with his memory impairment and to develop appropriate learning strategies to compensate for the impairment. 20        Finally, the plaintiff called Dr Tang Kok Foo, consultant neurologist with Tang Neurology and Medical Clinic.  I think it is fair to say that Dr Tang was the most familiar with this case as his conclusions were based on 10 consultations and interviews, including interviews with the plaintiff’s father.  Dr Tan concluded in a report dated 30 August 2002 (PB 92 etc) that the plaintiff had improved progressively with an intensive program of cognitive stimulation and exercises.  However, he had residual cognitive and behavioural abnormalities which are significant, and which impaired his academic achievements.  According to Dr Tang, this reduced “markedly” his potential for employment in high office and hence his earning potential, and was permanent and irreversible. 21        For his part, Mr Rama for the defence had engaged 2 of their own experts to evaluate the plaintiff.  They were Dr Prem Pillay and Dr David Oon.  However, in the course of the hearing, it emerged that the plaintiff had been examined by 2 other doctors at the behest of the EDB prior to his commencing his studies in the USA.  They were Dr Harold Robers and Dr Y. C. Lim. They too were subsequently called by the defendant to give evidence. 22        I start with the evidence of Dr David Oon.  The plaintiff was referred to Dr Oon by Dr Prem Pillay for neuropsychological testing.   On 2 June 2003, Dr Oon administered a number of tests on him, including the Weshsler Adult Intelligence Scale (3rdRevision), the Rey Complex Figure Test, the Graham-Kendall Memory-for-Design Test and the Wechsler Memory Scale (3rdRevision).  Dr Oon’s conclusions were that his cognitive abilities are within the Very Superior Range (Full Scale IQ of 132).  Further, in Dr Oon’s view, no deterioration of memory was indicated. 23        Dr Pillay, a consultant neurosurgeon at the Pillay Brain, Spine and Nerve Centre located in Mount Elizabeth Medical Centre examined the plaintiff on 4 June 2003 for the purpose of a specialist medical evaluation and report (DB 5 etc).  When examined, the plaintiff’s cranial nerve examination was normal.  Motor power was Grade 5/5 in the upper and lower extremities.  Sensory and cerebellar testing were also normal. 24        In Dr Pillay’s opinion, the plaintiff’s IQ assessment done by Dr Oon was commensurate with his estimated pre-morbid Very Superior intellectual level as ascertained by his past educational attainment prior to the accident.     However, his performance on the testing of memory indicated that his immediate memory and general memory were average.  His auditory immediate was not as good as his auditory delayed.  Dr Pillay’s overall conclusion was that there had been mild to moderate deterioration in his memory as a consequence of his accident.  There were no physical disabilities.  His current IQ assessment would suggest at worst only a mild deterioration of IQ as a consequence of the accident. 25        The thrust of the plaintiff’s evidence in court in relation to his intellectual ability was that it had deteriorated greatly as a result of the accident.   The focus of this was primarily in relation to memory loss.  He asserted that while he used to have “photographic” memory, he now would struggle to remember things.  Looking at all the medical reports, and the plaintiff’s complaints, I accepted that on the balance of probabilities he suffered a deterioration of memory.  This was consistent not only with the reports of the plaintiff’s experts, but also with the report of Dr Pillay who was called on behalf of the defendant. 26        I also found, having heard the expert evidence, that the plaintiff must have suffered emotional trauma, including symptoms of depression, as a result of the accident.  No one could, I think, escape from such a horrific accident unscathed both physically and emotionally.  Thankfully, he appeared to have little residual physical disability, and when he appeared before me, seemed to be socially normal and able to engage responsively in meaningful dialogue.  Indeed, looking at his post-accident IQ scores, the plaintiff was indeed a highly intelligent individual, and it was clear in my mind at least that he possessed (still) the pre-requisites to being exceptionally successful at whatever career he chose to pursue.   I found the evidence insufficient to establish any deterioration in IQ, and in any event, this was not seriously pursued by the plaintiff. 27        In the circumstances, I felt that a global award of $80,000 was a fair award for pain and suffering and loss of amenities. InMukhtiar Singh v Balwyndarjeet Singh[1993] 3 741, Rubin J had said: The main injuries suffered by the plaintiff were to his right hand and those injuries had led to several related claims and the possibility of overlapping on the damages to be awarded. In deciding the approach to take in awarding damages where there was a danger of overlapping, the test to be applied was whether the injuries sustained related to the same part or function of the body, or whether the injuries sustained were to different part of the body and affected different functions. Where the injuries fell within the former category, there should be one award of damages, and where the injuries fell within the latter category, it would be appropriate to make a separate award for each head of damage. However, care would have to be taken to avoid a further `sub-itemizing` of a head of damage or injury. In the present case, as the injuries sustained were related to the same part or function of the body (save for the scars due to skin grafting), the court considered $50,000 a fair and reasonable global award for the plaintiff`s injuries of the fracture of the humerus with metal plating, the amputation of the right thumb and the transplant of the index finger. For scars, an additional sum of $6,000 was awarded. 28        In this case, I considered that it was appropriate to award a global sum to take into account all the injuries to the head and their consequential effects, including the loss of memory, as there would otherwise be a danger of overlap.   Although I could have made a separate award for the fracture of the teeth, I felt that this sum would have been small in comparison, and therefore that it would not be wrong in principle to award a global sum covering the injury to the teeth.",
        "Loss of Scholarship": "29        The plaintiff had claimed the whole of the liquidated damages paid to the EDB when his scholarship had been terminated, and also for the additional school fees that would be required for him to complete his course.   The plaintiff had called Mr Timothy Sebastian of the EDB to explain why the plaintiff’s scholarship had been terminated.  Mr Sebastian’s evidence was essentially that the main reason for the termination of the scholarship was that the plaintiff had extended the scholarship to beyond 3 years, which was the time stipulated in the scholarship deed for the plaintiff to finish his course of study.  Further, had done did this without seeking the EDB’s permission. 30        I have stated that I took the view that the plaintiff had suffered some deterioration in his intellectual ability in relation to his memory, and also had to cope with emotional difficulties stemming from the accident.  From this, I found that on balance the loss of his scholarship could be attributed to the accident and I thus awarded him the amount equivalent to 4 years of study at University (including the amount of liquidated damages paid to the EDB).   The plaintiff had submitted that he should be entitled to his tuition fees and living allowance up to the Spring semester of 2006 (6 years in total), having to pass another 7 – 8 classes to graduate.  However, I felt that given that a normal student would be able to finish this 7 – 8 classes in one semester, two semesters should be sufficient for the plaintiff to complete them.  I should note that there was no independent evidence of how long it would take him to finish the course from anyone in the university.",
        "Loss of Earning Capacity and Loss of Future Earnings": "31        It is convenient for me to deal with these heads of damage together.  The plaintiff had submitted for $150,000 as loss of earning capacity.  For loss of future earnings, various figures were put forward by the solicitors for the plaintiffs.   In the first place, Mr Lim suggested a figure of S$10,874,520.00, based on a multiplier of 24 years and a multiplicand of $S453,105.00.  The multiplicand was derived from the assumption that the plaintiff would, if he had not been injured, gone on to reach a position equivalent to “Superscale Grade B” in the civil service.  In the alternative, Mr Lim argued that the plaintiff would at the very least have attained a position equivalent to “Superscale Grade G”, which should entitle him to S$3,660,390.00 based on a multiplier of 18 and a multiplicand of S$203,255.00. 32        The assumptions made by the plaintiff’s solicitors behind these figures were as follows.  First, that it was unlikely that the plaintiff would be able to secure a job even if he graduated from University due to reservations from potential employers about his intellectual abilities.  Even if, it was argued by Mr Lim, he could secure a job, it would be a menial technical job and not a professional job like an electrical engineer.  Finally, the plaintiff’s solicitors had taken as the multiplicand the average between the starting pay of an EDB officer and the pay the plaintiff would be expecting to earn when he attained “Superscale B” or “Superscale G”, whichever was appropriate. 33        I must say that I found Mr Lim’s submission of over S$10 million excessive and I had informed him on at least two occasions during the trial that a figure in that region was in my view wholly unrealistic.  The hope was that Mr Lim would proceed on a less speculative basis and provide the court with some reasonable assistance.  Otherwise, the court would be left with nothing but the defendant’s submissions on this issue and its own sense of fairness. 34        Mr Lim in his closing submissions did submit an alternative figure of some S$3 million (which I have referred to above); and further added that if the court were minded to assume that the plaintiff would be able to obtain a job as an Engineering Assistant after his graduation, then the appropriate figure should be some S$2,794,624 taking a multiplier of 16 years, and after deducting an estimated annual income of S$28,691.00 as a Senior Engineering Assistant. 35        In Chang Ah Lek & Ors v Lim Ah Koon[1999] 1 SLR 82, the Court of Appeal quoted with approval a passage from Scarman LJ`s judgment inSmith v Manchester Corporation (1974) 17 KIR 1, which is now recognised as the classic statement in this arena: Loss of future earnings or future earning capacity is usually compounded of two elements. The first is when a victim of an accident finds that he or she can, as a result of the accident, no longer earn his or her pre-accident rate of earnings. In such a case there is an existing reduction in earning capacity which can be calculated as an annual sum. It is then perfectly possible to form a view as to the working life of the plaintiff and, taking the usual contingencies into account, to apply to that annual sum of loss of earnings a figure which is considered to be the appropriate number of years’ purchase in order to reach a capital figure. The second element in this type of loss is the weakening of the plaintiff`s competitive position in the open labour market: that is to say, should the plaintiff lose her current employment, what are her chances of obtaining comparable employment in the open labour market? The evidence here is plain - that, in the event (which one hopes will never materialise) of her losing her employment with Manchester Corporation she, with a stiff shoulder and a disabled right arm, is going to have to compete in the domestic labour market with women who are physically fully able. This represents a serious weakening of her competitive position in the one market into which she can go to obtain employment. It is for that reason that it is quite wrong to describe this weakness as a `possible` loss of earning capacity: it is an existing loss: she is already weakened to that extent, though fortunately she is protected for the time being against suffering any financial damage because she does not, at present, have to go into the labour market. It is clearly inappropriate, when assessing this element of loss, to attempt to calculate any annual sum or to apply to any annual sum so many years` purchase. The court has to look at the weakness so to speak ‘in the round’, take a note of the various contingencies, and do its best to reach an assessment which will do justice to the plaintiff. 36        In the present case, the plaintiff’s written affidavit of evidence-in-chief and his answers to questions in court confirmed in my mind what his academic record suggested -- that he was a person of exceptional intelligence.  In cross-examination, he himself admitted that he was still a person of very high intelligence after his accident, it was just that he was “slower”.  I must say however, that this ‘slowness’ did not come through in the slightest while the plaintiff was giving evidence in court.  He appeared to me to be extremely articulate, expressive and adept at thinking quickly and sensibly on his feet.   Having said this, I obviously have not had the benefit of knowing the plaintiff prior to his accident; nor have I had the opportunity to see him produce written work (although to some extent I think the written affidavit speaks for itself). 37        Having read his affidavit and seen him in court, I was unable to agree with the underlying assumption behind the plaintiff’s claim for loss of future earnings – ie. that he would after graduating from Berkeley not be able to obtain a job, or at most, would be able to obtain only a “menial job” (in the plaintiff’s words).  It seemed to me that in view of his obvious intelligence and ability, he was in spite of the accident and its aftermath still likely to find gainful employment and in my view, was likely to be successful at whatever career he eventually chose.  In the circumstances, I was unable to adopt Mr Lim’s submissions as to loss of future earnings.  However, since I did find that there was some loss of memory function, I felt that in fairness the defendant had suffered some loss in terms of his future job prospects and I thus awarded him the sum of $100,000 as loss of earning capacity.  I might add that in any event, I found Mr Lim’s method of calculating the multiplicand somewhat simplistic.  I think if a proper assessment of loss earnings were to be done, it would be necessary to consider exactly how his income would increase over the years, as it clearly would not be on a straight-line basis.",
        "Future medical expenses and Special Damages relating to the Loss of Use of Motorcycle.": "38        In relation to future medical expenses, I should first note that Mr Lim did not lead any evidence; nor did he make any substantive submissions in this regard.  Admittedly, there was some reference in the medical reports of future treatment that might be needed, but Mr Rama was never given the opportunity to challenge this, nor was it his responsibility to raise the issue during the hearing.  Notwithstanding this, the plaintiff had complained of a persistent acne problem and he had also had extensive dental work done on his teeth which might require future medical care.  I thus felt that an award of $3,000 was fair and reasonable. 39        In relation to special damages, the only item appealed against is my award of $600 for loss of use of the plaintiff’s motorcycle.  The plaintiff had lost the use of his motorcycle as a result of the accident and had claimed $1,200 based on a rate of $40 for 30 days.  I felt that $20 per day was reasonable and thus awarded him 30 days’ usage based on this amount.",
        "Conclusion": "40        It is very unfortunate to say the least that an accident of these proportions occurred in the prime of the plaintiff’s life.  I commend him on the courage that he has shown so far facing up to his problems and by and large overcoming all of his injuries.  I can only hope that he is able to make the best of the situation he is now in and motivate himself to strive even harder than before to achieve his goals in life.  Having had the benefit of seeing and hearing him, there is no doubt in my mind that if he puts his heart and mind to it, he could be a shining success in any number of careers, and in so doing make a meaningful contribution to society as he seems so keen to do. 41        At one point in court I asked him whether it was his honest view that he had no future, to which his response was that his medical record would carry a stigma.  When pressed, he compared himself to his friends who were “very high flying” PSC scholars in the Administrative Service.  By the end of their 6-year bond, he said they would be “hitting the beginning of Superscale”, whereas he would only be able to get menial jobs – at that stage his self-pity, he added, would reach new depths. 42        Looking at the plaintiff’s case, I felt that it would be wrong to award him an excessive amount of money (and I considered any award in the region of millions of dollars excessive) for failing in a life which really had yet to begin.    The law only compensates you for what you can prove you have lost.  I felt that in all the circumstances, the total award of some $451,839 was an appropriate expression of his loss.   Any amount in the region which he claimed for would, I think, be incommensurate with his present situation, and further might curb his impetus to strive for success.  That, if it happened, would surely be the greatest loss of all."
    }
}