{
    "case_title": "Lee Cheong Ngan alias Lee Cheong Yuen v Public Prosecutor and Other Applications",
    "ncitation": "[2004] SGHC 91",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Background": "2Lee and Chiong are husband and wife, and joint owners of the premises at No 69 Toh Tuck Road (“the premises”). The property adjoining the rear of the premises is No 37 Toh Tuck Place. A brick retaining wall with an attached chain-link meshed fence lies near the boundary between the premises and No 37 Toh Tuck Place. 3Between January and March 2001, officers from the Building and Construction Authority (“BCA”) visited the premises to inspect the retaining wall and fence. As they found the fence in a state of disrepair, the BCA wrote to Lee and Chiong on 24 March 2001, directing them to repair the fence by 14 April 2001. 4On 6 July 2001, Phua Chee Sim (“Phua”), an officer attached to the Building Management Section of the BCA, carried out another inspection of the retaining wall and fence. As he was refused entry onto the premises, Phua had to examine the retaining wall and fence from No 37 Toh Tuck Place. He found a portion of the fence collapsed, with the remaining section in a state of dilapidation. 5Phua then obtained a survey plan from the Singapore Land Registry, which confirmed that the retaining wall and fence were within the boundaries of the premises. The BCA accordingly issued a notice to Lee and Chiong on 20 July 2001 (“the notice”), under s 4(1) of the Buildings and Common Property (Maintenance and Management) Act (Cap 30, 2000 Rev Ed) (“the Act”). Section 4(1) provides that: Where in the opinion of the Commissioner [of Buildings] any building or common property has not been kept or maintained in a state of good and serviceable repair or in a proper and clean condition, the Commissioner may, by notice in writing, require the owner within such period as may be specified in the notice to take such steps or carry out such repairs and maintenance as the Commissioner thinks fit. 6The notice was served by registered post as prescribed under s 20(1)(b) of the Act, and directed both Lee and Chiong to repair the damaged fence at the back of the premises by 19 August 2001. The notice also stated that a failure to comply would constitute an offence under s 4(3) pf the Act, which is punishable with a fine not exceeding $5,000 and a further fine not exceeding $25 for every day that the offence is continued after conviction. 7Lee Min Kwang (“Min Kwang”), a son of Lee and Chiong, subsequently wrote to the BCA on 15 August 2001, asking for more time to repair the fence. He explained that their neighbours at No 37 Toh Tuck Place had built a bird cage next to the fence, rendering it impossible to carry out the necessary rectification works. Crucially, he also acknowledged that a survey plan from the Singapore Land Registry showed that the retaining wall and fence were within the boundaries of the premises. 8On 29 December 2001, Phua conducted another inspection of the retaining wall and fence, again from No 37 Toh Tuck Place. He discovered that Lee and Chiong had still not carried out any rectification work. As a result, two summonses were issued against Lee and Chiong respectively on 27 February 2002. Both charges in them read as follows: You … are charged that you did fail to comply with the Notice … issued by the Commissioner of Buildings on 20 July 2001 under section 4(1) of the Buildings and Common Property (Maintenance and Management) Act, Chapter 30, requiring you to repair the damaged chain link fence at the rear of the premises at No. 69 Toh Tuck Road, Singapore by 19 August 2001 and you have thereby committed an offence punishable under section 4(3) of the said Act.",
        "The proceedings below": "9Lee and Chiong appeared before the magistrate on 8 October 2002, but the hearing was adjourned for the parties to produce an agreed statement of facts (“Agreed SOF”). On 9 October 2002, the magistrate was informed that Lee and Chiong intended to plead guilty. The magistrate then stood down the hearing to allow their counsel, Mr Tan Cheng Yew (“Tan”), to explain the Agreed SOF and charges to them. 10When the hearing resumed, the charge was read in Mandarin to Chiong, and in English to Lee. The interpreter informed the court that both were pleading guilty, and understood the nature and consequences of their pleas. The Agreed SOF was then read, and the interpreter notified the court that Lee and Chiong admitted to the facts contained therein. The magistrate accordingly convicted Lee and Chiong on the respective charges. 11In mitigation, Lee and Chiong submitted, through Mr Tan, that the damage to the fence was caused by their neighbours at No 37 Toh Tuck Place. Also, they were both in their seventies, and had been confused when they first received the BCA’s notice, as they did not know if the retaining wall and fence fell within their premises. 12After hearing the facts and taking into account every relevant mitigating factor, the magistrate sentenced Lee and Chiong to pay a fine of $900 each (in default nine days’ imprisonment). The fines were duly paid, yet Lee and Chiong still failed to carry out the required repairs. They were then charged on 17 October 2003 with a continuing offence under s 4(3) of the Act. On 15 March 2004, they filed these four applications to challenge their convictions on the earlier February 2002 charges. The later charges in October 2003 were not in issue before me.",
        "The applications": "13Lee and Chiong both filed petitions for criminal revision, asking the High Court to exercise its revisionary powers pursuant to s 268 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“CPC”) to set aside their convictions. They submitted that they had never intended to admit without qualification to the offences alleged against them, and had suffered serious injustice at the hearing before the magistrate. 14To substantiate their cases for revision, Lee and Chiong also applied for leave to introduce new evidence. In Criminal Motion No 7 of 2004, Lee sought to admit his own affidavit, as well as that of his other son, Lee Wei Kwang (“Wei Kwang”). In Criminal Motion No 8 of 2004, Chiong sought to admit her own affidavit to assist her case.",
        "The criminal motions": "15The revisionary powers of the High Court are governed by s 23 of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) and s 268(1) of the CPC. According to s 268(1) of the CPC, the High Court, in the exercise of its revisionary powers, may also take additional evidence in accordance with s 257(1) of the CPC, which provides that: In dealing with any appeal under this Chapter the High Court, if it thinks additional evidence isnecessary, may either take such evidence itself or direct it to be taken by a District Court or Magistrate’s Court. [emphasis added] 16In deciding if the evidence sought to be adduced is “necessary”, the three conditions set out inLadd v Marshall[1954] 1 WLR 1489must be fulfilled: (a)non-availability – it must be shown that the evidence could not have been obtained with reasonable diligence for use at trial; (b)relevance – the evidence must be such that, if given, it would probably have an important influence on the result of the case; and (c)reliability – it must be apparently credible, although it need not be incontrovertible. 17I adopted this framework inJuma’at bin Samad v PP[1993] 3 SLR 338, and have repeatedly affirmed its authority in cases such asChan Chun Yee v PP[1998] 3 SLR 638,Tan Sai Tiang v PP[2000] 1 SLR 439and most recently, inAnnis bin Abdullah v PP[2004] 2 SLR 93. 18In this case, the affidavits that the petitioners sought to adduce described their version of what transpired in the court below on 8 and 9 October 2002. It was apparent that, by the very nature of the evidence, the first condition was fulfilled, since this evidence obviously could not have been obtained at the proceedings below. The second condition was also clearly satisfied, as the evidence was highly relevant. Lee and Chiong based their cases for criminal revision on the main ground that their pleas of guilt below were invalid. In order to ascertain the legality of their pleas of guilt, and consequently, the soundness of their convictions, I had to consider evidence of the circumstances in which the pleas were taken. 19The only real issue here was the apparent credibility of the additional evidence. Although untested assertions of events would generally not be admitted at this stage, I noted that the affidavits of Lee, Chiong and Wei Kwang were broadly consistent in the most material particulars. Bearing in mind that the evidence must only be apparently credible, and need not be incontrovertible, I found that the final condition was satisfied, but only by the barest of margins. 20The deciding factor in this case was the high degree of relevance that this additional evidence had on Lee’s and Chiong’s petitions for criminal revision. They had to be allowed to put forward their version of events for me to ascertain the soundness of their convictions in the court below. Given the circumstances, the Deputy Public Prosecutor had no objection to the admission of the affidavits. 21Of course, the fact that I agreed to admit the affidavits did not mean that I accepted their entire contents as the truth. The veracity of the allegations still had to be tested against the rest of the evidence. As all three affidavits came from interested parties, I was especially chary of accepting their evidence at face value. With this in mind, I turned to consider the petitions for criminal revision.",
        "The criminal revisions": "22I laid down the principles governing the exercise of the High Court’s revisionary powers inAng Poh Chuan v PP[1996] 1 SLR 326at 330, [17]: [V]arious phrases may be used to identify the circumstances which would attract the exercise of the revisionary jurisdiction, but they all share the common denominator that there must be some serious injustice. Of course there cannot be a precise definition of what would constitute such serious injustice for that would in any event unduly circumscribe what must be a wide discretion vested in the court, the exercise of which would depend largely on the particular facts. But generally it must be shown that there is something palpably wrong in the decision that strikes at its basis as an exercise of judicial power by the court below. 23Bearing in mind the potential for abuse by accused persons who have pleaded guilty, the court will exercise its revisionary power sparingly, to ensure that it does not degenerate into a convenient form of “backdoor appeal”:Teo Hee Heng v PP[2000] 3 SLR 168at [7]. Not only must there have been some error, illegality, impropriety or irregularity, it must also have resulted in grave and serious injustice:Ma Teresa Bebango Bedico v PP[2002] 1 SLR 192at [8], followed inLee Eng Hock v PP[2002] 1 SLR 364.",
        "The petitioners’ case": "24Lee and Chiong raised several issues to substantiate their case for criminal revision. First, various complaints were made against Mr Tan’s conduct of their case. They further alleged that the interpreter did not adequately translate the charges or the Agreed SOF, and failed to convey their reservations to the court. The magistrate’s notes of evidence (“NOE”) were also ambiguous, and did not clearly record that they had both entered an unequivocal plea of guilt. It was submitted that all the circumstances, taken together, established that they had suffered serious injustice, and their convictions ought to be set aside.",
        "The pleas of guilt": "25The greater part of the petitioners’ arguments disputed the validity of their pleas of guilt below. The circumstances under which the High Court would exercise its revisionary powers in such cases are firmly settled. Section 180(b) of the CPC states that if the accused understands the nature and consequences of his plea and intends to admit without qualification the offence alleged against him, he may plead guilty to the charge and the court may convict him on it. InGanesun s/o Kannan v PP[1996] 3 SLR 560, I adopted the three common law safeguards for a valid plea of guilt as laid down inLee Weng Tuck v PP[1989] 2 MLJ 143: (a)an accused should plead guilty by his own mouth and not through his counsel; (b)the onus lies on the judge to ascertain whether the accused understands the true nature and consequences of his plea; and (c)the court must establish that the accused intends to admit without qualification the offence alleged against him. 26I turned to consider each of the petitioners’ contentions in light of these principles.",
        "Allegations against defence counsel": "27Lee and Chiong made many serious allegations against Mr Tan. According to them, he consented to the Agreed SOF without their authority, acted against their instructions, did nothing to express their views to the court, and also omitted to advise them of the availability of the defence of reasonable care. 28In many petitions for criminal revision, the accused often challenges defence counsel’s conduct of the case. Yet many of these allegations are often unfounded, and are raised by the accused only in a desperate attempt to escape the rigours of the law. InLee Eng Hock, ([23]supra), the petitioner pleaded guilty, but later sought criminal revision on the ground that he had misunderstood his counsel’s advice. While he was convinced of his own innocence throughout, he thought that his counsel had advised him that a plea of guilt would not occasion a custodial sentence. In dismissing the petition, I made the following observations at [10] of my judgment: If the conduct of defence counsel could be so easily challenged, the chilling effect on the criminal Bar would be immense. While there may in some cases be a thin line between dispensing credible legal advice and pressurising one’s client to plead guilty, it is undesirable to allow defence counsel to be made convenient scapegoats, on the backs of whom “backdoor appeals” are carried through. 29These sentiments applied with equal force here. Given that Mr Tan has unfortunately disappeared from the country, I was forced to evaluate the reliability of the petitioners’ account of events without his assistance. After carefully considering the evidence, I found that the petitioners’ claims simply could not be accepted. 30If Mr Tan was in fact guilty of the petitioners’ allegations, they had every opportunity to voice their objections in court. They may have been slightly overwhelmed by the proceedings, as they were advanced in years and it was their first time in court. Nonetheless, their sons Min Kwang and Wei Kwang had been keenly involved in the case from the beginning. They were present in court, and fully capable of protesting on their parents’ behalf. 31Lee, Chiong and Wei Kwang alleged in their affidavits that they had openly disagreed with Mr Tan at the hearing, and the magistrate had stood down the proceedings twice for the parties to resolve their differences. Yet there is no record of any of this in the magistrate’s NOE, which only reflect that the magistrate had stood down for the charges and the Agreed SOF to be explained to Lee and Chiong. The magistrate must have been aware of his duty to ensure that both Lee and Chiong did intend to plead guilty to the charges against them. If there was indeed such an obvious dispute between the petitioners and Tan, I had no doubt that the magistrate would not have accepted their pleas of guilt.",
        "Allegations against interpreter": "32Lee and Chiong also claimed that the interpreter did not translate the charges of the Agreed SOF in full, but instead said, in Mandarin, words to the effect of “you know what you are here for” and “trust your lawyer”. Again, I found their assertions to be completely groundless. 33The role that interpreters play in cases involving pleas of guilt is especially vital, since they assist the court in ensuring that the accused understands the nature and consequences of his plea, and intends to admit without qualification to the offence alleged against him. Given the importance of their work to the validity of guilty pleas, it is perhaps inevitable that in such cases for criminal revision, allegations against interpreters are almost commonplace. 34However, it would be detrimental to the administration of justice if the conduct of interpreters could be so easily impeached. Accused persons should take note that such arguments will be summarily rejected, unless they can establish a sufficient basis for their allegations, and it is demonstrated that the interpreter’s conduct undermined any of the three procedural safeguards outlined above. 35In this case, Lee and Chiong could not offer any reasons to explain why the interpreter, an officer of the court, would neglect to translate such material evidence, and demonstrate such a flagrant disregard for his duties. Their contentions were clearly unwarranted, and their case was further undermined by the considerable lapse of time between the hearing and their petitions. For some 17 months, Lee and Chiong made no complaints against the interpreter, and took no active steps to dispute their convictions. It would be unreasonable to expect the interpreter to be able to recall details of the proceedings now, so as to rebut their allegations. 36In any case, I had no doubt that both Lee and Chiong were aware of the particulars of the charge, and understood the nature and consequences of their pleas. The notice of 20 July 2001 clearly informed them that a failure to comply would amount to an offence under s 4(3) of the Act. They had received the summons on 27 February 2002, and engaged counsel shortly thereafter. They were represented in the court below, and their sons Min Kwang and Wei Kwang were also actively concerned with the case throughout. The nature and consequences of the charges must have been impressed upon them.",
        "The Agreed SOF": "37Lee and Chiong also argued that the Agreed SOF contained errors on the face of it, which raised serious issues as to its accuracy. It is trite law that the court has a legal duty to record a statement of facts following an accused’s plea of guilt, and to scrutinise the statement to ensure that all the elements of the charge are made out. The accused need not admit to every fact alleged in the statement of facts, so long as what he does admit contains all the essential ingredients of the offence he is charged with:Mok Swee Kok v PP[1994] 3 SLR 140. 38Here, Lee and Chiong claimed that the Agreed SOF contained evidence of a material element of the offence that was contradictory. Paragraph 3 of the Agreed SOF states that: Based on a detailed survey plan issued by the Chief Surveyor of the Singapore Land Registry, the chain link meshed fencing and brick retaining wall between No 69 Toh Tuck Road and No 37 Toh Tuck Place was shown entirely within the accused persons’ property,ieNo 69 Toh Tuck Road. 39However, Lee and Chiong maintained that a private survey conducted by Ho Huai Hoon Surveyors found that the fence was not within their premises. As s 4(1) of the Act confers a power on the Commissioner of Buildings to issue notices only to owners of the relevant property, if the fence was not within the premises, the BCA’s notice under s 4(1), and Lee’s and Chiong’s convictions under s 4(3), must be set aside. 40Their arguments on this point were flawed for many reasons. In so far as they disputed the definitive statement in the Agreed SOF that the fence was within the premises, they had to prove that Mr Tan consented to the particulars in the Agreed SOF without their authority. As they had not proved their allegations against Mr Tan to my satisfaction, I found that this particular fact must be taken to have been properly admitted. 41In any case, the petitioners’ son Min Kwang had confirmed their ownership of the retaining wall and fence in his letter to the BCA on 15 August 2001. Their other son Wei Kwang had also admitted in his affidavit that the ownership issue had been “conclusively settled” by the Singapore Land Authority in February 2003. Having effectively conceded this point, Lee and Chiong could not hope to resurrect the issue now. 42Even if I was prepared to reopen the question, Lee and Chiong had failed to adduce any evidence of the alleged private survey showing that the fence was not within their premises. A report from the surveyors they commissioned would have provided a strong measure of support for their claims. Tellingly, no such report was ever produced. It was impossible for me to accept their contentions, especially when the BCA had produced two survey plans from the Singapore Land Registry that directly contradicted their contention.",
        "The notes of evidence": "43Lee and Chiong also objected to the contents of the magistrate’s NOE, which they claimed were bare and ambiguous, and failed to reflect the “nuances” of what actually happened. 44Given the many exigencies that judges face, it is to be expected that the NOE will generally record only the most pertinent aspects of the evidence, often in point form. Here, the NOE did in substance record the most relevant events of the hearing. It was clear, from a perusal of its contents, that both Lee and Chiong had pleaded guilty, indicated that they understood the nature and consequences of their plea, and admitted to the Agreed SOF. 45Lee and Chiong made much of several minor omissions in the NOE. For instance, they pointed out that the magistrate did not make any distinction between Lee and Chiong. However, since Lee’s and Chiong’s cases were being heard together and they were obviously conducting their cases on the same footing, the magistrate had understandably found it unnecessary to refer to them individually. A broad, objective view must be taken of the entire NOE. It would be sufficient so long as the most relevant elements of the hearing are recorded. To insist on the level of detail that Lee and Chiong argued for would simply open the door to greater delays in court proceedings.",
        "Delay": "46Even if I accepted Lee’s and Chiong’s contentions, any injustice they may have suffered was seriously attenuated by their delay in presenting the petitions. While delay would generally be immaterial in a case of injustice, it may indicate, in some circumstances that there was in fact no injustice caused:Ang Poh Chuan, ([22]supra), followed inLim Hean Nerng v Lim Ee Choo[1998] 2 SLR 585. In this case, Lee and Chiong could not offer any credible explanation for the lateness of their applications. Although it was unfortunate that Lee had suffered from poor health since his conviction, this did not adequately explain the delay of more than 17 months. Chiong was still in a position to present their case, and their sons Min Kwang and Wei Kwang could also have instructed counsel to file the petitions. 47In fact, I found it reasonable to infer from the circumstances that these petitions were filed only as a response to the subsequent 17 October 2003 charges against Lee and Chiong, for a continuing offence under s 4(3) of the Act. They probably began to consider petitioning for criminal revision only after they received the second summons, and were faced with the prospect of a much heftier fine. All of this further undermined their case that they suffered substantial injustice in the court below. Their behaviour was certainly not consistent with that of anyone carrying the burden of injustice on their backs.",
        "Strict liability and the defence of reasonable care": "48Section 4(3) of the Act provides that “any person who fails to comply with the requirements of any notice issued by the Commissioner under subsection (1) shall be guilty of an offence”. The material elements of the offence are: (a) a valid notice issued by the Commissioner to the owner; and (b) failure to comply. 49As there is no expressmens rearequirement, Lee and Chiong conceded that the provision created a strict liability offence. However, they argued that the defence of due diligence or reasonable care should have been available to them, following the principles inM VBalakrishnan v PP[1998] SGHC 416;[1998] 1 CLAS 357andTan Cheng Kwee v PP[2002] 3 SLR 390. As Mr Tan failed to inform them of this, they allegedly suffered a serious injustice that must be set right.",
        "Strict liability": "50InComfort Management Pte Ltd v PP[2003] 2 SLR 67, I adopted the approach established inSweet v Parsley[1970] AC 132andGammon (Hong Kong) Ltd v Attorney-General of Hong Kong[1985] AC 1, to decide if the relevant offence was one of strict liability. The following opinion expressed by Lord Scarman inGammon (Hong Kong) Ltd(at 14) provides a concise set of guidelines: (1) there is a presumption of law thatmens reais required before a person can be held guilty of a criminal offence; (2) the presumption is particularly strong where the offence is “truly criminal” in character; (3) the presumption applies to statutory offences, and can be displaced only if this is clearly or by necessary implication the effect of the statute; (4) the only situation in which the presumption can be displaced is where the statute is concerned with an issue of social concern, and public safety is such an issue; (5) even when a statute is concerned with such an issue, the presumption ofmens reastands unless it can be shown that the creation of strict liability will be effective to promote the objects of the statute … 51However, it was not necessary for me to decide if s 4(3) of the Act did indeed create a strict liability offence, as Lee and Chiong clearly possessed the requisitemens reain any case. As I noted earlier, the only material elements of the offence were: (a) a valid notice issued by the Commissioner to the owner; and (b) failure to comply. It was not disputed that Lee and Chiong had received a valid notice, and as owners of the retaining wall and fence, were obliged to comply. Once they received the notice, they knew what was required of them, yet they deliberately chose not to carry out the necessary repairs. They were both clearly guilty of an offence under s 4(3).",
        "Defence of reasonable care": "52Even if I accepted that the defence of reasonable care was available to Lee and Chiong, their conduct fell far short of what was required. After receiving the BCA’s notice, they took no steps to carry out the rectification works. They claimed that the fence was not within their property, yet they did not submit any evidence of the alleged private survey they commissioned to support their contention. Moreover, their son Min Kwang had already acknowledged that the fence fell within the premises as early as 15 August 2001. 53Lee and Chiong also asserted that their neighbours at No 37 Toh Tuck Place were responsible for the damage to the fence. However, as they failed to produce any credible evidence to substantiate their allegations, I had no choice but to reject their claims.",
        "Conclusion": "54For the reasons above, I allowed the criminal motions to adduce new evidence, but dismissed the petitions for criminal revision. Criminal motions allowed. Petitions for criminal revision dismissed."
    }
}