{
    "case_title": "Sintal Enterprise Pte Ltd v Multiplex Constructions Pty Ltd",
    "ncitation": "[2004] SGHC 223",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "1          Sintal Enterprise Pte Ltd (the plaintiff) is a Singapore company that supplies and installs stonework (including marble, granite and tiles) for the construction industry. Multiplex Constructions Pty Ltd (the defendant) is an Australian company with a Singapore branch. As its name suggests, the company is in the general building and construction business as well as in the business of providing general building engineering services. 2          On 22 April 2004, the defendant applied by way of Summons in Chambers No 2217 of 2004 (“the application”) for an order that all further proceedings in this action be stayed pursuant to s 6 of the Arbitration Act (Cap 10, 2002 Rev Ed) (“the Act”), the plaintiff and the defendant, having by agreements in writing dated 26 November 2002 and 27 January 2003, agreed to refer to arbitration the matters in respect of which the plaintiff’s claim in this action is brought. 3          The assistant registrar heard the application on 3 June 2004 and ordered all further proceedings in this action be stayed, save for disputes relating to Interim Certificates Nos 27, 28, 29 and 30 (“the Interim Certificates”). The defendant was dissatisfied that the assistant registrar did not order a stay of proceedings for the plaintiff’s claim under the Interim Certificates and filed Registrar’s Appeal No 162 of 2004 (“the Appeal”) against that part of her decision. 4          The Appeal came up for hearing before me on 29 June 2004. I dismissed the Appeal with costs and the defendant has filed a Notice of Appeal against my decision (in Civil Appeal No 61 of 2004). I now give my reasons.",
        "The facts": "5          According to the Statement of Claim, the defendant was the main contractor for the construction of a housing development comprising of 360 units in four blocks at Haig Road known as Haig Court Condominium (“the Project”) which was developed by Great Eastern Life Insurance Ltd (“the Employer”). 6          The defendant’s contract with the Employer was dated 3 January 2001 (“the main contract”) under which the completion date for the project was 29 July 2002. By a supplemental agreement dated 13 February 2003 (“the first supplemental agreement”) made between the Employer and the defendant, the completion date was extended to 23 August 2003. By a second supplemental agreement dated 30 June 2003 (“the second supplemental agreement”) made between the parties, the Employer agreed to further extend the completion date of the project to 8 October 2003. The project was eventually completed on or about 16 January 2004 and the Temporary Occupation Permit to purchasers was issued by the relevant authorities on 11 February 2004. 7          The plaintiff was the nominated sub-contractor of the Employer by way of a letter of award dated 4 April 2001 from the project’s architects (Architects 61 Pte Ltd) for the supply of stone finishes for the project. Pursuant thereto, the defendant accepted the plaintiff as a nominated supplier by its letter dated 23 April 2001 (“the Letter of Acceptance”) as well as the plaintiff’s tender price of $2,853,765.60 for the supply of stonework. The Letter of Acceptance concluded with this paragraph: Unless and until a formal agreement is prepared and executed, your quotation together with this letter of acceptance and the Sub-Contract Documents listed herein shall constitute a legal and binding contract between us. 8          Much later, on 27 January 2003, the plaintiff did enter into a contract with the defendant for the supply of stonework for the Project (“the supply contract”) at a sum of $2,853,765.60. By an earlier contract dated 26 November 2002, the plaintiff was appointed the defendant’s domestic sub-contractor for the supply of labour and materials (“the installation contract”) for the installation of 60% of the stonework for the project, at a sum of $937,767.54. 9          The dates of commencement and completion under the supply contract were 16 January 2001 and 29 July 2002 respectively. The supply contract incorporated the Singapore Institute of Architects Conditions of Sub-contract (2ndEd, August 1999) (“the SIA sub-contract conditions”) for use in conjunction with the main contract of the defendant. 10        On 26 March 2004, the plaintiff commenced this action. In the Statement of Claim, the plaintiff claimed the following sums: (a)        stonework supplied by the plaintiff,valued/certified under the InterimCertificates and paid by the Employer            $485,268.55 (b)        other stonework supplied under thesupply contract                                              $1,361,138.05 (c)         variations under the supply contract    $1,119,306.84 (d)        installation works (including variations)under the installation contract$425,947.92 total:$3,391,661.36 11        In addition, the plaintiff claimed damages (to be assessed) for delay. The plaintiff alleged the defendant was in breach of the supply contract as it delayed the plaintiff’s completion from 29 July 2002 to 26 February 2003. 12        Yet another claim by the plaintiff related to the performance bond it had furnished to the defendant in the sum of $142,688.28 (“the guaranteed sum”). It alleged that the defendant, on or about 20 February 2004, made an unlawful demand for the guaranteed sum, which sum the defendant received on or about 24 February 2004. The plaintiff claimed a refund of the guaranteed sum. 13        As stated earlier at [3], the defendant was not satisfied with its partial success on the application. It wanted the plaintiff’s claims under the Interim Certificates also to be stayed and to proceed to arbitration together with the other claims in the Statement of Claim. In relation specifically to the sum of $485,268.55 (“the certified sum”) due under the Interim Certificates, the defendant (in the second affidavit filed by its general manager, S Premanand) had raised a defence of set-off, allegedly for the plaintiff’s delay in supplying the stone materials.",
        "The submissions": "",
        "The plaintiff’s arguments": "14        In the court below, counsel for the plaintiff submitted that the defendant’s right of set-off (if any) for the Interim Certificates was governed by cll 11.4 and 11.5 of the SIA sub-contract conditions which state: 11.4      The Contractor may set off against monies due to the Sub-Contractor under the Sub-Contract, such loss or damage suffered or incurred by him as a result of the failure of the Sub-Contractor to carry out the Sub-Contract Works with diligence or due expedition or to complete the Sub-Contract Works by the date or dates specified in Schedule III hereto or the date or dates as extended until such date as may be certified by the Contractor in his Sub-Contract Completion Certificate. 11.5      Without prejudice to the Sub-Contractor’s rights under general law to dispute any set off by the Contractor, it shall be a condition precedent for such set off by the Contractor that: (i)         the set-off has been quantified in detail with particulars and with reasonable accuracy (ii)        the Contractor has given to the Sub-Contractor written notice specifying his intention to set-off the amount so quantified together with the required details under clause 11.5(i) of this Sub-Contract and the grounds on which such set-off is made and (iii)       such notice shall be given to the Sub-Contractor not less than 7 days before the date of issuance of the interim certificate for payment which includes in the amount stated as payable, the amount due to the Sub-Contractor from which the Contractor intends to make the set-off. 15        Pursuant to cll 11.4 and 11.5(ii) above, the defendant issued four notices to the plaintiff dated 17 April, 19 May, 4 June and 18 July 2003 (“the Notices”) indicating its intention to set off “site overheads” and “running costs” from the sums certified to be payable to the plaintiff. 16        The Notices are to be found in exhibit SP-7 in the first affidavit of S Premanand filed on 22 April 2004. Interim certificates Nos 27, 28, 29 and 30 were dated 29 April, 3 June, 9 July and 11 August 2003 respectively and are to be found in exhibit CJBF-2 of the second affidavit of the plaintiff’s managing director Chua Joo Boon Fabian, filed on 4 May 2004. 17        The plaintiff submitted that the defendant’s claim for “site overheads” and “running costs” was a claim for general damages. However, under cl 10.00 of the Letter of Acceptance which formed part of the contractual documents, it had been agreed that liquidated damages would be payable by the plaintiff for delay. That clause states: Contract period and liquidated damages The commencement date shall be 16thJanuary 2001 and the completion of the Sub-Contract Works shall be as follows: 1.         Blk 1                –          12thSept 2001 till 26thJan 20022.         Blk 2                –          22ndSept 2001 till 6thFeb 20023.         Blk 3                –          22ndSept 2001 till 22ndFeb 20024.         Blk 4                –          22ndSept 2001 till 22ndFeb 20025.         Mock up           –          by 15thJune 2001 Liquidated and ascertained damages of S$30,000.00 per calendar day will be imposed for late completion of the Sub-Contract Works. The plaintiff argued that the defendant could not claim general damages for delay, it being settled law that where liquidated damages are provided for delay, it is an exhaustive remedy (seeTemloc Ltd v Errill Properties Ltd(1987) 39 BLR 30 andLightweight Concrete Pte Ltd v JDC Corp[1998] SGHC 178). 18        Another criticism levelled by the plaintiff against the Notices was that they lacked the requisite accuracy under cl 11.5. First, the Notices stated that the completion date was 22 February 2002 when it should have been 29 July 2002 (as stated in para 19 of S Premanand’s first affidavit). 19        Second, the defendant had blamed at least one other sub-contractor in the project for the period of delay which overlapped with the periods (154 and 196 days) attributed to the plaintiff. This can be seen from Suit No 42 of 2004. There, Lee Khim Chin Construction Pte Ltd (“Lee Khim”) sued the defendant for the price of labour and materials for “wet trade” works for the project. The defendant’s defence was that Lee Khim had breached the express/implied terms of the sub-contract and was late in completion. In para 16 of the Amended Defence, the defendant had pleaded: … The delay caused by [Lee Khim] had effectively and consequentially caused delay to the other works to the project. It followed that the works under the main contract were significantly delayed and the [defendant was] only able to complete the project on 16 January 2004. The significant delay caused by [Lee Khim] had caused the Project Owners to impose liquidated damages on the [defendant]. … The defendant had counterclaimed,inter alia, for liquidated damages of $2m paid to the Employer for the delay caused by Lee Khim. Yet, the Notices were premised on the plaintiff being entirely responsible for the delay in completion. 20        Counsel submitted that even if the plaintiff was responsible forsomeof the delay (which it denied), it was not responsible for all of it. This was admitted by the defendant in the preambles to the first and second supplemental agreements, where it acknowledged that it was in default (under the first supplemental agreement) and could not meet milestones A and B by 24 June 2003 (under the second supplemental agreement). 21        The law on delay is equally clear – where more than one party causes the delay, there must be a proper apportionment of the damages arising from the delay. Otherwise, the purported claim or set-off will fail (seeL & M Airconditioning & Refrigeration (Pte) Ltd v SA Shee & Co (Pte) Ltd[1993] 3 SLR 482andLam Hong Leong Aluminium Pte Ltd v Lian Teck Huat Construction Pte Ltd[2003] SGHC 53). 22        The plaintiff’s final objection to the Notices centred on the defendant’s attempts therein to set off future losses. In the first three Notices dated 17 April, 19 May and 4 June 2003, the defendant claimed a set-off for delay from “2 December 2002 against the forecast actual completion of the works of 4thMay 2003” and beyond. In the final Notice dated 18 July 2003, the claim was from 18 December 2003 (which must have been a mistake and should have been 18 December 2002) to 1 July 2003. The defendant’s purported claims should be contrasted with the wording of cl 11.4 of the SIA sub-contract conditions which confines the right of set-off to “loss or damage suffered or incurred”.",
        "The defendant’s arguments": "23        Counsel for the defendant submitted that, on a true construction of the contract, liquidated damages for delay would be an exhaustive remedy only if the parties had so agreed. She contended that this case was on all fours with, and the court should therefore follow the decision in,JDC Corporation v Lightweight Concrete Pte Ltd[1999] 1 SLR 615(“JDC Corporation”). She pointed to other provisions in the supply contract which referred to general damages. One such provision was to be found in the General Conditions and Preliminaries at p B1/11 (Item I); it states: Damages for Non-Delivery If the Supplier fails to commence, carry out or complete delivery of the materials or goods in accordance with Clause 11 of the Conditions of Sub-Contract, … then the Supplier shall indemnify the Contractor against any loss or damage suffered or incurred including liquidated damages which may be imposed by the Employer on the Contractor under the Main Contract. 24        Counsel argued that as inJDC Corporation, it was not that clear that the terms of the supply contract provided that liquidated damages would be the sole remedy for delay. To make that determination required a closer examination of the various provisions of the supply contract, the SIA sub-contract conditions as well as the General Conditions and Preliminaries amongst other documents, which might also necessitate the calling of witnesses to ascertain the parties’ true intentions. 25        On the issue of delay, the defendant did not specifically address the plaintiff’s submission. Instead, counsel skirted the issue by arguing that it was an indisputable fact that the plaintiff was in delay. Consequently, that was sufficient to give rise to the defendant’s exercise of its right of set-off under cl 11.4 of the SIA sub-contract conditions. She contended that issues relating to causation and effects of delay were matters which should be determined by the arbitral tribunal (seeKwan Im Tong Chinese Temple v Fong Choon Hung Construction Pte Ltd[1998] 2 SLR 137).  Counsel added that the plaintiff had not given any particulars of the alleged delay on the part of the defendant. 26        As for the alleged defects in the Notices, counsel argued that the plaintiff’s objections were without substance as cl 11.5(i) only required the defendant to quantify the set-off in detail with particulars and with reasonable accuracy, and the quantification need not be exact or specific. Neither was it necessary for the defendant to provide proof of the plaintiff’s delay and its impact on the completion of the project. She asserted that the plaintiff’s real objection was to the merits of the defendant’s claim for delay and the extent to which the plaintiff was liable or responsible for the delay. This however was a matter which should be determined in arbitration, not by the courts. 27        In any case, the plaintiff had never taken any objections to the Notices during the course of the project. As such, the defendant’s counsel submitted that the plaintiff had waived any defect in the Notices and was not entitled to raise it at the Appeal (seeChina Construction (South Pacific) Development Co Pte Ltd v Leisure Park (Singapore) Pte Ltd[2000] 1 SLR 622;Steel Industries Pte Ltd v Deenn Engineering Pte Ltd[2003] 3 SLR 377). In the plaintiff’s affidavits, the only complaint (which was untrue) was that the defendant had made a general statement of the loss and damage it allegedly suffered, not that the plaintiff objected to the validity of the Notices. The plaintiff’s current objection was said to be an afterthought. 28        Consequently, the defendant submitted, disputes relating to the plaintiff’s claim under the Interim Certificates and the defendant’s set-off against the certified sum were matters for arbitration and hence, a stay should be granted on all the plaintiff’s claims.",
        "The decision": "29        I did not accept the defendant’s arguments. I start by referring to the arbitration clause in the SIA sub-contract conditions, which was incorporated into the supply contract: Arbitration 15.1      Any dispute between the parties hereto as to any matter arising under or out of or in connection with this Sub-Contract or under or out of or in connection with Sub-Contract Works or as to any certificate decision direction or instruction of the Contractor, shall be referred to the arbitration and final decision of a person to be agreed by the parties or, failing such agreement within 28 days of either party giving written notice requiring arbitration to the other, a person to be appointed … by or on behalf of the President or Vice-President for the time being of the Singapore Institute of Architects … 30        The application was based on s 6 of the Act which states: (1)        Where any party to an arbitration agreement institutes any proceedings in any court against any party to the agreement in respect of any matter which is the subject of the agreement, any party to the agreement may, at any time after appearance and before delivering any pleading or taking any other step in the proceedings, apply to that court to stay the proceedings so far as the proceedings relate to that matter. (2)        The court to which an application has been made in accordance with subsection (1) may, if the court is satisfied that — (a)        there is no sufficient reason why the matter should not be referred in accordance with the arbitration agreement; and (b)        the applicant was, at the time when the proceedings were commenced, and still remains, ready and willing to do all things necessary to the proper conduct of the arbitration, make an order, upon such terms as the court thinks fit, staying the proceedings so far as the proceedings relate to that matter. 31        Section 6 of the Act replaced a similar provision in s 7 of the Arbitration Act (Cap 10, 1985 Rev Ed) (“the previous Act”), on which local case law has set out the principles applicable. I can do no better than to refer to the cases cited by the defendant starting with the Court of Appeal decision inSA Shee & Co (Pte) Ltd v Kaki Bukit Industrial Park Pte Ltd[2000] 2 SLR 12where it was held,inter alia, that the answer to the question whether a dispute fell within an arbitration clause in a contract must depend on first, what the dispute was, and secondly, what disputes the arbitration clause covered. 32        In an earlier case,Kwan Im Tong Chinese Temple v Fong Choon Hung Construction Pte Ltd([25]supra), the Court of Appeal held that the court should adopt a holistic and common-sense approach to see if there was a dispute for purposes of an arbitration clause. It also held that it was not wrong to apply principles used in summary judgment proceedings in an application for stay under s 7 of the previous Act but it should not be an exhaustive means of weighing the claims. 33        As counsel for the defendant relied heavily onJDC Corporation([23]supra), I turn now to that case. There, the Court of Appeal reversed my earlier decision inLightweight Concrete Pte Ltd v JDC Corp([17]supra) where I held that there was no genuine dispute between the parties which should be referred to arbitration. The appellants, who were the main contractors, had sought to set off their claim for delay (acceleration cost and additional preliminaries) against moneys due to the respondent sub-contractors under two interim certificates of payment. After the respondents commenced proceedings to recover the sums due under the two interim certificates, the appellants applied to court to stay the proceedings under s 7 of the previous Act; I refused to grant a stay. 34        In allowing the main contractors’ appeal, the Court of Appeal was of the view that cl 5.1 of the specifications for the sub-contract, which spelt out that the respondents would be liable for ascertained and liquidated damages (at $2,000 per day) was at variance with cl 19 of the conditions of the sub-contract, which proviso stated that the respondents were liable to the appellants for “any damage or loss suffered or incurred … caused by or due to” the respondents’ failure to complete the sub-contract works within the agreed period or periods. 35        At [15] of the judgment, L P Thean JA had this to say: There appeared to be some tension between cl 5.1 of the specifications and cl 19 of the conditions. Without seeking to delve too deeply into these provisions, it seemed to us that they raised the issue of whether the liquidated damages of $2,000 per day were the sole remedy for the delay under the sub-contract. It should be noted that the meaning and effect of any clause for payment of liquidated damages depends on its express terms and turns on the true construction of the clause. Therefore, whether liquidated damages of $2,000 per day were an exhaustive remedy for the appellants in the event of a delay by the respondents would depend on the true construction of the terms of the sub-contract, in particular cl 5.1 of the specifications and cl 19 of the conditions. In this connection, we bore in mind cl 30 of the conditions which explicitly provided that any dispute as to, inter alia, the ‘construction of the terms of the sub-contract, or as to any matter or thing arising thereunder’ was to be referred to arbitration. Accordingly, the appropriate forum for the resolution of this issue was an arbitral tribunal. 36        The appellate court had cited a passage from Saville J’s decision inHayter v Nelson[1990] 2 Lloyd’s Rep 265 to uphold the sanctity of the arbitration clause inJDC Corporation, notwithstanding the respondents’ argument that delay in referring the matter to arbitration would cause them considerable hardship in an industry where cash flow is vital. My reference to that case is in a different context. As stated in the headnote of the report, Saville J had held that: [T]he words “disputes” and “differences” in the arbitration clause should be given their ordinary meaning; neither the word “disputes” nor the word “differences” was confined to cases where it could not then and there be determined whether one party or the other was in the right; … 37        He added (at 268): The proposition must be that if a claim is indisputable then it cannot form the subject of a “dispute” or “difference” within the meaning of an arbitration clause. If this is so, then it must follow that a claimant cannot refer an indisputable claim to arbitration under such a clause; and that an arbitrator purporting to make an award in favour of a claimant advancing an indisputable claim would have no jurisdiction to do so. 38        I did not accept counsel’s argument thatJDC Corporationwas on all fours with our case; there are significant differences. It bears mentioning that the defendant had succeeded in obtaining a stay of the plaintiff’s other claims (see [10] above) which included damages for breach of contract, variations and additional stone materials supplied under the supply contract. Undoubtedly, there were “disputes” (according to Saville J’s definition) in relation to those claims which should be dealt with by an arbitral tribunal. However, the same cannot be said of the plaintiff’s claim for the certified sum under the Interim Certificates. 39        First, the defendant did not dispute the certification for the Interim Certificates. Indeed, by its attempts in the Notices to set off the certified sum against its losses due to delay, the defendant implicitly accepted the correctness of the Interim Certificates. Consequently, there was no “dispute”’vis-á-visthe certification which came within the ambit of the arbitration clause (see [29] above) in the supply contract. 40        Secondly, assuming the “dispute” actually pertained to the defendant’s set-off of its losses against the certified sum, then cll 11.4 and 11.5 of the SIA sub-contract conditions (see [14] above) came into play. To be able to exercise that right of set-off, the defendant was obliged to comply with the condition precedent set out in sub-cll 11.5(i), (ii) and (iii). It was the plaintiff’s contention that the defendant had failed to do so. 41        The Notices were issued on behalf of the defendant’s regional director by two signatories whose native tongue is English. They could be expected to be, or should be, precise in their language. Clause 11.5 required detailed and reasonably accurate quantification of the amount to be set off. Then, the defendant had to give the plaintiff seven days’ prior notice,beforethe issuance of interim certificates, of its intention to deduct its quantified claim from a sum stated to be due to the plaintiff. 42        I compared the requirements of cl 11.5 with what the defendant actually did. The Notices contained the exact same concluding paragraphs save that the total sum stated in the fourth notice was $2,121,787.48 and not $1,667,118.73, as stated in the three earlier Notices. Those paragraphs read: Appendix H indicates Multiplex’s site overheads and running costs, these amounting to $10,825.45 per day and total $1,667,118.73 for your 154day [sic] delay. No account has presently been taken of any other costs incurred by Multiplex as a result of your delay. In accordance with Clause 11.4 of the Conditions of Sub-Contract, the sum of $1,667,118.73 shall therefore be deducted from amounts due to Sintal within the forthcoming Architect’s Payment Certificate. If the amount or amounts stated as payable to you and included in the forthcoming Architect’s Interim Payment certificate is or are not enough to satisfy in full the said sum of $1,667,118.73 (or any other sum for which we are entitled to recover from Sintal), we reserve the right to recover whatever that remains due to us from such further Architect’s Interim Payment Certificate that may be issued in accordance with the terms of the Sub-Contract. Nothing herein shall be construed to prejudice or as a waiver of any claim that we may have for liquidated and ascertained damages of $30,000 per calendar day as provided for in clause 10.00 of the Letter of Acceptance. All our rights are reserved. 43        I should mention that Appendix H referred to in the above paragraph and which was attached to all the Noticesdid notprovide a breakdown of the daily rate of $10,825.45. What the defendant did was to total up the monthly site overheads and running costs (which comprised 22 items) and divide the total figure ($324,763.39) by 30 days to give a daily average of $10,825.45 charged to the plaintiff. The figures of $1,667,118.73 and $2,121,787.48 were arrived at using the daily rate multiplied by 154 and 196 days respectively. 44        I did not believe the defendant’s arithmetic fulfilled the requirements under cl 11.4 of the SIA sub-contract conditions. The 22 items comprised in the “site overheads” and “running costs” totalling $324,763.39 were at best, inaccurate and at worst, arbitrary. Every conceivable expense of the defendant had been factored into that figure. These included: (i) $140,000 for staffing; (ii) $2,000 for medical/petty cash; (iii) $75,000 for general workers; (iv) $2,500 for safety; (v) $15,000 for diesel; (vi) $10,000 each for telephone and water; (vii) $2,000 each for copier and stationery (a repeated item); (viii) $3,000 for telephone and (ix) $8,000 for overtime for clerk of works. It was totally unfair to the plaintiff, for reasons which will be explained later when I deal with the plaintiff’s second objection to the Notices. 45        It can be seen from the nine items extracted from the defendant’s alleged breakdown, that the figures were not actual but were estimates; otherwise, they would not all be ballpark or round numbers. That being the case, the defendant was indeed claiming general damages as the plaintiff contended. In that regard, I turn now to consider cl 10.00 of the Letter of Acceptance (see [17] above). Unlike the conflicting contractual provisions inJDC Corporation, there is no ambiguity or room for doubt in this case. Clause 10.00 clearly spelt out that liquidated and ascertained damages of $30,000 per calendar day (reiterated in the Notices) would be imposed for late completion of the sub-contract works. I could not see any “tension” (to borrow Thean JA’s word inJDC Corporation) between this clause and any provision in any other document which formed part of the contract between the parties. Counsel’s submission (that it was not so straightforward that liquidated damages were intended to be the sole remedy) was not made out. 46        Counsel made her above submission in reliance on a provision in the General Conditions and Preliminaries. That provision, entitled “Damages for non-delivery”, is to be found in exhibit SP-1 of S Premanand’s first affidavit. Counsel’s argument that general damages were not excluded from the contract between the parties is misconceived. This can be seen from a closer examination of that provision. The provision (see [23] above) states that the plaintiff wouldindemnifythe defendant against loss or damage suffered or incurredincludingliquidated damages, which may be imposed by the Employer on the defendant under the main contract, resulting from the plaintiff’s late and/or non-delivery of materials. In other words, the provision will come into play only if and when the Employer imposes damages (whether general or liquidated) on the defendant due to the plaintiff’s actions. It is an indemnity provision, not a condition whereby the defendant has the right to impose general damages on the plaintiff, as the defendant’s counsel contended. 47        Even if I am wrong and the Notices did comply with cl 11.4 of the SIA sub-contract conditions, the law requires the defendant to prove that the plaintiff’s delay under the supply contract was the sole cause for the delay under the main contract. In the light of the defendant’s claim against Lee Khim for $2m for liquidated damages paid to the Employer, the defendant did not discharge this burden of proof. 48        Additionally, the defendant could not point to any other provision in the contractual documents which gave it the right to impose general damages, whether in tandem with, or in contrast to, the liquidated damages provision found in cl 10.00 of the Letter of Acceptance. 49        The defendant had also failed to comply with the requirements of cll 11.4 and 11.5 of the SIA sub-contract conditions in its intention to set off the certified sum under the Interim Certificates against the liquidated damages, allegedly for delay under the supply contract. I rejected the defendant’s submission that the plaintiff had waived the defect in the Notices. The cases cited by counsel for the defendant (China Construction (South Pacific) Development Co Pte Ltd v Leisure Park (Singapore) Pte LtdandSteel Industries Pte Ltd v Deenn Engineering Pte Ltd([27]supra)) were not in point. 50        Consequently, there was no “dispute” concerning the Interim Certificates that needed to be referred to arbitration, pursuant to cl 15 of the supply contract. Accordingly I dismissed the Appeal."
    }
}