{
    "case_title": "Lim Kok Sian Brandon v Ong Ai Geok (alias Wang Aiyu)",
    "ncitation": "[2005] SGHC 51",
    "coram": "Lai Kew Chai J",
    "sections": {
        "The wife’s claim": "12        The wife listed her expenses as follows:  (a)Meals ($20 a day)$600(b)Fruits and household essentials$100(c)Utilities$50(d)Phone bill$95(e)Town council and service charges$80(f)Books and reading materials$100(g)Clothes, shoes and haircut$100(h)Toiletries and grooming$50(i)Contributions to parents (suspended because of financial situation)$600(j)Transportation (MRT) and taxi to town, doctor’s appointments, to and from lawyer’s office$250(k)Repayments (three credit lines)$300(l)Psychiatric treatment (twice a month)$300(m)Medical expenses (general practitioner, gynaecologist and dentist)$50(n)Miscellaneous expenses and obligations (bereavement, weddings and birthday gifts)$100Total:$2,775 13        In addition, she stated that she would need $800 a month for rental as the matrimonial flat has now been sold. Thus, the total monthly expenses claimed by her were $3,500.00.",
        "The district judge’s decision": "14        The district judge accepted that the wife was unable to work full-time for the time being but she noted that counsel for the wife had conceded that she should be able to earn about $1,000 a month from part-time work starting from January 2005. She accepted that $1,095 a month was reasonable. The district judge also thought that it was reasonable for the wife to claim $800 as the monthly rent as the matrimonial flat had been sold. The district judge took into account the wife’s ability to earn $1,000 a month from January 2005. The wife was awarded $1,895 a month as maintenance from August 2004 to December 2004 (ie, $9,475) and $895 a month for 31 months from January 2005 (ie, $27,745). As the husband was prepared to pay a lump sum maintenance of $40,000, the district judge awarded it as the lump sum maintenance. The district judge also took into consideration the following factors. The wife had received $128,500 for maintenance. She also had exclusive rent-free occupation of the matrimonial flat from the time they separated in 1999 until it was sold in April 2004. The husband had paid for the monthly instalments for the housing loan, the property tax and television licence during this period.",
        "The grounds of appeal": "15        During the appeal, counsel for the wife submitted that instead of the district judge’s view that the wife should be awarded $1,095 per month for five months and $895 per month for the next 31 months, the expenses as set out in [12] above were more reasonable. During the marriage, they lived in an executive Housing and Development Board flat in Bishan. The wife was taken out for meals in restaurants and was given money regularly, on the average $400 to $500 per month, to shop. 16        Counsel highlighted the fact that the wife had worked part-time for a few months in 2000, after which she was ill.",
        "The husband’s reply": "17        Counsel for the husband contended that there was no evidence that the wife had applied for jobs. From the credit card accounts tendered, it was evident that she had been going to spas and eating out in restaurants. From the reports of the private investigator engaged by the husband to track her lifestyle, the wife was leading a leisurely life. It was submitted that it would be unfair to require him to pay for another five years as claimed by the wife.",
        "My decision": "18        My decision was based on the following reasons. First, it was beyond dispute that the wife suffers from depressive disorder. According to the opinion dated 23 April 2004 of Dr Brian Yeo, a psychiatrist, she is unable “to start working on a full time basis for a considerable period of time”. In May 2004, the husband employed private investigators to keep surveillance of her lifestyle. Over one weekend, she was observed to have gone shopping at the departmental store, Takashimaya, and on a Wednesday, to have bought some cosmetics. The point to note was that her behaviour throughout was not inconsistent with that of a person suffering from depressive disorder. Secondly, I took into account sub-paras (a) to (f) of s 114(1) of the Women’s Charter (Cap 353, 1997 Rev Ed), which set out the matters which the court shall have regard to in determining the amount of any maintenance to be paid. They are: (a)        the income, earning capacity, property and other financial resources which each of the parties to the marriage has or is likely to have in the foreseeable future; (b)        the financial needs, obligations and responsibilities which each of the parties to the marriage has or is likely to have in the foreseeable future; (c)        the standard of living enjoyed by the family before the breakdown of the marriage; (d)        the age of each party to the marriage and the duration of the marriage; (e)        any physical or mental disability of either of the parties to the marriage; (f)        the contributions made by each of the parties to the welfare of the family, including any contribution made by looking after the home or caring for the family; … 19        In this case, the husband is a high-income earner. The wife, on the other hand, suffers from depressive disorder, in consequence of which she is unable to work for a considerable period of time. A divorce is a traumatic experience for both parties. Its effect on the parties to the marriage, however, varies. In the case of the wife, the breakdown of her marriage caused her mental breakdown. Her financial needs in terms of her monthly expenses are set out in [12] above. I was of the view that they were reasonable. I took into account that this was a short and childless marriage. The husband’s financial contributions during the period of separation was taken into account, both for the purposes of ascertaining his contribution under sub-para (f) of s 114(1) of the Women’s Charter, and, more importantly, for ascertaining the standard of living which he had provided for her and to which she was accustomed. As required by sub-para (c) of s 114(1), I also took into account the standard of living enjoyed by the wife before the breakdown of the marriage. 20        Sub-paragraph (e) of s 114(1) of the Women’s Chapter requires the court to have regard to any mental disability of either of the parties to the marriage. The wife attributed the cause of her depressive disorder to the violent behaviour of the husband during the marriage, and to the breakdown of the marriage. The husband denied the allegations. He suggested that there could be another reason, namely that she had lost about $100,000 in her speculation in shares. It seemed to me that the breakdown of the marriage, whatever the events that led to it, was more operative. One was unable to be definitive about it, since one could only consider the affidavits filed. Whatever the causes, the fact remains that she is suffering from depressive disorder and is unable to work. That being so, the question of her earning capacity and what she could have earned did not arise at all. 21        The next question was whether the provision of maintenance without a long stop and without ordering a lump sum was reasonable. I was not prepared to take the risk of assessing that five years would be sufficient for the wife to recover. Erring on the side of caution, and seeing that the decision involved the provision of maintenance for a wife who suffers from depressive disorder, I thought that the husband by way of a capital settlement of all future claims for maintenance could afford to part with two-thirds of his gross annual income earned in the year 2004. Alternatively, I ordered maintenance at $3,500 per month for three years and thereafter at $2,500 per month. If and when she recovers and finds full-time work, the husband can apply to court to revisit the issue. 22        The level of living to which the wife was accustomed to before the breakdown of the marriage brought me to the final reason behind the decisions I made. By s 114(2) of the Women’s Charter, a court is required to place the parties in the financial position in which they would have been if the marriage had not broken down. A court should do so as far as it is practicable. A court should also, in the exercise of its powers, consider the question of fairness, having regard to the conduct of the parties. In this case, I endeavoured to ascertain reasonable maintenance looking at the wife’s maintenance level shortly before the Deed was executed. I did not consider that the conduct of either party to the marriage had any material impact on the ascertainment of the amount of maintenance. Section 114(2) reads: In exercising its powers under this section, the court shall endeavour so to place the parties, so far as it is practicable and, having regard to their conduct, just to do so, in the financial position in which they would have been if the marriage had not broken down and each had properly discharged his or her financial obligations and responsibilities towards the other. 23        InQuek Lee Tiam v Ho Kim SweeDivorce Petition No 2928 of 1992 (26 January 1995) (unreported), the couple was married on 28 February 1989. It was a short marriage, decreenisihaving been pronounced on 31 August 1993. During the four and a half years of marriage, the wife had enjoyed a high standard of living. An attempt was made there, as far as practicable, to place her in a financial position she would have been if the marriage had not broken down. Similarly, the present circumstances warranted such an approach. Respondent’s appeal allowed."
    }
}