{
    "case_title": "Sie Choon Poh (trading as Image Galaxy) v Amara Hotel Properties Pte Ltd (No 2)",
    "ncitation": "[2005] SGHC 127",
    "coram": "Lai Kew Chai J",
    "sections": {
        "Gross negligence": "",
        "The law": "6          The term “gross negligence” as a concept is not susceptible of definition. Nor is it possible to lay down a standard, derived logically from past cases, by which a court can confidently rule when negligence should be deemed to be gross negligence. This is because the circumstances giving rise to the duty to act, including the duty to remove a potentially damaging or dangerous situation, vary from case to case and they also vary in infinite degree. It should be recognised that it is a practical impossibility that all the relevant circumstances which point to the degree of the negligence involved should be the same in any two cases that may arise. 7          But the meaning of the term within a contractual term is a matter of construction and my task is to find the intended meaning. In doing so, I shall consider the text in the context. The aim and purpose of the provision should be seen in the light of its factual matrix. In a shopping and hotel complex such as the Amara, where there are many shops and a food court, it is understandable for the defendant to exclude liability for any damage caused by negligence, however slight the dereliction of the duty of care. But what is not so easily acceptable is the exclusion of the consequences of serious errors. 8          How is a court to find as a matter of fact that there is gross negligence? Obviously, the particular circumstances at play in each case have to be examined and evaluated. Cases have shown that factors, such as notice or awareness of the existence of the risk, the extent of the risk, the character of the neglect, the duration of the neglect and, not least, the ease or difficulty of fulfilling the duty (eg, checking the condition of the pipes in the instant case) are important, and in some cases vital, in determining whether the fault (if any) of a defendant is ‘so much more than merely ordinary neglect that it should be held to be very great, or gross negligence’: seeBelanger v Michipicoten (Township)31 MPLR (2d) 198 andHolland v Toronto (City)[1927] 1 DLR 99discussed therein. 9          I am told by counsel that there is no local case which dilates on what would constitute gross negligence in an exemption clause in contract or generally in the law of tort. I therefore turn to cases in other jurisdictions for guidance. InThe Hellespont Ardent[1997] 2 Lloyd’s Rep 547, the plaintiffs, who had purchased tankers and incurred heavy losses on repairs and on their operations, sued each of the five defendants on the ground that they were grossly negligent and/or guilty of wilful misconduct in failing to arrange for adequate inspection of Ardent class records and/or adequate survey of her condition. The defendants relied on an exemption clause similar to cl 8.1 in the instant case. Mance J held that the inspection of full class records was an elementary step that any competent adviser fulfilling the defendant’s role ought to have undertaken in the inspection and the defendant’s failure to inspect them must be regarded as gross negligence. In construing the term “gross negligence” in the contract, Mance J stated at p 586 RHC: “‘Gross’ negligence is clearly intended to represent something more fundamental than failure to exercise proper skill and/or care constituting negligence. But, as a matter of ordinary language and general impression, the concept of gross negligence seems to me capable of embracing not only conduct undertaken with actual appreciation of the risks involved, but also serious disregard of or indifference to an obvious risk.” 10Great Scottish & Western Railway Company Ltd v British Railways Board2000 WL 389473 is another case where the term “gross negligence” appeared in a contract. The British Railways Board provided,inter alia, heavy maintenance work and the repair of any damage to the rolling stock of GSWRC. The Board excluded liability to GSWRC for any loss of or damage to property owned, leased or hired by GSWRC, except to the extent that such loss or damage or any severable portion thereof was caused wholly by the “gross negligence or wilful neglect” of the Board. The UK Court of Appeal stated at p 5 as follows: Thus, in the context of Clause 8.1, the words gross negligence take their colour from the contrast with wilful neglect and refer to an act or omission not done deliberately, but which in the circumstances would be regarded by those familiar with the circumstances as a serious error. The likely consequences of the error are clearly a significant factor. Thus, whether negligence is gross is a function of the nature of the error and the seriousness of the risk which results from it. 11        The trainman, in leaving a railway coach unscotched on tracks with a significant incline, as a result of which the coach rolled down and rammed a dining car causing extensive damage, was found by the trial judge liable for gross negligence. The Court of Appeal confirmed the finding that the trainman’s omission to scotch the state train coach was a ‘serous error’. 12        I now refer to theBelangercase,supra[8], a decision of Caputo J of the Ontario Court of Justice. The plaintiff, aged 35, slipped and fell on an icy patch of ground on the defendant municipality’s sidewalk on a Saturday afternoon. The plaintiff suffered a severe fracture of her left ankle and required surgery. She sued the municipality for damages, arguing that it had been grossly negligent under s 284(4) of the Municipal Act, RSO 1990, c M45 (Can) for failing to remove the icy conditions on the sidewalk. She succeeded. The court held that the sidewalk was dangerous and was a heavily-travelled pedestrian walkway which the municipality was under a duty to keep free of snow and ice. The municipality’s maintenance and inspection system, which was not carried out on weekends, was arbitrary and therefore inadequate. Therefore, the municipality was grossly negligent and was unable to invoke the statutory immunity from the consequences of mere negligence 13        TheBelangercase is also instructive for its other relevantdicta. Caputo J noted that the Court of Appeal of Ontario in the case ofDagenais v Timmins (City)(1995) 31 MPLR (2d) 196 rejected the defendant’s submission that gross negligence required proof of misconduct that is wilful, wanton or flagrant. Caputo J also followedHolland v Toronto (City),supra[8]. In that case, the Supreme Court of Canada allowed the appeal of the plaintiff who was injured on a sidewalk. It explained the mischief which the legislature intended to deal with. It was pointed out that owing to the heavy burden of climatic conditions in Ontario it was considered too onerous for municipalities to be held answerable in damages for every personal injury sustained in a fall in winter on a slippery sidewalk, however slight the negligence in failing to remove the snow and ice, the presence of which caused the fall. The relevant section in the Municipal Act read: “Except in case of gross negligence a corporation shall not be liable for personal injury caused by snow or ice upon a sidewalk.” 14        At pp 102–3 the Supreme Court of Canada stated as follows: The term “gross negligence” in this statute is not susceptible of definition. Noaprioristandard can be set up for determining when negligence should be deemed “very great negligence” – a paraphrase suggested inKingstonv.Drennan(1897), 27 S.C.R. 46, which for lack of anything better has been generally accepted. The circumstances giving rise to the duty to remove a dangerous condition, including the notice, actual or imputable, of its existence, and the extent of the risk which it creates – the character and the duration of the neglect to fulfil that duty, including the comparative ease or difficulty of discharging it – these elements must vary in infinite degree; and they seem to be important, if not vital, factors in determining whether the fault (if any) attributable to the municipal corporation is so much more than merely ordinary neglect that it should be held to be very great, or gross negligence. It is a practical impossibility that all the relevant circumstances affecting the character or degree of the negligence involved should be the same in any two cases that may arise.",
        "The facts": "15        The following facts emerged from the evidence. It was clear that the inspection window of the failed T-joint pipe fitting had never been opened for the purpose of assessing the pipe’s internal condition and the outcome of the internal cleaning conducted by the contractors of Amara. In fact, on the evidence led by Amara, it was clear that Amara had employed Dyna Jet Pte Ltd and Powerman Services only to flush the pipe system and not to inspect the condition of the pipe and the T-joints within the complex. 16        The evidence of Mr Sie’s expert, PW4 David Tay Yew Huat (“Mr David Tay”), is as follows. His evidence was not available at the first hearing. He is a materials and corrosion consultant. He conducted a failure analysis on the leaked waste T-joint pipe fitting. In his opinion, the leakage was caused by severe graphitic corrosion at the internal surface of the T-joint pipe fitting. Graphitic corrosion had occurred over time beneath massive accumulation of acidic waste matter formed inside the pipe fitting. The waste matter had accumulated to an extent of severe constriction leading to complete blockage. The morphology of the waste accumulation at the failed pipe fitting showed that it had been deposited over time and the pipe had not been maintained. 17        The failed T-joint pipe fitting was equipped with an inspection window. Unfortunately this inspection window was never opened or used for assessment of the internal condition of the pipe or pipe maintenance. The pipe system was installed more than nine years before the incident. It follows that for nine years the internal condition of the T-joint pipe was not inspected at all. 18Mr David Tay explained that due to the absence of maintenance of the pipe section, a massive accumulation of the hardened waste had formed over time. The hardened waste being acidic further acted as a corrosive medium (aqueous form), which is conducive for graphitic corrosion. In Mr David Tay’s opinion, which I accept, the thickness of the pipe fitting had reduced significantly. Given the severe accumulation of waste, any pressure induced in the pipe would cause a burst in this fitting, which was what happened at the time when the t-joint burst, while Dyna-Jet Pte Ltd was clearing the pipe by flushing a blockage in the waste pipeline located in the ceiling of the unit. 19        In cross-examination, Mr David Tay said that he had been engaged to assess the condition of pipes by owners of hotels three or four years after installation. Owners wanted to avoid sudden failures. He carries out about ten inspections annually. The age of the buildings range from five to ten years. At such inspections, he would establish the condition and integrity of the pipes in terms of materials and thickness of the pipes. He would use the “remote eye” to inspect visually the condition of the pipes and to check the hardness of the steel materials or cast iron. A thickness gauge checks the thickness. Mr David Tay also knocks the pipes to ascertain effective thickness. If the pipe is corroded it would sound brittle. Access to the internal parts of the pipes is gained through the inspection windows. 20        It would cost about $15,000 to carry out a risk assessment of a pipe system such as that in the Amara complex.",
        "My decision": "21        In my view, Amara’s omission to carry out any inspection of the condition of the pipe was a serious error. For more than nine years, Amara failed to engage competent contractors to inspect the T-joint pipe which incessantly carried acidic waste materials throughout the operating hours of the food court. When the T-joint burst, the equipment and stock of Mr Sie were extensively damaged. All that Amara caused to be done was to flush the pipes whenever there was a chokage. 22        Accordingly, I order judgment with costs for the plaintiff against the defendant and that damages as claimed in the Statement of Claim be assessed by the Registrar. Plaintiff’s claim allowed."
    }
}