{
    "case_title": "JU and Another v See Tho Kai Yin",
    "ncitation": "[2005] SGHC 140",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1          The first plaintiff is a Singaporean and a businesswoman by occupation. She had worked in Japan since the 1980s, travelled frequently (to Singapore, Malaysia, Japan, Taiwan and China) and spent most of her time outside Singapore. 2          The second plaintiff is the first plaintiff’s son by the first plaintiff’s husband (“the husband”) who is a Chinese national from Shanghai. The first plaintiff married the husband in a customary ceremony in China in October 2000. The first plaintiff was then 43 years of age, her birth date being 27 June 1957. The husband was ten years younger than her, a fact which prompted opposition to the marriage from the husband’s family. The parties’ marriage was registered in Singapore on 28 November 2001. 3          The second plaintiff was born by Caesarean delivery on 23 January 2002 in Singapore and suffers from Down’s syndrome. As at the date of the trial, he was about two and a half years of age. 4          See Tho Kai Yin (the first defendant) is a medical doctor who practises as an obstetrician and gynaecologist under the name and style of The See Tho Clinic for Women (“the Clinic”) at 6 Napier Road, #07-11/12, Gleneagles Medical Centre, Singapore 258499. He is a visiting consultant attached to the Department of Obstetrics and Gynaecology, National University of Singapore, with teaching responsibilities. The Family Clinic shares premises with the Clinic. However, it is a separate medical practice run by family physician Saleha Johari, who is the wife of the first defendant. When the first defendant took the stand, counsel for the plaintiffs sensibly informed the court that his clients withdrew their claim against The Family Clinic.",
        "The facts": "5          According to the first plaintiff, she went to Shanghai from Japan to meet the husband between 14 and 16 May 2001. Unbeknownst to her, she conceived the second plaintiff during that period. This was quite surprising in view of her age and the fact that in 1997, she had undergone surgery in Japan for cancer of the cervix. In May 1999, the first plaintiff had also discovered that she had an ovarian cyst which, fortunately, turned out to be benign. 6          The first plaintiff left China for Japan on or about 19 June 2001. On 4 July 2001, she flew to West Malaysia for business. On or about 11 July 2001, the first plaintiff left Malaysia for Shanghai to meet the husband. She consulted a gynaecologist on or about 31 July 2001 at the Bo Ai Humanity Hospital of Shanghai (“the Chinese hospital”) and discovered she was pregnant. She was attended by one Dr Zhu Ying (“Dr Zhu”) and underwent an ultrasound diagnosis which showed that the foetus was about ten to 12 weeks old. The first plaintiff did not undergo any tests but was advised to consult her former gynaecologist when she returned to Japan, in view of her previous history of cancer. 7          The first plaintiff decided she wanted to deliver her child in Singapore. Consequently, she telephoned her brother’s wife, Jane, informed Jane of her pregnancy and inquired who had delivered Jane’s baby in 1987. Jane recommended the first defendant and/or the Clinic. 8          On or about 9 August 2001, the first plaintiff consulted her Japanese physician who referred her in turn to one Dr Tohru Morisada (“Dr Morisada”). The first plaintiff was told by Dr Morisada that her foetus was about 14 weeks in gestation and was a male. She underwent an ultrasonic examination on 23 August 2001 at the Saisekai Utsunomia Hospital in Japan (“the Japanese hospital”) and was advised to undergo surgery (which she did on 5 September 2001), to stitch up her cervix so as to prevent a miscarriage. The procedure is better known in the medical field as a “McDonald stitch” and will henceforth be referred to as such. At the time of the surgery, the first plaintiff was told she was at about the 16th week of gestation and that her baby was due on or about 15 February 2002. She was hospitalised for five days after her cervical surgery. 9          According to the first plaintiff, she telephoned the first defendant from Japan and spoke to him twice, once, on or about 24 August 2001, and later, on or about 28 August 2001. There is a dispute on the content of those conversations. The first plaintiff claimed that the first defendant only advised her to undergo cervical surgery in Japan. The first defendant, on the other hand, asserted that he had asked about her age and when he was told of it, had advised the first plaintiff that she should request her Japanese doctor to carry out all the necessary antenatal tests on her foetus. It is common ground that the first plaintiff asked the first defendant for an appointment date but he declined, stating she should return to Singapore first before fixing an appointment with him. The first defendant advised the first plaintiff to obtain a report from her Japanese doctor on her condition. 10        When she left Japan on or about 15 October 2001 for West Malaysia, the first plaintiff carried a report from Dr Morisada dated 3 October 2001 (“Dr Morisada’s report”) as well as eight prints of the ultrasound scan he had done on the foetus. 11        According to the first plaintiff, she telephoned the Clinic on or about 16 October 2001 to make an appointment with the first defendant. She spoke to one of his two staff (either Winifred Khoo (“Winnie) or Alice Chng (“Alice”)). She gave the following information in that call: (a)        her full name and telephone number; (b)        that she had been recommended to the first defendant by her sister-in-law, Jane, and had consulted the first defendant previously over the telephone, and that the first defendant was aware of her case; (c)        that she had undergone a McDonald stitch procedure in Japan; (d)        that she was about 22 weeks pregnant with her first child and the estimated delivery date was 15 February 2002; and (e)        that she wanted as early an appointment as was possible with the first defendant. 12        The first plaintiff claimed she was given an appointment date of 23 October 2001 and that on or about 19 October 2001, she received a telephone call from the Clinic to say her appointment would be postponed to 30 October 2001. She returned to Singapore on 25 October 2001 to keep the appointment. 13        The first defendant and his staff, on the other hand, testified that the first plaintiff’s first consultation was all along scheduled for 30 October 2001. There was no earlier appointment fixed for 23 October 2001. 14        In any event, the first defendant attended to the first plaintiff on 30 October 2001. During that first consultation (which lasted about half an hour) he carried out an ultrasound scan on her to check on the condition of the foetus and detected no abnormalities. He informed the first plaintiff that the scan showed the foetus was a male. She replied she was aware of the fact. 15        The first defendant recorded in his clinical notes[1]that the first plaintiff had had antenatal diagnosis with follow-up in Japan (she denied telling him this) and that she had undergone a McDonald stitch procedure on 5 September 2001. The first defendant did not recall being shown an ultrasound report from the Chinese hospital, Dr Morisada’s report or ultrasound scans from the Japanese hospital by the first plaintiff, as she claimed. Neither could he remember being told that she had undergone scanning in China. 16        What the first defendant remembered was being told by the first plaintiff (which she denied) that she had been informed by Dr Morisada that her estimated delivery date was 15 February 2002, according to an ultrasound dating. The first defendant confirmed this estimated date by taking biometric measurements (head diameter, head and abdominal circumference, and femur length) when he did the ultrasound scan. According to him, she was by then 24 to 25 weeks into her pregnancy. Consequently, he did not carry out any amniocentesis test nor advise the first plaintiff to undergo further tests that day as she was past the threshold of legal abortions in Singapore under the Termination of Pregnancy Act (Cap 324, 1985 Rev Ed) (“the Act”). 17        Had the first plaintiff presented herself at the Clinic at 20 weeks’ gestation or earlier, the first defendant would have conducted an amniocentesis test on her to check whether there were chromosomal abnormalities. The test results would have been available about two to three weeks after the test. Even if he had seen the first plaintiff on 23 October 2001, it would have been too late to carry out an amniocentesis test in time for abortion to be an option. 18        The first plaintiff’s second appointment with the first defendant was on 24 November 2001. By then, she was 28 weeks pregnant. Again the first defendant carried out an ultrasound scan on her that day to assess foetal growth and to ascertain that it had no abnormalities. The first plaintiff was given copies of the printed scans. The first plaintiff was thereafter given a third appointment on 15 December 2001. 19        Sometime before 15 December 2001, the first plaintiff telephoned the Clinic and requested to speak to the first defendant who was not available. The first plaintiff then informed Winnie that she wanted the first defendant to deliver her baby by Caesarean section in the early hours of 12 February 2002, which was the first day of the Chinese New Year. When Winnie conveyed the first plaintiff’s message to the first defendant, he asked Winnie to inform the first plaintiff that he could not accede to her request and that the first plaintiff should choose a more reasonable time for the elective procedure. This was because generally in all hospitals, there was only sufficient operating theatre staff to handle emergency situations during the late hours of the night or the early hours of the morning. In the first defendant’s view, that was not an optimal situation and it was therefore not in the first plaintiff’s interest to have an elective procedure carried out during those times. (I should point out that the first plaintiff’s version was that she wanted her baby delivered in the afternoon a few days before and not on the first day of, the Lunar New Year.[2]) 20        The first plaintiff was unhappy when Winnie conveyed the first defendant’s message to her. She failed to keep her third appointment with the first defendant on 15 December 2001. Subsequently, the first defendant discovered that the first plaintiff had consulted another doctor, Dr Lee Wei Hong (“Dr Lee”), and that her baby (the second plaintiff) was delivered by Caesarean section on 23 January 2002 at Mount Alvernia Hospital. As stated earlier, the second plaintiff suffers from Down’s syndrome.",
        "The pleadings": "21        The plaintiffs filed this suit on 29 April 2003. In the Re-amended Statement of Claim, the first plaintiff,inter alia, alleged as follows: (a)        Her first appointment was postponed to 30 October 2001 from 23 October 2001. (b)        At the first and second appointments on 30 October and 23 November 2001 respectively, she was advised and assured by the first defendant that the foetus was normal, she need not undergo any further tests and no complications were noted from the ultrasound scans or from the first plaintiff’s examination. (c)        Between 16 October 2001 (when the first plaintiff telephoned the first defendant for an appointment) and 14 December 2001 (when she was given a third appointment by the Clinic) the first and second defendants undertook to provide and did provide the first and second plaintiffs with specialised medical treatment and advice in the fields of obstetrics and gynaecology in which the defendants professed to have special skill and expertise. (d)        The defendants owed a duty of care to the plaintiffs to use reasonable care and skill as experts in the field of obstetrics and gynaecology in the treatment and advice then provided to the first plaintiff. 22        The plaintiffs further pleaded that the following express or implied terms applied to the medical treatment and advice provided by the defendants: (a)        keeping the appointment scheduled for 23 October 2001; (b)        attending to the first plaintiff promptly and without delay at the appointed time in view of her age and stage of pregnancy; (c)        advising the first plaintiff of the possibility, risks and likelihood, especially in view of the first plaintiff’s age, of the foetus and child suffering from: (i) foetal chromosomal abnormalities; (ii) defects of the heart and other organs; (d)        advising the first plaintiff (in view of her age) to undergo examination and/or testing of the foetus for foetal chromosomal abnormalities and defects of the heart and other organs; (e)        advising the first plaintiff in view of her age of the possibility and legality of terminating the pregnancy. 23        The plaintiffs alleged that the first and second defendants breached the above duties, particularly in not advising the first plaintiff to terminate the pregnancy. The first plaintiff alleged she carried the pregnancy to full term instead of having and exercising an option to abort the foetus in accordance with the laws of Singapore and of Shanghai, China. 24        In the Defence, the first defendant: (a)        denied he practised under the name and style of The Family Clinic; (b)        contended that the first plaintiff did not inform the first defendant of the date when she conceived and became pregnant or the date of her last menstrual period; (c)        asserted that the first plaintiff was never scheduled for an appointment on 23 October 2001 to consult the first defendant; (d)        averred that at the first consultation on 30 October 2001, the first plaintiff told him she could not remember the date of her last menstrual period, that she had undergone antenatal diagnosis in Japan and that the baby was fine; she did not mention when she had conceived nor that she had any antenatal consultation in China; (e)        averred that prior to the first consultation, the first plaintiff already knew the foetus was a male; and (f)         averred that on 30 October 2001 he carried out ultrasound scanning of the foetus and determined the first plaintiff was 24 to 25 weeks pregnant. The scans showed the foetus to be normal and showed no obvious abnormalities. The first defendant told the first plaintiff that she could no longer terminate her pregnancy as the law in Singapore did not permit termination after 24 weeks of gestation. The first plaintiff had no alternative but to carry the pregnancy to full term. Consequently, the first defendant advised the first plaintiff there was no need to undergo further antenatal diagnosis. 25        The first plaintiff’s second consultation with the first defendant was on 23 November 2001. The first defendant carried out a foetal growth scan to check the size and position of the foetus and also checked the blood pressure and weight gain of the first plaintiff. The scan results were consistent with those of the first consultation and were shown to the first plaintiff. The first plaintiff was given a third follow-up appointment on 14 December 2001. 26        The first defendant denied the allegations of negligence pleaded in the Statement of Claim. As a specialist, he had and did exercise a duty to use all reasonable care as an obstetrician during the first and second consultations by the first plaintiff. He added that he owed no duty of care to the first plaintiff before she became his patient on 30 October 2001 and denied the express and implied terms of medical care and treatment alleged in the Statement of Claim. 27        The first defendant averred that if indeed he had scheduled an appointment with the first plaintiff on 23 October 2001 (which was denied), he did not owe her a duty not to change the appointment date. Save for cases of emergency and/or life threatening situations, the first defendant was not obliged to adhere strictly to any scheduled appointments. 28        The first defendant also alleged contributory negligence on the part of the first plaintiff. Although she had discovered she was pregnant on or about 31 July 2001, the first plaintiff did not ascertain whether the foetus had any foetal chromosomal abnormalities and/or defects from any of the doctors she consulted before she saw the first defendant on 30 October 2001.",
        "The evidence": "29        The plaintiffs called a whole host of witnesses, a number of whom were completely unnecessary both on the issues of liability and quantum, as will be seen later. I had advised counsel at the outset that I would only determine the issue of liability. In the event that I rule in favour of the plaintiffs, their claim will then be assessed by the Registrar. 30        The plaintiffs called six witnesses of fact (which included medical specialists) besides the first plaintiff, and had one expert witness who testified on Chinese law. They did not have a medical expert witness. Besides the first defendant, the defendants’ witnesses of fact were Winnie and Alice. The first defendant’s expert witnesses were two obstetricians and gynaecologists.",
        "The plaintiffs’ case": "31        As I have set out the first plaintiff’s version of events at [5] to [12] above, I shall focus on the evidence adduced from her under cross-examination. 32        In her younger days, the first plaintiff had spent a year in England studying fashion. Subsequently, she spent two years working as a fashion and/or garment co-ordinator, first in Hongkong and then in Taiwan. The first plaintiff claimed that although she had informed Dr Morisada she was 44 years old, he had not warned her of the risk of her foetus having chromosomal abnormalities. This was because Japanese doctors did not give such warnings.[3]She herself did not raise the subject because in 2001 she was ignorant about chromosomal abnormalities. Further, because of her previous medical history, she believed she would never conceive. She claimed that the doctors and/or gynaecologists she had consulted over the years never once told her that it was more difficult for an older woman to conceive. However, when she was about 25 years old, doctors had advised her that she had only about a 20% chance of conceiving. 33        Because of her busy (albeit routine) work schedule in Japan, the first plaintiff did not find out about the higher risks for older pregnant women from reading either newspapers or magazines; she watched television in her spare time. When she discovered she was pregnant in August 2001 and that it was a male foetus, she was “so happy”, given the odds of her conceiving. Although the first plaintiff had seen Down’s syndrome children with their characteristic facial features, she was not aware of the reasons therefor.[4]Even when she delivered the second plaintiff in January 2002, the first plaintiff claimed that she was ignorant of the increased risks of having a Down’s syndrome baby due to her advanced age. Indeed, up to the trial, the first plaintiff asserted that she did not know of the special tests for chromosomal abnormalities nor what they entailed. She revealed that she found out about the possibility that she could have terminated her pregnancy in China only after she had delivered the second plaintiff. 34        The first plaintiff denied that she had received antenatal care during her trip to Malaysia between 15 and 25 October 2001. She explained that she had told Dr Lee so on 20 December 2001, as she did not think it was nice to tell Dr Lee (who asked her) that she had consulted a Singapore doctor (the first defendant) before him, so she said she had seen Malaysian doctors instead. The first plaintiff showed Dr Lee Dr Morisada’s report but not the scan films taken by the first defendant. She explained that she was then in an advanced stage of pregnancy and she felt that Dr Morisada’s report was more than adequate to provide her medical history. She denied Dr Lee had told her on 20 December 2001 that she faced a greater risk of having a baby with chromosomal abnormalities because of her age. The first plaintiff asserted that while examining her that day, Dr Lee merely told her that the heartbeat of the foetus was a little slow. She also denied having told him that she understood chromosomal abnormalities to include Down’s syndrome. 35        Part of the first plaintiff’s pleaded case was that the first defendant should not have rescheduled her first appointment from 23 to 30 October 2001. When questioned why she wanted an early appointment so urgently, the first plaintiff said it was for no reason other than to ensure that the baby was fine. 36        In contrast to her insistence that the first defendant had postponed the first consultation, the first plaintiff denied that for the second consultation, the Clinic’s staff had changed the date from 23 to 24 November 2001. She maintained that there was no change from the original date of 24 November 2001. Her evidence did not accord with the Clinic’s appointment book entries. 37        A curious bit of evidence emerged from the first plaintiff’s visit to the Chinese hospital. The first plaintiff had produced her admission form[5]when she visited the Chinese Hospital on 31 July 2001. She was attended to by Dr Zhu who did a scan on her. The form stated her age as “35”. When questioned on this inaccuracy, the first plaintiff said the form was filled in for her and she did not notice her age as stated on the form.[6]Dr Zhu did not ask, and the first plaintiff did not volunteer, information on her age. 38        I had observed at [29] above, that the plaintiffs called a number of witnesses, who were completely unnecessary, on the issue of liability. These were the medical specialists who attended on the first or second plaintiff after the latter’s birth. They were: (a)        Dr S Bhavani, a neonatologist and paediatrician attached to KK Women’s and Children’s Hospital (“KK Hospital”); (b)        Dr Lim Yun Chun, a consultant psychologist attached to Raffles Hospital; and (c)        Dr Terence Tan, a paediatrician in private practice. Witnesses who should be but were not called were Dr Morisada and Dr Zhu. At a later stage, I will address the testimony of the plaintiffs’ remaining witnesses when I deal with the issue of expert evidence. 39        Dr Lee, who delivered the second plaintiff, testified for the plaintiffs. It appeared from his testimony that his management of the first plaintiff’s pregnancy (when he first saw her on 20 December 2001) was no different from the first defendant’s on 30 October 2001. Although she was unwilling to admit that had she first approached Dr Lee (instead of the first defendant), his advice to her would not have been different from the first defendant’s, it was clear from Dr Lee’s cross-examination that he would have given the first plaintiff the exact same care and advice as the first defendant. Dr Lee revealed that the first plaintiff told him the baby was her second pregnancy. This piece of evidence was vigorously denied by the first plaintiff when she testified. Indeed, the first plaintiff went so far as to allege that Dr Lee was lying on this aspect.[7] 40        Dr Lee also testified that: (a)        cell culture karyotyping was not a definitive way of diagnosing chromosomal abnormalities; (b)        genetic ultrasound scanning was not a definitive way of diagnosing chromosomal abnormalities; (c)        in October 2001, obstetricians in Singapore generally were not that familiar with the FISH test; and (d)        he himself was not familiar with, nor had he sent his patients for, the FISH test. FISH is the abbreviation for “Flourescent In-Situ Hybridisation”. It is a test to determine chromosomal abnormalities using blood samples. Dr Lee explained that he did not refer the first plaintiff to another obstetrician for genetic ultrasound scanning because she was then 32 weeks pregnant. He routinely sent his patients for confirmation of foetal abnormalities at about 20 weeks’ gestation when the scan would be most accurate.",
        "The defendants’ case": "41        Before he went into private practice by starting the Clinic in September1978, the first defendant worked at KK Hospital. As at the date the trial began, the first defendant had been in private practice for 26 years. He has had a busy practice, judging from the entries in his appointment book. 42        The first defendant explained that the Clinic’s staff could not have given an appointment to the first plaintiff on 23 October 2001 as she claimed. He was away in Australia attending first, the 11th World Congress on Ultrasound in Obstetrics and Gynaecology (“the Congress”) (held between 23 and 28 October 2001) and then the annual council meeting of the Asia Oceania Federation of Obstetrics and Gynaecology (on 27 and 28 October 2001). In support thereof, the first defendant produced a brochure of the Congress,[8]the Clinic’s appointment book for year 2001[9]and entries from his passport showing that he had left Singapore on 23 October 2001 and had returned on 29 October 2001. 43        The clean (unwritten) pages for the dates 23 to 29 October 2001 in the appointment book are to be contrasted with the entries for other dates. All entries were written in pencil and erasures were obvious when made. The first defendant testified that appointments recorded in pencil made it easier for alterations to be made when patients and/or the Clinic changed appointment dates. This could be seen for entries for the week of 16 to 23 November 2001, when appointments for patients were erased and rescheduled (including the first plaintiff’s from 23 November 2001 to Saturday, 24 November 2001) as the first defendant had to take urgent leave to go to London. 44        When his two staff testified, Winnie and Alice confirmed the absence of the first defendant from Singapore between 23 and 29 October 2001. They were told well in advance (sometime between August and September 2001) of his trip. In the case of Alice, she took advantage of the first defendant’s absence from Singapore to take a family holiday in Beijing during the period, for which she applied and obtained a visa for China on 11 October 2001. Both Alice and Winnie have worked for the first defendant for over 20 years. 45        As the first defendant’s version of events before and leading up to the two consultations has been set out earlier, I shall now proceed to look at the evidence adduced from him during cross-examination. 46        The first defendant agreed that it was the duty (with which he complied) of all obstetricians to advise their patients of the risk of having Down’s syndrome babies once they are past 35 years of age. He testified he had indeed discussed the risks of foetal abnormality with the first plaintiff because of her age and medical history. After his explanation, the first plaintiff appeared quite comfortable, and indicated that she would carry the baby to term and that she did not want to go through an amniocentesis. In any case, he was certain that Dr Morisada would have ensured (through ultrasound scans) that the foetus had no abnormalities before Dr Morisada performed the McDonald stitch on the first plaintiff, even if no amniocentesis was done. That was the level of care an obstetrician would have given to a patient of the first plaintiff’s age and condition. 47        As for discussing with patients various options for prenatal diagnosis to determine chromosomal abnormalities in the foetus, the first defendant pointed out that his advice depended on the stage of pregnancy when the patient first consulted him. A patient who presented herself to him at 10 to 13 weeks would undergo tests (the nuchal translucency screening test) different from a patient who was 16 weeks pregnant (the triple test) and different from a patient who was 20 weeks pregnant (ultrasound screening test). However in 2001, if a patient consulted him when she was 22 weeks pregnant, all methods of screening or genetic tests would have been academic. The only recommendation he would make to such a patient to determine whether she had a chromosomally abnormal child would be to undergo an amniocentesis. In this case, the first plaintiff was about 24 to 25 weeks pregnant on 30 October 2001 and about 28 weeks pregnant on 28 November 2001. It was far too late to carry out an amniocentesis as it would take another two weeks for the tests results to be known. Had she undergone an amniocentesis which proved that the foetus showed chromosomal abnormalities, the law precluded the first plaintiff from terminating her pregnancy in any event. 48        I noted that while counsel for the plaintiffs questioned the first defendant in considerable detail on whether he knew there were experts in the fields of prenatal diagnosis and then tossed up to the latter the names of some such experts, none of these experts were called by the plaintiffs to testify.",
        "The expert evidence": "49        It would be appropriate at this juncture to look at the expert evidence adduced at the trial. 50        As stated earlier at [30], the plaintiffs had one expert in Chinese law in the person of Mdm Chang Meiling (“Mdm Chang”). Mdm Chang, a lawyer from China, was originally slated to be a witness of fact. She had conducted interviews of a Chinese doctor, Sui Long (attached to Shanghai Changzheng Hospital initially and then to Fudan University’s affiliated hospital), on 23 March 2002 and 6 September 2003 respectively. Counsel attempted to introduce, through Mdm Chang, the text of those interviews which she exhibited in her (first) Affidavit of Evidence-in-Chief. For added measure, Mdm Chang then deposed to the medical practice in China to say that the first plaintiff would have been lawfully entitled to terminate her pregnancy in Shanghai before, on and even after 30 weeks of gestation. Counsel for the defendants rightly objected to such attempts to introduce hearsay and expert evidence through a witness of fact. I disallowed Mdm Chang’s evidence. 51        Counsel then attempted to turn Mdm Chang into an expert witness on Chinese law,vizon maternal and infant care, after he applied to amend (as appears in italics below) para 14 of the Statement of Claim so that it read as follows: The first plaintiff carried the pregnancy to term instead of having and exercising an option to abort the foetus which she was carryingin accordance with the laws of Singapore and of Shanghai, China respectivelyand thereby incurred the following further medical expenses up to delivery. 52        However, Mdm Chang’s credentials as an expert were woefully inadequate and/or lacking. She could not possibly come within s 47 of the Evidence Act (Cap 97, 1997 Rev Ed) as a person with special skills in giving an opinion on foreign law. Mdm Chang had retired in 1998 from the Law Practice Bureau where she was a clerk doing administrative work handling complaints against lawyers. She did not have a law degree from any university but had undergone a part-time law course. She then passed the lawyer’s licence examinations in 1993 and obtained a licence to practise. She practised with the Shanghai Bei Fang Law Firm (“the Firm”) and claimed to be a partner there. Her status, however, was not borne out by checks made on the Firm’s website by counsel for the defendants. When printed copies[10]of the website were shown to Mdm Chang, she claimed the website was not updated. On 31 January 2005 when she returned to court, she said the Firm’s website had been revised and her biodata had been included. 53        The Firm’s areas of practice did not include medical law practice. It practised mainly in commercial and financial areas and its clients were mostly state-owned enterprises and financial institutions. Moreover, according to her owncurriculum vitae, Mdm Chang handled women’s rights, maternal and infant health care matters as a family law specialist. However, she did a volte-face on the last day of trial and denied she was a family law specialist. What was certain, however, was that Mdm Chang had no legal experience or expertise on issues relating to the law on termination of pregnancy in China. The piece of legislation described as “The Law of the People’s Republic of China” on maternal and infant heath care exhibited in her affidavit was not properly proved. No copy of the original legislation or statute was produced in court. In addition, that document did not corroborate her statement that abortion was still possible in China even up to and after 30 weeks of gestation. I view that statement of Mdm Chang as highly irresponsible and incredible, bearing in mind that a foetus of 30 weeks’ gestation if born alive, is likely to survive nowadays with advanced and sophisticated medical facilities for premature babies. It is inconceivable that any country would legalise abortions when a woman is in the third trimester of her pregnancy. 54        Mdm Chang’s supplemental affidavit (as an expert witness) also failed to comply with O 40A r 3 of the Rules of Court (Cap 322, R 5, 2004 Rev Ed) (“the Rules”). The Rules require expert evidence to be given in a written report that must comply with the requirements set out in O 40A r 3(2). Mdm Chang’s report did not comply with that sub-rule. I have no hesitation therefore in totally rejecting her testimony as an expert. She was not qualified to be an expert witness, let alone to render an opinion on any aspect of Chinese law, bearing in mind that foreign law must be proved as a fact under our system of law. 55        Mdm Chang was a stark contrast to the expert witnesses of the first defendant, who both came with formidable credentials. 56        The first expert, Dr Yeo Seow Heong (“Dr Yeo”), was at the date of trial, the Chief of Obstetrics (since 1999) and the head (since 1993) of the maternal foetal medicine department in KK Hospital. Dr Yeo had been in charge of practice standards at KK Hospital which handled between 14,000 and 17,000 deliveries per year. He was the author of numerous research papers, articles and publications and had delivered papers at countless seminars, talks and symposiums. 57        Dr Yeo addressed the following issues: (a)        Was the first defendant under a duty to see the first plaintiff on an urgent basis? (b)        Was the first defendant under a duty to specifically carry out tests on the foetus for the purpose of detecting foetal chromosomal abnormalities and/or defects of the heart and other organs? If not, was he under a duty to advise the first plaintiff to undergo such tests? (c)        Was the first defendant under a duty to advise the first plaintiff of the possibility and legality of terminating the pregnancy? Dr Yeo answered the three issues in the negative. He concluded that by the time the first plaintiff presented herself to the first defendant on 30 October 2001, it was too late for either a screening test (maternal serum screening) or diagnostic test (chromosomal test) for Down’s syndrome to be done. Such tests were typically done between 14 and 20 weeks of pregnancy. After the 22nd week of pregnancy, the chromosomal test in any case was no longer a good test for Down’s syndrome diagnosis, because of the higher risks of miscarriage imposed on the foetus by the operative procedure. Dr Yeo gave an estimate of 2% to 5% risk of miscarriage if foetal blood sampling was done after 24 weeks as opposed to a risk of one miscarriage in 300 cases for amniocentesis testing. 58        Dr Yeo opined that the first defendant’s duty of care to the first plaintiff did not begin until 30 October 2001 when she was already 24 weeks pregnant, which was past the deadline for legal termination of her pregnancy. He added that it was reasonable to expect a normal woman to realise that she was at a greater risk of bearing a Down’s syndrome child if she was above 35 years of age. Here, the first plaintiff was 44 years of age and should have been aware of the risks. 59        Counsel for the plaintiffs spent an inordinate amount of time cross-examining Dr Yeo on the right of patients to be counselled on Down’s syndrome babies, referring Dr Yeo to numerous articles he had written on the topic. Counsel’s questions missed the point entirely. It would have served little purpose to have offered the first plaintiff counselling on the possibilities of her baby suffering from Down’s syndrome, when the law prohibited her from taking any action other than to carry her pregnancy to full term. Dr Yeo said as much when he acknowledged that while there was no law against prenatal screening after 22 weeks, there was a law, the effect of which meant that nothing constructive could be done. In any case, there was no blood test available after 24 weeks’ gestation that would screen for Down’s syndrome. 60        Dr Chow Kah Kiong (“Dr Chow”) is a gynaecologist in private practice and is a visiting specialist at KK Hospital as well as a medical adviser to Gleneagles Hospital. Between 1985 and 1988, Dr Chow was the deputy head of the obstetrics and gynaecology department in Alexandra Hospital. He echoed Dr Yeo’s views. Dr Chow opined that even if the first plaintiff had seen the first defendant on 23 October 2001 (assuming that was the first consultation date as she claimed), the first defendant would not owe a duty to advise her to undergo testing for foetal chromosomal abnormalities. It was already too late by then to do the usual amniocentesis test. (According to Dr Yeo, it took eight to 12 days to get the test results of an amniocentesis). Instead, it was the responsibility of the doctors providing her with earlier antenatal care to give such advice and to carry out the necessary testing. Testing for Down’s syndrome and the attendant counselling should have been done long before 24 weeks of pregnancy. Dr Chow stated that he recommended such a procedure at 12 weeks of pregnancy so that various options could be made available to the expectant mother for assessing the risks of Down’s syndrome. Diagnosing the foetus with karyotyping procedures was an alternative. 61        Dr Chow noted that the first plaintiff did not inform the first defendant that she felt her earlier antenatal care was inadequate and she did not specifically ask him for further testing for foetal chromosomal abnormality to be carried out. Hence, the first defendant did not owe her a duty to advise her to undergo such tests.",
        "The issues": "62        There are three issues I need to determine in this case: (a)        Did the first defendant owe a duty to the first plaintiff to schedule an appointment for her at the earliest possible date? (b)        Was the first defendant’s management of the first plaintiff’s pregnancy up to 24 November 2001 negligent or in breach of contract? (c)        If the answer to (b) is in the positive, did the breach of the duty of care cause the plaintiffs’ alleged losses?",
        "The law": "63        The Court of Appeal has affirmed inKhoo James v Gunapathy d/o Muniandy[2002] 2 SLR 414(“James Khoo’s case”) that the standard of care required of a medical practitioner in Singapore is that set out in thelocus classicus,Bolam v Friern Hospital Management Committee[1957] 1 WLR 582(hereinafter referred to as the “Bolamtest”). TheBolamtest was confirmed by the House of Lords inBolitho v City and Hackney Health Authority[1998] AC 232(“theBolithocase”). The Court of Appeal inJames Khoo’s case also followed theBolithocase. 64        According to theBolamtest, a doctor or any other person professing some skill or competence is not negligent if he is acting in accordance with a practice accepted as proper by a reasonable body of medical men skilled in that particular art, merely because there is a body of opinion that takes a contrary view. Based on this test, the first defendant is to be judged by the standards of practice of fellow obstetricians and gynaecologists, not of those in other specialities or sub-specialities in the medical profession. McNair J (at 587 of theBolamcase) emphasised that the defendant must have acted in accordance with the practice accepted as proper by a responsible body of medical men. To echo Lord Browne-Wilkinson in theBolithocase (at 241–242) The use of these adjectives – responsible, reasonable and respectable – all show that the court has to be satisfied that the exponents of the body of opinion relied upon can demonstrate that such opinion has a logical basis. In particular in cases involving, as they often do, the weighing of risks against benefits, the judge before accepting a body of opinion as being responsible, reasonable or respectable, will need to be satisfied that, in forming their views, the experts have directed their minds to the question of comparative risks and benefits and have reached a defensible conclusion on the matter. 65        Only the first defendant called expert witnesses to testify to the standard of care expected of an obstetrician and gynaecologist. The plaintiffs did not call any experts to rebut or contradict the testimony of either Dr Yeo or Dr Chow. Granted that the court is not obliged to accept the opinion of the first defendant’s experts, merely because the plaintiffs failed to call comparable experts. However, using as my guideline the judgment of Lord Browne-Wilkinson, it seems to me that the common views expressed by the two experts certainly passed theBolamtest. Their opinions were responsible, reasonable, respectable (being culled from years of experience) and in forming their views, Dr Yeo and Dr Chow had directed their minds to the question of comparative risks and benefits and had reached a defensible conclusion on the issues in question. 66        I am reinforced in my view by an important fact. The first defendant’s management of the first plaintiff’s pregnancy on 30 October 2001 and 24 November 2001 was remarkably similar to Dr Lee’s own management of the first plaintiff’s pregnancy on 20 December 2001. To recapitulate, Dr Lee’s testimony was to the following effect:[11] (a)        In view of her age, he advised the first plaintiff that she had an increased risk of foetal abnormality as opposed to someone younger. (b)        He was more concerned about the growth of the foetus and placenta sufficiency. (c)        He did not advise the first plaintiff to go for diagnostic testing for foetal abnormality at that stage because she had informed him that the foetus was normal according to the result of her earlier foetal abnormality scan done at about 20 weeks. In fact, he did not even attempt to send her for such scanning. (d)        He did an ultrasound scan of the foetus to measure its growth. In their final submissions, the defendants pointed out that the first plaintiff never complained that Dr Lee’s management of her pregnancy was deficient. That being the case, it was corroborative of the defence that the first defendant’s management of her pregnancy was in accordance with the standard of care expected of obstetricians. 67        The medical experts, Dr Lee and the first defendant, were mindful of the provisions of s 4(1)(a) of the Act which states: No treatment for the termination of pregnancy shall be carried out if the pregnancy is of more than 24 weeks duration unless the treatment is immediately necessary to save the life or to prevent grave permanent injury to the physical or mental health of the pregnant woman. It was Dr Yeo’s testimony,[12]which was never challenged, that pre-test and mandatory counselling had to be given to patients who were recommended or who contemplated abortions, so that they could give their informed consent for the procedure to be carried out if so desired. Dr Yeo added that it was his practice to give his patients 48 hours’ grace period after two days’ counselling, to decide whether to go ahead with an abortion. 68        Mandatory counselling is a requirement under s 5 of the Termination of Pregnancy Regulations (Cap 324, Rg 1, 1999 Rev Ed) which relevant provisions state: (1)        Every authorised medical practitioner shall, except as provided in paragraph (2), provide a trained counsellor and facilities for counselling to such pregnant women who come to him for treatment to terminate their pregnancies as may be specified by conditions to the authorisation granted by the Minister under regulation 3. … (5)        The counselling referred to in paragraph (1) shall take such form, be conducted in such manner and in accordance with such criteria as shall be laid down in the conditions to an authorisation granted by the Minister under regulation 3 and shall be given to such pregnant women as may be directed by the Director of Medical Services.",
        "The findings": "69        I shall deal with the testimony of the witnesses of fact before going on to consider the expert evidence. I start with the testimony of the first plaintiff. 70        Contrary to the impression she gave, the first plaintiff was not thenaïvetéshe claimed to be. She came across as an intelligent woman, a view shared by all the doctors who attended to her and testified. I will cite a few instances where the first plaintiff’s testimony contradicted her self-projection. 71        It is a known fact (confirmed by Dr Yeo) that the maternal age of 35 years is normally used as a cut-off point by medical caregivers to offer routine prenatal diagnosis for Down’s syndrome. The admission form of the first plaintiff for the Chinese hospital stated her age as 35, a discount of ten years. I have no doubt that the first plaintiff deliberately lied about her age when asked by the attending staff. Contrary to her claim of being ignorant of Down’s syndrome babies before the birth of the second plaintiff, the first plaintiff knew enough to realise her risks of having such a baby. She brought down her age to a level where the Chinese hospital would not consider her at risk of having a Down’s baby and would not broach the topic. It bears remembering that the first plaintiff was a businesswoman at the material time. She had spent a year in England studying fashion and before she started her own business in Japan, she had worked in Taiwan and Hongkong as a fashion co-ordinator. This was not the background of an ignorant unsophisticated woman. 72        What was even more interesting was the first plaintiff’s professed ignorance of her last menstrual date prior to conceiving the second plaintiff. I am convinced that due to her past medical history, the first plaintiff knew the date but deliberately withheld it from the first defendant as well as Dr Lee. Why? By not telling the two doctors, the first plaintiff thought the stage of her pregnancy could not be determined with any certainty. Not knowing the correct gestation period meant the first plaintiff had some room to argue that she was not yet 24 weeks pregnant when she consulted the first defendant on 30 October 2001. 73        The purported vagueness of the first plaintiff on her last menstrual date was tied to her insistence (proved untrue by the first defendant’s appointment book) that the first defendant had postponed her first consultation from 23 to 30 October 2001. Her motive was to strengthen her case. As at 23 October 2001, the first plaintiff was 23 weeks and two days into her pregnancy (based on an undisputed delivery date of 15 February 2002). Had the FISH test been conducted on her then and the foetus found to be abnormal, she would have argued that she could still have aborted the baby. However, I find that possibility highly unlikely. There would have been insufficient time for the first defendant (who said he does not carry out abortion procedures) to have referred the first plaintiff to another obstetrician for an abortion to be performed within the 24-week timeframe, taking into consideration the mandatory counselling requirement and the time needed for an amniocentesis test result to be known. Moreover, the first defendant had testified that abortions in the 24th week of pregnancy were extremely rare and were usually carried out for therapeutic considerations. 74        The first plaintiff was untruthful when she claimed she was never warned by Dr Morisada of the risks of her carrying a Down’s child due to her age and, that amniocentesis on the foetus was never recommended to her. Her testimony was even more incredible in the light of the fact she had undergone a McDonald stitch operation under Dr Morisada and before consulting the first defendant, she had seen, besides Dr Zhu, a Japanese physician. 75        If the first plaintiff did not have an amniocentesis done before 30 October 2001, it was by deliberate choice. Here was a woman who got married at 44–45 years of age to someone ten years younger. Against all odds (20% chance only), she had conceived naturally. Furthermore, the foetus was a male. The first plaintiff must have been ecstatic over her good fortune. Having a son at her age would improve her standing with her in-laws, who had opposed her marriage to their son (according to Dr Lim Yun Chin) due to the significant age difference. Under those circumstances, it was highly unlikely that the first plaintiff would have considered an abortion. Further, she did not want to find out if the foetus suffered from chromosomal abnormalities. She hoped for the best having been apprised by Dr Morisada that the foetus was normal. However, if things did not turn out as well as she hoped, she would pin the blame on someone else. 76        Where it did not suit her purpose, the first plaintiff would deny what she had said to the first defendant and even to Dr Lee. While it can be said the first defendant would have a reason to lie, why would Dr Lee, who was the plaintiffs’ witness, want to fabricate any untruths? Why would he say it was the second pregnancy of the first plaintiff unless she had told him so? How else too would Dr Lee have known that the first plaintiff had undergone a foetal abnormality scan at 20 weeks (with Dr Morisada)? It was equally unlikely that the first defendant would have known this information, unless he was thus informed by the first plaintiff. What would the first defendant, Dr Lee and Dr Lim have to gain by fabricating a story of the first plaintiff’s wish to deliver her baby at an auspicious time and date? She was again untruthful when she denied she had requested the first defendant to deliver the second plaintiff at an unearthly hour on the first day of the Lunar New Year. The fact that the pregnancy was the second for the first plaintiff undermined her case that she was unaware of the risks associated with a first pregnancy. 77        The first defendant, on the other hand, came across as a truthful witness. He was neither evasive nor defensive when cross-examined. I preferred his version of what he had said to the first plaintiff and what she had told him during the two consultations because it was documented in his clinic notes[13]and in his subsequent medical reports to her counsel dated 4 June 2002 and 2 July 2002 respectively. 78        It was absurd of counsel for the plaintiffs to have suggested to the first defendant that because the latter had failed to offer foetal blood sampling to the first plaintiff, the first defendant had thereby failed to discharge his duty of care to her. It was the first defendant’s testimony (which was corroborated by Dr Yeo) that foetal blood sampling was not a routine test for chromosomal abnormalities. This test was more commonly used to screen other abnormalities such as thalassaemia and haemophilia. The standard test for diagnosing foetal abnormalities in October 2001 was cell culture and chromosomal study. This was the common evidence of Dr Yeo, Dr Chow and Dr Lee. I see no reason why I should not accept their testimonies. 79        The mere fact that the FISH test was available in October 2001 did not mean that the first defendant was negligent in not recommending the test to the first plaintiff or in failing to send her for the test. TheBolamtest does not state that a doctor’s failure to use the latest medical equipment and/or test means he has failed to meet the standard of care expected of him. It bears mentioning in this regard that Dr Lee himself was not familiar with the FISH test either in October 2001 or in September 2004 when he testified. 80        Dr Roger Quaife (“Dr Quaife”) was called by the plaintiffs to testify on the FISH test. He is a consultant geneticist with Parkway Laboratory Services Ltd. Dr Quaife said the FISH test had been available in Singapore since April 1999. However in October 2001, he agreed that the standard test in Singapore to detect foetal abnormalities was by way of cell culture. Dr Quaife believed that in October 2001, the results of a FISH test would have been available one to two days or perhaps two to three days after it was carried out. 81        As was pointed out in the defendants’ submissions, Dr Quaife is not an obstetrician and he could not, and indeed did not, offer expert testimony on the standard of care expected of an obstetrician. He himself candidly revealed that he could not comment on surgical procedures (including amniocentesis) or on other non-surgical procedures like ultrasound scanning, to detect foetal abnormalities. 82        Dr Chow had opined that the FISH test was a very new procedure in October 2001. It was possible that the 48-hour FISH test for detecting foetal chromosomal abnormalities might have been available in some laboratories then. However, unless a patient specifically asked for such a test, Dr Chow would not advise it, as the test was not comprehensive – it could only detect some and might miss out other chromosomal abnormalities. 83        The statistics for the number of FISH tests done at KK Hospital in the past four years seemed to bear out Dr Chow’s testimony. Dr Yeo had produced[14]the following statistics from KK Hospital of the number of cases that underwent the FISH test for prenatal diagnosis:  20010 case20023 cases20030 case20046 cases The nil figures for 2001 and 2003 and the small numbers for 2002 and 2004 show that the test has not been widely used by KK Hospital even though it delivers the highest number of babies in Singapore. Dr Yeo explained[15]that even if the FISH test picked up all the signs of Down’s syndrome, it would not detect one-third of the chromosomal abnormalities that were serious enough to be considered as birth defects. While he agreed that in theory the FISH test could be carried out in 24 hours, Dr Yeo said in practice it was three days, to which should be added another two days for the mandatory counselling required under the regulations to the Act, in the event a foetus was found to be abnormal and abortion was being considered. 84        Consequently, even if the FISH test had been offered by the first defendant and had been carried out for the first plaintiff on or just after 30 October 2001 and the results known within 24 hours, I find that the first plaintiff could not have considered abortion as an option. In the words of the first defendant,[16]any further invasive tests on his part would not alter the outcome of her pregnancy. 85        Whilst the other specialist (in genetic ultrasound scanning) called by the plaintiffs,vizDr C Anandakumar, is an obstetrician, the plaintiffs did not call him as an expert witness. He was a witness of fact who testified that foetal blood sampling was amongst the tests available in 2001 for foetal abnormalities. Dr Anandakumar’s testimony was of no assistance. 86        Counsel for the plaintiffs had relied on Prof Ajit Biswas’s article entitled “Screening for foetal chromosomal abnormalities” in his closing submissions. He said it was an agreed document and argued that it therefore formed part of the evidence. That statement is totally misconceived. Prof Biswas did not testify in court. The mere fact that his article was marked as “Agreed Bundle 19–20” and was referred to during the cross-examination of Dr Yeo did not mean it was agreed evidence before the court. An agreed document merely dispenses with formal proof by the maker, it does not mean that the contents of the agreed document form part of the evidence and need not be tested by cross-examination. 87        It was the plaintiffs’ case that the first defendant was advising the first plaintiff from the time she made the first telephone call to him from Japan. As such, the duty of care he owed her commenced from sometime in August 2001. That argument is untenable and has no basis at law. The first defendant did not owe the first plaintiff any duty of care, even if he had proffered her advice over the telephone, until she became his patient on 30 October 2001. It would place an onerous and unfair burden on medical practitioners and specialist alike, if the law was to decree that their duty of care to patients began even before the first consultation, and extended to cover telephone advice and/or opinions sought by callers who may not even become their patients later. 88        Further, contrary to the first plaintiff’s contention (and submission), there was also no duty on the part of the first defendant to schedule an appointment for her as soon as possible. It bears remembering that when she was pressed for the reason for such urgency, the first plaintiff had given an unconvincing reason – she wanted to be assured that the foetus was alright. That could not be true as Dr Morisada had already told her that the foetus was normal and that it was a male. If indeed the first plaintiff wanted an early appointment and the first defendant could not oblige, there was nothing to stop the first plaintiff from consulting another obstetrician who could have accommodated her. 89        Accordingly, I am of the view the first plaintiff has failed to make out her case of negligence against the first defendant. I find that he did discharge his duty of care to her in accordance with theBolamtest. The case ofYeo Peng Hock Henry v Pai Lily[2001] 4 SLR 571cited by the plaintiffs is not in point and has no relevance. The facts there were entirely different. 90        The first plaintiff had pleaded[17](see [51] above) that the first defendant’s lack of advice prevented her from exercising her option to abort the foetus in accordance with the laws of Singapore and Shanghai respectively. I have already found that on the evidence it was too late for the first plaintiff to have terminated her pregnancy lawfully in Singapore. 91        As for Shanghai, I have also dismissed the testimony of Mdm Chang as an expert on Chinese law. There was no evidence before the court of what the position would have been under Shanghai and/or Chinese law. Moreover, as was pointed out in the defendants’ closing submissions,[18]the first plaintiff had no connection whatsoever with Shanghai, apart from the fact that the husband was from Shanghai and she had been seen there by Dr Zhu. It was the first plaintiff’s own testimony[19]that she would not have continued her antenatal management in Shanghai because of the lack of hygiene and good facilities there. That evidence flies in the face of her pleadings that she would have risked having an abortion in her second trimester in that city. It would have been totally irresponsible and unethical of him, had the first defendant recommended the first plaintiff to have an abortion elsewhere when he told her that Singapore law could no longer permit it. A doctor in Singapore is not duty-bound to, and indeed should not, recommend treatment outside Singapore when Singapore law prohibits such treatment. 92        As it is my finding that the first defendant did not breach his duty of care to the first plaintiff, there is no necessity for me to consider the issue of contributory negligence on the part of the first plaintiff. As for the plaintiffs’ claim based on breach of contract and the allegations of breach of express as well as of implied duties, I am mindful of the fact that the Clinic refunded to the first plaintiff the delivery charges she had prepaid. If indeed there was a contract (which I do not agree) between the parties that the first defendant would deliver the first plaintiff’s baby, that contract was rescinded by mutual consent when the Clinic returned the first plaintiff’s payment. 93        If I am wrong in my finding and the first defendant did breach the duty of care which he owed to the first plaintiff, did that breach cause her loss? An abortion was out of the question in Singapore. It was highly unlikely on the facts, that the first plaintiff would have accepted the risk of undergoing an abortion in Shanghai, China. Consequently, the first plaintiff’s “loss”,vizthe loss of the opportunity to have an abortion, did not result from the first defendant’s breach, if there was a breach. 94        It is often said that doctors should not play god. By the same token, doctors should also not be easy targets for unmeritorious claims by disgruntled patients. Medical specialists should not be scapegoats and be made to pay for the sins of omission or commission of their patients, after they have discharged their duty of care to those patients.",
        "The second plaintiff’s claim": "95        In claiming damages for the pain and financial hardship endured by him as a result of being born,[20]the second plaintiff is making a wrongful life claim. 96        At common law, a disabled child has no cause of action for such a claim, (seeJackson & Powell onProfessional Negligence(Sweet & Maxwell, 5th Ed, 2002) at para 12-056). Such claims would be contrary to public policy as a violation of the sanctity of human life. The common law position has been adopted by the English, Canadian and Australian courts. One such English case cited by the defendants isMcKay v Essex Area Health Authority[1982] 1 QB 1166where the appellate court struck out the claim of a mother whose child was born disabled as a result of an infection of rubella (German measles) while the child was in her womb. The mother had sued the health authority and the doctor who had looked after her for allowing the child to be born alive. The doctor’s alleged negligence was in misleading the mother as to the advisability of an abortion and failing to inform or advise her of its desirability. 97        InBurton v Islington Health Authority[1992] QB 204, the English appellate court decided, after a careful review of English, Canadian and American cases that, at common law, a doctor owed a duty not to injure an unborn child but the doctor did not owe a duty to the foetus to advise its mother to have an abortion nor owe a duty to the foetus to terminate its life. 98        Even if there was a breach of duty on the part of the first defendant to the second plaintiff before the child was born, that breach did not cause the child to suffer from Down’s syndrome – the cause was genetic. 99        I am not aware of any local cases that have upheld a claim for wrongful life.",
        "Conclusion": "100      Consequently, I dismiss the claims of both plaintiffs with one set of costs to the defendants. [1]See D5.[2]V/N268.[3]V/N 228–229.[4]V/N 234–235.[5]1PB56 and 58.[6]V/N207.[7]V/N 187.[8]See exhibit D1.[9]See exhibit D2.[10]D7.[11]V/N 82–83.[12]At V/N 483–485.[13]D5.[14]In exhibit D6.[15]V/N 520.[16]V/N 615.[17]In para 14 of the Statement of Claim.[18]Para 86.[19]V/N 209.[20]See paras 13, 16 and 18 of the Re-amended Statement of Claim."
    }
}