{
    "case_title": "Lim Swee Khiang and Another v Borden Co (Pte) Ltd and Others",
    "ncitation": "[2005] SGHC 135",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1          This is an action by minority shareholders for relief against oppression. The plaintiffs complain that the defendants, apart from the first defendant, conducted the affairs of Borden Company (Private) Limited (“Borden”) in a manner which was oppressive to them or which disregarded their interests as members of Borden. 2          Borden was set up in 1960 to manufacture medicinal and pharmaceutical products. It has been successful and is now particularly well known for its medicated oil which is sold under the “Eagle” brand name (“Eagle oil”). Borden has an authorised and paid-up capital of $1m divided into 10,000 ordinary shares of $100 each. Originally, Borden had six promoters. Currently, only one promoter, Lim Kheng Puan, the tenth defendant in this action, is still involved in Borden. The other five have died and their shares have been passed on to their respective families and family-owned companies. 3          The second plaintiff in this action, C H Lim Pte Ltd, is a family company established by Mr Lim Seck Koon alias Lim Chee Hoon (“CH Lim”), one of the six original promoters. The first plaintiff, Mr Lim Swee Khiang (“SK Lim”), is the son of CH Lim. Together, the plaintiffs hold 2,700 shares in Borden and thus have a 27% interest in the company. 4          Moving to the defendants in this action, the first defendant is Borden itself. It was included as a formal defendant as one of the remedies sought by the plaintiffs is a winding up order against it. The persons named as the second defendants are Yeo Swee Tee and Tan Lak Tho as executors and trustees of the estate of Tommy Tan, deceased. Tommy Tan had been given a 20% share in Borden by his father, Tan Jim Lay, who was one of the original promoters. The third defendant, Tan Lak Tho, is the son of Tommy Tan and he stands to inherit his father’s shares in due course. At the moment, he holds only one share in Borden and that was transferred to him relatively recently by the fourth defendant. 5          The fourth defendant, Mdm Lim Kha Eng alias Mengalina Halim (“Mdm Halim”), is the widow of Chew Jin Sian, another of the original founders. He died in 1970 and left his 20% shareholding in Borden to his widow. Mdm Halim and Mr Chew had four children, three daughters and a son. The latter, Edy Chew alias Edy Hardijana Tjugito (“Edy Chew”) is an Indonesian who runs a company called PT Eagle Indo Pharma (“PT Eagle”) which is also in the business of producing medicated oil. The fifth defendant, Chew Joo Kiang Rachel (“Rachel Chew”), is one of Mdm Halim’s daughters. Another of her daughters, one Ruth Chew, is married to Yeo Siew Khoon (also known as “Richard Yeo”). 6          Yeo Boon Hong had a 15% share in Borden. His estate still holds some 975 shares in Borden. The seventh and eighth defendants are the sons of Yeo Boon Hong. Richard Yeo, the seventh defendant, holds 450 shares in Borden while his brother, Yeo Yong Kian alias Christopher Yeo (“Christopher Yeo”), the eighth defendant, holds 75 shares in Borden. The two brothers have also been jointly named as the sixth defendants in their capacity as the administrators and trustees of their father’s estate. 7          Wong Ng, another promoter, had a 12% share in Borden. On his death his 1,200 shares were transferred to his widow, Ong Kim Gek, the ninth defendant. 8          The tenth defendant, Lim Kheng Puan, is not related to the plaintiffs. He still holds 600 shares in Borden. 9          When this action was commenced in September 2002, the directors of Borden were Christopher Yeo (managing director), Rachel Chew (assistant managing director), Tan Lak Tho and SK Lim. Of these four, SK Lim was the only one who did not have executive powers. Mdm Halim, Mdm Ong Kim Gek and Lim Kheng Puan had formerly been directors but had stepped down from the board quite some time prior to the start of these proceedings.",
        "The proceedings": "10        These proceedings started life as an originating summons. The action was precipitated by the plaintiffs’ receipt of Borden’s notice of the annual general meeting to be held on 11 September 2002. Among the items on the agenda was the following: Mr Lim Swee Khiang being the longest serving director is due for retirement in accordance with Article 81 of the Company’s Articles of Association. A retiring director is eligible for re-election. The plaintiffs saw this as an attempt to remove SK Lim as a director and to deprive them of board representation. They therefore filed the originating summons on 9 September 2002 and immediately thereafter, made anex parteapplication for an injunction restraining the holding of the annual general meeting. On 10 September 2002, an injunction was granted restraining the defendants from convening the annual general meeting scheduled for 11 September 2002 and for convening or proceeding with any other meeting to retire or remove SK Lim as a director of Borden. This injunction is still in force. 11        In June 2004, the proceedings were converted into a writ action. The plaintiffs filed their Statement of Claim on 17 August 2004. Various allegations were made against the defendants, in particular Mdm Halim, and various reliefs were sought. Amongst these were that the defendants were to be restrained from convening or proceeding with any meeting to remove SK Lim as a director of Borden and that Borden be wound up on the ground that it was just and equitable to so order. As an alternative, the plaintiffs prayed that the second to tenth defendants be ordered to jointly and/or severally purchase all the plaintiffs’ shares in Borden at a price to be fixed by a valuer or by the court. 12        The trial started on 22 November 2004. On 29 November 2004, Mdm Halim applied to amend her Defence by adding an averment to the effect that a reasonable offer to purchase the plaintiffs’ shares had been made by the second to eighth defendants and the tenth defendant by their agreeing to the valuation of the plaintiffs’ shares by an independent third party. The plaintiffs’ refusal to agree to the same and their maintenance of the action was asserted to be an abuse of the process of the court. The other defendants, apart from the ninth defendant, made a similar application to amend their joint Defence. I granted both applications. I gave the plaintiffs leave to amend their Statement of Claim as well and they did so on 30 November 2004 by deleting the alternative prayer that asked the court to order the defendants to purchase the plaintiffs’ shares. 13        At the hearing, only SK Lim gave oral evidence on behalf of the plaintiffs. The plaintiffs’ expert witness, Mr Tay Swee Sze, who had been engaged to report on financial and accounting irregularities in Borden, was not called to the stand. The parties agreed to admit his report without cross-examination. At the close of the plaintiffs’ case, the defendants submitted that there was no case to answer. They elected not to call any witnesses on this basis. This submission and election were made by all defendants apart from Borden and the ninth defendant who took no part in the proceedings. For the purpose of the analysis, when I use the term “defendants” hereafter it shall mean all the defendants except Borden and the ninth defendant. 14        The Court of Appeal inBansal Hemant Govindprasad v Central Bank of India[2003] 2 SLR 33held that a submission of no case to answer could succeed if either the plaintiff’s evidence at face value did not establish a case in law or the evidence led by the plaintiff was so unsatisfactory or unreliable that his burden of proof had not been discharged. The defendants in the present case said that both limbs set out by the Court of Appeal had been satisfied. They are convinced that the evidence adduced by the plaintiffs, even when taken at face value, did not establish a case of oppression. Further, in their view, the evidence led by the plaintiffs was so unsatisfactory and unreliable that they failed to discharge the burden of proof. The first matter to be dealt with therefore is to determine what case the plaintiffs here were trying to establish. Then the evidence adduced can be examined so as to see either whether it is sufficient to establish the case in law or whether it is unsatisfactory or unreliable to such an extent that the plaintiffs have failed to discharge their burden of proof.",
        "The Statement of Claim": "15        The Statement of Claim is fairly long and contains many averments in relation to allegedly oppressive conduct on the part of the defendants. In their closing submissions, however, the plaintiffs pursued only some of these averments. Therefore, I need only to refer to some portions of the Statement of Claim. 16        First, in para 9, it was alleged that the intention from the beginning was that the families of the original promoters would be represented on Borden’s board of directors. 17        In para 10 it was alleged that the defendants, as majority shareholders of Borden, conducted Borden’s affairs in a manner oppressive to the plaintiffs and in disregard of the plaintiffs’ interests as shareholders. Further, Tan Lak Tho, Rachel Chew and Christopher Yeo had exercised their powers as directors of Borden in a manner which was oppressive and disregarded the interests of the plaintiffs. Particulars of this allegation were contained in paras 11 to 14. Basically, these paragraphs stated that Borden had licensed PT Eagle to manufacture Eagle oil in Indonesia but that PT Eagle had stopped paying royalties to Borden for that licence and the defendants had not caused Borden to take any action to recover such royalties. Also, the defendants had worked closely with PT Eagle and had a close business relationship with Edy Chew and, in the course of such relationship, had allowed him to wrongfully use Borden’s resources and reputation to carry on and develop business for PT Eagle to Borden’s detriment. 18        In para 17, it was averred that the defendants had caused loss to the plaintiffs and/or to Borden itself by manipulating or otherwise allowing Borden’s affairs to be manipulated for their own benefit. Many sub-paragraphs set out various connections between the defendants and PT Eagle. In particular, there was an averment that Mdm Halim was a shareholder of PT Eagle and held the office of commissioner of that company. The defendants were said to have caused Borden to settle legal proceedings that it had taken against PT Eagle in Malaysia by paying PT Eagle the sum of US$900,000. Richard Yeo was said to have been running his other businesses from Borden and also assisting in the business of PT Eagle. There were also allegations that irregular payments had been made to various directors of Borden. 19        In para 17.12, it was alleged that Mdm Lim, together with the members of the Chew and Yeo families, sought to align the interests of Tan Lak Tho with the interests of those families so as to be able to control Borden’s affairs. In 1999, she had sued Tan Lak Tho in respect of an unauthorised bonus but subsequently she had settled the action and transferred one of her shares to Tan Lak Tho so that he could qualify to become a director of Borden. 20        The defendants were also alleged to have acted against the interests of Borden by failing or refusing to terminate the licence given to PT Eagle by Borden, by failing to take any action in respect of PT Eagle’s direct competition with Borden in Singapore and Vietnam, and by deciding to stop Borden’s intended legal proceedings in the United Arab Emirates (“UAE”) and Yemen in respect of certain trade mark actions taken by PT Eagle. 21        It was alleged in para 18 that the defendants had used their powers as directors and shareholders to try and oust the plaintiffs from Borden and keep them out of the management of Borden’s business. In this connection, SK Lim’s rights as a director had been curtailed and his involvement in the affairs of Borden had been restricted. He had also been wrongfully removed as an executive director.",
        "Analysis of the plaintiffs’ complaints": "22        It was apparent from the evidence that much of the plaintiffs’ dissatisfaction with the way that the affairs of Borden had been conducted stemmed from the parties’ relationship with PT Eagle and the various business initiatives that PT Eagle had undertaken under the leadership of Edy Chew. It is therefore necessary to give a brief account of the background to these complaints before considering whether the actual complaints have been made out. 23        In 1960, Borden bought the proprietary rights for the trade mark depicting an eagle device, the words “EAGLE BRAND” in English and Chinese, and the words “CHAP LANG”, and also the right to manufacture products under this trade mark. Sometime thereafter, PT Eagle was set up. In February 1975, Borden, using a letterhead bearing its registered business name, “Wilhelm Hauffmann & Company”, wrote to the Ministry of Health, Jakarta, stating that PT Eagle was authorised to use the name of Wilhelm Hauffmann & Company as it was licensed by Borden “to manufacture Eagle Brand medicated products”. Subsequently, it was decided that Borden’s business in Indonesia would be carried out through PT Eagle and a resolution was passed authorising Edy Chew to take any legal action necessary to protect and defend the “Eagle Brand” trade mark in Indonesia. Thereafter, Eagle oil was manufactured for the Indonesian market in PT Eagle’s factory in Indonesia. The plaintiffs accepted that PT Eagle had been authorised by Borden to use its trade mark in Indonesia. 24        In the 1980s, PT Eagle began selling Eagle oil in the Malaysian market. The trade mark in Malaysia was, however, owned by Borden. At that stage, no objection was taken to PT Eagle’s actions as the relationship between the directors of Borden and Edy Chew was good. Indeed, Edy Chew was general manager of Borden for two years between 1995 and 1997. According to SK Lim, Edy Chew left Borden after a disagreement with CH Lim which arose when Edy Chew tried to reduce Borden’s production capacity. Thereafter the relationship with Edy Chew deteriorated. 25        In September 1999, Borden complained to the Malaysian Ministry of Health that PT Eagle was infringing its trade mark in Malaysia. PT Eagle retaliated by filing an originating motion in the High Court in Kuala Lumpur in November 1999 (“the Malaysian proceedings”) to obtain a cancellation of Borden’s trade mark in Malaysia on the basis that the same had not been used for more than three years. In July 2000, PT Eagle’s action was dismissed for procedural reasons but it filed an appeal. Before the appeal was heard, Borden settled the dispute with PT Eagle by paying it the sum of US$900,000. 26        According to SK Lim, while the fight over the Malaysian market was taking place, PT Eagle also began exporting Eagle oil to Vietnam and the US and took action to register the trademark under its name in the UAE and Yemen. Borden, however, did not take any steps to stop the import of PT Eagle’s products in Vietnam and after SK Lim was removed as executive director of Borden, the board brought to a halt steps initiated by him to register Borden’s trademark in UAE and Yemen.",
        "Conflict of interest": "27        In the view of the plaintiffs, the issue of Mdm Halim’s conflict of interest was crucial to the tussle between PT Eagle and Borden. In this connection, I have to decide whether there was a conflict of interest. 28        In September 2000, the directors of Borden were Lim Kheng Puan (the tenth defendant), SK Lim, Mdm Halim and Mdm Ong Kim Gek (the ninth defendant). Following a request from Mr Tan Lak Tho, in his capacity as shareholder, to look into the issue of whether there was any breach of duty or abuse of power on the part of Mdm Halim as she had an interest in PT Eagle and was also the mother of its managing director, Mr Edy Chew, the board meeting of 20 September 2000 considered this issue. Prior to the meeting, Borden procured some investigations of PT Eagle to be undertaken. The report on these investigations was produced to the meeting. According to Indonesian solicitors, when PT Eagle was established in 1973, the founding shareholders were Mdm Halim and Edy Chew who held the posts of commissioner and director respectively. Subsequently Mdm Halim sold her shares to Edy Chew so that the latter became the sole shareholder of PT Eagle. Having considered this report, the board noted that Mdm Halim had never been a director of PT Eagle and was no longer a shareholder in that company. Based on those results, the then directors declared that there was no breach of duty by Mdm Halim of her fiduciary duties owed to Borden. 29        Sometime later, SK Lim instructed Borden’s solicitors, M/s Drew & Napier, to carry out further investigations into the conflict of interest issue. At that time, Borden had only two directors,vizSK Lim and Mdm Halim. Drew & Napier carried out these investigations via a different firm of Indonesian attorneys from those who had originally acted. In September 2001, about a year after the first report was given, the new Indonesian solicitors advised that their searches showed that Mdm Halim had been commissioner of the company since its formation and still retained this position. She was also named as one of the founding shareholders. The directors of PT Eagle since 1991 had been Edy Chew and one Dra Denty Tanud. The solicitors also advised that, under Indonesian law, the board of commissioners must supervise the policies of, and give advice to, the directors in connection with the management of the company. The board of commissioners was a non-executive body and neither the board nor an individual commissioner had authority to represent or bind the company. A commissioner had an obligation to disclose to the company any interest held by him or members of his family in the company or in other companies. 30        At an extraordinary general meeting of Borden held on 9 November 2001 (“the 2001 EOGM”), the meeting was informed by Ms Yvonne Tang from Drew & Napier that a recent search done on PT Eagle had shown that Mdm Halim was still a commissioner of that company. Ms Tang stated that there was a conflict of interest as PT Eagle was in direct competition with Borden. This issue was raised again by SK Lim at the board meeting held on 28 January 2002. Christopher Yeo considered that the two searches done by the Indonesian lawyers were inconsistent and asked SK Lim whether he was willing to accept a letter dated 25 January 2002 from Mdm Halim’s lawyers that stated that Mdm Halim had ceased to be commissioner and shareholder of PT Eagle for some time and, although she could not recall exactly when she resigned from the position of commissioner, she had not done any act in relation to PT Eagle since the early 1990s. Mr Yeo was satisfied with this letter and was not willing to pursue the matter further. Mr SK Lim reserved his position. Mr Tan Lak Tho, who was also present at the meeting, did not express any opinion. Mdm Halim was present via a proxy who did not contribute to the debate. 31        The plaintiffs argued that Mdm Halim was in a position of conflict as she was not only a shareholder in PT Eagle but had been and continued to be the commissioner of PT Eagle. As such she had the role of supervising and advising the directors on the management of PT Eagle. It was also asserted that Mdm Halim, in breach of her duty to disclose this conflict of interest to the other directors of Borden had failed, refused or neglected to do so and had further exerted her influence in Borden through Rachel Chew and Richard Yeo. 32        The plaintiffs submitted that Mdm Halim’s defence on the issue of conflict of interest was nothing more than a sham. She had been evasive and this behaviour was consistent with her earlier conduct when her solicitors stated that she disagreed with many points raised by the plaintiffs in their correspondence and reserved her rights to fully rebut the same at the appropriate time but did not go on to give details of her rebuttal or her disagreement. Mdm Halim had never rebutted the charge and had snubbed the opportunity to give her explanation at the trial by electing not to adduce evidence. The plaintiffs further submitted that in the absence of any explanation to the contrary, the only reasonable conclusion was that Mdm Halim was at all material times in a position of conflict of interest. 33        It is common ground that Mdm Halim was the commissioner of PT Eagle from its foundation. In my opinion, there is no evidence as to when, if at all, Mdm Halim relinquished that post. She asserted through her solicitors, as early as August 2000, that she had ceased to be a commissioner “some time ago”. She did not, however, come to court and testify how she had resigned and what “some time ago” meant. Nor did she give any explanation as to why the searches did not indicate her resignation. In these circumstances and in the face of the two sets of searches that show Mdm Halim’s initial appointment as commissioner and do not indicate any change in that position, I think I have to proceed on the basis that at all material times, she did hold that position. 34        The question is whether by reason of being commissioner of PT Eagle she was, during the years that she was also a director of Borden, in a conflict of interest position. There is no law that prevents a shareholder of one company from being also a shareholder of a competitor. A shareholder does not owe anyone any duty not to own shares in competing companies. In her capacity as shareholder, Mdm Halim was not in a position of conflict of interest. The law allows a person to be a director of many companies simultaneously. If, however, some of those companies are in competition with each other, then such a person may find himself often, if not continually, in a position of conflict of interest. Such conflicts must be disclosed. Mdm Halim was, however, not a director but a commissioner. The plaintiffs, having asserted that the holding of this position put her in a conflict situation, had to establish that fact. Their evidence on this was equivocal. All they had was a letter from the Indonesian attorneys dated 17 September 2001 that gave some general information on the respective roles of the board of directors and the board of commissioners in the management of an Indonesian company. It said that the board of commissioners had to supervise policies of the directors but that this board was a non-executive body. It also stated that the traditional view of Indonesian law was that directors, as the executive managers of the company, were more responsible and accountable than were the commissioners for the conduct of the company’s business and affairs. I gather from this that a commissioner plays no direct role in the management of the company but has powers of supervision of the directors if he or she chooses to exercise the same. Whether or not a conflict situation would arise therefrom, would depend on how actively involved in supervision any particular commissioner was. 35        In this case, the plaintiffs did not identify any particular act that Mdm Halim did, whether as director of Borden or as commissioner of PT Eagle, that put her in a position of conflict of interest or arose from a conflict of interest position. In para 17.4 of the Statement of Claim, the plaintiffs had complained of the action commenced by PT Eagle “under the directorship of the 4thDefendant” in Malaysia. As Mr Alvin Tan, counsel for Mdm Halim submitted, this appeared to be a misstatement as Mdm Halim was never alleged to be a director of PT Eagle. Further, given the supervisory and advisory role of the board of commissioners, Mdm Halim could not be assumed to have been involved in the commencement of the Malaysian action by PT Eagle. No evidence was given as to the way in which, if any, she was involved on behalf of PT Eagle in relation to either the Malaysian proceedings or any sale of Eagle oil in Malaysia. In any event, it was not alleged that she had carried out, or failed to carry out, any act as director of Borden in this context. By the time the Malaysian action was settled in February 2004, Mdm Halim had been off the board for nearly two years. Any conflict of interest that she had in relation to the Malaysian action would have ended, at the latest, when she left Borden’s board. 36        The plaintiffs have not established that Mdm Halim was in a position of conflict of interest in relation to PT Eagle’s activities in Malaysia. The plaintiffs made several allegations in relation to the circumstances in which SK Lim ceased to be an executive director of Borden. Those allegations were put under the rubric of “conflict of interest”. I do not see how they fit in there. I will consider them later when I consider why SK Lim’s executive powers were lost. 37The plaintiffs also submitted that there was clear evidence to show that Richard Yeo was in a position of conflict. The evidence they relied on was that he was a shareholder in three other companies in which Edy Chew held shares namely, Eagle Indo Land (Pte) Ltd, Eagle Indo Holdings Pte Ltd and Eagle Indo (Pte) Ltd. Mr Lok, on behalf of the plaintiffs, said that although these companies may not be in direct competition with Borden, Edy Chew was Borden’s main competitor and Richard Yeo, by 9 November 2001 and until 28 January 2002, was the only person having executive powers in Borden. The fact that the defendants would rather have Richard Yeo, and not SK Lim, hold executive powers, although the former was clearly in association with Edy Chew, underlined the fact that they were acting in bad faith in removing executive powers from SK Lim. In my judgment, this last sentence shows that the plaintiffs’ real complaint in relation to Richard Yeo is not a complaint of conflict of interest but a complaint of acting oppressively to prefer the interests of the majority at the expense of the interests of the minority. I will consider that later. I find that the plaintiffs have not established that Richard Yeo was in a position of conflict of interest as no conflict could arise simply from his holding shares in companies that did not compete with Borden even though Edy Chew, the mainstay of PT Eagle, also had an interest in those companies.",
        "Removal of SK Lim’s executive powers": "38        The plaintiffs alleged that the defendants deliberately stripped SK Lim of executive powers because he wanted to take action to terminate the licence that Borden had given PT Eagle to manufacture the products in Indonesia. They point out that on 5 October 2001, Drew & Napier had reiterated its earlier advice that the licence agreement with PT Eagle “should be terminated without further delay”. Barely two weeks later, Mdm Halim made a requisition for an extraordinary general meeting to be held to pass a resolution that “all members of the board of directors not hold executive positions in the company and that the General Manager of the Company report directly to the board of directors”. This requisition had resulted in the 2001 EOGM. Mr Lok submitted that this motion was targeted at only one person,vizSK Lim. There were no other executive directors in the company, and the motion, if passed, would put a stop to all other investigations into Mdm Halim’s conflict of interest. 39        SK Lim’s reaction was to propose that the 2001 EOGM also discuss and resolve on the course of action that should be taken by Borden in response to the parallel import of the products by PT Eagle. At the meeting itself, he asked that this item be discussed first. The other shareholders present rejected the request and instead proceeded to vote on Mdm Halim’s motion. They all supported it and it was passed. The plaintiffs alleged that the defendants had thus succeeded in preventing SK Lim from having any say in the conduct and management of Borden. Mr Lok submitted that this vote was exercised in bad faith. There was no reason for Mdm Halim to propose such a motion. While she was not herself present at the meeting, her supporters, the other defendants, apparently understood her reasons for wanting SK Lim removed and proceeded to do her bidding. According to the plaintiffs, the enormity of this action became clear when, just over two months later, on 28 January 2002, Christopher Yeo was appointed as managing director having executive powers. It should be noted that SK Lim remained a director, a position that he still holds, but that he no longer has any executive powers. 40        The plaintiffs’ main ground for contending that bad faith motivated the defendants’ adoption of the motion proposed by Mdm Halim was that this was a deliberate move to prevent SK Lim from continuing his investigations into her position of conflict of interest and, further, to prevent him from terminating PT Eagle’s licence. They pointed out that the requisition for the 2001 EOGM was made on 19 October 2001, two weeks after Drew & Napier advised by their letter of 5 October 2001 that the PT Eagle licence should be terminated, and therefore that one event had triggered the other. This allegation implies that the defendants knew of the advice. The evidence on this is, however, equivocal. 41        SK Lim’s evidence was that he was concerned about keeping these investigations into Mdm Halim’s position and PT Eagle confidential. He therefore arranged for Drew & Napier to send its advice to him by fax transmission to his private fax number at home. Both Drew & Napier’s letter of 28 September 2001, stating that a director who assumed the role of a commissioner for a competing company would have a conflict of interest with the company that she was director of, and their subsequent letter of 5 October 2001 were sent to him in this way. Under cross-examination, however, he stated that he was 70% to 80% convinced that the defendants had had access to the letters because three or four days after receiving these faxes, he had taken them to the office and had had them filed by the staff.  Thereafter, Richard Yeo, as general manager of Borden, could have had access to them. This was because the files were kept in the general office in a locked cabinet to which two staff members had the keys and he and Richard Yeo were the persons authorised to see the files in the cabinet. Mr Lok submitted that these letters would have been accessible to Richard Yeo by around 9 October 2001 and that he could then have alerted Mdm Halim and her supporters regarding the investigations and SK Lim’s intentions. 42        There was no direct evidence that Richard Yeo or Mdm Halim or any other defendant had seen either letter from Drew & Napier. No employee of Borden testified that the letters had indeed been in the cabinet. SK Lim was speculating when he testified that Richard Yeo must have seen the letters and advised Mdm Halim of their contents. It also seems odd to me that having taken the trouble to have the letters directed to his private fax number so that no one else would know about the investigations, he would then be so cavalier as to pass them to Borden’s employees to file in a place to which he knew Richard Yeo had easy access. His evidence on this point was not credible. I find therefore that the plaintiffs have not proved that the requisition was prompted by the advice given on Mdm Halim’s position or on the termination of the licence. Further, as the defendants had no knowledge of the continuing investigations and, from their point of view, the allegation of Mdm Halim’s conflict had been laid to rest in 2000, they would seem to have had no reason to conspire in October 2001 to remove SK Lim. 43        Whilst in their submissions the plaintiffs pointed to the requisition as evidence of a conspiracy, at the time it was served, SK Lim did not take that view of it. After he received it, his solicitors wrote to Borden’s company solicitors to raise various objections to the notice of the 2001 EOGM. No allegation was made in that letter that the EOGM had been prompted by SK Lim’s investigations. Instead, his solicitors stated that if Mdm Halim wanted to proceed with her resolution that directors should not be executive officers, SK Lim wanted that resolution expanded so as to prevent any person who was in any way related to the directors of Borden from holding the position of general manager. His solicitors also wrote to Mdm Halim’s solicitors in similar terms. It appears that at that time, SK Lim was prepared to step down if Richard Yeo also stepped down as general manager. He must have known that stepping down would adversely affect his ability to proceed further with his investigations and yet SK Lim did not cite this as the cause of the requisition. At the meeting itself, no allegation was made by SK Lim as to the unjustifiable reasons for the proposed resolution. It would appear that the conspiracy allegation was something that arose only long after the event. 44        Of course, even without knowing that SK Lim was carrying out private investigations into her position, Mdm Halim could have wanted to strip him of his executive powers for sinister reasons. One such alleged reason was found in para 15 of SK Lim’s Affidavit of Evidence-in-Chief filed on 16 July 2003. There he claimed that the plaintiffs were carrying out investigations into irregularities in the affairs of Borden as well as into PT Eagle. He said: During my time as an executive director, I assisted Lim Kheng Puan and Tan Lak Tho in the day to day management of the Company’s affairs. It was then that I discovered certain irregularities in the way that the Company’s business was being conducted. I also found out that PT Eagle was competing with the Company’s business and that some of the directors and shareholders of the Company had an interest in PT Eagle. I tried to investigate and rectify some of these situations. However, my attempts were impeded by the other directors and the majority shareholders and I was removed as an executive director. 45        As the defendants submitted, under cross-examination it became clear that these “discoveries” and “investigations” were fabricated. When SK Lim was asked to list the irregularities which he had discovered, he listed the following: (a)        Tan Lak Tho’s unauthorised bonus of $250,000; (b)        the salary increments and bonuses of Lim Kheng Puan in 1997; (c)        the salary increments and bonuses of Christopher Yeo in 1997; and (d)        the losses sustained by Borden from its sales to Po Wah Trading Company (“Po Wah”). From further cross-examination, it appeared that SK Lim had learnt about the unauthorised bonus given to Tan Lak Tho from a report dated 24 November 2000 produced by an accountant engaged by Mdm Halim. This report also mentioned the outstanding amounts due from Po Wah. Thirdly, the report commented on salaries and bonuses given to Christopher Yeo and Lim Kheng Puan but in relation to the years 1998 and 1999. It is clear therefore that SK Lim did not discover item (a) above from his own efforts as his affidavit suggested. Further, he admitted that Christopher Yeo had told him in early 2000 of Po Wah’s debts and it was not something that was hidden from him. As regards the salary and bonus of Lim Kheng Puan, SK Lim admitted that these had been approved at an extraordinary general meeting of Borden on 28 September 1998. As regards the salary of Christopher Yeo, SK Lim was shown documents indicating that a sum of $70,600 had been refunded by Christopher Yeo to Borden on 8 May 2000 after the plaintiffs had on 4 May 2000, through their solicitors, indicated their objections to the overpayment. 46        When SK Lim was asked which of the alleged irregularities he had tried to investigate, he replied that it had only been the Po Wah debt. He then admitted that he took action on this issue only after being pressed to do so by Mdm Halim. This is also clear from the minutes of the directors’ meeting on 5 October 2001. One of the purposes of this meeting was to go through queries that Mdm Halim had raised, one of which was with regards to the Po Wah debt. As a follow-up, in November 2001, SK Lim told the shareholders that Borden’s solicitors were, at his request, seeking advice from lawyers in Vietnam on the possibility of recovering this debt. 47        I am satisfied on the evidence that there were, as such, no investigations into any irregularities in Borden’s business being conducted by SK Lim at the time he ceased to be an executive director. 48        SK Lim’s further assertion in his para 15 that “I also found out that … some of the directors and shareholders of the Company had an interest in PT Eagle” was not accurate in that this discovery was not something that he made during the time he was executive director of Borden. He was appointed an executive director in 1999. He had known Edy Chew since he was a teenager and he knew that Edy Chew was running PT Eagle before Edy Chew became general manager of Borden in 1995. He knew way before 1999 of Edy Chew’s relationship with Mdm Halim and given that the relationships amongst the various families went back many decades, he must also have known of Richard Yeo’s connection with the Chews for a long time. 49        In the same paragraph of his affidavit, SK Lim had said that he had found out about the way in which PT Eagle was competing with Borden and that this was one of the things that he was trying to investigate and rectify. It appeared from the evidence that the only investigations that he carried out were searches to try and ascertain whether Mdm Halim was still a commissioner and shareholder of PT Eagle. His reason for initiating these was that the competition from PT Eagle had become more serious. When he was asked why he did not do anything to address the problem directly rather than to simply carry out searches, he responded that he was advised in late 2000 that Borden had authorised PT Eagle to produce Eagle oil and therefore Borden could not do anything. When he was asked why he did not do anything to end the authorisation by calling a shareholders’ meeting to discuss the issue, his response was that he was too busy with other issues. SK Lim had acknowledged that the solution to the problem which he claimed was facing Borden was to terminate the authority given to PT Eagle. Yet, rather than take direct steps to end this authority, he conducted searches on its corporate records in order to find out whether Mdm Halim was still a shareholder and commissioner. Such searches would not, in any case, have resolved this issue. His claim that he was too busy to call a shareholders’ meeting to address this issue from the end of 2000 up to the time when he ceased being executive director in November 2001 does not bear scrutiny. If competition from PT Eagle was a serious problem to Borden then dealing with it had to be given priority and there could be no question of being too busy to call a shareholders’ meeting to discuss termination of the licence. On the evidence, it appears to me that the complaints made by SK Lim in para 15 were specious and contrived.",
        "The defendants’ refusal to terminate the licence": "50        The plaintiffs alleged that the defendants had refused to terminate PT Eagle’s licence and stem PT Eagle’s penetration into Borden’s markets and that this conduct was oppressive. This submission was based on the following facts. 51        At the 2001 EOGM, a unanimous resolution was passed that the licence granted to PT Eagle to manufacture Eagle oil be terminated with immediate effect. The plaintiffs complained that the actions taken immediately after the 2001 EOGM had nothing to do with terminating the licence. Instead, on 13 November 2001, Richard Yeo sent a letter to SK Lim’s solicitors stating that SK Lim had been re-designated as a non-executive director and should hand over the “necessary documents” of Borden as soon as possible. Further, the locks to the office were changed immediately so that SK Lim could no longer have access to the office. Also, SK Lim asserted, the staff were warned not to speak with him. SK Lim said that he was treated henceforth as if he was not a director but an outsider. 52        On 7 December 2001, the second plaintiff sent Borden a letter asking whether Borden had taken any steps to follow up on the issue of Mdm Halim’s position as commissioner of PT Eagle and on the termination of the licence. No response to this letter was received so a chaser was sent on 26 December 2001. Another chaser was sent on 16 January 2002. Again, there was no response. So at a board meeting on 28 January 2002, SK Lim asked whether the licence to PT Eagle had been terminated. Christopher Yeo replied that he had consulted Drew & Napier on whether there was any contractual agreement between Borden and PT Eagle and had received a negative reply. He had then asked Drew & Napier how the licence could be terminated if the contract was non-existent. Christopher Yeo also commented that the letter sent by Mr Yeo Boon Hong to PT Eagle regarding the licence did not constitute a legal agreement. The plaintiffs submitted that this response from Christopher Yeo was self-serving and dishonest as the licence in 1975 had been granted by his father, Mr Yeo Boon Hong. There was no basis for Christopher Yeo to say that the licence had no legal effect. Further, on what basis was Christopher Yeo competent to contradict the advice of Drew & Napier? 53        The plaintiffs further submitted that the position of the defendants was that they denied the existence of a licence and that since there was no written document showing the licence, nothing could be done. The plaintiffs considered this position to be misleading and misconceived. Just because the defendants were unable to point to any specific document which showed the licence and its terms did not mean that one did not exist. In any case, if the defendants truly believed that there was no licence, why were no steps being taken against PT Eagle for infringing Borden’s trade mark in other countries? If Christopher Yeo had taken the stand he would have been asked whether he sought Drew &Napier’s advice on how to terminate the licence and, if so, which lawyer had given such advice. He would also have been asked whether the advice was in writing and, if not, why not, especially if the subsequent advice contradicted earlier advice given by them. Instead, Christopher Yeo had chosen to evade being asked these questions by electing not to testify. The plaintiffs invited the court to draw adverse inferences from the refusal of Richard and Christopher Yeo to testify. 54        The plaintiffs alleged that in contrast to their reluctance to take action to terminate the licence, the defendants were busy taking steps that were against the interests of Borden. Two meetings were held at Drew & Napier’s office on 20 November 2001, 11 days after the 2001 EOGM. Both were attended by Richard Yeo, Christopher Yeo and Tan Lak Tho as representatives of Borden. The plaintiffs submitted that what happened at those meetings could be gathered from letters that Drew & Napier wrote to Borden shortly thereafter. 55        At the first meeting, Drew & Napier was instructed that no further work was required in relation to Originating Summons No 1759 of 1999 because Tan Lak Tho had agreed to return his bonus of $250,000 to Borden and in return Mdm Halim had agreed to withdraw this originating summons that she had taken out against Borden. They were instructed that no further work was to be done in relation to the advice on whether Mdm Halim was acting in conflict of interest as a director of Borden. The second meeting was with the intellectual property department of Drew & Napier. At this meeting the firm was instructed that Borden did not wish to proceed with its trade mark oppositions filed in the UAE and Yemen. The lawyers were also told that Borden’s management would revert with instructions within a few weeks whether the licence between Borden and PT Eagle was to be terminated. The plaintiffs pointed out that Drew & Napier’s letter gave no indication that they had been asked to advise how to terminate a licence that was not in writing. They submitted that Christopher Yeo had lied to the directors’ meeting in January 2002 when he said that this advice had been asked for. 56        In the plaintiffs’ view, the decision not to proceed with the trade mark oppositions was inconsistent with the minutes of the meeting of 27 December 2001 where Christopher Yeo stated that he would “relook into the matter and report on any findings in due course”. Tan Lak Tho concurred with this decision and Rachel Chew did not express an opinion. The new management had withdrawn the instructions given by SK Lim to Drew & Napier in October 2001 to oppose PT Eagle’s application to register the Eagle brand trade mark in the UAE and Yemen. 57        A further discussion on this trade mark matter took place at the directors’ meeting held on 27 December 2001. At this meeting, it was recorded that Drew & Napier’s associates in UAE and Yemen had indicated that Borden had a 50% chance of succeeding in its opposition to PT Eagle’s application to register these trade marks. Drew & Napier had also advised that steps should nonetheless be taken to oppose those applications if the plaintiffs wanted to protect the market in the UAE and Yemen. The meeting noted that the application deadlines had expired and that it had been the responsibility of SK Lim to look into the matter since he had been executive director at the material time. 58        The plaintiffs submitted that contrary to what had been stated in the minutes, SK Lim had fulfilled his duty in relation to the trade mark oppositions and that the same had only been abandoned on the instructions of the defendants. The correspondence from Drew & Napier showed that the deadline for filing the objections was 31 October 2001 and that SK Lim had instructed Drew & Napier to proceed with the objections on 23 October 2001. Drew & Napier had acknowledged these instructions and reported that their associates would proceed with filing the necessary objections. The objections were only abandoned after the new management met Drew & Napier on 21 November 2001 and gave instructions to this effect. It was therefore dishonest of Christopher Yeo to state on 27 December 2001 that he would relook into the matter and for the defendants to imply that SK Lim had allowed the deadlines to expire. 59        The defendants questioned the sincerity of the plaintiffs’ complaints in this regard. They pointed out that although the 2001 EOGM had passed the resolution to terminate the licence given to PT Eagle, SK Lim had not raised this matter again at the directors’ meeting held on 7 January 2002 nor subsequently right up till June 2002 when the present action was commenced. As regards the UAE and Yemen trade mark oppositions, although SK Lim had asked for an update at the 7 January 2002 meeting, the defendants considered this a marginal issue since Borden had never sold any Eagle oil in Yemen and UAE as SK Lim well knew. It therefore could not be correct to contend that the “new management” had ceded markets in these territories to PT Eagle. The defendants suggested that these issues ought to be dealt with under s 216A of the Companies Act (Cap 50, 1994 Rev Ed) rather than s 216 as the plaintiffs had done. 60        On the issues of the termination of the licence and the trade mark oppositions in the Middle East, it appears to me that there was a fundamental difference in philosophy between the plaintiffs and the defendants. The defendants seemed to view PT Eagle’s aggressive marketing of Eagle oil with some degree of complacency as long as PT Eagle did not bring the product into Singapore. The plaintiffs, on the other hand, regarded PT Eagle’s actions as being in excess of the latter’s authority and, ultimately, detrimental to Borden’s interests and business as PT Eagle’s actions would curtail expansion by Borden into new markets. The court, in dealing with allegations of oppression, must not second-guess management decisions. On the other hand, however, where the shareholders have indicated their decision to take certain action, the management should follow through or explain why it has not. In this case, no proper explanation was given for the failure to carry through the resolution to terminate PT Eagle’s licence. There was no explanation, also, for the actions taken in regard to the trade mark oppositions except for the reference to the lawyers’ view that the chances of successfully opposing PT Eagle’s trade mark applications were slim. Since, however, the costs of persisting with the oppositions were low, there would seem to have been little reason to abandon them. The defendants did not give any fuller explanation for the new management’s instructions to Drew & Napier in October 2001. Failure to explain cannot, however, in itself be oppressive.",
        "Settlement of the Malaysian proceedings": "61        The plaintiffs complained that the settlement of the Malaysian proceedings was another step taken that was against the interests of Borden. They alleged that the Malaysian proceedings had been aggressively contested during SK Lim’s watch as executive director and this had resulted in PT Eagle’s action being dismissed. Although PT Eagle had appealed, the momentum then was clearly with Borden who had little reason to consider itself to be in a position that was inferior to that of PT Eagle. Unfortunately, once SK Lim was removed as executive director, he was no longer involved in discussions to settle the Malaysian proceedings. 62        In March 2002, Drew & Napier advised that there were three options available to Borden namely: (a)        proceed with the Malaysian action; (b)        reach a settlement under which PT Eagle would withdraw its cancellation action and continue to use the trade mark in Malaysia, paying Borden royalties on a regular basis; or (c)        reach a settlement with PT Eagle under which Borden would agree not to contest the Malaysian action and to sell its Malaysian trade mark to PT Eagle. Drew & Napier’s recommendation was that the first option was the best option if Borden wished to protect its trade mark and sales in Malaysia and other markets. This recommendation was, however, subject to a favourable assessment from the Malaysian lawyers on the admission of fresh evidence in the Malaysian proceedings. 63        The Malaysian proceedings were discussed at an extraordinary general meeting on 6 June 2002 (“the June EOGM”). SK Lim and the second plaintiff’s lawyer, one Mr Chew, were present. Mr Chew told the meeting that the second plaintiff wanted to pursue the court action and that settlement with PT Eagle might not be in the best interests of Borden as it might cause practical problems, in particular, allowing “parallel imports” of Eagle oil by PT Eagle into other countries. SK Lim himself specifically requested that the issue of “parallel import” be addressed when negotiating a settlement with PT Eagle. In the plaintiffs’ view, parallel importation of Eagle oil was the preferredmodus operandiof PT Eagle and had to be stopped. 64        The plaintiffs said that, to their surprise, the defendants then embarked on a course that sought to pay off Edy Chew and agreed on a settlement figure of US$900,000. At the annual general meeting of 18 December 2003, the defendants approved payment of this settlement sum. SK Lim asked for more time to consider the matter and to consult Drew & Napier but was out-voted. The plaintiffs alleged the settlement agreement was not in the best interests of Borden since it merely preserved the status quo and did not properly address the issue of parallel import and competition by PT Eagle. 65        The difficulty with the plaintiffs’ complaints here is that the evidence shows that Malaysian solicitors appointed through Drew & Napier to handle the Malaysian proceedings had advised Borden that its chances of ultimate success were 30% at the most. A representative of the Malaysian solicitors, one Ms Wendy Lam, attended an extraordinary general meeting held on 29 April 2002 to discuss the status of the Malaysian proceedings. Ms Lam advised the meeting that PT Eagle’s case had been dismissed on technical grounds and it had appealed against this decision. She further advised that the chance of Borden succeeding at the appeal was 30% at best as Borden did not have sufficient documentary proof to show the licensor-licensee relationship between itself and PT Eagle. She recommended that Borden negotiate for a settlement. Subsequent to this meeting, Borden sent further documents to the Malaysian solicitors. On 6 May 2002, the latter advised that the documents sent did not advance the case in Borden’s favour. This letter was tabled at the June EOGM and it was on the basis of this advice that all shareholders present, including the plaintiffs, resolved that negotiations for settlement with PT Eagle be initiated and that the management report to the shareholders on the outcome of the negotiations. The final terms of the settlement were to be approved by the shareholders. 66        At the annual general meeting held on 18 December 2003, Christopher Yeo informed the shareholders that he and Tan Lak Tho had had discussions with Edy Chew and the latter was willing to return the Malaysian market to Borden and transfer the products registration to it for US$1m in compensation. Christopher Yeo had counter-offered US$500,000 and Edy Chew had replied to say that the minimum that he would accept was US$900,000. Christopher Yeo also informed the meeting that a company called Medic Marketing Pte Ltd was prepared to take over the distribution of Eagle oil in Malaysia and had committed to purchasing three to four containers of goods for the first year. This would be a turnover of $1.6m per year. SK Lim was not happy with the proposed settlement and asked for more time for the shareholders to think about the matter and to seek Drew & Napier’s opinion on it. The other shareholders were in favour of settlement and passed a resolution fixing the compensation amount at US$900,000 and authorising the directors to do all acts necessary to gain control of the Malaysian market from PT Eagle. The settlement agreement was signed in February 2004. By it, PT Eagle agreed to render all possible assistance to transfer all existing product registrations held for it in Malaysia to Borden or Borden’s nominees. It also undertook to provide Borden with all technical know-how and formulation relating to these registered products and to supply such products to Borden on a cost plus basis. PT Eagle also agreed to withdraw the Malaysian proceedings and its claims to strike out the registration of Borden’s trade marks. 67        Assessing the evidence, it does not appear to me that the plaintiffs have established that the majority shareholders were acting in an oppressive manner. They had legal advice that they would most likely lose the Malaysian proceedings in the end. They also considered the fact that while the Malaysian proceedings were pending, they would not be able to exploit the Malaysian market. Once they paid off PT Eagle, they would be able to move into the market and the chances were that they would be able to do good business there. All the shareholders of Borden, including the plaintiffs, would benefit from direct sales in Malaysia. SK Lim’s plea for more time to think and seek further advice from Drew & Napier was not really warranted as the shareholders had looked into this matter over some time and had also received legal advice from the law firm handling the Malaysian proceedings.",
        "Appropriation of Vietnam by PT Eagle": "68        SK Lim was concerned with the problem of “parallel imports” by which he meant the influx of PT Eagle’s products into Borden’s markets. In court, he said that this had happened in Singapore, Vietnam, Malaysia and South Africa and that PT Eagle was challenging Borden’s products in those markets. The plaintiffs did not adduce any evidence as regards competition by PT Eagle in Singapore or in South Africa. These allegations remained unsubstantiated. As for the Malaysian position, that has already been dealt with. 69        The plaintiffs submitted that Vietnam was a particularly important market for Borden and that it had been ceded to PT Eagle as a result of the “rampant influx of PT Eagle’s goods” into Vietnam. PT Eagle was not only selling its products, it was also selling products from a company called Eastern Falcon (Asia) Pte Ltd which was owned by Edy Chew and one Alan Yeo. At the trial, SK Lim said that the sales figures for Vietnam showed that the competition was adversely affecting Borden’s business. He gave the following figures: 1998     : $5.8m in sales1999     : $1m2000     : $80,0002001     : $422,0002002     : $850,0002003     : $1.1m2004     : Up to May, around $150,000 The plaintiffs further submitted that the competition which led to the loss of the Vietnamese market was a direct consequence of failing to terminate the licence with PT Eagle. The existence of the licence meant that PT Eagle could flood the Vietnamese market with its goods and Borden could not take any action as PT Eagle’s products would not be considered counterfeit. 70        The plaintiffs did not produce any direct evidence of the competition in Vietnam. Whilst SK Lim did produce some bottles of oil said to have been purchased in Vietnam, that evidence was hearsay as he was not the one who purchased them in that market. The bottles were given to him by a third party who had in turn obtained them from someone else. Secondly, SK Lim was given these products towards the end of 2000 or the beginning of 2001. He then took the matter to Drew & Napier who advised that since the products were made by PT Eagle, they would not be considered counterfeit in Vietnam as Vietnamese law allowed parallel imports. At that time, SK Lim was the executive director. He did not take any immediate step to terminate the licence nor did he inform Mdm Halim, who was then a director, of the existence of the competition, much less ask her to take steps to stop the same. Thirdly, the sales figures given by SK Lim in court were not supported by any documents and the pattern of the figures was not conclusive of any matter. No evidence was produced to show that the figures related in any way to PT Eagle’s competition and not to other factors. Nor was there any evidence as to the degree to which PT Eagle’s products were penetrating the Vietnamese market. SK Lim’s suspicions alone cannot be accepted as evidence.",
        "Other complaints made by the plaintiffs": "71        The plaintiffs also submitted that the defendants had conducted the affairs of Borden in a manner where there was clear departure from the standards of fair dealing expected by shareholders in a company. Seven matters were said to justify this submission. I will deal with these in turn. 72        The first is that SK Lim’s late father, CH Lim, was wrongfully removed as a director of Borden, thereby depriving the second plaintiff of the representation on the board of directors that it was entitled to, from May 1997 to November 1999. In my view, this complaint is stale and should not have been made. The removal of CH Lim took place in 1997. The plaintiffs took no action then. The appointment of SK Lim as a director of Borden restored the Lim family’s representation on the board of directors. 73        The second matter was the removal of SK Lim as executive director of Borden on 9 November 2001, particularly as there was nothing to suggest why he should be removed as executive director. The defendants’ submission in response was that the evidence before the court showed that there were reasons why Mdm Halim had requisitioned the 2001 EOGM. These related to the Casey Lin and Company report. Casey Lin and Company were accountants who had been asked by Mdm Halim to investigate Borden’s affairs. Their report was first furnished to the plaintiffs on 22 December 2000 and SK Lim was asked to consider its contents and decide what action to take at a board meeting. 74        On 5 March 2001, Mdm Halim’s solicitors wrote to Drew & Napier asking for copies of written advice which they might have rendered to Borden on the report. A chaser was sent and on 15 June 2001, Drew & Napier replied, summarising their oral advice on the report. One piece of advice related to the bonus of $256,628 received by Tan Lak Tho in 1998. Drew & Napier advised that this amount should be recovered from Tan Lak Tho. Subsequently, Drew & Napier informed Mdm Halim’s solicitors that this advice had been given orally to SK Lim in February 2001. No steps were taken between February and July 2001. 75        At that time, SK Lim was aware that Mdm Halim had refused to attend a board meeting called on 21 February 2001 to approve the financial statements of Borden until she received replies to certain queries she had on those statements. Those queries had been addressed to Lim Kheng Puan and SK Lim, the then executive directors, on February 2001. Lim Kheng Puan resigned on 1 March 2001 and the queries raised by Mdm Halim were not answered until 30 August 2001 following further correspondence on the matter. After this, a directors’ meeting was held on 5 October 2001. This was the first board meeting in 2001 but SK Lim failed to raise the issue of the return of Tan Lak Tho’s bonus. In court, SK Lim was asked why he had failed to do so when he had stated that he was waiting for a directors’ meeting to raise the matter. His response was that he wanted to discuss the matter personally with Mdm Halim. The defendants considered this response to be feeble and evasive as there had been nothing to stop SK Lim discussing the matter with Mdm Halim earlier. 76        In my opinion, looking at the matter from Mdm Halim’s point of view, it would appear that she had reason to be annoyed with SK Lim in October 2001 when she put in the requisition for the 2001 EOGM. By then, ten months had passed since he had been given a copy of Casey Lin and Company’s report but he had done nothing to recover either the Po Wah debt or Tan Lak Tho’s bonus which were the two main items in that report. SK Lim only started working on the recovery of the Po Wah debt after the directors’ meeting held on 5 October 2001. The requisition submitted by Mdm Halim asked for an extraordinary general meeting to be called to consider four matters. The first item was for the shareholders to discuss and resolve on the courses of action Borden should take in relation to the matters raised in the Casey Lin and Company report. It would appear therefore that one of Mdm Halim’s main intentions in asking for the 2001 EOGM was to ensure that action was taken on those matters. The plaintiffs’ submission that there was nothing to suggest why SK Lim should be removed as executive director is, therefore, not supported by the evidence. 77        The third matter that the plaintiffs complained of was that subsequent to SK Lim’s removal as executive director, he was denied access to Borden’s records. The locks of the office were changed and employees were instructed not to speak to him. The plaintiffs were thereafter entirely shut out of the management of the affairs of Borden. The defendants did not address these allegations. 78        Next the plaintiffs complained that Richard Yeo was appointed general manager of Borden and Christopher Yeo was appointed managing director of Borden in early 2002 even though barely two months earlier, a shareholders’ resolution had been passed to forbid any directors to assume executive powers. The defendants did not deal with this complaint either. 79        The next two complaints have already been discussed: they relate to the defendants’ decision not to further investigate the issue of Mdm Halim’s alleged conflict of interest and their refusal or failure to terminate the licence granted to PT Eagle. Finally, the plaintiffs complained that the refusal of the defendants to justify their action in these proceedings was one of the matters making it clear that the defendants had conducted the affairs of Borden in a manner where there was a clear departure from the standards of fair dealing. To me, this last complaint does not make sense. The defendants were entitled to take the position that they would not appear as witnesses and adduce additional evidence because, in their view, at the end of the plaintiffs’ case, the plaintiffs had not made out a case which they had to answer. Such a decision in relation to court proceedings cannot be considered a matter relating to the conduct of the affairs of Borden.",
        "The law": "80        This action was brought to invoke the court’s powers under s 216 of the Companies Act. There has been much litigation involving that section and the basic principles to be applied by the court when determining whether an applicant has satisfied either limb of s 216(1) are not in doubt. The applicant has to show that the affairs of company concerned are being conducted or the powers of the directors are being exercised in a manner oppressive to the applicant or in disregard of his interests or that some act of the company has been done or is threatened that would unfairly discriminate against the applicant. In this case, it appears to me that the allegations made by the plaintiffs here fall more within the first limb relating to the conduct of the affairs of Borden and the use of the directors’ powers than within the second limb which relates to specific acts that are prejudicial to the plaintiffs. 81        There is no need for me to go through all the many authorities cited by the parties. It is, however, helpful to remind myself of the wisdom contained in certain well-known cases. InScottish Co-operative Wholesale Society Ltd v Meyer[1959] AC 324at 342, Viscount Simonds considered that “oppression” should be given its dictionary meaning as being the exercise of authority in a manner which was “burdensome, harsh and wrongful”. The English Court of Appeal inRe Jermyn Street Turkish Baths Ltd[1971] 1 WLR 1042adopted thisdictumand Buckley LJ, who delivered the judgment of the court, stated (at 1059–1060): In our judgment, oppression occurs when shareholders, having a dominant power in a company, either (1) exercise that power to procure that something is done or not done in the conduct of the company’s affairs or (2) procure by an express or implicit threat of an exercise of that power that something is not done in the conduct of the company’s affairs; and when such conduct is unfair or, to use the expression adopted by Viscount Simonds inScottish Co-operative Wholesale Society Ltd.v. Meyer[1959] A.C. 324, 342, “burdensome, harsh and wrongful” to the other members of the company or some of them, and lacks that degree of probity which they are entitled to expect in the conduct of the company’s affairs … Oppression must, we think, import that the oppressed are being constrained to submit to something which is unfair to them as the result of some overbearing act or attitude on the part of the oppressor. The above definition of oppression was cited with approval by our Court of Appeal inLow Peng Boon v Low Janie[1999] 1 SLR 761. 82        Another important passage for the court to bear in mind when assessing whether there has been oppression is the following oft-cited one from the judgment of Lord Wilberforce in the Privy Council decision ofRe Kong Thai Sawmill (Miri) Sdn Bhd[1978] 2 MLJ 227at 229: Secondly, for the case to be brought within section 181(1)(a) at all, the complaint must identify and prove “oppression” or “disregard”. The mere fact that one or more of those managing the company possess a majority of the voting power and, in reliance upon that power, make policy or executive decisions, with which the complainant does not agree, is not enough. Those who take interests in companies limited by shares have to accept majority rule. It is only when majority rule passes over into rule oppressive of the minority, or in disregard of their interests, that the section can be invoked. As was said in a decision upon the United Kingdom section there must be a visible departure from the standards of fair dealing and a violation of the conditions of fair play which a shareholder is entitled to expect before a case of oppression can be made (Elder v. Elder & Watson Ltd.): their Lordships would place the emphasis on “visible”. And similarly “disregard” involves something more than a failure to take account of the minority’s interest: there must be awareness of that interest and an evident decision to override it or brush it aside or to set at naught the proper company procedure (per Lord Clyde inThompson v. Drysdale). Neither “oppression” nor “disregard” need be shown by a use of the majority’s voting power to vote down the minority: either may be demonstrated by a course of conduct which in some identifiable respect, or at an identifiable point in time, can be held to have crossed the line. 83        With those principles in mind, I turn to consider whether the plaintiffs have been able to establish by the evidence adduced at the trial, taken at face value, that there has been a visible departure from the conditions of fair dealing and a violation of the conditions of fair play that the plaintiffs are entitled to expect such that a case of oppression can be made and/or that the plaintiffs have been constrained to submit to something which is unfair to them as a result of some overbearing act or attitude of the defendants. 84        Before I proceed, several things must be borne in mind. First, the oppressive conduct must have taken place before the action was instituted which, in this case, means prior to 9 September 2002. Second, SK Lim was an executive director of Borden for two years up to 9 November 2001. Third, although Mdm Halim was a director of Borden until March 2002, she did not exercise any executive powers during the period when SK Lim was executive director. Fourth, Christopher Yeo and Rachel Chew were appointed as directors and given executive powers in January 2002. The removal of executive powers from SK Lim and the granting of executive powers to these two directors despite the earlier resolution that directors should not have executive powers were moves that were supported by the defendants. Bearing these matters in mind, the period prior to these proceedings when the defendants can be alleged to have been in control of Borden or to have had conduct of its affairs would have been between November 2001 and September 2002. This is the main period with which I have to be concerned when considering whether there was oppression. 85        As far as the plaintiffs’ complaints of conflict of interest are concerned, I have found that Christopher Yeo was never in a position of conflict. As for Mdm Halim, although there was a theoretical possibility that as commissioner of PT Eagle she could have been in a position of conflict, there was no act or situation that the plaintiffs could point to which showed her in such a position. No situation had arisen in which she was shown to have preferred the interests of PT Eagle over those of Borden. 86        Secondly, the plaintiffs’ dissatisfaction commenced with the removal of executive powers from SK Lim. The plaintiffs’ evidence did not establish that on its face this step was taken pursuant to a conspiracy by the defendants to deprive SK Lim of a say in the management of Borden so that the defendants could prefer the interests of PT Eagle over those of Borden. There was evidence that Mdm Halim had reason to be unhappy with SK Lim’s stewardship of Borden, in particular with his reluctance to deal with concerns that she as a shareholder and co-director had raised. I do not believe that SK Lim was removed because he was taking further steps to investigate Mdm Halim’s position in PT Eagle. 87        The settlement of the Malaysian proceedings does not, strictly, concern me as this did not take place during the time period in which I am concerned. As I have stated, however, when I considered the matter in more detail, the plaintiffs had failed to show that the defendants, in approving the settlement, acted unreasonably or in an overbearing mannervis-à-visthe plaintiffs. There was also insufficient evidence to substantiate the plaintiffs’ complaints about PT Eagle’s activities in Vietnam. It is worth noting here that the plaintiffs’ expert accountant, who studied the books of Borden, found that Borden had been developing its business abroad. His report indicated that based on the accounts of the company for the years 2000, 2001 and 2002, Borden had generated on average more than $10m in revenue per year and had grossed over $4m in profit per annum and had also expanded the trading and distribution channels of its Eagle oil to Malaysia, Thailand, Vietnam, Hong Kong and the US. 88        The complaints of the plaintiffs considered thus far do not justify any finding of oppression. There are, however, certain matters which require further consideration. These are as follows: (a)        the failure of the executive directors to take steps in 2002 to terminate PT Eagle’s licence; (b)        the decision of the executive directors not to pursue the trade mark oppositions in Yemen and the UAE; (c)        the appointment of shareholders as executive directors despite the resolution passed at the 2002 EOGM; and (d)        the obstacles placed in SK Lim’s way after his executive powers were removed. 89        Taking the last two of these matters first, a shareholder does not always have the right to participate in the management of the company. It depends on the type of company and the agreement or arrangement among the shareholders at the time of formation of the company or upon the acquisition of shares. It was the plaintiffs’ case that from the beginning, it was understood and agreed that each family that held shares in Borden would participate in the management of the company. The evidence, however, did not establish such an arrangement. Whilst all of the founding shareholders were directors of Borden, subsequently, not all of them always had representation on the board and there were some directors who never took executive positions in the company. Whilst CH Lim was alive, he had been a director and had managed Borden for several years; but there were two years between 1997 and 1999 when the plaintiffs had no representation on the board or in the management. It is significant also that when the plaintiffs sought to change this position, they did so in a manner that would have conflicted with a pre-existing understanding that all shareholders were entitled to participate in management, had such an understanding existed. 90        In September 1999, the plaintiffs attended a shareholders’ meeting and agreed with a suggestion that Mdm Halim be replaced as a director by SK Lim with immediate effect. It was recorded in the minutes of the meeting that CH Lim proposed that an extraordinary general meeting be held so that Mdm Halim could present herself at the meeting and the matter be ratified. Subsequently Mdm Halim obtained an injunction restraining the shareholders from removing her from the board. There was no reason to eject Mdm Halim in order to make way for SK Lim since Borden’s articles permitted a maximum of six directors at any one time. It was also clear from the evidence that not all directors were executive directors. Between November 1999 and 2001, SK Lim was the sole executive director though not the sole member of the board. In my judgment, the evidence did not establish that all the founding families had a right to a representative on the board of directors at all times and, even if I am wrong in this, it most definitely did not establish that all the directors had the right to be executive directors. 91        Although the new management does seem to have treated SK Lim rather shabbily after he ceased to be an executive director in depriving him of access to his office and instructing the staff not to deal with him, I do not think that such conduct amounted to oppression. As SK Lim was no longer in the management, he would not have the right to give instructions directly to the staff and since they had previously been used to taking instructions from him, denying him access to them would have helped the new management take over control. As a director, SK Lim would still have the right to inspect Borden’s books in accordance with the provisions of the Companies Act. There is no evidence that a formal request for inspection in accordance with these provisions would have been denied. When the plaintiffs’ expert accountant was appointed, he was given access to Borden’s books. SK Lim also had the right to attend directors’ meetings and he did so even after he lost his executive powers. As shareholders, the plaintiffs did not suffer any deprivation of their rights and privileges after SK Lim left the management of Borden. 92        Moving to the first two matters,ie, the failure to terminate PT Eagle’s licence and the decision not to proceed in UAE and Yemen, there are two ways that these steps can be looked at. First, they can be considered to be a management decision relating to the way in which Borden wanted to carry on business in the future and whether such business would be impeded or enhanced if Borden were to cut its long-standing ties with PT Eagle and move into markets which it had not previously explored simply because PT Eagle had obtained trade mark registrations there. If the management decided that it was in the best interests of Borden not to take such steps, then that could very well be simply a policy decision which the plaintiffs could not have legal grounds to object to notwithstanding that they hold a different view as to what policy would better serve Borden’s interests. It is only if the plaintiffs can establish that there was an ulterior motive behind that policy decision and that it was taken to promote the interests of PT Eagle or the defendants’ own interests, rather than those of Borden because of the defendants’ association with PT Eagle, that the plaintiffs can ask the court to categorise the defendants’ actions as being oppressive. In my judgment, the plaintiffs have not been able to establish that fact. The plaintiffs are highly suspicious of the actions of the defendants because of the personal ties between various defendants and Edy Chew but they have not been able to show me, on the face of the evidence, how the majority shareholders would benefit from acting against the interests of Borden and in favour of the interests of PT Eagle. They have not even shown me any inclination on the part of the defendants to do so. 93        At the most, what the plaintiffs have been able to establish is that the other shareholders in Borden excluding the ninth defendant, Mdm Ong Gek Kim, had, to an extent, aligned themselves with each other by September 2002 and taken positions that were contrary to those adopted by the plaintiffs. Such alignment did not, however, in my view, result in any oppression being suffered by the plaintiffs prior to the commencement of these proceedings. Borden was doing well and making profits both in Singapore and in its foreign markets and all shareholders were benefiting from such success. The plaintiffs did not show, on the evidence, that the alignment of the defendants was for the purpose of running down Borden’s business and/or for the benefit of PT Eagle.",
        "Abuse of process": "94        Even if the plaintiffs had been able to satisfy me that they had been oppressed by the majority shareholders, they would have had difficulties in obtaining the relief that they sought. The plaintiffs asked the court to wind up Borden. They were not interested in buying out the defendants or being bought out by them. Generally speaking, where a company is doing well, as Borden is, the court is reluctant to order it to be wound up. In this case, the bigger obstacle that the plaintiffs face in obtaining such relief is the allegation by the defendants that this action or the continuation of this action is an abuse of process. 95        When this action was started on 9 September 2002, one of the prayers was that the second to tenth defendants be ordered to purchase the plaintiffs’ shares at a price to be fixed by a valuer upon the completion of a re-audit by the plaintiffs’ accountants. This was as an alternative to the liquidation of Borden. On 20 September 2002, the defendants’ solicitors wrote to state that the defendants were willing to purchase the plaintiffs’ shares pursuant to a valuation by a professional valuer to be agreed upon between the parties. This offer was in substance the same as that prayed for except that the plaintiffs’ prayer contemplated a re-audit of Borden’s accounts by the plaintiffs’ auditors. 96        The plaintiffs did not respond to the defendants’ overtures on the matter of the share purchase. One of the reasons given by them for this lack of interest was that even if the parties could agree on whom to appoint as the independent valuer, they would be very unlikely to agree on the scope of the work of the valuer. The defendants responded in writing and said that the parties should then try and agree on the scope of the work of the valuer and if they were unable to agree on any point, then a limited application could be made to court for the resolution of the issue within the framework of a buyout agreement. The defendants wanted a substantive response from the plaintiffs to this offer which they saw as a workable option and worth exploring. In July 2003, Mdm Halim’s solicitors wrote to the plaintiffs’ solicitors and asked for a reply to this offer within the next ten days failing which they would assume that the plaintiffs did not intend to respond. No response from the plaintiffs was received. On 4 November 2004, Mdm Halim’s solicitors wrote to the plaintiffs’ solicitors offering to purchase the shares based on a price-fixing formula. The plaintiffs rejected this offer. 97        It is clear from the House of Lords case ofO’Neill v Phillips[1999] 1 WLR 1092, that where there is a reasonable offer to purchase the allegedly oppressed party’s shares, then an action for oppression cannot be sustained. Lord Hoffmann stated at 1107 that in the case of a minority oppression action where one of the complaints was exclusion from management: In such a case, it will almost always be unfair for the minority shareholder to be excluded without an offer to buy his shares or make some other fair arrangement. … But the unfairness does not lie in the exclusion alone but in exclusion without a reasonable offer. If the respondent to a petition has plainly made a reasonable offer, then the exclusion as such will not be unfairly prejudicial and he will be entitled to have the petition struck out. Lord Hoffmann then set out the guidelines to assist shareholders in determining what would be a reasonable offer. There were five points. First, the offer must be to purchase the shares at a fair value. Second, the value if not agreed, should be determined by a competent expert. Third, the offer should be to have the value determined by the expert as an expert. Fourth, the offer should provide for equality of arms between the parties. Fifth, the question of costs would have to be considered. The offer should take into account the plaintiffs’ costs although this need not always be payable by the defendants as in cases where the defendants have not been given a chance to make an offer before the action was launched. 98        The defendants submitted, and I agree, that the offer made by them substantially met the requirements of the guidelines. Since the plaintiffs declined to engage in any discussions as to the mechanics of valuation or on any details of the valuation or offer, the issues of access to information and costs could not be addressed. If the plaintiffs had responded in a positive way, then these issues could have formed part of the negotiations and where parties had been unable to agree, the court could have made a decision on the point. The plaintiffs in this case received an offer very shortly after the commencement of the action but did not do anything to try and resolve the situation notwithstanding that they themselves had asked the court to provide the terms in which the shares could be bought out. It was only when the matter came to trial that the plaintiffs removed this prayer and stated that their sole aim was to achieve the winding up of Borden. I do not understand why the plaintiffs are so determined that Borden be wound up. The plaintiffs’ attitude seems to be that if they cannot play an active part in the management of Borden, the company should cease to exist. That such action would probably result in Borden’s markets being completely taken over by PT Eagle does not seem to concern them. 99        Borden is a company with an on-going business. Its liquidation would result in a loss of the goodwill if its business cannot be sold as a going concern. Even if a buyer can be found, generally, forced sales do not result in full value being paid for the asset concerned. Whilst the plaintiffs’ expert’s position is that he requires further documents and information to value the plaintiffs’ shares, that does not mean that no valuation can be undertaken since if all parties co-operate in the exercise, more information should be forthcoming. In any case, an independent valuer would have done the best he could in the situation and a procedure could have been worked out whereby certain issues affecting the valuation that could not be resolved by the valuer could have been presented to the court for resolution. 100      The words of Millett J inRe a company (No 003843 of 1986)[1987] BCLC 562at 571 are apposite in the present situation. He said: I turn to the application to stay the petition on the ground that the offer ought to be taken up. I will deal first of all with the application for winding up: in my judgment, it is now manifestly unreasonable for the petitioners to continue to press for a winding-up order. That would give them a financial remedy only, but it would be a financial remedy which would inevitably result in the later payment of a lesser sum than could be obtained from the offer that has been made. … In answer to that counsel for the petitioners (Mr Jefferis), argued that, because there was suspicion of misfeasance and misappropriation, it was not possible to say that the petitioners had been made a fair offer. In my judgment, there is nothing in that point. The terms of the offer that I have read ensure that both sides will have an opportunity to have access to all the company’s books and papers and to make whatever representations they wish to make to the independent accountants. In case there is any doubt about it, I should make it absolutely clear that, in my judgment, if the accountants have any reason to think that there has been any misappropriation or misapplication of the company’s assets which would have the effect of depreciating the value of the petitioner’s interest, then they will have to take that into account in valuing the company. So I would unquestionably stay or adjourn the petition in so far as it seeks a winding up. 101      In the present case, there is no suggestion of misappropriation. The plaintiffs’ expert did not find anything amiss in the accounts. The plaintiffs did suggest that a valuation of the shares of Borden might not yield a true and accurate value and therefore there was a risk that such an order would benefit the defendants and prejudice the plaintiffs. Their reason for this suggestion was that the accounts and financial books and statements were in the possession and control of the defendants. That complaint is not justified. The plaintiffs’ expert had full access to the accounts. The plaintiffs knew all about the accounts and statements up to November 2001. Secondly, the plaintiffs have not substantiated their suspicion that a valuation cannot yield a true and accurate value of the shares. 102      The plaintiffs in contending that winding up was a more appropriate remedy than a buy-out cited the case ofLow Peng Boon v Low Janie([81]supra) where the court made a winding-up order in respect of a family company that was a prosperous on-going concern. There the court considered that once there was a rift in the family that had driven the company, it would no longer be feasible for the business to continue. I do not think that authority is applicable to the present circumstances. Even though the trust and confidence between the plaintiffs and the other founding families have broken down, Borden can continue to exist. If I had found the plaintiffs’ complaints to be justified, I would have ordered a buy-out rather than a dissolution of the company. In the circumstances of this case, insisting on a winding up smacks of spite more than anything else. I agree that the plaintiffs were guilty of an abuse of process in continuing with this action and in refusing to respond to the defendants’ offer of a buy-out. It is, however, too late to strike out the action. The proper remedy is a dismissal.",
        "Conclusion": "103      In the premises, this action is dismissed with costs to all the defendants. The interim injunction granted is discharged."
    }
}