{
    "case_title": "Chia Kin Tuck v Leong Choon Kum and Another",
    "ncitation": "[2005] SGHC 1",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "1          These six appeals raised one question,vizwho owned the $1m (“the sum”) which Chia Kin Tuck (the plaintiff) claimed from Leong Choon Kum (the first defendant) and Chua Lan (the second defendant) in District Court (Transferred) Suit No 600872 of 2000 (“the suit”) as money had and received. After ten days’ hearing, the district judge on 18 June 2003 held that the first defendant did receive the sum from the plaintiff but she dismissed the plaintiff’s claim on the basis that the sum did not belong to him beneficially. On 5 August 2003, she ordered that each party should bear its own costs. All three parties have appealed against her decision as well as her orders for costs. 2          The plaintiff appealed in District Court Appeal (“DCA”) No 23 of 2003 against the dismissal of his claim. The first and second defendants appealed in DCA No 25 of 2003 and DCA No 24 of 2003 respectively, against the court’s finding that the sum was received by the first defendant from the plaintiff and not from the second defendant. In DCA No 38 of 2003, the plaintiff appealed against the order that each party was to bear its own costs. In DCA No 39 of 2003 and DCA No 40 of 2003 respectively, the second and first defendants lodged similar appeals. 3          The facts which gave rise to the suit are amply set out in the lengthy judgment of the district judge dated 31 October 2003. I shall set out only the salient facts for the purposes of these appeals. 4          The plaintiff was married to the first defendant in 1978. They were divorced on 7 January 2000 on an amended petition filed in Divorce Petition No 1621 of 1998 (“the divorce proceedings”) presented by the first defendant on 8 May 1998 based (originally) on unreasonable behaviour. The couple have two sons now aged 25 and 20 (hereinafter referred to as “the two sons”). The first defendant has worked as a conveyancing clerk in various law firms for about 30 years since 1968. 5          The second defendant met the first defendant in 1981 when the first defendant was working in a law firm which the second defendant retained to act for her in a property transaction. The two became firm friends thereafter and according to the first defendant, the second defendant trusted her completely and often gave her large sums of money or signed blank cheques to hold for purposes of property transactions. 6          The second defendant ran a brothel in Geylang from 1967 until her retirement in 1991. The first defendant introduced the plaintiff to the second defendant in 1988 and they became friends. The second defendant was widowed in 1980 and had no formal education. 7          The plaintiff’s statement of claim had alleged that the first defendant received $1m from him for the purpose of depositing into Australian banks in order to earn interest to be used for their sons’ educational and living expenses while the sons were studying in Australia. The plaintiff alleged that the first defendant deposited the sum into two Australian banks,vizThe Australian & New Zealand Bank (“ANZ”) and The Commonwealth Bank of Australia (“CBA”) but, in breach of trust and her fiduciary duties as trustee, she had on 16 April 1997 allowed the second defendant to operate the CBA account. Further, the first defendant had then transferred the deposits in the two banks to an account or accounts in the name of the second defendant, without the plaintiff’s knowledge. He alleged the two defendants conspired to defraud him of the sum. 8          The two defendants filed a common defence. They alleged that the plaintiff did not pass any money to the first defendant and that the moneys deposited in ANZ and CBA came from the second defendant who had asked the first defendant to take the second defendant’s money to Australia on her behalf.",
        "The evidence below": "",
        "The plaintiff’s case": "9          The plaintiff ran a family business called Hoo Sun which supplied marine equipment and accessories to ships. The business was started by his mother from whom the plaintiff took over the running of the business. The plaintiff’s mother, Chong Siew Kum (“the mother”), passed away on 4 April 1996. After the mother’s demise, the plaintiff had disputes with his siblings (three brothers and two sisters) over her estate, in particular, with his brother, Chia Weng Tuck (“Chia”). Hoo Sun was a partnership comprising of the plaintiff, the mother and Chia before the mother’s demise. 10        On 12 and 13 June 1996, the plaintiff transferred $2.48m from an account (held jointly with his sister, Chia Ee Moey) with the Bank of China to his personal account with Overseas Union Bank (“OUB”). He placed $980,000 into a fixed deposit and $1.5m into a multi-link account. He used the second defendant’s address (at No 2 Pebble Lane) for opening both accounts. This was done on the second defendant’s advice so that OUB’s statements would be forwarded to the second defendant’s address and his siblings could not trace the money. 11        On 18 July 1996, the plaintiff withdrew $500,000 from his OUB multi-link account. On the same day, a safe deposit box (“the first box”) was opened in the second defendant’s name, which she allowed the plaintiff and the first defendant to use on certain conditions. The plaintiff and the first defendant had access to the first box that very day. The plaintiff put the cash of $500,000 into the first box. On the same day, he lodged a police report against his brothers for making threats against him and his family. I should point out that the plaintiff had his own safe deposit box which he opened with OCBC bank on 16 July 1996. He had also visited his safe deposit box on 18 July 1996, for the purpose of taking out the title deeds of two properties,vizNo 393 Balestier Road and No 19 Ringwood Road, which documents he then deposited into the first box that very day. 12        On 17 September 1996, a bank draft for A$430,016.92 was purchased by the plaintiff using cash of S$480,000. A sum of S$20,000 was deposited by the first defendant into her Post Office Savings Bank (“POSB”) account on the same day. This was done against the plaintiff’s instructions which were to change the S$20,000 into Australian dollars with money changers, to cover the initial expenses to be incurred when the first defendant and the sons arrived in Brisbane. The first defendant left for Australia with the sons on 19 September 1996, taking with her the draft for A$430,016.92, which she deposited into CBA in her name on 20 September 1996. 13        On 27 September 1996, the plaintiff withdrew $200,000 from his OUB multi-link account by a cash cheque. The plaintiff intended to use the cash to pay for Chia’s relinquishment of Chia’s share in the mother’s estate, pursuant to a settlement agreement signed at the office of Chia’s lawyer on 28 September 1996. However, on the advice of Chia’s lawyer, the plaintiff paid Chia by cheque instead. On 30 September 1996 the plaintiff withdrew $300,000 from the same account. He used the total cash of $500,000 to purchase a draft for A$448,139.85 in the first defendant’s name. 14        The first defendant signed an acknowledgement of debt in favour of the plaintiff dated 30 September 1996 acknowledging she had received the sums of $480,000 and $499,900 from the plaintiff on 19 and 30 September 1996 respectively. The note also stated that the first defendant would deposit the moneys into a fixed deposit account to earn interest and utilise the interest towards the maintenance of herself and the sons and towards their education. Further, unless the plaintiff consented, the first defendant would not withdraw the principal sum. The typed figure “$500,000” had been cancelled and overwritten with the figure “$499,900”. The acknowledgement was prepared by the plaintiff’s lawyer, Kenneth Tan, who testified that the first defendant did not sign the document before him (as the plaintiff contended) nor could Kenneth Tan be certain that she had signed it in his office. 15        On 1 October 1996, the first defendant deposited A$448,139.85 into the ANZ account in her name. Interest earned on the deposit account was credited into an Access account maintained by the first defendant with ANZ. 16        On 1 October 1996 also, the first defendant converted the commercial bill account holding A$430,016.92 with CBA into a term deposit account. A net sum of A$427,088.17 was transferred to the term deposit while interest earned was placed into the first defendant’s Streamline account, which she had opened on 20 September 1996 with two deposits of A$330.54 and A$1,000. 17        The first defendant gave the second defendant a mandate to operate the term deposit with CBA by an authority dated 16 April 1997. On 29 April 1997, this term deposit was split into four term deposit accounts (“term deposits 1 to 4”) in the amounts of $300,000, $50,000, $50,000 and $27,088.17 respectively. Term deposits 1 to 4 were closed on 1 June 1998, 2 September 1997, 2 September 1997 and 25 November 1997 respectively. After closure, the amounts in the four accounts were transferred to the second defendant’s account with CBA on or about 1 June 1998. The four accounts would appear to have been consolidated before transfer as the amount credited to the second defendant’s account was A$420,000. 18        The first defendant’s letter dated 27 May 1998 authorising the transfer to the second defendant’s account also instructed CBA to liquidate another term deposit account holding A$10,000 and transfer the amount to the second defendant’s account. 19        The balance in the first defendant’s Streamline account of A$117.95 was also transferred to the second defendant’s account on 14 April 1998 after which the account was closed. 20        The second defendant withdrew all the balance in her account with CBA on 3 June 1998. 21        On 16 April 1997, the first defendant authorised the transfer upon maturity of the fixed deposit of A$448,139.85 with ANZ to a new deposit account to be opened in the name of the second defendant. She also authorised a transfer of A$1,860.15 from her Access account to the second defendant’s new account on 8 May 1997. Both transfers were effected on 8 May 1997. The second defendant’s new account held a sum of A$450,000 until the ANZ account was closed on or about 9 June 1998. 22        The first defendant’s Access account with ANZ was closed on 26 November 1997 and the balance of $2,601.18 was withdrawn in cash. 23        In his affidavit evidence, the plaintiff claimed he was the source of all the moneys remitted to Australia. He made the remittances on the advice of the first and second defendants so as to protect his money from his squabbling siblings, as he was the principal beneficiary (50%) under the mother’s will dated 11 June 1987. The plaintiff was able to support his contention by producing documents to evidence his various cash withdrawals, the bank draft purchase form of $480,000, as well as the acknowledgement of debt dated 30 September 1996 signed by the first defendant.",
        "The first and second defendant’s case": "24        The two defendants adopted a common stand in their testimony. Because the first defendant assisted her in numerous property transactions, the second defendant had the habit of giving the first defendant “red packets” or “ang pows”. 25        In September 1996, the second defendant was interested in properties in Australia for investment purposes. This was soon after the Singapore government had imposed restrictions and capital gains tax on property transactions in May 1996. As she knew the first defendant was going to accompany the two sons to Australia, the second defendant requested the first defendant to carry the second defendant’s moneys to Australia to be put into fixed deposits in banks in the first defendant’s name, to be held on trust for the second defendant. 26        Accordingly, on 17 September 1996, the second defendant handed cash of $500,000 to the first defendant in $10,000 notes. The second defendant claimed she liked to keep $10,000 notes. She did not keep her money in banks as being illiterate, she found going to banks inconvenient. She said $20,000 of the $500,000 cash was meant as an “ang pow” for the first defendant whilst the balance $480,000 was to be deposited in Australian banks. The first defendant signed an acknowledgement of receipt for $480,000 that day. The first defendant used the $480,000 to purchase a draft for A$430,016.92 which she took with her to Australia on 19 September 1996. 27        At the plaintiff’s request, the first defendant cut short her stay in Australia and returned to Singapore on 24 September 1996 in order to assist him in resolving his dispute with his siblings. 28        The first defendant left for Australia again on 30 September 1996. The second defendant handed her $500,000 cash that day. She signed a second acknowledgement of receipt later that same day for the amount. 29        On both occasions when the cash of $500,000 was handed over in envelopes to the first defendant by the second defendant, it was witnessed by one Tan Kok Jong (“Tan”), a friend and business partner of the second defendant. Tan testified he had driven the second defendant to the OUB branch at OUB Centre, Raffles Place on both occasions when the second defendant made the cash withdrawals. He had also witnessed the signing of the acknowledgements of receipts by the first defendant. Tan also claimed to have seen, on 17 September 1996, the handover of the key to the first box by the second defendant to the plaintiff and the first defendant. 30        Another witness for the defendants was Ng Siok Kim (“Ng”) who at the material time was a secretary in the law firm where the first defendant worked as a conveyancing clerk. Ng testified she had prepared, at the second defendant’s request, five documents – three were the acknowledgements of receipt signed by the first defendant, while the remaining two were the agreements governing the use by the plaintiff and the first defendant of the first box and another safe deposit box. 31        Ng explained that the second defendant had indicated she would only allow the plaintiff and the first defendant to keep documents and jewellery in the first box. The second defendant did not want to be responsible for any loss, actions or claims arising out of the couple’s use of the first box. Consequently, Ng prepared an agreement dated 28 June 1996 to reflect the arrangement between the second defendant and the couple. 32        Ng testified that besides the two acknowledgements dated 17 and 30 September 1996 respectively, she had prepared a third acknowledgement of receipt dated 9 October 1996 for S$90,000, for signature by the second defendant in favour of the first defendant. This was pursuant to a telephone request from the second defendant a day earlier. Ng was told that the first defendant had reimbursed the second defendant for some of the interest earned on the second defendant’s fixed deposits with CBA and ANZ, which the first defendant had withdrawn and utilised for the sons’ education and other expenses. 33        On 8 April 1998, again at the second defendant’s request, Ng drafted an agreement similar to that dated 28 June 1996, but this time governing only the first defendant’s usage of the first box. 34        Ng confirmed the second defendant was a woman of substance from whom her then employer used to obtain friendly loans. As the second defendant was not literate in English, at her employer’s request, Ng would help draft and translate documents for the second defendant. 35        The second defendant said she visited Brisbane between 15 and 19 April 1997. She was accompanied by the first defendant. On this trip, the defendants visited CBA and ANZ and the moneys held in the first defendant’s accounts were instructed to be transferred, or were transferred, to accounts opened in the name of the second defendant. The first defendant also signed the Authority to Operate form of CBA dated 16 April 1997, to enable the second defendant to operate the first defendant’s account. 36        The second defendant took the opportunity to look at certain properties during that visit. She paid a deposit of A$10,000 on a property at No 55 Brunswick Street and signed a contract dated 18 April 1997 for completion of her purchase on 28 November 1997. Subsequently she aborted the purchase as a result of which her deposit was forfeited. 37        The second defendant claimed the plaintiff met up with her and the first defendant before they left Australia on 19 April 1997 on the day he arrived. They even breakfasted together in Chinatown. The second defendant said the plaintiff was fully aware her visit to Australia was to execute bank documentation for her funds and to look at properties. 38        The second defendant closed the first box in April 1998 when she was informed by the plaintiff and the first defendant that they no longer needed its use. OUB records produced by the second defendant showed that between 18 July 1996 and 28 April 1998, the first defendant and/or the plaintiff had access to the first box on 20 occasions. On the day the first box was opened, the couple had access to it at four different times. Save for 18 July 1996, the second defendant did not visit the first box at all. 39        After the first box was closed, the second defendant opened a safe deposit box (“the second box”) with United Overseas Bank (“UOB”) at the first defendant’s request, for safe keeping of the first defendant’s jewellery and personal documents. The second box was opened on 29 April 1998 and closed on 3 February 1999. UOB’s records showed 13 visits were made to the second box between the opening and closing dates but no information was provided as to who made those visits. 40        The second defendant visited Brisbane for the second time on 30 May 1998, accompanied again by the first defendant. The purpose was to sign bank documentation to open an account with CBA. Pursuant to the first defendant’s instructions dated 27 May 1998, CBA transferred two term deposits – one for A$420,000 and the other for A$10,000 upon their maturity on 31 May 1998 – to the second defendant’s account with CBA. 41        As far as the second defendant was concerned, with the transfer of the moneys from the first defendant’s accounts to the second defendant’s own accounts with CBA and ANZ, the first defendant had returned all the moneys entrusted to her by the second defendant. Consequently, at the first defendant’s request, the second defendant endorsed (on 17 April 1997) on the acknowledgements of receipt dated 17 and 30 September 1996, that she had been repaid the sums of $480,000 and $500,000 respectively. 42        Although the first defendant was the account holder, the mailing address for her accounts with CBA and ANZ was No 2 Pebble Lane. The second defendant said the first defendant and the plaintiff did not have copies of the bank statements. This was odd if indeed the money in those accounts belonged to the plaintiff. 43        The second defendant pointed to another fact which disproved the plaintiff’s ownership of the moneys in Australia. Additional deposits of nearly A$50,000 were credited into the first defendant’s CBA account after September 1996 as well as A$500 into her ANZ account to comply with the minimum balance requirement. These additional moneys were handed in cash by the second defendant to the first defendant whenever the latter visited the sons in Brisbane. Yet, the plaintiff had laid no claims to these moneys. 44        The first defendant’s testimony corroborated the second defendant’s evidence. As for the acknowledgement of debt dated 30 September 1996,[1]the first defendant claimed the plaintiff tricked her into its signing. Apparently, on that day at around 6.30pm when he was about to send her to the airport to catch her flight to Brisbane, the plaintiff handed her the document and asked her to sign it. She inquired as to the purpose and the plaintiff told her he had $980,000 placed in a fixed deposit account which would mature on 12 July 1997. The plaintiff showed her a fixed deposit slip for $980,000 from OUB dated 12 July 1996 and said he would give her the sum upon maturity of the fixed deposit if she would sign the acknowledgement and insert the dates 19 and 30 September 1996 in the blank spaces on the document as the dates of receipt of the two sums stated of $480,000 and $500,000. (In court, the second defendant gave a different version[2]of how the acknowledgement came to be signed, according to what was told to her by the first defendant). 45        When the first defendant refused to sign the acknowledgement, pointing out she would only receive the moneys on or after 12 July 1997, the plaintiff told her he needed the acknowledgement for tax purposes and said she should do as she was told. Not wanting to refuse and at the same time to protect herself in case the plaintiff changed his mind later about giving her the fixed deposit amount of $980,000, the first defendant signed the acknowledgement but deliberately amended the figure $500,000 to $499,900. Little did the first defendant realise that the plaintiff was scheming to get the $980,000 which the second defendant had given her. The first defendant alleged the plaintiff knew the second defendant’s plans as he had overheard her conversation with the second defendant. 46        When the first defendant asked the plaintiff for the $980,000 after the fixed deposit matured on 12 July 1997, he gave the excuse that he needed the money for his business but repeatedly assured her he would give her the amount. To placate her, he gave the first defendant the title deeds to No 393 Balestier Road and No 19 Ringwood Road to hold as security.",
        "Findings of the court below": "47        On the first day of trial, counsel for the second defendant raised a preliminary point – was the plaintiff suing in his personal capacity or on behalf of the mother’s estate? His counsel confirmed that the plaintiff was suing in his own name and agreed that should the court find that the money did not belong to the plaintiff, the court would have to dismiss his claim, even if it found that the money which the first defendant brought to Australia was handed to her by the plaintiff and not by the second defendant. 48        The district judge found discrepancies and inconsistencies in the evidence of all three parties. 49        On the part of the plaintiff, she found that although he had the means to give $1m to the first defendant, his testimony on the source was inconsistent. At one point, he said it was his money. She noted that in his affidavit of means, the plaintiff had deposed that it was only after the mother’s demise that he dared to use her money by giving $1m to the first defendant for the sons’ education and that he informed his siblings about it. In cross-examination, he said he did not inform his siblings. I noted that in his affidavit evidence,[3]he deposed that when the mother died, there was constant fear that his money would be taken away by his siblings or that he would be cheated of his money. 50        It was the plaintiff’s evidence that the first defendant wanted him to gain control of Hoo Sun after the mother’s demise. That was the reason why he eventually bought out Chia’s interest for $200,000. The plaintiff remitted his money to Australia (and later also to Brunei) at the first defendant’s urging as she was afraid his siblings would forcibly take his money away from him. When counsel for the second defendant pointed out that his explanation of hiding his assets from his siblings made little sense as, after remitting $1m to Australia (and $500,000 to Brunei), the plaintiff still had an excess of $2.5m in his OUB account, the plaintiff offered no explanation. I noted that the plaintiff’s income tax returns for years of assessment 1997 and 1998 showed he declared interest he had earned from fixed deposits. The plaintiff deposed this was done on the instructions of the first defendant to his tax agents. 51        Another aspect of the plaintiff’s testimony which the district court found to be inconsistent related to why he remitted the $1m in two tranches instead of giving the sum to the first defendant in one go. The plaintiff had explained that after the first draft was purchased, he did his calculations and realised that a $1m deposit would generate monthly interest of $4,000 to $5,000 which would be more than enough to cover the sons’ expenses, based on the first defendant’s estimate of A$2,000 per month. He also said he liked to do things that way. However, when he was cross-examined, the plaintiff said he made his calculations in June, July and August 1996, before the first remittance was effected. Later he changed his evidence and said his oral testimony was incorrect and his affidavit evidence was correct. 52        The plaintiff had deposed in his affidavit that besides the higher fixed deposit interest rate in Australia (6%) as compared with Singapore (4%–5%), his reason for the second remittance was his dispute with his siblings. 53        The district judge concluded from the constant shift in his position that the plaintiff was actively hiding his money from his siblings. In fact, the defendants were helping him in this respect. The plaintiff gave conflicting evidence because he was caught in a bind as to whether to speak the truth,vizthat he was hiding his assets from his siblings, or give the impression in court that he was not, so as not to offend his siblings. He lodged a police report on 18 July 1996 because the plaintiff truly believed his siblings might harm him and/or his family. 54        The plaintiff had denied he was in Brisbane on 19 April 1997. However, he did not produce his passport to verify the defendants’ allegation, claiming the first defendant had broken into his locked drawer (which she denied) and stolen his passport therefrom. The court below could not come to any finding on this allegation and cross-allegation as the plaintiff produced a record to show he was working on board a vessel between 17 and 21 April 1997, whilst the defendants’ subpoenaed witness, an officer from the then Singapore Immigration & Registration Department could not give any information on whether the plaintiff left Singapore on 19 April 1997. At the submission stage, the second defendant’s counsel was told that the Australian authorities could disclose whether the plaintiff had entered Australia on 19 April 1997, provided the plaintiff consented to the release of the information, which his counsel said he did not. The judge quite rightly excluded from consideration in her decision, the possibility that such evidence if called, would prove the plaintiff was lying. 55        As for the first defendant, the district judge found it strange that she would need the second defendant to open a second box for her with OUB when the first defendant had her own safe deposit box with OCBC where she could keep her documents and jewellery worth $15,000–$20,000. Further, there was evidence that the first defendant had kept cash of $160,000 from 1995 to October 1997 in her flat. Why did she not put the amount in her safe deposit box or in the second box? The district judge further noted that the agreement dated 28 June 1996 prepared by Ng which governed the use of the first box was only signed by the two defendants and not the plaintiff. Consequently, the plaintiff would not know that the second defendant only allowed the first box to be used for the safe keeping of jewellery and documents only. He would not be aware that cash, let alone $500,000, was not to be kept in the first box. The court found that it was probable the plaintiff did hide the cash of $500,000 in the first box. However, it seemed foolhardy as the plaintiff did not hold the key. (Indeed, under cross-examination,[4]the plaintiff agreed he was foolish as the second defendant could have walked away with the cash.) 56        The district judge acknowledged the submission from the first defendant’s counsel, that the plaintiff’s method of purchasing the second draft of A$448,139.85 was strange. He could easily have debited his OUB account with $500,000 instead of making two cash withdrawals of $200,000 and $300,000 respectively. However, she reasoned that it appeared to be the plaintiff’smodus operandias, even for the second fixed deposit he placed in Brunei, he similarly made a cash withdrawal of $400,000 from his OUB account to buy a draft which he and the first defendant hand-carried to Brunei. This transaction was not disputed by either defendant. 57        The district judge was sceptical of the generous “ang pow” of $20,000 which the second defendant claimed to have given the first defendant. She noted that Ng too was a friend of the second defendant and had assisted the latter, like the first defendant, in conveyancing matters. Yet, Ng was never the recipient of such generosity. Ng only received from the second defendant red packets for Chinese New Year of amounts ranging from $50 to $100. 58        The court was equally sceptical of the second defendant’s financial means. An accountant, Ow Fook Sheng (“Ow”), had testified that he assisted the second defendant in her tax matters between 1981 and 1991. Ow had estimated that the second defendant had $2m excess from her sources of funds, less expenses, from unsold properties. He said she would have at least $1m at her disposal in September 1996. 59        In her written testimony, the second defendant exhibited her income tax assessments for the years 1981 to 1991 which showed income totalling $799,464. I noted therefrom that her taxable income for individual years ranged from a low of $48,000 per annum to a high of $95,464. After her retirement in 1991, her income dropped although interestingly enough her source of income was only from interest. I further noted that for the year of assessment 1992, the second defendant had interest income of $55,215. On the basis that the then fixed deposit interest rate was 5% (based on the plaintiff’s testimony that rates for Singapore fixed deposits were 4%–5% in 1996), that would mean that the second defendant had a principal sum of $1,104,300 to yield that amount of interest. I am prepared to accept that the second defendant’s declared income during her years of running a successful brothel (with 20 “girls”) may well have been less than what she actually earned but it would have been difficult to prove, as hers was essentially a cash business. 60        The second defendant had deposed that her domestic help of 30-odd years, one Eu Yok Chan, gave her cash of $250,000 in September 1992 followed by $95,000 in February 1993. At about that time, she and Mdm Eu jointly purchased a Housing and Development Board (“HDB”) flat at Marine Drive, which flat was sold in December 1995. Mdm Eu gave her $142,000 from the sale proceeds. Mdm Eu passed away in May 2000 aged 89. 61        The second defendant’s own mother sold her HDB flat in July 1996 for $323,000 and gave the second defendant the sale proceeds. Her mother passed away in 2000. The two gifts to the second defendant would, however, not explain the second defendant’s access to $1m in funds in 1996 when she paid no income tax for that year itself. In any case, the first gift was made to her four years before 1996. 62        The court below found that, apart from her tax returns (which were historical records), the second defendant produced no documentary evidence of her source of funds. She had maintained that she always kept her moneys in cash. The court questioned why the second defendant would keep such a substantial sum as $1m in cash and forgo the substantial interest she could have earned therefrom. The second defendant’s claim that she liked to keep and look at $10,000 notes instead of putting her money in banks was at odds with her source of income post-retirement, which was only from interest. Ow had said the second defendant earned interest from various bank deposits and investments between 1981 and 1991. Even at 2% per annum, the court below noted that the second defendant could have earned $20,000 a year in interest, which is not a small sum for a retiree. The judge also referred to two letters written in 1999 by the second defendant’s lawyers wherein it was stated that the $20,000 red packet given to the first defendant came from the sale proceeds of a property at Lorong Mydin. In court, the second defendant had said the money came from her earnings. I would add that for years of assessment 1996 and 1997, the second defendant was assessed by the inland revenue authority to be not liable for income tax. 63        The district judge also did not believe the second defendant to be serious in her intention to invest in Australian properties. The documentation produced by the second defendant on her aborted purchase of No 55 Brunswick Street was held to be too informal. The second defendant did not consult solicitors on the purchase after signing the standard contract, she did no searches or valuations on the property (which was a motel) and the vendor was the guardian of the sons of the first defendant. The judge wondered why the second defendant paid the deposit in cash when she could have used the moneys in her Australian bank accounts. She found that the first defendant had no experience in property transactions apart from her purchase of her own HDB flat. Prior to September 1996, the first defendant had not visited Australia. There was no reason therefore for the second defendant to rely on the first defendant to find her an investment property in Australia. The judge also expressed doubts on Tan’s corroborative evidence which she found to be confusing and contradictory. She regarded Ng as an honest witness. 64        Consequently, the court below rejected the defendants’ case and held that the plaintiff, not the second defendant, had handed the sum to the first defendant. Although the plaintiff constantly shifted his position on whether he or Hoo Sun or the mother was the source of the $1m, the court believed his testimony on the receipt issue, relying onTeo Geok Fong v Lim Eng Hock[1996] 3 SLR 431where Yong Pung How CJ at 439, [44] relied on a Malaysian decision (PP v Datuk Haji Harun bin Haji Idris (No 2)[1977] 1 MLJ 15at 19) which held: There is no rule of law that the testimony of a witness must either be believed in its entirety or not at all. A court is fully competent, for good and cogent reasons, to accept one part of the testimony of a witness and to reject the other. 65        The district judge went on to make a further finding[5]that the $1m came from the profits of Hoo Sun, accumulated over the years. The business had three partners before 5 January 1996,vizthe plaintiff, the mother and Chia. On 5 January 1996, the mother withdrew from the partnership, followed by Chia on 5 April 1996. The court held that the $1m was in existence before 5 January 1996 and hence was the partnership’s property. 66        The district judge rejected the argument of counsel for the plaintiff that his client had bought out Chia’s share in the business by the agreement dated 28 September 1996. On a closer look at the document, she found that the plaintiff bought out Chia’s share and entitlement to the mother’s estate, not in the partnership, although the agreement also stated that upon payment to him of $200,000, Chia no longer had any interest in Hoo Sun. 67        Even if Chia had relinquished his interest in Hoo Sun, the court below held that there was no evidence that the interest of the mother or her estate in the business had been relinquished. Although the plaintiff claimed that the mother had given the business to him, the district judge noted that the agreement dated 28 September 1996 recognised the interest of the mother or her estate in Hoo Sun. 68        As there was no fixed term for the partnership, Hoo Sun was a partnership at will under s 26(1) of the Partnership Act (Cap 391, 1994 Rev Ed). Under s 33(1) thereof, the partnership would in any case have been dissolved by the mother’s demise in April 1996. The judge below relied on the UK Court of Appeal decision inPopat v Shonchhatra[1997] 1 WLR 1367for her decision that the individual partners had no title to any specific partnership property during the course of the partnership. 69        As there was no evidence that accounts of the partnership had been taken and insufficient evidence that the mother had given her interest in the partnership to the plaintiff, the district judge held that she could not determine the plaintiff’s entitlement in the $1m or the total $3.5m which was in his various bank accounts. Accordingly, as the plaintiff had not proved sufficiently that he owned the sum, the court dismissed his claim.",
        "Costs": "70        On the question of costs, the court below was of the view that 90% of the hearing was taken up with determining who handed the $1m to the first defendant. She further observed that the issue of ownership of the sum was only raised by counsel for the second defendant on the first day of trial, after voluminous affidavits and documents had been filed. Taking into consideration O 59 r 3(2) of the Rules of Court (Cap 322, R 5, 1997 Rev Ed) and Yong Pung How CJ’s decision inMCST No 473 v De Beers Jewellery Pte Ltd[2002] 2 SLR 1at [57], she felt no order for costs would be proper, even though the plaintiff’s claim was dismissed.",
        "The appeals": "",
        "The plaintiff’s submissions": "71        The plaintiff submitted that the district judge erred in law when she held that the plaintiff must prove ownership to the sum on his claim for money had and received. Counsel argued that the finding was untenable as neither defendant had pleaded that the plaintiff had no interest in the money or that he was not the owner of the sum. Indeed, in the ancillary matters arising out of the divorce proceedings, the first defendant had conceded that the plaintiff should be treated as owner of the $1m. In fact, the first defendant consistently took the position that the $3.5m from which the plaintiff took the $1m belonged to the plaintiff. Counsel submitted that the court below should not even have considered, let alone given weight to, the second defendant’s preliminary objection that the plaintiff must prove ownership. It was a substantive defence which should have been, but was not, pleaded. To be able to raise a preliminary issue, the second defendant must show that determination of the issue of law did not require ascertaining the facts which appeared from the pleadings. The pleadings did not show a lack oflocus standiby the plaintiff and there were no savings in costs in determining the preliminary issue. 72        CitingHalsbury’s Laws of Englandvol 9(1) (4th Ed Reissue, 1998) at pp 850–852, counsel submitted that in an action for money had and received, ownership was not a requirement. The plaintiff only had to prove: (a)        he was in possession of the money which is the subject matter of the action; (b)        he handed the money over to the defendant. Otherwise, banks would not be able to sue on their customers’ behalf for moneys credited to the accounts of, or paid in error to, other customers or third parties. 73        Counsel also argued that as a beneficiary of the mother’s estate, the plaintiff hadlocus standito sue in his own personal capacity, relying onOmar Ali bin Mohd v Syed Jafaralsadeg bin Abdulkadir Alhadad[1995] 3 SLR 388. 74        As the court had made a finding that the plaintiff handed the $1m to the first defendant, it was implicit in that finding that the court found the plaintiff’s version of the purpose of the handing over of the money was correct,vizthat it would be placed in fixed deposit to earn interest to cover the sons’ expenses. It must follow that the first defendant had no title or right to the money, even more so the second defendant. It was therefore wrong of the court below to dismiss the plaintiff’s claim and allow the defendants to retain the sum when the court had rejected their defences. 75        On the issue of costs, however, the plaintiff maintained it was correct for the court below to direct that each party bears its own costs.",
        "The defendants’ submissions": "76        Counsel for the defendants maintained a common stand on the appeals. Counsel for the second defendant pointed out that in the court below, another counsel who conducted the trial for the plaintiff had made the concessions referred to in [47] above. In the affidavits which the plaintiff filed for the divorce proceedings, he consistently maintained he owned the $3.5m. It was only in his 12th affidavit filed on 24 March 2000 that the plaintiff did avolte-faceand said the $3.5m came from Hoo Sun and therefore belonged to the mother’s estate. 77        Counsel for the first defendant submitted this was one instance where the court should reverse the findings of fact made below. This was because the district judge had noted many inconsistencies and contradictions in the plaintiff’s case (which counsel enumerated). 78        Counsel argued it was not inconceivable that someone in the second defendant’s profession would deal with money mainly in cash. He relied on Ow’s testimony that the second defendant would have surplus funds in excess of $2m or at least $1m at her disposal. 79        On the question of costs, it was submitted that since the court had ruled against the plaintiff on whether he owned the $1m, costs should be awarded to both defendants. 80        Counsel for the second defendant, while aligning himself with the submissions tendered on behalf of the first defendant, ventured further in his submissions to say that the plaintiff’s withdrawal of $1m cash from the joint Bank of China account he held with his sister, amounted to criminal breach of trust under s 405 of the Penal Code (Cap 224, 1985 Rev Ed). The plaintiff’s conduct was illegal and in furtherance of this illegality, he sought the defendants’ assistance to hide the $1m from his siblings. 81        The plaintiff had passed title in the $1m to the first defendant and the parties werein pari delicto. As the scheme to hide the money was illegal, the court should not lend its assistance to help the plaintiff to recover the sum. Counsel cited several cases includingTop Ten Entertainment Pte Ltd v Lucky Red Investments Ltd[2004] 4 SLR 559(which referred in turn toTinsley v Milligan[1993] 3 All ER 65) in support of this submission. 82        Counsel for the second defendant then referred to the Court of Appeal’s decision inArumugam v Lim Boon Neo[1987] SLR 147for the principles when an appellate court can substitute its own views for those of the trial judge. There, Wee Chong Jin CJ said (at 151): It is settled law that in cases where the credibility or reliability of one or more witnesses has been in dispute and where a decision on these matters has led the trial judge to come to his decision on the case as a whole, an appellate court may interfere with the decision of the judge in limited circumstances. The above principle was also applied by the Court of Appeal inPeh Eng Leng v Pek Eng Leong[1996] 2 SLR 305where Karthigesu JA held (according to the headnote): As regards a trial judge’s findings of fact, an appellate court should defer to his judgment if it was unable to say with certainty that the trial judge was plainly wrong. In deciding whether the trial judge was plainly wrong, the appellate court would evaluate the quality of the evidence given by the witnesses. This involved testing it against inherent probabilities or against uncontroverted facts, including the conduct of the parties at the relevant time. In this respect, the appellate court was in as good a position as the court of first instance. 83        Counsel argued that the trial judge should have but failed to draw an adverse inference against the plaintiff under s 116(g) of the Evidence Act (Cap 97, 1997 Rev Ed) for refusing to give his consent to the Australian authorities to release information on whether he entered Australia on 19 April 1997.",
        "The decision": "84        First, I shall address the evidence adduced at trial. I found it very strange that the plaintiff (and the first defendant at the time) should worry that the plaintiff’s siblings would lay a claim to his money if the $3.5m in his bank accounts indeed belonged to him. What right would the plaintiff’s brothers and Chia in particular have to the plaintiff’s money unless the source was Hoo Sun? There was ample evidence in the court below for the judge to arrive at her finding that the plaintiff was not the beneficial owner of the $1m or the remaining $2.5m. The moneys, whether partly or wholly, came from Hoo Sun. 85        It was no answer (as his counsel submitted) to say that the plaintiff was already the sole proprietor by the time he made this claim. I noted that the plaintiff did not call his sister Chia Ee Moey to testify. She was the joint holder of the Bank of China account from which the plaintiff initially withdrew $2.48m. Her evidence would have been most material and I find it telling that the plaintiff failed to call her as a witness. It is very likely that had she testified, the plaintiff’s sister would have said the money in the joint account came from Hoo Sun. 86        The accounts of Hoo Sun should have been drawn up on 5 January 1996 when the mother withdrew from the business. Unfortunately such legal niceties were overlooked by the plaintiff and the mother. The accounts should have been drawn up again four months later on 4 April 1996, when the mother passed away or, on 5 April 1996 when Chia withdrew from the business. Again it was not done. 87        It was not sufficient, as his counsel submitted, for the plaintiff to say he had aninterestin the $1m. He had to go further to prove theextentof his interest in the $1m. As he failed to do so, the court below could not make the determination on his behalf. 88        As for the second defendant’s ability to come up with $1m, I had in [62] above considered the probabilities of her having such a substantial sum tucked away at home. It seemed highly unlikely that a person in her position would have that amount of cash, let alone kept $1m in the house instead of depositing it in banks to earn interest, especially after she had retired from her brothel business. In this regard, I accept the submission of her counsel that her brothel earnings were in cash and it was not unlikely that her declared earnings to the income tax authorities would have been less than her actual takings. What cannot be ignored, however, is the fact that she had retired a good five years, by the time she claimed to have passed $1m to the first defendant to invest in Australia. What was her source of funds between 1991 and 1996? She failed to provide a credible explanation. 89        Counsel for both defendants had submitted the trial judge erred in finding inconsistencies in the plaintiff’s testimony and yet holding that he, not the second defendant, handed the sum to the first defendant. With respect, that argument is misconceived. There were two aspects to the plaintiff’s evidence: (a) did he hand the $1m to the first defendant? (b) was the $1m his money? The court below found on the first issue that the plaintiff did hand the sum to the first defendant. There was ample evidence that the plaintiff had withdrawn the sum from various bank accounts. I am not prepared to disturb the finding of the trial judge as she was not plainly wrong to have arrived at such a finding. 90        It was on the second issue that the trial judge found numerous inconsistencies in the plaintiff’s testimony, which she attributed to the fact that he was hiding, not his own money but Hoo Sun’s, from his siblings. Again, there was ample evidence to enable the court to make this finding. This second issue is separate and apart from the first issue. On this, there appeared to be some confusion on the part of counsel for both defendants. Applying the principles fromArumugam v Lim Boon NeoandPeh Eng Leng v Pek Eng Leong([82]supra), I will not disturb the findings made by the court below as there is no basis to do so. 91        Granted that in a claim for money had and received, there is no requirement at law to prove ownership, what should have been done by the district judge was to allow the plaintiff’s claim as pleaded, but with a direction that Hoo Sun or the administrators of the mother’s estate could come forward to claim the money back from the plaintiff. Such a direction would inevitably have led to further litigation which process was short-circuited by the orders the judge made. 92        A valid submission that was put forward by counsel for the plaintiff was the inequities of the consequence of the judgment below. The district judge had found that Hoo Sun, not the plaintiff’s own means, was the source of the $1m. The judge therefore erred in allowing the defendants or the second defendant to retain the sum. I agree. 93        Accordingly, whilst I am dismissing all six appeals with no orders as to costs, I will vary the judgment made below by ordering the second defendant to return the $1m together with interest as claimed (at 6% per annum) to the plaintiff’s solicitors, pending resolution of the issue of who actually owns the sum beneficially. Appeals dismissed. [1]See Record of Appeal 1617[2]Para 75 of the grounds of decision[3]Para 110[4]N/E 31[5]Paras 111–120 of the grounds of decision"
    }
}