{
    "case_title": "Public Prosecutor v Siew Boon Loong",
    "ncitation": "[2005] SGHC 20",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Facts": "2          At the material time, the respondent worked as a courier for Victor Sims Services (“VSS”), which DHL Express Pte Ltd (“DHL”) had engaged to provide courier services on its behalf. The victim was one Daniel Koh Guan Hick (“Koh”), an IT manager for Misys International Financial Systems Pte Ltd. 3          On 28 September 2004, Koh engaged the services of DHL at about 2.30pm and later again at about 3.50pm. On each occasion, Koh wanted DHL to courier a parcel containing a laptop valued at $4,700 to Australia. In all, DHL was to courier two parcels, each containing a laptop, to Australia. On both occasions, DHL engaged VSS to perform courier services on its behalf, and in turn, VSS instructed the respondent to collect the parcels. The respondent collected the first parcel at 3.00pm, whereupon he went to the toilet, removed the laptop from the parcel, and hid it behind the toilet bowl. He did the same to the second parcel, which he subsequently collected at 4.00pm. After the respondent reported off from work, he returned to the toilet to retrieve the two laptops. The respondent later handed over the laptops to one Melvin Sim Peng Wei to sell them. The dishonest misappropriation of the laptops formed the basis of the CBT charges. 4          Subsequent to committing CBT, the respondent committed theft-in-dwelling on 3 October 2004, for which he was convicted and sentenced to one month’s imprisonment. Prior to this conviction, no action had been taken against him in respect of the earlier CBT. Almost immediately after being released from imprisonment for the theft-in-dwelling offence, the respondent voluntarily surrendered to the police and owned up to the earlier CBT that he had committed. More than a week after the respondent was released from imprisonment, on 5 November 2004 at about 5.23pm, one Roger Ng Koon San, a field support officer for DHL, lodged a police report after Koh informed him that two laptops were missing from the parcels upon delivery to Australia.",
        "The decision below": "5          In light of the respondent’s criminal antecedents, the trial judge duly noted that the respondent was not a first-time offender, and considered this to be an aggravating factor. However, the trial judge was also of the view that there were significant mitigating factors, namely the respondent’s early plea of guilt, his voluntary surrender to the police, and the full co-operation he rendered to the police that eventually led to the recovery of the laptops. In the circumstances, the trial judge felt that a total sentence of six weeks’ imprisonment in respect of both CBT charges would meet the ends of justice.",
        "The appeal": "6          The Prosecution contended that the total sentence of six weeks’ imprisonment was manifestly inadequate. Counsel for the respondent conceded that the sentence might be inadequate, but not so manifestly inadequate that I should disturb it. He also argued that there were exceptional mitigating circumstances in this case. In urging for the sentence to be enhanced, the Prosecution advanced several submissions before me, to which I now turn.",
        "The respondent’s criminal antecedents": "7          The Prosecution submitted that the trial judge had failed to sufficiently take into account the respondent’s repeated and similar antecedents up to the moment of sentencing. The Prosecution was of the view that the respondent’s antecedents revealed his lack of hesitation to obtain financial gain by dishonest means, as well as a propensity towards committing property offences. As such, the Prosecution felt that the trial judge should have regarded his criminal history as a strong aggravating factor. 8          The respondent had committed various offences against property, both as a juvenile, and as an adult. As a juvenile, he was charged with attempted lurking house-trespass by night, for which he was given a stern warning in lieu of prosecution. Subsequently, he was charged with simple theft, and was consequently placed on probation with a one-year stay at Bukit Batok Hostel. As an adult, he was charged with theft-in-dwelling and was sentenced to one month’s imprisonment as mentioned earlier. Theft-in-dwelling 9          In respect of the theft-in-dwelling offence, I noted that this was committed subsequent to, and before any action had been taken against him for, the CBT offences. Nevertheless, the conviction in relation to the theft-in-dwelling offence was a relevant antecedent that could and should be taken into account when considering the sentence for his CBT offences. InPP v Boon Kiah Kin[1993] 3 SLR 639(“Boon Kiah Kin”), I had stated at 647–648, [37] that: [A]ll earlier offences of similar nature should be put before a sentencer, regardless of whether the convictions therefor were obtained before or after the commission of the offence for which the defendant is being sentenced. InSimYeow Seng v PP[1995] 3 SLR 44, I had reiterated the same at 47, [8] that: [A] sentencing court should have regard to all of the accused’s antecedents up to the moment of sentencing because these antecedents reveal his character, his attitudes and the likelihood of rehabilitation. So long as previous convictions are shown to exist, therefore, it does not matter whether they were in respect of offences committed before or subsequent to the offence for which the court is considering sentence. 10        The Prosecution referred me toLim Poh Tee v PP[2001] 1 SLR 674, where I had stated at [40] that: [The appellant’s] previous conviction for an unrelated offence of corruption committed in 1998 [after the corruption offence for which the court was considering sentence], revealed his propensity to corrupt means of self-enrichment and correspondingly, a need to deter him from gravitating towards such wrong-doing. Accordingly, the district judge was fully entitled to take his previous conviction into account. I took a dim view of the appellant in that case, notwithstanding that his previous conviction was in relation to an offence committed subsequent to the offence for which the court was considering sentence. This was because the subsequent offence was in fact of the exact nature as the earlier offence, both being corruption offences punishable under s 6(a) of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed). The present case was quite different. I therefore reverted toBoon Kiah Kin, where I had stated at 648, [37] that: Where the accused was convicted of the earlier offence only after he committed the offence for which he is being sentenced, then normally he will have a better chance of persuading the court that circumstances relating to those earlier offences show that, in committing the offence for which he is being sentenced, he was not acting in defiant disregard of the law. If the court is persuaded that the element of defiance did not exist then it may certainly reflect its opinion in the sentence imposed, and perhaps in certain circumstances the court may even think fit to sentence the accused as if he were a first time offender. Admittedly, at first glance, it might be difficult to see, in light of the respondent’s juvenile antecedents, how it could be said that he did not act in defiant disregard of the law when he committed the CBT offences. However, this should become clearer after a closer examination of his juvenile antecedents. Juvenile antecedents 11        The respondent has two previous convictions for property offences that he had committed before the CBT offences, albeit as a juvenile. By committing the CBT offences after having already been disciplined for committing past property offences, the impression of persistence to commit crime despite chastisement was therefore more obvious and harder to dispel:Boon Kiah Kinat 648, [37]. In this regard, the Prosecution labelled the respondent a “repeat offender” in respect of property offences, though presumably not in the strict sense of that term used when invoking specific enhanced punishment provisions. 12        The fact that the respondent had run afoul of the law when he was still a juvenile (as opposed to an adult) might go some way in dispelling such an impression, though this could not be overstated because the respondent had committed not one, but two, property offences when he was a juvenile. I noted, however, that the respondent’s juvenile antecedents were committed some 11 years ago. InLeong Mun Kwai v PP[1996] 2 SLR 338, I had stated at 342, [19] that: [F]or convictions which occurred a long time ago, it would also be relevant to consider the length of time during which the defendant has maintained a blemish-free record. In this case, the respondent’s juvenile antecedents were relatively dated, being more than a decade old. He had therefore managed to remain crime-free for a significant period of time until only recently. Accordingly, I was inclined to accord less weight to his juvenile antecedents. In all, taking the respondent’s antecedents in their totality, I was of the view that it would be appropriate to accord some, but not too much, weight to them.",
        "Aggravating manner in which the CBT offences were committed": "13        The Prosecution also submitted that the trial judge had failed to attach sufficient weight to the aggravating manner in which the respondent had committed the CBT offences. Having regard to the respondent’smodus operandi, I agreed with the Prosecution that the respondent had put in some thought and planning. He had also misappropriated property that was entrusted to him on not just one, but two, occasions. 14        Because of the nature of CBT offences, there is the inevitable element of deception in most, if not all, of such cases. However, the respondent’s conduct was arguably more reprehensible in that he had taken active and positive steps to deceive in order to avoid arousing suspicion. Firstly, he had hidden the laptops away, and had only returned to retrieve them later when he reported off from work. Secondly, as the Prosecution suggested and I agreed, he must have cautiously removed the contents of the parcel, and sealed it back carefully afterwards to avoid any suspicion that the contents had been removed. It was not clear whether the trial judge took into consideration the aggravating manner in which the respondent had committed the CBT offences. In my view, due weight should be attached to it. However, in any event, and fortunately for the respondent, there were strong mitigating factors, to which I now turn.",
        "Mitigating factors": "15        The Prosecution submitted that the district judge had placed excessive weight on the respondent’s plea of guilt and co-operation with the police. However, in my view, the respondent’s saving grace in this entire episode was his extensive display of genuine remorse and repentance. His voluntary surrender to and full co-operation with the police, as well as his early plea of guilt, therefore formed very strong mitigating factors against the aggravating factors. Voluntary surrender to and co-operation with police 16        InWong Kai Chuen Philip v PP[1990] SLR 1011, Chan Sek Keong J (as he then was) had expressed at 1014, [14] that: [T]he voluntary surrender by an offender and a plea of [guilt] by him in court are factors that can be taken into account in mitigation as they may be evidence of remorse and a willingness to accept punishment for his wrongdoing. However, I think that their relevance and the weight to be placed on them must depend on the circumstances of each case. I do not see any mitigation value in a robber surrendering to the police after he is surrounded and has no means of escape, or much mitigation value in a professional man turning himself in in the face of absolute knowledge that the game is up. In the present case, the respondent claimed, and the Prosecution did not dispute, that he had voluntarily surrendered to the police almost immediately after he was released from imprisonment for his theft-in-dwelling offence, and had owned up to the CBT offences that he had committed earlier. 17        It could not be said that the respondent had no choice but to surrender to the police because he knew that the game was up. The truth of the matter was that it took DHL slightly more than a month after the respondent had committed the CBT offences before it lodged a police report in respect of the missing laptops. The loss of the laptops was not reported to the police, even after the respondent was convicted and had finished serving his month-long sentence for theft-in-dwelling. It was not until the respondent had surrendered himself to the police and owned up to the CBT offences that such a report was subsequently lodged. As such, the state of affairs could not have suggested to the respondent that it was very likely that the law enforcement agencies would discover his guilt, and that there was no other way out but to surrender. 18        Upon his voluntary surrender, the respondent had fully co-operated with the police. The quality of his assistance was evident from the fact that the two misappropriated laptops were eventually recovered. As such, Koh, the victim, suffered little or no loss. Early plea of guilt 19        Credit can be given for a plea of guilt when it tends to show remorse on the part of the accused and also when it saves the court and the Prosecution time and expense:Sinniah Pillay v PP[1992] 1 SLR 225at 231, [27]. Arguably, this is,a fortiori, the case if such a plea is entered early. In the present case, the respondent had pleaded guilty at the very first opportunity. 20        InSim Gek Yongv PP[1995] 1 SLR 537, I had stated at 540, [7] that: [A] plea of guilt [does] not automatically merit a discount; for … the element of public interest must be considered by the sentencing court in deciding whether a discount ought to be given for a guilty plea. In certain cases, the circumstances may be such that any mitigating effect afforded by a guilty plea is heavily or even completely outweighed by the need for a deterrent sentence. The Prosecution argued that there was a need to pass a sentence that would deter the respondent from re-offending because of his alleged propensity for committing property crime. This was overstated. As I have already discussed, the respondent’s antecedents are either more than a decade old (juvenile antecedents), or in respect of an offence (theft-in-dwelling) that had been committed subsequent to the CBT offences. As such, it would be inappropriate to accord too much weight to them. 21        The Prosecution also argued that ensuring couriered goods arrive safely at their intended destination was a countervailing public policy against giving a discount in sentence to the respondent for his early plea of guilt. To my mind, there is, however, an even greater public interest in encouraging a guilty person to come forward to disclose the facts of the offence that he has committed, and to confess that he is guilty of that offence. Thus put, giving significant weight to an early plea of guilt, or for that matter, any other indicators of remorse and repentance, is entirely consistent with the public interest.",
        "Sentencing precedents": "22        In appeals against sentence, it is frequently submitted that the sentence is “manifestly inadequate” or “manifestly excessive”, as the case may be. When a sentence is said to be manifestly inadequate, or conversely, manifestly excessive, it means that the sentence is unjustly lenient or severe, as the case may be, and requires substantial alterations rather than minute corrections to remedy the injustice:Liow Chow v PP[1939] 1 MLJ 170at 170–171. An appellate court must reject “the lore of nicely calculated less or more” in matters of sentence:Liow Chow v PPat 171. 23        In its written submissions, the Prosecution did not quantify exactly what the enhanced sentence should be to justify its contention that the original sentence was manifestly inadequate. Instead, it proffered a range of imprisonment terms from two to six months on the basis of three cited cases. In citing past cases, I should reiterate the caution that I sounded inSoong Hee Sin v PP[2001] 2 SLR 253at [12] that: [Any] attempt to reduce the law of sentencing into a rigid and inflexible mathematical formula in which all sentences are deemed capable of being tabulated with absolute scientific precision [will] be highly unrealistic. … In my view, the regime of sentencing is a matter of law which involves a hotchpotch of such varied and manifold factors that no two cases can ever be completely identical in this regard. While past cases are no doubt helpful and sometimes serve as critical guidelines for the sentencing court, that is also all that they are,iemere guidelines only. This is especially so with regard to the unreported cases, in which the detailed facts and circumstances are hardly, if ever, disclosed with sufficient clarity to enable any intelligent comparison to be made. At the end of the day, every case which comes before the courts must be looked at on its own facts, each particular accused in his own circumstances, and counsel be kept constantly and keenly apprised of the fact that it is just not possible to categorise cases based simply on mere numerals and decimal points. 24        During the appeal, the Prosecution conceded that enhancing the original sentence to two months’ imprisonment would not show that the original sentence was manifestly inadequate. It was therefore unnecessary to analyseQuek Thiam Seng @ Lim Cheok Seng v PP(Magistrate’s Appeal No 94 of 1994), which was cited by the Prosecution in support of a two months’ imprisonment sentence. The Prosecution then submitted that an enhanced sentence of six months’ imprisonment would be appropriate. In support, the Prosecution brought my attention toLim Henry @ Lim Boon Kwang Henry v PP(Magistrate’s Appeal No 75 of 2002) (“Lim Henry”). However, this case could be distinguished from the present one. 25        Firstly, Lim, the offender inLim Henry, was in a much higher position of trust, being Head of Projects with a construction company. The respondent in the present case was but a courier. Secondly, although Lim had recent antecedents that were, strictly speaking, not of a similar nature, they broadly shared the common thread of dishonesty. The respondent in the present case might have antecedents of a similar nature, but they are either too dated (the juvenile antecedents), or in respect of an offence (theft-in-dwelling) committed subsequent to the CBT offences. Thirdly, Lim only made restitution on the day of the trial, and as such, the trial judge felt that he was not genuinely remorseful, and would not have made restitution, if not for the trial. The respondent in the present case had fully co-operated with the police at a very early stage in the investigations, which led to the eventual recovery of the misappropriated property. Lastly, the trial judge found nothing spectacular in Lim’s mitigation. In contrast, the respondent’s mitigation in the present case was comparatively significant as I have stated above. 26        As for the remaining case,Lee Peng Tiak v PP(Magistrate’s Appeal No 163 of 1997), the Prosecution had reproduced a case summary of it. Whilst case summaries may be the best that there is in the absence of written grounds of decision, they do not disclose necessary details of the facts and circumstances with sufficient clarity to enable any intelligent comparison to be made. They may be helpful in providing practitioners with a broad sense of the sentences imposed for different permutations of variables, such as the amount misappropriated, the offender’s position of trust, whether restitution was made, whether the offender pleaded guilty, and whether the offender had antecedents. However, they are simply at too high a level of abstraction or generalisation for any meaningful comparison to be drawn. At such a level, analogies can be easily drawn, but they are likely to be misleading because a proper appraisal of the particular facts and circumstances is simply lacking.",
        "Conclusion": "27        Having careful regard to the peculiar facts and circumstances of this case, as well as the aggravating and mitigating factors, I was of the view that the sentence imposed by the court below was inadequate. I would have imposed a higher sentence if this case had come before me at first instance. However, sitting as an appellate court, I did not find that the sentence was manifestly inadequate. Interfering with it would be tantamount to minutely correcting it, rather than substantially altering it. 28        It bears repeating that this was a very unusual case indeed. A person who has just been released from prison will not normally rush to own up to other offences that he has committed, and risk being put back in prison again. The irresistible inference was that the prison environment had a positive impact on the respondent, and had made him feel sufficiently remorseful and repentant to want to confess his other transgressions of the law. In the circumstances, Counsel for the respondent did not have to do very much to convince me that this appeal could not succeed. Much credit is due to the respondent himself for his exceptional and commendable display of remorse and repentance. 29        Finally, I noted that the respondent had long finished serving his sentence on 8 December 2004 before this appeal was heard. The Prosecution informed me that it had kept to the prescribed time-lines, and that there was no delay on its part. For such future appeal cases, it may be prudent for the Prosecution to highlight to the Registry that the accused is serving a very short sentence, and is expected to be released before the appeal is heard, so that a decision can be made as to whether the appeal should be re-scheduled to be heard on an expedited basis. Appeal dismissed."
    }
}