{
    "case_title": "Koon Seng Construction Pte Ltd v Siem Seng Hing & Co (Pte) Ltd",
    "ncitation": "[2005] SGHC 8",
    "coram": "MPH Rubin J",
    "sections": {
        "Introduction": "1          In this case, the primary issue was whether there was a binding agreement between the plaintiff and the defendant for the supply of steel bars by the defendant to the plaintiff. After hearing the evidence, both documentary and oral, and arguments, I concluded that the plaintiff’s claim that there was indeed a binding agreement between the parties had not been established. My grounds now follow.",
        "Facts": "2          On 18 September 2003, the plaintiff, reportedly a large construction contractor, was awarded the main contract (“the main contract”) for the construction, completion and maintenance of the Singapore Management University City Campus – Victoria Project. After the award of the main contract, the plaintiff sent out various requests for quotations to a number of companies, including the defendant, for the supply of high tensile steel reinforcement bars (“rebars”). The request sent out by the plaintiff was somewhat brief and it merely mentioned that the contract period was “23 Months” and the quantity required was “Approximate 3600 ton [sic]”. 3          The defendant responded to the plaintiff’s request, by its letter dated 9 October 2003. In so far as is material, the said letter reads as follows: Siem Seng Hing & Co (Pte) Ltd Company: Koon Seng Construction Pte Ltd         From: Desmond Han Attention: Miss Tresa Sim/Mr Chong Wai Swee  Date: 9.10.2003 Message: Quotation For Building Material To SMU Victoria Project Parcel D2 Main Contract (Contract 3000) Further to our discussion, we are pleased to submit herewith our quotation for supply of building materials for your kind consideration. Reinforcement Steel Bar Product:            Mild Steel Round Bars and High Tensile Deformed Bars Technical Spec: BS444/1988 Grade 250 or SS2 Part 1/1999 Grade 3000 for Mild Steel Round Bars and BS4449/1988 Grade 460 or SS2 Part 2/1999 Grade 500 For High Tensile Deformed Bars Size:                 T10 T13 T16 T20 T25 T32 T40 R6 R10 R13 Price:                For 12M Straight bars At S$570 per M/Ton for 10mm to 32mm and R10 to R13 At S$585 per M/Ton for 40mm For off-site pre-fabricated steel bars Addition charge of S$85.00 per M/Ton over the above price of Standard length rebars. Price quoted inclusive of wastage but exclusive of preparation of BBS Bar chairs at S$1.00 per pce Quantity:           3600 ton Contract Period: 23 month Ordinary Portland Cement – Sand … Brick … Note: Order are subject to our final confirmation … Term of payment: 30 days from the date of invoice Please note that prices quoted above do not include GST and are subject to revision without prior notice. We hope you will give our quotation your kind consideration and we look forward to your favourable reply. Best Regards (signed) Desmond Han (Hp:96825004) Assistant Sales Manager [emphasis added] 4          Subsequently on 17 October 2003, the defendant, admittedly upon the request of the plaintiff, amended the quoted price for 12M straight bars from $570 to $560 per metric ton for 10mm to 32mm and R10 to R13 bars, and from $585 to $575 per metric ton for 40mm bars. 5          On 23 October 2003, the plaintiff sent the following letter to the defendant: Koon Seng Construction Pte Ltd … Mr Desmond Han Siem Seng Hing & Co (Pte) Ltd … Dear Mr Han Singapore Management University City Campus – Victoria Project – Reinforcement Steel Bars We refer to the earlier telephone conversation between yourself and our Ms Tresa Sim on the abovementioned subject. We are pleased to confirm your supply of Mild Steel Round Bars and High Tensile Deformed Steel Bars, Straight Bars, to us at the following rate: 12m Straight Bars $560.00 M/Ton for 10mm to 32mm and R10 to R13 $575.00 M/Ton for 40mm The said prices are confirmed throughout the whole duration of this project. The steel bars supply shall conform to the applicable prevailing standards.The payment terms is fixed at 60 days from the date of invoice. We shall follow up with a Letter of Award to you subsequently. Thank you Yours faithfully WS Chong Snr Constr Manager [emphasis added] 6          Despite the declaration by the plaintiff in the final paragraph of its letter dated 23 October 2003 that it would follow up with a letter of award, no such letter of award was ever issued by it. In the meantime, on 30 October 2003, the defendant wrote to the plaintiff, this time, increasing the price to $575 per metric ton for 10mm to 32mm and R10 to R13 bars; and $595 per metric ton for 40mm bars. 7          Sequentially, the next written note from the plaintiff was on 6 January 2004. It reads: Koon Seng Construction Pte Ltd … To: Siem Seng Hing & Co (Pte) Ltd … Date: 06.01.04 Attention: Mr Desmond Han … Subject: Ordering of Reinforcement Steel Bars We refer to your quotation reference SSH/FX 923/03 dated 09.10.03 and our subsequent confirmation letter reference SMU(V)64-SSH/03 dated 23.10.03 for the supply contract of reinforcement steel bars for the above project. We are pleased to place order for the following high tensile deformed bars: 1.         20 tons of T25 – 12m straight bars 2.         20 tons of T20 – 12m straight bars 3.         10 tons of T13 – 12m straight bars 4.         10 tons of T10 – 12m straight bars Total Amount = 60 tons x $560/ton = $33,600.00 Kindly deliver to our site on 07.01.04 (Wednesday) before 12pm. Please contact Mr Desmond Low @ 9100 4094 at site should you need further clarification. Thank you. 8          The defendant’s response to the foregoing letter, the next day on 7 January 2004, was as follows: Siem Seng Hing & Co (Pte) Ltd … 7thJanuary 2004 Koon Seng Construction Pte Ltd … Attention: Ms Kelly Toh Dear Madam Order For Reinforcement Steel Bars Singapore Management University City Campus Project We refer to your fax ref : F78/SMU(V) dated 6 January 2004. Please be advised that we are unable to accept your order for the high tensile deformed bars. At the meeting held on or about 3 November 2003, our Mr Jimmy Lim had already informed your Mr Goh Koon Suan that as we are unable to obtain supplies of the steel bars from Natsteel, we are in no position to supply steel bars to you for use in the above project. We have used our best efforts to persuade Natsteel to supply the steel bars to us but they have been unable to accede to our request. In the circumstances, we regret that we cannot accept your order. Yours faithfully Siem Seng Hing & Co Pte Ltd (signed) Jimmy Lim Managing Director 9          There followed an exchange of letters between the parties as to their respective positions and legal proceedings were threatened. In the end, on 1 April 2004, the plaintiff commenced proceedings against the defendant.",
        "Pleadings": "10        In its Statement of Claim (amended subsequently), the plaintiff averred that the agreement between the parties was contained by or was to be inferred from the documents referred to earlier, in addition to a few mill certificates forwarded by the defendant to the plaintiff on 23 October 2003. The plaintiff alleged that the defendant by its letter dated 7 January 2004 repudiated the agreement between the parties and the plaintiff accepted the said repudiation by its letter dated 28 January 2004[1]and claimed damages to be assessed. 11        The defendant’s defence simply was that there was no concluded agreement between the parties and that the documents referred to and the conduct relied on by the plaintiff did not give rise to any inference that there was any concluded agreement between the parties. The defendant further contended that there was no consideration to support the alleged agreement. In any event, the prices quoted were subject to revision, the agreement was subject to contract and the payment terms were not agreed upon.",
        "Evidence": "12        There were five witnesses for the plaintiff. Most of their evidence revolved around the background facts. One significant aspect in the testimony of Goh Koon Suan (“Goh”), the managing director of the plaintiff, was in relation to a meeting allegedly held during the first week of November 2003. In this respect, his evidence, as appears at paras to 7 to 9 of his affidavit of evidence-in-chief (“AEIC”), reads as follows: 7.         Subsequent to the confirmation of the Defendants as the Plaintiffs’ steel supplier, I was informed by Tresa that the Defendants’ Jimmy Lim wanted to have a meeting with me. Accordingly, a meeting was fixed sometime on or about the first week of November 2003. 8.         When the Defendants’ Jimmy Lim came to my office for the meeting, coincidentally, a friend of mine, one Peter Chan was also in my office at the same time. Peter Chan also knew the Defendants’ Jimmy Lim and stayed during the whole of the meeting between Jimmy Lim and I [sic]. 9.         The Defendants’ Jimmy Lim informed me that he wanted to meet up with me to discuss the source from which the Defendants’ supply of steel would come from. He informed me that the Defendants had several sources and wanted to know whether the Defendants could supply the steel from these various sources. On this point, I called in Tresa to confirm the point on the Defendants’ source of steel as I recalled seeing some Mill Certificates being provided by the Defendants. Tresa confirmed that the Mill Certificates were from Natsteel and Eastern Steel. I highlighted to Jimmy that the Project Consultants might not approve if the supply of steel came from many sources due to the difference in the quality of the steel. Therefore, I informed Jimmy that we only require steel from a single source of supply which must comply with the Main Contract Specification. I then informed the Defendants’ Jimmy Lim that the Plaintiffs’ contract for the supply of steel was for a period of 23 months and the 1stpurchase order would in all likelihood only be made only in January 2004, so the Defendants had time on their hands to ensure that they had the steel from the sources which they had contracted for. The Defendants’ Jimmy Lim agreed with this point and Tresa was dismissed from the meeting. I recall asking Jimmy whether he was having any problem in supplying the steel to the Plaintiffs for this contract. He replied that there was no problem and even cited an example of how he had continued his supply of steel to one local main contractor incurring loss of a few thousand dollars per truckload. With that, the meeting ended. 13        Another witness for the plaintiff was Peter Chan Chong Sin (“Chan”), an old friend of Goh. He claimed that he was also acquainted with Jimmy Lim (“Lim”), the defendant’s managing director. He testified that he happened to be visiting Goh, sometime on or about the first week of November 2003 and was present when Goh and Lim were having a conversation in Goh’s office. He said that Goh and Lim were talking about the price of steel being confirmed at $560 and that Lim assured Goh that the defendants would still abide by the contract with the plaintiff should the price of steel increase. 14        For the Defence, there were two witnesses, Desmond Han Boon Kwang (“Han”), the assistant sales manager of the defendant and Lim. In so far as Han’s evidence was concerned, his comments as regards the plaintiff’s letter dated 23 October 2003, as appear at paras 13 to 16 of his AEIC, bear reproduction. They read as follows: 13.        My comments on the 23 October fax are as follows: (1)        At no time did I commit the Defendants to supplying the Plaintiffs with 12m Straight Bars at $560 per M/Ton for 10mm to 32mm and R10 to R13 and at $575 per M/Ton for 40mm; (2)        At no time did I commit on behalf of the Defendants that the prices quoted by me are “confirmed throughout the whole duration of [the] project”; (3)        At no time did I agree with Tresa on behalf of the Defendants that the payment term is fixed at 60 days from the date of invoice; and (4)        As far as I am aware the Defendants did not receive any “Letter of Award” from the Plaintiffs at any time whilst I was still under their employ. 14.        I wish to inform this Honourable Court that it was never made known to me by anyone what was the whole duration of the SMU project. I did not and I still do not know when the project started and when it was supposed to be completed. Without such confirmation I could never have committed the Defendants to hold the prices of the rebars for “the whole duration of the project.” If the Plaintiffs’ allegations are true, which I wholly deny, it means that I had agreed on behalf of the Defendants to offer to sell the Plaintiffs rebars at a fixed price for an unknown and indeterminate period at a time when market prices of steel products in Singapore were most volatile. I could not and would never have done that. 15.        As for the alleged 60 day payment term, I stress that there was absolutely no discussion between Tresa and I [sic] on this issue in our telephone conversations. The Defendants’ standard payment term at all times was 30 days. This is clearly stipulated in the quotation dated 9 October 2003, the amended 9 October quotation and the 30 October quotation. It would not have been possible for me to extend the payment term from 30 days to 60 days as such an important change would have required the consent of Jimmy, which I did not have. 16.        When I received the 23 October fax, Jimmy was not in the office. I believed that he had already left on a business trip to China. When he returned on 29 October 2003, I brought the 23 October fax to his attention. Jimmy is the one who would do the sourcing. It was not part of my duties to do it. … 15        Lim’s evidence was that the defendant was only a “middleman”. He said that the defendant did not stock steel bars because the price of steel was highly volatile and to do so would require substantial capital investment. As such, before any contract to sell steel “rebars” was entered into by the defendant, it would first have to secure a back-to-back contract with one of its suppliers at a price with a profit element built in. It was for that reason that the defendant always inserted terms and conditions in its quotations to the effect that the orders were subject to final confirmation and that the prices quoted were subject to revision without prior notice. He added that the defendant could only confirm a sale at a certain price after it had obtained a similar commitment from a supplier. As regards the meeting with the plaintiff’s Goh, he said that meeting was on 3 November 2003. His testimony in this regard, as averred by him in paras 16 and 17 of his AEIC, reads as follows: 16.        Thereupon on the evening of 3 November 2003, I met with Mr Goh at his office together with Desmond and Peter. Tresa joined the meeting after it had already started. I related to Mr Goh the difficulty I had encountered in trying to secure a contract for the rebars. I told him that I could only deal with LiSteel as they were the only major steel suppliers entitled to supply steel products to the SMU peoject. I explained that LiSteel refused to supply the rebars at the prices set by the Plaintiffs and that by reason thereof the Defendants could not do the job at the prices the Plaintiffs wanted. I further told him that even at $575 per M/Ton for the smaller rebars and $595 per M/Ton for the 40mm rebars, I was not even sure I could still do the job as the smaller major suppliers were reluctant to supply the rebars through dealers like the Defendants. 17.        Mr Goh then chastised Desmond for offering to supply rebars at prices the Defendants were unable to honour. He also indicated had he been any other customer he would sue the Defendants. As I did not wish to antagonise Mr Goh and get into an argument with him over his statement, I kept quiet. I told him that I could not make any promises but I would try my best to talk to LiSteel to see whether they could supply the rebars at the prices set by the Plaintiffs. I promised Mr Goh that I would call him to tell him whether I have been successful. The meeting ended on that note.",
        "Arguments in a synopsis": "16        It was submitted by counsel for the plaintiff that there was a concluded contract between the plaintiff and the defendant as at 23 October 2003 and that the said contract was contained in or evidenced by or was to be inferred from the documents referred to in [3] to [8] above. He submitted further that in pursuance of the said contract the plaintiff placed an order for 60 tonnes of steel bars on 6 January 2004, but the defendant repudiated the contract on 7 January 2004. 17        The contention by counsel for the defendant was that the quotation dated 9 October 2003 and the amended quotation on 17 October 2003 submitted by the defendant were nothing more than a mere supply of information by the defendant in response to the plaintiff’s inquiry as to the price. He, in this connection, invited the court’s attention to the following express provisions in the quotation which stated that: (a) “Note: Order are [sic] subject to final confirmation” and (b) “prices quoted above do not include GST and are subject to revision without prior notice”. These express words, according to the defendant’s counsel, were fatal to the plaintiff’s allegation that there was a legally enforceable agreement in existence between the parties. It was further submitted on behalf of the defendant that even if the quotation of the defendant were to be construed as an offer, the plaintiff’s letter dated 23 October 2003 did not constitute an acceptance in law. He further argued that the plaintiff’s so-called acceptance letter was the plaintiff’s attempt at binding the defendant to a bargain without, however, wanting to commit itself to the defendant in any way.",
        "Conclusion": "18        In determining the issue whether there was indeed a binding contract between the contestants, two main documents played a central role in this case. The first was the purported quotation from the defendant dated 9 October 2003, amended only as to price on 17 October 2003. The second was the so-called acceptance letter dated 23 October 2003. In the said quotation, apart from a Delphic note that the order was “subject to [the defendant’s] final confirmation,” it also stated that the “prices quoted … are subject to revision without further notice”. Such qualifications in the quotation, in my view, imported an element of ambiguity and uncertainty particularly as to price. The plaintiff, no doubt, did not seem to have recognised the ambiguity. The plaintiff’s acceptance letter equally fared no better. Apart from other troubling aspects, which would be dealt with later in these grounds, it ended with the sentence: “We shall follow up with a Letter of Award to you subsequently.” 19        According toBlack’s Law Dictionary(6th Ed, 1990), the word “award”, amongst other things, is used in the sense of “one awards a contract to the bidder”. However, in the case at hand, the plaintiff did not follow up with any letter of award. When asked why no letter of award was forwarded to the defendant, contrary to the statement that the plaintiff would follow up with a letter of award, Goh said that he did not deal with such matters and deflected the question to Chong Wai Swee (“Chong”), the senior construction manager of the plaintiff.[2]When Chong was later questioned, he said[3]that for simple products the plaintiff did not have a letter of award. I must presently observe that the attempted answer was glib and entirely sidestepped the question asked. 20        In my view, quite apart from the unsatisfactory nature of the quotation and form of its purported acceptance, the failure by the plaintiff to follow up with a letter of award was fatal to its claim. In fact, upon perusing a specimen letter of award of the plaintiff in relation to another contractor[4]it would seem that the letters of award of the plaintiff usually contained detailed provisions and left little room for ambiguity. In my evaluation, the present claim would not have arisen if the price of steel did not climb steeply since October 2003. If the price had indeed fallen, and if the defendant were to insist that the plaintiff should accept delivery of the stated amount of steel at the price stated, it would have been probable for the plaintiff to say that until and unless a letter of award was issued by it, no contract was afoot. In my analysis, the purported letter of acceptance was merely an indication of the plaintiff’s intention to enter into a contract with the defendant and nothing more. 21        InPagnan SpA v Feed Products Ltd[1987] 2 Lloyd’s Rep 601 at 619, Lloyd LJ summarised the principles of law in relation to the construction of contracts concluded by way of correspondence in the following terms: As to the law, the principles to be derived from the authorities, some of which I have already mentioned, can be summarized as follows: (1)In order to determine whether a contract has been concluded in the course of correspondence, one must first look to the correspondence as a whole(seeHussey v Horne-Payne). (2)Even if the parties have reached agreement on all the terms of the proposed contract, nevertheless they may intend that the contract shall not become binding until some further condition has been fulfilled. That is the ordinary “subject to contract” case. (3)Alternatively, they may intend that the contract shall not become binding until some further term or terms have been agreed;seeLove and Stewart v Instone, where the parties failed to agree the intended strike clause, andHussey v Horne-Payne, where Lord Selborne said at p 323: … The observation has often been made, that a contract established by letters may sometimes bind parties who, when they wrote those letters, did not imagine that they were finally settling the terms of the agreement by which they were to be bound; and it appears to me that no such contract ought to be held established, even by letters which would otherwise be sufficient for the purpose, if it is clear, upon the facts, that there were other conditions of the intended contract, beyond and besides those expressed in the letters, which were still in a state of negotiation only,and without the settlement of which the parties had no idea of concluding any agreement. (4)        Conversely, the parties may intend to be bound forthwith even though there are further terms still to be agreed or some further formality to be fulfilled (seeLove and Stewart v Instoneper Lord Loreburn at p 476). (5)If the parties fail to reach agreement on such further terms, the existing contract is not invalidated unless the failure to reach agreement on such further terms renders the contract as a whole unworkable or void for uncertainty. (6)        It is sometimes said that the parties must agree on the essential terms and that it is only matters of detail which can be left over. This may be misleading, since the word “essential” in that context is ambiguous. If by “essential” one means a term without which the contract cannot be enforced then the statement is true: the law cannot enforce an incomplete contract. If by “essential” one means a term which the parties have agreed to be essential for the formation of a binding contract, then the statement is tautologous. If by “essential” one means only a term which the Court regards as important as opposed to a term which the Court regards as less important or a matter of detail, the statement is untrue. It is for the parties to decide whether they wish to be bound and, if so, by what terms, whether important or unimportant. It is the parties who are, in the memorable phrase coined by the the Judge, “the masters of their contractual fate”. Of course the more important the term is the less likely it is that the parties will have left it for future decision. But there is no legal obstacle which stands in the way of the parties agreeing to be bound now while deferring important matters to be agreed later. It happens every day when parties enter into so-called “heads of agreement”. [emphasis added] 22        In my determination, the intention that the contract should not become binding until the said letter of award was issued was unmistakable. In the premises, the plaintiff’s contention, that there was in existence a binding contract between the parties as of 23 October 2003, was unsustainable. 23        Proceeding further, there were other deficiencies in the plaintiff’s acceptance letter. In the quotation letter, the defendant had stipulated the term of payment to be 30 days from the date of invoice. But the acceptance letter varied it to 60 days from the date of invoice. On this, the plaintiff’s evidence was that the variation was inserted with the consent of the defendant’s Han. But Han denied this. In the absence of any written confirmation or contemporaneous documentary evidence from the plaintiff to support the variation, I found it difficult to hold that the plaintiff had established that there was any agreed variation. 24        The issues were further compounded when the defendant wrote on 30 October 2003 to increase the price. Such an act by the defendant did not seem to have produced any immediate protest or written demurrer from the plaintiff. 25        As regards the claim by the plaintiff that during the first week of November 2003, Lim agreed to affirm and stand by the terms of the original contract, this was swiftly denied by the defendant. Although Chan attempted to corroborate the claim of the plaintiff in relation to this aspect, I found the claim of the plaintiff to be highly suspect, since the plaintiff not only seemed to have omitted to record the alleged oral confirmation in any exchange of letters between the plaintiff and the defendant but also this alleged oral confirmation was singularly absent in the plaintiff’s Statement of Claim. I did notice, however, that in para 2 of the Statement of Claim there was a cryptic reference to the conduct of the defendant. However, the alleged conduct was not particularised and remained a mystery until the hearing. Be that as it may, in my evaluation, the phraseology employed by both parties in their respective letters did not lend itself to the inference that there was any concluded contract between the parties. In fact, the plaintiff was hoist with its own petard when it deliberately chose to end its so-called letter of acceptance dated 23 October 2003, with the statement that it would follow up with a letter of award, which it never did. In any event, before any letter of award was issued, the defendant by its letter dated 30 October 2003 revised the terms of its earlier quotations and this development effectively put paid to any argument that the order issued by the plaintiff on 6 January 2004 could be construed as a valid acceptance of the defendant’s earlier offer. 26        In my conclusion, inasmuch as the plaintiff did not follow up with its letter of award, the contract, as submitted by counsel for the defendant, remained incomplete. Additionally, the terms as to time of delivery, delivery of location, delay in delivery, the party responsible for unloading at site, were all yet to be agreed upon between the parties. According to the plaintiff’s witnesses, the said terms were all important. If the letter of award were to be issued, these terms would most naturally have found their place in it, as could be viewed from the specimen letter of award of the plaintiff produced at the trial. 27        After reviewing all the evidence adduced at the trial and after considering all the arguments presented, I was of the opinion that the plaintiff had not on a balance of probabilities established its claim. As observed by me earlier, there was no concluded contract between the parties and consequently there was no breach on the part of the defendant. In the premises, the plaintiff’s claim was dismissed with costs. Claim dismissed. [1]AB 200-201[2]Page 78, lines 6 to 13 of 27 October 2004 NE[3]Page 60, lines 13 to 20 of 28 October 2004[4]AB 407 to 410"
    }
}