{
    "case_title": "Wong Teck Long v Public Prosecutor",
    "ncitation": "[2005] SGHC 123",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The relevant facts": "2          At the material time in 1997, the appellant was working concurrently as an assistant vice-president and a manager of private banking with the Singapore branch of Bayerische Landesbank Girozentrale, a bank incorporated in Munich, Germany (“the bank”). The Prosecution and the Defence offered different versions of events.",
        "The Prosecution’s version of events": "3          The Prosecution’s version of events was largely premised upon the evidence of Kong Kok Keong (“Kong”), the giver of the gratification. Kong testified that he needed RM100m in credit to buy some “hot” shares from one Datuk Joseph Ambrose Lee (“DW3”), with the option of selling the shares back to DW3 at a higher fixed sum or at the prevailing market rate, whichever was higher. DW3 was to help Kong obtain financing to buy the shares. 4          Subsequently, DW3 met up with the appellant, together with Kong, at a hotel lobby in Singapore, during which the subject of arranging for a quick RM100m loan from the bank was broached. Kong learnt from the appellant that the credit limit that could be approved locally for an individual account was only about RM14.5m. A single loan of RM100m would have to be approved by the bank’s head office in Germany and this would take time. When asked how this could be overcome, the appellant suggested opening more accounts, each to be operated by Kong as an authorised third party, so that he would have effective control of the combined sum in credit. The account-holders, however, had to be high-net-worth individuals. 5          To this end, Kong referred six persons closely associated with him to be account-holders and together, they applied to open seven accounts, each applying for RM14.5m in credit facilities. The letters of authority and the third-party specimen signature cards (“the third party instruments”) in relation to the six accounts were also completed together with the account opening forms to authorise Kong to operate the accounts. The six persons, however, were not high-net-worth individuals. 6          The appellant colluded with Kong in submitting false information to the bank’s management on the estimated net worth of these six persons. The appellant told Kong that he could submit any figures of personal net worth. At first, Kong submitted estimated net-worth figures that the appellant thought were too modest. Kong then re-submitted fictitious figures that the appellant had suggested would be appropriate for the purposes of the approval of the credit facilities. Without obtaining supporting documents to prove the applicants’ estimated net-worth, the appellant then recommended the grant of the credit facilities to Kong and the six persons referred by him. Subsequently, the bank approved the credit facilities and issued the loans within a week. 7          Previously, the appellant had also told Kong that it would take a lot of hard work to arrange for the loans within such a short period of time, to which Kong responded by assuring him that there would be due rewards. After the bank granted the credit facilities, Kong told the appellant that he had prepared his reward, which was a sum between RM300,000 and RM400,000. To prevent establishing any direct link with Kong, the appellant asked Tay Siew Choo (“PW3”), his elder sister-in-law, to open an Innosabah trading account (“Innosabah account”). He then arranged for Kong to pay the RM300,000 to RM400,000 for a certain quantum of a particular share counter (“YCS shares”) through the Innosabah account.",
        "The Defence’s version of events": "8          The Defence essentially led evidence to discredit Kong’s version of events. To explain the trading of YCS shares through PW3’s Innosabah account, the Defence also led evidence to show that Wong Teck Chong (“DW4”), the appellant’s elder brother, had traded in the shares through his wife’s (PW3’s) Innosabah account, and that he had personally arranged for the payment of those shares. 9          The Defence also denied that the appellant knew of the arrangement between Kong and the six other account-holders. According to the appellant, the third-party instruments in relation to the six accounts were never completed at the point of submission of the account opening forms. The Defence further relied on a transcript of a taped conversation between the appellant and Kong, wherein Kong asked for the appellant’s help to write a letter stating that the other account holders were actually his nominees. The appellant responded by saying that he did not want to get involved and further, that he did not derive any benefit. The Defence submitted that Kong did not refute the appellant’s statement and also never insisted that the appellant was aware that the persons he had introduced were actually his nominees during the taped conversation.",
        "The decision below": "10        After closely examining the evidence before him and carefully assessing the credibility of the witnesses, the trial judge chose to believe Kong’s version of events. He was satisfied that the Prosecution had proved all the elements of the charge beyond a reasonable doubt. Accordingly, he found the appellant guilty of the charge and duly convicted him (PP v Wong Teck Long[2005] SGDC 44).",
        "The appeal": "11        Counsel for the appellant appealed against both conviction and sentence. Before me, counsel effectively abandoned the appeal against sentence. Instead, he urged me not to disturb the sentence and penalty that the trial judge had imposed. The appeal against conviction was based on several grounds, none of which justified overturning the conviction. I deal with each in turn.",
        "Error in the charge": "12        Counsel for the appellant submitted that there was an error in the charge, which ought to have been amended before the trial judge convicted the appellant. According to counsel, the charge against the appellant was for doing a favour for Kong,viz, recommending the grant of loans of RM14.5m each to Kong and the six persons referred by him. Counsel argued that the appellant’s act against his principal’s affairs was not in recommending Kong’s application, but the applications of the six persons referred by Kong. This was because Kong, unlike the six other account-holders, was a person of high net worth, and he would have qualified for the opening of the account and the revolving credit facilities granted under the account. Counsel therefore submitted that the charge ought to have been amended, to make it clear that the appellant was convicted for corruptly obtaining gratification for doing Kong a favour in connection with six, not seven, applications for credit facilities. 13        In my view, however, the circumstances that surrounded the charge had to be viewed in its entirety and taken as a whole. It was artificial to divorce Kong’s application from the other six applications. The six applications, together with Kong’s own application, was to enable Kong to effectively have access to a RM101.5m loan amount within a short span of one week, which he would not have otherwise got through a single individual account. Such an enormous loan amount granted under a single account could only be approved by the bank’s head office in Germany, and would arguably take time. I was therefore not satisfied that the charge was erroneous as counsel had alleged. 14        In any event, even if there was an error in the charge, counsel conceded before me that his client had suffered no harm in that he was not misled by the error. That being so, it was not a material error: see s 162 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed). In the circumstances, it was unnecessary to amend the charge.",
        "Evidence of Kong": "15        Counsel also took issue with the fact that the trial judge had accepted Kong’s evidence in full.Even ifKong, being the giver of the gratification, would be regarded as an accomplice, the combined effect of s 135 and illus (b) to s 116 of the Evidence Act (Cap 97, 1997 Rev Ed) is that the uncorroborated evidence of an accomplice can be relied upon to convict an accused, so long as the court has treated such evidence with caution: seeKwang Boon Keong Peter v PP[1998] 2 SLR 392at [29]. The trial judge was mindful that he needed to examine and scrutinise Kong’s uncorroborated evidence with extreme caution and circumspect, and had painstakingly considered Kong’s evidence, especially when Kong was under intense and rigorous cross-examination (at [144] of his judgment). His careful treatment of Kong’s evidence was without a fault. Furthermore, the trial judge, who has had the advantage of observing Kong’s demeanour in court, found him to be clear, cogent, forthright, comprehensive, patient and coherent at all times (ibid). 16        Counsel argued, in the main, that Kong had exaggerated in some of the court documents used in civil proceedings pertaining to matters connected to the present charge. In particular, Kong had pleaded that the appellant told him that the bank recognised that the loans made to him (Kong) were in fact loans to DW3. Kong agreed that by pleading this way, he had hoped to avoid liability on the loans. Counsel therefore submitted that Kong had a motive to give unfavourable evidence against the appellant. However, it should be duly recognised that Kong did not even attempt to conceal such exaggerations at trial. In fact, he was honest and candid about them. In stark contrast, the Prosecution rightly highlighted that the appellant had admitted to blatantly lying not once, buttwice, whilst on the stand. In fact, the Prosecution also successfully impeached the appellant’s credit. In the light of Kong’s demeanour in court, I was inclined to think, as the trial judge did (at [94]), that Kong had nothing to gain but everything to lose as his own evidence of the events could incriminate him, because it pointed to the fact that he was the giver of the gratification. 17        I was therefore satisfied that no appellate intervention was warranted in the circumstances, since the trial judge’s finding in this regard was based upon his assessment of Kong’s credibility and veracity, and the finding was not plainly wrong or against the weight of the evidence: seeYap Giau Beng Terence v PP[1998] 3 SLR 656at [24].",
        "Evidence of DW3": "18        Counsel then submitted that the trial judge was reluctant to accept DW3’s evidence because there was some bad blood between Kong and DW3. However, that wasnotthe only basis for preferring Kong’s evidence to DW3’s evidence. It was also coupled with the fact that the trial judge had found that DW3 was fairly defensive, if not evasive (at [121]), there were inconsistencies and contradictions in his evidence (at [123]) and some aspects of his evidence were inherently incredible (at [124]). 19        Seen in that light, the trial judge’s conclusion that DW3 was an unreliable witness and had come to court to refute Kong for the sake of refuting him was justified, and I found no reason to disturb it.",
        "The tape transcript": "20        Counsel also submitted that the trial judge had failed to consider the evidence of the tape transcript that bolstered the appellant’s case. However, DW7, the transcriber of the tape, testified on the lack of clarity and poor quality of the recording, as well as the possibility that the recording could have been tampered with as alien background sounds (flushing sounds of the toilet could be heard when the meeting was supposed to have taken place at a hotel lobby) were also captured in the recording. It was unsafe to accord any meaningful weight to the tape transcript, as it could not be confirmed that the recording of the conversation was complete, accurate and tamper-free. The trial judge was therefore right in giving little or no weight to the evidence of the tape transcript.",
        "Evidence of Manfred Wolf": "21        Manfred Wolf (“PW2”) is the bank’s general manager, as well as its principal officer (equivalent of chief executive officer). Counsel submitted that the trial judge erred in fact and in law in preferring PW2’s evidence in relation to the relevant practices and procedures of the bank. PW2 gave evidence that the act of endorsing and supporting a credit application from the appellant to the bank’s higher management was considered a “recommendation”. The appellant also had to obtain supporting documents to prove the client’s estimated net worth. 22        Counsel argued that the evidence of Richard Yong (“DW5”) should have been preferred because he was, at the material time in 1997, head of private banking and the author of one of the bank’s private banking manuals. In contrast, PW2 only started work as the operations manager at the bank’s Singapore branch in 1998, after the alleged corrupt transaction occurred. 23        DW5 gave evidence that the manual did not require private banking clients to prove their net worth, and also that the appellant did not make recommendations because there was no recommendation portion in the forms. The role of the appellant was simply to collate data and submit the application for credit facilities to the bank’s higher management for approval. 24        Although the trial judge found DW5 to be creditworthy and reliable, PW2 was no less relevant a witness by virtue of his independence and neutrality as he only came to work at the bank’s Singapore branch in 1998 after the alleged corrupt transaction occurred. In contrast, I noted that DW5 was the appellant’s superior. Counsel also argued that whatever PW2 could say about the practice and procedure of the bank were only those which existed after he joined in 1998. However, no evidence was adduced to show that the bank’s procedures and practices in 1997 were different from those in 1998. In any event, the trial judge noted that the Defence’s own witness, Ong See Ming (“DW6”), who was concurrently deputy head of private banking and senior account relations manager at the material time in 1997, concurred with critical parts of PW2’s evidence on the bank’s procedures and practices. The trial judge also noted that DW6’s evidence was more critical and relevant than that of DW5 since DW6 was the one who approved the opening of four out of the seven accounts.",
        "The account opening forms and letters of authority": "25        Counsel submitted that the trial judge erred in concluding that the appellant ought to have known of the arrangement between Kong and the six persons. This was because he made the wrong finding that the account opening documents and letters of authority were executed at the same time based on the types of ink on the documents. I was of the view that the trial judge was entitled to come to that conclusion, after providing an appropriate caveat that the court had no expertise in ink dating. In any event, that wasnotthe trial judge’s only basis to support that finding. 26        Earlier, the trial judge had already assessed both Kong (who gave evidence that the letters of authority were completed together with the account opening forms) and the appellant (who unsurprisingly gave evidence to the contrary), and found Kong to be more far more credible than the appellant. 27        Further, the trial judge rightly noted that it would have been impossible for the original letters of authority to have been signed by the six personsafterthe appellant received the account opening forms in April 1997, since they were Malaysian residents who had never come to the bank’s office in Singapore. According to PW2’s undisputed evidence, it was not the bank’s practice, once the bank’s staff had received the original account opening forms, to send out these forms to overseas clients for them to complete the third-party instruments. They had to come down personally to fill in previously uncompleted forms. Also, if the letters of authority had been left blank on the original account opening forms, the blanks would have been cancelled before submission to the operations department. The fact that the letters of authority were not cancelled evidenced that they had been completed by the time the appellant submitted them to the operations department. 28        In the circumstances, the trial judge’s conclusion that the appellant ought to have known of the arrangement between Kong and the six persons was therefore justified, and I found no reason to disturb it.",
        "Evidence of DW4": "29        Finally, counsel submitted that the trial judge was wrong to dismiss DW4’s evidence that offered a counter to Kong’s evidence that he had paid for the YCS shares. 30        I agreed with the trial judge that the problematic aspect about DW4 was that he was curiously able to remember perfectly almost every single detail about the YCS shares purchase, yet not so for his two other largest ever purchases through the Innosabah account. Coupled with the fact that DW4 was the appellant’s elder brother and that his evidence might be motivated to exonerate the appellant, it was plausible that DW4 was able to recall the details of the YCS shares purchase without a fault because he had fabricated the evidence about trading in YCS shares using the Innosabah account. 31        For the foregoing reasons, I dismissed the appeal against conviction.",
        "The cross-appeal": "32        The Prosecution cross-appealed against the sentence of four months’ imprisonment, and the default sentence of 15 weeks’ imprisonment. I allowed the cross-appeal and enhanced both sentences on the ground that they were manifestly inadequate in the circumstances. In my view, several aggravating factors, the public interest, and sentencing precedents warranted a lengthier sentence.",
        "Aggravating factors": "33        Firstly, the gratification sum of RM300,000 to RM400,000 was no paltry figure. Even after converting the lower end of that range (ie, RM300,000) and taking into consideration fluctuations of both currencies, the conversion came up to a very significant sum of S$150,000. 34        Secondly, as a result of the appellant’s corrupt acts, the bank suffered a substantial loss of RM72.5m. It did not matter that the loans were fully secured, and/or each of the six persons was only allowed to draw down an amount up to 60% of the collateral value. When the collaterals fell in value, such as in the persent case when the Asian financial crisis set in, the bank could have looked, apart from Kong, to the five account-holders (the loan granted under one account was repaid) to furnish further securities or to repay the loans granted to them in name, but for the fact that they were, in reality, men of straw whose true financial status was withheld from the bank because the appellant falsified their estimated net worth. This in turn, gravely affected the bank’s risk-assessment when granting the loans. The appellant’s acts misled the bank into believing that the risk of the loans granted under the seven accounts were well spread over seven individuals of high net worth, when in fact it was shouldered by Kong alone. Had the bank been appraised of the actual circumstances surrounding these loans, the wheels of financial calamity set in motion by the Asian financial crisis could have been restrained in so far as the accounts of Kong and the six persons were concerned, and the bank would not have suffered such a substantial loss. 35        Thirdly, the breach of the trust reposed in the appellant and the abuse of the appellant’s position were by no means insignificant, by virtue of the senior office he held in a financial institution as assistant vice-president and manager of private banking. This was to be taken as an aggravating factor.",
        "Public interest": "36        I was also of the view that public interest merited imposing a deterrent sentence in this case. The Prosecution brought to my attention that Singapore has witnessed a boom in the fast-growing private banking sector in recent times. Freedom from corruption is undoubtedly a magnet that attracts and assures wealthy private banking clients. To safeguard the overall public confidence in the integrity of our banking and financial industry as well as Singapore’s reputation as a regional and financial hub, punishment for deplorable and corrupt acts, such as that of the appellant, must be swift and harsh so that a strong message will be sent out to the offender at hand and would-be offenders that Singapore does not and will not, without exception, condone corruption.",
        "Sentencing precedents": "37        InPP v Tang See Meng[2001] SGDC 161(“Tang See Meng”), the accused, while acting as his employer’s contracts manager, corruptly received gratification sums on five occasions totalling $140,000 for recommending an award of a sub-contract. He was convicted of five charges under s 6(a) PCA and sentenced to a total of six months’ imprisonment, and a penalty of $140,000, in default, four months’ imprisonment, was imposed on him. The accused’s appeal against the sentence was dismissed in Magistrate’s Appeal No 62 of 2001. 38        The trial judge distinguishedTang See Mengfrom the present case on the basis that, in the present case, gratification was received only on one occasion as compared to five inTang See Meng. However, as the Prosecution rightly pointed out, although gratification was received on five separate occasions inTang See Meng, they had stemmed from one single corrupt transaction. Similarly in the present case, the gratification, albeit given on a single occasion, was also in respect of one single corrupt transaction by the appellant as an agent of the bank. 39        More significant, however, was the aggravating manner in which the offence was committed in the present case. The appellant had the presence of mind to come up with an elaborate arrangement for the gratification to be paid, with the sole aim of preventing any direct links from being established between him and Kong. In contrast, the mode of payment of the reward inTang See Mengwas simply by way of cheques on all five occasions. To my mind, the facts of the present case were therefore more aggravating than those ofTang See Meng. 40        I also considered the case ofWong Loke Cheng v PP[2003] 1 SLR 522.In that case, the appellant, who was the executive director of his employer company, was convicted of nine charges under s 6(a) PCA for corruptly receiving a total of US$90,377 (S$157,255.98) for recommending the charter of a vessel to his employer. The appellant was sentenced to ten months’ imprisonment, and a penalty of S$157,255.98, in default, 18 months and six weeks’ imprisonment, was imposed on him. His appeal against conviction and sentence was dismissed. 41        Considering the aggravating factors and the public interest in this case, and after reviewing the relevant sentencing precedents, I ordered that the sentence of four months’ imprisonment be enhanced to 15 months’ imprisonment. I did not disturb the penalty of $150,000 that the trial judge had ordered the appellant to pay. However, I agreed with the Prosecution that the default term of 15 weeks’ imprisonment in respect of the penalty would not deter the appellant from evading the penalty, and it would not serve as sufficient punishment in the event of a default: seeChia Kah Boon v PP[1999] 4 SLR 72at [15]. I therefore also ordered that the default sentence in respect of the penalty be enhanced from 15 weeks’ imprisonment to 15 months’ imprisonment. Appeal dismissed. Cross-appeal allowed."
    }
}