{
    "case_title": "Tan Chin Seng and Others v Raffles Town Club Pte Ltd (No 2)",
    "ncitation": "[2005] SGHC 38",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Reasons for the appellate court’s judgment on liability": "7The Court of Appeal has made findings of fact on liability and those findings are particularly pertinent and necessary for determining the amount of damages recoverable by the plaintiffs. It is convenient, at this juncture, to cite some of the relevant passages of the judgment delivered by Chao Hick Tin JA (seeTan Chin Seng v Raffles Town Club Pte Ltd (No 2)[2003] 3 SLR 307). 33What comes out clearly from the promotional materials is that the public (selected customers of financial institutions who were appointed as agents) were invited to join a club which was to be a premier club, described as “without peer in terms of size, facilities and opulence.” That was the central theme. We accept that a term should not be implied unless it is necessary to give the contract business efficacy, or unless it was a term which was so obvious that if any of the appellants were at the time to have asked RTC Ltd whether, notwithstanding the wide discretionary power conferred upon it [by r 6.1 of the Club’s Rules and Regulations], it would exercise those powers to ensure that the Club would, at all times, remain a premier club, [unequalled] in size, facilities and opulence, we would have no doubt that the answer given would be in the affirmative. … 35In our present case, while we recognise that the term “premier” is not one which can be defined with precision, we do not think it so obscure and vague a term that it should not be implied. It does convey the sense that it will be a club of distinction and pre-eminence, contrasting it to that of a run-of-the-mill type. It differentiates such a club from the ordinary club. … 37In our judgment, it must be implied into the contract which each appellant entered into with RTC Ltd that the Club would be a premier club, with first class facilities and that the discretion vested in RTC Ltd by the Rules would always be exercised in a manner consistent with the maintenance of the Club as a premier club. … 50Bearing in mind that we are here concerned with a “premier” club, it is clear that its facilities are inadequate to cater for the need of 19,000 members (plus their spouses, families and guests) in three major areas, the food outlets, the swimming pool and the gym; and probably also the bowling alley. The test of a premier club must surely be, besides the physical aspect, the ease with which members can gain access to facilities. While the occasional wait, such as [during] festive seasons, is acceptable, it should not be a regular feature on weekends and public holidays. It is plain logic that where you have a large number of members, the pressure on facilities will naturally increase, even though members may not turn up all at the same time or at the same regular intervals. 51At 19,000 members, RTC is the biggest club in Singapore and the next biggest club trails very much behind at 11,000 to 12,000. By failing to control the number of people RTC Ltd had admitted as members, it has breached its obligation of delivering a premier club to those who are admitted. Even the most luxurious of facilities will be turned into a “noisy market place”, in the words of some witnesses, if the number of members are just too large. … 8A potential problem of quantification of damages was apparently raised at the appeal. Chao JA, at [55], responded to that concern. In so doing, he touched on the decline in the price of RTC membership as compared with other clubs and also commented on a “dip” in price due to market conditions as something that is not recoverable as damages. It is clearly evident that the Court of Appeal did not lay down any basis for assessing damages.",
        "The heads of claim": "9Unlike the variety of claims raised and pursued in their Opening Statement and at the assessment, the plaintiffs have in their Closing Submissions confined themselves to two main types of damage claims: (a)Diminution in value of the membership which is computed at $15,925; and (b)Damages for loss of amenity, accessibility and enjoyment.",
        "Diminution in value": "10The plaintiffs’ claim for diminution in value is formulated on the basis that the breach of the implied term has resulted in the diminution in the value of the membership. In this formulation, the value of the membership is equated with price. Their counsel, Ms Molly Lim SC, contends that with 19,000 members, the Club had “degenerated into an ordinary or worse than an ordinary club” and had it not been for the breach, the value of RTC membership would still hold good today and would not have depreciated to the extent that it had. Ms Lim argues that diminution in value of the membership as reflected in the reduction in the price of RTC membership is the appropriate measure of the plaintiffs’ loss. 11The plaintiffs called Phua Geng Hoon (“Phua”), a partner of Tee-Up Marketing Enterprises and a club broker of 14 years experience. Her job entails the buying and selling of club memberships. She testified on the fall in the price of RTC membership after the Club opened in March 2000. Her evidence is that there were many sellers so much so that the price of RTC membership dropped. In May 2000, the price of RTC membership was about $28,000, but it went down to $16,000 in June 2000. It continued to decline steadily to $13,000 in December 2000 and then to $10,800 in February 2001. When the membership size of 19,000 became public, the price of RTC membership was $10,000. As at October 2003, the transacted price of RTC membership, based on her record, was about $7,300. In re-examination, she explained that presently, she received on average three to five telephone calls daily from RTC members who wished to sell their membership. On the other hand, there were few inquiries from buyers interested in RTC membership. Since January 2004 until September 2004, she had had about 600 members in hand wanting to sell their RTC memberships. She completed very few sale transactions for RTC membership in 2004, which she estimated at about one or two a month. 12The plaintiffs also called a club expert, Mr Robert Sexton (“Sexton”). He compared the fall of the price of RTC membership with international clubs outside Singapore and noted that RTC membership price fell 75% from $40,000 in the last quarter of 1999 to an average of $10,700 during the last quarter of 2000. On the other hand, no international club he looked at had lost value during the period under review. Sexton opined that in his experience no international club had come anywhere near this speed and scale of price collapse which he attributed to the market’s thinking or perception that RTC was not a viable club of excellence or premier standing. He concluded that this market judgment and resulting price collapse would have occurred regardless of the economic conditions in Singapore. Sexton explained that the fall in price stopped at the current floor of $7,400 because of RTC’s transfer fee which is 10% of the membership value pre-set at $60,000 under its Rules and Regulations. 13The plaintiffs accept that since November 1996 and up to recent times, general market conditions were not favourable and they had a negative impact on social club prices in Singapore. Ms Lim agrees that the plaintiffs cannot recover for any loss in value to the RTC membership due to factors other than breach of contract. On the plaintiffs’ case, after adjusting for a decline in the price of RTC membership due to general market conditions, the balance of the price depreciation of RTC membership is likely to correspond with the breach. Therefore in monetary terms, the decline in the value of RTC membership on account of the defendant’s breach is $15,925. 14The plaintiffs’ expert is Dr Ivan Png Paak-Liang (“Dr Png”), a professor in both the Schools of Computing and Business at the National University of Singapore. Dr Png’s approach to finding the diminution in value of RTC due to the breach is based on the premise that the market price of RTC fluctuates due to changes in market conditions and/or specific factors that are unique to RTC. In his opinion, the most appropriate way to measure changes in general market conditions is to construct an index price based on the average of the prices of a basket of social clubs. Then by deducting the changes in the index price from the changes in the price of RTC, the fall in RTC’s price that is due to specific factors, in this case the breach, can be isolated. The eight clubs selected were the American Club, British Club, Europa Country Club, Fairway Club, Hollandse Club, Singapore Polo Club, Singapore Recreation Club and Superbowl Golf and Country Club. All eight clubs, like RTC, belong to the same social club market and share one or more characteristics with RTC. They are either proprietary clubs, social clubs operating in the same location, or have similar types of facilities. In addition, their memberships have been sufficiently traded in the market. The source of the price data of the eight social clubs and RTC was from Phua. 15Dr Png computed the percentage changes in the eight-club index and the corresponding percentage changes for RTC membership prices at various relevant dates from March 2000 to June 2004. He deducted the percentage changes in the eight-club index from the percentage changes for RTC membership prices to obtain the percentage changes in RTC membership prices due to the breach. The result was applied to the base RTC price of $32,000 at March 2000 to derive the dollar value of the diminution in value of RTC membership due to the breach. Between March 2000 and March 2001, market decline was 16.5% whilst the RTC price decline for the same period was 66.3%. Dr Png infers from this result that 49.8% of RTC’s fall in membership price is due to the defendant’s breach. In dollar terms, the 49.8% drop translates to $15,925 (49.8% x $32,000). 16Counsel for the defendant, Mr K Shanmugam SC, submits that no damages are recoverable from the defendant as (a) the plaintiffs have suffered no pecuniary loss, and (b) if indeed the plaintiffs have suffered a pecuniary loss, it was a loss due to factors other than the breach. It is the defendant’s case that the loss in value of RTC membership, since December 1996, was effectively caused by the recession in Singapore, and not the defendant’s breach. Factors such as the extensive negative publicity affecting the Club following several lawsuits involving the former directors and shareholders of RTC and change in sentiments on club membership as an investment could have contributed to RTC’s price decline. The upshot of the economic realities of the day is that the plaintiffs are no worse off than if the contract had been fully performed. The defendant called as their expert witnesses two accountants, Nicky Tan Ng Kuang (“Tan”) of nTan Corporate Advisory Pte Ltd and Ong Yew Huat (“Ong”) of Ernst & Young, to testify to this. 17From the outset, I have found it difficult to reconcile the plaintiffs’ claim as presented with the nature of the established breach. It is therefore necessary to pause here, and as a starting point, to have a closer look at what the plaintiffs are in fact seeking by way of damages. The plaintiffs cite and rely on theRobinson v Harmanprinciple and go on to quantify their loss on an expectation basis. In awarding damages for “loss of bargain” or “expectation loss”, it is necessary to ask just what it is that the defendant had contractually promised and was found to be in breach of. The importance of such an inquiry, from the standpoint of the principle that damages for breach of contract is compensatory, is explained succinctly by Andrew Burrows inRemedies for Torts and Breach of Contract(Butterworths, 2nd Ed, 1994) at p 140: It is crucial to keep constantly in mind what the defendant contractually promised, so as not to put the plaintiff in a better or worse economic position than if the contract had been performed. A good illustration of how easy it is to drift away from the basic compensatory principle is where a surveyor contracts to survey a house for a prospective house purchaser. Subject to any express term, the surveyor will be taken to have promised contractually to use reasonable care in making the survey. He will not be taken to have warranted either that the house is worth any particular price or that it is free from any defects other than those reported. It follows that if in reliance on the survey the purchaser goes ahead and buys the house and it transpires that the survey was made in breach of contract, because the surveyor did not report reasonably discoverable defects, the aim of damages will be to put the plaintiff into as good a position as if reasonable care had been used in making the survey and the report; they are not aimed at putting the plaintiff into any (other) warranted position. Burrows reminds the reader at p 139 that the claim for compensation must focus, as breach of contract damages ought to do, “on the benefit to which the [innocent party] was contractually entitled and of which he has been wholly or partially deprived by the [wrongdoer’s] breach, and additional pecuniary loss [if any]”. 18The Court of Appeal held that the plaintiffs had contracted for a premier club, but they did not get a premier club. Significantly, there was no warranty that the value of the membership would appreciate or that it would hold its price; or put another way, it would not decline. In my judgment, the plaintiffs’ formulation seeks to recover for depreciation in the value of the membership based on a warranty that was not or did not form part of the expectation interest of the plaintiffs. The plaintiffs’ claim is premised on the price of the RTC membership having significantly diminished and the membership having been and continuing to be less readily saleable. Clearly, the head of claim as presented cannot be reconciled with the established breach. Consequently, damages for this head of claim cannot be recovered on the basis stated and must be disallowed. 19Separately, the plaintiffs’ loss measured by the diminution in the value of their club membership as presented is in principle flawed. Reduced to the essentials, the plaintiffs are in effect seeking in financial terms a refund under the guise of damages. This is not legally permissible in that on the facts, the plaintiffs cannot claim for recovery of the price paid, having failed to get the contract rescinded for misrepresentation. Equally, the contract has not been terminated or discharged and recovery of money paid is not possible where the failure was partial. 20Normally, “diminution of value” as a test orprima facierule applied in a claim for loss of bargain in a contract case is based upon the difference in value between what was contracted for and what was received. This diminution of value rule is, in my judgment, an appropriate assessment of compensation for the loss of what was expected on the facts of this case. The situation I am confronted with is, however, different given how the plaintiffs have put their case and consequently, the evidence as led. That is the plaintiffs’ dilemma at this assessment. 21The nearest analogy to the present case is where a party contracted and paid for superior services or goods and received substantially inferior services or goods.White Arrow Express Ltd v Lamey’s Distribution Ltd[1995] TLR 430(“White Arrow Express”), a case on damages for breach of contract for enhanced services, established that where an innocent party contracted for services of a high standard but received services of a lower standard, the loss suffered would be quantified as the difference between the market value of what had been contracted for and what had been provided. 22InWhite Arrow Express, the plaintiffs carried on a mail order business and the defendants, who were road transport operators, had for some years delivered and collected goods to and from the plaintiffs’ customers. In 1989, a new agreement was entered whereby for some unspecified consideration the defendants agreed to provide an enhanced service in certain respects. The plaintiffs’ claim was simply that they agreed and paid for an enhanced level of service which they did not get. They put forward a claim based on the extra amount which they calculated they paid for the enhanced services as a whole multiplied by the proportion of instances in which they alleged that the enhanced services had not been provided. The preliminary question was whether damages were recoverable on this basis or whether damages should be nominal. The trial judge and the English Court of Appeal both held that damages could not be recovered on the basis stated and, since neither the claim nor the notice of appeal set out another basis for calculation, nominal damages were awarded. The plaintiffs did not quantify or provide evidence by which the English Court of Appeal could draw an inference as to the difference between the values of what was contracted for and what was provided. The Master of the Rolls, Sir Thomas Bingham (as he then was) pointed out that in the ordinary way a party who contracted and paid for a superior service or goods and received a substantially inferior service or goods had suffered loss. I need only refer to one of his three illustrations. If B ordered and paid in advance for a five-course meal costing £50 and was served with a three-course meal costing £30, he suffered loss. 23Sir Thomas went on to state at 431 that the measure of damage in the case illustrated was the difference between the price paid, or if it was lower, the market value of what was contracted for, and the market value of what was obtained. The innocent party was required to provide evidence from which the court could draw an inference as to the difference between the values. In the absence of a relevant market, the contract price could be taken as best evidence of the value of the benefit in question. 24So what did the defendant provide? It is implicit in the decision of the Court of Appeal that the plaintiffs got a non-premier club which is a normal and ordinary club. Or to borrow the words of the Court of Appeal, a club that is not of distinction or pre-eminence. In its Closing Submissions, the defendant correctly identified the applicable measure of damages: the difference in value between a premier club and a non-premier club. But the defendant’s argument is that RTC, in terms of its building and operation of its facilities under opulent and posh surroundings, is nonetheless comparable to premier clubs like the Pinetree Club (“PTC”), now The Pines; Fort Canning Country Club (“FCCC”); and Singapore Recreation Club (“SRC”). The plaintiffs in their Closing Submissions went the opposite way: [T]he Plaintiffs’ loss or damage lies in the fact thatthey did not get the exclusive and premier clubthey had bargained for, nor the use and enjoyment of such a club.Instead, they got a club worse than an ordinary, run-of-the-mill club. [emphasis added] 25Normally when a premier club is compared with a normal and ordinary club, it is fair and reasonable to expect a determinable price differential between the two. This is the premium that a premier club has over a normal and ordinary club. This differential changes as a result of movements in the respective price of a premier club and a normal and ordinary club due to general market conditions. At the assessment hearing, Ms Lim used the analogy of the plaintiffs being promised a BMW but instead being given a Korean car and explained that the plaintiffs’ loss is that they have overpaid. To determine this overpayment, the plaintiffs are required to lead evidence on the value of the BMW (if the price paid is lower) and the type and value of the Korean car. Likewise, in the context of the present case, as Ms Lim has argued that RTC with 19,000 members is worse than ordinary clubs, the plaintiffs have to,inter alia, identify those clubs they have in mind (and this was not done) as representing RTC’s actual position because of the breach and to lead evidence on value. There is no material before the court from which an inference can be drawn as to the difference between the value of what was contracted for at a special price of $28,000 and which genre of clubs (and their value) that RTC with 19,000 members is said to have become on account of the defendant’s breach. To this extent, the evidence is incomplete. 26The slant of the evidence at the assessment was naturally dictated by the way the plaintiffs have put their claim. Correspondingly, so was the defendant’s counter-evidence to meet the plaintiffs’ case. Both parties thus focused on establishing a decline in prices. I shall elaborate on this below. For the moment, suffice it to say, without evidence of a differential in value, the court cannot assess in monetary terms (a) the position the plaintiffs would have been in if the breach of contract had not occurred and (b) their actual position as a result of the breach of contract, so that the difference is made up by an award of damages. The situation here is dissimilar to instances where precise or credible evidence is not available and the court must do the best it can with the evidence available. 27I must stress that in no way does this judgment seek to impose any rigid “formula” or “method” to determine a just compensation. The simple fact of the matter is that I am not convinced that the plaintiffs’ loss measured by the diminution in the value of their club membership as presented is right on the facts of the present case. Such a measure is not, in my judgment, a proper assessment of what has been lost, and it should not be so used. I should make one further observation. Even though the plaintiffs have quantified their loss on an expectation basis, it also confusingly hints of a claim made on a reliance basis. In the Further and Better Particulars of the Amended Statement of Claim served pursuant to the Order of Court dated 13 November 2003, the plaintiffs referred to the costs and expense in the nature of the entrance fee of $28,000 that were incurred and rendered futile by the breach. Ms Lim explained in the course of her cross-examination of the defendant’s expert, Simon Shepherdson (“Shepherdson”), that if the plaintiffs had known there would be 19,000 members they would not have bought into the Club and the 19,000 members is the very breach that had caused the decline in the price of RTC membership. That explanation has the appearance of a claim for reliance interest on the basis that the plaintiffs would not have entered into the contract if they had known of the situation. If anything, a loss of this nature on a reliance basis is not sustainable in law. The aim of damages in protecting the reliance interest is to put an innocent party in as good a position as he was in if no promise had been made. But as Burrows ([17]supra) pointed out at p 252, in the case involving a breach of contract, it is the breach of the contractual promise of a premier club that renders the defendant’s conduct wrongful and not when the defendant induces the plaintiffs to enter into the contract. 28The defendant rightly pointed out that on the plaintiffs’ case that RTC ought to have accepted 5,000 members to remain a premier club, their experts have not in the assessment calculated the value of RTC membership based on 5,000 members and how much the RTC membership would have been worth if the Club had 14,000 more members. Counsel for the defendant would have been well justified in considering that the defendant had no need to adduce any evidence for the purpose of defeating the plaintiffs’ case. In any event, Mr Shanmugam suggests that, even if evidence of this nature had been adduced, applying the “net loss principle”, there is no recoverable loss. This “net loss principle” requires benefits acquired subsequent to and as a result of the breach of contract to be taken into account so much so that compensating advantages are deducted. The plaintiffs say the defendant must only take 5,000 members so as not to be in breach of the implied term. The defendant’s argument is that if RTC had fully performed the contract, RTC would have gone into liquidation by reason of subsequent events like the Asian economic crisis in 1997 and the change in consumer attitude in club memberships as investments. The project would have failed at the outset because the total membership fees collected, based on 5,000 members (or even 7,000) at the discounted price of $28,000, would not have been sufficient; the defendant would in all likelihood have gone into liquidation and the plaintiffs would not have a club. Counsel ventures to state that there would be no difference in value (ie,as in zero value) between a RTC membership with 5,000 members and a RTC membership with 19,000 members because the Club would have gone into bankruptcy even before it opened its doors. The plaintiffs in fact benefited and lost nothing from the breach in that the Club has been built and remains a viable concern today because of the subscription income from its large membership base. With its 19,000 members, the plaintiffs are better off from the income subscription. In contrast, FCCC ran into serious financial problems and ended up in receivership because of a lack of members. 29The defendant’s arguments do not find favour with me given the clear finding of the Court of Appeal that the Club ceased to be a premier club because of the large membership. It hardly seems right, if that is the law on compensating advantage, that the wrongdoer, who is in breach of contract to the innocent party, can answer the latter in that way to deny the innocent party, who has suffered loss, of a just compensation. Crucially, the arguments miss the all-important point that the defendant started off on a wrong footing. RTC marketed and still continued to market the concept of a premier club at a discounted price. It went ahead to contractually promise a premier club to founder members at $28,000 knowing full well the high set-up cost and thus the need for a large population of members to fund the development costs. RTC was also conscious, as can be seen from its first bi-monthly newsletter dated March 1997, that based on the size of the facilities, there was an optimal membership level that RTC had to observe to avoid overcrowding. The defendant was contractually obliged not only to deliver a premier club but was also obliged under the Rules and Regulations of the Club to remain a premier club. The ratio of membership to size and available facilities is significantly higher in the case of RTC, a problem peculiar to RTC, as adjudged by the Court of Appeal. PTC, with its lower ratio of members to size and available facilities, did not face the same problem of inadequate facilities. 30If anything, the compensating advantages to be deducted are those benefits that must arise directly from the breach of contract. I do not regard the benefits argued for by the defendants as having arisen directly from the breach of contract on the test of factual causation. The events relied upon such as change of sentiments towards club memberships as investments started as early as 1997 and that change saw a drop in the price of club memberships generally. This trend was picked up and commented upon in a 1999 newspaper report drawn to my attention by the defendant. The Asian economic crisis started in 1997. They were not events that had arisen subsequent to the breach and for which the court, in my judgment, is not required to take cognisance of. The need for a large membership base to fund the development costs was realised in early days, and it was created through the acceptance of the applications in December 1996, well before the March 2000 breach. If anything, the subscription income that came from that large membership base is a collateral benefit and not a compensating advantage. 31In view of the manner in which the plaintiffs have in this assessment opened and closed their case, this makes it unnecessary for me to decide on which of the different approaches used to compute market decline is the more appropriate. I do not think it would be helpful to lengthen this judgment by analysing them. However, I would like to make some observations on the different approaches and at the end of the day, my concluding remark is that they each have their particular flaws that go to the question of reliability. 32Ms Lim points out that the defendant’s method of computing the decline in the price that is due to general market conditions involved the tracking of price changes of two or three clubs that are most comparable to RTC and is on the basis that their percentage fall represents the effect of general market decline. She explains that the eight clubs that make up Dr Png’s eight-club index were not chosen on the defendant’s notion and basis of comparable clubs. The plaintiffs’ criterion for selection is that the eight clubs would be representative of social clubs so as to reflect more accurately the general market decline of social clubs. Dr Png had intentionally excluded, from his basket of clubs, clubs (like PTC and FCCC) with specific factors affecting their membership prices, as the object was to isolate price changes due to general market conditions. Ms Lim emphasises that by using the eight-club index, as constructed, the percentage decline computed is more accurate and representative as opposed to the defendant’s narrow approach of two or three clubs. 33Mr Shanmugam singled out PTC and FCCC as premier clubs. He said SRC had also marketed itself as a premier club. It is the third most comparable club although it is a members’ club. Tan’s rationale for identifying comparable clubs is that the fall in prices of these clubs during the relevant periods would be“the best proxy to ascertain the quantum of the decline in the market value of the RTC membership caused by the deteriorating general market conditions”. The first two comparable clubs that Tan identified were PTC and FCCC. As no two clubs are exactly the same, the factors listed by Tan to determine comparability of the clubs include the location, facilities, length and type of club membership. 34The factors used to decide on the overall picture of comparability are mainly confined to the physical aspects. The experts have separated the physical aspects from the “size of membership” component. That latter component has been ignored in this part of the exercise and was made use of for a completely different point. This is clearly wrong. On the physical aspects of RTC, the defendant starts from the premise that because the Club’s premises and its facilities are operated under opulent and posh surroundings, it is comparable with premier clubs like PTC and FCCC. Reliance is placed on the first part of a sentence from [17] of the judgment, that “RTC Ltd has delivered the facilitiesbut the problem lies in it accepting too many founder members” [emphasis added]. The defendant also relied on the evidence of Seah Choo Meng, a quantity surveyor, who testified that RTC is a club with a high standard of finishings. Tan testified that in his mind, “a premier club is one that offers facilities like swimming pool and [has] a nice lobby” and so on. As to whether the club is exclusive in terms of the number of members it has (be it 5,000 or 19,000), that to Tan is a different issue. The message conveyed in the defendant’s approach, based entirely on the physical aspects of a club, is that RTC is still a premier club. If the basis of the comparison is accepted it would mean supplanting the decision of the Court of Appeal and ignoring its very finding of fact that the Club with its large membership of 19,000 had ceased to be an exclusive or premier club in terms of “quality” used in the broadest sense and without “the feel of space and comfort” associated with a premier club of distinction and pre-eminence. The problem, as identified by the Court of Appeal, lay in the defendant accepting too many members. The Court of Appeal was not talking about the Club being “exclusive” in the sense of its composition of members, but in terms of the number of members. On the matter of exclusive use and enjoyment of the facilities of RTC, Tan said that the economic reality was such that the plaintiffs would have to pay a very high price and not just the $28,000 and monthly subscription of $80 for exclusivity. In other words, the plaintiffs cannot expect exclusivity for the price paid. That, as I said, misses the point that the defendant contractually promised a premier club at a discounted price when it could ill afford financially to do so. 35An alternative fallback argument, which Mr Shanmugam made at the hearing, is that the use of PTC, FCCC and SRC is not misplaced. On the footing that RTC is not a premier club because of the breach, the fall in the price of its membership was equal to or was less than premier clubs like PTC, FCCC or SRC. Therefore, logically, the plaintiffs lost nothing by reason of the breach. Counsel’s argument is that there is no additional loss flowing from RTC not being a premier club. His conclusion is premised on either of the respective evidence of Tan and Ong carrying the day. 36The defendant’s evidence adduced through Tan is that the RTC membership price fell less than PTC and FCCC over the same period. Given their best proxy status, according to Tan, it is reasonable to conclude that the decline in the market value of the RTC membership during the relevant periods was caused primarily by the deteriorating general market conditions. Tan opined that RTC’s prices had fallen less than PTC and FCCC because people still believed that RTC could continue to be viable. RTC prices “stayed up” because there were enough members to make the Club “viable and an ongoing proposition for the public to invest in”. I agree with Ms Lim that there is no evidence to support Mr Tan’s opinion. At the same time, I do not consider Mr Tan as a club expert. His expertise lies elsewhere in the field of corporate restructuring and insolvency. Phua’s evidence is that there are more sellers of RTC memberships than buyers. She said that she has had in hand some 600 sellers and very little buyers. Phua’s evidence is consistent with Moh Siang King’s testimony. Moh is the defendant’s finance manager. She testified that as at June 2004, RTC had approximately a total of 17,079 members. Since March 1997 when it had 19,048 members, the membership numbers dropped due to non-payment of instalments or subscriptions, resignations or deaths. There were only 45 new members in total over a period of one and a half years beginning 2003. There is also evidence that the price probably did not fall more than FCCC or PTC because of the floor price that appeared to have arrested and capped the decline. 37Mr Ong’s conclusion is that in percentage terms, the fall of the RTC membership price was equal to the average of the percentage drop in the three comparable clubs selected,inter alia, on the basis of the affidavits of the club experts. The plaintiffs’ expert, Sexton, referred to PTC while the defendant’s expert, Shepherdson, considered FCCC and SRC to be similar in terms of facilities and concept. 38Like Tan, Ong chose March 2000 as the relevant date (it being the official opening of RTC) by which changes in the prices of RTC and the comparable clubs were to be computed from. However, unlike Tan who used the RTC launch price of $28,000, Ong’s opinion was that the price was artificial and in order to allow RTC prices in the secondary market to stabilise, he allowed a period of six months from March 2000 and settled for $15,000, the price as at October 2000. He next chose the price as at October 2001, the month before the present legal suit, on the assumption that it would approximate the actual market value of RTC before the possibility of bad publicity caused by the legal action could have any impact on the price. He then made a comparison of the changes in the membership price of RTC with those of the three comparable clubs for the period from March 2000 to October 2001. 39His computations revealed that PTC fell by 24%, FCCC by 50% and SRC by 24% for the period. Taking an average of the percentage decline in the price of the membership of the three comparable clubs of 33%, he computed that the value of RTC membership would have dropped to approximately $10,000, which figure happened to be the actual published price of RTC at the time. On this basis, he concluded that since the values of the comparable clubs fell during this period as a result of the general economic conditions, the value of RTC would be expected to drop accordingly due to the general economic conditions. 40On a closer scrutiny of the comparable clubs, it would appear that Ong’s choice of FCCC is inappropriate. Phua, in her written testimony, stated that the price of FCCC membership fell sharply from $8,000 to $4,300 during the period December 2000 to June 2001 due to concerns that it was facing financial difficulties. The implication of this is that apart from the impact of the general economic conditions, the price of FCCC is also affected by conditions that are specific only to FCCC – in this case, its financial difficulties. As this period is within the period of Ong’s analysis, it has a bearing on the use of FCCC for comparability to RTC. 41Without FCCC’s percentage decline of 50% for the period, the average percentage change of the remaining comparable clubs of PTC and SRC would be 24%. This is certainly less than the 33% fall in the price of RTC from $15,000 to $10,000, leaving the question as to what the further 9% fall in RTC price represents, it being over and above the decline due to economic conditions suffered by the comparable clubs. 42I now turn to comment on Dr Png’s eight-club index. In his supplementary affidavit, Dr Png stated that the construction of an index is an art and that the number of constituents in it as well as idiosyncratic changes of the respective constituents can affect the index. He had therefore excluded PTC and FCCC from the eight-club index as they were affected by financial difficulties of their respective proprietors. In addition, he acknowledged that his conclusions are also sensitive to the use of the base RTC price of $32,000 on March 2000. 43I note that the practice of the construction and use of indices in the fields of statistics, economics and business to reflect changes in prices or values of a basket of food, commodities or equity prices over periods of time is well established. However, this does not mean that any index is infallible and care has to be taken in selecting the sample items that are used in the construction of the index, the base period and the time period to be considered. 44In the case of the eight-club index, Dr Png agreed that unlike the stock market where shares are transacted actively on a daily basis, memberships in the club market are bought and sold infrequently. Another feature of the club market is that there is less transparency in the timing and disclosure of the transacted prices unlike in the stock market where transacted prices are recorded immediately for all to see. Dr Png has admitted in his supplementary affidavit that he has had to accommodate for the delay in disclosure of transacted club prices by considering changes in prices for one, two, three and four months after the relevant dates. 45Both the illiquidity and opaqueness of the club market will necessarily have a bearing on the effectiveness and accuracy of any club index constructed. In addition, the selection of the base period from which an index commences is important. In this case, there was a sales moratorium on RTC membership from the launch in December 1996 to March 2000. As there was no RTC membership transaction during the period, for the sake of comparability, Dr Png chose the base period to be March 2000. As it happened, the deterioration of the general market conditions straddled the period from December 1996 to March 2000. By using the March 2000 base period, the effects of the deterioration of the general market conditions in the earlier years on those clubs comprised in the index were not reflected whereas in the case of RTC, the moratorium caused a delayed effect on the fall of RTC prices due to the deteriorated general market condition in previous years. In the result, after the moratorium when transfers were eventually allowed for RTC memberships, the fall in price subsequently was significantly greater than those of the index. The situation lends itself to a distorted picture and any conclusions as to the effects of general market conditions on RTC relative to the index clubs need to be viewed with caution in the light of this anomaly. 46To conclude, for all the reasons earlier stated, the first head of claim must inevitably fail. I reach this result with some reluctance as I do not regard the plaintiffs’ claim for more than nominal damages to be wholly without merit but, unfortunately, it has not been established. This leads me to the next head of claim.",
        "Loss of amenity, accessibility and enjoyment": "47This head of claim is for general damages for loss of amenity, accessibility and enjoyment of a premier club caused by a breach of contract,ie,non-monetary loss of a premier club experience and benefit as Ms Lim explains. The defendant argues that this second head of claim is as a matter of law not sustainable in a representative action. It is not possible to prove this kind of non-monetary loss through the evidence of the nine named plaintiffs. At any rate, no damages should be awarded as the usage charts continued to show under-utilisation. Survey forms show that RTC does provide quality facilities and quality services to its members. 48In this case, efforts to establish a pecuniary loss failed. So in effect, there is an absence or no recovery of any other damages. Yet at the same time, the fact that the plaintiffs did not get the premier club contracted for is itself a loss. This case is similar to those English cases where the enjoyment or amenity to be achieved by the performance was itself something for which the plaintiff had contracted either expressly or by implication. 49Both parties citedRuxley Electronics and Construction Ltd v Forsyth(“Ruxley”)[1996] AC 344.The best example of the English courts awarding a head of damages called “loss of amenity” outside personal injury in this context isRuxleyitself. In my judgment, the principles expressed inRuxleycan apply in the present case. And general damages of the kind sanctioned inRuxleyshould be awarded. AsRuxleydemonstrated, the enjoyment of an amenity has a quantifiable value quite separate from the cost of performance and from the economic losses caused by a breach. 50InRuxley, the house owner, Forsyth, contracted with Ruxley for the construction of a swimming pool. Forsyth had specified that the deep end of the swimming pool was to have a depth of 7 feet 6 inches. Ruxley failed to comply with its contractual obligation: the actual depth at the deep end was 6 feet. It was found that there was no adverse effect on the value of the property and that it would be unreasonable to incur the cost of rebuilding. The trial judge therefore awarded nothing more than a sum of £2,500 for the loss of amenity by way of general damages. The essential reason for the trial judge’s award was the absence of any other damages for pecuniary loss. 51Although the propriety of that award was strictly not in issue since there was no cross-appeal against the trial judge’s award, Lord Bridge of Harwich at 354 said that since the attack on the principle of the award was central to Forsyth’s argument, it was an issue that the House of Lords might properly address. He agreed with Lord Mustill in the reasons he gave for concluding that there was no reason in principle why the court should not have power to award damages of the kind in question and that in some circumstances such power might be essential to enable the court to do justice. Lord Lloyd of Berwick expressed the view,obiter, that the award was supportable in principle provided that it was confined to a modest, almost conventional sum (at 374). He emphasised the fact that the contract was for the provision of a pleasurable amenity. 52Lord Mustill added some thoughts with reference to an award of general damages for loss of amenity in such circumstances. He said at 360: [I]t was for the plaintiff to judge what performance he required in exchange for the price. The court should honour that choice. Pacta sunt servanda. If the appellant’s argument leads to the conclusion that in all cases like the present the employer is entitled to no more than nominal damages, the average householder would say that there must be something wrong with the law. 53The English Court of Appeal, by a majority, awarded Forsyth the cost of demolishing and rebuilding the swimming pool at a cost of £21,560. The House of Lords restored the decision of the trial judge, on the basis that reasonableness was to be considered as an important factor in assessing the loss and the need for reinstatement. Their lordships found the usual “cost of cure” measure of damages to be wholly disproportionate to the loss suffered. In so doing, their lordships rejected the view that reinstatement and diminution in value were the only two possible measures of damages in a building case, and approved, as a matter of general application and not limited to building cases, an intermediate approach for loss of amenity. 54The House of Lords approved in principle an award of general damages for loss of amenity, because the purpose of the contract was the provision of a pleasurable amenity, or for loss of “consumer surplus”, which is the “excess utility or subjective value obtained from a ‘good’ over and above the utility associated with its market price” (see Harris, Ogus and Phillips, “Contract Remedies and the Consumer Surplus” (1979) 95 LQR 581 at 582). 55The House of Lords inFarley v Skinner[2002] 2 AC 732again upheld the concept of an award for loss of amenity in compensation of a non-pecuniary loss arising out of a breach of contract. Lord Scott of Foscote inFarley v Skinnerat [79] and [86] said: Ruxley’scase establishes, in my opinion, that if a party’s contractual performance has failed to provide to the other contracting party something to which that other was, under the contract, entitled, and which, if provided, would have been of value to that party, then, if there is no other way of compensating the injured party, the injured party should be compensated in damages to the extent of that value. Quantification of that value will in many cases be difficult and may often seem arbitrary. … In summary, the principle expressed inRuxley… should be used to provide damages for deprivation of a contractual benefit where it is apparent that the injured party has been deprived of something of value but the ordinary means of measuring the recoverable damages are inapplicable. The principle expressed inWatts v Morrow[1991] 1 WLR 1421should be used to determine whether and when contractual damages for inconvenience or discomfort can be recovered. 56Applying the principles expressed inRuxley, in my judgment, the plaintiffs are entitled to damages for loss of amenity and enjoyment on the basis that they were deprived of the contractual benefit to which they were entitled. After all, the contract was for the provision of a premier club with first class facilities for the enjoyment of the members. The declared purpose of the Club as set out in r 2 of the Rules and Regulations of the Club is to provide for the use and enjoyment by the members of facilities for,inter alia, recreation, entertainment and dining. The plaintiffs as members at the time of the Writ were associated together for the common purpose of enjoying the Club facilities and participating in its social, recreational and other activities offered by the Club. The members were themselves subject to rules and regulations in their conduct and use of the Club’s facilities; they could use the Club’s facilities for as many or as few times as they wished. I saw no merit in the defendant’s argument that a claim for loss of amenity and enjoyment cannot succeed when some of the plaintiffs do not use the Club. The object of an award of damages for non-pecuniary loss of this nature on theRuxleyapproach is not dependent on whether the Club and its facilities are more or less used by the plaintiffs. I have earlier said that the plaintiffs have been deprived of something of value but were not able, in a sense, to recover pecuniary loss from the ordinary measures. In these circumstances, it is open to the court to adopt aRuxleyapproach and place a contractual value on the contractual benefit of which the plaintiffs have been deprived. InRuxley, the value placed on the amenity value of which the pool owner had been deprived was £2,500. By that award, the pool owner was placed, so far as money could do it, in the position he would have been in if the diving area of the pool had been constructed to the specified depth. 57An alternative basis for awarding damages for non-pecuniary loss to the plaintiffs is to claim compensation for loss of amenity and enjoyment as consequential loss. Had it not been for the breach of the implied term, the plaintiffs would not have suffered the loss of amenity and enjoyment. Simply put, the loss of amenity and enjoyment flowed from this breach and it was reasonably foreseeable. Loss of amenity was something that the defendant knew or ought to have known was a serious possibility. It is clear on the evidence that the defendant reasonably contemplated the physical consequences of a large membership on the Club and its facilities. 58Tan Buck Chye (“TBC”) was a former shareholder and director of Europa Holdings Pte Ltd and Erasmia Pte Ltd, the previous shareholders of the defendant. He was one of the key persons involved initially in the project. TBC testified that 7,000 members for the Club was a comfortable figure given the size and dimensions of the Club. With 8,000 members, the defendant would have to look for additional facilities outside the Club as a branch of the Club. With this situation in mind, the defendant gave itself in r 27 of the Club’s Rules and Regulations the discretion to operate a branch of the Club to cater for a large membership population. There is also the testimony of Foo Joo Long (“Foo”), a former director of RTC. Foo’s evidence is that he raised the question of facilities outside the Club with the other former directors. The defendant’s bi-monthly newsletter dated March 1997 talked about “optimal membership level based on size of the facilities to consciously avoid overcrowding or long waiting periods during peak operation hours”. Ali Alavi’s fax dated 6 December 2000 to Lawrence Ang, a former director and chairman of RTC, referred to the Club’s pre-opening plan which was guided by a membership base of 5,000 to 6,000 members. 59The word “amenity” inRuxley, like in the present case, carries its dictionary connotations of pleasantness. Chao JA referred to the feeling of “space and comfort” expected of a premier club. In holding that the defendants did not provide RTC with a premier club, that ruling itself recognised a loss of amenity and enjoyment of a premier club. 60The defendant adduced evidence on current usage at various dining areas and produced the results of various surveys taken from the members. The defendant urges me to take into account the changes in circumstances after the breach. In my judgment, evidence on current usage does not assist the defendant. I agree with the plaintiffs’ submissions that the present state of usage is irrelevant. The Court of Appeal drew a distinction between usage and adequacy of the available facilities given the membership ratio with reference to size and dimension of the available facilities. The finding is that usage may not necessarily reflect adequacy and that in considering the question of the adequacy of the facilities, membership size cannot be viewed in isolation but must be related to the size of the facilities. Significantly as at June 2004, the membership size is 17,079 and that is still a very large number of members even though out of this figure 1,372 are absent members. I should not ignore the 6,993 supplementary members who are entitled to make use of the available facilities. The members’ families and guests should not be forgotten. 61In these circumstances, I disagree with the defendant’s contention that a representative action is unsustainable. The expectation of each of the plaintiffs was the same. There is no necessity for each of the plaintiffs to prove their personal non-pecuniary loss of this nature. I make no distinction that some of the plaintiffs are no longer members. The award of damages, on either of the two alternative bases, is not founded on any continuing loss but a one-time loss. The important thing is that the plaintiffs were members at the time of the Writ and the Court of Appeal confirmed the Club to be in breach of contract in August 2003. The breach lies in RTC ceasing to be a premier club given its membership size when viewed against the size and dimensions of available facilities. Chao JA said at [57] of his judgment: What we seek to ensure is that entrepreneurs who make promises should deliver them. The appellants subscribed to a “premier” club; they should get a “premier” club. Similarly, Lord Mustill inRuxleyat 360 said a contract breaker could not escape unscathed if he did not give to the innocent party what he had stipulated in the contract, and this obligation ought not to be devalued. 62I agree with Lord Steyn’s observation inFarley v Skinnerat [28] that awards of non-pecuniary damages in this area should be “restrained” and kept at a modest scale. Accordingly, on either of the two alternative bases, for loss of amenity and enjoyment of a premier club, I award to each plaintiff general damages in the sum of $1,000. 63As regards costs, although the plaintiffs are not the complete winners, there is, on an overall view of the case, no reason for costs not to follow the event. Consequently, the plaintiffs shall have their costs of the action. 64The plaintiffs have asked for the costs thrown away for preparation for the cross-examination of the two accounting witnesses (Chan Ket Teck and Tam Chee Chong) and second club expert (Tim Allen). I agree with Mr Shanmugam that it is the defendant’s prerogative to choose not to call these witnesses with the usual costs consequences following the outcome of the case. The timing of when this prerogative is to be exercised must surely be left to the better judgment of counsel as he watches and evaluates how his client’s case is doing at each step of the proceedings. In the circumstances, I cannot see any justification for an order for costs thrown away sought by the plaintiffs whose solicitors’ costs for work done in connection with the aforesaid three witnesses as well as the reasonable expenses and disbursements of Sexton and Neill Pool are already covered by my order on costs. The same order on costs holds for the first day of trial, namely 16 September 2004 and for any other day before 1 October 2004, when hearing was suspended. 65Finally, for the sake of completeness, I should mention that I am aware that in the course of the arguments presented on both sides, a number of subsidiary points were ventilated, and many authorities cited. I have however not found it necessary to refer to them in this judgment."
    }
}