{
    "case_title": "Lee Siew Eng Helen v Public Prosecutor",
    "ncitation": "[2005] SGHC 141",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The background to the appeal": "2          The appellant was the general manager of Anthola Insurance Broker (S) Pte Ltd (“Anthola”). She saw to the daily operations of the business. Under the Insurance Intermediaries Act (Cap 142A, 2000 Rev Ed) (“the Act”), Anthola was required to set up an Insurance Broking Premium Account (“IBPA”). The account was strictly regulated. Withdrawals from the account could only be made for the purposes authorised by s 22(3) of the Act. The appellant was alleged to have breached s 22 of the Act by knowingly instructing and authorising the transfer of moneys from the IBPA for purposes other than those permitted. 3          The appellant was initially charged with four counts of criminal breach of trust under s 408 of the PC. The first charge was for embezzlement of $19,000 in 2002, the second for $24,028 in 2001, the third for $134,296 in 2000, and the fourth for $219,000 in 1999. This last charge was withdrawn and a discharge amounting to an acquittal was recorded. At the end of the Prosecution’s case, the district judge decided that there was aprima faciecase to be brought under s 406 instead of s 408 of the PC. The charges were amended accordingly. 4          It was established that the moneys the appellant authorised for withdrawal from the IBPA were used largely for payment of various office expenses. In particular, premiums meant for various insurers were not paid to them, even though the persons insured had already paid in to the account. 5          When the appellant’s defence was called, she declined to testify on her own behalf. She also declined to call any witnesses. She insisted that there was no case to answer. The trial was therefore premised entirely on the Prosecution’s evidence. 6          The district judge rejected the Defence’s argument that the Prosecution had to show misappropriation through specific withdrawals being in excess of entitlements. In doing so, he regarded s 22 of the Act as contravened every time a withdrawal was made for an unauthorised purpose. He further drew an adverse inference from the appellant’s silence in the face of the Prosecution’s case – that the withdrawals were indeed in excess of entitlements. 7          He decided (see[2005] SGDC 84at [95]) that “requiring that misappropriation be established only by a particular withdrawal being in excess of a particular entitlement would create too much of an opportunity for funds to be used in disregard of the direction of law”. He thus considered it sufficient for a charge under s 406 of the PC to be made out on an aggregate basis. 8          The district judge accepted the Prosecution’s method of calculating the amount of money embezzled. In essence, this was done by taking the amount of money withdrawn from the IBPA, and subtracting from this the amount of commission accrued to Anthola in each relevant year. According to this method, the amount in excess of Anthola’s accrued commission was the minimum amount of money embezzled. 9          The appellant had withdrawn from the IBPA a total of $532,000 and $313,000 for the years 2000 and 2001 respectively. The accrued commissions were $397,704 and $288,972 for 2000 and 2001 respectively. Therefore in applying this calculus, the appellant was shown to have embezzled the sums of $134,296 in 2000, and $24,028 in 2001. 10        Due primarily to a lack of detailed and accurate accounts, the district judge opined that a conviction on the first charge would be unsafe. The appellant was thus acquitted on this basis. There was nevertheless enough evidence to sustain a conviction on the remaining two charges. For the second charge, the sentence imposed was three months’ imprisonment, and a $10,000 fine or two months’ imprisonment in default. The appellant was sentenced to six months’ imprisonment, and a $10,000 fine or two months’ imprisonment in default, for the third charge. As the sentences were ordered to run concurrently, the total sentence was six months’ imprisonment, and $20,000 in fines or four months’ imprisonment in default. At the time of appeal, the fines had not been paid.",
        "The issues regarding the appeal on conviction": "11        The appellant proceeded on three broad grounds of appeal. Firstly, that linking the total amount withdrawn each year to the commission earned that same year was a misinterpretation of the accounts. Secondly, that the district judge erred in disregarding the possibility of commissions being collected at some other time. Lastly, that the calculation did not include “management fees” – moneys which belonged to the company. 12        According to the appellant, the moneys in the IBPA representactualpremiums and commission collected. The figures used by the Prosecution were derived from Anthola’s balance sheet. These were “booked” figures. There were two main reasons why the actual and “booked” figures were not identical. First, clients might not pay on time. Second, Anthola had a credit policy of either 30, 60 or 90 days with the insurance company depending on the terms of each individual policy. 13        The appellant further alleged that the district judge failed to consider the evidence of PW4 (Anthola’s auditor) suggesting the possibility of commissions being collected in some other time, rather than in the year it was booked.Taking one extreme, if old debtors with high-value accumulated premiums suddenly paid and if Anthola had extremely generous credit policies with the insurance companies, there was no reason why theactualcommissions might not be higher than the “booked” commissions of any given year. Therefore the general proposition that the calculus adopted by the Prosecution would lead inallcases to the lowest possible amount embezzled, was theoretically incorrect. 14        Nevertheless, and with respect, the appellant’s assertion that the correlation between the premiums paid into the IBPA and the premiums booked was “fundamentally erroneous” or “a misinterpretation of the accounts”missed the point. Plainly the two figures might or might not be identical. The district judge had, in his grounds of decision, accounted for factors which contributed to the discrepancies between the two amounts. He observed (at [55]), for instance, that in 2001 “$288,972 was booked as commission, but the commission actually received was less”. He attributed the differences to the findings that: (a)        The amount of premiums collected was less than that which was booked – Anthola had failed to collect premiums from clients and had a substantial trade debt. This had the effect of greatly reducing the amount of commissions entitled. (b)        AXA (a primary insurer) had withheld its production allowance from Anthola, depressing further the amount of commissions Anthola would be entitled to in the IBPA; (c)        Anthola was transferring moneys in excess of the commissions earned, as reflected in the reconciliation statements. 15        The district judge was mindful that a mere possibility that the actual commissions would exceed accrued commissions “was not sufficient in the circumstances to raise a reasonable doubt. The Prosecution was not required to prove its case beyond all doubt and all possibility” (at [101]). This was correct. 16        The evidence in aid of the appellant’s position was not nearly enough to raise a reasonable doubt, let alone support a reversal of the lower court’s findings of fact. In the cross-examination of PW4, the auditor only raised a possibility of revenue being collected after the period within which it was booked. There was no evidence conflicting with the aging lists or the reconciliation statements,ie, that Anthola was entitled to less than what was booked. 17        Furthermore, the appellant had chosen not to adduce evidence or call witnesses in support of her contention at trial. This much was clearly enunciated in the district judge’s decision (at [73]): The Defence was content to take the risk of challenging the Prosecution’s evidence alone, without adducing evidence of its own. This meant that the Court did not have evidence of the Appellant’s version of events. Her own version was not put forward. No contradictory version was in fact adduced in evidence. There was in particular, no explanation by the Appellant of her own actions, inaction or intentions. 18        In a nutshell, the district judge decided that Anthola’s circumstances were vastly different from the hypothetical situation suggested by the appellant. He had reconciled the differences between the actual and booked commissions and, in doing so, made sure there was no reasonable doubt that the figure would not be the lowest possible amount embezzled. This should lay to rest the appellant’s first two grounds. 19        As for the appellant’s third ground, the appellant submitted that the district judge did not take into account “other operating income”, and more specifically “management fees”. “Other operating income” referred to an item on the balance sheet amalgamating moneys like management fees and production allowances. 20        This third ground is of little consequence in the present appeal. Where, for instance, a production allowance was given under “other operating income”, it was PW4’s testimony that Kemper (Anthola’s creditor) would deduct the production allowance from Anthola’s debt. As a consequence, there was no cash movement between the parties. Anthola would be precluded from claiming the production allowance because the evidence shows that the moneys were never received. 21        The appellant also contended that Anthola was entitled to these moneys simply because s 22(3)(a) of the Act allows “for payment to or for a person entitled to receive payment of the moneys,including itself in so far as it is entitled to receive payment for itself” [emphasis added]. 22        This argument was disingenuous. Anthola could not be entitled to money held specifically in the IBPA merely because it was entitled in general to these other moneys. The crucial question was whether these items known collectively as “other operating income” could be identified as forming part of the money in the IBPA. 23        A clear reading of s 22(2) of the Act reveals that it is mainly premiums and commissions that pass through the IBPA. PW4 did not testify that the other moneys were paid into the account. I could find no evidence that any of these items were so paid. The appellant certainly did not substantiate her appeal with any such evidence. There was therefore no reason why these items would have any bearing on the method used to determine the amount embezzled – the court was concerned only with the amount Anthola was entitled towithinthe IBPA. 24        Thus the district judge was justified in asserting that,in this particular case,using the booked commissions as a basis of calculating the lowest possible amount embezzled was proper. The method used the maximum commissions Anthola was entitled to in any given year and accounted for the various factors which might affect this entitlement. Therefore, I found great difficulty disagreeing with the Prosecution’s point that “the computation already gives the greatest benefit to the appellant”. In fact, if the appellant’s method of using actual commission entitlements were employed, the figure embezzled would probably be much higher.",
        "Appeal as to the sentence": "25        The appellant contended that the district judge ought to have considered s 38(2) of the Act, in that the maximum imprisonment term under that section is 12 months. She argued that, given her mitigating circumstances and the maximum sentence under s 38(2), six months’ imprisonment was manifestly excessive. 26        First of all, when the district judge invited the appellant to make her mitigation plea, she submitted that there was “no specific punishmentprovided for the breach of s 22”. It was noteworthy that the appellant did not mention s 38(2) of the Act in the lower court but chose to do so only later in this appeal. While this should not prove fatal to her appeal, the fact is that the appellant had not furnished the court with any other factual or legal basis on which to adjudge the sentence to be manifestly excessive. 27        The fact that the accused was charged under s 406 of the PC instead of s 38(2) of the Act is nevertheless a proper exercise of prosecutorial discretion. Section 38(2) of the Act regulates any breach of a direction of law under the Act whereas s 406 of the PC specifically relates to criminal breaches of trust. 28        Additionally, s 22 of the Act was enacted with a clear statutory intention of regulating the way insurance brokers keep and use the clients’ premiums. As the then Deputy Prime Minister Lee Hsien Loong said at the Second Reading of the Insurance Intermediaries Bill (Singapore Parliamentary Debates, Official Report(4 August 1999) vol 70, col 1904): As brokers hold their clients’ and insurers’ premiums on trust, it is necessary for them to keep proper accounts of these monies. Evidently, having been tasked with the responsibility of supervision, the appellant made no effort to keep such records. It is thus ironic that the lack of proper accounts was the basis on which the appellant chose to rest her appeal. 29        InWong Kai Chuen Philip v PP[1990] SLR 1011, Chan Sek Keong J (as he then was) held at 1015, [18]: In an offence like criminal breach of trust, it is a matter of common sense that, all other things being equal, the larger the amount dishonestly misappropriated the greater the culpability of the offender and the more severe the sentence of the court. 30        In passing the sentence, the district judge noted the fact that the appellant had not benefited herself and, instead, had used the funds for the company. He also observed that the Act had been repealed and replaced by the Financial Advisers Act (Cap 110, 2002 Rev Ed) (“the FFA”). Section 32 of the FAA provided for a maximum fine of $100,000 but no term of imprisonment. In contrast, s 406 of the PC stipulated a maximum fine of $10,000 and a maximum imprisonment of three years. As such, he decided at [114] that: In view of the amounts involved, even a maximum fine on each charge of $10,000 alone was not adequate at all. Some term of imprisonment was therefore required in addition to the fine. 31        There is no doubt that the appellant did not embezzle the moneys for herself, yet embezzling on behalf of her company should not make her any less morally culpable because the breach of a relationship of trust is itself an aggravating factor. The appellant did not plead guilty and did not make restitution. In view of the balance between the mitigating and aggravating factors, it has not been shown that the sentence is manifestly excessive.",
        "Conclusion": "32        It is trite law that an appellate court will only interfere with the lower court’s findings of fact when,inter alia, these findings are clearly contrary to the weight of the evidence:PP v Azman bin Abdullah[1998] 2 SLR 704.The district judge had clearly reconciled the differences between the actual and the booked commissions. Since the debts that Anthola owed and to which it was owed were tremendous, coupled with the fact that the allowances and commissions were withheld by insurers to offset Anthola’s debt to them, Anthola’s actual entitlement was probably much less that its booked entitlement. The trial judge rightly concluded that using the booked commissions resulted in the lowest possible amount embezzled. 33        With regard to the sentencing, the district judge had accounted for all the relevant factors. In view of the fact that the appellant had not herself pleaded guilty or made restitution, as well as the large sums of money taken, the appellant had failed to show how a six-month imprisonment was manifestly excessive. 34        For the reasons given, I dismiss both the appeal against conviction as well as that against the sentence. Appeal against both conviction and sentence dismissed."
    }
}