{
    "case_title": "Lim Kau Tee and Another v Lee Kay Li",
    "ncitation": "[2005] SGHC 162",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1          At the conclusion of the trial, I awarded interlocutory judgment to Lim Kau Tee and Ang Soi Hiang (“the plaintiffs”), who are husband and wife respectively, against Lee Kay Li (‘the defendant”). The defendant has now appealed against my judgment (in Civil Appeal No 63 of 2005). 2          The plaintiffs are the owners of a Housing and Development Board (“HDB”) shophouse situated at Block 713, Ang Mo Kio Avenue 6, #01-4040, Singapore 560713 (“the property”), which they purchased from the Post Office Savings Bank (with HDB’s consent) in 1995 for $5.6m. The property comprised two storeys with a total area of 448m². 3          The plaintiffs had used the second storey of the property as an office for their business since their purchase in 1995. The defendant was a tenant of the ground floor for three years from 1 May 2000 by a tenancy agreement dated 27 March 2000. The parties subsequently entered into a second tenancy agreement dated 15 April 2003 (“the Tenancy Agreement”) which was intended to be for another three years. 4          Eleven months after the commencement of the second tenancy, the defendant vacated the premises (on 24 March 2004). The plaintiffs alleged that the defendant had wrongfully repudiated the lease. The defendant on the other hand claimed that the plaintiffs had, by their actions which will be elaborated on hereunder, evinced an intention to be no longer bound by the Tenancy Agreement and were the ones who had repudiated the lease.",
        "The facts": "5          According to the first plaintiff, he had bought the property in the belief that the property was for commercial use with an approved structural loading of 1.5kN/m², on the basis of a print-out provided by HDB at the time of purchase. However, sometime either in late December 2001 or in early January 2002, the plaintiffs were informed by a HDB technician that the property had too many air conditioning units, and that this was not allowed for living quarters. 6          The plaintiffs’ chief operating officer (“COO”) then checked the lease instrument of the property and discovered that the plan thereto described the property as comprising a first storey shop of 204m² and a second storey living quarters of 204m². 7          The first plaintiff testified that he then sought to rectify the discrepancy between HDB’s enquiry print-out and what was described in the lease. On 28 January 2002, the plaintiffs’ solicitors wrote to HDB for their consent to a change of use of the property. On 6 February 2002, HDB replied saying that it had no objections to changing the use of the property provided that structural works were carried out to increase the loading of the second storey. This was because the existing loading of 1.5kN/m² was insufficient. 8          The plaintiffs’ solicitors replied to HDB on 12 June 2002, requesting for the change of use without any works to be done on the basis that at the time of the purchase of the property, the property was described as having been constructed with the approved loading for commercial use; HDB did not reply to this letter. 9          The plaintiffs also applied to the Urban Redevelopment Authority (“URA”) and were granted permission on 4 December 2003, valid for a period of three years, to effect a change of use of the second storey from living quarters to office use. 10        On 12 December 2003, the plaintiffs’ solicitors again wrote to HDB, asking for a response to their earlier request that the change of use be made without the need for strengthening works to the structural floor of the second storey. Again there was no response from HDB. 11        According to the first plaintiff, in view of HDB’s long silence, he became anxious that his investment in the property would be compromised. On the advice of the plaintiffs’ COO, the plaintiffs decided to carry out the works proposed by HDB so as to allow the change of use to be effected. 12        By a letter dated 9 January 2004, the plaintiffs informed the defendant of the proposed works. The letter stated that “As per requirement by the Housing & Development Board, we have to strengthen the ceiling structure.” The letter also stated that the defendant was “required to remove all [his] stocks and furniture by 24thMarch 2004” to facilitate the works which were planned for a period of 29 days from 25 March 2004 to 22 April 2004. 13        The plaintiffs claimed that they then entered into negotiations with the defendant in relation to their request. Doris, a member of the plaintiffs’ staff, contacted the defendant’s staff (Margaret Cheong) on 12 January 2004, asking whether the defendant had received the plaintiffs’ letter of 9 January 2004. During this conversation, upon Margaret’s request, Doris (with the first plaintiff’s agreement) agreed to waive a month’s rental for the defendant. However, Doris rejected Margaret’s request that the shoe shelves and cabinets in the premises be left behind. 14        On 18 February 2004, Doris called Margaret again to confirm that the shelves and cabinets would be removed for the works. Margaret replied that the defendant had not reverted to her but repeated that the defendant would move his stock to allow the works to be done. 15        The defendant claimed that he only received the letter dated 9 January 2004 on or about 23 February 2004 because it was delivered by hand to his outlet at the premises and his outlet manager only forwarded the letter to him on the said date. Upon receiving the letter, he then instructed his operations manager, Mr Eric, to contact the plaintiffs’ staff to make further enquiries. 16        Subsequently, in the first week of March 2004, two of the defendant’s staff (the operations manager, Mr Eric, and the operations and financial controller, Miss Kholyn Suarez Apolinar) met the plaintiffs’ project manager, Mr Raymond Tang. Together, they viewed the premises to assess the areas that would be affected by the works. According to the plaintiffs, at the end of this meeting, the defendant’s operations manager told the plaintiffs’ project manager that the defendant should be able to hand over the premises on 24 March 2004 for the works to begin on 25 March 2004. Hence, on 8 March 2004, the plaintiffs’ COO wrote to the defendant seeking confirmation that the defendant had agreed to hand over the vacant unit to the plaintiffs on 24 March 2004. 17        According to the defendant, after this meeting, he decided that he would not vacate the premises unless the plaintiffs paid his costs and expenses for doing so. Sometime between 8 March 2004 and 13 March 2004, the defendant went to the plaintiffs’ office where he met Doris, and asked to be compensated for the costs to be incurred in his moving out. By a letter dated 13 March 2004, the defendant sought to recover from the plaintiffs: (a) the cost of moving out his stock and furniture, (b) costs of rental for a temporary warehouse, (c) compensation for loss of sales and salary for two months (amounting to $20,000), (d) renovation and reinstatement costs of $80,000, (e) the reinstatement by the plaintiffs of the ceiling, lightings, air-conditioning and air-curtains and (f) the waiver of one month’s rental. 18        On 15 March 2004, the defendant’s staff met the plaintiffs’ staff again and reiterated the foregoing demands, which were turned down by the plaintiffs’ COO. 19        On the very same day, the defendant’s staff sent the plaintiffs a fax (at 8.18pm), and by hand the next day (16 March 2004) a letter requesting to see HDB’s letter stipulating that the plaintiffs had to carry out strengthening works. 20        Subsequently, on 18 March 2004, the defendant, through his solicitors, again requested for a copy of HDB’s letter to the plaintiff. This letter also said that the plaintiffs’ letter of 9 January 2004 amounted in effect to a demand for the defendant to vacate the premises, which the defendant would not comply with. Further, if the plaintiffs insisted on removing the defendant from the premises, the defendant would resist and hold the plaintiffs liable for consequential losses suffered as a result. 21        Pursuant to the request by the defendant to see the letter from HDB, the plaintiffs’ solicitors finally forwarded a copy to the defendant’s solicitors on 22 March 2004. In a letter dated 23 March 2004, the defendant through his solicitors alleged that the plaintiffs, by not informing the defendant at the time of renewal of the tenancy agreement that the defendant would have to vacate the premises for the strengthening works, had intentionally misled the defendant into signing the Tenancy Agreement, which the defendant would not otherwise have signed had he been apprised of this fact. On 24 March 2004, two days after receiving the letter from HDB to the plaintiff, the defendant moved out of the premises and on 31 March 2004, the defendant’s solicitors returned the keys of the premises to the plaintiffs’ solicitors.",
        "The pleadings": "22        In the Amended Statement of Claim, the plaintiffs alleged that the defendant had by his conduct, evinced an intention no longer to be bound by the Tenancy Agreement and had repudiated the same. 23        In the Defence and Counterclaim, the defendant denied that he had repudiated the tenancy and contended that he had rescinded the Tenancy Agreement on the basis of the plaintiffs’ misrepresentation. The defendant averred that in view of the extremely competitive retail sector in Singapore, he was prepared to enter into a second tenancy at the plaintiffs’ premises (as stated in his letter dated 10 March 2003 to the plaintiffs) only if the plaintiffs would agree to: (a)        a reduction in the monthly rental from $19,000 to $15,000 as this would translate into significant savings for the defendant in the long term; and (b)        a tenancy period of three years instead of the two years (plus one year’s renewal) provided for in the first tenancy agreement as this would translate into a longer depreciation period for the renovation costs of the premises incurred at the commencement of the first tenancy period and significant cost savings as a result of not having to renovate new premises for an additional three years. 24        The defendant alleged that the plaintiffs had represented to him that the monthly rental would be reduced from $19,000 to $17,000 and that they had misrepresented that he would be allowed the uninterrupted use and occupation of the premises for an additional period of three years. Induced by and in reliance upon the plaintiffs’ representations, the defendant entered into the Tenancy Agreement with the plaintiffs. 25        The defendant pleaded that the plaintiffs had made the representation fraudulently, in that the plaintiffs knew that it was false. The defendant alleged that the plaintiffs knew as early as 6 February 2002 that the defendant would have to vacate the premises in order for strengthening works to be done. The defendant also argued that the plaintiffs knew, at the time of making the representation, that the works would be carried out during the second tenancy. Alternatively, the defendant argued that the plaintiffs made the representation asserting belief in it when they did not have such belief. The defendant also pleaded that the plaintiffs were negligent in failing to inform the defendant about the nature and effect of the HDB letter prior to the execution of the Tenancy Agreement. 26        The crux of the defendant’s case was therefore that the plaintiffs knew all along from the time of purchase or, at the very least, by 6 February 2002 (when they received HDB’s letter stating that HDB was agreeable to a change of use provided that strengthening works were done) that the defendant’s use of the premises during the second tenancy would be interrupted. 27        The defendant’s explanation for suddenly vacating the premises on 24 March 2004 when he had on 18 March 2004 adopted the opposite stand that he would not vacate the premises was that he was shocked to realise from the HDB letter of 6 February 2002 that the works proposed by the plaintiffs were only necessary because the plaintiffs desired to change the use of the second storey from that of living quarters to office use. To his knowledge, the plaintiffs had all along used the second storey as their office. 28        More importantly, the letter had been forwarded to the plaintiffs’ solicitors more than a year before the commencement of the second tenancy. The defendant therefore alleged that the plaintiffs had misrepresented to him, at the time of negotiating the second tenancy, that he would be able to peacefully hold and enjoy the use of the premises for an uninterrupted period of three years. In his affidavit, the defendant claimed that if he had known that his use of the premises would be interrupted, he would never have signed the Tenancy Agreement as this would mean that he would have to incur unnecessary expenses in removing his furniture and fittings, moving his stocks, finding temporary storage for the furniture, fittings and stocks, renovating the premises and re-commencing business after the works were completed. The defendant also alleged that the plaintiffs, upon getting a tenant for a further three years at a good rental, immediately proceeded to plan and execute the works. The defendant also argued that the plaintiffs had breached the covenant for quiet enjoyment by demanding that he vacate the premises. 29        In response to the defendant’s allegations, the plaintiffs pleaded that when the Tenancy Agreement was entered into, they were of the view that no works were needed as the print-out provided by HDB at the time of purchase had stated that the property was for commercial use with an approved structural loading of 1.5kN/m². The plaintiffs only decided to carry out the strengthening works after waiting in vain from early 2002 to late 2003 for a reply from HDB which would hopefully confirm that the plaintiffs did not need to carry out any works to change the use of the second storey from living quarters to that of office use. 30        According to the plaintiffs, their letter of 9 January 2004 could not be construed as a demand for the defendant to vacate the premises. Furthermore, prior to the defendant vacating the premises, the plaintiffs and their staff had been consistently engaging the defendant or his staff in negotiations over the items the defendant would move and the compensation they would offer the defendant for the inconvenience caused by the proposed works. The first plaintiff was therefore very surprised when the defendant suddenly vacated the premises on 24 March 2004.",
        "The evidence": "31        As I have already set out the plaintiffs’ version of events at [5] to [16] above, I shall now focus on the evidence adduced from the first plaintiff during cross-examination. 32        The defendant’s solicitor argued that it was inconceivable for the plaintiffs to spend $5.6m on the basis of a print-out especially when the first plaintiff was well experienced in the sale and purchase of HDB properties, having bought several such properties previously. Nonetheless, despite his wealth of experience and the benefit of being advised by solicitors in relation to the sale and purchase of the property, the first plaintiff maintained that up until early 2002, he did not know that the second storey of the premises was for living purposes only, having used it as an office for his own business for six to seven years. 33        Another issue was whether the plaintiffs’ cause of action corresponded to the first plaintiff’s evidence that he had all along thought that the premises could be used as an office. The first plaintiff agreed that despite his insistence that there was a contradiction between the print-out provided by HDB and the lease instrument, no mention of this alleged contradiction was made in his solicitors’ letter dated 28 January 2002 to the HDB seeking change of use. He testified that he felt that there was no need to point out the contradiction as he was merely seeking to clarify the exact position. The first plaintiff denied that there was in fact to his mind no contradiction and that he had only sought to regularise his breach after his use of the second storey as an office was discovered by HDB. 34        While the first plaintiff confirmed that he would face a paper loss of over $1m in the value of the property if the change of use of the second storey from living purposes to that of commercial use was not effected, there was no deadline issued by HDB as to when the strengthening works had to be done. He testified that had the defendant refused to vacate the premises, he would have done the strengthening works after the defendant’s second tenancy ended. 35        The first plaintiff confirmed that the parties had entered into the second tenancy only after negotiations between the parties were carried out. The first plaintiff did not deny that during the negotiations up to the signing of the Tenancy Agreement, no mention was made to the defendant of the need for strengthening works to be carried out. He also admitted that the plaintiffs did not inform the defendant of the proposed upgrading works to the Ang Mo Kio town centre. However, the first plaintiff testified that the tenants of the shops around the area would have received brochures on the proposed upgrading works from the Ang Mo Kio Town Council, and that there was an exhibition showing the proposed upgrading works in the heart of Town Square, less than 100m from the property. The defendant denied however that he had seized the opportunity, as presented by the plaintiffs’ letter of 9 January 2004, to vacate the premises in view of the impending major upgrading works to the Ang Mo Kio town centre, which would, as he admitted, adversely affect the flow of customers to his shop. The defendant also denied that he knew of the upgrading works. 36        Next, I looked at the defendant’s evidence adduced in cross-examination. In contrast to the plaintiffs’ testimony, the defendant’s evidence was inconsistent and contradictory at times. I found him evasive. The concluding submissions made by counsel for the plaintiffs rightly pointed out that it was unclear from the defendant’s evidence and pleadings what was the exact representation which the plaintiffs were alleged to have made and upon which the defendant allegedly relied on and was induced thereby to enter into the second tenancy. 37        As set out above in [21], on 23 March 2004, the defendant initially said that the representation made by the plaintiffs was in failing to inform him that he would have to vacate the premises for strengthening works, thereby misleading him into signing the Tenancy Agreement. The defendant further alleged that he would not have signed the document had he been apprised of this fact. The defendant subsequently pleaded in his defence that he was entitled to rescind the contract as he was induced into entering the second tenancy by the plaintiffs’ representation that the monthly rental would be reduced from $19,000 to $17,000 and that he would be allowed the uninterrupted use and occupation of the premises for an additional period of three years. 38        Under cross-examination however, the defendant contradicted himself by testifying that he had entered into the second tenancy because he had extracted a good bargain from the plaintiffs, paying (approximately) $9,828 per month under the second tenancy as compared to $20,200 per month in the first tenancy, inclusive of Public Utilities Bill (PUB) charges amounting to $1,200 per month. 39        The defendant admitted that he was not truthful in his written testimony where he claimed that the monthly rental of $17,000 for the second tenancy was much higher than his initial offer of $15,000. Taking into account first, that he did not have to pay the monthly PUB charges of $1,200 under the second tenancy, second, that he had a rent-free month at the beginning of the second tenancy and third, that he had a subtenant who paid him a monthly rent of $5,500, the defendant agreed that he was effectively paying a monthly rental of $9,828. 40        In his affidavit, the defendant claimed that he had contacted the plaintiffs’ property agent sometime in late February or early March 2003, indicating his willingness to enter into a new tenancy if the monthly rental was reduced to $15,000 and the tenancy was granted for three years. However, the plaintiffs allegedly rejected his offer. By a letter dated 10 March 2003, he made the same offer again to the plaintiffs, informing them that he would vacate the premises at the end of March 2003 if his offer was refused. Cross-examined, the defendant’s evidence was that upon deciding to renew the tenancy, he sent the letter dated 10 March 2003 to the plaintiffs making the offer to renew. However, there was no evidence that the plaintiffs received the defendant’s letter. The address on the letter was incorrect and the defendant was unable to adduce evidence to corroborate his contention that he also faxed the letter to the plaintiffs. 41        There were other inconsistencies in the defendant’s evidence. For instance, the defendant had initially claimed that after vacating the premises, he only managed to find suitable alternative premises after a long search. Under cross-examination however, it emerged that the defendant had in fact entered into a tenancy agreement at the alleged alternative premises located at Harbourfront Mall in 2003. This was well before he vacated the plaintiffs’ premises in March 2004. 42        The defendant admitted that he held closing down sales at the property on 20 and 21 March 2004. This plainly contradicted his evidence that he only decided to vacate the premises on receiving the plaintiffs’ solicitors’ letter of 22 March 2004 which threatened to exercise the plaintiffs’ right of re-entry, as he was frightened at the prospect of being locked out of the premises. In the light of his contradictions and inconsistencies, I formed the view that the defendant was an unreliable and untruthful witness. 43        In reaching my decision, I was aware that inSundara Moorthy Lankatharan v PP[1997] 3 SLR 464, the learned Yong Pung How CJ said (at [44]): There is no rule of law that the testimony of a witness must either be believed in its entirety or not at all. A court is fully competent, for good and cogent reasons, to accept one part of the testimony of a witness and to reject the other … . In the defendant’s case however, it was unsafe to rely on any part of his testimony.",
        "The issues": "44        There were two issues I needed to determine in this case: (a)        Did the plaintiffs breach the covenant for quiet enjoyment, thereby repudiating the Tenancy Agreement? (b)        If the answer to (a) was in the negative, was the defendant entitled to rescind the Tenancy Agreement based on the allegedly fraudulent misrepresentation made by the plaintiffs?",
        "The law": "",
        "Repudiation of tenancy": "45        The question as to whether the contractual principle of repudiation applies to tenancies has been much debated in other common law jurisdictions. While the Court of Appeal inKlerk-Elias Liza v KT Chan Clinic Pte Ltd[1993] 2 SLR 417applied the principle of repudiation to a tenancy agreement, the issue was only clarified by Warren Khoo J inTan Soo Leng David v Lim Thian Chai Charles[1998] 2 SLR 923(“Tan Soo Leng David”) who rightly pointed out (at [17]) that the issue emanates from the more fundamental question concerning the nature of a lease. Is it essentially a purchase of rights in real property, or is it no more than a bundle of contractual rights and obligations? 46        As Khoo J inTan Soo Leng Davidconcluded (at [28]), whether the rules of contract law apply to a lease depends very much on the nature of the lease in question. He said: It seems to me there is much to be said for the application, in appropriate cases, of the contractual concept of repudiation and acceptance as a means, in addition to the traditional ones provided by common law, of bringing a lease to an end. It is particularly appropriate in the case of a lease in which the element of a purchase of an interest in land is not significant or is non-existent. In such cases, its application, together with the application of the rule about mitigation of damages, is more straightforward and is more likely to lead to a fair and equitable adjustment of the rightsand obligations of the parties where thetenant repudiates the tenancy, than is the application of any of the common law remedies I have referred to. 47        I found that the principle of repudiation applied to the Tenancy Agreement. In the present case, the issue was whether the plaintiffs had by their letter of 9 January 2004 requiring the defendant to vacate the premises for a period of 29 days from 25 March 2004 to 22 April 2004 thereby breached the covenant for quiet enjoyment and repudiated the Tenancy Agreement.",
        "Covenant for quiet enjoyment": "48        The covenant for quiet enjoyment operates to secure the lessee not merely in the possession, but also in the employment of the premises for all usual purposes; and where the ordinary and lawful enjoyment of the demised premises is substantially interfered with by the acts or omission of the lessor or those lawfully claiming under him, the covenant is broken. 49        InKenny v Preen[1963] 1 QB 499, Pearson LJ in the Court of Appeal said (at 511): The implied covenant for quiet enjoyment is not an absolute covenant protecting a tenant against eviction or interference by anybody, but is a qualified covenant protecting the tenant against interference with the tenant’s quiet and peaceful possession and enjoyment of the premises by the landlord or persons claiming through or under the landlord. The basis of it is that the landlord, by letting the premises, confers on the tenant the right of possession during the term and impliedly promises not to interfere with the tenant’s exercise and use of the right of possession during the term. I think the word “enjoy” used in this connection is a translation of the Latin word “fruor” and refers to the exercise and use of the right and having the full benefit of it, rather than to deriving pleasure from it. 50        It was previously thought that a covenant for quiet enjoyment is only breached if the title or possession of the land is affected. However, inHarrison, Ainslie & Co v Muncaster[1891] 2 QB 680, the UK Court of Appeal held that (at 684): Formerly it was thought that a covenant for quiet enjoyment only applied to an interference with the title of the covenantee, but upon more careful consideration it was held that it applied to an interference with the enjoyment of the thing demised; and it seems clear that there may be an interference with the enjoyment of property without any interruption to or interference with the title to it 51        Whether this interference has taken place is, in each case, a question of fact. InOwen v Gadd[1956] 2 QB 99, the UK Court of Appeal said (at 105): The question whether the quiet enjoyment of the premises demised has been interrupted or not is in every case one of fact; and the covenant is broken although neither the title to the land nor the possession of the land may be otherwise affected, where the ordinary and lawful enjoyment is substantially interfered with by the acts of the lessor or of those lawfully claiming under him. 52        It is clear that a tenant is not obliged to wait until the landlord changes the locks of his premises before he can claim that the landlord has repudiated the tenancy. As Lord Evershed MR in the same case opined (at 107): It was said by Mr. Chapman that we must further qualify the language of Fry L.J. and that there could be no breach of the covenant for quiet enjoyment unless there was what he called an actual physical irruption into or upon the premises demised on the part of the landlords or some persons authorized by them by their actually entering upon or invading the premises, or by, e.g., the irruption thereon of water emitted from the landlords’ premises elsewhere. In my judgment, that submission is not justified by the authorities. 53        However, as the authors ofHill & Redman’sLaw of Landlord and Tenant(John Furber gen ed) (LexisNexis Butterworths, Looseleaf Ed, September 2003 release) rightly noted (at A1857), the mere likelihood of interruption is not enough. Hence, inHoward v Maitland(1883) 11 QB 695, the UK Court of Appeal held that there had been no breach of the covenant for quiet enjoyment although a judgment had been obtained subjecting the land to a right in common, as there was no entry on, or actual disturbance of, the lessee. Brett MR opined (at 700): Therefore there having been no absolute interference with the plaintiff’s actual enjoyment of this land until the property in it was taken away from him by the Epping Forest Act, 1878, it seems to me that there was no disturbance which could entitle him to maintain this action. 54        The law as regards the covenant for quiet enjoyment is therefore that to amount to a breach, there must be some interference with the enjoyment of the demised premises. The interference need not be direct or physical so long as it substantially interferes with the title to or possession of the demised premises or the ordinary and lawful enjoyment of those premises by the tenant. 55        InManchester, Sheffield & Lincolnshire Railway Company v Anderson[1898] 2 Ch 394(“Manchester”), the defendant pleaded that the plaintiff company had breached the covenant for quiet enjoyment as works done by the plaintiff company had resulted in structural injury to his house and had also for some time rendered the access to his premises less convenient. In response, Lindley MR said (at 401): I will only add a few words about the covenant for quiet enjoyment because counsel for the defendant urged us to go to an extent rather alarming to real property lawyers. I take it that a mere temporary inconvenience caused by a lessor, not in depriving his tenant of a right of way, but in rendering his access less convenient than it was, is not a breach of covenant for quiet enjoyment. A temporary inconvenience which does not interfere with the estate or title or possession is not, to my mind, a breach of covenant, nor is there any case that goes anything like the length required to shew that it is. … But to say that partly blocking up a public street, which is an inconvenience to the public and an inconvenience to any one residing near the place, is a breach of covenant for quiet enjoyment, is going far beyond any authority I am aware of. 56        InPhelps v City of London Corporation[1916] 2 Ch 255(“Phelps”), the plaintiff claimed that he was entitled to relief against a nuisance or breach of the covenant for quiet enjoyment and sought to restrain the construction works being carried out by the defendant. Peterson J said (at 267): The last complaint which the plaintiff puts forward is founded on noise; he claims to be entitled to relief against a nuisance or against a breach of the covenant for quiet enjoyment. So far as nuisance is concerned, it is temporary and does not constitute a cause of action:Harrisonv.Southwark and Vauxhall Water Co[1891] 2 Ch. 409. Moreover, a temporary inconvenience, such as this, is not a breach of the covenant for quiet enjoyment:Manchester, Sheffield and Lincolnshire Ry. Co. v Anderson[1898] 2 Ch 394, 401; and it is at least doubtful whether a nuisance by noise is a breach of such a covenant:Jenkinsv.Jackson40 Ch. D. 71. 57        Counsel for the plaintiffs argued that these authorities stand for the proposition that a temporary inconvenience does not amount to a breach of the covenant for quiet enjoyment. While I agree with the decisions in those cases, I am of the view that the facts inManchesterandPhelpsare very different from those at hand and do not stand for the proposition which counsel claims they do. 58        Indeed, the breach of the covenant for quiet enjoyment can be of a temporary nature so long as the interference is substantial. InBudd-Scott v Daniell[1902] 2 KB 351, the defendant succeeded in her counterclaim for breach of an implied covenant for quiet enjoyment as she had to move out of the house for two weeks during the tenancy agreement to allow the plaintiff, who was obligated under a private Act of Parliament, to paint the house. 59        I come to the last line of cases where courts have found that there has been a breach of the covenant for quiet enjoyment where landlords have either by threatening behaviour or words sought to evict their tenants. InSampson v Floyd[1989] 2 EGLR 49, the tenant left the premises after fighting with the landlord on three occasions. The landlord had used abusive language demanding that the tenant leave the premises and on the last occasion, the tenant’s wife had been so terrified that she hid underneath one of the caravans. The UK Court of Appeal said: It is, however, clear that eviction need not be physical. If the landlord’s conduct was such as to frighten the plaintiff, both on his behalf and on his wife’s behalf, then there was an eviction. 60        InKenny v Preen([49]supra), the UK Court of Appeal found that the acts of the landlord amounted to a breach of the covenant for quiet enjoyment on the basis that it amounted to a direct physical interference with the tenant’s use and enjoyment of the premises. I agree with Pearson LJ who opined (at 510–511): In this case the landlord was asserting that the tenant’s title, her right to possession of the premises, although initially valid, had been wholly determined by a notice to quit. In my judgment, a landlord by merely making that assertion, however wrong he may be, does not commit a breach of covenant. He is entitled to make that assertion, at any rate if he believes it to be true, frequently, emphatically and even rudely. He is entitled also to threaten proceedings in the courts for possession and damages. In the present case, however, there was much more than that. The landlord evaded answering the solicitors’ letters raising the tenant’s defences to his claim. He concentrated his attention on the tenant herself and tried, by a series of threatening communications, to drive her out of her possession of the premises. The threats were not merely of legal proceedings: there were threats of physical eviction of the tenant and removal of her belongings. Moreover, there was an element of direct physical interference by repeatedly knocking on the door and shouting the threats to her. That element of direct physical interference was not trivial but substantial in this case, because it was persisted in and because it has to be seen against the background of the threatening letters. 61        I was of the view that the plaintiffs’ conduct could not be said to amount to a substantial interference with the defendant’s use and enjoyment of the premises. Prior to the defendant’s sudden move on 24 March 2004, the plaintiffs were engaged in negotiations with the defendant as to when the defendant would move out and how the plaintiffs would compensate the defendant for the resultant inconveniences of the proposed works. Admittedly, the first plaintiff did not agree to most of the defendant’s requests. Nonetheless, I was satisfied that the plaintiffs had no intention of evicting the defendant out of the premises by their letter of 9 January 2004 [12]. While the plaintiffs’ solicitors’ letter of 22 March 2004 threatened to exercise the plaintiffs’ right of re-entry, this was in relation to their claims against the defendant for the outstanding rental for the months of February and March 2004, which the defendant admitted during cross-examination that he had deliberately refused to pay. Further, as mentioned above in [42], I disbelieved the defendant’s evidence that he was frightened at the prospect of being locked-out upon receiving this letter as he had already held closing down sales prior to receiving this letter. He was in no way threatened by the plaintiffs’ letters. 62        I therefore formed the view that the defendant was the one who, by vacating the premises, had repudiated the Tenancy Agreement.",
        "Fraudulent misrepresentation": "63        The law on fraudulent misrepresentation was considered by our Court of Appeal inPanatron Pte Ltd v Lee Cheow Lee[2001] 3 SLR 405at: 13         The law as regards fraudulent representation is clear. Since the case ofPasley v Freeman(1789) 3 Term Rep 51, it has been settled that a person can be held liable in tort to another, if he knowingly or recklessly makes a false statement to that other with the intent that it would be acted upon, and that other does act upon it and suffers damage. This came to be known as the tort of deceit. InDerry v Peek(1889) 14 App Cas 337 the tort was further developed. It was held that in an action of deceit the plaintiff must prove actual fraud. This fraud is proved only when it is shown that a false representation has been made knowingly, or without belief in its truth, or recklessly, without caring whether it be true or false. 14         The essentials of this tort have been set out by Lord Maugham inBradford Building Society v Borders[1941] 2 All ER 205. Basically there are the following elements. First, there must be a representation of fact made by words or conduct. Second, the representation must be made with the intention that it should be acted upon by the plaintiff, or by a class of persons which includes the plaintiff. Third, it must be proved that the plaintiffhad acted upon the false statement. Fourth, it must be proved that the plaintiff suffered damage by so doing.Fifth, the representation must be made with knowledge that it is false; it must be wilfully false, or at least made in the absence of any genuine belief that it is true. 64        The first question I considered was whether the plaintiffs had indeed made a representation to the defendant. The defendant claimed that the plaintiffs fraudulently represented that he would have the uninterrupted use and occupation of the premises for an additional period of three years despite being aware of the fact that works would have to be done during the second tenancy. As Andrew Phang in his bookCheshire, Fifoot and Furmston’sLaw of Contract (Singapore and Malaysian Edition) rightly opines (at p 412): Silence upon some of the relevant factors may obviously distort a positive assertion. A party to a contract may be legally justified in remaining silent about some material fact, but if he ventures to make a representation upon the matter it must be a full and frank statement, and not such a partial and fragmentary account that what is withheld makes that which is said absolutely false. A half-truth may be in fact false because of what it leaves unsaid, and, although what a man actually says may be true in every detail, he is guilty of misrepresentation unless he tells the whole truth. 65However, I found that the plaintiffs made no such representation to the defendant. The defendant had the burden of proving that the plaintiffs had in fact made a representation, which he failed to discharge. Even if I was wrong in reaching this conclusion, the defendant could not succeed as he was not induced to enter into the contract by the plaintiffs’ alleged misrepresentation. 66        A representation does not render a contract voidable unless it was intended to cause and has in fact caused the representee to make the contract. InSmith v Chadwick(1882) 20 Ch D 27, the plaintiff frankly admitted in cross-examination that although the company’s prospectus listed a certain important person as being a director of the company, he had been in no degree influenced by this misstatement in purchasing the company’s shares. This was similar to the facts of the present case where the defendant admitted under cross-examination that he had entered into the second tenancy as he got a good bargain paying a greatly reduced rent as compared to what he had paid under the first tenancy. Accordingly, the defendant’s defence failed",
        "Conclusion": "67        For the reasons set out earlier, I found no merits in the defendant’s defence or counterclaim. Consequently, I awarded interlocutory judgment to the plaintiffs with costs, and directed that damages be assessed by the Registrar with the costs thereof reserved to the Registrar."
    }
}