{
    "case_title": "Cheong Wai Keong v Public Prosecutor",
    "ncitation": "[2005] SGHC 126",
    "coram": "Yong Pung How CJ",
    "sections": {
        "The facts": "2          The appellant admitted without qualification to the Statement of Facts. It recited that on 24 June 2005 at about 7.55am, Sergeant Kelvin Chee Hau (“Sgt Chee”) attended to a dispute at No 10 Ubi Crescent, Ubi Tech-Park Building (“the Tech-Park”). At the scene, the appellant informed Sgt Chee that he had earlier driven his motor car SDV 7890M a short distance along Ubi Crescent. His intention had been to park his vehicle inside the Tech-Park but he had been stopped from doing so by the security guard. As the appellant smelt strongly of alcohol and had an unsteady gait, Sgt Chee administered a breathalyser test on him. The appellant failed the test. He was subsequently placed under arrest and taken to the Traffic Police Division for a Breath Evidential Analyser test. The test result showed that the appellant’s breath specimen contained 87 microgrammes of alcohol per 100 millilitres of breath. This greatly exceeded the prescribed limit of 35 microgrammes of alcohol per 100 millilitres of breath. 3          The appellant had had several previous criminal convictions, but only two were for traffic offences. These two traffic offences were not offences under s 67(1) of the RTA, nor were they offences that would trigger s 67A, the section providing for enhanced penalties for offenders with previous convictions under certain sections of the RTA. The punishment prescribed for the first conviction of an offence under s 67(1) of the RTA is a fine of not less than $1,000 and not more than $5,000, or imprisonment for a term not exceeding six months. In addition, under s 67(2) of the RTA, disqualification from holding or obtaining a driving licence for 12 months is mandatory, unless “special reasons” are shown to the court and the court thinks fit to order otherwise. 4          In a mitigation plea on behalf of the appellant, counsel for the appellant submitted that, as the appellant had driven only a short distance and in circumstances such that he was unlikely to be brought into contact with other road users, these amounted to special reasons such that the appellant should be disqualified for a period shorter than the mandatory minimum of 12 months. It was submitted that on the night before the date of the offence, the appellant had parked his car by the side of the road, along double yellow lines. He had consumed alcohol with his friends, and had no intention of driving his car that night after having parked it. The next morning, he was informed that one of his workers who was at the Tech-Park was having a problem, and he was asked to proceed to the Tech-Park to see if he could solve the problem. 5          It was when the appellant reached the location that he realised that his car was parked along double yellow lines, and that it might cause obstruction to other road users if he left it there for the day. The appellant therefore decided to move the car to the car park which was just next to the road where the car was parked. He drove a distance of about 25 feet from where he had parked the car to the beginning of the driveway into the car park, and about another 35 feet along the driveway to the barrier of the car park. The appellant contended that as he drove his car at 7.55am, there was no traffic on that road and no one was using the short stretch of the road at that time. Further, he had only driven along the side of the road before turning left into the car park, and had had no intention of driving the car after that.",
        "The decision below": "6          The trial judge held that the circumstances surrounding the appellant’s driving of the car did not amount to special reasons to reduce the period of disqualification imposed on the appellant. The trial judge held that, even if he were wrong in this regard, he would not exercise the discretion not to disqualify the appellant for the mandatory period. The trial judge therefore sentenced the appellant to a fine of $2,300 and a disqualification for the mandatory minimum period of 12 months.",
        "The appeal": "7          The sole ground of appeal in this case was whether the fact that the appellant had driven over a short distance and in circumstances such that he was unlikely to be brought into contact with other road users amounted to a special reason to reduce the period of disqualification prescribed by law.",
        "The law": "8          Case law has established that a “special reason” is a mitigating or extenuating circumstance, not amounting in law to a defence to the charge, yet directly connected with the commission of the offence and one which the court ought properly to take into consideration when imposing punishment. A circumstance peculiar to the offender as distinguished from the offence is not a special reason:R v Crossen[1939] 1 NI 106;Whittall v Kirby[1947] KB 194;PP v Balasubramaniam[1992] 1 SLR 822;Sivakumar s/o Rajoo v PP[2002] 2 SLR 73.Further, even if special reasons are established by the offender, it does not automatically mean that the offender will not be disqualified. The court must separately consider whether the discretion not to disqualify should be exercised in favour of the offender:Sivakumar s/o Rajoo v PP. 9          There are no local cases on the issue of whether the fact that the appellant had driven over a short distance and in circumstances such that he was unlikely to be brought into contact with other road users would amount to a special reason. 10        Early English cases suggest that if the distance driven by a defendant is short, this will amount to a special reason such that an order of disqualification will not be imposed:R v Agnew[1969] Crim LR 152 andJames v Hall[1972] 2 All ER 59. 11        Later cases, however, have clarified that a special reason is only established if the shortness of the actual distance driven by the offender is such that he is unlikely to be brought into contact with other road users and danger is unlikely to arise. InCoombs v Kehoe[1972] 2 All ER 55, Lord Widgery CJ held thatJames v Hallwas a very special case which should not be extended. Lord Widgery CJ drew a distinction between the facts inJames v Hall, where the circumstances were such that the offender had only driven a few yards and the offender’s actions were unlikely to bring him into contact with other road users and thus unlikely to produce a source of danger, and the facts inCoombs v Kehoe, where the respondent had driven his lorry through busy streets for 200 yards and his lorry was a potential source of danger to other road users. In the latter case, it was held that the circumstances surrounding the respondent’s actions did not amount to a special reason, and mandatory disqualification was imposed on the respondent. 12        The point that driving for a short distanceper secould not amount to a special reason for non-disqualification was also highlighted in the case ofChatters v Burke[1986] 3 All ER 168. The court listed seven matters which should be considered when deciding whether special reasons exist. They are: (a)        how far the vehicle was driven; (b)        the manner in which the vehicle was driven; (c)        the state of the vehicle; (d)        whether the driver intended to drive any further; (e)        the road and traffic conditions prevailing at the time; (f)         whether there was any possibility of danger by contact with other road users; and (g)        the reason for the vehicle being driven. 13        Of these seven matters, item (f) was held to be the most important. The facts of the case were that the respondent was a passenger in a car when the driver lost control of it. The car left the road and ended up in a field next to the highway. The respondent then drove the car a few yards, from the field through a gateway onto the road. He then parked the car on the road. The court considered the following factors: that the respondent had only driven a short distance with the distance driven on the road being minimal; the respondent was not intending to drive the vehicle any further; there was minimal danger caused to other road users; and the reason for moving the car from the field was that the respondent had thought that it was the right thing to do. It was held that special reasons for not disqualifying the respondent had been established.",
        "My decision": "14        In my opinion, the English cases discussed above do not provide useful guidance to our courts when we are asked to determine whether “special reasons” exist. Courts in England often take time in considering the distance traveled, and whether there was other traffic at the time, before deciding whether or not there were special reasons to reduce the mandatory period of disqualification of 12 months. 15        I was of the view that, while “special reasons” may be taken into account in deciding whether or not to reduce the period of disqualification, there should not be any consideration given to the distance traveled. Courts would find it an impossible task to try and determine the relevance of various distances in different cases in deciding on whether or not to allow the period of disqualification to be reduced. It would be difficult in practice to administer the law. 16        To my mind, it would be preferable to lay down a simple rule that a person who is convicted of drink-driving should be disqualified for the mandatory 12 months period, if he has started the car and moved it at all, unless there are very “special reasons” for not doing so, bearing in mind that the distance traveled does not constitute a “special reason” as such. 17        Whether or not there are very “special reasons” can then be left to be determined by the courts without reference to the distance traveled. 18        Given my views on this matter, I was of the opinion that the appellant’s sole ground of appeal was wholly without merit. The circumstances surrounding the appellant’s driving of the car did not constitute a special reason to reduce the period of disqualification imposed on him. Accordingly, I dismissed the appeal. Appeal dismissed."
    }
}