{
    "case_title": "Lai Swee Lin Linda v Attorney-General",
    "ncitation": "[2005] SGHC 182",
    "coram": "Tan Lee Meng J",
    "sections": {
        "The appeal": "8          Under s 64 of the Bankruptcy Act (Cap 20, 2000 Rev Ed), the court may, for sufficient reason, make an order staying the proceedings on a bankruptcy petition, either altogether or for a limited time, on such terms as the court may think just. In view of this, the issue before the court is whether there is sufficient reason for a stay of the bankruptcy proceedings. Regrettably, at the hearing of the appeal, Ms Lai did not furnish any good reason as to why her appeal against the assistant registrar’s decision should be allowed. 9          During the hearing of the appeal, Ms Lai, who commenced Suit No 995 of 2004 against the Attorney-General for breach of her employment contract after her action against the PSC was dismissed by the Court of Appeal in 2001, focused her attention on this new suit, which had nothing to do with the statutory demand in question. She informed the court that in her new action against the Attorney-General, she was seeking to recover the costs that she had been ordered by the Court of Appeal to pay the PSC in 2001. She could not accept that the question of reversing the Court of Appeal’s order of 29 January 2001 on the costs in her previous suit against the PSC did not arise. In para 7 of her written submissions, she stated: Using medical analogy, it was the Defendant which caused the sickness, should not the perpetrator of the sickness be liable for costs? If there was no sickness in the first place, there would be no need for any panacea. Using another analogy, should not the perpetrator of a crime be liable for his actions? 10        Ms Lai alleged that the Attorney-General was using the costs owed by her as “a weapon to prevent her from pursuing the matter” so that the “failure to comply with rules and procedures and the abuse of power would be swept under the carpet”. She did not substantiate this allegation. 11        After taking all the circumstances into account, I dismissed her appeal against the assistant registrar’s decision to refuse to order a stay of the bankruptcy proceedings against her."
    }
}