{
    "case_title": "Public Prosecutor v Kok Weng Shang Bernard",
    "ncitation": "[2005] SGHC 64",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The facts": "2          The accused was born on 28 May 1985. At the time of the offence, he was four weeks away from his 19th birthday. He was unemployed. 3          The accused and the deceased were classmates in 2000 when they were both Secondary 2 students in Guang Yang Secondary School. They could not get along with each other and often fought. The following year, they moved to different classes in Secondary 3. At the end of 2001, the accused left the school to study at an Institute of Technical Education. The two teenagers ceased to have contact thereafter. In July 2003, the deceased left the school and started work. 4          It appeared from the investigations that the accused hated the deceased very much since their school days. He claimed that the deceased had made fun of him, bullied him, scolded him with “bad words”, laughed at him and made “snake sounds” at him. He further claimed that in 2002, after his short stint at the Institute of Technical Education, he began to hear voices in Hokkien telling him that if he did not kill the deceased, people would get married. The accused disliked people getting married because he was evil. He then decided to kill the deceased. He claimed that several others, including his father and his classmates, also asked him to kill the deceased. Even the deceased himself asked him to kill him. The deceased was his enemy and he would lose face if he did not kill him. 5          The accused then began looking for the deceased. He bought knives on a few occasions and, when he could not locate the deceased, would throw them away before returning home. Sometimes, he would bring a kitchen knife from his home. 6          On 30 April 2004, the accused went to West Mall Shopping Centre (“West Mall”) to do some shopping and also to look for the deceased. Quite fortuitously, he saw the deceased at the sports goods shop there. The deceased had been working as a part-time staff there for about six months. The accused observed the deceased from a distance for a while and then left for home. 7          The next day, the accused went to the same shopping mall with a knife that he had bought a few months back and which he kept at home. Upon arriving at the mass rapid transit station next to West Mall, he put on a pair of sunglasses to avoid being recognised by the deceased. He went up to the sports goods shop and pretended to browse. A sales assistant went up to him to offer his assistance but the accused merely stared at him and continued walking around. The supervisor of the shop spoke to the deceased who informed him that the accused was his former classmate and he had some mental problems. 8          When the deceased was about to walk out of the shop to buy some food, the accused took out the knife from his front right trousers pocket to try to stab the deceased at the back of his neck. A struggle ensued and both fell to the ground whereupon the accused stabbed the deceased’s neck. The deceased became motionless. None of the shop’s staff and customers dared to approach the accused as he was still holding the knife. One Caucasian customer asked him to drop the knife but was chased by the accused out of the shop. The shop’s supervisor then telephoned the police while another staff member ran out of the shop to get assistance from security officers of the mall. 9          The accused returned to the shop, walked up to the deceased’s motionless body and began to stab him repeatedly in the stomach, the neck and the face. He then walked out of the shop and stood outside. 10        Two of the mall’s security officers, Ayasamy Paliniappan and Kalidas s/o Rajendran (“Kalidas”), arrived outside the shop and wanted to prevent the accused from leaving. The accused pointed the bloodstained knife at them. He then walked about aimlessly in the shop. A cleaning supervisor, Anandan s/o Palanisamy Manickam (“Anandan”), arrived at the shop to help. The accused knelt down next to the deceased and stabbed him several more times. He then walked around the shop again, still holding the knife. A volunteer special constable from the Police Coast Guard, Imran bin Mawi, who happened to be at the mall at that time, also went up to the shop to render assistance. Kalidas took a metal rod from another shop and the four men confronted the accused, shouting to him to drop the knife. After some time, the accused threw the knife on the floor. Anandan immediately punched him in the stomach and floored him. The men pinned the struggling accused down and subdued him. The two security officers then used their neckties to bind his hands and his legs. 11        The police arrived shortly thereafter and took over custody of the accused. 12        Dr Gilbert Lau, a forensic pathologist from the Health Sciences Authority, certified the deceased’s cause of death as due to severe, acute haemorrhage primarily caused by a deep, incised wound of the neck that had severed the right common carotid artery, incised the right internal jugular vein and transected the larynx and oropharynx. In total, the deceased suffered five incised wounds and 14 stab wounds at his head, neck and upper body. 13        On 6 May 2004, Dr Daniel Fung, a consultant psychiatrist from the Child Guidance Clinic, provided a medical report on the accused based entirely on medical records kept of the accused’s visits between December 2000 and March 2002. The accused was diagnosed to have Autistic Spectrum Disorder. During his sessions at the clinic, there were reports of him being physically aggressive towards his parents, having been reported to the police for overturning a cart in Bugis Junction and beating up a student in school. The family defaulted in follow-up sessions from March 2002. 14        Dr Cai Yiming, Senior Consultant Psychiatrist at the Institute of Mental Health and Woodbridge Hospital, examined the accused on 20 and 24 May 2004. He found that the accused was aware he had killed the deceased who, he alleged, had scolded and bullied him when they were classmates in 2000. The accused was not sure the deceased had died after the first wound. He therefore returned to stab the deceased a few more times and felt “more comfortable” after knowing that he was really dead. Dr Cai concluded that the accused held persistent persecutory delusion and hallucination and was suffering from a schizophrenic illness probably since 2000. He was of the opinion that the accused was not of unsound mind at the time of the offence but his mental state amounted to an abnormality of mind as would have substantially impaired his criminal responsibility. He stated that the accused had intended to kill the deceased. The accused was assessed to be fit to plead and to stand trial. 15        In a supplementary report, Dr Cai opined that the accused would require long-term medication and treatment and was likely to be a danger to himself or to society. 16        Dr Cai was cross-examined on his opinions by the Defence. He was referred to extracts fromKaplan & Sadock’s Comprehensive Textbook of Psychiatry,(7th Ed, 2000) and to theOxford Textbook of Psychiatry,(3rd Ed, 1996) at p 779, where guidelines on assessing “dangerousness” of patients were set out in a table. Defence counsel suggested to him that not all the factors mentioned there were satisfied in this case. Dr Cai replied that the said table concentrated on the nature of killing. He had, in offering his opinion, also taken into consideration factors relating to the nature of the illness. The accused is suffering from a serious mental illness, he is male (the prognosis for male patients is generally not as good as that for female patients) and the onset of his illness was a slow one. There was also a delay of around four years before treatment with poor premorbid adjustment. He killed without provocation. From Dr Cai’s observation of the accused’s conduct in court and the way he responded to the court’s questions, it was obvious to him that the accused’s condition has not improved and he is still unwell. For the present offence, it was the deceased who was the accused’s target but if the illness continues, the target may shift to someone else. Dr Cai recommended life-long treatment for the accused. 17        The accused had a clean record before this case. Because of the danger he poses to the public, the Prosecution submitted that the accused should be imprisoned for life.",
        "The mitigation plea": "18        The accused’s father, a retiree, is 63 years old. His mother, a clerical worker, is 56 years old. He has a 30-year-old brother and an identical twin brother. 19        He passed his Primary 6 examinations with an aggregate score of 182. While in secondary school, he was disruptive in class and could not get along with others because of his poor communication skills. On one occasion, he suddenly and gleefully poured a packet of soya bean drink over a teacher while she was eating alone in the school canteen. There was no provocation and the teacher had no previous interaction with him. On another occasion, he suddenly threw a book at the chest of another female teacher in class and looked gleeful after that. These acts, defence counsel submitted, were in the nature of childish pranks and not evidence of a violent disposition. 20        The deceased, it was alleged, armed with an iron rod, fought with the accused in school and punched him in the face on several occasions. He also challenged the accused to kill, used vulgarities against him and made hurtful remarks like calling the accused’s mother a prostitute. 21        The accused is autistic and was therefore exempted from performing National Service. While being treated at the Child Guidance Clinic between December 2000 and March 2002, he was disruptive and appeared to have no respect for anybody. 22        Dr Tan Chue Tin, a consultant psychiatrist in private practice, examined the accused recently on 16 February 2005 and interviewed his parents and his twin brother on a number of occasions. He reported that the accused heard a voice speaking in Hokkien in June 2003 telling him to kill the deceased as doing that would prevent men and women from getting married. He did not want people to get married because he was evil. His father, his classmates and even the deceased himself urged him to kill the deceased. Troubled by those voices, he began to search for the deceased and chanced upon him at West Mall. 23        Dr Tan agreed with the Prosecution’s Dr Cai that the accused suffers from schizophrenia, a major psychosis, and that he is fit to plead and to stand trial. Acknowledging that it was difficult to say whether or not the accused would commit murder again or would be a danger to society, Dr Tan opined that “it is more likely than not that Bernard is not prone to commit another murder (and therefore more likely than not that he is not danger to society)”. The target of his killing on 1 May 2004 was a specific person whom he hated and was therefore not a random killing. He stabbed no one else. There was no history of violence or of suicide-homicidal or sado-masochistic behaviour. The critical factor for arriving at this assessment was the accused’s satisfactory response to treatment and resolution of his hallucinatory and delusional psychotic symptoms. 24        Dr Tan was cross-examined by the Prosecution on his opinion. He was referred to the same materials put before Dr Cai. Dr Tan said that treating schizophrenia involved total management and that it was not necessarily confined to an institution. Family involvement, education and care were as important as medication. The accused’s family is very supportive in the care of the accused. Although the accused will suffer from schizophrenia for a long time, Dr Tan believed that with modern treatment and family care, the accused could be made to be as functionally normal as possible. He did not think that the accused would be less likely to comply with instructions to take medication. He was of the view that the accused had recovered partially by the time Dr Tan saw him in February 2005. 25        Defence counsel stated that the accused was well-behaved in the remand prison, spending his time reading. He no longer hears the voices in his head. He has pleaded guilty, thereby accepting responsibility for his actions and saving trial time. After the death of the deceased, there was nothing to suggest that the accused would suffer a relapse and repeat such an offence. He had been provoked by the actions and words of the deceased and other schoolmates while they were in the same school and “may have erred to protect his mother’s reputation”. 26        Based on the above, defence counsel urged the court to sentence the accused to the lower tier of ten years’ imprisonment in s 304(a) of the Penal Code (Cap 224, 1985 Rev Ed).",
        "The decision of the court": "27        Before sentencing the accused to imprisonment for life, I made the following remarks. 28        This gruesome killing of a teenager is a tragic case of one young life lost at the hands of an equally young man diagnosed, quite sadly, to be suffering from schizophrenia. In cases involving accused persons such as Mr Bernard Kok here, the law is clear – in deciding whether to impose imprisonment for life or for a term of up to ten years, the court has to consider the following factors: (a)        Is the offence in itself grave enough to require a very long sentence? (b)        Does it appear from the nature of the offence or from the history of the accused that he is a person of unstable character likely to commit such an offence in the future? (c)        If the offence is committed, would the consequences to others be specially injurious, as in the case of sexual offences or crimes of violence? A sentence of life imprisonment is justified if the answers to these three considerations are affirmative (seeNeo Man Lee v PP[1991] SLR 146,PP v Ong Wee Teck[2001] 3 SLR 479andPP v Kwok Teng Soon[2001] 4 SLR 516). Caning is not imposed in such cases as the accused persons would have been suffering from such abnormality of mind as would have substantially impaired their mental responsibility for their acts. 29        In the above cited case ofPP v Kwok Teng Soon, a decision affirmed on appeal to the Court of Appeal, I expressed the view that the purpose of the three conditions inNeo Man Lee v PPis not to determine how evil a particular accused person can be but is to extrapolate from his condition and his actions the likelihood of a relapse and what the probable consequences might be in such an event. 30        The medical evidence from the Prosecution shows that the accused here has been suffering from a schizophrenic illness from around 2000 and that he held persistent persecutory delusion and hallucination. The prognosis for his illness, unfortunately, is likely to be poor. He probably requires life-long medication and treatment and is likely to be a danger both to himself and to others. 31        The medical opinion tendered by the defence acknowledges quite fairly that the question whether or not the accused here may commit murder again and whether he poses a danger to society is a difficult one to answer. Being of the view that the killing of the deceased was person-specific and the accused had no history of violence or suicide-homicidal behaviour, the Defence’s consultant psychiatrist opines that it is more likely than not that the accused is not prone to commit another murder and therefore more likely than not that he is not a danger to society. 32        InPP v Kwok Teng Soon, it was argued that the 51-year-old accused there had felt cheated by his wife, whom he almost decapitated, and that the delusional state suffered by him was therefore person-specific. As he was already 51 years old, if sentenced to the lower tier of ten years’ imprisonment, it was not likely that he would be in a similar situation again with someone else upon his release. It was also said that the accused there was responding well to the prescribed medication and that the prognosis for his illness was good. I was not persuaded by the arguments there. 33        In the present case, I regret that I do not share the optimism of the Defence’s medical opinion. There is no telling whom the accused may next consider to be his “tormentor”. Even if he was justifiably angered by the deceased’s taunting and bullying in 2000, there was a period of two to three years when there was no contact at all between them before the killing. Yet something sinister was brewing in the accused’s mind even after this period of time. Who might be the next Kelvin (the deceased) whom he must kill to “prevent men and women from getting married”? This appears to me a very real risk and I do not think society should be made to bear this risk and that some parents in the near future should have to lose their son like Kelvin’s parents did. 34        The accused requires long-term medication and treatment. Will he keep his medical appointments and comply faithfully with the directions on medication given to him? He has defaulted at the Child Guidance Clinic before. I am heartened to hear that his family is concerned and supportive. If he is sentenced to ten years’ imprisonment and is released after another six years or so, his father and his mother would be 69 and 61 years old respectively. His elder brother (by then 36 years old) would have his own life to lead and so would the accused’s twin brother (by then 26 years old). Together with his past behavioural problems, including being physically aggressive towards his parents, I am not at all confident that the accused will co-operate with those eager to help him recover and see him well and I doubt his parents will be in a position to control him effectively then. 35        The Court of Appeal inPP v Tan Kei Loon Allan[1999] 2 SLR 288cautioned that life imprisonment for a young offender would be much more drastic in its effect than for an older one because it is incarceration for the remainder of one’s life, subject to the possibility of parole after twenty years. It is unusual for an offender in such a case to be as young as the accused here but the consequences of his acts are no less horrifying and devastating than those of older offenders. 36        Undoubtedly, the conditions spelt out inNeo Man Lee v PPare satisfied. I feel very sorry for the unfortunate condition the accused is in but the safety of society is paramount. 37        On this topic of safety of the public, I commend all the people who assisted in subduing the then knife-wielding and agitated accused at the shopping mall, especially Mr Ayasamy Paliniappan, Mr Kalidas s/o Rajendran, Mr Anandan s/o Palanisamy Manickam and Mr Imran bin Mawi. Their quick thinking and brave acts have averted what could have been a second disaster in the busy shopping centre on that public holiday last year. 38        For the reasons stated, I now sentence the accused, Mr Bernard Kok Weng Shang, to imprisonment for life with effect from the date of his arrest on 1 May 2004. Accused sentenced to imprisonment for life."
    }
}