{
    "case_title": "Re Wong Sook Mun Christina",
    "ncitation": "[2005] SGHC 100",
    "coram": "Andrew Phang Boon Leong JC",
    "sections": {
        "Introduction": "1          The law exists in order that justice can be achieved. Not justice in the abstract but, rather, in the context of the very real and complex world where much injustice would otherwise abound. In few other disciplines are ideal and actuality so inextricably linked. Unfortunately, however, there will always be a tension or gap between ideal and actuality. This occurs because the various facets of the law that have been fashioned to aid the courts in the goal of achieving justice are necessarily limited in a number of ways. 2          One main limitation is this. It is that each proposition or set of propositions of law cannot, by their very nature, encompass every possible factual scenario that arises for decision by the courts. On occasion at least, the factual matrix is simply not covered by the principle at hand. Under such circumstances, other legal principles or even extra-legal assistance must be sought. 3          Unfortunately, this was one instance where the legal principle or rule concerned could not aid the court. As we shall see, this was not because of any inherent defect as such within that particular principle or rule. It was simply not intended to cover the situation in question. That rule was to be found in s 110 of the Evidence Act (Cap 97, 1997 Rev Ed). Before proceeding to consider it, however, it would be appropriate to set out the legal issue arising from a comparatively simple factual matrix.",
        "The factual matrix and legal issue": "4The legal issue arose from a less than ideal fact situation. In many ways, it was quite tragic. It had its roots in familial disharmony and, ultimately, fragmentation. Such situations are especially painful because they involve human relationships that are intended to connect intimately. These relationships – between husband and wife, between parent and child, as well as between and amongst siblings – are the microcosm as well as foundation of community itself. 5          Unfortunately, the ideal of community was, in this particular instance, not to be. We begin with a husband and a wife who were married on 2 December 1963. There were three offspring of the marriage – two daughters and a son. The husband left for the US in an apparently abrupt manner after a quarrel that he had, presumably, with his wife. This took place in 1979. He did not leave any forwarding address or contact number; he only stated that he was leaving for the US. Over a quarter of a century has passed. That is a long period of time, by any stretch of the imagination. However, there was, with one exception, no contact between the husband and his wife and/or his children all this while. The exception occurred in 1994 when, out of the blue, the husband gave the eldest daughter a power of attorney. The power of attorney originated in the State of New York and was dated 25 March 1994. This did not confer any benefit on the family as such. It was related to the matrimonial property and was, presumably, intended to bring to an end an unhappy marital relationship. The husband and his wife were then in the midst of divorce proceedings initiated by the wife in 1993, and which are elaborated upon briefly in the next paragraph. This was clearly the husband’s perspective, as far as I could see. There was no indication that he wanted to keep in touch with his family in any way. This is a significant fact that I shall have occasion to touch on again later. 6          What is also a significant fact is that the power of attorney mentioned in the preceding paragraph was given by the husband in response to a petition of divorce filed by his wife in 1993 (see Divorce Petition No 2342 of 1993). He did not appear before the court as service of the petition on him was dispensed with pursuant to an order of court. The decreenisiwas granted in November 1993 and was made absolute in September 1996. 7          It is presently the year 2005. The present application came before me. In it, the applicant, the younger daughter and indeed youngest child of this family, sought an order from this court declaring that her father be presumed dead. The reason for this application was set out in her Affidavit. Put simply, she stated that the family had suffered much from both financial and emotional points of view. In particular, in so far as the former perspective was concerned, her family had hitherto been assisting in financing her overseas university education at a university in the US. An appeal was made by the applicant’s mother (through her Member of Parliament) to the Central Provident Fund (“CPF”) Board for the withdrawal of funds in her husband’s account to assist in alleviating this financial burden. However, the CPF Board was unable to accede to this request. The CPF Board can only release the funds to the member on reaching the age of 55 or to his or her nominee in the event that the member has passed away or has been presumed to have passed away. If no nominee has been appointed, the funds will be released to the Public Trustee for distribution in accordance with the Intestate Succession Act (Cap 146, 1985 Rev Ed); hence, the present application. 8          It should be noted that counsel for the applicant, Mr Lam, informed me that no information had in fact been released by the CPF Board either as to the amount of funds which were in the applicant’s father’s account or as to whether or not there was indeed a nominee appointed. Indeed, the CPF Board, in its letter to the applicant’s mother, stated that “we are not in a position to assume that a member has passed away although he has been missing for a long time” and that “[o]nly the Court of Law is able to do so [by way of] an Order of Presumption of Death”. The applicant’s brother, through his solicitors, wrote a further letter (dated 29 May 2002) to the CPF Board, informing them that an application to the court seeking an order for the presumption of death of his father had been made, and sought confirmation as to whether any withdrawal of funds had been effected from his father’s account. However, the CPF Board replied, via a letter of 4 June 2002, thus: “We regret to inform you that we are unable to disclose to you the information you requested as the information is strictly confidential.” 9          The presumption the applicant sought to rely upon in the present proceedings is embodied within s 110 of the Evidence Act, which was briefly alluded to above. The provision itself reads as follows: Burden of proving that person is alive who has not been heard of for 7 years 110.When the question is whether a man is alive or dead, and it is proved that he has not been heard of for 7 years by those who would naturally have heard of him if he had been alive, the burden of proving that he is alive is shifted to the person who affirms it. 10In her Affidavit, the applicant details the efforts made – albeit unsuccessfully – to locate her father. In addition to a much earlier attempt in relation to the divorce proceedings referred to in [5] above (which consisted, in the main, in writing to the Embassy of the Republic of Singapore in the US and to the Controller of Immigration to locate him, and which were fruitless), the attempts this time around included the following: (a)        Letters were sent by the applicant’s mother’s then solicitors on or about 11 October 1999 to the applicant’s father’s last known address in the US as well as to the Notary Public (“the Notary Public”) who had notarised the power of attorney mentioned in [5] above. (b)        Letters, dated 26 February 2001, were sent by solicitors, on behalf of the applicant’s brother, to both her father and the Notary Public at their last known addresses. (c)        Letters, dated 15 February 2002, were sent, again on behalf of the applicant’s brother, to the Controller of Immigration as well as to the Singapore Embassy in Washington DC (“the Embassy”) (with further reminders to both dated 1 April 2002). The Controller of Immigration responded via letters dated 18 February 2002 and 28 February 2002 to the effect that the personal particulars sought (of the applicant’s father) were confidential. In response to further correspondence, the Controller of Immigration responded via a letter dated 12 April 2002 that the information sought “cannot be acceded to”. The Embassy responded to the applicant’s brother via a letter of 8 May 2002, stating that there was no record of the applicant’s father and that this could mean that he had not registered with the Embassy. It also stated that the Embassy had neither heard from him nor was aware of his latest address, although it added that the “Singapore Immigration and Registration (SIR) records show that [the applicant’s father] is still a Singapore citizen and SIR has not received any death records of him”. (d)        Advertisements were placed locally inThe Straits Timesof 21 February 2001 and in the US in theUSA Todayof 25 October 2001. (e)        Letters, dated 27 September 2004, were sent by the applicant’s present solicitors to both her father and the Notary Public at their last known addresses. (f)         Advertisements were once again placed locally inTheStraits Timesof 11 October 2004 and theLianhe Zaobaoof 27 September 2004, as well as (overseas) in theUSA Todayof 3 May 2004. 11I held, albeit reluctantly, that the above provision did not apply and that I could therefore not grant the application. I now give the reasons for my decision.",
        "Section 110 of the Evidence Act": "12        It will be seen that s 110 of the Evidence Act does not in fact operate in isolation. It has to be read with the preceding section,viz, s 109. Section 109 of the Evidence Act itself reads as follows: Burden of proving death of person known to have been alive within 30 years 109.When the question is whether a man is alive or dead, and it is shown that he was alive within 30 years, the burden of proving that he is dead is on the person who affirms it. 13The relevant case law is clearvis-à-visthe relationship between ss 109 and 110. Consistent, in fact, with the literal language of both provisions, s 110 is viewed as aprovisoto s 109 (see, for example,Sarkar’s Law of Evidencevol 2 (Wadhwa and Company, 15th Ed, 1999) at pp 1553 and 1555, andSir John Woodroffe & Syed Amir Ali’s Law of Evidencevol 3 (LexisNexis Butterworths, 17th Ed, 2002) at pp 4273, 4278 and 4283, as well as the Malaysian High Court decision ofRe Osman bin Bachit[1997] 4 MLJ 445at 448). 14        Applying the two provisions to the present factual matrix, the following scenario emerges. Under s 109, the burden of proving that a person (here, the applicant’s father) is dead is on the applicant since it is clear that her father was in fact alive within the last 30 years. Indeed, he was in touch with her elder sister with regard to his power of attorney in 1994. Even if we disregard this last-mentioned event, her father, having left in 1979, was last seen alive within 30 years. 15        As s 109 applied to impose the burden of proof on the applicant, the issue then arose as to whether or not s 110 applied to relieve her of that burden. This was, I take it, the nub of the present application. 16        Unfortunately, however, I had two difficulties. The first was that even if s 110 applied, the legal effect was to shift the burden of proof back to the person who was alleging that the person concerned (here, the applicant’s father) was alive (see also, for example,Narayan Bhagwant v Shriniwas Trimbak(1905) 8 Bombay LR 226 at 229,perJenkins CJ). This is as it should be for the presumption, even at common law (from which, as we shall see, s 110 was derived), was never a conclusive one. That this is so is made clear by the literal wording of s 110 itself. Hence, it is always open for the other party to adduce evidence to rebut the presumption contained in s 110. I am fortified in my view by the unambiguous proposition inSarkar’s Law of Evidencevol 2 ([13]supra) at p 1555 that s 110 “is a rebuttable presumption” (see alsoSir John Woodroffe & Syed Amir Ali’s Law of Evidencevol 3 ([13]supra) at p 4277). This also appears to be the position under English law (seeHalsbury’s Laws of Englandvol 17(1) (4th Ed Reissue, 2002) at para 580). 17        However, returning to the facts of the present proceedings, there was in point of fact no person or entity who was interested in proving that the applicant’s father was alive. The nearest possibility was the CPF Board but they were, in my view, neutral. In a nutshell, s 110 does not appear, in and of itself, to constitute a substantive provision that establishes that the person concerned is dead, even if the prerequisites contained in that provision have been satisfied (and compare, for example,N Prem Ananthi v Tahsildar, CoimbatoreAIR 1989 Mad 248). 18        Notwithstanding the analysis in the preceding paragraph, might it nevertheless be possible for the applicant to argue that s 110 still applies in her favour based on the case law interpreting this particular section? Turning to the case law itself, it is clear that the provision itself only results in a presumption of thefactof death and doesnotestablish the particulartimeat which the death itself occurred. The leading decision embodying this proposition, not surprisingly, hails from India since the Singapore Evidence Act was based on the Indian Evidence Act (and see generally, with respect to the law in this area,Sarkar’s Law of Evidencevol 2 ([13]supra) at pp 1555–1557 and 1559–1561, andSir John Woodroffe & Syed Amir Ali’s Law of Evidencevol 3 ([13]supra) at pp 4272, 4273–4275 and 4280–4285). More specifically, it was a decision of the then highest appellate court in India (and, indeed, of Commonwealth courts generally in the not too distant past, including Singapore) – that of the Judicial Committee of the Privy Council inLal Chand Marwari v Mahant Ramrup GirAIR 1926 PC 9 (“Lal Chand”) (also reported in the English law reports in (1926) TLR 159, which, incidentally, testifies to its importance as a precedent). This particular decision has been followed in subsequent (especially Indian) cases which are too many to list here (see also the Malaysian decision ofR Muthu Thambi v K Janagi[1955] MLJ 47(“Muthu Thambi”)). It should also be noted that the proposition mentioned in the present paragraph also represents English law (see, in particular, the seminal decision ofIn re Phené’s Trusts(1870) LR 5 Ch App 139 as well asHalsbury’s Laws of England([16]supra), vol 17(1) at para 581), which was in fact thesourceof s 110 in the first instance (see, for example,Sarkar’s Law of Evidencevol 2 ([13]supra) at p 1555, as well as the Indian decisions ofShankareppa v ShivarudrappaAIR 1963 Mysore 115 at [8] andLal Chand, at 11 and 160, respectively). 19        Given the specific facts of the present case, might it therefore be argued that s 110 might still apply, in a more general sense, in favour of the applicant? Whilst this is possible, it could equally be argued (consistent with the general reasoning in [18] above) that astrictapplication of the principle set out above to the effect that the particular time at which death occurred has to be proved by actual evidence might itself pose a problem even when s 110 is sought to be invoked in a more general fashion (compare, for example, the Malaysian High Court decision ofRe Osman bin Bachit([13]supra), especially at 449–450). It should also be borne in mind that, if actual evidence were required, the applicant’s father in the instant case had not yet reached “an age so advanced as to exclude the probability of survival” (see “Presumption of Death” (1912) 57 Sol J 3 at 3 (discussing the case ofWilliam Robertson Lidderdale); compare, also,In the Goods of Matthews[1898] P 17). More importantly, however, there isanotherlegal obstacle for the applicant in so far as the attempt to invoke s 110 successfully is concerned, to which I now turn. 20        I now proceed to consider the second (and, arguably at least, more important) point or, rather, difficulty. 21        In order for s 110 to operate in the present case, in addition to satisfying the requirement of seven years, there is asecondelement that must be satisfied (see alsoRe Osman bin Bachit([13]supra) at 448). In the context of the facts of the present case, the applicant’s father must “not [have] been heard of for7 yearsby those who wouldnaturallyhave heard of him if he had been alive” [emphasis added]. 22        The requirement of seven years has been satisfied. However, that is not sufficient. The applicant had also to show that her father had not been heard of for seven years by “those who wouldnaturallyhave heard of him if he had been alive” [emphasis added]. In other words, would her family in general and the applicant as well as her mother in particular be considered persons “who wouldnaturallyhave heard” of the applicant’s father if he had been alive? 23        On one view, they would fall within the category of persons just mentioned by virtue of blood or marital ties. They were, after all, his next-of-kin, notwithstanding what appeared to be an irreparable rent in the fabric of familial relations. However,thiswas precisely why I was of the view that the applicant and her mother couldnotfall within the category of persons mentioned in s 110 of the Evidence Act. In other words, one has to adopt a practical and commonsensical view towards the interpretation of this provision. It is true that there were blood ties. But this was only in the most literal sense possible. This was due to the fact that the applicant’s father was wholly and totally estranged from his family in Singapore. He appeared, in my view, to want to have nothing to do with them. Even when a power of attorney was sent to his eldest daughter, this was merely in response to the divorce proceedings commenced by his wife. As already mentioned in [5] above, this power of attorney did not appear to embody any claim by him over the matrimonial property. It appeared that he simply wanted nothing more to do with the family and that this was his way of cutting off the last ties to his family. Under these circumstances, I do not think that the applicant and her mother (as well as the applicant’s two siblings) could be considered as “those who wouldnaturallyhave heard of” the applicant’s father if he had been alive. On the contrary, they would probably be the last persons whom he would want to contact. This is unfortunate but true. 24        That this particular element or requirement of s 110 is important is also evident from the case law (see, for example,Halsbury’s Laws of England([16]supra) at para 580, as well asperLord Blackburn in the House of Lords decision ofPrudential Assurance Company v Edmonds(1877) 2 App Cas 487 at 509). Indeed, although each case is obviously different simply because the respective fact situations will almost invariably be different, the general approach adopted in the present case – centred on a practical and commonsensical view that does justice to the particular facts at hand – is also evident in the case law (see also generallySir John Woodroffe & Syed Amir Ali’s Law of Evidencevol 3 ([13]supra) at pp 4285–4286). 25        In the Indian decision ofEast Punjab Province v Bachan SinghAIR 1957 Punjab 316, it was held that a person absconding from justice (here, to evade a trial upon a charge of murder) “would … not communicate with any relation in the natural course of events because to do so would reveal his whereabouts and he might be apprehended by the police and prosecuted” (perKhosla J at 317, with whom Falshaw J agreed). 26        In another Indian decision,Surjit Kaur v Jhujhar SinghAIR 1980 P & H 274 (“Surjit Kaur”), it was held,inter alia(at [15]), that a person who has deserted his wife would not naturally have communicated with her (reference may also be made toMuthu Thambi([18]supra)). In yet another Indian decision,Kamtabai v UmabaiAIR 1929 Nagpur 127, it was observed, in a similar vein thus (perMacnair AJC, at 127): [Section 110 of the Evidence Act] has no application as a wife, who left her husband and is in the keeping of another, is not one of the persons who would naturally hear from him if he were alive. 27        Nor, so it was also held inSurjit Kaur(at [15]), would it have been natural for that same person to have communicated with a person where the former was the son of the sister-in-law of the latter; such a relationship was characterised as being “rather remote” (seeibidat [15]). 28        Somewhat closer to home, reference may also be made to the Malaysian High Court decision ofRe Osman bin Bachit([13]supra) at 448 for a succinct account of relevant cases from various jurisdictions. Reference may also be made toMuthu Thambiat 49. 29        In so far as instructive English precedents are concerned, Professor Treitel, in a seminal article, not only stated some relevant general principles but also succinctly covered many of the leading cases in the following observations (see G H Treitel, “The Presumption of Death” (1954) 17 MLR 530 at 531–532 (footnotes omitted, with a few of the relevant decisions cited by the learned author set out in square brackets)): It is impossible to lay down any definite rule as to who are the persons who would have been likely to hear of the propositus. Generally speaking they are his close relations or neighbours [seeDoe d France v Andrews(1850) 15 QB 756; 117 ER 644].But their evidence is not sufficient if there are circumstances other than death to account for the absence and lack of news. Thus a man who is a fugitivefrom justice, from creditors,from his family[see, for example,Watson v England(1844) 14 Sim 28; 60 ER 266 andBowden v Henderson(1854) 2 Sm & G 360; 65 ER 436], or from his fiancée cannot be expected to communicate with the persons who, but for such escape, would have been likely to have heard from him. [emphasis added] 30        In any event, however, it was clear to me that, on the facts of the present case, the applicant had not taken sufficient steps to ascertain whether or not her father was still alive. It is true that, on a literal construction of s 110 itself, it might be argued that that provision does not include this particular requirement. At common law, however, it appears clear that this is indeed a requirement (see, for example,Halsbury’s Laws of England([16]supra), vol 17(1) at para 580, as well asperSir Boyd Merriman P inChipchase v Chipchase[1939] P 391at 394; though compareRe Watkins, Watkins v Watkins[1953] 2 All ER 1112). It appears to me that both logic and commonsense (as well as the common law from which the present provision was in fact derived) suggest that such a requirement ought to be incorporated as part of s 110 itself, and this view appears to have been confirmed in the Malaysian context (see the Malaysian High Court decision ofRe Gun Soon Thin[1997] 2 MLJ 351at 359). Such an approach acknowledges that the operation of s 110 is not one-sided, so to speak. Indeed, an extreme example occurs where it is sought to invoke s 110 where another method for proving the death of a particular individual clearly exists. Such a use of s 110 as a device of convenience may in fact border on abuse and cannot be permitted, as the Singapore High Court decision ofLim Ah Khee v Legal Representative of the Estate of Ong Koh Tee, deceased[1994] 2 SLR 769clearly illustrates. In this particular case, a search at the Registry of Births and Deaths for the relevant death certificate would have sufficed, but the applicant was not prepared to wait for the Registry to go through their records. Not surprisingly, Kan Ting Chiu JC (as he then was) dismissed the application made pursuant to s 110. 31        Turning to the facts of the present case, those who allegedly would “naturally have heard of” (here) the applicant’s father (including, of course, the applicant herself) cannot simply rely upon the applicant’s father to attempt to contact them. If they would “naturally have heard of” him, it would not be inappropriate for them to have taken steps to contact him too. In fairness, they did, as alluded to above, take some steps. The steps taken have already been set out in [10] above. Unfortunately, they were not, in my view, sufficient. Let me elaborate. 32        The first efforts in relation to the present proceedings were made in 1999. This was some 20 years after the applicant’s father had left the family for the US. It was also some five years after the applicant’s elder sister had received the power of attorney from her father. It is not surprising, therefore, that the Notary Public who had notarised the power of attorney could no longer be contacted at the address which was, presumably, gleaned from the power of attorney itself. By parity of reasoning, it is also not surprising that the applicant’s father could also not be contacted at his last-known address. 33        It stands to reason that subsequent letters sent in 2001 and 2004 to thesameaddresses mentioned in the preceding paragraph were doomed to meet the same fate as the letters sent in 1999. 34        The advertisements placed in both the local newspapers as well as the US newspaper entitledUSA Todayin 2001 and 2004, in my view, also constituted insufficient steps. The efforts were, with respect, only token efforts. They were too few and far between, and were akin to casting a line for a small select shoal of fish in a vast ocean. The odds of the applicant’s father having had notice of these advertisements was extremely low, to say the least. 35        Finally, I note the response by the Controller of Immigration (see [10] above). The response by the Controller was, in my view, neutral at best and detrimental at worst. Although it is true that one cannot draw a clear conclusion from this response, it seemed to me that such a response was equally consistent with the applicant’s father still being alive, although it was not within the power of the Controller (at least as he or she viewed it) to disclose such information to the applicant.",
        "Conclusion": "36This was not a situation where an applicant was seeking to prove that a loved one was presumed dead. That usually happens in a situation where a disaster has occurred or where the circumstances are such as to lead the applicant concerned to reasonably suspect that something has gone horribly wrong in so far as his or her loved one is concerned (compare, in this regard, for example,In the Estate of William Lancelot Walker[1909] P 115,Re A Penhas Deceased[1947] MLJ 78andRe Gun Soon Thin([30]supra); reference may also be made toSarkar’s Law of Evidencevol 2 ([13]supra) at p 1562). 37        Whilst I am not unsympathetic towards the applicant’s plight, I was unable to find that s 110 of the Evidence Act operated in her favour on the facts of the present case for the reasons I have set out above. 38        Whilst it is true that the law might not be able to offer the applicant a solution, her situation is not, in my view, wholly without hope. However, it seems to me that any plausible solution would lie in the extra-legal sphere. In particular, the world is now more interconnected than it has ever been at any other time in human history. This applies not simply to physical connection but to remote access as well. The Internet is a powerful instrument. Used wisely, it can be a great aid – in this case, to aid the applicant in locating the whereabouts of her father. Even if he had in fact passed away, confirmation of this fact would also allow the family to have closure after more than two decades. 39        There might also be other possible (and reasonable) ways of attempting to contact the applicant’s father which are not merely stabs in the dark or searching for a needle in a haystack. As I have mentioned, methods of communication and research have improved greatly in the intervening decades. 40        It is hoped that some good might come out of this application even though I could not grant it. It might be that, with greater efforts, the applicant’s father, assuming he is still alive, might somehow be contacted or might be alerted to the search for him. 41        On the other hand, if, unfortunately, it is found that the applicant’s father has indeed passed on, there would nevertheless be closure for the entire family. In that event, the applicant would clearly have the legal right to apply successfully for the release of the funds in her father’s CPF account without even having to resort to s 110 of the Evidence Act or any other statutory provision or rule of common law for that matter.",
        "A coda": "42Not surprisingly, perhaps, s 110 may be in need of legislative reform. This is not surprising, perhaps, in view of the fact that it is embodied in an Act which had its genesis more than a hundred years ago. Equally unsurprising is the fact that other provisions of the Evidence Act may also be in need of legislative reform – for example, the parol evidence rule as embodied within ss 93 and 94 (and see generallyChina Insurance Co (Singapore) Pte Ltd v Liberty Insurance Pte Ltd (formerly known as Liberty Citystate Insurance Pte Ltd)[2005] SGHC 40at [57]–[63], and where to the possible legislative reforms briefly referred to at [62] should be added the reforms proposed by the Indian Law Commission in its latestReport([47]infra)). 43        Let us return, specifically, to the presumption of death in general and s 110 in particular. 44        Very significantly, in my view, the then Vice-Chancellor, Sir L Shadwell, observed as far back as 1844, in the English decision ofWatson v England([29]supra) at 29, thus: The old law relating to the presumption of death is daily becoming more and more untenable. For, owing to the facility which travelling by steam affords, a person may now be transported in a very short space of time from this country to the back woods of America, or to some other remote region where he may be never heard of again. 45        And, in a similar vein, in the 1963 Indian decision ofShankareppa v Shivarudrappa([18]supra), the court observed thus (at [19]): I should like to mention that under the changed circumstances the continuance of [s 110] would be a source of immense troubles. We are in an age of aeroplane and sputniks. Death in unknown places and under unidentifiable circumstances is a matter of every day occurrence. That being so, [s 110] would work to the detriment of the heirs of the deceased. Hence it might be advisable to delete that provision. 46        Indeed, it has been argued that “in contemporary English litigation the presumption of death has little, if any, practical effect” and that “it is difficult to see that the concept serves any purpose at all” (see D Stone, “The Presumption of Death: A Redundant Concept? (1981) 44 MLR 516 at 516; though compare Treitel ([29]supra) at 545, where a couple of safeguards are proposed in situations where it turns out that the presumption of death has been wrongly applied). As we have seen, s 110 was itself premised on the common law (see [18] above). 47        Even more recently, and moving to possiblelegislativereform, it is of no mean significance that in the jurisdiction from which our Evidence Act emerged (India), the Indian Law Commission recently undertook an extremely comprehensive review of its own Evidence Act which stretched to slightly over 1,000 pages in total, and which included (not surprisingly, perhaps) recommendations for reform for the equivalent of s 110 as well as ss 93 and 94 of our Evidence Act (see generally Law Commission of India,185th Report on Review of the Indian Evidence Act, 1872(March 2003), and available online, at the time of writing, at <http://www.lawcommissionofindia.nic.in/reports.htm>). This was not the Indian Law Commission’s first attempt in recent history. An earlier comprehensive attempt in fact took place as far back as 1977 but, unfortunately, had to be “sent back to the Law Commission only on the ground of lapse of time before it was implemented” (see the covering letter in the presentReportby Justice M Jagannadha Rao). 48        In so far as the equivalent of s 110 was concerned, in brief summary, the Indian Law Commission recommended, in its presentReport([47]supra), that the presumption in that particular provision bemodified(see generally at pp 466–480). In particular, it was of the following view (at p 479): We are, therefore, convinced that from the date a person’s whereabouts are not known, as stated in [s 110],a presumption arises about his death at the end of seven yearsand then, as provided in [s 110], after seven years, the burden shifts to the party who wants to prove that he was alive thereafter, to prove that fact. If that burden is not discharged, a presumption of death on the expiry of seven years must follow. It must also be made clear however that if a person wants to contend that a person whose whereabouts are not known had died on any particular date within the seven years, then, of course, as stated inRe Phené’s Trusts[[18]supra] andLalchand’s case[[18]supra], the burden must be on him to prove that fact. [emphasis in original] 49        In the circumstances, the Indian Law Commission recommended (at p 480) the following draft provision in place of the Indian equivalent of s 110 of the Singapore Evidence Act (ss 107 and 108 of the Indian Evidence Act correspond to and in fact arein pari materiawith ss 109 and 110 of the Singapore Evidence Act): Burden of proving that a person is alive who has not been heard of for seven years 108.Notwithstanding anything contained in section 107, where the question is whether a man is alive or dead, or was alive or dead at a particular time, and it is proved that he has not been heard of for seven years or more by those who would naturally have heard of him if he had been alive, the burden of proving that he was alive during any period after the expiry of seven years shall be upon the person who affirms it and if the said burden is not discharged, the Court shall, as respects such period starting from the expiry of seven years, presume that the person was dead. Explanation:-     If any question is raised that the man died on any particular date during the period of seven years aforesaid, the burden of proving that he died on such date during that period, shall be on the person who so affirms, and the presumption referred to in this section has no application. 50        Again, the issue of legislative reform is obviously outside the purview of the courts. What is clear, however, is that the law is ever-changing and proposed reforms in various jurisdictions are ever-increasingly accessible in a world that has become interconnected, in a myriad of ways, more than at any other time in its history. Where, therefore, legislative reforms or proposals in other jurisdictions are germane, they might well be considered and even adopted if to do so would enhance both the efficiency as well as fairness of the existing law in Singapore. Application dismissed."
    }
}