{
    "case_title": "Re Bintan Lagoon Resort Ltd",
    "ncitation": "[2005] SGHC 151",
    "coram": "Andrew Ang J",
    "sections": {
        "The Company, its shareholders and its subsidiary": "5          The Company was incorporated in Singapore on 6 September 1991 as a holding company. Its wholly-owned Indonesian subsidiary, PT Bintan Lagoon Resort Corporation (“PT Bintan Lagoon”) owns and runs the Bintan Lagoon Resort, a holiday resort in Bintan, Indonesia. 6          The Company’s shareholders are: (a)        SAFE Enterprises Pte Ltd (b)        The Kintetsu Group (c)        PT Buana Megawisatama (d)        Seletar Investments Pte Ltd, the assignee of Temasek Holdings Pte Ltd’s rights; and (e)        Straits Steamship Co Ltd (now known as Keppel Land (HK) Ltd). Over the years, the operations of PT Bintan Lagoon have resulted in the Company accumulating substantial debt. As at 31 December 2003, the Company’s total liabilities amounted to $152,795,536. 7          The Company is indebted to one of the petitioners, the Post Office Savings Bank of Singapore (“POSB”) in the sum of $20m under an unsecured medium term loan facility which matured and became repayable on 15 August 2000. The remaining petitioners are together owed a sum of $43,200,000 as bondholders under a bond issue on 22 September 1995. The bond matured on 26 September 2000 but has remained unpaid. Together, the petitioners are owed $63,200,000 which sum constitutes approximately 41.4% of the total debts of the Company and 66% of its unsecured debts. 8          Apart from the petitioners, the Company’s other major creditors were a group of banks (“the Club Lenders”) who had extended the Company a six-year $70m amortising term loan and guarantee facility. The facility was secured by a deed of debenture dated 20 July 1995 conferring a fixed and floating charge over the Company’s assets. When the Company defaulted under the facility, all but one of the shareholders together formed Winners Path to buy out the Club Lenders, thereby acquiring their rights and interests under the deed of debenture,inter alia. This was done on or about 13 August 2001 by payment to the Club Lenders of the amount owing of about $40.16m. 9          At that time the Company was also in defaultvis-à-visthe petitioners. It had, on 7 December 2000, made its first restructuring proposal to the petitioners asking them to hold their hands and not to exercise their strict legal rights as creditors. The petitioners alleged that the buyout was done in bad faith and that after leading the petitioners into believing that it would enter into a restructuring arrangement with them, thereby causing them to hold their hands for more than four years, the principal shareholders of the Company (through Winners Path) eventually appointed a receiver and manager to sell the Bintan Lagoon Resort. The petitioners went into great detail (which for the purposes of my Grounds of Decision it is unnecessary to repeat) how successive proposals were put forward and then taken off the table at the eleventh hour. I should perhaps mention that these allegations of bad faith were stoutly denied. 10        The Company painted a different picture. According to the Company, from February 2001, the Company and its shareholders had come under pressure from the Club Lenders who, through their solicitors, required, amongst other things, the perfection of certain securities over land in Indonesia and the payout of overdue interest. Although the Company engaged the Club Lenders in discussion over restructuring proposals, in the end the Company was unable to meet the conditions set by the Club Lenders. Thereupon, by a letter of demand dated 2 July 2001, the Club Lenders’ solicitors threatened legal action against the Company. Winners Path then bought out the Club Lenders. 11        The Company denied that the buyout was in bad faith and asserted that it did not in any way prejudice the rights of the petitioners. It asserted that the buyout was done under pressure from the Club Lenders and was meant to facilitate the ongoing restructuring negotiations between the Company and its unsecured creditors. The Company also pointed out that after the petitioners were informed of the buyout in September 2001, they continued to negotiate with the Company on the debt restructuring for the next three years. As for the delay, the Company alleged that the petitioners themselves had contributed substantially thereto. 12        Owing to what, presumably, they considered to be egregious circumstances, the petitioners applied for a judicial management order despite (a) a receiver and manager having been appointed by Winners Path; and (b) s 227B(5) mandating that in view of such appointment and the objections of Winners Path, the court should dismiss the petition. It was therefore incumbent upon them to persuade the court that this was an appropriate case in which the court should exercise its power under s 227B(10) to appoint a judicial manager on the basis that the public interest so required. To this end, the petitioners submitted in para 68 of their written submissions as follows: (a)        It is always in the public interest torescue companies that have a decent chance of survival. This will produce better returns for all creditors as a whole. This also benefits the Company’s suppliers, customers and employees. (b)        Although the Petitioners do not dispute Winner’s [sic] Path’s security and their right to appoint [a receiver and manager], the Petitioners submit that the manner in whichWinner’s Pathhas acquired its securityviolates the rules of fair play and good conscience. The Petitioners therefore asks [sic] this court to exercise its discretion to ensure that Winner’s Path is not unfairly advantaged by its acts. (c)        If the [receiver and manager] is allowed to continue in its appointment, once it has sold the Company’s shares in the P.T. Bintan Lagoon, all that remains would just be a shell. At that stage, the Company would, in all probability be wound up. In fact, there is an existing winding up petition brought by John Hancock Life Assurance Company Ltd and Manulife (Singapore) Pte Ltd (Companies Winding Up No. 24/2005/T). The Petitioners submit that there will beeconomic, social and political consequencesof allowing the Company to be wound up. [emphasis in original] 13        It will be observed that the test in s 227B(10) is not merely whether it is in the public interest but whether the court considers that “the public interest so requires”. The opening words of s 227B(10), which provide that “[n]othing in this section shall preclude” the court from making a judicial management order if it considers the public interest so requires, support a more stringent construction. By reason of those opening words, the court has an overriding power to make a judicial management order (if it considers the public interest so requires) notwithstanding that it may not be satisfied that the making of the order would be likely to achieve one or more of the purposes set out in s 227B(1):Re Cosmotron Electronics (Singapore) Pte Ltd[1989] SLR 251.In other words, the court has the power (if it considers the public interest so requires) to make a judicial management order even though the making of such order is unlikely to achieve any of the purposes which, by virtue of s 227B(1), are prerequisites to the making of such order. Such a power therefore should not be lightly exercised even if it may be in the public interest to do so. The court must be of the view that the public interest so requires; it should not only be opportune but also importunate that the power be exercised. Thus, even assuming, as the petitioners’ counsel contended, that it is in the public interest to rescue companies with a decent chance of survival, that alone is not enough. 14        The question whether the public interest so requires may perhaps best be answered by considering the likely consequences of not making a judicial management order. Will a refusal to make such order lead to or allow the dismemberment or collapse of a company whose failure will have a serious economic or social impact? The Pan-Electric type of case comes immediately to mind as a paradigm but I do not suggest that the circumstances need be as dire nor that the consequences of not granting the order should be as grievous. What I can say is that the mere fact that amongst the petitioners is a listed company in Singapore or a statutory body such as the Inland Revenue Authority of Singapore is not enough. If the Company were to fail and the debts owed to such a petitioner had to be written off, it will be of no great moment. 15        Counsel for the petitioners’ pointed to the “august pedigree” of the Company in that “[i]t was conceptualised out of the economic cooperation agreement signed in August 1990 between the governments of the Republic of Singapore and the Republic of Indonesia to promote the development of the Riau province in the Republic of Indonesia”. He then contended that the demise of the Company could be consistent with the vision for a growth triangle with Bintan. Additionally, it was said that the employees of the resort could lose their livelihood if the Company were to be wound up. Thus, it was argued that there would be social, economic and even political repercussions if the Company were to be wound up. 16        Companies do fail sometimes and often with adverse consequences to employees, customers and suppliers. It cannot seriously be suggested that the court should exercise its power under s 227B(10) each time this happens. Besides, in this present case, any buyer of the resort wishing to continue operating it will have to offer employment either to the incumbent or new employees. Arrangements would also need to be made for the continuation of supplies. The impact of the sale therefore should not be exaggerated. 17        Will there be any “political repercussions”? In my view, it is a gross exaggeration to suggest that there will be any. The resort was completed and has been in operation for some years now. The objective of promoting the development of the Riau province has been advanced whatever the fate of the Company may be. Leaving aside the question whether it is appropriate to entertain such considerations, I should state that, in my view, no case was made out to invoke the court’s power under s 227B(10). 18        This leaves me with the remaining contention – that because the manner in which Winners Path acquired its security allegedly violated the rules of fair play and good conscience, the court should act to deny Winners Path its “unfair advantage”. First of all, it is difficult to understand what unfair advantage Winners Path acquired. If it is the right to block the appointment of a judicial manager, this right was acquired when Winners Path paid off the secured creditors. In the event of a sale of the resort, Winners Path will recover from the net proceeds of sale only what it paid the secured creditors and interest thereon, the balance being shared amongst the unsecured creditors. This is hardly an advantage. Moreover, but for the buyout, the secured creditors may well have exercised their rights of enforcement even sooner. 19        The petitioners asserted that by granting indulgence to the Company in the belief that the Company was serious in putting forward a workable proposal, they had foregone a chance of a higher percentage of recovery of the sums owing to them had they enforced their claims earlier. 20        Implicit in this assertion is the allegation that the Company was not serious in the proposals for restructuring and was merely leading the petitioners on. I did not think this was made out. As the Company pointed out, if it did not have any intention to restructure the debts, it would not have made the attempts to negotiate with the petitioners; all those attempts have put the Company in no better position than it was in when it became unable to pay the outstandings owing to the petitioners in August 2000. The parties negotiated in the hope that the outcome would be more advantageous than if the petitioners were to enforce recovery of the outstandings. It was only with the benefit of hindsight that the petitioners asserted that an earlier sale of the property would have been better. 21        In any event, even if the petitioners’ contention was made out, I did not consider that this was a case in which the public interest required the appointment of a judicial manager. In so saying, I did not foreclose the possibility that the court may in certain egregious circumstances consider that the public interest requires the making of a judicial management order so as to redress a grievous wrong. 22        In the result, I held that the petitioners failed to make out a case for the court’s intervention on the basis that the public interest so required. I therefore dismissed the petition with costs."
    }
}