{
    "case_title": "CHS CPO GmbH (in bankruptcy) and Another v Vikas Goel and Others",
    "ncitation": "[2005] SGHC 74",
    "coram": "Andrew Phang Boon Leong JC",
    "sections": {
        "Introduction": "17        Counsel for both the plaintiffs as well as the defendants were agreed on the legal principles applicable to the present case. Indeed, there was – not surprisingly perhaps – a great deal of overlap in the authorities that they helpfully cited to me. The crux of the present appeal relates, therefore, to theapplicationof these principles.",
        "The application for fortification of the plaintiffs’ undertakings to the court": "1The present proceedings stem from the grant of a Mareva injunction as well as an Anton Piller order to the first and second plaintiffs on 30 July 2004. However, they do not concern an attempt to set aside the injunction on its merits as such. The sole issue in these proceedings concerned, rather, an application for an order that the plaintiffs fortify their undertakings to the court with regard to damages payable to the defendants for possible loss that has allegedly resulted, and/or might result, from the grant of the said Mareva injunction and Anton Piller order.[1]Hence, there wasnoneed to determine any factual issues or the merits with regard to themainaction as such. 2          Only the first and third defendants are parties to the present application (they are, respectively, Vikas Goel and Esys Distribution Pte Ltd). 3          When the application came before me, the defendants did not argue that the Mareva injunction and Anton Piller order should be set aside – a point in fact stressed by counsel for the plaintiffs, Mr Xavier. The defendants were content merely to press on with the case for fortification of damages. As will be seen, the amounts involved in the defendants’ claim with respect to fortification were “impressive” by any standard. Not surprisingly, the plaintiffs, in resisting the application, took the view that the claimed amount was contrived and was a patent attempt to put undue pressure on them and, by implication at least, to stymie the claim in the main action by placing an impossible financial burden on them. This is by no means an irrelevant or fanciful consideration, for as Knox J put it in the English High Court decision ofBhimji v Chatwani[1992] BCLC 387at 403: Indeed, in my judgment the very size of that figure [claimed with respect to fortification by the defendants in that case] lends some weight to the view that the claim is being put forward, at least in part, to put pressure on the plaintiffs rather than to provide against a known and ascertained contingent liability upon the defendants.",
        "The heads of claim": "4          In so far as the alleged heads of likely loss were concerned, counsel for the third defendant, Mr Chacko, relied, in the main, on the expert report prepared by Mr Andrew Grimmet (of Deloitte & Touche Financial Advisory Services Pte Ltd) and all references hereafter to figures relating to such alleged loss will (unless stated otherwise) be to that particular report.[2]It must also be borne in mind that this was the only expert report tendered, and by the third defendant at that. The report itself raised many very broad as well as, on occasion, moot points that were not tested by cross-examination. I note, further, that even assuming that the contents of this report were impeccable (which I do not), they were nevertheless still subject to the applicable principles of law. 5In summary, the third defendant argued that the plaintiffs be required to fortify their undertakings by paying the following sums:[3] (a)        $11,841,777, being the estimated direct losses up to the end of November 2004 (and constituted by all the separate heads I consider in more detail below, but for the last, which related to the potential impact of delay in the initial public offering (“IPO”) process with regard to the shares of the third defendant). (b)        $37.1m, being the lower-end estimate of the potential impact of delay in the IPO process as well as the depreciation in the value of the proceeds that the third defendant is likely to obtain in a public listing of its shares on the Singapore Stock Exchange. 6In so far as the first defendant was concerned, as his counsel, Mr Chan, argued, the likely damage suffered as a result of the Mareva injunction and the Anton Piller order was based essentially on the damage suffered by thethird defendant.[4]In particular, it was argued that the loss suffered with regard to the first defendant was threefold, as follows: (a)        The alleged loss suffered with respect to the first defendant’s realisable proceeds through the IPO of the third defendant. (b)        The alleged loss suffered as a result of deprivation of the realisable proceeds through the IPO of the third defendant. (c)        The alleged loss suffered as a result of the fall in value of the first defendant’s shareholding in the third defendant. 7          The alleged quantum of likely loss claimed by the first defendant was, takenin toto, “impressive”.[5]However, for the reasons set out below (see generally at [116]–[120] and especially at [120]), there was no likely loss to the first defendant in the first instance and, hence, consideration of the alleged quantum of likely loss was rendered unnecessary. 8          Although the application by the defendants (or, more specifically, by the third defendant) for fortification of the plaintiffs’ undertakings to the court as to damages was allowed in the sum of $315,646, the third defendant was dissatisfied with the quantum of fortification ordered and has appealed. As I made no order with regard to the application by the first defendant for fortification of the plaintiffs’ undertakings to the court as to damages, he, too, has appealed. I now give my reasons for my decision.",
        "A factual overview": "9          It is important to reiterate at the outset that the merits of themain actionfalloutside the purviewof thepresentproceedings (see also [1] above). 10        Simply put, this action related to a claim by the plaintiffs, both of whom were foreign companies. The first plaintiff is a Swiss company (which was recently declared bankrupt). It is involved in the business of distributing computer components and related products. The first plaintiff is, in turn, wholly owned by the second plaintiff, a company incorporated in Luxembourg. The second plaintiff is a wholly-owned subsidiary of a Dutch company (CHS Logistics Services BV), which is (in turn) wholly owned by a company incorporated in the US, CHC Electronics Inc. 11        The first plaintiff had in fact incorporated a branch office, Distribution Karma (“DK”), in Dubai. The first plaintiff, through DK, later incorporated the fourth defendant in Singapore. DK later became converted into a different type of corporate entity and became known as Karma ME FZE. 12        The third defendant is a major distributor of computer components and related products, whilst the first defendant was the promoter and is the principal shareholder of the third defendant. The first defendant owns virtually all of the shares in the third defendant, whilst the third defendant owns all but one of the shares in the fourth defendant. The second defendant holds one share each in the third and fourth defendants. The first and second defendants are also directors of the third and fourth defendants. 13        Without entering into the precise details (which are in fact unnecessary for the purposes of the present proceedings), the gist of the plaintiffs’ claims centres around the argument that they had been defrauded of their interest and holdings in Karma ME FZE. As already alluded to above, the alleged events (in particular, the alleged elaborate schemes effected by the defendants) upon which the plaintiffs’ claims are based are complex and have yet to be fully ascertained. It suffices for our present purposes to note that the plaintiffs allege that the defendants are liable to account to them for all profits and assets misappropriated and that the defendants are also liable as constructive trustees. Alternatively, the plaintiffs allege that the defendants were guilty of a conspiracy to defraud the plaintiffs of the said profits and assets. 14        Not surprisingly, the defendants totally deny the plaintiffs’ claims and put them to strict proof thereof.",
        "The issues before the court": "15        The task of the court in the present proceedings is, however, placed within a much briefer compass. It is to ascertain whether there is a sufficient risk of loss to the defendantsas a result of the execution of the Mareva injunction and Anton Piller order by the plaintiffsand, if so, how much fortification of damages ought in the circumstances to be ordered. 16        In this regard, it should be reiterated that only the first and third defendants are involved in the present proceedings. More importantly, it should be reiterated that the risk of loss arising with respect to themainaction are, for the reason just stated,notgermane to the resolution of the present proceedings for fortification.",
        "The legal principles applicable": "",
        "Preliminary points": "18        I am here concerned withfortificationof an existing undertaking as to damages by the plaintiffs. Theundertaking itselfis indeed a standard requirement that accompanies the court’s grant of an injunction almost as a matter of course (see, for example, the English Court of Appeal decisions ofGraham v Campbell(1878) 7 Ch D 490;Griffith v Blake(1884) 27 Ch D 474; andCheltenham & Gloucester Building Society v Ricketts[1993] 1 WLR 1545; as well as the House of Lords decision ofF Hoffmann-La Roche & Co AG v Secretary of State for Trade and Industry[1975] AC 295(“theHoffmann-La Rochecase”)). This was not always the case. But that is now legal history. A succinct and illuminating account of the historical development can be found in the judgment of Jessel MR inSmith v Day(1882) 21 Ch D 421 at 424–425 and that of Lord Diplock in theHoffmann-La Rochecase, at 360. The reasons for such undertakings are grounded in both common sense and justice and ensure that where it is necessary, justice is achieved for the defendant/injunctee as well, providing, as it does, a means of compensation for the defendants if loss occurs in relation to (here) the grant of the Mareva injunction and Anton Piller order. 19        The reasons just briefly canvassed above apply,a fortiori, in my view, to the more draconian contexts in which both Mareva injunctions and Anton Piller orders are granted. This was precisely, in fact, the situation before me at the present hearing.",
        "The legal principles": "20        A very appropriate starting point is the recent decision by Mann J in the English High Court decision ofSinclair Investment Holdings SA v Cushnie[2004] EWHC 218(“theSinclair Investment Holdingscase”). I agree, in this regard, with counsel for the third defendant who described this particular case as “perhaps the most helpful authority”. 21        Indeed, as counsel pointed out, there did not appear to be any relevant local authorities on fortification of damages, apart from a brief reference in the Singapore High Court decision ofKian Choon Investments (Pte) Ltd v Societe Generale[1990] SLR 167at 185, [47], where, however, the learned judge, L P Thean J (as he then was), observed that: Unfortunately, on this point [as to fortification of the cross-undertaking as to damages given by the plaintiffs] I received no meaningful proposal from any party as to the amount the plaintiffs should provide to secure their cross-undertaking. And, in the circumstances, Thean J decided, without assistance, what he considered to be a fair and reasonable amount. 22        Returning to theSinclair Investment Holdingscase, Mann J was of the view (at [22]) that “[t]he point of a cross-undertaking in damages is to provide a means of compensation for loss if it occurs in relation to the injunction or undertaking to which it relates” and that “[t]o that extent the court has, if necessary, to form a view as to the kind and degree of loss that may result in deciding whether a cross-undertaking has sufficient value (with or without fortification)” (see also the approach of Roxburgh J in an earlier decision,Baxter v Claydon[1952] WN 376at 377). In forming such a view, the learned judge proceeded to observe (at [24]) that “it is both appropriate and necessary for me to consider the extent to whicha risk of losshas been shown” [emphasis added]. 23        Mann J went on to agree with the argument of counsel for the defendants in that case (who were applying,inter aliaand in substance, for fortification of a cross-undertaking in damages by the plaintiff), as follows (ibid): In many cases the fact that there is a risk of loss will be obvious merely from the general situation, and while it may not be possible to put anything like a precise figure on the loss, the court, will if necessary, do what it can on the evidence before it to reach an appropriate figure. The courts are well accustomed to assessing the appropriate value to be given to things whose valuation is difficult. It [sic] some cases it will be possible to make a more precise or confident assessment than in others. The mere absence of particularised evidence does not mean that there is no evidence of a risk of loss. Mr Briggs [counsel for the defendants] submitted that what he had to show was a risk of loss; any more refined questions of causation and likelihood would be appropriate for the enquiry (if any) should the cross-undertaking be called upon. I agree with that as a general approach.By and large it would be unnecessary and inappropriate for a court to go into a detailed and prolonged assessment of difficult questions on causation on applications for interim relief, not least because it might become entirely academic.[emphasis added] 24        Whilst I agree that the task of the court at this particular stage of the proceedings is not to enter as such into a meticulous analysis of the merits of the case itself, it is equally clear, in my view, that Mann J could not possibly have been referring to the opposite extreme either – which was simply to accept, without more, the applicant’s assertion that there was “a risk of loss” and to grant the application for fortification almost as a matter of course. Indeed, the learned judge acknowledged this himself in theSinclair Investment Holdingscase by observing (at [25]) thus: However, that leaves open the question of the threshold which has to be crossed by [an applicant] in establishing that there is a sufficient risk of loss. If it is not sufficiently apparent there is a sufficient risk of loss, then while that is no reason for not extracting a cross-undertaking, it would be a reason for not requiring fortification.It seems to me to be impossible to specify any formula for or definition of that level of risk. All that can be said is that the court must be satisfied that there is a sufficient level of risk to require fortification in all the circumstances. That will be a question of judgment in every case where it arises (though there will be large numbers in which it will not have to be the subject of any particularly anxious enquiry). [emphasis added] 25        All counsel agreed with me that the test embodied in the above quotation was not particularly helpful in the sphere of actual and practical application (especially when we have regard to the words italicised in the quotation above). They also agreed with me, however, that the court had nevertheless to exercise its discretion in a principled manner. 26        In all fairness, it must be stated that perhaps the difficulty in stating a more precise approach is not only problematic but may even be impossible in view of the inherent nature of the inquiry itself. However, what complicates matters, as already alluded to above, is the fact that the court must make some (for want of a better word) “preliminary assessment” of the case itself in order to ascertain whether, on the given facts, there is “a sufficient risk of loss”. The assessment is necessarily “preliminary” simply because the inquiry itself is a preliminary one. The present application, it will be recalled, is for a fortification of the plaintiffs’ cross-undertaking as to damages. That is the pith and marrow of the application itself – no more, and no less. It isnotan entry into the assessment of themeritsof the case itself. That will be effected by the court hearing the main action itself. 27        In the circumstances, the court is placed in a rather difficult position. There will necessarily be some assessment of the merits of the case, albeit not in the detail required in so far, for example, as the hearing of the main action is concerned. 28        That having been said, this is not a situation that is unique. An analogical process occurs in a somewhat different situation when the court is asked to determine whether an interim injunction ought to be awarded in the circumstances of a particular case, albeit on a balance of convenience. Once again, the court is placed in a similar situation: there will necessarily be some investigation of the merits of the case, whether the court likes it or not. However, the court must be wary of going too far into the merits as such for that is not its task. 29        To their credit, counsel in the present case frankly acknowledged the difficulty. The amount, as well as intensity, of this difficulty was underscored by the fact that whilst (as already mentioned) counsel could agree on the legal principles to be applied, they were (as shall be seen in a moment)vigorously at oddswith each other in so far as theapplicationof those legal principles to the present fact situation was concerned. Indeed, it was only because those legal principles were stated at such a high level of generality that I expect that counsel were able to unanimously agree on them in the first instance. 30        Herein lies the nub of the problem. Legal principles laid down at a high level of generality are most likely to garner a datum level of consensus. However, it is precisely because of the high level of generality that when they come to be applied at the “ground level”, as it were, that the relative lack or absence of practical utility becomes exposed in the cold light of application. As I have just mentioned, the vigorous disagreement between counsel for the plaintiffs as well as counsel for the defendants in the present hearing bears crystalline testimony to the observation I have just made. 31        I should add – and this is, in my view, of no mean significance – that the dangers of “straying”, as it were, into the substantive merits of themainaction were also underscored in the present case by the fact that, at the initial stages of this hearing, counsel for both parties unwittingly began to delve not merely into the substantive issues surrounding the alleged damage likely to be caused by the Mareva injunction and Anton Piller order but also into the substantive issues that layoutsidethose parameters.[6] 32        This emphasises a point I made earlier – which is that both counsel and the court must indeed be alert at all times to the task at hand and (more importantly) avoid any discussion of the substantive merits – in particular, those that are not even related to the interlocutory proceedings themselves. In other words, one must constantly bear in mind the fact that the relevant damage is that which is occasioned by theinjunctionandnotthat which is caused by the litigation as such. Reference may be made, in this regard, to the Ontario decision ofGault v Murray(1891) 21 OR 458 and the New Zealand decision ofNewman Brothers, Limited v Allum, SOS Motors, Limited[1935] NZLR Suppl 17. 33        More recently, Aickin J, in the Australian decision ofAir Express Limited v Ansett Transport Industries (Operations) Proprietary Limited(1981) 146 CLR 249 (“theAir Express Ltdcase”), observed thus (at 268): It is important in all cases, and particularly in the present case, to bear in mind the distinction adverted to in many of the cases … between damages flowing from the injunction and damages flowing from the litigation itself. There may not in every case be any difference between the two but, where there is a difference, it is essential that the damage flowing from the litigation should not be confused with the damage flowing from the interlocutory injunction. This is necessarily required by the form of the undertaking itself. 34        A similar view was expressed by Barwick CJ, Gibbs and Mason JJ in the same decision in the High Court of Australia, where Aickin J’s decision was affirmed: see [33]supraat 310, 312–313 and 324, respectively. 35        And this view finds expression in the local context in the decision of Chan Sek Keong J (as he then was) in the Singapore High Court decision ofSunseekers Pte Ltd v Joshua[1990] SLR 245, which was helpfully cited to me by counsel for the plaintiff and where theAir Express Ltdcase was also considered. 36        However, while it may generally be difficult to articulate a set of formulae of sufficient (that is to say, of practically helpful) particularity, the general thrust of the existing legal principles does give the court at least some guidance as to the general direction and approach that ought to be adopted. 37        It seems to me that one could not, even at this preliminary stage, avoid the need to apply general principles of law to the given facts in order to ascertain whether or not there would be “a sufficient risk of loss” to the (here) defendants (in particular, the third defendant). 38        What does seem clear in this regard is this: where applicants are unable to demonstrate a sufficient risk of loss because even a preliminary application of the relevant principles of law would reveal – without more – that there isno legal basis for liabilityin the first instance, then that is an end to the matter, and fortification will not be ordered. 39        Where, in other words, the applicant cannot persuade even the court at the threshold, as it were, that there is a basis for legal liability even prior to investigation of the factual matrix in question, then it is clear that there isno“sufficient risk of loss”. Where, however, the applicant can demonstrate that there is an at least reasonable basis for legal liability, the task of the court is then to apply the relevant legal principles to the relevant facts. In this regard, the following observation by Knox J inBhimji v Chatwani([3]supraat 403) is apposite: But there is, in my judgment, a significant difference in principle between difficulty in quantification of a loss that one can see is likely to occur on the one hand and the absence of evidence of the likelihood of a significant loss on the other hand. 40        The principles just enunciated are consistent with those set out inBhimji v Chatwani([3]supra) as well as in the English Court of Appeal decision ofNorwest Holst Civil Engineering Ltd v Polysius Ltd,The Times, 23 July 1982 (full transcript available on Lexis). In the latter case, though, the Mareva injunction was in fact discharged by the court, which then held that the question arose as to whether any loss had been suffered by the defendant as a result of the injunction. Indeed, the court proceeded to hold that if there was “any real possibility” of loss having been suffered by the defendant, that would also justify an inquiry by the court (see especiallyperSir John Donaldson MR). 41        Yet again, a similar approach was adopted by Millett J (as he then was) in the English High Court decision ofIn re DPR Futures Ltd[1989] 1 WLR 778(which was also referred to by counsel for the third defendant). In this case, the learned judgerefusedto order anunlimitedcross-undertaking in damages on the part of the joint liquidators, who had obtainedex parteMareva injunctions against the directors and shareholders of the company concerned. The initial cross-undertaking was in fact limited to £200,000. The joint liquidators were also granted orders with regard to the discovery of documents. However, after the joint liquidators issued proceedings against the said directors and shareholders for the recovery of £2.3m which had allegedly been withdrawn by the latter from the company in the form of directors’ emoluments, dividends, loans and payment for one of the directors’ shares, the latter were prepared to give appropriate undertakings only if the joint liquidators’ cross-undertaking was unlimited in amount. The joint liquidators, on the other hand, were prepared to give a cross-undertaking limited to £2m. Millett J, in continuing the Mareva injunctions as well as the orders for discovery in favour of the joint liquidators, held that they should not be required to provide an unlimited cross-undertaking in damages. The learned judge made the following pertinent observations (at 786): The court cannot avoid the need to make an intelligent estimate ofthe likely amount of any losswhich may result from the grant of the injunction. There is nothing unusual in this. It is so in every case where the balance of convenience has to be considered. A plaintiff’s resources are not infinite. But any such estimate can be reviewed from time to time and further fortification required if necessary. If fortification cannot be obtained this will affect the balance of convenience between granting or refusing the injunction. But the court cannot abdicate its responsibility for deciding where the balance of convenience lies. [emphasis added] 42        The above observations by Millett J are consistent with those expressed above in theSinclair Investments Holdingcase ([20]supra) and were in fact referred to in the latter case itself. 43        In addition to the legal principles set out in the cases just considered, there are a few other relevant (and related) legal principles that might be usefully noted. 44        One is the fact that it is a relevant factor if the plaintiff is outside the jurisdiction. In this regard, counsel for the third defendant cited the English High Court decision ofHarman Pictures NV v Osborne[1967] 2 All ER 324. Whilst this was a case dealing with an application for interlocutory relief with regard to an alleged infringement of the plaintiffs’ copyright in a book (specifically, an application for an injunction to restrain alleged infringement of copyright as well as to restrain the defendants from making or producing a film based on the defendants’ screenplay), if a general legal principle could be drawn from it, it would of course apply to the present case (which also concerned applications for injunctions, albeit of a somewhat different cast). I note that in that case, Goff J (as he then was) was of the view, first, that he had to “impose terms for the protection of the defendants” (seeibidat 337). Indeed, this was self-evident and a point “conceded by counsel for the plaintiffs” (ibid). It was at this point that the learned judge made his observations with regard to the fact that the plaintiffs were outside the jurisdiction as follows (ibid): As the plaintiffs are not within the jurisdiction I must require them to give security towards implementing any liability they may incur under their cross-undertaking in damages. It is impossible to quantify that at this stage, but they have offered £10,000, which is the figure I had independently conceived in my own mind. The injunction will therefore be conditional on the plaintiffs giving security in that amount to the satisfaction of the master within twenty-one days or such further time, if any, as the parties may agree or the master direct. Further, the defendants will have liberty to apply to discharge the injunction at any time. 45        It seems to me that the general principle(s) to be drawn from this particular case do not take the matter forward for either of the parties. Indeed, the issue is precisely whether or not the plaintiffs’ undertaking in the present case ought to be fortified and, if so, to what amount. UnlikeHarman Pictures NV v Osborne, there has been no concession by the plaintiffs in the instant case as to the amount that ought to be ordered with respect to fortification. On the contrary, counsel for the plaintiffs were at pains to argue that fortification ought not to be ordered in the first instance. Hence, we are thrown back, as it were, to the principles set out in theSinclair Investment Holdingscase ([20]supra), which have already been considered in some detail above. 46        Perhaps some aid (or clarification, rather) in this regard may be drawn from the English Court of Appeal decision ofTarasov v Nassif(29 June 1994, unreported; transcript available on Lexis), where it was held,inter alia, that the key question was not so much whether the plaintiff was resident within the jurisdiction but, rather, whether there were assets within the jurisdiction that were readily available to satisfy any liability under the cross-undertaking. 47        Counsel for the third defendant also cited the decision of Legoe J in the Supreme Court of South Australia decision ofGolf Lynx v Golf Scene Pty Ltd(1984) 75 FLR 303 at 313 for the (related) proposition to the effect that the undertaking given by (here) the plaintiffs ought not to be illusory. I do not think that this very basic principle can be controverted. However, once again, it does not really take the matter further forward inasmuch as, yet again, whether or not the undertaking is illusory or not depends, in the final analysis, as to whether or not there is a sufficient risk of loss. If, of course, there is such a risk and fortification is consequently required, the undertaking would be illusory if fortification is not ordered – andvice versa. So the court comes back once again to what appears to be the crucial issue in the present case: Was there in fact a sufficient risk of loss with regard to the various heads which the defendants have canvassed? 48        Finally, counsel for the third defendant also referred to the English High Court decision ofStaines v Walsh[2003] EWHC 1486at [35] for the proposition to the effect that the plaintiffs (here) must indicate their wealth or at least have sufficient funds to cover adequately their cross-undertaking in damages – a point which overlaps with one already dealt with above, albeit in the context of plaintiffs situated outside the jurisdiction (see [46] above). Otherwise, fortification of the plaintiffs’ undertaking as to damages would usually be required: see, for example, the Supreme Court of New South Wales decision ofSelect Personnel Pty Ltd v Morgan & Banks Pty Ltd(1988) 12 IPR 167. I did not view this to be a serious issue in the present case inasmuch as counsel for the third defendant himself pointed to the fact that the plaintiffs had allegedly indicated in an earlier (and related) proceeding that if needed, the plaintiffs were “in a position to underpin their undertakings to a substantial extent”.[7]It is perhaps significant that counsel for the plaintiffs, whilst not admitting this particular point, did not vigorously controvert this particular observation either.",
        "The core principles of causation, remoteness of damage and mitigation": "Introduction 49        There was nevertheless an important issue latent within the general principles hitherto considered. However, counsel for all the parties concerned appeared to assume that it was not problematic throughout the hearing. This was perhaps not surprising because, as we shall see in a moment, it raises such fundamental concepts that are all too easily taken for granted. But herein lies a danger that must be assiduously avoided. And it is to take fundamental principles and concepts for granted. Even logically speaking, there is a compelling reason why such principles are considered “fundamental” in the first instance. It is because they are so important and so pervasive a part of the legal landscape that they oughtnotin fact to be taken for granted. Or at least we do so at our peril. What, then, is this issue? 50        It will be recalled that much store was laid by counsel on the recent decision in theSinclair Investment Holdingscase ([20]supra) – and rightly so. However, the principle relating to “a risk of loss” contains within it further principles that cannot be taken for granted. Causation 51        One fundamental principle is really whether or not the loss was and/or will becausedby the grant and implementation of the Mareva injunction and the Anton Piller order (seeSunseekers Pte Ltd v Joshua([35]supra) as well as the English High Court decision ofTharros Shipping Co Ltd v Bias Shipping Ltd[1994] 1 Lloyd’s Rep 577). This is perhaps so fundamental as not to require reiteration. However, there must, at the very least, be an articulation of this important principle. If, in other words, the loss hasnotbeencausedby the Mareva injunction and the Anton Piller order, the risk of loss must surely have been non-existent. This is why I was at pains to emphasise above that the court ought not – indeed, cannot – enter into the substantive merits of the main litigation itself (see [32]–[35] above), in order not to muddy the legal waters surrounding the issue of causation. Remoteness of damage and mitigation 52        Another fundamental principle is whether or not the loss alleged was tooremote. This is a principle of the first importance and, I might suggest, lies at theheartof the principle and concept of “a risk of loss” itself. While the articulation of this principle of remoteness is not without difficulties, these are dissipated once the light of both logic as well as precedent is cast upon them. They nevertheless are there and must be dealt with. Before proceeding to do so, however, it would be appropriate to refer toone otherprinciple which is relatively straightforward and whose application is dependent, in the final analysis, on the particular factual matrix itself. 53        This is the principle ofmitigationof damage. In other words, the plaintiff ought not to unreasonably increase its loss and must, on the contrary, take reasonable steps to reduce it. One can immediately see that the focus is on the standard or concept of reasonableness and that is why I have emphasised that much is dependent on the particular facts at hand. Arguments in favour of the contractual conception of remoteness of damage 54        At this juncture, it is important to examine in a little more detail the principle ofremoteness of damage. In particular, whichbranchof law does the principle itself derive from in the context of proceedings such as the present? 55        It might be appropriate at this juncture to state that both logic as well as precedent point to an application of thecontractualprinciples relating to remoteness. Some elaboration of how this conclusion is arrived at is nevertheless necessary. This is because there must always be alegal basisfor every legal principle considered and applied. 56        An appropriate starting point is the nature of the undertaking itself. The undertaking given by the plaintiff is not, strictly speaking, one that is given to the defendant as such. It is, rather, given tothe court(see, generally, Steven Gee,Commercial Injunctions(Sweet & Maxwell, 5th Ed, 2004) at para 11.001). This principle is now firmly established in the case law. A sampling of decisions in this regard across the decades include the English Court of Appeal decisions ofRe Hailstone(1910) 102 LT 877 andCheltenham & Gloucester Building Society v Ricketts([18]supra). 57        If, therefore, there is no contractual nexus between the plaintiff and the defendant, why then do the general contractual principles apply? In this regard, the following observations by Lord Diplock in theHoffmann-La Rochecase ([18]supra) are apposite, for, as the learned law lord stated (at 361): [I]f the undertaking is enforced the measure of the damages payable under it isnot discretionary. It is assessed on an inquiry into damages at which principles to be applied are fixed and clear. The assessment [of damages] is made uponthe same basis as that upon which damages for breach of contract would be assessedif the undertaking had been a contract between the plaintiff and the defendant that the plaintiff wouldnotprevent the defendant from doing that which he was restrained from doing by the terms of the injunction … [emphasis added] 58        The approach embodied in the above quotation is, I suggest, both reasonable and fair (see also Gee,Commercial Injunctions([56]supra) at para 11.028). In the absence of a clear prior legal basis for the assessment of damages for loss caused (which is understandable in view of the relatively recent vintage of both Mareva injunctions and Anton Piller orders), it is clear that some basis ought to be established for what is essentially a legal liability that obtains, strictly speaking, in neither contract nor tort. However, if one examines both the Mareva injunction as well as the Anton Piller order closely, it is clear that the analogy with contract is a much closer one and, hence, it is submitted, the approach adopted by Lord Diplock in the quotation above is the correct one to adopt. 59        Indeed, this rationale (from contract) would, in my view, obtain more in the context of undertakings in relation to the grant of injunctionsgenerally. In this regard, however, there are at least three mainalternativesavailable (including that pertaining to contract, which I have just endorsed). 60        Firstly, in addition to the rationale from contract, there is that which derives from the tort ofdeceit or fraudulent misrepresentation. Adoption of this last-mentioned rationale would mean that the plaintiff would, under the undertaking in question, be liable for all loss that flowed directly from the tortregardlessof whether or not such loss was foreseeable and would include all consequential loss as well (see the leading House of Lords decision ofSmith New Court Securities Ltd v Citibank NA[1997] AC 254). The reason for such a strict (and even draconian) approach was helpfully elaborated upon by Lord Steyn inSmith New Court Securities Ltd v Citibank NAitself, as follows (ibid, at 279–280): “[f]irst it serves a deterrent purpose in discouraging fraud”; and “[s]econdly, as between the fraudster and the innocent party, moral considerations militate in favour of requiring the fraudster to bear the risk of misfortunes directly caused by his fraud”. Such considerations are not, in my view, an integral part of the circumstances surrounding damage or loss that results from a situation where an injunction is granted by the court and I would therefore reject such a basis without more. 61        Secondly, there is, as already alluded to above, thetortiousconcept of remoteness of damage (which centres on the principle of reasonable foreseeability, the most oft-cited authority being that of the Privy Council decision ofOverseas Tankship (UK) Ltd v Morts Dock & Engineering Co Ltd (The Wagon Mound)[1961] AC 388). Here, we need to return to first principles. The grant of an injunction or (in more specific contexts) Mareva injunctions and/or Anton Piller orders is not, in my view, premised on a tortious basis as such. Hence, the attribution of a tortious concept of remoteness is inappropriate. 62        This leaves us with the third possible rationale – that fromcontract. It is admitted that a direct contractual link does not exist as such. This is due to the fact that the grant of an injunction is not one that is premised on any direct cause of action. It is granted by the court and is, to that extent,sui generis. However, the contractual analogy is theclosestthat we have in so far as the available options are concerned,viz, contract, tort, and deceit. In particular, the fact that thecourtis in overall charge, as it were, of the process is the basis, as we have seen (in [56] above), for the fact that the undertaking in damages is owed to it, and not to the other party. 63        Although, strictly speaking, the damage or loss that is likely to result is suffered not by the court but, rather, by the other party,vizthe defendant,andissues from the grant and implementation of theinjunctionitself, the undertaking to the court is not thereby rendered irrelevant or immaterial. To the extent that it is relevant, it does give the overall process an at leastquasi-contractual flavour. In this regard the following observations by Brett LJ inSmith v Day([8]supra) at 428 are also relevant (and where, it should be noted, the leading decision on contractual remoteness,Hadley v Baxendale(1854) 9 Exch 341; 156 ER 145, is mentioned, and which is considered below at [81]–[85]): Now in the present case there is no undertaking with the opposite party, but only with the Court. There is no contract on which the opposite party could sue, and let us examine the case by analogy to cases where there is a contract with, or an obligation to the other party. If damages are granted at all, I think the Court would never go beyond what would be given if there were an analogous contract with or duty to the opposite party. The rules as to damages are shewn inHadley v. Baxendale. If the injunction had been obtained fraudulently or maliciously, the Court, I think, would act by analogy to the rule in the case of fraudulent or malicious breach of contract, and not confine itself to proximate damages, but give exemplary damages. In the present case there is no ground for alleging fraud or malice. The case then is to be governed by analogy to the ordinary breach of a contract or duty, and in such a case the damages to be allowed are the proximate and natural damages arising from such a breach, unless as inHadley v. Baxendale, notice had been given to the opposite party, of there being some particular contract which would be affected by the breach. [emphasis added] 64        The general reasoning set out in the preceding paragraphs is not without merit – especially since there appears to be no other viable alternative rationale or explanation. However, Brett LJ’s specific observations inSmith v Day, which are set out in the preceding paragraph, suggest that if the injunction had been obtained “fraudulently or maliciously” a different approach might be adopted by the court. Even here, however, the learned judge suggests the award of exemplary damages. Many potential issues arise here which cannot be dealt with in the instant hearing – not least because there was no argument from fraud or malice, at least in so far as the present hearing was concerned. 65        Nevertheless, one wonders whether Brett LJ was referring to the concept of aggravated damages instead of exemplary damages as it is understood today. Indeed, the rather limited circumstances under which exemplary damages will be granted under English (and, presumably, Singapore) law appears to be in a state of transition, even flux (compare, for example, the House of Lords decisions ofRookes v Barnard[1964] AC 1129andCassell & Co Ltd v Broome[1972] AC 1027on the one hand with both the House of Lords decision ofKuddus v Chief Constable of Leicestershire Constabulary[2002] 2 AC 122and the New Zealand Privy Council decision ofA v Bottrill[2003] 1 AC 449on the other; further reference may be made to the English Law Commission’sReport on Aggravated, Exemplary and Restitutionary Damages(Law Com No 247, 1997)). 66        There is the yet further issue as to whether or not exemplary damages could be awarded for cynical breaches ofcontract(see generally, for example, the Canadian Supreme Court decision ofWhiten v Pilot Insurance Company(2002) 209 DLR (4th) 257). All these issues raise important questions of great import but fall outside the purview of the present decision. 67        In addition to the general reasoning proffered thus far, however, it is clear that the great weight ofprecedentis in favour of acontractualrationale. This is clear from the observations of Lord Diplock in theHoffmann-La Rochecase ([57]supra). This approach has even earlier roots in the case law. Lord Diplock himself, for example, referred to the English Court of Appeal decision ofSmith v Day([18]supra), which was (in turn) referred to by the (also) English Court of Appeal decision ofSchlesinger v Bedford(1893) 9 TLR 370. 68        Further, theHoffmann-La Rochecase was itself applied in a number of decisions: see, for example, the English Court of Appeal decision ofFinanciera Avenida v Shiblaq,The Times, 14 January 1991 (full transcript available on Lexis), with both these aforementioned decisions being cited in the English Court of Appeal decision ofCheltenham & Gloucester Building Society([18]supra). Indeed, all three of the decisions just mentioned in the present paragraph were themselves cited in the English High Court decision ofTharros Shipping Co Ltd v Bias Shipping Ltd([51]supra). Reference may also be made to the English High Court decision ofIn the Matter of an Arbitration between Robert Leigh Pemberton and Richard Cooper and Robert Cooper(1913) 107 LT 716 as well as the Ontario Supreme Court decision ofDouglass v Bullen(1913) 12 DLR 652. 69        However, notwithstanding the weight of precedent in favour of the contractual rationale, there has been a handful of cases where different views have been adopted. Perhaps the most important decision in this regard is that of Jacob J in the English High Court decision ofR v The Medicines Control Agency[1999] RPC 705, where (as we shall see) many of the other relevant decisions were cited as well. The learned judge in this case observed (at 713) that “the precedential basis for a rule that the damages can be assessed only on a notional contract damages is slender”. Whilst Potter LJ, delivering the judgment of the English Court of Appeal inYukong Line Ltd v Rendsburg Investments Corporation[2001] 2 Lloyd’s Rep 113 at [36] acknowledged the views of Jacob J, he held that “it [is] not necessary to go into the niceties of that question for the purposes of deciding this appeal”. 70        With respect, this is surprising as Jacob J then proceeded to cite a number of other English cases, two of which are in fact cited in [73] below. 71        The learned judge also cited (at 714) the views of Cussen LJ in the Victorian Supreme Court decision ofVictorian Onion and Potato Growers’ Association v Finnigan[1922] VLR 819at 822, as follows: I think the word “damages” in that undertaking is to be given a very general meaning, and is not necessarily to be given the same meaning as the word “damages” when used in connection with breaches of contracts. “Damages” in this case seems to me to mean real harm, rather than to have any strictly defined meaning. 72        With respect, the view just quoted is rather vague and general. There must surely be a legal basis for the ascertainment of the loss that is likely to result and this must entail, in turn, the adoption by the court of aspecific rationale. The law does not – and cannot – operate in a vacuum devoid of specific guidance. This view is, in my view, confirmed by the opening observations of Aickin J in theAir Express Ltdcase, which are quoted below (at [73]). 73        Jacob J also construed the views of Aickin J in theAir Express Ltdcase ([33]supra) as meaning that the latter “was not prepared to say that the contract measure was immutable” (seeR v The Medicines Control Agency([69]supra) at 714; the decision of Aickin J was in fact affirmed on appeal by the High Court of Australia). Indeed, in theAir Express Ltdcase itself, Aickin J observed (at 266–267) thus: With all the respect properly due to Cussen J.[inVictorian Onion and Potato Growers’ Association v Finnigan],I am unable to derive much assistance from the expression “real harm”[see also [71], above]and I respectfully think that it cannot be adopted as a substitute for what on the authorities has become at least a prima facie guide. In a proceeding of an equitable nature it is generally proper to adopt a view which is just and equitable, or fair and reasonable, in all the circumstances rather than to apply a rigid rule. However the view that the damages should be those which flow directly from the injunction andwhich could have been foreseen when the injunction was granted, is one which will bejust and equitablein the circumstances ofmost casesand certainly in the present case. No doubt the view as expressed in the two decisions of the Court of Appeal [inSmith v Day([18]supra) andSchlesinger v Bedford([67]supra)] does not constitute a rigid rule and circumstances may sometimes require a different approach. However, it will in my opinion be seldom that it will be just or equitable that the unsuccessful plaintiff should bear the burden of damages which were not foreseeable from circumstances known to him at the time. [emphasis added] 74        However, inFinanciera Avenida v Shiblaq([68]supra), the court did not find it necessary to give guidance as to whether or not the High Court of Australia in theAir Express Ltdcase ([33]supra) was indeed departing from the views of Lord Diplock in theHoffmann-La Rochecase ([57]supra). This is not surprising in view of this same court’s endorsement of theHoffmann-La Rochecase itself (see [68] above). On the contrary, Neill LJ, in theCheltenham & Gloucester Building Societycase ([18]supra) appeared (at 1552) to treat the views expressed in theAir Express Ltdcase as being consistent with the proposition to the effect that “the court in exercising its equitable jurisdiction would adopt similar principles to those relevant in a claim for breach of contract”. In my view, this is the correct view of theAir Express Ltdcase, having regard to the precise language used by Aickin J himself (and as quoted at [73] above). The views of Aickin J were in fact endorsed by both Barwick CJ and Stephen J on appeal, whilst Mason J appeared to prefer the rationale from the tort of deceit, with Gibbs J apparently expressing no conclusive views in this regard. 75        I should point out, however, that Chan J inSunseekers Pte Ltd v Joshua([35]supra) did appear (at 251–252, [20]) at first blush to accept Aickin J’s view with respect to what is just and equitable in theAir Express Ltdcase (see above at [73]) as a possible alternative argument. However, the learned judge did then proceed to observe, adopting the very words of Aickin J himself, that “it will be seldom that it will be just or equitable that the unsuccessful plaintiff should bear the burden of damages which were not foreseeable from circumstances known to him at the relevant time” (at 252, [21]). Indeed, Chan J held that the alleged damage suffered by the defendant in that case as a result of the grant of a Mareva injunction failed not only on the ground of the lack of causation but also because the damage was, in any event,too remote(seeibid). 76        Finally, Jacob J, inR v The Medicines Control Agency([69]supra) observed thus (at 714–715): I have much sympathy with the view that the contract basis for assessment is or may be too narrow in some cases. After all, even if the injunctor is no wrongdoer, as compared with the wholly wrongly assailed injunctee, he stands a notch down. It was he who (as it turned out) wrongly assailed the injunctee. He was the “voluntary litigant” … There is a lot to be said for the view that the paying party should pay for all the damage directly caused to the injunctee by the wrongful injunction — that he must take his victim as he finds him. Of course if, once he knows of the injunction, the injunctee does not spell out to the injunctor any special circumstances causing direct but, to the injunctor, unforeseeable damage, he may not be allowed to recover for that damage. Equity would be apt to blame an injunctee who stood by, letting the injunctor build up a liability on the cross-undertaking of which he had no knowledge. I think that in an appropriate case the courts will have to examine the principles more closely. I do not think it is necessary for me to do so here.Whether the recoverable damage is that which is foreseeable by the plaintiff or that which is directly caused by the injunctionisnot in point. None of the differing views expressed in the cases go so far as to say that the injunctee can claim for damagenotsuffered by him. Nor do the very words of the undertaking (which is the foundation of the jurisdiction) suggest that he can recover more than that which he has suffered, whether that damage is foreseeable by the injunctor or not. [emphasis added in bold italics] 77        With great respect, the views expressed in the above quotation from Jacob J’s judgment appear, firstly, to endorse the rationale from the tort of deceit. However, as I have already mentioned, this rationale is not a very satisfactory one (see generally [60] above). 78        Secondly, and more importantly, the learned judge does appear, in the final analysis, to endorse an approach that is, as we shall see, both in substance and effect the same as the test for remoteness under the law ofcontract. This is indeed the test which is, as already argued, endorsed both in principle and logic as well as by the weight of case law authority. 79        Finally, it is clear that Jacob J did not in fact decide, in the final analysis, whether an approach alternative to the contractual one ought to be adopted. This is self-evident from the concluding paragraph quoted above at [76]. Indeed, it was unnecessary for the learned judge to decide on the particular legal approach to be taken since he found, on the facts, that there was no damage suffered by the defendant in the first instance. 80        Having established, therefore, that the general principles ofcontractualremoteness apply, it would be appropriate to set out the precise principles which are applicable in this regard. Contractual principles relating to remoteness of damage 81        It is established law that remoteness of damage under contract law comprises two limbs – first, damage flowing “naturally” from the breach of contract and, secondly, “unusual” damage which (by its very definition) does not flow naturally from the breach of contract but, rather, is due to special circumstances. These two limbs are in fact to be found in the seminal decision of the (English) Court of Exchequer inHadley v Baxendale([63]supra), as helpfully elaborated upon in the English Court of Appeal decision ofVictoria Laundry (Windsor) Ld v Newman Industries Ld[1949] 2 KB 528.Indeed, in the latter decision, Asquith LJ (who delivered the judgment of the court) perceptively and helpfully distinguished betweentwo kindsof knowledge that must be brought home to the defendant in order that the damage might not be considered to be too remote. 82        The first isimputedknowledge. Knowledge is imputed when it is the kind or type of knowledge that everyone, as reasonable people, must be taken to know. Everyone must, as reasonable people, be taken to know of damage which flows “naturally” from a breach of contract. In other words, this category of (imputed) knowledge is linked to thefirstlimb referred to in [81] above. What is of vital legal significance is that in so far as such “natural” or “ordinary” damage is concerned, there isno needfor the plaintiff to proveactualknowledge on the part of the defendant: the defendant (in this particular case, the plaintiffs) must betaken to know(under the concept of imputed knowledge) that such damage wouldordinarilyensue as a result of the breach of contract concerned. 83        The second type of knowledge isactualknowledge. Not surprisingly, this particular category of knowledge relates to thesecondlimb referred to in [81] above. It concerns “special” or “non-natural” damage that results from a breach of contract. A relatively more stringent criterion of knowledge is here required in order that the damage will not be found to be too remote in law. Put simply, the defendant must have hadactualknowledge of the special circumstances which are outside the usual course of things. These circumstances must be such that, in the event of a breach of contract occurring, loss or damage goingbeyondwhat would ordinarily result under the first limb (referred to in [81], above, and which,ex hypothesi, are within the usual course of things) would ensue. In fairness to the defendant, in order for him or her to be fixed with liability for such “special” or “non-natural” damage, he or she must have hadactualknowledge of the aforementioned special circumstances. In order for such actual knowledge to be brought home, as it were, to the defendant, an objective test is utilised. In the words of Robert Goff J (as he then was) in the English High Court decision ofSatef-Huttenes Albertus SpA v Paloma Tercera Shipping Co SA (The Pegase)[1981] 1 Lloyd’s Rep 175 at 183: [T]he test appears to be: have the facts in question come to the defendant’s knowledge in such circumstances thata reasonable person in the shoes of the defendantwould, if he had considered the matter at the time of the making of the contract, have contemplated that, in the event of a breach by him, such facts were to be taken into account when considering his responsibility for loss suffered by the plaintiff as a result of such breach. The answer to that question may vary from case to case … [emphasis added] 84        The following observations by Lai Kew Chai J in the Singapore High Court decision ofTeck Tai Hardware (S) Pte Ltd v Corten Furniture Pte Ltd[1998] 2 SLR 244at [17] might also be usefully noted: The second rule [ie, the second limb inHadley v Baxendale, as to which see [81] above] caters for the situation where the contract breaker knows or ought in certain circumstances to have known more than what every reasonable man is presumed to know. If his contracting party tells him something outside the ordinary course of things before or at the time the contract is made, the second rule would apply. 85        That the abovementioned principles are part of Singapore law can be seen, for example, from a local decision decided as far back as 1880: seeYeo Leng Tow & Co v Rautenberg, Schmidt & Co(1880) 1 Ky 491. There are of course more recent decisions, including the Singapore Court of Appeal decisions ofHong Fok Realty Pte Ltd v Bima Investment Pte Ltd[1993] 1 SLR 73andCity Securities Pte Ltd v Associated Management Services Pte Ltd[1996] 1 SLR 727. 86        English law is the foundation of Singapore law (see, in particular, and in this regard, the Application of English Law Act (Cap 7A, 1994 Rev Ed), especially s 3). It is no surprise, therefore, that the English position with regard to remoteness of damage is well established in the Singapore context. 87        It might be noted in passing at this juncture, however, that there is a New Zealand Court of Appeal decision that actuallyquestionsthe viability ofHadley v Baxendaleitself: seeMcElroy Milne v Commercial Electronics Ltd[1993] 1 NZLR 39(“McElroy Milne”). Nevertheless, the situation in so far as Singapore is concerned is, as we have seen, too well established in so far as the adoption of the rule inHadley v Baxendaleis concerned.In any event,McElroy Milnehas not in fact found favour in New Zealand itself: see, for example, Rex Ahdar, “Remoteness, ‘Ritual Incantation’ and the Future ofHadley v Baxendale: Reflections from New Zealand” (1994) 7 JCL 53 as well as Stephen Todd, “Remedies for breach of contract” in ch 21 of John Burrows, Jeremy Finn & Stephen Todd,Law of Contract in New Zealand – A Successor to Cheshire & Fifoot’s Law of Contract, 8th New Zealand Edition(LexisNexis, 2nd Ed, 2002) at pp 767–768. The very relevant call to legal autochthony (which has its source in the rich scholarship of the late Prof G W Bartholomew) is nevertheless not a call to departure from the received English law merely for its own sake. Indeed, this is one such situation where departure is not, in my view, justified.",
        "A brief summary": "88        I turn, now, to the application of the general legal principles stated – and elaborated upon – above, particularly as they apply to the various alleged heads of likely loss canvassed by (in particular) counsel for the third defendant. 89        However, before proceeding to do so, it would be appropriate and helpful, in my view, to set out, in summary form, the main legal principles applicable (always bearing in mind the fact that this is, nevertheless, no substitute for a detailed knowledge, and analysis, of these principles): (a)        An undertaking as to damages is one given to thecourt, and not to the other party. (b)        Such an undertaking is intended to provide a means of compensation for the defendant for loss if it occurs in relation to (here) the grant and implementation of the Mareva injunction and the Anton Piller order. (c)        Whether or notfortificationof such an undertaking will be granted depends on whether or nota real risk of losscan be shown by the (here, first and third) defendants. (d)        The risk mentioned in the preceding paragraph is governed,inter alia, by thecontractualprinciples relating to causation, remoteness of damage and mitigation. (e)        In the final analysis, the undertaking given by the plaintiff cannot be illusory. More specifically, the court has to ascertain whether there aresufficient assetseither within or outside the jurisdiction that would be readily available to satisfy any liability under the undertaking itself. This explains why fortification of undertakings is usually, albeit not invariably, granted where foreign plaintiffs are involved.",
        "The alleged losses": "",
        "Alleged loss of sales revenue suffered as a result of alleged disruption to the third defendant’s business": "90        Counsel for the third defendant sought to demonstrate that the obtaining of, and execution of, both the Mareva injunction as well as Anton Piller order by the plaintiffs resulted in grave disruption of the third defendant’s business and equally grave (indeed, graver) loss in so far as its sales revenue was concerned. 91        In summary, the alleged loss (in US dollars) is 1.9% (which comprised the gross margin) of the total of the amounts to be found in the right-most column of the following table reproduced in Mr Andrew Grimmett’s report[8](under the heading of “Net Loss”).  DateActual Turnover (USD)Average per day (USD)Net Loss(USD)03-Aug-042,568,9975,700,9673,131,97004-Aug-042,695,8515,700,9673,005,11605-Aug-046,442,7805,700,967(741,813)06-Aug-044,326,7615,700,9671,374,20607-Aug-04125,828787,557661,72909-Aug-041,973,5331,746,825(226,708)10-Aug-045,526,9245,700,967174,04311-Aug-044,435,8395,700,9671,265,12812-Aug-045,791,5245,700,967(90,557)13-Aug-045,031,4805,700,967669,487TOTAL9,222,601 92        The alleged loss is therefore US$175,229 (ie, 1.9% of US$9,222,601) or S$297,890. 93        If one examines the figures pertaining to net loss in the above table closely, it will be seen immediately that there was a significant loss on 3 August 2004 and 4 August 2004. However, on the day immediately following (ie, 5 August 2004), there was not only no loss but (on the contrary) an actual gain of US$741,813. The figures for the remainder of the period (from 6 August 2004 to 13 August 2004) demonstrate no real pattern as such (with actual profits manifesting themselves, in fact, on two of the days,viz, 9 August 2004 and 12 August 2004). 94        It is clear, in my view, taking the most generous interpretation I can reasonably adopt with regard to the third defendant’s alleged losses, that any disruption caused by the plaintiffs’ taking out – and execution – of the injunctions concerned could (at best) have had an adverse causative impact on the third defendant’s business on 3 August 2004 and 4 August 2004 only. I bear in mind, in this regard, that it was significant that both the Mareva injunction as well as the Anton Piller order were executed between 2 August 2004 and 4 August 2004. This coincidence in timeframe appears to me to be – at least arguably – more than a mere coincidence and one that supports the third defendant’s claim for fortification under this particular alleged head of loss during this period. If so, then, the likely loss suffered by the third defendant is 1.9% of US$6,137,086 (or S$198,216). 95        Counsel for the plaintiff did, however, argue persuasively that the execution of the Mareva injunction and Anton Piller order could not reasonably have disrupted the third defendant’s business to such a massive extent. He also pointed to the netprofitearned on,inter alia, 5 August 2004, the day after the execution of both injunctions. I have in fact already taken this last-mentioned fact into account. However, it must be borne in mind that the onus on the third defendant is not to prove its loss as such but only to demonstrate that such loss was likely to take place in accordance with the various legal criteria set out earlier in this judgment. Given the relatively low threshold of proof, I was therefore satisfied that there was likely loss to the third defendant under this head of loss totalling S$198,216.",
        "Alleged losses with regard to manpower costs as well as losses arising from stationery and photocopying": "96The alleged losses with regard to manpower costs as well as losses arising from stationery and photocopying relate to a couple of relatively minor matters. By “minor” I refer to the amounts claimed since they pale by comparison to the other amounts that the defendants have claimed as likely losses in this application. It should be noted that both these heads of alleged likely loss are to be found in the affidavit of Ms Emily Chay Suet Meng, who is the Chief Financial Officer of the third defendant.[9] 97        The first relates to the alleged losses suffered with regard to manpower costs. This was calculated on the basis of the writing-off, in effect, of the salaries of the third defendant’s officers who were directly involved in helping to supervise the execution of the Anton Piller order by the plaintiffs at the third defendant’s premises. This amounted to $6,400.[10]I am prepared to find that these officers were in fact “tied up” during the time the Anton Piller order was executed and would include it as a likely loss suffered by the third defendant. 98        The second sub-head of damage relates to the alleged stationery and photocopying costs incurred during the plaintiffs’ execution of the Anton Piller order at the third defendant’s premises. This came to a total of $1,030[11]and I am prepared to hold that this would also be a likely loss that was suffered by the third defendant.",
        "Alleged loss suffered under an existing contract with a Mexican company": "99        In its claim (with respect to an alleged likely loss of $4,622,470 suffered under an existing contract with a Mexican company), counsel for the third defendant did not raise anyexpressarguments with regard to remoteness of damage. It can, hardly though, be argued that these principles do not apply – especially since counsel for the third defendant relied so heavily on the principle of “a risk of loss” which, as we have seen,necessarilyembodies thecontractualprinciple of remoteness of damage. 100      The general principles relating to remoteness of damage have already been set out above (see generally [81]–[87]). In a nutshell, the established principles first set out inHadley v Baxendaleapply. 101      Turning, then, to the specific facts that constitute the basis of the third defendant’s allegation of loss under the present head, it was clear that the alleged loss related to a contract with a foreign (here, Mexican) company which the plaintiffs did not (or at least were not shown to have) special knowledge of. 102      It is also clear that the alleged loss that was likely to be suffered under the contract with the Mexican company was not an “ordinary” or “natural” but was, rather, “unusual” or “special”. Hence,actualknowledge on the part of the plaintiffs would be required (see also Gee,Commercial Injunctions([56]supra) at p 311 as well as [83]–[84] above). This was clearly absent on the facts of the present case and, not surprisingly, was not argued by counsel for the defendants. It was therefore clear to me that the alleged loss suffered under the present head was too remote and, hence, not recoverable.",
        "Alleged loss suffered as a result of the alleged adverse impact on the third defendant’s working capital": "103The alleged loss suffered as a result of the alleged adverse impact on the third defendant’s working capital in the sum of $11m and its consequent inability to take advantage of cash discounts offered by its major suppliers related to the fact that the third defendant would be entitled to a cash discount of 1% if it made payment within 15 days. Counsel for the third defendant argued, in this regard, that the need to set aside $11m as stakeholders’ moneys in order to obtain suspension of the Mareva injunction has deprived the third defendant of a substantial amount which it could otherwise have utilised in order to enjoy the said cash discount offered by its suppliers. 104      The amount of loss alleged was not insubstantial. The calculation in this regard was premised on two cycles per month (with, presumably, 15 days comprising one cycle). On the basis of a 1% cash discount obtainable for two cycles a month, this worked out to $220,000. On some months, counsel for the third defendant argued that his client had in fact lost 2% for a particular cycle. From August 2004 to November 2004 alone, the amount of likely loss alleged totalled $900,000, according to Mr Andrew Grimmett’s report.[12] 105      Counsel for the third defendant in fact went further. Relying on Mr Andrew Grimmett’s report,[13]he argued that the third defendant had also missed the opportunity to garner an additional $44m in sales up to September 2004 and a further $44m in sales in October and November 2004. At a gross margin of 1.9% (already noted previously), this came to an alleged total loss of $1,672,000. 106      This was not all. Counsel for the third defendant, referring to Mr Andrew Grimmett’s report,[14]further argued that until the amount of $11m was in fact returned to the third defendant, it would continue to lose gross margins of $22m in lost sales per month. 107      This is a classic instance of where one can miss the proverbial wood for the trees if one is not careful about starting-points. In other words, if one commences – no matter how well intentioned one might be – on the wrong road, then all the effort spent travelling on that wrong route, which would otherwise have been immensely praiseworthy, would (unfortunately) be in vain. More specifically, and turning to the facts of the present case, where it is necessary to delve into figures and statistics generally, the court will of course do so. However, such details come into play only when they are triggered, as it were, by applicable legal principle(s). To plunge straight into the various figures and statistics without more would be an exercise in futility if there had been no likelihood of loss in law in the first instance. The ascertainment of the legal foundations must necessarily be the first step. 108      Looking in the first instance at the legal basis for the claim levelled here by counsel for the third defendant, one had necessarily – as correctly pointed out by counsel for the plaintiffs – to return to the terms of the Mareva injunction itself. After all, it was precisely because (so the third defendant’s argument went) the Mareva injunction had “tied up” $11m that the losses under the present head had resulted. 109      Counsel for the plaintiffs pertinently pointed to a crucial term in the Mareva injunction itself – specifically, toException 2which provides that the defendants may deal with or dispose of their assets “in the ordinary and proper course of business”.[15]This Exception reflects the observation by Millett J inIn re DPR Futures Ltd([41]supra), where the learned judge observed (at 786) that “[i]t is important to remember that it is not the purpose of aMarevainjunction to prevent a defendant from carrying on business or living his life normally pending the determination of the proceedings” and the learned judge in fact added words which were similar in spirit to those contained in Exception 2. 110      Counsel for the plaintiffs further argued that if there had been any doubt on the part of the defendants, they could have sought legal advice or made an urgent application to the court. Given the fact that the third defendant was more than amply represented from a legal perspective as well as what I must consider to be its considerable commercial acumen and (above all) will, I have no doubts that it had – or ought, as reasonable commercial persons, to have had – not only cognisance of Exception 2 but also ought to have fully understood its meaning and content as well. As I note towards the end of my judgment, the defendants did not attempt to get the Mareva injunction set aside either. Nor, more specifically, was this particular argument by counsel for the plaintiffs really met in any substantive way by counsel for the defendants. 111      In the circumstances, I find that the third defendant has not demonstrated that the “tying up” of the $11m actually caused the loss presently alleged to have been suffered under the present head. Indeed, it is precisely because it did not avail itself of the standard exception to the Mareva injunction that the alleged damage was caused. Even if the third defendant is able to succeed on the issue of causation (and this is extremely doubtful, as I have just indicated), it is clear that by merely sitting on its hands, as it were, it has clearly not only not mitigated its loss but has actually (and unreasonably, in my view) exacerbated it. There is no doubt, as a matter of law, that the principle of mitigation of damage is clearly applicable in situations of this nature (see [53] above as well as Gee,Commercial Injunctions([56]supra) at p 310). The principle of mitigation, as already mentioned, is primarily one centring on the concept of reasonableness as viewed in the context of the specific facts and the finding any reasonable person would take would be as I have just stated. 112      However, I did, after careful consideration, determine that, in so far asone cyclein the very initial periodwas concerned, the third defendant would – owing to insufficiency in time – have been unable to avail itself of Exception 2 above. I have in mind, in particular, the fact that the Mareva injunction and the Anton Piller order were executed between 2 August 2004 and 4 August 2004. I am therefore prepared to find that there was likely loss during the very first cycle during the very first period (amounting to $110,000). 113      In the circumstances, the third defendant clearly failed with respect to the application for fortification under the present head of alleged loss, except with respect to one cycle for which I find that there was a likely loss of $110,000.",
        "Alleged loss suffered as a result of an alleged adverse impact on the third defendant’s quarterly rebates": "114      Another alleged head of likely loss related to quarterly rebates given to the third defendant by its major vendors, provided that stipulated targets are achieved. To this end, the third defendant claims that it has lost a total of $4,882,668. 115      Consistently with my views and holding expressed above with regard to the alleged loss centring on the likely loss of sales, I find that the third defendant has not satisfactorily proved that loss under this particular head was indeedcausedby the execution of the Mareva injunction and the Anton Piller order by the plaintiffs. Indeed, the absence of causal nexus seems to me to be even more marked in this particular regard.",
        "Alleged loss resulting from an inability by the third defendant to obtain a listing on the Singapore Stock Exchange": "116      The amount claimed by the third defendant under the head of alleged loss resulting from its inability to obtain a listing on the Singapore Stock Exchange was, in a word, astronomical (of between $30m and $42m), and entailed a complex series of calculations (detailed in Mr Andrew Grimmett’s report[16]). As already mentioned, the third defendant was prepared to adopt a lower estimate of $37.1m. This remained, nevertheless, an enormous sum. It did not appear logical that the actions of the plaintiffs in taking out both the Mareva injunction as well as Anton Piller order could have resulted in such a massive loss. Still, fact is often stranger than fiction and anything is possible. For present purposes, of course, the question for determination was whether it was probable as a likely loss that wascausedby the plaintiffs’ actions. Herein (in the application of the basic concept of causation), I found logic and the lawad idem. 117      It should also be noted that this particular head was in fact the only one that involved the first defendant as he (the first defendant) had agreed to take 75% of the shares to be listed and had intended to float 5% upfront so as to obtain funds in hand immediately. Counsel for the first defendant did concede that the likely loss was difficult to ascertain, although the amounts he mentioned were also very large. Once again, such loss was premised on whether this alleged loss was a likely loss that wascausedby the plaintiffs’ actions. 118      The Anton Piller order was executed within, as we have seen, a very brief compass of physical time. Whilst it must, as I have ruled, have resulted in some disruption and possible loss to the third defendant, I could not locate a causal connection or nexus between the execution of that order and the loss now claimed under the present head. If at all, any chance of success under this particular head by the third defendant must necessarily lie in arguments centring around the effect of the Mareva injunction – to which issue I now turn. 119      The respective events and timeframe leading to the application for, execution of, as well as ultimate suspension of the Mareva injunction have already been set out earlier in my judgment. It remains now to ascertain what effect it might have had with respect to the loss under the present head. In this regard, I agree with counsel for the plaintiffs who argued that the defendants’ argument was misconceived as they (the defendants) had identified thewrong causefor the loss claimed under the present head. In particular, counsel for the plaintiffs argued that it was neither the Mareva injunction nor the Anton Piller order that had resulted in an inability on the part of the third defendant to bring to fruition its listing on the Singapore Stock Exchange. Indeed, it was acknowledged by counsel for the third defendant that so long as litigation was in process, it would be impossible to obtain a listing. I agree with counsel for the plaintiffs that the Mareva injunction as well as the Anton Piller order were merely part of the ongoing litigation and could in no way havecausedthe loss claimed under the present head. I therefore reject the claim for fortification under this alleged head of loss in so far as both the first and third defendants are concerned. Indeed, it is imperative to reiterate that a distinction must be drawn between loss caused by the Mareva injunction and Anton Piller order on the one hand and that caused by the main litigation on the other – a distinction that has in fact already been set out and emphasised above (see [32]–[35]). 120      The rejection of the third defendant’s claim under this particular head has profound implications in so far as the first defendant’s claim is concerned. This is because the success of the latter’s claim is dependent on the success of the former’s. This was clearly admitted by counsel for the first defendant right at the outset of the present hearing (see [6] above). In the circumstances, therefore, the first defendant’s claim must necessarily fail.",
        "Conclusion": "121      I found it somewhat odd that, although there were references to some arguments,[17]no real attempt as such was made by the defendants, in conjunction with thepresentarguments for fortification, to discharge the injunction on its merits. It was clear, however, that if the plaintiffs could not meet the amount for fortification that I had ordered, the injunction would have to be discharged (compare, for example,MacDonald v Pottersfield Limited (No 2)[2002] EWHC 1778); this was in fact an order sought by this application,[18]and I indeed made an order to that effect. 122      Since there is at least some indication that the defendants were not disputing the merits of the injunction (at least up to the point of time concerning the present hearing) but were, rather, concerned about the possible damage it might suffer as a result therefrom (and, hence, the present application), I was especially mindful that any fortification ordered had to be thoroughly justified, in order to ensure that the plaintiffs were not unjustifiably deprived of their rights. Although it would perhaps be going a little too far to argue, as counsel for the plaintiffs did, that the entire purpose of the present applications was to bring undue pressure to bear on the plaintiffs, this was not (potentially at least, and especially in the context of the total amount of fortification asked for by the defendants in the present case) a wholly spurious argument and, hence, I was anxious to ensure that there was thorough justification for any fortification ordered. I bear in mind, in particular, the fact that the amount of fortification requested by the defendants was so astronomical that, if it were not so justified, it might arguably be even more draconian than an unlimited undertaking, given the fact that the amount of the undertaking sought here, if granted, would crystallise immediately. 123      The right to fortification is, after all, intended to do justice to the applicant without resulting in the hanging of an albatross around the neck of the other party. It is imperative that procedural and substantive justice be integrated – a point of general and, indeed, pivotal importance, and which I have elaborated upon in another decision: seeUnited Overseas Bank Ltd v Ng Huat Foundations Pte Ltd[2005] SGHC 50at [4]–[9]. 124      After reviewing all the items canvassed by counsel for the third defendant, I came to the conclusion (as elaborated upon in more detail above) that there was a likelihood of damage, albeit not of the magnitude claimed by the third defendant and for the reasons I have stated above. As already explained above, none of these items impacted the first defendant in any way; in other words, there was no likelihood of any damage resulting in so far as the first defendant was concerned. 125      In the premises, I granted the third defendant’s application for fortification in the total amount of S$315,646, comprising the following heads of likely loss: Heads of alleged likely loss                                          Amount (S$) Loss of sales revenue                                                               198,216 Loss resulting from manpower costs                                             6,400 Loss related to stationery and photocopying costs                        1,030 Loss of cash discounts110,000 Total315,646 126      For the reasons I have already given, the total amount was allocated to the third defendant only, with costs. Application allowed in part. [1]See generally para 1 of the Third Defendant’s Submissions dated 13 January 2005.[2]This expert report is contained in Exhibit “AG-1” of Mr Andrew Grimmett’s affidavit dated 5 January 2005 in the Third Defendant’s Bundle of Affidavits — Volume 6. The report itself is dated 3 January 2005.[3]And see para 48 of the Third Defendant’s Submissions dated 13 January 2005.[4]See the First Defendant’s Skeletal Submissions at p 3.[5]See the First Defendant’s Skeletal Submissions at pp 5-7 read together with Mr Andrew Grimmett’s expert report contained in Exhibit “AG-1” of his affidavit dated 11 January 2005 as well as with his first report, above, note 2 at para 109.[6]See also, for example, paras 8-12 of the Third Defendant’s Submissions dated 13 January 2005.[7]See para 32 of the Third Defendant’s Submissions dated 13 January 2005, referring to the relevant Notes of Argument annexed to the said Submissions as Appendix B.[8]At para 27 of Mr Andrew Grimmett’s report.[9]See her affidavit dated 19 August 2004 in the 3rdDefendant’s Bundle of Affidavits — Vol 2.[10]Seeibidat para 23.[11]Seeibidat para 24.[12]See para 58 of Mr Andrew Grimmett’s report.[13]At para 60.[14]At para 61.[15]See the Third Defendant’s Bundle of Pleadings, Vol 1, Tab 14 at pp 12-13.[16]Atparas 75 to 113.[17]Principally from material non-disclosure: see paras 13-31 of the Third Defendant’s Submissions dated 13 January 2005.[18]See para 1(iii) of the Third Defendant’s Submissions dated 13 January 2005."
    }
}