{
    "case_title": "United Overseas Bank Ltd v Bebe bte Mohammad",
    "ncitation": "[2005] SGHC 113",
    "coram": "Lai Kew Chai J",
    "sections": {
        "Basic facts": "8          The basic facts which are not disputed are as follows. I will later set out the evidence relating to the issues of fact. The defendant has been the registered owner of the property since 16 March 1967. The title to the defendant’s property was comprised in Certificate of Title Vol 495 Folio 160 (“the Original CT”). 9          The defendant is about 90 years old. She has two adopted daughters, namely Suzanah and Hajjah Aisah bte Haji, alias Mimi Haji (“Hajjah”). 10        In early 2000, the Original CT was found missing. Hajjah then engaged, on behalf of the defendant, solicitors to act for the defendant to apply for and obtain a replacement certificate of title. This was done by way of an application for replacement certificate of title No I/188861N which was lodged with the Registry of Titles (“the Registry”) on 30 May 2000. 11        Pursuant to the said application for replacement of the certificate of title, the replacement certificate of title (“the Replacement CT”) was issued on 6 July 2000. It should be noted that the word “REPLACEMENT” is stated clearly on the front page of the document at the top right hand side of the page and it is also described as “Edition 1”. 12        On the evidence, it is not disputed that the Replacement CT has at all material times been in the possession of Hajjah and continues to be in her possession up to the trial of this action. 13        Section 43(5) of the LTA requires the Registrar of Titles to enter in the relevant folio of the land-register a notification of the issue of the replacement certificate of title and that notification operates to cancel the lost original certificate of title “for all purposes notwithstanding the fact that the certificate may subsequently be recovered”. 14        By a letter dated 29 September 2000, the plaintiff offered JSN Enterprises credit facilities of $1,000,000.00 upon the security of a legal mortgage of the property of the defendant. It will be recalled that Suzanah and Junaidi were the partners of JSN Enterprises. They played no part in these proceedings and I am told that they are untraceable. 15        The plaintiff appointed M/s Mohan Das Naidu & Partners as its solicitors in the mortgage of the property of the defendant. Mr Mohan Das Naidu (“Mr Naidu”) was the solicitor in charge of the matter. 16        M/s Junaini and Jailani (“M/s Junaini”) acted for the borrowers and, on the face of it, they also acted for the defendant as the mortgagor of the property. Mr Junaini bin Manin was the solicitor in charge. At the time he gave evidence, he was serving sentence for another offence which had nothing to do with this case. 17        It is not disputed that prior to the execution of the Mortgage, Mohan Das Naidu & Partners conducted the relevant searches in respect of the property. The solicitors through themselves or their conveyancing clerk knew that a replacement certificate of title was issued in respect of the property. In their usual report to their clients, Mr Naidu informed the plaintiff in writing that a replacement certificate of title was issued, but he did not enclose a copy thereof as should have been the usual practice. The simple reason was that they had not received the Replacement CT from M/s Junaini, which would have been in the usual course of events. Instead, Mr Naidu received the original duplicate certificate of title from one Mr Rajan Pillay, the agents of Suzanah and Junaidi. 18        In fact, Mohan Das Naidu & Partners had written to M/s Junaini on 24 October 2000 seeking their confirmation that Mr Rajan Pillay was acting with the authority of the latter’s clients when he, Mr Rajan Pillay, handed over to Mr Naidu “the original Duplicate Certificate of Title Volume 495 Folio 160”. No confirmation was elicited from M/s Junaini and the matter was not pursued further by Mr Naidu. 19        If Mr Naidu had required the production of the Replacement CT, as he should have done, the fraud would have been exposed. 20        The Mortgage was executed by Suzanah and Junaidi, as partners of JSN Enterprises, as borrowers and, on the face of it, it was executed by the defendant as the mortgagor on 19 October 2000. Mr Junaini as solicitor signed the usual solicitor’s certificate, to the effect that the defendant understood the terms of the Mortgage and the extent of the defendant’s liability. I will evaluate his evidence later in this judgment. 21        The Mortgage was registered at the Registry. 22        Section 42(1) of the LTA stipulates that a certificate of title must be produced for the purposes of effecting registration of any instrument.",
        "Findings of facts": "23        I now turn to the questions of fact and set out my findings based on the evidence adduced. 24        The first question of fact to determine is whether Mr Naidu had used the Original CT to register the Mortgage. On the evidence, I find that he had. The Replacement CT, since its issue, has at all material times up to the hearing before me been in the exclusive possession of Hajjah, whose evidence on this I have no hesitation in accepting. The Replacement CT has been verified as authentic, on the evidence of the Singapore Land Authority (“SLA”) and SNP Security Printing Pte Ltd (“SNP”). They confirmed that the paper on which the Replacement CT is printed bears the SNP watermark and the security design used on the Replacement CT was created by SNP for SLA. In the case of the title to the property, the SLA confirmed that only one application was made for the Replacement CT. Mr Naidu himself wrote a letter dated 24 October 2000 to M/s Juanini informing them that one Mr Rajan Pillay had handed to him “the original Duplicate Certificate of Title Volume 495 Folio 160”. The SLA officer was unable to say if the original duplicate certificate of title, the Replacement CT or a good forgery of the Replacement CT was used. They had no record which certificate of title was presented. As I am convinced that the Replacement CT was at all material times in the exclusive possession of Hajjah; in my judgment, Mr Naidu must have used the original duplicate certificate of title to register the Mortgage. 25        Now, s 42(1) of the LTA provides that a certificate of title must be produced for the purposes of registration of the Mortgage. Section 43(5) of the LTA provides that notification by the Registrar of Titles of the issue of a replacement certificate of title shall operate to cancel the lost original certificate of title “for all purposes notwithstanding the fact the certificate may subsequently be recovered”. Under r 24 of the Land Titles Rules (Cap 157, R 1, 1999 Rev Ed), Mr Naidu was required to surrender the original duplicate certificate of title to the SLA as possession of it was a criminal offence. Instead he kept it for 11 days and used it unlawfully to register the Mortgage. 26        The next question is whether the apparent paramountcy of the estate of the Mortgage under s 46(1) of the LTA is defeated by the legal disability exception. The question requires a reference to s 46(2) of the LTA, the relevant parts of which read as follows: Nothing in this section shall be held to prejudice the rights and remedies of any person — … (d)        to recover from a proprietor land acquired by him from a person under a legal disability which was known to the proprietor at the time of dealing; … 27        The defendant therefore has to prove that she was of unsound mind at the time of the execution of the Mortgage and that the plaintiff knew her to be of unsound mind at that time. 28        I accept the evidence of Dr Ong Pui Sim, a qualified psychiatrist. She opined that the defendant “would have impaired mental competence in dealing with complex problems even in 2000”. She further observed as follows: Moderate memory loss, especially for recent events, as can be seen in the earliest stages of dementia, would greatly impair her ability to receive, retain and process information provided in a lengthy mortgage deed. This memory deficit, coupled with problems in judgment and problem solving skills, could further impair her ability to understand and manipulate information rationally. Hence my conclusion, in the form of my opinion, is that Madam Bebe would be of unsound mind when she executed the mortgage in the year 2000”. Dr Ong in her first examination of the defendant had diagnosed her as being in the moderately severe stage of disease,ie, Stage 6. As can be seen from table 12.1 in exhibit D1, an extract from Barry Reisberg, “Memory Dysfunction and Dementia: Diagnostic Considerations” inClinical Geriatric Psychopharmacology(C Salzman ed) (Williams & Wilkins, 2nd Ed, 1992), Stage 6 of the disease can last for 29 months. This would mean that the defendant would have been in the moderately severe stage of the disease in October 2000 when the Mortgage was executed. The plaintiff’s expert, Dr Ang Yong Guan, conceded that a person suffering from moderately severe Alzheimer’s Disease could be of unsound mind. There were various pieces of evidence which more or less contradicted Dr Ong’s opinion but I do not think that they displaced it, when they are cumulatively considered. 29        However, on the evidence, the plaintiff had no knowledge that the defendant was of unsound mind at the time of the signing of the Mortgage. This was an agreed fact set out in para 6 of the Agreed Statement of Facts. 30        Accordingly, this exception does not assist the defendant. 31        The central contention advanced on behalf of the defendant is that she is entitled to defeat the plaintiff’s registered title pursuant to s 46(2) of the LTA on the ground of Mr Naidu’s fraud. 32        Counsel for the defendant submitted that it was not necessary for the defendant to prove actual fraud,ie, dishonesty of some sort on the part of Mr Naidu. Fraud in this context is not limited to cases of actual and certain knowledge. What the defendant needs to prove is that Mr Naidu knew enough to make his duty as an honest man to hold his hand, and either make further inquiries before proceeding with the mortgage and registration of it or abstain from proceeding with the mortgage until the issue of the Replacement CT was resolved. 33        InWaimiha Sawmilling Co Ltd v Waione Timber Co Ltd([7]supra), Salmond J stated that “fraud is not limited to cases of actual and certain knowledge” and elaborated at 1175 as follows: The true test of fraud is not whether the purchaser actually knew for a certainty of the existence of the adverse right, but whether he knew enough to make it his duty as an honest man to hold his hand, and either to make further inquiries before purchasing, or to abstain from the purchase, or to purchase subject to the claimant’s rights rather than in defiance of them. If, knowing as much as this, he proceeds without further inquiry or delay to purchase an unencumbered title with intent to disregard the claimant’s rights, if they exist, he is guilty of that wilful blindness or voluntary ignorance which, according to the authorities, is equivalent to actual knowledge, and therefore amounts to fraud. 34        InAssets Company, Limited v Mere Roihi[1905] AC 176at 210, it was said by the Privy Council (on appeal from the Court of Appeal of New Zealand) with relation to fraud under the Land Transfer Acts 1870 and 1885 as follows: Fraud by persons from whom [the person whose registered title is impeached] claims does not affect him unless knowledge of it is brought home to him or his agents. The mere fact that he might have found out fraud if he had been more vigilant, and had made further inquiries which he omitted to make, does not of itself prove fraud on his part. But if it be shewn that his suspicions were aroused, and that he abstained from making inquiries for fear of learning the truth, the case is very different, and fraud may be properly ascribed to him. 35        In his evidence, Mr Naidu maintained that Mr Pillay handed him the Replacement CT. He maintained this line in his re-examination. He said that one Ms Rachel Loo, who was a fairly experienced conveyancing clerk, had checked the documents and prepared the documents. She got the Mortgage registered. Mr Naidu was referred to the fact that she had drafted his letter to M/s Junaini which had stated that Mr Pillay had handed him “the original duplicate CT”. That description fitted the original duplicate certificate of title which was printed on yellow-beige paper. It looked very different from the new certificates printed under the STARS system for the SLA by SNP, which is in blue with watermarks and security features. Mr Naidu sought to explain that perhaps Ms Loo had used the phrase “original duplicate certificate of title” in the letter[1]in error. I am unable to accept his evidence and his explanation. Any experienced conveyancing clerk could not have mistaken the title certificate printed on the previous yellow-beige parchment paper and the new blue paper with watermarks. On top of that, the Replacement CT was at all material times always in the exclusive possession of Hajjah. 36        Owing to the fact that Mr Naidu had maintained that the Replacement CT and not the original duplicate certificate of title was delivered to him, he was not in position to give any evidence on what he did with the original duplicate certificate of title. He offered the explanation that he had “assumed” that the Replacement CT was the one handed to him, in view of the fact that his Registry title searches contained the notification that a Replacement CT was issued. 37        In view of the stand taken by Mr Naidu that he was handed the Replacement CT and not the original duplicate certificate of title, the plaintiff decided not to call Ms Loo to give evidence. We therefore do not have the benefit of her evidence. According to Mr Naidu, Ms Loo had handled the searches and the drafting of the Mortgage. She wrote the letter stating that the “original duplicate certificate of title” was handed to Mr Naidu. She was the one who must have read the Registry title searches and found that a Replacement CT had been issued. She must have known that the original duplicate certificate of title had been cancelled “for all purposes notwithstanding the fact that the certificate may subsequently be recovered”. She must also be deemed to know that it was an offence to be in possession of that certificate, which should have been surrendered to the SLA. But Ms Loo was not the person who tendered the Mortgage and the original duplicate certificate of title for registration. It was another person who freelanced for Mr Naidu. That person was not called to give evidence. The registration at the Registry also made the mistake. And the registration went through. 38        What did Mr Naidu and/or Ms Loo know in relation to the original duplicate certificate of title given to them? Mr Naidu gave me the impression that he left the file very much to Ms Loo and his secretary. He did not strike me as knowing very much about the file. On the other hand, Ms Loo had checked the title, made the Registry title searches and written the letter acknowledging that the firm had received the “original duplicate certificate of title”. She knew or deliberately turned a blind eye to the fact that the firm had received a document which was cancelled and of which it was illegal for the firm to be in possession. Yet Ms Loo proceeded with the registration of the Mortgage, by instructing the freelance registration clerk to do so. As a result, the Mortgage was registered on the strength of an erroneous document. In the case of wilful blindness, I rely on what was stated by Tadgell JA inMacquarie Bank Ltd v Sixty-Fourth Throne Pty Ltd[1998] 3 VR 133, where it was pointed out that wilful blindness could in certain circumstances be “akin to fraud”. In my view, this was the situation in the instant case, if Ms Loo’s conduct was not fraudulent in the first place. On either basis, the defendant is entitled to defeat the Mortgage registered pursuant to s 46(2) of the LTA on the ground of fraud. 39        Alternatively, in view of the facts as found, I accept the submission of counsel for the defendant that I should rectify the land-register by cancelling the registration of the Mortgage under s 160(1)(b) of the LTA on the ground that it was obtained through an omission or mistake. In accepting the original duplicate certificate of title at the Registry, the staff concerned (who was not identified) must have made a mistake. The plaintiff should not derive any benefit arising from the registration because of the wrongful and illegal use of the original duplicate certificate of title. 40        Further and in the alternative, I also accept the submission of counsel for the defendant that the defendant has a personal right recognised by equity to set aside the transaction on the ground that the plaintiff’s agents had unlawfully used the cancelled original duplicate certificate of title to get on the land-register as a mortgagee to the defendant’s detriment and when they were not entitled to do so. This case does not involve a third party who had dealt with the property on the faith of the land-register. The case ofMercantile Mutual Life Insurance Co Ltd v Gosper(1991) 25 NSWLR 32 (“theMercantile Mutual Lifecase”) is relevant. It was held by a majority of the Court of Appeal with Meagher JA dissenting that registration under the Australian Real Property Act 1900 (which is broadly similar to the LTA) might be set aside when there was a personal equity enforceable under the general law. It was also held that such an enforceable personal equity arose in respect of a forged variation of mortgage where the mortgagee produced the certificate of title without the authority of the registered proprietor and in breach of its obligations in relation to possession and custody of the certificate of title. 41        Prof Tan Sook Yee summarised the facts in theMercantile Mutual Lifecase in her bookPrinciples of Singapore Land Law(Butterworths Asia, 2nd Ed, 2001) at pp 242 and 243 as follows. In that case, Mrs Gosper mortgaged the property to the mortgagee for a certain sum. The mortgage was registered. Later, Mr Gosper, without the knowledge or consent of Mrs Gosper, increased the amount of the loan and forged Mrs Gosper’s signature to the Variation of Mortgage. Mrs Gosper argued that the Variation was not binding on her. The mortgagee was not found to be fraudulent. It relied on the indefeasibility of its title. The court held that although the mortgagee had title under the Variation of Mortgage (despite the forgery of Mrs Gosper’s signature), nevertheless as no interest had been acquired by a third party on the faith of the register, Mrs Gosper could enforce a personal equity against the mortgagee. This personal equity sprang from the mortgagee using Mrs Gosper’s certificate of title to register the Variation of Mortgage without her consent. The court held in favour of Mrs Gosper even though the mortgagee was neither privy to the fraud nor was it even put on enquiry as to the perpetuation of the fraud. 42        Based on the facts as found above, the use of the original duplicate certificate of title to register the Mortgage was in my view unconscionable. 43        In my view, the sanctity of the land-register under the LTA under the doctrine of indefeasibility should not be used to allow unconscionable behaviour. 44        Accordingly, I grant the following reliefs: (a)        a declaration that the Mortgage dated 3 November 2000 registered by the plaintiff against the property belonging to the defendant comprised in Certificate of Title Volume 495 Folio 160 is null and void and is set aside as against the defendant; (b)        an order that the registration of the Mortgage be cancelled by the Registrar of Titles; and (c)        an order that the plaintiff pay the defendant costs, including the costs of $7,500.00 awarded in Originating Summons No 539 of 2002. Claim dismissed. [1](AB58)"
    }
}