{
    "case_title": "JSI Shipping (S) Pte Ltd v Teofoongwonglcloong (a firm)",
    "ncitation": "[2006] SGHC 223",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "The Plaintiff": "2          The plaintiff was incorporated on 26 September 1998 under the name “Ten-Up International Pte Ltd” which was subsequently changed to its present name.  They carry on the business of providing freight forwarding and other related services.  Although the plaintiff had two directors at the material time, Riggs was based in Singapore while the other director, James Cullen (“Cullen”) was resident in California.  Cullen was also a director and the major shareholder of the plaintiff’s ultimate holding company, JS International Shipping Corporation (“JSISC”) which was incorporated in California.  JSISC is the parent of the plaintiff’s holding company, Cranberry Gold, which was incorporated in the British Virgin Islands. 3          JSISC had its origins in a sole proprietorship established in 1983 by Cullen and which he incorporated as a company in 1986.  JSISC provides international logistics and door to door freight forwarding services to its customers who are mainly based in the USA.  It has four branches in the US, namely in Austin, Boston, Los Angeles and Portland, with the Corporate Office in Burlingame, California.  JSISC also operates in Taiwan, Hong Kong and China.  For its freight forwarding operations in Singapore, JSISC previously used local agents.  These agents would invoice JSISC, who would in turn invoice its own customers with a mark-up.  However, with an increased volume of business in Singapore JSISC considered that it made business sense to incorporate a local subsidiary.  The plaintiff was accordingly incorporated on 26 September 1998.  The bulk of the plaintiff’s business came from JSISC’s customers in the US and it was not a priority to establish a customer base in Singapore.  There were no sales or revenue targets for the plaintiff to achieve.  By way of comparison, JSISC’s average annual turnover from 1999 to 2002 was approximately U$30m worldwide.  The plaintiff’s turnover in Singapore was $2.5m in 1999, and $7.3m for 2000 and 2001. 4          Cullen’s evidence in relation to how Riggs was engaged was not disputed.  Cullen said that to minimise cost, he to engaged a director in Singapore (rather than employ somebody from the United States on expatriate terms) to head the plaintiff as well JSISC’s Asia operations.  Riggs, who was introduced to Cullen by one of JSISC’s agents sometime in 1997 or 1998, seemed to fit the requirements for the job and was engaged sometime at the end of 1998 as the plaintiff’s Asia Director.",
        "The defendant": "5          The defendant is a full service public accounting practice.  The services that it provided include statutory auditing, special auditing, accounting, tax, corporate advisory services, litigation support, due diligence review, initial public offerings, liquidation, receivership and judicial management.  At the material time, the defendant was a member of the same organization, NEXIA, as JSISC’s auditors in California.   The defendant conducted three statutory audits of the plaintiff’s accounts: these were in respect of financial years (“FY”) 1999, 2000 and 2001.  All three audits were unqualified.",
        "Riggs’ malfeasance": "6          In June 2002, Cullen received an anonymous letter informing him that Riggs, together with two other employees of the plaintiff, were involved in a scheme to siphon funds from the plaintiff through a company called Starwin Century (S) Pte Ltd (“Starwin”).  The letter also alleged that Riggs was using the plaintiff’s funds for his personal expenses.  Cullen made two trips to Singapore to investigate the matter.  In his second trip he was satisfied that Riggs had siphoned funds from the plaintiff and terminated Riggs’ employment sometime in June.  Cullen discovered that it was the plaintiff’s Office Manager, Laili Ya’akub (“Laili”) who had sent the anonymous letter.  Laili explained that around January 2002 she had noticed certain questionable matters concerning Riggs and conducted a discreet investigation.  She had only managed to gather sufficient evidence by June but, fearing for her employment as Riggs was the most senior person in Singapore, she decided to send an anonymous letter to Cullen. 7          Riggs left Singapore shortly after he was sacked.  In early July 2002 the plaintiff engaged the services of the auditing firm of M/s Ng, Lee & Associates-DFK (“NLA”) to conduct a special audit to uncover the full extent of Riggs’ malfeasance.  The initial audit initially covered the period 1 January 2001 to 30 June 2002.  This was completed and a report put up on 5 August 2003.  The plaintiff filed the writ in this action on 29 October 2004.  In September 2005, NLA was instructed to carry out a special audit for the period September 1998 to December 2000.  NLA completed the report for this second special audit on 8 February 2006. 8          In its First Special Audit Report, NLA stated that Riggs had misappropriated company funds totalling $1.808 million over the period January 2001 to June 2002.  These misappropriations comprised personal expenses charged to director’s benefits without board approval, unsubstantiated travelling expenses, doubtful charges for office renovation, fictitious payments to a company controlled by Riggs and issuance of numerous cash cheques for spurious transactions. 9          The Second Special Audit Report, covering the period September 1998 to December 2000, alleged that there was an overpayment of salary for Riggs amounting to $18,000.  The report also stated that he had received non-approved sums of money for allowances and other benefits amounting to about $174,000. 10        Even after the two special audits were completed, documents surfaced that changed some of the findings.  At the end of the trial, the plaintiff’s claims were narrowed to a total of $1,777,224 comprising the sum of $1,639,622 from the First Special Audit Report and $137,602 from the Second Special Audit Report.  The breakdown for these sums is as follows: (a)        First Special Audit Report covering FY2001 and FY2002: (i)         Payments for personal transactions charged to director’s benefits without board approval totalling $262,729 (FY2001) and $169,232 (FY2002); (ii)        Deposits balances for housing and children’s education fees totalling $36,300 (FY2002); (iii)       Travelling expenses without documentation totalling $100,942 (FY2001); (iv)       Transactions charged to office renovation accounts totalling $97,250 (FY2001); (v)        Various cash cheques and cheques issued to American Express without supporting documents totalling $285,131 (FY2001) and $62,508 (FY2002); (vi)       Various cash cheques charged to employee’s benefits account totalling $63,800 (FY2001); (vii)      Transactions charged to prepayment accounts without documentation totalling $259,824 (FY2002); (viii)      Payments to Riggs’ companies, RNF Services totalling $60,561 and Starwin totalling $93,453; and (ix)       Misappropriation of plaintiff’s funds by issuance of various cheques to Starwin totalling $148,300. (b)        Second Special Audit Report covering FY1999 and FY2000: (i)         Overpayments of salary totalling $18,756; and (ii)        Non-approved payments of allowances and other benefits totalling $118,846. 11        The plaintiff claimed that these losses were caused by the breaches by the defendant of its contractual obligations and duty of care in relation to the three audits it carried out for FY1999, FY2000 and FY2001.  The plaintiff’s case is that the defendant was negligent and/or had breached its duty to the plaintiff in three critical areas in the audits: (a)        For each of the three audits, although the defendant was in substantial doubt as to the entitlement of Riggs to the amount of his salary and benefits attributed to him as director’s remuneration, the defendant had failed to obtain sufficient appropriate audit evidence to remove such doubt.  Alternatively, the defendant did not plan and perform its audits in 1999, 2000 and 2001 with the required attitude of professional scepticism. (b)        For each of the three audits, the defendant failed to express a qualified audit opinion or disclaimer opinion that would serve to document or highlight the limitation of the scope of its audit that prevented them from obtaining sufficient appropriate audit evidence. (c)        The defendant had failed to issue a management letter or internal control report to advise the plaintiff that there was a practice of: (i) splitting payment of invoices of more than $12,000 to circumvent the single cheque signatory limit; (ii) signing of blank cheques; and (iii) having large Prepayment accounts comprising transactions that had no substantiating documents, thereby breaching its contract and duty to bring to the plaintiff’s attention material weaknesses in the system of accounting and internal control that had come to the defendant’s notice.",
        "Disputes of fact": "12        The plaintiff’s case turns on the manner in which the defendant carried out the three audits and most of the facts are not in dispute.  However there are several specific events during the audits that the plaintiff relies on as part of its evidence in support of its case which the defendant disputes.  This concerns Riggs’ employment contract.  I now set out the evidence before me on this issue and the findings of fact that I made. 13        From its incorporation in September 1998 until June 1999, the plaintiff engaged the services of TFW Management Services Pte Ltd (“TFWMS”) to provide accounting and payroll services.  TFWMS was the defendant’s consultancy arm and it provided services to update accounting records and post individual entries from the plaintiff’s source documents.  TFWMS also maintained journal listings which were kept at its office.  In July 1999, the plaintiff terminated this service and the plaintiff’s Accounting Manager, Sandy Wah (“Sandy”), carried out the bookkeeping and payroll functions.  Both Sandy and the plaintiff’s Office Manager Laili were never shown Riggs’ employment contract.  Laili, who was in charge of human resource and administration and who maintained employees’ personal files was never given a copy of Riggs’ contract.  In relation to his salary and expenses, Sandy merely carried over the accounting practice from TFW and subsequently followed Riggs’ instructions to make such payments. 14        Sandy gave evidence that sometime in February 2000, the audit assistant assigned to the FY1999 audit, Lim Ken Ling (“Ken Ling”) asked for a copy of Riggs’ employment contract.  She told Ken Ling to check with Laili as this was a personnel matter.  She said that Ken Ling subsequently told her that she had spoken to Laili who told her that she did not have a copy of Riggs’ contract.  However, Ken Ling denied this.  She gave evidence that she had not asked for Riggs’ contract at all and so the incident about Sandy asking her to check with Laili could not have taken place.  No evidence was adduced from Laili on this point.  Sandy further said that she subsequently told Riggs that Ken Ling had wanted to see his employment contract.  Sandy said that following this, on a day when she was with Ken Ling in the conference room, Riggs entered and waved a brown envelope at them, saying that his employment contract was inside.  Riggs said that he would give it to Sandy or Laili and that Ken Ling could get it from either of them.  He then left the room.  Sandy said that Riggs never passed it to her and as Ken Ling did not pursue the matter further, she assumed that she had obtained it from Laili.  Ken Ling of course denied this event, consistent with her position that she had never asked for Riggs’ contract. 15        It is rather puzzling that Riggs did not pass the envelope to Ken Ling there and then.  It appeared a rather circuitous way of doing things.  Further, Sandy was also there in the room, so he could have passed it to Sandy if he, for whatever reason, did not want to hand it to Ken Ling directly.  In cross-examination Sandy could not throw any light on these questions.  She suggested that Riggs might not have wanted to pass it to her because it was a personal matter.  However, that begs the question why Riggs named Sandy as one of the two persons he would hand the employment contract to, and does not answer the question why Riggs did not pass it to Ken Ling there and then. 16        This could well have remained one of the endearing mysteries of this suit were it not for Sandy’s evidence of the audit carried out the following year, FY2000.  The audit assistant on this occasion was Pamela Pang (“Pamela”).  Sandy said that sometime at the end of February 2001, Pamela told Riggs that she wanted to see his employment letter.  Riggs replied that it was confidential and refused to produce it.  Sandy was asked in cross-examination if this was surprising to her as Riggs’ stand in the previous year was that he was quite ready to provide his employment contract to the auditors.  Sandy said that it was not because Riggs had a habit of turning down requests.  Counsel pressed further: since she was under the impression that Riggs had passed his contract to Laili the previous year (the “brown envelope” incident with Ken Ling), why did she not tell Pamela to get it from Laili?  This was Sandy’s reply: A:         Well, Pamela Pang actually approached Laili for the contract first.  However, she was---I mean, she wasn’t able to get the contract for---from Laili, so she came to me. Q:         So weren’t you surprised that Laili didn’t have a copy of this contract? A:         Yes, I was.  I was surprised. Q:         So did you ask---did you raise this---did you ask Pamela Pang then “How did you do it for the previous years?  How did you all get these employment figures for 1999 when you hadn’t seen the employment contract?” A:         I did not ask Pam but I respected Pam for her professionalism because she was very detailed in a lot of things.  I had a lot of respect for her capability. 17        Sandy’s evidence went further.  She said when Riggs suggested to Pamela that he would provide confirmation of remuneration by way of Cullen signing the Directors’ Report in the Annual Report, Pamela insisted on obtaining a copy of the contract and they got into a heated argument.  Pamela’s evidence in this respect contradicts Sandy’s.  She said that she had asked Sandy for a copy of Riggs’ employment contract and Sandy told her to check with Riggs.  Pamela subsequently asked Riggs and he told her that it was “not available”.  Pamela said that she understood this as meaning that there wasn’t one.  Pamela then discussed with Riggs on other means of confirmation of remuneration.  Riggs suggested getting the other director to confirm his remuneration which satisfied her.  Pamela denied that there was any acrimonious exchange with Riggs and commented that it was not for a person in her position to get into one with the director of a client. 18        Indeed, it does seem to me incredible that an audit assistant would engage in a heated argument with a director of a client over his refusal to disclose his employment contract, especially when he had stated that it was confidential and offered an alternative.  I accept Pamela’s position that had this taken place she would have consulted her audit manager rather than take it upon herself to quarrel with the client’s director.  I disbelieve Sandy’s evidence in this regard.  I have found her testimony to be wanting in terms of consistency as well as demeanour.  She also had the habit of avoiding the question in giving her answers in cross-examination and she had shifted her position on several matters. 19        I therefore accept the evidence of Ken Ling and Pamela.  I find that Ken Ling did not ask for Riggs’ contract during the FY1999 audit.  In the FY2000 audit Pamela asked Sandy for it, but Sandy told her to check with Riggs.  Riggs gave Pamela the impression that there was no contract and suggested that she obtained confirmation from the other director, Cullen.",
        "The audits": "20        The defendant performed a total of three audits, for FY1999, FY2000 and FY2001.  They were all carried out under the purview of audit partner John Teo (“Teo”), but the audit managers and audit assistants for each of these audits were different persons.  In all three audits, the defendant expressed an unqualified opinion on the financial statements. 21        The defendant was first engaged as the plaintiff’s auditor by way of a standard letter of engagement issued by the defendant dated 8 July 1999.  The terms of engagement mirror closely Appendix 2 of the Singapore Standard on Auditing (“SSA”) published by the Institute of Certified Public Accountants of Singapore in 1996. The two subsequent audits for FY2000 and FY2001 were also on the same terms. 22        The defendant’s case is that it had carried out all three audits in accordance with the requirements of s 207 of the Companies Act (Cap 50, 1994 Rev Ed) and the SSA.  The auditing standards pertaining to a statutory audit require the auditor to carry out sufficient work to provide reasonable assurance that the financial statements taken as a whole are free from material misstatement.  In undertaking these audits the defendant had, in accordance with the SSA: (a)        planned and performed the audit with a view to obtaining reasonable assurance about whether the financial statements are free of material misstatement; (b)        undertaken an examination of, on a test basis, evidence supporting the amounts and disclosures in the financial statements; and (c)        assessed the accounting principles used and significant estimates made by the directors, as well as evaluating the overall financial statement presentation. 23        According to the defendant, two of the purposes of the audits were: (a)        to form an opinion whether the financial statements were properly drawn up in accordance with the provisions of the Companies Act and Statements of Accounting Standard so as to give a true and fair view of the state of affairs of the plaintiff and of its results and other matters required by s 201 of the Companies Act to be dealt with in the financial statements; and (b)        to form an opinion as to whether the accounting and other records, and the registers required by the Companies Act to be kept by the plaintiff had been properly kept in accordance with the provisions of the Companies Act. 24        The defendant gave evidence by way of testimony of the people who participated in the audits forFY 1999, 2000 and 2001 as to the manner in which those audits were conducted.  The audit partner, John Teo, the Audit Manager and Assistant for the FY1999 audit, Ong Chin Heng and Lim Ken Ling, those for the FY2000 audit, David Yeo and Pamela Pang, and for the FY2001 audit, Merral Quek and Eve Ong, all set out in great detail the investigations and inquiries they made in their respective audits.  The defendant’s expert was of the opinion that the work carried out by the defendant in those three audits were adequate in the circumstances and sufficient to give the defendant a reasonable basis to express an unqualified opinion on the financial statements. 25        The plaintiff’s expert was of the opposite opinion and pointed to various matters that the defendant did or failed to do that, in the circumstances, constituted a breach in its contractual duty to the plaintiff.  I set out below the gist of their findings.",
        "Plaintiff’s expert’s findings": "26        The plaintiff’s expert is Michael Chin (“Chin”), a director in the firm of Corporate Advisory Partners.  In 1983 he qualified as a chartered accountant in the UK and joined the firm of Price Waterhouse in London.  He was posted to Istanbul, Frankfurt, The Hague before being sent to Singapore in 1990.  He had attained the position of senior audit manager when he left Price Waterhouse in 1994.  He joined the Institute of Certified Public Accountants of Singapore as its first practice review director to head and run the first practice monitoring programme in Singapore.  He established practice review procedures and policies to be used in the regulation of audit firms.  From 1999 to 2002 he was a partner in Arthur Andersen’s Assurance and Business Advisory division.  He was a   member of its Technical Committee involved in resolving issues on audit in, financial reporting and accounting.  He co-founded Corporate Advisory Partners in 2002 and had been involved in a number of special assignments ranging from due diligence review, business valuations, IPO reporting accountants’ work, internal audit, fraud investigations and litigation support.  Chin is a member of the Institute of Internal Auditors of Singapore and appointed by the Accounting and Corporate Regulatory Authority as a member of its Complaints and Disciplinary panel. 27        Chin gave evidence that he reviewed the audit carried out by the defendant in respect of the plaintiff’s financial statements for FY 2000 and 2001 and director’s remuneration pertaining to Riggs in respect of the financial period from 26 September 1998 to 31 December 1999 (“FY 1999”) with the objective of ascertaining whether the audit for each of the FY 1999 to FY 2001 was conducted in accordance with the SSApublished by the Institute of Certified Public Accountants of Singapore in 1996.  He made the following findings: (a)        Riggs’ remuneration was material (as defined in SSA 25 Audit Materiality) in the context of the financial statements of the plaintiff. (b)        The defendant had not documented in its working papers the significant issues relating to the unusual difficulties it encountered during its audits to gather sufficient appropriate audit evidence of Riggs’ remuneration as it was not able to: (i)         obtain Riggs’ employment contracts and related correspondence on remuneration matters; (ii)        obtain confirmation reply from the other director, Cullen; and (iii)       obtain management representation letters for FY2000 and FY2001 which included specific representations on Riggs’ remuneration, and under such circumstances ought not to have given an unqualified audit opinion on the financial statements (SSA 9 Documentation). (c)        The defendant did not obtain sufficient appropriate evidence as required by SSA 8 Audit Evidence to be satisfied that the assertions in the financial statements relating to Riggs’ remuneration are valid and in this respect should have expressed a qualified opinion or a disclaimer audit opinion as required under paragraph 18 of SSA 8 Audit Evidence. (d)        The defendant should have described the scope limitation and indicated possible adjustments to the financial statements that might have been determined to be necessary had the limitation not existed in its auditor’s report to the members of the plaintiff under SSA 13 Auditor’s Report on the Financial Statements. (e)        It is questionable whether the defendant had complied with SSA 11 Fraud and Error in respect of: (i)         carrying out of the audit with an attitude of professional scepticism, recognising that conditions and events may be found that indicate fraud and error may exist particularly in a control environment dominated by Riggs who was the sole signatory for cheques up to, initially, $10,000 and subsequently $12,000; and (ii)        assessing and addressing the risk factors in the design of its audit procedures relating to Riggs being a dominant individual who controlled the company and had authority to sign cheques up to those amounts as well as inadequate documentation to support his remuneration. (f)         Best practices would have required a reasonably competent auditor to issue a management letter to the board on the internal control weakness pertaining to Riggs’ sole cheque signatory powers that the defendant was aware of. 28        Chin’s conclusion was that the defendant’s failure in the audit of the plaintiff is essentially due to them not being able to carry out the audit procedures they intended on Riggs’ remuneration and at the same time, exercising incorrect professional judgement by accepting the signed Statement by Directors and Directors’ Report in the plaintiff’s financial statements as sufficient appropriate evidence to substantiate Riggs’ remuneration. The defendant should have recognised the scope limitation of its audit and expressed a qualified or disclaimer audit opinion in accordance with SSA 8 and SSA 13 for each of the financial years 1999 to 2001. 29        In relation to the issue of Riggs’ employment contract, Chin’s comments about the defendant not documenting in its working papers the unusual difficulties in gathering audit evidence of Riggs’ remuneration must be considered in the light of the finding of fact I have made that Ken Ling had not asked for a copy of Riggs’ contract and Pamela was told by Sandy that there was no such contract.",
        "Defendant’s Expert’s Findings": "30        The defendant’ expert was Kaka Singh (“Singh”) a partner in RSM Chio Lim, Singapore (“RSM”), an international firm of certified public accountants.  Prior to joining RSM in 2000 Singh was a senior partner of Deloitte & Touche, Singapore which he joined in 1986.  At Deloitte & Touche he had served as director of accounting and auditing, director of training, senior technical partner and litigation support partner. He had also been involved with quality reviews of audit working papers of selected Deloitte & Touche firms in Hong Kong, Malaysia, Indonesia, India and Brunei.  Singh had served the Institute of Certified Public Accountants of Singapore (“ICPAS”) on several committees including being the chairman of the Audit Practice Committee from 1986 to 1987 and the chairman of the Accounting Standards Committee from 1993 to 1995. In 1993, he was awarded the Silver Medal by ICPAS for contribution to the accounting profession in Singapore.  Singh was a member of the Financial Reporting Committee of the Association of Chartered Certified Accountants, London from 2001 to 2005.  He is alsoan independent director and chairman of three listed companies: Tuan Sing Holdings Ltd, Gul Technologies Singapore Ltd and Sunningdale Tech Ltd. 31        The terms of reference of Singh’s report were his expert opinion on the following matters: (a)        whether the defendant had in the audit of the financial statements of the plaintiff for the financial years 1999, 2000 and 2001, acted in accordance with the SSA and the requirements of the Companies Act; and (b)        in particular, to focus on the allegations in the Amended Statement of Claim as to the failings or shortcomings in the audit for the relevant years. 32        Singh said that he had reviewed the Audit Plan Memorandum for the three audits and formed the opinion that the budgeted times of 92 hours, 104 hours and 130 hours for FY1999, FY2000 and FY2001 were reasonable and realistic.  This was because of the small size of the company, with a few accounting staff and uncomplicated accounting due to the nature of its freight business.  Singh noted that the defendant adopted a methodical approach in planning each audit, utilising an Audit Plan Memorandum to guide its audit staff even though this was not required by the auditing standards.  He opined that the defendant’s Audit Plan Memorandum for each audit was more than adequate even for a fairly large company. 33        Singh concurred with the defendant’s view that the plaintiff did not have any difficult audit or accounting areas that needed special attention of the audit manager or audit partner.  He said that the defendant had noted that the plaintiff was a wholly-owned subsidiary of an MNC and that it would be closely supervised and monitored by the parent company.  Singh noted that the defendant had made an assessment of the audit risk by inquiries of appropriate management and staff of the plaintiff and came to the conclusion that the audit risk was low.  In Singh’s view, the assessment that the risk was low was appropriate because the plaintiff was a one-product company with a significant portion of its sales with the parent company and with close monitoring and supervision by the accounting staff of the parent company.  Also, the plaintiff’s only other director was the president of the parent company. 34        Singh opined that the most important aspect of a planning process was to develop a general strategy and a detailed approach to be taken for the audit.  He observed that the defendant had documented these thoroughly and they had included compliance tests, tests of controls, substantive tests such as analytical reviews, reasonableness tests and vouching of significant profit and loss items.   In his view, this was more than sufficient for the three audits. 35        Singh was of the view that the manpower committed to each of the three audits was more than adequate for a company of the plaintiff’s size.  He noted that the audit staff and manager were changed each year, thereby minimising the risk of errors arising out of over-familiarity and ensuring that the audit team’s independence was not impaired due to familiarity with the plaintiff’s management.  Singh noted that the audit plan memorandum for each of the three audits in question was prepared and subsequently reviewed by two persons, the manager and the partner, thereby ensuring that any bias would be addressed. 36        Singh said that the defendant had made a proper assessment of the materiality criteria based on the literature issued by ICPAS.  He explained that auditing materiality criteria determines the scope of the audit. The concept recognises the fact that an audit is inherently imprecise because, for practical reasons, it is based on tests of less than 100% of recorded balances and transactions. It is designed to be used repeatedly throughout the audit for scope determination, for sampling applications, as a limit on \"unexamined\" populations of transactions, and as the judgmentally-determined maximum undetected misstatement allowable for analytical procedures used as primary substantive audit tests.  By setting a materiality criteria, the auditors are required to audit all items over the materiality criteria amount or justify why no audit work was necessary. Consequently, it is often and is expected that those items with amounts less than the materiality criteria amounts are not audited.  Singh opined that the materiality level determined by the defendant, of $35,000, $80,000 and $60,000 respectively for the audits in FY 1999, FY 2000 and 2001 were properly determined. 37        Singh said that the detailed general risk assessment for all the three audits had noted that: (a)        there were no unusual constraints on fees or deadlines – this meant that there was no scope limitation or undue pressures imposed by the client on the auditors. (b)        there was proper budgeting control – meaning that the plaintiff’s budgets were prepared and reviewed by management at the Singapore level and the parent company level. (c)        there was no lack of accounting and administrative procedures. In fact, the plaintiff was ISO9002 certified, which requires minimum acceptable controls of servicing processes and developing a quality system to control internal documents to qualify for the certificate. This provided comfort in that there were certain minimum accounting controls which the defendant could rely on. 38        Singh was of the view that, based on the detailed general risk assessment for each of the audits, the plaintiff had a good control environment to ensure that there was no inherent risk in the preparation of the financial statements.  He explained that inherent risk refers to the risk of material misstatements in the financial statements that have not been actively prevented or have not been detected by the company’s and parent company’s personnel in the normal course of business.  He noted that the defendant also made a specific risk assessment for each of the audits in question that indicated which audit programs were to be used for the various ss of the balance sheet and profit and loss accounts. The specific risk assessments were prepared by one person and countersigned by another to prevent any bias and to ensure a proper approach to the various balances in the balance sheets and profit and loss accounts. 39        Singh also commented on the specific audit procedures carried out by the defendant in the audits for FY1999, FY2000 and FY2001.  He opined that the nature and extent of the procedures performed in the three audits were more than adequate for a company of the plaintiff’s size and simplicity.  He stated that for a small company, it was usual that a substantial part of the audit evidence would be provided verbally by the management of the company.  He noted that this was the case with the audits in question and that the defendant could take comfort that under s 402 of the Companies Act, it is an offence for a director to be dishonest with the auditors. 40        Singh observed that the significant sales and related costs were with the parent company. The defendant had tested these for validity and the balances were confirmed in writing by the parent company.  Additional analytical procedures performed were adequate.  He noted that the tests of controls and substantive tests performed were in addition to the analytical procedures and in fact, they would not normally be required in such circumstances.  Singh said that the defendant had in fact exceeded what it was required to do.  The defendant also performed analytical procedures for the items in the Profit and Loss accounts and for all the significant variances, it made enquires of the plaintiff’s management to satisfy itself that the variances were properly explained.  Singh said that auditors were entitled to rely on the management to provide honest explanations. 41        Singh examined the audit working papers and noted that there would be conclusions arrived at by the audit staff, usually in the form of words like “no exceptions, no unusual items, satisfactory or fairly stated”.  He observed that the audit working papers for all three audits were initialled by two persons to indicate that the work planned was carried out, and was performed to the satisfaction of the reviewer. 42        Singh was of the firm view that the audits were properly planned, the nature and extent of the audit procedures were appropriate, the audit procedures were carefully executed, and that where necessary, alternative procedures were performed and sufficient audit evidence was obtained.  On this basis he opined that the defendant had a reasonable basis for expressing its opinion on the plaintiff’s financial statements for FY 1999, FY2000 and FY2001. 43        In response to Chin’s opinion on specific failures of the three audits undertaken by the defendant, Singh observed that there appeared to be fraud involving collusion amongst the plaintiff’s employees.  He said that under these circumstances, the defendant could not be expected to detect such fraud as any accounting and internal control system may be ineffective against fraud involving collusion amongst employees or fraud committed by management. 44        Singh also noted that it was also not the defendant’s responsibility to prevent fraud or error.  He explained that the objective in an audit is to express an opinion on the company’s financial statements, and not to provide assurance on internal control. Thus, the defendant was not obligated to search for material weaknesses, nor was it expected to discover all such deficiencies. The defendant’s only obligation was to report such deficiencies which had come to its notice and which it thought to be material. 45        Singh observed that the manner in which the plaintiff is organised only worked effectively if the Singapore resident director, namely, Riggs, was beyond reproach and totally loyal to the plaintiff and its parent company.  This manner of organisation is common and has been known to work with many MNCs with small operations overseas.  Singh said that he had personally noticed this when Singapore companies started small operations in China.  Singh opined that given the inherent limitations of an audit and that the audits for FY 1999, 2000 and 2001 were carried out to provide a reasonable basis for expressing an opinion on the plaintiff’s financial statements for FY 1999, 2000 and 2001, the defendant should not be held to an unrealistically high standard that required the prevention and detection of every bit of irregularity and fraud.",
        "Evaluation of Experts’ Evidence": "46        At issue is not so much the general manner in which the defendant carried out the audits but its failure to verify information or detect weaknesses in relation to three specific matters. 47        The first major complaint of the plaintiff was that the defendant had failed to verify the remuneration and other benefits that Riggs was entitled to.  It turned out that Riggs’ initial contract in November 1998 provided for a salary of $12,000 per month, plus a discretionary incentive bonus.  He was also entitled to $300 reimbursement for health insurance for him and his family.  By an exchange of e-mail with Cullen, Riggs negotiated his salary to $22,000 per month from May 1999.  In April 2000 he obtained additional benefits of between $6,000 and $7,000 per month.  And from January 2001 his salary was $25,000 per month.  Indeed Cullen had adopted a rather informal approach on the issue of Riggs’ entitlement to benefits and approved specific expenses outside of what was agreed upon. 48        The defendant’s approach towards this issue has been from the viewpoint of choice of audit procedure.  In the particular circumstances of the plaintiff, the defendant had determined that, there being only one director receiving remuneration, a confirmation of the remuneration paid to the receiving director from Cullen who was at the same time the only other director and the majority shareholder, was better audit evidence compared to the mere sighting of an employment contract. This would address the situation where an employment contract became outdated or did not comprehensively cover all benefits a director had received. 49        Consistent with this approach, in the FY1999 audit Ken Ling, the Audit Assistant, did not ask for Riggs’ employment contract.  In the FY2000 audit, the Audit Assistant, Pamela, asked Sandy for it, was referred to Riggs who told her that it was not available and suggested that the defendant obtain confirmation from the other director.  The defendant eventually accepted Riggs’ suggestion that Cullen’s approval by his signature on the draft financial statements would constitute approval of Riggs’ remuneration package.  The defendant reasoned that, as Riggs was the sole director receiving remuneration, Cullen would be able to glean from the entry “director’s remuneration” in the draft financial statements the total remuneration Riggs received for the year in question. 50        The defendant also argued that Riggs’ did not try to hide his remuneration and other benefits.  In fact,Riggs was completely transparent about it with his staff, with the defendant, and with Cullen and the finance director of the JSISC, Russ Hora (“Hora”).  His remuneration were disclosed in monthly Profit and Loss accounts submitted to US, various schedules, in operating budgets and in the draft financial statements in all three audits.  Riggs had no qualms about the specific disclosure of his remuneration in the plaintiff’s audited financial statements for FY 1999, 2000 and 2001. It was Riggs’ suggestion to the defendant to accept Cullen’s signing on the audited financial statements as acknowledgement of his remuneration.  Sandy testified that Riggs had never told her to hide any figures from Cullen or Hora.  Sandy agreed that he left it to her as to how the accounting should be done for those expenses. 51        The second major complaint pertains to the issue of split cheques.  Riggs had a cheque signing limit initially of $10,000 which was increased in July 2000 to $12,000.  Cullen said that he had established this as a form of control, the amount being pegged to the monthly rental so that Riggs could sign those cheques.  For sums higher than this, Cullen’s signature would be required.  The Special Audit disclosed instances where payments for invoices higher than the limit were made in two or more cheques, each below the limit.  This meant that Riggs alone could sign the cheques, thus bypassing Cullen’s control.  These cheques were in round figures, mostly for the limit of $10,000 or $12,000. 52        The plaintiff submitted that in a case such as this, where a co-signatory resides overseas, this form of internal control becomes even more critical and important because it is one of the main ways of exerting management control and influence.  All the more when Riggs was not known to Cullen before he joined the plaintiff and where the plaintiff’s operations were totally financed by JSISC.  However it is worth noting that the plaintiff’s expert, Chin, did not cite this as a significant finding in his report. 53        The defendant’s position was that it did not considerthe existence of “round numbered cheques” by itself to be an indication of fraud. This was because progresspayments and partial payments of an invoice are often done in round numbered amounts, thus the mere existence of a round numbered cheque would not be considered a suspicious practice.The defendant’s expert, Singh, testified that issuing of “round numbered” cheques is a common occurrence in companies especially in light of the fact that many companies pay their purchases by instalments.  He said that the statutory audit process is not designed to identify “round numbered” cheques. This is because in the usual case, where payment vouchers are used as a basis for verification, the relevant audit procedure is to ensure that such payment vouchers are duly authorised. The auditor’s duty is to ensure that the payments are properly paid out and that is the focus of the verification work.  Testing is done by way of sampling, and also, the objective is to establish the validity of the expenditure and proper classification in the accounts.  Inthe course of the audit for FY 2001, the defendant’s staff did come across some of the “round numbered” cheques but it did not give rise to any reason for suspicion as the defendant managed to establish the validity of the expenditures and proper classification of the accounts for those payments.  Furthermore, Sandy said that in early 2002 she had sent to Cullen and Hora Excel spreadsheets containing details of all cheques issued in each month in 2001.  The fact that “round numbered” cheques had been issued and that payments were made by split cheques were clear from those documents. 54        The defendant pointed out that inany event, the plaintiff had not established that payments using “round numbered” cheques were for illegitimate expenses and therefore did not have any evidence that it had suffered losses as a consequence of this. 55        The third major complaint pertains to expenses of the plaintiff’s Hong Kong Subsidiary, Ten-Up International (Hong Kong) Ltd (“Ten-Up Hong Kong”).  In 2001 and 2002 Riggs had caused cash cheques to be drawn on the plaintiff’s bank accounts and made payable to third parties purportedly for transactions made by Ten-Up Hong Kong.  In the audited financial statements for FY2001, the defendant had stated that the receivable balance from Ten-Up Hong Kong was approximately $438,000 as at 31 December 2001 but there was nothing to substantiate the representation that the receivable balance was in fact about $438,000. 56        During the audit for FY2001, a meeting was held sometime in January 2002 in which the defendant’s representatives asked Riggs for substantiation of numerous cash cheques that had been drawn up by Riggs and ostensibly made payable to GoodTime Services Limited for renovation expenses of Ten-Up Hong Kong. Riggs responded that he could not furnish supporting documents to substantiate the transactions as he had engaged the services of part-time labourers. The defendant’s representatives then asked Riggs to either get the contractor to provide invoices or to engage a surveyor to prepare a report providing an estimate of the costs of the renovations carried out.  Riggs later presented invoices in the name of GoodTime which were accepted by the defendant and they did not pursue the matter further. GoodTime was apparently dissolved on 17 November 1995. 57        Ten-Up Hong Kong was incorporated in January 2001 and like the plaintiff, it provided semi-conductor distribution, freight forwarding services and logistics support, mainly as a forwarding agent to receive and onward ship air cargo for customers of JSISC. The defendant was not the auditor for Ten-Up Hong Kong which had its own separate auditor.  At all material times, Riggs and Cullen were also the only two directors of Ten-Up Hong Kong while Sandy was in charge of preparing Ten-Up Hong Kong’s financial statements and management accounts. Ten-Up Hong Kong’s account books were kept by Sandy in Singapore. 58        The defendant had performed the following verification procedures for the payments made on behalf of Ten-Up Hong Kong: (a)        At the planning stage, the Audit Assistant, Ong Ciu Hwa (“Ciu Hwa”) planned to obtain confirmation of the debt due and agree the amount to Ten-Up Hong Kong’s account books which she had been told were kept by Sandy in the plaintiff’s office. (b)        At the audit evidence gathering stage, Ciu Hwa made relevant adjustments to account for amounts pertaining to the inter-company balance between the plaintiff and Ten-Up Hong Kong which had been wrongly classified. (c)        Based on the information obtained from the plaintiff’s Management Accounts 2001, Ciu Hwa calculated that the total receivable balance due from Ten-Up Hong Kong was about S$438,000. (d)        Ciu Hwa obtained confirmation of the amount owing by Ten-Up Hong Kong by agreeing the amount to Ten-Up Hong Kong’s account books, which were at the material time, maintained by Sandy and kept at the plaintiff’s office. (e)        The defendant obtained a further confirmation that the debt due from Ten-Up Hong Kong was approximately S$438,000 when it was requested by Ten-Up Hong Kong’s auditors, Mazars, to carry out an audit of Ten-Up Hong Kong’s account books which were kept in Singapore. In the course of doing so, the defendant sighted a letter between Ten-Up Hong Kong and the plaintiff confirming the receivable balance. 59        The defendant’s expert, Singh, opined that the procedure was acceptable especially in the light of the confirmation from Ten-Up Hong Kong that the amount was due as a debt to the plaintiff.  He said that it was not the responsibility of the defendant to satisfy itself that Ten-Up Hong Kong had expended those monies properly.  The plaintiff’s own expert, Chin, did not express a view on this matter.  The accountant who conducted the Special Audit, Steven Teo was asked about this and his response was that in a normal audit, he would have done what the defendant did, i.e. rely on the confirmation of debt from the subsidiary.",
        "The law": "60        Singh began his report by citing the ss 199 and 201 of the Companies Act which impose duties on directors of companies to maintain accounting records, to ensure that they reflect a true and fair view of its financial affairs and to highlight any unusual item, event or transaction that is material.  Singh noted that both Cullen and Riggs, as directors, had made the following statements in the Directors’ reports for FY1999, FY2000 and FY2001 attesting to the accuracy of the financial statements: (a)        At the date of this report, the directors of the company are not aware of any circumstances not otherwise dealt with in this report or financial statements which would render any amount stated in the financial statements of the Company misleading. (b)        In the opinion of the directors, the results of the operations of the Company have not been substantially affected by any item, transaction or event of a material and unusual nature during the financial year. (c)        In the opinion of the directors, no item, transaction or event of a material and unusual nature has arisen in the interval between the end of the financial year and the date of this report which would affect substantially the results of the operations of the Company for the financial year in which the report is made. 61        In my view, the fact that these duties are imposed on directors by itself does not absolve the defendant of liability.  However, as I understand it, the defendant’s point is that any representation made by a director would be accorded the appropriate weight by the auditor bearing in mind that the director has these statutory duties. 62        The proper line of inquiry would be to ask what are the duties of an auditor, specifically the defendant, to the client company.  This would be governed by the contract of engagement.  The defendant was first engaged as the plaintiff’s auditor by way of a standard letter of engagement issued by the defendant dated 8 July 1999.  The material parts of that letter states as follows: Our audit will be made in accordance with the requirements of Section 207 of the Companies Act, Cap. 50, with the objective of expressing an opinion on the accounts. In forming our opinion on the accounts, we will perform sufficient tests to obtain reasonable assurance as to whether the information contained in the underlying accounting records and other source data is reliable and sufficient as the basis for the preparation of the accounts. We will also decide whether the information is properly communicated in the accounts. In this regard, we will disclose significant deviation if the accounts do not comply with the Statements of Accounting Standard issued by the Institute of Certified Public Accountants of Singapore. Because of the test nature and other inherent limitations of an audit, together with the inherent limitations of an audit, together with the inherent limitations of any system of internal control, there is an unavoidable risk that even some material misstatement may remain undiscovered. Accordingly, our audit should not be relied on to disclose fraud, defalcations or other irregularities. However, if they exist, their disclosure may result from the audit tests we undertake.We shall report to you any such matters and any material weaknesses in the system of accounting and internal control which come to our notice and which we think should be brought to your attention. The Companies Act provides that the responsibility for the preparation of the accounts including adequate disclosure is that of the directors. This includes the maintenance of adequate accounting records and internal controls, the selection and application of accounting policies, and safeguarding of the assets of the Company. As part of our audit process, we will request from the directors written confirmation concerning representations made to us about the audit. The Companies Act provides that we shall have a right of access to the accounting and other records including registers of the Company. In addition, we have access to such information and explanations as we require for the purposes of our audit. In this connection we look forward to full co-operation with your staff. [emphasis added] 63        These terms are very similar to what is found in Appendix 2 of the SSA, save that the defendant have included an additional express duty (underlined above) to report any material weaknesses in the system of accounting and internal control which come to its notice.  The terms of engagement remained the same for the two subsequent audits for FY2000 and FY2001. 64        The terms of engagement must be seen in the light of the statutory provisions pertaining to the audit.  The relevant ones are ss 205 and 207 of the Companies Act.  Section 205 requires directors to appoint auditors within three months of incorporation and to ensure they are replaced in good time after resignation.  Section 207 requires the auditor to report to members of the company on its accounts and to give an opinion as to whether they give a true and fair view of its profit or loss.  The provision confers extensive powers on auditors to gain access to all relevant records and attend general meetings.  The auditor is obliged to report serious breaches of the Act to the Registrar of Companies and any offence involving fraud or dishonesty to the relevant authority. 65        It can be seen that that auditor is required by s 207 to give an opinion as to whether the accounts of the company give a true and fair view of its profit and loss. InRe Kingston Cotton Mill Co Ltd[1896] 2 Ch 279, (“Re Kingston”), Lopes L J illustrated this in the following manner (at 288): It is the duty of an auditor to bring to bear on the work he has to perform that skill, care, and caution which a reasonably competent, careful, and cautious auditor would use.  What is reasonable skill, care, and caution must depend on the particular circumstances of each case.  An auditor is not bound to be a detective, or, as was said, to approach his work with suspicion or with a foregone conclusion that there is something wrong.  He is a watchdog, but not a bloodhound.  He is justified in believing tried servants of the company in whom confidence is place by the company.  He is entitled to assume that they are honest, and to rely upon their representations, provided he takes reasonable care.  If there is anything calculated to excite suspicion  he should probe it to the bottom; but in the absence of anything of that kind he is only bound to be reasonably cautious and careful. 66        It was held inRe London and General Bank(No. 2) [1895] 2 Ch 673, at 683 that the duty of an auditor in a statutory audit is not to provide a warranty that the books correctly show the true position of the company’s affairs, but to take reasonable care to ascertain that they are so.  What amounts to reasonable care depends on the circumstances of each case.  InRe City Equitable Fire Insurance Co Ltd[1925] Ch 407 at 509, Pollock M R, referring to the metaphor (of an auditor being a watchdog, not bloodhound) used by Lopes L J inRe Kingston, said that the role of an auditor was more “happily expressed” as one of verification and not detection.  The Master of the Rolls cited with approval the statement of Lindley L J inRe Kingston[1896] 2 Ch 279 at 287, that if there is no suspicion of any fraud, the question is whether there was a want of reasonable care on the part of the auditors. 67        InFomento (Sterling Area) Ltd. v Selsdon Fountain Pen Co Ltd[1958] 1 All ER11 at 23, Lord Denning expanded on this in the following manner: What is the proper function of an auditor? It is said that he is bound only to verify the sum, the arithmetical conclusion, by reference to the books and all necessary vouching material and oral explanations, and that it is no part of his function toinquirewhether an article is covered by patents or not. I think this is too narrow a view.An auditor is not to be confined to the mechanics of checking vouchers and making arithmetic computations. He is not to be written off as a professional “adder-upper and subtractor”. His vital task is to take care to see that errors are not made, be they errors of computation, or errors of omission or commission, or downright untruths.  To perform his task properly, he must come to it with an inquiring mind – not suspicious of dishonestly, I agree – but suspecting that someone may have made a mistake somewhere and that a check must be made to ensure that there has been none.[Emphasis added] The words italicised above was cited with approval by the Court of Appeal inUnited Project Consultants Pte Ltd v Leong Kwok Onn[2005] 4 SLR 214. 68        In determining whether there is a breach of duty, the court must do so in the light of accepted professional practice.  InLloyd Chyham v Littlejohn[1987] BCLC 303, at 305, the Woolf J held that the same test for auditors applied at that for doctors (inBolam v Friern Hospital Management Committee[1957] 1 WLR 582); therefore there would be no breach of duty if the auditor has acted in accordance with a practice accepted as proper by a body of skilled and responsible auditors. 69The plaintiff relied onLeeds Estate Building and Investment Co. v Shepherd(1887) 36 Ch D 787 where the auditor had relied on inaccurate balance sheets prepared by the secretary and manager of the company.He also relied without further inquiry upon the same person’s statement that securities upon which monies were lent were worth more than those monies. The auditor certified the accounts in terms indicating that he had carried out proper examination and inquiries. In holding the auditor to be in breach of his duty to the company, Stirling J said that: … the duty of the auditor is not to confine himself merely to the task of verifying the arithmetical accuracy of the balance-sheet, but to inquire into its substantial accuracy, and to ascertain that it contained the particulars specified in the articles of association (and consequently a proper income and expenditure account), and was properly drawn up, so as to contain a true and correct representation of the state of the company’s affairs. 70        In my view the facts inLeeds Estate Building and Investment Co. v Shepherdare very different from those in the present case.  First of all, the auditor did not even look at the articles of association which required that dividends be paid only from profits.  The balance sheets were prepared by the manager instead of the directors who in law were the persons responsible for the accounts.  The directors in theLeeds Estatecase had never exercised any judgment with reference to the accounts.  In the present case, the defendant was dealing directly with one director (Riggs) and relied on the involvement of the other director, Cullen, in terms of oversight and signing of the directors’ report. 71        The plaintiff citedDeputy Secretary v Das Gupta[1956] AIR 414for the proposition that an auditor is not entitled to simply rely on representations of management without independent verification.  That case involved an auditor facing disciplinary action over his failure to properly carry out balance-sheet audits of a bank.  Such audits are primarily confined to the verification of the existence of assets shown in the balance-sheet.  Specifically, cash-in-hand is required to be verified by counting cash in banks by reference to passbooks, letters of confirmation, securities by inspection and uncashed cheques by presenting them for payment.  The auditor did not perform such verification but relied on a certificate from management.  The court held that the fact that he stated in his audit report that he had not counted the cash did not absolve him from liability because he had failed to do what was his duty to do.  It was in this context that the court made the following statement that was cited to me by the defendant: The whole object of an audit is an examination of what the management have done and if the statements of the very persons who constitute the management were to be accepted in all matters, even in matters capable of direct verification, an audit would be an idle farce. That case involved specific actions required in a special form of audit and is quite different from the present one in which the salary of the director was one of many items to be audited and which did not require any special form of verification. 72        The plaintiff also cited the case ofPacific Acceptance Corporation Ltd v Forsyth(1970) 92 WN 29.  I need not go into the details of that case as I am satisfied that the facts of that case, involving gross acts of negligence, are very different from the one before me.  What is more germane is the plaintiff’s submission that in seeking verification of Riggs’ remuneration the defendant cannot rely on representations suggested or procured by Riggs himself, i.e. in obtaining Cullen’s signature on the Directors’ Reports and/or Statement by Directors.  The plaintiff asserted that it was wholly inappropriate for the defendant to direct its inquiry about Riggs’ proper entitlement to Riggs or Sandy and that it clearly should have contacted Cullen.  In my view, as the defendant did not have any reason to doubt Riggs or Sandy, it would be very onerous – and certainly one that is beyond the scope of the engagement - to impose such a requirement.  In any event the papers did get to Cullen to be signed.  I do not find anything unreasonable in the following statement made by Teo in cross-examination: …  in our profession we deal with the local directors.  Where there is no evidence to the contrary of dishonesty or fraud, we deal with them on that level and that we have written to the company … and therefore if … Cullen was sitting in Singapore, he would have seen the letter as well.  Our letter was addressed to the company.  And we sought the company’s collaboration … to get a confirmation, just like we would ask the company to send a letter of authority to the banks to release information to us.  We go through the company because we are auditing the company …  If we had known that there was evidence to the contrary, we would definitely go through directly to the other directors.  So there is no---absolutely no cause for us to think otherwise. 73        The plaintiff submitted that defendant’s argument, taken to its logical conclusion would mean that no auditor could ever be liable because in all cases the directors have to sign off on the Directors’ Report or the Statement of Directors before the audited financial statements are issued.  This argument is specious because the defendant did not seek in the present case to rely on the directors’ statements to confirm the entire audit, but only to confirm one aspect of it.  Indeed that was what Teo had meant in the following answer he gave in cross-examination that the plaintiff had cited in its submissions to support this point: Your Honour, if the audit was based on representation, then I think the auditor’s role is no more needed.  We just get a huge representation from the board of directors confirming every single balance sheet item. 74        The defendant’s expert witness, Singh, had given the following evidence in his affidavit evidence-in-chief: 4.10      An auditor does not have to and does not examine every single transaction of the audited financial statements especially when it is below the planning materiality precision or materiality criteria. An auditor wouldperform procedures only to the extent necessary, based on materiality and risk assessments, to achieve appropriate audit objectives in the most efficient manner. 4.11      In an audit, samples are used because it is cost prohibitive and time-consuming to perform a 100% audit of all transactions. Also, by performing audits on a representative sample, the auditing standards permit the auditor to draw comfort that the rest of the population is free of material misstatements. This is also why the standard audit report according to SSA 13 indicates that an audit includes examining,“on a test basis, evidence supporting the amounts and disclosures in the financial statements. This aspect of his evidence was not disputed by the plaintiff’s expert, Chin. 75        I accept the evidence of the defendant’s expert, Singh, that the defendant had conducted the three audits in question without breach of duty or negligence.  It was indeed unfortunate that the defendant did not seek more evidence to verify Riggs’ remuneration and other payments.  But in my view, this is different from saying that it had not met its duty under the contract or was negligent in the performance of the audits.  I find that the evidence before me does not support the plaintiff’s case against the defendant and I accordingly dismiss the action. 76        I will hear counsel on the question of costs."
    }
}