{
    "case_title": "Paillart Philippe Marcel Etienne and Another v Eban Stuart Ashley and Another",
    "ncitation": "[2006] SGHC 187",
    "coram": "Andrew Ang J",
    "sections": {
        "The defence": "39        The first defendant made five main points in his defence. First, he alleged that the first plaintiff had breached the Agreement in that he failed to secure a promised investment from an entity known as “Green SA” (“Green”). Second, he maintained that the defendants were entitled to remove the first plaintiff from the directorship of the second defendant because of “gross misconduct”, particularised in the Letter. Third, the first defendant contended that the first plaintiff’s acts of misconduct were a breach of s 157 of the Companies Act (Cap 50, 1994 Rev Ed) (“the Act”) – again warranting immediate dismissal. Fourth, the convening of the EGM was proper. Finally, the first defendant contended that the plaintiffs were not entitled to the equitable remedies sought as by his misconduct the first plaintiff had unclean hands and it would be inequitable to grant the remedies in those circumstances. 40        I will now consider each of the defences.",
        "Breach of the Agreement": "41        In his defence, the first defendant averred that the first plaintiff was in breach of cl 3 of the Agreement in that he failed to secure a promised investment from Green. I find that the first plaintiff did not breach the Agreement in allegedly failing to secure the promised investment by Green. Clause 3 of the Agreement states as follows: Investor: Once this agreement has been executed and all of the activities described in [cl 2] above have been completed, it is all parties intention to invite a company called Green SA, incorporated in Samoa, identified by Philippe as a willing and capable investor, to invest US$1.00 million in ESI. The terms and conditions of this investment shall be subject to a separate agreement between ESI and Green SA. 42        Upon a proper construction of cl 3 of the Agreement, it is clear that the parties merely contemplated inviting Green to invest in the second defendant. The clause merely stipulated the parties’ intention to invite Green to invest in the second defendant. Nowhere did it require the first plaintiff to ensure or procure Green’s investment. The terms of such investment were also left open subject to agreement. 43        It follows from the above that the defendants were not entitled to rely upon a breach of cl 3 of the Agreement to argue that the first plaintiff had repudiated the Agreement. Indeed, not every breach of a term of a contract entitles the innocent party to treat a contract as repudiated. 44Halsbury’s Laws of Englandvol 9 (Butterworths, 4th Ed, 1974) at para 547 states as follows: Not every refusal to perform a part of the contract amounts to a repudiation which entitles the other party to treat the contract as at an end; there must be a refusal to perform something which goes to the root or essence of the contract. 45        I should add that, even if the first plaintiff was bound to secure Green’s investment and that this breach of the Agreement amounted to a repudiation of the Agreement, the defendants did not accept such repudiation.Chitty on Contracts(Sweet & Maxwell, 29th Ed, 2004) vol 2 at para 37-213 states: The innocent party faced with a repudiatory breach can do one of two things: (i) affirm the contract in a clear way; or (ii) accept the repudiation by making it plain that by reason of the repudiatory act of the defaulting party, he considers that the contract is at an end. 46        At trial, counsel for the first defendant conceded that the defendants had not accepted the purported repudiation by the first plaintiff of the Agreement. Accordingly, even if the first plaintiff was in breach, the defendants could not treat the Agreement as at an end. Clause 5(b) therefore continued to have effect and the first plaintiff could not be removed on the ground that he had breached the Agreement. 47        On the basis of the contract alone, the plaintiffs would be entitled to the declaration and injunction sought, barring any reason making it inequitable to do so. Although the declaration is not an equitable remedy, it is discretionary in nature and equitable principles apply: seeZamir & Woolf([28]supra) at paras 4.028 and 4.029. The same can be said of an injunction, being an equitable remedy. Nevertheless, let me go on to the other defences.",
        "The first plaintiff’s alleged gross misconduct": "48        The first defendant alleged that the documents, the Resolution and the Power of Attorney executed in favour of Nicholas Paillart, the first plaintiff’s son, were fraudulent for the following reasons: (a)        Although the first plaintiff claimed that the Resolution comprised official minutes of a meeting of the board of directors of ESI, no ESI directors’ meeting had been convened or held on 6 May 2005 or at any other time adopting the resolutions contained therein. (b)        The first plaintiff admitted in writing that no such minutes ever existed. (c)        No ESI directors’ meeting had been held on 6 May 2005 or at any other time authorising the issue of a power of attorney to the first plaintiff’s son as “Manager/Negotiator of the company”. (d)        There was no documentary evidence corroborating the first plaintiff’s claim that the majority directors consented to these documents. (e)        ESI’s corporate secretary, David Yeung, was unaware of the existence of both documents as written and signed by the first plaintiff, and had never seen such documents or filed any such documents with the Accounting and Corporate Regulatory Authority. (f)         No other ESI directors signed the Resolution or Power of Attorney, nor was any signature line provided in either document for the first defendant or Geraghty’s signatures. (g)        The first plaintiff had both documents notarised and certified and then had his son, Nicholas Paillart, attempt to submit the Resolution to meet a banking requirement that required abona fidedirectors’ resolution of ESI. 49        I am of the view that the evidence does not support the first defendant’s case that the first plaintiff was guilty of the alleged gross misconduct. The first plaintiff’s testimony was that Geraghty was involved in the setting up of the FZE company in the UAE and the first plaintiff’s task was to sign the three documents, namely, the letter appointing Pannell Kerr Foster as ESI’s consultants to register ESI as a FZE company, the consent to the Resolution, and the Power of Attorney, and return them for the incorporation of the FZE company. 50        I accept the first plaintiff’s evidence that he honestly held the view that the first defendant’s and Geraghty’s signatures were needed before the Resolution could become valid. The Resolution merely stated that the first plaintiff had consented to the adoption of various resolutions. It is material that the first paragraph of the Resolution states that “[t]he undersigned being the directorof Earth Science Industries Pte Ltd … hereby consent to the adoption of the following resolutions” [emphasis added]. For the Resolution to be valid, the consent of the rest of the directors of ESI to the Resolution was required. 51        Although it is odd that the first plaintiff signed off as “President” in the Resolution, I accept the plaintiffs’ argument that if the first plaintiff had intended to hoodwink anyone, the first plaintiff would never have used the non-existent title of “President”. Indeed, whether he had used the title “President” or “Chairman” (which position he actually occupied) would have made no difference to the document. Had the first plaintiff drafted the Resolution, he would not have used a non-existent title since the use of his legitimate title as Chairman would not have affected the document in any manner whatsoever. 52        The resolutions which the first plaintiff consented to included, first, the registration of a FZE company in the SAIF Zone in the UAE; second, the provision of full financial commitment by ESI to the establishment of the FZE company; third, the appointment of the first plaintiff’s son, Nicholas Paillart, as the manager/negotiator of the company; and finally, the execution of the Power of Attorney in Nicholas Paillart’s favour. 53        The fact that the first plaintiff’s son was involved required that this court carefully scrutinise the transactions. The first defendant contended that the first plaintiff’s son, by virtue of the Power of Attorney, would then be able to control ESI’s bank account with Standard Chartered Bank in Dubai. The evidence, however, was that the bank account with Standard Chartered Bank in Dubai was never opened. Furthermore, neither the first plaintiff nor the first plaintiff’s son stood to gain from the transactions as the FZE company was to be wholly owned by the second defendant. This was not disputed by the second defendant. 54        The plaintiffs’ evidence was that Geraghty had previously identified the first plaintiff’s son as a possible source of help. This corresponded with the documentary evidence. As can be seen from the application form dated 4 May 2005, submitted by Geraghty, for a SAIF-Zone licence, it was Geraghty who had inserted the name of “Nicholas Philippe” as the manager of the proposed FZE company. In yet another application form submitted by ESI, this time for registration in the SAIF Zone as a FZE company, Geraghty had again inserted the name “Nicholas Philippe” in the column for the manager of the FZE company. The plaintiffs contend that if they were the ones who had inserted the names, they would have inserted “Nicholas Paillart” instead of “Nicholas Philippe”. 55        In my view, it is material that the opening paragraph of the Power of Attorney states as follows: BY THIS POWER OF ATTORNEY given this 6 day of May 2005,we the Directorsof Earth Science Industries Pte Ltd, HEREBY APPOINT Mr. Nicholas Paillart ... [emphasis added] The words “we the Directors” clearly indicate that the Power of Attorney was intended to be signed by more than one signatory. That being the case it was illogical to suggest that the first plaintiff attempted to pass off the document as valid when it carried only his signature. 56        The first defendant also alleged that the plaintiffs were guilty of trying to “steal” the intellectual property rights belonging to the second defendant because the second plaintiff had tried to pay the second defendant’s patent lawyers, M/s Lawrence YD Ho & Associates Pte Ltd (“M/s Lawrence Ho”), the fees for extending the patent to countries beyond Singapore. The second plaintiff’s cheque was rejected by M/s Lawrence Ho as they took the view that they were “unable to accept a cheque from Sin Rong Investment Pte Ltd for an ESI patent unless there is a Director’s [sic] Resolution from ESI to authorize it”. The first defendant argues that this was another example of the first plaintiff attempting to issue instructions unilaterally on behalf of the second defendant without a legitimate directors’ resolution. 57        The onus of proving the allegations of wrongdoing lies with the first defendant. The standard of proof when fraud is alleged was discussed by the Singapore Court of Appeal most recently inTang Yoke Kheng v Lek Benedict[2005] 3 SLR 263.Without going any further, it would suffice for the present purposes to say that the more serious the allegations, the more the party on whom the burden of proof fell had to do in order to establish his case on a balance of probabilities. Having considered the evidence and the submissions of counsel for the first defendant, I find on a balance of probabilities that the first defendant has not made out his case that the first plaintiff was guilty of the alleged gross misconduct. 58        In fact, I am of the view that the first defendant was the one who had acted dishonestly. 59        The first plaintiff’s stance is that the whereabouts of the machine, the second defendant’s only and most valuable asset, are unknown. As the parties who had financially supported the development of the machine from drawing board to reality, the plaintiffs have a legitimate interest in the whereabouts of the machine. During cross-examination, it emerged from the first defendant’s evidence that: (a)        some day in between 14 November and 21 November 2005, he had appointed Geraghty to be the guardian of the machine; (b)        this was despite the fact that Geraghty had resigned as a director of ESI on 12 September 2005; (c)        Geraghty had removed the machine from the warehouse (where it had been kept) on 13 September 2005; (d)        the machine had been sold to Oceanic Shiphandlers (“OS”), an entity which the first defendant admitted was “friendly”, for 41,210.50 dirhams on 11 September 2005 as part of “a deal … made between [Geraghty] and [OS]”;[note: 1] (e)        Geraghty was the first defendant’s ally “in ensuring that the machine would somehow return to [the first defendant] or to [Geraghty]”;[note: 2]and (f)         the first defendant had attempted to purchase the machine from OS by asking OS for a quote for the machine on 27 December 2005 on behalf of his own company, Kaitiaki Pte Ltd, a company of which he and his wife were the only shareholders and directors. 60        In the event, I am persuaded by the plaintiffs’ submission that the first defendant’s conduct was dishonest. Given my finding, it hardly lay in the first defendant’s mouth to complain about the first plaintiff’s misconduct. Even assuming that the first plaintiff did have improper or fraudulent motives (of which I find no evidence), proper steps had to be taken to remove him.",
        "Contravention of the Companies Act": "61        The third defence is that the first plaintiff’s acts of gross misconduct were in contravention of s 157 of the Act and warranted immediate dismissal. It would follow from my finding that no misconduct had been made out as alleged and that therefore there was no breach of s 157 of the Act. But for the sake of argument, even if there was gross misconduct and a breach of s 157 of the Act, proper steps had to be taken to remove the first plaintiff. This leads us to the first defendant’s next point which is that the EGM was properly called.",
        "Notice of EGM": "62        I accept that the purported director’s circular resolution resolving to convene an EGM for the purpose of removing the first plaintiff from the directorship was not sent to the first plaintiff at the material time. Despite Art 105 of the memorandum and articles of association of the second defendant allowing a resolution to be passed by a majority vote, at the least the proposed resolution had to be circulated to the first plaintiff. This was not done. In my view, the purported resolution was ineffective: seePolybuilding (S) Pte Ltd v Lim Heng Lee[2001] 3 SLR 184(“Polybuilding”). InPolybuilding, the court observed that although a majority decision of the board of directors prevails, a meeting of the majority without notice to the minority is ineffective. That being so, the notice of EGM was defective.",
        "Plaintiffs not entitled to equitable relief": "63        The final contention of the first defendant is that by reason of the first plaintiff’s misconduct as alleged, the first plaintiff ought to be denied the equitable relief prayed for. Given my finding that the first defendant had not proved on a balance of probabilities that the first plaintiff had committed gross misconduct as alleged, this final contention of the first defendant is inapplicable. I might add that from the evidence that emerged as to the first defendant’s conduct, it hardly lay in his mouth to complain about the first plaintiff’s misconduct. 64        In the premises, I grant the plaintiffs the relief prayed for,viz: (a)        a declaration that for as long as the second plaintiff holds at least 10% shares of the second defendant, the first plaintiff is entitled to be appointed a director of the second defendant; (b)        an order that the first defendant be restrained and a permanent injunction be granted restraining him from convening, holding or otherwise allowing to be held any EGM, directors’ meeting or any meeting whatsoever or doing any acts or things whatsoever that purport to or have the effect of removing the first plaintiff as a director of the second defendant or curtailing or diminishing his powers, rights or privileges as such director; (c)        damages to be assessed by the Registrar and interest thereon to be fixed by the Registrar; (d)        that there be liberty to apply in regard to prayer 12B(b); and (e)        costs to be taxed.   [note: 1](In line 25 of p 217 of the Notes of Evidence). [note: 2](In lines 28–31 of p 217 of the Notes of Evidence)."
    }
}