{
    "case_title": "Karaha Bodas Co LLC v Perusahaan Pertambangan Minyak dan Gas Bumi Negara",
    "ncitation": "[2006] SGHC 148",
    "coram": "Sundaresh Menon JC",
    "sections": {
        "Who may apply?": "19        Order 32 r 6 simply provides that the court may set aside an order madeex parte. It does not limit the court’s power by reference to the identity of the party seeking to set aside the order. This is not surprising if one has regard to the jurisprudential basis underlying this provision. In the case of the usual order of court, the interest of finality in litigation mandates that the only way in which such an order may be challenged is by an appeal. However the nature of anex parteorder is such that it is provisional in nature. It is true that this provisional nature derives from the fact that the court has moved upon hearing one party only. However, it does not follow from this that it is provisional only as against the party that has not been heard and is final as against the party who originally applied for the order. There is nothing in the case law to support such duality in the nature or character of such an order. Moreover, if this were the case, it would mean that an applicant who obtained an orderex partecould never himself set it aside. Since an order that is madeex partegenerally cannot be appealed against, it would mean in effect that as against the original applicant anex parteorder could be even more resilient than one obtainedinter partes. That seems untenable and, indeed, perverse. 20        Counsel could not find a great many authorities on the point. Perhaps the clearest articulation of the principles involved is to be found in the judgment of Sir John Donaldson MR in the English Court of Appeal inWEA Records Ltd v Visions Channel 4 Ltd[1983] 1 WLR 721(“WEA Ltd”). The appeal stemmed from an application for an Anton Piller order which had been soughtex parte. An application was brought by the defendants to discharge the order. The following passage from the judgment of the Master of the Rolls at 727 is instructive: Equally there is no doubt that the High Court has power to review and to discharge or vary any order which has been made ex parte. This jurisdiction is inherent in the provisional nature of any order made ex parte and is reflected in R.S.C., Ord. 32, r. 6. … As I have said, ex parte orders are essentially provisional in nature. They are made by the judge on the basis of evidence and submissions emanating from one side only. Despite the fact that the applicant is under a duty to make full disclosure of all relevant information in his possession, whether or not it assists his application, this is no basis for making a definitive order and every judge knows this. He expects at a later stage to be given an opportunity to review his provisional order in the light of evidence and argument adduced by the other side and, in so doing, he is not hearing an appeal from himself and in no way feels inhibited from discharging or varying his original order. This being the case it is difficult, if not impossible, to think of circumstances in which it would be proper to appeal to this court against an ex parte order without first giving the judge who made it or, if he was not available, another High Court judge an opportunity of reviewing it in the light of argument from the defendant and reaching a decision. [emphasis added] 21        It is true that the judgment refers to the matter being reconsidered in the light of what “the other side” says. Mr Chew relied on this to suggest that the court’s jurisdiction to set aside anex parteorder is therefore limited to when “the other side” applies. I think this is misplaced in the light of the express language of O 32 r 6 and what I have said at [19] above. In the great majority of cases, the party seeking to have the order set aside will be the party against whom the order has been made and in the minority of cases where the party who has obtained the order later wishes to apply to have it set aside, it must almost invariably be the case that the other party would not resist it. The present case is exceptional in that sense and in my judgment it is this which likely accounts for the dearth of cases on the point. 22        In the course of arguments, Mr Yeo advanced a simple but compelling hypothetical example in support of his position. He said that it would be absurd to hold that an applicant who had obtained anex parteorder but then later discovered he had done so on the basis of a misapprehension could not take steps himself to right the wrong. I agree it would be absurd to place so narrow a construction upon the broad terms used in O 32 r 6 and I decline the invitation to do so. 23        In my judgment therefore there is nothing to prevent the party who obtained anex parteorder from later bringing an application to set it aside.",
        "What may be considered?": "24        Mr Chew’s second argument was that if I had the jurisdiction to set aside the order upon the motion of the original applicant, it was only to be exercised on the basis of matters that were known or at least in existence at the time of the order. Put another way, Mr Chew’s argument was that I could not base my decision on matters that had transpired subsequent to the making of theex parteorder. The significance of this lay in the fact that the present application was brought by Mr Yeo on account of the course of the enforcement proceedings in the US after the date of theex parteorder. 25        Mr Chew relied on this briefdictumof Lord Denning MR inBecker v Noel[1971] 1 WLR 803: Not only may the court set aside an order made ex parte, but where leave is given ex parte it is always within the inherent jurisdiction of the court to revoke that leave if it feels that it gave its original leaveunder a misapprehension upon new matters being drawn to its attention.[emphasis added] 26        Mr Chew suggested that this meant that the new material must go towards showing that at the time the original order was made, it should not have been. I do not agree. Thedictumitself is contained in a short Practice Note which makes it impossible to arrive at any conclusion as to the limits of the principle that was enunciated there since it is not apparent what the facts before the court were. Further, there is nothing in thedictumthat necessarily limits it as suggested by Mr Chew. Moreover, for the reasons that follow, Mr Chew’s submission is not well-founded. 27        First, there is nothing in the language of O 32 r 6 which mandates such a conclusion. Secondly, if the order is provisional, then it seems to me it must be provisional in every way. The provisional character of anex parteorder cannot be artificially segmented so that it is treated as provisional as to matters up to the time of the making of the order but final as to matters subsequent thereto. Thirdly, I cannot see the sense in imposing an artificial limitation in the way suggested by Mr Chew. If the order is liable to be set aside or confirmed upon hearing both sides, then it seems most sensible that the court should be allowed access to all relevant matters in deciding what it should do at the time this is being consideredinter partes. 28        Finally, if Mr Chew were right on this, it would mean that even the party against whom the order was made could not rely upon matters subsequent to theex parteorder being made in order to have it set aside. This is utterly untenable. To apply it in the present context, it would mean that if the applicant after obtaining the originalex parteorder had got satisfaction of its award in another jurisdiction, then this could not be a basis for either party to apply to have it set aside. That is patently wrong. Nor does it make sense to then read in a further artificial limitation that this is only so if the application to set aside were brought by the party who obtained the originalex parteorder. 29        Although it is not exactly on all fours with the issues raised by Mr Chew’s argument, I think it is useful to recall the well-established principle that a court dealing with an application to set aside anex parteorder may have regard to facts and matters that were not known even by the party seeking the order at the time the original application was made. 30        Thus, inWEA Ltd, Dunn LJ noted that evidence obtained from the execution of an Anton Piller order that was madeex partecould be used to support the original grant. He stated at 728–729: Following the execution of theAnton Pillerorder, Messrs. Terence and Jeffrey Collins swore affidavits. The effect of Terence Collins’ affidavit was to admit that certain illicit goods, as defined in the order, were in their possession. It was said on behalf of the defendants that that evidence was irrelevant and inadmissible in any application to review the order either by way of an application to discharge it or by way of appeal, and that on such an application the court should confine itself to the evidence before the judge who made the order. I do not agree with that submission.Hallmark Cards Inc. v. Image Arts Ltd.[1977] 3 F.S.R.150, to which Sir John Donaldson M.R. has referred, shows that the court looks at the reality of the situation, including any evidence filed or statement made by counsel by way of admissions after the execution of theAnton Pillerorder. If consequent upon the grant of theAnton Pillerorder the evidence shows that the order was in fact justified, then the fact that the evidence before the judge was not as strong as it ultimately became does not in my view provide a ground for challenging the order itself. 31        The following passage fromSingapore Civil Procedure 2003(Sweet & Maxwell Asia, 2003) at para 32/6/7 also bears this out: The court is entitled to take into account facts and documents disclosed or discovered in compliance or in pursuance of the interim orders, even though the question of whether the order should have been made in the first place was being raised ... 32        The decision of the Court of Appeal inNikkomann Co Pte Ltd v Yulean Trading Pte Ltd[1992] 2 SLR 980(“Nikkomann”) is cited in support of the foregoing proposition inSingapore Civil Procedure 2003. InNikkomann,the Court of Appeal followedWEA Ltdand said as follows at 992, [50]: At this point, we ought to say that the learned judicial commissioner was also entitled to take into account facts and documents disclosed or discovered in compliance or in pursuance of the interim orders, particularly the clandestine sale … and the disposal of the proceeds of the sale,even though the question whether the order should have been made in the first place was being raised before him. [emphasis added] 33         These cases show that the court dealing with an application to set aside anex parteorder can even consider material that was unknown to the applicant for theex parteorder at the time it was made, and which was only obtained as a result of the execution of the very order which was the subject of the challenge. It would be illogical in my view to stop there and not permit the consideration of fresh material that might be directly relevant to either the continuance or the discharge of the order but which related to matters that transpired after the order was made. 34        Mr Chew drew my attention to the decision of the Privy Council inMinistry of Foreign Affairs, Trade and Industry v Vehicles and Supplies Ltd[1991] 1 WLR 550(“Vehicles and Supplies Ltd”). That was a case where the majority of the Court of Appeal of Jamaica held that anex parteorder could not be set aside in the absence of any new material being placed before the reviewing judge. 35        The matter then went on appeal to the Privy Council which allowed it. Lord Oliver of Aylmerton, who delivered the judgment of the Board, did not express any view as to whether the principle articulated by the majority in the Court of Appeal was correct. Instead, he relied upon the fact that there was new material before the first instance court when it set aside theex parteorder. Part of that new material was in respect of the supposed effects of theex parteorder: seeVehicles and Supplies Ltdat 555–556. Such effects must by definition have occurred subsequent to theex parteorder and this demonstrates in my view that it is permissible to have regard to matters that take place after the order that is being challenged was made. 36        It follows that, in my judgment, a court considering the exercise of its discretion in an application to set aside anex parteorder may have regard to all relevant matters including those that occur after the original order was made.",
        "How should the discretion be exercised in the present case?": "37        Mr Yeo submitted that if I had the jurisdiction to set aside theex parteorder in the present circumstances, then it was not a matter ofdiscretion. In effect he submitted that I had to set it aside. I am satisfied that this is incorrect. 38        I return to the express terms of O 32 r 6 which merely states that the court “may” set aside such an order. Furthermore, it seems to me that the approach to be taken and the principles to be applied by the court when dealing with an application to set aside anex parteorder will not as a general rule be different by reason only of the fact that the party moving to set aside the original order is the very party that obtained it. 39        I accept that there is a difference between cases where theex parteorder is challenged on the basis that it ought not to have been made (either at all or in the light of the facts or the evidence or the arguments that are subsequently brought to the attention of the court) and those where the order is sought to be set aside not because the order was unsound but because there is no longer a need for it. However, in my view, this is not a distinction that warrants a different rule as to whether or not the court has a discretion. Rather, it may be a relevant factor and perhaps, on occasion, even an overwhelming factor, to be taken into consideration in the exercise of the court’s discretion. 40        In the present case, I note that what underlies the applicant’s desire to set aside theex parteorder is its view that there is unlikely to be any necessity for enforcement proceedings to be pursued in Singapore. This view is founded on the course that the enforcement proceedings pursued in the US have taken. The respondent also wishes to have theex parteorder set aside but uponitsapplication. This is an important point because the respondent’s interest lies not in upholding theex parteorder but rather in having it set aside onitsterms. This brings me back to the point I noted at [9] above. The respondent’s real interest is to ensure that this court retains jurisdiction over the matter so that the respondent has an opportunity to vindicate itself here. Mr Chew submitted that it would be just to refuse Mr Yeo’s application so that the respondent could have the opportunity to show that theex parteorder was wrongly obtained. 41        Mr Chew submitted that the discretion of the court was ultimately to be exercised in the interests of justice. He relied upon the decision of the Court of Appeal in Malaysia inMajlis Peguam Malaysia v Raja Segaran a/l S Krishnan[2002] 3 MLJ 155(“Raja Segaran”). That was a case where the plaintiff brought an action seeking a number of declarations that were directed at an intended meeting of one of the defendants which was to have been convened in order to discuss certain allegations relating to the Malaysian judiciary. The plaintiff obtained an interlocutory injunction against the meeting proceeding. The matter then went to trial where at the close of the proceedings, judgment was reserved. Subsequently, the learned judge who heard the trial read out a statement to the parties indicating his view that they should come to an agreement and resolve their differences. This proved unsuccessful and the plaintiff then applied to discontinue the suit. This was opposed by the defendants. The learned judge permitted the discontinuance and the defendants then appealed successfully to the Court of Appeal. 42        The matter was dealt with on the basis of O 21 r 3(1) of the Rules of the High Court 1980 (PU(A) 50/1980) (M’sia) which provided as follows: Except as provided by rule 2, a party may not discontinue an action (whether begun by writ or otherwise) or counterclaim, or withdraw any particular claim made by him therein, without the leave of the Court, and the Court hearing an application for the grant of such leave may order the action or counterclaim to be discontinued, or any particular claim therein to be struck out, as against any or all of the parties against whom it is brought or made on such terms as to costs, the bringing of a subsequent action or otherwise as it thinks just. 43        This provision isinpari materiawith O 21 r 3 of our Rules of Court. Sri Ram JCA who delivered the judgment of the Court of Appeal made the following points at 161–162: (a)        The case highlighted the tension between the right of the initiator of an action to withdraw the process by which he had invoked the court’s discretion, and the right of a defendant to press his case forward to judgment especially where he considers himself to bedominus litis. (b)        The court has a wide discretion under the Malaysian equivalent of O 21 r 3 in resolving the tension between these interests. (c)        This is not an unprincipled discretion but is guided by the principles and guidelines that emerge from previous authorities. These suggest that discontinuance may be refused if: (i)         the defendant in fact controls the litigation; or (ii)        the case is at a very advanced stage; or (iii)       the plaintiff has gained some interlocutory or interim advantage prior to seeking discontinuance. 44        On the facts before it, the Court of Appeal noted that the action had been contested vigorously and the defendants had suffered much in the way of expense and trouble to test the plaintiff’s position. All that remained was for judgment to be rendered. However, these were not the factors considered by the learned judge at first instance in considering the application for leave to discontinue the proceedings. Rather, the learned judge had reached his decision on the basis of policy considerations that were not legally relevant. On this basis, the appeal was allowed. 45        Mr Yeo did not take issue with the decision itself or with the reasoning inRaja Segaran. Rather he made three short points. First, he submitted that that was a case concerned with O 21 r 3. He pointed out that that provision specifically sets out the sort of orders a court could make thereunder. In contrast, O 32 r 6 simply states that the court may set aside anex parteorder without more. I think Mr Yeo is correct to the extent he submits that the principles applicable to a discontinuance are not automatically to be imported into the regime that deals withex parteorders. Indeed the brevity of O 32 r 6 is to be seen in the context of the fact that much of the law onex parteorders and applications is judge-made and concerns the exercise of the court’s wide discretion in this area. It would not be appropriate, in my view, to impose limitations upon the exercise of such discretion simply by importing rules and principles articulated in a different context. 46        Mr Yeo next submitted thatRaja Segaranis an extreme case in that after the considerable exertions of both parties, all that remained was for the judgment to be delivered. He further submitted that it was extreme in the sense that the Court of Appeal considered that the defendant’s constitutional right to free speech on a matter of public interest was at issue in that case. IfRaja Segaranwere relevant to the exercise of the court’s discretion under O 32 r 6, I would agree that it does not assist the respondent in the case before me. Although this matter has been afoot for some years, for most of that time, upon a common understanding it has been put to one side. Moreover, although the hearing dates were imminent, there is a substantial amount of time and effort yet to be expended. 47        Mr Yeo’s third submission was that the case before me is one where there would be no injustice to the respondent if I were to make the order sought by the applicant. Both parties ultimately seek a similar end – namely to set aside theex parteorder albeit on different bases. Mr Yeo submitted that the basis upon which that order is set aside would in the final analysis have a bearing on costs. He submitted that as far as the applicant was concerned, they were entitled to apply for and obtain the original order but this was a contention the court should properly assess when making its order as to the costs of the proceedings. Again, I accept that this is correct. In my view, given that both parties wish to have theex parteorder set aside, the real significance of the basis upon which that is done is, if at all, in the way which the costs of the proceedings are to be dealt with. 48        In my judgment, no injustice or prejudice would be caused to either party by my setting aside theex parteorder, which could not adequately be compensated by an appropriate order as to the costs of the proceedings. I do not think it is material in the circumstances that the respondent wishes to preserve the jurisdiction of this court in order to get a finding at first instance on the issue of fraud. The International Arbitration Act (Cap 143A, 2002 Rev Ed) which incorporates the United Nations Commission on International Trade Law (UNCITRAL) Model Law on International Commercial Arbitration sets out the circumstances in which an award may be set aside or challenged in this court whether before or at the same time as an application for enforcement of that award. If, and to the extent, the respondent is able to initiate a separate action in Singapore to have the award set aside on the grounds of the fraud allegation, then it suffers no prejudice by the present order. If, on the other hand, it would not be able to found jurisdiction here for such a purpose absent a pending enforcement proceeding, then I do not consider that a party such as the applicant can be required to maintain an enforcement proceeding it has initiated solely to provide a jurisdictional basis for the respondent to have its challenge against the award determined here. 49        In the circumstances, I do set aside theex parteorder on the oral application made by Mr Yeo. It was contemplated during the hearing that if I reached this point, the question of the costs of the proceedings and of this application would be dealt with separately. I will accordingly hear the parties on these issues. 50        Finally, Mr Chew submitted that if I were to set aside theex parteorder it should be done on terms that the applicant could not subsequently commence a fresh set of proceedings, for instance, if it failed in the US. In effect, he contended that I should only exercise my discretion on terms that would be the equivalent of the respondent having succeeded on its application. 51        As to this, Mr Yeo submitted that it went to the effects of setting aside anex parteorder, and he argued that this should be left to a future occasion if and when a fresh set of proceedings were initiated. He contended that until that happened, this was an issue not ripe for determination. Alternatively, he submitted that this should be the subject of separate submissions to be made at the same time as those pertaining to costs. 52        As this last issue was not fully argued, I leave this also to be addressed together with the submissions on costs at a subsequent hearing before me."
    }
}