{
    "case_title": "Chin Tyng Lei v Lim Yoon Ngok",
    "ncitation": "[2006] SGHC 104",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "5          According to the plaintiff, the defendant was an old friend and his business partner. The defendant was a director of a company called Chalimax Engineering Pte Ltd (“Chalimax”) of which the plaintiff was a passive investor and also a director until his resignation on 1 October 2005. The day-to-day operations of Chalimax were managed by the defendant. The plaintiff ran a company called Allinton Engineering & Trading Pte Ltd (“Allinton”) incorporated on 29 April 1982, of which he was both a shareholder (with his wife) and a director. Since the incorporation of Chalimax (on 6 January 2001), Allinton had provided the company with support in the form of finance and business. 6          Between 2003 and 2004, the defendant approached the plaintiff for loans which the plaintiff extended. The friendly loans were interest-free and were repayable on demand. Loans totalling the claim were made to the defendant by the plaintiff between 15 August 2003 and 16 November 2004. 7          Despite repeated demands, the defendant failed to pay the claim, even though he had on 15 May 2005 furnished a breakdown of the claim to the plaintiff. 8          The defendant, on the other hand, asserted (both in his affidavits and in his defence) that the loans from the plaintiff were not made to him personally but were extended to Chalimax. The defendant identified six cheques drawn upon United Overseas Bank for sums totalling $115,000 which he said were cash cheques which proceeds were withdrawn and advanced to or paid for the salaries of workers, or were paid into the bank account of Chalimax. He disputed the balance of $145,000 in the claim. The defendant’s solicitors then served on the plaintiff’s solicitors a notice to produce all the cheques which made up the claim. 9          The defendant disputed the plaintiff’s assertion that it was the defendant who managed the operations of Chalimax exclusively, pointing out that prior to the plaintiff’s resignation as a director, the plaintiff would sign cheques, payment vouchers and salary computations jointly with the defendant. He pointed out that the plaintiff earned 10% commission for any orders Allinton placed with Chalimax. This was over and above the plaintiff’s half share of the profits made by Chalimax by virtue of being a 50% shareholder like the defendant. In 2002, the plaintiff earned a commission of about $200,000 based on the commission arrangement and in 2003, he earned about $300,000. The defendant claimed it was also in the plaintiff’s interest to keep Chalimax alive as the company provided engineering services to Allinton. 10        In response, the plaintiff (in his fourth affidavit filed 20 March 2006) exhibited e-mails exchanged between the parties, in particular on 23 March 2005, where the defendant requested the plaintiff to pay $2,500 for three sets of air-conditioners and office partitioning. In reply, the plaintiff said: PERSONALLY YOU STILL OWE ME TWO HUNDRED AND SIXTY THOUSAND, YOU CAN DEDUCT IT FROM YOUR LOAN. 11        The defendant’s reply stated: Pls. breakdown the figure, I think only about S$70,000/= The plaintiff e-mailed back to the defendant the same day as follows: Further to my e-mail to you dated 17 April 2005 regarding the amount owing to me. Please let me known [sic] when be able to let me have the money back? There was no reply from the defendant. 12        The defendant explained that his e-mail of 23 March 2005 was not an admission that he owed $70,000 to the plaintiff but to highlight the fact that a sum of $67,150 was owed by Chalimax to the plaintiff. The figure $67,150 appeared in the defendant’s subsequent e-mail to the plaintiff dated 15 May 2005 (see [14] below). The defendant claimed that the word “personally” in the plaintiff’s e-mail did not register in his mind. He did not take it to mean that he personally owed money to the plaintiff. If indeed he personally owed money to the plaintiff, the defendant pointed out that the plaintiff would or should have made him sign an IOU. 13        Subsequent to 23 March 2005, the plaintiff e-mailed the defendant on 17 April 2005 with a breakdown of the claim as requested in the defendant’se-mail of 23 March 2005. The plaintiff deposed that he had accidentally deleted from his computer his message of 17 April 2005 but was able to produce his draft of the same which showed that he gave a breakdown of the claim. 14        There can be no dispute that the plaintiff did send an e-mail to the defendant on 17 April 2005 in the terms of his draft dated 16 April 2005 as the defendant responded by e-mail on 15 May 2005 with his comments on each and every item in the plaintiff’s breakdown. According to the defendant’s comments, Chalimax had borrowed $67,100 from the plaintiff from years 2000 to 2004 for the running of the company and for its employees.",
        "The issue": "15        The only issue I had to determine was whether the loans comprised in the claim were extended by the plaintiff to the defendant personally, as the plaintiff contended, or they were made to Chalimax, as the defendant asserted.",
        "The decision": "16        After considering all the affidavits filed by the parties as well as the exhibits filed therewith, I formed the view that the defendant was liable to the plaintiff for $70,000 of the claim based on his own admission. 17        I was not persuaded by the argument of his counsel that the defendant’s e-mail of 23 March 2005 (see [11] above) did not amount to an admission. Neither did I accept the defendant’s claim that the word “personally” used by the plaintiff did not register in his mind. Judging from the defendant’s subsequent e-mail to the plaintiff dated 15 May 2005 (where he painstakingly went through each and every item in the plaintiff’s breakdown), it would have been out of character on the defendant’s part to have failed to notice the word “personally”. 18        The defendant’s explanation in [12] above was also not convincing for two other reasons: (a)When he admitted to owing $70,000, there was no reference yet to Chalimax owing $67,100 to the plaintiff. That reference was made almost a month and a half later. (b)He did not reply to the plaintiff’s reminder for payment (see [11] above). If indeed the claim was owed by Chalimax, a natural and reasonable response would have been for the defendant to so inform the plaintiff. 19        Counsel for the defendant then suggested that the defendant’s e-mail showing the date of 15 May 2005 did not mean that it was sent out that day, only that the defendant prepared it that day. That argument was disingenuous – the defendant specifically referred therein to the plaintiff’s e-mail of 17 April 2005 containing the breakdown of the claim. Even if the defendant’s e-mail dated 15 May 2005 was not sent out that day, the undisputed fact remained that it was sent outafter23 March 2005. 20        The principles governing unconditional leave to defend are well established and need not be rehashed here. The principles for granting conditional leave to defend are equally well established: if there is no defence or no triable issues, then the plaintiff must be awarded final judgment. In my assessment, the defendant had no defence whatsoever with regard to the sum of $70,000 which formed part of the claim. 21        As for the balance of $190,000, the defendant may well have channelled the moneys into Chalimax. However, that did not necessarily mean that the loans were extended to the company. It is significant in this context to note that the defendant had himself admitted that Allinton had lent substantial sums of money to Chalimax. If the plaintiff’s company was in the habit of making loans to Chalimax, why would the plaintiff himself extend loans personally to Chalimax? It was more than likely that the balance of $190,000 was lent to the defendant personally. 22        A commentary on O 14 r 4 of the Rules inSingapore Civil Procedure 2003(Sweet & Maxwell Asia, 2003) at para 14/4/12 (p 157) states: A condition of paying some or all of the money or damages claimed into court, or giving security, is imposed where there is good ground in the evidence for believing that the defence set up is a sham defence or the master “is prepared very nearly to give judgment for the plaintiff” (Wing v. Thurlow(1893) 10 T.L.R. 53). 23        The following commentary appears at p 158 of the same book on the same Order and rule: When granting conditional leave to defend, the court is required to consider all the circumstances, which include the financial circumstances of the defendant, and for practical purposes, should not impose a condition,e.g. the payment into court of such a sum of money as would make fulfilment of the condition impossible and that impossibility was known or should have been known to the court by reason of the evidence placed before it; and therefore it would be a wrong exercise of discretion to grant the defendant leave to defend on condition that he should pay into court a sum which he would never be able to pay, for that would be tantamount to giving judgment for the plaintiff, notwithstanding the court’s opinion that there was an issue or [a] question in dispute which ought to be tried … (M.V. Yorke Motors (a firm) v. Edwards[1982] 1 W.L.R. 444; [1982] 1 All E.R. 1024 HL). 24        The defendant had filed an affidavit on the morning of the hearing deposing that he owned no other assets apart from a Housing and Development Board flat, which was mortgaged for a 30-year period and which had an outstanding loan of $200,000. He had $1,800 in his bank account and would only be able to come up with $20,000 (by borrowings) should the court order conditional leave to defend on the appeal. He was married with a homemaker wife and two teenaged daughters. Judgment against him would cause him to go into bankruptcy and wreck him and his family financially. 25        The factors set out in the above paragraph were taken into consideration when I ordered the defendant to provide security in the amount of $10,000 as a condition of his being granted leave to defend the balance ($190,000) of the claim. The security ordered was only half of the $20,000 which figure the defendant had said he would be able to raise, and was not even 10% of the balance claim. Yet, the defendant has chosen to appeal against my order."
    }
}