{
    "case_title": "S & E Tech Pte Ltd v Western Electric Pacific Ltd and Another",
    "ncitation": "[2006] SGHC 10",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1          There are five actions between S & E Tech Pte Ltd (“S&E”) on the one hand and Western Electric Pacific Limited and/or Western Electric Asia Pte Ltd on the other hand. I will refer to both these Western Electric companies as “the Western Electric companies”. The five actions were consolidated in order that they could be heard together. 2          Before the trial of the actions, M/s Rajah & Tann, the solicitors for the Western Electric companies, served on M/s Drew & Napier, the solicitors for S&E, an offer to settle all the actions on the basis of payment by S&E of a certain sum expressed in Singapore currency (“the OTS”). The OTS was served on 19 December 2005. 3          In the evening of 20 December 2005, the principal officer in charge of liaising with the solicitors of the Western Electric companies, Lim Su-Lynn, realised that the OTS contained an error as the sum stated therein should have been expressed in US currency. The error had been caused by an erroneous e-mail she had sent earlier to Rajah & Tann to instruct them to make the OTS. Upon realising the error, Ms Lim immediately contacted Rajah & Tann to inform them of the mistake. They in turn informed Drew & Napier, on the same day, by fax and by post as well as orally over the telephone, about the error and that they would be applying to withdraw the OTS. The application to withdraw the OTS was filed that same evening of 20 December 2005. 4          However, on 21 December 2005, Drew & Napier sent Rajah & Tann a letter together with an Acceptance of Offer to accept the OTS. 5          The application to withdraw the OTS was heard on 23 December 2005 before an assistant registrar who allowed the application. S&E appealed against that decision. After hearing arguments, I dismissed the appeal for the reasons stated below.",
        "Reasons": "6          In the light of certain developments by the time of the hearing of the appeal before me, Mr Kelvin Tan, counsel for S&E, was no longer taking the position that there was no good reason to allow the withdrawal of the OTS. However, he maintained that the court had no power to allow the withdrawal of the OTS in the circumstances under O 22A r 3 of the Rules of Court (Cap 322, R 5, 2004 Rev Ed). The relevant provisions are O 22A rr 3(1) and 3(2) which state: 3.—(1) An offer to settle shall be open for acceptance for a period of not less than 14 days after it is served. If an offer to settle is made less than 14 days before the hearing of the matter, it shall remain open for a period of not less than 14 days unless in the meanwhile the matter is disposed of. (2)        Subject to paragraph (1), an offer to settle which is expressed to be limited as to the time within which it is open for acceptance shall not be withdrawn within that time without the leave of the Court. An offer to settle which does not specify a time for acceptance may be withdrawn at any time after expiry of 14 days from the date of service of the offer on the other party provided that at least one day’s prior notice of the intention to withdraw the offer is given. 7          The OTS had specified that it was open for acceptance for a period of 14 days. Mr Tan submitted that as a time limit for acceptance was specified, the opening words in r 3(2), “Subject to paragraph (1)” (“the Qualification”), meant that the court could grant leave to withdraw only after the expiry of 14 days. This meant that if the time limit for acceptance had been specified, for example, to be 28 days after service, the offeror could not be granted leave to withdraw the offer for the first 14 days but could be granted leave to withdraw during the next 14 days. As the OTS had a time frame of 14 days for acceptance, Mr Tan’s submission meant that the court could not grant leave for withdrawal of the OTS within that time frame and the OTS would be deemed to have been withdrawn on the expiry of the 14 days under O 22A r 3(4). 8          Mr Tan submitted that the Qualification was not meant merely to affirm the minimum period for which an offer to settle must remain open for acceptance as that minimum period was already specified in r 3(1). He submitted that such an interpretation would render the Qualification otiose. Mr Tan also submitted that the second limb of r 3(2), which deals with the situation where an offer to settle does not specify a time for acceptance, supported his position since it referred only to a withdrawal of such an offer after the expiry of 14 days of service of the offer. As regards any inherent jurisdiction of the court to avoid any injustice, Mr Tan submitted that such a jurisdiction must be exercised within the perimeters of the Rules of Court. 9          Mr Lee Eng Beng, counsel for the Western Electric companies, submitted that the Qualification is to make it clear that where a time frame for acceptance was stipulated in an offer to settle, the time frame must be at least for 14 days. While r 3(1) prescribes a 14-day minimum period (“the minimum period”) for acceptance, r 3(2) prescribes the circumstances allowing for withdrawal of an offer to settle. The Qualification makes it clear that r 3(2) does not detract from the minimum period. Mr Lee also submitted that the second limb of r 3(2) is consistent with his position. Furthermore, policy considerations suggest that the court should have the power to grant leave to withdraw to cater for situations like the one that arose. Mr Lee also pointed out that under O 22, which deals with payments into court, there is no minimum period before an order for withdrawal can be made. 10        I was of the view that O 22A r 3(1) does not envisage the withdrawal of an offer to settle within the minimum period and that the court has no power under r 3(2) to allow such a withdrawal. Let me elaborate. 11        Rule 3(1) states that an offer to settle shall be open for acceptance for not less than 14 days after it is served. There is no distinction in this paragraph between an offer to settle which expresses a time frame within which it is open for acceptance and one where no time frame for acceptance is expressly stated. 12        Rule 3(2) draws a distinction between the two types of offers to settle. Where a time frame for acceptance is expressed in the offer, the first limb applies. Where no time frame for acceptance is expressly stated in the offer, the second limb applies. 13        The first limb has the Qualification. Is this merely an affirmation of what is already stated in r 3(1)? I was of the view that if this were so, the Qualification would be redundant. As Mr Lee had submitted, r 3(2) prescribes the circumstances for withdrawal of an offer to settle and r 3(1) prescribes the minimum period which an offer to settle is to remain open for acceptance. Therefore, in my view, the Qualification determines when an offer to settle can be withdrawn. It is not to affirm that a stated time frame in an offer must be at least for the minimum period. Thus, for example, if an offer to settle expresses 28 days as the time within which the offer is open for acceptance, the court may grant leave to withdraw the offer after the minimum period but not before. 14        I was reinforced in this view by the second limb of r 3(2). It relates to the withdrawal of an offer to settle, where no time for acceptance is expressed therein, after 14 days only. There is no provision for the withdrawal of such an offer before the minimum period. Is this an inadvertent oversight? Having regard to the minimum period in r 3(1) and the Qualification in the first limb of r 3(2), I do not think so. There is no such provision for withdrawal in the second limb because such an offer cannot be withdrawn within the minimum period. 15        Mr Lee’s reference to O 22 did not help his submission because O 22 does not have any minimum period. Whether O 22A should be amended to make it consistent with O 22 orvice versais another matter. 16        Accordingly, I was of the view that the court has no power under r 3(2) to allow the withdrawal of an offer to settle before the expiry of the minimum period, whether or not the offer to settle expresses a time limit for acceptance. 17        As for Mr Lee’s submission that the court should have power to remedy the situation, I was of the view, for reasons which I shall elaborate, that my conclusion on the interpretation of rr 3(1) and (2) does not necessarily mean that the court is powerless to act. Accordingly, I asked counsel whether such a conclusion would necessarily mean that S&E’s acceptance of the OTS was valid. 18        Mr Tan did not dispute that where there was a unilateral mistake, like the present, which was known to the offeree prior to acceptance, the common law doctrine of mistake would deny any validity to the acceptance or the settlement which might have resulted from it. However, Mr Tan submitted that such a doctrine must be subject to the Rules of Court which have, by rr 3(1) and 3(2), supplanted the doctrine. He argued that the draftsman of such rules had addressed the situation as there was provision for the withdrawal of an offer to settle. 19        If the intention was to exclude the doctrine of mistake from offers to settle, I would have expected clear words to that effect. I add that Mr Lee had referred to cases in Canada such asDraper v Sisson1991 ACWSJ 483881 andAlberta Ltd v Royal Trust Corp of Canada1995 ACWSJ 635263 in which the court applied the doctrine of mistake to the Canadian equivalent of the Singapore rules on offers to settle. True, there is no minimum period in their jurisdiction for which an offer to settle is to remain open but, in my view, that does not affect the persuasive weight of those authorities. There is nothing in O 22A that suggests that an offer made by mistake, which mistake is made known to the offeree, may still be accepted by the offeree. In my view, the draftsman of rr 3(1) and 3(2) had not envisaged the situation which has arisen in the present case. I add that there is no provision in O 22A to allow an application to be made to amend an offer to settle. 20        Indeed, Mr Lee had suggested, without dispute from Mr Tan, that there was no provision in the Rules of Court to allow an application to be made to amend an offer to settle. I had thought that Mr Lee was right but I have since considered another provision, O 20 r 8, afresh and it seems to me arguable whether that provision is wide enough for that purpose. Having said that, I will also say that I believe that O 20 r 8 has not been used so far to apply to amend an offer to settle. 21        In any event, whether an application to amend an offer to settle may be made under O 20 r 8 or not, I was of the view that O 22A rr 3(1) and 3(2) do not exclude the doctrine of mistake and there was no need to resort to the court’s inherent jurisdiction. In the circumstances I declared that there was no valid settlement arising from S&E’s acceptance of the OTS. As this was the crux of the appeal, although the original application related to the withdrawal of the OTS, I dismissed the appeal."
    }
}