{
    "case_title": "Sunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric (practising under the name and style of W P Architects)",
    "ncitation": "[2006] SGHC 222",
    "coram": "Andrew Phang Boon Leong J",
    "sections": {
        "Introduction": "133I had earlier found that the defendant had not only breached hiscontractualduties owed to the plaintiff under the Deed but hadalsobreached histortious duties (in negligence)that he had also owed to the plaintiff. Having just established that the defendant could not avoid liability under the Limitation Act, I come now to the quantum of damages awardable to the plaintiff for the defendant’s breach of the aforementioned duties. 134  As a key legal concept figures prominently – and repeatedly – in the analysis that follows, it would be appropriate to consider it at this preliminary (albeit important) juncture. This concept is that ofremoteness of damage. Indeed, an extremely important issue arises even before this concept can be applied to the facts at hand. And it is whether or not thecontractual or tortious principlesrelating to remoteness of damage apply. They are not the same. 135  In so far ascontractualprinciples of remoteness are concerned, the seminal decision is, of course, the English Court of Exchequer decision inHadley v Baxendale(1854) 9 Exch 341. I have summarised the general position in the Singapore context in the Singapore High Court decision ofCHS CPO GmbH v Vikas Goel[2005] 3 SLR 202, as follows (at [81]–[86]): 81     It is established law that remoteness of damage under contract law comprises two limbs – first, damage flowing “naturally” from the breach of contract and, secondly, “unusual” damage which (by its very definition) does not flow naturally from the breach of contract but, rather, is due to special circumstances. These two limbs are in fact to be found in the seminal decision of the (English) Court of Exchequer inHadley v Baxendale([63]supra), as helpfully elaborated upon in the English Court of Appeal decision ofVictoria Laundry (Windsor) Ld v Newman Industries Ld[1949] 2 KB 528.Indeed, in the latter decision, Asquith LJ (who delivered the judgment of the court) perceptively and helpfully distinguished betweentwo kindsof knowledge that must be brought home to the defendant in order that the damage might not be considered to be too remote. 82     The first isimputedknowledge. Knowledge is imputed when it is the kind or type of knowledge that everyone, as reasonable people, must be taken to know. Everyone must, as reasonable people, be taken to know of damage which flows “naturally” from a breach of contract. In other words, this category of (imputed) knowledge is linked to thefirstlimb referred to in [81] above. What is of vital legal significance is that in so far as such “natural” or “ordinary” damage is concerned, there isno needfor the plaintiff to proveactualknowledge on the part of the defendant: the defendant (in this particular case, the plaintiffs) must betaken to know(under the concept of imputed knowledge) that such damage wouldordinarilyensue as a result of the breach of contract concerned. 83     The second type of knowledge isactualknowledge. Not surprisingly, this particular category of knowledge relates to thesecondlimb referred to in [81] above. It concerns “special” or “non-natural” damage that results from a breach of contract. A relatively more stringent criterion of knowledge is here required in order that the damage will not be found to be too remote in law. Put simply, the defendant must have hadactualknowledge of the special circumstances which are outside the usual course of things. These circumstances must be such that, in the event of a breach of contract occurring, loss or damage goingbeyondwhat would ordinarily result under the first limb (referred to in [81], above, and which,ex hypothesi, are within the usual course of things) would ensue. In fairness to the defendant, in order for him or her to be fixed with liability for such “special” or “non-natural” damage, he or she must have hadactualknowledge of the aforementioned special circumstances. In order for such actual knowledge to be brought home, as it were, to the defendant, an objective test is utilised. In the words of Robert Goff J (as he then was) in the English High Court decision ofSatef-Huttenes Albertus SpA v Paloma Tercera Shipping Co SA (The Pegase)[1981] 1 Lloyd’s Rep 175 at 183: [T]he test appears to be: have the facts in question come to the defendant’s knowledge in such circumstances thata reasonable person in the shoes of the defendantwould, if he had considered the matter at the time of the making of the contract, have contemplated that, in the event of a breach by him, such facts were to be taken into account when considering his responsibility for loss suffered by the plaintiff as a result of such breach. The answer to that question may vary from case to case … [emphasis added] 84     The following observations by Lai Kew Chai J in the Singapore High Court decision ofTeck Tai Hardware (S) Pte Ltd v Corten Furniture Pte Ltd[1998] 2 SLR 244at [17] might also be usefully noted: The second rule [ie, the second limb inHadley v Baxendale, as to which see [81] above] caters for the situation where the contract breaker knows or ought in certain circumstances to have known more than what every reasonable man is presumed to know. If his contracting party tells him something outside the ordinary course of things before or at the time the contract is made, the second rule would apply. 85     That the abovementioned principles are part of Singapore law can be seen, for example, from a local decision decided as far back as 1880: seeYeo Leng Tow & Co v Rautenberg, Schmidt & Co(1880) 1 Ky 491. There are of course more recent decisions, including the Singapore Court of Appeal decisions ofHong Fok Realty Pte Ltd v Bima Investment Pte Ltd[1993] 1 SLR 73andCity Securities Pte Ltd v Associated Management Services Pte Ltd[1996] 1 SLR 727. 86     English law is the foundation of Singapore law (see, in particular, and in this regard, the Application of English Law Act (Cap 7A, 1994 Rev Ed), especially s 3). It is no surprise, therefore, that the English position with regard to remoteness of damage is well established in the Singapore context. [emphasis in original] These principles were in fact recently endorsed in the Singapore Court of Appeal decision ofJet Holding Ltd v Cooper Cameron (Singapore) Pte Ltd[2006] 3 SLR 769at [106]. 136  There is in fact some New Zealand authority which questionsHadley v Baxendale, but it is clear that the principles enunciated inHadley v Baxendalecontinue to be good law in the Singapore context (not least because of its endorsement by numerous Singapore cases as seen in the quotation in the preceding paragraph). As I observed inCHS CPO GmbH v Vikas Goel([135]supraat [87]): It might be noted in passing at this juncture, however, that there is a New Zealand Court of Appeal decision that actuallyquestionsthe viability ofHadley v Baxendaleitself: seeMcElroy Milne v Commercial Electronics Ltd[1993] 1 NZLR 39(“McElroy Milne”). Nevertheless, the situation in so far as Singapore is concerned is, as we have seen, too well established in so far as the adoption of the rule inHadley v Baxendaleis concerned.In any event,McElroy Milnehas not in fact found favour in New Zealand itself: see, for example, Rex Ahdar, “Remoteness, ‘Ritual Incantation’ and the Future ofHadley v Baxendale: Reflections from New Zealand” (1994) 7 JCL 53 as well as Stephen Todd, “Remedies for breach of contract” in ch 21 of John Burrows, Jeremy Finn & Stephen Todd,Law of Contract in New Zealand – A Successor to Cheshire & Fifoot’s Law of Contract, 8th New Zealand Edition(LexisNexis, 2nd Ed, 2002) at pp 767–768. The very relevant call to legal autochthony (which has its source in the rich scholarship of the late Prof G W Bartholomew) is nevertheless not a call to departure from the received English law merely for its own sake. Indeed, this is one such situation where departure is not, in my view, justified. [emphasis in original] See also the Singapore Court of Appeal decision ofJet Holding Ltd v Cooper Cameron (Singapore) Pte Ltd([135]supraat [106]). 137  In so far as thetortiousprinciples of remoteness are concerned, these were stated inCHS CPO GmbH v Vikas Goel([135]supraat [61]), as follows: 61     Secondly, there is, as already alluded to above, thetortiousconcept of remoteness of damage (which centres on the principle of reasonable foreseeability, the most oft-cited authority being that of the Privy Council decision ofOverseas Tankship (UK) Ltd v Morts Dock & Engineering Co Ltd (The Wagon Mound)[1961] AC 388). [emphasis in original] 138It is clear that,ceteris paribus, thetortiousprinciples of remoteness arebroaderthan the correspondingcontractualprinciples. Indeed, it would conduce towards more clarity if the phrase “reasonableforeseeablity” was utilised to describe thetortiousprinciples of remoteness, and the phrase “reasonablecontemplation” was utilised to describe thecontractualprinciples of remoteness. Put simply, the tortious principles of remoteness are broader and more “generous” simply because, apart from situations where there isconcurrentliability in both tort and contract, a situation involving tortious liability would relate to parties who have hadno prior relationship with each other. This is, of course, instark contrastto a situation involvingcontractualliability where there would,ex hypothesi, be an existing (contractual) relationship between the parties. In such a situation, the parties would be expected to provide for any reasonable contingencies that might be expected to arise. In any event, it would be easier toinferwhat the parties might have provided even if no express term covered the contingency concerned (for example, a term could possibly beimpliedeither “in fact” or “in law”). It is only logical and commonsensical, therefore, thatstricterrules and principles of remoteness obtain in the contractual – as opposed to the tortious – sphere. 139  What, then, ought to be the situation in the context of a situation such as that which obtained in the present proceedings, where there wasconcurrentliability in both contract (under the terms of the Deed) as well as in tort (for negligence for pure economic loss)? Mr Lai cited fromClerk & Lindsell on Torts(Sweet & Maxwell, 19th Ed, 2006) at para 2-145, arguing that, in such a situation, the strictercontractualrules and principles ought to apply. 140  Quite apart from the authority of an established textbook, it is clear, in my view, that this ought to be the legal position based on principle, logic and commonsense. Where there is concurrent liability in both contract and tort,andgiven (as we have noted above) the fact that the rules and principles in respect of remoteness of damage are stricter in the contractual sphere as opposed to the tortious sphere, it would follow that the successful claimant (whether it be the plaintiff in the main claim or the defendant in a successful counterclaim) ought not to be better off in tort than it would be in contract. To this end, where, therefore, there is concurrent liability in both contract and tort, the stricter rules and principles of remoteness in contract ought to prevail. 141  In the present proceedings, therefore, the contractual rules and principles of remoteness first laid down in the seminal decision ofHadley v Baxendale([135]supra) ought to apply. With this in mind, I now turn to apply these rules and principles to the various heads of damage in the present proceedings.",
        "The claim under the Deed": "",
        "Background, arguments and testimony": "14The issue with regard to this particular head of claim was straightforward inasmuch as it centred, in the final analysis, on the interpretation of the terms of the Deed itself. There was no allegation on the part of the defendant that he had signed the Deed under duress or undue influence or any other vitiating factor. The liability (if any) of the defendant is therefore to be determined based on the meaning to be given to the relevant parts of the Deed itself. To this end, the testimony of the main witnesses – in the main, from one of the directors of the plaintiff, one Madam Koh Hwee Kheng (“Madam Koh”), as well as from the defendant himself – was, in this particular respect at least, not crucial and was, at best, marginal. What is ultimately at issue is anobjectiveinterpretation of the language of the Deed itself,regardlessof the subjective allegations of the parties – save where such allegations are in fact helpful in assisting the court in ascertaining theobjectiveintention of the parties to the Deed itself. However, one thing was clear in so far as the testimony of these two principal witnesses was concerned: Madam Koh was, by far, the more truthful witness. However, her evidence was marred by two closely related factors. The first was her evident nervousness which was the result, in part, of being in the witness box itself and, in part, of her evident anxiety not to state anything that might jeopardise the plaintiff’s chances of succeeding in the present proceedings. For instance, the following apprehension expressed by Madam Koh at a fairly early stage of the proceedings is telling:[note: 1]  Witness [Madam Koh]:Your Honour, I was cheated. Your Honour, I’m so scared that I will lose the case. I was already cheated, I do not want just to say “yes, yes, yes” to everything. So if I everything say “yes” I might just lose the case like that.Court:Okay.(Witness breaks down)Q [Counsel for the defendant]:I’m sorry, Mdm Koh, if I agitated you in any way. I’ll try to be nice to her. 15     Although Madam Koh sought her level best to answer the questions put to her by counsel, for the most part, her resultant testimony came through with a staccato-like effect for the reasons stated in the preceding paragraph. 16     Secondly, Madam Koh’s testimony was also coloured by what she perceived to be a grave injustice visited on her, her husband and the plaintiff company by the main contractor. Her anger towards the main contractor and, consequently, the defendant did, in my view, cast a partial shadow over her testimony. This factor is particularly crucial when I come to consider a specific issue, the decision of which turned on her relationship with (and, more importantly, attitude towards) themain contractor(see [166] below). 17     In contrast, the defendant was evasive in the witness box. He was determined to say as little as possible. This is understandable because he, too, felt aggrieved that the plaintiff had brought the present claim against him. But that was the plaintiff’s prerogative, particularly in the light of the Deed that he (the defendant) had signed. As already mentioned, the defendant at no point challenged the validity of the Deed. Hence, the key issues with respect to this particular document centred, in the final analysis, onits scope and content. The arguments by both parties in this last-mentioned regard were straightforward. However, before proceeding to set out these arguments, it would be apposite to set out the terms of the Deed itself. 18     The Deed itself was both short and simple, and reads as follows: DEED OF INDEMNITY THIS DEEDis made on 21st day of October 1996BETWEEN:- (1)SUNNY METAL & ENGINEERING PTE LTD,a company whose registered office is situated at 50 Senoko Road Singapore 785115 (hereinafter called “the Employer”) of the one part; and (2)WP ARCHITECTS,practising as consulting architects whose registered office is at Blk 1 #340/D Balestier Hill Shopping Centre Thomson Road Singapore 300001 (hereinafter called –“the Consultants”) of the other part. WHEREAS : - (A)   The Employer intends to construct and complete a factory (hereinafter called “the Project”) as described and specified in the Agreement dated the 21st day of October 1996 between the Employer and PIERRE MARC CORPORATION PTE LTD (hereinafter called “the Contractor”). (B)   The Contractor is desirous of appointing the Consultants provide professional architectural/engineering services in connection with the Project. Now in consideration of the/premises and of the Employer giving consent to the Contractor to engage the Consultants/at the request of the Contractor and Consultants, the Consultants agree with the Employer as follows:- 1.      The Consultants warrant that they shall exercise reasonable skill, care and diligence in the performance of their duties to the Contractor and/or the Employer. 2.      The Consultants acknowledge that the Employer has no liability to the Consultants in respect of fees and expenses under the contract of appointment between the Consultants and the Contractor. 3.      The copyright in all drawings, reports, specifications, calculations and other similar documents provided by the Consultants in connection with the Project shall remain vested with the Employer but the Consultants and their appointee shall have a licence to copy and use such drawings and other documents and to reproduce the designs contained in them for any purpose related to the Project. 4.      The Consultants shall indemnify and keep indemnified the Employer from and against all claims, demands, proceedings, damages, costs, charges and expenses arising out of or in connection with any breach of duty, whether in contract, in tort or otherwise. IN WITNESS WHEREOFthe common seals of the parties were hereto affixed the day and year first before written The Common Seal of                                                                 )SUNNY METAL & ENGINEERING)PTE LTDwas hereunto affixed in                                              )[Seal of the plaintiff]the presence of :-                                                                        ) [Signature] ……………….                  Director  [Signature] ……………….                  Director/Secretary SIGNED SEALED AND DELIVERED by                               ) [Seal affixed by the defendant] For and on behalf ofWP ARCHITECTS)in the presence of :- [signature of the defendant and date (22 October 1996)] 19     Turning to the arguments of the respective parties, counsel for the plaintiff, Ms Monica Neo, argued that, pursuant to the terms of the Deed, the defendant owed the plaintiff legal duties in both contract as well as in tort. She further argued that these duties included the duty to supervise the main contractor’s (PMC’s) works and to ensure that the main contractor carried out its work in accordance with the terms of the “design and build contract”. She also argued that the defendant was under a duty to administer the “design and build contract” properly and that he was under a duty to comply with all the relevant codes, practices as well as statutes and regulations. Finally, she argued that the defendant was under a statutory duty to submit, within 14 days of his ceasing to carry out his duties under the Building Control Act (Cap 29, 1999 Rev Ed), the requisite Certificate of Supervision. In a nutshell, Ms Neo argued that the defendant had failed, refused and/or neglected to carry out these various duties and that the plaintiff had suffered loss as a result. There had also been a claim for the loss of value of a “30 + 30 year” lease. However, this particular claim was abandoned during the course of the trial. In this regard, I must observe that the plaintiff abandoned this claim as soon as it realised what the true facts were and ought not to be penalised for what was, in the final analysis, a reasonable course of action (whether in respect of costs or otherwise). 20     In so far as the alleged breach of contract pursuant to the terms of the Deed was concerned, Ms Neo relied, specifically, on an alleged breach of cll 1 and 4 of the Deed, both of which have been reproduced above (at [18]). She had appeared, initially at least, to run the plaintiff’s claim in this particular regard by reading both clauses as operating in tandem. On further inquiry by this court, however, she stated that she was also arguing that each of these clauses could be relied upon as creatingindependentlegal duties. A close perusal of the precise language of the relevant clauses reveals that this latter approach must surely be correct and I now proceed to analyse these clauses in the context of the facts of the present proceedings on that basis. 21     The main thrust of the plaintiff’s arguments with respect to an alleged breach of contract under the terms of the Deed was premised on the assumption that the legal duties that the defendant assumed under the Deed wentbeyondthose that he hadalreadyassumed as QP and agreed to as part of his legal relationship with the main contractor (PMC). Ms Neo argued,inter alia, that there would have been no need for the plaintiff and the defendant to have entered into this (separate) deed if the defendant’s duties therein went no further than to reaffirm the duties that he (the defendant) hadalreadyassumed as QP and had agreed to under his legal relationship with the main contractor. In other words, this legal arrangement would, on the assumption just stated, have been an exercise in legal redundancy and futility. In this regard, thecontextunder which the Deed was entered into between the plaintiff and the defendant is of the first importance and I will therefore consider it in more detail below. 22     More specifically, Ms Neo also argued that the defendant’s legal duties as QP centred, in fact, only around ensuring that there was compliance with the requirements of the Building Control Act, the building regulations and the approved plans (citing s 9(4)(a) of this particular Act). However, she argued that the language of the terms of the Deed (in particular, cl 1 thereof) wentmuch furtherthan that. Ms Neo also pointed to the fact that the defendant had carried out various administrative roles, that he had chaired as well as taken minutes of various meetings, and that he had carried out various certification duties – all of which, she argued, were clearly outside the scope of his duties as QP. 23     In so far as cl 4 of the Deed was concerned (reproduced above at [18]), Ms Neo argued that as this clause referred to terms such as “damages”, “costs”, “charges” and “expenses” in general terms, it was not confined merely to third party claims. 24     On the other hand, counsel for the defendant, Mr Lai Yew Fei, argued, first, that the defendant could not possibly have undertaken duties beyond those he had owed as QP and under his legal relationship with the main contractor (PMC) because this would have meant supervising the works of his own employer (viz, PMC). More importantly, he argued that the defendant’s legal responsibilities were limitedonlyto duties owed as QP and, indeed, that the defendant otherwise only owed legal duties to the main contractor, who (as just mentioned) was his employer. It was also argued that it was highly unusual for a building owner (here, the plaintiff) to appoint the architect (here, the defendant) engaged by the main contractor (PMC) to supervise and oversee the main contractor. This may well be the case. However, nothing is impossible, and it was, in the final analysis, up to the defendant to decide what legal relationships he wanted to enter into and how he wanted to order his affairs. More importantly, there was, as we shall see (at [32] below), an extremely important reason as to why theplaintiffrequired the defendant to enter into a separate contract, as embodied in the Deed. 25     More specifically, Mr Lai argued that cl 4 of the Deed (reproduced above at [18]) applied only to a situation where claims had been made by athirdpartyagainst the plaintiff and not to a situation such as the present where no such claims were involved. 26     In so far as damage or loss was concerned, Mr Lai mounted a series of arguments against recovery based,inter alia, on the doctrine of remoteness of damage.",
        "Analysis": "131Having regard to my conclusions on the nature of the defendant’s liability arrived earlier in the present judgment, it is clear, in my view, that the defendant owed the plaintiff acontinuing dutyand that the defendant’s argument to the effect that time began to run from the date of contractual completion must be rejected. This last-mentioned date was, if at all, relevant only with respect to the legal situation existing between themain contractor and the plaintiffand, even then, might not be conclusive. Thenature and scopeof thedefendant’s duties to the plaintiffwere, in contrast,quite different. As I pointed out right at the outset of this judgment, this was not a typical or conventional building contract. That also explains the dearth of direct authority – a fact acknowledged by both parties. But the dearth of such authority is not a recipe for arbitrariness; far from it. One must, in the circumstances, have regard togeneral (in particular, first) principles. And these include, as the plaintiff has argued, ascertaining thenature and scope of the defendant’s duties to the plaintiff as viewed in the context of the particular factual and legal matrix of the present case. Taking this logical and commonsensical approach, it is clear that the date argued for by the defendant (viz, the contractual date of completion) was, as already alluded to above, both arbitrary and wholly divorced from thetruelegal relationship between the defendant and the plaintiff – a legal relationship which wouldnoteven haveordinarilyarisen,but for the special circumstances of the case itself(which have been detailed right at the outset of the present judgment). 132  In the circumstances, the defendant owed the plaintiff a legal duty to exercise reasonable care in the supervision of the project work carried out by the main contractor. Such a legal duty obviouslyextended beyondthe contractual completion date – if nothing else, because the main contractor was itself woefully derelict in its dutiesunderitscontract with the plaintiff as well as pursuant to the duty of care it owed the plaintiff under the law of tort. However, there had, in the nature of things, to be a “cut-off date” as well. This “cut-off date” was, as argued by the plaintiff, necessarily the date when the main contractor hadeither practically or finally completed its work on the project itself. In the circumstances, and taking these last-mentioned dates into account, it was clear that the plaintiff’s claim wasnottime-barred.",
        "The claim in negligence": "",
        "The applicable legal principles": "Introduction 37     As already mentioned, the plaintiff mounted an alternative claim in negligence for damages for pure economic loss. 38     The entire area relating to liability in negligence for pure economic loss is a confused – and confusing – area. Different approaches have been adopted in different Commonwealth jurisdictions. The law is still in a state of flux. Even the position in Singapore is not, with respect, unambiguously clear, despite appearances to the contrary (which I will come to in a moment). This is perhaps understandable in light of the very nature of the subject matter itself. The realm of liability in negligence for pure economic loss is one of those rare areas of the law where theory and practice find themselves at a clear confluence, and where each is closely defined by the other. This is quite distinct from the usual situation where there is a gap – often, and somewhat unfortunately, a large one – between theory on the one hand and practice on the other. Indeed, many of the difficulties in this particular area of the law have their roots in the conceptual sphere. I have always held the view that a judge ought not, absent exceptional circumstances, refer to his or her extra-judicial writings. In this regard, though, I note the rather quaint situation where McKinnon LJ, in what is now a classic passage in an oft-cited decision, did refer, in passing and without detail, to the text of an essay when judicially formulating his classic “officious bystander” test in the context of the law of implied terms. These were his actual words (see the English Court of Appeal decision ofShirlaw v Southern Foundries (1926) Ltd[1939] 2 KB 206 at 227 (affirmed by the House of Lords in [1940] AC 701)): If I may quote froman essay which I wrote some years ago, I then said: “Prima facie that which in any contract is left to be implied and need not be expressed is something so obvious that it goes without saying; so that, if, while the parties were making their bargain, an officious bystander were to suggest some express provision for it in their agreement, they would testily suppress him with a common, ‘Oh, of course!’” At least it is true, I think, that, if a term were never implied by a judge unless it could pass that test, he could not be held to be wrong. [emphasis added] 39     The exact source of this well-known statement of principle was, if I may say so, one of the great legal mysteries which nobody ever talked about. I once thought that I was the only person who wondered what the exact identity of that elusive “essay” was, and whether it was ever published. It was only after I had uncovered it literally in the bowels of Langdell Library at Harvard Law School (ironically, thousands of miles distant from where the essay had originated) and incorporated it in an essay of my own on implied terms that I discovered that there were a great many persons wondering precisely the same thing! I will not exercise further judicial licence by referring to my own essay, but it may be an apt denouement at this particular point to reveal the fact that McKinnon LJ’s essay was really a lecture. In this regard, I will merely repeat what I had said in my judgment in the Singapore High Court decision ofForefront Medical Technology (Pte) Ltd v Modern-Pak Pte Ltd[2006] 1 SLR 927at [31]: Interestingly, the essay referred to above was in fact a public lecture delivered at the London School of Economics in the University of London: see Sir Frank MacKinnon,Some Aspects of Commercial Law – A Lecture Delivered at the London School of Economics on 3 March 1926(Oxford University Press, 1926) (and see, especially, at p 13). 40     So there appears to be some (albeit slender) precedent for a judge to cite his or her own extra-judicial writings. This was one that I was aware of off-hand. Another was helpfully brought to my attention subsequently. This was even more helpful. It was of infinitely more recent vintage. And it was by a law lord. This relates to Lord Millett’s reference to his article in the important House of Lords decision ofTwinsectra Ltd v Yardley[2002] 2 AC 164, as follows (at [80]): In “The Quistclose Trust: Who Can Enforce It?” (1985) 101 LQR, 269, I argued that the beneficial interest remained throughout in the lender. This analysis has received considerable though not universal academic support: see for example Priestley LJ “The Romalpa Clause and the Quistclose Trust” inEquity and Commercial Relationships, edited by P D Finn (1987), pp 217, 237; and Professor Michael Bridge “The Quistclose Trust in a World of Secured Transactions” (1992) 12 OJLS 333, 352; and others. It was adopted by the New Zealand Court of Appeal inGeneral Communications Ltd v Development Finance Corpn of New Zealand Ltd[1990] 3 NZLR 406and referred to with apparent approval by Gummow J inIn re Australian Elizabethan Theatre Trust(1991) 102 ALR 681. [emphasis added] The fact that the learned law lord was dissenting makesnodifference to the principle of citation I am presently concerned with. 41     Apart from this rather slender stream of authority, however, the guiding principle with regard to citations of this nature must surely be that of necessity. In the nature of things, therefore (and as I have already alluded to above), such citation will be the very rare exception rather than the rule. In this regard, given the inherent practical as well as (especial) conceptual difficulties surrounding the law relating to liability in negligence for pure economic loss, I feel compelled to refer to an article I co-wrote which attempts to deal comprehensively with the topic from both comparative as well as conceptual perspectives: see Andrew Phang, Cheng Lim Saw and Gary Chan, “Of Precedent, Theory and Practice – The Case for a Return toAnns” [2006] Sing JLS 1 (“Of Precedent, Theory and Practice”). I should include the caveat that this article, although published recently, was in fact written before I came on the bench. It is therefore an academic article. But having re-read it even more recently, there is much in it that I believe will be helpful to a judicial consideration (or even re-consideration) of this very thorny area in the law of tort. Indeed, the strict dichotomy occasionally drawn between academic work on the one hand and court judgments on the other is, in the medium and longer terms, a recipe for disaster. This is because theory cannot be divorced from practice. Each interacts with – and needs – the other. Shorn of their theoretical roots, the relevant rules and principles will become ossified. On the other hand, if one stays only in the rarefied atmosphere of “high theory”, the danger of collapsing for want of the “oxygen” of practical reality is not only possible; it would be imminent. But extreme positions have always had this effect and should therefore be assiduously eschewed. More to the point, they do not reflect reality and, if they should become reality, the legal system would be much the poorer for it. However, the conflict between theory and practice just referred to is, in my view, a false one. As I have already emphasised, the process is, instead, aninteractiveone. Whilst one must, in the main, have one’s legal feet firmly planted on theterra firmaof practical reality (and this means,inter alia, paying close attention to the facts of the case at hand), one must (occasionally, at least) adopt a “helicopter view” which the theoretical roots afford in order to survey the legal terrain in perspective, lest the wood be lost for the trees. However, the process is, in the final analysis, an interactive one inasmuch as there is no dogmatic rule that the court can only do one to the exclusion of the other, or that one or the other can only be done at designated times only. Much depends on the applicable rules and principles, as well as the precise factual matrix concerned. 42     Put simply, academics must not indulge in impractical “hobby horses”, but must write for that wider legal audience (comprising not merely students and fellow academics but also practitioners and judges) which is willing to consider their arguments and ideas, and even put them into practice. On the other hand, courts ought, in my view, to incorporate such arguments and ideas whenever to do so would not only aid in resolving the case at hand in a just and fair manner but would also aid in the development of the law in that particular area. 43     Having regard to the views I have just expressed, I must, with respect, differ (at least somewhat) from the views expressed by Lord Goff of Chieveley in his perceptive and thought-provoking Maccabaean Lecture entitled “The Search for Principle” (1983) 69 Proceedings of the British Academy 169 (reprinted inThe Search for Principle – Essays in Honour of Lord Goff of Chieveley(William Swadling & Gareth Jones eds) (Oxford University Press, 1999) at pp 313–329 (citation will be from this latter reference)), where the learned law lord spoke,inter alia, on the respective functions of both judge and jurist; in particular, he pointed to the fact that the roles of both are not the same and that the former focuses on the facts of the particular case whereas the latter focuses on the idea. In other words, the judge focuses on the particular whereas the jurist focuses on the universal; the former approach is really more “fragmented” whereas the latter approach is broader. Lord Goff proceeded to observe thus (at pp 327–328): It is sometimes asked – who should be dominant, judge or jurist? … Dominance can be considered in many forms, and in terms of power or influence. However, in the one matter which I regard as important for present purposes, which is the development of legal principles, the dominant power should, I believe, be that of the judge. This is not because the judge is likely to be a better lawyer than the jurist; far from it. It is because it is important that the dominant element in the development of the law should be professional reaction to the individual fact-situations, rather than theoretical development of legal principles. Pragmatism must be the watchword. 44     The dichotomy drawn above between judge and jurist is perhaps a little too stark. Whilst the learned author does allude briefly to the fact that the work of judge and jurist is complementary, the element ofinteractionis, with respect, not emphasisedsufficiently. It is precisely the conceptual as well as logical analysis contained in the synthesis of academic writings that provides the necessary material for judges to apply to the facts at hand and, on occasion and in appropriate cases, to advance the law (albeit, in the nature of things, incrementally, at least for the most part). It is through the crystallisation of these broader and more general principles that the law gains coherence in its application to discrete situations. Moreover, certain academic writings (in particular, comments and notes on particular cases) will contain much more specific analysis of legal issues that might not “qualify” as synthesis as such but would nevertheless be extremely helpful to a court faced with the same (or similar) issues. However, there is also a need for academic writings to have regard to issues that are – or are likely to be – faced by courts in actual cases; academic scholars should not go off on fanciful “academic frolics” of their own. These would, for example, include esoteric theories tailored for hypothetical situations which are wholly divorced from any sort of reality whatsoever. This is not to state that such hypothetical situations might not be invoked very occasionally to emphasise a point. However, a moderate – let alone excessive – indulgence in such an approach is both undesirable and tends to undermine the utility as well as credibility of the academic writing concerned. Nevertheless, the reasonable postulation of hypothetical situations that might arise before the courts and the legal analysis that flows therefrom might not only have useful normative value for the courts but might also assist in the resolution of current fact situations by analogy. The “two stage test” 45     Returning to the article cited above (at [41]),viz, “Of Precedent, Theory and Practice”, the basic thesis stated therein is a simple (yet practical) one – that the courts ought to return to the simple (albeit not simplistic) formulation of Lord Wilberforce in the House of Lords decision ofAnnsv Merton London Borough Council[1978] AC 728 (“Anns”); the formula itself is as follows (at 751–752): [I]n order to establish that a duty of care arises in a particular situation, it is not necessary to bring the facts of that situation within those of previous situations in which a duty of care has been held to exist. Rather the question has to be approached intwo stages.Firstone has to ask whether, as between the alleged wrongdoer and the person who has suffered damage there isa sufficient relationship of proximity or neighbourhoodsuch that, in the reasonable contemplation of the former, carelessness on his part may be likely to cause damage to the latter – in which case aprima facie dutyof carearises.Secondly, if the first question is answered affirmatively, it is necessary to consider whether there are any considerations which ought tonegative, or to reduce or limit the scope ofthe dutyorthe class of persons to whom it is owed or the damages to which breach of it may give rise. [emphasis added] 46This has popularly been referred to as the “two stage test”. Thefirstlimb comprises alegalconception of reasonable foreseeability orproximity(incontrastto a purelyfactualconception of reasonable foreseeability, which would, by its very nature cast too wide a “net” of liability). It could not, in my view, have been the case that Lord Wilberforce was referring to afactualconception of reasonable foreseeability or proximity simply becausealmost everythingwould be reasonably foreseeable. As I have just mentioned, this would run foul of the danger encompassed within the famous (and oft-cited) observations of the great American judge, Cardozo CJ, inUltramares Corporation v Touche174 NE 441 (1931) of “liability in an indeterminate amount for an indeterminate time to an indeterminate class” (at 444). In the circumstances, therefore, it would not only avoid potential confusion but also conduce towards more clarity to characterise thisfactualconception as “reasonable foreseeability” and thelegalconception as “proximity”. As we shall see, therealdifficulty (from both conceptual as well as practical perspectives) is defining what the latter,viz, “proximity”, is. 47     The distinction drawn between “reasonable foreseeability” and “proximity” in the preceding paragraph – between the factual and the legal – is important, simply because it was not always clear which aspect Lord Atkin was referring to when he enunciated the famous “neighbour principle” in the seminal House of Lords decision ofDonoghue v Stevenson[1932] AC 562, as follows (at 580): The rule that you are to love your neighbour becomes in law, you must not injure your neighbour; and the lawyer’s question, Who is my neighbour? receives a restricted reply. You must take reasonable care to avoid acts or omissions which you can reasonably foresee would be likely to injure your neighbour. Who, then, in law is my neighbour? The answer seems to be – persons who are so closely and directly affected by my act that I ought reasonably to have them in contemplation as being so affected when I am directing my mind to the acts or omissions which are called in question. 48     Indeed, many assumed that the above formulation, seminal though it was, referred to thefactualaspect. As we have seen, such an interpretation is, of course, much too broad to constitute a basis for ascertaining whether or not there exists a legal duty of care – especially in the context of liability in negligence for pure economic loss. More importantly, such a criterion is inappropriate simply because we would be attempting to utilise afactualbasis from which to ascertain whatlegal(and,ex hypothesi,normative) consequences ought to follow. This is very much like comparing the proverbial apples with oranges or mixing oil with water. In other words, in order to arrive at a rule or principle withnormativeforce, one cannot premise it on adescriptive or factualbasisonly. 49     Turning now to thesecondlimb in the “two stage test” inAnns, it will be seen from the quotation above (at [45]) that this limb comprises broaderpolicyfactors which go towards limiting the scope of that duty. The “three part test” 50     However, the “two stage test” has since lost favour in England, where the “three part test”, embodied in the House of Lords decision ofCaparo Industries plc v Dickman[1990] 2 AC 605 (“Caparo”), appears to have been adopted instead (andcfbelow at [75]). This last-mentioned test is embodied within the following observations by Lord Bridge of Harwich (seeCaparoat 617–618): What emerges is that,in addition to the foreseeability of damage, necessary ingredients in any situation giving rise to a duty of care are that thereshould exist between the party owing the duty and the party to whom it is oweda relationship characterised by the law as one of “proximity” or “neighbourhood”and that the situation should be one in which the court considers itfair, just and reasonablethat the law should impose a duty of a given scope upon the one party for the benefit of the other. [emphasis added] 51The “three part test” comprises, as is evident from the quotation above, the following elements,viz, (a) foreseeability, (b) proximity, and (c) the requirement that the imposition of any duty of care be “fair, just and reasonable”. The tests are the same in substance 52     At this juncture, it is important to point out that, in my view at least, the “three part test” is, in substance and effect, thesameas the “two stage test” – except that, by adding on, as it were, an extra stage to the entire inquiry, the “three part test” actually engenders more heat and confusion rather than light and clarity. Let me elaborate. 53     It might be appropriate to begin in an ostensibly unorthodox fashion – from the back to the front, so to speak. In particular, the second limb in the “two stage test” and the third part of the “three part test” are, in my view,one and the same. In other words, asking whether there are policy factors limiting the scope of a duty of care under the former is the same thing as asking whether or not it is “fair, just and reasonable” to impose a duty of care under the latter. 54     Turning, next, to the concept of “proximity”, it is clear, in my view that the concept of “proximity” under the first limb of the “two stage test” and the same concept under the second part of the “three part test” arealso one and the same. 55     But, it may quite legitimately be asked, is there not still adifferencebetween the “two stage test” and the “three part test” simply because, after the analysis in the preceding two paragraphs, thereremainsthefirst partof the “three part test”, which isnotpresent in the “two stage test”? The answer to this question is a simple one. The first part of the “three part test” (relating to “foreseeability”) is, in effect, a reference to thefactualconception of reasonable foreseeability or proximity. It is, in other words, what I have earlier termed (at [46] above) as “reasonable foreseeability”. Although this consideration has been incorporated as an element within the “three part test” itself, its incorporation is, with respect,unnecessary. As I have already pointed out above (at [46]), the requirement of reasonable foreseeability from afactualperspective willalmost always be satisfied, simply because of its very nature and the very wide nature of the “net” it necessarily casts. There is thereforeno practical needto include such afactualelement within alegalformulation such as exists with regard to the existence (or otherwise) ofa duty of care. If, in other words, thefirst partin the “three part test” isredundant, then there would beno difference, in substance and effect, between the “three part test” and the “two stage test”, having regard to the correlation (indeed, coincidence) referred to above(at [53]–[54]).I would go further and observe thatby confining the formulation of the duty of care to its strictly legal form by incorporating only the two most essential elements (of proximity, qualified by policy), the “two stage test” is superior to the “three part test”, the latter of which tends to complicate matters unnecessarily be introducing the first (factual) element which is really redundant or otiose, as just explained above.This is not to state that this last-mentioned (factual) element is to be discarded. As I have already mentioned, it willalmost alwaysbe satisfied. More importantly, if it is not, then there wouldnotbe anylegalproximity in the first instancesince even the factual substratum or pre-requisite would not exist in the first instance. However, this doesnotentail elevating thisfactualelement into the status of alegalone by regarding it as a separatelegalelement, in and of itself. 56It should also be pointed out, at this juncture, that, with the exception of England and Malaysia, the “two stage test” laid down by Lord Wilberforce inAnns(reproduced at [45] above) has in fact been embraced – in one form or another – throughout the Commonwealth. In this regard, I have in mind, in particular, the legal position in Australia, New Zealand and Canada. An overview of the legal position in the various major Commonwealth jurisdictions can in fact be found in “Of Precedent, Theory and Practice” ([41]supraat pp 4–37). The concept of proximity and the allied concepts of voluntary assumption of responsibility as well as reasonable reliance 57However, even if we accept that the “two stage test” laid down by Lord Wilberforce inAnnsought to be the governing law, there remain a number of difficulties – the chief of which centres around the meaning to be attributed to, and (as, if not more, importantly) the application of, the (legal) concept ofproximity. The level as well as intensity of the difficulties in this particular regard become immediately clear when an eminent law lord like Lord Bridge of Harwich observed (inCaparo([50]supraat 618)) thus: [T]he concepts of proximity and fairness … are not susceptible of any such precise definition as would be necessary to give them utility as practical tests, but amount in effect to little more than convenient labels to attach to the features of different specific situations which, on a detailed examination of all the circumstances, the law recognises pragmatically as giving rise to a duty of care of a given scope. [emphasis added] The “legal anxiety” in this regard is compounded when another eminent law lord, Lord Roskill, observed, in a similar vein in the same case, thus (at 628): Phrases such as “foreseeability”, “proximity”, “neighbourhood”, “just and reasonable”, “fairness”, “voluntary acceptance of risk”, or “voluntary assumption of responsibility” will be found used from time to time in the different cases. But, as your Lordships have said, such phrases arenot precise definitions. At best they are but labels or phrases descriptive of the very different factual situations which can exist in particular cases and which must be carefully examined in each case before it can be pragmatically determined whether a duty of care exists and, if so, what is the scope and extent of that duty. [emphasis added] 58     One should also refer to the observations of Lord Oliver of Aylmerton in the House of Lords decision ofAlcock v Chief Constable of South Yorkshire Police[1992] 1 AC 310 at 411, that “in the end, it has to be accepted that the concept of “proximity” is anartificialone which depends more upon the court’s perception of what is the reasonable area for the imposition of liability than upon any logical process of analogical deduction” [emphasis added] (see also, by the same law lord, inCaparo([50]supra) at 633). 59     However, all is not mere legal doom and gloom, for, if nothing else, efforts must be made to concretise (here) the concept of proximity lest the courts be left powerless to adjudicate the claims before them. To this end, one might note the Hong Kong Privy Council decision ofYuen Kun Yeu v Attorney-General of Hong Kong[1988] AC 175 at 194, where Lord Keith of Kinkel, who delivered the judgment of the Board, referred to the concept of “close and direct relations” (see alsoidat 192). One might also have regard to the decision of Deane J in the Australian High Court decision ofSutherland Shire Council v Heyman(1985) 157 CLR 424 (“Heyman”), where the learned judge observed (in an important passage) thus (at 497–498): The requirement of proximity is directed tothe relationship between the partiesin so far as it is relevant to the allegedly negligent act or omission of the defendant and the loss or injury sustained by the plaintiff. It involvesthe notion of nearness or closeness and embraces physicalproximity (in the sense of space and time) between the person or property of the plaintiff and the person or property of the defendant,circumstantialproximity such as an overriding relationship of employer and employee or of a professional man and his client and what may (perhaps loosely) be referred to ascausalproximity in the sense of the closeness or directness of the causal connexion or relationship between the particular act or course of conduct and the loss or injury sustained. It may reflectan assumption by one party of a responsibilityto take care to avoid or prevent injury, loss or damage to the person or property of another orrelianceby one party upon such care being taken by the other in circumstances where the other party knew or ought to have known of that reliance.Both the identity and the relative importance of the factors which are determinative of an issue of proximity are likely to vary in different categories of case.That doesnot meanthat there is scope for decision by reference to idiosyncratic notions of justice or morality or that it is a proper approach to treat the requirement of proximity asa question of fact to be resolved merely by reference to the relationship between the plaintiff and the defendant in the particular circumstances.The requirement of a relationship of proximityserves as a touchstone and control of the categories of case in which the common law will adjudge that a duty of care is owed.Given the general circumstances of a case in a new or developing area of the law of negligence, the question what (if any) combination or combinations of factors will satisfy the requirement of proximity is aquestion of law to be resolved by the processes of legal reasoning, induction and deduction. On the other hand, the identification of the content of that requirement in such an area should not be either ostensibly or actually divorced from notions of what is “fair and reasonable” … or from the considerations of public policy which underlie and enlighten the existence and content of the requirement.[emphasis added] 60     The following observations by Lord Nicholls of Birkenhead (dissenting, but not on this particular point) in the House of Lords decision ofStovin v Wise[1996] AC 923 at 932 are also helpful: TheCaparotripartite test elevates proximity to the dignity of a separate heading. This formulation tends to suggest that proximity is a separate ingredient, distinct from fairness and reasonableness, and capable of being identified by some other criteria. This is not so. Proximity is a slippery word. Proximity is not legal shorthand for a concept with its own, objectively identifiable characteristics. Proximity is convenient shorthand for a relationship between two parties which makes it fair and reasonable one should owe the other a duty of care. This is only another way of saying that when assessing the requirements of fairness and reasonableness regard must be had to the relationship of the parties. 61     There is a suggestion of some overlap between the concept of proximity and the element of “fair, just and reasonable”, although the focus of the latter should (as I have suggested above at [53]) be on policy factors instead. The learned law lord also proceeded to observe thus ([60]supraat 932): [T]he pithy, tripartite formulation has advantages. The relationship between the parties is an important ingredient in the overall assessment. The tripartite test is useful in focusing attention specifically on this feature and also in clearly separating this feature from foreseeability of damage. 62     And, in the Canadian Supreme Court decision ofCooper v Hobart(2001) 206 DLR (4th) 193, McLachlan CJC and Major J, who delivered the judgment of the court, observed thus: [31]  … Two things may be said [about the concept of “proximity”]. The first is that “proximity” is generally used in the authorities to characterize the type of relationship in which a duty of care may arise. The second is that sufficiently proximate relationships are identified through the use of categories. The categories are not closed and new categories of negligence may be introduced. But generally, proximity is established by reference to these categories. This provides certainty to the law of negligence, while still permitting it to evolve to meet the needs of new circumstances. [32]  On the first point, it seems clear that the word “proximity” in connection with negligence has from the outset and throughout its history been used to describe the type of relationship in which a duty of care to guard against foreseeable negligence may be imposed. “Proximity” is the term used to describe the “close and direct” relationship that Lord Atkin described as necessary to grounding a duty of care inDonoghue v Stevenson[and see above at [47]] … … [34]  … Defining the relationship may involve looking at expectations, representations, reliance, and the property or other interests involved. Essentially, these are factors that allow us to evaluate the closeness of the relationship between the plaintiff and the defendant and to determine whether it is just and fair having regard to that relationship to impose a duty of care in law upon the defendant. [35]  The factors which may satisfy the requirement of proximity are diverse and depend on the circumstances of the case. One searches in vain for a single unifying characteristic. 63However, at the end of the day, the concept of proximity is still a somewhat elusive one. In order to infuse a datum measure of certainty and practicality into the process of ascertaining whether or not proximity exists in law on the facts of any given case, it is suggested that the twin (and related) concepts of thevoluntary assumption of responsibilityand reasonable reliancewould be of great assistance. Indeed, both these concepts are embodied in the observations of Deane J inHeyman(quoted above at [59]). Both concepts are not only of practical utility; they are also conceptually related. In this last-mentioned regard, I can do no better than to quote from “Of Precedent, Theory and Practice”, as follows ([41]supraat pp 47–48 (footnotes omitted)): We would further submit thatbothbases are not only to be ascertained on an objective basis but are alsocomplementary and integrated. Indeed, authority forbothbases can be located in theHedley Byrnecase [viz, the seminal House of Lords decision on negligent misstatement inHedley Byrne & Co Ltd v Heller & Partners Ltd[1964] AC 465] itself. More importantly, there is, in the final analysis,no real conflictbetween both bases. The rationale of reasonablereliancecentres on theclaimant’sperspective, whilst the rationale ofvoluntary assumptionof responsibility centres on thedefendant’sperspective (the defendant havingmadethe alleged misstatement in the first instance). In summary,bothperspectives are, at bottom,two different (yet inextricably connected) sides of the same coin and ought therefore to be viewed in an integrated and holistic fashion.It therefore should not be surprising in the least that courts and judges frequently refer tobothbases in the same case or judgment, respectively. What is particularly significant for the purposes of the present article is this: the (complementary) concepts of both reasonable reliance as well as voluntary assumption of responsibility appear to the present writers to constitute the best – and most practical – criteria for establishing whether or not there is proximity between the claimant and the defendant from a legal standpoint. To this end, the various aspects of proximity (physical, circumstantial and causal) arefactorsthat are to be taken into account as the Court considers whether, in any given case, there has been both reasonable reliance and voluntary assumption of responsibility – all viewed from a holistic and integrated perspective. It might, however, be argued that – situations of negligent misrepresentation apart – in many situations, there might not beactual or factualreliance and/or assumption of responsibility as such. It is submitted that this is too narrow an approach to take, especially having regard to the fact that the concept of proximity itself is (as we have argued) not merely factual but is, rather,legalin nature. In other words, there will be situations where, notwithstanding the absence of actual reliance and/or assumption of responsibility, the court concerned will nevertheless hold that there ought,in law, to be found reliance as well as assumption of responsibility on the basis of what, respectively, a reasonable claimant and a reasonable defendant ought to contemplate in the specific category of case as well as the specific facts present, with broader policy factors also coming possibly into play at the second stage of the inquiry in accordance with the “two stage test” inAnnswhich we of course support. Our proposal does not, of course, do away with all the uncertainties. However, it does furnish us with a more concrete and practical way forward. More importantly, it infuses content into what would otherwise be an empty concept, the emptiness of which would serve to obfuscate rather than enlighten judges, lawyers and students in this already rather confused (and confusing) area of tort law. [emphasis in original] 64The suggestions above notwithstanding, the law relating to liability in negligence for pure economic loss continues to be at least somewhat shrouded in uncertainty, as evidenced by the extremely recent House of Lords decision ofCustoms and Excise Commissioners v Barclays Bank plc[2006] 3 WLR 1 (“Customs and Excise Commissioners”). As this decision represents the latest position in England at the time of writing and is rendered by the highest appellate court in that jurisdiction, I turn now to consider it briefly. Continued confusion in England 65     The House of Lords decision inCustoms and Excise Commissionersnot only confirms – but actually underscores – the numerous difficulties canvassed above and the consequent need for a more coherent approach by the courts. 66     The issue raised in this case was a straightforward one: Whether a bank, notified by a third party of a freezing injunction granted to it (the third party) against one of the bank’s customers (and affecting an account held by that customer with the bank), owes a duty of care to the third party to take reasonable care to comply with the terms of the injunction. The House decided, unanimously, that no duty of care existed under such circumstances – not least because it could not be said that the relationship between the bank and the third party involved any notion of assumption of responsibility but was (on the contrary) an adverse one in which the bank had no choice but to comply with the (non-consensual) court order concerned. However, the actual views expressedvis-à-visliability in negligence for pure economic loss were not, with respect, particularly enlightening. 67     To understand the backdrop to the views expressed in the House, it should be noted that theCourt of Appealin the same case held that there werethree teststhat existedandwhich hadallto be utilised. In the words of Longmore LJ inCustoms and Excise Commissioners v Barclays Bank plc[2005] 1 WLR 2082 at [23]: The modern law of negligence derives primarily from four decisions of the House of Lords:Caparo Industries plc v Dickman[1990] 2 AC 605,Henderson v Merrett Syndicates Ltd[1995] 2 AC 145,White v Jones[1995] 2 AC 207 andPhelps v Hillingdon London Borough Council[2001] 2 AC 619.Caparolaid down the threefold test of foreseeability, proximity and fairness and emphasised the desirability of incremental development: see in particular Lord Bridge of Harwich at pp 617–618.HendersonandWhiteboth emphasised the concept of assumption of responsibility in cases where the negligent performance of services had caused economic loss. In the light of these authorities this court has held (seeBank of Credit and Commerce International (Overseas) Ltd v Price Waterhouse[1998] BCC 617) that an appropriate course for ascertaining whether there is a duty of care, at least in an economic loss case, is to look at any new set of factsby using each of the three approaches in turn, viz, the threefold test, the voluntary assumption of responsibility test and the incremental test —“if the facts are properly analysed and the policy considerations are correctly evaluated the several approaches will yield the same result”: per Sir Brian Neill, at p 634. [emphasis added] Peter Gibson LJ endorsed the above approach which he viewed (at [57]) as constituting a “pragmatic suggestion”. 68     Lindsay LJ also emphasised the importance of treating the assumption of responsibility test as anindependentone, as follows (idat [51]): But the expression “assumption of responsibility” is a useful reminder that an express or implied disavowal of such an assumption is always likely to be material and could often be conclusive. For these reasons I would not wish “assumption of responsibility” to be merely subsumed within other tests as to a “duty of care” or to be abandoned as a separate head of inquiry. 69With respect, the approach adopted by the Court of Appeal as briefly set out above is both conceptually as well as practically confusing. Only the “three part test” (characterised as a “threefold test”) is, in my view, a clearly acknowledged one. 70     The “assumption of responsibility” test is, with respect and contrary to what Lindsay LJ stated in the preceding paragraph,notreally a substantive test in its own right. It isone(albeit an important)criterionfor ascertaining whether or notlegal proximityhas been established. Indeed, its “mirror image” is – more often than not – that ofreasonable reliance. I have, in fact, already elaborated upon these criteria for legal proximity in more detail above (see generally at [63]). The test based on incremental development (embodied, most notably perhaps, in Deane J’s statement of principle inHeymanquoted at [59] above) is alsonota substantive test in its own right. It is amethodological aidthat emphasises the fact that ascertaining whether there has been legal proximity is an inquiry that is inextricably connected with the particular factual matrix of the case at hand as well as with analogical comparison with the factual matrices in previous cases. 71     In so far as the concept of assumption of responsibility is concerned, the view expressed in the preceding paragraph is, in fact, supported by the approach of Lord Bingham of Cornhill in the same case at the House of Lords stage, where the learned law lord observed ([64]supraat [4]) that “it is correct to regard an assumption of responsibility asa sufficient but not necessary conditionof liability” [emphasis added] (in this regard, reference should also be made to the observations of Lord Mance, especially at [87], and of Lord Rodger of Earlsferry at [52], whose observations (at [65]) also support the view proffered in this judgment to the effect that the concepts of voluntary assumption of responsibility and of reasonable reliance are, more often than not, “mirror images” of each other). 72     In so far as the concept of incremental development is concerned, Lord Bingham of Cornhill also observed ([64]supraat [7]) that “theincremental testisof little value as a test in itself, and is only helpful when used in combination with a test or principlewhich identifies the legally significant features of a situation” [emphasis added]. Lord Mance, on the other hand, viewed the concept of incremental development as furnishing the concrete particularity that would mitigate the otherwise high level of abstraction that would otherwise operate (seeidat [83]–[84]). All this in fact buttresses the observations I made above (at [70]) to the effect that this particular concept is amethodological aid. 73     If the analysis proffered in the preceding paragraphs is correct, then it is not inaccurate to state that all three “criteria” mentioned by the English Court of Appeal inCustoms and Excise Comissioners v Barclays Bank plc([67]supra) ought to be applied simultaneously – albeit not for the reasons set out by the court itself. Indeed, had there truly been three disparate legaltests, they could – contrary to the view expressed by the court in the case just mentioned (at [67] above) – conceivably engender different results (although overlaps are obviously possible; see also Paul Mitchell & Charles Mitchell, “Negligence Liability for Pure Economic Loss” (2005) 121 LQR 194 (“Mitchell & Mitchell”) at p 198). Indeed, if all three tests would, on the other hand, give rise to thesameresult, one can only wonder why there was even a need for these threeseparate and distincttests in the first instance (see also Mitchell & Mitchell,supraat p 197). They ought, in logic and principle, then, to be stated asonetest – to avoid confusion, if nothing else. Even if it is insisted that such an approach does not make anypracticaldifference, there remains, as just mentioned, the very real danger of terminological confusion – which confusion can itself give rise to undesirable (andsubstantive) consequences. In any event, the law in general and in this area in particular is already sufficiently technical. Conceptual, definitional as well as practical “streamlining” ought to be the order of the day – not the opposite. 74     With the greatest respect, the approach adopted by the English Court of Appeal inCustoms and Excise Commissioners v Barclays Bank plc([67]supra) is both confused and confusing – a view that is, in fact, supported by a recent Singapore Court of Appeal decision (see [93] below). Not surprisingly, it has also been the subject of rather trenchant comment (see generally Mitchell & Mitchell ([73]supra)). Indeed, Lord Bingham of Cornhill did in fact refer to the comment just referred to ([64]supraat [4]). Unfortunately, however,no definitive viewwas expressed with regard to this particular proposition as to whether or not the three “tests” mentioned by the Court of Appeal were all substantivetestsin their own right and wereallto be applied in any given case. Indeed, the general position adopted by the House itself is, with respect, none too clear (see also Steven Gee, “The Remedies Carried by a Freezing Injunction” (2006) 122 LQR 535, especially at p 536, which is a comment on the House of Lords decision and which came to my notice after an initial draft of this judgment had been prepared). 75     Lord Bingham of Cornhill, for example, stated that he intended “no discourtesy to counsel in declining to embark on yet another exegesis of [the] well-known texts” contained in the leading authorities which, whilst yielding “many valuable insights”, nevertheless also contained “statements which cannot readily be reconciled” ([64]supraat [4]). Lord Rodger of Earlsferry appeared to opt for the “three part test” – at least in so far as novel situations are concerned (seeidat [53]). Lord Walker of Gestingthorpe also appeared to favour the “three part test” as enunciated inCaparo, although he admitted (idat [71]) that that test “does not provide an easy answer to all our problems, but only a set of fairly blunt tools”; nevertheless he thought that that was “to [his] mind progress of a sort” (seeid). Lord Mance also appeared to favour the “three part test”, albeit more in the context ofapplicationas opposed to doctrinal exposition (see, especially,idat [99]–[100]). 76     Further, Lord Hoffmann echoed the views expressed inCaparo(see [57] above) in the following words ([64]supraat [35]): There is a tendency, which has been remarked upon by many judges, for phrases like “proximate”, “fair, just and reasonable” and “assumption of responsibility” to be used asslogans rather than practical guidesto whether a duty should exist or not. These phrases are often illuminating but discrimination is needed to identify the factual situations in which they provide useful guidance. [emphasis added] 77     However, it is imperative that there be, in the final analysis, a just and fair result. This is echoed in the following words of Lord Bingham ([64]supraat [8]): [I]t seems to me that the outcomes (or majority outcomes) of the leading cases cited above are in every or almost every instancesensible and just, irrespective of the test applied to achieve that outcome.This is not to disparage the value of and need for a test of liability in tortious negligence, which any law of tort must propound if it is not to become a morass of single instances. But it does in my opinion concentrate attention on the detailed circumstances of the particular case and the particular relationship between the parties in the context of their legal and factual situation as a whole. [emphasis added] 78     The above observations are also instructive inasmuch as they emphasise that, regardless of the test ultimately utilised by the court, the precise factual context is of the utmost importance. As we have seen above (especially at [59]–[63]), this is particularly significant in so far as the ascertainment of whether or not there has been the requisite legal proximity is concerned. 79It can thus be seen that the position in England,even at the present, continues to be in a state of flux and confusion. It is, with respect, therefore unhelpful to Singapore courts. The Singapore courts are, at the very least, free to adopt a test which is most logical and principled. The Singapore position 80     What, then, is the position in Singapore? The leading decisions are those of the Court of Appeal inRSP Architects Planners & Engineers v Ocean Front Pte Ltd[1996] 1 SLR 113(“Ocean Front”) andRSP Architects Planners & Engineers (Raglan Squire & Partners FE) v Management Corporation Strata Title Plan No 1075[1999] 2 SLR 449(“Eastern Lagoon”). 81     Both the cases mentioned in the preceding paragraph involved claims for pure economic losses in the context of real property in general and defective buildings in particular. 82     InOcean Front, the court first considered whether there was (on the facts of the case) sufficient proximity between the parties, which would (in turn) give rise to a duty of care. L P Thean JA, who delivered the judgment of the court, observed thus (at 139, [69]): But the approach of the court has been to examine a particular circumstance to determine whether there exists that degree ofproximitybetween the plaintiff and the defendant as would give rise to a duty of care by the latter to the former with respect to the damage sustained by the former.Such proximity is the “determinant” of the duty of care and also the scope of such duty.[emphasis added] 83     The court then proceeded “to consider whether there isany policy consideration in negativing such [a] duty of care” (at 142, [75]; emphasis added). Such an approach is, in substance and effect, the adoption of the “two stage test” inAnns, although it is acknowledged that it would cease to be so if the first limb in the “two stage test” referred merely tofactual(as opposed tolegal)proximity, as Thean JA was clearly referring to thelatterin the quotation in the preceding paragraph. However, as I have already pointed out above (at [46]), the first limb in the “two stage test” must necessarily refer to alegalconception of proximity. It therefore follows that the approach adopted inOcean Frontwas, in substance and effect, the “two stage test” enunciated by Lord Wilberforce inAnns(and see [54] above). 84     InEastern Lagoon, however, the court appeared to expressly reject the “two stage test” inAnns. L P Thean JA, who delivered the judgment of the court, observed thus (at [18]): It seems to us that what is objectionable in that passage [containing Lord Wilbeforce’s test inAnns case] is firstly his Lordship’s sweeping proposition of a single general rule or principle which can be applied in every situation to determine whether a duty of care arises and secondly the fact that the test propounded by his Lordship in the first stage was based on foreseeability of damage alone. 85     Significantly, in my view, Thean JA had also delivered the judgment of the court in the earlier decision ofOcean Front. As the learned judge did not either modify or comment adversely on his previous judgment inOcean Front, it must be assumed that the approach adopted in that case is still good law. However, we have already seen (at [83] above) that the approach adopted inOcean Frontwas, in substance and effect, thesameas the “two stage test” laid down by Lord Wilberforce inAnns. It is therefore rather curious that inEastern Lagoonitself, Thean JA, after reviewing the decision inOcean Frontitself, proceeded to observe thus ([80]supraat [29]–[30]): It is abundantly clear that inOcean Frontthis court didnotfollow the broad proposition laid down by Lord Wilberforce inAnns. True, the court reached its conclusion bya two-stage process.In principle, there is no objection to such approach. It depends on what is involved and considered in each stage. The court certainly did not apply the first test inAnns. The court’s finding that there was sufficient degree of proximity giving rise to a duty on the part of the developers to avoid the loss sustained by the management corporation was not premised on foreseeability of damage alone, but on the consideration of other relevant facts. Nor did the court accept Lord Wilberforce’s proposition that in any given situation, a single general rule or principle can be applied to determine whether a duty of care arises. It does not follow from the mere fact that the court in the course of their determination examined the facts by thetwo-stage processthat the court in effect followedAnns. [emphasis added] 86     The learned judge then proceeded to observe as follows (idat [31]): Stripped of the verbiage, the crux of such approach [ie, the “two-stage process” referred to in the preceding paragraph] is no more than this: the court first examines and considers the facts and factors to determine whether there issufficient degree of proximityin the relationship between the party who has sustained the loss and the party who is said to have caused the loss which would give rise to a duty of care on the part of the latter to avoid the kind of loss sustained by the former. …Next, having found such degree of proximity, the court next considers whether there isany material factor or policy which precludes such duty from arising. [emphasis added] 87Hence, the position inSingaporenow appears to be embodied in neither the “two stage test” nor the “three part test” but, rather, anew test altogether– the “two-stage process”. BothOcean FrontandEastern Lagoon, being decisions of the Court of Appeal, are of course binding on me. With respect, however, it seems to me that the new “two-stage process” is, in substance and effect,the same as the “two stage test” laid down by Lord WilberforceinAnns. Further, substance ought to prevail over form. This is especially needful in an area of the law which is already (by virtue of both its inherent nature as well as the unnecessarily complex manner in which the law has hitherto developed) already rather confused and confusing. Indeed, an even cursory perusal of the formulation with respect to the “two-stage process” set out in the quotation in the preceding paragraph – together with a comparison with the “two stage test” (set out at [45] above) – will confirm that the tests are, in substance and effect, thesame. If so, then, in the famous words of William Shakespeare inRomeo and Juliet(Act 2, Scene 2) (also quoted in the Singapore High Court decision ofChua Kwee Chen, Lim Kah Nee and Lim Chah In (as Westlake Eating House) v Koh Choon Chin[2006] 3 SLR 469at [20]): What’s in a name? That which we call a rose / By any other name would smell as sweet. 88     If, as I have just pointed out, the “two stage test” and the “two-stage process” are, in substance and effect, the same, then the present Singapore position, as laid down in bothOcean FrontandEastern Lagoon, is consistent with that which I have advocated in the present judgment – which is a return to the “two stage test” laid down by Lord Wilberforce inAnns(set out at [45] above). It does not matter, in my view, whichlabelis used, in the final analysis, so long as thesubstanceof the test is clear. Hence, I gratefully adopt the rubric of “two-stage process” laid down by the Singapore Court of Appeal inEastern Lagoon, as indeed I must – as a matter of binding precedent, if nothing else. It is, nevertheless, hoped that should an appropriate opportunity arise, the Singapore Court of Appeal will clarify theterminologythat ought to be used. 89     It is also significant to note that in a subsequent Singapore Court of Appeal decision,Man B&W Diesel S E Asia Pte Ltd vPT Bumi International Tankers[2004] 2 SLR 300(“Man B&W Diesel”), it was pointed out (at [29]) that: [Ocean Front]preferredthe approach taken by the House of Lords inAnnsrather than in [Murphy v Brentwood District Council[1991] 1 AC 398] and also by the courts in Australia and Canada.It basically adopted the two-step test advanced by Lord WilberforceinAnns. [emphasis added] 90     The above observations support, in fact, the interpretation ofOcean Frontproffered in the present judgment; although the “twostagetest” laid down by Lord Wilberforce inAnnsis referred to as a “two-steptest” instead, this is, once again, an issue of terminology rather than substance. Indeed, the court inMan B&W Dieselwas not unaware of the controversy surrounding the “two stage test” inAnns, although it “diplomatically” referred (at [45]) to this particular test as having “been qualified”. 91     I should point out, at this juncture, however, that there has been yet another Singapore Court of Appeal decision which is also relevant. InUnited Project Consultants Pte Ltd v Leong Kwok Onn (trading as Leong Kwok Onn & Co)[2005] 4 SLR 214(“United Project Consultants”), Yong Pung How CJ, who delivered the judgment of the court, observed thus (at [27]): In determining whether to impose a duty of care in cases such as the present, where the remedy sought is damages for “pure economic loss”, the courts have consistently adopted a more restrictive approach. This in turn must be contrasted to judicial attitudes towards claims in negligence resulting in damage to the person or property … 92     This is, of course, a succinct statement of the basic problem of line-drawing that is the main difficulty where liability in negligence for pure economic loss is concerned; in contrast, there is no such difficulty wherephysical damageis concerned simply because there is, in such a situation,ex hypothesi, a limit to the amount of damages that can be claimed (see also the Singapore Court of Appeal decision ofThe Sunrise Crane[2004] 4 SLR 715at [36] as well asCustoms and Excise Commissioners([64]supraat [31],perLord Hoffmann)). 93     Yong CJ then proceeded, in this particular case, to acknowledge (at [27]) that “despite the best efforts by many a distinguished judge to identify the requisite elements to establish a duty of care in such cases, the authorities appear to be in a state of confusion”. The learned Chief Justice also referred to thethen Englishposition as embodied,inter alia, within theEnglish Court of Appealdecision ofCustoms and Excise Commissioners v Barclays Bank plc([67]supra) – a position which I have argued above (at [69]–[74]) to be confused and confusing, and which has not (unfortunately) been clarified (one way or the other) by the House of Lords on appeal (see generally above at [75]–[76]). In a similar vein, the court inUnited Project Consultantsalso acknowledged “theapparent uncertaintyemanating from theUKcourts” and how, in contrast, “thelocalapproach iscomparatively settled” ([91]supraat [34]; emphasis added). Indeed, Yong CJ proceeded torejectthe approach adopted by the English Court of Appeal in the following words (at [33]): [W]e found ourselves unable to agree with this state of affairs. The laws of any country must be sufficiently clear and capable of guiding parties in the regulation of their affairs. While a measure of uncertainty will always be present, for that is the consequence of any jurisdiction that founds its laws upon previously decided cases, it would be undesirable for a court to refrain from coming down in favour of any particular test when faced with various alternative approaches: see also Paul Mitchell & Charles Mitchell (“Negligence Liability for Pure Economic Loss”) (2005) 121 LQR 194. 94     Yong CJ then proceeded to apply (idat [35] and [38]) what is,in substance and effect, the “two stage test” enunciated by Lord Wilberforce inAnns, having earlier referred toEastern Lagoon(at [34]). However, he then proceeded to observe thus (at [36]): We should also hasten to add, for the avoidance of doubt, that our restatement of the principle inRSP Architectsshould not be construed as reverting to the two-stage test inAnns v Merton London Borough Council[1978] AC 728.While the two-stage test propounded by Lord Wilberforce sought to focus entirely on foreseeability as the sole requirement of the first limb, the “proximity” requirement as understood inRSP Architectspurports to encompass more than just the element of foreseeability. Other factors that would go towards the establishment of a duty of care would include the reliance placed upon the defendant’s professed skill, the defendant’s assumption of duty and the exact relationship between the parties. However, we do not wish to set down a closed list of factors which a court must consider as each case will inevitably present a multitude of different factors. 95With respect, however, and having regard to my analysis in an earlier part of this judgment (at [46]), the first limb of the “two stage test” inAnnswasnotreferringmerelyto “factualforeseeability” as such but, rather, to “legal proximity” instead. Looked at in this light, there is, insubstance and effect,no differencebetween the “two stage test” inAnnsand the “two-stage process” laid down inEastern Lagoon. 96     What was helpful, however, was Yong CJ’s further observation ([91]supraat [37]) that so-called “labels” are not merely “empty legal vessels” but do indeed comprise “crucial indicators that a court must look for in order to satisfy itself that there exist circumstances which justify the imposition of a duty of care” (cfalsoperLord Hoffmann inCommissioners for Customs and Excise(at [76] above)). 97     What was also helpful was the learned Chief Justice’s apparent endorsement of the proposition proffered above (at [63]) to the effect that the concepts of voluntary assumption of responsibility and reasonable reliance are, more often than not, “mirror images” of each other (see [91]supra, especially at [28] and [31]). 98     In the final analysis, therefore, this particular case does not, with respect, adopt a position that is any different from that adopted by the same court inEastern Lagoon(see, especially, at [95] above). This brings us back, in effect, to the issue ofnomenclature or labels. As I have already emphasised, the focus ought, at bottom, to be on thesubstance, rather than the form (see [87] above). 99However, it should also be pointed out that,in addition tothe“two-stage process”, the “three part test” enunciated inCaparo(see [50] above) has also been endorsed in the Singapore context: see, for example,Ikumene Singapore Pte Ltd v Leong Chee Leng[1993] 3 SLR 24;Standard Chartered Bank v Coopers & Lybrand[1993] 3 SLR 712;Pang Koi Fa v Lim Djoe Phing[1993] 3 SLR 317;Mohd bin Sapri v Soil-Build (Pte) Ltd[1996] 2 SLR 505;D v Kong Sim Guan[2003] 3 SLR 146;TV Media Pte Ltd v De Cruz Andrea Heidi[2004] 3 SLR 543; andThe Sunrise Crane([92]supra). Yet, as I have pointed out above, there is, in substance and effect,no differencebetween the “three part test” on the one hand and the “two stage test” on the other. I will not re-traverse my arguments (at [52]–[55] above), save to observe (once again) that should an appropriate opportunity arise, it is hoped that the Singapore Court of Appeal will clarify the relationship between the two tests just mentioned. Indeed, as I have already argued, it would conduce towards clarity if the “three part test” was no longer utilised since it is already embodied within the “two stage test” (or “two-stage process”, as the case may be), with the extra (first) element in the “three part test” being (as I have argued above at [55]) redundant or otiose. 100  Tosummarise, the following appears to be the position in theSingaporecontext with respect to liability in negligence for pure economic loss (for the sake of clarity, my comments and suggestions, which do not represent the present law but which (for the avoidance of doubt) are not inconsistent with it are rendered in bold font): (a)    The test to be applied is the “two-stage process”, comprising the need (in order to establish that a duty of care exists) to prove, first, the existence of (legal)proximitybetween the parties and, secondly, that there is no material factor orpolicywhich prevents such a duty of care from otherwise arising (see, in particular, [85]–[87] above). (b)The “two-stage process” is, in substance and effect,one andthesameas the “two stage test” enunciated by Lord Wilberforce inAnns, despite express statements to the contrary (see generally [87] above). (c)    There is, however, also authority which suggests that the “three part test” is also relevant (see [99] above). (d)However, the “three part test” is, in substance and effect, thesameas the “two stage test” enunciated by Lord Wilberforce inAnns(see [52]–[55] above). As this is the case, the present legal position in the Singaporecontext is governed by (a) above, subject to the comments in (b) above. (e)In so far as theapplicationof the concept (or, rather, test) ofproximityis concerned, whilst the court’s findings will be dependent very much on the precise facts concerned, useful concepts that will aid in this particular process include thevoluntary assumption of responsibilityandreasonable reliance, both of which are in factcomplementaryconcepts (see [63] above). 101  However, as we shall see in a moment,regardlessof the precise test applied to the facts of the present proceedings, theresultwould be thesame.",
        "The application of the legal principles to the facts in the present proceedings": "Introduction 102  As I mentioned in the preceding paragraph, it does not matter which test is applied as the result in the present proceedings would be the same. In order to simplify the process of applying the legal principles to the facts in the present proceedings, it might be best to begin by distilling thecommon principlesthatunderlieallthe tests.Consistent with the analysis in the preceding section, thesecommon principlesare best represented in the following diagrammatic format: TESTSELEMENTS (AND WHETHER REQUIRED)Reasonable Foreseeability(Factual)Proximity(Legal)PolicyConsiderations“Two Stage Test”Yes, but assumed as a pre-requisite, and not formally included as part of this particular test.YesYes“Three Part Test”YesYesYes, but under the rubric of “fair, just and reasonable”.“Two-Stage Process”Yes, but assumed as a pre-requisite,and not formally included as part of this particular test.YesYes 103  It will be seen, therefore, that the following common principles (in what I have suggested constitute interchangeable terminology) are: (a)    Reasonable foreseeability (factual); (b)    Proximity (legal); (c)    Policy considerations (orwhether it is “just and reasonable” to impose a duty of care). 104  Indeed, as depicted in the diagram (at [102] above), the “three part test” would, in effect, entail the application of (a), (b) and (c) above, whilst both the “two-stage process” as well as the “two stage test” (boththese last-mentioned tests of which I have suggested are, in substance and effect, thesame) would alsoentail the application of (a), (b) and (c),although (a)isnot a formal part of the legal formulation of either of these two last-mentioned tests as such. Indeed, I have also suggested in an earlier part of this judgment that, but for the inclusion of (a) as a formal part of the legal formulation in the “three part test”,thattest is otherwise thesame(in substance and effect) as the “two-stage process” as well as the “two stage test”. 105  I turn, now to consider each of these principles (viz, (a), (b) and (c) at [103] above) as they apply to the facts of the present proceedings. Reasonable foreseeability 106It is clear that the damage or loss to the plaintiff was in fact foreseeable if the defendant failed to take reasonable care in fulfilling his duties set out in the Deed. 107  It bears repeating that the requirement of factual foreseeability is an easy one to satisfy. To this end, therefore, there need to be other legal control mechanisms to ensure that the “floodgates” of liability are not released. These mechanisms (to be considered below) include the concepts of (legal) proximity as well as the requirement that it be “just and reasonable” that a duty of care be imposed on the defendant. Other mechanisms – from the standpoint of remedies – include the concepts of remoteness of damage (pursuant to the leading (Privy Council) authority ofThe Wagon Mound[1961] AC 388) as well as mitigation of damage. Proximity 108  As we have seen, this particular concept is problematic. From apracticalperspective, it is desirable to have regard to two specific criteria or requirements. To recapitulate, these are the requirements of the voluntary assumption of responsibility and reasonable reliance, respectively. As we have also seen, these two requirements can – and ought to – be correlated with each other. I have already elaborated on the correlation above (especially at [63]) and will therefore not repeat my propositions here. On apracticallevel, however, the facts of the present proceedings confirm such correlation. More importantly, both requirements – which are closely related to each other – are satisfied on these facts. 109  Turning, first, to the criterion of thevoluntary assumption of responsibility, one could not have a clearer example of the satisfaction of this requirement than that which exists in the present case. Indeed, the assumption of responsibility by the plaintiff is not only voluntary – it iscontractual. Acontractual relationshipis,ex hypothesi, even closer than those which are “near-contract” situations – the classic recent example of the latter of which is to be found in the House of Lords decision ofJunior Books Ltd v Veitchi Co Ltd[1983] AC 520 (“Junior Books”). Indeed,Junior Books, much maligned in the English context, has in fact found a new lease of life, so to speak, in theSingaporecontext: see the Singapore Court of Appeal decision ofMan B&W Diesel. Significantly, although the Court of Appeal reversed the High Court decision (reported in[2003] 3 SLR 239), this difference in the actual result was due to a difference inapplicationas opposed to principle – for the High Court, too, endorsedJunior Books. 110  Somewhat curiously, however, Mr Lai sought to argue thatMan B&W Dieselsupportedthe defendant’scase. Indeed, he argued that it was “on all fours” with the present proceedings in so far as the facts were concerned. 111  InMan B&W Dieselitself, the plaintiff, PT Bumi International Tankers (“Bumi”), was the owner of an oil tanker (“the vessel”), which Malaysian Shipyard and Engineering Sdn Bhd (“MSE”) had agreed to build (this contract between Bumi and MSE will hereafter be referred to as “the main contract”). 112  MSE, in turn, had entered into a contract with the first defendant, Man B&W Diesel SE Asia Pte Ltd (“MBS”), for MBS to supply the ship’s main engine (“the sub-contract”). The engine was to be subsequently manufactured by MBS’s parent company in the UK (and the second defendant in this particular case), Mirrlees Blackstone Ltd (“MBUK”). It is important to note, therefore, that there was no direct contractual relationship as such between either MBS or MBUK on the one hand and Bumi on the other for the manufacture/design and supply of the ship’s engine. It is also important to note that the main contract (between Bumi and MSE) contained a limited warranty in respect of the vessel (for example, a warranty limited to defects discovered and notified within 12 months of delivery of the vessel and to the cost of repairing/replacing those defects only) as well as several exception clauses which expressly excluded or limited MSE’s liability (and that of its sub-contractors) to Bumi. In particular, cll 17.1 and 22 are pertinent, and are set out below for ease of reference: 17.1BUILDER[ie, MSE]shall be fully responsible forany part of work performed or to be performed byhis sub-contractors and for the acts and omissions of his sub-contractorsand persons either directly or indirectly employed by them to the same extent as he is for the acts and omissions of persons directly employed by him. … 22.    BUILDER states that he and his sub-contractors are fully experienced and properly qualified to perform the class of construction of the VESSEL provided for herein … BUILDER shall act as anindependent builderin performing the construction of the VESSEL, maintaining complete control over its employees and all of its sub-contractors.Nothing contained in this CONTRACT or any sub-contract awarded by BUILDER shall create any contractual relationship between any such sub-contractor and OWNER[ie, Bumi] … [emphasis added] 113  Within a few weeks of the vessel’s delivery, however, the engine started to give trouble and the problems persisted. The engine eventually broke down completely some 33 months thereafter and the vessel had been out of operation since. As a result, Bumi was unable to fulfil its obligations under a long-term charter which it had entered into with an Indonesian oil company. 114  Consequently, Bumi brought an action in tort against both MBS and MBUK to recover what was essentially pure economic loss (this included the loss of hire arising from the failed charter as well as the cost of a new engine). Bumi was unable to pursue a direct claim against MSE because such an action would, by then, have been time-barred. One of the main issues which the courts at first instance and on appeal had to consider was whether MBS and/or MBUK owed Bumi a duty of care in tort. 115  Contrary to the decision of the High Court, the Court of Appeal held that no duty of care had been established on the facts and, on that basis, did not find it necessary to decide whether or not the duty of care ought in the context of pure economic loss to be extended to chattels as well. In the circumstances, the court also did not have to decide whether there had been a breach of duty and, if so, the quantum of damages that ought to be awarded and, hence, dismissed the appeal brought by Bumi in respect of the damages awarded to it at first instance. 116  In arriving at its decision that no duty of care had been established on the facts, the Court of Appeal held that the contractual arrangements between Bumi and MSE under the main contract clearly demonstrated that Bumi had decided to lookonlytoMSEfor legal redress for any defect that might arise in respect of the vessel. This was despite the fact that MBS and MBUK had supplied the engine. Further, Bumi haddeliberatelychosen not to enter into a direct contractual relationship with either MBS or MBUK. In the circumstances, therefore, neither MBS nor MBUK owed Bumi a duty of care in tort. 117  It is immediately apparent from this brief exposition that the facts as well as reasoning inMan B&W Dieselcould not be more different from those in the present proceedings. Most importantly, whilst there wasno contractual relationshipbetween the relevant parties inMan B&W Diesel, there was clearly a contractual relationship between the parties in the present proceedings as evidenced by, and embodied in, the Deed. 118  The salient contractual provisions inMan B&W Diesel(some of which were reproduced above at [112]) were also clear inasmuch as the plaintiff in that case had undertaken that it would look, in the event that it suffered damage or loss as a result of conduct on the part of the defendant sub-contractors, to themain contractorinstead. This was significant and served – correctly, in my view – tonegatethe existence of any duty of care owed by the defendants toward the plaintiff. Once again, the situation in thepresentproceedings isquite different. Indeed, the situation in the present proceedings is ana fortiorione compared to that which existed inJunior Books, which concerned a “near contract relationship” instead. As already alluded to above, the Court of Appeal inMan B&W Dieseldid not in fact resile fromJunior Books. However, unlike the court below, the Court of Appeal was of the view that, on thefactsinMan B&W Diesel, the legal principles laid down inJunior Booksdid not apply. 119  Turning now to the issue ofreasonable reliancein the present proceedings, it is equally clear that the plaintiff did in fact rely on the defendant – again, pursuant to the terms of the Deed. 120  Indeed, there is no difficulty whatsoever in establishing legal proximity between the plaintiff and the defendant in the present proceedings simply because there wasa contractual relationshipbetween them in the first instance. Generally speaking, given the fact that a defendant will not be allowed to be better off in tort than it would have been in contract where concurrent liability exists, it is no surprise that – depending on the precise contractual terms – it is more likely than not that legal proximity will be established where there is a contractual relationship between the parties concerned. Policy considerations 121  There are clearly no policy considerations which militate against the imposition of a duty of care on the defendant in the present proceedings. Once again, the defendant voluntarily entered into a contractual relationship with the plaintiff. The resultant contractual relationship, it will be recalled, is embodied within the Deed. In the circumstances, it is, therefore, only “just and reasonable” that a duty of care be owed by the defendant to the plaintiff. Conclusion on the issue of the duty of care 122  This is a relatively easy case on the facts. The principal factor is the contractual relationship between the parties as embodied within the Deed. More importantly, all the main elements that are required in order to establish a duty of care owed by the defendant to the plaintiff have been clearly established on the facts of the instant case. 123  I turn now to consider whether or not the duty of care owed by the defendant to the plaintiff in the present proceedings has been breached. Has there been a breach of the duty of care? 124Many of the arguments proffered by the parties in the present proceedings centred on whether or not a duty of careexisted. This was especially the case in so far as the defendant was concerned. However, having found that a duty of care did indeed exist, abreachof that duty of care still needs to be established by the plaintiff. 125  It is clear, on the facts, that the duty of care had been breached by the defendant. It is telling that, throughout the present proceedings, the defendant (as already noted above) was at pains to argue that he owed the plaintiff onlyvery limitedduties under the Deed – in both the contractual as well as the tortious spheres. This strongly suggests that the defendant did not in fact fulfill any duties beyond these more limited duties. On the other hand, the duties which the plaintiff rightfully claimed the defendant owed it included (as the terms of the Deed themselves indicate) a duty to supervise the main contractor and ensure that it completed the project properly and on time. Indeed, theavailable evidenceindicates clearly that the defendant did not fulfill these duties. As I have dealt with such evidence in relation to the defendant’s breach of the terms of the Deed above, I will not re-traverse such ground here. Has the breach of the duty of care resulted in damage or loss? 126  Having established a duty of care on the part of the defendant and a breach thereof, it is textbook law that the plaintiff also has to prove that damage or loss has resulted from such a breach. I will deal with this below (under the Part entitled “The quantum of damages awardable”). Before proceeding to do so, however, I need to consider an argument from limitation which was raised by the defendant.",
        "The argument from limitation": "",
        "The defendant’s arguments": "127Apart from taking issue with the substantive constitutive elements of the plaintiff’s causes of action,the defendant also argued that the plaintiff’s action was time-barred. In particular, Mr Lai argued that time began to run from thecontractual date of completion(viz, 20 August 1997), and that (consequently) the plaintiff’s claim was (presumably, by virtue of s 6 of the Limitation Act (Cap 163, 1996 Rev Ed)) time-barred on 20 August 2003 (whereas the plaintiff’s writ was filed only on 13 May 2004). He also argued that the cases relied upon by the plaintiff were unhelpful as they did not deal with the rather unusual situation that existed in the context of the present proceedings. He further relied on various decisions, including the Singapore High Court decision ofPeople’s Parkway Development Pte Ltd v Akitek Tenggara[1993] 1 SLR 704.Interestingly, and parenthetically, the position in England would have been quite different: Under s 8 of the UK Limitation Act 1980 (c 58), the limitation period for a claim arising under a contract under seal (viz, adeed) is 12 years from the date on which the cause of action accrued. However, there is no equivalent of that provision in the Singapore context. The relevant provision in the Limitation Act for present purposes was s 6(1)(a), which provides as follows: Subject to this Act, the following actions shall not be brought after the expiration of 6 yearsfrom the date on which the cause of action accrued: (a)    actions founded on a contract or on tort; …. [emphasis added] 128  I would only pause, at this juncture, to observe that the cases cited by the defendant were unhelpful inasmuch as thecharacterisationof when the cause of action accrued through the occurrence of the damage concerned and when, therefore, time begins to run for the purposes of the Limitation Act, is crucial. This consideration of when “the cause of action accrued” must necessarily entail an assessment of theprecise factual matrixof the case itself to determine the nature of the obligation owed and the time of its breach. In other words, it is extremely unhelpful and even dangerous to generalise from the facts of an existing precedent unless the facts in that case are truly “on all fours” with those considered in the case at hand. Indeed, and more importantly, there can be reasonable disagreement as to how any given factual matrix is to be characterised for the purposes of limitation (cf, for example, the treatment of the English decision ofForster v Outred[1982] 1 WLR 86 by Chao Hick Tin J (as he then was) in the Singapore High Court decision ofWiltopps (Asia) Ltd v Emmanuel & Barker[1999] 1 SLR 354(“Wiltopps”), especially at [25]). As already mentioned, the facts in these proceedings are rather unusual and there is, to the best of my knowledge, really no existing precedent that is “on all fours” with them. And as we shall see in a moment, it is therefore necessary, in the final analysis, to have regard to first principles as viewed from the perspective of the precise factual matrix concerned.",
        "The plaintiff’s arguments": "129  On the other hand, Ms Neo argued – correctly, in my view – that, in the absence of direct authority, the focus ought to be on thenature and scopeof the duty agreed to be undertaken by the defendant, rather than merely on the form of the building agreement or arrangement between the relevant parties. In particular, she argued that the nature and scope of the duty the defendant owed to the plaintiff in the present proceedings wasseparate and independentfromthe plaintiff’s legal arrangement with the main contractor under the “design and build contract”. She also argued that, in any event, the duties of,inter alia, administering the contract between the plaintiff and the main contractor as well as ensuring the timely completion of the project have been held to existeven in traditionalbuilding arrangements (citing the English decisions ofSutcliffe v Chippendale & Edmonson(1971) 18 BLR 149 andWest Faulkner Associates v Newham London Borough Council(1992) 31 Con LR 105). Most importantly, Ms Neo argued that there wasa continuing dutyowed by the defendant to the plaintiff in the context of the present proceedings and that such a duty continued right up to (and including)eitherthedate of substantial or practical completion(viz, June 1999)orthedate of final completion(again, argued by her to be June 1999); consequently, she argued, the plaintiff’s claims were not time-barred. In this regard, Ms Neo relied on the English decision ofUniversity of Glasgow v Whitfield John Laing Construction Ltd(1988) 42 BLR 66 (see especially at 77) (“University of Glasgow”). And the date of practical completion was, Ms Neo argued, June 1999 (as opposed to 2 February 1998, as argued for by the defendant). Indeed, she argued that it was erroneous for the defendant to fix the date of practical completion by relying on his certification of completion simply because,by virtue of the plaintiff’s claim itself,thatcertification wasitselfbeing impugned. 130  Before proceeding to deliver my decision on this particular issue, I pause to observe that the defendant’s citation of the English decision ofNew Islington and Hackney Housing Association Limited v Pollard Thomas and Edwards Limited[2001] BLR 74in order to counter the plaintiff’s reliance onUniversity of Glasgowis misconceived simply because the facts in the former case were quite different from the facts in the latter case. As I have already pointed out above (at [128]), the precise factual matrix is extremely important in this particular area of the law and, in this regard, there can be no “blanket rule” one way or the other. At the same time however, the defendant’s argument to the effect thatUniversity of Glasgowis not relevant because the case dealt with design – as opposed to supervision – obligations is, with respect, also misconceived as being far too literal an approach to take, especially since I understood the plaintiff to be utilising thegeneral principlesembodied in this particular case and to be, in any event, referring to that case by way of analogy only.",
        "The quantum of damages awardable": "",
        "The claim for loss of use of factory space": "142  The plaintiff claimed a total of $1,149,398.56, being the loss of use of factory space for the period from the contractual completion date to the date when the Temporary Occupation Licence (“TOP”) was finally obtained. In so far as damages under this particular head are concerned, whilst it would normally have been awarded, I held that such damages could not be awarded, based on the facts of the present proceedings. 143  Both the subject property as well as the plaintiff’s former premises were built on land purchased on long term leases and werenot tenantedproperties. Any owner of real estate will know that the user costs ofactually rentingpremises as opposed to being theownerof the same premises can be quite different. The market rental value as a means to measure the loss of use to the owner, although convenient, is flawed. The market rental value reflects components of interest costs, depreciation, maintenance and property taxes. Given that the plaintiff was not able to shift to the subject property which was not completed on time, the full costs of certain components embedded within the market rental value such as depreciation and maintenance cost of the building and property taxes would have not been incurred whilst the plaintiff remained at its former premises. In other words, using market rental value would have included business expenses which did not materialise and therefore ought not to be borne by the defendant in the context of the present proceedings. More importantly, there was no evidence led with respect to this issue (of expenses). However, I will need to return to this issue – albeit in a somewhat different (albeit related) context (see [149] below). 144  There are, in fact, three main scenarios that could have possibly resulted in (as well as justified) the use of market rental to estimate loss of use. 145  The first is if the plaintiff was waiting to commence its business in the subject premises and as a result of the delay had to incur the expenses of rentingalternative premises. However, the plaintiff was already conducting its business operations on its former premises. Hence, this scenario is not applicable based on the facts of the present proceedings. 146  A second possible scenario is if the plaintiff had required the subject premisesin addition toits former premises. But it is clear, from the plaintiff’s own claim for damages for its inability tosellitsformer premises, thatno additional capacityfor its business operations was in fact required. It is true that the plaintiff desired larger premises, but it has to prove that its capacity at its former premises (which it continued to use) was insufficient for its purposes during the relevant period of delay. Indeed, the plaintiff adduced no evidence that it had contracts that required the use of the subject premisesin additionto the use of its former premises. This would, for example, have been the situation if the plaintiff had demonstrated that it had entered into an overwhelming number of contracts in anticipation of its increased capacity that could not have been accommodated by the capacity afforded by its former premises only. There was also no evidence, in fact, that the plaintiff had ceased its business operations whilst waiting for the subject premises to be completed. 147  If, indeed, the plaintiff required additional capacity in order to fulfil its various business commitments, these additional commitments would, presumably, have fallen within the second limb ofHadley v Baxendale(see [135] above), and consequently requiredactualknowledge on the part of the defendant. It was clear that the defendant did not, in any event, have such actual knowledge and, hence, such loss, even if it had existed, would have been too remote. 148  A remaining scenario is where the plaintiff had decided to retain its former premises and desired the subject premises asan investment. If so, then the delay in the completion of the subject premises would have resulted in the loss of rent that could have been obtained from these premises.However, it is clear that the plaintiff had intended the subject premises to bea replacement forits former business in the context of the conduct of its business operations. Indeed, the plaintiff had claimed that it had suffered loss due to the fact that it had lost the opportunity to sell its former premises – a head of alleged loss that I will be considering in the next section of this judgment. 149  However, in fairness to the plaintiff, I need to canvass an alternative argument that might have been raised in relation to this alleged head of loss – but which wasnot. To determine the damages suffered by the plaintiff relating to the use of premises in this scenario in whichboththe subject and former premises are owned rather than rented, I would suggest that a more appropriate measure is the depreciation to the asset value incurred by the plaintiff during the period in question. Straight line depreciation accounting will calculate this on the basis of the amount paid for the overall period of the lease divided by the total period (to give the total monthly notional rental), which figure should then have been multiplied by the number of months in question (here, 23 months). However, as I have already mentioned, this alternative argument was never canvassed and the necessary figures were not before this court. Indeed, the argument was never even pleaded to begin with. 150  In the circumstances, the plaintiff cannot succeed under this particular head of claim.",
        "The claim for loss from the sale of the old factory": "151  The plaintiff claimed $1,200,000 under this particular head of loss, arguing that it could not sell the old factory for the price it could have owing to the main contractor’s breach of its legal duties. Once again, however, such loss would, if at all, have fallen within the second limb ofHadley v Baxendale(see [135] above). In the circumstances,actualknowledge on the part of the defendant had to be proved by the plaintiff. The plaintiff (through the testimony of Madam Koh) was unable to do so and, hence, this particular head of loss is too remote and I therefore find in favour of the defendant. Indeed, Madam Koh’s evidence in this regard was rather vague and tentative and, in my view, clearly did not pass muster.",
        "The claim for loss of use of plant and machinery for the period between December 1997 and July 1999": "152  The plaintiff claimed a total of $325,974.04 under this particular head of loss. In this regard, what was involved was new machinery for use at the subject premises. Once again, however, the second limb ofHadley v Baxendale(see [135] above) applies and once again, in the circumstances, the plaintiff was unable to proveactualknowledge on the part of the defendant and, hence, I find in favour of the defendant. Indeed, in its submissions, the plaintiff was relying on the much broader (and tortious) concept of reasonableforeseeabilitywhich was not, in the circumstances, applicable in the present proceedings for the reasons give above (at [139]–[140]).",
        "The claim with respect to storage charges for the machines and container": "153  The plaintiff claimed $19,911.29 under this particular head of loss. Once again, the second limb ofHadley v Baxendale(see [135] above) applies and once again, in the circumstances, the plaintiff was unable to proveactualknowledge on the part of the defendant and, hence, I find in favour of the defendant. This conclusion in fact follows from my finding with regard to the preceding head of damage or loss.",
        "Claim with regard to defects in the subject property": "154  The plaintiff set out, through its expert report, a whole host of defects in the subject property. I found that this was clearly the case. The work that issued from the main contractor was clearly unsatisfactory; in some instances, if I might venture to observe, it was appalling. It is not surprising, therefore, that Madam Koh, in particular, felt thoroughly aggrieved. 155  Whilst not seeking to deny that such defects were in fact present in the subject property, the defendant sought to argue that many of the items concerned were either not caused by the main contractor or were excessive or were due to normal wear and tear. 156  I went through each and every alleged defect in the light of the various arguments made on behalf of both parties, as well as in the light of the available testimony. I found, in fact, that most of the defects had in fact been caused by the main contractor and which, for the reasons I have already set out above, the defendant was also liable for. I also found, however, that the following items of alleged loss had not been proved by the plaintiff, as follows (the respective sums claimed with respect to each item follow in parentheses): (a)    The need to overhaul and lay the lightning conductors/metal strips on the parapet walls to a flat surface ($2,000). (b)    Repainting works to the exterior and interior of the building ($150,000). (c)    Certain works to the guardhouse ($450). (d)    Infilling the aerated slab with earth and turf ($100). (e)    To compact, re-spread and level the existing tarmacadam driveway and loading/unloading bay ($40,000). (f)     Topping up of the soil and loosing of the soil (to provide sufficient oxygen in the soil for better growing of plants) prior to the replanting exercise ($5,000). (g)    To treat the termites with pest control methods ($1,500). (h)    The hacking out and replastering of the hollow/debonded plaster on the column on the first storey ($150). (i)     To lay over the whole roof (shared with the PUB transformer room, PUB switch room and consumer switch room) with waterproofing membrane and dressed up to the roof parapet ($3,000). (j)     Replacing the rusty metal clasp of the conduit in the PUB switch room ($10). (k)    Installation of weather-boarding at the base of the doors in the consumer switch room ($30). (l)     Re-designing the door and partition wall in the female toilet on the second storey (beside stair A) ($200). (m)  Redecorating the dented window still in the production area in the second storey ($100). (n)   Filling up the gap between the frame and the wall at all shutter openings with appropriate sealant to stop rainwater seepage in the production area in the second storey ($50). (o)    Installing a new door knob to the exit door to stair B in the third storey ($50). (p)    Relocating the floor trap in the production area in the third storey ($1,000). 157  There is no need to delve into detailvis-à-visthe reasons as to why recovery for each of the items listed in the preceding paragraph was not allowed. Broadly speaking, however, the following reasons were applicable (and are borne out in the testimony of the plaintiff’s expert, one Mr Chin Cheong, given (principally by way of admissions) under cross-examination by Mr Lai): (a)    Not recoverable because it is a maintenance issue (see generally items (a), (d), (j), (o), and part of item (c) above). (b)    Not recoverable because it is an improvement, as opposed to a rectification (see generally items (f) and part of item(c)). (c)    Not recoverable because it is not part of the relevant report (see generally item (h) above). (d)    Not recoverable because it is unnecessary (see generally item (k) above). (e)    Not recoverable because it is excessive (see generally item (l) above). (f)     Not recoverable because not identified or proved (see generally items (m), (n) and (p) above). There is also some overlap (see, for example, item (b) above, which, in my view, fall within reasons (a), (e) and (f) above, as well as item (e) above, which falls within reasons (a) and (f) above). 158  In the circumstances, the total sum with respect to the items set out above (at [156]) which I found hadnotbeen proved by the plaintiff was $203,640.",
        "Miscellaneous claims": "159  There were a number of miscellaneous claims, which included the following (the respective amounts claimed are in parentheses): (a)    Fees paid to JTC for the extended construction period from August 1997 to July 1999 ($1,030). (b)    Fees paid to the defendant and the Urban Redevelopment Authority for the increase in building height from 3 storeys to 4 storeys, which was aborted to mitigate delay ($6,500). (c)    Addition fees incurred for the appointment of a replacement architect as the QP in the defendant’s place to complete what the defendant had left undone ($22,000). (d)    Additional expenses incurred in engaging other contractors to complete all outstanding works and to remedy the various defects ($39,493.50). 160  These claims under this particular head were modest. Thus, they ought, in principle, to be awarded.",
        "A recapitulation – the total amount of damages awardable to the plaintiff": "161  A total of $3,346,397.39 was claimed by the plaintiff in the present proceedings. 162  Given my findings above, the following amounts werenotrecoverable by the plaintiff: (a)The claim for loss of use of the subject premises$1,149,398.56(b)The claim for loss from the sale of the old factory$1,200,000(c)The claim for loss of use of plant and machineryfor the period between December 1997 and July 1999$325,974.04(d)The claims with respect to storage charges for themachines and container$19,911.29(e)Claim with regard to defects in the subject property$203,640Total$2,898,923.89 163  Hence, the total amount of damages that ought to be awarded to the plaintiff is $447,473.50.",
        "Sums taken into account by way of set-off": "164  There were two sums that the defendant argued ought to be taken into account by way of set-off and to his credit in the event that damages were awarded. To recapitulate, the total amount of damages awardable to the plaintiff is $447,473.50. 165  However, I note, first, that the plaintiff has admitted that $250,000 (received by the plaintiff from Overseas Union Insurance Limited pursuant to a performance bond furnished by the main contractor) ought to be taken into account as credit for any damages which are payable by the defendant. 166  The second sum engendered more controversy. The defendant argued that the retention sum of $196,230.30 should also be taken into account as credit for any damages payable by him. However, the plaintiff argued to the contrary. The main issue, in this regard, was whether or not this retention sum had been released to the main contractor; if it had, then it ought not to be taken into account. In the circumstances, I found that there was simply no evidence whatsoever that that sum had in fact been released by the plaintiff to the main contractor.In point of fact, no concrete evidence was led as to what the precise position was between the plaintiff on the one hand and the main contractor on the other. There was, in fact, no evidence adduced by the defendant to rebut the plaintiff’s claim that the defendant had in fact over-certified inasmuch as works that had not actually been done by the main contractor were nevertheless certified by the defendant to have been completed. There was also a dispute as to what the contract sum under the “design and build contract” actually was. I saw no reason to disbelieve Madam Koh’s version to the effect that the contract sum waslowerthan that argued for by the defendant, not least because, try as he might, Mr Lai was unable to undermine her version in cross-examination.Indeed, as I have already pointed out above, the plaintiff in general and Madam Koh in particular had had difficulties with the main contractor right from the outset of the project itself. As I have also indicated above, the rancour – even hatred – felt towards the main contractor continues unabated, and even exceeded that felt towards the defendant in the present proceedings. All this reinforces my finding thatunder those circumstances, it was improbable that the plaintiff would have released the retention sum to the main contractor. In any event, as I have already mentioned, there was no evidence that such a sum was in fact released. In the circumstances, therefore, I also took this sum into account as credit for any damages payable by the defendant. 167  The total of the two sums mentioned in the preceding two paragraphs was $446,230.30. The total amount of damages awardable, on the other hand, was $447,473.50. After taking the total of the two sums mentioned into account by way of set-off, the total amount of damages awardable was $1,243.30.",
        "Conclusion and the issue of costs": "168In the premises, I found in favour of the plaintiff and awarded it a sum of $1,243.20, together with interest and costs. 169  However, as referred to at the commencement of this judgment, the controversy between the parties stretched beyond the decision on the substantive issues, and into the sphere of costs. 170  In this regard, Mr Lai argued that, despite the fact that the plaintiff had in fact succeeded on most issues with regard to liability and had been awarded damages, each party ought to bear its own costs. His main argument centred on the fact that the plaintiff had been awarded only $1,243.20. However, it should be borne in mind that this wasnottheactualloss or damage caused to the plaintiff. This was, as I have pointed out above, thenetfigure, after the necessary set-offs had been taken into account. In point of fact, theactualloss or damage caused to the plaintiff was$446,230.30,ie, a sum close tohalf a million dollars. This could, by no stretch of the imagination, be characterised as a failure on the part of the plaintiff to prove its claim – still less that it constituted nominal damages only. Indeed,muchof the argument centred on the argument ofliability. 171  Further, although the set-offs were,in fairness to the defendant, taken into account, I did note Ms Neo’s point that the argument as to these set-offs was only raised at the conclusion of the trial at the stage of submissions. It is both unjust and unfair for the defendant to now take advantage of the concessions it has obtained by seeking to utilise those sums (already utilised as set-offs against the total damages payable by the defendant to the plaintiff) as a legal instrument to avoid having to pay the plaintiff its costs. 172  The general (and well-established) principles as to costs were stated in the oft-cited Singapore Court of Appeal decision ofTullio v Maoro[1994] 2 SLR 489, as follows (at 496, [24]): We have foundRe Elgindata Ltd (No 2)[1993] 1 All ER 232] which is a recent judgment of the English Court of Appeal most helpful as it has collected together all the relevant principles which should govern the awarding of costs. Suffice to set out here the headnote which reads: The principles on which costs were to be awarded were (i) that costs were in the discretion of the court, (ii) that costs should follow the event except when it appeared to the court that in the circumstances of the case some other order should be made, (iii) that the general rule did not cease to apply simply because the successful party raised issues or made allegations that failed, but that he could be deprived of his costs in whole or in part where he had caused a significant increase in the length of the proceedings, and (iv) that where the successful party raised issues or made allegations improperly or unreasonably the court could not only deprive him of his costs but could also order him to pay the whole or part of the unsuccessful party’s costs. The fourth principle implied, moreover, that a successful party who neither improperly nor unreasonably raised issues or made allegations which failed ought not to be ordered to pay any part of the unsuccessful party’s costs … 173  Based on the four principles set out in the above quotation, it is clear that the plaintiffwasentitled to its costs. However, I did take into account the fact that the plaintiff did fail on one argument with respect to liability (see above at [33]) as well as with respect to certain arguments regarding the remedies sought (centring principally round the doctrine of the remoteness of damage). In the circumstances, I was of the view that the plaintiff ought to be awarded 70 per cent of its costs. 174  As mentioned above, this wasnotan instance where onlynominaldamages were awarded. The ultimate amount awarded did not truly reflect the true quantum of recovery by the plaintiff. To reiterate a point made earlier, one ought, as always, to look to the substance rather than to the form. It is, of course, true that in situations where nominal damages were in fact awarded, the plaintiff will – more often than not – not be regarded as having been a “successful” plaintiff. However, even in such a situation, the plaintiff might still be regarded as a “successful” plaintiff if part of the object of the claim is to establish a legal right (see generallyMcGregor on Damages(Sweet & Maxwell, 17th Ed, 2003) at para 10-010). I do not think that a “blanket rule” can be imposed, and the facts of each case are crucial and will need to be scrutinised closely. However, as I have already mentioned, the present proceedings didnotconcern a situation where only nominal damages were awarded. 175  The defendant also – rather belatedly – argued that two offers to settle had been made by it to the plaintiff. One was an offer to settle dated 30 July 2004. This was for a mere $10,000 (inclusive of interest) and must surely be considered extremely trivial and even (from the plaintiff’s perspective) insulting, given the nature and amount of damage claimed. Although it did also contain an offer to pay the plaintiff’s costs, it should be noted that the parties had not, at that particular point in time, proceeded to trial yet. 176  The second was an offer to settle dated 26 July 2005, after the hearing in open court had concluded. This was for an amount of $120,000 (inclusive of interest) and with the understanding that each party bears its own costs. The amount involved, whilst more substantial than that contained in the first offer to settle, still fell far short of what the plaintiff ultimately obtained from this court, which was close to half a million dollars. It should also be noted that the amount that would ultimately be awarded by this court was, of course, unknown to the parties at the time and that this particular offer must have therefore been made by the defendant with the plaintiff’s original claim in view. 177  In the circumstances, it was rather disingenuous of the defendant to invoke O 22A of the Rules of Court (Cap 322, R 5, 2006 Rev Ed). The defendant, not surprisingly, focused on the award of $1,243.20. This was, with respect, a literalist approach that did not take into account thecontextof the case itself. 178  As I alluded to at the outset of this judgment, this case, whilst raising interesting legal issues, was, in the final analysis, a rather long-drawn battle between parties who fought doggedly every step of the way in an unusual factual context. They were fuelled not so much by principle as by rancour. It was, in addition – on the part of the defendant at least – a fight for “survival” in the absence of the requisite insurance coverage. But this conduct on the part of the defendant was, in the final analysis, misplaced in the light of the clear language of the Deed as interpreted in the light of the surrounding circumstances as a whole, and of a factual matrix that was so clear that liability for negligence for pure economic loss was inevitable even in the face of the general complexity of the law in the area itself. In the circumstances, the defendant was fortunate that certain items of claim were too remote or not proved, and (more importantly) that set-offs were available to him. On a more general level, things might have taken a quite different – and certainly less acrimonious – turn if both parties had displayed some commonsense, forgiveness and compromise. However, this was not to be. As already mentioned, the result was a very unfortunate “tit for tat” battle to the very end (including, but not limited, to the issue of costs).  [note: 1]See Notes of Evidence at pp 88–89. [note: 2]See, for example, the Minutes of Meeting as well as the plaintiff’s letter to the defendant, both dated 24 September 1996 (at PCB, Tab 6, at pp 198–201 and 196–197, respectively). [note: 3]See, for example, PCB, Tab 7, pp 215, 246 and 254."
    }
}