{
    "case_title": "Econ Piling Pte Ltd v Aviva General Insurance Pte Ltd and Another",
    "ncitation": "[2006] SGHC 76",
    "coram": "Woo Bih Li J",
    "sections": {
        "The PB": "11        The material parts of the PB stated: NOW THE CONDITION of the above-written Bond is such that it shall be void only in either of the following cases, namely : (1)        if the CONTRACTOR or his successors or assigns shall well and truly perform, fulfil and keep all and every of the terms, covenants, conditions, clauses, provisos and stipulations of the Contract on the part of the CONTRACTOR or his successors or assigns to be observed, performed, fulfilled and kept according to the true purport, intent and meaning thereof; or (2)        if, on failure or default by the CONTRACTOR or his successors or assigns so to do, the SURETY shall, without proof or conditions, pay to the CORPORATION the full amount of the above-written Bond. …. The Certificate of the Superintending Officer of the CORPORATION certifying the amount of losses damages costs and expenses sustained by the CORPORATION shall also be deemed to be final and conclusive of the same PROVIDED ALWAYS THAT where the total of these amounts less any payments or credit in sums or money certain due and payable to the CONTRACTOR do not exceed the abovewritten Bond the balance of the bond money shall after meeting the claims of other parties be released to the SURETY. 12        The district judge was of the view that the crux of the issue was whether Econ had indeed well and truly performed the contract. In her view, the absence of any legal action by JTC against Econ during the period allowed by the Limitation Act (Cap 163, 1996 Rev Ed) (“the Act”) was sufficient proof that Econ had performed the contract to the extent that the PB was rendered void. As for JTC’s reliance on the decision of the SO, the district judge noted that JTC’s request to the SO for her determination was made long after the limitation period had ended and she was concerned that if JTC was allowed to make a call on the PB it would open companies like Econ to potential claims for an indefinite period of time, thus circumventing the Act. The district judge was also of the view that the SO had based her determination entirely on the arbitrator’s decision which was inherently unfair as Econ had not participated in the arbitration. 13        The district judge also observed that JTC’s conduct in the circumstances might fall into the category of unconscionable behaviour for which interlocutory injunctions have been granted in the past in respect of “on demand” bonds, pending the outcome of the substantive dispute under the underlying contract for which a performance bond had been procured. Nevertheless, the district judge made no finding on this issue as the parties had not addressed her thereon. 14        Econ’s counsel, Ms Shanmugam, submitted that because JTC was precluded under the Act from bringing any action (under contract or tort) against Econ, JTC was also precluded from making a demand under the PB. 15        However, JTC’s counsel, Mr See, submitted that the effect of the expiry of a limitation period merely precluded JTC from commencing action but did not extinguish the right to claim damages against Econ. The textbook, David W Oughton, John P Lowry & Robert M Merkin,Limitation of Action(LLP, 1998) states at pp 48 to 49: Generally, it is said that when time expires against the plaintiff, his remedy is barred, but his right is not extinguished. … The importance of the distinction between the barring of a remedy and the extinction of a right of action can be quite significant. In the first place, the limitation defence must be expressly pleaded by the defendant, with the result that if he fails to do so and the plaintiff’s right of action still survives, there will be nothing to prevent the court from adjudicating on the matter in the absence of a plea of limitation of actions. A second consequence of the distinction is that it may be possible for a plaintiff to pursue his right by means other than seeking a judicial remedy. Although the plaintiff’s right to the remedy is barred by the expiration, the same is not true of his right. Thus if the plaintiff can lawfully pursue a self-help remedy, such as abating a nuisance, there will be nothing, in law, to prevent him from doing so. Similarly in the field of contract and commercial law, an unpaid seller of goods, in some circumstances, may have a lien over goods in his possession as security for the price, which can be exercised without the need to resort to court assistance. Similarly, there are certain rights in favour of a personal representative of an estate, such as the right to deduct from a legacy the amount of a statute-barred debt owed by the legatee to the estate or the right to deduct the amount of a statute-barred debt owed to himself. 16        The textbook, John Weeks,Preston and Newsom on Limitation of Actions(Longman, 4thEd, 1989), states at para 2.5.4: A security may be enforceable even if given for a statue-barred debt and if the creditor has any lien or charge for his debt he can enforce the lien or charge after the debt is barred:Spears v Hartley(1800) 3 Esp 81. Thus, if a solicitor has client’s documents upon which he has a lien an order for taxation of his costs should include any statute-barred items:Re Brockman[1909] 2 Ch 170. 17        I was of the view that the district judge had erred when she equated the absence of any legal action by JTC to proof that Econ had performed the contract without default. I will refer to an absence of default as full performance, for convenience. I was of the view that the fact that JTC had not commenced legal action could not be equated with a conclusion that Econ had fully performed because there could be other reasons, such as a limitation period, which precluded JTC from commencing legal action. Furthermore, while the district judge took into account the absence of legal action by JTC, she omitted to take into account the fact that Econ had not pursued its claim for the retention sum. The lack of pursuit by Econ would in turn suggest that it had not fully performed the contract but again that omission did not necessarily lead to a conclusion that Econ had defaulted in its performance. It might be that it did not pursue its claim for the retention sum in order to avoid a claim by JTC for a much larger amount. 18        I was also of the view that the district judge had erred in taking into account the fact that JTC had not joined Econ as a defendant in the arbitration to conclude that Econ had fully performed the contract. JTC may have believed that Econ had fully performed. JTC may have erred in not joining Econ as a defendant in the arbitration or in not filing a protective action. However, it is a quantum leap to conclude that all of that means that Econ had in fact fully performed the contract. 19        As regards the district judge’s observation that the SO had based her determination entirely on the arbitrator’s decision, the SO’s written determination dated 20 June 2005 stated that she had considered an exchange of correspondence between JTC and Econ and the arbitrator’s award on liability dated 31 March 2003. The SO’s written determination summarised JTC’s position in the arbitration which was that TAR, and not Econ, was to blame. However, the SO also noted that the arbitrator found that poor or defective workmanship on the part of Econ led to the defects and damage of the installed bored piles. Accordingly, while I accepted that the SO probably based her determination primarily, if not entirely, on the arbitrator’s decision, it seemed to me that the SO had taken into account the fact that JTC had already been arguing Econ’s positionvis-à-visTAR, but the arbitrator did not find TAR liable. 20        I was mindful of Ms Shanmugam’s arguments emphasising (a) that Econ was not a party to the arbitration and (b) the expiry of the limitation period. However, it was not as though Econ was not given a chance to present its position to the SO. Indeed, in Econ’s letter dated 25 May 2005, Econ had forwarded copies of correspondence to the SO and emphasised that it was not named as a defendant nor was it represented in the arbitration. It also emphasised that any finding in the arbitration was not binding on it. Significantly, Econ did not mention in that letter that any claim by JTC was time-barred. 21        It was not suggested by Ms Shanmugam that the expiry of a limitation period precluded JTC from even seeking the SO’s determination under Clause 43, the material part of which states: 43         Provided always that in case any dispute or difference ... shall arise between the Corporation or the Superintending Officer on its behalf and the Contractor, either during the progress or after completion of the Works or after the determination, abandonment or breach of the Contract as to the construction of the Contract or as to any matter or thing arising thereunder, or as to the withholding by the Superintending Officer of any progress payment to which the Contractor may claim to be entitled, then the Superintending Officer shall determine such dispute or difference by a written decision given to the Contractor. The said decision shall be final and binding on the parties unless the Contractor within 14 days of the receipt thereof by written notice to the Superintending Officer disputes the same, in which case or in case the Superintending Officer for 14 days after a written request to him by the Contractor fails to give a decision as aforesaid, such dispute or difference shall be referred to the arbitration and final decision of a person nominated and appointed by agreement between the Superintending Officer and the Contractor or, in event of his death or unwillingness or inability to act, or, if the Superintending Officer and Contractor fail to agree, of an arbitrator nominated by the Minister for Trade and Industry award of such Arbitrator shall be final and binding on the parties. 22        Even if JTC was so precluded, it was for Econ to expressly raise the limitation point with the SO. It did not. If JTC was not precluded from seeking the SO’s determination, then it was for Econ to raise the limitation point with the SO, in addition to the point that Econ was not a party to the arbitration between JTC and TAR. As I have mentioned, Econ did not raise the limitation point with the SO. 23        In any event, as Mr See submitted, it was for Econ to challenge the SO’s decision pursuant to Clause 43. It did not. No explanation was given in the affidavit filed for Econ as to why it omitted to take this step. Ms Shanmugam, however, said that it was not in Econ’s interest to pursue its recourse under Clause 43 because Econ was relying on the limitation point. To do so would open the Pandora’s box. 24        In such circumstances, was JTC precluded from making a call under the PB because of the limitation point? I did not think so. While I accepted that the PB was meant as security for any default by Econ under the contract, it was still a separate contract from that between Econ and JTC for the supply and installation of the bored piles. Whether JTC was precluded by a limitation period from making a call under the PB was to be determined by the terms of the PB itself. There was no argument by Ms Shanmugam that under the terms of the PB itself the time to make a demand had expired. 25        There was no expiry date in the PB. Neither was it stated to expire after a certain time from the end of a defects liability period. It was poorly drafted in an archaic form. It appeared to be perpetual until Econ fully performed its obligations or the full amount of the PB was paid. It did not even expressly state that payment would be made on demand provided Econ was in default. As there had to be default by Econ, it was not, in that sense, an “on demand” bond. However, generally, in both an “on demand” bond and a “default” bond, a call or a demand still has to be made. The difference is that for an “on demand” bond, there is no need for the beneficiary of the bond to establish default whereas for a “default” bond the beneficiary still has to establish the default. The nature of a bond depends on the terms thereof. For the PB, I was of the view that a demand had to be made and Econ’s default had to be established. JTC’s position was that by obtaining the SO’s determination, it had established Econ’s default. I agreed. 26        In the circumstances, I was of the view that JTC was not precluded from making a demand under the PB. While it is true that such a view would mean that AGIPL and Econ were open to claims for an indefinite period of time long after the completion of the contract between JTC and Econ, it was not quite right to say that this would be long after the expiry of the relevant limitation period. The latter depended on which limitation period one was considering: was it the limitation period to commence action under the contract between JTC and Econ or under the PB? 27        Besides, if Econ had raised the limitation point with the SO or pursued its recourse under Clause 43, the matter might have ended favourably for Econ. It seemed to me that Econ made a mistake in not raising the limitation point with the SO and might have made another mistake in not challenging the SO’s determination under Clause 43. Its fears of opening a Pandora’s box might not have been well-founded as any counterclaim by JTC in arbitration proceedings between Econ and JTC might still be time-barred. 28        In any event, Econ had elected its course of action. In the circumstances, I did not see any unconscionability in the conduct of JTC. 29        I would add that although I was of the view that JTC was not precluded from making a demand under the PB, I was also of the view that JTC had not yet established the amount of its damages. The PB had referred to a certificate of the SO thereon as being final and conclusive of the same. While I accepted Mr See’s argument that it was not mandatory for JTC to obtain such a certificate from the SO, JTC had not established the amount of its damages since the arbitrator’s award was not binding on Econ and the SO had not issued her certificate on the amount. 30        Mr See had sought to argue that JTC was entitled to payment for whatever it demanded under the PB, subject to the maximum sum thereunder, by virtue of condition (2) of the PB (see [11] above). He interpreted that to mean that full payment was to be made thereunder upon default by Econ. I did not agree. In my view, condition (2) merely meant that if, upon default by Econ, full payment was made by AGIPL to JTC, then the PB would cease to be valid. It was still for JTC to establish Econ’s default and the amount of JTC’s damages as a result thereof before AGIPL was obliged to pay under the PB. There is no appeal by JTC in respect of this part of my decision."
    }
}