{
    "case_title": "Volkswagen Financial Services Singapore Ltd v Public Prosecutor",
    "ncitation": "[2006] SGHC 48",
    "coram": "Yong Pung How CJ",
    "sections": {
        "Background facts": "2          The petitioner, VFS, was the owner of the vehicle and entered into a hire purchase agreement on 28 July 2004 with one Yogeswari d/o Thiagarajan (“Yogeswari”). 3          Between 28 July 2004 to 5 August 2004, Yogeswari’s husband, one Balamurukan s/o Kuppusamy (“Balamurukan”), used the vehicle to commit the offences of robbery (s 392 of the Penal Code (Cap 224, 1985 Rev Ed)), theft (s 379 of the Penal Code) and snatch theft (s 356 read with s 34 of the Penal Code). Balamurukan subsequently faced 15 charges for these offences, as well as for driving whilst under disqualification and driving without insurance. 4          He pleaded guilty to these offences and had been sentenced on 17 August 2005 to seven years of corrective training, 18 strokes of the cane and disqualification from driving for 16 years from the date of his release from prison.",
        "The petitioner’s case": "5          VFS submitted that the court retained the discretion to make a forfeiture order. The court should applyToh Teong Seng v PP[1995] 2 SLR 273which interpreted s 20 of the Environmental Public Health Act (Cap 95, 1988 Rev Ed) (“the 1988 EPHA”) which has since been repealed, and held that the court had a discretion to forfeit or release the vehicle. It contended thatToh Teong Seng v PPwas a case on all fours with the present and s 4 of the Act was materially identical to s 20 of the 1988 EPHA. In particular, VFS submitted that as s 4(3) of the Act referred to the discretion of the “court before which the prosecution with regard to the scheduled offence has been held”, it cannot refer to the instances under ss 4(4) and 4(6) which were instances “without prosecution”. Therefore, s 4(3) effectively referred to forfeiture under s 4(1). I will have occasion to return to this point later. 6          VFS also claimed that it was entirely innocent of wrongdoing, was an innocent third party, had no knowledge of the use of the vehicle in the commission of the offence, and did not benefit from the commission of the offence. 7          Further, VFS argued that the forfeiture would not have any deterrent effect whatsoever since the wrongdoer was not the person who suffered loss as a result of the forfeiture. To allow forfeiture would amount to imposing an additional fine which was out of proportion in the circumstances.",
        "The respondent’s case": "8          The Deputy Public Prosecutor (“DPP”) submitted that the trial judge was correct in holding that forfeiture under s 4(1) of the Act was mandatory.Toh Teong Seng v PPdid not apply because s 4 of the Act was not similarly worded as s 20 of the 1988 EPHA. The DPP argued that this difference in wording was significant because without specifically referring to s 4(1) of the Act, there was no conflict between ss 4(1) and 4(3) of the Act. 9          Moreover, a perusal of the parliamentary debates clearly showed that the Legislature intended forfeiture under s 4(1) of the Act to be mandatory.",
        "Principles of revision": "10        As I observed inHong Leong Finance Ltd v PP[2004] 4 SLR 475at [14]: The High Court’s revisionary powers are conferred by s 23 of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) (“SCJA”) and s 268 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“CPC”). It is established law that such powers of revision are discretionary and must be exercised sparingly. The test laid down by the courts is whether the failure to exercise revisionary powers will result in serious injustice being done. No precise definition of what constitutes serious injustice is possible. However, it must generally be shown that there was something palpably wrong in the decision by the court below, which strikes at its basis as an exercise of judicial power: seeAng Poh Chuan v PP[1996] 1 SLR 326, followed inMagnum Finance Bhd v PP[1996] 2 SLR 523andCredit Corporation (M) Bhd v PP[2000] 3 SLR 762. 11        A wide discretion is vested with the High Court in the exercise of its revisionary powers. It is thus axiomatic that if the trial court had erred in ordering forfeiture to the extent that there was a fundamental error occasioning clear failure of justice, the High Court could exercise revisionary jurisdiction.",
        "The decision below": "12        The trial judge held that forfeiture was mandatory for a vehicle seized by the police once the preconditions of s 4(1) of the Act were proved to the satisfaction of the court and the Attorney-General chose to make the application for forfeiture. 13        The offences committed by Balamurukan fell within para 1(i) of the Schedule under the Act, in particular, Chapter XVII of the Penal Code (comprising ss 378 to 462). Since the vehicle had been used in the commission of a scheduled offence and had since been seized by the police, and the Attorney-General had made a written application for forfeiture, there was no vestige of doubt that the elements of s 4(1) of the Act had been made out. 14        The issue before me, therefore, was whether it was mandatory or discretionary for the court to order the forfeiture. 15        The trial judge relied on two reasons to distinguishToh Teong Seng v PP(seeVolkswagen Financial Services Singapore Ltd v PP[2006] SGDC 18). First, the trial judge opined (at [19]) that unlike s 20(5) of the 1988 EPHA which applied to vehicles liable to forfeiture under s 20(4), s 4(3) of the Act was a power of release referable tothe whole of s 4of the Act. Owing to this crucial distinction, the power of release within s 4(3) of the Act would not be rendered superfluous if the word “shall” in s 4(1) was used in its mandatory sense. 16        Second, the trial judge stated (at [20]) that the forfeiture inToh Teong Seng v PPwas out of all proportion to the minor offences prosecuted under the 1988 EPHA. This rationale was not relevant to the case at hand. The offences listed in the Schedule to the Act are serious ones. 17        Further, the trial judge relied on s 9A(2)(a) of the Interpretation Act (Cap 1, 2002 Rev Ed) which allows the courts to have regard to extrinsic materials such as Parliamentary speeches to confirm that the meaning of the provision is the ordinary meaning conveyed by the text of the provision. The Parliamentary debates found in favour of a mandatory forfeiture. I will rule on this particular point later.",
        "The appeal": "18        AsToh Teong Seng v PPwas a pivotal case in this appeal, it necessitated closer examination. InToh Teong Seng v PP, I held that the word “shall” in s 20(4) of the 1988 EPHA was used in the directory sense,ie, there was a discretion to make a forfeiture order. In particular, I sought to reconcile the differences in wording under ss 20(4) and 20(5) of the 1988 EPHA which read: (4)A courton convicting any person of an offence under subsection (1)shall,on the written application of the Public Prosecutor, make an order for the forfeiture of the vehicle which has been used in the commission of the offence notwithstanding that no person may have been convicted of that offence. (5)        An order for the forfeiture or for the release of a vehicle liable to forfeitureunder subsection (4)may be made by the courtbefore which the prosecution with regard to an offence under subsection (1) has been or will be held. [emphasis added] 19        Sections 20(4) and 20(5) of the 1988 EPHA were similarly worded to ss 4(1) and (3) of the Act respectively. The latter two provisions read: (1)        Where it is proved to the satisfaction of a court that a road vehicle has been used in the commission of a scheduled offence or that any scheduled offence has been committed in respect of the road vehicle or in respect of any article found in the road vehicle or on any person found therein, or that a road vehicle has been used to convey persons to the scene where the scheduled offence has been committed, or that a road vehicle has been used for the escape or to facilitate the escape of any persons from the scene of a scheduled offenceandthat the road vehicle has been seized by the police,the court shall, on the written application of the Attorney-General, make an order for the forfeiture of the road vehicle, notwithstanding that no person may have been convicted of any scheduled offence. … (3)        An order for the forfeiture or for the release of a road vehicle liable to forfeitureunder this section may be made by the courtbefore which the prosecution with regard to the scheduled offence has been held. [emphasis added] 20        At a peripheral glance, the parallels between these provisions were apparent. They contained an intrinsic contradiction through the draftsman’s use of the words “shall” (which is mandatory) and “may” (which is directory). However, on closer analysis, these similarities may well indeed be more apparent than real. First, the wordings are not identical. Second, the Act in question has more conditions in place. Third, the forfeiture order inToh Teong Seng v PPwas set aside because a forfeiture was disproportionate to the offence. I will now deal with these pointsseriatim. The wordings in the two provisions are notinpari materia 21        InToh Teong Seng v PP, I stated at 280, [38] that, “Section 20 is, to put it mildly, not very well drafted.” Further, I added at 281, [39] that: Subsection (4) states that the court ‘shall’ make an order for forfeiture if the written application is made. However, sub-s (5) allows the court to make an order for the release of the vehicle notwithstanding that it is ‘liable to forfeiture under sub-s (4).’Since there is only one instance when the court can order forfeiture of the vehicle under sub-s (4), that is on the written application of the Public Prosecutor, this suggests that sub-s (5) is granting the court the discretion whether to forfeit the vehicle.Subsection (5) is therefore irreconcilable with sub-s (4) if the word ‘shall’ in sub-s (4) is used in the mandatory sense. This points to the conclusion that the word ‘shall’ in sub-s (4) is used in the directory sense. [emphasis added] 22        In deciding this appeal, it was my view that s 20(5) of the 1988 EPHA specifically limited the Court’s power to forfeit a road vehicle to s 20(4). On the contrary, s 4(3) of the Act allowed the court’s power of forfeiture to extend to the entire s 4. 23        I should add that a similar linguistic conundrum exists in s 4 of the Act because s 4(1) contains the word “shall”, while s 4(3) contains the word “may”. Thus, s 4 is equally badly drafted. As shown above, there was only one instance when the court could order forfeiture under the 1988 EPHA,ie, under s 20(4). Thus, there was specific reference to s 20(4) which contained the word “shall”. This resulted in a direct contradiction and conflict between the words “shall” in s 20(4) and “may” in s 20(5), and prompted a reconciliation of the divergence. In contrast, I found such palpable tension to be absent under the Act in question. Section 4(3) allows the court to forfeit or release the vehicle made under the entire s 4, not just a subsection. 24        I should also mention that if Parliament intended the court’s power under s 4(3) of the Act to be limited to s 4(1), it would have expressly drafted so, instead of referring to the entire section. Even if I accord s 4(3) its implied meaning, in the interest of justice,Toh Teong Seng v PPshould be distinguished. After all, that case dealt with a lorry dumping waste on state land and there was no necessity to go to the extreme measure of forfeiture, while the present case dealt with more serious offences which threatened social security and encompassed larger policy concerns. 25        I later expressed inToh Teong Seng v PPat 281, [40]: Furthermore, a reading of sub-ss (6), (7) and (8) reveals that if no prosecution is made, the owner of the vehicle may make a claim for the vehicle. However, if a prosecution is mounted, there is no provision for the owner of the vehicle to make a claim for it notwithstanding that there is no conviction.This suggests that the court should have the discretion whether to release the vehicle or order its forfeiture in such a case, especially since the alleged offender is not necessarily the owner and the prosecution may be frivolous. [emphasis added] 26        In the case at hand, I noted that ss 4(4), 4(5) and 4(6) of the Act were also materially identical to ss 20(6), 20(7) and 20(8) of the 1988 EPHA. I was of the view that the fears brewing inToh Teong Seng v PPas expressed in the preceding paragraph were unfounded in the present case. Over the years, the courts have developed a trend towards making finance and car rental companies responsible when entering into hire purchase or rental agreements for their vehicles. It was incumbent on them to take more precautions. Although VFS was not the offender, this did not justify any serious injustice that warranted the court’s exercise of its revisionary powers. Owing to the checks and balances provided by the more stringent and onerous prerequisites of s 4(1) of the Act, there is no cause for worry that the prosecution would be frivolous.",
        "There are more conditions to satisfy under s 4(1) of the Act": "27        Conviction was the only prerequisite under s 20(4) of the 1988 EPHA. On the other hand, s 4(1) of the Act lays down three preconditions before the court can make a forfeiture order,ie, the vehicle must be used in connection with a scheduled offence, the police must seize the vehicle and the Attorney-General must apply for forfeiture. I found that given the stringent preconditions that had to be satisfied before the court could grant a forfeiture, it would be egregious if the court’s power to forfeit was not mandatory, but discretionary. Compared with s 20 of the 1988 EPHA, there are more conditions in s 4(1) of the Act to fulfil and this raised the threshold of the grant of a forfeiture order. Naturally, the compliance with these conditions justified the mandatory grant of forfeiture. 28        In my view, it was imperative to make the forfeiture order mandatory on the written application of the Prosecution and upon the fulfilment of the three conditions. To argue otherwise would render s 4(1) nugatory and defeat the underlying objectives of imposing the three conditions, which are in themselves already difficult to fulfil.",
        "Would allowing the forfeiture order be disproportionate to the relevant maximum punishment?": "29        The Act is a specifically enacted provision that deals only with the question of forfeiture of road vehicles. It encompasses three preconditions that had to be satisfied before an application to forfeit can be brought. Section 6 of the Act states that, “Any person who contravenes of [sic]fails to comply with the provisions of this Actshall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding 6 months or to both.” [emphasis added] 30        InToh Teong Seng v PP, the forfeiture order was made under s 20 of the 1988 EPHA. Unlike the Act in question, the 1988 EPHA did not deal solely with forfeiture. The maximum penalty conferred for s 20 of the 1988 EPHA was found in s 21(1) of the 1988 EPHA which read: Any personwho commits an offence under section 18, 19, or 20may be arrested without warrant by any police officer, public health officer or public officer authorised in writing in that behalf by the Commissioner and taken before a Magistrate’s Court and shall be liable on conviction toa fine not exceeding $1,000and in the case of a second or subsequent conviction to a fine not exceeding $2,000. [emphasis added] 31        InToh Teong Seng v PP, I set aside the forfeiture order because “the value of a vehicle such as the one in this case easily exceeds $100,000. Ordering its forfeiture would amount to imposing an additional fine exceeding $100,000 on the appellant in addition to the $800 already imposed. That would be quite wrong.”: at 281–282, [42]. It should be noted that under the 1988 EPHA, the penalty for breaching s 20(1) under s 21 was a fine of $1,000. Subsequent revised editions increased the penalty to $10,000 or imprisonment for a term not exceeding 12 months or to both and later, $50,000 or imprisonment for a term not exceeding 12 months or to both. The vast jump from $1,000 to $50,000 demonstrates Parliament’s emphasis on reducing the number of cars on hire purchase being used to bring criminal activities to fruition. The persistent violation of this warning will be sternly dealt with. 32        In the present case, s 6 of the Act deals with one who does not comply with the Act. Besides, as I have previously observed that the Act is a specific provision on forfeiture, it would be quixotic on my part to simply look at the penalties under s 6 of the Act. Instead, it was a wiser choice to be armed with a broader policy perspective and focus on the offences which were committed using the vehicle in question. 33        I underscored the importance of considering whether forfeiture was proportionate to both the gravity of the offence committed and the maximum punishment provided under the forfeiture statute inMagnum Finance Bhd v PP([10]supra) at 532, [38]: Finally, I note that the district judge did not consider whether forfeiture would have been proportionate to the gravity of the offence, or to the maximum punishment provided for under s 140 of the Charter. In arguing that forfeiture was necessary as a deterrent, the DPP also suggested that this was because the offence committed was a serious one. A maximum sentence of $10,000 or five years’ imprisonment may be imposed by the court under s 140. The accused was fined $8,000.The offence in question was not even considered sufficiently serious to warrant a custodial sentence, let alone the maximum fine of $10,000.This only creates further doubt as to whether forfeiture was appropriate. [emphasis added] 34        I considered the maximum punishments that Balamurukan could have been accorded. Under s 356 of the Penal Code, the maximum imprisonment was seven years for snatch theft. Under s 379 of the Penal Code, the maximum imprisonment was three years for theft. Under s 392 of the Penal Code, the maximum imprisonment was ten years and the minimum for caning was six strokes. A notable thread running through the offences Balamurukan was convicted of was how grave, serious and severe they were. Looked at in this light, therefore, it was clear that forfeiture in the present case was proper. 35        The courts should not be too quick in indulging and condoning such pernicious acts. In the circumstances, forfeiting the vehicle would not be disproportionate to the offences committed. There was evidently no serious injustice. I was of the view that forfeiture was appropriate due to the grave nature of the offences.",
        "Responsibility of finance companies": "36        As I accentuated inHong Leong Finance Ltd v PP([10]supra) at [25]: Finance companies are responsible for the use of their vehicles and for protecting themselves against loss of their vehicles. Finance companies are well aware of the commercial risk associated with lending out vehicles on hire purchase. Therefore, they should inquire more carefully about the customer’s occupation and place of work. If finance companies find difficulty in keeping watch on the use of their vehicles, they should insure themselves against the loss of their vehicles and, if they so desire, have the customer pay the cost of the insurance premiums. 37        The absence of criminal involvement by the petitioner was irrelevant. I observed inCredit Corporation (M) Bhd v PP([10]supra) at [11] that: The petitioner claimed that as an innocent party it was unjustifiable that they be penalised. However, I made clear inPublic Finance Bhd v PP[1997] 3 SLR 354,PP v Mayban Finance (Singapore) Ltd[1998] 1 SLR 462andPP v M/s Serve You Motor Services[1996] 1 SLR 669that, even though the court sympathised with the owners, forfeiture must be ordered once it has been used in the commission of the offence, regardless of whether the petitioner had participated in the criminal offence. The provision is clear and mandatory. The owners would have to be left to their remedies against the offenders. 38        It bears repeating that it is incumbent on finance and hire purchase companies to take extra care when entering into hire purchase agreements for their vehicles. Mandatory forfeiture places the onus on vehicle owners to exercise due diligence to ensure their vehicles do not serve as transportation tools to facilitate criminal activity. The courts have been constantly sending out this clear message in a long line of cases dealing with forfeiture.",
        "Deterrent effect": "39        Section 9A(1) of the Interpretation Act states that: In the interpretation of a provision of a written law, an interpretation that wouldpromote the purpose or object underlying the written law(whether that purpose or object is expressly stated in the written law or not) shall be preferred to an interpretation that would not promote that purpose or object. [emphasis added] 40        It should be noted that the objective of the Act was “to give power to restrict the use of, stop and search road vehicles and to provide for the seizure and forfeiture of road vehicles and articles found therein in certain circumstances and matters incidental thereto”. It was a special power of forfeiture conferred by Parliament. Hence, the purpose of s 4 is to deter the use of vehicles for the scheduled offences which are, in my view, of serious nature and pose an imminent impact on public safety and social order. 41        If vehicles were returned to innocent owners, it would be a simple feat for persons contemplating theft and robbery to obtain possession of vehicles to facilitate their crimes. I stated inCredit Corporation (M) Bhd v PPat [17] that: [M]andatory forfeiture of the vehicles puts the onus on the vehicle owners to exercise care and responsibility when lending or hiring out their vehicles. By extension, it also places onus on hirers and borrowers to exercise greater care in preventing their vehicles from becoming easy theft targets. 42        Again, I reiterated inCredit Corporation (M) Bhd v PPat [38]: Car rental and finance companies should modify their trade practices to cover themselves. The cost will be passed down to car hirers or borrowers. With the deterrent effect of pecuniary loss, all parties will be made to be more careful in handling their vehicles. 43        In the absence of a mandatory forfeiture, the standards of hire purchase companies might grow lax as the hirers would not be encouraged to inquire into their customers’ backgrounds. In a case such as this where the offences were serious and even involving a life being sacrificed in a snatch theft, it is the inherent responsibility of the court to prevent the vehicle from being used in the commission of further offences.",
        "Use of parliamentary debates": "44        At [17], I mentioned that the trial judge relied on s 9A(2) of the Interpretation Act. Having considered and cited several parliamentary extracts, the trial judge was satisfied that the power of the court under s 4(1) of the Act was mandatory. 45        It was understood that the rationale as set out by s 9A(2) of the Interpretation Act was to permit the court to have regard to extrinsic materials such as parliamentary speeches to confirm the ordinary meaning of the provision and to ascertain the meaning of an ambiguous provision. What was crucial was whether the language of s 4 of the Act was ambiguous and, therefore, required confirmation of its meaning. 46        I was of the view that the provision in question was not ambiguous. Parliamentary debates are not necessary if the wording of the statute is clear. As far as I am aware, counsel have been including parliamentary speeches in their written and oral arguments, even though the language of a statutory provision was clear. This has evolved into a worrying trend. 47        Justice ought to be administered in accordance with the law, more so if the law is clear and precise. The courts have no choice but to adopt the law in its totality. Citing parliamentary debates would be of little use if the legislation required no further explanation. Such extrinsic materials would then be rendered otiose and would result in a waste of the court’s time.",
        "Conclusion": "48        Once the Attorney-General has made a forfeiture application, the courts should only be concerned with whether the three conditions have been met. And when they have been, a forfeiture order must be made. 49        The trial judge held (at [22]) that even if there existed discretion on the part of the court, the sole reason proferred by VFS was that it was a hire purchase company and as such, had no direct control over its vehicles. As I have already alluded to above, finance companies are responsible for the use of their vehicles and for protecting themselves, through insurance or otherwise, against the loss of their vehicles. To hold that the court’s power to order forfeiture here was discretionary would lead to a schism in the long line of decisions restating the serious responsibilities that hire purchase companies bear. To this end, the trial judge rightly ordered the forfeiture of the vehicle. There was no necessity to exercise revisionary jurisdiction. 50        The petition for criminal revision was accordingly dismissed."
    }
}