{
    "case_title": "Hennedige Oliver v Singapore Dental Council",
    "ncitation": "[2006] SGHC 218",
    "coram": "Tan Lee Meng J",
    "sections": {
        "[A]       BACKGROUND": "2          The appellant practises under the name and style of “Oliver Dental Surgery Pte Ltd” (“the clinic”) at No 242 Tanjong Katong Road, Singapore 437030. 3          On 24 August 2004, the complainant filed a complaint against him to the SDC, alleging that he had not informed her that the mini implant he intended to put into one of her teeth necessitated the capping of an adjacent front tooth to hold the implanted tooth in place.  The said complaint was forwarded to the SDC’s Ethics Committee for mediation.  After mediation efforts failed, the SDC recommended that the complainant file a claim at the Small Claims Tribunal for the recovery of the charges for the dental treatment that she paid to the appellant.  At the Small Claims Tribunal, the claim was withdrawn by consent on 13 May 2005. 4          Subsequently, on 7 June 2005, the complainant made a second complaint to the SDC.  Her complaint was forwarded to the SDC’s Complaints Committee, which dismissed the following allegations made by her against the appellant: (a)        that on 23 July 2004, the appellant embarrassed her by shouting at her in public; (b)        that the aesthetic impact of the crowns put by the appellant on her teeth (#23 and #24) had an undesirable impact on her social life; and (c)        that the appellant had failed to exercise the requisite standard of care while treating her. 5          Although the Complaints Committee found most of the complainant’s accusations against the appellant to be without foundation, it decided that her allegation that the appellant had not obtained her informed consent for the mini implant procedure was serious enough for him to face the DC.",
        "[B]       THE INQUIRY": "6          The DC heard both the complainant and the appellant.  In addition, it heard two expert witnesses for the prosecution, namely Dr Loh Poey Ling and Dr Ken Tan, and four of the appellant’s witnesses, namely Dr Ho King Peng, Dr Siva Rajendram, Ms Magie Barganza Morillo (“Magie”) and Ms Maria Franchelle (“Franny”). 7          The charge against the appellant was as follows: That you DR OLIVER HENNEDIGE are charged that on or about 21 April 2004, you failed to obtain the informed consent of one, Shanta Wilhemina Sena (the “Patient”)… prior to carrying out the Imtec mini implant procedure .. on her left canine (#23) .. to wit, by failing to inform the Patient  of the material risk that the adjacent tooth to the Left Canine ie  first permanent premolar (#24) … may be involved in the overall dental management.",
        "The complainant’s version of events": "8          The complainant said that she went to the appellant’s clinic (“the clinic”) on 8 April 2004 because she was suffering from pain as a result of her broken upper left canine (“tooth #23”).  As the appellant was not at the clinic, she consulted his colleague, one Dr Ho King Peng (“Dr Ho”), who prescribed painkillers to help her cope with the pain. 9          On 21 April 2004, the complainant went to the clinic to have her tooth #23 treated.  She claimed that the appellant, who informed her that her tooth #23 was broken and could not be capped, suggested that she use a bridge to replace the broken tooth.  She asserted that she informed the appellant that she was very particular about her front teeth and did not want any procedure that affected them.  She said that the appellant then suggested that she have a mini implant inserted. 10        The complainant said that when queried as to what an implant was, the appellant said that it was just “putting something into the gums”. Without being aware of the ramifications of the proposed mini implant, she agreed to have the mini implant carried out.  Treatment included the extraction of the complainant’s canine tooth #23.  According to her, it was only after the extraction of this tooth that the appellant told her that it was necessary for her tooth #24 to be capped to hold the implant.  As her tooth #23 had already been extracted, she had no choice but to proceed with the procedure and two temporary crowns were fitted onto her teeth. 11        The mini implant procedure was completed on 10 July 2004 and the complainant remained dissatisfied with the treatment and results.",
        "The appellant’s version of events": "12        The appellant contended that on the morning of 21 April 2004, he explained the various options available to the complainant.  He said that he informed her that a mini implant would involve tooth #24 and that the complainant was attracted to the mini implant procedure because it would involve the capping of only one adjacent tooth (#24) unlike a 3-unit bridge, which would have involved the capping of two adjacent teeth (#22 and #24). 13        The appellant asserted that on the evening of 21 April 2004, he prepared tooth #24 for crowning.  It was only after this had been done that tooth #23 was extracted.  The temporary crowns were then fitted onto both teeth and the whole procedure, inclusive of the insertion of permanent crowns, was completed on 10 July 2004.",
        "The DC’s decision": "14        The DC found the appellant guilty of professional misconduct in failing to obtain the informed consent of the complainant for the mini implant procedure.  On 25 May 2006, the appellant filed his appeal against the decision of the DC. 15        When this appeal was first heard on 25 July 2006, the DC had not furnished grounds for its decision.  This was unsatisfactory for as Karthigesu J, as he then was, said in theIn the Matter of an Appeal by Alex Ooi Koon Hean[1991] SGHC 82: [E]xcept in the most straightforward of cases, the Medical Council and indeed every professional body entrusted with the statutory duty of maintaining professional standards and conduct should give reasons in support of the findings of fact in respect of each of the essential ingredients of the charges.  Failure to do so can only result in the arduous task of the Appellate Court, in the words of Lord Radcliffe inFox v General Medical Council,having to “take a comprehensive view of the evidence as a whole and endeavour to form its own conclusion whether a proper inquiry was held and a proper finding made on it” in order to assure that there has been no miscarriage of justice albeit to see that the finding of guilt is not “out of tune” with the evidence. 16        The hearing was adjourned for the DC to furnish grounds for its decision.  The DC’s grounds of decision dated 21 August 2006 were subsequently forwarded to the court and the hearing of the appeal resumed on 22 November 2006.",
        "[C]       THE APPEAL": "17        When considering an appeal against the decision of the SDC, reference should first be made to section 47(3) of the Dentists Act, which provides as follows: In any appeal to the High Court against a decision referred to in section 44(1) or (2), the High Courtshall accept as final and conclusiveany finding of the Disciplinary Committee relating to any issue of ethics or standards of professional conductunless such finding is in the opinion of the Court unsafe, unreasonable or contrary to the evidence. 18        In the light of section 47(3) of the Dental Act, the question before the court was whether or not the DC’s decision is unsafe, unreasonable or contrary to the evidence. That the court should not, without more, interfere with findings of the DC in relation to standards of professional conduct was stressed inTan Sek Ho v Singapore Dental Board[1999] 4 SLR 757,764, where Amarjeet Singh JC stated as follows: Whilst admittedly such appeals are indeed by way of re-hearing, courts have consistently observed and held that a tribunal’s conclusion should not be lightly treated as a tribunal’s members – in this case a specialised and professional tribunal’s members – were not only in a much better position to assess the credibility of witnesses but were also acting on their knowledge and experience in the respective profession and as the peers of the person whose conduct they were examining. 19        In his Grounds of Appeal, the appellant asserted that the DC’s decision is unsafe, unreasonable or contrary to the evidence.",
        "Allegation of bias": "20        For a start, a serious allegation was made that the DC members were biased and prejudiced against the appellant.  Reference was made toFranklin v Minister of Town and Country Planning[1948] AC 87, where Lord Thankerton said: I could wish that the use of the word “bias” should be confined to its proper sphere.  Its proper significance, in my opinion, is to denote a departure from the standard of even handed justice which the law requires from those who occupy judicial office, or those who are commonly regarded as holding a quasi-judicial office, such as an arbitrator. The reason for this clearly is that, having to adjudicate as between two or more parties, he must come to his adjudication with an independent mind, without any inclination, or bias towards one side to other in the dispute. 21        The following passage from the judgment of Chan Sek Keong J, as he then was, inRe Singh Kalpanath[1992] 2 SLR 639, 666-667 in relation to the Law Society’s disciplinary committee was also relied upon: A judge is expected to maintain the highest standard of conduct in the exercise of his functions.  He must bring an open and impartial mind to the determination of the dispute before him and must not act in any way which compromises the integrity of the judicial process.  The standard required of the chairman of the disciplinary committee under the Legal Profession Act is just as high, and is commensurate with the standard of that office, having regard to the statutory qualifications for holding that office and the powers of the committee.  Further, the committee is vested with powers to make findings and determinations which may affect the reputation or livelihood of an advocate and solicitor. 22        In para 7 of his written submissions dated 16 November 2006, his counsel, Dr Myint Soe, put his client’s position as follows: One background factor which has contributed to the said bias and prejudice in this case is that all DC members (other than the Observer who is a layman) are not General Practitioners.  They are familiar with conventional implants, and do not do or do not look favourably on mini dental implants which [are] far cheaper and [take] far less time to complete the procedure.  The Appellant was therefore basically regarded as a delinquent; by specialising and making money as an exponent of mini implants in Singapore, having done about 2000 … mini implants in the past 4 years or so. Hence their questioning of the Appellant and his witnesses went far beyond clarification and became inquisitorial.  Additionally, a lot of it went far beyond the charge to matters not in issue. 23        There was no evidence whatsoever to support the bald assertion that most of the DC members regarded the appellant as a delinquent or that they were unhappy that he earned money from mini implants.  In any case, the issue before the DC was not whether conventional implants are better than mini implants but whether the informed consent of the complainant had been obtained before the mini implant procedure was carried out.  As such, this ground of bias need not be further considered. 24        Another ground for complaining about bias was that there was an alleged contrast in the DC’s treatment of the complainant and the appellant.  It was asserted that the DC treated the complainant “most kindly and gently” whereas the appellant was robustly examined and his evidence strongly challenged time and again by the chairman and members of the DC.   However, the number of injections in a disciplinary inquiry is, without more, neither here not there.  DC members are entitled to seek clarification from the person charged.  In this case, it must not be overlooked that the complainant’s evidence is necessarily limited in scope because she only has to say what she had been or had not been told by the appellant before the mini implant procedure was carried out.  On the other hand, the appellant’s evidence covered much wider ground.  Apart from explaining what he told the complainant, he initially challenged the applicability of the principle of informed consent and raised issued such as whether or not he explained to the complainant alternative forms of treatment available to her, such as  root canal treatment, whether or not he used a hand mirror to show the complainant the teeth that would be affected by the mini implant and whether his treatment cards, on which he scribbled notes in different coloured ink and in pencil and outside the margin for notes, had been “doctored” after the complaint was made.  Furthermore, part of the appellant’s evidence at the inquiry had not been mentioned in the written Explanation that he had submitted earlier on while aspects of his oral evidence contradicted what had been stated in the said written Explanation.  In these circumstances, the appellant must expect his peers in the DC to question him thoroughly on his many assertions.  A brief look at some of his answers during the inquiry will reveal that often enough, additional questions and injections resulted from the nature of his answers.  As such, this ground of bias also has no foundation.",
        "Whether the decision of the DC is against the weight of evidence": "25        The DC is entitled to prefer the complainant’s evidence rather than that of the appellant and it cannot be overlooked that the members of the DC had the opportunity to question them and observe their demeanour.  All the same, its decision must be based on proper evidence.  If the complainant’s assertions against the appellant in relation to the charge against him do not rest on solid ground, the DC cannot, without more, find the appellant guilty of the charge.  This is so because it is for the prosecution to prove the charge against the appellant. 26        In her letter of complaint to the SDC dated 7 June 2005, the complainant stated, inter alia, as follows: Dr Oliver had totally ruined my nice set of front teeth regarding the size and colour and unnecessary covering of another good tooth, No 4 upper left, which had totally affected me badly as I do not like to open my mouth or even smile. I went to Dr Oliver with my upper left No 3 tooth broken.  Dr Oliver said it cannot be capped so he advised me to make a bridge.  I did not want another good tooth No 4 upper left to be capped.  Dr Oliver suggested an implant. Dr Oliver described “An Implant” is just putting something in my gums”.  Only after taking the No 3 upper tooth out, Dr Oliver said the tooth is too large so the next tooth has to be capped to hold the implant.  I was not told of this before taking the tooth out. I had no choice but to do it after the tooth was out.  I was also not told before work was done that the gums of No 3 Upper left had to be cut deep inside for the implant. If only I [had] been told the truth right from the beginning I would not even have taken my tooth out. 27        The record of the proceedings of the inquiry reveals that the complainant was totally confused or inconsistent about the dental treatment by the appellant at the clinic on far too many occasions.  Initially, she said that she first consulted the appellant on 22 April 2004 but she finally conceded that the consultation was on 21 April 2004.  Admittedly, part of the confusion was because the receipt that had been given to her by the clinic had been dated 22 April 2004 when it should have been dated 21 April 2004. In relation to the mistaken dates, the DC stated as follows in paragraphs 9 and 10 of its Grounds of Decision: 9          [T]he Respondent’s Counsel raised the issue of the discrepancy in the Complainant’s recollection of these events; in that the Complainant remembered the mini implant procedure as having taken place on 22 April 2004 instead of 21 April 2004, which was reflected on the treatment cards.  The Complainant was asked to explain this discrepancy …. Her explanation was that she had relied on the date stated on the payment receipt.  This receipt was wrongly dated by the Respondent’s staff.  When it was highlighted to the Complainant that the receipt was wrongly dated, she accepted that the date of the mini implant procedure to be 21 April 2004 and she took no issue with it. 10         This Committee considered the issue of the variance of the Complainant’s recollection on the dates of the mini implant procedure and the Respondent’s treatment notes.  The Committee found the discrepancy in the dates and timings immaterial and did not affect the main issue of informed consent. 28        What must be noted is that the complainant remained confused about the dates of her treatment and, more importantly, about the sequence of events at the clinic after she finally accepted that she first consulted the appellant at the clinic on 21 April 2004.  It was even more disturbing that the complainant was not sure whether the mini-implant procedure had been substantially completed on one day, as the notes on the treatment card revealed, or over two days.  All these went to the question of the credibility of her evidence and were given insufficient attention by the DC. 29        The complainant claimed that she saw the appellant three times on the treatment date, which she finally accepted was 21 April 2004.  Her sequence of events was as follows: (a)        She first consulted the appellant for only a few minutes at around 9 am, after which she was given a green pamphlet on implants to read. (b)        She then waited in the clinic for around 3 ½ hours until 12.55 pm, only to be given another few minutes of consultation with the appellant. (c)        She returned to the clinic at 5 pm to inform the appellant that she had decided to have the implant in question; (d)        The major part of the implant procedure was carried out on the next day (ie 22 April 2004). 30        The complainant’s claim that she saw the appellant for only a few minutes at around 9 am and had to wait for more than three and a half hours before she managed to see the appellant at 12.55 pm for another few minutes is clearly not credible.  She testified that she was furious about having to wait so long and that she knew that it was then 12.55 pm because there was a clock at the clinic and she had a watch.   It is most unlikely that the appellant had seen her at 12.55 pm because there was ample evidence that he, an active Rotarian, was at a Rotary Club lunch on that day, which started at 12.30 pm.  The appellant’s receptionist, Magie, testified that he made it a point to attend the Rotary Club’s lunch every Wednesday and that on 21 April 2004, he had left the clinic for the lunch between 11.30 am and 12 noon.  The President of the Rotary Club of Singapore, Mr Manik Shahani, confirmed in writing that the appellant was present at the club’s lunch on 21 April 2004.  If the appellant had really attended to the complainant at 12.55 pm, it would have made little sense for him after having seen her to attend the lunch, which was scheduled for 12.30 pm to 2pm, at the Mandarin Hotel in Orchard Road, which is some distance away from his clinic at Katong. 31        In contrast, the appellant contended that he had only one session with her before lunch and that was between 9.15 am to 10.15 am. It is worth noting that when questioned by the chairman of the DC about whether or not she admitted to having been seen by the appellant on 21 April 2004, she readily replied that that it was on themorningof 21 April 2004 when “he described about the implantand all that”.The notes in the complainant’s treatment card for this consultation on the morning of 21 April 2004 included, among other things, the following: X L 3                            40 Perioglas + GTR           150 3-unit bridge                  1140 Imp                               700 2 Cr                              760 32        Dr Myint Soe submitted that the notes in question spoke volumes. To begin with, it was recorded that the extraction of tooth #23 would cost the complainant $40.  Secondly, it was duly noted that the combined cost of the perioglas bone material and the membrane which is put on the perioglas is $150.  Thirdly, it was stated in the notes that the cost of a 3-unit bridge was $1,140.  Finally, the notes referred to the cost of the two crowns required in relation to the extracted tooth and tooth #24.  The complainant admitted that the price of the implant was quoted to her.  Moreover, x-rays and impressions of the complainant’s teeth were taken before she left the clinic on the morning of 21 April 2004.  I thus find that the appellant’s assertion that he saw the complainant for about an hour on the morning of 21 April 2004 to be more believable than the complainant’s version that she was seen by the appellant for only a few minutes at around 9 am and for another few minutes at around 12.55 pm. 33        As for the complainant’s assertion that she had returned to the clinic at 5pm to inform the appellant that she had decided on the mini implant procedure, there were also massive gaps in her evidence.  She accepted that the extraction  of tooth #23 was done on the evening of 21 April 2004 but she contradicted herself when she said that nothing other than the taking of x-rays had been done that evening and that the mini implant procedure was then carried out on the following morning. 34        At the hearing of the appeal, it was not disputed that it was on the evening of 21 April 2004 that tooth #24 was shaven, tooth #23 was extracted and both these two teeth were fitted with temporary crowns.  Furthermore, while the complainant did visit the clinic on the following morning, it was not to carry out any implant procedure but to seek relief for what she claimed was swelling after the previous evening’s treatment.  She saw the appellant’s colleague, Dr Ho, because the appellant was out of town and could not have attended to her on 22 April 2004. 35        Why the complainant insisted that she had been treated by the appellant on the next morning (ie 22 April 2004) and that it was then that she first learnt that tooth #24 was going to be capped cannot be fathomed. Her claim that the appellant attended to her on the evening of 21 April 2004 and on the following morning was unequivocal.  The relevant part of the proceedings when she was questioned by Dr Myint Soe is as follows: Q.        Whatever was done to you, the whole lot, on 22nd.  You say 22nd, we say 21st.  Whatever was done to you was done on 21stevening.  Do you agree? It could be a lapse of memory. A.        The whole lot is what. Q.        The whole lot is the capping of twenty four, subsequently the extraction of twenty three, then the putting in the perioglas, putting in the GTR, stitching it, and other steps to make a temporary crown so that you can leave the clinic with two temporary crowns so nobody will laugh at you. A.        The whole lot was done on 22ndto me.  But I don’t argue the fact that he said he pulled out on 21st.  The date is no big deal to me.  But what’s done on 22ndwas important to me. [emphasis added] 36        When given another chance to clarify the position, the complainant again made a distinction between the extraction of her tooth on 21 April 2004 and other procedures on 22 April 2004. The relevant part of the complainant’s evidence is as follows: OK, I don’t argue if he says he pulled out 21st.  But nothing was touched about number 4 or said on the 21st. Everything was done on the 22nd. 37        Subsequently, when a member of the DC tried to clarify matters, the position became even more confusing as the complainant had another version of events.  This time, she said that her tooth was extracted the following morning.  The relevant part of the transcript is as follows: Q.        So x-rays were taken in the evening on the 21st.  What else were done? A.        That’s all. Q.        No other things? A.        To my knowledge, that’s all.  To my knowledge, based on this, its 22ndthe pulling out of that tooth. 38        There is no basis for assuming that the complainant made a mistake about the sequence of events due to the mis-dated receipt issued by the clinic.   The following part of the transcript of the proceedings, during which she was questioned by the appellant’s counsel, Dr Myint Soe, shows that the complainant was clear that she was treated by the appellant over two days, namely, the 21 April 2004 and the following day: Q.        [Y]ou saw him in the morning.  The capping and extraction took place in the evening of 21stApril, not 22nd.  It is a slight mistake on your part.  You agree? Possible? A.        OK, doesn’t matter.But what was said and done regarding the cappingand about the tooth being big, #3 upper left was all donethe next morning, 22nd…. Q.        So you’re still arguing. A.Now 22ndis definite.    [emphasis added] 39        It cannot be overlooked that as it was not disputed that the appellant had prepared tooth #24 for cappingbeforetooth #23 was extracted on the evening of 21 April 2004.  In view of this, the complainant must have known that her tooth #24 had been shaven and reduced in size for the purpose of fitting a temporary crown before her canine tooth was extracted.  The appellant explained the position at the inquiry as follows: [W]hen I trimmed the teeth, a lot of this material would be flying around … [S]he would know that I was trimming her tooth, notwithstanding the fact that it was numb because I would have asked her to wash her mouth and she would have seen bits and pieces of amalgam in her mouth that will just crumble and break and fall on the floor of mouth and suction sometimes takes all the amalgam, sometimes it doesn’t always take all.  And when you trim amalgam, there’s always like a brownish or greyish mesh that even falls on the tongue.  The scrapping of the amalgam, it would all be there.  And when she spits out, she will see all those bits and pieces.  She will know that I’m doing L4 and nothing else and she was told I’m going to do L4 and she knows that in order to put a dummy tooth there, I need to attach it to somewhere and she knows I’m going to do L4.  She only keeps on insisting “Do not touch my L2, the lateral should not be touched”.  I said “Don’t worry, I won’t touch that tooth”. 40        The fact that tooth #24 was trimmed for capping before tooth #23 was extracted completely undermined the foundation of the complainant’s case, which is that she did not know that her tooth #24 would be affected before her tooth #23 was extracted. This is especially so since she has previously had crowns fitted onto her teeth. 41        Undoubtedly, the complainant’s rambling and contradictory evidence could not justify any finding that the appellant was guilty of the charge faced by him.  The next question to be determined is whether or not the appellant’s evidence gave the DC any reason to find him guilty of the charge faced by him.  The appellant has to take much of the blame for the poor impression the DC had of him and his evidence.  For instance, the transcription of the notes on the complainant’s treatment card that he furnished to the DC was inaccurate and embellished and there was reason to believe that some notes written in pencil above the margin for notes, which pointed to his having explained to the complainant other options such as root canal treatment on the morning of 21 April 2004, had been added after the treatment to advance his case at the inquiry.  Thus, the attention of the DC was diverted to these mysterious “additional” notes.  However, notwithstanding the shortcomings in the appellant’s case, whether or not a failure to mention to the complainant other options such as root canal treatment smacks of lack of professionalism is not relevant to the charge faced by the appellant.   More importantly, while the DC found the appellant evidence unsatisfactory, it must be borne in mind that inYeo See Koon Jimmy v PP[1994] 3 SLR 539, 549, Yong Pung How CJ, while referring to the effect of defects in a defendant’s case, rightly stressed that however tenuous that defence may be, the burden still lies on the prosecution to prove its case and in discharging that burden, it is simply insufficient for them to point to the inadequacies of the defendant’s testimony.",
        "[D]       CONCLUSION": "42        I am grateful to both Dr Myint Soe and SDC’s counsel, Mr Tan Chee Meng SC, for their very clear and detailed submissions in this case.  Both of them rendered much assistance to the court.  I am mindful of the fact that the DC found that the appellant’s evidence left much to be desired.   All the same, the prosecution has to prove its case against him beyond reasonable doubt.  This was not done and it was clearly not safe for the DC to find the appellant guilty of the charge faced by him. In view of this, the decision of the DC is set aside."
    }
}