{
    "case_title": "Main-Line Corporate Holdings Ltd v United Overseas Bank Ltd and Another (First Currency Choice Pte Ltd, Third Party)",
    "ncitation": "[2006] SGHC 233",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       At the conclusion of this 18-day trial, parties agreed to make written closing submissions in sequential order, with the plaintiff tendering its submissions first, followed by the two defendants’ submissions and with the plaintiff having the right to file submissions in reply. 2       On 5 October 2004, the plaintiff commenced this action against the first defendant (“UOB”) only for allegedly infringing its Singapore Patent No.  86037 (W/O 01/04846) titled DYNAMIC CURRENCY CONVERSION FOR CARD PAYMENT SYSTEMS (“the patent”). The following month, the second defendant (“FCC”) applied to be added as a defendant and the writ of summons was amended accordingly. Both defendants denied infringement of the patent and counterclaimed for the revocation of the patent. UOB also claimed an indemnity from FCC in the event that it was found liable for infringement of the patent. Insofar as these third party proceedings are concerned, by an order of court made by consent on 17 December 2004, UOB obtained judgment against FCC for a declaration that FCC is liable to indemnify UOB in respect of any sum that UOB may be held liable to pay to the plaintiff in respect of this action, including the plaintiff’s costs, and UOB’s costs incurred in this action and the third party proceedings on an indemnity basis. 3       The plaintiff is a company incorporated in Ireland and is one of the corporate vehicles for holding the intellectual property assets of an Irish group of companies called the Fintrax Group. A major business area of this group is in multiple-currency credit card payment systems. The group is also involved in the business of providing tourist tax refunds services and multiple currency transaction processing, consultancy and software development for these services. It is the proprietor of the patent, which was granted on 30 June 2003, with its priority date being 12 July 1999 (“the priority date”). The plaintiff holds a similar patent in Europe granted by the European Patent Office (“EPO”) on 5 December 2001. 4       UOB is a bank incorporated under Singapore law and is one of the major local banks here. FCC is a company incorporated under Singapore law with its main business being the provision of dynamic currency conversion payment services to retailers. It is the proprietor of the First Currency Choice System (“the FCC system”) created by itself and made available in Singapore in or about 2001. The FCC system has since been made available in various countries in Europe and Asia. It is also involved in opposition proceedings in Australia against the plaintiff’s Australian patent, which is substantially identical in scope to the patent as both patents were derived from the same Patent Cooperation Treaty application.",
        "The parties’ case and the evidence": "5       The patent covers a method and system to determine the operating currency in which to process a transaction for a credit card (for instance, VISA and MasterCard), a charge card (such as American Express) or a debit card (such as Cirrus and Maestro) at the point of sale between a merchant and the holder of the relevant card, without the need for manual selection or intervention by the merchant and/or cardholder in order to identify the card’s operating currency. The invention in the patent solves the problem of finding an accurate means of determining a preferred currency for a transaction between a local merchant and a foreign cardholder in Singapore. 6       The plaintiff is the proprietor of corresponding patents and patent applications in numerous other jurisdictions, particularly in Europe and in Australia. It has been granted a patent in Europe by the EPO but is facing post-grant opposition there. It is also facing pre-grant opposition in Australia. Opposition proceedings in New Zealand commenced by a company known as Multicurrency Management Services Ltd were dismissed in March 2006. 7       In 1999 and 2000, the plaintiff and UOB were in negotiations in the hope that UOB would eventually take a licence from the plaintiff to exploit the invention in the patent. Following a Non-Disclosure Agreement dated 6 September 1999 between the plaintiff’s agent (Global Dutifree Ltd, now known as Fintrax Group Holdings Ltd) and UOB, the plaintiff disclosed in confidence its invention in the patent and its proprietary methodology in a series of emails and meetings. Nothing came about as a result of the discussions. 8       On 11 October 2001, UOB made an agreement with FCC, one of the opponents in Australia and which is affiliated to Global Refund AB, an opponent to the patent in Europe, under which FCC would offer to UOB in Singapore a card currency recognition system known as the FCC system at various merchants acquired by UOB. The plaintiff alleged that the FCC System performs the same functions as the invention in the patent and is therefore infringing the patent. 9       The acts of infringement were set out in the plaintiff’s Particulars of Infringement dated 5 October 2004. Unfortunately, for the reason mentioned in [2] above, these particulars referred only to UOB and were not amended when FCC entered the fray. However, FCC responded to these particulars in its Defence as though they referred to FCC as well. 10     Claim 1 of the patent is an independent claim for a method of automatically determining a preferred currency in a card transaction. It claims: “a data processing method for determining a preferred currency for association with a charge, debit or credit card transaction between a merchant and a charge, debit or credit cardholder comprising the steps of; obtaining the card number of the card from the cardholder, characterized in that the method further comprises the steps of; identifying an identifier code from the said card number, determining the operating currency for said identifier code, by comparing said identifier code with entries in a table, wherein each entry in the table contains an issuer code or range of issuer codes and a corresponding currency code, and setting the currency for association with the card transaction as the determined operating currency for the issuer code”. The essential elements or integers of claim 1 of the patent are therefore: (a)    identifying an identifier code from the said card number; (b)    determining the operating currency for the said identifier code; (c)    by comparing the said identifier code with entries in a table (the Bank Reference Table), wherein each entry in the table contains an issuer code or range of issuer codes and a corresponding currency code; and (d)    once the card currency is identified, the transaction can then be set to that currency as its operating currency. 11     Claim 14 is an independent claim for a system for use in a card transaction to automatically determine a preferred currency in the transaction. Claims 2 to 13 are dependent claims to Claim 1 while Claims 15 to 33 are dependent claims to Claim 14. Claims 34 and 35 are omnibus claims. 12     The essential elements make the invention novel and inventive over the currency conversion systems that were then available at the point of transaction before the priority date. The existing methods required manual intervention and selection by the merchant who had to determine a card’s currency from the cardholder and then manually select that currency from a menu of currencies displayed. The patent, on the other hand, automatically determines the operating currency of a card by using a portion of the card’s Primary Account Number (“PAN”) to extract an identifier code and then automatically determines the card currency by reference to a specially constructed table known as the Bank Reference Table (“BRT”). The only task required of the merchant is to ask the cardholder whether he wishes to pay in the card’s currency or in the merchant’s currency. 13     Both UOB and FCC alleged that the FCC System does not infringe the patent because the former does not set the currency immediately upon the card being swiped at the point of sale and that it performs the automatic currency detection in a sequence different from that of the patent. They argued that the FCC System sets the transaction to the choice of currency selected by the cardholder after the payment choice has been made. The defendants also claimed that the FCC System does not contain the option of checking to determine whether the transaction value in the merchant’s currency is within the minimum and maximum range as described in the patent and that the patent does not comprise the step of presenting to the cardholder both the merchant’s currency and the converted currency along with the exchange rate for the cardholder’s approval. They also challenged the patent’s validity on the grounds of lack of novelty and lack of inventive step. They also alleged that the patent’s specification did not disclose the invention clearly and completely for it to be performed by a person skilled in the art in that it did not adequately describe the essential features of the invention, failed to describe in sufficient detail what was an “identifier code”, an “issuer identifier code” and an “issuer code” and how to identify an “identifier code” from the card number. Although UOB did not lead evidence on all these issues, it aligned itself with FCC’s evidence and submissions on these. 14     The focus of FCC’s challenge to the patent was that it lacked novelty. FCC produced seven alleged prior users and many alleged prior art documents in support of this contention. The alleged prior users were: (a)    Gothenburg Airport, Sweden – it was alleged that a system involving the claims of the patent was tested publicly at this airport by Global Refund AB from June to September 1999, during which about 100 transactions were carried through the system. (b)    Grafton Plaza Hotel, Ireland – it was also alleged that a multi-currency management terminal, involving the claims of the patent, was tested in early 1999 by Flexicom Ltd (“Flexicom”). (c)    Blarney Woollen Mills, Ireland – similarly, a system involving the claims of the patent was used at this major retailer since 1997 by Flexicom. (d)    Multi-Currency Point of Sale (“MCPOS”) software – FCC alleged that this software involved the claims of the patent and was used publicly by Flexicom in various businesses in Ireland, Northern Ireland and Great Britain since August 1998. (e)    Fexco Dynamic Currency Conversion Ltd (“Fexco”) – it was alleged that the dynamic currency conversion system developed by Fexco was in public use in about 180 locations in Ireland before the priority date. (f)     FX-ePay system – this currency conversion system developed by Trintech Technologies was tested publicly in the House of Ireland and Shelbourne Hotel before the priority date. (g)    Nabanco’s Trans 380 x 2 dual currency terminal – there was alleged public use of this terminal in Jamaican shops since May 1995 and that this system involved the claims of the patent. 15     FCC alleged that the invention in the patent formed part of the state of the art by virtue of the following prior art documents: (a)    documents published by Europay, Association for Payment Clearing Services (“APACS”) and British Standards Institute. (b)    Flexicom’s MCPOS functional specification – this was a draft for version 3.17 of the MCPOS software. (c)    presentation papers made to Harrods, Selfridges and Retail Logic – these were commercial proposals made by Fexco to the three entities mentioned. Fexco offered to set up a multi-currency payment solution for Harrods and Selfridges. Retail Logic was the payment solutions provider to Harrods at that time and Fexco had to work with it to implement its proposal. Only Harrods accepted the proposal, which was implemented in November 2000, more than a year after the priority date. (d)    Trintech quotation and Compact 9000 user’s guide – FCC produced an unsigned commercial quotation from Trintech, an Irish company, to develop a currency conversion system for the Bank of Ireland. (e)    PRIAM specifications – this was supposedly a proposal to implement a currency conversion system at Waterford Crystal in Ireland. Fexco claimed that PRIAM was one of its software developers. (f)     Bank Identification Number (“BIN”) table provided by Fexco to Retail Integration. 16     The above documents were also relied on to show the lack of an inventive step or obviousness in the patent. In addition, FCC referred to five other patents, several other documents and common general knowledge in its challenge to the patent. The five patents were: (a)    Patent WO 95/12169 (“the Visa/Levine patent”) – this concerns a process providing electronic access to pre-paid funds for cash or payment for goods and services. It is limited to making withdrawals from automated teller machines (“ATM”) which dispenses money in the currency of its location. (b)    Patent WO 97/04411 (“the Citibank/Jennings patent”) – this also concerns a method relating to ATMs and a banking network. (c)    Patent WO 96/36024 (“the Koninklijke/De Roojj patent”) – this concerns a payment system using smart cards and electronic cash registers. (d)    Patent EPO 843 292 A2 (“the Eastmar/Murphy patent”) – this appears to be a manual selection system. (e)    Patent EPO 251619 (“the Visa/Vincent patent”) – this relates to smart cards and to methods of approving a transaction value. The currency of the transaction is the currency of the merchant in question. 17     FCC referred to two articles entitled “Fexco Launch Multi-Currency Management Terminal” dated March 1999 (“the Fexco articles”) which claimed that Fexco’s terminal was capable of processing multi-currency credit card transactions in the cardholder’s currency but did not state that it was able to perform automatic currency determination. FCC also cited a letter dated December 1997 issued by Visa to its members which referred to the many issues surrounding currency conversion at the point of sale but omitted details relating to the issue of detection of currency. FCC further referred to an article from Nabanco relating to the Trans 380 x 2 dual currency terminal mentioned above. FCC also alleged that it was common general knowledge at the priority date that BINs could be used for identification of a card’s currency. 18     The plaintiff led evidence from five witnesses, including an independent expert. UOB had only one witness while FCC had ten witnesses, including its expert. 19     Gerard Joseph Barry (“Gerard Barry”) is the plaintiff’s chief executive officer. He is also the inventor of the patent. He explained the structure of the PAN which is the (usually) 16-digit number on credit cards. The first digit represents the scheme which issues the card. For instance, 3 would be American Express cards and 4 would be Visa cards. For Visa and MasterCard, the second to sixth digits would be the Issuer Identifier Number or the BIN. BINs were devised as a routing means for authorisation requests and processing, clearing and settlement of card transactions. 20     As at the priority date, when a cardholder travelled to another country, transactions on his credit card would be denominated in the local merchant’s currency. The currency exchange would be performed subsequently by the issuing bank which would apply a mark-up on the exchange rate. The issuing bank would then bill the cardholder in the credit card’s settlement currency. Hence, the cardholder would only know the converted value of that transaction when the billing statement was received by him. This is still the position for transactions performed at outlets which do not have conversion of currency facility at the point of transaction. 21     Subsequently, banks were able to authorise, clear and settle card payments in multiple currencies. This led to the development of the facility whereby merchants were able to offer currency conversion at the point of transaction. The initial system of such currency conversion was entirely manual in nature. The merchant would have to know that the credit card presented was a foreign one and determine the operating currency of that card. Subsequent developments enabled the system to identify the card as a foreign card and, after the cardholder had indicated his choice of currency, the merchant would then process the transaction by looking up an exchange rate table or keying in the exchange rate and converting the transaction amount. The setbacks of these systems were delay and risks of operator error. 22     The invention in the patent seeks to overcome these setbacks by eliminating the need for action by the merchant. The invention extracts an identifier code based on the card’s number and automatically determines the card’s operating currency. The merchant only needs to ask the cardholder whether he wishes to pay in that currency and if so, the transaction would be performed automatically by the terminal at the point of transaction. The system identifies the operating currency by reading the PAN and referring to a BRT table, which in turn identifies the currency of the card in question and presents the cardholder with the choice of proceeding in that operating currency or in the currency of the merchant. It eliminates operator error inherent in the previous menu-driven systems. The BRT is a table specially constructed from a portion of the PAN and it is of variable length. 23     The invention identifies the card’s currency and not its issuer. The BIN identifies the issuing bank for the purposes of authorisation and settlement and not the operating currency of the card. It is not always possible to identify the operating currency by reference to the BIN because BINs are assigned to principal members of the card schemes and portions of the BIN may be assigned to an associate or affiliate member which may not necessarily be in the same location (and therefore currency). Further, the principal members may issue cards in a currency which is different from that of the said members’ location. 24     Teh Kor Lak, who owns a consultancy business providing management consultancy services, particularly in the area of information technology, used to work for Visa in Singapore (between 1995 and 1999). Pursuant to an order made by me after hearing the parties on interlocutory applications at the commencement of the trial, he inspected the functioning of the FCC System at a terminal of a merchant’s outlet (the Grand Plaza Parkroyal Hotel) and at the FCC Gateway to determine how it worked. He did the inspection together with the parties’ solicitors. Chandrakant Agnihotri, the Chief Technical Officer of FCC, was also present. Teh Kor Lak prepared a report after the inspection and testified as an expert on the functioning of the FCC System. He noted his findings at pages 21 and 22 of his report, which was annexed to his second affidavit of evidence-in-chief filed on 20 February 2006. He also included a flow diagram (Appendix B of the report) to help in understanding the sequence of events from his interpretation of the log activities during the inspection. BIN numbers were developed by the card schemes as a means for routing authorisation requests and for processing, clearing and settlement of transactions. They may be used to identify the issuing bank but it did not follow that the operating currency of the card could be automatically determined thereby. He also testified as a witness of fact on other matters. According to him, automatic currency detection was unknown in Asia at the material time. 25     John Kevin Duffy, the head of Research and Development for the Fintrax Group, was asked by Gerard Barry in 1998 to investigate the state of the market in Ireland then. He testified that what was available then was a manual, menu-driven system requiring operator intervention or selection. In July 1998, he met John Clarke (one of FCC’s witnesses) of Flexicom in Dublin to see if Flexicom could offer point of sale development services to the Fintrax Group. He was shown a terminal which offered dual currency facility but which utilized a manual system requiring the operator to select a button for the Irish Punt or for the Euro/ECU respectively. He also visited Fexco’s office and witnessed the Flexicom host in operation. That was based on a personal computer system and also had a menu for currency selection. He also saw the system operating in a retail jewellery store, recalling that it was also a manual one. In April 1999, he visited Blarney Woollen Mills and saw an American tourist making a payment by means of a manual system. He also dealt with UOB in the plaintiff’s negotiations with the bank. 26     Glynn Kenneth Walker, the plaintiff’s consultant, used to work with AIB Credit Card Services Dublin, a subsidiary of Allied Irish Bank, from 1995 to 2000. By virtue of his work, he was familiar with the technical aspects of credit card payment data processing and routing before the priority date. He testified that Flexicom was a company formed by John Clarke and Patrick Shiel (FCC’s witnesses). He knew Shiel when the latter was working for Trintech. 27     Glynn Kenneth Walker, who was in the team that negotiated with UOB, said that Flexicom’s original electronic cash register concentrator was later developed into the MCPOS system. As at the priority date, it was a manual system entailing operator intervention to select the transaction’s currency. 28     Robert Wastyn, who used to work for MasterCard, was called as an expert by the plaintiff. He is the senior consultant and managing director of Triangle Marketing Consulting and holds a Master of Applied Economic Sciences (Business Management and Marketing) from the University of Antwerp. He has worked in the European card payment industry since 1988. He has no commercial relations with the plaintiff. He had no personal knowledge of the alleged prior users and therefore offered no comments about them. Having studied the alleged prior art documents tendered by the defendants, he was of the view that the patent is valid as it is novel and not obvious as at the priority date. He was also of the opinion that the invention had been sufficiently disclosed and that the FCC System infringed the patent. The card schemes never had an automatic currency conversion system built into the payment terminals until the invention made it possible. 29     UOB’s sole witness was Francis Hsu, the head of the bank’s credit card operations. He led a team which negotiated with the plaintiff but eventually chose the FCC System, which UOB is still using and offering to its list of merchants. He also testified about the events preceding this action, which will be covered in greater detail later on in this judgment (at [76] to [80]). 30     Chandrakant Agnihotri, the head of technology and service systems in FCC, used to work for Visa between 1992 and 1999. He was not aware of any automatic currency detection system during his employment with Visa. He was not involved in setting up the FCC System for UOB. More than 300 merchants in Singapore are presently using that system, which is also available in Australia and in Switzerland. When the plaintiff’s Teh Kor Lak inspected the FCC System in the course of this trial, he was present to provide a system log of the test transaction made. He said he could understand the patent’s claims and agreed that the flow diagram prepared by the plaintiff after the said inspection represented the FCC System’s transaction flow accurately. He also agreed that BINs were not set up by the card schemes for the purpose of identifying the relevant currency and that Claim 1 of the patent did not require the currency to be set immediately after the card was swiped. 31     John Clarke, who now works for Euroconnex, was the technical director and co-founder of Flexicom with Patrick Shiel in 1993. The MCPOS software emerged in 1996 and was based on the personal computer. MCPOS and Multi Currency Management System (“MCMS”, also known as the FDCC system, a dynamic currency conversion system developed by Fexco) were the same software but IPAC was different from MCPOS. He confirmed that version 3.18 of MCPOS was the first fully automatic version of the software and that previous versions were therefore irrelevant for this trial. He claimed that some merchants were still using version 3.18, which was not produced at trial as he had not been asked to do so. He acknowledged that he and Patrick Shiel were weak in documentation. 32     John Clarke said he was not consulted before Flexicom commenced the EPO opposition proceedings but was consulted by Patrick Shiel for the latter’s EPO declaration. He agreed that his evidence here mirrors that of Patrick Shiel’s evidence in the EPO proceedings. He could understand the claims of the patent. Flexicom was aware of the plaintiff’s European patent but was not concerned as there was prior art relating to the claims. 33     Denis Cleary, the technical manager of Fexco, was the one who made the presentation to Harrods and Retail Logic and to Selfridges together with Connie Penn. The objective of the Harrods presentation was to show that the system proposed could process transactions in foreign currencies. He could not say whether the proposal involved an automatic system. The software in question was then “vapourware” which required further development and did not exist until the end of 2000. 34     FCC was initially a joint venture between Fexco and Global Refund. That relationship ended in July 2002. The FCC System operates on the same basis as the FDCC. It takes a portion of a credit card’s PAN, matches it with a corresponding currency code in a table to undertake the automatic currency recognition. Denis Cleary agreed that the MCPOS software had no automatic currency recognition capability before version 3.18 MCPOS was used in some 180 locations in Ireland. 35     Fexco and Flexicom formed Shandling Ltd as a joint venture. Flexicom transferred the intellectual property rights of MCPOS to Shandling Ltd. Fexco eventually bought over Flexicom’s share in the joint venture and now holds the rights to MCPOS. 36     Connie Gabrielle Penn works for Kilrush Consultancy. Its major client is Fexco. She testified that the presentation to Harrods involved an automatic currency detection system. 37     Dermot Michael McCarthy set up Retail Integration which supplied the Meridien POS software used at Blarney Woollen Mills in Ireland. He came to court to testify at the request of Euroconnex, with which Retail Integration have common customers. The Meridien software replaced the Fexco software at the said location. The Meridien software had automatic currency recognition capability since 1999 using the BIN table, which was given by Denis Cleary in May 1999. Fexco had asked Retail Integration to replicate and integrate into the Meridien software the currency recognition function of MCPOS. This was done in two days. 38     Edmond G. Ryan used to work for Bank of Ireland, then Euroconnex and is now with Bank of Ireland again. Bank of Ireland used to be in the card business. Its merchants used the software known as FX-ePay developed by Trintech and which was introduced in 1997. That was a manual system. In 1998, a review of the system was done culminating in a presentation to the management of the bank at the end of that year that an automatic currency recognition system be developed. This development request was given to Trintech in December 1998 and work commenced although there was only an unsigned quotation. Trintech used 250 BINs which were sufficient for the purpose. The BINs were uploaded and testing of the new system took place in March 1999. It became operational at the end of June 1999. However, the test record documents showed that the testing was in March 2000 and there was no record by Trintech that the BINs were uploaded. There was a marketing blitz for the new system. However, no evidence was adduced to confirm this. Bank of Ireland earned a 1.75% fee for handling cross-border transactions. He agreed that banks could issue cards in more than one currency in a particular country. 39     According to Edmond Ryan, he was at Blarney Woollen Mills in the second half of 1999 where he saw an automatic currency recognition system. That system was explained to him but he did not report this discovery to his management. 40     It was pointed out in cross-examination that the Trintech Compact 9000 manual was probably only a draft as there were “dummy” entries and material discrepancies when compared with the German version obtained by the plaintiff from the Internet as well as the English version of Compact 9000i manual obtained from Trintech. Edmond Ryan was also not able to produce any printed copy of the manual despite his assertion that some 1,000 copies were made. The Trintech records also showed that the production date of the software was in September 1999, which was after the priority date of the patent. 41     Vivian Galligan is a shareholder of Flexicom. He used to be an employee of Allied Irish Bank but now works for Euroconnex. He claimed that copies of the MCPOS software version 3.18 could be available in Flexicom, Fexco and some retailers. That version was but a minor upgrade over the preceding version which was covered by the annual maintenance fee of £150. There were no delivery records of the software by Flexicom to Allied Irish Bank. Similarly, there were no records relating to the installation of the software in the system at Blarney Woollen Mills. 42     FCC’s next witness, Johan B. Gronberg, is the senior vice-president of Administrative Support Services in Global Refund AB. He agreed that FCC and Global Refund AB are part of the same group of companies. The managing director and CEO of Fexco and another officer of Fexco sat on the board of directors of Global Refund AB and they authorised Asad Jumabhoy, one of the directors of FCC and Global Refund Singapore, to give a guarantee to UOB. 43     The test at Gothenburg Airport was performed in a souvenir shop owned by Global Refund AB using software despatched from the United Kingdom. That test was successful but the project nevertheless never took off. The witness agreed that receipts did not by themselves prove the existence of an automatic currency recognition system and that someone watching the payment transaction would see only the card being swiped without being able to see how the currency recognition was performed. 44     Jeffrey Sachs, the vice-president for Consumer Debit Services in Visa, USA, used to work for NABANCO. He was thus familiar with the Trans 380 terminal used in Jamaica. That system recognised only Jamaican BINs so that Jamaican cardholders had to transact in Jamaican currency. All other cards were billed in US dollars. BINs were one of the basic building blocks of the card schemes, used for routing authorisation and settlement. Members of the card scheme could be principals, associates or affiliates but liability fell only upon the principals who would be assigned BINs which they could sub-divide with their respective associates and affiliates. A card issued out of London need not necessarily be denominated in sterling. In setting up a BIN, Visa would be informed of the currency to be associated therewith. The witness agreed that the letter dated December 1997 issued by Visa to its members (see [17] above) did not teach how automatic currency recognition was to be done. 45     FCC’s final witness was Patrick Shiel, the expert witness, holder of a double first class honours degree in electronic engineering and mathematics from Trinity College, Dublin in 1982. He has worked in the card payment industry since 1988. He filed two affidavits of evidence-in-chief. His conclusions were that the FCC System did not infringe the patent. The former did not set to currency of cardholder until and unless a payment choice had been made by the cardholder. It also presented to the cardholder both the merchant’s currency as well as the converted amount for the cardholder’s review and approval, unlike the patent’s data processing method and system which comprised the steps of converting the transaction amounts to equivalent amounts in the preferred currency and presenting these amounts for review by the cardholder and presenting an exchange rate to the cardholder. He opined that the patent ought to be revoked for the reasons relied on by FCC. In his view, the plaintiff’s BRT comprised most, if not all, of the structure and features of the BIN table and was no different from it. The BRT served the same purpose as the BIN table and the latter concept had been in use before the priority date. The use of BINs was therefore neither novel nor inventive. If the BRT was not the BIN table, the FCC System was one using BINs and therefore did not infringe the patent. 46     As mentioned earlier, Patrick Shiel was the co-founder of Flexicom together with John Clarke and had filed a declaration in the EPO opposition proceedings similar to John Clarke’s affidavit of evidence-in-chief here. Before co-founding Flexicom in 1993, he was an engineering manager in Trintech for about five years, which company specialised in point of sale equipment for handling credit and debit cards. According to Patrick Shiel, Euroconnex (a joint venture company formed by the Bank of Ireland and a company called Nova, now wholly owned by Nova) now owns Flexicom but the MCPOS software belongs to Fexco which bought the rights thereto in order to protect its investment. Flexicom was not involved in the proposals made to Harrods and Selfridges. Flexicom specialised in the design and sale of integrated point of sale equipment and produced a range of software for handling multiple currencies in the card payment industry. 47     He disagreed that he was not an independent expert although Flexicom was one of the players in the card payment industry in Ireland at the material time. He was approached by Euroconnex to testify in the EPO proceedings and agreed to do so because Euroconnex would fund the proceedings. He did consult John Clarke on the technical aspects of his evidence before the EPO as he was not necessarily aware of all the features in the MCPOS software. However, he did not agree with John Clarke’s concession that only version 3.18 of MCPOS had the automatic currency recognition capability. He did not inspect the FCC System but agreed with the evidence of Chandrakant Agnihotri that it worked differently from the claims in the plaintiff’s patent. He left Flexicom and the card payment industry in March 2004 to set up a company dealing with building management and maintenance systems.",
        "The decision of the court": "48     Section 66(1) of the Patents Act (“the Act”) (Cap 221, 2005 Rev Ed) provides for the situations constituting infringement of a patent. It states: Subject to the provisions of this Act, a person infringes a patent for an invention if, but only if, while the patent is in force, he does any of the following things in Singapore in relation to the invention without the consent of the proprietor of the patent: (a)    where the invention is a product, he makes, disposes of, offers to dispose of, uses or imports the product or keeps it whether for disposal or otherwise; (b)    where the invention is a process, he uses the process or he offers it for use in Singapore when he knows, or it is obvious to a reasonable person in the circumstances, that its use without the consent of the proprietor would be an infringement of the patent; (c)    where the invention is a process, he disposes of, offers to dispose    of, uses or imports any product obtained directly by means of that process or keeps any such product whether for disposal or otherwise. 49     Section 67(2) of the Act declares that the court shall not, in respect of the same infringement, both award the proprietor of a patent damages and order that he shall be given an account of the profits. Section 82(1)(a) of the Act provides that the validity of a patent may be put in issue by way of defence in proceedings for infringement of the patent while s 82(3) states that the only grounds on which the validity of a patent may be put in issue are those on which the patent may be revoked under s 80. Section 80(1) in turn provides that a patent may be revoked on the grounds, among others, that the invention is not a patentable invention or that the specification of the patent does not disclose the invention clearly and completely for it to be performed by a person skilled in the art. 50     What then is a patentable invention? Section 13(1) provides the answer: Subject to subsection (2), a patentable invention is one that satisfies the following conditions: (a)    the invention is new; (b)    it involves an inventive step; and (c)    it is capable of industrial application. The defendants challenge the patent only on conditions (a) and (b) above. 51     Section 14 of the Act deals with the issue of “newness” or novelty as follows: (1)    An invention shall be taken to be new if it does not form part of the state of the art. (2)    The state of the art in the case of an invention shall be taken to comprise all matter (whether a product, a process, information about either, or anything else) which has at any time before the priority date of    that invention been made available to the public (whether in Singapore or elsewhere) by written or oral description, by use or in any other way. (3)    The state of the art in the case of an invention to which an application for a patent or a patent relates shall be taken also to comprise matter contained in an application for another patent which was published on or after the priority date of that invention, if the following conditions are satisfied: (a)    that matter was contained in the application for that other patent both as filed and as published; and (b)    the priority date of that matter is earlier than that of the invention. … Section 15 of the Act elaborates on what is an inventive step: An invention shall be taken to involve an inventive step if it is not obvious to a person skilled in the art, having regard to any matter which forms part of the state of the art by virtue only of section 14(2) and without regard to section 14(3). 52     Section 25(4) of the Act provides: The specification of an application shall disclose the invention in a manner which is clear and complete for the invention to be performed by a person skilled in the art. 53     The burden of proving lack of novelty or anticipation rests on UOB and FCC. Our Court of Appeal, following its earlier decisioninMerck & Co Inc v Pharmaforte Singapore Pte Ltd[2000] 3 SLR 717, said inGenelabs Diagostics Pte Ltd v Institut Pasteur[2001] 1 SLR 121at [24] that in order for a prior publication to anticipate the patent, it must be shown that following the teachings in the prior publication would inevitably lead to the invention covered by the patent and that the prior disclosure must not only identify the subject matter of the claim in the later patent, it must do so in a way that enables the skilled man to make or obtain it, a kind of enabling disclosure. The prior art or prior use must therefore clearly disclose the invention in the patent. 54     The US Court of Appeals, Federal Circuit inWoodland Trust v Flowertree Nursery Inc47 USPQ 2d1363, 1366 (1998) said: There is a very heavy burden to be met by one challenging validity where the only evidence is the oral testimony of interested persons and their friends, particularly as to long-past events. Corroboration of prior invention is the general rule in patent disputes … In assessing corroboration, the court has endorsed the following criteria as compiled inIn re Reuter670 F.2nd1015, 1021 n.9 and 210 USPQ 4249, 255: (1)    the relationship between the corroborating witness and the alleged prior user (2)    the time period between the event and the trial (3)    the interest of the corroborating witness in the subject matter in suit (4)    contradiction or impeachment of the witness’ testimony (5)    the extent and details of the corroborating testimony (6)    the witness’ familiarity with the subject matter of the patented invention and the prior use (7)    probability that a prior use could occur considering the state of the art at the time (8)    impact of the invention on the industry, and the commercial value of its practice. 55     This authority and the cases cited therein were considered by Judge Fysh Q.C. in the recent decision inKavanagh Balloons Pty Ltd v Cameron Balloons Ltd[2004] RPC 5at [57] to provide “good, practical guidance when it comes to assessing the value of evidence of prior user in patent cases” while bearing in mind that one has to look at the facts of the particular case. His Honour also noted that the US authority stressed the need for “clear and satisfactory evidence” when it came to assessing the probative value of evidence of prior user. I respectfully agree with these observations. 56     Bearing these principles in mind, I now consider the defendants’ evidence. The evidence of Johan Gronberg on the Gothenburg Airport test did not establish clearly that it took place before the priority date of the patent. On his evidence, the testing took place over a few months between June and September 1999. Was it successful by the patent’s priority date in July 1999? It would appear not because there was reconfiguration work to be done and no testing was apparently done in July 1999 because of the summer holidays in Sweden. The screenshots produced by him, initially claimed to have been taken from an actual transaction in June 1999, were actually for a test conducted in 2002. Apart from this being long after the priority date, they also showed a menu of currencies which would indicate that the operator still had to choose one of the currencies listed, alluding to a non-automatic system. He also accepted that receipts alone were insufficient to prove that the system was capable of automatic currency recognition. This so-called Global Refund System was also a system provided by a third party which Johan Gronberg and his team merely plugged in and tested. There was also no explanation as to why the system was not put into use after the successful testing. The evidence on this test was therefore far from clear and satisfactory. 57     Similarly, I found the evidence pertaining to the Grafton Plaza Hotel, Dublin test in early 1999 wanting. John Clarke testified that the MCPOS version 3.18, which was the version containing the automatic currency recognition feature and which was introduced in August 1998, was tested running on a Verifone Omni 2250 terminal which, according to Denis Cleary, had been sourced from Germany. This terminal needed an additional modem in order to function in Ireland and was apparently unsuccessful as it was withdrawn from the market and replaced by the Omni 2650 terminal, introduced sometime in the middle of 1999. Clearly, therefore, the system was not able to perform. The article from Fexco on the test did not disclose how currency recognition was performed or indeed even allude to its automatic functionality, which would have been a notable enhancement over the erstwhile manual systems. The system used was described as “multi-currency” which, according to John Clarke, would signify a manual system because to him, “dynamic currency conversion” would have implied something happening or an automatic function. 58     The incident at Blarney Woollen Mills in 1997 could not have been a case of automatic recognition of currency. Dermot McCarthy said that Retail Integration’s software replaced MCPOS and it was only in late 1998 that he was asked to incorporate a currency recognition function in the software. What was used at that location in 1997 must therefore have been software that pre-dated version 3.18 and that means it could not have had the automatic function. The replacement software with the alleged automatic function was not cited as one of the prior users. It is doubtful at any rate that such software existed. The modification was said to have been accomplished successfully in a mere two days with no benefit accruing to Retail Integration, which defy belief. Further, the software no longer exists. 59     The MCPOS software version 3.18 was not produced in this trial. There was scant documentation on this software and its functionalities. Even if Flexicom was lacking in the area of documentation, it was strange that it did not preserve such important evidence of prior user especially in the light of its knowledge then that someone else was asserting patent rights over what they claimed already existed as part of the state of the art. Further, none of the many alleged users of this software has been called to attest to the existence and capability of this software. 60     The Fexco dynamic currency conversion system allegedly used at some 180 locations in Ireland and in a few places in the United Kingdom was, as is apparent from Denis Cleary’s answers in cross-examination, also Flexicom’s MCPOS software. The observations made earlier regarding this software thus apply to this alleged user. 61     The FX-ePay system was developed by Trintech and licensed to the Bank of Ireland. There was only a manual system available in the market as at the priority date and this was mentioned in the patent. There was again a dearth of documentation regarding the alleged automatic system. It was claimed that some one thousand copies of the Trintech manual on this were printed and distributed but none was produced in evidence. 62     The Nabanco Trans 380 terminal, as evident from the article written about it, was a dual currency system (involving Jamaican currency and US dollars) capable of distinguishing Jamaican cards from foreign ones. There was no mention of any automatic currency recognition capability and it was conceded in cross-examination that the system in question was not able to identify any foreign currency other than US dollar. All foreign cards would simply be deemed to be denominated in US dollar. 63     Where prior art documents are concerned, one must confine oneself to what is clearly disclosed in such documents and guard againstex post factoanalysis of the invention by invoking knowledge coming into existence after the publication of such documents. Anticipation does not include vague disclosures or near misses but must be found within the document in issue. It is not permissible to combine the teachings of two or more documents except where one of these directs the reader to study the other – in other words, it is not permissible to create a mosaic of extracts from various documents spread over a number of years. For these propositions, see the High Court decision inInstitut Pasteur & Anor v Genelabs Diagnostics Pte Ltd & Anor[2000] SGHC 53at [189] and [190] and the cases cited therein. 64     Applying these principles to the alleged prior art here, the Europay (or MasterCard Europe) documents merely teach computer programmers how to set up various fields and do not disclose the method of the invention in the patent. Further, these documents were confidential in nature and are available only to members of Europay and not to the public (see s 14(2) of the Act at [50] above). Similarly, the APACS documents are in the nature of achieving standard practices for computer programmers and do not disclose any automatic recognition facility. The MCPOS document of July 1998 has been shown to be irrelevant because it relates to version 3.17 and anything prior to version 3.18 has been accepted as not possessing the automatic facility. 65     The PowerPoint presentations to Harrods and to Selfridges were in the nature of sales proposals, not specifications as to how the system worked. They, as admitted by Connie Penn, would not and were not intended to teach anybody anything. Further, they concern “vapourware” and not the operational software. At most, they contain a list of what the presenters hope to do but not the solution to accomplish it. The same comments could be made about the proposals to Retail Logic, which Fexco would need to work with if its sales proposals had been accepted by Harrods. In any event, such documents could hardly be considered public documents, especially during the material time. 66The document published by the British Standards Institute shows the reader how to identify the issuer of a card from its number but does not teach the invention. The unsigned Trintech quotation to Bank of Ireland serves only as a quotation at most and not as prior art. It is doubtful in any event that the FX-ePay in existence then was an automatic system. In the same vein, the document created by PRIAM Software (a developer of software) for Waterford Crystal in Ireland was merely a document setting out requirements and does not disclose the invention. The Compact 9000 user’s guide said to have been issued in June 1999 appears to be a draft. Strangely, none of the one thousand or so copies could be retrieved for production in court. No mention of this document was made by Edmond Ryan in his declaration before the EPO. In fact, it was not originally pleaded as prior art by the defendants. In any event, it also does not clearly disclose the invention. Similarly, the BIN table supposedly produced by Fexco in May 1999 was only disclosed when FCC filed its affidavits of evidence-in-chief. It contains a list of numbers. It is unclear how this teaches the invention. 67     After considering all the alleged prior users and prior art, I am of the view that none of them qualifies as such. The invention is indeed novel and satisfies the first test of patentability. 68     On the question of lack of an inventive step or the issue of obviousness, our courts have adopted the four-step approach enunciated by the English Court of Appeal inWindsurfing International Inc v Tabur Marine (Great Britain) Ltd[1985] RPC 59at 73 and 74 thus: There are, we think, four steps which require to be taken in answering the jury question. The first is to identify the inventive concept embodied in the patent in suit. Thereafter, the court has to assume the mantle of the normally skilled but unimaginative addressee in the art at the priority date and to impute to him what was, at that date, common general knowledge in the art in question. The third step is to identify what, if any, differences exist between the matter cited as being “known or used” and the alleged invention. Finally, the court has to ask itself whether, viewed without any knowledge of the alleged invention, those differences constitute steps which would have been obvious to the skilled man or whether they require any degree of invention. Here again, the court must guard against using hindsight andex post factoanalysis in approaching the questions. The issue is not whether it is obvious now but whether it was so at the material time. Inventiveness is not synonymous with complexity as an invention may well be one because it is such a simple solution to what appears a highly complex problem (seeInstitut Pasteur & Anor v Genelabs Diagnostics Pte Ltd & Anorat [197]). 69     The inventive concept in the patent relates to the automatic detection or recognition of the card’s currency so as to offer the card holder a choice of the currency in which to pay for the transaction in question. This was made possible by means of the BRT constructed specially by the plaintiff from information gleaned from various sources. As at the priority date, all that was available was some sort of manual system for the selection of currency. That system had apparently been available only a few years before the priority date and was largely available only in Ireland. Elsewhere in the world, card transactions would typically be in the currency of the merchant with the cardholder becoming aware of the exact amount spent only when the monthly statement is issued to him. The difference in approach was palpable in terms of speed and elimination of error. While moving from a manual system to an automatic one may be the obviouswishin almost every process, what has to be obvious is thestepin making that transition. I do not think that the notional person skilled in the art would have naturally gravitated towards the idea in the patent to make that transition. Even as at today, automatic recognition of card currency is hardly universal. 70     The materials cited by the defendants on this point of challenge to the patent (see [16] and [17] above) do not make the way to the solution of automatic recognition of currency an obvious one. The skilled person would still have to determine what sort of data was needed to fulfill the task and how the database could be assembled. This was not something he could easily pick up from the alleged prior art documents or from common general knowledge. The BRT, as an amalgamation of information from diverse sources (including cardholders), did not exist at the priority date and no one before the plaintiff thought of assembling such information to accomplish the task of automatic recognition of a card’s currency. The BRT may include the typically six-digit BIN table but it is not the BIN table. It has been explained that principals do not necessarily issue cards in only the currency of their location and that they do assign portions of their BINs to associates or affiliates who may be located in other countries and therefore issue cards in other currencies. The BIN table alone would result in errors in such instances. 71     I am therefore satisfied that the invention in the patent is innovative and does involve an inventive step as it was not obvious to a person skilled in the art at the relevant time. It therefore satisfies the second test of patentability as well. Something that is new and inventive does not automatically become an overnight success or “the next big thing”. Even if it is not, like the plaintiff’s Teh Kor Lak said, “a big deal”, it is nevertheless something new and inventive which, after the invention is known, others may wish they had thought of it or wonder why they never thought of it. Some patents achieve much more commercial success and are more life-changing than (many) others. The fact that the invention has not been widely adopted in the credit card industry is therefore not an adverse reflection of its inventive quality. 72     On the challenge relating to insufficiency, practically all the witnesses of FCC had little difficulty reading and understanding the specifications and the claims in the patent. The terms “identifier code”, “issuer code” and “issuer identifier code” are elaborated on in the patent (see page 11 thereof). To a lay person, the explanations in the patent would probably not give him a complete understanding of the invention but we must remember that we are here concerned with the notional person skilled in the art. That person, like many of the witnesses for FCC, would have no difficulty performing the invention after having studied the specifications in the patent. The challenge on this ground must accordingly fail too. 73     The final issue is whether the FCC System in fact infringes the patent. I am of the view that it does. It is clear that, like the invention in the patent, it performs the same function of looking up a specially constructed table comprising a portion of the PAN and co-relating entries therein with currency codes. It seeks to perform automatic recognition of a card’s operating currency. The FCC System therefore uses a process comprising the method and system of determining the currency of a card in a transaction. Even FCC’s Chandrakant Agnihotri acknowledged during cross-examination that the FCC System fell squarely within the words of Claims 1 and 14 of the patent. The BRT is a trade secret and how it is constructed is not germane to the issues at hand. It is immaterial even if the FCC System performs automatic currency identification in a slightly different sequence from that in the patent or has some additional feature which is not in the patent so long as the FCC System does perform the same function using the integers of the claims in the patent and the variation or addition does not alter the essence. On the question of infringement by a variant, see againInstitut Pasteur & Anor v Genelabs Diagnostics Pte Ltd & Anorat [208] to [211] (and the authorities cited therein) where it was held that “the other five amino acids in the First Defendant’s 23 mer do not alter the character of the Plaintiffs’ 18 mer…”.The patent (at page 19) allows the currency detection to be implemented at different stages of the transaction anyway. The FCC System came into being after the priority date and the patent is in force. FCC uses and offers for use its system to UOB. UOB in turn uses and offers its merchants the use of the FCC System. In my view,it is obvious to a reasonable person in the circumstances that such use without the consent of the proprietor would be aninfringement of the patent.Both UOB and FCC have therefore infringed the patent within the meaning of s 66(1)(b) of the Act. 74     In the event that I uphold the validity of the patent and find infringement on the part of the defendants, UOB seeks to rely on s 69(1) of the Act which provides: In proceedings for infringement of a patent, damages shall not be awarded and no order shall be made for an account of profits against a defendant who proves that at the date of the infringement he was not aware, and had no reasonable grounds for supposing, that the patent existed. The plaintiff submits that UOB is not entitled to rely on this defence of innocent infringement as it has not been pleaded and, in any event, is not borne out by the facts. UOB on the other hand argues that the law of pleading requires only material facts to be pleaded and not the legal result arising from those facts or the applicable statutory provision, relying on the Court of Appeal’s decision inMK (Project Management) Ltd v Baker Marine Energy Pte Ltd[1995] 1 SLR 36at 45). The material facts are that UOB did not know of the patent until it was notified by a letter dated 17 October 2002 from Infinitus Law Corporation containing the application number of the patent and enclosing a copy of European Patent No. 1018711 and this has been pleaded at paragraphs 9 and 10 of its Defence and Counterclaim. Even if the defence was not pleaded, UOB relies on the statement made by the Federal Court of Malaysia inBoustead Trading (1985) v Arab-Malaysian Merchant Bank[1995] 3 MLJ 331that “where there is no pleaded case of estoppel, but there is let in, without any objection, a body of evidence to support the plea, and argument is directed upon the point, it is the bounden duty of a court to consider the evidence, and the submissions and come to a decision on the issue. It is no answer, in such circumstances, to say that the point was not pleaded …”. 75     In my view, a defence of innocent infringement ought to have been positively pleaded rather than by mere implication. Order 18 rule 8(1) of the Rules of Court (Cap 322, R 5) states that a party must plead specifically any matter which he alleges makes any claim of the opposite party not maintainable or which, if not specifically pleaded, might take the opposite party by surprise. A defence of limitation is given as an example of such a matter. In my view, a defence in the nature of s 69 is of the same genre. While it may not be necessary for UOB to refer specifically to s 69 of the Act, it ought at least to assert that it was not aware and had no reasonable grounds for supposing that the plaintiff’s patent existed until it was informed in October 2002. Para 9 of UOB’s Defence is a response to the matters set out in para 4 of the plaintiff’s Particulars of Patent Infringement. These include the averments that there was a meeting on or about 26 September 2002 between the parties’ representatives during which the European patent and the pending application here were mentioned and UOB was invited to obtain a licence and that UOB was formally notified of the same patent and application by solicitors’ letter of 17 October 2002. Para 9 of UOB’s Defence does no more than admit the fact of the meeting and the solicitors’ letter but not the mention about the patent and the application at the same meeting and the invitation to obtain a licence. Para 10 of UOB’s Defence was essentially a non-admission of paras 5.1 and 5.2 of the plaintiff’s Particulars of Patent Infringement which merely state that “[i]n the premises, the Defendant knew or the same would have been obvious to a reasonable person in the circumstances that the data processing method referred to in Claims 1 to 13 and the system referred to in Claims 14 to 35 are patented in Singapore” and “[t]he Defendant’s use of an identical or similar data processing method and system in the First Currency Choice without the consent of the Plaintiff would be an infringement of the Patent”, obviously alluding to s 66(1)(b) of the Act. In my opinion, these two paras of UOB’s Defence do not make it explicitly clear that UOB was pleading innocent infringement. Nonetheless, as this issue of innocent infringement was alluded to in evidence and can be dealt with without causing injustice to any party, I will consider it now. In any event, this defect in pleading can be cured, even at this late stage, by an application to amend the pleading as I do not see any need to recall any witness if this is allowed. The relevant facts pertaining to this issue are already before the court. 76     The facts relating to this issue are as follows. After the discussions between the plaintiff and UOB ended in June 2000, there was no further communication between them until April 2002. In the meantime, FCC approached UOB with its FCC System and they eventually signed a Multicurrency Exchange Agreement in October 2001 whereby UOB would make the said system available to its merchants. The system was first offered at the merchant outlets in December 2001. 77     On 19 April 2002, UOB’s officer informed the plaintiff that UOB had implemented the FCC System. Gerard Barry responded by email on 10 May 2002 informing UOB that the EPO had granted the plaintiff a patent on 5 December 2001 and that corresponding applications were pending in over 60 countries, including Singapore. This email was not disclosed to UOB until the trial. On 24 September 2002, a meeting was held between the plaintiff and UOB after which UOB asked Gerard Barry for details of the pending patent application in Singapore so that it could follow up on the matter (the plaintiff’s pleaded case was that this meeting was “sometime on or about 26 September 2002” and the fact of the European patent and the pending registration in Singapore was orally communicated then). He responded on 9 October 2002 providing the number of that pending application. This was followed by the plaintiff’s solicitors’ letter dated 17 October 2002 which enclosed a copy of the European patent and which reiterated the number of the pending patent application here. UOB then consulted FCC and was assured that the plaintiff’s patent was not valid. UOB also took comfort in the indemnity that was provided by FCC. 78     It was only on 17 July 2003 that the plaintiff sent an email to UOB to express its displeasure at the latter’s implementation of the FCC System. Further correspondence followed culminating in this writ action on 5 October 2004. 79     UOB argues that it was not involved in the distribution of brochures relating to the FCC System, contrary to the plaintiff’s pleading. It admits, however, that it has used the FCC System, which it merely acquired from FCC System, and continues to do so today. UOB submits that it should be liable for damages only from the time of knowledge of the patent or when it had reasonable grounds for supposing that the patent exists and that the earliest date for consideration would be 10 May 2002. However, s 69(2) of the Act provides: A person shall not be taken to have been aware or to have had reasonable grounds for supposing by reason only of the application to a product of the word “patent” or “patented”, or any word or words expressing or implying that a patent has been obtained for the product, unless the number of the patent accompanied the word or words. UOB argues that, by analogy as the invention here is not a product, the email of 10 May 2002, which did not mention the number of the pending patent application, could not constitute sufficient notice of the existence of the patent or reasonable grounds for supposing that it exists. There was also no “cease and desist” letter from the plaintiff subsequent to 10 May 2002. The earliest date of liability on UOB’s part must therefore be 9 October 2002 when the number was provided. The plaintiff’s system had no presence at all here and there was therefore no other source from which UOB could find out about the pending patent application. Alternatively, UOB submits that its liability should start from 26 September 2002, the date averred by the plaintiff in its pleadings (see [76] above). 80     UOB further submits that a reasonable time should be given for investigating the situation and for bringing the infringing activity to an end. This, it suggests, should be a period of six months, relying on the factual scenario inLux Traffic Controls Limited v Pike Signals Limited[1993] RPC 107, where such a grace period was submitted by the defendant there and accepted by the plaintiff. This is because UOB had been using the FCC System for about eleven months by October 2002 and had spent a lot of time and money on it and would suffer in reputation as a leading bank if it withdrew the system immediately upon receiving the plaintiff’s notification. Alternatively, it suggests that the minimum grace period ought to be three months. 81     The plaintiff contends that it could only commence this action after the patent was granted in June 2003. UOB was aware of the invention but chose to rely on FCC’s assurance and indemnity. The plaintiff was trying to resolve the matter amicably until September 2003 when it took legal advice and weighed its options before deciding to commence action about a year later. It had to take into consideration the fact that it was also then engaged in litigation in Ireland and in Australia. Although UOB said in its opening statement that the plaintiff was only entitled to damages and not an account of profits, that was not pleaded and in any event, the plaintiff has the option of electing which remedy to pursue at the assessment stage. 82     I do not think s 69(2) of the Act has any relevance here. I also doubt that specifying the number of the patent in the 19 May 2002 email would have made any difference to UOB in the circumstances. In any event, the European patent was attached to the email and surely that was a much more reliable and ready notification than merely conveying a registration number, which serves no purpose other than to enable an alleged infringer to find out more about the patent. The evidence shows that the meeting between the plaintiff and UOB was on 24 September 2002 and that Gerard Barry had orally informed the bank about its European patent and the pending application here. That date (approximate though it may be) is also part of the plaintiff’s pleaded case. There is nothing to suggest that the oral communication was not taken seriously by UOB. The subsequent written communication did nothing more than to place the matter formally on record. The evidence shows that UOB was pretty nonchalant as FCC had assured the bank, upon its inquiry, of the patent’s invalidity and the bank also felt secure in the knowledge that FCC would be the ultimate responsible party should any infringement action be taken. In the words of UOB’s Francis Hsu, a “judgment call” was made by him. The continued use of the FCC System after 10 May 2002 was therefore an advised and a considered decision. 83     An infringer who believes that a patent can be challenged is certainly not the same as one who does not know about the patent. To succeed in this defence, an infringer must plead and prove absence of knowledgeandabsence of reasonable grounds. I find that by 10 May 2002, UOB had the requisite knowledge of the patent or at least reasonable grounds for supposing that it existed and that any innocent infringement therefore ended by that date. 84     I accept that in an appropriate situation, a grace period could be granted for an innocent infringing party to bring its infringing activities to a halt after it becomes aware of a relevant patent. However, this case does not warrant such equitable intervention. This is because UOB never had the intention to stop the infringing activities after it was notified. It was taking no steps whatsoever to stop using the FCC System after it was imbued with the requisite knowledge and therefore does not merit being given a grace period. A grace period is time given to a remorseful infringer to undo his unintended misdeeds, not a licence conferred on an infringer who feels no need for repentance to prolong the infringement with impunity. UOB is accordingly liable for infringement of the patent from 10 May 2002 onwards. As mentioned earlier (at [2]), this liability will be covered by FCC’s indemnity. 85     The plaintiff is granted judgment against both UOB and FCC on the ground that its patent is valid and has been infringed. The injunction against further infringement, as prayed for in the Statement of Claim, is granted but it is to be suspended for four weeks in order to allow the defendants time to make arrangements to comply with this judgment. The liability for infringement will, however, continue to run during these four weeks until such time as infringement has ceased altogether. There will be an inquiry by the registrar on damages or an account of profits (see s 67(2) of the Act) and the plaintiff is to make its election at or before the stage of directions to be given for such an inquiry. Costs of this trial are awarded to the plaintiff against both UOB and FCC. Costs of the inquiry are reserved to the registrar conducting the same. It follows that the respective counterclaims for invalidating the patent are dismissed. 86     It remains for me to deal with the submissions relating to the quality of FCC’s witnesses. Clearly, most of them were not independent witnesses with no interest in these proceedings as they were related in one way or another with some party that was opposing the plaintiff’s patent. That alone does not disqualify them as witnesses but it does mean that their evidence has to be scrutinized with greater care because of the increased likelihood of bias. Similarly, Patrick Shiel’s testimony as an expert has to be considered with his history and his involvement in the subject matter of the global litigation in mind."
    }
}