{
    "case_title": "Public Prosecutor v G Krishnasamy Naidu",
    "ncitation": "[2006] SGHC 64",
    "coram": "Woo Bih Li J",
    "sections": {
        "Background": "1          The accused, G Krishnasamy Naidu, was committed to stand trial in the High Court on two charges. At the trial, the Prosecution proceeded with the first charge and the second charge was stood down. The first charge was for the offence of murder. It reads: You, G KRISHNASAMY NAIDU … are charged that you on 17 May 2004, at or about 6.20 am, at Sony Display Device (Singapore), located at No. 5 Tuas [Lane], Singapore, did commit murder by causing the death of one Chitrabathy d/o Narayanasamy, female, 39 years old, and you have thereby committed an offence punishable under section 302 of the Penal Code, Chapter 224. 2          The accused is a male Singaporean Indian. He was born on 18 May 1961. At the date of the alleged offence on 17 May 2004, he was 43 years of age. The deceased (“Chitra”) was his wife. The accused had been working as a tour bus driver, a taxi driver and then as a lorry attendant prior to 17 May 2004. 3          Chitra was a female Singaporean Indian. She was born on 18 April 1965 and was about 39 years of age when she was killed. Before her demise, she was working as a production operator at Sony Display Device (S) Pte Ltd (“Sony Display”) at 5 Tuas Lane, Singapore. 4          The marriage between the two was an arranged one. They were married on 1 June 1985. The accused was then 24 years of age and Chitra was 20 years of age. After the marriage, the couple lived with the accused’s mother at Block 8 Telok Blangah Crescent, #03-169, and later moved to their matrimonial home at Block 111 Teck Whye Lane, #10-612. The couple have two children. Their daughter, Subhasini d/o Krishnasamy Naidu (“Subhasini”), was born on 1 July 1986. Their son, Naresh s/o Krishnasamy Naidu, was born on 3 September 1989. 5          The evidence established that at about 6.20am of 17 May 2004 the accused had attacked Chitra with a chopper at 5 Tuas Lane and killed her. The forensic pathologist for the case, Dr Gilbert Lau, found two incised wounds on Chitra’s right arm, two incised wounds on her neck and two incised wounds on her back. He was of the view that the cause of death was due to sub-total decapitation caused by a gaping, deep incised wound across the neck. 6          Sections 300 (a) and (c) of the Penal Code (Cap 224, 1985 Rev Ed) state: Except in the cases hereinafter excepted culpable homicide is murder — (a) if the act by which the death is caused is done with the intention of causing death; … (c) if it is done with the intention of causing bodily injury to any person, and the bodily injury intended to be inflicted is sufficient in the ordinary course of nature to cause death[.] 7          The evidence also established that the accused intended to cause the bodily injuries to Chitra. The bodily injuries intended to be inflicted and, in particular, the sub-total decapitation was sufficient in the ordinary course of nature to cause death. This meant that s 300(c) was applicable. Furthermore it was clear that the sub-total decapitation was done with the intention of causing death. Therefore, s 300(a) was also applicable.",
        "The defence": "8          The Defence relied on the defence of diminished responsibility under Exception 7 to s 300. The exception states: Culpable homicide is not murder if the offender was suffering from such abnormality of mind (whether arising from a condition of arrested or retarded development of mind or any inherent causes or induced by disease or injury) as substantially impaired his mental responsibility for his acts and omissions in causing the death or being a party to causing the death. 9          The Defence alleged that the accused was suffering from Delusional Disorder Jealous Type which was a disease of the mind and that the disease had substantially impaired his mental responsibility for his acts in causing Chitra’s death. This disorder was referred to as “morbid jealousy” in the trial. Although diminished responsibility is not an uncommon defence, morbid jealousy is. Therefore, I should set out at the outset some literature about the subject which was introduced in evidence.",
        "The literature": "10        TheDiagnostic and Statistical Manual of Mental Disorders(American Psychiatric Association, 4th Ed, 1994) (“DSM-IV”) (Exh P191) states that the essential feature of Delusional Disorder is the presence of one or more non-bizarre delusions that persist for at least one month. One of the subtypes of Delusional Disorder is the jealous type which is described at pp 297 and 298 as follows: This subtype applies when the central theme of the person’s delusion is that his or her spouse or lover is unfaithful. This belief is arrived at without due cause and is based on incorrect inferences supported by small bits of “evidence” (e.g., disarrayed clothing or spots on the sheets), which are collected and used to justify the delusion. The individual with the delusion usually confronts the spouse or lover and attempts to intervene in the imagined infidelity (e.g., restricting the spouse’s autonomy, secretly following the spouse, investigating the imagined lover, attacking the spouse). 11        Page 301 of DSM-IV states: Diagnostic criteria for 297.1 Delusional Disorder Nonbizarre delusions (i.e., involving situations that occur in real life, such as being followed, poisoned, infected, loved at a distance, or deceived by spouse or lover, or having a disease) of at least 1 month’s duration. 12        At p 765, “delusion” is defined as: A false belief based on incorrect inference about external reality that is firmly sustained despite what almost everyone else believes and despite what constitutes incontrovertible and obvious proof or evidence to the contrary. The belief is not one ordinarily accepted by other members of the person’s culture or subculture (e.g., it is not an article of religious faith). When a false belief involves a value judgment, it is regarded as a delusion only when the judgment is so extreme as to defy credibility. Delusional conviction occurs on a continuum andcan sometimes be inferred from an individual’s behavior. It is often difficult to distinguish between a delusion and an overvalued idea (in which case the individual has an unreasonable belief or idea but does not hold it as firmly as is the case with a delusion). [emphasis added] 13        At the same page, a “bizarre” delusion is defined as: A delusion that involves a phenomenon that the person’s culture would regard as totally implausible. 14        Karl Jaspers,General Psychopathologyvol 1 (The Johns Hopkins University Press, Reprint Ed, 1997) (“Jaspers”) (Exh D21) also suggests that a delusion of jealousy may be inferred from one’s behaviour. Page 106 states: Delusion however arises from a primary experience not accessible to others and it cannot be substantiated. We can recognise it only by the way in which the patient subsequently tries to give it ground. A delusion of jealousy, for instance, may be recognised by its typical characteristics without our needing to know whether the person has genuine ground for his jealousy or not. The delusion does not cease to be a delusion although the spouse of the patient is in fact unfaithful – sometimes only as the result of the delusion. 15        It was not disputed that the fact of an affair is not determinative. Accordingly, a person may be suffering from morbid jealousy even though his partner is in fact having an affair. However, other literature caution against placing too much reliance on behaviour and stress the need for a delusion before a diagnosis of morbid jealousy is made. The literature also points out that the distinction between normal and morbid jealousy is not always clear. I set out below some of the literature on these points as well as on the characteristic behavioural manifestations of a person suffering from morbid jealousy. 16        Michael Gelder, Richard Mayou & Philip Cowen,The Shorter Oxford Textbook of Psychiatry(Oxford University Press, 4th Ed, 2001) (Exh D22) states at p 389: Inpathological (or morbid) jealousy, the essential feature is an abnormal belief that the marital partner is beingunfaithful. The condition is called pathological because the belief, which may be adelusionor anovervalued idea, is held on inadequate grounds and is unaffected by rational argument. …. The belief is often accompanied by strong emotions and characteristic behaviour, but these do not in themselves constitute pathological jealousy. A man who finds his wife in bed with a lover may experience extreme jealousy and may behave in an uncontrolled way, but this should not be called pathological jealousy.The term should be used only when the jealousy is based on unsound evidence and reasoning. [emphasis in original] 17        An article, “Aspects of morbid jealousy”, by Michael Kingham & Harvey Gordon, in the journal, Advances in Psychiatric Treatment (2004) 10: 207–215, published by The Royal College of Psychiatrists (“Kingham & Gordon”) (Exh D9), states at 207: Morbid jealousy describes a range of irrational thoughts and emotions, together with associated unacceptable or extreme behaviour, in which the dominant theme is a preoccupation with a partner’s sexual unfaithfulness based on unfounded evidence (Cobb, 1979). It is noteworthy that individuals may suffer from morbid jealousy even when their partner is being unfaithful, provided that the evidence that they cite for unfaithfulness is incorrect and the response to such evidence on the part of the accuser is excessive or irrational. Healthy people become jealous only in response to firm evidence, are prepared to modify their beliefs and reactions as new information becomes available, and perceive a single rival. In contrast, morbidly jealous individuals interpret conclusive evidence of infidelity from irrelevant occurrences, refuse to change their beliefs even in the face of conflicting information, and tend to accuse the partner of infidelity with many others (Vauhkonen, 1968). 18        On confirmatory behaviours the article states at 211: Once suspicions regarding the partner’s fidelity are established, they quickly become preoccupying. Overt behaviours to investigate suspicions and preoccupations are common and evident to all involved. They include interrogation of the partner, repeated telephone calls to work and surprise visits, stalking behaviour, or hiring a private detective to follow the partner. Jealous individuals may search the partner’s clothes and possessions, scrutinise diaries and correspondence, and examine bed linen, underclothes and even genitalia for evidence of sexual activity. They may hide recording equipment to detect clandestine liaisons, and some go to extreme lengths, including violence, to extract a confession from their partner. 19        I now come toPrinciples and Practice of Forensic Psychiatry(Robert Bluglass & Paul Bowden eds) (Churchill Livingstone, 1990). Chapter IX.7 is on “Morbid jealousy and the delusion of infidelity” by Paul Mullen (“Mullen”). Page 823 states: This chapter attempts to distinguish morbid jealousy from the varied manifestations of this passion that are best considered within normal limits, and to discuss its clinical presentations. 20        Page 824 states: Jealousy has however been considered to be pathological even in the absence of delusional beliefs, when for example the individual responds with abnormal facility and intensity to events which appear, albeit remotely, to place the partner’s fidelity in question (Mairet 1908, Shepherd 1961). 21        The chapter also states at pp 824 to 825: Behaviour Jealousy watches, constantly vigilant for the tell-tale evidence which will confirm its suspicions. Checking is the behaviour of jealousy: checking, cross-checking, rechecking; following, searching through pockets, washing-baskets, bank statements, inspecting the lover’s clothes for tell-tale hairs, their underwear for semen stains, the bed linen for the marks of illicit love. The suspected partner is usually subjected to inquisitions on every detail of their present and past behaviour. The incessant demand is for the confession which will put jealousy’s mind at rest, but which even if obtained produces at best temporary respite and often an explosive and potentially violent response. The assumption that behaviours such as spying, cross-questioning and searching desperately for the evidence of infidelity are the hallmark of morbid jealousy is mistaken. Otherwise normal individuals in the grips of jealousy find themselves indulging in just such activities, often to their own horror and shame. Similarly, violence is too common in normal jealousy to offer a useful criteria for morbid jealousy. The traditional reluctance of psychiatry to attribute pathology on the basis of behaviour, in contrast to some of our colleagues in clinical psychology and social work, is more than justified in jealousy. The behaviour of the jealous, however extreme, must remain dubious grounds for considering the jealousy morbid, though such actions are reason for enquiring further into the accompanying state of mind. …. Summary The separation of the jealousy complex into component parts, however artificial, does allow the distinction between normal and morbid jealousy to be approached systematically along a number of parameters. In practice, however, the distinction may remain elusive. When jealousy emerges in the context of a recognisable mental disorder, such as a major depression, and can reasonably be considered symptomatic of that underlying illness, then it can confidently be considered morbid. When the jealousy is a reaction to a state of affairs which can be understood as raising the question of infidelity, then the designation of morbid often rests on subjective judgements of the excessive and exaggerated nature of particular features in the jealousy complex. Such judgements may owe as much to cultural and ethical norms as to a knowledge of psychopathology. The relativism and uncertainty can encourage the wary clinician to confine morbid jealousy to those states where delusions of infidelity are present, or where the jealousy can reasonably be considered a symptom of a morbid process open to external validation. Even here, however, problems exist. DELUSIONS OF INFIDELITY …. The absolute conviction experienced as self-evident reality, not mere opinion or belief, said to characterise delusion, is often encountered in normal jealousy. The lack of amenability to reason and failure to modify with experience, said to be hallmarks of delusions, are to be found in many examples of jealousy among otherwise normal individuals. 22        Page 826 states: Delusional interpretation Deluded individuals habitually interpret a wide variety of apparently unrelated or trivial occurrences as confirmation of their view and dismiss contrary evidence as irrelevant or open to doubt and a different construction. Jealousy, normal and morbid, operates in a similar mode, seeking confirmation and ignoring refutation. Delusional experiences can be recognised, in some instances, from their emergence on the basis of strange and incomprehensible insights and intuitions. In one of our cases the wife’s infidelity was revealed by the fact that the lights on the Christmas tree in the window of the marital home were flashing on and off in synchrony with those on the neighbour’s tree; in another case the serial numbers on tax returns provided final and irrefutable evidence of adultery. In practice the situation is rarely so clear. The jealous, be they morbidly so or not, will divine infidelity from subtle changes in manner and in sexual technique, from odd irregularities in established patterns of life, or from alterations in the nuances of personal interaction visible only to the eye of love. 23        Page 827 states: Reactive and symptomatic jealousy Morbid jealousy may be reactive in the same manner as normal jealousy in that it is a response to a provocation. The distinction is to be found in the type of reaction and its genesis. Morbid jealousies that are reactive can be said to have the following features: 1.         a provocation which can reasonably be related to fears about the partners’ fidelity; 2.         a state which sensitises the subject to such provocation, which may be one or more of the following: a.         a personality deviation such as poor self-esteem and oversensitivity or a superficial self-confidence covering unacknowledged vulnerability; or b.         a mental disorder, most frequently depressive; or c.         a past experience of being deceived or deserted; 3.         an exaggerated psychological and behavioural response which can on occasion, involve the development of delusional ideas; 4.         a course and evolution which can be understandably related to the provoking situation and subsequent developments. Morbid reactions differ from their normal counterparts, both in terms of the intensity and facility of the response and the presence of predisposing factors such as a personality disorder, which leaves the patient peculiarly vulnerable and sensitive to any threat to his self-esteem. 24        The overview at p 834 states: OVERVIEW Morbid jealousy occupies an ambiguous and marginal position in contemporary psychiatry which is dominated by the disease entities. Denied the seal of diseasehood, morbid jealousy has been either relegated to a symptom of proper disorders like schizophrenia or, despite its frequency, placed as a curiosity amongst the rare psychiatric syndromes. The difficulties of fitting morbid jealousy into the framework of current psychiatric thought has been emphasised. The solution for the clinician and the expert witness must be a pragmatic eclecticism in dealing with this common and important area of human experience. 25        The textbook, Gregory L White & Paul E Mullen,Jealousy: Theory, Research and Clinical Strategies(The Guildford Press, 1989) (Exh D8) at p 194 states: The foregoing discussion illustrates the difficulty in producing a phenomenological description of delusions of infidelity that will provide a clear and simple distinction between the beliefs common in normal jealousy and the delusions of pathological jealousy. No single factor can be relied upon as a foolproof guide. In practice, many cases create little problem, given the bizarre nature of the beliefs and the history of their emergence and extension. In some situations, however, it is impossible for a clinician to be certain whether he or she is dealing with a delusional phenomenon or a flamboyant expression of normal jealousy. In situations where doubt exists, the presumption of normality should always be made. 26        The textbook, David P Farrington & John Gunn,Aggression and Dangerousness(John Wiley & Sons, 1985) (Exh D7) states at pp 109 to 111: Todd and his colleagues (1971) employed the absence of reasonable grounds for suspicion as a criterion of abnormality, but added that jealous reactions, justified or not by the evidence, were abnormal if they were of such intensity as to render the person dangerously aggressive. This has the advantage of taking account of the patient’s reactions and way of responding, butthe concentration on dangerous aggression is perhaps overly restrictive and would lead to very considerable problems if applied in the forensic field. Todd (1978), in a later paper, made this clear when he said ‘psychiatrists are concerned with sexual jealousy stemming from delusion and not with an excessive reaction’. In the situation of the courtroom, a psychiatrist who proposed that an accused person, who had acted in a dangerously aggressive way as a result of jealousy, was therefore abnormal mentally, could create difficulties. This is exemplified by one of our recent homicide cases. The accused was a somewhat shy young man who was unusually emotionally dependent upon his wife who was some years older than he. He discovered the wife’s liaison with another man, and when threats to kill himself or her failed to persuade her to give up the relationship, he carefully planned and carried out a murderous assault on her and her lover. This man had grown to adulthood in Southern Italy and his social attitudes were those of his birthplace rather than those of the smart middle-class suburb in North London where his wife had grown up and in which they both now resided. He was distressed and threatened by the wife’s infidelity, but his actions, though undoubtedly dangerously aggressive, in no way arose from abnormality of mind. Should such a man’s jealousy be considered morbid, or is it not preferable to see his jealousy as understandable culturally and personally, and the actions stemming from it as criminal? Shepherd (1961) makes a similar but less restrictive distinction when he says ‘a person’s jealousy may be considered abnormal as much by virtue of thefacility and intensity with which they react as by the abnormal quality of their reactions’. …These types of distinction, as Shepherd recognized,leave the borderline between morbid jealousy and the normal, understandably jealous individual, arbitrary and poorly defined. The study of clinical material shows the shallowness and inadequacy of most attempts to separate so-called ‘normal’ from so-called ‘pathological’ jealousy. The truth or falsity of the suspicions will not do as a distinction.Equally the intensity of the response, both in terms of the distress and the behaviour elicited, makes an uncertain ground for a clear distinction.Cases of suicide or murder as a response to supposed or actual infidelity are within the experience of most psychiatrists with an interest in the forensic field. But without knowing more about the nature of the individual, his vulnerabilities, ethical and religious convictions, the way he habitually deals with anger and frustration, the meaning and significance of this particular spouse or partner to him, and the nature of their previous relationship, could any of us say that the resort to such terrible violence unequivocably indicated psychiatric pathology? Only the most mechanistic approach allows such an equation. [emphasis added]",
        "The past relationships before February 2004, a personal protection order and the accused’s brush with the law": "27        The nature of the defence requires a consideration of the accused’s reactions to Chitra’s past relationships with other men and how their own relationship developed. For this purpose I have used the summary of evidence in Exh P192 (“the Summary”) prepared by the Prosecution during the trial as a guide with such amendments as I consider appropriate for accuracy, elaboration or easier reading. However that does not mean that I accept everything that was stated in the Summary. I will elaborate later on those material aspects which I do not accept.",
        "1987 – First Affair with Vele Murugan": "28        In 1987, Chitra had an extra-marital affair with one Vele Murugan (“Murugan”), a Malaysian colleague at her workplace, Pelmac Industries Pte Ltd (“Pelmac”). Unknown to the accused then, Chitra had been going out on dates with Murugan on several other occasions over a period of about two months prior to 24 April 1987. On 24 April 1987, Chitra pretended to go to work. However, unknown to the accused and his mother, Chitra had taken leave that day. On that day, a security guard at Pelmac telephoned the accused’s mother to inform her that Chitra was on leave. After ascertaining that Chitra was not at her parents’ home, the accused looked for her at her workplace but was told that she was not at work. Chitra returned home at around midnight that night, which was the usual time she would return home after work. When the accused questioned her as to her whereabouts that day, she insisted that she had been at her workplace. Knowing that she was lying, the accused questioned her further. She then stated that she had been at a friend’s place at Block 5 Boon Lay. The accused did not pursue the matter further that night. 29        On the next day, the accused checked and discovered that there was no Block 5 in Boon Lay. Later that night, the accused questioned Chitra again at home. Chitra kept silent when confronted with the fact that there was no Block 5 in Boon Lay. The accused then assaulted Chitra, after which Chitra confessed that she was having an extra-marital affair with Murugan. She also admitted that on the previous day, she had gone to Strand Hotel and engaged in sexual intercourse with Murugan. 30        The accused met up with Murugan and told Murugan to stop speaking to Chitra. Murugan agreed. During this meeting, Murugan admitted to having sex with Chitra at Strand Hotel. The accused wanted to divorce Chitra, but his mother advised him to give her a second chance. The accused took his mother’s advice but laid down the condition that Chitra must resign from Pelmac and stop seeing Murugan. Chitra resigned and stopped work. The accused also changed the telephone number of his mother’s flat where they were staying. 31        After this incident, the accused forgave Chitra and their relationship returned to normal. The accused did not check on Chitra. In 1993, the accused was retrenched from his job as a tour bus driver when his employer-company closed down. He then started work as a taxi driver in 1993. In 1993, Chitra started work at Sony Display to supplement the family income. The accused and Chitra had a normal and uneventful relationship until 2000.",
        "2000 – Second Affair with Gunaseelan Jayaseelan": "32        In 2000, Chitra had an extra-marital affair with one Gunaseelan Jayaseelan (“Jayaseelan”), an Indian national colleague at her workplace at Sony Display. The accused discovered this by chance. On 27 March 2000 (Monday), Chitra was supposedly working on the night shift and left home on the pretext of going to work. Unknown to the accused then, the factory was closed for nine days from 25 March 200 (Saturday), and all staff had to take leave. There was no overtime work as well. On 28 March 2000 (Tuesday) at 4.00am, the accused returned home after work and discovered that his son was sick. He telephoned Chitra’s workplace numerous times from 4.00am till 9.00am but nobody answered the telephone. Chitra did not own a mobile phone at this point in time. At 8.30am, the accused brought the son to a clinic. When the accused called Chitra’s workplace at about 9.30am, an engineer answered the telephone and told him that the factory was closed for nine days and all staff had to take leave. The accused had called on the third day of closure. It was only at this juncture that the accused came to know that Chitra had not gone to work. 33        When Chitra was on night shift, she would usually be home by 8.00am the following morning. On 28 March 2000, at about 11.00am to 11.20am, Chitra called home and asked if the accused would like her to buy lunch. The accused was angry. He told her that their son was sick and asked her to return home early. Chitra returned home sometime before 12.00 noon. The accused locked the front door and the door of the son’s bedroom. He told her that their son was sick and he had been calling her workplace. He questioned her on her whereabouts. She lied by saying that she was working at the main plant (a different plant). The accused knew that she was lying as he had learnt that morning that even this main plant was closed. The accused told her that the main plant was closed. When she insisted that she was working at the main plant, the accused hit her with a bamboo pole. She then said that she had been to a friend’s home to watch video compact discs (“VCDs”), but the accused did not believe her as she should have told him if she had wanted to watch VCDs at a friend’s place. He told her that she probably had a fling with somebody outside, but she denied it. He continued to hit her with the bamboo pole and fractured her right wrist. When he went to the toilet, she ran out of the flat and made a police report. She was hospitalised at the National University Hospital (“NUH”) for four days until 31 March 2000 (Friday). 34        On 28 March 2000 at about 6.00pm, the accused discovered a telephone number from the Caller ID Service (“caller ID”) on his home telephone. That night, he called that telephone number and discovered that it was the telephone number of a foreign workers’ hostel for Sony. The person who answered his call said that Jayaseelan was Chitra’s colleague working on the same shift and would have been the one who called the accused’s home. As Jayaseelan was not around, the accused left a message for Jayaseelan to call back. On the next day, 29 March 2000, Jayaseelan called back. The accused asked Jayaseelan why he called the accused’s home. Jayaseelan replied that he wanted to speak to “sister”, referring to Chitra. The accused asked him whether he was having an affair with Chitra, but he denied this. He claimed that he treated Chitra like an elder sister. The accused did not believe that there was nothing between Jayaseelan and Chitra, because when the accused asked Jayaseelan to come to the accused’s flat to talk about the matter, he refused as he was afraid that the accused would assault him. Yet, Jayaseelan had been to the accused’s flat on two prior occasions when the accused was not at home. 35        Whilst Chitra was warded in NUH, the police visited her in hospital, and she told the police that it was a domestic dispute and she did not wish to pursue the matter against the accused. The police then gave the accused an oral warning that serious action would be taken against him if he repeated the offence. 36        When Chitra was discharged from hospital on 31 March 2000 (Friday), she went to stay at her mother’s place until 2 April 2000 (Sunday). She was on medical leave for two months. On the night of 2 April 2000 (Sunday), the accused fetched Chitra home and questioned her about Jayaseelan. He did not conduct any checks on her body or clothing. He spoke to her in a normal tone, and asked her to admit if she indeed was having an affair with Jayaseelan. When she denied this, the accused assaulted her. He beat her up, and she bled from her face, mouth and nose. After the assault, Chitra admitted that she was having an affair with Jayaseelan and had been to Hotel 81 at Geylang with Jayaseelan on 4 March 2000 (Saturday), 11 March 2000 (Saturday), 18 March 2000 (Saturday) and 27 March 2000 (Monday). She asked for forgiveness and clung to the accused’s feet. 37        The accused asked Chitra to call Jayaseelan to come to Chitra’s flat to meet her after midnight on Sunday night, on the pretext that the accused had gone to Malaysia and was not at home. When Chitra was speaking to Jayaseelan on the telephone, the accused listened in on the conversation on another telephone. Jayaseelan agreed to come over to Chitra’s flat. When Jayaseelan arrived and entered the flat, the accused and his brother-in-law, Narayanasamy Rajoo (“Rajoo”), assaulted Jayaseelan who then admitted to having sexual intercourse with Chitra on many occasions in Hotel 81. The accused told Jayaseelan not to speak to Chitra anymore. During this time, Chitra was in the kitchen where the accused had asked her to remain while he talked to Jayaseelan. 38        According to the accused’s understanding of Tamil custom, a woman should not pray when she was menstruating. As Chitra had conducted prayers throughout the month, the accused became suspicious and asked her why she did not have her menses. She replied that she did not know. The accused was also suspicious as he had not had sexual intercourse with her for about four to five months. On 17 April 2000, the accused brought Chitra to Choa Chu Kang Polyclinic where she was tested to be eight weeks pregnant. The accused brought her home and on the way home, he questioned her on how she became pregnant. Chitra initially said that she was carrying the accused’s child but the accused confronted her with the fact that he had not had sexual intercourse with her for about four to five months. When they reached home, the accused questioned her but she did not reply and “acted blur”. That made the accused very angry, and he then assaulted her. When Chitra could not withstand the beating, she confessed that she was carrying Jayaseelan’s baby. On 28 April 2000, the accused brought Chitra to a private clinic at Wisma Atria and paid $500 for her abortion. 39        The accused wanted to divorce Chitra, but Chitra pleaded for another chance on account of the children. The accused forgave her because he still loved her very much, and also because he wanted the children with him. The accused explained that despite her two affairs, she was still his only love. Prior to his marriage, the accused had never had any girlfriend and had never loved anybody else. 40        The accused asked her not to return to work at Sony Display, but Chitra insisted on working as she could not get such good pay elsewhere. The accused accepted her explanation and permitted her to work but warned her not to speak to Jayaseelan. She returned to work in June 2000. He did not stop her from working as he was not earning enough as a taxi driver to support the family. 41        After this incident, the accused forgot about the past, and their relationship returned to normal. They had a normal sex life. During the period from April 2000, after Chitra agreed to end her affair with Jayaseelan, until December 2001, when the accused chanced upon Chitra’s next affair with Anan, the accused did not have any reason to believe or suspect that Chitra was having an affair with any other person. He did not monitor Chitra’s movements, check her mobile phone or check the caller ID at home. 42        Jayaseelan returned to India in October 2001. Jayaseelan sent a Valentine’s Day card by registered mail to Chitra from India in 2002. The accused read the card and kept it.",
        "Application for Personal Protection Order": "43        Subsequently, Chitra decided to divorce the accused, and applied for a Personal Protection Order (“PPO”) from the Family Court on 28 November 2001. After the summons and expedited order were served on the accused by an officer from the Family Court in the afternoon of 28 November 2001, the accused and Chitra quarrelled during which time the accused threatened to kill Chitra and the children if the application for PPO was not withdrawn. The accused made the threat because he did not want Chitra to divorce him. On 5 December 2001, the Family Court issued a PPO against the accused by consent.",
        "2001 – Third Affair with Anan": "44        In December 2001, Chitra had an extra-marital affair with an Indian national named Anan. Anan worked at a flower shop near the accused’s flat. On one occasion, at about 3.30pm to 4.00pm, when the accused was leaving for work, he saw Chitra standing inside the flower shop talking to Anan. Their son was standing outside the shop. According to the accused, she and Anan were standing too close to each other. From outside the flower shop, the accused called out to Chitra. She appeared frightened. When he asked her why she was talking to Anan instead of going home, she replied that he was just a friend and she was having a friendly chat. The accused remarked that she would start out with a friendly chat and end up having an affair with him. 45        On another occasion in December 2001, whilst both the accused and Chitra were at home, the accused took hold of Chitra’s mobile phone in order to transfer a picture message from her phone to his mobile phone. Coincidentally, an incoming call was received on Chitra’s mobile phone. The accused answered the call, but the caller kept silent. The accused took down the telephone number of the caller, as reflected by the caller ID on Chitra’s phone, in order to find out who the caller was. He passed the telephone number to a friend Kumar, whose cousin worked in Starhub. Kumar got his cousin to check Starhub’s records and discovered that the SIM card for the telephone number was registered under Chitra’s name. Chitra discontinued the subscription to that telephone number in December 2001. 46        On or about 9 January 2002, when the accused questioned Chitra about the SIM card, she claimed that she had given the SIM card to her friend in Malaysia. The accused noted that the call had been reflected as a local call and not an overseas call and he questioned her further. The accused thought that Chitra had bought the SIM card for this particular person because he was a foreign national. The accused questioned Chitra about her relationship with Anan. When she denied any relationship with Anan, he beat her with a bamboo pole. She then confessed that she had purchased the SIM card for Anan and had gone to a hotel to have sexual intercourse with Anan on two occasions. When the accused assaulted Chitra, he told her to tell Anan to leave the location; otherwise he would assault Anan. Chitra then telephoned Anan in his presence and told Anan so. The accused did not confront Anan as the accused’s friends used to patronise the flower shop and he was afraid that all his friends would come to know of the affair if he confronted Anan. 47        On 10 January 2002, Chitra made a police report regarding the beating with the bamboo pole that she had received from the accused.",
        "The accused’s brush with the law in 2002": "48        Chitra had made police reports in respect of the 28 March 2000 incident when the accused fractured Chitra’s wrist with a bamboo pole, the threat made on 28 November 2001 to Chitra when the accused was served with the expedited order and summons for PPO and the 10 January 2002 incident when the accused hit Chitra on the arms and leg with a bamboo pole. When the police were conducting investigations into those cases, Chitra did not initially reveal that the real reasons for the disputes and assaults were her affairs with Jayaseelan and Anan. It was only on 21 February 2002 (the last police interview in a series relating to three cases) when she was confronted with the facts provided by the accused, that she stated that she “might have admitted” to the affair with Murugan in 1987 and implied that she spent the night on 27 March 2000 at Hotel 81 in Geylang because she was not on talking terms with the accused due to his drinking and his failure to support the family. She eventually accepted that she had “admitted to him about the affairs, when he started hitting me with the bamboo pole”. In her 21 February 2002 police statement, Chitra informed the police that she wished to withdraw all the charges against the accused as she wanted to give him a last chance to save their marriage and keep the family together. 49        The accused was charged in court with three charges. Eventually, the Prosecution reduced the charge of voluntarily causing grievous hurt for the 28 March 2000 incident to a change of voluntarily causing grievous hurt under grave and sudden provocation. The accused pleaded guilty to this reduced charge on 25 March 2002 and the two other charges were taken into consideration for the purposes of sentencing. The accused was sentenced to three months’ imprisonment on 25 March 2002. During the term of imprisonment, Chitra visited the accused in prison and cried. 50        On 25 May 2002, the accused was released from prison, and he returned to live with Chitra and their children. He was happy to be out of prison. Chitra cried again and asked for forgiveness. The accused forgave Chitra for her affair with Anan as he still loved her. Their relationship returned to normal and the accused forgot about the past. The accused felt there was happiness at home. During the period from his release from prison in May 2002 until February 2004, the accused had a normal relationship with Chitra. 51        The accused stated that he noticed a pattern of events in respect of the three affairs involving Murugan, Jayaseelan and Anan. Firstly, he would confront Chitra about the suspected affair and she would deny it. He would then assault her and she would then confess to the affair. The accused said that he would only confront Chitra about a suspected affair after he had obtained evidence or had reasonable ground for believing that she was seeing another man. He also said that he did not constantly accuse her of having affairs with other men without reason. He had a normal relationship with her and used to go out with the family.",
        "2003 to 2004 – The relationship with Michael Lee": "52        Michael Lee (“Michael”) is a Malaysian. He was working in a different plant of Sony at 1 Tuas Road. 53        Michael said that in the beginning of 2003, he developed an interest in Chitra. After a few months, they would hold hands when returning home at the Teck Whye area. On some occasions when he sent her home, they would kiss. 54        In mid-2003, Chitra and Michael went to Genting Highlands for two days and one night but he did not have sex with her as he was drunk that night. 55        Also, Chitra and Michael stayed at a chalet in East Coast Park, with her children, on two occasions at the end of 2003 and also at the beginning of 2004. On 19 and 20 January 2004, they were again staying at a chalet there. On the second day of that occasion, he had slept with Chitra on the floor beside the bed which the children were sleeping on and had touched her breast and her private part. Thereafter they continued to stay in touch. They took the same company transport and sent messages through their handphones, including messages of love. In May 2004, he learnt that Chitra had been killed by the accused.",
        "February 2004 onwards – relationship with Asokan s/o Muthu Suppiah": "56        In the month of February 2004, the accused did not stay at home with his wife and children because of family problems. He had no problems with Chitra but he felt that his children were not listening to him and Chitra was supporting the children. On occasion, his children would return home late and when he questioned them, they told him that they had a PPO and threatened to make a complaint against him. In order to avoid beating the children, he therefore left home and went to stay with a friend, Subash, at his working place in Toh Tuck Road. During that one month, he did not contact Chitra at all. From time to time, he would call the children to check if they were alright. For the first six days of March 2004, he stayed with another friend, Johnson, in Bukit Batok. On 6 March 2004, he returned home because he missed his wife and children. Between 6 March 2004 and 26 March 2004, he did not have any problem with either Chitra or the children. Life was back to normal. However, he and Chitra did not sleep together. He would sleep on the sofa in the living room. After his return, he and Chitra were not on too friendly terms and they did not talk much to each other. When he tried to talk to her, she would turn her face away. However, he did not suspect that she was having an affair and did not check on her. 57        Asokan s/o Muthu Suppiah (“Ashok”) was working as a security guard at Sony Precision Engineering Center at 52 Tuas Avenue 9. Unknown to the accused then, Chitra and Ashok had gotten to know each other sometime in early February 2004, when Ashok struck up a conversation with her when she went over to see the Sony company doctor at 52 Tuas Avenue 9. Chitra’s workplace at 5 Tuas Lane was just round the corner from 52 Tuas Avenue 9. It turned out that Ashok and Chitra took the same company bus to work, and Ashok had already noticed her on the company bus. After the first meeting, Chitra would go over to the rear of the company bus where Ashok usually sat and would sit with Ashok each day. After their third or fourth meeting, Chitra and Ashok had exchanged mobile phone numbers, and they started exchanging phone messages. Ashok called her “Chitra” and Chitra called him “Bo Bo” on the phone. About one week after knowing each other, Ashok and Chitra started sharing their personal lives with each other. She told Ashok that she was married but separated from her husband because her husband would assault her when drunk, despite her having a PPO. When she wanted to call the police, he would threaten to beat her further. She also said that her husband incurred a lot of credit card bills. 58        In late February 2004, Ashok invited Chitra to go to the Indian Association (“IA”), where he was a member, to listen to music with him. Chitra did not give an immediate reply, but eventually agreed. On the night of 28 February 2004, Ashok took a taxi and picked Chitra up at Teck Whye. She wore a sleeveless blouse and long skirt and wore normal make-up. At the IA, they ordered drinks and listened to music. Ashok told Chitra that he liked her, but she smiled and did not give an answer. He also held her hands and placed his hand on her lap, which she allowed. Later, they went to a coffeeshop at Balestier Road and had supper. While at the coffeeshop, Ashok invited her to go to the IA with him again. She replied that she would check her schedule and let him know. Ashok then sent her home in a taxi and kissed her goodbye on her cheek. 59        Chitra later told Ashok that she agreed to go to the IA again with him. While on the company bus, Ashok tried to hold her hand, but she brushed his hand away as other colleagues were also on the bus. Ashok placed his arm on the chair behind Chitra on the bus. 60        On 5 March 2004, Chitra went out with Ashok to the IA for the second time. Chitra wore a dress and make-up. Again, Chitra and Ashok held hands and Ashok placed his hand on her lap. When Ashok sent Chitra home, he kissed her goodbye on the cheek again. Subsequently, Ashok invited Chitra to go with him to the IA again on 26 March 2004. 61        As the accused had stayed away from home for the entire month of February 2004 and until 6 March 2004, he was completely unaware of the facts in paras 57 to 60 above. 62        On 26 March 2004 (Friday) at 6.30am, the accused called Chitra on her mobile phone to tell her that he would be fetching her after work. At 7.00am, the accused went to Chitra’s workplace to fetch her after she finished her night shift. After breakfast, Chitra informed the accused that the company was holding a barbecue party at an East Coast Park chalet. She said that although the party started at 6.30pm, she would go for the party at 9.00pm. When the accused asked her why she was going to the party so late, she replied that if she went to the party early, she would meet some colleagues whom she did not like. She preferred to go to the party with her Chinese friends who would be going there late and they would be having beer. 63        On the evening of 26 March 2004, Chitra left home at 8.30pm after taking a shower. She wore a white sleeveless blouse and a long denim skirt. She also wore make-up, lipstick and perfume. The accused asked her why she was wearing so much make-up for a barbecue party and she replied that her friends would all be there. The accused thought that her dressing was inappropriate for a barbecue party. He recalled that she had worn a T-shirt and Bermuda shorts when she previously attended barbecue parties on 31 December 2003 and 19 January 2004. He told her that she was dressed more like she was going to a pub or on a date, but she did not reply. Chitra told him that she would only return at 9.00am the following morning and the accused became suspicious. The accused told her that he would fetch her at 2.00am or 3.00am, and she was not happy about it. The accused asked her for the chalet number and barbecue pit number and she replied that it was East Coast Park chalet C12 and carpark number five. Ten minutes after she had left home, she called home and asked the daughter whether the accused had left home. The daughter told the accused about what Chitra had enquired about. 64        At about 9.00pm, the accused went out to get food for the children. He drank some beer at a coffee shop and felt uneasy while drinking. He had a feeling that Chitra was not going to a barbecue party, and it was likely that she was meeting somebody and having an affair. 65        At about 10.00pm, the accused called Chitra on her mobile phone and asked for the location of the barbecue party. She again told him that the barbecue party was at East Coast Park chalet C12 and carpark number five. As the accused was driving the morning shift and did not have his taxi with him, he asked his friend, a taxi driver by the name of Ganesan, to check whether there was such a barbecue party. It was also more convenient for Ganesan to check as he was driving around that area then. Ganesan checked and told him that it was very quiet at the chalet and it appeared that nobody had booked the chalet concerned. The accused asked Ganesen to check with the security at the chalet as to whether Sony had booked the chalet, and Ganesan found out that Sony had not booked the chalet. The accused also asked Ganesan to check whether there was any barbecue party being held at the beach. Ganesan called back about one hour later and told him that it appeared that nobody was having a barbecue party there. The accused then became angry as he believed that Chitra had lied to him again. 66        The accused then called Chitra on her mobile phone and asked where she was. He shouted at her over the phone and told her to return home in one hour. She agreed but did not sound happy. The accused called again five minutes later, but could not get through. He believed that Chitra had switched off her mobile phone. He redialled the number every five to ten minutes as he believed that she was not at the chalet and was with somebody else. At about 2.45am, he called her again and, this time, she answered the phone and stated that she was at the foot of the block. 67        When Chitra returned home, the accused opened the door to the flat. She hesitated before entering. The accused assured her that he would not beat her, and that he just wanted to talk to her. After she had entered the flat, he noticed that she looked dishevelled as if she had had sexual intercourse with somebody. She was not wearing any make-up and lipstick and her hair was undone. 68        The accused told Chitra to enter the master bedroom. He told her that she had been lying to him because he had sent a friend to check the East Coast Park chalet and the company was not holding any barbecue party there. He also commented on her condition, namely, that her hair was undone, and she was not wearing any make-up and lipstick. He questioned her on where she had gone, and she then replied that she had gone to a pub. He asked her who she had gone to the pub with and she replied that she had gone to the pub alone. He replied that people do not go to a pub alone but would go with colleagues. He did not believe her as she did not appear like someone who had just returned from a pub. He thought that she might have gone to a pub at 8.30pm, but she would have gone to a hotel to have sexual intercourse with whoever she had gone to the pub with. That might be why she had switched off her mobile phone. He asked why she had switched off her phone and she replied that that was because he kept calling her. He questioned her whether she had gone out with another man, but she denied this and challenged him to bring her to a hospital to check her. He also knew that she would apply powder on her vaginal area after taking a shower. As she mentioned that she did not go to the toilet the entire night, he asked her to undress, and he checked her panties to see if there was any sperm mark. He also asked her why there was no powder mark on her vaginal area. He noticed that there was a sticky whitish liquid on her panties, which he believed to be sperm. He then questioned her as to who she had gone out with. 69        He then asked her to remove her bra. When she refused, he forcibly removed the bra and noticed that there were love bites on her breast. He had not had sexual intercourse with Chitra for five months. He asked her whether she had gone out and engaged in sexual intercourse, but she denied this. In the course of questioning her, the accused became very angry. Thinking that he might become violent again, he told her to go and sleep. He said he did not assault her, beyond slapping her once, as he only had grounds for suspicion but did not have any proof. He then had sexual intercourse with her, but she was unresponsive and reacted like a piece of wood. 70        Thereafter, he could not sleep. He bought six cans of beer and drank the beer in the living room. He thought about what had happened previously and about how he had forgiven her for what she had done previously. He knew that she now had a PPO and that he would go to prison if he harmed her. She had been telling other people that he had gone mad and that he had become very suspicious of her. However, he viewed those allegations as untrue, and he did not think that he was mad. 71        On the morning of 27 March 2004 at about 9.00am, while Chitra was sleeping, the accused checked her mobile phone. There was a text message from telephone number 90477502 which read, “Girl, don’t worry. If there is any trouble, I will come down.” He woke Chitra up and asked who the sender was. She claimed that some Bangladeshi had been disturbing her by sending her messages. He did not believe her, as Chitra’s mobile number was unlisted and a Bangladeshi would not be able to obtain the number. He used Chitra’s phone to send a text message, “I miss you”, to the telephone number 90477502. At about 1.30pm to 2.00pm, another message was received from the same telephone number 90477502 which read, “Girl, don’t feel lonely. Always think I am with you.” 72        The accused questioned Chitra about these messages. She claimed that some Bangladeshi had been disturbing her by sending messages. 73        On 28 March 2004, Chitra was working the morning shift. After she had left for work, the accused called her phone but it was engaged. He also called the telephone number 90477502 and that phone was also engaged. That day, he called Chitra’s phone about ten times, during morning tea break time, lunch time and afternoon tea break time, and the phone was engaged on all these occasions. He concluded that she was talking to somebody. 74        On 29 March 2004 at about 8.30pm, he questioned Chitra. He questioned her until about 11.00pm or 12.00 midnight. This was the first of three or four “family meetings” that he held. He told her that it was better to admit if she was having an affair with this person. If she liked the other man, then she should seek a divorce. But if she wanted to live with the accused, then she should tell him the truth. Chitra brushed aside what he said, and said that he was mad and suspicious. He was having an argument with Chitra when the daughter told him, “If you want to know whose number is it, I’ll tell you. It is Ashok and he is also known as ‘Bo Bo’.” The accused realised that the children had spoken to Ashok on previous occasions. He asked Chitra who Ashok was and Chitra said that he was a person who had worked in the company for only two days before he left the company. She claimed that she had given him her mobile number because she was supervising him. When asked why she had given him her mobile number when she only knew him for two days, she said he was just a friend. He questioned her as to whether she was having an affair with Ashok, but she denied this. Chitra said that he was mad to make such a suggestion. She said that there was nothing between Ashok and herself and they both did not call each other on the telephone. However, the accused did not believe her. 75        On 30 March 2004 (Tuesday) at about 8.30pm, he questioned Chitra again after her work as he was not satisfied with her answers. This was the second “family meeting”. His daughter was present. His son was out when he started questioning, but he later returned and was also present. The questioning lasted until about 12.00 midnight. The accused smashed Chitra’s mobile phone because the line was always engaged when he called. He believed that she was using the mobile phone to talk to Ashok because when her phone was engaged, Ashok’s phone would be engaged at the same time. When Chitra called home (and therefore could not be talking to Ashok), he would call Ashok’s phone number and he would be able to get through. Taking into account what he had observed when she returned in the early morning of 27 March 2004, he concluded that she and Ashok were having an affair. He was in a confused state of mind and could not drive his taxi beyond earning just enough to pay for its rental. He also thought of committing suicide because of her betrayal. He knew that she was pretending. 76        He called for a family conference involving Chitra’s sister and mother. When the other family members were there, Chitra cried and insisted that she was innocent and that the accused was the one causing all the trouble. 77        Altogether, the accused had three to four “family meetings” where he questioned Chitra, the first being the meeting held on 29 March 2004. In all the meetings, she denied that she was having an affair with Ashok. When asked at trial whether he believed Chitra when she denied having an affair with Ashok, he stated that sometimes he believed her and sometimes he did not. He did not assault Chitra as she had a PPO against him and he was also tired of beating her up. His evidence was that it was Chitra, and not he, who called the children and involved them in these meetings. He felt that the children were siding with Chitra. 78        Between 27 March 2004 and 7 April 2004, the accused went to Chitra’s workplace in the night, two or three times, to check whether she had actually gone to work. He explained that he wanted to check to see if she was working because she had previously lied to him about going to work, when in fact she had not gone to work. From the outside of the factory premises, it was possible to see Chitra’s work location. He observed that sometimes she was not at her workplace, and sometimes she was on the phone. When he saw her talking on the phone he would call Ashok’s phone and his line would be engaged. He was sure that she was speaking to Ashok on the phone. 79        Ashok testified that after 26 March 2004, he received abusive phone calls in Tamil from an unknown male caller, whom Chitra said was her husband. The caller wanted Ashok to stop seeing Chitra, but Ashok replied that as a salesman, he had to meet his customers. 80        The accused checked Chitra’s phone for text messages sent by other men. He found that one Nantha Kumar Gabriel, her insurance agent, had sent her a number of generic or chain messages. He called up Nantha Kumar Gabriel, and asked him to stop sending her messages. However, he did not believe that Nantha Kumar Gabriel was having an affair with Chitra, and did not accuse him of having an affair with Chitra as he had no basis and he had met Nantha Kumar Gabriel before. 81        According to the daughter, the accused also accused Chitra of having an affair with Ashok and Michael at the same time during their quarrels. 82        I digress here to mention a point stressed by Mr Fernando, defence counsel, in the course of the trial. He said that whether Chitra had had an affair with Ashok lay at the heart of the case for the Defence. It was the foundation for the defence of diminished responsibility and the rock bottom of the defence that the accused falsely believed that Chitra was having an affair and the basis of the defence was that there was no affair with Ashok. 83        Mr Fernando was taking the position that if there was no sexual intercourse, then there was no affair. Applying that basis, it is true that there was no direct evidence that Chitra had had an affair with Ashok. Accordingly, I have not referred to their relationship as an affair. Nevertheless, it is clear to me from the evidence that Chitra and Ashok were more than just friends. In my view they were involved in an inappropriate relationship even if it did not amount to an affair. 84        In any event, this stance of Mr Fernando was quite irrelevant. The literature and the evidence of the Defence’s own expert medical witnesses stressed that the point was not so much whether the subject of the accused’s attention,ie, Chitra in this case, was in fact having an affair or not, but whether the accused’s reason or reasons for believing so were delusional or not.",
        "The stabbing incident on 8 April 2004": "85        On 7 April 2004, the accused told Chitra that he would be fetching her from work in the morning of 8 April 2004 after her night shift. On 8 April 2004 at 4.00am, he called her to say that he would not be fetching her. At 5.30am, the accused went to Chitra’s workplace to check on her. He was refused entry into the company premises. He called the company phone and told Chitra that he would be coming to fetch her at 7.10am. After Chitra finished work at 7.00am, the accused fetched her and then bought breakfast for her and the children before sending her home. He then started his work as a taxi driver at about 7.30am. When he called home, he discovered that the home telephone was engaged. He then called Ashok’s phone and it was also engaged. He then stopped work, and drove the taxi home as he wanted to ask Chitra who she was talking to on the phone. 86        When he almost reached home, he called both his home phone and Ashok’s phone and both lines were then not busy. He became very angry believing that Chitra had been talking to Ashok on the phone and using the home phone to do so. He called for Chitra and his children. He told Chitra that she had been talking to Ashok earlier using the home phone. Chitra told him that he must be out of his mind. She said, “I don’t wish to talk to a madman like you.” He felt provoked when she called him a madman and took a knife from the kitchen. He managed to stab her twice. According to the daughter, the accused then said that Chitra would die and if she did not die, he would go to her workplace and kill her. The accused then left the home. The daughter called for the ambulance. While waiting for the ambulance, the phone in the home rang. It was the accused who asked whether Chitra had died. When police officers were in the home the phone rang again. Again it was the accused who called and asked whether Chitra had died. He explained that he stabbed her because she had lied to him about not using the phone and had provoked him by calling him a madman. Chitra did not give him peace of mind to work and he was in a confused state of mind because of her. The accused surrendered himself that same day and was arrested by the police. 87        On 10 April 2004, the accused was charged in court and was remanded for psychiatric assessment at the Institute of Mental Health(“IMH”).",
        "Remand at IMH": "88        During the period of remand in IMH, the accused saw Chitra come to IMH together with her sister, Aminah Begum Abdullah @ N Vejayakumari (“Vejaya”), for her interview with Dr George Fernandez (“Dr Fernandez”). He was happy to see her and called out to her. She rebuffed him and said “I will never talk to a murderer”. He became very angry and scolded her with an expletive. 89        On the following day, he saw Chitra at IMH again, this time with his daughter, Subhasini, and Vejaya. After Subhasini’s interview with Dr Fernandez, Subhasini smiled at him. The accused called out to her. He also asked a male nurse to convey the message that he would like to talk to her. After the male nurse had conveyed the message to Subhasini, he saw Chitra and Vejaya say something to Subhasini. Thereafter, Subhasini said something to the male nurse and then the male nurse conveyed the message that the daughter did not wish to speak to him. He felt Chitra and Vejaya had instigated his daughter not to speak to him. He was still angry with Chitra because of her remark from the previous day. 90        Almost every night in IMH, the accused had difficulty sleeping because he was thinking of Chitra and the children. He wondered whether Chitra was now going out with Ashok. Feeling troubled and disturbed that Chitra was carrying on an affair with Ashok, he felt that the best thing to do was to “kill this woman”. He did not tell anybody about his thoughts of killing. He felt that he could not divorce her as he could not bear to see her with another person. He felt that killing her was the only way to get her out of his mind.",
        "The release on bail and the period before the killing": "91        On 7 May 2004, the accused’s case was mentioned in court and he was released on bail. On the same day, the accused was brought to the Family Court where a domestic exclusion order (“DEO”) was made preventing him from returning to the matrimonial flat. The accused stayed with his mother from this point. After being released on bail, he thought of patching up with Chitra. When he was released on bail, he felt happy and he wanted to get his family members and Chitra’s family members together to find a solution. He no longer thought of killing Chitra. He still loved her very much. 92        On 8 May 2004 (Saturday) morning, the accused called Chitra’s workplace and was told that it was her day off and she was not doing overtime that night. He had called to speak to Chitra to see if they could come to some kind of settlement. At about 8.00pm, he called Chitra’s workplace again to check whether she was doing overtime. A staff told him that she was on her day off. He asked his friend, Supramaniam s/o Sockalingam Palayan (“Supramaniam”), to call his mother-in-law’s flat to check if Chitra was home, as Chitra and the children would be at the mother-in-law’s flat. However, a male person answered the call, used bad language and hung up. At about 10.00pm, the accused called Chitra’s brother, Rajoo, who told him that she was working the night shift. The accused began to suspect that she was meeting Ashok because of previous incidents where she had lied that she was going to work but instead had rendezvous with other men. He called Chitra’s mobile phone and noticed that there was music in the background. He remained silent as he was not sure whether she and Ashok were together at the same place, even though he suspected so. He suspected that she was at the IA as she had told him previously that she knew Ashok who was a member of the IA. To confirm this, the accused called Ashok’s mobile phone and noticed that the background music was the same. He thus concluded that Chitra and Ashok were together at this point of time. He thought that they were in a pub, but he did not know which pub. He became very angry and went down to the coffee shop at his mother’s place to drink some beer. 93        The accused asked his taxi driver friend, Supramaniam, to meet him at the coffee shop at his mother’s place. He drank about two to three bottles of beer while Supramaniam drank Milo. After drinking, the accused asked Supramaniam to drive him to the IA. He claimed that Chitra was there for a function and he wanted to gather information to submit to his private investigator. The accused could not drive his own taxi there as his services as a taxi driver had been terminated after the stabbing incident. On the way to the IA, the accused was using his mobile phone and trying to reach someone. They arrived between 12.30am to 1.00am. The accused tried to get into the IA but was stopped as he was not a member. Supramaniam managed to enter the IA on the pretext of using the toilet, and he returned to tell the accused that the IA was closed for the day. The accused waited outside the IA until 1.30am, but did not see Ashok or Chitra. 94        He then asked Supramaniam to drive him to Leisure Park. He wanted to check whether Chitra was at Leisure Park as he thought that perhaps she might have gone there with the family. He asked Supramaniam to drive around the Leisure Park car park as he was looking out for his brother-in-law’s, Rajoo’s, car. He wanted to find Rajoo to tell him that he had information that Chitra was not working despite her having told Rajoo that she was working and he hoped to bring Rajoo along to Chitra’s workplace. He did not manage to locate Rajoo’s car. 95        Thereafter, he asked Supramaniam to send him to Chitra’s workplace as he wanted to check whether she was working. At Chitra’s workplace, he went to the guardpost but the Indian security officer refused to let him enter the premises to check whether Chitra was there. 96        The accused then asked Supramaniam to send him back to Telok Blangah Crescent. At about 3.30am, they returned and sat at a coffee shop. He called Chitra’s mobile phone which rang for a while before being switched off. He also called Ashok’s mobile phone but it was also switched off. The accused thought that Chitra and Ashok were together having sex. He called both their numbers every ten minutes but both phones remained switched off. 97        The accused drank beer. He was very depressed and was in tears. He was depressed because he was thinking about her previous affairs and he thought that she was having an affair with Ashok that particular morning. He told Supramaniam about his 20 years of marriage and how he had forgiven Chitra despite her many affairs. He also talked about his pending case for stabbing Chitra and knew that he would have to serve a term of imprisonment. He mentioned that his family members had advised him to forget Chitra and his sister had even promised to introduce a good girl to him for another marriage. Supramaniam also advised the accused to let go of Chitra and start a new life. After talking for a while, the accused seemed to be feeling better. 98        He did not sleep the whole night as he was angry and his mind was disturbed. He was thinking that Chitra and Ashok were engaged in sexual intercourse, based on Chitra’s previous affairs. This made him very angry. He had forgiven her for her previous affairs, but now she was going out with other men again. He was disturbed that she had not changed for the better and was still giving all these problems to him. He continued to call both their phones every ten minutes but their phones remained switched off. 99        At about 6.30am, he was able to get through to both their mobile phones at the same time. In his mind, this confirmed his suspicion that they were having an affair. He suspected that Chitra and Ashok were in a hotel and she had lied to her family members that she was working the night shift. He kept checking on Chitra by calling her mobile phone. At 7.00am, he could again get through to her mobile phone. He knew that she would get home at 7.45am after her night shift. At 7.45am sharp, he called Chitra’s phone again and it was switched off. In his mind, he believed that she had returned home and was pretending to her family members that she had just returned from the night shift and had to switch off her mobile phone. 100      Between the night of 9 May 2004 and 12 May 2004 (both dates inclusive), the accused did not call Chitra or Ashok. He did not look for Chitra on those nights because he knew that she was working the night shift on those nights. 101      After the stabbing incident, the accused called Amutha Valli (“Amutha”), one of Chitra’s colleagues and asked whether Chitra had a colleague called Michael. According to the accused, he asked Amutha why Michael was sending so many phone messages to Chitra, and said sometimes Michael would call early in the morning. He asked Amutha to tell Michael not to send phone messages to Chitra and not to call his home. However, he did not call Michael’s phone number repeatedly, unlike Ashok’s. 102      The accused knew that Chitra would work four nights in a row before getting a day off. He therefore calculated that she would be working the night shift from 9 to 12 May 2004, and her days off would fall on 13 and 14 May 2004. On 13 May 2004 at 8.00pm, he called her workplace to check on her, and her supervisor told him that she was off. From 10.00pm onwards, he called both Chitra’s mobile phone and Ashok’s mobile phone numerous times. Both the mobile phones were switched on and the background was very quiet and it sounded to him like they were in a hotel room. The accused presumed that they were in a hotel. 103      On 14 May 2004 at 1.00am, both their mobile phones were switched off. The accused became convinced that Chitra was still having an affair with Ashok despite his stabbing her. This made him very angry. While he was drinking beer alone shortly after, the accused abandoned hope of patching up with Chitra and decided that if he could not have Chitra as his wife, nobody else would have her as well. He decided to buy a sharp knife from a shop and kill Chitra. The accused returned home one to two hours later and slept. When the accused awoke, he still had thoughts of killing Chitra. That afternoon, he went to his sister’s flat to spend time with her family knowing that he would not have the opportunity to do so again. While he was there he flipped through a law book of his nephew and checked the punishment under ss 306 and 302 of the Penal Code. The latter provided for the death penalty for murder. The accused remembered that penalty. 104      On 15 May 2004 at about 4.30am, the accused got a taxi driver friend to pick him up and drive him to Yew Tee MRT station so that he could catch a glimpse of Chitra when she was taking the company bus to work. He managed to catch a glimpse of Chitra and felt happy. He then returned home. He still wanted to kill the only love of his life because he felt that if he let her live, she would continue to be unfaithful to him and bring problems to the lives of others as she was having affairs with other people’s husbands. Later, the accused decided to go to the temple because he knew he was going to do something wrong. He followed his brother to the temple that morning. During his prayers, he was unsure whether he should proceed to kill Chitra or not. He asked his god to show him a sign if he was not supposed to kill her. In his mind, if things did not go smoothly, that would be a sign from god that he should not kill her. He then thought of using a chopper or parang instead of a knife as she did not die after he stabbed her the last time. He felt that if she lived, he would continue to suffer because he loved her so much. 105      The accused then went to a hardware shop at Block 9, Telok Blangah Crescent. He asked for a parang. When he was told that the shop did not sell parangs, he asked for a chopper, which he claimed he wanted to use to cut goats at a temple. He bargained on the price and bought a chopper for $25. He also asked and was given a receipt so that if the police were to stop him, he could produce the receipt as proof of his purchase.",
        "17 May 2004": "106      The accused had not received any sign from his god. At about 2.30am of 17 May 2004, the accused left his mother’s flat and took a taxi to Chitra’s work place. He brought along a red bag containing the chopper that he had bought for the purpose of killing his wife. He also placed his phone charger in the red bag. The accused had brought along his phone charger because the battery of his mobile phone was low and he knew the Chinese security guard on duty that morning, one Eng Fock Yong (“Eng”), would allow him to charge his phone at the guard house. 107      The accused knew that Chitra would be working on the morning shift that day. Another reason why he had chosen that day was because he knew that Eng, whom he could get along with, would be on duty that day. 108      After leaving his mother’s flat, the accused went to buy one packet of fried “bee hoon” and two packets of coffee for Eng.He then got into a taxi and told the taxi driver to take the highway because he was worried that he might meet a police road block. He placed his red bag containing the chopper under the passenger seat of the taxi. Along the way, he told the taxi driver to stop at a petrol kiosk where he bought three cans of Redbull and one packet of Fisherman’s Friend. The drinks and sweets were bought to keep him awake. 109      Upon reaching 5 Tuas Lane, the accused went to a vacant factory which was opposite. He took out the chopper from the red bag and placed the chopper in an opening of a high wall. He discarded the chopper box nearby. He then went to the guard post of 5 Tuas Lane and handed over the food and coffee to Eng. 110      Inside the guard post, the accused noticed a note on the board which stated his particulars and that he was not to enter the company’s premises. The accused then sat at the guard post and chatted with Eng.The accused told Eng that he was there because he wanted to get his wife to sign some divorce papers. Eng then told him that he had heard form the company’s bus driver that Chitra was having an affair with another security guard at a factory nearby, also owned by Sony. The accused then proceeded to check out this other factory at 52 Tuas Avenue 9. 111      Upon reaching 52 Tuas Avenue9, the accused saw an Indian security guard on duty and asked for “Ashok”. However, the Indian security guard said that there was no such person working there as that was what Ashok had told him to say should anyone look for him. The accused then returned to 5 Tuas Lane. 112      At about 6.00am, Eng told the accused to leave the premises and to wait outside for Chitra as the company buses would be arriving soon with workers. The accused then left the premises. He went to retrieve the chopper from where he had hidden it earlier and tucked the chopper at his back. 113      The accused then entered the premises of 5 Tuas Lanethis time by climbing over the fence. He hid himself behind a meter room. From his position at the meter room, he could see the workers alight from the company buses and could also see the workers walking into the factory. 114      At about 6.25am, the accused saw Chitra walking into the factory. He came out from his hiding place and approached her. He passed her a piece of paper, claiming it to be a divorce document and asked her to sign it. Chitra took the piece of paper and when she turned away from him, the accused took out his chopper and slashed her. 115      After attacking Chitra, the accused took a taxi and headed for his sister’s, Subbulakshmi’s, flat at Toa Payoh. Along the way, he made calls to various people,ie, to his mother-in-law, to his brother, Subburayan Naidu (“Subburayan”), and to his said sister, informing each of them that he had killed Chitra. 116      The accused also called the police and told them that he had killed his wife and was currently at Labrador Park. The accused explained that he had initially wanted to go to his mother’s flat (at Telok Blangah) to change his clothes. But since the address stated on his NRIC was his mother’s address, the police would go to his mother’s flat to arrest him. He did not want to be arrested at his mother’s flat. As such, he lied to the police that he was at Labrador Park. 117      The accused reached Subbulakshmi’s flat at about 7.00am. The accused took a shower and changed his clothing. Subbulakshmi hugged him and cried. The accused consoled her, telling her not to worry and to take care of the children. Subbulaksmi’s evidence was that the accused told her: I don’t know what is going to be my punishment, but even if I get sentenced to death, don’t worry about me. The accused then threw his bloodstained clothes into the rubbish chute and left the flat. 118      The accused went to Kampong Kapor Roadfor breakfast. There, he bumped into his friend, Ganesan. The accused joined Ganesan and some others for beer at a coffeeshop. The accused then privately told Ganesan that he had killed his wife and that he would surrender himself to the police. The accused then requested to go over to Ganesan’s place for a while to rest. Ganesan agreed. They both took a taxi to Ganesan’s place at Block 22, Jalan Tenteram, #03-561. 119      Sometime around 2.30pm, the accused called Subburayan, and asked Subburayan to pick him up near Jalan Bahagia. Subburayan picked up the accused and brought him to a coffee shop at Balestier Roadfor chicken rice. Subburayan’s evidence was that the accused told him that he had “chopped” Chitra several times, and that one blow landed at the rear of her neck. Later that same day, Subburayan brought the accused to surrender himself at Central Police Division Headquarters. 120      According to the evidence of Chitra’s sister, Vejaya, the accused called her that day at about 3.00pm plus and said, “The next is you.” She said the accused had a grudge against her because she had brought Chitra to the police station to make reports against him and to the Family Court to apply for a PPO against him.",
        "Dr George Fernandez": "121      The Defence called two medical expert witnesses. The first was Dr Fernandez, a consultant psychiatrist at Woodbridge Hospital. Dr Fernandez is also head of Psychotherapy Services. He was previously a consultant psychiatrist in the Department of Forensic Psychiatry and, Head, Division of Emergency Psychiatry, Woodbridge Hospital. Dr Fernandez is also a lecturer in the Diploma in Psychodynamic Psychotherapy Course at the National University of Singapore (“NUS”), School of Post Graduate Medicine. 122      After the accused was remanded for the stabbing incident on 8 April 2004, he was remanded at IMH from 10 April 2004 to 7 May 2004 for an assessment as to whether he was of unsound mind and whether he was fit to plead in court. Dr Fernandez interviewed the accused eight times between 12 April to 5 May 2004. He also interviewed Chitra once on 20 April 2004, the daughter, once on 21 April 2004 and Subbulakshmi, the accused’s sister, on 27 April 2004. In his report dated 3 May 2004, Dr Fernandez said that he also noted the nurses’ observations of the accused’s behaviour in the ward during remand and perused a statement of facts. The report states,inter alia: In the ward, the patient was calm and co-operative with the nurses and myself. On repeated mental state examination, he was well behaved and co-operative. He spoke clearly and logically. He gave a clear account of his behaviour, and admitted he was wrong in what he did. There was no evidence of hallucinatory behaviour or of thought disorder. There was also virtually no expression of sorrow over the injuries he had caused to his wife. During the period of his remand, he became agitated once when the wife and daughter came to the ward to be interviewed. Their fear of him was obvious. In my opinion, this man suffers from morbid jealousy, which is a form of mental illness. He remains convinced in his mind about his wife’s infidelities, and the strength and persistence of this belief was manifested by his repetitive questioning of his wife for admissions of guilt. Moreover, his repetitive questioning did not bring about a cessation of this line of inquiry. Instead it carried on. His behaviour over the years has shown a disturbing pattern of escalation from interrogations to physical assaults to his most recent act, which was stabbing his wife, a behaviour that was accompanied by threats. In my opinion, he remains a danger to his wife. He was started on medication to treat his morbid jealousy and he will need to be on long-term treatment. How much the medication will help him, remains to be seen. He is fit to plead and stand trial. With respect to the alleged offence, he was not of unsound mind. 123      As I have mentioned, the accused was then facing a charge in relation to the stabbing incident on 8 April 2004 and not a charge of murder in relation to the killing on 17 May 2004. Presumably, that is why Dr Fernandez’s report does not address the point whether the accused qualifies for the defence of diminished responsibility, a defence which is relevant only to a charge of murder. Indeed, Dr Fernandez declined to give any evidence on that defence as he had not addressed his mind to it. Nevertheless, both the Defence and Prosecution considered his evidence important because if the accused was suffering from morbid jealousy prior to 17 May 2004, it was likely that he would still be suffering from this disorder on 17 May 2004. Conversely, if he was not suffering from this disorder prior to 17 May 2004, it was unlikely that he was suffering from it on 17 May 2004. I would add that Dr Fernandez conducted two more interviews with the accused on 21 May 2004 and on 31 May 2005.",
        "Dr Stephen Phang": "124      The second medical expert witness for the Defence was Dr Stephen Phang Boon Chye “(Dr Phang”). Dr Phang is a consultant forensic psychiatrist and Deputy Chief of the Department of Forensic Psychiatry at IMH. He is also a visiting psychiatrist to the Prisons Department. 125      After Chitra was killed on 17 May 2004 and the accused was charged for the offence of murder, the accused was remanded at Changi Prison Hospitalfrom 15 June to 6 July 2004 for a psychiatric evaluation. For this purpose Dr Phang examined the accused on three occasions between 21 and 29 June 2004. He also interviewed the accused’s two children, and brother-in-law, Rajoo, on 25 June 2004 and referred to the nursing observations of the prison hospital staff during the accused’s remand and the past clinical records of the accused at IMH where the accused had been previously remanded after the stabbing incident, as well as a summary of facts from the police (Exh D14). 126      Dr Phang issued a report dated 5 July 2004. The report states,inter alia: Mental State Examination 9.         The accused was lucid and able to furnish an account of himself, and of the circumstances leading up to his arrest and detention. The prominent and predominant finding on mental state examination was that of jealousy premised on what came across as an unshakeable belief that his wife had been unfaithful to him, and which had clearly reached pathological proportions, in terms of both the nature and intensity of the belief. However, there was no evidence of hallucinatory experiences or disorder of his thought processes. He was not depressed or suicidal. Cognitively, he manifested no overt deficits. Indeed, apart from the immutability of his belief with regards to his late wife’s alleged marital infidelity, he did not manifest any other abnormality on psychiatric examination. Opinion 10.        I am of the opinion that the accused suffers from adelusional disorder, jealous type, which is a major form of mental illness characterized by the presence of non-bizarre delusions (ie, involving real situations that occur in real life, such as being deceived by a spouse) in which the essential feature is an abnormal belief that his partner (in this case his wife) had been unfaithful. This condition is also commonly known asmorbid jealousy, orpathological jealousy. The central pathology lies in the fact that the belief of infidelity is held oninadequate groundsand generallyunaffected by rational argument, as well as typically accompanied bystrong emotionsandcharacteristicbehaviour, all of which were evidently manifest in the accused. 11.        The accused’s belief in his late wife’s marital infidelity was absolute, brooked no contradiction and was unreasonable in bothexpressionandintensityin that the belief was premised onslight andinconclusive evidence. According to him, the mere periodic inability on his part to get through to his wife’s and her alleged lover’s handphones were taken as “confirm” that they were having an extramarital affair. In addition, his behaviour in calling his wife and her alleged lover multiple times daily (including at her workplace to check on her), having his wife followed, issuing threats with knives, holding frequent late night family “meetings” behind locked doors, and even checking her panties for ‘evidence’ that she had had illicit sex, all reflect a state of mind that was clearly abnormal in terms of theintensityof his belief and preoccupation with his wife’s alleged sexual unfaithfulness. 12.        This notwithstanding, the lucidity and consistency of his account, as well as the obvious planning he undertook prior to the killing is indicative of a state of mind that retained sufficient capacity to appreciate the nature, wrongfulness in law and potential consequences of his actions at and around material time of the alleged offence. In this sense, he wasnot of unsound mindthen. He is currentlyfit to pleadand take his trial. However, I am of the further opinion that at and around the material time of the commission of the alleged offence, the accused was suffering from an abnormality of mind, namely, pathological jealousy, which substantially impaired his mental responsibility for his act in causing his wife’s death. He would, as such, qualify for the defence ofdiminished responsibilityunder Exception 7 to Section 300 of the Penal Code. [emphasis in original in bold and underline] 127      The accused was subsequently remanded at Changi Prison Complex Medical Centre from 16 September to 7 October 2004 for a further psychiatric assessment. Dr Phang examined the accused on four more occasions between 20 September to 1 October 2004. He also considered the observations of the accused by the prison hospital nursing staff during his recent remand and perused an additional statement of facts [Exh D26] given to him by the investigating officer. Dr Phang issued a second report which was dated 5 October 2004. The report states,inter alia: 4.         He again admitted that he had deliberately killed his wife, Chitrabathy, as a consequence of his belief that she had been unfaithful to him. He based his conclusions about his late wife’s marital infidelity on the same reasons he previously described, for instance, her switched-off handphone meant that she engaged in an illicit tryst in a hotel with her lover, and an engaged tone signified to him that “they(ie the deceased and her lover)are talking to each other, maybe love story, or maybe want to go hotel, sex”. 5.         …. Mental State Examination 6.         He remained, on psychiatric examination, pathologically jealous in terms of the nature and intensity of his belief regarding his wife’s marital infidelity. There were otherwise no other abnormalities of note. He was lucid and relevant, amply able to give an account of himself. He was not depressed or suicidal. He remained cognitively intact and cognizant of the nature and potential implications of the current charges against him, particularly the charge of murder. Opinion 7.I remain of the opinion that the accused suffers fromdelusional disorder, jealous type, otherwise known asmorbid jealousy, orpathological jealousy.The substance of the pathology lies in the constant preoccupation with, as well as the abnormal intensity of expression of his beliefs regarding his wife’s infidelity, and the consequent behavioural manifestations which followed, such as calling the victim multiple times daily and checking her underwear, among others. Unfortunately, he does not accept that he suffers from a major mental illness which requires long term psychiatric follow-up and treatment. The potential implications of this are ominously significant, and, I would hasten to add, potential dangerous by virtue of his insightlessness, which is a not uncommon observation in such patients. [emphasis in original in italics, bold and underline] Dr Ang Ah Ling 128      The Prosecution’s medical expert witness was Dr Ang Ah Ling (“Dr Ang”). He is an Emeritus Consultant attached to IMH. Dr Ang’s past appointments were: (a)        Consultant Psychiatrist and Deputy Head Unit II Woodbridge Hospitalfrom 1981 to 1993; (b)        Head of Department of Forensic Psychiatry, Woodbridge Hospitaland IMH from 1993 to 1996; (c)        Medical Director and Senior Consultant, Woodbridge Hospitaland IMH from 1996 to 2000; (d)        Senior Clinical Lecturer, NUS, since 1998; (e)        Examiner for Master of Medicine in Psychiatry since 1993; (f)         Chief Examiner for Master of Medicine in Psychiatry from 2000 to 2003; (g)        Chairman, Specialists Training Committee for Psychiatry from December 1999 to August 2002 and member of that committee since August 2000; and (h)        Visiting Consultant in Psychiatry to the SingaporeArmed Forces till June 2004. 129       Dr Ang examined the accused between 26 November to 1 December 2004 and considered the nurses’ observations of the accused’s behaviour in the ward when the accused was remanded at Changi Prison Complex Medical Centre from 19 November to 13 December 2004 for further psychiatric evaluation. Dr Ang also interviewed the accused’s younger brother, Subburayan. He also perused the clinical notes and reports of Dr Fernandez and Dr Phang. Dr Ang issued a report dated 10 December 2004. The report states,inter alia: 33      He was very clear about why he had killed his wife. As he had said, “I know killing is wrong and bad but what she did to me, what she told people about me, calling me mad and sending me to IMH, she made me very angry. Kill her because I am angry with her for having affair outside. Why at age 40 years still don’t want to change. Daughter already big – 18 years old. If she had stopped seeing Ashok, I would have forgiven her. Like how I forgave her over Jayaseelan. She stopped talking to him. I allowed her to go to functions. Even last year, I allowed her to go to Genting Highlands with her Chinese colleagues for the 3 days National Day holidays. No conditions set. Some more, even gave her money. I love my wife. If I can’t have her, nobody else can.” 34     Physical examination revealed no abnormality. A blood VDRL done on 16/6/04 was non-reactive (meaning he had no venereal infection) and a CT brain scan carried on him on 25/6/04 also showed no abnormality. 35     He was well behaved and co-operative during his period of remand. Opinion 36         The accused was angry with the deceased for being defiant and provocative and refusing to acknowledge and end her affair with Ashok even after he had forgiven her for her past three affairs. In deciding to kill her, he was fully aware of what the consequences would be and in the execution of his plan, he had shown full control of his thoughts and action. 37         From my examination findings and other information available to me, it is my opinion as follows: a)         He does not suffer from any mental disorder. His wife’s extra marital affairs were factual events; b)         At the time of the alleged offence, he was not of unsound mind; c)         Neither was he suffering from such abnormality of mind (whether arising from a condition of arrested or retarded development of mind or any inherent causes or induced by disease or injury) as would have substantially impaired his mental responsibility for his act; and d)         He is fit to plead.",
        "The court’s reasons and conclusions": "130      It was for the Defence to establish diminished responsibility although its burden was to establish this on a balance of probabilities and not beyond any reasonable doubt. 131      InZailani bin Ahmad v PP[2005] 1 SLR 356(“Zailani”) the Court of Appeal reaffirmed the three limbs that an accused person has to satisfy to establish diminished responsibility. They are: (a)        He was suffering from an abnormality of mind. (b)        Such abnormality of mind must have: (i)         arisen from a condition of arrested or retarded development of the mind; or (ii)        arisen from any inherent causes; or (iii)       been induced by disease or injury. (c)        Such abnormality of mind as in (b)(i) to (b)(iii) must have substantially impaired his mental responsibility for his acts and omissions in causing the death or being a party to causing the death. 132      In the seminal case ofRegina v Byrne[1960] 2 QB 396, the phrase “abnormality of mind” was described as a state of mind so different from that of ordinary human beings that the reasonable man would term it abnormal. This description was adopted by the Court of Appeal inZailani. 133      With regard to the first limb, the Court of Appeal inZailaniheld at [49] and [50]: 49         … However, in coming to a decision on whether an accused is suffering from such an abnormality of mind, the court is entitled to seek guidance from available medical evidence. Where the court is faced with evidence conflicting with such medical evidence, it is within the discretion of the court to form its own conclusion on the matter, taking into account other facts such as the acts or statements of the accused and his demeanour, and any other conflicting medical opinion … 50.        … even when such medical opinion is unchallenged, the trial judges would be perfectly entitled to reject or differ from the opinions of the medical men, if there were other facts on which they could do so … 134      With regard to the second limb, the Court of Appeal inZailaniwas of the view that the limb was reliant on the conclusion of medical experts. 135      With regard to the third limb, the Court of Appeal inZailanisaid at [52]: The final and most crucial limb,ie, the third limb, focuses on an accused’s mental responsibility for his acts. The expression “mental responsibility for his acts” points to a consideration of the extent to which the accused’s mind is answerable for his physical acts, which must include a consideration of the extent of his ability to exercise will power to control his physical acts.R v Byrne. There is also the further requirement that the accused’s mental responsibility besubstantially impaired.Cheng Swee Hin v PP[1980-1981] SLR 116.While medical evidence would be constructive in determining the presence and/or extent of impairment, the main question of whether an accused’s mental responsibility was substantially impaired is ultimately one for the court to answer … [emphasis original] 136InPP v Juminem[2005] 4 SLR 536, Choo Han Teck J said at [30]: Reverting to the question whether there was a substantial impairment of the first accused person’s mental responsibility, I would begin with the reminder that the term “substantially impairs his mental responsibility” is couched in “popular language, (not that of the M’Naughten Rules)” as the Court of Criminal Appeal in Regina v Byrne ([24] supra) at 404 observed. Following suit, Ashworth J, the trial judge in Regina v Lloyd[1967] 1 QB 175at 178 summed up his directions to the jury as follows: I am not going to try to find a parallel for the word ‘substantial.’ You are the judges, but your own common sense will tell you what it means. This far I will go. Substantial does not mean total, that is to say, the mental responsibility need not be totally impaired, so to speak, destroyed altogether. At the other end of the scale substantial does not mean trivial or minimal. It is something in between and Parliament has left it to you and other juries to say on the evidence, was the mental responsibility impaired, and, if so, was it substantially impaired? That summation was fully endorsed by the Court of Criminal Appeal in the same case, at 181, and I think that it serves as a useful working guide. 137      I note that the summation inRegina v Lloydwas also cited by the Court of Appeal inChua Hwa Soon Jimmy v PP[1998] 2 SLR 22(“Jimmy Chua”) as being useful. 138      The Court of Appeal inJimmy Chuaalso said at [32]: We also thought that a distinction must be made here between whether the appellant ‘did not resist his impulse’ or ‘could not resist his impulse’, a distinction incapable of scientific proof which left the court free to make its own finding. As the court stated in Byrne’s case (supra) at 404: Inability to exercise will power to control physical acts, provided that it is due to abnormality of mind from one of the causes specified in the parenthesis of the subsection, is … sufficient to entitle the accused to the benefit of the section; difficulty in controlling his physical acts depending on the degree of difficulty, may be. It is for the jury to decide on the whole of the evidence whether such inability or difficulty has, not as a matter of scientific certainty but on the balance of probabilities, been established, and in the case of difficulty whether the difficulty is so great as to amount in their view to a substantial impairment of the accused’s mental responsibility for his acts. 139      In the case before me, the delusion of infidelity was not as obvious as the examples given in the literature such as the example of the correspondence in the flashing of lights in Christmas trees. That makes the question before me as to whether the accused was suffering from a delusion of infidelity all the more difficult. Dr Phang said that it was not an easy case to assess initially but eventually he concluded that the accused was suffering from a delusion of infidelity. I note Dr Phang’s conviction, which was evident from his reports and his oral evidence, that the accused was suffering from morbid jealousy. However, it appears to me that his conviction was based more on what he perceived as the intensity of the accused’s conduct. For example, in his second report Dr Phang had emphasised the accused’s preoccupation with Chitra’s infidelity as well as the abnormal intensity of the accused’s expression of his beliefs and consequent behavioural manifestations. 140      Before I deal with the question of whether the accused was suffering from a delusion, I reiterate that according to the literature, the falsity of the infidelity does not necessarily lead to a conclusion of morbid jealousy. I come now to the Prosecution’s submission that the defence expert witnesses had concluded that there was morbid jealousy in their respective reports because they had initially disbelieved the accused’s account of Chitra’s affairs, but it has since been established that she did have affairs with three men between 1987 and 2001 and at least an inappropriate relationship with Ashok in 2004. This submission was ironic because I am of the view that Dr Ang himself had placed undue reliance on Chitra’s affairs or relationships with other men. 141      Dr Ang’s report states specifically that Chitra’s “extra marital affairs were factual events”. In the course of cross-examination, Dr Ang made it clear that in his view there could be no morbid jealousy if an affair was factual. On the other hand, his view was that, if in fact there was no affair, then this only meant that perhaps the accused was suffering from morbid jealousy. I should add that in the course of the trial Dr Ang accepted that it was not correct to refer to Chitra’s relationship with Ashok as an affair since there was no specific evidence of their having engaged in sexual intercourse. However, this was immaterial to his view as he was of the opinion that their relationship was not platonic. 142      Coming back to the defence expert witnesses, I note that Dr Fernandez’s report does not identify the specific delusion which the accused was suffering from although Dr Fernandez had concluded that the accused was suffering from morbid jealousy. It seems to me that at the time when Dr Fernandez had examined the accused before he issued his report, he either did not believe the accused’s version of the past affairs or he had placed undue emphasis on the accused’s conduct in 2004 or both. 143      As for Dr Phang, his first report does specify a delusion,ie, that the accused was concluding from the switched-off handphones of Chitra and of Ashok that they were having an affair. This was the only specific delusion identified in Dr Phang’s first report although I should add that Dr Phang was then not in possession of Exh P192, being the Summary. 144      Dr Phang’s second report mentions not only the accused’s perception from the switched-off handphones but also the engaged handphones. By then, Dr Phang was in possession of additional facts (Exh D26) but still not the Summary (Exh P192). 145      I also note that Dr Phang’s first report states that the accused’s belief in Chitra’s infidelity was not affected by rational argument. However, Dr Phang had challenged the accused only on the rationality of his perception arising from his calls to the handphones of Chitra and of Ashok. Even then, the challenge was, with respect, rather limited. I will come back to this point later. 146      I come now to the oral evidence at trial of the expert witnesses. I should mention that Dr Fernandez did not agree with certain parts of Mullen’s chapter on “Morbid jealousy and the delusion of infidelity”. He did not agree that the normally and morbidly jealous operate in a similar mode, seeking confirmation and ignoring refutation. He did not agree that both would divine infidelity from subtle changes in manner and in sexual techniques, from odd irregularities in established patterns of life or from alterations in the nuances of personal interaction visible only to the eye of love. He also did not agree with Mullen’s overview in [24] above. 147      Both Dr Fernandez and Dr Phang were of the view that the accused’s abnormal mental state had begun around 26 March 2004. They accepted that he was not suffering from morbid jealousy in relation to Chitra’s affairs with the first three men. The first time the accused came to suspect that Chitra might be having an affair in 2004 was on the 26 March 2004. Chitra had told the accused that day that she would be going to an office barbecue party at the East Coast chalet. She told him that she would go at 9.00pm although the party was to start at 6.30pm because she did not want to meet some colleagues whom she did not like and she preferred going with some friends who were going later. In the same evening at about 8.30pm, Chitra was leaving home. She wore a white sleeveless blouse and a long denim skirt. She also put on make-up, lipstick and perfume. The accused recalled that she had worn a T-shirt and Bermuda shorts when she attended barbecue parties in the past in December 2003 and January 2004. He told her that she was dressed more like she was going to a pub or on a date. She did not reply. 148      Dr Fernandez and Dr Phang thought that Chitra’s dressing then was innocuous and the accused had been overly suspicious. They questioned as to why her dressing should have aroused his suspicion. I am of the view that the correct approach is not whether there is another explanation, but whether the accused’s perception suggested an abnormal mental process at play. I stress this because I note that on this topic, and on others as well, both Dr Fernandez and Dr Phang often raised other possible explanations to question the rationality of the accused’s perceptions. 149      Granted that a woman in a white sleeveless blouse and a long denim skirt with make-up, lipstick and perfume should notper searouse a suspicion of infidelity, it seems to me that the accused knew his wife best, as Dr Fernandez conceded. He should know how she used to dress for different occasions. I am not persuaded that his suspicion arising from her dressing for what was purportedly a barbecue party was abnormal. 150      Chitra told the accused she would return at 9.00am the following morning. The Summary states, “the accused became suspicious”. This may have caused the Prosecution to submit that the accused only became suspicious then. I do not accept such a fine demarcation. From the accused’s overall evidence on this point, I am of the view that the accused’s suspicions had already been aroused by Chitra’s dressing. 151      The accused told Chitra he would fetch her at 2.00am or 3.00am but she was not happy about it. The accused asked her for the chalet number and barbecue pit and she replied that it was East Coast Park chalet C12 and carpark number five. Ten minutes after Chitra left, she called home and asked the daughter whether the accused had left home. According to the daughter, the accused asked her whether it was her mother who was on the telephone. The daughter told him about Chitra’s inquiry. 152      Dr Phang was of the view that the fact that the accused had asked whether it was Chitra on the telephone suggested a preoccupation with her. Dr Phang reasoned as to why it could not have been an aunt or someone else. As I mentioned, the correct approach is not whether there could have been another conclusion but whether the accused’s perception suggested abnormality. I do not think this instance suggested abnormality. He was thinking about her and it was not abnormal to do so given his suspicion about her. 153      I come now to a piece of evidence which Dr Fernandez and Dr Phang also placed some reliance on. Dr Fernandez’s notes of his interview with the daughter revealed that the daughter had told Dr Fernandez that the deceased had said, “Mother is having affair again.” Dr Fernandez and Dr Phang opined that this suggested an abnormal preoccupation with the theme of infidelity because of the immediacy with which the accused had arrived at this conclusion. However it was not clear from Dr Fernandez’s notes as to when the accused had said this. Did he say this after Chitra had called back or after his friend Ganesan had found out that there was no barbecue party at East Coast Park that night? If the latter, then he would have realised that Chitra had lied to him and would have had a rational basis for concluding that she was having an affair. Although the daughter gave evidence, she was not asked to clarify when the accused made that statement. Therefore, it is unsafe to give any weight to it. 154      At about 9.00pm, the accused left home. He was still wondering whether Chitra was meeting someone else and having an affair. I need not repeat the Summary as to how he got Ganesan to check the relevant chalet and carpark and the beach at East Coast Park and discovered that Chitra had lied about going to a barbecue party there. I also need not elaborate on his calling and shouting at her to return home in one hour and her switching off her handphone and eventually returning home more than an hour later. 155      I come to the next point about Chitra looking dishevelled as if she had sexual intercourse with someone. According to the accused, her hair was undone and she was not wearing any make-up or lipstick. I accept Dr Phang’s scepticism about the accuracy of this piece of evidence. I agree that if indeed Chitra had engaged in a tryst that night, she would not have come back in a state which would have caused more suspicion. I am of the view that either the accused made this piece of evidence up to justify his subsequent behaviour or he had grossly exaggerated it. To me, he had deluded himself into thinking that she looked dishevelled as if she had sexual intercourse with someone. While this does not by itself establish abnormality of the mind, it is a factor suggesting abnormality. 156      At this stage, I refer to the accused’s evidence on what he was allegedly told when he was warded at IMH. On 29 June 2004, the accused told Dr Phang that a male nurse, Mogana Sundram s/o Singaram (“Mogana”), had told the accused that he had seen Chitra at the IA. The accused said Mogana asked him to identify his wife when she came to the ward to see Dr Fernandez and when Chitra was pointed out, Mogana allegedly said, “Ya lah, I ever see your wife with Ashok few times, in the IA.” A similar, but not identical, statement was given by the accused to the police a month earlier on 25 May 2004. 157      Mogana is a senior nurse at IMH. When questioned by Dr Phang, Mogana denied having told the accused that he had seen Chitra at the IA. Dr Phang believed Mogana. 158      In his conditioned statement, Mogana said that he had told the accused that he used to play football at the IA. The accused had asked him if he had seen his wife at the IA and he replied he did not know who his wife was. Mogana saw Chitra for the first time when Chitra had come to IMH to see Dr Fernandez. He told the accused he had not seen her before at the IA. In fact, he did not go to the IA often unless there was a soccer game. 159      It seems to me that Mogana would also not have known who Ashok was. There was no evidence that Mogana patronised the lounge at IA or why he should have noticed Chitra with Ashok bearing in mind that they had not been to the IA often and there must have been other couples there. The accused himself had not seen Ashok before until the trial. In my view, Mogana did not say that he had seen the accused’s wife with Ashok a few times at the IA. The accused had conflated what Mogana had told him with his own fears to justify his suspicion of Chitra’s affair with Ashok. To me, this was more than a misunderstanding by the accused and further suggested an abnormality of the mind. 160      I come back to the night of 26 March 2004. Some emphasis was placed by Dr Fernandez and Dr Phang on the accused’s conduct in checking Chitra’s panties and removing her bra. To them this was characteristic behaviour of a morbidly jealous person. However, behaviour is different from a delusion and I will come back to the topic about the accused’s conduct later. 161      As for the accused’s observation of a sticky whitish liquid on the panties which he thought to be sperm (or more accurately semen) Dr Fernandez and Dr Phang questioned the accuracy of the conclusion. To them, the sticky whitish liquid could have been something else, for example, a discharge from the vagina. However, if indeed the accused had observed this sticky whitish liquid, I cannot say that the accused’s perception reflected abnormality. Having learnt that Chitra had lied about going to a barbecue party at East Coast Park and Chitra’s failure to come back within an hour, as demanded, it was not abnormal for him to think that what he saw was semen, even though he might have been wrong. It is all very well for doctors to suggest that that could have been a vaginal discharge but the accused is not a doctor. 162      As for the accused’s asking why there was no powder mark on the panties, this was of peripheral relevance and I need say no more about it. 163      As for the love bite which the accused professed he had seen, I cannot say that he was deluded in his perception. 164      I come now to the episode when the accused then had sexual intercourse with Chitra that same morning. The accused said she was unresponsive like a piece of wood. To Dr Fernandez and Dr Phang, the accused had used this as a litmus test of her fidelity,ie, her lack of response suggested she had had sexual intercourse with someone else just before. It is not in dispute that the words “litmus test” were not coined by the accused. That was the expression used by the Defence’s expert witnesses and the question is whether they were accurate in their description of his perception about her lack of response. I am of the view they were. The next question is whether the accused’s perception suggested some abnormal mental process at work. Dr Ang thought it was understandable given what the accused had learnt but I disagree. It is one thing for the accused to think that Chitra was having an affair. It is another for him to associate her lack of response with an affair. After all, he had, as Dr Phang put it, subjected her to the indignity of a strip search and removed her bra by force. It would have been surprising if she had been more responsive. In my view, the accused’s perception suggested an abnormality of the mind. 165      I come now to the calls which the accused said he made to the handphones of Chitra and of Ashok after 26 March 2004. On average, he had called ten to fifteen times a day. According to a complaint which Chitra made to the police on 8 May 2004 at 8.43am, he had attempted to call her about 32 times the night before. As I have said, I will deal with the accused’s conduct later. However his perception is significant. In his mind, Chitra was talking to Ashok whenever he called and each of their handphones was engaged. Again Dr Fernandez and Dr Phang questioned why it could not mean that each of them was talking to someone else but, as I have said, that is not the point. In my view it was not irrational for the accused to conclude generally that Chitra and Ashok were talking to each other in view of the many occasions when both their handphones were engaged at the same time, bearing in mind that he had learnt of her lie on 24 March 2004, that BoBo had been sending personal SMS messages to Chitra and that Ashok was BoBo. It was not as though Ashok was a stranger to Chitra. However, I am of the view that it was abnormal for the accused to conclude that each and every occasion when both their handphones were engaged meant that they were necessarily talking to each other. 166      The accused also informed Dr Phang that when he had called Chitra’s workplace and was told that she had gone to the toilet or was on the phone, he believed that she was talking to Ashok. In my view, the perception that she was talking to Ashok when the accused was told that she had gone to the toilet also suggested an abnormality of the mind. 167      The accused’s perception when both their handphones were switched off was more significant. In his mind, each of these occasions meant that they were having sex together at a hotel. Unfortunately, Dr Phang’s challenge to the accused about this perception was rather limited, as I have said. Dr Phang had suggested to the accused that perhaps Chitra had switched off her handphone to save the battery to which the accused disagreed. It was only in cross-examination that Dr Phang provided more alternative explanations, for example, Chitra might have switched off her handphone because she was fed up with the accused’s incessant calls. 168      Nevertheless, Dr Ang agreed that it was unreasonable for the accused to conclude that the switched-off handphones meant that Chitra and Ashok were having sex. However, Dr Ang was of the view that this was understandable in the light of what had happened since 26 March 2004. Dr Ang said that what the accused was concerned with “was that they could be having sex” (NE 1745) but I note that that was not the evidence of the accused. The accused was not merely considering the possibility of the couple having sex. He was certain of it. 169      At this stage, I come to a point made by the Prosecution. The Prosecution submitted that in the course of the trial, the accused had said that sometimes he was certain about Chitra’s infidelity in 2004 and sometimes he was not, although most of the time during the trial he said he was “100% certain”. The Prosecution submitted that a wavering of certainty militated against the existence of morbid jealousy because in such a disorder, there is no doubt. 170      In my view, the intensity of the accused’s conduct demonstrated that he was certain about Chitra’s infidelity in 2004, just as he was certain as to what the engaged handphones and switched-off handphones meant. I add that a behaviour of checking is not incongruous with certainty as the literature has explained. The need to check is consistent with the need to resolve a tormenting doubt. It seems to me that it is this tormenting doubt that the accused was referring to when he said that at times he was uncertain. 171      I am of the view that the accused’s perception about the significance of the switched-off handphones reflected an abnormality of the mind. 172      There is one other aspect of the accused’s evidence which I consider to be significant. On 7 May 2004, the accused was released on bail on the charge relating to the stabbing incident. A DEO was also made against him that day. On the night of 8 May 2004, he was being driven around as he wanted to find out where Chitra was. I will come back to this later. Between 9 to 12 May 2004, the accused did not call Chitra or Ashok on their handphones at night as he knew that she was on the night shift. He had calculated her off days and believed she was not working on 13 May 2004. He called her workplace at about 8.00pm and was told she was off. According to his evidence, he called the handphones of Chitra and Ashok from 10.00pm onwards many times. Both their handphones were switched on and the background was very quiet. It sounded to him like they were in a hotel room. At 1.00am of 14 May 2004, both their handphones were switched off. 173      Even Dr Ang had to say that the perception of a tryst in a hotel room from a quiet background reflected excessive jealousy on the part of the accused. However, Dr Ang said that this was not illustrative of abnormal or pathological jealousy (NE 1748 and 1749). 174      I have reflected on whether the accused’s evidence on this point was true. If it was true, it would mean that each time when he called, each of the couple had elected to receive the call but then not to speak, not even to say “Hello” on the phone, but instead to remain quiet. To me this was highly improbable. They would either have taken his call and said at least, “Hello” or switched off their handphones or let the handphones ring without taking the call. Furthermore, his evidence was that he had called them numerous times that night. His evidence suggested that each time he called, he managed to get through whereupon he noticed the quiet background on the handphones. I find it incredulous that they would each take his calls when he called so many times. 175      Perhaps what the accused meant was that he managed to get through once only that night although he called many times. If this is what happened, I infer that the person he was calling then cut off the call after hearing his voice (assuming there was no caller ID for the recipient’s handphone). By then the accused had noted a quiet background as opposed to, say, music in the background as had happened on other occasions on other days. Even then, I am of the view that it was abnormal to conclude from a quiet background that the couple were together and were having a tryst in a hotel room. 176      The Prosecution relied on Kingham & Gordon at [17] above to submit that since the accused’s suspicion of infidelity focused on Ashok in 2004 and no longer on Michael, this indicated that he was not suffering from morbid jealousy; otherwise he would have persisted in his suspicion against Michael. The Prosecution submitted that during one of the accused’s quarrels with Chitra post 26 March 2004, the accused had accused Chitra of having an affair with Michael, but after she denied it, he did not pursue his suspicion against Michael. 177      This submission overlooks the time when the accused had called Amutha (at [101]). According to Amutha, the accused told her that Chitra was having an affair with a guy called Michael and asked her for information about Michael. She told him she did not know who Michael was. In oral evidence, the accused suggested that he did not pursue the matter after he failed to obtain information about Michael from Amutha. 178      I note that the accused was not asking Amutha whether Chitra was having an affair with Michael. He was telling her it was so. I am also of the view that he did not pursue the matter about Michael further because he perceived he had much more evidence about the infidelity with Ashok. The accused was a person who sought such evidence. Dr Phang described the delusional feature as a delusional interpretation of spurious evidence even though he agreed that the accused did not suffer from a primary experience inaccessible to others as stated by Jaspers in [14] above. 179      In any event I agree with the submission for the Defence that the literature does not go so far as to say that a person suffering from morbid jealousy must suspect more than one lover of his partner. What Kingham & Gordon says is that such a person tends to accuse the partner of infidelity with many others. 180      I come now to the accused’s conduct from 26 March 2004. 181      In addition to the rapidity at which the accused perceived instances of infidelity in 2004, Dr Phang had also placed much weight on the accused’s conduct in the six weeks between 26 March to 17 May 2004, including his inability to work beyond just earning enough to pay the rent for his taxi. 182      The Prosecution submitted that there could not have been a delusional disorder from 26 March 2004 because the DSM-IV suggested that the disorder should last a month before such a diagnosis could be made and there was no evidence of such a disorder before 26 March 2004. 183      However, as Dr Phang pointed out, the accused’s intense conduct did last for at least one month as they spanned about six weeks from 26 March to 17 May 2004. In my view it is not necessary for the accused’s intense conduct to have commenced one month before 26 March 2004 as the Prosecution was suggesting. There must be a start date when such reactions become evident. 184      As for Dr Ang, he agreed that the accused’s conduct, such as his checking of her panties and his constant checking of her handphone and the interrogations during the “family meetings”, was characteristic of a person suffering from morbid jealousy. However, he was of the view that they were understandable in the light of what the accused had been learning since 26 March 2004 and also because Chitra had still not admitted to having an affair with Ashok, unlike the previous affairs when she did admit to them. Dr Ang was also of the view that the stabbing incident was similar to other acts of violence in the past. In his view the methods of checking and questioning and acts of violence were different but the pattern was the same. 185      As regards the checking of the panties, I am of the view that the accused gave a reasonably credible explanation,ie, that she had challenged him to bring her to a hospital for a check. Assuming that Chitra did challenge the accused, it was not abnormal if he responded to that by checking her underwear instead. I do not agree with Dr Phang that the accused should have, in response, brought Chitra for a medical check-up. In Dr Phang’s view, even rape victims are brought for such check-ups but the point is that Chitra did not claim to have been raped. What would the accused or Chitra say to the examining doctor: that the accused wanted to check whether his wife had recently engaged in sexual intercourse with another person? 186      As for the accused’s constant checking of Chitra’s handphone as well as Ashok’s, I agree that that was excessive. This cannot be explained away by the argument that she had still not admitted to the affair. 187      As for the “family meetings”, these were interrogation sessions which the accused had initiated. These were more intense than his previous questioning of her in the past. Such sessions also involved his children who were compelled by him to sit in during the sessions. The sessions lasted till late into the night, the accused would lock the main door of the flat, take the telephone off the hook and demand that the handphones of his wife and children be handed over to avoid interruptions and brandished a knife on occasions. The daughter had described such sessions as torture sessions. I agree that such sessions demonstrated very intense behaviour on the part of the accused. 188      I note that the accused was rather restrained in the morning of 27 March 2004, given his past history of violence when he learnt of her affairs and bearing in mind that he had just learnt that Chitra had lied to him about going to a barbecue party at East Coast Park and Chitra had not returned home within the one hour deadline he had subsequently imposed on her. There was a suggestion that he did not assault her, beyond a slap, when she returned home because of the PPO but Dr Ang’s view was that if he was suffering from morbid jealousy then, he would have assaulted her whether there was a PPO or not. However, there was no other evidence suggesting that a person suffering from morbid jealousy would be incapable of restraining himself from committing acts or further acts of violence. In any event, the accused’s actions subsequently became more intense and dangerous. 189      As mentioned above, the accused stabbed Chitra on 8 April 2004. There was to my mind one significant difference between that incident and the previous acts of violence by the accused. In the stabbing incident, the accused had intended to kill Chitra. That was not his intention in the past acts of violence, even when he had learnt that she was pregnant with Jayaseelan’s child. I do not think such a reaction can be explained away on the basis that she had called him “mad” or by her refusal to admit to an affair with Ashok. Even after he had stabbed her, he did not regret what he had done. There was no horror or shame as suggested by Mullen: see [21] above. According to the daughter, he called back twice thereafter. He wanted to know whether Chitra had died and not because he was concerned for her. Indeed, according to the son, the accused had said he was happy after he killed Chitra on 17 May 2004. 190      I come now to the accused’s behaviour on the night of 8 May 2004. As mentioned above, the accused had been released on bail and was faced with a DEO. According to the Summary, the accused called Chitra’s workplace in the morning to speak to her about some kind of a settlement. He was told she was not working then. He called again at about 8.00pm and was told it was her day off. He got his friend Supramaniam to call his mother-in-law’s flat but a male person answered the call and abused the caller. At about 10.00pm he called Chitra’s brother, Rajoo, who said she was working the night shift. The accused called Chitra’s handphone. There was music in the background. He called Ashok’s handphone and heard the same music in the background. He concluded that they were together. Notwithstanding possible alternative explanations suggested by Dr Phang, I do not fault the accused for this conclusion. It is the next sequence of events that night which is, in my view, more significant. 191      The accused had gone to a coffee shop to drink beer. He then asked his taxi driver friend, Supramaniam, to meet him. After a while, he asked Supramaniam to drive him to the IA to see if Chitra was there. They arrived between 12.30am and 1.00am. Although the accused was stopped from entering the premises there as he was not a member, Supramaniam managed to gain entry on the pretext of using the toilet. He returned and told the accused that the IA was closed for the day. They waited a while without seeing Chitra or Ashok. 192      The accused then asked Supramaniam to drive him to Leisure Park. He gave two different reasons for this. In examination-in-chief, the accused said he wanted to go there to see if Chitra was there with her family. He was looking for Rajoo’s car. 193      In cross-examination, the accused said he wanted to see if he could locate Rajoo to tell him that his sister was not working that night (contrary to what Rajoo had said) and to bring him to her workplace. 194      I find these reasons perplexing. The accused had learnt that Chitra was not working and had concluded that Chitra was with Ashok. There was no logical reason to then think she was with Rajoo especially at such a late hour. Secondly, what was the point of seeking Rajoo to bring him to Chitra’s workplace when he had not yet informed Rajoo that Rajoo was mistaken about Chitra being at work that night. 195      Furthermore, after the accused had arrived at Leisure Park with Supramaniam, they were not able to locate Rajoo’s car whereupon they proceeded to Chitra’s workplace. This last action was also strange because the accused had already learnt that it was Chitra’s off day then. 196      In my view, the accused’s conduct that night suggested an obsession with Chitra. Dr Phang referred to the accused’s conduct that night as a “feverish, frenzied search” for the couple which was the pathology. He also referred to the “sequence of navigating around Singapore” as a “classic description of delusional disorder, jealous type” (NE 1395 and 1392). 197      I agree that the accused’s conduct since 26 March 2004 was characteristic of a person suffering from morbid jealousy. However, I am mindful of the caution from the literature that such conduct alone may not justify a finding of morbid jealousy. 198      As I have elaborated above, although certain perceptions of the accused were understandable, others suggested or reflected an abnormality of the mind. Taking this into account and the accused’s conduct, I am of the view that the Defence has discharged its burden on the first limb. I find that the accused was suffering from the disorder known as morbid jealousy at the time he killed Chitra. 199      The Defence also sought to rely on the features listed by Mullen at [23] above to support its submission that the accused was suffering from morbid jealousy. In the light of my conclusion above, it is unnecessary for me to dwell on such features. 200      As for the second limb, there is no dispute that morbid jealousy is a disease of the mind and that it is a major mental illness. 201      I move on to the third and last limb,ie, whether the disorder had substantially impaired the accused’s responsibility for his act of killing Chitra. 202      The Prosecution placed much emphasis on the detailed planning of the accused leading to the killing, as well as his awareness of the penalty for murder, to demonstrate that the accused’s mental responsibility had not been substantially impaired. Dr Phang said that even schizophrenic patients can plan. He gave an example of how such patients can plan their travel to a hospital, register to see the doctor and collect and pay for their medication. Another example he gave was how such patients can select their food from an array of dishes at a canteen, pay for the same and receive the correct change. With respect, I agree with the Prosecution that such illustrations are quite different in nature and detail from the planning that the accused went through to kill Chitra. As for Dr Ang, he accepted that the ability to plan did not necessarily mean that there was no substantial impairment. He then noted the rather detailed planning of the accused although he eventually accepted that a person suffering from morbid jealousy can plan and carry out a plan to kill with minute details (NE 1776, 1777 and 1780). Nevertheless, Dr Ang was of the view that the extent of the accused’s control of his actions suggested no substantial impairment of his mind. 203      Dr Ang explained that the accused’s intention to kill Chitra was no different from a normally jealous person who has decided to kill his wife. He elaborated that this was not a situation whereby the accused was responding to a perceived threat like Chitra and Ashok planning to take his life. On this point, Dr Ang was relying on the M’Naghten rules but a defence of diminished responsibility is not the same as the M’Naghten rules as Choo J observed. 204      As I have mentioned, Dr Fernandez did not venture a view on the issue about substantial impairment. Dr Phang was of the view that the disorder did substantially impair the accused’s mental responsibility for his act. However, Dr Phang’s reports did not elaborate on this crucial aspect. In examination-in-chief, Dr Phang said that the accused had become agitated as the accused described the events leading to and the killing. In his view, the accused felt a sense of grave and gross entitlement to kill Chitra. In cross-examination, Dr Phang said at NE 1153 to 1155: Q         You have stated in both your reports that the accused suffers from a disease of the mind, delusional disorder jealous type? A         Yes. Q         Right, which substantially impair his mental responsibility for his act of killing his wife. Perhaps, you can tell us, on what basis do you say that the act of his killing his wife was substantially---he was substantially mentally impaired? You see, I fail to find that out when your counsel was leading your evidence. It was just a one minor. Do you agree, do you maintain? Yes, that’s it. So, what is your basis for saying that? A         Your Honour, the fundamental basis for my stating that is that the accused suffered, in my opinion, from a recognised major psychiatric disorder or illness at and around the material time of the alleged killing. And I have stated my clinical reasons why I believe that he suffered from this major psychiatric disorder at and around the material time. And that is the fundamental reason, your Honour, why in my opinion, the accused was very likely on clinical grounds to have been substantially impaired in his mental responsibility for his acts in being a party in doing the killing. Q         Dr Phang, I understand that you have clinically found him to be suffering from this abnormality of mind which you said is delusional disorder jealous type, right. And I also, I have heard you correctly that you have testified that this disease, delusional disorder jealous type, was induced by the disease. You know, this disorder was induced by a disease? A         Yes. Q         Right. So there is one more limb which is this disease, this disorder, sorry, this abnormality of the mind substantially impaired his mental responsibility for his acts in causing the death of the wife. I have not heard anything from you in terms of correlating that disease to the killing of the wife. How did the abnormality of the mind substantially impair his mental responsibility for killing his wife? A         Your Honour, the answer to this rests on the differing mental mechanisms between delusional jealousy versus normal jealousy. The delusionally jealous will as a consequence of their psychiatric disorder behave with an abnormal facility and intensity, abnormal reaction, abnormal intense reaction to the believed infidelities. They were manifest characteristic behaviours which the normally jealous will not [have]. In the delusionally jealous, they will never be satisfied even when they say that they were sure as was typically, you know, classically the case in this accused even when he was absolute, he told me he was confirmed that she has been unfaithful. He still went on checking. The normally jealous will not do that, your Honour. The normally jealous, once they are sure, will desist and then they will take other steps, other---possibly other practical steps and it is my submission, your Honour, that it is because of his state of mind, the delusional state of mind, the delusional interpretation of the observations he made, even casual observations, that was what pointed to the fact that he was psychotic. A delusion, your Honour, is a form of psychosis. It is a type of psychosis. Psychosis has various manifestations. In this particular instance, the type of psychosis, the symptom of psychosis he manifested was the delusion of jealousy and it is this psychotic process which, on the balance of clinical probabilities, I concluded substantially impaired his mental responsibility. Q         Dr Phang. A         Yes. Q         How has this disorder, jealous---how has this disorder known as delusional disorder (jealous type) impaired the accused in his planning to kill the wife? A         Your Honour, I have testified that the delusional disorder (jealous type) does not impair the planning process of the individual but the impairment is contained in other aspects of his life. 205      At NE 1157, Dr Phang’s evidence was: Q         Including the killing? His mental responsibility, you know, Dr Phang? A         Yes, your Honour. He knew exactly what he was doing, he intended to do what he in fact did, he knew what he was doing and therefore he was not of unsound mind. He knew it was wrong as well, and therefore he was not of unsound mind. But it is my---it is my clinical opinion that nevertheless, he suffered from a major psychiatric disorder which I believe comes within the ambit of exception 7, your Honour, and which I further believe substantially impaired his mental responsibility, although I would humbly add, your Honour, that in my---in my training in forensic psychiatry, I was actually taught that we---as psychiatrists, we should confine ourselves to what is within the parenthesis of exception 7, and---and substantial impairment is actually a matter for the Court to---to decide. But nevertheless, your Honour, I---I---I feel, and I am of the opinion that with---with the psychosis and the---and the psychotic disorder that he was suffering from, and with all the attendant abnormalities of---of---of expression and behaviour, I---I think it is a reasonable clinical conclusion that he was substantially impaired, and that is my---that is my opinion, your Honour. 206      At NE 1159, Dr Phang’s evidence was: Q         You see, Dr Phang, I---I have yet to elicit from you---I---I’m still unable to understand in what sense, in what manner did the disorder, you know, impaired---substantially impaired his mental responsibility for killing the wife? A         Your Honour, his mental---his psychiatric or mental disorder resulted in him believing that his wife was unfaithful and further believing that the only way to end his personal sufferings inflicted upon him supposedly by his spouse was to kill her. And that is the link, your Honour, that I believe perhaps counsel is---is looking for and I hope this is---that was helpful. 207      Dr Phang also said that the killing was a product of the accused’s abnormal mental processes and he stressed several times that it was in the service of the abnormality of the mind. 208      It seems to me that what Dr Phang was saying was that because the accused was suffering from morbid jealousy this necessarily caused a substantial impairment of mental responsibility for his actions leading to the killing of Chitra. 209      I reiterate the accused’s detailed plans to kill and his execution of the plan, as well as his awareness of the penalty for murder. The accused was also wavering in his intention to kill Chitra. The accused had wanted to kill Chitra on 8 April 2004 when he stabbed her. When he was remanded at IMH thereafter he was initially happy to see her but she rebuffed him. During the rest of his remand before he was released on bail, he thought of killing her. When he was released on bail on 7 May 2004, he no longer thought of killing her. On 8 May 2004, he was going around Singapore to look for her. On 14 May 2004, he thought of killing her. On 15 May 2004, he caught a glimpse of her at Yew Tee MRT station and was happy. He still thought of killing her and went to the temple. As he was unsure whether he should kill her, he prayed to his god to ask for a sign if he was not to kill her. He told Dr Fernandez that he would deduce such a sign from a road block or if he was stopped by the police or if he fell down before he carried out the killing. I have also taken into account the accused’s conduct after the killing before he surrendered himself. 210      On the totality of the evidence, I am not persuaded that the accused could not have resisted his impulse to kill Chitra. That impulse stemmed from his obsession about her. He could not bear to divorce her or to let her be with other men. Such obsessive feelings are also found in persons who are extremely possessive and jealous, but not morbidly so. In my view, his feelings for her, however strong, did not substantially impair his mental responsibility for his actions leading to the killing of Chitra even though he was suffering from a mental disorder. 211      The burden of proof is on the Defence. I am afraid that the Defence has failed to discharge its burden in respect of the third limb. In the circumstances, I have to reject the defence of diminished responsibility and convict the accused on the charge of murder and sentence him according to the law."
    }
}