{
    "case_title": "Aloe Vera of America, Inc v Asianic Food (S) Pte Ltd and Another",
    "ncitation": "[2006] SGHC 78",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1          The plaintiff, Aloe Vera of America, Inc (“AVA”), took out this originating summons in June 2004 in order to obtain leave to enforce the Final Arbitration Award No 50 T 199 0092 03 issued on 15 October 2003 (“the Award”) against Asianic Food (S) Pte Ltd (“Asianic”), the first defendant named in the summons and Chiew Chee Boon (also known as Steven Chiew), the second defendant. The application proceeded on anex partebasis, as usual, and an order in terms was made against both defendants on 25 June 2004. They were subsequently served with the order and the supporting papers. 2          On 23 July 2004, Mr Chiew applied to set aside the order. After several hearings before Assistant Registrar David Lee, his application was dismissed on 9 November 2005. Mr Chiew’s appeal against that decision is now before me.",
        "Background": "3          AVA, a company incorporated and existing under the laws of Texas, USA, is a manufacturer and distributor of aloe vera products (“the products”). Its relationship with Mr Chiew goes back to 1987 when he became an independent distributor of the products. Subsequently, Mr Chiew was employed by AVA. 4          In 1997, AVA decided to close its Singapore office. Mr Chiew persuaded it not to shut down the Singapore operations completely but to let him take them over. He then established Asianic for this purpose. On 1 August 1998, an Exclusive Supply, Distributorship and License Agreement (“the Agreement”) was entered into between AVA and Asianic. By the Agreement, AVA granted Asianic exclusive rights to sell, market and distribute the products. Mr Chiew signed the Agreement on behalf of Asianic. 5          The Agreement provided for disputes between the parties to be mediated, and if mediation was unsuccessful, to be arbitrated. It also provided that the Agreement was to be governed by the law of Arizona, USA. The relevant provisions, cll 13.7 and 13.9, read as follows: 13.7Mediation/Arbitration. If a dispute arises relating to any relationship among any of the Forever Living Products Companies (“FLP”), their officers, employees, distributors or vendors or arising out of any products sold by FLP, it is expected that the parties will attempt in good faith to resolve any such dispute in an amicable and mutually satisfactory manner. In the event such efforts are unsuccessful, either Party may serve a notice of mediation/arbitration (“Notice of Mediation/ Arbitration”) on the other Party. … If differences cannot be resolved by mediation, the Parties agree that in order to promote to the fullest extent reasonably possible a mutually amicable resolution of the dispute in a timely, efficient and cost-effective manner, they will waive their respective rights to a trial by jury and settle their dispute by submitting the controversy to arbitration in accordance with the rules of American Arbitration Association (“AAA”) except that all Parties shall be entitled to all discovery rights allowed under the federal rules of civil procedure as those rules exist in the United States Federal Court for the District of Arizona. … The Arbitration shall be governed by the Federal Arbitration Act, 9 U.S.C. Sec 1et.seq., and the judgment upon the award rendered by the arbitration may be entered by any court having jurisdiction thereof. Either party may elect to participate in the arbitration telephonically. Any substantive or procedural rights other than the enforceability of the arbitration agreement shall be governed by Arizona law, without regard to Arizona’s conflict of laws principles. … 13.9Choice of Law. It is the intention of the parties hereto that this Agreement and the performance hereunder and all suits and special proceedings hereunder be construed in accordance with and under and pursuant to the laws of the State of Arizona, U.S.A., and that in any action, special proceeding or their proceeding that may be brought arising out of, in connection with, or by reason of this Agreement, the Laws of the State of Arizona, U.S.A., shall be applicable and shall govern to the exclusion of the law of any other forum, without regard to the jurisdiction in which any action or special proceeding may be instituted. 6          Disputes arose subsequently and the Agreement was terminated. In February 2003, AVA commenced arbitration proceedings. It submitted an arbitration complaint to the American Arbitration Association (“AAA”) and served a notice of arbitration on both Asianic and Mr Chiew. Both of them were named as parties to the arbitration complaint. By a letter dated 27 February 2003 to both defendants, the International Centre for Dispute Resolution (“ICDR”) of the AAA acknowledged receipt of AVA’s demand for arbitration and set out various instructions in relation to the procedural steps for the arbitration to which it gave the case number 50 T 199 00092 03. By a letter dated 7 May 2003, the ICDR formally informed parties that one Richard N Goldsmith had been appointed as arbitrator for the arbitration (“the Arbitrator”). 7          Mr Chiew was upset to be named a party to the arbitration. He took the position that he was not a party to the Agreement and had not agreed to arbitration or to the laws of Arizona applying to him personally. He appointed a law firm called Sullivan Law Group to act on his behalf to object to the arbitration. On 21 July 2003, Sullivan Law Group sent a position statement to the Arbitrator in which it was made clear that Mr Chiew was not submitting to the jurisdiction of the Arbitrator and that he was not a party to the arbitration agreement. AVA’s lawyers responded and submitted that Mr Chiew was a party to the arbitration agreement pursuant to cl 13.7 of the Agreement and/or that he was thealter egoof Asianic. On 1 August 2003, the Arbitrator made a preliminary order. He found that he had jurisdiction over Mr Chiew pursuant to cl 13.7 of the Agreement because Mr Chiew was properly a party to the arbitration under the broad definition found in cl 13.7 of the Agreement. He also stated that he had reached that result without deciding whether Mr Chiew was also properly before the tribunal under thealter egoclaim. 8          In a letter to the Arbitrator dated 10 September 2003, Sullivan Law Group stated that Mr Chiew disagreed with the Arbitrator’s order. Thereafter, Mr Chiew took no further part in the arbitration proceedings. 9          On 15 September 2003, the Arbitrator conducted a hearing. Prior notice of this hearing was given to all parties and they were asked to attend with their witnesses and to be prepared to present their proofs of evidence. Mr Chiew and Asianic did not attend. 10        The Arbitrator issued the Award on 15 October 2003. Pursuant to the Award, the Arbitrator ordered Asianic and Mr Chiew to pay to AVAinter alia: (a)        US$548,461.68 as special and compensatory damages; (b)        US$1,958.31 as the Arbitrator’s compensation and expenses and US$21,598 as costs; and (c)        US$8,000 as the AAA’s administrative fees and expenses. It should also be noted that in the final award, the Arbitrator made a finding that Mr Chiew was at all material times the president, a director and shareholder of Asianic and that Asianic was undercapitalised, failed to honour corporate formalities and was thealter egoof Mr Chiew. He further found that all acts and obligations of Asianic were the acts and obligations of Mr Chiew. 11        In September 2003, Mr Chiew filed an originating summons in this court (Originating Summons No 1276 of 2003) in which he sought a declaration that he was not a party to the Agreement. He obtained leave to serve these proceedings on AVA out of jurisdiction but AVA subsequently made a successful application for that order to be set aside. On appeal, Mr Chiew failed to have the order reinstated.",
        "The appeal": "12        Before I go on to set out and discuss the issues that arise in this appeal, it is worth emphasising two facts. The first is that the Agreement was, in terms, expressed to be made between “Aloe Vera of America Inc., a Texas Corporation” and “Asianic Food (S) Pte. Ltd., a Singaporean Corporation”. Mr Chiew was not expressly stated to be a contracting party. The second is that Mr Chiew’s signature appeared at the execution part of the Agreement under Asianic’s name in the following manner: LICENSEE:      ASIANIC FOOD (S) PTE. LTD., a Singaporean corporation [Mr Chiew’s signature] By: STEVEN CHIEW Its: MANAGER 13        Counsel for Mr Chiew, Mr Quentin Loh SC, took a two-pronged approach when putting forward his contention that AVA should not have been given leave to enforce the Award. First, he argued that AVA had not crossed the preliminary hurdle of establishing that there was an arbitration agreement between the parties. In this regard, he cited O 69A r 6 of the Rules of Court (Cap 322, R 5, 2004 Rev Ed) (“the Rules”) which sets out the procedure to be followed by a party seeking to enforce an arbitration award governed by the International Arbitration Act (Cap 143A, 2002 Rev Ed) (“the Act”). He argued that AVA had been unable to comply with the requirement that such an application be supported by an affidavit exhibiting the arbitration agreement because there had been no such agreement between AVA and Mr Chiew. His second ground was that, in any case, the court should refuse enforcement because Mr Chiew was able to satisfy one or more of the grounds set out in s 31(2) of the Act as a basis for refusing to enforce a foreign arbitration award.",
        "Definition of “arbitration agreement”": "14        The parties were agreed that the legal regime governing the recognition and enforcement of foreign arbitration awards is set out in the Act. They were not, however, agreed on exactly which sections of the Act applied. Mr Loh submitted that I should apply s 19, which is a section in Part II of the Act. If that were the case then I would also have had to consider the definition of “arbitration agreement” which appears in s 2(1) of the Act. On the other hand, Mr Dhillon, counsel for AVA, submitted that the appropriate section was s 29 of the Act in Part III thereof and that the correct definition of “arbitration agreement” to be considered would be that appearing in s 27(1). 15        Which definition of “arbitration agreement” is applicable is important because Mr Loh submitted that in order to enforce an arbitration award, the condition precedent that must be complied with is that there must be a written arbitration agreementbetween the parties. This he said was a clear requirement of s 19. It also required that the agreement be contained in a document signed by the parties. This was because the term “arbitration agreement” as used in s 19 had to be understood in the way defined in s 2. That section defines an arbitration agreement as an agreement in writing as referred to in Art 7 of the United Nations Commission on International Trade Law’s Model Law on International Commercial Arbitration (“the Model Law”). Article 7 of the Model Law provides that the arbitration agreement shall be in writing and an agreement is in writing if,inter alia, it is contained in a document signed by the parties or in an exchange of letters, telex, telegrams or other means of telecommunication which provide a record of the agreement. It is worth bearing in mind that, just looking at the list of exchanges by which an arbitration agreement can be brought into existence it seems to me unlikely that in all cases the parties’ signatures are required to constitute an agreement. In view of my holding below, however, it is not necessary for me to express a concluded view on Mr Loh’s interpretation. 16        The definition of “arbitration agreement” in s 27 of the Act is slightly different as it says that an arbitration agreement is an agreement in writing of the kind referred to in para 1 of Art II of the “Convention on the Recognition and Enforcement of Foreign Arbitral Awards concluded on 10th June 1958” (“the Convention”), often referred to as the “New York Convention”. The first two paragraphs of Art II read: 1.         Each Contracting State shall recognise an agreement in writing under which the parties undertake to submit to arbitration all or any differences which have arisen or which may arise between them in respect of a defined legal relationship, whether contractual or not, concerning a subject-matter capable of settlement by arbitration. 2.         The term “agreement in writing” shall include an arbitral clause in a contract or an arbitration agreement, signed by the parties or contained in an exchange of letters or telegrams. Paragraph 1 requires a written agreement but it does not require a signature. As to para 2, it is an illustrative and inclusive clause and not an exhaustive list of what constitutes an agreement in writing. It is plain therefore that the definition of arbitration agreement in the Convention is both wider and looser than that in s 2 of the Act. It is more difficult to argue in the context of this definition that an arbitration agreement only exists when there is a document between the parties that has been signed by the parties as such. 17        The Court of Appeal of Manitoba, Canada, in the case ofProctor v Schellenberg[2003] 2 WWR 621had to consider an argument that a party seeking to enforce a foreign arbitration award had not satisfied the requirement of para 1 of Art IV of the Convention to supply the court with the “agreement in writing” referred to in Art II of the Convention. In the course of his judgment, Hamilton JA stated at [18]: The requirements of para. 1 of Article IV of the Convention are mandatory requirements that an applicant must satisfy on an application under theAct. The issue here is whether an agreement was supplied to the court by the applicant, as required by para. 1(b) of Article IV of the Convention. To answer this, one must first determine what “agreement in writing” means. In doing so, one must give meaning to the words “shall include.” These words make it clear that the definition is not exhaustive. It is also clear that written documentation is required. My reading of the definition is that written documentation can take various forms, including an arbitral clause within a contract signed by both parties; an arbitration agreement signed by both parties; an arbitral clause within a contract contained in a series of letters or telegrams; or an arbitration agreement contained in a serious of letters or telegrams. Because the definition is inclusive rather than exhaustive, the Legislature did not limit the definition to these articulated methods of documentation. What is important is that there be a record to evidence the agreement of the parties to resolve the dispute by an arbitral process. This flexibility is important in this day and age of changing methods of communication. In my view, communication by facsimile falls within the definition. This is in keeping with a functional and pragmatic interpretation of the definition to serve the Legislature’s intent to give effect to arbitral awards granted in other jurisdictions in this era of interjurisdictional and global business. With respect, I endorse the attitude taken by the Court of Appeal of Manitoba in the above judgment and agree that one must take a pragmatic approach towards the definitions in the Convention and the Act in order to give effect to arbitral awards granted outside Singapore. 18        It is clear to me that in the case of an award which, like the Award here, was made by an arbitral tribunal with its seat in a foreign state (here Arizona) and where the law governing the arbitration was not Singapore law, the correct part of the Act to apply is Part III which contains ss 27 and 29 and is entitled “Foreign Awards”. Part II of the Act entitled “International Commercial Arbitration” generally applies only to arbitration proceedings with their seats in Singapore and which are “international arbitrations” within the meaning of that term in s 5 of the Act. The only exception to this is in respect of the court’s powers under ss 6(3) and 7(1) but those sections are not relevant in the present case. Part III of the Act, on the other hand, applies to “foreign awards” which are defined as arbitral awards made in pursuance of an arbitration agreement in the territory of a country, other than Singapore, which is a party to the Convention. The USA is a party to the Convention. Further, s 29(1) of the Act states that a foreign award may be enforced in a court in the same manner as an award of an arbitrator made in Singapore is enforceable under s 19 (that means that as with an award rendered in a Singapore international arbitration, where leave to enforce a foreign award is given, judgment may be entered in terms of the award). That wording allows a recourse to s 19 which would not otherwise be possible. It does not incorporate the definition of “arbitration agreement” found in Part II into that term as used in Part III.",
        "Procedure for enforcement": "19        Section 30 of the Act lays down the requirements with which a person seeking to enforce a foreign award must comply. This section reads: 30.—(1) In any proceedings in which a person seeks to enforce a foreign award by virtue of this Part, he shall produce to the court — (a)        the duly authenticated original award or a duly certified copy thereof; (b)        the original arbitration agreement under which the award purports to have been made, or a duly certified copy thereof; and (c)        where the award or agreement is in a foreign language, a translation of it in the English language, duly certified in English as a correct translation by a sworn translator or by an official or by a diplomatic or consular agent of the country in which the award was made. (2)        A document produced to a court in accordance with this section shall, upon mere production, be received by the court as prima facie evidence of the matters to which it relates. 20        The actual procedure to be followed when an application for leave to enforce a foreign award is made is, as stated earlier, set out in O 69A r 6 of the Rules. Rule 6(1) provides that the application may be madeex parteand must be supported by an affidavit: (a)        exhibiting the arbitration agreement and the duly authenticated original award or, in either case, a duly certified copy thereof and where the award or agreement is in a language other than English, a translation of it in the English language, duly certified in English as a correct translation by a sworn translator or by an official or by a diplomatic or consular agent of the country in which the award was made; (b)        stating the name and the usual or last known place of abode or business of the applicant (referred to in this Rule as the creditor) and the person against whom it is sought to enforce the award (referred to in this Rule as the debtor) respectively; and (c)        as the case may require, stating either that the award has not been complied with or the extent to which it has not been complied with at the date of the application. It can be seen that the language of r 6(1)(a) substantially tracks the language of ss 30(1) paras (a), (b) and (c). The whole debate in this case is what precisely is intended by requiring the applicant to produce, pursuant to r 6(1)(a), “the arbitration agreement”.",
        "Fulfilling the requirement of producing the arbitration award": "21        Mr Loh submitted that in view of the requirement for a copy of the arbitration agreement to be produced, when AVA was seeking to enforce the Award the first hurdle it had to overcome was to prove to the court that there was a written arbitration agreement signed between it and Mr Chiew. If the court found that there was no written agreement to which Mr Chiew was a party then there would be no need to proceed further. In effect, what Mr Loh was saying was that there should be, at a very early stage of the enforcement process, a two-step substantive examination of the foreign award for the purposes of enforcement in Singapore. Not only would the court have to see duly authenticated copies of the arbitration agreement and of the award but it would also have to be satisfied that although the award was in terms made against the person against whom it was sought to be enforced, it had been correctly made against that person in that such person wasprima faciea party to the arbitration agreement. 22        Whilst preferring to rely on the language of s 2 of the Act to substantiate his arguments, Mr Loh further submitted that proving the existence of an arbitration agreement as a prerequisite was also evident from the provisions of the Convention. The relevant articles provide: ARTICLE II 1.Each Contracting State shall recognise an agreement in writing under which the parties undertake to submit to arbitration all or any differences which have arisen or which may arise between them in respect of a defined legal relationship, whether contractual or not, concerning a subject-matter capable of settlement by arbitration. 2.The term “agreement in writing” shall include an arbitral clause in a contract or an arbitration agreement, signed by the parties or contained in an exchange of letters or telegrams. … ARTICLE III Each Contracting State shall recognise arbitral awards as binding and enforce them in accordance with the rules of procedure of the territory where the award is relied upon, under the conditions laid down in the following Articles. … ARTICLE IV 1.To obtain the recognition and enforcement mentioned in the preceding Article, the party applying for recognition and enforcement shall, at the time of the application, supply — (a)        the duly authenticated original award or a duly certified copy thereof; (b)        the original agreement referred to in Article II or a duly certified copy thereof. … 23        It was pointed out that the common law position as set out by Devlin J inChristopher Brown Ld v Genossenschaft Oesterreichischer Waldbesitzer Holzwirtschaftsbetriebe Registrierte Genossenschaft mit beschränkter Haftung[1954] 1 QB 8 (“theGenossenschaftcase”) was that a plaintiff seeking to enforce in court an arbitration award had to prove five matters, the first of which was the making of the contract which contained the submission to arbitration. This common law position, it was submitted, was also reflected by the Convention and the Act. Further, it was contended that under O 69A r 6, the court had acarte blanchediscretion to decide whether Mr Chiew was a party to the arbitration agreement. 24        Mr Loh was not able to cite an English (except possiblySvenska Petroleum Exploration v Government of the Republic of Lithuania[2005] 1 Lloyd’s Rep 515 (“theSvenska Petroleumcase”), a decision I will deal with later) or a local case that adopted the position advocated by him in relation to the enforcement of foreign awards under the Convention. TheGenossenschaftcase was one involving a domestic English arbitration and the principles governing the enforcement of an award from such a proceeding are not automatically applicable to cases coming under the Convention, a treaty that was concluded some four years later. There were, however, cases from other Convention jurisdictions that appeared to have adopted the approach argued for by Mr Loh when considering whether or not to enforce an award issued by a tribunal sitting in a third Convention state. It was submitted that in each of these cases, the court considered the fundamental prerequisite,ie, whether there was a valid and binding arbitration agreement. 25        First, there was a Norwegian case, a decision of the Hålogaland Court of Appeal in August 1999 reported at Yearbook Comm Arb’n XXVII (2002) p 519 (“theHålogalandcase”). There, the appellant, a Norwegian businessman, sought to charter a vessel to ship herring to Ukraine. His broker in Russia contacted a Cyprian broker who presented a vessel belonging to a Russian owner. The two brokers discussed the relevant issues by e-mail, using a GENCON charterparty as the basis of their discussions. All issues were resolved between the brokers and the shipowner’s broker issued a charterparty based on the GENCON draft incorporating the amendments and discussions and signed it “on behalf of the Owners”. Neither the charterer nor his broker signed the same. Disputes having arisen, the shipowner commenced arbitration in London according to the arbitration clause. The charterer denied the jurisdiction of any arbitral body and did not participate in the ensuing arbitration. In his award the arbitrator referred to the exchange of e-mails and found that a contract containing an arbitration clause had been entered into, and thus awarded damages against the charterer. The shipowner sought to enforce the award in Norway in the district court. The charterer objected, contending that there was no agreement “in writing” as he had not signed anything nor given instructions to the broker. 26        At first instance the district court held that the Convention applied and the requirement of the written form in Art II (agreement in writing) could not be used as an argument to deny enforcement of the arbitration agreement. Once the tribunal had decided that an arbitration agreement existed, it followed from Art III of the Convention that a Contracting State should recognise the award as binding and enforce it subject to the Convention grounds. In the view of the court, by producing e-mails and the charterparty which, according to the arbitral award, constituted an agreement between them, the parties had fulfilled the requirement of Art IV (ie, producing the duly authenticated award and original agreement). The Court of Appeal reversed this decision. It considered that: (a)        The parties had not produced the original arbitration agreement referred to in Art II. Although Art II does not specifically state that the local enforcement authority shall verify that the agreement satisfies the requirements of Art II, the Court of Appeal was of the view that it should be interpreted in that way. It was therefore necessary for the local enforcement authority to ascertain whether the requirements of Art II had been complied with. (b)        This assessment was to be done by the enforcement court and need not coincide with the question of the jurisdiction of the arbitrator in accordance with his domestic law. (c)        It was doubtful whether the e-mail transcripts could be held to fall within the definition of Art II(2) but under no circumstances could it be asserted that these transcripts contained an agreed arbitration clause. The contents of the e-mails appeared obscure and incomplete and reflected just fragments of an agreement. 27        This case was used by Mr Loh to substantiate the proposition that whether an arbitration agreement existed had to be decided on the basis of Singapore law. This reliance does not, however, take him very far. The court in theHålogalandcaseheld that “the contents of the E-mails appear obscure and incomplete and reflect just fragments of an agreement”. Obviously, these documents did not even satisfy the formalities for the enforcement of an award as they did not constitute an arbitration agreement in writing as required by Arts II and IV of the Convention. The Singapore court too would look at the document produced as the arbitration agreement under which the award had been made and consider whether under our law such document is capable of constituting an arbitration agreement. This would be a fairly formalistic examination as stated in [39] below. Applying theHålogalandcase would not require me to undertake a re-examination of the Arbitrator’s decision on its merits. 28Next wasPeter Cremer GmbH & Co v Co-operative Molasses Traders Ltd[1985] ILRM 564(“Peter Cremer”), a decision of the Irish Supreme Court. There the applicants had entered into two contracts with the respondents for the supply of goods. Each contract was negotiated with a series of letters and telexes. In the first contract, the parties agreed to arbitration in London under the Grain and Feed Trade Association (“GAFTA”) rules. In negotiating the second contract, the applicants stated that other than price and date of arrival, all conditions were to be as per the first contract. Subsequently, the applicants confirmed these terms but added that any disputes would be arbitrated amicably in Hamburg. The respondents did not respond to either of these communications. Later, the respondents purported to repudiate the contract and the applicants submitted the dispute to arbitration in London under GAFTA rules. The respondents refused to recognise the tribunal’s jurisdiction. The tribunal nevertheless ruled that a contract existed between the parties and included a clause providing for arbitration in London under GAFTA rules. The applicants then sought to enforce the award in Ireland under Part III of the Irish Arbitration Act 1980 (No 7 of 1980) (“the 1980 Act”) which provided for the enforcement of foreign arbitral awards under the Convention. Section 2 of the 1980 Act defined an arbitration agreement as an agreement in writing to submit disputable matters to arbitration. 29At first instance, Costello J held that the award should be enforced. After a careful consideration of the telexes between the parties, he was satisfied that they had agreed to arbitrate their disputes in London under GAFTA rules. He observed that once a point was raised by a respondent seeking to resist enforcement of an award by relying on s 9 of the 1980 Act (which contained Convention grounds to resist arbitration) the court was not bound by the arbitrator’s conclusion that the arbitral panel had been composed in accordance with the parties’ agreement. On appeal, the Supreme Court agreed. It considered the evidence and upheld the finding that there was an agreement between the parties and that they had agreed to arbitration in London under GAFTA rules. 30        The submission made on behalf of the appellants inPeter Cremerwas that there was no binding contract between the parties and that therefore there could not be a binding agreement to submit disputes to arbitration and that, accordingly, the assumption of jurisdiction by the arbitrators in London was invalid. That argument was put forward under ss 9(2)(d) or 9(2)(f) of the 1980 Act (our ss 31(2)(d) and (f)). The Supreme Court held that this issue was not properly the subject of those sub-sections because they referred to a situation where there was an undoubted submission to arbitration and where it could be established by the terms of such submission that the award dealt with a difference not contemplated or falling within the terms of the submission or that it contained decisions on matters beyond the scope of that submission. If there was no binding agreement containing an arbitration clause, then by definition there could be no submission to arbitration and no issue as to whether an award dealt with differences that did not fall within the terms of the submission or went beyond its scope. The Supreme Court pointed out that the appellants had not sought to set aside or suspend in England (the supervisory jurisdiction) the award made by GAFTA. The Supreme Court then held that the issue as to whether a binding contract existed between the parties was an issue that fell to be determined in an application under Part III of the 1980 Act by reason of the definition of “award” contained in s 6(1) of the 1980 Act, coupled with the definition of an arbitration agreement contained in s 2. Finlay CJ said at 573 that: … If a court before whom an application is made to enforce an award pursuant to Part III of the Act of 1980 is to enter upon consideration of that application it must first be satisfied that the document or decision sought to be enforced is, within the meaning of that Act, an award made in pursuance of an arbitration agreement within the meaning of that Act. In determining that issue the court cannot rely, of course, on any decision reached by the arbitral authority that an arbitration agreement had been reached, nor is it, however, in my view, in any way debarred from reaching a decision on that issue by reason of the existence in the award of a decision by the arbitral authority that an arbitration agreement exists. 31        The decision inPeter Cremeris not consistent with the decision inDardana Ltd v Yukos Oil Co[2002] 2 Lloyd’s Rep 326 (“theDardanacase”) which is cited in [42] below. It is not clear from the report ofPeter Cremerwhether the Irish courts have the equivalent of O 69A r 6 as part of their rules of court or the equivalent of s 30(1) as part of the 1980 Act. If there are such provisions, the court did not consider what the full implication of their existence might mean. In the light of this omission and possible difference in legislation, I do not considerPeter Cremerto be a persuasive authority for a Singapore court. 32        The third case, decided by Holmes J in the British Columbia Supreme Court, wasJavor v Francoeur[2003] BCJ No 480. There, an arbitration was carried out in California under the rules of the AAA pursuant to an arbitration agreement entered into between the claimants, Eddie Javor, and a corporation called Fusion-Crete, Inc, and the respondent, Fusion-Crete Products Inc. The arbitrator found that there was no separation between Fusion-Crete Products Inc and the individual, Mr Francoeur, and he subsequently added Mr Francoeur as a party to the arbitration proceedings. An award was later made against Mr Francoeur. Mr Javor sought to enforce the award against Mr Francoeur in Canada. Holmes J held that the award was not enforceable, regardless of the arbitrator’s findings, as the Convention did not provide for the issue of enforcement orders of arbitration awards against a person who was not a party to the arbitration agreement. However, there are factual differences between that case and the present that lessen its persuasiveness. Mr Francoeur was not a party to the arbitration agreement and the arbitrator did not suggest that he had been a party to it. Instead, he considered that Mr Francoeur should be held personally liable for the debts of the corporate respondent. In this case, Mr Chiew was named a party to the arbitration proceedings from the start, the Arbitrator found that he was a party to the arbitration agreement and the Arbitrator held him liable for breach of the arbitration agreement. 33        The case ofSarhank Group v Oracle Corporation(“theSarhankcase”) was a particularly interesting one. It was first heard by the US District Court for the Southern District of New York (see Yearbook Comm Arb’n XXVIII (2003) p 1043) and then on appeal by the US Court of Appeals for the Second Circuit, reported at 404 F 3d 657 (2nd Cir, 2005). The facts were that in 1991, Sarhank Group (“Sarhank”), an Egyptian corporation, entered into a contract with Oracle Systems, Inc (“Systems”), which provided for arbitration in Egypt. Systems was a wholly owned subsidiary of Oracle Corporation (“Oracle”). The contract was governed by Egyptian law. In 1997, a dispute arose between Sarhank and Systems and Systems eventually terminated the contract. Sarhank then commenced arbitration proceedings against both Systems and Oracle at the Cairo Regional Centre for International Commercial Arbitration. Oracle objected to the arbitration, alleging that it was not a signatory to the contract. In 1991, the arbitral tribunal issued a unanimous decision against both Oracle and Systems. The arbitrators held that the arbitration clause in the contract between Sarhank and Systems was binding upon Oracle because Oracle was a partner with Systems in the relation with Sarhank. Oracle sought an annulment of the award before the Cairo Court of Appeal but the award was upheld. 34        Sarhank then sought enforcement of the Egyptian award before the US District Court for the Southern District of New York. The District Court granted enforcement. It dismissed Oracle’s argument that the court should decide whether the arbitration agreement between the parties was valid in order to determine whether it had subject-matter jurisdiction to enforce the award under the Convention. The court reasoned that it was not asked to compel arbitration, in which case it would need first to decide whether the parties had agreed to arbitrate. Rather, the court was asked to enforce a foreign award in which the validity of the arbitration agreement had already been established under the laws of Egypt. The District Court concluded that in such a case it had original subject-matter jurisdiction under the Convention and turned to consider whether Oracle could establish any grounds for refusal of enforcement. I should note here that this decision was relied on by AVA below. The reasoning of the District Court was in line with that in theDardanacase ([31]supra) and this authority was relied on by the assistant registrar when he reached his decision. 35        Mr Chiew did not wish me to follow the first instance decision in theSarhankcase. Instead, Mr Loh referred me to the appellate decision of the US Court of Appeals for the Second Circuit which had become available by the time of the hearing of the appeal before me. The Court of Appeals overturned the District Court’s judgment in theSarhankcase. It decided that under American law, whether a party had consented to arbitrate was an issue to be decided by the court in which enforcement of an award was sought. An agreement to arbitrate must be voluntarily made and the court would decide, based on general principles of domestic contract law, whether the parties had agreed to submit the issue of arbitrability to the arbitrators. It noted that Oracle was not a named party to the agreement and stated that an agreement between Sarhank and Systems which did mention Oracle did not evidence a clear and unmistakable intent by Oracle to arbitrate or permit the arbitrator to decide the issue of arbitrability. The arbitrators’ conclusion that Oracle was bound to arbitrate as a non-signatory was based solely upon Egyptian law. The court held that it was American federal arbitration law that controlled the issue and “an American nonsignatory [could] not be bound to arbitrate in the absence of a full showing of facts supporting an articulable theory based on American contract law or American agency law”. The judgment below was vacated and the case remanded to the District Court to find as a fact whether Oracle had agreed to arbitrate. 36        Mr Dhillon submitted that the decision of the Court of Appeal is flawed in its reasoning and should not be followed. He made three main criticisms. Firstly, in relation to Art V(2)(a) of the Convention (ie, the equivalent of s 31(4)(a) of the Act), Mr Dhillon contended that the court erred in finding at 661 that: Under American law, whether a party has consented to arbitrate is an issue to be decided by the Court in which enforcement of an award is sought. An agreement to arbitrate must be voluntarily made, and the Court decides, based on general principles of domestic contract law, whether the parties agreed to submit the issue of arbitrability to the arbitrators. This was because Art V(2)(a) of the Convention has nothing to do with the arbitrators’ power to rule on their own jurisdiction as it deals with the situation in which recognition is refused by the enforcement court because it finds that the subject matter of the difference submitted to arbitration was not capable of settlement by arbitration under the law of the enforcement court. The second difficulty with the decision was that with regard to the argument under Art V(2)(b) of the Convention (the equivalent of s 31(4)(b) of the Act), the court ignored its holdings in previous US cases as to the narrow scope of public policy grounds, and its findings (for example inAmerican Bureau of Shipping v Tencara Shipyard SPA170 F 3d 349 (2nd Cir, 1999) (US Court of Appeals)) that non-signatories may be bound by an arbitration agreement. Thirdly, the court effectively held that it was entitled to ignore the parties’ choice of law and apply American law to the determination of whether a party was bound by the arbitration agreement. Mr Dhillon contended that such disregard for the parties’ choice of law undermines the very foundation for arbitration. 37        The reasoning of the Court of Appeals in theSarhankcase has also been criticised by arbitration attorneys in the US in an article entitled “Looking for Law in All the Wrong Places: The Second Circuit’s Decision inSarhank Group v. Oracle Corporation” by Barry H Garfinkel and David Herlihy published in MEALEY’S International Arbitration Report vol 20, No 6, June 2005, p 18. The authors considered at p 19 that the court’s decision illustrated how the term “arbitrability” was used wrongly: … In most legal systems, an “arbitrable” matter is one that can be resolved by arbitrators — assuming there is a valid arbitration agreement encompassing it. Under this definition, non-arbitrable matters have historically included criminal laws, family laws and a now-shrinking group of other “public” laws reserved to the courts. By contrast, in U.S. case law an “arbitrable” matter often connotes a matter falling within the scope of the parties’ arbitration agreement in any given case (assuming there is no law prohibiting its resolution by arbitrators). In this sense of the term, a non-arbitrable matter can be anything outside the realm of the parties’ consent to arbitration. InOracle, the Second Circuit incorrectly grafts this latter concept of “arbitrability” into Article V(2)(a) of the Convention, even though that provision was plainly intended to cover awards in which “the subject-matter of the difference is not capable of settlement by arbitration” because a law in the enforcing state prohibits that class of disputes from being resolved by arbitrators. That is why Article V(2)(a) is listed alongside the exception for “public policy” in Article V(2)(b) and is widely regarded as a specific application of the public policy exception. 38        In my view, the criticisms of the appellate court’s decision in theSarhankcase have considerable force. The approach taken by the appellate court was antithetical to that enshrined in the Convention. It demonstrated an insular attitude to the decisions of foreign tribunals involving American nationals without regard to the fact that the American parties had chosen to do business in a foreign jurisdiction and to make their agreements subject to foreign law and foreign arbitration. It runs counter to international comity and is an attitude that, if followed widely in the US, would adversely affect the enforcement of US arbitration awards abroad since the Convention implements a system that enjoins mutuality and reciprocity so that there is a danger of non-US jurisdictions refusing to enforce US awards when their own awards are not recognised in the US. 39        The arguments put forward on behalf of Mr Chiew were rejected by the assistant registrar who considered that it was sufficient for the purpose of satisfying O 69A r 6 of the Rules for AVA to prove that Mr Chiew was mentioned in the arbitration agreement that was exhibited by AVA and that the arbitral tribunal had made a finding that Mr Chiew was a party to the arbitration agreement. His conclusion was that the examination that the court must make of the documents under O 69A r 6 is a formalistic one and not a substantive one. 40        The issue therefore is as to the nature of the threshold imposed by s 30 of the Act as implemented by O 69A r 6 of the Rules. The emotive point made is that it would be wrong for the court to employ a merely mechanistic approach to this issue because that would result, as had allegedly happened in this case, in a foreign tribunal being able to make, with no basis, all sorts of orders against a Singaporean who was never a party to the contract which was being arbitrated and those orders thereafter being enforced by this court. Instead of taking a course that would lead to such an unwarranted result, the court must itself be satisfied first that the party against whom the award was made was in fact a party to the contract from which the arbitration arose. On the other hand, there is the principle of international comity enshrined in the Convention that strongly inclines the courts to give effect to foreign arbitration awards. As Litton PJ observed in the decision of the Hong Kong Court of Final Appeal inHebei Import & Export Corp v Polytek Engineering Co Ltd[1999] 2 HKC 205 (“theHebeicase”), woven into the concept of public policy as it applies to the enforcement of foreign arbitration awards “is the principle that courts should recognise the validity of decisions of foreign arbitral tribunals as a matter of comity, and give effect to them, unless to do so would violate the most basic notions of morality and justice” (at 211). 41        After carefully considering the arguments, I have come to the conclusion that the assistant registrar was correct. In the present case, there was a contract, the Agreement, between Asianic and AVA that contained an arbitration clause. The Agreement was signed by Mr Chiew on behalf of Asianic and it is not disputed that Mr Chiew had set up Asianic and was active in running its business with AVA pursuant to the Agreement. The provisions of the Agreement evidenced that the parties had agreed to disputes relating to the business established by that contract being resolved by arbitration and it was therefore capable of being considered as “an agreement in writing under which the parties undertake to submit to arbitration … differences which have arisen” within the meaning of that term in Art II of the Convention for an arbitration involving not only Asianic and AVA but also Mr Chiew himself. There can be no doubt that at the time he signed it, Mr Chiew anticipated that disputes arising from the business under the Agreement would be settled by arbitration although, probably, he was not contemplating that he himself would personally be a party to the arbitration proceedings. This holding is in line with the views expressed inProctor v Schellenberg([17]supra). 42        The approach adopted by the assistant registrar is also supported by authority. The idea that the enforcement process is a mechanistic one which does not require judicial investigation by the court of the jurisdiction in which enforcement is sought was expressed in Robert Merkin,Arbitration Law(LLP, 1991) (Service Issue No 42: 5 December 2005) at para 19.48 as follows: The Arbitration Act 1996, s 101(2) provides that a New York Convention award may, by permission of the court, be enforced in the same manner as a judgment or order of the court to the same effect, and s 101(3) goes on to state that “where leave is so given, judgment may be entered in terms of the award”. This wording makes it clear that the enforcement process is a mechanistic one, and that the court may simply give a judgment which implements the award itself. It follows that the award cannot be enforced on terms not specified in the award, and in particular it can only be enforced against a person who was the losing party in the arbitration. 43        This approach was the one taken by the English Court of Appeal in theDardanacase ([31]supra) which involved the submission that the appellant, Yukos, was not a party to the arbitration. In theDardanacase, the parties to the contract were Western Atlas International Inc and YNG. In respect of Yukos, it was contended that it had by its conduct made itself an additional party to the contract despite the fact that there was no written agreement to that effect. When counsel argued that the English equivalent of O 69A r 6 could be used to resist the enforcement of the award, Mance LJ held (at [9]) that this would: … lead to a curious duplication and, moreover, an inconsistency in onus. On the one hand, the respondents would have to prove the actual existence of a valid arbitration agreement in writing, before the award could be recognized or enforced. On the other hand, under s. 103(2) [the English equivalent of s 31(2) of the Act], recognition or enforcement “may be refused” if the appellants could prove one of the matters there listed, which include the absence of any valid arbitration agreement. Mance LJ further held at [10] and [12]: I consider that the scheme of the [Arbitration Act 1996 (c 23) (UK)] is reasonably clear. A successful party to a New York Convention award … has a prima facie right to recognition and enforcement. At the first stage, a party seeking recognition or enforcement must, under [the English equivalent of O 69A r 6 of the Rules], produce the duly authenticated award or a duly certified copy and the original arbitration agreement or a duly certified copy. … Once such documents have been produced, recognition or enforcement may be refused at the second stage only if the other party proves that the situation falls within one of the heads set out in s. 103(2). The issue before us concerns the content of and relationship between the first and second stages. … [A]t the first stage, all that is required by law of an arbitration agreement is apparently valid documentation, containing an arbitration clause, by reference to which the arbitrators have accepted that the parties had agreed on arbitration or in which the arbitrators have accepted that an agreement to arbitrate was recorded with the parties’ authority. On that basis, it is at the second stage, under s. 103(2), that the other party has to prove that no such agreement was ever made or validly made. 44        It is also material that s 30 of the Act, in setting out the evidential requirements that must be complied with to enforce a foreign award, requires the production of,inter alia, “the original arbitration agreementunder which the award purports to have been made, or a duly certified copy thereof” [emphasis added] and by sub-s (2) enjoins the court to receive such document “upon mere production, … as prima facie evidence of the matters to which it relates”. This language fully supports the further observation of Mance LJ in his judgment in theDardanacase (at [10]) that: The first stage must involve the production of an award that has actually been made by arbitrators. … [I]t would not, for example, be sufficient to produce an award which had been forged. However, it must be irrelevant at that stage that the award is as a matter of law invalid, on any of the grounds set out in s. 103(2), since otherwise there would have been no point in including s. 103(2). The award so produced must also have been made by arbitrators purporting to act under whatever is the document which is at the same time produced as the arbitration agreement in writing. That, it seems to me, is probably sufficient to satisfy the requirement deriving from the combination of s. 100(1) and s. 102(1) to produce “an award made, in pursuance of an arbitration agreement, …”. The words “in pursuance of an arbitration agreement” could in other contexts require the actual existence of an arbitration agreement. But they can also mean “purporting to be made under”. Construed in the latter sense the overlap and inconsistency to which I have referred are avoided. Any challenge to the existence or validity of any arbitration agreement on the terms of the document on which the arbitrators have acted falls to be pursued simply and solely under s. 103(2)(b) [the English equivalent of s 31(2)(b) of the Act]. 45        There is no doubt in this case that the Agreement that was exhibited to the affidavit filed by AVA when it applied for leave to enforce the Award was the “arbitration agreement under which the award purports to have been made” because the Arbitrator had held that Mr Chiew was properly a party to the arbitration as a party to the Agreement under cl 13.7 thereof and therefore had made the Award against him as well as against Asianic. 46        Mr Dhillon further submitted, and I agree, that it was difficult for Mr Loh’s arguments to be sustained because s 31(1) of the Act expressly provided that “enforcement in any of the cases mentioned in subsections (2) and (4) may be refused but not otherwise”. This language indicates that the grounds stated in s 31(2) of the Act are meant to be exhaustive and that the court has no residual discretion to refuse enforcement if one of those grounds is not established. This is also the view taken by the authors of the section on Arbitration inHalsbury’s Laws of Singaporevol 2 (LexisNexis, 2003 Reissue) (“Halsbury’s”) at para 20.140. 47        Whilst I have noted Mr Chiew’s arguments that he was not a party to the arbitration agreement, I do not think that it is correct for a court that is asked to enforce an award under the Convention to go behind the holding on the merits on this aspect that has been made by the Arbitrator except to the extent that this is permitted by the Convention grounds during the second stage of the enforcement process. It is indisputable that in holding that Mr Chiew was a party to the arbitration agreement, the Arbitrator was acting within his jurisdiction. It is an accepted principle of arbitration law that an arbitral tribunal has jurisdiction to determine whether a particular person is a party to an arbitration agreement. This is referred to as the doctrine ofKompetenz-Kompetenzand is not contested by Mr Loh whose submissions state that an arbitral tribunal has power to rule on its own competence and to continue with the arbitration if it considers itself competent to do so. In this particular case, there is also, under the applicable rules of the AAA, a specific rule (Art 15(1)) that states that the tribunal has power to rule on its own jurisdiction “including any objections with respect to the existence, scope or validity of the arbitration agreement”. 48        The Arbitrator was acting under the rules of the AAA. He reached his decision based on the law of Arizona, the law that was provided by the Agreement to be the law governing the relationship between the parties. He held that he had jurisdiction to determine the arbitrability of the claim by AVA against Mr Chiew and, secondly, that Mr Chiew was a proper party to the arbitration. Whilst it is also accepted that the power of the arbitral tribunal to determine its own jurisdiction is subject to review by the court, the issue in a situation like this is which court should conduct such review. Should it be the court that supervises the arbitration,ie, the court of the jurisdiction of the seat of the arbitration or should it be the court that is asked to enforce the award in a different jurisdiction? TheSvenska Petroleumcase ([24]supra) indicates that the English courts take the view that the answer to this question is that the supervisory court is the only one entitled to review the decisions of the arbitrator. 49        In theSvenska Petroleumcase, the claimant, a Swedish company, claimed that it had entered into a joint venture agreement with the Government of Lithuania (“the Government”) and a Lithuanian company for the purpose of exploiting certain oil fields in Lithuania. The joint venture agreement was governed by the law of Lithuania and contained an arbitration clause. A dispute arose between the parties which was referred to an International Chamber of Commerce arbitration in Copenhagen. The Government objected to the jurisdiction of the arbitration tribunal on the grounds that it was not a party to the joint venture agreement or to the arbitration agreement within it. This objection was considered by the tribunal at a hearing attended by all parties and the tribunal subsequently issued an interim award in which it held that the Government was a party to the joint venture agreement and was bound by the arbitration agreement. The Government did not challenge the interim award before the Danish court. It took no further part in the arbitration. Subsequently, a final award was issued in which the Government was ordered to pay certain sums to the claimant. The claimant then obtained an order giving it leave to enforce the final award in England. The Government applied for this order to be set aside on the ground that as an independent sovereign state, it was immune from the jurisdiction of the English court. The claimant then applied for the Government’s application to be struck out. It argued that the issue of whether the Government was a party to the arbitration agreement had been determined by the arbitration tribunal in its interim award, which award had given rise to an issue estoppel on that point so that the Government’s claim to state immunity was bound to fail. 50        Nigel Teare QC, sitting as a Deputy Judge of the High Court, dismissed the claimant’s application because it had not been able to show that the arbitral award had finally and conclusively determined in Denmark the issue of whether the Government was a party to the arbitration agreement. He did, however, state in his judgment that the question of whether an award was final and conclusive must depend on its status in the country where it was made, just as the question of whether a foreign judgment was final and conclusive depended on its status in the country where the judgment was pronounced. In the course of his judgment, Teare QC commented that theGenossenschaftcase ([23]supra), which had been cited to him as authority for the proposition that where an arbitral tribunal determines that it has jurisdiction, the decision will not be binding upon the parties, stated the law as it was prior to the English Arbitration Act 1996 (c 23) (“the English Act”) and that after that legislation was passed, it was necessary to refer to it rather than to the common law in relation to questions of arbitral jurisdiction. He also noted that theDardanacase had held that under the English Act, the only burden on the person seeking recognition of the award was to produce the documents required by s 102 and the applicant did not have to show at that stage that the award was binding upon the person against whom recognition was sought. Such questions were for that person to raise at the second stage under s 103 of the English Act (s 31(2) of the Act). Teare QC’s decision was not, however, the end of the saga. 51        The application by the Government to set aside the order giving the claimant leave to enforce the award was heard subsequently and decided inSvenska Petroleum Exploration AB v Government of the Republic of Lithuania & AB Geonafta[2005] EWHC 2437(Comm) before Gloster J. This application was dismissed. In the course of her judgment, Gloster J held that the interim award having been rendered nearly four years before her decision and the Government having taken no action before the Danish court, as the supervisory court of the arbitration proceedings, to challenge the interim award, it was probable that the Danish court would conclude that it was no longer open to the Government to make such a challenge. The award was therefore final and binding on the Government and therefore gave rise to an issue estoppel on the issue of whether the Government was the party to the arbitration agreement. Thus, the Government was not entitled in the proceedings in England and in relation to its claim to state immunity to rely on the fact that it was allegedly not a party to the arbitration agreement. 52        In the present case, the preliminary order on Mr Chiew’s position was made by the Arbitrator on 1 August 2003 and the Award was rendered on 15 October 2003. Up to the date of this hearing, Mr Chiew had not challenged either of those determinations in the Arizona Court. It was clear from the submissions made on his behalf that Mr Chiew had chosen not to challenge the Award in the Arizona Court and that he knew that he was entitled to mount such a challenge in that forum. One Edwin Baird Wainscott, an attorney in Arizona, who filed an affidavit on behalf of AVA confirmed in his affidavit that as no application had been made by Asianic or Mr Chiew to set aside the Award, the Award remained binding on the parties and that AVA was entitled to enforce the Award. Mr Chiew has not brought any evidence to challenge that assertion and establish instead that the Award is not final and binding under the law of Arizona. 53        Instead, what Mr Loh submitted was that Mr Chiew was not obliged to challenge the Award in the Arizona courts but could do so before this court, the enforcement court. He relied on the decision of Woo Bih Li JC (as he then was) inNewspeed International Ltd v Citus Trading Pte Ltd[2003] 3 SLR 1. There, Woo JC observed that a party faced with an arbitration award against him had two options – either to apply to the courts of the country where the award was made to set aside the award, or to wait until enforcement was sought and then attempt to establish a ground of opposition. He considered that these options were alternatives and not cumulative. 54        I have no quarrel with that observation. It was based on comments by Kaplan J in the Hong Kong case ofPaklito Investment Limited v Klockner East Asia Limited[1993] 2 HKLR 39. Kaplan J said at 48–49 of his judgment: It is clear to me that a party faced with a Convention award against him has two options. Firstly, he can apply to the courts of the country where the award was made to seek the setting aside of the award. If the award is set aside then this becomes a ground in itself for opposing enforcement under the Convention. Secondly, the unsuccessful party can decide to take no steps to set aside the award but wait until enforcement is sought and attempt to establish a Convention ground of opposition. That such a choice exists is made clear by Redfern and Hunter inInternational Commercial Arbitrationp. 474 where they state; “He may decide to take the initiative and challenge the award; or he may decide to do nothing but to resist any attempts by his adversary to obtain recognition and enforcement of the award. The choice is a clear one – to act or not to act.” 55        It must, however, be made clear as to exactly what Kaplan J and, in turn, Woo JC meant. They meant that a party seeking to challenge a Convention award had two courses of action open to him: he could apply to the supervising court to set aside the award and he could also apply to the enforcement court to set aside any leave granted to the opposing party to enforce the award. That is all that was meant. Neither judge said that the two courses of action were identical and could be based on similar grounds. It is axiomatic that an application to a supervisory court to set aside an award has to be based on one of the grounds which the jurisdiction of that court provides for such an order. In a jurisdiction applying the Model Law, an award by the arbitral tribunal on jurisdiction may be challenged in court and, at common law too, an award may be overturned by the supervisory court on the basis that the tribunal did not have jurisdiction. It is also axiomatic that an application to an enforcement court to resist a grant of leave to enforce must be based on one of the grounds as the jurisdiction of that court provides for such setting aside. It is not necessary nor is it logical that the grounds for both types of application would be identical. It is a question of what the law of the respective jurisdictions provides for. As was pointed out by Sir Anthony Mason NPJ in theHebeicase ([40]supra) at 229: Under the Ordinance [the Hong Kong equivalent of the Act] and the Convention, the primary supervisory function in respect of arbitrations rests with the court of supervisory jurisdiction as distinct from the enforcement court … But this does not mean that the enforcement court will necessarily defer to the court of supervisory jurisdiction. The Convention distinguishes between proceedings to set aside an award in the court of supervisory jurisdiction (arts V 1(e) and VI) and proceedings in the court of enforcement (art V(1)). Proceedings to set aside are governed by the law under which the award was made or the law of the place where it was made, while proceedings in the court of enforcement are governed by the law of that forum. The Convention, in providing that enforcement of an award may be resisted on certain specified grounds, recognises that, although any award may be valid by the law of the place where it is made, its making may be attended by such a grave departure from basic concepts of justice as applied by the court of enforcement that the award should not be enforced. 56        The fact that the Award may be final in Arizona does not therefore mean that Mr Chiew is excluded or precluded from resisting enforcement in Singapore. He may still resist enforcement of the Award provided that he is able to satisfy one of the Convention grounds under s 31(2) of the Act. The grounds on which enforcement of an award may be resisted under the Act, however, are not the same grounds that would entitle Mr Chiew to set aside the Award in the jurisdiction of the supervisory court. Whilst Mr Chiew’s options may be cumulative, that does not mean that the bases on which the options may be exercised are or must be identical. Mr Chiew could have challenged the Award in Arizona on the basis that the Arbitrator had no jurisdiction to make the Award because Mr Chiew was not a party to the arbitration agreement. He may be able to resist enforcement here if he can establish that the arbitration agreement was “not valid under the law to which the parties have subjected it” within the meaning of that phrase in s 31(2)(b). He is not, however, entitled to object to the initial grant of leave to enforce on the basis that the Arbitrator erred in holding that he was a party to the arbitration. As the enforcement court, I can only permit Mr Chiew to resist enforcement if he is able to establish one of the grounds set out in s 31(2) of the Act. Except to the extent permitted by those grounds, I cannot look into the merits of the Award and allow Mr Chiew to re-litigate issues that he could have brought up either before the Arbitrator or the supervisory court. As Mason NPJ also pointed out in theHebeicase, a party may be precluded by his failure to raise a point before the court of supervisory jurisdiction from raising that point before the court of enforcement. This is because failure to raise such a point may amount to an estoppel or a want ofbona fidessuch as to justify the court of enforcement in enforcing an award. This, in fact, is what happened to the Government of Lithuania in theSvenska Petroleumcase.",
        "Are any of the Convention grounds for resisting enforcement made out?": "57        Having rejected Mr Chiew’s initial objection to enforcement on the ground that there was no arbitration agreement that could be furnished to the court under O 69A r 6 and s 30 of the Act, I therefore turn to the second stage of the proceedings. I have now to consider whether Mr Chiew has made out a ground under s 31(2) or 31(4) of the Act which would warrant my exercising my discretion in his favour and refusing enforcement of the Award. 58        Mr Chiew argued that the Convention grounds under s 31 which entitle me to refuse enforcement are: (a)        Section 31(2)(b) – the assertion is that there was no valid arbitration agreement as Mr Chiew was not a party to the same. (b)        Section 31(2)(d) – the assertion is that the Award went beyond the scope of the submission to arbitration as the arbitration only bound AVA and Asianic. (c)        Section 31(4)(a) – the assertion is that the subject matter of the difference between the parties to the Award was not capable of settlement by arbitration as questions such as whether a person is thealter egoof a corporation are not arbitrable but must be resolved by the courts. (d)        Section 31(4)(b) – the assertion is that the enforcement of the Award would be contrary to the public policy of Singapore. I will consider these in turn.",
        "Section 31(2)(b) – No valid arbitration agreement": "59        Section 31(2)(b) provides that a court may refuse enforcement of a foreign award if the person against whom enforcement is sought proves to the satisfaction of the court that “the arbitration agreement is not valid under the law to which the parties have subjected it or, in the absence of any indication in that respect, under the law of the country where the award was made”. 60        Mr Loh submitted that Mr Chiew was not even a party to the Agreement, which contained the arbitration clause and a clause providing for the applicable law to be the law of Arizona. Arizona law therefore could not apply to him and, more importantly, cl 13.7 of the Agreement on which the Arbitrator relied to find that Mr Chiew had agreed to arbitrate disputes, had no application to him. Mr Loh also put forward various arguments why on the true interpretation of cl 13.7, it would not render Mr Chiew a party to the arbitration agreement. 61        First of all, it should be remembered that under s 31(2) of the Act, it is the party who wishes the court to refuse enforcement of the award who has the burden of establishing that one of the grounds for refusal exists. Sub-section (2)(b) calls on the challenger to establish that the arbitration agreement in question is not valid under the law to which the parties have subjected it. In this case, the arbitration agreement was subject to the law of Arizona and therefore Mr Chiew bore the burden of establishing that it was not valid under the law of Arizona and that under the law of Arizona the clauses of the Agreement could not have any application to him. It would not be correct in this situation for me to construe cl 13.7 or any other clause of the Agreement in the same way as I would be able to if it were subject to Singapore law in order to establish whether there was a valid arbitration agreement binding Mr Chiew. 62        The same argument was brought before the assistant registrar who correctly held that the issue as to whether there was a valid arbitration agreement had to be determined on the basis of foreign law. He also recognised that Mr Chiew had the burden to adduce evidence to establish his contention. The assistant registrar found that Mr Chiew had failed to adduce such evidence. On the contrary, the evidence showed that Mr Chiew had signed the Agreement and was also active in running Asianic. The assistant registrar found support from the reasoning of the US District Court decision in theSarhankcase ([33]supra). Batts J who decided it at first instance stated: [T]he court has been asked to enforce an international arbitral award in which arbitrability has already been established under the laws of Egypt. … … [T]he Convention … does not sanction second-guessing the arbitrator’s construction of the parties’ agreement. … It is well-settled that absent “extraordinary circumstances”, a confirming court is not to reconsider the arbitrators’ findings. … … [The arbitrators’] conclusion of partnership under the contract is one of “construction of the parties’ agreement” and will not be reviewed by the Court, absent extraordinary circumstances. In the instant case, no such extraordinary circumstances exist. Whilst the decision of Batts J may have been reversed by the Court of Appeals, I respectfully agree with his observations which are in line with the general approach taken by an enforcement court to the decision of the arbitral tribunal in question. They are also consonant with the views of the court in theHebeicase which underline that the approach towards the decisions of foreign arbitral tribunals in Convention countries is to recognise the validity of the same and give effect to them subject to basic notions of morality and justice. The Court of Appeals in theSarhankcase took a different view, one that I hope will not be generally endorsed. 63        The only evidence that Mr Chiew adduced of the law of Arizona was contained in an affidavit filed by one Mr Steven Sullivan. Mr Sullivan was Mr Chiew’s attorney in Arizona and, at the hearing below, it was conceded that Mr Sullivan was not acting as an expert but as an advocate for Mr Chiew. There was therefore no independent expert evidence from Mr Chiew on the law of Arizona as it applied to the Award. Also, as the assistant registrar found, Mr Sullivan’s affidavit essentially contained a rehash of the arguments (based on Arizona laws, Arizona Rules of Civil Procedure and AAA rules) which were raised before the Arbitrator and, subsequently, adjudicated and rejected by the Arbitrator. Since Mr Chiew had not adduced expert evidence to show that the Arbitrator’s findings are incorrect under Arizona law, I agree with the submission made by the plaintiff that there are no extraordinary circumstances warranting a review of the Award. I am not the supervisory court and cannot review the Arbitrator’s decision in the same way that an Arizona court could. For me to refuse to enforce the Award on this ground, I would need to be satisfied that, under the law of Arizona, the arbitration agreement was invalidvis-à-visMr Chiew and that the Arbitrator was not entitled to find that Mr Chiew was a party to the Agreement and the arbitration. No basis has been given to me for such a finding.",
        "Section 31(2)(d) – The Award went beyond the scope of the submission to arbitration": "64        Under s 31(2)(d), enforcement of the Award may be refused if it “deals with a difference not contemplated by, or not falling within the terms of, the submission to arbitration or contains a decision on the matter beyond the scope of the submission to arbitration”. 65        Mr Loh submitted that the Award should not be enforced in Singapore because it contains a decision on matters that are beyond the scope of the submission to arbitration – the arbitration agreement was between AVA and Asianic and the submission to arbitration was restricted to those parties only. Joining Mr Chiew and entering an award against him went beyond the scope of the submission to arbitration.Javor v Francoeur([32]supra) was cited in support. Additionally, Mr Loh said certain academics (though he referred me to only one article, that by Prof Wedam-Lukic, “The Jurisdictional Problems of Arbitration” (1994) 1 Croatian Arbitration Yearbook 51) were also of the view that an award seeking to bind non-parties to an arbitration agreement was a ground for refusal of enforcement under Art V(1)(c) of the Convention (the equivalent of s 31(2)(d) of the Act). 66        On behalf of AVA, Mr Dhillon submitted that s 31(2)(d) dealt with the grounds of excess of power or authority of the arbitrator. He cited para 20.145 ofHalsbury’s([46]supra) where the author stated that this ground of challenge assumed that the tribunal had jurisdiction over the parties and that the excess of jurisdiction should be looked at in relation to the scope of the arbitration agreement and not be restricted to the pleadings filed in the arbitration. The author added that when the court examined such a challenge, it should be cautious that in doing so it did not go into the merits in the case raised before the arbitrator, including any issue of law. 67        Mr Dhillon further submitted that s 31(2)(d) did not overlap with s 31(2)(b) which was the proper section to invoke when a challenge was being made on the basis that a person was not a party to the arbitration agreement. He pointed out that inPeter Cremer([28]supra), the appellant had argued that there was no binding contract between the parties and that therefore there could not be a binding agreement to submit disputes to arbitration. Dealing with this argument in the Irish Supreme Court, Finlay CJ held at 573 that: I am not satisfied that this issue can properly be made the subject matter of a defence pursuant to either s.9(2)(d) or s.9(2)(f) of the Act of 1980. S.9(2)(d) clearly, in my view, refers to a situation where there is an undoubted submission to arbitration … If, as is contended by the appellants in this case, there was no binding agreement containing an arbitration clause then, by definition, there could be no submission to arbitration and in the absence of a submission to arbitration there could be no issue as to whether an award dealt with differences not contemplated or falling within the terms of a submission or went beyond the scope of the submission. InPeter Cremer, no challenge was mounted on the basis of the Irish equivalent of s 31(2)(b) but it is quite clear that the court did not consider that a challenge, premised on the argument that a person was not a party to an agreement, could be made under s 31(2)(b). 68        In any event, Mr Dhillon submitted that in order to determine whether the award dealt with matters that were beyond the scope of the submission to arbitration, the law to be applied would have to be the governing law of the arbitration agreement since that law would control the way in which the arbitration agreement was construed. Accordingly, where a Convention award is to be enforced, the foreign law of the award would be applicable. In this case, Mr Chiew had brought no evidence based on Arizona law to prove that the Award contained a decision on a matter beyond the scope of the submission to arbitration. As forJavor v Francoeur, this case was distinguishable on its facts as the arbitrator there had held that the respondent was liable without finding him to be a party to the arbitration agreement. 69        Having considered Mr Dhillon’s arguments, I accept them. I agree with the assistant registrar that this ground of challenge relates to the scope of the arbitration agreement rather than to whether a particular person was a party to that agreement. Mr Chiew has not established that this ground avails him in this instance.",
        "Section 31(4)(a) – The subject matter of the difference between the parties to the Award was not capable of settlement by arbitration": "70        Under s 31(4)(a) of the Act, the court may refuse to enforce a foreign award if it finds that “the subject-matter of the difference between the parties to the award is not capable of settlement by arbitration under the law of Singapore”. 71        Under this ground, the first submission made was that a finding ofalter egoby the arbitral tribunal could not be used to prove a binding arbitration agreement.Alter egois an issue that is not arbitrable under Arizona law to begin with. It is a question for the courts and an arbitrator’s award based on a purported finding ofalter egois invalid under Arizona law. These assertions were based on the evidence of Mr Sullivan. Two cases from the US Court of Appeals for the Ninth Circuit which cover the state of Arizona were cited. One of these held that a party may not be compelled to arbitrate or held to the arbitration result under thealter egotheory in the absence of a court judgment ruling to that effect after that party had been afforded his full due process rights. 72        In my opinion, the above submissions are misplaced. It is clear from the wording of the section itself that the determination of whether a matter is arbitrable or not is governed by Singapore law. The law of Arizona is irrelevant. As far as Singapore law is concerned, as para 20.149 ofHalsbury’spoints out, no specific subjects have been identified by statute as being or as not being arbitrable. Instead,Halsbury’sstates: It is generally accepted that issues, which may have public interest elements, may not be arbitrable, for example citizenship or legitimacy of marriage, grants of statutory licences, validity of registration of trade marks or patents, copyrights, winding-up of companies … Whether a person is thealter egoof a company is an issue which does not have a public interest element. It normally arises in a commercial transaction in which one party is trying to make an individual responsible for the obligations of a corporation. In my judgment, such an issue can in an appropriate case be decided by arbitration. In this case, the Arbitrator had first found an agreement between Mr Chiew to arbitrate as he found the latter to be “properly a party to this arbitration as a party under the broad definition found in paragraph 13.7 of the Agreement”. It was only after hearing evidence at the final hearing that the Arbitrator found that Mr Chiew was thealter egoof Asianic based on Arizona law. As the Arbitrator had clearly found Mr Chiew to be a party to the arbitration agreement with AVA, he was entitled to go on and decide in the course of the arbitration whether or not Mr Chiew was thealter egoof Asianic. This issue was within the scope of the submission to arbitration and was clearly arbitrable.",
        "Section 31(4)(b) – The enforcement of the Award would be contrary to the public policy of Singapore": "73        Under s 31(4)(b), the court may refuse to enforce the award if it finds that the enforcement of the award would be contrary to the public policy of Singapore. 74        Mr Loh submitted that there was no evidence before the court to show that Mr Chiew was thealter egoof Asianic. In fact, the evidence adduced by Mr Chiew showed the opposite to be the case. It was, he submitted, against public policy to enforce an award made on the basis of thealter egotheory because the Arbitrator’s decision had pierced the corporate veil without any supporting evidence. Further, in his preliminary award to join Mr Chiew as a party to the arbitral proceedings, the Arbitrator stated that he was not making a finding based on thealter egopoint but merely on a wide reading of cl 13.7. Later, in the substantive award, the Arbitrator found Mr Chiew to be Asianic’salter egowithout giving any reasons and in Mr Chiew’s absence. If this had been the subject of his preliminary ruling, Mr Chiew might have challenged the same in the Arizona courts on the basis thatalter egowas not an arbitrable issue. Due to the course the matter took, Mr Chiew was deprived of this opportunity. This was a breach of natural justice. At another point in the submissions, it was contended on behalf of Mr Chiew that the enforcement of foreign arbitral awards that seek to bind non-signatory Singapore citizens to such awards would be contrary to Singapore’s public policy. 75        The approach that I take to arguments that an award from a Convention country should not be enforced because it would be against public policy to do so was well expressed in the passage from theHebeicase that I cited in [40] above. Such an award must be enforced unless it offends against our basic notions of justice and morality. InRe An Arbitration Between Hainan Machinery Import and Export Corporation and Donald & McArthy Pte Ltd[1996] 1 SLR 34, I held that the principle of comity of nations requires that the awards of foreign arbitration tribunals be given due deference and be enforced unless exceptional circumstances exist. I have not changed my mind since then. 76        In this particular case, the enforcement of the Award would not by any stretch of imagination offend against the most basic of the notions of justice that the Singapore court adheres to. Firstly, strictly speaking, it is not accurate to describe Mr Chiew as a “non-signatory” to the Agreement. He did in fact sign it although he did so as the manager of Asianic. That was evidence that he had something at least to do with the Agreement. Secondly, in Singapore, legal principles exist which allow liability for breach of contract to be imposed on a person who, ostensibly, is not a party to the contract concerned. Singapore legal principles also recognise that a person who is not named in a particular contract may in fact be a party to it and responsible for the obligations purportedly undertaken by somebody else. Such liability can be imposed on the basis of theories such asalter egoand agency. So the findings on Mr Chiew’s positionvis-à-visthe Agreement and the arbitration are not strange to us. Whether on the evidence adduced in the proceedings, a Singapore court would have come to the same conclusion as the Arbitrator did, is irrelevant to my consideration of the public policy issue. Thirdly, Mr Chiew was at all times given the opportunity to deal with the substantive issues involved in the arbitration. He was notified from the beginning that AVA was making a claim in the arbitration against him as a party to the Agreement. He took part in the arbitration to the extent that he objected to the jurisdiction. There was nothing thereafter to stop him from challenging the Arbitrator’s preliminary holding in the courts of Arizona or from taking part in the arbitration itself or from challenging the Arbitrator’s final holding in the courts of Arizona. Having chosen not to participate in the proceedings, it really does not lie in Mr Chiew’s mouth to say that he has been deprived of natural justice because the Arbitrator made one finding in his interim award and supplemented that with an additional finding in the final award. Mr Chiew had the benefit of legal advice in Arizona at all material times and his decision not to have recourse to the supervisory court was a calculated one. If his choice has proved to be a miscalculation, public policy does not require that I relieve him from the consequences of such miscalculation.",
        "Conclusion": "77        In the result, this appeal fails and must be dismissed with costs."
    }
}