{
    "case_title": "WestLB AG v Philippine National Bank & Others",
    "ncitation": "[2006] SGHC 234",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The Republic’s application": "4       The Republic’s application is founded on the principle of state immunity embodied in s 3(1) of the State Immunity Act (Cap 313, 1985 Rev Ed) (“SIA”). A State is immune from the jurisdiction of the courts of Singapore except as provided in the following provisions of this Part. 5       The 2ndto 7thdefendants (“the defendants”) objected to the application. They objected at two levels, the first whether the Republic was entitled to make the application, and the second whether the application should be allowed. 6       The objection at the first level was related to the Republic’s right and interest in the Funds. Essentially the point was that the Republic did not have a sufficient interest in the Funds to assert state immunity over their disposal. While the Republic relied on the decision of the Philippines Supreme Court which forfeited the Funds to the Republic, the effect of the decision was challenged on the ground that the 2ndto 6thdefendants were not parties before the Philippines Supreme Court, and whether the Republic’s right to the Funds was a rightin personamor a rightin rem. 7       These are substantive questions that have to be addressed in the substantive hearing, if the proceedings are to proceed, and are not stayed. But for the present purposes, the question whether the Republic has the requisitelocus standito apply for a stay has to be considered at this preliminary stage. 8       This does not require that the Republic’s right and interest in the Funds to be conclusively determined. The test to be applied to establish a state’s right to assert state immunity in a dispute has been considered by the Privy Council inJuan Ysmael & Co Inc v Government of the Republic of Indonesia[1955] AC 72. 9       The short facts of the case is that a vessel was arrested by a process of court in Hong Kong. The government of Indonesia entered appearance under protest and applied to set aside the proceedings on the ground that it was the owner of the vessel having purchased it from an agent of the appellants, the party which arrested the vessel, and therefore the proceedings impleaded on the state immunity of Indonesia. The claim of the government was based on the evidence in the affidavits of two persons. The appellants obtained leave to cross-examine them, but when they failed to avail themselves to be cross-examined, their affidavits were expunged. When the main action went for trial, the trial court dismissed the government’s claim for immunity and gave judgment in favour of the appellants. The government appealed against the decision, and succeeded. The Appeal Court held that the trial judge was wrong in dismissing the government’s motion for dismissal. 10     The appellant brought the matter to the Privy Council, which reversed the decision of the Appeal Court. Earl Jowitt who delivered the judgment of the Privy Council explained the rule of state immunity and highlighted the inherent difficulty that may arise. He noted at pages 86 and 87: The rule according to a foreign sovereign government immunity against being sued has been considered and applied in many cases. The basis of the rule is that it is beneath the dignity of a foreign sovereign government to submit to the jurisdiction of an alien court, and that no government should be faced with the alternative of either submitting to such indignity or losing its property. … Where the foreign sovereign State is directly impleaded the writ will be set aside, but where the foreign sovereign State is not a party to the proceedings, but claims that it is interested in the property to which the action relates and is therefore indirectly impleaded, a difficult question arises as to how far the foreign sovereign government must go in establishing its right to the interest claimed. Plainly if the foreign government is required as a condition of obtaining immunity to prove its title to the property in question the immunity ceases to be of any practical effect. 11     The problem does not arise when the state is made a party in the proceedings because the inclusion of the state as a party would be an acknowledgement of the state’s interest in the subject matter of the dispute. 12     Earl Jowitt was concerned over an earlier decision,The Jupiter[1924] P 236, where Scrutton LJ stated that he was content to uphold a claim for state immunity on a sovereign’s bare assertion of ownership. Earl Jowitt disagreed with Scrutton LJ, and stated in pages 89-90: In their Lordships’ opinion the view of Scrutton L.J. that a mere assertion of a claim by a foreign government to a property the subject of an action compels the court to stay the action and decline jurisdiction is against the weight of authority, and cannot be supported in principle. In their Lordships’ opinion a foreign government claiming that its interest in property will be affected by the judgment in an action to which it is not a party, is not bound as a condition of obtaining immunity to prove its title to the interest claimed, but it must produce evidence to satisfy the court that its claim is not merely illusory, nor founded on a title manifestly defective. Earl Jowitt’s restatement is preferred as the correct state of the law. 13     By that standard, the Republic’s claim based on the judgment of the Philippines Supreme Court is not illusory or manifestly defective, and I am satisfied that the Republic has established a sufficient standing to apply to stay the proceedings. 14     In support of the stay application, the Ambassador Extraordinary and Plenipotentiary of the Republic, Her Excellency (Mrs) Belen Fule-Anota filed two affidavits on 8 March 2006 and 27 April 2006. 15     In the first affidavit dated 8 March 2006, she deposed that: 4.      I am advised by the Presidential Commission on Good Government and the Office of the Solicitor General that the circumstances through which the Funds which are the subject matter of the present Summons were forfeited to the Republic, the circumstances under which the monies were deposited in Singapore and the basis upon which the present Summons were commenced are set out in the affidavits that have already been filed. 5.      The Republic owns and/or is interested in the Funds and, as a sovereign nation, the Republic is entitled to assert immunity in respect of the same. Accordingly the Republic wishes to be joined to these proceedings to assert its interest in its property and to claim state immunity in respect of it pursuant to the State Immunity Act (Cap. 313) and/or under common law. 16     The first-quoted paragraph confirmed the PCGG’s involvement with the Funds. It is noteworthy that the Ambassador did not deny that PNB was authorised to claim the Funds on behalf of the Republic, and she did not state that the PNB had acted in excess of its authority. 17     The application was opposed by the defendants. The thrust of the defendants’ opposition to the stay was that the Republic cannot invoke state immunity because: (a)    the Republic has submitted to jurisdiction through PNB, its agent, and (b)    the Republic has submitted to jurisdiction by its own action, and under s 4(1) of the SIA: A State is not immune as respects proceedings in respect of which it has submitted to the jurisdiction of the courts of Singapore.",
        "Submission to jurisdiction by PNB": "18     In the 14 October 2004 submissions made on behalf of PNB by Drew & Napier LLC, the former solicitors of PNB, it was stated[note: 1]that: [PNB] seek recovery of the subject matter of the dispute (i.e. the monies with the Plaintiffs) that were placed with the Plaintiffs by [PNB]. They are the account holders of the funds with the Plaintiffs. As such, they are entitled to require that the Plaintiffs release the monies to them. They are undoubtedly thelegal-title holders to the funds as well as beneficially entitled to the sameas adjudicated by the Swiss Courts and the Philippines Supreme Court and the Philippines Supreme Court En Banc. [Emphasis added] 19     The statement was made against the background that neither the Swiss courts nor the Philippines Supreme Court had adjudged that PNB was beneficially entitled to the Funds. To the contrary, the Philippines Supreme Court had forfeited the Funds to the Republic. 20     J Ermin Ernest Louie R Miguel, Director of the Legal Department of the PCGG, deposed in an affidavit dated 29 April 2006 to refute the argument that PNB had put forward the Republic’s claim to the Funds as its agent. He submitted that: In effect, the 7thDefendants are trying to equate PNB with the Republic, and treat them as one entity, attributing actions by PNB to the Republic. I am advised by the Republic’s Singapore solicitors and I verily believe that the 7thDefendants’ contentions are flawed. The mere fact that PNB holds the Funds as agent for the Republic, does not mean that PNB and the Republic are one and the same. 21     The issue was not whether PNB and the Republic should be equated and treated as one entity. It was whether PNB was acting as the Republic’s agent when it claimed the release of the Funds and submitted to the jurisdiction of the court. 22     There was no dispute that PNB has submitted to jurisdiction. The Republic in its submissions stated: It is admitted that PNB has submitted to jurisdiction.However, PNB has only submitted to jurisdiction in respect of its own claimto the Funds. … If PNB’s claim is unsustainable, it will be defeated. It will not be reconfigured into a new claim based on the rights and interests of the State. By pursuing its own claim to the Funds, this cannot be a submission to jurisdiction by the Republic.[note: 2][Emphasis added] and On the 7thDefendants’ argument that the Republic authorised PNB to pursue the Republic’s claim to the Funds, we submit that this issue does not even arise. As stated above, because PNB is not the Republic, submission by PNB to jurisdiction is not submission by the Republic to jurisdiction. As PNB’s participation in the proceedings cannot be equated to the Republic participating, the issue of whether the Republic authorised PNB does not arise.[note: 3] 23     Was there any basis for saying that PNB had submitted to jurisdiction in respect of its own claim? PNB’s participation in the proceedings was at the behest of the Republic pursuant to the authority conferred upon it by PCGG. During the hearing, the solicitors for the Republic gave discovery of PCGG Resolution No. 2004-Y-001 dated 27thJanuary 2004. The resolution referred to the Funds held in escrow by the PNB, which were still to be recovered, and empowered PNB to recover the Funds for the Republic. The critical parts of the resolution for the purpose of these proceedings are: [T]he PNB is authorised as follows: 1.      …. 2.      To retain the amount of US$1-Million to cover the litigation and administrative costs to be incurred in therecovery and transfer to the Republic of the Philippinesof the account in the bank in Singapore … [emphasis added] There was a subsequent Resolution No. 2004-Y-002 dated 29 January 2004 which increased the amount of US$1 million to 5% of the amount recovered. When these resolutions were passed, the Philippines Supreme Court had forfeited the Funds to the Republic, and PNB was appointed to seek the release of the Funds to the Republic. At that time, litigation was in contemplation because WestLB had released a portion of the money in the escrow account to PNB, but had not released the balance because it had received the competing claims. 24     When PNB made a claim for the beneficial interest in the Funds, it could only be doing that on behalf of the Republic pursuant to the resolution of the PCGG. In its own right, PNB cannot conceivably claim more than a legal interest in the Funds as the holder of the escrow account, and this has been acknowledged subsequently. 25     The current counsel for the Republic accepted in the written submissions dated 2 October 2006 that: The PNB did not, at any time, state in its Affidavits that it was beneficially entitled to the Funds.[note: 4] 26     Rogel L Zenarosa, First Vice President of PNB, had filed an affidavit dated 8 July 2006 on behalf of PNB in the interpleader proceedings: 21.    The said funds – are held in accounts with the Plaintiffs, opened in the name of [PNB]. As such, I submit thatprima facie, [PNB] as the account holder, is entitled to receive the said funds as and when demanded. 22.    On 18 November 2003, the Republic of the Philippines Supreme Court, En Banc, affirmed the Decision of the Supreme Court … upholding the decision of forfeiture of the embezzled monies, in favour of the Republic of the Philippines.[note: 5] 27     His affidavit made it clear that PNB regarded the beneficial interest in the Funds to have been vested in the Republic. Thus, when PNB submitted to the jurisdiction of this court and claimed a beneficial interest in the Funds, it was doing that as an agent of the Republic acting under the authority vested in it by the PCGG resolution. 28     The Republic has therefore, by its agent PNB, laid its claim before this court and has submitted to the jurisdiction of the court.",
        "Submission to jurisdiction by the Republic": "29     This issue arose out of the second prayer of the Republic’s application of 22 August 2006 set out in para 2(n) herein. This prayer was abandoned on 5 October 2006 in the course of the hearing of the stay application. Counsel said that was done to avoid confusion as to its effect, but the decision did not affect the question whether the Republic has taken a step in the proceedings by including the prayer in its application. 30     The defendants’ argument is that by praying for an order from the court that the Funds are to be released to the Republic, the Republic has submitted to the jurisdiction of the court; a party which seeks substantive relief from the court must be submitting to the jurisdiction of the court. 31     The Republic’s response set out in its rebuttal submissions is: 2.      Prayer 2 must be assessed in the context of its application. As a preliminary, it is well established that the court has two kinds of jurisdiction (a)    The jurisdiction to decide a case on its merits (the first kind of jurisdiction) (b)    The jurisdiction to decide whether the court has the jurisdiction of the first kind (the second kind of jurisdiction). These two kinds of jurisdiction should not be confused. … 19.    We submit that it is very clear that prayer 2 does not amount to a submission to the first kind of jurisdiction. It is made in the context of this hearing, which pertains to the second kind of jurisdiction only. It is a consequential prayer, ancillary to the principle relief claimed, that of determination of immunity. It does not evidence a willingness by the Republic to submit to the first kind of jurisdiction. To the contrary the Republic has repeatedly stated (through its counsel and in affidavit) it is joining solely to raise immunity. In assessing the nature of the prayer, reference should be made to the supporting affidavits filed herein. It is apparent that the application is made solely in the context of application pertaining to State Immunity, and not to a determination of the merits. 32     There are flaws in the argument. This court will only lose jurisdiction to decide the interpleader application on its merits if the Republic’s invocation of state immunity is upheld. 33     However the prayer for the Funds to be released to the Republic is a submission to the court’s jurisdiction. If the proceedings are stayed, the court should do no more than stay the proceedings. The court should not be making any order as to whom the Funds are to be released to, and the Funds will remain where they are. The second prayer is not a consequential order to a stay order as counsel for the Republic suggested. Before the court can order the Funds to be released to the Republic, the court must consider the claims put forth by the Republic and the other claimants, and be satisfied that the Funds should be released to the Republic rather than to the other defendants. The court cannot do that without assuming jurisdiction over the dispute and the parties. The Republic, by asking the court to make that order, must necessarily be submitting to the jurisdiction of the court. 34     The Republic’s position is elaborated on by the Ambassador in her affidavits. In her first affidavit, she deposed: For the avoidance of doubt, this application and the subsequent joinder of the Republic to these proceedings is solely to assert the Republic’s interest in its property and to claim immunity in respect of the same, and is not a submission to the jurisdiction of the courts of Singapore. and she reiterated in her second affidavit: I confirm that I have not, at any time, submitted the Republic to the jurisdiction of the courts of Singapore in the proceedings herein. 35     The effect of the Republic’s actions on its assertion of state immunity must be considered against the background of s 4(3), (4) and (5) of the SIA: (3)    A State is deemed to have submitted – (a)    if it has instituted the proceedings; or (b)    subject to subsections (4) and (5), if it has intervened or taken any step in the proceedings. (4)    Subsection (3) (b) does not apply to intervention or any step taken for the purpose only of – (a)    claiming immunity; or (b)    asserting an interest in property in circumstances such that the State would have been entitled to immunity if the proceedings had been brought against it. (5)    Subsection (3) (b) does not apply to any step taken by the State in ignorance of facts entitling it to immunity if those facts could not reasonably have been ascertained and immunity is claimed as soon as reasonably practicable. 36     In considering the effect of taking a step in the proceedings, reference can be made to the law relating to stay of actions pending arbitration. In the arbitration legislation, the taking of a step in the proceedings can affect an application to stay the proceedings pending arbitration, and the decided cases relating thereto can be instructive. 37     InChong Long Hak Kee Construction Trading Co v IEC Global Pte Ltd[2003] 4 SLR 499(“Chong v IEC”), the defendant in the proceedings filed a defence and counterclaim after the plaintiff had issued a 48-hour notice to file the defence. Para 1 of the defence stated: The Defendants are filing their defence herein without prejudice to their rights to file their application to stay proceedings on the basis that the parties have agreed by the document, produced in paragraph 4 hereof that the cause of action alleged in the Statement of Claim (“SOC”) and all matters in difference respecting the same, should be referred to arbitration. and the counterclaim started with: The Defendants repeat paragraphs 1 to 8 of the Defence herein. 38     When the stay application was filed subsequently by the defendant, it was dismissed on the ground that the defendant had taken a step in the proceedings. The defendant appealed against the dismissal. Tay Yong Kwang J heard the appeal. He quoted with approval at para 9 of his judgment para 20.035 ofHalsbury’s Laws of Singapore, Vol 2 (2003 Reissue): A step taken in the proceedings would nullify the party’s right to seek a stay under the statutory provision and is not merely a matter for the exercise of the court’s discretion to grant a stay. … There is no definitive rule as to what amounts to a “step in the proceedings”. It is generally accepted that any step which affirms the correctness of the proceedings or demonstrates a willingness or intention to defend the substance of the claim in court instead of arbitration may be construed as such. Clear examples of such steps would be filing of a defence on the merits of the claim. Where, however, such applications [steps?] are made with the expressed reservation that a stay application will be made on the basis of the arbitration agreement, the right could be preserved. However, requests made to the plaintiffs for extension of time for filing a defence; a request for particulars of the claim or to file a defence; filing affidavits in opposition to the continuation of an interim injunction; commencement of an action for the principal purpose of obtaining a mandatory order for delivery up of goods, have been held not to be “steps in the proceeding”. 39     He then referred to s 6(1) of the Arbitration Act (Cap 10, 2002 Rev Ed) which provides that: 6.(1) Where any party to an arbitration agreement institutes any proceedings in any court against any other party to the agreement in respect of any matter which is the subject of the agreement, any party to the agreement may, at any time after appearance and before delivering any pleading or taking any other step in the proceedings, apply to that court to stay the proceedings so far as the proceedings relate to that matter. and went on to state: The defendant was careful enough to reserve its right to apply for a stay in its [Defence and] Counterclaim by incorporating para 1 of the Defence. A Counterclaim is a separate matter from the plaintiff’s claim (O 15 r 2(3) of the Rules of Court (Cap 322, R 5)) although the rules (O 15 r 2(1)) require a Counterclaim, if made, to be added to the Defence. In a Counterclaim, the defendant takes on the mantle of a plaintiff. The defendant here would therefore be evincing an intention to sue on the subject matter covered by the arbitration clause if no reservation to apply for a stay had been stated in its Counterclaim as well. However, the defendant undermined itself by its action of giving its own 48-hour notice to the plaintiff in respect of its Counterclaim in the period between the assistant registrar’s decision and this appeal. That notice put it beyond doubt that it was serious in pursuing its Counterclaim in court and not by way of arbitration as the Counterclaim pertained to matters covered by the arbitration clause. The 48-hour notice militated against the defendant’s solicitors’ arguments of an “unequivocal, clear and consistent” intention to arbitrate the matters in dispute as the Counterclaim and the Defence were intertwined. The service of the 48-hour notice by the defendant was clearly a step in the proceedings within the meaning of s 6(1) Arbitration Act and thereby nullified the defendant’s right to apply for stay. 40     InAustralian Timber Products Pte Ltd v Koh Brothers Building & Civil Engineering Contractor (Pte) Ltd[2005] 1 SLR 168(“Australian Timber Products”), the defendant in the proceedings had filed an application to stay the proceedings under s 6(1) of the Arbitration Act and did not file its defence to the plaintiff’s claim. The plaintiff obtained judgment in default of appearance. The defendant applied to set aside the judgment, and a district judge in chambers set it aside. The plaintiff appealed to the High Court. Belinda Ang J allowed the appeal. She found at para 22 that the defendant should have filed its defence because: … an act, which would otherwise be regarded as a step in the proceedings, will not be treated as such if the [party] has specifically stated that he intends to seek a stay or expressly reserves his right to do so. 41     I am not sure that an expressed reservation or intention to apply for a stay should be considered to be sufficient by itself for that purpose. If that party wants to apply for a stay of the proceedings, it should do so before, or at the same time as it takes a step in the proceedings. The effect of a step taken after or with a stay application would be considered with the application taken into account. The effect of a step taken without a stay application can only be considered on its own. An expressed reservation or intention is not an application and cannot be accorded the same weight as an application. The party would secure its position better by filing an application for stay, and taking the step in the proceedings with the express reservation that the step is taken without prejudice to the stay application. 42     Leaving that qualification aside, the rule is of great practical value as it enables a party which is compelled to take a step in the proceedings to do that without forfeiting the opportunity to stay the proceedings or finding itself in the position of the defendant inAustralian Timber Products. 43     That position is justified on the assumption that the step taken is contingent to the stay application, i.e. that it is to be acted on only if the proceedings are not stayed and will not be proceeded with if the action is stayed. If the step taken is intended to be acted on even if the proceedings are stayed, then the taking of the step will undermine the stay application because the party intends the action to proceed despite the stay application. This was the point Tay J made with reference to the counterclaim inChong v IEC. 44     To put it simply, if a party takes a step in the proceedings on the basis “I will proceed with the step only if the proceedings are not stayed”, that step is not fatal to the stay application. However if the party’s position is “I will proceed with the step even after the proceedings are stayed”, then the step will work against the application to stay the proceedings. 45     Against this background, the Republic’s intention in applying to the court for an order to release the Funds to it must be examined. This point was covered in the Republic’s Rebuttal Submissions: 10.    If the court decides, pursuant to its second kind of jurisdiction, that it does not have the first kind of jurisdiction to hear the merits of the inter pleader because of state immunity, there will then be the issue of what has to be done in respect of the Funds. Prayer 2 addresses this. It does not call for a determination as to the merits of any parties’ claim, it only provides for the release of the Funds to the Republic. It isconsequential and ancillaryto the determination of immunity, and cannot be said to be inconsistent with, or to disaffirm it. If the funds were still with the Plaintiff WestLB, prayer 2 would not be necessary. Once the conflicting claims had been stayed, pursuant to the second kind of jurisdiction, the Plaintiff would have been free to remit the money as it had been instructed. But that is no longer the case. The Plaintiff is no longer participating in these proceedings. As a consequence of these proceedings, the Funds are now in an escrow account at the disposal of the court. … 19.    We submit that it is very clear that prayer 2 does not amount to a submission to the first kind of jurisdiction. It is made in the context of this hearing, which pertains to the second kind of jurisdiction only. It is aconsequential prayer, ancillary to the principle relief claimed, that of determination of immunity. It does not evidence a willingness by the Republic to submit to the first kind of jurisdiction. To the contrary the Republic has repeatedly stated (through its counsel and in affidavit) it is joining solely to raise immunity. In assessing the nature of the prayer, reference should be made to the supporting affidavits filed herein. It is apparent that the application is made solely in the context of application pertaining to State Immunity, and not to a determination of the merits… 20.    It is anecessary prayer, as the Funds in the escrow account have to be dealt with if the court holds that immunity applies. As we mentioned above, the court has ordered the Funds into an escrow account, first in the name of M/s Drew & Napier and now in the name of Harry Elias Partnership, to the credit of these proceedings. In effect the Funds are being held at the disposal of the court, and the court must order its release. 21.    To avoid confusion as to its effect, we have now withdrawn the prayer. We will be relying on prayer 4 of our application for this Honourable court to give its ancillary directions as to how the Funds will be dealt with, in the event the Republic is successful on prayer 1. [Emphasis added]. 46     By endowing the prayer with the nature of a consequential, ancillary and necessary prayer, it is clear that the Republic has intended that the prayer for the release of the Funds was to be proceeded with even if the claims of the other defendants were stayed. This was not a fallback step taken in the contingency that the proceedings are not stayed. Even assuming that it is correct for the Republic to take the position that because the Funds are being held at the disposal of the court, the court must order their release, it does not mean that the court should order their release to the Republic. If the Republic does not submit to the court’s jurisdiction, it should not want the court to make any order affecting it, save in connection to its assertion of state immunity, and it should not apply for an order that the Funds be released to it. In the result, I find that prayer 2 puts s 4(3)(b) into operation, and that is so even when the prayer is withdrawn, because the step has been taken.",
        "The effect of s 4(7) of the SIA": "47     The Ambassador had made it clear in her second affidavit that she has not submitted to the jurisdiction of the courts of Singapore. In making this assertion, the Ambassador was relying on s 4(7) of the SIA, which provides that: 4.(7) The head of a State’s diplomatic mission in Singapore, or the person for the time being performing his functions, shall be deemed to have authority to submit on behalf of the State in respect of any proceedings; and any person who has entered into a contract on behalf of and with the authority of a State shall be deemed to have authority to submit on its behalf in respect of proceedings arising out of the contract. The portion of the provision after the semi-colon has no relevance to the facts of this application. 48     Section 4(7) does not stand alone and should not be construed in isolation. It must be read together with s 4(1) and s 4(3): 4.(1) A State is not immune as respects proceedings in respect of which it has submitted to the jurisdiction of the courts of Singapore. … (3)    A State is deemed to have submitted — (a)     if it has instituted the proceedings; or (b)     subject to subsections (4) and (5), if it has intervened or taken any step in the proceedings. 49     Reading the three sub-sections together, it can be seen that there are two forms of submissions, firstly, submissions by action taken in the proceedings as envisaged in s 4(3), and secondly, submissions through an authorised person under s 4(7) without necessarily instituting, intervening or taking a step in any proceedings. 50     In this case, the defendants are contending that there was submission under s 4(3)(b) in the steps taken by PNB as an agent of the Republic, and by the Republic itself when it applied for the Funds to be released to it. 51     The Ambassador’s statement does not address the defendants’ contention that there was submission under s 4(3)(b). Nevertheless, it raised an issue on the effect of s 4(7), i.e. whether only the head of the diplomatic mission, the person performing his function or a person who has entered into a contract on behalf or with the authority of the State has the authority to submit to jurisdiction. 52     It was vigorously argued on behalf of the Republic that the three categories of persons mentioned in s 4(7) are definitive and exhaustive. Counsel referred to the decision of the Employment Appeal Tribunal inMalaysian Industrial Development Authority v Jeyasingham[1998] I.C.R. 307 (“Jeyasingham”). The facts of this case are set out in the headnotes: The applicant complained to an industrial tribunal that, inter alia, he had been unfairly dismissed by his employers, an investment authority which was part of a department of state of the sovereign state of Malaysia. The director of the authority entered a notice of appearance, but subsequently sought to claim immunity, pursuant to the State Immunity Act 1978. The industrial tribunal heard unchallenged evidence from a solicitor and received a draft affidavit of the Malaysian High Commissioner to the effect that the director had been advised by the solicitor that immunity could not be claimed and that, although the High Commissioner had thought that immunity should be claimed, the director had been persuaded by the solicitor that a notice of appearance should be entered. The tribunal found that the solicitor and the High Commissioner had invented a story to avoid a finding that immunity had been waived and held that it had jurisdiction to hear the complaint. 53     Counsel relied on the decision of the appeal tribunal which heard and allowed the employers’ appeal against the tribunal’s ruling. In the decision, Judge Hull Q.C. held at 315: With regard to the High Commissioner, he was the only person who could waive sovereign immunity. Unless it could be shown that he had done so, the industrial tribunal was bound to hold that the authority was entitled to immunity. The provision of the State Immunity Act 1978 under consideration was s 2, which is similar to s 4 of our SIA. 54     The defendants, on the other hand, referred to a recent decision of the English Court of Appeal inRepublic of Yemen v Aziz[2005] EWCA Civ 745. This was also an employment case. The facts as set out in the headnotes are: The applicant was employed as a member of staff at the London embassy of a foreign state until he was dismissed. He made a complaint of unfair dismissal against his employers. A notice of appearance and grounds of defence were served by solicitors purportedly on behalf of the employers. Before the employment tribunal, counsel for the employers conceded that the entering of the notice of appearance constituted a step taken in the proceedings by the employers within the meaning of section 2(3)(b) of the State Immunity Act 1978, but contended that that had been done in ignorance of facts entitling the employers to immunity so that, by virtue of section 2(5), the employers should not be deemed to have submitted to the jurisdiction of the tribunal and were still entitled to immunity. The tribunal found that the employers had submitted to the jurisdiction, waiving their immunity. The employers appealed on the ground that they had not taken a step in the proceedings since the entering of the notice of appearance had not been authorised by the ambassador. The Employment Appeal Tribunal admitted evidence from an attaché at the embassy to the effect that he had instructed the solicitors believing that the employment tribunal was a conciliatory body only, and from the ambassador to the effect that, although he had been aware that the attaché had had dealings with the solicitors regarding the applicant’s case, he had not authorised the attaché to instruct them. Accepting that evidence, the appeal tribunal found that the employers had not taken a step in the proceedings within the meaning of section 2(3)(b) of the 1978 Act and that they were accordingly immune from the jurisdiction. Section 2 of the State Immunity Act 1978 is similar to s 4 of our SIA. Section 2(3)(b) is identical to our s 4(3)(b) and s 2(7) is identical to our s 4(7). 55     Pill LJ in delivering the judgment of the court took a different view of the effect of s 2(7) from that taken inJeyasingham, which was cited in the arguments. He held at para 53: I agree with the analysis of section 2(7) inDickinson, Lindsay & Loonam’s State Immunity: Selected Materials and Commentary(2004), para 4.024: “This deeming provision appears to have been intended to resolve doubt as to whether the persons listed have authority to submit. In other cases, the authority of the state’s representatives must be established by evidence, if challenged. In such cases, there can be no question of ostensible authority, this being a species of estoppel and incapable therefore of extending the court’s jurisdiction.” … By deeming the existence of authority in the head of mission, the statute has clarified a point which may previously have been uncertain, though it does not follow that there is no other way in which a state can submit to the jurisdiction. and allowed the employee’s appeal. 56     I endorse Pill LJ’s construction. Section 4(7) should not be read as exhaustive or conclusive. On its face, it only provides that the three classes of persons shall be deemed to have the authority to submit on behalf of the state to the jurisdiction of the court. There is nothing that states or shows an intention that no one else can have the authority to submit on behalf of a State. 57     The restrictive construction, taken to its conclusion would mean that a submission by the head of a State who is empowered by the laws of that State to make the submission cannot do that because of s 4(7). This cannot be correct. Whether the authority exists is a question of fact which comes within the laws of that State. A court of Singapore should recognise and act on the submission. It can refuse to do so only if it refuses to acknowledge the existence of the authority, or if it denies the fact of the submission, and both alternatives are untenable. 58     Consequently, although the Ambassador has not submitted to the jurisdiction, that does not mean that the Republic has not submitted to the jurisdiction.",
        "Exception from immunity under s 5 of the SIA": "59     The defendants also argued that the Republic’s application should not be allowed because the Republic was engaged in a commercial transaction which is excluded from state immunity under the restrictive theory of state immunity. 60     Having found that the Republic has submitted to the jurisdiction of the court, it is not strictly necessary for me to deal with this argument. But I will deal with it as it touches on an interesting and important aspect of state immunity. 61     Section 5(1) of the SIA states that: A State is not immune as respects proceedings relating to— (a)a commercial transaction entered into by the State;or (b)     an obligation of the State which by virtue of a contract (whether a commercial transaction or not) falls to be performed wholly or partly in Singapore, but this subsection does not apply to a contract of employment between a State and an individual.[Emphasis added] and s 5(3) states: In this section “commercial transaction” means— (a)any contract for the supply of goods or services; (b)     any loan or other transaction for the provision of finance and any guarantee or indemnity in respect of any such transaction or of any other financial obligation; and (c)any other transaction or activity (whether of a commercial, industrial, financial, professional or other similar character) into which a State enters or in which it engages otherwise than in the exercise of sovereign authority.[Emphasis added] 62     The defendants placed emphasis on the italicised portions of the provisions to contend that the escrow contracts were commercial transactions which come within s 5(1) and s 5(3)(a) and (c). 63     It was submitted that the escrow agreements came within s 5(3)(a) as they were contracts of service by PNB as an escrow agent in return for payment. It was further argued that the agreements came within s 5(3)(c) because the escrow arrangements were transactions that private parties can engage in and were not actions reserved for the exercise of sovereign authority. 64     The distinction between acts of the first kind (acta jure gestionis) and acts of the second kind (acta jure imperii) was explained in the noted decision of the House of Lords inI Congreso del Partido[1983] 1 AC 244. 65     The distinction is drawn because the concept of state immunity in international law has evolved from the orthodox absolute theory to the restrictive theory currently favoured and incorporated in our SIA and the other similar legislation which I have referred to. 66     Lord Wilberforce explained the restrictive theory at 262: The relevant exception, or limitation, which has been engrafted upon the principle of immunity of states, under the so called “restrictive theory,” arises from the willingness of states to enter into commercial, or other private law, transactions with individuals. It appears to have two main foundations: (a) It is necessary in the interest of justice to individuals having such transactions with states to allow them to bring such transactions before the courts. (b) To require a state to answer a claim based upon such transactions does not involve a challenge to or inquiry into any act of sovereignty or governmental act of that state. It is, in accepted phrases, neither a threat to the dignity of that state, nor any interference with its sovereign functions. and went on to state at 267 that: … in considering, under the “restrictive” theory whether state immunity should be granted or not, the court mustconsider the whole context in which the claim against the state is made, with a view to deciding whether the relevant act(s) upon which the claim is based, should, in that context, be considered as fairly within an area of activity, trading or commercial, or otherwise of a private law character, in which the state has chosen to engage, or whether the relevant act(s) should be considered as having been done outside that area, and within the sphere of governmental or sovereign activity. [Emphasis added] 67     Reverting to the facts in the present case, the issue is whether placing the Funds into the escrow account with WestLB through PNB is a private act or a sovereign act. 68     The defendants argued that opening an escrow account with a bank is an act a private party can do, so the act does not come within the restrictive theory of state immunity. That is true if the opening of the account is taken in isolation. But when it is considered in “the whole context in which the claim against the state is made” as Lord Wilberforce had said, then a different picture emerges. 69     The circumstances of the Republic’s involvement with the Funds must be taken into account. It had applied to freeze the Swiss bank accounts with the assistance of the Swiss authorities under IMAC. The assistance under the IMAC is only available to state applicants. The Republic took the action because it regarded the assets in the accounts to be the illegal ill-gotten wealth that the Republic was entitled to recover. Subsequently the Republic obtained the release of the Funds from the Swiss accounts on condition that they were placed with “AA” rated banks and, in compliance with that condition, it placed the Funds with WestLB. 70     Looked at in the whole context, the accounts with WestLB were opened by the Republic as an integral part of the exercise of its sovereign powers to recover the Funds, and are not commercial transactions undertaken by the Republic.",
        "Conclusion": "71     As the Republic has, by its agent PNB and by its own action submitted to the jurisdiction of the court, the application to stay the interpleader proceedings is dismissed, with costs to the 2ndto 7thdefendants. [note: 1]at para 31[note: 2]The Republic of the Philippines Written Submissions dated 2ndOctober 2006, para 53[note: 3]The Republic of the Philippines Written Submissions dated 2ndOctober 2006, para 57[note: 4]Written Submissions dated 2 October 2006 para 50[note: 5]Affidavit of Rogel L Zenarosa dated 8thJuly 2004"
    }
}