{
    "case_title": "Law Society of Singapore v Tan Buck Chye Dave",
    "ncitation": "[2006] SGHC 216",
    "coram": "Chan Sek Keong CJ; \n      Lai Siu Chiu J; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Introduction": "1          This was an application by the Law Society of Singapore (“the Law Society”)pursuant to s 94(1) read with s 98 of the Legal Profession Act (Cap 161, 2001 Rev Ed) (“the Act”) for the respondent to show cause as to why he should not be dealt with under s 83(2)(e) of the Act. Having heard the submissions of the respective parties, we granted the application at the conclusion of the hearing and ordered the respondent to be suspended from practice for a period of six months and to bear the costs of the proceedings before us as well as of the Disciplinary Committee (“DC”) proceedings, to be agreed or taxed. We now give the detailed grounds for our decision.",
        "The charges": "2          There were originally four charges preferred against the respondent at the commencement of the DC hearing. However, upon the DC’s invitation to the Law Society to reconsider the second and third charges as the facts on which those charges were based could be considered as one “transaction”, the Law Society subsequently amalgamated the second and third charges into one charge. The charges, as eventually formulated by the Law Society, were as follows: (a)        First Charge: That the Respondent is guilty of grossly improper conduct in the discharge of his professional duty within the meaning of s.83(2)(e) of the Legal Profession Act (Cap.161, 2001 Rev Ed) in that, on 9 January 2004, during a telephone conversation with Chia Heng Huat he did attempt through the said Chia Heng Huat, to procure employment in respect of HDB conveyancing matters, by promising to give the said Chia Heng Huat a sum of $200.00 within one (1) month of the completion of each HDB property conveyancing matter, for obtaining his employment in each HDB conveyancing matter that would be referred to him by the said Chia Heng Huat. (b)        Amalgamated Second and Third Charge: That the Respondent is guilty of grossly improper conduct in the discharge of his professional duty within the meaning of s.83(2)(e) of the Legal Profession Act (Cap.161, 2001 Rev Ed) in that, on 14 January 2004, at a meeting with Chia Heng Huat at MOS Burger at Toa Payoh HDB Hub he did attempt through the said Chia Heng Huat, to procure his employment in respect of HDB property conveyancing matters, by promising to give the said Chia Heng Huat or the said Chia Heng Huat’s real estate agents, a sum of $200.00 in cases where his firm’s legal costs in the matter would be $2,000.00 or a sum equivalent to fifty percent (50%) of the excess of $2,000.00 in cases where his firm’s legal costs in the matter would exceed $2,000.00, for obtaining his employment in each HDB conveyancing matter that would be referred to him by the said Chia Heng Huat or the said Chia Heng Huat’s real estate agents. (c)        Fourth Charge: That the respondent is guilty of grossly improper conduct in the discharge of his professional duty within the meaning of s.83(2)(e) of the Legal Profession Act (Cap.161, 2001 Rev Ed) in that, on 20 January 2004, at a meeting with Mohamed Husain s/o Tahirali Thaker at Mos Burger at Toa Payoh HDB Hub he did attempt to procure his employment in respect of HDB conveyancing matters, by promising to give the said Mohamed Husain s/o Tahirali Thaker a sum of $200.00 within one (1) month of the completion of each HDB property conveyancing matter in cases where his firm’s legal costs in the matter would be $2,000.00, for obtaining his employment in each HDB conveyancing matter that would be referred to him by the said Mohamed Husain s/o Tahirali Thaker. 3          In the interest of completeness, it should be noted that the salient parts of s 83 of the Act read as follows: Power to strike off roll or suspend or censure 83. —(1) All advocates and solicitors shall be subject to the control of the Supreme Court and shall be liable on due cause shown to be struck off the roll or suspended from practice for any period not exceeding 5 years or censured. (2)        Such due cause may be shown by proof that an advocate and solicitor — … (e)        has, directly or indirectly, procuredorattempted to procurethe employment of himself or any advocate and solicitor through or by the instruction of any person to whom any remuneration for obtaining such employment has been given by him or agreed or promised to be so given; … [emphasis added]",
        "The facts": "4          The respondent is an advocate and solicitor of the Supreme Court of Singapore of some 18 years’ standing, having been called to the Bar on 16 March 1988. At all material times, he was a partner in a firm and his practice includes the area of conveyancing law. 5          At this juncture, it would be convenient to highlight that the respondent had admitted without qualification all the facts as set out in the Law Society’s statement of facts dated 4 March 2006, the relevant portions of which state as follows: 3.         On or around 13 July 2004, Goldeneye Investigations & Security Services Pte Ltd (“GISS”) referred information to the Council of the Law Society of Singapore which touched on the conduct of the Respondent. 4.         At the material time, GISS was conducting investigations on law firms, that were believed to be offering monetary incentives to real estate agents for referring Housing Development Board (“HDB”) conveyancing matters to them. GISS had appointed several of their part-time assistant investigators to conduct the investigations. The part time assistant investigators from GISS who had communications with the Respondent were as follows: a.         Chia Heng Huat (“Chia”); b.         Mohamed Husain s/o Tahirali Thaker (“Husain”); and c.         Regina Wong Ming Keat (“Wong”). 9 January 2004 5.         On 9 January 2004, Chia telephoned the Respondent and introduced himself as Jeffry Tan from Coldwell Banker. Chia asked the Respondent what he (Chia) would get for referring clients to the Respondent’s Firm. The Respondent informed Chia that he (Chia) would receive payment in the amount of S$200.00. Chia then asked if the amount would be paid in cash and when such payment would be made. The Respondent replied that payment would be made in cash within one (1) month after completion. The Respondent further informed Chia that he (Chia) could contact the Respondent anytime after the expiry of one (1) month after completion to collect the sum of S$200.00. 14 January 2004 6.         On 14 January 2004, Chia telephoned the Respondent and arranged a meeting with him at 2.10pm at MOS Burger at Toa Payoh HDB Hub. 7.         At the meeting, the Respondent explained the conveyancing process to Chia. Following this explanation, Chia reminded the Respondent of the content of their previous telephone conversation on 9 January 2004 where the Respondent had stated that Chia would receive payment one (1) month after completion. The Respondent informed Chia that the Respondent could try to hand over the money earlier if he (the Respondent) was informed in advance as he (the Respondent) would need at least one week to process the request. The Respondent stated that this was because he would only receive the file, one week after completion. 8.         The Respondent also confirmed that he would pay Chia’s real estate agents an incentive in the amount of S$200.00 in cash. The Respondent informed Chia that: a.         The average legal costs for this type of matter would be approximately S$2,000.00; b.         If the total legal costs amount to S$2,000.00, the Respondent would retain a nett amount of S$1,800.00 and pay S$200.00 to Chia and his real estate agents; and c.         If the total legal costs amounted to more than S$2,000.00, fifty percent (50%) of the excess would be given to Chia and his real estate agents. 9.         The Respondent further stated that, if the legal costs for each matter amounted to a sum less than S$2,000.00, Chia and his real estate agents would get an incentive in the amount of S$200.00. 10.        The Respondent subsequently agreed with Chia that for cases referred by Chia’s real estate agents, the real estate agents would only need to state Chia’s name and fax the case over to the Respondent. 19 January 2004 11.        On 19 January 2004, Husain telephoned the Respondent at his office. Husain introduced himself to the Respondent as Mohd Ali, from PropNex and informed the Respondent of his (Husain’s) intention of introducing clients to the Respondent. Husain then asked the Respondent whether the Respondent paid incentives for cases that were referred to him (the Respondent). The Respondent informed Husain that it would be better if they discussed this issue in person, instead of over the telephone. The Respondent then agreed to meet Husain on 20 January 2004. 20 January 2004 12.        On 20 January 2004, the Respondent met Husain at MOS Burger at Toa Payoh HDB Hub. At the meeting, the Respondent explained the HDB conveyancing procedure to Husain. 13.        Subsequently, the Respondent informed Husain that if the legal costs in this matter amounted to S$2,000.00, Husain would receive payment of a commission in the amount of S$200.00 within one (1) month of the completion of the matter. 14.        At all material times, the Respondent did not have any permission or authority from the Respondent’s Firm to act in the manner as stated in this Statement of Facts.",
        "The Disciplinary Committee hearing and findings": "6          Based on the above facts, a DC was appointed pursuant to s 90 of the Act to hear and investigate the complaints against the respondent on 20 May 2005. 7          As early as 22 August 2005, the respondent, in his defence, admitted to the Law Society’s case and did not deny making the offers as outlined in the original statement of the case dated 10 May 2005, which is substantially the same as the Law Society’s statement of facts dated 4 March 2006 set out above at [5]. Nevertheless, he did go on to plead that he did not subsequently go through with the offers and did not contact the “agents” any further. He also pleaded that he would be putting his mitigation before the DC at the DC hearing. At the pre-trial conference held on 18 December 2005, counsel for the respondent, Mr Cyrus Patel, again informed the DC that the respondent would be pleading guilty and agreed that the attendance of witnesses could be dispensed with. 8          At the hearing before the DC of 4 March 2006, the respondent further confirmed, through his counsel, that he had read and understood the charges and that he understood the nature and consequences of his guilty plea to the three charges. He also admitted without reservation the Law Society’s statement of facts dated 4 March 2006. Not surprisingly, it was held by the DC that the charges brought by the Law Society were made out and the respondent was guilty of the three charges brought against him. The DC then had to determine whether the circumstances warranted a finding under ss 93(1)(b) or 93(1)(c) of the Act,ie, whether while no cause of sufficient gravity for disciplinary action existed, the respondent should be reprimanded or ordered to pay a penalty sufficient and appropriate to the misconduct committed, or whether cause of sufficient gravity for disciplinary action existed (s 93(1)(a) being inapplicable given that the charges were made out). 9          In mitigation, Mr Patel raised the fact that the respondent was the sole breadwinner of the family and that he had no previous antecedents. It was confirmed by the Law Society that there had been no previous complaints touching on the respondent’s professional conduct. It was further highlighted that the respondent had expressed remorse and chose to admit guilt early on. He had not sought to take the DC through two or more days of hearing to argue his way out of the circumstances. Additionally, Mr Patel also strongly urged the DC to take into consideration the following factors: (a)        Other than the initial contacts set out in the statement of facts, the respondent did not follow up with the “agents” and he never pursued the “agents” for work subsequently. (b)        No transaction was actually carried out or consummated under the “arrangement” agreed upon between the respondent and the “agents”. (c)        He had at least five months to pursue or carry out these arrangements, but he never subsequently contacted these “agents”. (d)        He made a bad judgment call but did not consummate the arrangement, he managed to pull himself back from the brink, walk away and revert to the professional standards required of him as an advocate and solicitor. (e)        He had suffered great personal stress, strain and anxiety since the complaint was filed. (f)         He had not made any monetary gain or profit. (g)        It was only a momentary lapse, and did not involve dishonesty or fraud. (h)        Each case should be looked at on its own particular facts and there are strong extenuating circumstances in this case. At the end of the day, Mr Patel submitted that this was a case with sufficient mitigating circumstances to be taken into account as to warrant a finding under s 93(1)(b) of the Act that while no cause of sufficient gravity for disciplinary action existed under s 83, the advocate and solicitor should be reprimanded. 10        Counsel for the Law Society, Mr Shashidran Nathan, on the other hand, did not take any position as to whether a finding should be made under ss 93(1)(b) or 93(1)(c) of the Act. Apart from stating that he had no instructions from the Law Society to seek any deterrent sentence of any sort, counsel left it to the DC to decide on the appropriate course of action or sanction. 11        After due consideration of all the facts and circumstances of the case, the DC observed that the discussions between the respondent and Chia and Husain were not just preliminary contacts without any discussion of any details or specific proposals. The respondent had come up with specific proposals based on the fees he would stand to gain if such referrals were made and even told Chia that his real estate agents needed only to state Chia’s name and fax the cases over to him for them to earn the “incentive” payment. The respondent, in effect, had the plan all worked out. The DC was thus convinced that the respondent had made a directattemptto procure employment by promising or agreeing to give remuneration for such procurement in breach of s 83(2)(e) of the Act, which clearly makes an attempt an offence. The DC also found that whilst it was true that the respondent did not “follow up” with the “agents” who had proposed referring work to him for remuneration, the respondent had not done so only because his partners had advised him not to proceed further on the matter. While the DC did credit the respondent for pleading guilty at an early stage, and accepted that each case had to be treated on its own special set of facts, it was unable to find any extenuating circumstances that would exonerate the respondent from disciplinary action. Consequently, the DC found that cause of sufficient gravity existed for disciplinary action to be taken against the respondent pursuant to s 83 of the Act and the present application was taken out accordingly under s 98 of the Act against the respondent to make absolute an order to show cause.",
        "Our decision": "12There have in fact been a spate of similar cases recently – some of which have already come before Disciplinary Committees, whilst others are still pending. However, this is, to the best of our knowledge, the first case to come before this court. As we shall see, thepublic interestcannot be ignored. However, we also bear in mind the fact that, in fairness to the individual respondent, relevant mitigating factors ought to be taken into account in deciding what sanction ought to be imposed on him. 13        Mr Patel sought to argue that, given the strong mitigating factors, his client ought only to be censured. 14        We are unable to accede to this request. It is true, as we shall elaborate upon below, that there are strong mitigating factors that operated in the respondent’s favour. However, thevery natureof the professional misconduct involved in the present proceedings is serious. It goes not only to the lawyer’s own honour and integrity as viewed on anindividualbasis but also has broadersocietalimplications as well. In the oft-cited words of Yong Pung How CJ, delivering the judgment of the court in the Singapore High Court decision ofLaw Society of Singapore v Ravindra Samuel[1999] 1 SLR 696(at [11]–[12]): … It is not simply a question of punishing the solicitor concerned. A further consideration must be what course should the court take to protect the public and to register its disapproval of the conduct of the solicitor. In the relevant sense, the protection of the public is not confined to the protection of the public against further default by the solicitor in question. It extends also to the protection of the public against similar defaults by other solicitors through the court publicly marking the seriousness of what the instant solicitor has done. The orders made must therefore accord with the seriousness of the default and leave no doubt as to the standards to be observed by other practitioners. In short, the orders made should not only have a punitive, but also a deterrent effect. There are also the interests of the honourable profession to which the solicitor belongs, and those of the courts themselves, to consider. The administration of justice can only proceed on the basis that solicitors can place reliance upon the honesty of the solicitors with whom they deal. The public too must be able to repose confidence in a profession which plays so indispensable a part in the administration of justice. Similarly, the courts of this country must be able to depend on the honesty and integrity of all practitioners appearing before them and to expect that they will maintain the highest standards of personal honesty and integrity in their dealings with the courts. 15        It is not surprising that the observations quoted above have been cited so many times simply because, as this court pointed out inLaw Society of Singapore v Ong Ying Ping[2005] 3 SLR 583(at [63] and [64]): There is, in fact, an inherent, irreducible and non-negotiable public interest in the administration of justice in its multifarious forms(see also generally Tan Yock Lin, “Sentencing for Legal Professional Misconduct” (2000-01) 21 Sing L Rev 62). Should the fabric of the system of justice be torn (worse still, rent apart), the entire fabric of society itself will suffer as a consequence. The public institutions which constitute the foundation of the system of justice (and thisincludes,inter alia,the legal professionand the prisons, both of which were directly and adversely impacted in the present case) constitute not only an extremely important part of the basic structure of society but also simultaneously contribute to the stability and positive growth of that structure itself. All this necessarily entails ensuring that the integrity of the above-mentioned institutions which aid, as pillars, in facilitating the administration of justice is not sullied, tainted or undermined in any way. To this end, any misconduct, such as that perpetrated by the respondent in the present proceedings, can only undermine the system, not merely with regard to the specific situation concerned, but also with regard tothe very integrity as well as perception of the institution itself. [emphasis added in bold italics] 16        The practice of law is not merely a business, although, on a practical level, it is undoubtedly the case that it is simultaneously a form of livelihood. It is also a noble calling that, in the final analysis, serves the public. The legitimacy, therefore, of the profession in the eyes of the public is of the first importance. Professional misconduct, such as that which exists in the context of the present proceedings, undermines this legitimacy. As this court observed inLaw Society of Singapore v Ahmad Khalis bin Abdul Ghani[2006] 4 SLR 308at [81]: … But does the legal profession deal only with the lowest common denominator? Put simply, is a solicitor’sprofessionalismowedonlyto those who have entered into a retainer with him or her? Is the legal profession a place where only economic pragmatism holds sway? This surely cannot be the case. The profession is a noble one – one that exists to serve the ends of justice and fairness. The cynicism that existsvis-à-visthe legal profession (unfortunately, across jurisdictions) is due precisely to the gap between ideal and actuality, especially in the eyes of the public. If the conduct of the “black sheep” in the profession results in the failure to attain the ideal of justice and fairness and, on the contrary, results in the precise opposite, this does not demonstrate the elusiveness of the ideal, still less that it is unattainable. In so far as the practice of the law is concerned, the ideal (of justice and fairness) is the actuality – andvice versa. There ought to be no dichotomy or schism between the two. There will always be a gap between ideal and actuality in the real world caused by those who do not hold fast to the highest standards of professional conduct required of them. But the numbers of such errant lawyers must be kept to the barest minimum possible. In this regard, we are heartened to note that there are lawyers who are to be found on the other end of the spectrum. They demonstrate that the ideal is not only attainable, but (in some instances) actually go beyond it. For example, they extend help to their clients beyond the boundaries of their respective retainers. Some go further: They engage inpro bonolegal work, helping those who would otherwise (for one reason or another) fall between the legal cracks. Such lawyers epitomise what is best and noblest in the profession. It is our hope that an ever-increasing proportion of the profession will be identified along these lines. In this regard, legal ethics starts, as it were, at home. Hence, we hope that the local law schools will inculcate, within their students, not only a passion for legal learning and its application, but also a deep and abiding sense of legal ethics. In this, the mission must be all-encompassing. We have in mind, in particular, not only the institutions which train lawyers for practice but all educational institutions that teach the law. This includes the training of para-legals as well. All these institutions constitute “law schools”, looked at from this broader perspective. Acultureof ethics and service must be developed. It is not an optional extra; it goes to the very heart of the law and of its practice. [emphasis in original] 17However, whilst bearing in mind the overriding considerations embodied in the very real and practical concept of the public interest, we need also to bear in mind the fact that we are also dealing with an individual as well – with not only his reputation and livelihood but also his future and his family. In other words, this court’s task also entails the balancing of interests – here, the rights of the public and that of the respondent, respectively. This is where any relevant mitigating factors become crucial. We turn now to consider them. 18        The relevant mitigating factors have in fact been summarised above (at [9]), and we will therefore not repeat them here. It will suffice to state that the following factors are of particular significance. 19        We note, first, that the respondent did not actually consummate any of the transactions with the so-called “agents”. As Mr Nathan pointed out (in, what we might add, was in the true spirit of fair play that constitutes what is true and noble in the legal profession and which we would like to see more of), the respondent was guilty of an attempt and there had been no completed transaction. Hence, he added, the Law Society did not wish to press for a deterrent sentence. He pointed, further and correctly in our view, to the fact that s83(2)(e) of the Act itself clearly envisages an attempt (as opposed to a wholly consummated transaction). This is epitomised in the words of the provision itself (reproduced at [3] above). 20We note, secondly, that the reason the respondent did not actually consummate any of the abovementioned transactions was not due, in the main at least, to events beyond his control. It was primarily avoluntarydecision. It is true that the respondent had already succumbed to temptation inasmuch as the seeds of possible transactions had already been sown. However, he did not resile from them merely because, for example, he discovered that he was under investigation or (worse still) that the authorities were already at his “doorstep”. On the contrary, being pricked by his conscience, he then proceeded to consult with his partners. He was advised against proceeding with such transactions. He heeded their advice and did not follow through with any of them. As Mr Patel also pointed out, the “partnership” was a loose alliance only, with each individual partner having autonomy over his or her own practice. Hence, the respondent was not legally obliged as such to follow his partners’ advice. 21        We pause here to observe, parenthetically, that John Donne’s famous words that “no man is an island” are of particular relevance in the context of the legal profession. The legal profession is, by its very nature, a community of trained and skilled legal professionals. Hence, whilst individual endeavour and achievement are important, the idea of community ought not to – indeed, cannot – be gainsaid. Indeed, the manifestation of such community in the context of the present proceedings has saved the respondent from actually following through with the transactions concerned. We would like to see lawyers consulting with other lawyers when they are in doubt. Nobody ought to pretend that he or she knows everything – for that is an impossibility. As the old adage goes, pride goes before a fall. It is unfortunate that the respondent did not see fit to consult his partnersbeforehe actually made the prohibited offers to the “agents”. On a more positive note, we hope that there will not only be just more civility within the legal profession itself although that is of course very important as well as desirable; we hope that there will be more camaraderie within the profession. We also hope that there will be a system of mentoring, not merely of pupils but also within the ranks of actual practitioners as well. There is no substitute for experience. Lawyers should not be shy, still less reluctant, to share their experiences with the junior members of the Bar. Further, mere seniority alone does not mean that assistance need not, when appropriate, be sought from junior members of the Bar as well. The very idea of community – here, legal community – entails that advice and assistance will be given in times of need, and, if we are true to ourselves, we will have to admit that, in the nature of things and life itself, we will all require assistance from time to time. In this day and age, selfishness often leads to only short-term gains and even (on occasion) woe whilst, paradoxically, altruism often results in (often unexpected) substantive benefits as well. 22        Returning to the mitigating factors in the present case, we note, thirdly, that the respondent did not attempt to justify himself when faced with the charges levelled against him. As Mr Patel pertinently emphasised, the respondent pleaded guilty to the charges at the first available opportunity. This was surely a factor that was very significant and which we took into account in deciding what sanction ought to be meted out to the respondent in the circumstances. The theme of repentance was present once again and ought to work in the respondent’s favour. 23        It follows, fourthly, from what has been discussed above, that there was clearly no proven dishonesty on the part of the respondent. In the circumstances, this would not, in our view, justify striking the respondent off the roll. In the oft-cited words of Sir Thomas Bingham MR (as he then was) in the English decision ofBolton v Law Society[1994] 1 WLR 512 at 518: Any solicitor who is shown to have discharged his professional duties with anything less than complete integrity, probity and trustworthiness must expect severe sanctions to be imposed upon him … Lapses from the required high standard may, of course,take different forms and be of varying degrees. Themost seriousinvolvesproven dishonesty, whether or notleading to criminal proceedings and criminal penalties. In such cases the tribunal hasalmost invariably, no matter how strong the mitigation advanced for the solicitor, ordered that he be struck off the Roll of Solicitors. Only infrequently, particularly in recent years, has it been willing to order the restoration to the Roll of a solicitor against whomserious dishonestyhad been established, even after a passage of years, and even where the solicitor had made every effort to re-establish himself and redeem his reputation.If a solicitor is not shown to have acted dishonestly, but is shown to have fallen below the required standards of integrity, probity and trustworthiness, his lapse is less serious but it remains very serious indeed in a member of a profession whose reputation depends upon trust. A striking off order will not necessarily follow in such a case, but it may well. The decision whether to strike off or to suspend will often involve a fine and difficult exercise of judgment, to be made by the tribunal as an informed and expert body on all the facts of the case. Only in a very unusual and venial case of this kind would the tribunal be likely to regard as appropriate any order less severe than one of suspension.[emphasis added] 24The principles embodied in the quotation have in fact been applied in the local context in many cases: see, for example, the decisions of this court inLaw Society of Singapore v Ravindra Samuel([14]supraat [14]);Law Society of Singapore v Lau See-Jin Jeffrey[1999] 2 SLR 215at [39]; and (most recently)Law Society of Singapore v Vardan Vasantha Lakshmi[2006] SGHC 185at [43]. 25        Mr Patel also argued that the respondent was the sole breadwinner. His wife, who had been working with him in his firm, had ceased work. They also have three young children. Further, the respondent had voluntarily ceased practice as from August this year after the decision of the DC had been released. Whilst we sympathise with the respondent, we do not think that this particular factor can be taken into account in mitigation of any sanction that might be imposed on him. As this court observed inLaw Society of Singapore v Ong Ying Ping([15]supraat [85]–[86]): It was also submitted that the respondent was the sole breadwinner of his family which included two young children. While we sympathise with him, we could not, for that reason alone, indulge in undue leniency. In the words of Sir Thomas Bingham MR inBolton v Law Society[[1994] 1 WLR 512] at 519: [I]t can never be an objection to an order of suspension in an appropriate case that the solicitor may be unable to re-establish his practice when the period of suspension is past. If that proves, or appears likely, to be so the consequence for the individual and his family may be deeply unfortunate and unintended.But it does not make suspension the wrong order if it is otherwise right. The reputation of the profession is more important than the fortunes of any individual member. Membership of a profession brings many benefits, but that is a part of the price.[emphasis added] The learned Master of the Rolls proceeded to observe a little later in his judgment thus (ibid): At the end of a period of suspension a solicitor is able to seek employment, or seek to re-establish himself in partnership, perhaps subject to such conditions as the Law Society see fit to attach to his practising certificate. But that puts him in quite a different position from a solicitor who has been struck off, who cannot practise at all as a solicitor unless or until he is restored to the Roll. 26Finally, both Mr Patel and Mr Nathan dealt with two previous decisions of this court which dealt with professional misconduct of a similar nature to that involved in the present proceedings. 27        The first,Law Society of Singapore v Lau See-Jin Jeffrey([24]supra), related to a situation where this court held that a “service fee” payable under an agreement entered into between the lawyer concerned and the complainant was, in effect, a commission payable by the lawyer to the complainant for the complainant successfully procuring his (the lawyer’s) employment as a developer’s solicitor in respect of a commercial project in China. In the circumstances, the lawyer was found to be in breach of s 83(2)(e) of the Act and was suspended from practice for a period of five years. This court observed (at [40]) that the lawyer, whilst not acting dishonestly, “had fallen short of the integrity and impartiality which are to be expected of a solicitor”. It is also significant to note that the lawyer concerned sought to vigorously defend the charge levelled against him, despite the objective facts that plainly demonstrated that the so-called “service fee” provided for in the agreement was in reality a commission which was prohibited under s 83(2)(e) of the Act. We also note that the lawyer in that case had agreed to pay the complainant 30% of his proposed legal fees. This is in stark contrast to the approach adopted by the respondent in the present proceedings where, as already noted, he pleaded guilty to the charges concerned at the first available opportunity and never followed through on any of the proposed transactions. 28        The second case,Law Society of Singapore v Lee Cheong Hoh[2001] 2 SLR 80, concerned a situation in which the lawyer paid an employee gratification or commission for having procured the employment of legal business for himself as well as his firm. The employee concerned was in fact hired specifically to do work relating to motor repairers’ claims against third parties, and his terms of employment included an entitlement to 10% of all professional fees collected by the firm in respect of such claims. The employee was in fact the only one to be paid on such a basis. This court found, based on the objective evidence, that the 10% payment was, in effect, payment in the nature of a commission or gratification which fell afoul of ss 83(2)(d) and 83(2)(e) of the Act. Chao Hick Tin JA, who delivered the grounds of judgment of the court, observed thus (at [46]): Comparing the position in the present case with that inLau See-Jin Jeffrey, the difference lies in the fact that the person to whom Lee had paid a gratification/commission was an employee, and that inLau See-Jin Jeffreythe payment was agreed to be made to a third party. Furthermore, the commission which was agreed to be paid inLau See-Jin Jeffreywas 30%, a much higher percentage than in this case. Therefore, the misconduct in the earlier case could be considered to be graver. But this was not to say that a mere censure against Lee would suffice. The misconduct of Lee remained serious. A clear message must be conveyed to the profession as a whole that such unprofessional and unethical conduct could not be condoned. It also undermined the integrity and dignity of the profession. Therefore, we considered that it warranted a period of suspension. Three years was what we felt would fit the wrongdoing. 29Once again, the facts inLaw Society of Singapore v Lee Cheong Hohcan be distinguished from those that existed in the present proceedings. As inLaw Society of Singapore v Lau See-Jin Jeffrey([24]supra), the lawyer inLaw Society of Singapore v Lee Cheong Hohvigorously contested the charges levelled against him despite the clear objective facts to the contrary. It bears emphasising, once again, that the respondent in the present proceedings pleaded guilty to the charges concerned at the first available opportunity and never followed through on any of the proposed transactions. His conduct throughout, whilst not excusable, was, however, quite different from that of the lawyers inLaw Society of Singapore v Lau See-Jin JeffreyandLaw Society of Singapore v Lee Cheong Hoh.",
        "Conclusion": "30Balancing the overriding public interest considerations with what mitigating factors that could legitimately be taken into account in favour of the respondent, we made the show cause order absolute and suspended the respondent from practice for six months, and ordered that he bear the costs of the proceedings both before this court as well as in the tribunal below. 31        We should add, however, that there were strong mitigating factors in the present case. If they had not been present, we would have been compelled to impose an even more severe sanction on the respondent."
    }
}