{
    "case_title": "Spandeck Engineering (S) Pte Ltd v Defence Science & Technology Agency",
    "ncitation": "[2006] SGHC 229",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "1          This case involves a dispute concerning a building contract.  The plaintiff, Spandeck Engineering (S) Pte Ltd, was successful in a tender exercise called by the Government of Singapore (“the Employer”) and was awarded a contract dated 24 June 1999 (“the Contract”) at the lump sum price of $31.78m (“the contract price”).  The Contract was to redevelop a medical facility (described as a medical group) in Nee Soon Army Camp (“the project”) for the Ministry of Defence (“Mindef”) consisting of two blocks. The Contract (see 1AB219) was preceded by a letter of award from Mindef to the plaintiff dated 26 May 1999 (see 1AB208) advising that the construction period would be 19 months commencing on 15 June 1999.  The contractual completion date would therefore be 14 January 2001.  The plaintiff was required to, and did, furnish a performance bond equivalent to 5% (viz$1,589,000) of the contract price to Mindef on behalf of the Employer. 2          The defendant, Defence Science & Technology Agency (“DSTA”), was formerly known as Land & Estate Organisation when it was a division of Mindef, before it was constituted under the Defence Science and Technology Agency Act (Cap 75A) on 15 March 2000.  The defendant was appointed as the superintending officer (“the SO”) of the project by the Employer.  Under the terms of the Contract, the SO was responsible for the administration and supervision of the project.  In particular, the SO was responsible forinter aliacertifying interim payments in respect of the plaintiff’s works under the project. 3          The architects who were appointed for the project were RDC Architects Pte Ltd (“RDC”), the structural engineers were TY Lin (SEA) Pte Ltd (“TY Lin”), the mechanical & electrical engineers were Parsons Brinckerhoff Consultants Pte Ltd (“Parsons”) while the quantity surveyors were KPK Quantity Surveyors (1995) Pte Ltd (“KPK”). 4          On 7 July 1999, Mindef advised the plaintiff that Quek Kheng Song and Huang Siong Hui were appointed the SO and SO’s Representative, respectively, with Peh Chew Seng as the alternate SO’s Representative in the absence of the SO’s Representative (see 1AB596-597).  The letter added: The following persons have been appointed to assist the SO’s Representative in the administration of the Contract: Mr Ang Tok Teng                                                     Project Officer Mr Huang Siong Hui/Mr Tan Shao Yen                   Project Architect Mr Ng Kay Beng                                        Civil/Structural Engineer Ms Janet Ng                                         M&E Engineering (Parsons) Mr Soundararajah/Mr Loh Boon Theng                 Quantity Surveyor The SO’s Representative is authorised to issue the SO Instructions involving variations and to act on behalf of the SO on all matters relating to the Contract. In an emergency or in other exceptional circumstances where it is not practical to seek the prior written instruction of the SO’s Representative, the Contractor shall comply with the instructions. Pursuant to clause 2.5 and clause 19.2 of the Public Sector Standard Conditions of Contract for Construction Works and further to item G of the particular conditions to the Public Sector Conditions of Contract for Construction Works, you shall response (sic) within the following time frame: Clause 2.5 – confirm in writing within seven (7) days of receiving oral SO Instruction; Clause 19.2 – notify in writing within fourteen (14) days of receiving written SO Instruction if it constitutes a variation; and To notify the SO’s Representative in writing with estimated cost (substantiate with approximate quantity and rates) within 14 days of occurrence of event that you deem it is a variation and request the SO Instruction to be instructed. All letters pertaining to claims shall be copied to the Project QS. You are reminded that the conditions listed above are conditions precedent to claims and no payment shall be made for variation works completed when no SO Instruction is issued. You are to submit a monthly status report on variation claims (refer to attached sample) to the SO’s Representative and copy to the Project QS with each progress claim.” 5          Hence, RDC, KPK, TY Lin and Parsons (collectively referred to as “the consultants”) were appointed by the defendant to assist the SO Quek Kheng Song (“Quek”), the SO’s Representative Huang Siong Hui and the alternate SO’s Representative Peh Chew Seng in the administration of the Contract. 6          Quek (DW5) was at the material time an officer (now a Programme Manager) of the defendant while Peh Chew Seng and Ang Tok Teng were employees of the Employer.  Huang Siong Hui and Tan Shao Yen (“Tan”) were from RDC, Ng Kay Beng was from TY Lin, Janet Ng was from Parsons while Soundararajah and Loh Boon Theng were from KPK.  The Contract contained the following clause (1AB220): 3. The following documents shall be deemed to form and be read and construed as part of this Agreement,viz:- (1) The Employer’s Letter of Acceptance; (2) The said Tender; (3) The Conditions of Contract comprising (a)        the Standard Conditions(PSSCOC); (b)        the Particulars Conditions; and (c)        the Appendix; (4) The Specifications; (5) The Drawings; (6) The Schedule of Rates; and (7) The Addenda NosTWO (2)[original emphasis added] 7          The abbreviations PSSCOC in cl 3(3)(a) above refers to the Public Sector Standard Conditions of Contract.  Clause 1 of the PSSCOC contained definitions and interpretations. The relevant definitions (see 1AB240-242) are listed hereunder: 1.1(c)   “Contract” means the Conditions and Appendix, the Specifications, Drawings, Schedule of Rates (if any), Bills of Quantities (if any),the Tender, Letter of Acceptance, Agreement and such other letters and documents as the parties may expressly identify in writing and agree as forming part of the contract. [emphasis]. 1.1(k)   “Drawings” means the drawings referred to in the Contract including such drawings which have been prepared by the Contractor and accepted by the Superintending Officer pursuant to Clause 6.2 and such other drawings as may from time to time be issued or accepted in writing by the Superintending Officer. 1.1(q)   “Permanent Works” means the works of a permanent nature (including Plant) to be executed in accordance with the Contract. 1.1(y)   “Tender” means the Contractor’s offer to the Employer to design (to the extent provided for by the Contract), execute and complete the Worksfor a lump sum as accepted by the Letter of Acceptance. [emphasis added] 1.1(z)    “Temporary Works” means all works of a temporary nature of every kind (other than Construction Equipment) required or provided in or about the execution of the Works and the remedying of any defects therein. 1.1(ab)  “Works” means the Temporary Works and the Permanent Works, and where the context requires, a phase or part of the Works. 8          In the tender that it submitted, the plaintiff had provided an alternative design proposal (“the alternative proposal”) in addition to the original tender design (“the base tender”).  The alternative proposal involved using pre-cast structures which the plaintiff represented to the consultants (who managed the tender exercise) would result in cost savings of $200,000 and shorten the construction time by two months, in comparison to the base tender.  After reviewing the alternative proposal, the consultants recommended it to the Employer who accepted the recommendation.  Hence, the plaintiff secured the Contract. 9          The plaintiff had initially submitted a Summary of Tender (“the original SOT”) with the base tender. A SOT is essentially a bill of quantities with an itemised breakdown of the price in a lump sum contract.  After the Employer had accepted the plaintiff’s alternative proposal, KPK requested the plaintiff to submit a revised SOT to reflect the change in design.  The plaintiff submitted the first revision to KPK on 24 May 1999.  After further revisions by the plaintiff, the revised SOT and cost breakdown (“CBD”) for the contract price were finalised by KPK with the plaintiff and incorporated into the contract documents in October 1999. (Hereinafter the documents will be referred to as the “contract SOT” and “contract CBD” respectively). 10        The plaintiff duly commenced work under the Contract.  However problems arose in the course of the project.  The defendant complained that the plaintiff’s work was slow and its performance unsatisfactory, that the work on site was uncoordinated and the quality poor.  On its part, in July 2000, the plaintiff alleged that KPK had under-certified its work for the months April to June 2000.  KPK rejected the allegation as unfounded.  Instead, KPK felt that the plaintiff’s progress claims were excessive as they were based on projected amounts for anticipated work that had not been carried out.  KPK further noted that the plaintiff’s progress claims were often not properly substantiated by complete supporting documentation such as delivery orders. 11        On 29 September 2000, the plaintiff submitted a new SOT (“the new SOT”) to KPK addressed to its director Soundararajah.  The plaintiff requested KPK to review and approve the new SOT for future assessment of the plaintiff’s progress claims. 12        KPK felt that the new SOT was nothing more than an attempt by the plaintiff to redistribute the entire costs of the project such that the plaintiff would receive more payment for works done in the earlier stages of the project, in order to alleviate the plaintiff’s then cash-flow problems.  The new SOT was accordingly rejected by KPK. 13        At a meeting held on 16 November 2000 attended by representatives of the plaintiff, the defendant and the consultants to review the plaintiff’s performance, the plaintiff’s chairman Tony Chi (“Chi”) renewed the plaintiff’s request that the defendant accept a revised SOT.  The defendant agreed to assist the plaintiff in two ways: (a)        it would make payments direct to the plaintiff’s sub-contractors and suppliers subject to certain conditions; and (b)        it would consider adjusting the contract SOT subject to KPK’s evaluation of the new SOT to ensure that adequate money was allocated for future works and provided the plaintiff submit a performance bond, equivalent to the amount of money to be reallocated to present works from future works. 14        According to Chi, the defendant’s condition of a second performance bond in addition to that provided under the Contract was not acceptable to the plaintiff.  Consequently, the new SOT was never implemented for payment of the plaintiff’s progress claims.  It was the defendant’s case that the plaintiff voluntarily withdrew the new SOT subsequently.  Ultimately, the plaintiff did not complete the project as the main contractor.  Instead, the project was novated to another contractor Neo Corporation Pte Ltd (“Neo Corp”) by an agreement dated 16 July 2001 (“the novation agreement”) signed by the plaintiff, the Employer and Neo Corp.  The last interim payment certificate issued by RDC prior to the novation agreement was interim certificate no. 23.  The defendant’s payments to the plaintiff on certificate nos. 23 and 24 as well as on the earlier certificate no. 22, were the subject matter of the plaintiff’s claim herein.",
        "The pleadings": "15        In its re-re-amended statement of claim, the plaintiff alleged that the defendant was negligent in its administration of the Contract.  The plaintiff alleged that despite its forwarding to KPK the new SOT on 1 February 2001 and despite the fact that the plaintiff’s works reflected in certificate nos. 22 to 24 were under the alternative proposal, the defendant continued to apply the contract SOT, which served only as a guide, to its progress claims in certificate nos. 22 to 24. 16        In the alternative, the plaintiff alleged that the defendant failed to accept the new SOT even though the works carried out by the plaintiff represented variation works (“VO works”) under cl 19 of the PSSCOC. 17        The plaintiff contended that the defendant failed to adhere to the payment regime set out under cl 32 of the PSSCOC when it under-certified and/or undervalued the plaintiff’s works and when it refused to certify certain permanent works which the plaintiff had carried out. 18        The plaintiff averred that the defendant’s demand for an additional performance bond (see [13] above) was also not in accordance with the PSSCOC; it exceeded the defendant’s powers as SO under the Contract. The plaintiff contended that the demand was so unreasonable as to amount to a repudiation of the Contract. 19        Due to the financial difficulties that it encountered as a consequence of the defendant’s actions set out above, the plaintiff claimed it had no option but to novate the Contract to Neo Corp.  Up to the date of the novation, the defendant had certified the amount of work done by the plaintiff as $16,945,403.90 when the value of work done represented in certificate no. 23 was $19,328,547.31. 20        For the breach of its duty of care owed to the plaintiff, the plaintiff claimed from the defendantinter aliathe following amounts: (a)        $2,234,704.24 being the difference between the sum claimed by the plaintiff using the contract SOT and contract CBD and the amount certified under certificate no. 23; (b)        the defendant’s under-payment of $290,102.25 for a VO; (c)        the plaintiff’s loss of profits from the balance works amounting to $629,994.59; and (d)        the plaintiff’s loss of management fees from a VO for mechanical and engineering works. 21        The defence filed by the defendant essentially denied it was negligent and denied it owed a duty of care to the plaintiff as alleged or at all.",
        "Was a duty of care owed by the defendant to the plaintiff?": "22        At this juncture, I need to determine a preliminary issue – was there a duty of care owed by the defendant to the plaintiff?  If no such duty existed, then the plaintiff’s action can be dismissed outright. 23        The plaintiff’s case against the defendant as pleaded can be summarised as follows: (a)        The defendant, in its capacity as an independent certifier, owed a duty of care to the plaintiff to exercise professional skill and judgment fairly, professionally and independently in the certification of works carried out by the plaintiff; (b)        The defendant breached the duty of care to the plaintiff byinter aliarefusing to certify permanent works which had actually been carried out by the plaintiff, whilst at the same time, under-valuing and/or under-certifying the plaintiff’s works and delaying payment of the certified amounts for the plaintiff, often taking longer than the stipulated time in the Contract; (c)        As a result of, arising from and/or in connection with the defendant’s breaches, the plaintiff had suffered damage, loss and expense; and/or (d)        The plaintiff had no further or other remedy, contractual or otherwise, against the defendant or any other party to recover damages due to the plaintiff. 24        The defendant’s main defences were: (a)        It was not liable to the plaintiff in negligence as the defendant did not owe any duty of care to the plaintiff; (b)        Even if the defendant owed a duty of care, the defendant had not breached the duty of care and caused the alleged losses and damages claimed by the plaintiff; (c)        The defendant had delegated the task of assessing and certifying payments to the consultants. They were independent consultants and the defendant was not liable for their actions; and (d)        In any event, the loss and damage claimed by the plaintiff was too remote and unforeseeable. 25        The plaintiff also submitted that the defendant was in breach of its duty of care to the plaintiff when it failed, refused and/or neglected to adopt the new SOT and/or CBD that would accurately represent the actual work done by the plaintiff.  In its reply to the defence, the plaintiff contended that the defendant owed a duty of care to the plaintiff regardless of the defendant’s engagement of the consultants who were not independent but acted on the defendant’s instructions. 26        The plaintiff relied for its supposition on the House of Lords decision inJunior Books Ltd v Veitchi Co Ltd[1983] 1 AC 520 (“Junior Books”) where it was held that there was a requisite degree of proximity between the defendants and plaintiffs by virtue of a number of factors including the defendants’ knowledge of the plaintiffs’ requirements, the plaintiffs’ reliance on the defendants’ expertise, the defendants’ knowledge that the plaintiffs relied on their skills and experience and the fact that the relationship between the parties was as close as it could be, short of actual privity of contract, and held that in those circumstances a duty of care existed. 27        The plaintiff further submitted that the Court of Appeal inRSP Architects Planners & Engineers v Ocean Front Pte Ltd (“Ocean Front”)[1996] 1 SLR 113adopted the position taken inJunior Books, when it held that the relevant proximity was established between the developers and the management corporation in that case. 28        The plaintiff added that the Court of Appeal in another similar caseRSP Architects Planners & Engineers (Raglan Squire & Partners FE) v Management Corporation Strata Title Plan No 1075(“Eastern Lagoon”)[1999] 2 SLR 449extended liability for pure economic loss from a management corporation-developer relationship to the management corporation-building consultant relationship. 29        In short, the plaintiff’s case was that it depended on the defendant to accurately value and certify the plaintiff’s works.  The defendant therefore could not have been exonerated from liability towards the plaintiff for its negligence. 30        The defendant on the other hand relied on the UK appellate court’s decision inPacific Associates Inc v Baxter(“Pacific Associates”) [1989] 2 All ER 159 to argue to the contrary.  There, the consultant engineer was retained by the employer to supervise the contract works. The contractor made claims for additional payments which were rejected by the engineer. The contractor sued the engineer on the grounds that he was negligent in rejecting its claims. The issue was whether the engineer owed a duty of care to the contractor.  The English Court of Appeal held: Where an engineer was employed or retained by a person, such as a building owner, to oversee the work of a contractor in circumstances where theengineer was under a duty to the employer to exercise care and skill in overseeing the contractor’s workand was liable to the employer if the employer was sued by the contractor for economic loss which the contractor had suffered as a the result of the engineer’s negligence and where there wasno direct contractual relationship between the contractor and the engineer or any assumption by the engineer of direct responsibility to the contractor for economic loss caused to the latter, the engineer owed no duty of care directly to the contractorcoterminous with the contractor’s rights against the employer. Accordingly, since there was no direct contractual relationship between the contractor and the engineer and sincethe contractor was entitled under its contract with the employer to claim the additional payments for hard materials from the employer, the engineer owed no duty of care to the contractor.” [emphasis added] 31        The defendant also cited a Hong Kong decision,Leon Engineering & Construction Co Ltd v KA Duk Investment Co Ltd47 BLR 139, that followedPacific Associates.  The issue there was whether the architect owed any duty of care to the contractor in considering claims and issuing certificates under the contract.  The Court held: Where there isadequate machinery under the contract between the employer and the contractor to enforce the contractor’s rightsthereunder and there is no good reason at tender stage to suppose that such rights of machinery would not together provide the contractor with an adequate remedy, then, in general, a certifying architect or engineer does not owe to the contractor a duty in tort co-terminous with the obligation in contract owed to the contractor by the employer [emphasis added]. 32        The defendant   further referred to the Australian position as highlighted inJohn Holland Construction and Engineering Limited v Majorca Products and Anor(2000) 16 Const LJ No 2 114.  There, the Supreme Court of Victoria consideredPacific Associatesand held: [T]hat, having regard to the contractual right of the contractor to dispute and seek revision of the decisions of the architect in his certificates, there was no reliance by the contractor or assumption of responsibility by the architect which would justify granting a tortuous obligation on the certifier of the kind alleged by the contractor. 33        The defendant argued that Woo Bih Li JC’s decision inHong Huat Development Co (Pte) Ltd v Hiap Hong & Company Pte Ltd(Originating Motion No 12 of 1999, unreported) (“Hong Huat”) was not binding and the following observations which he made (at [191]-[195]) were obiter: 191       However, the position in Singapore is different. For example, inRSP Architects Planners & Engineers v Ocean Front Pte Ltd[1996] 1 SLR 113, the Court of Appeal decided that a developer does owe a duty of care to a Management Corporation to avoid pure economic loss. The Court of Appeal found that there was a sufficient degree of proximity between the developer and the management corporation in view of various factors. One of the factors was that the developer knew or ought to have known that negligence in the construction of the common property would have to be made good by the management corporation. 192       InRSP Architects Planners & Engineers (Raglan Squire & Partners FE) v Management Corporation Strata Title Plan No 1075 & Anor[1999] 2 SLR 449, the Court of Appeal also decided that architects owe a duty of care to a Management Corporation to avoid pure economic loss. Here, the Court of Appeal found that the architects knew that the management corporation would depend on the architects’ care and skill. The element of reliance by the management corporation on the architects was present. 193       I think that a strong argument can be made that an architect/certifier does owe a duty of care not only to the owner but also to the contractor to avoid pure economic loss.An architect must know that both intend to rely on his fairness as well as his skill and judgment as a certifier, as was mentioned inJones v St John’s CollegeLR 6 QB and cited inKempster, (see paragraph 92 above). See also the judgment of Bowen LJ inJackson v Barry Railway Co(1893) 1 Ch 238 at p.247 which was cited with approval by the Court of Appeal inNelson Carlton Constructionat p.150 and 153.The architect must also know that if he is negligent in issuing certificates he might cause loss to one of these parties. 194       On the other hand, it may be argued that because an architect as certifier is often considered as exercising a quasi-arbitral or quasi-judicial function, he should owe no duty of care to the contractor when he exercises that function. 195       I need say no more on this point as it is not necessary for me to decide whether an architect, as certifier, owes a duty of care to the contractor. [emphasis added] 34        Next, the defendants referred toMan B&W Diesel S E Asia Pte Ltd v PT Bumi International Tankers(“PT Bumi”)[2004] 2 SLR 300.The Court of Appeal there recognised that the case involved special circumstances as there was a contract between Malaysian Shipyard and Engineering Sdn Bhd (“MSE”) and the respondent, PT Bumi International Tankers (“Bumi”), containing a limited warranty and several limitation clauses.  However, Bumi did not have a direct contractual relationship with the appellant, Man B&W Diesel S E Asia Pte Ltd (“MBS”), or the appellant’s UK parent company, Mirrlees Blackstone Ltd (“MBUK”).  It was held that by entering into the main contract with MSE on such limited terms, Bumi committed itself to looking to MSE for redress. As far as Bumi was concerned, it had relied on MSE alone.  To then infer a duty of care on MBS and MBUK would run counter to the specific arrangement that Bumi had chosen to make with MSE.  The Court also observed thatOcean FrontandEastern Lagoonwere cases special on their facts. 35        To show that there was no proximity of relationship between the plaintiff and the defendant that could give rise to a duty of care, the defendant relied onCaparo Industries Plc v Dickman(“Caparo”)[1990] 2 AC 605.It submitted that first, the defendant (as an SO) did not take part in the assessment of the plaintiff’s interim progress claims.  Second, the defendant’s duty was to the Employer and it was clear from the contractual structure between the plaintiff and the Employer that “it would not have been foreseeable that the plaintiff would be unable to have any remedies against the Employer for the SO’s negligent under-certification” (see the defendant’s Opening Statement at [51]). 36        In addition, the defendant argued, it was not just and reasonable to impose a duty of care on the defendant because first, the role of assessing progress payments and issuing certificates of payment had been expressly delegated to KPK and RDC; the defendant did not take part in the assessment of the plaintiff’s interim progress claims.  Second, the imposition of a duty of care on the consultants might expose them to claims from sub-contractors which would result in an unduly onerous obligation on the consultants.  Third, the imposition of a duty of care on the consultants was equivalent to imposing a contractual warranty between the consultants and the contractors. 37        Assumingarguendothat the defendant did owe a duty of care to the plaintiff, the next issue was whether the defendant breached the duty of care.  In this regard the defendant quoted fromJackson & Powell on Professional Negligence(Sweet & Maxwell: London,5thEd, 2002) at [8-131]: As in the case of other professions the standard generally required of an architect in discharging his duties is the reasonable skill, care and diligence of an ordinary competent and skill architect. 38        The defendant submitted that the standard of care expected of the defendant must be objectively determined as a matter of fact by the court (seeChong Yeo & Partners & Anor v Guan Ming Hardware & Engineering Pte Ltd[1997] 2 SLR 729). 39        Even if a duty of care was owed to the plaintiff, the defendant argued it had not breached the duty.  The defendant contended there was no causal link between the alleged breach of duty and the loss suffered because the plaintiff had not shown how the alleged breach led to its financial woes. 40        This argument was buttressed by the affidavit evidence of Tan, the architect from RDC, filed on 13 July 2006 (at [39]): In relation to the Plaintiffs’ progress claim no. 22 and 23 submitted to the Consultants for assessment and certification, there were many letters from the plaintiffs complaining of under-certification. KPK had investigated into these allegations through meeting with the Plaintiffs as well as joint site valuation and they have directly responded in writing to the Plaintiffs thereon.  RDC had also investigated and had conveyed their view in writing to the Plaintiffs that their allegations had no merit. 41        The alleged losses suffered by the plaintiff were pure economic losses. The issue here is whether the facts are marked by “the kind of assumption of responsibility and known reliance” commonly present “in the categories of cases in which a relationship of proximity exists with respect to pure economic loss” (seeEastern Lagoonat [23]). 42        Woo Bih Li JC had commented on the English position inHong Huat(supra [33] at [190]) when he said: Whether that case should be confined to its particular facts or not, I note that the English courts are less inclined to find a duty of care for pure economic loss. See alsoD&F Estates Ltd & Ors v Church Commissions for England & Ors(1989) AC 177 andMurphy v Brentwood District Council(1990) 2 All ER 908. In conclusion therefore, it is possible to sue for pure economic loss caused by negligent acts insomecircumstances in Singapore and Australia.",
        "Is there a duty of care for pure economic loss?": "43        There are two prevailing tests on the issue of pure economic loss and they are to be found in two House of Lords decisions with the earlier one beingAnns v Merton London Borough Council (“Anns”)[1978] AC 728.Lord Wilberforce concluded inAnns(at 751-752) that the duty comprised two stages.  The first stage, derived from the “neighbour” principle inDonoghue v Stevenson(“Donoghue”) [1932] AC 562, was a relationship of proximity or neighbourhood based on foreseeability of harm. The second stage was the consideration of policy factors which precluded such a duty from arising. 44        InOcean Front(supra [27]), the Court of Appeal had appliedJunior Books(which followed theAnnstwo-stage test) to allow recovery in tort for pure economic loss arising from a defective chattel in near-contractual circumstances. The appellate court held that the relationship between the developers and the management corporation gave rise to a sufficient degree of proximity and there existed a duty of care. The management corporation successfully sued for damages arising out of faulty construction of the common property. 45        The Court of Appeal inEastern Lagoon(supra [28]) followed Ocean Front and held that architects owed a duty of care to the management corporation and were liable for the management corporation’s pure economic losses. The main issue inEastern Lagoonwas whetherOcean Fronthad been correctly decided, on which the Court of Appeal had this to say (at [31]): This court inOcean Frontsaid at p 139: ….the approach of the court has been to examine a particular circumstance to determine whether there exists that degree of proximity between the plaintiff and the defendant as would give rise to a duty of care by the latter to the former with respect to the damage sustained by the former. Such proximity is the ‘determinant’ of the duty of care and also the scope of such duty. Next, having found such degree of proximity, the court next considers whether there is any material factor or policy which precludes such duty from arising. Both on principle and on authority, we do not see why such an approach should not be taken in Ocean Front and in a case such as the one before us. 46        Other local cases which followed Ocean Front and applied theAnnstwo-stage test includeManagement Corporation Strata Title Plan No 1938 v Goodview Properties Pte Ltd[2000] 2 SLR 807andManagement Corporation Strata Title Plan No 2297 v Seasons Park Ltd[2005] 2 SLR 613. 47        The second test on a duty of care in relation to pure economic loss is to be found inCaparo(supra[35]). In a much cited passage (at 617–618) from the case, Lord Bridge of Harwich identified three elements that had to be present in order for the court to determine whether a duty of care was owed in any particular circumstance and if so, what its scope was. The three elements were: foreseeability of damage, a relationship of “proximity” or “neighbourhood” existing between the party owing the duty and the party to whom it was owed and lastly, that the situation was one in which the court considered it fair, just and reasonable that the law should impose a duty of a given scope upon the one party for the benefit of the other. 48        Recent Court of Appeal cases which have based the duty of care on theCaparothree-part test includeTV Media Pte Ltd v De Cruz Andrea Heidi and Another Appeal[2004] 3 SLR 543,The \"Sunrise Crane\"[2004] 4 SLR 715andPT Bumi(supra [34]).",
        "Proximity as the determining factor": "49        The Court of Appeal based its decision inOcean Fronton the notion of proximity. InThe \"Sunrise Crane\", the Court of Appeal made the following observations aboutOcean Front(at [65]): [T]he court conducted a wide-ranging review of the authorities both in England (includingCaparo) and in Australia and concluded at 139, [68] and [69] (perL P Thean JA): Whatever language is used the court is basically involved in a delicate balancing exercise in which consideration is given to all the conflicting claims of the plaintiffs and the defendants as viewed in a wider context of society. … But the approach of the court has been to examine a particular circumstance to determine whether there exists that degree of proximity between the plaintiff and the defendant as would give rise to a duty of care by the latter to the former with respect to the damage sustained by the former. Such proximity is the ‘determinant’ of the duty of care and also the scope of such duty. 50        The emphasis on proximity as being the main ingredient in the determination of the duty of care was reiterated inEastern Lagoon. 51        However, foreseeability of harm in itself does not automatically lead to a duty of care (seeSimaan General Contracting Co v Pilkington Glass Ltd (No 2)[1988] QB 758 andPT Bumiat [38]). 52        The Court of Appeal inThe \"Sunrise Crane\"observed (at [66]) that the Court inPT Bumi: [D]rew attention to other factors that had been important inOcean Frontand stated (at [31]): The court also indicated that there was no single rule or set of rules for determining whether a duty of care arises in a particular circumstance, and the scope of that duty. It said that in determining whether a duty of care existed, and the scope of such duty, all the relevant circumstances would have to be examined. This approach was similar to that enunciated by Gibbs CJ inThe Council of the Shire of Sutherland v Heyman(1984-1985) 157 CLR 424 at 441: In deciding whether the necessary relationship exists, and the scope of the duty which it creates, it is necessary for the court to examine closely all the circumstances that throw light on the nature of the relationship between the parties. It would appear therefore that the concept of proximity has been moved slightly from the centre of the exercise and the court has returned to what some may consider a more traditional balancing of the various factors involved without giving one or another pre-eminence. Thus, in deciding whether or not a particular defendant owed a particular plaintiff a duty not to cause the plaintiff the damage he in fact sustained, the court must give due regard to all the circumstances in which the transaction that gave rise to the damage occurred so as to understand the relationship between the parties at the time of the damage.” 53        Further, it was stated by the Court of Appeal inEastern Lagoon(supra [28] at [29]): It is abundantly clear that inOcean Frontthis court did not follow the broad proposition laid down by Lord Wilberforce inAnns. True, the court reached its conclusion by a two-stage process. In principle, there is no objection to such approach. It depends on what is involved and considered in each stage. The court certainly did not apply the first test inAnns. The court’s finding that there was sufficient degree of proximity giving rise to a duty on the part of the developers to avoid the loss sustained by the management corporation was notpremised on foreseeability of damage alone, but on the consideration of other relevant facts. Nor did the court accept Lord Wilberforce’s proposition that in any given situation a single general rule or principle can be applied to determine whether a duty of care arises. [emphasis added] 54        The relevant circumstances in this case were the following: (a)        There was no assumption of direct responsibility by the defendant to the plaintiff for the alleged economic loss suffered by the plaintiff. (b)        There was no direct contractual relationship between the plaintiff as the main contractor and the defendant as the SO. (c)        The plaintiff was entitled under its contract with the Employer to claim the additional payments for variation works from the Employer. Thus, the plaintiff had recourse in contract. (d)        The property in question was an army camp, not a residential development. In this regard,Pacific Associates(supra [30]) is a case very similar to our present.",
        "The scope of the duty of care for pure economic loss": "55        The cases ofOcean FrontandEastern Lagoonwere primarily concerned with economic losses suffered on account of damage to immoveable property which specifically related to management corporations. 56        The court in The Management Corporation Strata Title Plan no 1075 v RSP Architects Planners & Engineers (Raglan Squire & Partners F.E) & Anor (Suit No 1260 of 1995, unreported) extended the duty of care between a developer and a management corporation to that of an architect and a management corporation.  The appeal was dismissed by the Court of Appeal in Eastern Lagoon. 57        Judith Prakash J in Suit No 1260 of 1995 found (at [14]-[16]): 14         I have, therefore, as a first step, to consider the relationship between the defendants as architects for the condominium and the plaintiffs who as its management corporation are statutorily entrusted with the maintenance, upkeep and repair of its common property. Although the two situations are obviously not identical, many of the factors which the Court of Appeal found established a very close relationship between the developers and the management corporation inOcean Frontalso exist in this case. 15         ….The defendants knew or ought to have known that if they were negligent in their design and/or supervision the resulting defects would have to be made good by the management corporation. I would add that it was obviously foreseeable by the defendants that if they were negligent in the design of the condominium, this could result in expensive rectification work and therefore economic loss for either or both the subsidiary proprietors and the management corporation. 16         ….Although the relationship is not as close as that of the developers and the management corporation, it is sufficiently close in my judgment for the requirements of proximity to be satisfied and the duty of care to be imposed. 58        The Court of Appeal inPT Bumi(supra [34]) also commented on the reasoning behind the imposition of a duty of care between a developer and a management corporation (at [30]): In holding that the developer was so liable to the management corporation with whom the developer had no contractual relation, the court examined the scheme of things under the Land Titles (Strata) Act (Cap 158, 1988 Rev Ed), (“the Strata Act”), the role of the management corporation in a development, and the duties of the developer under the Buildings and Common Property (Maintenance and Management) Act (Cap 30, 1985 Rev Ed), (“the Common Property Maintenance Act”), with regard to common property before the establishment of the management corporation. It held that the relationship between the developer and management corporation was “as close as it could be short of actual privity of contract”… 59        However, the Court of Appeal also cautioned against the extension of the duty of care in pure economic loss cases involving management corporations (at [33]-[34]): 33  …It is important to bear in mind that the court was at pains inOcean Frontto explain the special position of the management corporation. The court examined the scheme of things under the Strata Act and the Common Property Maintenance Act and how the management corporation came into being. The court noted that “the management corporation was in fact the creation of the developers”. It was in thisvery special factual matrix that the court came to the view that a remedy in tort should be made available to the management corporation, who would otherwise be without a remedy 34  …While we would not say that for every subsequent case to fall within the scope of the decision inOcean Frontthe facts must be identical or the same,extreme caution must be exercised in extending the Donoghue principle, or the decision in Ocean Front, to new situations, particularly to a scenario which is essentially contractual. [emphasis added] 60        I agree that a duty of care for pure economic loss should not be imposed in circumstances which are entirely contractual in nature.  Further, the courts should be slow in extending the duty of care to cases outside the ambit of property-related disputes involving management corporations. 61        On our facts, there are no exceptional circumstances that justify an extension of the scope of the duty of care found in cases such asOcean FrontandEastern Lagoonto one which involves a government project and where the contractor had a lump sum contract with the employer and was entitled to claim for additional payments for variation works. 62        As forCaparo, it “..must be understood in the context of the statutory requirements of audited accounts of a company” (per LP Thean JA inEastern Lagoonat [37]).  LP Thean JA further observed (at [38]-[39]): 38         In our opinion,Caparohas no application here. As the learned judge held and we agree, RSP were involved in the development of the condominium right from the start. They were engaged by the developers to design and supervise the construction of the condominium including the common property and the developers relied on the exercise of reasonable care and skill of their architects and they (the architects) undertook such responsibilities… 39         With regard to the element of reliance which was regarded by RSP as critical, we think that it was also present in the relationship between the management corporation and the architects… 63        The facts inCaparomay be distinguishable but its principles are all-encompassing and thus, applicable.",
        "Reasonable foreseeability": "64        The definition of ‘reasonable foreseeability’ stems from Lord Atkin’s neighbour principle inDonoghue(supra [43] at 580): The rule that you are to love your neighbour becomes in law, you must not injure your neighbour; and the lawyer’s question, Who is my neighbour? receives a restricted reply. You must take reasonable care to avoid acts or omissions which you can reasonably foresee would be likely to injure your neighbour. [And repeating] Who, then, in law is my neighbour? The answer seems to be—persons who are so closely and directly affected by my act that I ought reasonably to have them in contemplation as being so affected when I am directing my mind to the acts or omissions which are called in question. 65        As the SO, the defendant was responsible and empowered to make assessments and certifications of payment in respect of the plaintiff’s works under the Contract. The defendant sought to argue that it had no part to play in the assessment of the plaintiff’s progress claims.  That argument leads to the determination of the next issue.",
        "The defence of independent contractors": "66        In its Opening Statement at [69], the defendant contended that “[i]n the event that this Honourable Court should decide that the defendant owed a duty of care to the plaintiff, the defendant would submit that [it] is entitled to rely on the “independent contractor” defence”.  It is trite law that a person is not vicariously liable in negligence if he employed an independent contractor and the damage was caused by the negligence of that contractor:Management Corporation Strata Title Plan No 2297 v Seasons Park Ltd(supra [46]). 67        The defendant’s Opening Statement added, “it is evidence that KPK and RDC were independent contractors. The defendants did not at any time interfere with the KPK and/or RDC’s assessment and certifications and there is no evidence to show that the defendant did so”. 68        In his affidavit of evidence-in-chief, Quek had deposed (at [21]): It can be seen from the said exhibited letters and the description of the process hereinabove thatit was the Consultants, and not the Defendants, who collectively carried out the evaluation and certification of the Plaintiffs’ progress claim independently of the Defendants. All the correspondence pertaining to the certification of the progress claims emanated from the Consultants and the Plaintiffs. These letters were regularly copied to the Defendants as it acted as the Employer’s representative. In this way, it was kept informed by the Consultants and the Plaintiffs of the issues which arose between the Plaintiffs and the Consultants. The Defendants have not in any way interfered with the Consultants’ valuation and certification of interim payments. [emphasis added] 69        Quek’s affidavit further stated (at [10]): Mr Huang Siong Hui from RDC was delegated the tasks of administering the Contract, in particular that of certifying interim payments with assistance from Mr Tan Shao Yen (also from RDC) and the other Consultants and he proceeded to do so. 70        Tan was one of the architects who represented RDC in the project. Tan deposed in his affidavit (at [8]): …the assessment and certification of the Plaintiffs’ works was carried out by the Consultants and not by the Defendants. The Defendants had always allowed the Consultants to carry out their task of valuation and certification independently and without interference. 71        The plaintiff’s Opening Statement on the other hand asserted that the defendant cannot hide behind the veil of its purported independent contractors. 72        Although the consultants were appointed to assist the SO’s Representative in the administration of the Contract, the fact that the defendant delegated its duties to the SO’s Representative did not mean that it was absolved from blame. The duty to make proper certification and assessment of payment fell on the defendant’s shoulders and it remained responsible for the acts of the SO’s Representative and the consultants. 73        Clause 2 of the PSSCOC related to the SO and SO’s Representative.  The relevant definitions are listed as follows: 2.1        Superintending Officer’s Authority The authority of the Superintending Officer shall be that stated in or necessarily to be implied from the Contract. Any limitations on the authority of the Superintending Officer are set out in the Appendix. Except as expressly stated in the Contract, the Superintending Officer shall have no authority to relieve the Contractor of any of his obligations under the Contract. Superintending Officer’s Authority to Delegate The Superintending Officer may from time to time delegate to the Superintending Officer’s Representative any of the duties or functions vested in the Superintending Officer other than those listed in the Appendix pursuant to Clause 2.1 and he may at any time revoke such delegation. Any such delegation or revocation shall be in writing and shall not take effect until a copy of such delegation and/or revocation has been delivered to the Contractor. Any act done by the Superintending Officer’s Representative in accordance with such delegation shall have the same effect as though it had been done by the Superintending Officer… [emphasis added] …………………………….. 2.4 Appointment of Assistants The Superintending Officer or the Superintending Officer’s Representative may appoint in writing any number of persons to assist the Superintending Officer’s Representative in the carrying out of his duties under Clause 2.2. The Contractor shall be notified in writing of the names, duties and authority (if any) of such assistants. Such assistants shall have no authority to issue any instructions to the Contractor save insofar as such instructions may be necessary to enable them to carry out their duties and to secure that the Plant, materials, goods or work are in accordance with the Contract. 2.5 Instructions by Superintending Officer Instructions given by the Superintending Officer shall be in writing. 74        Clause 2.3 of the PSSCOC provided: “Any act done by the Superintending Officer’s Representative in accordance with such delegation shall have the same effect as though it had been done by the Superintending Officer.” In the course of cross-examination, Quek agreed that any duties that were carried out by the SO’s representatives, pursuant to delegation by the defendant would be deemed to have been done by the defendant.[note: 1]Although the duties of the SO were non-delegable and the SO was ultimately still responsible for the acts of the SO’s Representative and the consultants, this caveat does not change my view that there was no duty of care owed by the defendant as SO to the plaintiff as the main contractor of the project.  There was no assumption of direct responsibility by the defendant to the plaintiff for the alleged economic loss suffered.  The SO was employed by the Employer.  If the SO owed anyone a duty, it was to the Employer, a submission in the defendant’s Closing Submissions at [50] which I accept. 75        In any event, the plaintiff could have claimed for loss and expense under cl 22 of the PSSCOC which reads: 22         CLAIMS FOR LOSS AND EXPENSE 22.1      Reasons for Loss and Expense The Contractor shall be entitled to recover as Loss and Expense sustained or incurred by him and for which he would not be reimbursed by any other provision of the Contract, all loss, expense, costs or damages of whatsoever nature… 76        More significantly, cl 34 of the PSSCOC which also forms part of the Contract between the Employer and the plaintiff, provides for arbitration as “an available remedy for any disputes including any alleged under-certification by the SO under the contract”.  The relevant parts of cl 34 of the PSSCOC read: SETTLEMENT OF DISPUTES Reference to the Superintending Officer (1) If a dispute or difference of whatsoever kind shall arise between the Employer or the Superintending Officer or the Superintending Officer’s Representative and the Contractor in connection with or arising out of the Contract or the execution of the Works…it shall in the first place be referred by either party in writing to the Superintending Officer for his decision… … Reference to Arbitration (1) If either the Employer or Contractor is dissatisfied with the decision of the Superintending Officer made pursuant to Clause 34.1 hereof…then the Employer or the Contractor may…give notice to the other party with a copy for information to the Superintending Officer of his intention to refer the decision or the dispute of difference that had not been decided to an arbitrator… Strangely enough, the defendant did not use the arbitration clause in cl 34 to apply for a stay of proceedings after the plaintiff commenced this suit, presumably because the plaintiff’s claim was framed in tort, not in contract. 77        In the light of the factual matrix of this case, I do not think that the economic loss allegedly sustained by the plaintiff was foreseeable by a person in the position of the defendant.  The plaintiff should look to the Employer to seek redress under the Contract if it suffered any economic loss.  In this regard, I find that the plaintiff had other avenues in the form of cll 22 and 34 of the PSSCOC to claim for payment or settle disputes arising from the contract SOT, which it did not use.",
        "Proximity": "78        Deane J inSutherland Shire Council v Heyman(1985) 60 ALR 1 commenting on the definition of ‘proximity’ said (at 55): It involves the notion of nearness or closeness and embraces physical proximity (in the sense of space and time) between the person or property of the plaintiff and the person or property of the defendant, circumstantial proximity such as an overriding relationship of employer and employee or of a professional man and his client and what may (perhaps loosely) be referred to as causal proximity in the sense of the closeness or directness of the causal connection or relationship between the particular act or course of conduct and the loss or injury sustained. It may reflect an assumption by one party of a responsibility to take care to avoid or prevent injury, loss or damage to the person or property of another or reliance by one party upon such care being taken by the other in circumstances where the other party knew or ought to have known of that reliance. Both the identity and the relative importance of the factors which are determinative of an issue of proximity are likely to vary in different categories of case. 79        I find that there was the requisite physical proximity between the plaintiff and the defendant in the sense that they would often be present at site – the plaintiff working as the main contractor and the defendant carrying out site inspections.  Also, while there was no direct contractual relationship between the plaintiff and defendant, circumstantial proximity existed by virtue of the fact that the defendant was the appointed SO for the Contract.  However, there was no causal proximity between the plaintiff and the defendant as there was no assumption of direct responsibility by the defendant to the plaintiff for the alleged economic loss suffered by the latter.",
        "Just, fair and reasonable": "80        Although I am of the view that the first and second stages of reasonable foreseeability and proximity respectively have not been satisfied, for the sake of completeness, I will examine whether it would be just, fair and reasonable in all the circumstances to impose on the defendant a duty of care towards the plaintiff. 81        It cannot be disputed that SOs are part and parcel of the construction industry – they are tasked with administering the contract on their employers’ behalf.  On the facts of this case, I do not think that it is just, fair and reasonable to impose a duty of care on the defendant as the SO, particularly as the connection between the SO and the main contractor seems to be somewhat tenuous. 82        Consequently, theCaparothree-prong test has not been satisfied and there was no duty of care owed by the defendant to the plaintiff.",
        "Application of the Anns two-stage test": "83        TheAnnstwo-stage test, although followed inOcean FrontandEastern Lagoon, has been heavily criticised.  InEastern Lagoon[note: 2](supra [28]) LP Thean JA said (at [19]) Hence, the criticisms directed at Lord Wilberforce’s two-stage test were firstly, that a single general principle cannot be applied in determining the duty of care and its scope and secondly, that the test at the first stage confined the determinant of the existence of a duty of care and its scope to foreseeability of damage alone. 84        Chao Hick Tin JA in his judgment on behalf of the majority inThe “Sunrise Crane” (supra [48]) said (at [81]): Whilst I have largely used theCaparotest earlier, I believe the same result would have been arrived at by applying the two-stage test derived fromOcean Front. 85        Judith Prakash J in Suit No 1260 of 1995 (supra [56]) had observed (at [17]): The next step in the analysis is to consider whether there is any policy reason to negative the duty of care. The first question, as put by Justice Thean, is whether this would result in imposing liability in an indeterminate amount for an indeterminate time to an indeterminate class. For the same reasons as His Honour enumerated in theOcean Frontcase, this question must be answered in the negative ie the amount recoverable is determinate, the class of persons is definable and the time span is not indeterminate because of the provisions of the Limitation Act (Cap 163). As for the second question relating to the objection that recovery for economic loss would result in an indefinitely transmissible warranty, this is not applicable since, under the scheme of the relevant legislation, until termination of the strata subdivision plan, the management corporation will always be the person having responsibility for the common property. 86        TheAnnstwo-stage test necessitates a determination of the following issues: (a)        Was the relationship between the plaintiff (the main contractor) and the defendant (the SO) sufficiently proximate to give rise to a duty of care? (b)        If so, would liability be imposed on an indeterminate amount for an indeterminate time to an indeterminate class? 87        It is evident that the first stage has not been met because the important element of foreseeability was absent and this element forms part of the concept of “proximity” in the two-stage test (seeThe “Sunrise Crane”at [81]). 88        Even if the first stage of the test was satisfied, the second stage would not be fulfilled due to the presence of policy reasons indicating why a duty of care should not be imposed in the circumstances of this case.  The amount recoverable is determinate. The time period is determinate (see s 6 of the Limitation Act Cap 163, 1996 Rev Ed).  However, the class of persons liable to be sued by the main contractor is indeterminate.  To find a duty of care between the SO and the main contractor in this scenario would be to open the floodgates not only to claims against other categories of third parties who are not privy to the contract between the employer and the main contractor (e.g. the SO’s Representative, the alternate SO’s Representative and the consultants employed to assist the SO’s Representative), but also to claims in non-residential property cases not related specifically to management corporations. 89        As a result of the open-endedness of such liability, no duty of care should be imposed here. 90        Further the plaintiff entered into a lump sum contract with the Employer and it was within its rights to make contractual claims for variation works done. There is no justification for this court to extend theDonoghueprinciple and create an additional recourse for the plaintiff in economic tort.  Our courts have made it clear that in instances of pure economic loss, a duty of care is found in exceptional and special circumstances involving usually the management corporations of residential developments. 91        Further, courts are usually reluctant to interfere in the contractual arrangements of parties. The plaintiff should adhere to its side of the bargain.  I will repeat the warning bell sounded by the Court of Appeal inPT Bumi(at [34]): …extreme caution must be exercised in extending theDonoghueprinciple, or the decision inOcean Front, to new situations, particularly to a scenario which is essentially contractual. 92        Having reviewed all the relevant authorities in some detail, I am of the view that the defendant did not owe a duty of care to the plaintiff. I see no justification in imposing such a tortious obligation on the defendant.  Even if the defendant did owe a duty to the plaintiff, I find that the evidence adduced at the trial was against the plaintiff.",
        "Was the Contract SOT binding on the parties?": "93        I turn now to consider the main issues that arose from the evidence adduced at the trial. 94        As stated earlier (see [8] above) the plaintiff had offered the Employer (which accepted) as part of its original tender, an alternative pre-cast design for the project, which would supposedly result in a total cost savings of approximately S$200,000. 95        Chi had deposed in his affidavit (at [8]): In view of the alternative precast design, the Plaintiffs requested for a revision of the original Summary of Tender (the “Original SOT”), as the claim format and/or cost breakdown provided by the Defendants when assessing and/or certifying the Plaintiffs’ works, adopted under the Original SOT, did not accurately reflect the scope of and actual value of work carried out by the Plaintiffs pursuant to the terms of the Contract. In particular, there were mistakes in the Original SOT such that the works that the Defendants required the Plaintiffs to carry out were not reflected in the Original SOT and/or the works set out in the Original SOT were no longer required to be carried out by the Plaintiffs. 96        In its Opening Statement, the plaintiff asserted “that at no point in time was any revised summary of tender and/or cost breakdown, as alleged by the defendant, incorporated into the contract and/or applied by the defendant in the valuation and/or certification of the plaintiff’s works”.  The plaintiff added that “in failing, neglecting and/or refusing to apply the claim format and/or cost breakdown under cl 32 of the PSSCOC, the defendant failed to, neglected and/or refused to recognise and properly account of the quantities and costs involved in the alternative structural design”. 97        Quek’s affidavit said (at [13]-[14]): 13         …The alternative tender was accepted primarily because of the Plaintiffs’ representation that the construction time would be reduced. In view of this, KPK requested the Plaintiffs to submit a revised Summary of Tender (“SOT”) to reflect the change of the design…a copy of the Plaintiffs’ letter dated 24 May 1999 to KPK which enclosed its initial revised SOT [Quek’s affidavit at 62-65]. 14.        After further revision by the Plaintiffs, the SOT and cost breakdown (“CBD”) were finalised by KPK with the Plaintiffs. The SOT and CBD were then duly endorsed by the Plaintiffs and incorporated into the Contract… 98        He added (at [26]): …a SOT for the Contract was submitted by the Plaintiffs at the tender stage for the base tender. A revised SOT which reflected the Plaintiffs’ alternative tender was later submitted by the Plaintiffs and subsequently incorporated into the Contract replacing the base tender SOT. 99        Ng Suh Lian[note: 3](“Ng”), an Associate Director of KPK, was  at the material time assisting her superior Soundararajah[note: 4]as a quantity surveyor in this project. In her affidavit filed on 13 July 2006, Ng stated (at [7]): To my best recollection, the SOT and CBD were finally agreed upon sometime in September 1999…and this was then duly incorporated into the documents forming the contract made between the Project employer and the Plaintiffs. 100      I would also refer to Tan’s affidavit (at [12]): The whole intent as provided in the “Notes to Costs Breakdown” which was incorporated in the Contract was that the CBD and SOT cannot be changed unless the Employer agreed. 101      The Contract was signed on 24 June 1999.  The contract SOT which took into account the alternative design was finalised and incorporated into the Contract on 30 September 1999 (see 1AB292).  Chi admitted in cross-examination[5]that the contract SOT was meant for the alternative design and that it was incorporated into the full contract in September/October 1999.  Consequently, the allegation in the plaintiff’s Opening Statement at [55] and in Chi’s written testimony (para 9 of his affidavit) that the contract SOT was for guidance only is incorrect.",
        "Was the contract SOT only a guide as the plaintiff contended?": "102      The relevant parts in the Notes for the SOT (see 1AB-291) read: 1.         Description of the works involved in this contract as described in the Summary of Tender are for theguidanceof the Contractor only. … 5          Notwithstanding that the Summary of Tender is described in various items, thelump sum pricequoted in the Form of Tender shall be the sum for the execution and completion of the whole of the Works comprised in this Contract (whether described therein or not but are necessary for the completion of the whole Works) as specified therein and as shown in thedrawings. 6          The Contractor shall priceall itemsin this Summary of Tender reasonably. Items with no price or “NA” or “-” are deemed to be priced in other items. If in the opinion of the Employer, the Contractor has priced any particular item unreasonably, the Employer reserves the right to adjust the price of the items to that which in his opinion should be reasonable. [emphasis as in original in bold underline and emphasis added in italics] 103      The relevant parts in the Notes for the CBD (see 1AB-296) state: 1          The contractor shall provide cost breakdown for all the works listed herein. 2          These breakdownshallbe used as a guide for progress payment. However, where in the opinion of the SO, the amount of any item has been unevenly distributed among the elements, he may at his discretion make payments based on his own breakdowns but without changing the overall amount of the item in question. The decision of the SO on this matter shall be final. 3          The SO reserve the right for a further cost breakdowns to be submitted by the contractor during the contract period and used a guide for progress payment… [emphasis added] 104      In its re-re-amended statement of claim, the plaintiff pleaded that “[t]he description of the works and the payment terms set out in the original SOT were for guidance of the parties only.  Clause 32 of the PSSCOC provided that progress payments and the final account were to be determined,inter alia, on the value of work actually carried out at the site”.  I should point out that what I refer to as the contract SOT was what the plaintiff referred to as the “original” SOT in its pleadings and in the evidence (written and oral) of its witnesses. 105      The plaintiff’s expert witness, Sandy Avianto[note: 6](“Avianto”) who is a quantity surveyor had stated in his report (at [9]): …the SOT is merely for guidance for progress payments only. The SOT does not in fact have any contractual implications, and the defendants should have assessed the amount of payment due to the plaintiffs based on actual works completed and materials delivered on site. 106      Although Chi accepted that the contract SOT and CBD formed part of the contract documents[note: 7]and that the word “shall” [in the Notes for the CBD] meant “must”, he maintained the contract SOT was to be used only as a guide[note: 8].  Chi said that the parties did not need an SOT or CBD to value interim payments as the plaintiff based its progress claims on the actual work executed on site, in accordance with cl 32 of the PSSCOC.  However, in the course of cross-examination, Chi admitted that the contract SOT and CBD were contractual in nature and that they must be used for interim payments.[note: 9] 107      KPK on the other hand had used the contract SOT to value the works done and if there were no particular elements inside that document, then (according to Chi) no payment would be made for those elements claimed by the plaintiff.[note: 10] 108      In its Opening Statement (at [88]), the defendant said: ..[t]he Consultants had throughout valued the Plaintiffs’ works based on the terms of the Contract. It is submitted that on a proper construction of the Contract, in particular, the Notes of Cost Breakdown (1AB-296), the said Contract SOT and CBDmustbe used to help the Consultants to value and certify interim payments. If another CBD is proposed to be used, this would represent a change in the Contract and parties thereto must agree before it can be implemented. This is especially so when the Contract SOT was one whichalready reflected the plaintiffs’ alternative design.” [emphasis added] 109      Tan had deposed in his affidavit (at [22]): ….The Consultants had all along valued and certified interim payments to the Plaintiffs in accordance to the terms of the Contract. The Consultants adhered to the breakdown of prices found in the Contract SOT which formed part of the Contract. Unless the relevant contractual terms were varied by the parties, the Consultants were not in a position to deviate from the prescribed method of assessment found in the Contract. As alluded to above, the SOT attached to the Contract was a revised one which reflected the alternative tender. 110      It was the common testimony of Quek, Tan and Soundararajah that between the commencement of the project and August 2000, the plaintiff had at no time raised any allegation that an incorrect SOT was applied by the consultants in their assessment of the progress claims. 111      I agree with the plaintiff that the Notes to the contract SOT and contract CBD provided that the contract SOT and contract CBD were to be used as guides only. However, the question that arises is:  What other yardstick could the parties have used to measure the value of works done if not by the contract SOT? 112      Soundararajah had testified that KPK and the other consultants had throughout valued the plaintiff’s works based on the terms of the Contract. The consultants adhered to the breakdown of prices found in the contract SOT and the contract CBD which formed part of the Contract. 113      Consequently, the parties did not use any other yardstick to assess the value of the plaintiff’s      works. The plaintiff’s course of conduct was telling and it led the defendant and the consultants to believe that they could certify the value of works done pursuant to the contract SOT. 114      Chi himself admitted in his affidavit (at [13]) that “…the defendants had already applied the Original SOT to progress certificate 1 to 21….”.  Those certificates were all valued according to the contract SOT without any objections from the plaintiff until it encountered cash-flow problems.  The entire contract period was for 19 months commencing from 15 June 1999.  It was more than a year later on 29 September 2000 (according to Soundararajah’s affidavit at [18]), that the plaintiffs submitted a new SOT to KPK and requested KPK to review and approve it for use in future assessment of the plaintiff’s progress claims. 115      Clearly, the plaintiff was estopped from insisting on a different method of valuation for its progress claims. 116   The Court of Appeal inSingapore Island Country Club v Hilborne[1997] 1 SLR 248held (at [27]): The criteria for establishing an estoppel by convention are: (i)         that there must be a course of dealing between the two parties in a contractual relationship; (ii)        that the course of dealing must be such that both parties must have proceeded on the basis of an agreed interpretation of the contract; and (iii)       that it must be unjust to allow one party to go back on the agreed interpretation. 117      Without doubt, the three conditions amounting to an estoppel by convention are met in our case.  The plaintiff cannot now argue that the contract SOT was merely a guide. 118      Even if the contract SOT was only to be used as a guideline, the fact remains that both parties relied on the document without any complaints from the plaintiff for a good 15 months of the Contract period of 19 months.",
        "Did the plaintiff under-price the Contract?": "119      The project was a lump sum contract between the plaintiff and the Employer for $31.78m.  The ‘Preliminaries for the Whole Project’ provides certain definitions and interpretation (see 1AB-585): 1.1  Definitions (d)Contract Sum The Contract Sum shall be deemed to have included the construction and completion of the whole of the works embodied in this Contract to the satisfaction of the S.O.  The Contractor shall be deemed to have provided for all price fluctuations pertaining to labour, material and overhead which may arise during the continuance of this Contract, and no claim shall be entertained by the Employer in this respect. 120      There was a letter dated 9 June 1999 from the plaintiff to the defendant which reads (see 1AB-214): We refer to the above mentioned project and here with submit the adjustment made to the Contract Sum for your attention. The details of the breakdown as follows: a)         Deducted S$80,000.00 and S$500,000.00 from the Demolition and Furniture respectively because of over allocations. b)         Cost of brick work and plastering amount of S$585,856.00 deducted from the Architectural works and added to the Structural works since the brick walls converted to the precast concrete wall panels. c)         The sum of S$380,000.00 added to the Indoor Range in Blk 715 becauseduring the tender stage we have not quoted for it.” [emphasis added] 121      In his written testimony, Soundararajah deposed that “the plaintiff proceeded to submit a [new] SOT under cover of a letter dated 8 December 2000 to KPK for its evaluation”.  KPK had prepared an assessment report and Soundararajah concluded in his affidavit (at [30]) that: 30.1. The Plaintiffs’ contract sum of $31.78 million was extremely “competitive” being10% cheaperthan the second lowest tender submitted. That worked out to a price difference of nearly $3.19 million. A high degree of cost control was required to ensure costs were kept within the contract price… … 30.3. Of the Building and External Works, KPK’s findings were that prices allocated by the Plaintiffs to Block 1, Block 4-6 and “Other Building” were consistent with their assessments. However, Block 2 wasunderpricedby $381,761.64 and Block 3 wasunderpricedby $441,076.59.  Only the External Works were possibly overpriced by $245,813.37. [emphasis added] 122      In [44] of his same affidavit, Soundararajah said: Another complaint of the Plaintiffs appeared to be that there was a discrepancy between the costs it incurred to carry out the works and the amount certified by the Consultants for the same. As pointed out by RDC in point 14.0 of its said letter to the plaintiffs [see the letter dated 27 April 2001 from RDC to the plaintiffs at 1AB-4342-4344], this arose because the plaintiffs had under-priced the Contract. The Consultants could only assess the works in accordance with clause 32 of the Contract and not according to the actual costs incurred by the Plaintiffs to carry out the works. Payments to the Plaintiffs under the Contract was not based on a reimbursement basis. 123      The real reason for the plaintiff’s request that the defendant and/or the consultants apply the new SOT to value the plaintiff’s works appears in Quek’s affidavit (at [30]) where he revealed: At the Management Meeting No. 2 held on 16 November 2000 in the morning and a further meeting held in the afternoon, the Plaintiffs’ Dr Tony Chi repeated their request for the SOT to be revised so as to alleviate its cash-flow problems. According to him, cash-flow problems arose because the plaintiffs hadmisallocated the pricesin the SOT which was incorporated in the Contract. [emphasis added] 124      My suspicion that the plaintiff had under-priced the Contract is reinforced by a letter dated 3 January 2001(see 1AB-3598) from the plaintiff to RDC which said: We wish to express our concern over the past progress payments valuation had resulted our heavy burden into financing the above mentioned project. Although KPK Quantity Surveyor had shown their helpful assistance buttheir real problem to the whole valuation being the incorrect breakdown prices appeared in the contract documents. We had highlighted the same and is already more than 3 months the relocation of BQ prices to allow more reasonable cash flow in order to smoothen the construction progress received no clear sign at all. We see no conflict as this is a lump sum contract and for the interest of all parties, re-adjustment of contract breakdown costs is needed. As this present stage, the more we completed, the less money we had received… 125      In cross-examination, Chi admitted that from the time the Employer was interested in the alternative tender to the time the Contract was agreed and the contract SOT incorporated therewith, he had many opportunities to make the necessary amendments to the contract SOT and change the big figures[note: 11]but he did not. 126      My view that the plaintiff’s financial woes resulted from under-pricing of the Contract is further supported by Tan’s affidavit where he said (at [13]): The Contract was awarded to the Plaintiffs at the contract price of $31,780,000.00. This was the lowest tender received for the Project. In its eagerness to secure the Contract, the plaintiff committed a fatal costing error with consequential cash-flow problems.  I would venture to add that even if the plaintiff had managed to complete the Contract, it would probably have lost money on the project.  Consequently, even if there was a duty of care owed by the defendant to the plaintiff, the evidence strongly suggests that the cause of the plaintiff’s economic loss was due to its under-pricing.  So long as the amounts certified by the consultants were based on the contract SOT, the plaintiff would never be able to recoup the sums it expended, simply because its pricing was too low as against its own construction cost. 127      I would add that the consultants were never able to certify the full value of work done because they too were constrained by the lump sum price of $31.78m. If the full value of the contract was under-priced, by a logical extension, the certification would have to be continuously undervalued within the confines of that contract value. 128      This can be seen from Soundararajah’s answers during cross-examination:[note: 12] Q:         …I asked you when you assessed the work done, is there ever a possibility for your assessed value to be higher than the amount provided by the contractor in the summary of tender? I am just asking you for possibility. A:         On the value of work done, no. Q:         Okay. Because your assessment will always be done as a percentage of the total amount allocated for that particular item; correct? A:         Yes. 129      The plaintiff’s claims were consistently higher than KPK’s figures (see 1AB-4329).  When Chi was cross-examined, he was unable to produce evidence to substantiate the plaintiff’s higher claims. I cite as an example the frame of Block 701 of the army camp.  Chi was asked if he had “any evidence showing that it should be as your claim $1,345,902.70 and not what KPK certify, which is $1,305,000”.[note: 13]He could not point to any document in the agreed bundle to evidence the amount of work that the plaintiff allegedly carried out.[note: 14]He admitted that “there was a problem due to [his] errors in pricing the BQ”.[note: 15] 130      I should also add that Soundararajah’s testimony (see his affidavit at [44]) that the plaintiff had under-priced the Contract was never challenged.   Based on the rule inBrowne v Dunn(1893) 6 R 67 that “[a]ny matter upon which it is proposed to contradict the evidence-in-chief given by the witness must normally be put to him so that he may have an opportunity of explaining the contradiction, and failure to do this may be held to imply acceptance of the evidence-in-chief, I find that the plaintiff had indeed under-priced the Contract at the contract price (see alsoArts Niche Cyber Distribution Pte Ltd v PP[1999] 4 SLR 111at [48]). 131      I agree that the rule [inBrowne v Dunn] does not mean that every point should be put to a witness, but if the point sought to be made goes to the heart of the matter, then it should be put to the witnessOng Jane Rebecca v Lim Lie Hoa and OthersCivil Appeal No 58 of 2004, unreported at [70]). 132      The plaintiff realised it was stuck with the Contract which was under-priced; hence it attempted to come up with ways to get round the contract price by requesting for the contract SOT to be substituted by the new SOT and that the contract CBD be adjusted.",
        "Was the plaintiff’s allegation that the defendant under-certified for certificate nos. 22 and 23 substantiated?": "133      As stated earlier (see [114] above) from certificate nos. 1 to 21, the plaintiff did not object to the consultants’ use of the contract SOT to measure the value of work done.  The plaintiff first alleged under-certification in certificate nos. 22 and 23.  It complained that the consultants should have adopted cl 32 of the PSSCOC, instead of the contract SOT, for assessment of the work done. 134      Clause 32 of the PSSCOC deals with progress payments and final account. The relevant portions read (see 1AB-282): 32.1 Monthly Statements The Contractor shall submit to the Superintending Officer, at monthly intervals, a statement in such form as the Superintending Officer may from time to time prescribe… 32.2 Monthly Payments (1) Within 21 days of receiving a statement duly submitted pursuant to Clause 32.1, the Superintending Officer shall certify to the Employer (with a copy to the Contractor) the amounts to which the Contractor is in his opinion entitled in respect of each of the amounts in the statement, subject to the deductions of any sums which have been or may become due and payable by the Contractor to the Employer under the Contract or otherwise.",
        "Certificate no. 22": "135      The alleged under-certification for certificate no. 22 was tabulated in the defendant’s closing submissions at Tab A.  KPK certificationPlaintiffs’ claimDifference% differencebetween plaintiffs’claim and KPK’svaluationWork done$13,453,430.79$13,613,510.60$160,080.001.2%Material on site$3,460,002.75$4,220,488.77$760,486.0018.0%VO$106,699.80$271,440.55$164,740.7560.6%Total$17,020,133.34$18,105,439.92$1,085,306.706% Work done 136      On the plaintiff’s allegation that KPK failed to value the safety supervision work, the defendant submitted that Chi accepted that the plaintiff was paid for the site safety supervisor over the contract period of 19 months[note: 16]as evidenced in the following extracts from the notes of evidence: Q:         So you are saying that they have been paid 19 months? A:         Yes. Q:         But they have not been paid for the further five months? A:         Right. Q:         And the reason why you say that is? A:         Because extension, a lot of VO. 137      The defendant therefore argued there was no basis for this preliminary claim because first, the plaintiff’s default caused the delay in completion and second, the plaintiff could have but did not claim for loss and expense under cl 22 of the PSSCOC. 138      On the issue of M&E works, the consultants had certified the work at $903,423.42 although the plaintiffs claimed $509,833.00. Therefore, the plaintiff had been paid $393,490.00 more than its claim as the consultants decided to value the actual work carried out even though the plaintiff did not include the same in its progress claim.  Chi had also admitted to an over-certification of $393,490.00 by reason of the M&E works for certificate no. 22,[note: 17]as can be seen from the following notes of evidence: Q: So actually we are paying you more than what you actually claim, by a figure of $393,490.00? A: This is direct payment. Materials on site 139      With regard to the materials on site, the plaintiff’s claim was higher than KPK’s certification by $760,486.00.  The defendant’s submissions (at [76]) pointed out that the plaintiff over-claimed by $380,024.08 for M&E materials on site.  The plaintiff’s sub-contractors and Parsons carried out a joint site inspection of the materials on site with Alan Quah [the plaintiff’s project manager] who agreed to the site assessment.  Parsons had also explained that the ABB fans and damper were not shown to them for the valuation exercise nor were there delivery orders evidencing their delivery to site. 140      The defendant submitted that the plaintiff failed to account for $535,412.69 which was converted to work done and for $29,435.58 for materials expended such as cement. This failure to account was admitted by Chi in cross-examination:[note: 18] Q:         …I’m asking you, this table didn’t enter into account the fact that materials had been used for construction purposes that month? Court:   And should be deducted. Mr Tai: And should be deducted. A:         Yes. 141      It was the defendant’s further submission at [79] that “[t]he plaintiffs also had no evidence to show why the figures used by KPK were not correct or what should be the proper figures to be deducted”.",
        "Certificate no. 23": "142      The alleged under-certification for certificate no. 23 was tabulated in the defendant’s closing submissions as follows:  KPKcertificationPlaintiffs’ claimDifference% differencebetween plaintiffs’claim and KPK’svaluationWork done$13,877,160.77$15,197,311.67$1,320,151.108.6%Material on site$2,918,553.33$3,678,100.63$759,547.6020.6%VO$149,689.80$304,695.84$155,006.0050.8%Total$16,945,403.90$19,180,108.14$2,234,704.7011.6% Work done 143      The plaintiff alleged that the under-certification for work done was a result of the use of the contract SOT.   Earlier (see [114] above), I had found that the plaintiff raised no objections to KPK’s use of the same until after certificate no. 21 was issued.  In addition, I had further found (see [126] above) that the alleged under-certification was a result of the plaintiff’s initial under-pricing of the Contract.  Consequently, I again reject the plaintiff’s complaint that the work done under certificate no. 23 was under-certified. Materials on site 144      The plaintiff had claimed $290,000.00 for materials on site (see 1AB-9725).  However, Chi was unable to produce any evidence or delivery order to show that the “ABB fan and fire damper were worth $290,000”.[note: 19] 145      The plaintiff did not substantiate their various claims with delivery orders. This can be seen in a letter dated 1 August 2000 from RDC to the plaintiff which reads (see 1AB-2942-2943): 3   An amount of approximately S$100,000.00 for roof truss which was delivered from 15 June 2000 to 7 July 2000. These delivery orders were not submitted in your claim submission. 146      Another letter from RDC to the plaintiff dated 15 September 2000 (see 1AB-3041) highlighted the problem the consultants encountered in processing the plaintiff’s progress claims: Nee Soon Camp – Progress Payment We refer to the issue of progress payment. You have alleged that your claim for progress payment had been “undervalued” by KPK QS… It was found that KPK QS’s valuation was consistent and fundamentally contractual, e.g. based on Schedule of Rates. No doubt there were grey areas that required clarification…such grey areas arose due changes in construction proposed (to use hollow core slab in lieu of cast in-situ slab) by your Company. For the record, we have exercised due fairness and agreed that for concrete top-up areas that serve as finished level, e.g. those level with flush floor trunking in Block 1 and storage area in Block 2, they would be considered as screed and be paid accordingly. On the other hand, we found that the basis of your progress claim had not been consistent, e.g.:- Your payment submissions of each month are based on anticipated projected amounts for works done and materials on site, instead of completed works and material already delivered to site. These claims were also found to be excessive. Your submission of the delivery orders for all materials delivered to site are consistently incomplete. Your progress payment claim includes variation works where S.O. instructions are yet to be issued. 147      Tan had referred to the same problem in his affidavit (at [26]): RDC found that the Plaintiffs’ progress claims were excessive as they were based on projected amounts for anticipated work which had not been carried out. Furthermore, they included claims for variation works for which RDC had not issued the instructions.  RDC also noted that the Plaintiffs’ progress claims were often not properly substantiated with a complete set of supporting documents such as delivery orders. 148      Another problem was that some of the materials on site went missing.  In his affidavit (at [18]) Chi said: It is incredulous [sic] for the defendants to take possession of the material which the Plaintiffs delivered on site, and yet certify a negative value for the total materials on site. 149      Quek deposed (at [23]) of his affidavit: The defendants were also informed at about June 2001 from the consultants that materials on site were missing and could not be accounted for. It appeared that the plaintiffs or their sub-contractors were removing these materials from the site. In the defendants’ letter dated 3 July 2001 to the plaintiffs [see Quek’s affidavit at 210-213], they enclosed copies of site memos and correspondences from the Consultants relating to the unauthorised removal of materials and instructed the Plaintiffs to return these materials. This was reinforced by some correspondence between GIB Automation Pte Ltd, who were one of the Plaintiffs’ sub-contractors and the Plaintiffs where they blamed each other for some of the missing equipment [see Quek’s affidavit at 214-219]. These correspondences were copied to the Defendants. Variation orders 150      The variations certified in certificate no. 23 were tabulated at Tab C in the defendant’s closing submissions:  S/NDescriptionSOI No.Plaintiffs’ claimConsultants’ certification11ststructural submission Block 1(2ndstorey) – steel structure &metal canopyNil$25,600.00Nil2Block 2 – addition one civil defenceshelter29$84,750.00$51,000.003To rectify earth sliding at Bath Roadside17$9,000.00$6,899.804Additional guard house and fencingat new guard house10$8,369.74Not VO – paid underExternal Work.5Obstruction of piling works at Block260$24,691.00Not VO – paid underExternal Work.62ndstructural submission & 3rdstructural submissionNil$47,580.82$37,070.007ArchitecturalNil$89,704.28$54,720.00 151      For item 1, Lee Tuck Sung[note: 20](“Lee”), the plaintiff’s project manager, agreed in cross-examination that “because it was not erected on site, there is no basis for Spandeck to claim for it.”[note: 21] 152      For item 2, the defendant pointed out (at [89] of its closing submissions) that KPK certified $51,000 because the civil defence shelter was incomplete and the plaintiff furnished no evidence that the work was completed.  In a letter dated 5 October 1999 (see 1AB-2177) from KPK to the plaintiff, KPK requested the plaintiff to comment on its assessment of this item. There was no response from the plaintiff.[note: 22] 153      As for items 3 to 6, the plaintiff was unable to provide evidence to prove that there was under-valuation.  In regard to item 7, Chi could not explain when questioned, the plaintiff’s basis for claiming 10 per cent for wastage and 20 per cent for profit and attendance”.[note: 23].",
        "The plaintiff’s allegation that $290,000 of VO work was carried out but not claimed because there was no SO’s instruction (“SOI”).": "154      The alleged under-payment for work done without SOI but not within certificate no. 23 was in Chi’s affidavit at p 842 (exhibit CCTT-4).  S/N.Description of itemValue1Block 1 6thfloor$50,000.002Block 1 5thfloor additional civil defence shelter at GL 13$80,000.003Block 1 2ndfloor transfer beam at auditorium hall$44,000.004Block 1 1stfloor auditorium seats$30,000.005Block 2 loading bay design fee$6,000.006Block 3 roof water tank design fee$12,000.007Block 3 9thstorey GL 14 abortive civil defence shelter work$27,102.258Block 3 L shape parapet wall$2,000.009Block 4 redesign fee for extended ramp$2,000.0010TY Lin Variation Order$37,000.00Total$290,102.25 155      For item 1, Chi admitted it had actually been paid under the structural submissions 2 and 3[note: 24]and he agreed that he would not claim if there was no SOI.  He then further conceded that he did not get an SOI for the design work for the item.[note: 25] 156      For item 2, Chi was shown the tender and contract drawings (see 1AB-10752 and 1AB-11093) which showed that this item was part of the original contract work and included in the lump sum price.  Consequently, he conceded that this claim was invalid as can be seen from the following extracts from the notes of evidence: Q:         So, do you accept there is a claim for VO at block 1, fifth storey, which is baseless? A:         It is included in the original contract. Q:         In other words, you have no claim, no valid claim for VO? A         For this particular location. 157      For item 3, Chi contended that the structural drawings showed a column blocking the projection room and the plaintiff had been instructed to remove the column (see NE128 on 25 August 2006).  He added that there was a mistake in the structural drawing.[note: 26]The defendant however referred the court to a contract architectural drawing that showed there was no column at that position[note: 27]and Chi agreed. There appeared to be an inconsistency between the structural and architectural drawings. 158      Clause 4.4 of the PSSCOC states that the onus was on the plaintiff to write to the defendant in the event that the plaintiff identified any ambiguities and/or discrepancies in the contract documents (see 1AB-246); the clause states: Responsibility for Identifying Ambiguities, Discrepancies, etc (1) The Contractor shall forthwith notify the Superintending Officerin writingof any ambiguity, discrepancy, conflict, inconsistency or omission in or between any of the Contract documents that mayat any timebe found… [emphasis added] Chi was unable to provide any evidence to support his claim that he had informed the SO of the discrepancy between the architectural and structural drawings.[note: 28] 159      In relation to item 4, the defendant contended that the plaintiff was aware that it must do precast steps in the auditorium.  Hence, the plaintiff priced the item in and it formed part of, the Contract.  This was supported by Chi’s admission during cross-examination: Q:         So if you priced it in and it is part of the contract -- A:         I agree. 160      Paragraph 5 of the Notes for the CBD states (see 1AB-296): The contractor is deemed to have included and priced for all items of works shown in the drawings and/or specified. 161      The defendant’s closing submissions rightly pointed out that for items 5 and 6, no evidence was produced at the trial to substantiate their validity and quantum. 162      For item 7, the plaintiff’s position was that it built 31 civil defence shelters including one which was only half-completed. Thus, there were 30 completed shelters. The defendant’s stand was that the parties contracted for 30 shelters but two shelters were omitted while one was added therefore totalling 29.[note: 29]Chi however did not agree that KPK had already certified 20 per cent of the structural work for the abortive civil defence shelter.[note: 30] 163      It was the defendant’s submission that no evidence was produced by the plaintiff to support the validity and quantum of items 8 and 9.   As for item 10, the defendant asserted that it was part of the structural submission No. 2 and 3[note: 31]which had been certified by RDC in certificate no. 23 and paid accordingly (in the sum of $37,070). 164      The defendant in its closing submissions (at [108]) contended that the plaintiff’s VO claims were notbona fide.  I agree.",
        "Must there be a SOI before the consultants will certify the works?": "165      In a letter dated 28 November 2000 (see 1AB-3343) from RDC to the plaintiff, it was pointed out: …SOI/ VARIATION MATTERS … In the Architectural SOI/ variation meeting, you were asked repeatedly to highlight any variation works already done but without payment. You confirmed that as of the meeting, there was no significant work already done but without payment. In any case, we have confirmed that should you have completed any variation work, certified as in order by consultant/site staff in accordance with Drawings/ Instructions,even if formal SOI had not been approved, we would communicate with KPK QS to valuate the works and certify payment to you. Therefore, whether or not formal SOI had been issued should not be any hindrance to your progress. Your responsibility is to ensure work executed is in accordance with updated Drawings, Specifications and Contract Documents. [emphasis added] 166      RDC then attached to the above letter a record of RDC’s discussion with the plaintiff on architectural matters which noted the following (see 1AB-3345-3346): RECONFIRMATION OF VARIATION TO CONTRACT 1. RDC confirmed the following: … c. The following SOI not received by SE had been issued, pending formal approval by DSTA… d. Other SOI not received by SE but had been issued, pending formal approval by DSTA: SOI No. 44 to 50.SE to proceed without any regards to these SOI. … 2….As per SE’s request, a set of drawings stamped “For Construction”, deemed as Instruction, issued after 26/6/00 shall be re-issued to SE. … 4. SOI classified by SE as C&S, clarified by RDC/ TYL as Architectural… [emphasis in its original] 167      In the course of his cross-examination, Chi was asked: Whether an SOI has been issued to you or not, if you think that that item of work involves a variation, all right, wouldn’t you have submitted your claim?[note: 32] Chi’s answer was KPK had told the plaintiff that “no SOI, no payment.”[note: 33]He then referred to a letter dated 9 April 2001 (see 1AB-4240) from KPK to the plaintiffs which reads: 2.0        Please be advised certification of payment for variation orders shall be made for approved variation orders by way of SOI. 168      However, it was then drawn to Chi’s attention that in fact variation works without SOI were valued by KPK and that Chi “can’t deny that there is no SOI number for these two items” (see 1AB-4318).[note: 34] 169      It was noted from the documents produced in court that the consultants would proceed to certify the plaintiff’s work at times even when there was no SOI. The plaintiff’s contrary allegation was therefore unfounded. 170      I fully agree with the defendant’s submission that the plaintiff could have compelled and hastened the process for, the issue of SOIs bearing in mind cl 2.5 of the PSSCOC which states (see 1AB-243): 2.5  Instructions by Superintending Officer Instructions given by the Superintending Officer shall be in writing…Provided further that if the Contractor, within 7 days, confirms in writing to the Superintending Officer any oral instruction of the Superintending Officer and such confirmation is not contradicted in writing within 7 days by the Superintending Officer, it shall be deemed to be an instruction of the Superintending Officer… 171      Further, cl 19.2 of the PSSCOC placed the burden on the plaintiff to write to the defendant if it required a variation (see 1AB-265); it states: Power to Order Variations The Superintending Officer may at any time issue an instruction in writing requiring a variation. If or to the extent that an instruction does not states that it requires a variation but the Contractor considers that it does require a variation, the Contractor shall within 14 days from the date of receipt of the instruction notify in writing the Superintending Officer who may, if he thinks fit, within 14 days from the date of receipt of the Contractor’s notification, confirm, modify, rescind or contradict in writing the instruction and the Contractor shall then comply forthwith.",
        "Was the defendant justified in asking for an additional performance bond?": "172      To recapitulate, the plaintiff had submitted their new SOT on 29 September 2000. The defendant then instructed KPK to review the plaintiff’s adjusted breakdown based on the new SOT and on 1 February 2001, KPK issued their version of a new SOT (“KPK’s revised SOT”) adopting a new claim format and/or cost breakdown to apply to the plaintiff’s alternative proposal design. 173      The defendant was willing to accommodate the plaintiff’s request to adjust the cost breakdown in return for a second performance bond as security. At the meeting held on 16 November 2000 where the plaintiff, the defendant and the consultants were present, the points discussed were as follows (see 1AB-3232-3233): 3.00 Payment for Sep 2000 3.01 SE claimed that the payment certification for Sep 2000 by the consultants was late and valued below the actual work done on site. KPK QS clarified that the valuation was completed later than usual due to the fact that materials found on site did not tally with delivery orders submitted by SE. Another round of physical count was conducted to ascertain the material on site. SE claimed that certain material on site was not counted, contributing to the low value. However, it was confirmed that KPK conducted the count in the presence of SE’s representatives. KPK also highlighted that even though the said payment was later than usual, it was still within the payment period as stipulated in the contract. SE was reminded that their QS or other representatives should ensure that the claim and the materials/work done on site was in order to avoid unnecessary delay. … 4.00 Adjustment of Summary of Tender (SOT) 4.01 In rebutting SE’s claim that the valuation is below the fair value, KPK produced a breakdown to illustrate that SE had indeed over-claim in their structural works. The amount claimed by SE under structural works had exceeded the provision under the contract summary of tender (SOT). 4.02 SE claimed that due to the structural re-design, certain architectural elements in the original SOT had been changed to structural elements, e.g. external brickwalls of Blk 3 had been changed to pre-cast concrete wall panels. He claimed that it was therefore not fair to use the original SOT for valuation, and requested DSTA to consider revising the SOT. … 4.05 Assuming SE is able to substantiate their case as per 4.03 or other method, DSTA is prepared to consider the adjustment of SOT, based on the following conditions: a) KPK would evaluate the revised SOT to ensure that adequate money had been allocated for all the unfinished works. b) SE must submit a performance bond equivalent to the amount of money shifted away from the future works. This is to safeguard MINDEF that in case SE is unable to fulfil their contractual obligations, the money for the remaining works is maintained as per original contract. SE[meaning the plaintiff]had no objection to the above conditions for the adjustment of SOT.[emphasis added] 174      It was the plaintiff’s case that the defendant’s demand of a performance bond from the plaintiff to underwrite the additional payment was a breach as it was not a term in the Contract.  This position was repeated in Chi’s affidavit at [14]. 175      Avianto also noted the plaintiff’s argument in his report at [14].  During  cross-examination, Avianto said “[i]f we confirm that we pay more than they should be entitled to get, then the money, the balance of the money have a risk. This you put a request of bond for this balance.”[note: 35]He added that “[b]ecause performance bond already stated is based on the contract, and the contract, I believe the redistribution of summary of tender and cost breakdown won’t change the final contract sum. So, based on that, we don’t need to issue another bond together with changes to SOT.”[note: 36] 176      The plaintiff’s position was that at the meeting between the parties on or about 22 May 2001, the defendant did not accept, agree or acquiesce to KPK’s revised SOT. 177      In response to the plaintiff’s allegation, Quek had deposed in his affidavit (at [36]) that: The Consultants did not apply the proposed new SOT in the certification of works for progress claims no. 22 and 23 simply because the plaintiffs themselves had withdrawn their request to implement the new SOT. 178      Earlier in his affidavit, Quek said (at [28]): On 29 September 2000, the plaintiffs submitted an unsolicited and amended SOT to KPK and requested KPK to review and approve it for use in the future assessment of the Plaintiffs’ progress claims. The intent of the Plaintiffs’ request appeared to be a proposed re-distribution of the costs of the entire contracted works so that the Plaintiffs could receive more payment for works already completed in the initial stages of the Project. 179      Further, Quek’s affidavit showed (at [31]): The Defendants also agreed to consider the Plaintiffs’ said request to adjust the SOT subject to the following conditions: 31.1. KPK shall evaluate the new SOT proposed by the Plaintiffs and ensure that adequate money were allocated for the uncompleted works; and 31.2. the Plaintiffs shall submit a performance bond equivalent to the amount of money which were proposed to be reallocated from uncompleted works to safeguard the employer’s interest. 180      Then at [35], Quek said: [A]t a subsequent meeting held on 10 April 2001 [see Quek’s affidavit at 350-352], the Plaintiffs’ representative Dr Tony Chi said that they would not put up a performance bond at all contrary to what was previously agreed as he alleged that the proposed SOT was based on “future works”. During the said meeting, RDC said that if the proposed SOT was implemented, an extra of about $200,000 would be paid upfront to the plaintiffs in the forthcoming progress payment which represented risk to the employer. That was why a bond was necessary…At the Plaintiffs’ request, the proposed revision of the SOT was abandoned. 181      It was the plaintiff’s case that no performance bond was necessary because the money set aside for future works was merely shifted forward to pay for current works. There was no additional work done and the plaintiff was still bound by the same lump sum contract price. 182      However, I find that the defendant’s request for a performance bond was justified. In this respect, I quote from Quek’s cross-examination:[note: 37] Q: …So according to KPK’s proportionate distribution, if it were applied to the work that the plaintiff had done, it may result in an increase of $200,000 to the plaintiffs, is that correct? A: What I was given to understand is that they actually did the assessment of the payment 21, based on the contractual SOT and based on the new revised SOT. Effectively, there is a difference of 200K. In other words, if the contractor stopped work totally, refused to do anything, they would get 200K coming into the account. 183      The defendant had not acted unreasonably. All it wanted was for the construction of the army camp to be completed within the contract period.  The under-pricing of the Contract was the plaintiff’s own doing; the loss must lie where it falls.  It is not the function of any court to intervene in a contract entered into between two willing parties so as to enable the plaintiff to adjust the contract SOT and/or CBD in order to recoup more than the Contract sum.  The plaintiff must honour its side of the bargain, even if it meant incurring a loss. 184      I would add that the plaintiff’s evidence was wholly unsatisfactory especially that of its main witness Chi.  Despite his impressive academic qualifications, his testimony was at times incoherent and often inconsistent.  He was evasive and did not seem capable of giving a simple “yes” or “no” answer to direct questions asked of him in cross-examination, despite repeated reminders from the court.  Chi was an unreliable witness. 185      As an example of Chi’s lack of credibility, I refer to his allegation that the defendant forced him to novate the project to Neo Corp.  Paragraph 19 of Chi’s affidavit reads: The defendants’ repeated breaches of their obligations caused the plaintiffs almost irreparable financial damages and strain. These led to several meetings with the defendants, where several optionswere put to the plaintiffs. One of the options was to novate the contract to a third party. [emphasis added] 186      The evidence adduced from the documents showed that it was the plaintiff who proposed novating the contract, as can be seen from a letter dated 30 May 2001 (see 1AB-4546) from the defendant to the plaintiff which stated: We refer to the discussion on 24 May 2001 between yourself, DSTA Management, M/s RDC Architect and M/s KPK at DSTA whereyouproposed to novate the contract. [emphasis added] 187      In his affidavit (at [41]), Quek deposed: The plaintiffs, by their own volition, during a meeting on 24 May 2001 and by way of their letter dated 25 May 2001, informed the defendants that they were considering the possibility of novating the contract to another contractor. 188      In [44] of his affidavit, Quek added: …the defendants were not aware of and were not interested in the details of the commercial discussions between the plaintiffs and the contractors whom they intended to novate the contract to. That was strictly between these parties and the defendants were not in the least interested. Their only concern was that a competent contractor would be taking over and to complete the contract. Quek’s testimony was never challenged by the plaintiff. 189      In contrast, the testimony of the defendant’s witnesses, including the consultants, withstood the rigours of cross-examination, particularly that of Quek and Soundararajah.",
        "Conclusion": "190      On a balance of probabilities, the plaintiff had failed to discharge the burden to prove it was owed a duty of care by the defendant.  Even if such a duty existed, the evidence adduced clearly disproved the breach of any such duty by the defendant to the plaintiff. 191      Consequently, I dismiss the plaintiff’s action with costs to the defendant on a standard basis. [note: 1]NE at p 131 on 4 September 2006.[note: 2]However, see Andrew Phang, Cheng Lim San and Gary Chan,Of Precedent, Theory and Practice – The Case for a Return to Anns[2006] SJLS 1where the authors “suggest that there are very persuasive reasons of principle why the “two stage test” inAnnsought to be adopted”: at 37.[note: 3]DW2.[note: 4]DW1.[note: 5]NE at p 24 on 22 August 2006.[note: 6]PW4.[note: 7]NE at p 24 on 22 August 2006.[note: 8]NE at p 40 on 22 August 2006.[note: 9]NE at p 45 on 22 August 2006.[note: 10]NE at pp 35-36 on 22 August 2006.[note: 11]NE at pp 26-28 on 22 August 2006.[note: 12]NE at p 63 on 29 August 2006.[note: 13]NE at p 76 on 22 August 2006.[note: 14]See NE at pp 77-79 on 22 August 2006.[note: 15]NE at p 98 on 24 August 2006.[note: 16]NE at pp 68-69 on 22 August 2006.[note: 17]NE at p 61 on 22 August 2006.[note: 18]NE at p 56 on 22 August 2006.[note: 19]NE at p 59 on 24 August 2006.[note: 20]PW3.[note: 21]NE at p 57 on 28 August 2006.[note: 22]NE at p 105 on 22 August 2006.[note: 23]NE at pp 121-122 on 22 August 2006.[note: 24]NE at p 47 on 24 August 2006.[note: 25]NE at pp 48-49 on 24 August 2006.[note: 26]NE at p 4 on 28 August 2006.[note: 27]NE at p 5 on 28 August 2006.[note: 28]NE at pp 4-7 on 28 August 2006.[note: 29]NE at pp 33-34 on 24 August 2006.[note: 30]NE at p 33 on 24 August 2006.[note: 31]Also see NE at pp 25-28 on 24 August 2006.[note: 32]NE at p 128 on 22 August 2006.[note: 33]NE at p 130 on 22 August 2006.[note: 34]NE at p 132 on 22 August 2006.[note: 35]NE at p 17 on 29 August 2006.[note: 36]NE at p 27 on 29 August 2006.[note: 37]NE at pp 122-123 on 4 September 2006."
    }
}