{
    "case_title": "Go Go Delicacy Pte Ltd v Carona Holdings Pte Ltd and Others",
    "ncitation": "[2007] SGHC 165",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The submissions": "",
        "The defendants’ arguments": "16        Counsel for the defendants referred to s 6 of the Arbitration Act (Cap 10 2002 Rev Ed) (“the Act”) which was the basis of the stay application; it states: Stay of legal proceedings (1)        Where any party to an arbitration agreement institutes any proceedings in any court against any other party to the agreement in respect of any matter which is the subject of the agreement, any party to the agreement may, at any time after appearance and before delivering any pleading or taking any other step in the proceedings, apply to that court to stay the proceedings so far as the proceedings relate to that matter. (2)        The court to which an application has been made in accordance with subsection (1) may, if the court is satisfied that ? (a)        there is no sufficient reason why the matter should not be referred in accordance with the arbitration agreement; and (b)        the applicant was, at the time when the proceedings were commenced, and still remains ready and willing to do all things necessary to the proper conduct of the arbitration, make an order, upon such terms as the court thinks fit, staying the proceedings so far as the proceedings relate to that matter. 17        Quoting from the Court of Appeal’s decision inSamsung Corp v Chinese Chamber Realty Pte Ltd[2004] 1 SLR 382(“Samsung Corp”)in extenso, counsel submitted that a defendant cannot be compelled to file its defence while a stay application was pending. 18        Counsel submitted that if a defendant was to file its defence, it would lose its right to a stay under s 6 of the Act, relying onChong Long Hak Kee Construction Trading Co v IEC Global Pte Ltd[2003] 4 SLR 499(“Chong Long Hak Kee”). 19        Indeed, counsel added, “taking a step” (under s 6(1) of the Act) would have fatal consequences for a stay application, referring to the following extract (at p 472) from Mustill & Boyd’sThe Law and Practice of Commercial Arbitration in England(Butterworths, 2ndEd, 1989): The taking of a step nullifies the jurisdiction of the Court to grant a stay; it is not simply a matter which is to be weighed when the Court exercises its discretion. 20        For the meaning of “a step in the proceedings”, counsel referred to the following extract from para 20.035 ofHalsbury’s Laws of Singaporevol 2 (Lexis Nexis, 2003 Reissue, 2003) (at p 40): There is no definitive rule as to what amounts to a ‘step in the proceedings’. It is generally accepted that any step which affirms the correctness of the proceedings or demonstrates a willingness or intention to defend the substance of the claim in court instead of arbitration may be construed as such. Clear examples of such steps would be filing of a defence on the merits of the claim; … The above extract was cited with approval inChong Long Hak Kee(supra[18]). 21        Reference was also made to the House of Lords decision inFord’s Hotel Company Limited v Bartlett[1896] AC 1 as authority for the proposition that applying for an extension of time to file a defence was a “step in the proceedings”. The court was informed that the House of Lords’ interpretation of a “step in the proceedings” was followed by the Federal Court of Malaysia inSanwell Corp v Trans Resources Corp Sdn Bhd[2002] 2 MLJ 625. 22        Counsel then sought to distinguish the decision of Belinda Ang J inAustralian Timber Products Pte Ltd v Koh Brothers Building & Civil Engineering Contractor (Pte) Ltd[2005] 1 SLR 168(“Australian Timber”) where she held that an application to extend time to serve a defence would not constitute a “step in the proceedings” because such an application would be an act that safeguarded the defendant’s position pending the determination of a stay application. Counsel added thatAustralian Timberwas inconsistent with and directly contradicted the decision inSamsung Corp(supra[17]).",
        "The plaintiff’s arguments": "23        Counsel for the plaintiff not unexpectedly relied heavily (if not totally) onAustralian Timberand distinguishedSamsung Corp. He pointed out that only the first defendant was a party to the Franchise Agreement, not the other four defendants. Consequently, there was no basis for the second to fifth defendants not to have filed their defence collectively or individually by the timeline of 18 April 2007 or by 22 April 2007 in response to the 48 hours notice. 24        Counsel submitted that it was for the court to exercise its discretion whether or not to grant a stay application. At the same time, the defendants should not be allowed to flout the Rules of Court (Cap 322, R5, 2006 Rev Ed) (“Rules of Court 2006”) merely because they had applied for a stay, citing the following extract at [12] fromSamsung Corp: We endorse the views of the judge that generally where the Rules of Court have expressly provided what can or cannot be done in a certain circumstance, it is not for the court to override the clear provision in exercise of its inherent powers. No court should arrogate unto itself a power to act contrary to the Rules. Counsel added that what the defendants should have done but failed to do, was to apply for an extension of time to file their defence pending the outcome of the stay application. 25        I should point out that counsel’s complaint before me that the defendants did not file any affidavit is incorrect. As indicated earlier (supra[10]) the stay application was supported by an affidavit filed by the fifth defendant. I would add that the plaintiff through its director Kheh Kim Chong (who is a cousin of the fifth defendant) also filed an affidavit, to resist the stay application, the nub of which contents was that the plaintiff’s claims against the various defendants were separate and distinct, although they all arose out of the Franchise Agreement.",
        "The decision": "26        One reason I dismissed the Appeal was the fact that a stay of these proceedings was not practical as only the first defendant was a signatory to the Franchise Agreement; therefore only one of the five defendants involved was bound by the arbitration clause therein. A court cannot compel non-parties to an agreement that contains an arbitration clause to arbitrate their dispute merely because one defendant is a party to that agreement. This fact was clearly considered by the AR when he dismissed the stay application (see [11] of his grounds of decision). 27        The arbitration clause in the Franchise Agreement was to be found in cl 23.13. Its wording was quite standard and states: 23.13.1 Any dispute arising out of or in connection with this Agreement including any questions regarding its existence, validity or termination shall be referred to and finally resolved by arbitration in Singapore in accordance with the rules of the Singapore Arbitration Centre for the time being in force which rules are deemed to be incorporated by reference into this clause 23.13.1. 28        The fifth defendant’s affidavit filed in support of the stay application (supra[10]) was short on facts relevant to the court’s consideration whether a stay should be granted. Instead, she deposed to irrelevant factors (at para 7) that a main advantage of having the dispute referred to arbitration was the element of confidentiality, as the first and second defendants were prominent companies which had a good reputation with their customers, suppliers and partners and had never been involved in litigation previously. 29        The fifth defendant then accused the plaintiff of attempting to circumvent the arbitration obligation by including frivolous claims against the second to fifth defendants which were “utterly baseless”. My short comment to this allegation is that if indeed the plaintiff’ claims against the defendants (other than the first defendant) were frivolous, the second to fifth defendants shouldnothave applied for a stay of proceedings (which had no basis as they are non-parties to the Franchise Agreement) but should have applied to strike out the plaintiff’s action against them under Order 18 rule 19 (1) of the Rules of Court 2006. 30        I turn now to the authorities cited by the parties in support of their opposing positions, starting withSamsung Corp. In that case, the Court of Appeal dealt with a situation where the appellant/defendant Samsung Corporation (“Samsung”) had applied for a stay of proceedings after entering an appearance to the respondent/plaintiff’s writ of summons, due to a similar arbitration clause in the Singapore Institute of Architects conditions of contract which governed the parties’ relationship. 31        The plaintiff then applied for summary judgment (with leave granted by an assistant registrar as under the then Rules of Court 1997 (Cap 322, R 5, 1997 Rev Ed), the plaintiff could not apply for Order 14 judgment until after a defence had been filed). The plaintiff’s application for summary judgment and Samsung’s application for a stay were ordered to be heard together by an assistant registrar. Samsung appealed to a judge in chambers who ordered Samsung to file its defence with the caveat that this was not to be construed as a step in the proceedings (this was termed “the compromise order” by the Court of Appeal). 32        The Court of Appeal set aside the compromise order and allowed Samsung’s appeal, holding that no Order 14 application should be brought before Samsung’s stay application was disposed of. 33        InAustralian Timber, Belinda Ang J dealt with a situation similar to this case. The defendant there was the main contractor who had appointed the plaintiff as its subcontractor for construction of a building. The plaintiff sued for its unpaid claim. The defendant applied for a stay of proceedings under s 6 of the Act because of an arbitration clause in the contact that governed the parties’ relationship. The defendant did not serve its defence within the timeline, arguing that it was not required to do so because of the pending stay application. The plaintiff applied and obtained judgment in default of defence. The defendant succeeded in its application to set aside the default judgment whereupon the plaintiff appealed to a judge in chambers in the High Court. 34        In allowing the plaintiff’s appeal, Belinda Ang J held that a pending stay application did not stop time from running for the service of the defence. The onus was upon the defendant to see the duty registrar to bring forward the hearing date of the stay application for immediate hearing as a matter of urgency or, apply for an extension of time to serve the defence pursuant to Order 3 rule 4 of the Rules of Court (Cap 322, R 5, 2004 Rev Ed). Ang J held at [23] that an application to extend time to serve the defence would not constitute a “step in the proceedings” within the meaning of s 6(1) of the Act. 35        I noted that counsel for the defendants mistakenly thought there was only Hobson’s choice available to his clients – (i) file a defence in compliance with the 48 hours notice with the attendant risk that it would amount to taking a “step in the proceedings” and therefore would be fatal to the stay application; (ii) risk having judgment in default of defence being entered against the defendants by not filing any defence. 36        Counsel was incorrect in his surmise. As I informed him, there was a third alternative available to the defendants – the stay application should have included an additional prayer for an order that the defendants not be compelled to file any defence pending the stay application. There was even a fourth alternative the defendants could/should have explored. They could have applied to the duty registrar to bring forward the hearing date of the stay application or applied to postpone the hearing date of the judgment application to a date after the hearing of the stay application. Even if counsel for the defendants disagreed with the decision inAustralian Timber(which he did),these two alternatives would not have done violence to the spirit and effect of the appellate court’s decision inSamsung Corpand would not in my view amount to taking a “step in the proceedings”. 37        Although it was not totally on point, I shall also addressYeoh Poh San v Won Siok Wan[2002] 4 SLR 91(“Yeoh Poh San”) since the case was followed inSamsung Corpand referred to inAustralian Timber. 38        In that case, the Malaysian plaintiffs sued the defendant, who was also a Malaysian, in Singapore but effected service of the writ on the defendant in Malaysia. The defendant entered an appearance to the writ and thereafter applied for the proceedings to be stayed on the ground offorum non conveniens. The stay application was dismissed by the assistant registrar against which decision the defendant appealed to a judge in chambers (“the first appeal”). The due date for filing of the defence expired before the date of the hearing of the first appeal. The plaintiffs applied for judgment in default of defence while the defendant applied for an extension of time to file her defence or, for a stay until final determination of the first appeal. The defendant was granted an extension of time of 14 days by the deputy registrar to file her defence on the undertaking of the plaintiffs’ solicitors not to treat the filing of the defence as a step taken by the defendant in the proceedings, in view of the then pending first appeal. 39        The defendant filed a separate appeal to a judge in chambers (“the second appeal”) against the deputy registrar’s order, seeking an extension of time to file her defence until she had exhausted all avenues of appeal. In allowing the second appeal, Woo Bih Li JC (as he then was), relying onThe Jarguh Sawit[1998] 1 SLR 648, held that where a plaintiff was aware that a defendant had filed an appeal against the refusal to order a stay, he should not insist on the filing of a defence pending the hearing of the appeal. To insist on the filing of a defence was wrong because it would defeat the very purpose of filing an appeal against the refusal to order a stay. This principle applied to an application for a stay on any grounds and was not confined to a challenge based on an absence of jurisdiction. 40        Chao Hick Tin JA who delivered the judgment inSamsung Corpin following Woo JC’s decision inYeoh Poh Sanhad this to say at [7]: It seems to us that as a matter of logic, it makes absolute sense that when the question of stay is put in issue that should first be determined before any further step is taken by either party in the action. In the context of an arbitration clause, it is all the more so as under s 6(1) of the Arbitration Act (Cap 10), it is expressly provided that the party who wants a stay of the court proceedings should apply “after appearance and before delivering any pleading or taking any other step in the proceedings”. Once the stay question is finally determined, then everything else will follow from that. I fully endorse the above comment. 41        As I had said earlier, had the defendants adopted either of the two alternatives I suggested in [36], they would not be in their present predicament. Either one of the two alternatives would not have been inconsistent with the reasoning inSamsung CorporYeoh Poh SanorAustralian Timber. I agreed with the AR that the defendants should have been more proactive than merely relying on the stay application as their reason for not complying with the 48 hours notice. 42        Although I dismissed the Appeal, the defendants were not left without any remedy. As was pointed out by the court below, they could have applied to set aside the default judgment."
    }
}