{
    "case_title": "Public Prosecutor v Lim Ah Liang",
    "ncitation": "[2007] SGHC 34",
    "coram": "V K Rajah J",
    "sections": {
        "The facts": "3   Sometime in late March 2005, the accused commenced working as a freelance masseur for the deceased, who operated a massage business. Apart from massage services, the accused also provided ‘extra’ services such as masturbation, oral sex or anal intercourse to his clients. The accused paid the deceased a commission for all client referrals. 4   Sometime around June 2005, the accused abruptly terminated this arrangement with the deceased when the latter insisted on increasing his commission. However, later in September 2005, the accused re-established contact with the deceased with a view to renegotiating the commission arrangements. At the accused’s suggestion, a meeting was held at the deceased’s flat on 13 September 2005 at about 6.00pm. No others were present at the flat. 5   In the midst of their discussion in the bedroom area of the deceased’s flat, an acrimonious row broke out between the two when the deceased persistently alleged that the accused had worked for another agent. The accused denied this. Refusing to accept the accused’s denial, the deceased procured a knife from the kitchen and pointed the knife menacingly at him. He demanded that the accused confess his “infidelity”. A desperate struggle for the knife ensued. The accused managed to seize the knife and stab the deceased in the chest. The violent struggle eventually spilled into the living room where the accused, upon gaining the upper hand, frenziedly and repeatedly stabbed the deceased on his chest. 6   Despite his grievous predicament, the deceased managed to escape and he ran towards the main door. Remorselessly, the accused pursued him and continued to stab him on his back. The deceased then tried to take refuge in the kitchen but the accused grabbed his shirt. As the deceased desperately tried to free himself, they both lost their balance and fell. The accused recovered his balance and stood up first but the deceased grabbed his legs. Enraged, the accused grabbed a metal frame lying nearby and used it to feverishly hit the deceased’s head repeatedly until the deceased became motionless. It bears emphasis that the only injury sustained by the accused throughout the entire melee was a 1.5cm linear laceration on the last finger of his right hand and a slight 2 cm abrasion on his right elbow. 7   After the incident, the accused washed his hands and changed into fresh clothing obtained from the deceased’s wardrobe. He disposed of his bloodstained clothes and the knife in the rubbish chute. The deceased’s two mobile phones, an electronic safe, a wallet and a set of house keys were stolen by the accused. Cash amounting to S$10, the deceased’s National Registration Identity Card (“NRIC”), credit/debit cards and an ATM card, were removed from the wallet. 8   Sometime between 14 and 16 September 2005, the accused handed over the deceased’s NRIC, credit/debit and ATM cards, the electronic safe, as well as an NRIC belonging to one Lee Yean Shan to one Gu Chen Lin (“Gu”), an acquaintance. Lee Yean Shan had lost her NRIC sometime in 2001. The accused gave Gu instructions to pry open the safe, sell the NRICs, effect withdrawals with the ATM cards, and make purchases with the credit card. The accused agreed that all proceeds would be shared equally between them. 9   Call tracing records from the deceased’s mobile phone line eventually led the police to the accused, who was by then hiding in Johor Bahru. With the assistance of the Malaysian police the accused was apprehended. He was subsequently extradited to Singapore on 23 September 2005.",
        "The autopsy report": "10  Dr Lai Siang Hui (“Dr Lai”) performed an autopsy on the deceased and confirmed that the cause of death was ‘multiple stab wounds to thorax’. She states that the post-mortem examination revealed that the deceased had been dead for a period of three to ten days prior to the discovery of the body. Dr Lai noted sharp force injuries to the right side of the head and forearm. She also observed that the injuries to the forearm were consistent with defensive injuries. 11  Dr Lai reported finding a total of 13 distinct stab wounds on the body. The autopsy report of the deceased revealedinter alia: (a) Four stab wounds to the thorax anterior region (front of chest); (b) Six stab wounds to the thorax posterior region (back of chest); (c) One stab wound on the right forearm (a defensive injury); (d) Two stab wounds on the head; (e) a superficial incised wound over the back of the left hand (a defensive injury); and (f) a slash wound near the right ear.",
        "Mitigation": "",
        "The incident": "12  The Defence claims that the accused had been unscrupulously exploited by the deceased. As the accused and the deceased were unable to agree on the appropriate referral commission, the accused stopped working for the deceased. However, financial pressure surfacing during his 3-month period of unemployment compelled the accused to re-establish contact with the deceased. 13  In the midst of their discussion, the deceased had purportedly pointed a knife at the accused simultaneously issuing an ultimatum – to either resume working for him or to immediately engage in homosexual acts with him. The accused, despite fearing for his life, had declined to accede, causing the deceased to become even more agitated. The accused tried to move away from the deceased, but instead lost his balance and fell onto the bed with the deceased. He eventually wrested the knife from the deceased and in the midst of the struggle the deceased was stabbed. The subsequent events were entirely chaotic. It was only after the deceased lay motionless on the ground that the accused had an opportunity to assess and appreciate the magnitude of the injuries inflicted. Out of desperation, and in a state of sheer panic, he attempted to conceal all evidence of his presence at the scene of the crime. 14  The accused denies seizing the deceased’s electronic safe for financial profit or gain. Instead, he was concerned that the safe might contain records of customers he had serviced. He feared this might lead to his identification and implicate him in the incident. Only when his need for money to leave the country arose did he give the various stolen items, removed from the deceased’s home, as well as Lee Yean Shan’s NRIC to Gu purely to raise funds to facilitate his escape. 15  With respect to the charge being taken into consideration – that of knowingly possessing another’s Singapore Identity Card without reasonable excuse – the accused had allegedly been given Lee Yean Shan’s NRIC about five years ago by a friend, and it was left unused in a wardrobe for several years. 16  The accused asserts that he panicked after the incident and had committed the grave error of attempting to cover his tracks. He left Singapore out of fear and distress over the incident. Upon his arrest, he cooperated fully with the investigation. Indeed, the Statement of Facts was based entirely on information given by him.",
        "The profile of the accused": "17  The accused, who is now 29 years old, resided with his mother and step-father at the material time. His biological parents were never married. Although an only child, he was fostered out when he was just four months old until he was seven years old. 18  The accused suffered a violent and abusive childhood. He was cruelly and repeatedly beaten by his caregivers. That was not all. He suffered the deeply harrowing experience, while still a child, of being raped by another male. These incidents left indelible emotional and psychological scars. His psychiatric disorders could have been triggered by a traumatic adolescence. He often found himself in the throes of depression and his personal trials and tribulations were compounded by financial woes which he could not cope with. His criminal record, depressive condition and meagre education conspired against him when he sought employment. 19  Having acknowledged several antecedents, the accused had nonetheless submitted that these antecedents were entirely unrelated and dissimilar from the present case.",
        "Antecedents": "20  The accused was convicted of four charges of theft from a dwelling place and six other charges of simple theft on 17 April 1998, with 12 additional charges of theft and a further three charges of attempted theft taken into consideration. He was released from his term of imprisonment for this cluster of offences sometime in November 1999. On 22 August 2001, the accused was again convicted of theft with common intention and served this sentence until August 2003. 21  From August 2003 to September 2004, the accused was detained at the army detention barracks for absence without official leave while obliged to perform National Service obligations.",
        "Psychiatric evidence": "",
        "Dr Tommy Tan’s medical opinion": "22  The accused was remanded in the Complex Medical Centre of the Institute of Mental Health from 12 October to 2 November 2005 for psychiatric evaluation. He was examined by Dr Tommy Tan (“Dr Tan”) on three occasions. Dr Tan diagnosed the accused with dysthmia, a worrying chronic disorder which triggers continuous depression. In addition, the accused suffered, at the material time from a moderate depressive episode, characterised by loss of appetite, loss of weight, depressed mood, tearfulness and forgetfulness. 23  Dr Tan pronounced that the accused was not of unsound mind at the time of the offence given that he was fully aware of what he was doing and must have realised that he was in the wrong. Nonetheless, Dr Tan was persuaded that the accused was entitled to a defence of diminished responsibility. The accused was at the material time in the throes of a moderate depressive episode that could have precipitated an abnormality of the mind. This could have prompted him to react impulsively rather than rationally during the incident. It might also have substantially impaired his mental responsibility for the death of the deceased. 24  Dr Tan unequivocally concluded that the accused would need long-term medication and reviews to prevent a relapse of depression.In fact, the accused is likely to require anti-depressants for life. Dr Tan further reiterated that if the accused suffered a relapse, he might act impulsively toward others.The accused could be a danger to himself and others if he does not take his medication. 25  Dr Tan also testified that the accused was probably unaware of the gravity of his psychiatric illness and that he had no “real insight” into his medical condition. The risk of the accused re-offending was fairly high given the poor prognostic factors: he has a history of offending, little education, no occupational skills and hardly any social and/or family support. Although dysthmia does not invariably result in violent reactions or behaviour, patients are prone to succumb to frequent depressive episodes. Should the accused lapse in the future into further moderate or severe depression, he could well turn violent. Such violence has already been triggered on two previous occasions: first, when the accused injured himself in the military detention barracks (seeinfraat [27]); and secondly, when he committed the present offence. Dr Tan had grave doubts as to whether the accused’s aged mother would be able to ensure his long-term treatment.",
        "Psychiatric history prior to the offence in the present case": "26  The accused was first psychiatrically assessed in February 1996 by Dr Leslie Lim of the Psychological Care Centre, Military Medicine Institute (“MMI”) for his inability to keep up with military training during his National Service. The accused had acknowledged his homosexuality then. 27  Subsequently, the accused was reassessed by Dr Ang Yong Guan (“Dr Ang”), also of the MMI, when he was detained for further medical evaluation in early 2004. Prior to this, while in the military detention barracks, the accused injured himself by banging his head on the prison cell bars on 23 January 2004. A medical officer also observed that there were periods during his detention when he rejected food, any form of medication, and refused to be examined or to cooperate during interviews. Dr Ang diagnosed the accused as suffering from a major depressive disorder as well as dysphoric mood with anger, hostility and other underlying personality problems. 28  A psychiatric report prepared by Dr Cheok Cheng Soon, Christopher, the Head of Singapore Armed Forces Psychological Care Centre, Military Medicine Institute (“the SAF psychiatric report”), pointedly noted that the accused’s medical treatment had to be forcibly administered and that most of his consultations had to be conducted under the supervision of the military police.",
        "Sentencing considerations": "29  Section 304(a) of the Penal Code currently contemplates three sentencing options for culpable homicide not amounting to murder: life imprisonment, ten years’ imprisonment or a term of less than ten years’ imprisonment. Given the remorseless and savage manner in which the accused killed the deceased, the issue that arises is whether the appropriate sentence in this case should be a term of life imprisonment or ten years’ imprisonment. 30  InPP v Chee Cheong Hin Constance[2006] 2 SLR 707(“Constance Chee”) at 710, [5] - [6], I summarised the applicable considerations for the imposition of life imprisonment as follows: The Court of Appeal inNeo Man Lee v PP[1991] SLR 146andPurwanti Parji v PP[2005] 2 SLR 220at [19] approved and applied the following three broad criteria that could warrant the imposition of a term of life imprisonment as enunciated by the English Court of Appeal inR v Hodgson(1968) 52 Cr App R 113 at 114 (“theHodgsoncriteria”): (1) where the offence or offences are in themselves grave enough to require a very long sentence; (2) where it appears from the nature of the offence or from the defendant’s history that he is a person of unstable character likely to commit such offences in the future; and (3) where if the offences are committed the consequences to others may be specially injurious, as in the case of sexual offences or crimes of violence. InPurwanti Parji v PP, the Court of Appeal took pains (at [24]) to stress that these criteria were “mere guidelines” whose “status should not be overstated”. Just as importantly, the court acknowledged that mental impairment was not the “only way” to establish unstable character (at [22]). The reference to “unstable character” would apply to individuals who could pose a risk or danger to society arising from an inability to maintain self-control when confronted with some provocation, real or imagined. 31  Defence counsel has candidly conceded that the first and thirdHodgsoncriteriaaresatisfied in this case. However, it was argued that the accused’s condition does not generally or invariably manifest in aggressive behaviour. His impulsive and furious outburst in the instant scenario, it was contended, was prompted by a peculiar and unique factual confluence of events that will not recur. As the secondHodgsoncriterion is not satisfied, it was submitted that a term of indeterminate imprisonment should not be imposed. 32  It cannot be gainsaid that the accused suffers from a chronic illness and as such, the risk of a relapse without proper medication is imminent. Dr Tan has stated, without mincing his words, that if the accused does not take his medication, he could prove a danger both to himself and others. The accused was catapulted to act in an uncontrollable frenzy because of his chronic illness. A relapse could trigger further irrational behaviour. The Prosecution rightly raised legitimate concerns as to whether the accused would faithfully adhere to any prospective scheme of treatment or consultation. It would be most remiss of me not to pay heed to the SAF psychiatric report which emphasised in no uncertain terms that the accused’s submission to treatment had to be enforced. A letter from DrY C Lim, a prison psychiatrist who examined the accused while he was in remand, reveals that the accused had again refused to comply with the prescription of anti-depressants so much so that Dr Lim had discontinued all medication upon the accused’s request. Finally, it is extremely troubling to note that the accused has no real insight into the actual nature of his illness and his susceptibilities. In fact, the accused had not sought any form of treatment for his psychiatric illness after the initial diagnosis by the MMI. He quite clearly requires constant supervision to ensure that he receives the requisite long term treatment to stabilise his underlying illness. 33  Since 1998, the accused has been regularly incarcerated for criminal conduct. Incapable of earning a legitimate livelihood, he had resorted to theft. He was unable to cope with his National Service obligations. After his release from military detention, he appears to have maintained himself entirely through immoral earnings as a male prostitute. 34  InConstance Chee(at 713, [19]), the medical expert opinion surmised that the accused in that case was unlikely to comply with the prescribed medication if and when left to her own devices. Nevertheless, I was satisfied that public safety could in the circumstances of that case be satisfactorily addressed and preserved without the need to permanently incarcerate that accused. My decision to opt for a ten year term of imprisonment instead of a life sentence was largely grounded upon and influenced by the undertakings by the accused’s three sisters, affirmed on affidavit, that they would assume responsibility for her future medical care and supervision upon release from incarceration. The sisters confirmed that the accused would live with one of them on a permanent basis upon her release from prison, and that they would ensure that the accused would regularly attend her medical appointments. They would also attend to her financial needs in addition to seeking employment for her. I was satisfied that the accused’s sisters were responsible persons who would honour their commitment to ensure and preserve her future welfare and well-being. A satisfactory support mechanism prevailed in that case to facilitate and ensure the accused’s rehabilitation and medical needs. 35  In the present case, while some well-meaning friends are prepared to step forward to offer assistance and pledge their support to the accused, they have failed to propose any concrete or satisfactory plans or suggestions as to how the accused might be supervised or managed upon his release. Bare albeit well-intended assertions on their part that they will ensure that the accused continues to receive proper medical treatment are entirely insufficient to convince me of either the seriousness of their commitment or their ability to honour it. I am therefore not in the least impressed by the defence’s contention that this will afford an adequate safety net for the accused upon his release. 36The need for a reliable support network upon release is crucial in cases where the accused person requires lifelong supervision. This is indispensable in ensuring conformity with the necessary medicinal prescriptions and proper medical reviews to monitor progress. This requirement was recently illustrated in the case ofPP v Mohammad Zam bin Abdul Rashid[2006] SGHC 168where in imposing a term of life imprisonment for an offence under s 304(a) of the Penal Code, Tay Yong Kwang J voiced his concerns about the lack of familial support for the accused who similarly required lifelong medication for his mental illness. Tay J was not confident that the accused would comply with the prescribed medication regime upon his release. He noted that the accused’s siblings were not in a position to confer on the accused the care and supervision needed. In assessing the risk, Tay J perceived the threat of something untoward recurring if the accused lost control of himself as very real. The fact that the accused was likely to commit offences in the future given his unstable character (the secondHodgsoncriterion) was a decisive factor precipitating the imposition of a life sentence in that case. 37  The likelihood of re-offending and social support were also highlighted as critical factors inPP v Aguilar Guen Garlejo[2006] 3 SLR 247(“Aguilar”). In that case however, it was the accused’simprobablelikelihood of re-offending as assessed by a medical expert that I took into account. I further determined that familial support and medical counselling woulddiminishthe risk of future offending in that instance. Significantly, the mayor of the accused’s home town had also furnishedconcreteassurances that the accused would receive the necessary counselling, support and supervision after her incarceration: seeAguilarat [53]. In such unique circumstances, I felt that the imposition of a term of life imprisonment was unwarranted. 38  In the present case, however, the secondHodgsoncriterion is amply satisfied given the medical opinion of Dr Tan, who perceives the risk of the accused re-offending as fairly high. My comments on this criterion inConstance Cheeat 710, [7] may be pertinent: TheHodgsoncriteria do not require that a case of “high propensity” be established. The court need only be persuaded that a likelihood of such future offences being committed exists. The reference to such future offences is not to be equated with the prospective commission of identical offences. It would suffice that the offences contemplated fall within the broad spectrum of somewhat similar offences. 39  In this case, given that the accused suffers from a chronic psychiatric illness and has a history of serious prior offending, the prognosis for his future is poor. There is a real likelihood of reoffending, and unfortunately, a significant paucity of any positive factors that might justify a more optimistic outlook for the accused. He has a limited educational background and has not acquired any useful occupational or life skills. Prior to the incident, in order to earn a living, he prostituted himself. Indeed, this is precisely what set in motion the train of events that has culminated in such a tragic crime. Nor is there a strong network of family or social support in place to secure his welfare or well-being. His only relative is his aged mother. Dr Tan rightly expressed reservations as to whether she could ensure the accused’s long term treatment. I am also persuaded that the facts of the present case worryingly and overwhelmingly indicate that the accused is indeed capable of both irrational brutality as well as gratuitous and disproportionate violence when enraged. The accused escaped from the melee virtually unscathed, with no more than a couple of minor superficial cuts; on the other hand, he had repeatedly and remorselessly stabbed the deceased, despite the latter’s desperate attempts to escape. This, compounded by his previous dubious conduct such as deliberately causing himself hurt while in detention in the barracks, amply demonstrate the danger that the accused could pose both to himself and to the public. Given that a relapse of depression will in all probability trigger further violent behaviour, I am convinced that the risk of his re-offending poses a significant threat to the public. 40  I emphasise that for cases such as the present, where the accused is suffering from a mental illness that has sown the seeds for the commission of an offence, specific and general deterrence are sentencing considerations of largely penumbral significance: seeNg So Kuen Connie v PP[2003] 3 SLR 178at [58]: [T]he element of general deterrence can and should be given considerably less weight if the offender was suffering from a mental disorder at the time of the commission of the offence. This is particularly so if there is a causal link between the mental disorder and the commission of the offence. In addition to the need for a causal link, other factors such as the seriousness of the mental condition, the likelihood of the appellant repeating the offence and the severity of the crime, are factors which have to be taken into account by the sentencing judge. In my view, general deterrence will not be enhanced by meting out an imprisonment term to a patient suffering from a serious mental disorder which led to the commission of the offence. 41  The crucial considerations in such a scenario are instead the twin goals of rehabilitation and, to an even larger extent, incapacitation. In rehabilitation, the focus is on the perceived needs of the offender, not the gravity of the offence committed. While the deterrence rationale targets offenders who are perceived as rational and calculating, the rehabilitative theory addresses those who seem to be crying out for help and support: see Professor Andrew Ashworth’s comments inSentencing and Criminal Justice(Cambridge University Press, 2005, 4th Ed) (“Sentencing and Criminal Justice”) at page 82. Incapacitation, on the other hand, aims to deal with offenders in such a way as to make them incapable of offending for substantial periods of time. It is popularly referred to as ‘public protection’ and advocates the imposition of long, incapacitative custodial sentences on ‘dangerous’ offenders when the potential risk to prospective victims is substantial:Sentencing and Criminal Justiceat page 80. 42  In the present case, the fact that the accused’s condition has stabilised in remand,despitehaving unilaterally discontinued his medication, can only be properly attributed to the controlled environment in prison. In prison, the stresses and strains of trying to eke out a livelihood are conspicuously absent. Incarceration would also allow and facilitate meticulous and uninterrupted supervision of the accused to ensure compliance and conformity with the requisite medical regime necessary to address his underlying psychiatric condition. Given the accused’s more than plausible propensity to re-offend, the paramount consideration in this matter is the community’s safety. This can only be satisfied through the imposition of an incapacitative custodial sentence on the accused. Lifelong imprisonment is consequently an unavoidable necessity in this case to serve the aims of both rehabilitation and incapacitation (or “public protection”), which assume centre stage as key sentencing considerations.",
        "Conclusion": "43  The accused’s unfortunate personal circumstances and mental illness have combined to collude against him in this very real tragedy. While one may quite naturally sympathise with the plight of the accused as a forlorn victim of a troubled childhood, his illness and distressing background by no means deprived him of the facility to distinguish between right and wrong. Given the sad and disturbing medical history of the accused, I am constrained to reluctantly conclude that it is in the public interest as well as in the interests of the accused’s own safety that he be sentenced to a term of life imprisonment."
    }
}