{
    "case_title": "Public Prosecutor v Lee Meng Soon",
    "ncitation": "[2007] SGHC 129",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Summary of facts": "3          The statement of facts, to which the respondent agreed without qualification, reads as follows: The complainant is Staff Sergeant Nelson Tan, attached to Central Police Division. 2.         The accused is Lee Meng Soon, Male/35 years old. He was the driver of motor car SFG 8333 D at the material time. He is presently employed as an artiste at Mediacorp Pte Ltd. 3.         On 8 October 2006 at about 4:13 am, the accused was driving along Serangoon Road towards Upper Serangoon Road at the extreme right lane. At the signalized cross-junction of Serangoon Road and Kitchener Road, the accused failed to keep a proper lookout ahead and thereby drove without reasonable consideration for other persons using the road. 4.         This resulted in a side-swipe collision between the accused’s car and with motorcycle FX 7262 S, which was traveling [sic] in front of the car at the material time. The right front side of the accused’s vehicle hit the left rear side of the motorcycle FX 7262 S. 5.         As a result of the accident, the rider of motorcycle FX 7262 S, one Periakaruppan Dhandapani (referred to as ‘the rider’), lost control of the said motorcycle. The rider and his pillion rider, one Jayaraman Senthil Kumar (referred to as the ‘the pillion’), fell to the ground as the motorcycle skidded along the road. The pillion suffered serious injuries. 6.         The accused drove off from the accident location and continued to drive up Kitchener Road. He stopped his car along the left-hand side of the said road. The accused opened the door on the driver’s side of his car and looked back at the accident scene. The accused did not render any assistance to the rider or the pillion. He then closed the car door and drove away. The accused did not have the authority of a Police Officer to move or otherwise interfere with the car. 7.         The accused was subsequently apprehended at the traffic junction of Kitchener Road and Jalan Besar. The complainant interviewed the accused, and noted that the latter smelled strongly of alcohol. A breathalyzer test was conducted on the accused and he failed the test. Subsequently the accused was placed under arrest and was escorted to the Traffic Police Department for a Breath Evidential Analyser (BEA) test. 8.         The BEA test was conducted on the same day at about 6:27 am. The BEA test revealed that the proportion of alcohol in the accused’s breath was 77 microgrammes of alcohol in every 100 millilitres of breath. The prescribed limit is 35 microgrammes of alcohol per 100 millilitres of breath. 9.         Both the rider and the pillion were conveyed to Changi General Hospital and Tan Tock Seng hospital respectively. Due to the accident, the rider sustained the following injures: a)         Dried blood noted at left external nares, no obvious septal deviation b)         Oedematous mildly bruised upper and lower lip c)         Area of irregularity at inferior border of upper incisor d)         Mild tenderness over left lower chest wall anteriorly with no bruising, chest and heart clear on auscultation e)         Abrasion 6cm x 3cm over ventral aspect of right forearm, tender over right elbow and slightly limited movement of right elbow due to pain f)          Abrasion 4cm x 4cm over left wrist with full range of movement of left wrist g)         Tenderness over right wrist with movement slightly limited by pain h)         X-ray chest shows possible break in cortex of posterior left 8thrib, no pneumothorax, X-ray right elbow no fracture seen 10.        The rider was discharged with medication and given medical leave from 8 October 2006 to 13 October 2006. 11.        Due to the accident, the pillion sustained the following injuries: a)         Open comminuted fractures and near-amputation at the distal, middle and proximal phalanges of the left third toe b)         Abrasions of the left side of the forehead, left eye brow, left side of face, left elbow and the left knee c)         Crack, intra-articular fracture of the distal left radius 12.        The abrasions were cleansed and dressed. The third toe was treated with wound debridement and terminalisation of the toe at the proximal phalanx. The crack fracture was treated with a cast. The pillion made good progress and was discharged after two days on 10 October 2006. He was granted medical leave from 8 October 2006 to 6 November 2006. 13.        The accused is charged accordingly.",
        "Mitigation": "4          Counsel for the respondent tendered the following written mitigation plea: A.        Introduction 1.          The Defendant, Mr Lee Meng Soon, has pleaded guilty to the following charges: i)          Drink driving over the prescribed limit under Section 67(1)(b) of the Road Traffic Act, Chapter 276 (\"RTA\"). ii)         Driving without reasonable consideration under Section 65 of the RTA. iii)         Failing to render assistance under Section 84(3) read with Section 84(7) and punishable under Section 84(8) of the RTA. iv)        Removing a vehicle involved in a traffic accident without authority under Section 84(4) read with Section 84(7) and punishable under Section 131(2) of the RTA. 2.         The following charge has been taken into consideration for the purpose of sentencing: i)          Failing to stop after a traffic accident under Section 84(1) read with Section 84(7) and punishable under Section 131(2) of the RTA. 3.         In this plea, we seek to highlight the mitigating factors in Mr Lee's favour in order that this Court is in a position to impose a just and fair sentence. 4.         We will submit that in the circumstances, a custodial sentence and/or the imposition of a lengthy period of disqualification are unwarranted and would be extremely harsh on Mr Lee. B.         The Defendant's Background 5.         Mr Lee is 35 years old and a Permanent Resident of Singapore. He is a well-known and popular actor with MediaCorp Pte Ltd (\"MediaCorp\"). He has been working in Singapore since 1989. He obtained his driving licence in Malaysia around 1993. He converted his Malaysian driving licence to a Singaporean one in 1995 and has since been driving in Singapore. C.        Prior to the accident on 8 October 2006 At Cuscaden Walk 6.         On 7October 2006 at about 10.30pm, Mr Lee was at his friend's apartment at a condominium at Cuscaden Walk (\"the apartment\"). He was with another friend, Sean. The two of them were waiting for a mutual friend, Andy. The 3 of them had planned to meet another friend, Patrick, at Balaclava bar at Suntec City (\"Balaclava\"). They had not met up for quite some time. 7.         As Mr Lee anticipated that he and his friends would have drinks that night, he took the precaution of leaving his car in the car park at the condominium and took public transport that evening. Mr Lee was aware that drink driving was against the law and fully intended to abide by the law. 8.         When Andy turned up at the apartment, he indicated that he would only be able to join them at Balaclava later. As such, Mr Lee and Sean left the apartment by taxi for Balaclava without Andy. Between about 10.30pm to about 11.30pm, Mr Lee recalls having some wine at the apartment. At Balaclava 9.         Mr Lee and Sean stayed at Balaclava between around 11.45pm and about 1.30 am. During this time, Mr Lee recalls having had some beer. Before they left Balaclava, Patrick joined them. In the end, Andy did not turn up, as he was occupied at a birthday party for another mutual friend, Jeff. At about 1.30am, at Andy's behest, they went to Party World KTV at International Building, Orchard Road (\"the KTV\") to join Jeff’s birthday party. Mr Lee, Sean and Patrick took a taxi to the KTV. At the KTV 10.        Aside from wishing Jeff a happy birthday, Mr Lee did not join in the main celebrations and spent most of his time talking to a few friends in a corner of the KTV. After about an hour, he left the KTV and walked back to the apartment. Back at the apartment 11.        The walk and the cool night air refreshed Mr Lee. When he arrived back at the apartment, he took a rest. Sometime after that, around 4.00am, Mr Lee felt hungry and decided to go for supper. He felt that he had not drunk a lot that nightand thought that the alcohollevel in his body had dropped below the legal limit, as it had been quite some time since he last took alcohol.In any event, he did not feelimpaired by the alcoholhe had taken and believed that he would have no difficulties driving his car. As such, he decided to drive out for a short supper at a coffee shop along Kitchener Road. D.        Mr Lee was in control of his faculties 12.        We enclose a map showing International Building and Cuscaden Walk.It is apparent that to get from the KTV to the apartment, Mr Lee would have to cross a traffic light, negotiate the entrances of a few car parks sited along Angulia Park and cross an overhead bridge - a distance of about 600 metres. 13.        Further, Mr Lee took about 10 minutes to drive from the apartment to the junction. This route was more than 5km in distance.Mr Lee abided by all of the numerous traffic lights along this route. He also had to drive through a number of uncontrolled junctions along this route, including Newton Circus. 14.        We respectfully submit that the fact that Mr Lee was able to walk to the apartment home carefully and the fact that Mr Lee was able to drive safely from the apartment to just before he reached his destination at Kitchener Road shows thathe was not impaired by thealcohol he had consumed, certainly not to any extent that he was not in proper control of his car. 15.        We submit that this is a significant point to consider when assessing Mr Lee's overall culpability. His state of mind should be contrasted with someone who may not have consumed enough alcohol to bring him or herself over the legal limit but who feels clearly impaired (e.g. unsteady gait, nodding off to sleep, slurred speech) by the alcohol andstillmakes a deliberate decision to drive a car or who drivesknowing full wellthat he was over or likely to be over the legal limit. E.         Details of the accident and the aftermath 16.        Mr Lee approached the junction from Serangoon Road. He stopped at the junction on the right-most lane of Serangoon Road, as the traffic light was red. Mr Lee intended to turn right to Kitchener Road and signalled accordingly. Once the light turned green in his favour, he proceeded to make a right turn into Kitchener Road. Whilst he was negotiating the right turn in the junction, he felt a slight bump at the right side of his car. 17.        Mr Lee realised that he might have been involved in a collision with another vehicle. His first impression was that it was a motorcycle as the impact was minimal. 18.        The slight collision left Mr Lee in a daze and he recalls that he drifted away from the junction (not under acceleration). He was in shock as he had never been involved in any traffic incident, let alone a collision with another vehicle before.Mr Lee never had any intention toflee the scene of the collision to avoid getting caught. He acknowledges that he ought to have alighted and gone to the accident scene to render assistance. He would have done so had he not been in a shock and confused about what had happened. 19.        As a result of the minor collision, Mr Lee did not anticipate and did not appreciate the possibility that serious or life-threatening injuries could have been caused. In this regard, the motorcyclist and the pillion did not seem to have suffered significant or clearly visible injuries, or be in great pain. In this regard, it is to be noted that the motorcyclist predominantly suffered only some minimal impact to one of his teeth. 20.        Mr Lee was confused and at a loss as to what to do. He eventually drifted towards his original destination, the coffee shop at the other end of Kitchener Road, only a few hundred metres away. There, he stopped by the roadside, near the traffic junction. About 5 or more minutes later, he and several other vehicles were directed by a police officer to u-turn and go to the scene of the accident. We respectfully submit that if Mr Lee had intended to run from the scene, he would have been at least 5km away before the police arrived on the scene - as far away as Chinatown if he drove down Jalan Besar from the coffee shop at that time of the night with little traffic. 21.        At the scene of the accident, Mr Lee spoke to the uniformed police officers, who informed him that he was required to go with some Traffic Police officers back to the police station to assist in investigations. Mr Lee was worried about the condition of the persons on the motorcycle and asked about them. He was informed then that they did not appear to suffer significant injuries. By that time, they had already left the scene of the accident. 22.        Following a breathalyser test at the Traffic Police Headquarters, Mr Lee was informed that the amount of alcohol in his breath was above the prescribed limit. After a statement was recorded from him, he was released on police bail later that morning. F.         Sentencing precedent and considerations Drink driving under Section67(1)(b) of the RTA 23.        Section67(1)(b) provides that a first time offender is liable to a fine of not less than $1,000 and not more than $5,000 or to imprisonment for a term not exceeding 6 months. 24.        We refer to the extract on drunk driving in the 2ndEdition of Sentencing Practice in the Subordinate Courts. It is noted there that the quality of the driving and the amount by which the offender was over the limit were factors in determining the sentence to be imposed. 25.        The court does not necessarily have to impose a term of imprisonment in each and every case of drink driving where personal injuries result from an accident. As noted in the case ofDinesh Bhatia Singh s/o Amarjeet Singh v PP [2005] 3SLR 1byVK RajahJ (as he then was),\"benchmarks and/or tariffs had significance, standing and value as judicial tools so as to help achieve a certain degree of consistency and rationality in sentencing practices. However, they should not be viewed as binding or fossilised judicial rules, inducing a mechanical application. The context of the case in question, relating as it did to the actual facts and circumstances therein, also had to be taken into account\". 26.        InPP v Chua Hock Ann Benny [MA 204/94/01]andPP v Terence Yap GiauBeng [MA 371/96/01],fines of $3000/- and $5,000/- were imposed for charges under Section67(1)(b) of the RTA. In both cases, the alcohol concentration in the offenders was about double the prescribed limit of 80mg per 100ml of blood, as in the present case. The injuries were also fairly serious, with one of the injured parties inChua Hock Ann Bennybeing warded for 5 days. InTerence Yap Giau Beng,boththe rider of the motorcycle and his pillion suffered from fractured legs. 27.        In the recent case ofCarter Oh Keng Hsiao (unreported),the offender was fined for drink driving and failing to keep a proper look out even though he caused thedeathof the pedestrian. 28.        It bears noting as well that in a number of other cases where brief terms of imprisonment were imposed for chargesunder Section67(1)(b) of the RTA,the degree of culpability in the offenders' driving was significantly higher in those cases than in the present case (see table below). CaseSentenceDrivingAlcohol concentrationChau King Pangv PP[MA369/92/01]3 weeks’imprisonment &disqualified 5yearsOffender’s vehiclecutinto path oftwo cars coming from oppositedirection, colliding with one carand causing other to swerve andhit road divider.157.9mg per100ml of bloodBrent PhilipDobeson v PP[MA509/92/01]2 weeks’imprisonment &disqualified 5yearsOffender’s vehicle collided with amotorcyclist afterdriving through ared light.198.3mg per100ml of bloodPeh Hock Sengv PP[MA10/94/01]3 weeks’imprisonment &disqualified 4yearsOffenderdrove against the flow oftrafficresulting in a head-oncollision with a taxi257mg per100ml of blood 29.        In comparison, as will be set out below at Paragraphs32 to 34, Mr Lee's culpability for the accident was much lower. The impact of the collision was not significant and the collision had taken place during a routine right turn at a junction where the motorcyclist was also making a right turn. Mr Lee was not flouting any traffic regulations in causing the accident, unlike in the three cases cited in the table above. There is also no evidence that the accident was a result of any alcohol-induced impairment to Mr Lee's ability to drive. 30.        We respectfully submit that in the circumstances, a sentence of a fine along with term of disqualification would be appropriate in respect of the drink driving offence, bearing in mind the quality of Mr Lee's driving and the general mitigatory factors set out below at Part G of this mitigation plea, in particular, Mr Lee's awareness that drink driving was an offence and the fact that he had not set out that night to deliberately drink drive. On the contrary, he took precautions as he anticipated he would drink that night. His mistake lay in his misapprehension that the alcohol concentration in his body was below the prescribed limit when he drove that night. The walk back from International Building, the lengthy rest he had at the apartment was to Mr Lee a mental break between the drinks and his drive to Kitchener Road. This takes it out of the normal circumstances under which drink driving is concerned. Driving without reasonable consideration under Section65 of the RTA. 31.        Section65 provides that a first offender is liable to a finenot exceeding $1,000 or to imprisonment for a term not exceeding 6 months, or both. 32.        We refer to the extract on driving without reasonable consideration in the 2ndEdition of Sentencing Practice in the Subordinate Courts. It was acknowledged that\"the degree of culpability is the primary consideration when sentencing\"and that\"cases of momentary inattention or error of judgementshould result in fines\"[note: 1]. The extract citesThe Queen v Chau Tai [1999] 1HKSLR 341,wherein it was stated,\"the consequences of an accident maysometimes have little relevance to the penalty that should be imposed. Sometimesa period ofmomentary inattention can have tragic results, while a piece of extremely bad or wicked driving can fortunately result in an offender escaping any accident”. 33.        The authors further opined\"as the degree of culpability is theprimary consideration when sentencing, cases of momentary inattentionor error ofjudgmentshould result in fines\". 34.        The present case is a clear example of a minor accident occurring as the result of a momentary lapse in concentration. Mr Lee had no problem driving from Cuscaden Road to the Kitchener Road junctionwithout incident. He had only collided with the motorcycle as a result of brief inattention on his part whilst turning right at the junction. 35.        Mr Lee was proceeding in conformity with the green traffic light in his favour and it was the sort of accident that could have happened to anyone at any time. Further, the area around the Kitchener Road junction was not particularly well lit and certainly contributed to Mr Lee's inadvertent failure to notice the motorcycle on his right when he was making the right turn into Kitchener Road. We enclose photographs taken of Kitchener Road and the area around the accident junction at around 3.00am showing this. 36.        The collision was so minor that the only damage to Mr Lee's vehicle was some scratches on the right front wheel of the vehicle. This shows that the actual collision was not that serious. Mr Lee's degree of negligence that fateful night was indisputably minor. We enclose photographs of Mr Lee's car taken after he retrieved it from the police station, which show that there [sic] damage to Mr Lee's car from the collision was insignificant and only to the right front wheel of the car. 37.        We therefore respectfully submit that Mr Lee should only be fined in respect of this offence. Even in cases where death was caused, fines are usually imposed where the driving does not descend to the standard of recklessness. Failure to render assistance under Section 84(3) of the RTA and moving off without authority under Section 84(4) of the RTA 38.        A first-time offender of moving off without authority is liable to a fine not exceeding $1,000 or to imprisonment for a term not exceeding 3 months. Fines are normally imposed for offences under Section84(4) of the RTA. 39.        A first time offender of failure to render assistance is liable to a fine not exceeding $3,000 or to imprisonment for a term not exceeding 12 months. 40.        We refer to the extract on sentences under Section84 of the RTA in the 2ndEdition of Sentencing Practice in the Subordinate Courts. The extract states: \"The offender has a moral obligation to stop after an accident and assist the victim.Such assistance can make a difference between life and death.\"[Emphasis added] 41.        From the extract, it is clear that the authors of the book recognise that Section84(3) is meant as a deterrent to ensure that errant drivers whocanmake a difference between life and death, do put in the effort (as they are obliged)to make that differencebetween life and death. However, not all road traffic accidents result in life and death situations. 42.        It follows thatan offender's knowledge of the seriousness of the injuries suffered in the accident is important in determining his culpability for this offence(and hence the sentence that ought to be imposed). A clearly distillable principle in relation to the culpability of a driver who fails to render assistance therefore must be: \"the greater the perceived injury, the greater the moral obligation to render assistance\". 43.        As noted in the case ofPP v Koh Liang Choon[2006] SGDC 234, a custodial sentence is not warranted in every case of failure to render assistance. It was acknowledged that\"there are situations,even those involving serious injury,where a fine might be warranted, but that these cases are the exceptional ones\".Parliament has also recognised that even for failure to render assistance in cases of serious injury, the imposition of a custodial sentence is not mandatory. 44.        What kind of exceptional cases warrant the imposition of fines even where there is serious injury? It must be where there is both an objective and subjective assessment that due to the minor nature of the accident (of which minimal impact is a significant consideration), there was no basis to think that there was endangerment of life or that serious injury had occurred. 45.        We respectfully submit that the present case is such an exceptional case. 46.        In the present case, the impact between vehicles was minimal and Mr Lee did not appreciate that there were serious or life-threatening injuries occurring as a result of the minor collision. This can be contrasted with the case ofKoh Liang Choon,where the offender knew he had knocked downa pedestrian. He also had the presence of mind to seek out legal advice. Further, the pedestrian inKoh Liang Choonsuffered long-term trauma and psychological damage over and above her physical injuries and even became suicidal. 47.        This case can also be contrasted with the unreported case ofTanSiong Chin(\"the unreported case\"), which involved a lorry and a motorcycle. In that case, the motorcyclist and his pillion were both injured in the accident. The offender, who also faced charges for drink driving and inconsiderate driving,was sentenced to a fine of $1000/-and disqualified from driving for 8 months in respect of his failure torender assistance. Fines were also imposed in respect of the other charges. The offender also initially failed to provide a breath specimen. That charge was withdrawn after he pleaded guilty to the rest of the charges. Following the accident, which led to\"a shattered front windscreen and damaged front portion\",the offender left the scene until located by the police nearby. Photographs of the damage to the offender's lorry demonstrate just how serious the collision was. 48.        The unreported case is an example of how Courts do not invariably impose custodial sentences in respect of offences of failure to render assistance.We submit that it is also a more serious case of failingto render assistance than Mr Lee's case. The impact between the lorry and the motorcycle was far greater than in the present case. Further,itwas a 'head-on collision'(as conceded by the offender). Thus, the degree of negligence by the offender in the unreported case was far worse than Mr Lee's. The injuries toboththe motorcyclist and pillion were also significant; in fact they both suffered from amnesia about the accident due to their head injuries and the pillion suffered from broken teeth. It is entirely fortuitous that they did not suffer more serious injuries. In fact, the chances of fatalities are far higher in head-on collisions. 49.        It cannot be disputed that the offender's knowledge of the seriousness or potential seriousness of the injuries to the motorcyclist and pillion rider was greater than Mr Lee's. The offender could not but have had reason to believe, given the glaring degree of damage to his own vehicle (with its smashed front and shattered windscreen), that the injured parties were in dire need of assistance and that it was potentially a matter of life and death. Yet, the offender not only failed to render assistance, he left the scene of the accident entirely and hid at a HDB car park before the police caught up with him. 50.        Further, Mr Lee was in shock after the accident and was not thinking straight. Had he had the presence of mind to do so, he would certainly have rendered assistance to the motorcyclist and pillion in this case. Mr Lee's charitable work (see Paragraph59 below) exemplifies his care for others and we are instructedthat from the moment he met first the IO he has shown his care and concernfor the welfare of the motorcyclist and pillion rider, up to and including his efforts to date to settle the Civil Suit as set out above. 51.        Though we do not have the contents of the mitigation plea (if any) presented to the Court in the unreported case, it is respectfully submitted that the mitigating factors in that case could not be as numerous or forceful as they are in Mr Lee's case. In particular, there is no evidence that the drink driving by the offender had taken place under a misimpression about the alcohol concentration in his body, unlike in Mr Lee's case, where he had conscientiously taken taxis earlier in the night. The offender had also been uncooperative in failing to provide a breath specimen. 52.        By some quirk of fate, the motorcyclist and pillion rider in the unreported case only suffered from superficial wounds, broken teeth and head injuries that led to amnesia. By contrast, despite the minor collision, the pillion rider in the present case was unfortunate enough to lose a toe and suffer a fracture. He spent only 2 days in hospital and, we are given to understand, has since returned to work in the same job. It is respectfully submitted that the very slight injuries suffered by the motorcyclist in the present case are more consistent with the nature of the actual accident in the present case. This alone gives a clear indication of the minor severity of the accident and overall impact of the contact between the two vehicles.It is clearly a matter of misfortune (for both the pillion rider and our client) that the pillion rider suffered the loss of a toe and a fracture in such a minor accident. 53.        Certainly, we are not advocating that the extent of injuries caused in any accident be disregarded completely in the assessment of the driver's culpability. Our position is simply thatthe nature of theaccident and the extent to which a driver has renounced his moralobligation to stop carry significantly more weight in determining that driver's overall culpability than the nature of the injury suffered. 54.        Such a position has support from the Courts. The case ofThe Queen v Chau Taicited above shows that the Courts do recognise thatfortune (or misfortune) should not play that significant a role in determining a road traffic offender's culpability. We respectfully submit thatthere must be due recognition given to the aspect of their culpabilities that road traffic offenders could have controlled. 55.        It would not be just to sentence Mr Lee more harshly simply because luck was shining on the offender in the unreported case and not him. We respectfully submit that the Court ought to have more regard for their behaviour and moral culpability than the uncontrollable consequences of the respective accidents. 56.        As such, there is every reason to impose only fines in respect of Mr Lee's offences of failing to render assistance and drink driving. Mr Lee's overall culpability cannot possibly be greater than the offender in the unreported case. The offender had clear reason to believe that he had caused serious injuries or fatalities and therefore had a greater moral responsibility to render assistance than Mr Lee did in this case. To our client, it would not have seemed that it was a matter of life and death for the motorcyclist and pillion, or that they were likely to have suffered serious injuries. 57.        If there is an exceptional case deserving of a fine, this is such a case. We respectfully submit that sentencing of the charge of failure to render assistance must be proportional to the severity of the circumstances surrounding the offence. G.        General mitigatory factors in favour of leniency 58.        We are instructed that Mr Lee has had no previous criminal convictions. He has always been a law-abiding citizen. As a person constantly in the public eye, he has always been well aware of the need to set a good example of himself for others tofollow and has done so. 59.        Aside from Mr Lee's lack of antecedents, we submit that the following factors lend weight to our request for leniency: Remorse and acceptance of responsibility 60.Mr Lee is deeply remorseful for his actions that resulted in the accident. Afterlearning that it was a motorcycle that was involved in the collision, he was deeply concerned about the motorcycle rider and the pillion rider. 61.        Mr Lee is pleading guilty to the charge without undue delay. His plea saves the State time and costs. Mr Lee had taken precautions not to drink drive that night 62.        Mr Lee begun the evening by conscientiously taking taxis to commute betweenthe few destinations that he was visiting with friends. He was well aware that it was against the law to drive when intoxicated and we are instructed that he has always taken public transport when going out for a drink. 63.        Mr Lee walked back to his friend's apartment at Cuscaden Road, refreshed from the walk and a generous rest of more than an hour before deciding to drive out for supper. It was therefore under an error of judgment that Mr Lee eventually drove out to supper that night whilst above the legal limit. He had belaboured under the mistaken belief that a break of a few hours between driving and his last drink sufficed for the alcohol concentration in his body to have dipped below the prescribed limit. 64.        This error was compounded by the fact that he felt fine and able to drive normally. This impression was fortified by his walk back to the apartment and his taking a rest there for quite a while before he drove out for supper. We submit that it is entirely reasonable to note that the walk and the rest constituted a clear intervening event between the drinks he had much earlier in the evening and the drive he undertook nearer the break of dawn. This intervening event, it is respectfully submitted, takes this case out of the ordinary into the exceptional. Viewed together with his precaution to avoid driving earlier in the evening, it reduces Mr Lee's culpability drastically. 65.        Mr Lee acknowledges that he was at fault for failing to ascertain exactly how quickly he could resume driving after consuming some alcohol. However, we humbly submit that Mr Lee, as a layperson, does not deserve having the book thrown at him for this mistake. 66.        We would also respectfully point out that information on the rate of alcohol elimination has not been brought to the attention of the general public. Many laypersons still believe for instance that consumption of water and coffee and the passing of urine all help them to eliminate alcohol and its effects from their bodies. A print out from the website of Lion Laboratories (we understand they supply the Traffic Police with breathalyser equipment) shows that contrary to that common belief (which was also Mr Lee's belief), the alcohol“elimination process proceeds... relatively slow, so that only a small quantity of alcohol can be removed at any time”and only“10% of the alcohol leaves the body with the urine and breath and through the skin with sweat”. Details of Mr Lee's media campaign against drink driving 67.        Mr Lee has learnt a big lesson and is not only keen to make amends but also to ensure that others do not make the same errors of judgement that he did and to contribute as much as he can to safety on the Singapore roads. 68.        To that end, Mr Lee's managers have been in contact with the Traffic Police and have communicated Mr Lee's will to work with the Traffic Police on such programmes after this matter has been disposed of. Compensation of the motorcyclist and pillion rider 69.        After considerable efforts on Mr Lee's part to settle the Civil Suit commenced by the motorcyclist and the pillion rider, terms for a settlement have been agreed with them. The settlement monies have already been paid into our account and they will be released to the motorcyclist and pillion rider upon the approval of the office of the Official Assignee and Public Trustee to the settlement. In our professional assessment, the amounts of compensation offered are more than reasonable to compensate them and are above what they would have been entitled to under the law. 70.        Significantly, both the motorcyclist and the pillion rider filed their claims against Mr Lee in the Magistrates Court in the same suit. As such, the Magistrates Court only has the jurisdiction to award a maximum of $60,000 in total to both of them. In our view, the total amount The amount [sic] of compensation under the terms of the settlement exceeds the jurisdictional limit of what the Magistrates Court has the power to award them both the Plaintiffs in the Civil Suit. Mr Lee was nonetheless prepared, to waive the jurisdictional limit and has already paid the sums to us even as it awaits statutory approval from the Public Trustee. The compensation to the motorcyclist and the pillion rider covers: i.          their medical expenses; ii.          their loss of income; iii.         their loss of amenities; iv.         their pain and suffering; v.         repair to the motorcycle; vi.         their lawyer's fees in relation to the Civil Suit. 71.        Mr Lee of course deeply regrets the accident and the injuries caused and hence his instructions to us that he would not wish to contest the claims brought by the two Plaintiffs. The amounts paid, the speed of the settlement and the fact that compensation will be from his own pocket attests to the remorse and regret on his part and represents his genuine and sincere desire to what he can to render assistance to both of the injured persons. 72.        The reparations made by Mr Lee significantly distinguish the present case from almost all other similar cases. We are not aware of the offenders in any of the cases (reported and unreported) cited herein compensating the victims of the accident out of their own pocket, much less to such sums. Testimonials in favour of Mr Lee 73.        We annexe in this mitigation plea several testimonials in Mr Lee's favour. They were given by people who have worked with Mr Lee or know him well. All of them cite his good character and compassion for the less fortunate. It is clear that whatever Mr Lee has done in the present case is completely out of character and cannot be anything more than a one-off error of judgement. 74.        The testimonials from Mr Lee's bosses at Mediacorp refer to his professionalism, work ethic and significant contribution to Mediacorp. 75.        The testimonials from Sean Say and Patrick Wong, who were with Mr Lee on the night in question, speak of how Mr Lee is law-abiding and would not knowingly drink and drive, even going to the extent of ensuring that his friends do not drive when they drink. Mr Lee was clearly not aware when he drove on the night in question that he was above the limit. Self-imposed driving ban 76.        Mr Lee has also decided even before the conclusion of investigations that he will voluntarily 'ban' himself from driving indefinitely. We are instructed that soon after retrieving his barely 3-month old car from the Traffic Police in October 2006,he sold it off at a substantial loss of more than $40,000.00. Given the need for mobility in his job, this was a significant sacrifice made by Mr Lee, well before he was even prosecuted in relation to the accident. It is clear that Mr Lee has learnt his lesson. Mr Lee's charity work 77.        Mr Lee is heavily involved in charity work. He has devoted significant amounts of time to preparing for and performing various stunts in several charity shows to raise funds for charity. A large number of these stunts were dangerous but we are instructed that Mr Lee has never paid heed to such risks as he felt a strong sense of duty to serve the public good. Among the charity events that Mr Lee was involved in are: a)         The President's Star Charity 2001 - 2004 b)         The National Kidney Foundation Charity Show 2002 - 2004 c)         The National Kidney Foundation Cancer Show 2005 d)         The Community Chest Charity Show 2002 e)         The Children's Medical Fund Show 2004 f)          The Ren Ci Charity Show 2005 – 2006 H.        Conclusion 78.        We humbly submit that sentences of fines ought to be imposed in respect of the 4 charges that Mr Lee has pleaded guilty to. 79.        The drink driving offence can be distinguished from other cases, as there was a genuine misapprehension by Mr Lee of the alcohol concentration in his body - the taking of taxis earlier in the night attests to this. The precaution he took earlier in the night to avoid driving altogether, seen with the fact that he took a long rest before driving out to supper, strongly fortifies the fact that Mr Lee made an error of judgement, an error that ought not to be punished by a custodial sentence. 80.        The nature of the accident was also minor and this is an important factor with respect to all of the charges. The degree of abdication of moral responsibility is lower in this case than in others where custodial sentences have been imposed for failures to render assistance. This truly is an exceptional case warranting a departure from the norm of short custodial sentences for that offence. 81.        Mr Lee could not have done more since the accident. His efforts at reparations ought to be given due weight in determining the appropriate sentences for him. This is clearly seen in his generous posture in compensation for the motorcyclist and pillion rider, both of whom we understand are grateful and appreciative of Mr Lee's efforts to compensate them. 82.        A perusal of the First Schedule of the Workmen’s Compensation Act shows that amputation of a toe is regarded as causing only a permanent 3% loss of earnings. Aside from that, the other injuries suffered by the motorcyclist and pillion rider do not have a lasting impact on their future earning capacity. In fact, we understand that they both returned to work after their respective periods of medical leave. In the eyes of the law, the compensation to them over and above their reasonable legal entitlement has more than brought their lives back to normal. 83.        With respect to the period of disqualification to be imposed in Mr Lee, we respectfully urge that the Court specifically consider, aside from the general mitigatory factors, the fact that Mr Lee has already voluntarily banned himself from driving for more than 6 months since the accident.",
        "The decision below": "5          At the trial below, counsel for the respondent highlighted the lack of antecedents, remorse and acceptance of responsibility evinced by the respondent’s timely plea of guilt and a self imposed indefinite driving ‘ban’. In particular, counsel focused on the precautions taken by the respondent on that fateful night, such as his initial recourse to public transport and the fact that the respondent had taken a walk and had rested for more than an hour. It was further submitted that the respondent committed an error of judgment as he belaboured under the genuine misapprehension that a break of a few hours sufficed for the alcohol concentration in his body to have dipped below the prescribed limit. 6          The district judge made reference to the varying rate of alcohol absorption from individual to individual and observed that the misapprehension of one’s alcohol level was simply all too common in cases of drink driving. Nonetheless, he concluded that a fine and disqualification would be sufficient for the drink driving charge. 7          Regarding the “hit and run” charge, the district judge adhered to the guideline that where serious injury was caused, the starting point for the court was a custodial term and a period of disqualification. Counsel’s assertion that the respondent had “no basis to think that there was endangerment of life or that serious injury had occurred” was roundly rejected on the basis that the respondent was conscious of and had seen the accident scene, for which there was every possibility that some injury could have resulted. He referred to the active duty on a person to stop and check in any case, and reiterated that the respondent’s failure to stop was clearly a choice. 8          Ultimately, the district judge took the view that the circumstances of the case were nowhere near exceptional and observed that “as far as drink driving and hit and run cases go, this case is almost entirely average”. In the circumstances, he decided to adhere to the usual tariff of a custodial sentence for s 84(3) (as opposed to departing from it in favour of a fine), and imposed a term of 4 weeks’ imprisonment and disqualification for all classes of vehicles for three years. 9          In the present appeal, the prosecution submits that the trial judge failed to give sufficient weight to the fact that (a) the respondent had total disregard for the safety of other road users; (b) that the level of alcohol in his system was more than twice the prescribed limit; (c) that he had failed to render assistance despite knowing that he had knocked down two victims from their motorcycle which (d) caused serious injury as a result. In particular, the prosecution contends that the trial judge failed to address his mind to the public interest in deterring offences involving drink driving and the subsequent failure to render assistance. These arguments are largely similar to those canvassed before the trial judge for which nothing of novel significance emerges, save for the present focus on the need for a deterrent sentence, which will be addressed below.",
        "Sentencing principles": "10        It is well settled that an appellate court has only a limited scope for appellate intervention with respect to sentences meted out by a lower court. This is because sentencing is largely a matter of judicial discretion and requires a fine balancing of myriad considerations:Angliss Singapore Pte Ltd v PP[2006] 4 SLR 653. 11        However an appellate court retains the prerogative to correct sentences where: (a) the sentencing judge had erred as to the proper factual basis for sentence; (b) the sentencing judge had failed to appreciate the material placed before him; (c) the sentence imposed was wrong in principle and/or law; and (d) the sentence imposed was manifestly excessive, or manifestly inadequate, as the case may be:Tan Koon Swan v PP[1986] SLR 126at [4], [5], [8], [9];PP v Cheong Hock Lai & Other Appeals[2004] 3 SLR 203at [26]. 12        In the present case, the appellant contended that the sentences imposed on the first and third charges were manifestly inadequate. In assessing the adequacy of a lower court’s sentence, due regard may be given to previous sentencing precedents involving similar facts or offences, for the reason that these cases give an indication of the appropriate sentence to be imposed although this must be done with full appreciation of the unique circumstances of each case:Viswanathan Ramachandran v PP[2003] 3 SLR 435at [43]. While references to such ‘benchmarks’ facilitate consistency and fairness by providing a focal point against which subsequent cases with differing degrees of culpability can be accurately determined, they are not cast in stone, nor do they represent an abdication of the judicial prerogative to tailor criminal sanctions to the individual offender:Syeed Chowdhury v PP[2002] 1 SLR 301at [15]. 13        Indeed, the oft-cited mantra that sentencing precedents should not be dogmatically applied without due appreciation of the unique facts and circumstances of each individual case is aptly illustrated by the following passage inSoong Hee Sin v PP[2001] 2 SLR 253which reiterates as follows (at [12]): [T]he regime of sentencing is a matter of law which involves a hotchpotch of such varied and manifold factors that no two cases can ever be completely identical in this regard. While past cases are no doubt helpful and sometimes serve as critical guidelines for the sentencing court, that is also all that they are, i.e. mere guidelines only. This is especially so with regard to the unreported cases, in which the detailed facts and circumstances are hardly, if ever, disclosed with sufficient clarity to enable any intelligent comparison to be made. At the end of the day, every case which comes before the courts must be looked at on its own facts, each particular accused in his own circumstances, and counsel be kept constantly and keenly apprised of the fact that it is just not possible to categorize cases based simply on mere numericals and decimal points. 14        Having delineated the principles which should guide an appellate court’s review of a lower court’s sentence, I turn to assess whether any of the above grounds merit an interference with the sentence meted out by the trial judge and whether it was in fact manifestly inadequate.",
        "Driving under influence: s67(1) of the Act": "15        In the present appeal, the appellant reiterated the widespread problem of drink driving and its dire consequences. Indeed, the recent increase in the number of drink driving cases had not gone unnoticed by Parliament. In the recent Parliamentary debate on 22 May 2007, the Senior Minister of State for Home Affairs noted: Sir, the number of persons arrested for drink driving increased by about 30%, from about 2,930 persons in 2004 to 3,730 persons last year. For the first quarter of this year, SPF arrested 920 persons for drink driving, an increase of 22% over the same period last year. Slight injury accidents related to drink driving also increased, from about 200 cases in 2004 to 260 cases in 2006 while fatal and serious injury accidents related to drink driving have remained stable over the past three years registering 38 cases, 28 cases and 32 cases in 2004, 2005 and 2006 respectively. 16        The offence of driving under influence, or commonly called drink driving is set out in s 67(1) of the Act: Driving while under influence of drink or drugs 67.— (1) Any person who, when driving or attempting to drive a motor vehicle on a road or other public place — (a)        is unfit to drive in that he is under the influence of drink or of a drug or an intoxicating substance to such an extent as to be incapable of having proper control of such vehicle; or (b)        has so much alcohol in his body that the proportion of it in hisbreath or blood exceeds the prescribed limit, shall be guilty of an offence and shall be liable on conviction to a fine of not less than $1,000 and not more than $5,000 or to imprisonment for a term not exceeding 6 months and, in the case of a second or subsequent conviction, to a fine of not less than $3,000 and not more than $10,000 and to imprisonment for a term not exceeding 12 months. (2) A person convicted of an offence under this section shall, unless the court for special reasons thinks fit to order otherwise and without prejudice to the power of the court to order a longer period of disqualification, be disqualified from holding or obtaining a driving licence for a period of not less than 12 months from the date of his conviction or, where he is sentenced to imprisonment, from the date of his release from prison. (3) Any police officer may arrest without warrant any person committing an offence under this section. 17        The rationale behind sub-section (1)(a) is clear: any person so affected by alcohol, drug or other intoxicating substance as to be unfit to drive a vehicle is prohibited from doing so because he would be a threat to the public as well as to himself. Section 67(1)(b) was inserted by the Road Traffic (Amendment) Act (Act 11 of 1996). Prior to this amendment the prohibition was against driving under influence, for which s 67(1) as it then was provided as follows: 67.— (1) Any person who, when driving or attempting to drive a motor vehicle on a road or other public place, is under the influence of drink or of a drug to such an extent as to be incapable of having proper control of such vehicle shall be guilty of an offence and shall be liable on conviction to a fine of not less than $1,000 and not more than $5,000 or to imprisonment for a term not exceeding 6 months and, in the case of a second or subsequent conviction, to a fine of not less than $3,000 and not more than $10,000 and to imprisonment for a term not exceeding 12 months. Section 70 of the Act prior to the 1996 amendment (“the old Act”) provided a rebuttable presumption that a person is incapable of having proper control of his vehicle if the alcohol level in his blood exceeded a certain level. Section 70 of the old Act provided as follows: 70.— Any person who has been arrested under section67 or 68 shall be presumed to be incapable of having proper control of a motor vehicle if the specimen of blood provided by him under section69 is certified by a medical practitioner to have a blood alcohol concentration in excess of 80 milligrammes of alcohol in 100 millilitres of blood 18        The Minister, in his second reading speech on 27 February 1996, explained the objective of the present provisions in the following manner (Singapore Parliamentary Report, Vol. 65, col 722): “Currently, under existing section 70 of the Act, a person is presumed to be incapable of having proper control of his vehicle if the amount of alcohol found in his blood is above the prescribed legal limit. This has given rise to a situation where the defence tries to rebut this presumption by trying to prove in each case that the defendant did not lose control of the vehicle. To prevent unnecessary debate, clause 9 of the Bill seeks to re-enact section 67(1)(b) to make the presence of alcohol exceeding the legal limit in a driver's blood or breath an offence in itself without linking it to the control of vehicle. The new section 67(1)(b) makes it clear that an offence is committed once the driver's alcohol content exceeds the prescribed limit. This provision is similar to the provisions in Malaysian and UK legislation.” 19        Therefore it is clear that the prohibition encompassed by s 67(1) covers the situation where a person drives a vehicle while: (a)        he is incapable of having proper control over his vehicle on account of alcohol, even though the amount of alcohol in his body does not exceed the prescribed limit; and (b)        the amount of alcohol in his body exceeds the prescribed limit even though he is capable of proper control of his vehicle. Therefore, the legislature had decided that a person who has consumed such amount of alcohol that his breath or blood alcohol level exceeds the prescribed limit is likely to be incapable of driving a vehicle safely, and that as a matter of policy, he should be prohibited on pain of punishment under penal law from driving irrespective of whether he is capable of so doing. 20        With this background in mind, I turn to the considerations relevant in sentencing a person convicted of an offence under s 67(1). The punishment prescribed in s 67(1) for a first offender is a fine, of between $1,000 and $5,000, or imprisonment for up to 6 months. For a second offender, he is liable to both a fine, ranging from $3,000 to $10,000, and to imprisonment for up to 12 months. In both cases the offender is liable to be disqualified from driving for a period of at least 12 months. 21        There have been many cases where a first offender under s 67(1) had been sentenced to a fine only and germane to the present appeal are the factors that would affect the decision to impose a sentence of imprisonment rather than a fine. It is useful to consider the matter from the extreme ends of the spectrum of punishment. At the minimum end is the case of a person who, after consuming a small amount of alcohol, drives a vehicle on the road. He is able to control his vehicle but is stopped for a random breath alcohol test which discloses a level that is at or just over the prescribed limit. He is guilty of an offence under s 67(1)(b). In the absence of any other material factor, it would be appropriate to sentence him to the minimum fine of $1,000 or an amount not far from this sum. The disqualification period imposed under s 67(2) would be the minimum period of 12 months unless there are special reasons not to do so. At the maximum end of the spectrum is the case of a heavily intoxicated driver who careens from one side of the road to the other at high speed, causing danger or even injury to other persons and damage to property. The level of alcohol in his body is many times over the prescribed limit. He would be accorded a punishment at the maximum end of the scale, with imprisonment for a term at or close to the maximum of 6 months and disqualification for a long period, possibly for life. 22        The cases have established that the principal aggravating factors in an offence under s 67(1) are the level of alcohol in the breath or blood and the degree of control of vehicle. InOng Beng Soon v PP[1992] 1 SLR 731, the offender was sentenced to a two-week custodial term for drink driving under s 67 of the old Act. He had lost control of his vehicle and crashed his car into a tree. The offender’s blood alcohol concentration was 164.5mcg/100ml, which was more than twice the level that would invoke the presumption under s 70 of the old Act. On appeal, the High Court emphasised that (at [7]): The appellant had a blood alcohol concentration of more than twice the legal limit and it would not in principle be appropriate to treat him as if he were an offender who was just over the limit. A person substantially over the limit is obviously in more flagrant violation of the [Road Traffic] Act than a person marginally over the limit. 23        InPP v Oh Cheng Siong (unreported), the offender was driving a motor lorry while intoxicated. He collided into the rear portion of a taxi at a traffic junction, injured the taxi driver and drove away from the scene without rendering assistance. He was subsequently arrested by the police when they found him sleeping in the driver’s cabin of the motor lorry some distance from the accident scene. The offender, who had previously been convicted of careless driving, was fined $1,800 for the drink driving charge and disqualified for one year. On appeal, the High Court substituted the fine with an imprisonment term of 75 days and increased the disqualification period to three years. 24        A person knows the amount of alcohol he has consumed. The higher the amount of alcohol he has consumed, the greater would be his knowledge that he is likely to be “over the limit”. So if he chooses to drive after consuming a large quantity of alcohol, it is obviously an aggravating factor of the offence. Therefore there will be situations where it will be appropriate to sentence the offender to imprisonment where the amount of alcohol in his breath or blood is much higher than the prescribed limit, even though there is no evidence of any lack of control when he drove the vehicle on the road. 25        The other major factor is degree of control of the vehicle. The objective behind the offence in s 67(1)(b) is to prohibit persons from driving who have too much alcohol in their bodies as to render such activity unsafe. Therefore a person’s inability to control the vehicle, and this obtains even if the alcohol level is only slightly over the prescribed limit, would be an aggravating factor. A person may not know what his breath or blood alcohol content is, but he would know that he is affected by alcohol to the extent that he is unable to control his vehicle. So if a person drives a vehicle when he is unable to control it to the extent that he causes injury or damage, or poses great danger to others under egregious circumstances, imprisonment could be the appropriate sentence. 26        I have set out the main factors that affect the decision to sentence an offender to imprisonment. It is not possible, nor is it desirable, to be more specific than that because each case turns on its own facts. Turning to the present case, the respondent had 77 microgrammes of alcohol per 100 millilitres of breath. It is 2.2 times the prescribed limit of 35 microgrammes. This is not a case where the offender has just crossed the limit. It is more than twice the prescribed limit, although this of itself this might not have justified a sentence of imprisonment for a first offender. 27        But there is another important factor in this case: the degree of control over the vehicle exhibited by the respondent. He was involved in a collision with a motorcycle which had resulted in injuries to the rider and serious injuries to the pillion rider. The latter suffered “open comminuted fractures and near-amputation at the distal, middle and proximal phalanges of the left third toe” as well as an “intra-articular fracture of the distal left radius”. It must be stated at the outset that the fact of involvement in an accident by itself does not necessarily show that the driver was not in control of his vehicle. The circumstances in which the accident occurred must be examined. Take the example of a motorcar that has stopped at a signalised junction waiting for the traffic light to turn green. If a motorcyclist comes along and collides into the rear of the motorcar, its driver cannot be said to have displayed poor control of his vehicle. However in the converse situation, i.e. the motorcar collides into the rear of a motorcycle stopped in a junction waiting for the lights to turn green, this would show that the driver had poor control of the vehicle. There are other factors that indicate poor control such as the manner in which the vehicle is driven, e.g. speed of travel, whether it remains in lane and whether it complies with other traffic rules. 28        The circumstances of the accident in the present appeal are set out in the statement of facts and the mitigation plea. The respondent had stopped his motorcar along Serangoon Road, awaiting the traffic signal to turn right into Kitchener Road. The motorcycle concerned had stopped to his right. Due to the respondent’s failure to keep a proper lookout ahead, he caused the right front side of his car to collide with the left rear side of the motorcycle. It is stated in his mitigation plea that all he perceived was a slight bump at the right side of his car and he “realised that he might have been involved in a collision”. This was despite the fact that the motorcycle was travelling ahead of him to his right, which is the driver’s side, and the collision was between the right front side of his vehicle and the left rear side of the motorcycle. It is difficult to envisage how a person could fail to fully realise that he had knocked down a motorcycle where this takes place on the front right side of the vehicle. This could be explained by the part of the mitigation plea that stated that the respondent was “in a daze” after the collision and had been shocked and confused. Whatever the explanation may have been, these facts indicate very strongly that the respondent had poor control of his vehicle. 29        Where a first offender of an offence under s 67(1) has a high level of alcohol combined with poor control of his vehicle, notwithstanding that by itself any of those factors would not have merited a sentence of imprisonment, a sentence of imprisonment could be justified. In my view, it is justified on the facts of this case and I find the sentence of a fine imposed on the respondent to be manifestly inadequate. 30        Turning to the term of imprisonment that ought to be imposed, I noted that the respondent was a first time offender who pleaded guilty to the charges. He had taken some degree of precaution such as his decision to take public transport earlier that night. Such precautions arguably reflect a lesser degree of wilful disregard for the law. However the amount of weight to give to this factor is quite another issue as it is far too easy for an offender to undertake precautions, but thereafter underestimate the level of alcohol remaining in his system, as amply illustrated by the present case. In view of the fact that the respondent had shown remorse, fully cooperated with the police upon his apprehension and pleaded guilty, a two-week term of imprisonment would be appropriate. As for the disqualification, in my view the appropriate period is three years.",
        "Failure to render assistance: s84(3) of the Act": "31        Section 84(3) of the Act imposes a duty on the driver of a vehicle involved in a road accident to render such assistance as he reasonably can. Under s 84(8), a first offender who fails to comply with s 84(3) in circumstances where he has caused serious injury or death to another person is punishable with a fine of up to $3,000 or imprisonment for up to 12 months. 32        As with most offences, there is a spectrum of circumstances encompassing varying degrees of culpability, ranging from the least serious, where the driver reasonably contemplates negligible damage or the absence of injury, to the other extreme, where the driver perceives the carnage of crumpled metal, torn flesh and spilled blood. In between these extremes, there are varying shades of gray. Although the offence under s 84(8) is made out once there is death, injury or damage to property, the appropriate degree of punishment must depend on what the offender reasonably apprehends, and not the actual degree of damage that was occasioned, although they tend to be correlated. 33        In cases involving serious injury or death, the range of imprisonment sentences have been for 3 to 6 weeks and a disqualification period of 18 months:PP v Rohaizad bin Kasmoh(TAC 2412/98);Tan Hin Tat v PP(MA 4/2002/01);PP v Koh Liang Choon[2006] SGDC 234;PP v Fernandez Joseph Ferdinent[2007] SGHC 60. Considerations affecting the severity of the sentence include,inter alia, (i) the degree of injury or property damage suffered; (ii) evidence of alcohol consumption; (iii) failure to stop to evade arrest; and (iv) prior antecedents. In the present appeal, the appellant did not dispute that the 4-week custodial sentence imposed for the hit and run charge was within the prevailing range for such offences. However the appellant submitted that there was a need for a review of the prevailing benchmark sentences for such offences, given that the sentences currently imposed have demonstrably failed to deter like-minded offenders. 34        Undoubtedly, hit and run offences must be severely dealt with as it constitutes a reprehensible abdication of the fundamental moral obligation to render assistance to the victim of an accident engineered by one’s negligence or recklessness. In 2002, Parliament, during the second reading speech of the Road Traffic (Amendment) Bill, emphasized the need to deal severely with such offenders and explained that: The Road Traffic Act is also amended to enhance the measures we can take against hit-and-run drivers. The number of hit-and-run cases involving injuries or fatalities remains high. There were 179 hit-and-run cases in the year 2000 and 154 cases in 2001. These figures were higher than any of the preceding years since 1993. The act of hitting a person and driving off without stopping is wholly unacceptable. This is especially so when such failure to render assistance can mean the difference between life and death to the victim. 35        The appellant highlighted the continual uptrend in the incidents of such offences and suggested a revised sentence of 4 to 6 months’ imprisonment on the basis that repeated legislative and judicial admonishments of hit-and-run offenders have not had their desired deterrent effect. 36        Sentencing reflects a variety of penal objectives and is governed by a smorgasbord of tensive principles. I agree that sentences have some part to play in instilling a sense of responsibility in the accused and like-minded offenders by discouraging such cowardly and irresponsible conduct, but remain unconvinced by the prosecution’s argument for the blanket upward revision of “deterrent” sentences by more than four times solely in response to the increasing incidents of hit-and-run offences. 37        In the classic exposition of sentencing principles proffered inSargeant(1974) 60 Cr. App. R 74, Lawton LJ opined (at para 1.60) that: So far as the deterrence of others is concerned, it is the experience of the courts that deterrent sentences are of little value in respect of offences which are committed on the spur of the moment, either in hot blood or in drink or both. Deterrent sentences may very well be of considerable value where crime is premeditated. 38        Similar sentiments were echoed by V K Rajah J inPP v Law Aik Meng[2007] 2 SLR 814, in which he observed (at [22]) as follows: Specific deterrence is usually appropriate in instances where the crime is premeditated:Tan Fook Sumat 533, [18]. This is because deterrence probably works best where there is aconsciouschoice to commit crimes. Nigel Walker and Nicola Padfield inSentencing: Theory, Law and Practice(Butterworths, 1996, 2ndEd) (“Padfield & Walker, 1996”) at p99 explain the theory of undeterribility. Pathologically weak self control, addictions, mental illnesses and compulsions are some of the elements that, if possessed by an offender, may constitute ‘undeterribility’, thus rendering deterrence futile. Such elements seem to involve some form of impulse or inability to make proper choices on the part of the offender, which, by definition, runs counter to the concept of premeditation. It should be pointed out here that this reasoning applies with equal cogency togeneraldeterrence (discussed below from [24] to [28]). 39        Against this backdrop, it appears to me that an offender who decides to hit-and-run does not do so as a result of a series of rational thought processes calculated to achieve a desired result. While the decision to “run” can undoubtedly be characterised as a “conscious choice”, such “flight mentality” tends to be motivated by fear, confusion and some sort of impulse to hide from the consequences of one’s folly as a result of the accident. This does not in any way detract from the culpability of the offender or the moral reprehensibility of such conduct, which must undoubtedly be punished as an abdication of the fundamental duty to assist. 40        Nonetheless, the issue before me is whether a “deterrent” sentence four times the length of what is presently usually imposed for such cases would be effective to stem the flow of such offences. In this regard, the appellant has not placed before me any evidence that the suggested sentence would have such effecti.e., that a person would be less likely commit such an offence if the range of sentences was enhanced to that extent. The argument advanced was merely that a more severe sentence would have that effect simply because it was harsher. 41        As a counterpoint to the intuitively appealing assumption of the hydraulic proportional relationship between sentences and criminal behaviour, some have suggested that it is beliefs about the probability of detection rather than the quantum of punishment which are more likely to influence human behaviour (Andrew Ashworth, “Sentencing and Criminal Justice” (4thEd) at[3.3.2]). On this note, it should be highlighted that it is desirable in the interest of fairness to offenders sought to be made an example of, that “deterrent sentences” are buttressed by reasonable grounds for the supposition that the example will have the result intended: Eric Stockdale and Keith Devlin,Sentencing(London: Waterlow, 1987) at [1.70]. 42        Sentences imposed in the name of deterrence that are disproportionate to the severity of the offence committed or the moral and legal culpability of the offender must be done on the basis of adequate evidence that it is likely to have the desired effect and not upon the simplistic argument that “more is better”.  Therefore I disagreed with the appellant’s submission that the trial judge’s sentence of 4 weeks’ imprisonment was manifestly inadequate. 43        For the reasons set out above, I dismissed the appeal in respect of the third charge. I allowed the appeal only in respect of the first charge and set aside the district judge’s sentence of a fine of $3,000 and a disqualification period of two years on the charge of drink driving and substituted it with imprisonment for a term of 2 weeks and a disqualification period of three years. I ordered the 2-week imprisonment sentence to run consecutively with the 4-week imprisonment sentence imposed for the hit-and-run charge. Since the sentence under the first charge is either a fine or imprisonment, I ordered the fine of $3,000 that the respondent had paid to be returned to him. [note: 1]Page925 of the 2ndEdition of Sentencing Practice in the Subordinate Courts."
    }
}