{
    "case_title": "Lee Kuan Tat v Public Prosecutor",
    "ncitation": "[2007] SGHC 65",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Introduction": "1          This is an appeal against sentence. The appellant, Lee Kuan Tat, was charged with and pleaded guilty to ten charges under s 8(1)(b)(ii) of the Moneylenders Act (Cap 188, 2006 Rev Ed) (“the Act”) for carrying on a business of moneylending without holding a licence. A further 21 similar charges were taken into consideration for the purpose of sentencing. 2          For each of the ten charges, the district judge sentenced the appellant to 4 months’ imprisonment and a fine of $30,000, with 4 months’ imprisonment in default. The district judge ordered the sentences of imprisonment for two of these charges (DAC Nos 37535 and 37537 of 2006) to run consecutively. The total sentence was therefore 8 months’ imprisonment and fines totalling $300,000. With the default sentence of 4 months for each fine, if the appellant did not pay anything at all, he would have to serve a further 40 months’ imprisonment. 3          Under s 8(1)(b)(ii) of the Act, the court may sentence the appellant to a fine ranging from $20,000 to $200,000 as well as to an imprisonment term not exceeding five years. After hearing the submissions of the appellant and the DPP, I dismissed the appeal. I now give my reasons.",
        "The facts": "4          The appellant started carrying on a business as a moneylender without a license in June 2003. He was known to his debtors as “Ah Heng”. An interest rate of 20% was imposed on each loan and the debtor was required to furnish a guarantor. 5          Sometime in October 2004, the appellant recruited one Chin Wei Kee (“Chin”) to assist in the illegal moneylending activities and paid him a monthly remuneration of $1,800. 6          Themodus operandiadopted by the appellant and Chin was generally as follows: The appellant and Chin would communicate with each other on their mobile phones. In a similar manner, Chin would communicate with potential debtors by mobile phone and inform them of the terms of the loan. The interest charged on the loan would usually be 20% of the principal amount over six to eight weeks. Details of the debtors, including their bank account numbers and their guarantors, would be kept in a laptop computer and thumb drives. 7          Prior to a loan being issued to a debtor, Chin would contact the appellant and provide him with the debtor’s personal particulars. The appellant would then issue the loan to the debtor by transferring the money to the debtor’s bank account. In respect of repayments, on the instructions of the appellant, Chin would direct the debtors to deposit their repayments into two designated bank accounts. 8          Over time, the appellant and Chin entered into a profit sharing arrangement whereby Chin would receive 25% of the profit of the moneylending business. 9          In all ten charges, the acts constituting the offences were committed from January to June 2006. The loans were for sums of $1,000 to $2,000, repayable within six to eight weeks at an interest rate of 20%.",
        "The proceedings below": "10        Given that the appellant’s plea of guilt and his consequent convictions, the sole issue before the district judge was the appropriate sentence to impose. 11        In the appellant’s mitigation plea, the appellant submitted that it was Chin who approached him and proposed that he run a sideline business of illegal moneylending for the appellant. The appellant added that he initially refused to the scheme but subsequently agreed only because his wife was demanding large sums of money to settle their divorce without a contest. It was further submitted that the appellant had not harassed his debtors for the return of the loans. 12        In assessing the appropriate sentence, the district judge was mindful that this was the appellant’s third conviction under the Act for carrying on an illegal moneylending business. The district judge found that the illegal moneylending activity was a well run operation. Bank accounts were opened for debtors to deposit their repayments and the information was stored in a laptop computer and thumb drives. The appellant was the main operator behind the scheme. He supplied the funds and had recruited Chin and another unknown person to issue loans to the debtors. The district judge added that the illegal moneylending business must have been good because the appellant and Chin subsequently entered into a profit sharing arrangement. Given that a high interest rate of 20% was charged on each loan, the district judge concluded that the profit margin was high and it was thus reasonable to assume that the appellant had the means to pay fines. 13        The district judge also noted that the recent 2005 amendments to the Act saw Parliament taking a stronger stance against illegal moneylending activities by enhancing the penalties for carrying on a business of moneylending without a licence. 14        After considering the appellant’s mitigation plea and the recent amendments to the Act, he imposed the sentences of 4 months’ imprisonment and $30,000 fine, in default 4 months’ imprisonment, for each charge, with two of the sentences of imprisonment to run concurrently.",
        "The appeal against sentence": "15        Dissatisfied with the sentences meted out by the district judge, the appellant filed the present appeal. In essence, the appellant submitted that (a) the total default sentence of 40 months’ imprisonment in lieu of the fine of $300,000 in respect of the 10 charges was manifestly excessive; and (b) there was a disparity in sentence between the appellant and the co-accused, Chin. Chin was sentenced to 15 months’ imprisonment and $400,000 fine in default 20 weeks’ imprisonment. 16        In response, the prosecution contended that there was no merit in the appellant’s grounds of appeal so as to interfere with the district judge’s sentences. The prosecution submitted that (a) the 40 months’ default sentence was appropriate to deter the appellant from evading the fines that he had been sentenced; and (b) the appellant had played a bigger role in the scheme as compared to Chin and that was sufficient reason for the differentiation in sentence between the appellant and Chin.",
        "Nature and purpose of the Act": "17        In Singapore, the conduct of the business of moneylending is regulated by the Act. The nature and legislative purpose of the Act was recently considered by the Court of Appeal inDonald McArthy Trading Pte Ltd and Others v Pankaj s/o Dhirajlal (trading as TopBotton Impex)[2007] SGCA 8, where Chan Sek Keong CJ, delivering the grounds of decision of the court, said at [6] to [7]: It is trite that a court should give effect to the legislative purpose when interpreting an Act of Parliament. From the transcripts of parliamentary debates on the enactment and subsequent amendments of the Act, it is clear that Parliament intended the Act to be a social legislation designed to protect individuals who, being unable to borrow money from banks and other financial institutions, have to turn to unscrupulous unlicensed moneylenders who prey on people like them.For example, inSingapore Parliamentary Debates, Official Report(2 September 1959) vol 11 at col 593, Mrs Seow Peck Leng made the following remarks: This Bill [referring to the Moneylenders Bill] is laudable for the fact that it protects the poor from the clutches of unscrupulous moneylenders. This Bill, in my opinion, should be implemented as soon as possible to ease the hardship of those already victimised and to prevent those who, because of financial difficulties, may be victimised in the future … It is the very, very poor, Sir, who need protection most, who usually take loans of less than$100, and I think that they are the ones who should be protected… These expressions of legislative purpose have been reiterated whenever the Act has come up for amendment in Parliament. For example, inSingapore Parliamentary Debates, Official Report(28 May 1993) vol 61 at col 294, Prof S Jayakumar (the Minister for Law) said: Sir, this Bill amends the Moneylenders Act to increase the quantum of penalties for illegal moneylending… Members, I am sure, would have read numerous accounts in the press of illegal moneylenders or loansharks resorting to the use of threats and violence in extracting payment from debtors for loans given. These loans were often at exorbitant rates of interest.They prey on debtors who, having no access to the usual channels of raising finance, had no recourse except to look to those loansharks for their funds. [emphasis added] 18        Due to the rise in the number of illegal moneylending cases, the Act was amended in 1993 and most recently in 2005 to impose more severe punishments on those involved in unlicensed moneylending activities. Of direct relevance is s 8(1)(b)(ii) which deals with repeat offenders. In 1993, the fines were increased to between $20,000 and $200,000 from the maximum fine of $5,000. In addition, a discretionary term of imprisonment of up to 12 months could be imposed. Unfortunately, despite the increase in penalties, the number of illegal moneylending activities continued unabated and Parliament recognised the need to further enhance prosecution and punishment so as to send a strong message to all illegal moneylenders that such activities will not be tolerated. Thus, the Act was amended again in November 2005 and they took effect in January 2006. The objective behind the 2005 amendments was to introduce higher penalties to curb the rise in illegal moneylending activities and related harassment cases. As noted by the district judge at [15] in his Grounds of Decision, the following remarks made by the Senior Minister of State for Law, Associate Professor Ho Peng Kee, at the second reading of the Moneylenders (Amendment) Bill in 21 November 2005 (Parliamentary Debates, vol 80 at col 1831) are germane: Sir, as for these amendments which are under consideration, Parliament shouldsend a strong signal to loansharks that we will not tolerate the conduct of unlicensedmoneylending activities, where exorbitant interest rates are charged and borrowers and even non-borrowers are harassed in their own homes. Therefore, this Bill seeks to increase the penalties for unlicensed moneylending under the Moneylenders Act as follows: First, the existing fines for offenders who carry out unlicensed moneylending activities or harassment cases will be doubled; Secondly, the meaning of \"harassment\" will be refined to make it difficult for any accused to argue that an isolated act does not constitute harassment; Thirdly, in harassment cases, first-time offenders who, in the course of harassment, cause damage to property or hurt to person will be liable to caning; and Fourthly,repeat offenders ofillegal moneylendingwill be subject to mandatory imprisonment, whilst repeat offenders of harassment where hurt to person or damage to property is caused will be subject to mandatory caning. … Bank accounts are now used by runners to collect debts on behalf of unlicensedmoneylenders. Debtors are increasingly being asked to make interest and principal repayments of their debts by depositing them into bank accounts. Such arrangements make it difficult for the police to detect unlicensedmoneylending activities.As such, a new provision will create a presumption that any person whose bank account or ATM card has been proven to have been used in the collection of debts by an unlicensed moneylender is presumed to have assisted in the carrying out of unlicensed moneylending activities. But, of course, this is a rebuttable presumption. … In conclusion, Sir, these amendments are needed to send a strong signal that the Government has zero tolerance for unlicensed moneylending activities.  The enhanced deterrent effect should also help stem the increase that we have seen in such activities. [emphasis added] 19        With the 2005 amendments to the Act, the maximum prescribed punishment for a second or subsequent offence under s 8(1)(b)(ii) of the Act was a fine up to $200,000 and a mandatory term of imprisonment of up to five years. 20        I pause to point out that there is a separate and heftier offence for illegal moneylenders who resort to harassment and intimidation in the course of extracting repayments from debtors under s 33 of the Act. The 2005 amendments saw the doubling of fines imposed under s 33. The term of imprisonment has been enhanced. Caning has also been introduced for offenders who commit damage to property during the course of harassment and repeat offenders of harassment will be subject to mandatory caning when hurt to person or damage to property is caused. Section 33 of the Act reads: Harassing debtor, besetting his residence, etc. 33.—(1)   Subject to subsection (3), where a person who does not hold a licence but who is presumed to be a moneylender under section 3 — … in connection with the loan to the debtor (whether or not he does the act personally or by any person acting on his behalf), he shall be guilty of an offence and — (i) in the case of a first offence, shall be liable on conviction to a fine of not less than $4,000 and not more than $40,000 or to imprisonment for a term not exceeding 3 years or to both; (ii) in the case of a second or subsequent offence, shall be liable on conviction to a fine of not less than $4,000 and not more than $40,000 and shall also be punished with imprisonment for a term not exceeding 6 years; and … (3)   Subject to section 231 of the Criminal Procedure Code (Cap. 68) — (a) a person who is convicted for the first time of an offence under subsection (1) or (2) shall also be liable to be punished with caning… (b) a person who is convicted of a second or subsequent offence under subsection (1) or (2) shall also be punished with caning…",
        "Decision of the court": "21        As mentioned at [15] the appellant is essentially appealing against the sentence of 40 months’ default imprisonment. Section 224 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“CPC”) deals with the provisions as to sentence of fine and default sentences. The relevant portion of s 224 CPC reads: 224.Where any fine is imposed under the authority of any law for the time being in force then, in the absence of any express provision relating to the fine in such law, the following provisions shall apply: … (c) the term for which the court directs the offender to be imprisoned in default of payment of a fine shall be as follows: (i)if the offence is punishable with imprisonment for any term exceeding 6 months it shall not exceed one half of the term of imprisonment which is the maximum fixed for the offence; … (d) the imprisonment which the court imposes in default of payment of a fine may be additional to a sentence of imprisonment for the maximum term awardable by the court under section 11 provided that the aggregate punishment of imprisonment passed on an offender at one trial shall not exceed the limits prescribed by section 17. [emphasis added] 22  Under s 8(1)(b)(ii) of the Act, the maximum imprisonment sentence prescribed is five years and by virtue of s 224(c)(i) CPC, the maximum term for which the court may direct the appellant to be imprisoned in default of payment of the fine is 2 ½ years. The sentence of 4 months in default of payment of fine is within this provision. The total sentence of 8 months’ imprisonment and 40 months’ default sentence is also within the limit set in s 224(d) of the CPC. 23  The crux of this appeal is whether the 40 months’ default sentence is manifestly excessive in light of Chin’s sentence of 20 weeks’ default sentence? The prosecution referred to the case ofChia Kah Boon v PP[1999] 4 SLR 72for the proposition that the guiding principle in determining the length of default sentence is that it must not be too short as to deter the appellant from evading the fines to which he had been sentenced. In addition, if the appellant should default on the fines, the imprisonment terms ought to constitute sufficient punishment for the appellant. 24  Before me, Counsel for the appellant, Mr Kumar, submitted that the appellant had never disputed the 10 charges and submitted that the roles played by both the appellant and Chin were of equal culpability. Chin would scout for potential debtors and in turn, the appellant would provide the necessary funds. At this juncture, it bears mentioning that Mr Kumar, for the first time, submitted that the profit sharing arrangement between the appellant and Chin was on a 75:25 basis in 2005 but in 2006 both parties enjoyed equal profits. Mr Kumar added that both the appellant and Chin were not first time offenders and accordingly, there was no justification in imposing a 40 months’ default sentence on the appellant when Chin only received 20 weeks’ default sentence. On that note, Mr Kumar submitted that there should be parity in sentence between the appellant and Chin. 25  The prosecution responded to the appellant’s contentions by raising the following arguments. First, in so far as the Statement of Facts before the district judge was concerned, the appellant and Chin’s share in the profits was on a 75:25 basis. There was no mention that the appellant and Chin enjoyed equal shares in 2006. Second, the appellant was the initiator and financier of the operation. He provided the funds and recruited Chin as the face of the operation. As such, the 40 months’ default sentence was justified. 26  The position in law with regard to disparity in sentence is articulated inPP v Ramlee and Anor[1998] 3 SLR 539where Yong Pung How CJ observed at [7]: Where two or more offenders are to be sentenced for participation in the same offence, the sentences passed on them should be the same, unless there is a relevant difference in their responsibility for the offence or their personal circumstances: see Archbold (1998), para 5-153. An offender who has received a sentence that is significantly more severe than has been imposed on his accomplice, and there being no reason for the differentiation, is a ground of appeal if the disparity is serious. This is even where the sentences viewed in isolation are not considered manifestly excessive: seeR v Walsh(1980) 2 Cr App R (S) 224. InR v Fawcett(1983) 5 Cr App R (S) 158, Lawton LJ held that the test was whether ‘right-thinking members of the public, with full knowledge of the relevant facts and circumstances, learning of this sentence consider that something had gone wrong with the administration of justice?’ [emphasis added] 27        The well-established principle that the courts should strive towards parity in sentencing has been reiterated by numerous authorities: seeSarjit Singh Rapati v PP[2005] 1 SLR 638,PP v Tan Chee Seng & Ors[2004] 1 MLJ 392andChua Chuan Heng Allan v PP[2003] 2 SLR 409. That said, although consistency in sentencing is certainly desirable, it is not an overriding consideration. The principle is flexible and takes into account the factual matrix of each case. In this regard, reference may be made toLim Poh Tee v PP[2001] 1 SLR 674where Yong Pung How CJ held at [30]: [W]hile consistency in sentencing was a desirable goal, this was not an inflexible or overriding principle. The different degrees of culpability and the unique circumstances of each case play an equally, if not more, important role. Furthermore, the sentences in similar cases may have been either too high or too low:PP v Mok Ping Wuen Maurice[1999] 1 SLR 138at para 26, followingYong Siew Soon v PP[1992] 2 SLR 933at p 936. 28        In the case before me, I agreed with the prosecution that the appellant was the main man behind the illegal moneylending business. In my view, the appellant clearly played a much bigger role in the entire operation. The appellant was operating as a loanshark. He was the brain behind the business and he had recruited runners to front the operation. Accordingly, this was sufficient justification for imposing a heavier sentence on the appellant. 29        Mr Kumar also submitted that, as there was no evidence that the debtors were exposed to any harm or violence, the punishment imposed on the appellant was excessive. During the hearing, I asked Mr Kumar how the appellant would have obtained repayment from his debtors in the event of non-payment. In response, Mr Kumar submitted that the appellant would have forgone the money and maintained that the appellant would not have used any threat or violence. 30        Although there is nothing in the statement of facts alleging that the debtors were harassed or exposed to threats or violence, Mr Kumar’s submission that the appellant would not have resorted to threats or violence and meekly forgone the money is naive to the extreme. This is a systematic moneylending operation with a large number of debtors employing computers and electronic banking to process loans and repayments. The scheme has all the hallmarks of an oppressive loansharking operation. An exorbitantly high interest rate was charged on the principal amount: 20% over a period of six to eight weeks (this amounts to over 200% per year). Only the desperate would resort to this source of loans and recovery would often require harsh enforcement methods. The business was conducted in a furtive and elusive manner. In the appellant’s bid to avoid detection and arrest by the authorities, records were stored in thumb drives and in a laptop computer and repayment of loans were paid into two designated bank accounts. The illegal moneylending activities were conducted by people who have previous convictions for the same offence. Such moneylenders have been put on notice by Parliament when the amendments were passed in 2005. 31        As mentioned at [20], s 33 of the Act is concerned with the more serious offence of harassing the debtor. An offender may be fined, sentenced to imprisonment and even caned, depending on whether he is a first or second time offender and whether the offender has caused damage to any property and/or has caused hurt to another person while committing the offence. If there had been evidence that the debtors had been exposed to threats or violence or harassment, the appellant would have faced charges under s 33 and have been liable to more severe punishment. 32        I note that the appellant is no stranger to the criminal justice system. In 1997, the appellant was charged for one count of harassing his debtor under s 33(1) of the Act and two counts of unlicensed moneylending under s 8 of the Act. A further count of unlicensed moneylending under s 8 was taken into consideration. The appellant was fined a total of $40,000. In 1998, the appellant was again charged with three counts of unlicensed moneylending under s 8. Four charges under the same provision were taken into consideration and the appellant was fined $66,000. All of his fines were fully paid. Apart from the offences convicted under the Act, the appellant has also been charged previously for armed robbery, theft in dwelling as well as the possession of obscene film and the distribution of obscene or lewd film. 33        InGoh Boon Sim v PP[MA 104/98], the offender was convicted of two charges under s 8 of the Act. The offender had given two illegal loans of $1,000 and $2,000 to two different borrowers. Like the instant case, an interest rate of 20% was charged. The offender also had previous antecedents. He had three similar previous convictions with another three taken into consideration. The trial court sentenced the offender to 6 months’ imprisonment and $60,000 fine (in default 6 months’ imprisonment) on the charge relating to the loan of $1,000 and 8 months’ imprisonment and $80,000 fine (in default 8 months’ imprisonment) on the other charge. 34        In the present appeal, the appellant is a third time offender. He was previously fined $15,000 and $22,000 for each charge under s 8 of the Act in 1997 and 1998 respectively. He either has not learned anything from those episodes or he has found the business so lucrative that it is worth the risk. Accordingly, I found that the appellant has clearly failed to learn the errors of his criminal ways and the fine of $30,000 (in default 4 months’ imprisonment) and 4 months’ imprisonment for each offence is wholly warranted. In my judgment, taking into account the factual matrix of the present appeal as well the appellant’s illustrious history of criminal antecedents, particularly for the offences under the Act, I found that 40 months’ default sentence was wholly justified. 35        The appeal was therefore dismissed"
    }
}