{
    "case_title": "Public Prosecutor v Mohamed Fadzli bin Abdul Rahim",
    "ncitation": "[2007] SGHC 177",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Tay Yong Kwang J:": "",
        "The charges": "1       The accused is now 28 years old. He pleaded guilty to three charges and consented to three other charges being taken into consideration for the purpose of sentence. There were three female victims involved in the six charges. Their names have been substituted with “Victim 1”, “Victim 2” and “Victim 3”. 2       The three charges which the prosecution proceeded with were the following: You, Mohamed Fadzli Bin Abdul Rahim,  1st Chargeon or about 1 April 2006, at about 5.00 a.m., at Geylang Drive, Singapore, being jointly concerned with one Muhamad Dhiyauddin Bin Ahmad, one Mohamad Norhazri bin Mohd Faudzi, one Yusry Shah bin Jamal, and one Khairul Zaman bin Mamon, did commit gang robbery of the following items:a.   one blue handbag value unknown;b.   one K700 Sony Ericsson handphone valued at $420/-;c.   one airline ticket value unknown;d.   one white gold chain with a diamond pendant valued at $740/-;e.   one white gold earring valued at $40/-;f.   one ring valued at $280/-;g;   one lipstick value unknown;h.   one comb value unknown;i.   one lighter value unknown;j.   cash of about $360/-; andk.   one China passport,amounting to a total value of about $1,840/-, in the possession of [Victim 1], and you have thereby committed an offence punishable under section 395 of the Penal Code, Chapter 224.2nd Chargeon or about 1 April 2006, at about 5.00 a.m., at Geylang Drive, Singapore, did rape [Victim 1], and in order to commit the said offence you voluntarily caused hurt to [Victim 1], and you have thereby committed an offence punishable under section 376(2)(a) of the Penal Code, Chapter 224.6th Chargeon or about 12 August 2006, sometime between 3.00 a.m. and 5.00 a.m., at Jalan Sam Kongsi, Singapore, did rape [Victim 3], and in order to commit the said offence you voluntarily caused hurt to [Victim 3], and you have thereby committed an offence punishable under section 376(2)(a) of the Penal Code, Chapter 224. 3       The following three charges were admitted by the accused and taken into consideration for the purpose of sentence:  3rd Chargeon or about 1 April 2006, at about 5.00 a.m., at Geylang Drive, Singapore, did voluntarily have carnal intercourse against the order of nature with [Victim 1], to wit, by forcing [Victim 1] to perform an act of fellatio on you, and you have thereby committed an offence punishable under section 377 of the Penal Code, Chapter 224.4th Chargeon or about 16 April 2006, at about 12.00 a.m., at Jalan Sam Kongsi, Singapore, together with one Mohammad Aishare bin Abdul Samad and the said Mohamad Norhazri bin Mohd Faudzi, in furtherance of the common intention of you all, did commit robbery of the following items:a.  one white handbag valued at $60/-;b.  one grey handphone valued at $400/-; andc.  cash of $60/-,amounting to a total value of at least $520/-, in the possession of [Victim 2], and you have thereby committed an offence punishable under section 392 read with section 34 of the Penal Code, Chapter 224.5th Chargeon or about 12 August 2006, sometime between 3.00 a.m. and 5.00 a.m., at Jalan Sam Kongsi, Singapore, together with one Mohammad Al-Ansari bin Basri and the said Mohamad Norhazri bin Mohd Faudzi, did commit robbery of the following items:a.  one white handbag value unknown;b.  one China Passport No. G06460325;c.   ne United Airlines air ticket value unknown;d.  cash of $600/-;e.  one blue comb value unknown;f.  one silver handphone value unknown;g.  one China Sim card value unknown;h.  one lipstick value unknown; andi  two phone books value unknown;mounting to a total value of at least $600/-, in the possession of [Victim 3], and in committing the said robbery, at least one of you voluntarily caused hurt to [Victim 3], and you have thereby committed an offence punishable under section 394 of the Penal Code, Chapter 224. 4       As can be seen from the six charges set out above, the three offences against Victim 1 took place at about 5am on 1 April 2006, the offence against Victim 2 happened on 16 April 2006 at around midnight and the two offences against Victim 3 occurred between 3 and 5am on 12 August 2006. 5       The punishment provided by law for the 1st charge of gang robbery is imprisonment for not less than 5 years and not more than 20 years and not less than 12 strokes of the cane. The punishment for the 2nd and 6th charges of rape with hurt is imprisonment for not less than 8 years and not more than 20 years and not less than 12 strokes of the cane. 6       After hearing the prosecution and the defence counsel, I sentenced the accused to 7 years imprisonment and 12 strokes of the cane for the 1st charge and 11 years imprisonment and 14 strokes of the cane each for the 2nd and 6th charges. I ordered the imprisonment terms for the 2nd and 6th charges to run consecutively and the imprisonment term for the 1st charge to run concurrently with them, making a total imprisonment term of 22 years with effect from 15 May 2007 (the date that bail for the accused was revoked by the High Court). I also ordered that the accused be subject to a maximum of 24 strokes of the cane because of s 230 of the Criminal Procedure Code (Cap 68, 1985 Ed). 7       The accused has appealed against sentence through a new firm of solicitors. As caning of not less than 12 strokes is mandatory for each of the three offences in question, the accused would be subject to no less and no more than 24 strokes of the cane on the charges. The appeal is therefore effectively against the imprisonment terms imposed.",
        "The facts – 1stand 2ndcharges": "8       The accused was working as a flight supervisor at the airport before his arrest. Victim 1 is a 27 year old Chinese national who came to Singapore on 24 March 2006 on a social visit pass. Victim 3, aged 36, is also a Chinese national. She arrived here on 6 August 2006 on a social visit pass. One of the accomplices named in the 1stcharge, Muhammad Dhiyauddin, a Malaysian, is still at large. Mohamad Norhazri, aged 21, is also a Malaysian. He lived in Johor Baru and was the driver of a two-door white Honda Civic (“the Honda car”). He is the accused’s cousin. He was arrested on 23 August 2006 and the charges against him will be dealt with separately. Yusry Shah and Khairul Zaman are both 17-year-old Singaporeans. The accomplice named in the 5thcharge, Mohammad Al-Ansari, is a 16-year-old Singaporean. They have been dealt with separately in other courts. 9       In the evening of 31 March 2006, the accomplices (in the 1st charge) entered Singapore in the Honda car. After going to Sim Lim Square Shopping Centre and finding the shops closed, they went to meet the accused. Later, Norhazri drove the other three accomplices to his grandfather’s house. They left after some time there and went to look for the accused again. This time, the accused boarded the Honda car and the group went to Geylang so that the accused could show them some night spots there. On the way there, the accused, Norhazri and Dhiyauddin came up with a plan to rob a prostitute and have sex with her for free. The others agreed to go along with the plan. The accused then told Norhazri to let Yusry, Khairul and Dhiyauddin alight at the cul-de-sac at Geylang Drive as there was otherwise no room in the Honda car to pick up a prostitute. If they were successful in picking up a prostitute, the driver would drive back to Geylang Drive and flash the headlights of the Honda car to signal to the others there that they had a prey. 10     The accused and Norhazri cruised around in the Geylang area. After they spotted Victim 1, the accused negotiated with her and agreed to pay her $80 for sex. The accused then got out of the front passenger seat in order to let Victim 1 into the back seat. She pointed out a nearby hotel and then got into the car. 11     The Honda car was then driven back to Geylang Drive where the pre-arranged flashing of headlights was done. When Victim 1 stepped out of the car, she was set upon by the accused, Norhazri and Dhiyauddin. The three men punched her face and head repeatedly and also kicked her. Norhazri pulled away her handbag. Her jewellery was snatched from her body and her blouse and brassiere were ripped off. She was then dragged to the perimeter fence of the People’s Association building where her jeans and panties were forcibly removed from her body. The accused then raped her. 12     After the attack, the group fled in the Honda car with Victim 1’s handbag. She ran naked to Nicoll Highway and hid behind a bus stop. Subsequently, she managed to flag a taxi which brought her back to the apartment she was staying in. The taxi driver gave her a rubber floor mat to cover her body. Later that day, she informed her landlord about the robbery and rape. He then brought her to make a police report the same day. 13     Victim 1’s valuables were not recovered. Yusry and Khairul were given $60 while the other three members of the gang shared the loot among themselves. 14     The gang went to Liang Court Shopping Complex for breakfast. They then left in the Honda car. The accused returned home while the other four went to Yusry’s flat to rest. Norhazri threw Victim 1’s handbag into a rubbish bin at the void deck of the said flat. After some time, the four of them returned to Malaysia. There, they sold Victim 1’s handphone. 15     Victim 1 was examined by a doctor the same day (1 April 2006). She had multiple bruises on her head, her upper and lower limbs and her body.",
        "The facts –6th charge": "16     On 11 August 2006, at about 6.15pm, the accused and Al-Ansari played sepak takraw in Tampines. When the accused told Al-Ansari that he would be going for a joy ride later with Norhazri, Al-Ansari said he would like to join them. 17     On 12 August 2006, sometime after midnight, the three of them left in the Honda car for supper. During the meal, the accused told the other two that he wanted to have sex with a prostitute for free. They then left for Geylang. 18     They could not convince any prostitute to get into the Honda car. They then decided to let Al-Ansari alight as they believed that the prostitutes were not willing to enter the car because there were three men in it. The pair cruised around for a while but did not succeed in getting a prostitute to board the car. They then returned to pick up Al-Ansari. 19     At about 3am, they spotted Victim 3 walking along Lorong 34, Geylang. Norhazri drove the Honda car alongside her and told her that the accused was interested in having sex. The price was agreed at $80. Victim 3 then got into the back seat and sat next to Al-Ansari. 20     After a few minutes of driving, Norhazri stopped the car along a road to top up water in the car’s engine as it was overheating. At this juncture, Victim 3 tried to leave the car but was prevented from doing so. While Norhazri and Al-Ansari were attending to the car’s engine, the accused got into the backseat. After that, they continued on their journey. 21     Along the way, the accused started groping Victim 3’s breasts. She struggled but he overpowered her and removed her blouse, brassiere and pants. She held on to her panties to prevent the accused from removing it. The accused took her handbag from her and shortly thereafter, they arrived at Jalan Sam Kongsi and parked the Honda car by the roadside there. 22     Al-Ansari alighted and the accused then tried to push Victim 3 out of the car. Victim 3 struggled and was punched by the accused and Norhazri repeatedly. Eventually, the three of them managed to push Victim 3 out with her holding on to her blouse and one of her shoes. The accused pulled her to the rear of a lorry which was parked along the road and wanted her to masturbate him there. She refused initially but stopped resisting because she feared further assault. After she masturbated the accused for a while, he pulled down her panties and raped her in a standing position. 23     He then returned to the car and told Al-Ansari to throw out Victim 3’s other shoe. The three men then fled in the car with Victim 3’s handbag. The accused bought a packet of cigarettes and some food for Al-Ansari and shared the contents in Victim 3’s handbag with Norhazri. The accused kept her handphone which was recovered from his flat after his arrest on 24 August 2006. 24     Victim 3 ran towards Tampines Road wearing only her panties and bleeding on the forehead. A passing taxi with a passenger in it stopped for her and brought her to a neighbourhood police centre. Later, Victim 3 brought the police to the scene of the rape where her clothes and one of her shoes were recovered. She was examined by a doctor and found to have multiple bruises and scratch marks on her head, her upper and lower limbs and her body. 25     The accused was also examined medically after his arrest. He was not found to be suffering from any sexually transmitted disease.",
        "The prosecution’s submissions on sentence": "26     The accused’s only previous conviction was for driving a motor vehicle without lawful authority for which he was fined $1,000 on 15 August 2002. 27     The prosecution highlighted the following aggravating factors justifying a deterrent sentence in this case: (a)    the accused and his accomplices had cunningly and carefully planned the robberies and the rapes; (b)    Victim 1 and Victim 3 were viciously assaulted and beaten into submission; (c)    while the accused was raping Victim 1, she was also sexually assaulted by his accomplice; (d)    this was not an isolated case committed in a moment of weakness; (e)    the male offenders outnumbered the completely helpless victims who had been brought to dark, deserted places; (f)     gross indignities were forced on the victims with Victim 1 having been forced to perform fellatio before she was raped and Victim 3 having been forced to masturbate the accused before the rape; (g)    the accused had a share in the spoils of the robberies; (h)    the accused was the oldest among the offenders and he took part in both physical and sexual assault on both victims. 28     Several precedents in rape cases were cited for my guidance includingChia Kim Heng Frederick v PP[1992] 1 SLR 361where the Court of Appeal set out the benchmark sentence of 10 years imprisonment and caning of not less than 6 strokes for an adult offender found guilty of rape under s 376(1) of the Penal Code after trial. The prosecution also relied onPP v NF[2006] 4 SLR 849where V K Rajah J (as he then was) analysed the principles pertaining to the offence of rape and laid down guidelines in dealing with this offence. 29     Where the gang robbery charge was concerned, the prosecution cited two decisions from the district court which were affirmed on appeal to the High Court. They areYeo Kee How v PP(MA 312/1992 – unreported) andRobert Anak Imbak v PP[2002] SGDC 326. In the first case, the 52 year old accused and 5 accomplices, while armed with daggers, robbed a company of electrical goods worth some $930,000. Most of the loot was later recovered. The accused, who pleaded guilty and had an unblemished record, was sentenced to 7 years imprisonment. He was spared caning by virtue of his age. In the second case, the accused, as part of a group of 12, assaulted and robbed 2 victims of several hundred dollars worth of items. He was sentenced to 7 years imprisonment and 12 strokes of the cane. 30     The prosecution also relied onPP v NF(see above) for the proposition that a plea of guilt did not automatically entitle an offender to a discount in sentence. As established in that case, a court must carefully examine the conduct of the offender in order to determine whether he was genuinely contrite. It was submitted that the accused’s plea of guilt should be given very little weight as he did not surrender to the police and only decided to plead guilty on the first day of trial after three of his accomplices had done so some time earlier.",
        "The mitigation plea": "31     According to the accused, after his accomplices arrived from Malaysia, Norhazri contacted him and asked him to join the group for supper and a tour of the city. When Norhazri suggested going to Geylang, the accused agreed to show the group around for only a short while as he had to work the next day. While they were there, the accomplices started commenting on the prostitutes in that area. Norhazri then asked Dhiyauddin if he wanted to rob somebody like they used to do in Johor Baru and suggested robbing a prostitute as an easy target. Norhazri boasted to the group that it would be easy as he had done so many times in Johor Baru until his car was “hot” in that city and he could not commit crimes there anymore. Norhazri suggested that they leave the car while he and Dhiyauddin scout around for a victim. The accomplices agreed on the pre-arranged signal of flashing the headlights. The accused declined to alight from the car as he did not know the other three accomplices. He therefore went with Norhazri in the car. 32     When they saw Victim 1, the accused negotiated the price on Norhazri’s instructions. Norhazri also joined in the negotiations as he could converse in Mandarin. At the scene of the robbery and rape, the accused did punch Victim 1 but stopped after Dhiyauddin removed her clothes with the help of the others. The accused asked Norhazri and Dhiyauddin to stop hitting Victim 1 but they paid no heed to his plea. When Norhazri and Dhiyauddin asked the accused to have sex with her, he agreed in a moment of impulsiveness. The rape took place while they were in a standing position. It was over in a few minutes. The accused had about $50 in his hand and wanted to pay Victim 1 but Norhazri told him there was no need to do so. The accused received only $70 from the spoils of the robbery, some of which he used to pay for the petrol for the car and the balance thereof he returned to Norhazri and Dhiyauddin. These two men were the “major perpetrators of violence” against Victim 1 and, being experienced criminals, were the “prime movers in orchestrating the robbery”. 33     Where the offences against Victim 3 were concerned, the accused and Al-Ansari were playing sepak takraw when Norhazri contacted them to go for supper. During supper, the accused mentioned his intention of having sex with a prostitute for free. However, he changed his mind later and asked Norhazri to send him home. Al-Ansari then suggested going to Geylang to look at prostitutes. Upon Norhazri’s insistence, the accused accompanied them to Geylang in the car. It was Norhazri who asked Al-Ansari to alight as he felt that prostitutes would be unwilling to enter the car with three men in it. When they subsequently saw Victim 3, it was Norhazri who negotiated the price for her sexual services. 34     On the way to Jalan Sam Kongsi, the accused removed Victim 3’s blouse, brassiere and pants. He also took away her handbag but handed it to Norhazri. When they arrived, Victim 3 refused to alight and started a commotion. Norhazri then turned around suddenly from the driver’s seat and punched her face repeatedly. The accused also punched her several times but not on her face. After Victim 3 got out, Norhazri asked the other two to bring her to the back of a lorry so that she would not be able to identify his car. Victim 3 then bent over and submitted to the rape. 35     After the rape, the accused wanted to return Victim 3 her pants and pay her but Norhazri said it would be fun to leave her half naked there. The accused was given about $100 from the robbery which he used to buy cigarettes and food for Al-Ansari. He kept her handphone for Norhazri because Norhazri told him to. When the accused was arrested, he volunteered the information about the handphone to the police. 36     Counsel for the accused highlighted the absence of the following factors which would have warranted a harsh sentence: (a)    there was no abuse of a familial relationship here; (b)    the accused played a minor role in the assault and was under Norhazri’s influence; (c)    the victims did not contract any sexually transmitted diseases or become pregnant as a result of the rapes (it was not disputed that Victim 3’s sexually transmitted disease was not caused by him); (d)    the victims were neither young nor virgins; (e)    while they suffered trauma, there was no indication that they suffered devastating harm as a result of the incidents; (f)     no weapons were used in the commission of the offences; (g)    it was not a case of multiple rapes of the same victim by the same perpetrator; (h)    the previous conviction had no bearing on the present charges. 37     The accused was remorseful. He had made statements admitting to the offences and implicating his accomplices. He agreed to plead guilty on the prosecution’s original offer on the first day of trial, thus gaining no tactical advantage. While the prosecution had expended resources in preparing for the trial, the plea of guilt nevertheless resulted in saving of judicial time. The victims were also spared the trauma of having to testify about the unpleasant incidents in court. 38     The accused did not try to flee during the period he was on bail. He is willing to testify for the prosecution in Norhazri’s trial. 39     After he made his plea in court, he made payment of $1,000 compensation to each of the three victims through the police, in the hope that it would assist them, in whatever small way, to move on. The value of the items taken in the robberies was relatively small and the accused did not profit substantially from the robberies. He knew about the gang robbery only on the day of the incident. 40     The sentencing precedents cited by the prosecution were all distinguishable on their facts. 41     Where the accused’s personal circumstances were concerned, his father passed away suddenly in March 2006 and he had to shoulder the responsibility of looking after his aged and sickly mother with his humble income. He wished to be re-united with her as soon as possible after serving his sentence. He was a good uncle to his elder sister’s children. He also rendered social service by coaching a community centre’s sepak takraw team. 42     The accused wrote a letter to the court to express his anguish and regret over his foolish acts. The various testimonials from his family members, friends and his religious teacher showed his true character. His good character, together with the strong support from his family, would “certainly guard against any chance of [the accused] re-offending”. 43     The accused had spent slightly more than a month in remand before he was released on bail on 26 September 2006. He has been in custody since 15 May 2007 (when the bail was revoked by the High Court).",
        "The decision of the court": "44     S 18 of the Criminal Procedure Code provides: Where at one trial a person is convicted and sentenced to imprisonment for at least 3 distinct offences, the court before which he is convicted shall order that the sentences for at least two of those offences shall run consecutively. Section 230 of the Criminal Procedure Code provides that the maximum number of strokes that an adult accused has to undergo for one trial shall not exceed 24. It follows that the accused would have to undergo, at the very minimum, 13 years imprisonment (if I ordered the minimum imprisonment term of 5 years for the gang robbery charge and the minimum imprisonment term of 8 years for one of the rape with hurt charges to run consecutively) and would be subject to exactly 24 strokes of the cane because of the mandatory minimum caning for each of the three offences and by virtue of s 230 of the Criminal Procedure Code. 45     InChia Kim Heng Frederick v PP(see above at [28]), a 32-year-old accused pleaded guilty to one count of rape of a 16 year old girl under s 376(1) of the Penal Code and was sentenced to eight years’ imprisonment and eight strokes of the cane. His appeal to the then Court of Criminal Appeal was dismissed as the sentence was not found to be manifestly excessive. The court (at 367) provided some guiding principles in sentencing in rape cases under s 376(1). It held that the starting point in a contested case, without any aggravating or mitigating factors, should be ten years’ imprisonment and caning of not less than six strokes. The court should then consider the mitigating factors such as a plea of guilt (which would merit a reduction of one-quarter to one-third of the imprisonment term) and the aggravating factors such as the victim’s youth, the accused’s position of responsibility and trust towards her and perversions or gross indignities forced on the victim. 46     InPP v NF(see above at [28]), V K Rajah J said (at [19] to [23]: 19     In this regard, it would be profitable to refer toR v William Christopher Millberry[2003] 2 Cr App R (S) 31 (“Millberry”), where the English Court of Appeal recently had the opportunity to review the sentencing practice of the English courts for rape offences. Building upon the analytical sentencing framework established in the leading case ofR v Keith Billam(1986) 8 Cr App R (S) 48 (“Billam”), the Court of Appeal in Millberry accepted the continued relevance and validity of the four broad categories of rape first articulated inBillam. These categories were designed and calibrated to ensure both stability and a measure of predictability in sentencing rape offenders by assigning a benchmark sentence to each category. 20     At the lowest end of the spectrum are rapes that feature no aggravating or mitigating circumstances. The second category of rapes includes those where any of the following aggravating features are present: (a)    The rape is committed by two or more offenders acting together. (b)    The offender is in a position of responsibility towards the victim (eg, in the relationship of medical practitioner and patient, teacher and pupil); or the offender is a person in whom the victim has placed his or her trust by virtue of his office of employment (eg, a clergyman, an emergency services patrolman, a taxi driver or a police officer). (c)    The offender abducts the victim and holds him or her captive. (d)    Rape of a child, or a victim who is especially vulnerable because of physical frailty, mental impairment or disorder or learning disability. (e)    Racially aggravated rape, and other cases where the victim has been targeted because of his or her membership of a vulnerable minority (eg, homophobic rape). (f)     Repeated rape in the course of one attack (including cases where the same victim has been both vaginally and anally raped). (g)    Rape by a man who is knowingly suffering from a life-threatening sexually transmitted disease, whether or not he has told the victim of his condition and whether or not the disease was actually transmitted. 21     The third category of cases involves those in which there is a campaign of rape against multiple victims. The fourth category deals with cases where the offender “has manifested perverted or psychopathic tendencies or gross personality disorder, and where he is likely, if at large, to remain a danger to women for an indefinite time”: seeBillamat 50-51. 22     The benchmark sentences set by the court inMillberryfor each of the four categories are as follows: for the first category of rape offences, the starting point is five years’ imprisonment; for the second, eight years’ imprisonment; for the third, 15 years’ imprisonment; and for the fourth, a life sentence. 23     Because Singapore’s legislative sentencing scheme and policy considerations are not altogether similar, it would be decidedly inappropriate for our courts to unreservedly adopt the precise sentencing benchmarks articulated inMillberry. … That said, the approach inMillberryandBillamof classifying rape offences into various broad categories is both helpful and useful and may be broadly adopted and employed with appropriate adaptation. 47     After a review of many past cases of familial rape, V K Rajah J concluded that the appropriate starting point for category 2 rapes was 15 years’ imprisonment and 12 strokes of the cane. Where category 3 rape was concerned, the learned judge said that in most cases where the offender had terrorised the same victim multiple times or where he had assaulted multiple victims, the prosecution would proceed with multiple charges and the court would then have the option of exercising its discretion to order more than one sentence to run consecutively. As such, there would be no overriding need for the court to commence sentencing at a higher benchmark than that applied to category 2 rapes. For category 4 rapes, it was held that it would not be inappropriate to sentence the offender to the maximum of 20 years’ imprisonment and 24 strokes of the cane if the circumstances so dictated. 48     I note defence counsel’s submissions that the guidelines inPP v NFmust have been articulated on the basis of the offender having claimed trial (since the judge did refer toChia Kim Heng Frederick v PPand the starting point set by the Court of Appeal there was for contested cases) and that the case involved a father raping his 15 year old daughter. However, although the accused inPP v NFpleaded guilty to the sole charge of rape under s 376(1) of the Penal Code, he was nevertheless sentenced to 15 years imprisonment and 15 strokes of the cane. In fact, at [76], the learned judge said: In the instant case, the starting point is 15 years’ imprisonment and 12 strokes of the cane. It would seem therefore that the starting point in the guidelines enunciated in that case was on the basis of an offender pleading guilty before the court. 49     The case before me has some features of category 2 and category 3 rapes. The victims targeted by the accused were foreigners working as commercial sex workers in Singapore. This group of victims must have been selected because it would be easy to get them into a car and drive them to some dark place to attack them. The accused and his accomplices must have thought also that such victims would be reluctant to report the offences to the authorities because they could be staying in Singapore illegally or were not engaged in lawful work. 50     Commercial sex workers are no less human beings than any of us. While some may frown upon their means of livelihood, such workers are no less entitled to be protected from the kind of harm that was inflicted on the victims here. Targeting the victims in the fashion shown in this case, knowing their vulnerability, was really quite abominable. 51     In addition to the indignities and injuries inflicted on the two victims, the ruthless robbers and rapist abandoned them, battered and bruised, in dark and unfamiliar surroundings, leaving one naked and the other clothed only in her panties. It was fortuitous that the victims found help in some public-spirited gentlemen after the horrendous experiences that they had to endure. 52     Defence counsel, in doing his professional utmost for his client, has put forward a comprehensive mitigation plea on behalf of the accused. I accepted that the accused was genuinely remorseful in court, belated though it was, and that there was still some redemptive value in a man who realized the enormity of the harm caused by him and was honourable enough to face up to his wrongdoings by pleading guilty, especially in a case where the 3 charges all carried hefty minimum sentences. However, I thought that his attempts to minimize his role and downplay his involvement in the crimes did him no credit. 53     He was the oldest among the accomplices (or at least the second oldest as we do not know the age of Dhiyauddin, who remains at large). Even if Norhazri was a seasoned criminal, he was only 21 years old. The other three accomplices were between 16 and 17 years old. The accused was nearly 27 at the time of the incidents in April and August 2006. He was not a simpleton who could be easily manipulated by others. He was the one who roughed up, robbed and raped both victims. I found it hard to accept that he was merely following the lead of others or was succumbing in a moment of folly or weakness. 54     The accused, Norhazri and Dhiyauddin came up with the plan to have sex with a prostitute for free where Victim 1 was concerned (see [9] above). For Victim 3, it was the accused who told the other two accomplices that he wanted to have sex with a prostitute for free (see [17] above). It thus sounded farcical that he contemplated paying the victims after brutalising them and forcing himself on them. If he had wanted to pay for sexual services, he would not have had to go to the extent of abducting the victims and beating them into submission before having sexual intercourse with them and robbing them. He was clearly the sexual predator in both instances. Even if his share of the loot was small, he achieved what he wanted and got his sexual gratification at the expense of the victims. 55     The fact that the victims were no strangers to sex, while not aggravating the rapes, were certainly not mitigating factors in the accused’s favour either. The accused’s overture of offering some monetary compensation to all 3 victims (of $1,000 each), which was accepted, could not lead to a substantial discount in the punishment. The amount was insignificant when compared to the enormity of the crimes and the extent of the injuries suffered by Victim 1 and Victim 3. 56     The demands of retribution and deterrence called for a sentence sufficiently long for the accused to atone for his crimes and to prevent him and to deter other would-be rapists-robbers from inflicting harm on female victims. As noted inPP v NF, the sentencing court could and often would moderate and calibrate the sentences for individual offences where there are multiple charges in order not to arrive at an overall sentence that could be said to be a crushing one, especially in the light of s 18 of the Criminal Procedure Code (see [44] above). In such cases, the individual sentences are usually not as important as the sum thereof. Bearing in mind the one-transaction and the totality principles, I sentenced the accused to a total of 22 years imprisonment with effect from 15 May 2007 and the maximum of 24 strokes of the cane (for the individual sentences, see [6] above)."
    }
}