{
    "case_title": "Re Wee Soon Kim Anthony",
    "ncitation": "[2007] SGHC 66",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Background facts": "1       In 2002 and 2003, Kan Ting Chiu J (“Kan J”) sat as the trial judge in Suit No 834 of 2001 (“S 834”) in which the present applicant (“Mr Anthony Wee”) was the plaintiff and UBS AG (“UBS”) was the defendant. On 8 Dec 2003, Kan J dismissed S 834 with costs (see[2003] SGHC 305]. Mr Anthony Wee appealed against the dismissal of his action in CA No. 1 of 2004. On 27 May 2004, the Court of Appeal dismissed his appeal with costs (see[2004] SGCA 33). In both S 834 and CA No. 1 of 2004, Mr Anthony Wee was represented by the late Mr Lim Chor Pee and UBS was represented by Mr Davinder Singh, SC. 2       The cost orders made by Kan J against Mr Anthony Wee formed the subject matter of a statutory demand subsequently issued by UBS, which led to a bankruptcy petition being presented against Mr Anthony Wee. I have been informed by the Registry of the Supreme Court that there is a pending appeal to the Court of Appeal against Belinda Ang J’s decision not to set aside the said statutory demand. That appeal (CA No. 39 of 2006) is scheduled to be heard on Friday, 11 May 2007.",
        "The present application": "3       In thisexparteOriginating Summons (“this OS”), Mr Anthony Wee, a retired senior lawyer, appears as a litigant in person, seeking to set aside the judgment of Kan J in S 834 on the grounds of “excessive intervention during the cross-examination of the Plaintiff/Witness and/or apparent bias in breach of a Judge’s judicial duty to ensure a fair and impartial hearing”. The “Plaintiff/Witness” is a reference to Mr Anthony Wee. In his affidavit in support of this OS, he quoted from various passages in the verbatim notes of evidence in S 834 to try to justify his allegations that: (a)    Kan J’s “excessive interruptions” were “clearly calculated to conduct an investigation to elicit evidence to assist Davinder Singh’s cross-examination”. (b)    Kan J’s “excessive interruptions” prolonged the cross-examination to thirty half-day sessions and were “calculated to harass and thereby put at risk the well-being of the Plaintiff who was, at the material time, 73 years old with a serious heart condition”. (c)    Kan J’s “callous attitude” toward Mr Anthony Wee’s age and serious heart condition gave rise to “a suspicion of ill-will” and the apprehension of a real danger of bias. (d)    Kan J intervened to caution Mr Anthony Wee’s counsel to “keep out of it”, i.e. not to interfere with his answers, when such intervention had nothing to do with his judicial duty to clear up points which were overlooked or left obscure. Mr Anthony Wee further alleged that Kan J “inflicted further punishment on the Plaintiff by certifying a ‘Certificate of Two Counsel’ costs” notwithstanding that none was asked for by Mr Davinder Singh, SC. He also alleged that Kan J refused to recuse himself in June 2005 from hearing the taxation of costs in a bill arising out of S 834 and had instead allowed opposing counsel to argue on his (i.e. the judge’s) behalf on whether he should recuse himself or not and then, “to add salt to the wound”, awarded costs to the opposing counsel",
        "Correspondence before the hearing": "4       This OS was initially fixed for hearing on 24 April 2007. However, Mr Anthony Wee informed the Registry that he was on medical leave from 5 Dec 2006 to 4 Mar 2007 and would continue to be on medical leave until 4 May 2007, enclosing two letters dated 18 Dec 2006 and 29 Jan 2007 from Dr Lye Wai Choong, a consultant physician and nephrologist of the Centre for Kidney Diseases Pte Ltd at the Mount Elizabeth Medical Centre. Accordingly, Mr Anthony Wee requested (through his personal secretary) that this OS be adjourned to a later date, stating that CA No. 39 of 2006 was fixed before the Court of Appeal in the week commencing on Monday, 7 May 2007 and asking that the adjourned hearing date for this OS not be too close to the matter before the Court of Appeal, as he would be appearing in person and was not of good health. 5       This request was brought to my attention by the Registry. I was also informed that the Court of Appeal had, on 28 Mar 2007, granted Mr Anthony Wee a final adjournment in CA No. 39 of 2006 (to the week commencing on Monday, 7 May 2007) and directed that if he was not able to appear in person, he must instruct counsel to appear on his behalf and that if he was absent and no counsel appeared to argue on his behalf, the hearing would proceed without further adjournment. As the background facts set out above (at [1] and [2]) show, this OS will have an impact on CA No. 39 of 2006. Kan J’s judgment and cost orders in S 834 are the foundation of the statutory demand and CA No. 39 of 2006. Accordingly, I directed the Registry to reschedule this OS for hearing on 7 May 2007 (as Mr Anthony Wee would be on medical leave until 4 May 2007) and made the same directions as the Court of Appeal did. In addition, I directed the Registry to inform Mr Anthony Wee that: Your application obviously cannot be heard ex parte and you must takeimmediatesteps to serve the OS and affidavit, together with this letter from the Registry, on the party or parties who may be affected by the orders that you are seeking. These directions were set out in a letter dated 18 April 2007 faxed to Mr Anthony Wee. 6       The next day, Mr Anthony Wee wrote to the Registry as follows: I refer to your letter 18thApril 2007 which I received by fax today at 2.22pm. I note that my application has been fixed before Justice Tay Yong Kwang who had heard and dismissed my ad-hoc application for a Q.C. to act for me in Suit 834 of 2001. I place on record that paragraph 2(a), (b), (c) and (d) of your letter under reply is not only oppressive but smacks of apparent bias. It may interest Justice Tay to know I have a pending Court of Appeal in Hong Kong. Upon hearing of my unfortunate predicament, the Appeal Judges adjourned the hearing without question until such time when I am well. Even Linklaters [which I assume is more reputable than Davinder Singh SC of Drew & Napier] never objected to the adjournment nor did they make the demand that the pending appeal be fixed no matter what and that if I am still unwell I be ordered to instruct counsel or else. In the circumstances, may I know the reason and the law for ordering me to instruct Counsel failing which Justice Tay will proceed to hear my ex parte application without further ado. Finally, I would like to know, as a litigant in person, for the record the law for Justice Tay to order me to take immediate steps to serve the O.S. and Affidavit together with your letter under reply on the party or parties who may be affected for the orders that I am seeking. May I also know who are the “party or parties” other than Justice Tay’s brother judge Kan Ting Chiu as the only party who may be affected. In the circumstances, by this letter, I hereby request that Justice Tay  recuse himself on grounds of apparent bias from hearing my ex parte application on 7 May 2007. 7       I instructed the Registry to inform Mr Anthony Wee to make his application before me on 7 May 2007. Mr Anthony Wee was also informed (by the Registry’s letter of 20 April 2007) that the earlier directions pertaining to this OS, contained in the Registry’s letter dated 18 April 2007, were still valid. 8       On 27 April 2007, Mr Anthony Wee wrote to the Registrar stating: I would like to have the Court to record the proceedings. I am told that the proposed recording cannot be done in Chambers. But in order to save time, I am asking the Court through you to transfer the Chamber hearing into an Open Court hearing in the public interest and transparency so that I will not ask for an adjournment for me to make a formal application. I acceded to Mr Anthony Wee’s request. 9       On 7 May 2007, Mr Anthony Wee appeared in person in open court, assisted by his personal secretary who sat at counsel’s table behind him. His day nurse sat in the public gallery in court. Mr Anthony Wee informed me that he was not on medical leave anymore but was appearing in court against his doctor’s advice. By virtue of his physical condition, he requested to address the court while seated and I accorded him that privilege and courtesy.",
        "“Apparent Bias”": "10     Mr Anthony Wee began by tendering a three-page submission to ask me to recuse myself from hearing this OS “on grounds of apparent bias which appears from your refusal to admit Gerald Godfrey QC in OM 22 of 2002 and Richard de Lacy QC in OM 4 of 2003”. His complaint in essence was that I was in awe of Mr Davinder Singh SC of Drew & Napier, who was counsel for UBS in S 834. Mr Anthony Wee contended that: The most telling appearance of apparent bias is when you praised with awe of the “illustrious career” of Davinder Singh SC of Drew & Napier couched as follows: Senior Counsel Davinder Singh of Drew & Napier acts as lead counsel for the Defence. In the course of hisillustrious career, [sic] her has acquired a daunting, if not absolutely fearsome reputation as Singapore’s foremost litigator. (The emphasis in the quotation is Mr Anthony Wee’s.) 11     Mr Anthony Wee was referring to my judgment in Originating Motion No. 22 of 2002 (at [25] of[2003] 1 SLR 461) in which he sought the admission of Gerald Godfrey QC to appear for him in S 834. That application was filed by Goh Aik Leng & Partners and was supported by an affidavit by Mark Goh Aik Leng. I pointed out to Mr Anthony Wee that the passage he quoted (at [10] above) had been wrongly attributed by him to me. The words of “awe” came from paragraph 54 of Mark Goh Aik Leng’s affidavit, some portions of which I was reciting in my grounds of decision to examine how Mr Anthony Wee came to be in the predicament he found himself in where the issue of legal representation was concerned. It was Mark Goh Aik Leng, Mr Anthony Wee’s counsel, who was praising Mr Davinder Singh SC with awe. 12     Similarly, Mr Anthony Wee, in his submissions on Originating Motion No. 4 of 2003 (see[2003] 4 SLR 23)(concerning the application to admit Richard de Lacy QC, also for the purpose of appearing as counsel for him in S 834) stated: At [3] of your decision, you unfairly refused to allow me to address the court, and thereby denying me my basic right to argue my own case in an uneven playing field given your awe of Davinder Singh and I quote: (the same words of “awe” are repeated here) … In the circumstances, you should recuse yourself the hearing is for to set aside the Judgment of your brother Judge Kan Ting Chiu in a case where the counsel appearing for UBS AG is none other than Davinder Singh SC the“daunting, if not absolutely fearsome reputation as Singapore’s foremost litigator”. As explained above (at [11]), it was Mr Anthony Wee’s then counsel, not I, who said the words of awe. 13     Mr Anthony Wee’s submission of “apparent bias” on my part was quite clearly erroneous. I assured him that I had no prejudice against or any bias for him and that I respected him as a senior member of the bar, even if he disagreed with my decisions. I therefore declined to recuse myself from hearing this OS. After the hearing, Mr Anthony Wee wrote to say that he would be filing a notice of appeal in a day or so and asked for my grounds of decision, adding: For the avoidance of doubt, I am not appealing your refusal to recuse for hearing O.S. 550 since you have dismissed it on technical grounds.",
        "Whether this OS should be heard ex parte": "14     Mr Anthony Wee confirmed that he had not served this OS on anyone as he saw no necessity to do so. He argued that the cost orders in favour of UBS in S. 834 were merely consequential upon the dismissal of the suit and that he was not asking for Kan J’s judgment to be quashed but was seeking only a retrial of that action. He did not think that UBS’s lawyers should be arguing for Kan J in this OS. 15     As mentioned earlier, I had directed service of this OS and of the supporting affidavit to be effected on anyone who might be affected by the orders that Mr Anthony Wee was seeking in this OS. Obviously, an interested party would be UBS which had been sued unsuccessfully and which had orders of costs in its favour. As I pointed out to Mr Anthony Wee, he was seeking to undermine the foundation (i.e. Kan J’s judgment) without any regard for the building erected above it (i.e. the cost orders in favour of UBS). If he succeeded in this OS, then the cost orders would also have to be set aside. It was thus patently clear that UBS ought to have been made a party to this OS. As Mr Anthony Wee resolutely maintained that he did not need to serve this OS on anyone, I had no choice but to dismiss this OS.",
        "Jurisdictional foundation for this OS": "16     Mr Anthony Wee contended that one High Court judge could set aside the judgment of another High Court judge pronounced after a full trial and thus sit in judgment over the earlier court. With respect, I disagree. Every High Court judge has co-ordinate jurisdiction and none can arrogate to himself/herself the authority to oversee the judicial work of another by the process that Mr Anthony Wee seeks to invoke in this OS. If at all such allegations as made by Mr Anthony Wee here are to be levelled against a trial judge, they ought to be raised before a court that is superior in hierarchy to the trial court and to which there is a right of appeal or in which there resides revisionary or supervisory jurisdiction over the trial court. InTee Kok Boon v PP[2006] 4 SLR 398, a case decided in criminal proceedings, I made very much the same points (see [ 11] to [16] of that decision) and summarised the principles distilled from the statutes and case law as follows (at [17]): (a)    The High Court has revisionary powers over all subordinate courts but not over a decision of the subordinate courts which has already been upheld on appeal by the High Court. (b)    The High Court does not have revisionary powers over another High Court. (c)    The Court of Appeal does not have revisionary (as opposed to appellate) powers over the High Court. (d)    It is of no consequence that the subsequent court comprises the same judge or judges as, or that it consists of a different judge or different judges from, the earlier one.",
        "Allegations in this OS not raised before Court of Appeal in 2004": "17     Mr Anthony Wee’s allegations in this OS were not canvassed before the Court of Appeal in the appeal from S 834. His explanation was that his former counsel, the late Mr Lim Chor Pee, refused to raise these allegations before the Court of Appeal, telling Mr Anthony Wee that he (Mr Lim) was the lawyer conducting the appeal and that he (Mr Anthony Wee) should shut up. 18     Whatever the truth is, the fact remains that the Court of Appeal has already affirmed Kan J’s decision in 2004 and doctrine and good order dictate that it is not permissible for Mr Anthony Wee to try to re-open that appeal by means of this second attack against Kan J’s decision in S 834. 19     On these three grounds, this OS cannot even take off and must be dismissed. I express no opinion whatsoever on the many allegations that Mr Anthony Wee made in this OS regarding the conduct of the trial in S 834 and the consequential matters flowing from the dismissal of the action there. 20     Mr Anthony Wee asked me for leave to appeal insisting that such leave was necessary. If so, I granted him leave to appeal. I also indicated to him that I would try my best to set out in writing the grounds of decision as quickly as possible."
    }
}