{
    "case_title": "Nagase Singapore Pte Ltd v Ching Kai Huat and Others",
    "ncitation": "[2007] SGHC 61",
    "coram": "Judith Prakash J",
    "sections": {
        "Background": "1          One of the businesses carried on by the plaintiff, Nagase Singapore Pte Ltd, is the buying and selling of plastics and chemicals. For this purpose, the plaintiff requires the use of a warehouse and supporting logistics services. This action arose out of the plaintiff’s employment of the second defendant, David’s Logistics Pte Ltd (“ D Logistics”), to provide such services for the plaintiff’s GE Plastics Division (“the division”), so called because it dealt in plastic products manufactured by a company called GE Plastics. The plaintiff has alleged that D Logistics overcharged it and that it together with its majority shareholder and director, the first defendant (Ching Kai Huat, David) (“DC”), and the third and fourth defendants who were employees of the plaintiff, conspired to injure the plaintiff. The plaintiff also alleged that the third defendant, Clement Yip (“CY”), and the fourth defendant, Mary Ting Chi Fong (“MT”) were in breach of the duties that they owed the plaintiff. 2          The plaintiff first got to know DC when he was working for a company called Visa Freight Pte Ltd (“Visa Freight”). Visa Freight supplied storage services (both the actual warehousing space and the manpower to move and store the goods) to the plaintiff from 1992 until it ceased business in 1999. The plaintiff then suggested to DC that he should set up his own business and supply it with similar services. That suggestion led to the incorporation of D Logistics. The plaintiff rented a warehouse and, from 1999, D Logistics provided the staff required to operate the warehouse and store the plaintiff’s goods. D Logistics also monitored the stock levels in the warehouse. For these services, the plaintiff paid D Logistics a lump sum fee of $42,000 per month. 3          In the meantime, in February 1995, MT started to work for the plaintiff. She proved to be a good employee and received several promotions. In April 2000, she was promoted to be the plaintiff’s customer service manager and in April 2002, she was given a further promotion to the post of senior manager of the division. MT’s superior was CY who had joined the plaintiff in 1988. He too was promoted several times. In July 2001, CY became a director of the division. This designation was an administrative one only and CY was not appointed a director of the plaintiff company. 4          In mid 2001, the plaintiff decided that it no longer wanted to pay warehouse rental and that it would be cheaper if it went back to obtaining total warehousing services from a contractor. Pursuant to this decision, CY had a discussion with DC on the proposed change. It was accepted that CY had the authority to make, on behalf of the plaintiff, a new warehousing contract with D Logistics. On 2 July 2001, D Logistics sent the plaintiff a quotation (“the first quotation”) containing its rates for providing both the warehouse and the warehousing services to the plaintiff. CY did not accept the first quotation. Two weeks later, on 16 July 2001, D Logistics sent the plaintiff a second quotation (“second quotation”). This was subsequently signed by both DC and CY on behalf of their respective companies and therefore became the basis of what the parties subsequently referred to as the first agreement. At the same time, CY and DC signed what was called a supplementary agreement. This supplementary agreement provided that the plaintiff would be entitled to a ten percent rebate on the total storage charges each month. About a year later, on 1 July 2002, D Logistics sent the plaintiff a third quotation (“third quotation”) which effected changes to the previously agreed rates. This was accepted by CY and as a result the plaintiff and D Logistics entered into what the parties subsequently referred to as the second agreement. 5          In early 2003, the plaintiff found out that D Logistics had been overcharging it. The plaintiff stopped payment to D Logistics and, on 26 June 2003, terminated its services. In July 2003, the plaintiff commenced this action against D Logistics and DC and claimed a refund of the amount by which it alleged it had been overcharged. D Logistics put in a counterclaim for the sum of $191,837.22 being the sum of its bills for the period from April to June 2003. In April 2004, the plaintiff amended its claim and brought in CY and MT as additional defendants. 6          In the meantime, on 9 July 2003, Mr Masamichi Kan, the plaintiff’s managing director, had lodged a police report against CY and MT alleging that they had received kickbacks from DC. The police investigated the complaint but in March 2005, they informed the plaintiff that they had decided to take no further action on it.",
        "The plaintiff’s claims": "7          I will set out the main claims made by the plaintiff for clarity and I will then go on to consider the arguments and evidence in relation to each of these claims. This judgment contains my main findings on the claims but, as indicated below, further submissions are needed on two issues. 8          In respect of its case against CY and MT in their position as its employees, the plaintiff pleaded that CY and MT owed the following duties to it: (a)        Equitable/implied contractual duties: (i)         a duty of fidelity to act faithfully in the plaintiff’s best interests; (ii)        a duty to take care in the performance of their jobs. (b)        An express contractual duty to maintain the confidentiality of the plaintiff’s trade secrets. (c)        Fiduciary duties: (i)         a duty to act in good faith and in the plaintiff’s best interests; (ii)        a duty not to act for a collateral purpose; (iii)       a duty not to place themselves in a position of actual or potential conflict of interest. 9          The above duties were, allegedly, breached by the following actions: (a)        Acceptance of the second quotation and more particularly because: (i)         CY and MT concealed the first quotation from the plaintiff; (ii)        CY and MT either told DC and D Logistics that CY would accept less favourable terms than the first quotation or they let DC and D Logistics know of less favourable terms which CY was prepared to accept; (iii)       CY agreed to the second quotation, resulting in the first agreement, despite those terms being less favourable than those of the first quotation without comparing and contrasting the second quotation with other parties’ quotations. (b)        In relation to the supplementary agreement: (i)         CY and MT concealed the supplementary agreement from the plaintiff; and (ii)        CY and MT neglected to enforce the supplementary agreement. (c)        Acceptance of the third quotation and more particularly because: (i)         CY and MT told DC and D Logistics that the plaintiff was willing to accept less favourable terms; and (ii)        CY accepted the third quotation, despite the third quotation having less favourable terms than the second quotation, without comparing the third quotation with other quotations. (d)        Overcharging as particularised in [12] below. 10        As regards its contractual claim against D Logistics, the plaintiff pleaded that D Logistics wrongfully overcharged it by: (a)        calculating “truncated” weeks as whole weeks; (b)        claiming manpower and equipment costs as miscellaneous charges; (c)        inflating the tonnage volume in D Logistics’ invoices; (d)        inflating the unit price for storage; (e)        inflating the number of packages and charging for both tonnage and packaging. 11        Alternatively, the plaintiff pleaded that D Logistics owed an implied contractual duty to the plaintiff to take care in the preparation of its invoices and bills so that D Logistics would not overcharge the plaintiff. 12        The plaintiff asserted that CY and MT breached their duties stated at [8] in relation to the overcharging effected by D Logistics in that: (a)        CY and MT failed to check whether the amounts of stock D Logistics invoiced corresponded with the amounts reported to the plaintiff or with the amounts stated in D Logistics’ own stock balance reports; and (b)        MT instructed her subordinate Sarah Ng not to verify the data for goods removed from the warehouse and Sarah Ng then passed this information on to her successor, Tan Mui Theng; and thereby they had (i) procured that the plaintiff paid D Logistics the overcharged amounts or (ii) neglected to take any steps to prevent the plaintiff from paying those amounts. 13        The plaintiff pleaded that all the defendants conspired to injure it by the following unlawful means: (a)        CY and MT’s breach of their duties to the plaintiff; and (b)        DC and D Logistics’ unlawful interference with the plaintiff’s business, with reference to the following events: (i)         acceptance of the second quotation; (ii)        concealment of the supplementary agreement; (iii)       acceptance of the third quotation; and (iv)       overcharging. 14        In the alternative, the plaintiff pleaded, with reference to the same events, that the defendants conspired by lawful means to injure it.",
        "Breach of duties": "",
        "What duties did CY and MT owe to the plaintiff?": "15        CY and MT did not dispute that they each owed the plaintiff a duty to act in its best interests in the course of their employment and that they had a general duty to take care in the performance of their jobs. They did dispute, however, the scope of their duty of care and also that they owed fiduciary duties to the plaintiff as the plaintiff asserted. One other dispute was over the plaintiff’s allegation that CY and MT were in breach of their duty of confidentiality to it. I need not deal with this dispute as, although it was pleaded, no submissions were made on it by the plaintiff and the allegation therefore appears to have been dropped. 16        Turning to the duty to take care in the performance of their respective jobs, the plaintiff said that this duty required both CY and MT to do the following: (a)        in respect of the agreements: (i)         compare and contrast quotations from several parties before agreeing to any one on the plaintiff’s behalf; (ii)        secure the best possible quote for the plaintiff; (iii)       not to disclose to suppliers terms and conditions which the plaintiff may be prepared to agree to, especially where such terms were less favourable to the plaintiff than the suppliers’ proposed terms. (b)        ensure, through the maintenance of adequate records and internal controls, that the plaintiff’s funds were used for payment on its behalf only where the plaintiff was liable to pay the invoice presented; (c)        ensure that a proper system was in place to check and confirm: (i)         the amounts that the plaintiff was liable for before its funds were paid out; (ii)        that the plaintiff’s funds were paid out only at the rate and for the period of warehousing it was liable for and not more; (iii)       that the plaintiff’s funds were not paid out for manpower; equipment and/or other costs unless it was liable for those sums; (iv)       that the quantity of goods D Logistics claimed it warehoused was delivered to and/or removed from the warehouse (against the plaintiff’s own records) before funds were paid out; (d)        monitor the plaintiff’s warehousing expenses and inventory levels; (e)        investigate and bring to the plaintiff’s attention any substantial discrepancy between the plaintiff’s warehousing expenses and inventory levels through the maintenance of adequate records and internal controls.",
        "Scope of duties": "17        Turning first to consider the scope of CY’s duties, it would be recalled that he held the position of director of the division between 2 July 2001 and 26 May 2003 when his employment was terminated by the plaintiff. Prior to July 2001, CY had been the general manager of the division and had held this post for four years. His job scope was not defined in either the letter dated 15 April 1997 that promoted him to general manager or in the subsequent letter dated 2 July 2001 whereby he was promoted to director. There was therefore neither explicit statement by the plaintiff of what CY’s responsibilities were in either post nor any indication of the plaintiff’s understanding of the scope of those duties. 18        At the trial, the plaintiff stated that CY was responsible for the overall operation of the division. His job scope included directing the division’s day-to-day operations through staff under his supervision, including MT. It also included negotiating warehousing contracts and ensuring that they were enforced. CY also had to ensure that adequate records and internal controls were maintained to prevent loss of the division’s assets and to provide accurate management reports to the plaintiff’s higher management. CY, on the other hand, argued that none of these duties that the plaintiff now claims were owed by him were actually part of his job scope when he was either the general manager or the director of the division. He accused the plaintiff of seeking to tailor various duties based on the breaches that it now alleges. 19        According to CY, he was primarily responsible for overseeing the general operations of the division and ensuring its profitability. He did so by monitoring the daily operations of the division and meeting up with his immediate superior, one Mr Mizumori, on a regular basis, to update him on what was happening within the division. He also ensured that reports were submitted to the plaintiff’s management on a monthly basis. These reports which showed the plaintiff’s performance and results for the preceding month were prepared by the various section heads and submitted to CY. He then collated them and presented them at monthly meetings attended by Mr Kan, the heads of the respective divisions and various managers. There were approximately 45 employees working under CY in the division. As director, CY stated, it was not his job to inspect each and every facet of the work carried out by each and every member of his staff. It was not his job either to verify, approve and authorise payments on invoices issued by D Logistics to the plaintiff. In this connection, I accept that CY did not have a specific duty to personally verify, approve and authorise payment of invoices issued by D Logistics. 20        CY did not, however, directly address the more broadly worded duties pleaded by the plaintiff. He did not contest his responsibility for the negotiation and enforcement of warehousing contracts. Nor did he contest the assertion that he had a duty to ensure that a proper system was in place to verify the funds to be paid out and the amount of goods stored, which was a different assertion from one that he had to perform the verification itself. There was no evidence from CY that any other member of the plaintiff’s staff was responsible for the duties listed by the plaintiff. As director of the division, there was no reason why, in my view, that CY should not have been the person who was responsible for these areas. I accept therefore that CY had all the duties ascribed to him by the plaintiff in its pleadings and set out in [16] above. 21        MT was senior manager of the customer service department of the division from 1 April 2002 to 26 May 2003 when her employment was terminated by the plaintiff. Before that, from 3 April 2000, she had been the customer service manager of the division. In her case too, the letters of appointment issued by the plaintiff did not spell out her duties. 22        According to the plaintiff, MT had to assist CY in the proper performance of his duties and had to implement his directions. She had a duty to direct the employees who were under her supervision. She also had a duty to help CY negotiate warehousing contracts and ensure that they were enforced. She also had to ensure that adequate records and internal controls were maintained to prevent loss and to provide accurate management reports to the plaintiff’s higher management. 23        According to MT, her duty was to possess and exercise reasonable skill or competence as a customer service manager. The scope of her job was to manage and supervise the customer service department, which involved overseeing all backend operations and ensuring the smooth running of the division. Her job was supervisory in nature. MT testified that she assisted CY, her immediate superior in the day-to-day operation of the division. She managed a team of 30 persons who provided backend support for the entire supply chain. The customer service department had four units: the order fulfilment unit, the data management unit, the warehouse management unit (managing about ten warehouses spread across South East and North Asia) and the credit and collection unit. 24        MT did not really dispute that she had the duties claimed by the plaintiff except for the duties relating to the agreements. The plaintiff appears to me to have stretched a point in that regard as there was no evidence at all that MT ever took part in negotiations for the warehouse contract. It was also clear that she herself had no power to contract with third parties on behalf of the plaintiff.",
        "Fiduciary duties": "25        Whilst the defendants did not dispute that an employee owes duties of care and loyalty to his employer, there was a lot of contention over when an employee who is not a director of a company owes that company fiduciary duties. This issue was considered in some detail inNottingham University v Fishel[2000] IRLR 471(“Nottingham”). 26        The defendant inNottinghamwas a clinical embryologist working for the plaintiff on a full time basis as a scientific director of the plaintiff’s infertility unit. The plaintiff sought an account of profits from the defendant, or alternatively damages, for alleged breaches of fiduciary duty and breach of contract because the defendant was doing outside work without consent from the plaintiff. Elias J conducted a detailed analysis of when an employee of a company owes fiduciary duties to the employer. He made many pertinent observations on the issue and it is worth quoting his judgment in some detail. Elias J stated between [85] and [98]: … there has been a tendency to describe someone as a fiduciary simply as a means of enabling the courts to impose the equitable remedies … It is important to recognise that the mere fact that Dr Fishel is an employee does not mean that he owes the range of fiduciary duties referred to above. It is true that inBlakeLord Woolf … said that the employer – employee relationship is a fiduciary one. But plainly the court was not thereby intending to indicate that the whole range of fiduciary obligations was engaged in every employment relationship. This would be revolutionary indeed, transforming the contract of employment beyond all recognition and transmuting contractual duties into fiduciary ones. In my opinion, the court was merely indicating that circumstances may arise in the context of an employment relationship, or arising out of it, which, when they occur, will place the employee in the position of a fiduciary. … … the essence of the employment relationship is not typically fiduciary at all. Its purpose is not to place the employee in a position where he is obliged to pursue his employer’s interests at the expense of his own. The relationship is a contractual one and the powers imposed on the employee are conferred by the employer himself. The employee’s freedom of action is regulated by the contract, the scope of his powers is determined by the terms (express or implied) of the contract, and as a consequence the employer can exercise (or at least he can place himself in a position where he has the opportunity to exercise) considerable control over the employee’s decision-making powers. This is not to say that fiduciary duties cannot arise out of the employment relationship itself. But they arise not as a result of the mere fact that there is an employment relationship. Rather they result from the fact that within a particular contractual relationship there are specific contractual obligations which the employee has undertaken which have placed him in a situation where equity imposes these rigorous duties in addition to the contractual obligations. Where this occurs, the scope of the fiduciary obligations both arises out of, and is circumscribed by, the contractual terms; it is circumscribed because equity cannot alter the terms of the contract validly undertaken. … The problem of identifying the scope of any fiduciary duties arising out of the relationship is particularly acute in the case of employees. This is because of the use of potentially ambiguous terminology in describing an employee’s obligations, which use may prove a trap for the unwary. There are many cases which have recognised the existence of the employee’s duty of good faith, or loyalty, or the mutual duty of trust and confidence – concepts which tend to shade into one another. … Accordingly, in analysing the employment cases in this field, care must be taken not automatically to equate the duties of good faith and loyalty, or trust and confidence, with fiduciary obligations. Very often in such cases the court has simply been concerned with the question whether the employee’s conduct has been such as to justify summary dismissal, and there has been no need to decide whether the duties infringed, properly analysed, are contractual or fiduciary obligations. As a consequence, the two are sometimes wrongly treated as identical … Accordingly, in determining whether a fiduciary relationship arises in the context of an employment relationship, it is necessary to identify with care the particular duties undertaken by the employee, and to ask whether in all the circumstances he has placed himself in a position where he must act solely in the interests of his employer. It is only once those duties have been identified that it is possible to determine whether any fiduciary duty has been breached … 27        In the present case, the plaintiff’s pleading was that CY and MT owed fiduciary duties to it based on the fact that the plaintiff relied on them to perform their equitable and contractual duties. It further averred that its funds were placed under CY’s and MT’s control as a result of this reliance. CY’s response was that he was, although a senior employee and designated as “director” of the division, not a member of the board of directors and that it was Mr Mizumori who represented the division on the board. As such, CY claimed he was a mere employee and did not owe the plaintiff any fiduciary duties. He pointed out that in the local case ofAndrew Shepherd v BIL International Ltd[2003] SGHC 145, the plaintiff who had been the defendant’s chief financial officer was held by the court not to owe any fiduciary duties to the defendant “as he was never appointed a director of the defendant”. MT took the same tack. She argued that she was merely an employee and that although the plaintiff had claimed that funds were entrusted to her, as a result of her equitable and contractual duties, nowhere had it been stated in her employment contract that the plaintiff would make payments based on those duties. 28        InNottinghamit was emphasised that care had to be taken not to equate the duty of good faith and loyalty owed by every employee with a fiduciary obligation although the same case also made it plain that an employee did not have to hold a position on the board of directors in order to owe fiduciary duties to his employer. InNottingham, the issue was whether the defendant had to account for profits made by him when he undertook work from a third party while still in the plaintiff’s employment. In that situation, the usual duty of fidelity owed to the plaintiff did not encompass the acts alleged and the defendant would only have been liable if he was a fiduciary. In this case, however, there is no indication how the imposition of fiduciary duties would increase CY’s and MT’s potential liabilities. The plaintiff did not say what areas the fiduciary duties it sought to impose might cover that were not already covered by the normal equitable and contractual duties. On a consideration of the evidence, it appears to me that in respect of CY and MT, their duty of fidelity and their duty to take care in the performance of their jobs fully overlapped with the ambit of the fiduciary duties claimed by the plaintiff. 29        In any case, the evidence does not establish that CY and MT owed a special duty of “single minded or exclusive loyalty” to the plaintiff. They were members of the middle management of the plaintiff albeit that CY held a fairly senior position. The mere authority to negotiate contracts on behalf of the company or to authorise the payment of invoices would not itself give rise to fiduciary obligations on the part of the officers of the company entrusted with such authority. Otherwise, practically every middle level manager and every person with some signing authority in a company’s finance department would have fiduciary duties. In the case of CY, his promotion in 2001 to director of the division from the post of manager did not change the scope of his duties. He still had to report to Mr Mizumori and the board of directors and had to get Mr Mizumori’s sanction for many of his decisions. I cannot find a basis to support any assertion that by becoming director of the division, CY had undertaken specific contractual obligations which had “placed him in a situation where equity imposes these rigorous duties in addition to the contractual obligations”. CY was not top management and MT’s position, as CY’s subordinate, was even more removed from a situation in which fiduciary duties could be imposed. 30        The facts of the instant case differ quite significantly from those ofCanadian Aero Service Ltd v O’Malley et al.40 DLR (3d) 371, which was cited by the plaintiff in support of its position. In that case, a president and executive vice-president of a company were held to be fiduciaries of the company even though the company was a subsidiary and that the defendants were subject to the supervision of the officers of the controlling company. In justifying the extension of fiduciary duties of the defendants, Laskin J said (at 381): They were ‘top management’ and not mere employees whose duty to their employer, unless enlarged by contract, consisted only of respect for trade secrets and for confidentiality of customer lists. Theirs was a larger, more exacting duty which, unless modified by statute or by contract (and there is nothing of this sort here), was similar to that owed to a corporate employer of its directors. 31        The defendants inCanadian Aero Servicecan be contrasted with the plaintiff inMitchell v Paxton Forest Products Inc.[2002] BCCA 532. The latter was employed by the defendant as a mill manager, and later became a sales manager. The plaintiff’s responsibilities included developing and maintaining the defendant’s customer base, marketing its products, setting prices, negotiating terms of sale and dealing with defendant’s suppliers. The plaintiff reported to the general board and did not have responsibility with regard to hiring and firing. While not deciding whether a fiduciary duty applied to the plaintiff, Newbury JA said (at [6]): I would tend, if pressed, to say Mr. Mitchell was not “senior management”, since he was not entrusted with powers and influence which could materially affect the company’s interests. He had managerial responsibilities with regard to sales, but could not approve a purchase over $1,000, had only one clerk reporting to him and could not hire or fire employees. To this extent, his responsibility and authority were unlike those of the defendant inAnderson, Smyth & Kelly Customs Brokers Ltd. v World Wide Customs Brokers Ltd.,[1996] 7 W.W.R. 736 (Alta. C.A.), who was the manager of the plaintiff’s Edmonton office and a director; or the defendants inCanadian Aero Service Ltd v O’Malley(1973), [1974] S.C.R. 592 (S.C.C.), who were directors and officers of the plaintiff company.",
        "Was there any breach of duty on the part of CY or MT in relation to the acceptance of the second quotation rather than the first?": "32        The plaintiff’s case in respect of this allegation was that the first quotation showed that D Logistics was willing to provide warehousing services at the rate of $2.50 per week per tonne. When CY received it, however, he deliberately concealed it from Mr Mizumori and, instead, indicated to DC that the plaintiff would be willing to agree to a rate that was higher than the one provided in the first quotation. As a result, DC sent over the second quotation which stated that the rate would be $2.90 per week per tonne. DC and CY then both signed that quotation. 33        CY’s response was that the first quotation was not a real offer. Instead it was sent by DC to CY in response to CY’s request, made in June 2001, for DC’s “bottom-line figures” for the provision of warehousing services,i.e., D Logistics’ cost of providing these services. DC and CY then used the first quotation as a starting point for further negotiations. CY considered that it would be unreasonable to expect D Logistics to provide these services at cost, so he asked DC to provide the second quotation to set out what DC would consider a “fair price”. Since the first quotation was not a real offer, it was not a breach of any duty for CY not to disclose it to Mr Mizumori or to consider it seriously. 34        DC and D Logistics’ position, however, contradicts that of CY. DC’s evidence was that he was prepared to supply the services at the price stated in the first quotation. Whilst DC did say that the first quotation was issued “for discussion purposes”, D Logistics did not claim that the first quotation reflected its cost price. 35        An examination of the first quotation itself does not support CY’s position that it merely reflects “bottom-line prices”. The terms of the first quotation indicate an offer price rather than a cost price. It starts out “… we are pleased to furnish our best offer for the above services for your kind consideration and approval” and states further down “We trust our rates will meet your requirements and awaiting(sic)your favourable reply”. A number of terms also clearly refer to D Logistics’ cost price:e.g.“pallets and [shrink]-wrap materials” are listed “at cost”. This suggests that the other items with stated prices are not provided at cost. Furthermore, one item, the repacking of cargo, is listed as free of charge, which clearly could not refer to D Logistics’ cost price for providing this service. Finally, CY gave no reasons why D Logistics would agree to provide its cost price as a basis of negotiations, a move which militates against common commercial sense. For the foregoing reasons, I find that the first quotation did reflect a price at which D Logistics was prepared to supply its services. 36        The plaintiff, on the basis that the first quotation was a genuine one, argued that the second quotation was only issued because CY indicated to DC that the plaintiff would accept a higher price than the $2.50 stated in the first quotation. The second quotation was, therefore, issued and accepted for an illegitimate reason. CY contested this on the basis that the second quotation was the first genuine offer which reflected a fair price for D Logistics including a profit of 0.40 cents per tonne per week. According to CY, this price gave D Logistics sufficient incentive to provide a good level of service for the plaintiff while also giving the plaintiff the discretion to cut costs if and when necessary. I do not accept this evidence since, as stated above, I consider the first quotation to have been a genuine one. 37        That finding is, however, not the end of the matter. There were many other differences between the first and second quotations quite apart from the increase in the storage charge rate by 0.40 cents per tonne per week. The terms of the first and second quotations where they differ, are set out in the table below.   Rate in the first quotationRate in the second quotationStorage charges$2.50 per week per tonne$2.90 per week per tonneStorage charges for export ordersNot mentionedFOCRepacking of cargoesBelow 250kg per month – FOC251kg and above per month - $3.00 per bagFOCRepalletiseNot mentionedFOCOvertimeNot mentioned$30.00 per hourNot mentioned3-month notice period required if either party needs to review the agreementNot mentionedExisting tenancy agreement between Pole Technologies (the warehouse owner) & the plaintiff to be taken over by D Logistics with no other costs to the plaintiffNot mentionedCurrent administrative and handling charges to be superseded by the above quoted rates 38        In certain areas such as the repacking of cargo and the three month notice period, the terms of the second quotation are clearly better than those of the first. These differences support CY’s argument that the second quotation is not clearly more unfavourable to the plaintiff than its predecessor. Furthermore, as D Logistics pointed out, the plaintiff did not show or produce any evidence that $2.90 per week was a deviation from the market price. CY also explained (without contradiction from the plaintiff) that although the $30 per hour overtime charge was another area in which the second quotation was not as good a deal for the plaintiff as the first, he had agreed to it so as to ensure that there was a steady pool of manpower and equipment available to the plaintiff when required; for instance, during the twice yearly audit and stock counts as well as when there was a sudden inflow of goods. 39        Further, the evidence of both CY and DC was that when the first rate of $2.50 per tonne per week was proposed, CY had not yet informed D Logistics that the plaintiff wanted it to take over the warehouse that the plaintiff was renting. It was only after CY mentioned this fact to DC that D Logistics came up with the new rate and CY agreed to it. DC’s evidence was at the meeting held to discuss the first quotation, he had told CY that unless he increased the rate by 0.40 cents, he would not be able to take over the warehouse. DC also testified that he had calculated the original rate of $2.50 on the basis that he would be able to hire a smaller warehouse than that then used by the plaintiff and that the rental for such warehouse would be less than the rental paid by the plaintiff. 40        The plaintiff in response to the above arguments pointed out that CY’s evidence was that when he was negotiating the first quotation with DC, he did so in the belief that D Logistics would provide the plaintiff with the warehouse. The plaintiff considered that this evidence contradicted DC’s claim that the first quotation did not include D Logistics’ cost in taking over the warehouse rental. I am, however, more inclined to accept DC’s evidence on this point. He was quite clear in his testimony in court that he did not know until that meeting with CY that the plaintiff wanted him to take over the particular warehouse that it had been renting. He knew that he had to provide a warehouse but had thought that he could rent a smaller and cheaper warehouse. It was only at that meeting that he learnt that taking over the plaintiff’s warehouse was a condition of the contract. He explained that the warehouse the plaintiff had been using was actually too big for the amount of cargo that it was storing at that time and that was why he was planning to rent a smaller warehouse at a lower rental. It is also significant, in my view, that only the second quotation contained an express term stating that the tenancy of the warehouse was to be taken over by D Logistics. This term is not found in the first quotation and had CY accepted that quotation, therefore, there would have been no obligation on D Logistics to take such action. The offer in the first quotation was, therefore, most probably made without regard to the cost of taking over the tenancy of the particular warehouse. 41        Referring to D Logistics’ claim that the new price was reached at the meeting discussing the first quotation, the plaintiff argued that it was extremely unlikely that CY and DC would have been able to come up, on the spot, with a rate that would yield an acceptable return. To this, DC replied that he had a good knowledge of the plaintiff’s goods, having been in charge of its account when the plaintiff used Visa Freight’s services. Also, DC illustrated during cross-examination how he had done his mental calculations and come up with the figure of $2.90 per tonne per week. Furthermore, D Logistics in fact operated at a loss at that rate, giving weight to DC’s testimony that he had calculated the rate on the spot. Finally, CY had also told DC at the same meeting that the plaintiff urgently needed to “discharge the warehouse” so it was not incredible that the price was quoted and agreed to at one meeting. 42        I find that the sequence of events was that CY asked DC for a quotation on the basis that D Logistics would provide a warehouse as well as warehousing services and thereupon, DC provided the first quotation. Further discussions, including the added consideration that D Logistics would be taking over the existing warehouse at the existing rental instead of being able to find its own premises, led to the second quotation and the adjustment of the basic rate by 0.40 cents per tonne, among other changes. In these circumstances, it was not a breach of duty for CY to accept the second quotation rather than the first even though the basic rate had been increased. 43        The next allegation made by the plaintiff in relation to the first quotation was that CY and MT deliberately concealed it from the plaintiff’s higher management and only disclosed the second quotation. It should be noted, however, that Mr Kan agreed in cross-examination that there was no obligation either on CY or MT to show all unsigned versions of the agreement (i.e.,quotations like the first quotation) to the plaintiff’s senior officers. 44        Further, in his closing submissions, CY argued that the plaintiff had not provided any explanation of what would motivate him and DC to come up with the first quotation nor why the first quotation was not destroyed but instead filed in a folder in MT’s cabinet in the plaintiff’s office. The plaintiff responded that the first quotation was not destroyed but only filed away because the defendants never thought it would see the light of day. They did not anticipate being escorted off the plaintiff’s premises. This argument does not really answer the point because even if the defendants did not expect to be rushed off the premises, there was little reason for them to keep incriminating evidence at all much less within the plaintiff’s office. There would have been no difficulty at all in destroying the first quotation once it was decided to artificially inflate the price of D Logistics’ services. 45        MT denied any involvement in the agreements reached between DC and CY. Both of them had testified that she was not present during the negotiations which resulted in the first and second quotations and was not involved in reaching the agreed price. The plaintiff argued that this was not believable because it was only natural for conspirators to testify that there had been no conspiracy and try and explain away their actions. Whilst this may be so, MT’s function was mainly a back office function and there was no reason for her to be involved in the negotiations. The only evidence of her involvement was CY’s testimony that he had told her that he was asking DC for a quotation and that DC marked the second quotation for MT’s attention. The first quotation had, however, been addressed only to CY and this fact supports MT’s submission that she was not involved in the negotiations at that early stage. If she was not involved at that stage, then it is highly unlikely that she was involved later. 46        In my judgment, CY’s acceptance of the second quotation was a genuine decision taken by him in what he considered at that time to be the best interests of the plaintiff. The warehousing rate in the second quotation was justifiably higher than the rate in the first quotation because it had to reflect the costs that D Logistics would incur by taking over the plaintiff’s existing warehouse for which the plaintiff was paying a higher rental than D Logistics had contemplated paying. Following from this finding, it is logical to find that although the first quotation was not shown to the higher management in the plaintiff, this was not due to any sinister effort to conceal it from them. If CY’s acceptance of the second quotation wasbona fide, then even if MT had been involved in the negotiations, there could be no criticism of her on that score. I find, however, that there is no evidence to support the allegation that she was involved in the negotiations. In sum, I find that there was no breach of duty on the part of either CY or MT in connection with the acceptance of the second quotation.",
        "Was there any breach of duty on the part of CY or MT in relation to the supplemental agreement?": "47        The plaintiff’s case is that CY and MT deliberately negotiated the supplemental agreement separately from the second quotation rather than incorporating its terms into the latter document and that they concealed the existence of the supplemental agreement from the plaintiff by not filing it with the plaintiff’s finance department (although it was kept in MT’s cabinet) and by failing to enforce the plaintiff’s entitlement under that agreement. I should state immediately that I find no evidence of any involvement of MT in the negotiation of the supplemental agreement. 48        The express terms of the supplemental agreement were as follows: (a)        ten percent rebate on total storage charges on a monthly basis; and (b)        mode of settlement to be advised by the plaintiff. It was not in dispute that the ten percent rebate was not in fact given to the plaintiff throughout the period of its contract with D Logistics. 49        Although the plaintiff argued that the fact that the supplemental agreement was a separate document was evidence of a deliberate attempt by CY and MT to deprive the plaintiff of its entitlement under that document, there does not appear to me to be anything sinister in this arrangement. CY argued that it would be illogical for him and DC to hatch a plan to overcharge the plaintiff and then to separately agree to a ten percent rebate and document it in the supplemental agreement without having the slightest intention of enforcing it or eventually bringing the rebate to the plaintiff’s attention. I agree. Also, according to DC, CY had contacted him the day after having verbally accepted the terms of the second quotation and had then asked for a ten percent rebate. CD agreed and, as requested by CY, he prepared the supplemental agreement and gave it the same date as the second quotation. DC said that if CY had asked him to put the terms of the supplemental agreement into the second quotation, he would have done so. This, however, was not CY’s request and it was not DC and D Logistics’ concern to look into his motives for asking for a separate document. The plaintiff had no reply to these contentions. 50        The evidence also showed that while the second quotation was filed with the plaintiff’s finance department, the supplemental agreement was not. CY admitted in court that he told MT not to submit the supplemental agreement to the finance department and explained that this was because that agreement had not been implemented at that time. The plaintiff asserted that the omission to file the supplemental agreement was part of the plan to keep it concealed. It is hard for me to accept that submission because the whole existence of the supplemental agreement contradicts an intention to overcharge the plaintiff. If CY had conspired with DC to overcharge the plaintiff by agreeing to the rates in the second quotation, he would not have asked for the ten percent rebate at all much less made D Logistics commit itself to such a rebate by reflecting it in a written agreement. In this context, CY’s explanation that he had not given the document to the finance department because it was agreed that the supplemental agreement would not be implemented at that time makes sense. It is also significant that CY had initiated the request for the rebate entirely on his own and not under instructions from the plaintiff’s senior management. 51        The plaintiff, of course, contended that CY’s failure to enforce the supplemental agreement by asking for the ten percent rebate was evidence of the intention to conceal the agreement from it. CY’s argument was that the supplemental agreement was only meant to be activated when the plaintiff was facing financial pressures and was forced to implement cost cutting measures. According to CY, this was reflected by the fact that the mode of settlement of the ten percent rebate was not even fixed. D Logistics agreed that this was the understanding. The plaintiff contended that if that had been so, the additional condition would have appeared on the face of the supplemental agreement. Having heard the witnesses, I accept the evidence of CY and DC that the condition was understood to be a term of the supplemental agreement although it was not stated because of inadequate drafting. DC is not well versed in the English language and is not particularly well educated and therefore it is understandable that he did not ensure that all the agreed terms were expressed in writing though it would have been in his own best interests to do so, since, without the express mention of the condition, the supplemental agreement appeared to be immediately enforceable. In any case, if it was true that the ten percent rebate was unconditional, it would have been far more straightforward for CY and DC to have agreed on a rate of $2.61 per tonne per week directly (being 90% of $2.90). I find that the supplemental agreement was not intended to have immediate effect. 52        The plaintiff also argued that there were substantial contradictions between CY and DC’s versions of the conditions under which the supplemental agreement would be enforceable. DC said that the ten percent rebate was only exercisable when the warehouse was fully stocked. CY said, however, that there was no such condition. CY said the supplemental agreement was supposed to continue to be applicable to the new agreement in 2002 after the third quotation was accepted, but DC denied that. In my opinion, these contradictions did not necessarily mean that the parties were colluding with each other. As DC and D Logistics submitted, whilst there were differences in the details there was no difference between them and CY in relation to the objective and spirit of the supplemental agreement. Commercially, both parties were protecting the interests of their respective businesses with respect to the supplemental agreement. 53        It was also CY and MT’s case that the supplemental agreement and the second quotation were shown to Mr Mizumori. According to Mr Kan, Mr Mizumori had told him that CY had reported to Mr Mizumori “what kind of conditions, the terms and conditions [CY] is trying to sign an agreement”. I agree with the plaintiff that this comment did not necessarily mean that Mr Mizumori was shown both the second quotation and the supplemental agreement. The plaintiff also argued that neither CY nor MT raised this point in their defence and only mentioned it after it was clear that Mr Mizumori would not be called as a witness. Therefore, this defence was an afterthought tailored to the way that the trial unfolded. 54        In his affidavit of evidence-in-chief, CY had stated only that he showed the second quotation to Mr Mizumori but he submitted that while there was no express mention of the supplemental agreement in that statement, it should be “interpreted” in his favour. MT testified that the reason why she did not include that point in her affidavit of evidence-in-chief was that she assumed she could raise it on the witness stand. Neither submission is very convincing. 55        The defendants made a strong point of the failure of the plaintiff to call Mr Mizumori as a witness to rebut their allegations despite the fact that he is still in its employ and travels to Singapore regularly. CY invited me to draw an adverse inference from this failure but the plaintiff pointed out that the reason why Mr Mizumori was not called was that he had not been mentioned in any of the defences and therefore it had not been alerted as to the necessity of adducing evidence from him. I note also that when counsel for CY mentioned for the first time that CY had shown the supplemental agreement to Mr Mizumori, the plaintiff had immediately objected. I will not draw any adverse inference against the plaintiff in this connection. The contentions in relation to the supplemental agreement were only raised on the fifth day of the hearing. Before that the plaintiff had no reason to believe that evidence from Mr Mizumori was required. On the evidence as it stands, it appears to me that on the balance of probability, CY and MT did not show the supplemental agreement to Mr Mizumori. This finding does not conclude the point, however, because failing to show the document to Mr Mizumori does not mean that it was deliberately concealed from the plaintiff. The supplemental agreement was intended by both DC and CY not to be immediately enforceable. From CY’s point of view, it would not be implemented until cost pressures on the plaintiff necessitated cost cutting measures. That situation had not arisen up to the time the agreement was terminated and therefore the supplemental agreement was, so to speak, in a state of suspension. Accordingly, neither CY nor MT was in breach of duty in not enforcing the supplemental agreement or in bringing it to the attention of the plaintiff.",
        "Was the acceptance of the third quotation a breach of duty?": "56        The plaintiff’s case was that after a year, CY had agreed to accept the third quotation and thereby modify the terms of its contract with D Logistics in a way that was less favourable to the plaintiff than the first agreement had been. The differences between the second and third quotations are tabulated below:   Rate in the second quotationRate in the third quotationStorage charges for cartons/super-sacksNot mentioned (i.e.$2.90 per week per tonne)$2.90 per package/unitRepalletiseROCNot mentionedOvertime$30.00 per hourNot mentionedUnstuffing/Stuffing of containers (palletised cargo)20’ - $55.0040’ - $70.0020’ - $70.0040’ - $90.003-month notice period required if either party needs to review the agreementNot mentionedExisting tenancy agreement between Pole Technologies & the plaintiff to be taken over by D Logistics with no other costs to the plaintiffNot mentionedCurrent administrative and handling charges to be superseded by the above quoted ratesNot mentioned The issue that must be considered first in this connection is whether the differences between the two quotations actually support the plaintiff’s contention that the changes in the contract resulted in a worse deal for it. 57        The first difference was in respect of the charges for cartons and “super-sacks”. The plaintiff’s position was that there was no basis for the third quotation to differentiate between cartons and super-sacks and normal sacks when the second quotation did not do so. D Logistics had stored all packages at the same rate since 1 August 2001 and the plaintiff was entitled to insist that D Logistics continued to store both cartons and super-sacks at $2.90 per week per tonne until D Logistics had given it three months’ notice of the proposed price revision. Yet, CY had agreed (without insisting on the notice period) that from acceptance of the third quotation, cartons and super-sacks would no longer be charged on the basis of their weight but would be stored at the significantly higher price of $2.90 per package/unit per week. This change was advantageous to D Logistics as the cartons and super-sacks weighed less than one tonne each. 58        D Logistics’ position was that although it had stored cartons and super-sacks since August 2001, it was justified in differentiating the rates for these items because goods in such packaging required more labour to move and also took up more storage space in the warehouse. Super-sacks were also not the same as 25 kg bags (the standard packaging for plastics) as they could not be stacked and occupied a pallet each. DC stated that CY had acknowledged that because of these differences, it was only a matter of time before D Logistics approached him for a price revision. 59        This allegation lost much of its force when Mr Kan withdrew the conspiracy allegation with regard to the price for storing cartons and super-sacks although the plaintiff maintained its claim that D Logistics had overcharged it by overstating the number of super-sacks stored. Mr Kan’s concession meant that the plaintiff accepted that the price of $2.90 per package was a justifiable change from the rates quoted in the second quotation. 60        The next difference between the two quotations related to the three-month notice period required for any revision in the prices charged by D Logistics. This clause appeared in the second quotation but was omitted from the third. The plaintiff’s case was that there was no good reason for the omission of this clause since its absence meant that D Logistics was entitled to change its rates without any notice. 61        CY said at first that the reason why he did not insist on a three-month notice in respect of the change regarding the cartons and super-sacks was that he was aware of the problems that D Logistics had faced for many months in storing these items and considered that DC’s request for a revision of the rates was genuine. CY thought that he ought to help a supplier who was “suffering”. Moreover, Mr Mizumori was also aware of the super-sacks issue. Subsequently, however, during cross-examination, CY admitted that he was unaware that the three-month notice clause had been removed from the third quotation. Nevertheless he argued that it was not disputed that he had the authority to negotiate and enter into warehousing contracts on the plaintiff’s behalf and there was no evidence to show that he was not actingbona fidewhen he exercised his authority to waive the three-month period. 62        In view of CY’s admission that he was unaware that the three-month clause was absent from the third quotation, I cannot accept his explanation that he deliberately waived that requirement out of concern for D Logistics. The plaintiff’s position that CY acted to its detriment in not enforcing that clause in the second quotation and in not insisting that it appeared in the third quotation has not been refuted. 63        The plaintiff also argued that CY should not have signed the third quotation without ensuring that it incorporated the supplemental agreement giving the plaintiff the right to claim the ten percent rebate. CY’s response was that the supplemental agreement was still applicable to the third quotation and could be enforced whenever the plaintiff faced costs pressures. This response is not correct since the supplemental agreement was specifically entitled “Supplement to agreement dated 16 July 2001” and therefore was specifically referring to the first agreement. On its face therefore, it would not have applied to the second agreement reached in July 2002. On this point therefore, the third quotation was a worse deal for the plaintiff than the second. 64        In his submissions, CY alleged that the plaintiff had full knowledge of the terms of the third quotation. He relied on Mr Kan’s testimony that Mr Mizumori was aware of the terms set out in the third quotation and Mr Kan’s reply when he was asked whether Mr Mizumori objected to the terms of the quotation that he did not think that Mr Mizumori objected to them. In this connection too, CY said, an adverse inference should be drawn from Mr Mizumori’s absence as a witness. The plaintiff did not reply to this point. 65        From the above discussion, it is plain that the third quotation was a worse bargain for the plaintiff than the second quotation in relation to the absence of the three-month notice period of changes in rates and because there was not even the possibility of a ten percent rebate when the plaintiff faced cost pressures. The rates for stuffing/unstuffing of palletised cargo were also changed but the plaintiff did not make any arguments on that change. 66        Notwithstanding the adverse changes resulting from the third quotation, I cannot find any breach of duty in relation to its acceptance. This is because whilst CY was, in my opinion, negligent in not ensuring (or even asking) that the better terms of the second quotation were carried on into the third quotation, the changes in the terms (apart from the omission of ten percent rebate provision) were accepted by Mr Mizumori, his superior. Mr Kan said twice in court that Mr Mizumori did not object to these terms. That being the case, the plaintiff cannot complain about a breach of duty on the part of CY without also complaining of a breach of duty on the part of Mr Mizumori. There was no suggestion that the plaintiff thought Mr Mizumori was at fault. In relation to the lapse of the rebate term, the breach of duty was technical only as the plaintiff has not shown that the condition necessary for its implementation was met during the term of the second agreement. As far as MT is concerned, not only do the same arguments apply in her favour but also the plaintiff made no submissions on her involvement in the acceptance of the third quotation and must, therefore, be deemed to have dropped this allegation against her. In any event, there was no evidence at all that she was involved in the negotiations leading to the second agreement.",
        "Overcharging": "67        The plaintiff alleged that D Logistics had wrongfully overcharged the plaintiff in the five ways I have set out in [10] above. 68        As regards CY and MT, the plaintiff’s allegation was that they were responsible for it having paid the overcharged amounts to D Logistics because they either agreed to the wrongful basis for the overcharges or they failed, deliberately or negligently, to correctly verify the amounts due to D Logistics.",
        "Was there overcharging?": "Truncated weeks 69        The first head of overcharging was in respect of what the parties referred to as “truncated” weeks. The second quotation had provided for D Logistics to charge on a weekly basis. At first, this is what D Logistics did. Very soon after starting its services, however, D Logistics began to charge for periods that were less than seven days long as if they were full weeks. These periods occurred at the end of each month. The first four weeks of the month would be charged on the normal weekly basis – there would be an invoice for the first seven days of the month, one for the next seven (ie for the eighth to fourteenth day) followed by invoices for the third and fourth weeks. Then, instead of issuing an invoice for the next seven day period covering the last few days of the one month and the first few days of the succeeding month, D Logistics would issue an invoice for the remaining days of that month,i.e., either the twenty-ninth and thirtieth days or the twenty-ninth, thirtieth and thirty-first days but the rates charged in this final invoice instead of being pro-rated to reflect the actual period of storage covered would be the same as if the invoice was for a full period of seven days. This method of charging was what the parties meant when they said that D Logistics had charged on a “truncated” week basis. 70        The plaintiff argued that because MT allowed truncated weeks to be calculated as full weeks, it had been overcharged. 71        Each of the parties had a different version of how truncated weeks came to be charged. According to the plaintiff, Sarah Ng, MT’s subordinate who had been assigned to verify D Logistics’ invoices for the period from September to December 2001, had first come across a truncated week invoice when D Logistics charged for the 29thand 30thSeptember 2001 as a full week. Sarah Ng then checked with MT whether or not to approve the invoice. She testified that she was certain that MT had told her to treat the truncated week as a full week. 72        DC and D Logistics claimed that around the third week of September 2001, DC had called CY about the truncated week billing practice, and CY had given him the go-ahead to follow the same provided it was the market practice. DC testified that he had told CY that D Logistics could not otherwise survive, and that this was the market practice. 73        CY claimed that there was no such agreement with DC. DC had made the request but upon hearing it, CY had merely referred DC to MT. He heard no more about it subsequently, and only became aware of the charging of truncated weeks when he was informed of it by MT in or around April 2003. 74        MT claimed that she found out about the truncated week problem in early 2002 and had asked Ms Tan Mui Theng (an employee who had taken over the task of verifying D Logistics’ invoices), to check with DC about the truncated weeks. MT said Tan Mui Theng told her that DC had said it was the market practice. MT then accepted what Tan Mui Theng told her. She did not remember whether she had told CY about the truncated weeks but was certain that she did not speak to DC about them. 75        The plaintiff pointed out that Sarah Ng was likely to be telling the truth because she had been assigned the task of verifying the invoices and looking out for anomalies like the truncated weeks. Also, Sarah Ng had no incentive to lie, having left the plaintiff on 31 May 2002. MT, however, argued that Sarah Ng was an unreliable witness who was unable to give details of the alleged instructions given by MT. Furthermore, there had been no mention of the alleged instruction in Sarah Ng’s affidavit. 76        As for DC’s and D Logistics’ version, the plaintiff argued that this story at least was consonant with Sarah Ng’s version of the events, in so far as there was an agreement between DC and CY to charge for truncated weeks. The plaintiff, however, disputed DC and D Logistics’ claim that the agreement was reached on an arm’s length basis. There had been no mention of DC’s alleged telephone conversation with CY in DC’s and D Logistics’ defence. Also, referring to DC’s testimony that D Logistics could not survive without charging truncated weeks, the plaintiff argued that the charging of truncated weeks did not prevent D Logistics from suffering losses. CY himself stated that the alleged agreement regarding truncated weeks was not documented in any subsequent correspondence between CY and DC, nor was it mentioned in any discussion in relation to the third quotation. 77        DC and D Logistics submitted that DC’s version was substantiated by a tape recording of a conversation between DC and Mr Kan which took place at the end of May 2003. This taped conversation was recorded by the plaintiff without DC’s knowledge. DC and D Logistics considered that this recording showed that they had consistently asserted that DC had told CY that he could not survive without charging the truncated weeks, and CY agreed to it. 78        In support of his own version of events, CY argued that he never received any invoices setting out the truncated week charges and was not involved in the verification process, and thus it was entirely plausible that he would have been unaware of this issue until he was informed of it by MT in or around April 2003. Also, he argued that no instructions were given to MT to allow the charging of truncated weeks. 79        In response, the plaintiff submitted that CY’s testimony did not match anybody else’s story. It argued that if CY did ask DC to check with MT, there was no reason why DC should not have done so. Yet, MT did not say anywhere that DC had asked her about truncated weeks. Also, it would not have made any sense for DC to charge for truncated weeks without either CY or MT’s permission since, had he done so, his invoices would have been immediately rejected by the plaintiff. The plaintiff submitted that DC would not have needed to check with MT if, as DC had claimed, CY had already agreed to the truncated weeks. There was also no reason for CY to tell DC to refer this matter to MT because CY had been the plaintiff’s negotiator for all the other contractual terms between the plaintiff and D Logistics. DC pointed out in his submissions that CY’s story on this point did not appear in his first affidavit and was only raised in a supplementary affidavit filed after DC’s own testimony had been given. 80        Referring to MT’s version of the events, the plaintiff argued that it was unlikely that MT would just have accepted it without further checking with anyone else when Tan Mui Theng told her that DC had stated that charging truncated weeks was the market practice. After all, MT had admitted to never having come across truncated weeks previously and had agreed that the other warehouses she dealt with had not followed this practice. It was also unlikely that both Sarah Ng and Tan Mui Theng had failed to notice the truncated weeks during the periods when they were supposed to verify the invoices. MT’s response was that it was entirely reasonable for her to rely on Tan Mui Theng who had had experience in the operational aspects of warehousing from 1995. 81        On this point, CY’s version was not convincing. He was the person who negotiated directly with DC on all the other issues. The second quotation made no reference to truncated weeks. Looking at it at face value, CY must have thought when he accepted it, that only full weeks would be charged at the agreed rate. That was also the position taken by D Logistics because DC knew that he had to get the consent of the plaintiff in order to change the basis on which it charged. DC naturally went to CY who had agreed all the other financial terms. To me it is most unlikely for CY, who had the responsibility for such financial matters, to have passed it on to MT by telling DC to discuss it with her. I find that DC’s version of this story is the true one. 82        I do not believe either that MT did not find out about the truncated weeks until January 2002. I must say also that if the story was true it showed MT to have been negligent in her checking of Sarah Ng’s work since the practice had been in effect for four months before MT found out about it. According to MT’s own testimony, all that Tan Mui Theng told her was that DC had said that charging truncated weeks was market practice. MT said that she based her decision on the fact that Tan Mui Theng did not object to what DC had said whilst she would have counter-checked with DC if Sarah Ng had told her the same thing. MT said that she trusted Tan Mui Theng’s experience entirely. That is not believable since Tan Mui Theng had joined the plaintiff in the same year that MT had, and thus did not have much more experience in these matters that MT did. In any case, Tan Mui Theng had not confirmed herself that it was market practice but simply said that this was DC’s claim. MT surely knew better than to accept the claim of a supplier at face value when that claim was to his advantage and to the plaintiff’s disadvantage. I also believe Sarah Ng’s evidence that she raised this issue with MT and was told to accept the invoice. She had no reason to lie and no bias either for or against the plaintiff. 83        What I do not quite understand is why MT gave Sarah Ng the instruction to approve the invoice for the truncated week. Whilst I accept that the invoice was raised by D Logistics pursuant to an agreement between CY and DC, there was no evidence that CY had told MT about this agreement. If CY had indeed told MT about it, this would have been a perfect defence for her yet she did not mention this. I can only surmise that when the first invoice for a truncated week was shown to her, MT assumed that D Logistics would not have issued such an invoice without the consent of CY and approved it on that basis. Whatever the reason for her decision, it was a mistake on her part not to have checked the position properly before approving the invoice. Notwithstanding this, given that the invoice was in fact issued pursuant to an agreement between CY and DC, the plaintiff cannot hold MT liable for adverse consequences flowing from this mistake as, if she had checked with CY, she would have been told that the charge was a proper one. The responsibility, if any, for this type of overcharging was CY’s alone. 84        As far as CY’s acceptance of this method of charging was concerned, the plaintiff’s position was that he had been wrong to accept DC’s request as he knew that under the second quotation, D Logistics was not entitled to charge this way. CY submitted that if he had agreed (a fact he did not admit), he would have done so on the basis that this was the market practice and therefore his decision would have beenbona fidein exercise of his authority to negotiate and amend the terms of warehousing contracts. The plaintiff did not adduce evidence that it was not market practice to charge truncated weeks. On the other hand, DC and D Logistics produced some quotations from other companies which appeared to indicate that they too charged on this basis. The makers of those documents were not called, however, so strictly speaking the documents were hearsay and not admissible. D Logistics also argued that CY had agreed to truncated weeks because D Logistics would not have survived otherwise and the collapse of D Logistics would not have been in the plaintiff’s best interests. There was, however, no evidence that supported this assertion. 85        Given that CY had the authority to negotiate contracts on the plaintiff’s behalf, the plaintiff would be bound by CY’s agreement with D Logistics notwithstanding that CY may have been in breach of dutyvis-à-visthe plaintiff when he agreed to the truncated weeks unless the agreement was a result of conspiracy between DC, D Logistics and CY. I will consider the issue of conspiracy later in this judgment. For the time being, I hold that,prima facie, the agreement regarding truncated weeks bound the plaintiff and therefore as between it and D Logistics, the submission of invoices for truncated weeks did not constitute overcharging. I also hold, however, that CY was in breach of his duty to the plaintiff when he agreed to the truncated week proposal put forward by D Logistics since the second quotation did not provide for this and there was no evidence either of a general market practice in this regard or that D Logistics would have collapsed if it was not allowed to charge on that basis. Manpower and equipment costs 86        Next, the plaintiff alleged that D Logistics had overcharged for manpower and equipment costs. D Logistics’ invoices included various charges for these items which were stated to be incurred in relation to the auditing and stocktaking exercises in the warehouse which were carried out from time to time. The plaintiff’s argument was that such exercises had been carried out before the first agreement came into effect and under cl G of the second quotation, it had been expressly provided that the quoted rates would supersede “the current administrative and handling charges”. The plaintiff argued that this meant that the charges stated in the second quotation included the manpower and equipment costs in relation to these items and there should not have been any separate charge for them. 87        CY argued that there was no overcharging because: (a)        MT, being familiar with warehousing procedures and having been involved in stock and audit exercises herself, had agreed that D Logistics should be allowed to charge extra for the additional manpower it provided during the stock counts; and (b)        Mr Kan did not provide any evidence for his assertion that charges for the additional machinery and manpower required to carry out a stocktaking are included in warehousing contracts as a common industry practice, despite there being no written provision for this in the second quotation. 88        D Logistics’ submission was that before 1 August 2001, it had provided services to the plaintiff on a lump sum basis and this had included its manpower and machinery. On the other hand, the plaintiff was responsible for the warehouse rental. As such, there was a clear division between D Logistics supplying manpower and equipment and the plaintiff supplying the warehouse. After 1 August 2001, however, payment was made on a per tonne per week basis and manpower, equipment and the warehouse rental were entirely the responsibility of D Logistics. As such, the rate of $2.90 per tonne per week could not include the additional manpower and equipment needed for the stocktaking exercises. D Logistics also pointed out that CY had testified that before 2001, stocktaking took between one and a half and two days to finish whilst after 2001, these exercises were finished within a day because more manpower was used. I note Tan Mui Theng’s testimony on this point contradicted D Logistics’ position. She testified that the annual stocktaking exercise was carried out over a period of two days, or at least one and half days. She noted that while the plaintiff tried to complete the exercise within a day, if this could not be achieved, the job would be carried forward to the next day. D Logistics admitted that Tan Mui Theng was a credible witness because she had no interest in the case. 89        To my mind, the resolution of this issue depends on a construction of the second quotation having regard to the factual matrix. The difference between the situation prior to 1 August 2001 and that thereafter when the first agreement was in effect, was that the old contract provided for payment on a lump sum basis. This meant that all services that D Logistics rendered in operating the warehouse, which naturally would have included stocktaking exercises, were covered by a single fee. In some months, D Logistics might have incurred less expense to provide those services and in other months, because of the extra efforts required, D Logistics’ costs might have gone up, but whatever the level of D Logistics’ work was, the fee remained the same. The first agreement was arrived at on a different basis. Both the first and second quotations contained a detailed list of the services that would be provided by D Logistics under the new regime and a detailed price list. There were for example, separate charges for “handling in/out charges”, for “storage charges”, for “overtime” and “one round trip trucking of general cargo”. Such itemisation had not occurred in the past. Thus, as I interpret the second quotation, it provided for the stated services at the stated prices and nothing more. If any additional services had to be provided, then there would have to be a separate agreement as to charges for those services. Audits and stocktaking exercises were additional services as these cannot fall within the common meaning of the terms “handling in/out charges” and “storage charges”. The fact that the second quotation stated under cl G that the “current administrative and handling charges would be superseded by the above quoted rates” only meant that for the services that had been quoted, the lump sum charge had been superseded by the individual rates. It did not mean that services that had not been quoted were included in the quoted rates. The quotation was not all encompassing. In my view, D Logistics was entitled to charge for any services that were asked for after 1 August 2001 and for which it had not quoted a price in the second quotation. It was not required to deliver free services since this was a commercial relationship and the basis of this relationship had changed entirely from the limited one that had existed previously. 90        The plaintiff has not adduced any evidence that the charges imposed by D Logistics for the audit and stocktaking exercises were unreasonable or beyond market rates. It was content to rely on the argument that these charges were covered by the agreed rates for storage charges. Since I have rejected that argument, there remains no basis on which I can find that D Logistics overcharged the plaintiff by including charges for the manpower and equipment costs it incurred when it assisted the plaintiff in the latter’s stocktaking exercises. The plaintiff argued that CY should not have allowed D Logistics to charge separately for the additional manpower and equipment costs. Whilst CY should perhaps have been more careful in his negotiations with D Logistics and ensured that either there was an agreed price for the stocktaking exercises or that there would be no extra charge for this item, since the second quotation was shown to Mr Mizumori, any lack of care on the part of CY has been waived by the plaintiff. In this connection, it was CY’s evidence that before he accepted the second quotation, he had brought it to the attention of Mr Mizumori and asked him whether he wished to sign it on behalf of the plaintiff but Mr Mizumori had directed CY to sign it instead. I should say also that it was never part of the plaintiff’s case that it did not have knowledge of the second quotation or that the same had been concealed from it in the way it alleged the first had been. Thus, even if Mr Mizumori did not see the second quotation before it was signed, the plaintiff’s higher management must have seen it shortly thereafter when it was filed with the finance department at which time they did not take issue with CY over his failure to include an express provision that D Logistics would assist in the stocktaking exercises at no extra charge. Inflation of tonnage volume 91        The next complaint was about inflation of the tonnage volume by D Logistics. This was allegedly done in two ways. The first was by D Logistics invoicing for the storage of an increasing volume of cargo which was not actually in the warehouse. The fact of overcharging in this manner was not disputed by DC and D Logistics. They disagreed, however, as to the quantum of overcharging. 92        Seeking to make MT liable for this type of overcharging, the plaintiff argued that MT instructed Sarah Ng not to verify the data for goods removed from the warehouse in the D Logistics’ stock movement report. When Sarah Ng was re-assigned, she passed on those instructions to Tan Mui Theng who took over the job of verification. This resulted in the plaintiff being unaware that the amount of goods for which D Logistics sent invoices was much greater than the amount of goods actually being warehoused. Sarah Ng had testified that she did not check the “out” transactions against the numbers in the plaintiff’s computer system because MT had told her not to. Accordingly, she only checked and ticked the “in” transactions. 93        MT denied that she ever gave such an instruction to Sarah Ng or Tan Mui Theng. MT’s first point was that Sarah Ng’s evidence was unreliable and she was a confused and unconvincing witness. In particular, Sarah Ng could not remember the date of the alleged meeting at which the instruction was given nor how the meeting proceeded. Sarah Ng also confused the method of verification of stocks with the method of D Logistics’ charges. According to Sarah Ng, MT only gave “very general instructions”. This, according to MT, was not evidence that the specific instruction not to verify the “out” transactions had actually been given. Sarah Ng also wrongly claimed that it was the plaintiff who charged D Logistics for warehousing services (rather than the other way around) and also displayed an incorrect understanding of the billing formula. 94        The plaintiff replied that Sarah Ng was not a fully cooperative witness and had to be subpoenaed to attend court. Her testimony was as clear as to be expected from a truthful witness who had no reason to lie and testified without extensive preparation on events which had happened four and half years previously. The plaintiff also argued that even if there were mistakes in her recollection of events, there was nothing tenuous about Sarah Ng’s testimony that MT told her not to check “out” transactions. 95        MT’s second point was that the giving of such instruction would have been inconsistent with Sarah Ng’s duty to verify the opening and closing balances of each week. MT pointed out that Sarah Ng conceded that MT did not give any instructions to her not to verify the opening balances for each week. As such, MT contended that Sarah Ng should have verified the closing balance for the previous week and/or the opening balance for the following week, which would only be possible by verifying the outgoing stock against the data in the plaintiff’s computer system, known as the Nagase Future System (“NFS”). It would thus have been absurd for MT to tell Sarah Ng not to verify the “out” transactions. 96        The plaintiff replied that MT was trying to shift the blame to Sarah Ng for having carried out incomplete verifications. Even though the data was available on the NFS for verification by MT’s staff and the finance department, MT had told her staff not to verify the invoices and it was not the finance department’s job to verify D Logistics’ invoices. MT had succeeded in misleading the plaintiff even though the data was freely available. 97        I agree with the plaintiff that Sarah Ng’s testimony is reliable on this particular point. Sarah Ng testified that MT even provided her with a reason why she need not verify the “out” transactions: MT had told Sarah Ng that while the “in” transactions needed to be verified because those figures were provided by D Logistics, the “out” transactions need not be verified because the figures for the outgoing stocks were keyed in by the plaintiff’s own staff. I find her testimony clear and unequivocal in this regard. 98        Further, the fact that another process (that is, the verification of opening and closing balances for each week) might have required the verification of “out” transactions is neither here nor there. It was clear that “out” transactions were not properly verified during both the verification procedures of D Logistics’ invoices as well as those of the opening and closing balances. It appears that the inadequate steps taken in the latter situation were not the result of instructions given by MT. Tan Mui Theng, for instance, testified that she had “assumed” that she did not need to verify the opening and closing balances. Nevertheless, this does not preclude Sarah Ng having not properly verified D Logistics’ invoices because MT had told her not to verify the “out” transactions. 99        I am also persuaded by the fact that MT admitted that she had noticed that Sarah Ng had not ticked the “out” transactions, indicating they were not verified, but nonetheless did not ask Sarah Ng about it. (This contradicted her earlier testimony that she did not notice that the “out” transactions were not ticked.) When asked why she did not seek clarification from Sarah Ng, MT replied that “different people have different ways of doing things, so it did not come across my mind that I need to ask her why she never ticked these ones but only ticked the GRNs”. I find this reason unconvincing, since MT herself claimed that Sarah Ng was new and inexperienced (in the context of saying that she would not have accepted Sarah Ng’s word if Sarah Ng had been the one to raise the truncated weeks issue to her). I do not think it likely that MT would simply have accepted Sarah Ng’s method of verification without question. 100      I therefore find that MT did tell Sarah Ng not to verify the “out” transactions. MT has herself admitted that it would be a “gross misdirection” if she had given that instruction. Thus, I have no difficulty in finding that she breached her duties to the plaintiff in this regard. Gross weight or net weight 101      The next way in which the plaintiff claimed that D Logistics had overcharged it was that the latter had treated sub-25 kg net weight bags as 25 kg net weight bags and charged the plaintiff on that basis. D Logistics responded to this claim by arguing that it was supposed to charge the plaintiff based on the gross weight and not on the weight marked on the bag, which was the net weight. The gross weight of a bag is heavier than its net weight, because gross weight includes the packaging material as well. As such, not only did D Logistics not overcharge the plaintiff but, in fact, the plaintiff was undercharged by 354.7 tonnes for the period from January 2002 to December 2002. This was because even if the sub-25 kg bags were charged as 25 kg bags, this charge was more than off-set by the undercharging of bags which were marked 25 kg and which actually had a gross weight of more than 25 kg, but which D Logistics only charged as 25 kg bags. In short, D Logistics rounded down more than it rounded up and this was to the plaintiff’s benefit. 102      Alternatively, D Logistics argued that the parties had agreed to D Logistics’ using the figure of 25 kg across the board. Tan Mui Theng had stated that even if the weight of the bag was less than 25 kg, she was supposed to use the figure of 25 kg. 103      The plaintiff replied that there was no basis for D Logistics to claim that it was supposed to charge the plaintiff based on gross weight. No witness had ever contended that the charge was based on gross weight and D Logistics had always invoiced on the basis of net weight. D Logistics’ invoices had been verified, countersigned and paid on a net weight basis. Further, DC had admitted that he charged sub-25 kg bags as 25 kg bags without obtaining permission from anyone in the plaintiff. 104      In this respect, the plaintiff’s argument is compelling. It is clear from the documents that D Logistics only charged the plaintiff on the basis of net weight. It is not acceptable for DC and D Logistics to now claim that D Logistics was supposed to charge according to gross weight when the documents showed no such practice and DC and D Logistics were unable to point to any evidence of an agreement on this point. D Logistics was, contractually, supposed to charge according to whatever was the net weight stated on the bag itself. Whilst CY and MT failed to object to D Logistics having charged sub-25 kg bags as 25 kg bags when the error was reflected in the latter’s invoices, that failure could not constitute a waiver or agreement with D Logistics to vary the established practice of charging according to net weight. It should be noted, also, that the plaintiff made no allegation that such overcharge resulted from an agreement on the part of CY or MT. Unit price 105      The next allegation relating to overcharging was that D Logistics had inflated the unit price of warehousing. This allegation comprised two issues: the first was that D Logistics charged $2.90 per tonne per week instead of $2.50 per tonne per week as required by the first quotation and the second related to a type of cargo called “LNP cargo”. I have already dealt with this first issue and found no basis for the plaintiff’s allegation that the charge of $2.90 per tonne per week was an overcharge. 106      As regards the LNP cargo, D Logistics charged the plaintiff $4 to $5 per tonne per week for such cargo when it was stored at the warehouse instead of using the standard rate of $2.90 per tonne per week. According to the plaintiff, there was no basis under the second quotation to justify a different charge in respect of LNP cargo as the second quotation did not differentiate between the types of cargo which the plaintiff was entitled to store with D Logistics. According to Mr Kan, LNP products were very similar to those produced by GE Plastics. 107      D Logistics disputed this. It said that LNP cargo was not at all similar to GE Plastics cargo and that because of these differences, CY had agreed to a different rate for LNP cargo. It emphasised too that Tan Mui Theng had agreed in court that the way in which DC had characterised LNP cargo in his affidavit was correct and, in particular, she had agreed that LNP cargo was completely different from GE Plastics cargo and was more difficult to store and handle. Furthermore, the plaintiff had been in a hurry to move the LNP cargo from another warehouse to D Logistics’ warehouse within a short time span and required manpower after the usual office hours. At the time when D Logistics and the plaintiff made the contract, the plaintiff did not deal in LNP cargo. When the plaintiff subsequently required D Logistics to handle LNP cargo, D Logistics was justified in asking for a variation of the contract to reflect the commercial reality of having to handle a different and more difficult kind of cargo than that which was previously contracted for. 108      CY’s evidence was that in about March 2003, he was informed by GE Plastics that it had just taken over a new product called LNP plastics and that the plaintiff should store the new cargo as well. The plaintiff was asked to transfer the LNP cargo from the warehouse in which it was then stored to D Logistics’ warehouse. When CY asked DC to make the necessary arrangements, DC agreed on the basis that the storage charges for the LNP cargo would be higher than the $2.90 per tonne per week rate set out in the third quotation. After discussion, CY agreed to a rate of $5 per tonne per week. He thought the higher rate was justified because: (a)  LNP plastic was a specialised form of plastic and was produced in small quantities to meet particular requirements; (b)  Each batch of LNP plastic was stored on a single pallet and this meant that, often, each pallet was not fully utilised. The result was that the pallets containing LNP cargo took up a lot more space in D Logistics’ warehouse than the same quantity of GE Plastics cargo did. 109      I note that there was evidence from the plaintiff itself that supported CY’s testimony that LNP cargo was qualitatively different from GE Plastics cargo. Johnny Wong, the plaintiff’s customer service manager and one of its witnesses, agreed that LNP plastics were generally ordered in smaller quantities than other kinds of plastics and each order would be stored on a single pallet so as not to mix up the orders. As the orders were small, the pallet would not be fully utilised. Mr Kan himself agreed that the nature of the LNP cargo was such that the pallet upon which such cargo was stored was not fully utilised, and hence warehousing of LNP cargo could not be done efficiently. 110      In these circumstances I am satisfied that CY acted bona fide in the exercise of his authority when he agreed to a different rate for LNP cargo than that charged for GE Plastics cargo. Thus, the plaintiff’s allegation of overcharging in this respect cannot be sustained. 111      The final allegation in relation to overcharging was that D Logistics had inflated the number of packages and charged for both packages and tonnage. The first part of this allegation was dealt with in part when I considered whether MT had given Sarah Ng instructions not to verify the “out” transactions. There was no denial by D Logistics that it had inflated the number of packages. The second part of this allegation no longer needs to be considered as the plaintiff withdrew its claim that super-sacks and cartons should have been charged on the basis of weight rather than on a per package basis.",
        "CY and MT’s duties to prevent overcharging": "112      The plaintiff pleaded that from August 2001 to May 2003, CY and MT were in breach of their duties to the plaintiff because they procured that the plaintiff made payment of the amount that D Logistics had overcharged or because they failed to take any step to prevent the plaintiff from paying those amounts. 113      What is the applicable standard of care which an employee must adopt in the performance of his job? CY cited two local casesPersonal Automation Mart Pte Ltd v Tan Swe Sang[2000] SGHC 55andVita Health Laboratories Pte Ltd v Pang Seng Meng[2004] 4 SLR 162(“Vita Health”) but those dealt more with the duties of a director than with those of a senior manager who did not owe fiduciary duties to the company. The proper reference for such an employee remains the duty of reasonable skill and care arising out of his contractual relationship with his employer:Lister v Romford Ice and Cold Storage Co[1957] 1 All ER 125. What is the appropriate standard of care to which an employee may be held? Ravi Chandran inEmployment Law in Singapore(2005) states, at p 130: Carelessness must however be judged in the light of what may fairly be expected of the employee. Higher standards may be demanded from those who expressly or impliedly hold themselves out as having some particular skill or expertise. Whilst the court inVita Healthstated that a court would be reluctant to fault a director who hadbona fidedelegated his functions or powers to competent subordinates, this principle does not mean that a director or, for that matter, a senior manager, can never himself be held negligent because the loss complained of resulted from the negligence of his subordinates whom hebona fidebelieved to be competent. A senior manager cannot abdicate his responsibility to oversee this performance of his subordinates no matter how competent they may have proved themselves to be in the past. What is crucial is that the manager must have in place a proper system of ensuring that his subordinates do not make serious mistakes, and such mistakes if committed are quickly spotted and rectified. Failure to check D Logistics’ invoices 114      The plaintiff alleged that CY and MT were in breach of duty because they failed to check D Logistics’ invoices properly. In response, CY said that this failure was not his but MT’s alone and MT herself attempted to lay the blame on Sarah Ng and Tan Mui Theng. 115      The plaintiff argued that MT had breached her duty in not detecting the increasingly wide differential between what was recorded in the invoices and what was actually stored. This was because of the way the verification of invoices was done. The system of verification was described by CY as follows: (a)        any invoice received by the plaintiff from DL would be routed to the warehousing unit of the customer services department within the division; (b)        an employee working in the warehousing unit (i.e.first Sarah Ng and, subsequently, Tan Mui Theng) would then verify the volume of cargo stated in the invoice and in respect of which storage charges were being levied; (c)        once the invoice had been verified, it would be handed to MT as senior manager of the customer service department for her counter-signature; and (d)        MT would countersign the invoice and send it to the finance department so that payment could be processed and a cheque issued. 116      The issue was whether MT had inherited the verification system from the time when Visa Freight was handling the plaintiff’s warehousing needs or whether she had devised a new system. MT argued that the former situation was the true position and that it was thus reasonable for her to continue to use that system, which had been working well. The plaintiff argued that MT had set up the verification process with Sarah Ng in August 2001, as it did not exist before that time. 117      The evidence supports the plaintiff’s position. Visa Freight had charged on a per tonne per week basis. When D Logistics took over, it initially charged on a lump sum basis. It was only after August 2001 that D Logistics charged on a per tonne per week basis. There was no evidence produced on either side as to the procedure that was followed during Visa Freight’s time. On the facts, I accept that MT set up the system in question only in August 2001 when it became necessary to verify the volumes stated in D Logistics’ invoices. 118      That said, even if MT did inherit the system, in my view, she had tinkered with it by telling Sarah Ng not to verify the “out” transactions. Furthermore, it would also have been MT’s continuing responsibility to ensure that the system functioned as it should. MT disagreed, submitting that it was reasonable for her to expect the subordinate appointed to do the work to possess a reasonable level of skill and to be able to carry out the job of verification. Tan Mui Theng, in particular, was an experienced staff member and thus it was reasonable for MT not to brief Tan Mui Theng when she took over Sarah Ng’s job in January 2002. MT pointed out that she held monthly meetings with her staff. She also conducted random checks on Sarah Ng’s verification work but stopped doing this a month after Tan Mui Theng had taken over. This was reasonable as Tan Mui Theng had done verification work before and was well versed in warehouse operations. 119      MT further argued that, at any rate, Sarah Ng and Tan Mui Theng should have spotted the errors when they were checking the closing and opening balances, as MT had never instructed them not to check those figures. Tan Mui Theng had admitted that she had simply assumed that she did not have to check the balances, although she would have detected the errors if she had done so. According to MT, this showed that the system of verification was not at fault, but it became inefficient because of human error. MT also argued that she did not have a duty of repeating the verification work undertaken by her staff. 120      As I have stated above, Tan Mui Theng was not more experienced than MT and the latter should not have assumed that Tan Mui Theng’s experience would have rendered the chances of a slip-up so negligible that she was justified in terminating the random checks. By saying this, I am not imposing a requirement of close and constant supervision but simply holding that a reasonable manager should not abdicate all responsibility to her staff, no matter how competent she may think they are. MT’s supervisory role clearly extended beyond merely setting the initial system of verification in motion by briefing Sarah Ng in July 2001. MT herself appreciated the risk of human error, and this was demonstrated by her random checks of Sarah Ng’s work. It was also disingenuous to say that because MT’s subordinates could and should have detected the error by the proper performance of their other duties (i.e.the verification of the opening/closing balances) their mistakes relieved MT of her supervisory responsibility to ensure that the system put in place did not go wrong. 121      The plaintiff also claimed that CY had failed to take proper steps to prevent and detect the overcharging. In particular, CY breached his duties by personally countersigning some invoices without finding out what was involved in the process either before or after such signing. 122      In response, CY first noted that he had no involvement in the verification and payment process except for when he countersigned three invoices out of the over two hundred disputed invoices (according to Mr Kan’s affidavit of evidence-in-chief, CY countersigned six invoices). According to CY, he had only signed those invoices because MT was not there at the time, and, before doing so, he had checked with Tan Mui Theng that she had already verified those invoices. 123      Second, CY argued that he did not have any knowledge of the alleged instruction given by MT to Sarah Ng not to verify the “out” transactions. There was also no evidence that CY had given any instruction of that nature. 124      Third, CY pointed out that Sarah Ng and Tan Mui Theng should and could have spotted the errors even if MT did tell Sarah Ng not to verify the “out” transactions by verifying the figures against the NFS. CY also argued that the NFS was accurate at all times and anyone could have verified the correct figures at any time. In addition, audits and 100% physical stock counts were conducted twice a year to verify and countercheck the stock figures. There was thus nothing wrong with the system of verification and, accordingly, the fault for missing the discrepancies lay with Sarah Ng and Tan Mui Theng rather than CY. 125      Fourth, CY argued that it was reasonable for him to have relied on MT’s experience to manage the customer services department. In this regard, CY stressed that senior employees should be entitled to delegate duties to their subordinates and expect them to carry out those duties diligently. CY claimed that the following factors demonstrated the reasonableness of this reliance: (a)        that the warehousing unit was a dedicated unit within the customer services department headed by Tan Mui Theng who had the specific task of verifying D Logistics’ invoices; (b)        that both MT and Tan Mui Theng were university graduates more than sufficiently qualified for their jobs. Tan Mui Theng was familiar with and experienced in warehousing matters. Prior to this incident, both MT and Tan Mui Theng had been highly regarded by the plaintiff; (c)        CY had weekly feedback sessions with his subordinates in the division. The heads of the units did not raise any irregularity in respect of D Logistics’ invoices at these meetings, nor was any difficulty raised with regards to the verification process; and (d)        the fact that the finance department made payment of the verified invoices showed that it was satisfied with the verification system in place. 126      I do not think that CY had any duty to personally verify every single invoice from D Logistics. Clearly, that responsibility belonged to Sarah Ng and Tan Mui Theng and they acted under the direct supervision of MT. MT had breached her duty by issuing an instruction to Sarah Ng which made it easier for overcharging to occur. She also failed to properly conduct random checks to ensure the continuing integrity of the verification system she had set up with Sarah Ng after January 2002. The question here is whether CY should have uncovered the mistakes MT had been making. 127      I believe that it was incumbent on CY to have properly overseen what MT was doing with respect to the verification system. There was no evidence that he ever asked MT how the system worked. It was inappropriate for him to merely leave it up to the customer services department or the warehousing unit to bring up any problems it faced at his periodic feedback sessions. This form of supervision would probably have taken the form only of an occasional briefing or update. It was insufficient to rely on subordinates to spot their own mistakes – even if the NFS was accurate and would have revealed the discrepancies, the problem here was that nobody was checking it and the relevant staff members had assumed they did not need to. It was also remiss of CY not to take any action to ensure that MT, on her part, was doing her job properly even if she was known to be a good worker. 128      Finally, I do not think CY can disclaim responsibility for the countersigning of the three or six invoices simply because they were only a small proportion of the disputed invoices. The purpose of the countersignature was precisely to avoid the problems which arose. Even if CY was merely standing in for MT, it was then incumbent on him to assume the same level of responsibility which she had when countersigning invoices. Failure to stop payment 129      The plaintiff’s next claim centred around the alleged failures of CY and MT to inform it of the overcharging after they had found out about it and to stop payment to D Logistics. The following account of the relevant events is taken from CY’s affidavit of evidence-in-chief and MT’s second supplementary affidavit of evidence-in-chief. Other than arguing that CY and MT’s actions were donemala fideand in complicity with DC and D Logistics with respect to the overcharging, and except where noted below, the plaintiff had no quarrel with the sequence of events. 130      In March 2003, while perusing the monthly report in respect of the plaintiff’s performance for the month of February 2003, CY noticed that the plaintiff’s selling expenses as compared to its sales figures were very high. This was unusual and CY highlighted these figures at the monthly management meeting in March 2003. At Mr Kan’s request, CY also instructed MT and Tan Mui Theng to prepare a report to explain the figures. (Note: Mr Kan had testified that it was actually he who discovered the irregularities in October 2002 while checking the sales expenses. He then told Mr Mizumori and CY to report to him at the beginning of 2003. However, I do not think anything turns on this point except to show a rather lackadaisical attitude on the part of Mr Kan). 131      In March 2003, CY requested a meeting with DC. MT and Tan Mui Theng were also present at this meeting. CY highlighted the high warehousing expenses to DC and asked him about D Logistics’ calculations. CY asked DC to check for any errors in the invoices and DC agreed to do so. 132      CY, MT, Tan Mui Theng and DC met for a second time on 21 April 2003 (“the 21 April 2003 meeting”). At this meeting, DC acknowledged that D Logistics had overcharged the plaintiff. As a gesture of goodwill, DC said that D Logistics would not invoice the plaintiff for warehousing charges incurred in the first and fifth weeks of April 2003. 133      In early April 2003, MT submitted the report requested by Mr Kan to CY. This report was then passed to Mr Mizumori but was not accepted. A revised report was prepared by MT but this was not accepted either. A final report (“the Final Report”) was prepared and CY and MT met with Mr Kan on 14 May 2003 to discuss it. Kunio Ishida, the plaintiff’s finance and administration director, was also present. At this meeting, Mr Kan gave instructions that no further payments were to be made to D Logistics. On that same day, however, a cheque for the sum of $129,867.15 (“the last cheque”) was drawn by the finance department in favour of D Logistics and sent out to the latter. 134      On 26 May 2003, MT produced yet another report detailing warehouse figures. There was no discussion of this report, however, as Mr Kan terminated CY and MT’s employment that day. 135      According to the plaintiff, CY and MT had admitted that they found out about the overcharging at the latest by about 21 April 2003. CY had said that during the 21 April 2003 meeting, DC had provided CY and MT with some handwritten figures setting out the tonnage figures for the preceding 12 months which formed the basis for D Logistics’ invoices to the plaintiff. CY said that it was obvious to him that the tonnage figures were in excess of what he knew to be the range of the plaintiff’s stock stored in D Logistics’ warehouse. 136      The plaintiff claimed that CY was aware that any error in the closing balance would be carried forward indefinitely. However, even after 21 April 2003, CY and MT did not take any step to stop the plaintiff from making further payments. CY admitted that he did not raise this possibility with DC. Instead, he and MT agreed to D Logistics not billing for two weeks without informing the plaintiff’s higher management. This only reduced the storage charges for April 2003, but in the meantime, D Logistics’ invoices for other weeks continued to be excessive. It was ultimately the plaintiff’s higher management who instructed payment to be stopped. As such CY and MT were both responsible for failing to stop payment of the last cheque. 137      Referring to the last cheque, CY argued that this allegation could not be raised because it was not pleaded. While I agree that the allegation relating to the last cheque was not particularised in the plaintiff’s statement of claim, I think that the plaintiff’s general pleading that CY and MT had failed to prevent the plaintiff from making payment of the overcharged amounts to D Logistics was sufficient to encompass this specific allegation. 138      CY argued that his failure to stop the last cheque was not a breach of duty because instructions to stop payment of D Logistics’ invoices were only issued by Mr Kan on 14 May 2003, by which time the cheque had already been prepared and issued by the finance department. The last cheque itself related to invoices issued between 31 March and 30 April 2003 and the last invoice was countersigned by MT on 6 May 2003. Thereafter, the invoices were sent to the finance department and were thus out of CY and MT’s hands. Also, CY gave evidence that the decision not to stop the cheque was reasonable because: (a)        the plaintiff could not afford to stop paying D Logistics as to do so would probably cause D Logistics to cease doing business and that would affect the plaintiff adversely; (b)        the final amount by which D Logistics had overcharged was not finalised and CY wanted to see the exact figures before making a decision to stop payment; (c)        the amount of the overcharging also was not expected to be so substantial at that point of time; (d)        a replacement for D Logistics could not be found in a short time; and (e)        CY was confident of working out an agreement with D Logistics which would enable the plaintiff to recoup its losses. 139      On MT’s part, although she admitted that “it would have been foolish of MT or CY to allow the cheque to be paid” after knowing of the fact of the overcharging, she argued that “unfortunately the cheque went through in the normal processes and [not] through any deliberate plan to let D Logistics have the payment(sic).”. She claimed that this did not happen because of any specific conduct on the part of herself or CY and hence they should not be blamed for it. 140      The plaintiff did not respond to these contentions. In my view, if anyone other than the managing director Mr Kan, had the responsibility to stop the last cheque, it would have been Kunio Ishida, as the finance and administration director. I do not think it was CY or MT’s responsibility to give instructions to the finance department to stop issuing cheques, and, if anything, it was Mr Kan who should have made sure that the finance department was kept informed of the order. In any case, the higher management had notice of the overcharging in early April and could very well have given instructions then or any time between then and 14 May 2003, that no further payment would be made to D Logistics until the issue was sorted out. 141      As for the plaintiff’s claim that CY failed to tell the plaintiff that he agreed that DC would not bill for two weeks, I agree with CY that this is not a breach of his duties as this move in no way contributed to the overcharging and there was no plea by the plaintiff that CY had failed to keep it informed of his actions in relation to other aspects of his jobs. 142      MT prepared the Final Report where she “simulated” the opening “Billed mt” figures for D Logistics by doubling the “Actual mt”. This Final Report was presented to Mr Kan and Mr Mizumori, in the presence of CY on 14 May 2003. According to the plaintiff, the “simulated” figures significantly understated the extent of the overcharging in the following manner:  Actual amount stored with D LogisticsAmount which Final Report said D Logistics invoicedAmount which D Logistics actually invoicedJanuary 20033,934.00mt7,868.00mt10,442.00mtFebruary 20033,053.00mt6,106.00mt10,289.00mtMarch 20033,249.00mt6,588.00mt11,102.00mt 143      The plaintiff alleged that MT did not warn Mr Kan or Mr Mizumori about this. Her position was that this should have been understood from a footnote in the Final Report which said “Carryover of 1-week storage from previous month since Jan”, because that statement indicated that the figure was derived from adding the closing stock of December and the opening stock of January together. MT did not tell Mr Mizumori or Mr Kan that the opening “Billed mt” figures in the Final Report were not actual figures or that they were “simulated” to be exactly twice the opening “Actual mt” figures. 144      MT argued that it was impossible for her to have presented any false information in the Final Report as it would have been possible to check her figures against the NFS raw data. The “Billed mt” figure was simulated because investigations were still continuing at the time in respect of the full extent of the overcharging. MT claimed that a simulated figure was not a false figure nor did it amount to a misrepresentation. 145      I find MT’s explanation of her simulated figures unconvincing. There was no indication to the reader that the “Billed mt” figures in the Final Report were not the actual billed figures from D Logistics’ invoices. MT admitted in court that she made no attempt to apprise Mr Mizumori of that fact. Even in the absence of bad faith, the false calculation which understated the extent of D Logistics’ overcharging, constituted a breach of MT’s duty of care. 146      The plaintiff also claimed that CY did not stop payment even though the Final Report showed that the discrepancy in metric tonnage and the resulting overcharging was more than triple what it should have been. CY merely said that he did not think of it at that time. CY had realised that the opening “Billed mt” figures for D Logistics in the Final Report were exactly double the corresponding “Actual mt”. He appreciated that this was unusual but he did not raise this with the plaintiff and took no action. He did not ask MT or anyone else about the figures. 147      CY also relied on the fact that he was not involved in the drafting of the Final Report. This was confirmed by MT. MT had also testified that she tried to explain the figures to CY but he did not understand them. Thus, CY argued, he could not be expected to point out the unusual features of the report to his superiors given his lack of understanding of how MT arrived at the figures. 148      While I find it somewhat puzzling that CY would be unable to understand something like that, I also note that it would have been in MT’s interest to say that CY had understood or even approved of her method of calculation. The fact that she did not, suggests that her statements are most likely to be true. I agree that CY should not be faulted for failing to bring MT’s unorthodox calculation methods to the plaintiff’s attention. There may be a further question of whether CY had a duty to make sure he understood the full details of the Final Report before bringing it before Mr Mizumori, but this was not pleaded as a breach of his duties. 149      The plaintiff also argued that CY admitted on or about 13 or 14 May 2003, after he and MT had met Mr Mizumori to discuss the Final Report, that he realised that D Logistics had overcharged the plaintiff by more than $100,000 for March 2003 alone. Despite this, CY did not raise the issue with the plaintiff. CY replied that it was illogical of the plaintiff to make this claim because Mr Mizumori would have been aware of this from looking at the Final Report submitted to him on the day of the meeting itself. I agree. There was no evidence that such information was particularly difficult to glean from the report, or that Mr Mizumori had failed to do so such that CY needed to tell him about it.",
        "Conspiracy": "150      The other main issue in this case is whether the acts pleaded by the plaintiff are sufficient to constitute the agreement or combination which is the primary requirement of a charge of conspiracy, whether by lawful or unlawful means. This question was considered by Belinda Ang J inOCM Opportunities Fund II, LP v Burhan Uray (alias Wong Ming Kiong)[2004] SGHC 115. She summarised and approved of the position set out inKuwait Oil Tanker Co SAK v Al Bader[2000] 2 All ER (Comm) 271 as follows: 47         Second, it is self-evident that in conspiracy cases of this type, it would be remarkable for various conspirators to regulate the arrangements as between themselves in a formal manner … Therefore, as is often the case, the agreement or combination is to be inferred from the evidence. 151      This proposition is counterbalanced by authorities which stress that cases of fraud and conspiracy require more evidence to meet the standard of proof. Andrew Phang Boon Leong JA said inWu Yang Construction Group Ltd v Zhejiang Jinyi Group Ltd[2006] 4 SLR 451that: 93         But mere unsubstantiated assertion is clearly insufficient. And even something that goes a little more beyond mere assertion is still insufficient. 94         Applying as well as elaborating upon the Singapore Court of Appeal decision inTang Yoke Kheng v Lek Benedict[2005] 3 SLR 263, I observed (at [39]): In summary, the standard of proof in civil proceedings where fraud and/or dishonesty is alleged is the civil standard of proof on a balance of probabilities. However, where such an allegation is made (as in the present proceedings),moreevidence is required than would be the situation in an ordinary civil case. Such an inquiry lies, therefore and in the final analysis, in the sphere of practical application (rather than theoretical speculation). In this regard, a distinction ought not, in my view, to be drawn between civil fraud and criminal fraud. [emphasis in original] 152      On this point, I agree with the plaintiff that the Court of Appeal’s decision inSeagate Technology Pte Ltd v Goh Han Kim[1995] 1 SLR 17does not stand for the proposition that the circumstantial evidence must “ineluctably” lead to the inference of a conspiracy. D Logistics submitted that proposition arose from the following observation of LP Thean JA appearing at [21] of the judgment: Looking at the evidence in totality, we are not persuaded that the circumstantial evidence relied upon by the appellants led ineluctably to the inference that the respondent and Heng were acting in concert pursuant to an agreement to cheat the first appellants. I cannot accept that submission as it is apparent from the paragraph that the Court of Appeal was only concluding that the trial judge’s decision that there was no conspiracy should not be disturbed and that the trial judge had been justified in making that finding. The trial judge had said that he “was not convinced,on a balance of probabilities, that there was an agreement or arrangement between the first and second defendants to cheat the first plaintiffs [my emphasis]”. Clearly, the trial judge had not applied any test of “ineluctability” and in view of the many authorities which have established the standard of proof without reference to such a test, the passing usage of the term in the Court of Appeal judgment cannot have been intended to change the established law.",
        "Was there a conspiracy by unlawful means?": "153      The plaintiff’s claims for conspiracy are based on the following unlawful means: (a)        Acceptance of the second quotation (i)         CY and MT told DC and D Logistics of the plaintiff’s readiness (through CY’s agency) to accept terms less favourable to the plaintiff and/or let DC and D Logistics know the terms that CY was prepared to accept on the plaintiff’s behalf; (ii)        DC and D Logistics unlawfully interfered with the plaintiff’s business by sending the second quotation to CY and MT, knowing that they were breaching their duties to act in the plaintiff’s best interests; (iii)       CY breached his duties by agreeing to the second quotation; (iv)       DC and D Logistics unlawfully interfered with the plaintiff’s business by providing warehousing services under the second quotation knowing that CY was in breach of his duties. (b)        concealing the supplemental agreement (i)         CY and MT neglected or failed to take any step to enforce the plaintiff’s entitlement under the supplemental agreement; (ii)        DC and D Logistics unlawfully interfered with the plaintiff’s business by failing to give the plaintiff its entitlement under the supplemental agreement, knowing that CY and MT’s neglect to enforce the supplemental agreement was in breach of their duties. (c)        acceptance of the third quotation (i)         CY and MT told DC and D Logistics of the plaintiff’s readiness (through CY’s agency) to accept terms less favourable to the plaintiff or let DC and D Logistics know the terms that CY was prepared to accept on the plaintiff’s behalf; (ii)        DC and D Logistics unlawfully interfered with the plaintiff’s business by sending the third quotation to CY and MT, knowing that they were breaching their duties to act in the plaintiff’s best interests; (d)        overcharging (i)         DC and D Logistics unlawfully interfered with the plaintiff’s business by overcharging the plaintiff in breach of the first and second agreements; (ii)        CY and MT procured that the plaintiff paid D Logistics the overcharged amounts or neglected to take any steps to prevent the plaintiff from paying those amounts, by: (A)     failing to check whether the amounts of stock D Logistics invoiced corresponded with the amounts reported to the plaintiff or with amounts stated in D Logistics’ own stock balance reports;(B)      (on the part of MT) instructing Sarah Ng not to verify the data for goods removed from the warehouse. (iii)       CY and MT failed to monitor the plaintiff’s warehousing expenses and inventory levels and neglected to investigate or bring to the plaintiff’s attention the substantial discrepancy between the plaintiff’s warehousing expenses and inventory levels. 154      So far, I have found the following in relation to the above allegedly unlawful acts: (a)        the agreements (i)         accepting the second quotation instead of the first was abona fidedecision taken by CY. There was no attempt to conceal the first quotation from the plaintiff. MT was not involved in the negotiations; (ii)        there was no intention to conceal the supplemental agreement from the plaintiff. The supplemental agreement was intended by both DC and CY to be enforceable only when cost pressures on the plaintiff necessitated cost-cutting measures; (iii)       Mr Mizumori knew of the third quotation and the plaintiff did not object to its terms. (b)        Overcharging (i)         truncated weeks – no overcharging. CY had agreed with DC that D Logistics could charge on the basis of truncated weeks. CY had, however, acted in breach of his duty of care in making such agreement without checking its necessity or desirability; (ii)        manpower and equipment costs – no overcharging. CY had not breached his duty by agreeing to such charges; (iii)       inflating the tonnage volume – (A)     this has been admitted by D Logistics and I have also found that MT told Sarah Ng not to verify the “out” transactions;(B)      sub-25 kg bags – overcharging. D Logistics was supposed to charge the plaintiff based on gross weight and not net weight; (iv)       inflating the unit price of warehousing – no overcharging with respect to charging $2.90 per tonne per week as well as charging higher rates for LNP cargo; (v)        inflating the number of packages and charging for both packages and tonnage – overcharging is admitted by D Logistics. (c)        CY and MT’s other duties to prevent overcharging (i)         failing to check D Logistics’ invoices – MT had failed to set up a proper system of verification to ensure that Sarah Ng and Tan Mui Theng spotted the errors in D Logistics’ invoices. CY had also failed to oversee MT’s actions; (ii)        failure to inform the plaintiff of discrepancies – CY and MT had not breached their duties to stop the payment of the last cheque. MT had breached her duties by simulating the figures in the Final Report without properly explaining her calculation to the plaintiff. CY was not in breach for not stopping payment based on the Final Report or for not telling the plaintiff of MT’s simulated figures. 155      It is clear from the above that there is no evidence at all to sustain any claim that there was a conspiracy between all four defendants with respect to the agreements. I also think that whatever breaches of duty CY and MT committed with respect to the overcharging do not bear out the conspiracy claim. The facts instead indicated that CY negotiated in good faith with DC in relation to the making of the first and second agreements and the supplemental agreement. CY’s powers to enter into such negotiations and to subsequently vary the agreed arrangements were sometimes not exercised as prudently as they should have been but there was no consistent pattern of fraud and deceit. Similarly, the managerial mistakes made by CY and MT led to the failure to discover overcharging by D Logistics, but there was little to suggest that these were deliberate attempts to work in concert with DC and D Logistics. This is true for both lawful and unlawful conspiracy. 156      In reaching this conclusion, I have borne in mind that there was never any evidence of any benefit to CY or MT from participating in the conspiracy. This factor is not, by itself, conclusive of the fact that there was no conspiracy, but the absence of such evidence places a heavier evidential burden on the plaintiff. The plaintiff had argued that CY had not disclosed any of his financial information for inspection. However, given that the burden lies on the plaintiff to prove the conspiracy and not for CY to disprove it, I do not think this argument carries much weight. 157      I also accept CY’s contention that the existence of accurate figures in the NFS system would have rendered any conspiracy to overcharge highly vulnerable to detection, such that it would have been unlikely that he and MT, at least, would have embarked on such a risky enterprise. CY argued that if there was indeed a conspiracy, he and MT would have altered the figures in the NFS, but it was accepted that no such tempering had taken place. The plaintiff’s submission that there was no need to falsify the system because no one checked the “out” transactions is unconvincing. While that may be so, it is clear that neither CY nor MT had done anything to ensure that the closing and opening balances would not be checked. Had either Sarah Ng or Tan Mui Theng or anyone else in the management decided to do so, the entire ruse would have been discovered. 158      I turn now to address some particular allegations by the plaintiff. 159      The plaintiff claimed that it was too coincidental that, after January 2002, MT had happened to stop the random checks which would have revealed the overcharging (except with regards to the truncated week charging), just as the overcharging started to happen. It was also a suspicious coincidence that MT appointed Tan Mui Theng to take over the verification at that time. The nefarious purpose of the latter act, according to the plaintiff, was so that Tan Mui Theng could be blamed for the overcharging. It would have been more difficult to blame Sarah Ng, who was inexperienced. 160      I find this proposition difficult to accept. It flies in the face of commonsense for MT, assuming she acted in bad faith, to appoint a more experienced staff member to be in charge of verifying the accounts just when the deliberate overcharging was taking place. As mentioned before, Tan Mui Theng could well have decided to verify the figures in the D Logistics’ invoices against the NFS figures and the game would have been up. As it turned out, she did not do so, but there was no evidence whatsoever that MT knew that Tan Mui Theng would not take this step. Neither MT nor anyone else had told either Sarah Ng or Tan Mui Theng not to verify the opening and closing balances so MT could not have acted in the expectation that Tan Mui Theng would omit a check that could expose her deceit. 161      It was also alleged several times by the plaintiff that the conflicting accounts put forth by the defendants were themselves evidence of a conspiracy, in that the conspirators were trying to implicate each other, now that the scheme had fallen apart. Somewhat contradictorily, the plaintiff had also alleged elsewhere that CY and MT were in some sort of arrangement to deflect liability onto DC and D Logistics, and where that failed, MT would be the one to take the fall. I do not accept this argument. It is clear in this case that overcharging of some nature had occurred and something had gone wrong. The various stories put forward by the defendants, contradictory as they were, may well have equally been the result of attempts to avoid being pinned with the blame for the overcharging, rather than evidence of conspirators having fallen out with each other. Whilst I have found that in certain instances the defendants did not tell the truth, I would hesitate to draw a conclusion of conspiracy from that alone. 162      Whilst there was insufficient evidence to establish the conspiracy allegations in relation to MT and CY, there were two defendants who were obviously deeply involved in the deliberate overcharging of the plaintiff. I refer, of course, to D Logistics and DC. It was apparent from the evidence that DC was at all times the moving spirit and alter ego of D Logistics. I accept that any deliberate action taken by D Logistics would have been on the instructions and with the knowledge of DC. I note also that these two defendants maintained that the overcharging had resulted from the mistakes of an employee of D Logistics but this employee was not called to testify as to how and why she had sent out the inflated invoices over such a long period of time and had not noticed that she was misstating the tonnage figures. Further, I do not believe that DC would have overlooked such mistakes consistently. I therefore find that he must have known of the overcharging as it occurred and been privy to it. 163      In the statement of claim, the plaintiff did plead, in the alternative, that all the defendants (or any two or more together) wrongfully and with intent to injure the plaintiff or cause loss to the plaintiff conspired to do so. The plaintiff further pleaded that in furtherance of this conspiracy, D Logistics (and DC procured D Logistics to) unlawfully interfered with the plaintiff’s business and/or contracts and/or, in breach of the first agreement and/or, subsequently, in breach of the second agreement, wrongfully overcharged the plaintiff. 164      Despite the above pleading, the plaintiff did not in its submissions specifically address the issue of whether DC and D Logistics could on their own, irrespective of any participation by MT and CY, be said in law to be liable in conspiracy to the plaintiff. This issue arises because of the position of DC as the alter ego of D Logistics and the views expressed in some authorities and texts that a combination may not exist between a corporation and natural persons where the persons involved are the partners or directors of the company. To me this is an issue that must be explored further as, at first blush at least, I consider it unattractive to have to hold that whilst DC may have caused D Logistics to deliberately overcharge the plaintiff, only D Logistics can be held responsible for that wrongful act and DC himself can elude liability. In the absence of full submissions on the point, particularly from DC, however, I am not able to come to a conclusion on this issue.",
        "The pleading issue": "165      The plaintiff argued that both MT and CY’s defences constituted bare denials and thus they should not have been allowed to raise any positive defences. The plaintiff also argued that DC and D Logistics’ defence also contained bare denials. I have left this to the end because it does not affect the substantive outcome discussed above. 166      This is an important issue, but only CY addressed it. CY made the following arguments: (a)        CY’s denials were not bare denials but instead implied an affirmative case, and hence he was permitted to adduce evidence at trial to prove that case; (b)        at any rate, the plaintiff was not caught by surprise and had ample time to respond to CY’s case; and (c)        the plaintiff did not raise any objections to CY’s affidavit of evidence-in-chief in its notice of objection to contents of affidavits of evidence-in-chief.",
        "“Bare denials” and “pregnant negatives”": "167      InArul Chandran v Chew Chin Aik VictorJP[2000] SGHC 111, it was noted by Chan Seng Onn JC: 204.      A traverse by denial of a negative averment may simply remain as a mere denial with nothing to be implied and as a consequence, the defendant will not be allowed at the trial to call evidence and set up in his defence an affirmative case to the contrary, which has not been specifically pleaded. Essentially, the defendant by such a mere denial would be simply putting the plaintiff to strict proof. But in certain cases, the double negative contains within itself an affirmative allegation. This is the “pregnant negative”, which clearly imports a positive assertion of fact, where particulars may be ordered, if not so given. The third possibility is that the matter is left in doubt in which case the pleading may be struck out as being embarrassing unless made clearer by an amendment. 168      While the conceptual distinction between a bare denial and a pregnant negative can be easily appreciated, determining whether any single pleading falls under the first or second category is a somewhat more difficult task. 169      To take one example, the plaintiff had pleaded that CY had concealed the first quotation from his superior officers. CY had merely pleaded that the entire paragraph in the statement of claim was denied and that the plaintiff was put to strict proof thereof. However, in his submissions, CY had contended firstly that the first quotation was not concealed because the first quotation was not a quotation but merely reflected D Logistics’ cost price (and hence need not be shown to the plaintiff), and secondly, that the fact that the first quotation was not destroyed but kept in MT’s drawer demonstrated the lack of an intention to conceal. 170      CY’s denial of the plaintiff’s claim could have been reasonably interpreted in a number of ways, including (as suggested by CY himself), the implied allegation that CY had indeed shown the first quotation to his superiors. However, the arguments and evidence which the plaintiff would have had to marshal to rebut each interpretation would differ substantially. It would not have been possible for the plaintiff to have reasonably anticipated the way in which CY would support his pleading that he had not concealed the first quotation from his superior officers. 171      One could compare this with the position inInland Revenue Commissioners v Jackson[1960] 1 WLR 873 (“IRC v Jackson”), where it was held that a denial of the claim that the defendant failed to furnish information as to his sources of income “without reasonable excuse” was a pregnant negative because it implied that he did have a reasonable excuse. As such, it was then open to the plaintiff to ask for further particulars as to what this reasonable excuse was. In that case, notably, the defendant was trying to argue that his denial was a bare denial, so as to avoid giving particulars and revealing his case to the plaintiff. This is quite the opposite from our present situation where CY is trying to argue that his defence was not a bare denial. 172      Sellers LJ inIRC v Jacksonseemed to be of the opinion, not directly expressed, that there was really only one interpretation of the defendant’s denial, and as such, it should be considered as an affirmative allegation. I think that the fundamental, though unstated, principle is clear – the “pregnant negative” denial must make it obvious to the plaintiff what the defence is, rather than merely be seen to be putting the plaintiff to strict proof of his own claim. 173      On that note, I am also of the opinion that the use of the phrase by any defendant “and the plaintiff is put to strict proof thereof” combined with a denial without further particulars suggests, though not conclusively, that the defendant is intending a bare denial rather than a pregnant negative. This is the case with CY’s denial of the first quotation concealment claim. 174      In the ordinary course of events, at this point it would become necessary to pick through each of CY and MT’s denials to determine which was a bare denial and which was a pregnant negative. Positive averments made to the former in submissions must be disregarded. Thankfully, this exercise is academic because of the following issues also canvassed by CY.",
        "The plaintiff was not caught by surprise and did not object": "175      As it turned out, the first time the plaintiff objected to the bare denials was in its closing submissions. The trial, as pointed out by CY, proceeded quite smoothly without the plaintiff facing any difficulties in obtaining witnesses and evidence to rebut CY’s defences, particularly because there was a gap of about a month between the first hearing, in which CY’s positive allegations were revealed for the first time, and the second hearing when the plaintiff’s case closed. It may be that the court may still allow the unpleaded defences in such instances: for instance, inSuperintendent of Lands and Surveys (4thDiv) v Hamit bin Matusin[1994] 3 MLJ 185, the Malaysian Supreme Court allowed evidence of unpleaded facts to be adduced because the opposing party was not taken by surprise. The specific defences raised were held to be “mere developments” of the defendant’s pleaded case. 176      The more persuasive point to me is that the plaintiff failed to raise any objections on the “bare denials” point in respect of any affidavits in its objections to contents of affidavits of evidence-in-chief filed on 9 March 2006. It has been noted inSingapore Court Practice 2006by Jeffrey Pinsler (at para 38/2/8) that the taking of objections to the affidavits of opposing parties “is a crucial stage of the proceedings as failure on the part of the advocate to raise appropriate objections may lead to the improper admission of evidence to the detriment of his client”. Citing the case ofHua Khian v Lee Eng Kiat[1996] 3 SLR 1, the learned authors also noted that it is important for a party seeking to avoid the consequences of its failure to object to give reasons why it did not do so in the specified time limits. The caveat to this principle is that inadmissible evidence does not become admissible simply by reason of a party’s failure to object, but this is not applicable in the present case. 177      In my opinion, even though the bare denials would have otherwise prevented CY and MT (and also possibly DC and D Logistics) from raising certain defences, it is too late in the day for the plaintiff to raise any objections to the contents of the defendants’ affidavits and consequently, any arguments premised thereon.",
        "Quantum of the plaintiff’s claim": "178      I will consider the quantum of the plaintiff’s claims against the various defendants in turn. First, as regards CY and MT, the plaintiff wants: (a)        compensation for breaches of CY and MT’s fiduciary and equitable duties; (b)        all overcharged sums; (c)        damages for breach of contract and duties; (d)        $146,232.62 for the acceptance of the second quotation instead of the first quotation; (e)        $104,937.65 for the concealment of the supplemental agreement from the plaintiff and/or failure to enforce the plaintiff’s entitlement under the supplemental agreement; (f)         $87,174.68 for the acceptance of the third quotation; (g)        $913,541.68 for the procurement of the plaintiff to pay the overcharged sums and/or neglecting to take steps to prevent the plaintiff from paying those sums. 179      On the basis of the findings that I have made earlier in this judgment, the plaintiff is not entitled to recover under most of the headings above as it has not succeeded in proving those claims. I have found that the plaintiff has only succeeded in proving the following material breaches: (a)        in respect of CY, his agreement to the plaintiff being charged on the basis of truncated weeks; (b)        in respect of CY, his failure to oversee MT’s actions in relation to the setting up and operation of a proper system of verification; (c)        in respect of MT, her failure to set up a proper system of verification and to supervise this system properly; and (d)        in respect of MT, her simulation of the figures in the Final Report and failure to properly explain her calculations to the plaintiff. As far as the last breach is concerned, the plaintiff has not in my view established that any damage has been sustained as a result of that breach since the Final Report was given some time after the overcharging was first discovered and the management of the plaintiff had had ample time before it saw the Final Report to take action to stop payment to D Logistics and ensure that new invoices were properly verified. The misstatement of the figures in the Final Report did not, as far as I can see from the evidence, influence the plaintiff’s conduct in any way since on the day the Final Report was issued, Mr Kan gave instructions for payment to be stopped and 12 days later, he terminated the employment of CY and MT. If the correct figures had been given in the Final Report, Mr Kan may have sacked them on 14 May 2003 itself but there is no evidence of what, if any, damage the plaintiff suffered as a result of employing these two defendants for a further 12 days. 180      As far as the other breaches are concerned, MT would be liable to compensate the plaintiff for all the overcharges relating to excess tonnage and packages only. CY would be liable for the same type of overcharges and would also be liable to compensate the plaintiff for the overcharges relating to the truncated weeks. 181      As far as D Logistics is concerned, the plaintiff claims: (a)        sums held as a constructive trustee of moneys paid in breach of CY and MT’s fiduciary duties; (b)        moneys held as trustee of the amounts overpaid by the plaintiff; (c)        $913,541.68 for the overcharging. In view of my findings above, (a) above must fail. As regards (b) whilst D Logistics is a trustee of the overpayments made by the plaintiff, the issue is what the amount of such overpayments was. The plaintiff said that that figure was the $913,541.68 set out in (c) and therefore in fact (b) and (c) are the same claim. I will discuss this claim in more detail below. I should, however, point out here that the amount of $913,541.68 is not the amount that CY and MT should be liable to pay the plaintiff under [179] above because it is a gross figure comprising all heads of overcharge asserted by the plaintiff and I have found CY and MT responsible for only some but not all of those heads. 182      As against DC himself, the plaintiff claims: (a)       sums held as a constructive trustee of moneys paid in breach of CY and MT’s fiduciary duties; and (b)        any commission, payment or profit held on trust for the plaintiff as a result of DC’s dishonest assistance of CY, MT and D Logistics. The first of the above claims has failed. The second of the above claims has failed in relation to the alleged association between DC, CY and MT and I have not yet received submissions on whether DC can be held responsible for simply conspiring with or dishonestly assisting D Logistics alone so no conclusion can be reached at this stage. 183      There is also a claim against all defendants for damages for conspiracy or unlawful interference in the plaintiff’s business. This has failed vis-à-vis CY and MT and as regards DC and D Logistics,inter se, further submissions are required. 184      Reverting now to the figure of $913,541.68, the question is whether that sum properly reflects the loss that the plaintiff had suffered as a result of the overcharging. DC and D Logistics noted the many changes which the overcharging figure had undergone from the time the plaintiff first discovered the problem until the end of the trial. The final amount in the plaintiff’s statement of claim (amendment no 6) filed on 21 July 2006, was $912,890.61. The figure of $913,541.68 came from a further revision of the statement of claim filed on 12 February 2007. The defendants might not be aware of this figure given that this filing took place long after their submissions had come in. (Counsel for the plaintiff explained in February 2007 in a letter to the court that he had forgotten to file this revised statement of claim earlier.) Quite apart from the changes in the figure, as I have stated above, the plaintiff has not particularised how each form of overcharging contributed to the overall global figure. Since I have found that only some of the claims of overcharging succeeded, it is impossible for me to arrive at a final figure for each of the defendants using the plaintiff’s submissions. This is a difficulty that I pointed out to counsel in the course of the trial and I was somewhat surprised that the plaintiff’s submissions did not condescend to particulars. There may well be a costs implication as a result of this omission. 185      There are two possible solutions. The first is to ask the parties to give me further submissions on the quantum of overcharging based on the findings that I have made. The other solution would be to use the figure of $417,075.35 which is the figure that D Logistics and DC admitted that D Logistics had overcharged the plaintiff by. This figure would represent the excess tonnage charged. It would not, however, include the charges for the truncated weeks since the position taken by D Logistics (which I have accepted) is that the plaintiff through CY who was acting with authority had agreed to that method of charging. It also does not include the amount overcharged by reason of the fact that D Logistics charged underweight bags as if they were bags of 25kgs. There is some evidence in the record as to the amount overcharged by reason of the use of the truncated week basis but the reliability of this evidence has been criticised by D Logistics. Since, however, a mass of evidence has been produced on the calculations, it would probably be fairest for further submissions to be made on quantum by all parties. If the plaintiff is not able to satisfy me as to its calculations, I would then use the D Logistics figures as the basis of the calculation notwithstanding the items that it does not cover. This would mean that the plaintiff would not be able to recover extra sums for the truncated weeks and the overcharging based on weight.",
        "D Logistics’ counterclaim": "186      D Logistics has counterclaimed a sum of $191,837.22 against the plaintiff, being the outstanding balance allegedly unpaid for services rendered. The plaintiff’s defence was that there was no legal or moral basis for that claim and it put D Logistics to strict proof. 187      There was some issue as to whether the unpaid invoices reflected overcharging (in the manner alleged in the plaintiff’s main claim). The plaintiff did not plead such overcharging as a defence to D Logistics’ claim but at trial Mr Kan first said, on questioning by me, that “these invoices are part of the overcharge and I am claiming”. In the end, Mr Kan said in cross-examination by DC and D Logistics’ counsel that he could consider the overcharging claim and this counterclaim as “separate issues”. At any rate, the plaintiff did not press this point in submission. 188      D Logistics’ counterclaim was based on a statement of account dated 30 June 2003 and a number of invoices dated February to June 2003, with the bulk of them having been issued between May and June 2003, after the stop payment order was issued by Mr Kan. D Logistics argued that the plaintiff had received these documents but failed to pay up despite not disputing any of the invoices for three years. Initially, Mr Kan had said that the reason why the plaintiff refused to pay was that he did not receive the account statement and the supporting documents (the invoices). Later on, he appeared to say that the dispute was about the correctness of the sums allegedly unpaid – that if the sums were correct, the plaintiff would pay up. In that vein, the plaintiff submitted that D Logistics’ invoices were totally unsupported by any evidence as regards the actual amount of goods stored at D Logistics’ warehouse at the material time. 189      It is clear that the plaintiff did indeed receive the 30 June 2003 statement of account as well as its supporting documents. The plaintiff’s general manager, Imamura Natsuki, filed an affidavit verifying documents dated 27 February 2006, which listed those documents as being in the plaintiff’s possession. Further, given that Mr Kan admitted that the plaintiff did not dispute any of the invoices at the time, the plaintiff has not provided a valid defence to the counterclaim. I therefore find that D Logistics has established its counterclaim.",
        "Conclusion": "190      The plaintiff is entitled to judgment against each of the defendants, except possibly DC, for sums which are yet to be determined. At the least, the amount due, vis-à-vis, D Logistics and MT and CY, would be $417,075.35 less the sum of $100,000 that D Logistics paid in May 2003 towards refund of the overcharges and less the sum of $191,837.22 (being the amount of D Logistics’ unpaid invoices). So the amount due to the plaintiff would be $125,238.13. If this is the final amount actually due to the plaintiff, then there would be costs implications at least vis-à-vis D Logistics who had from the very beginning admitted that this amount had been overcharged and was repayable. 191      I direct that the parties furnish further submissions as follows: (a)        the plaintiff shall file within three weeks of the date hereof submissions on the following issues: (i)         of quantum in respect individually of D Logistics, CY and MT; (ii)        of conspiracy between D Logistics and DC; and (iii)       on costs; (b)       D Logistics, DC, CY and MT shall furnish their reply submissions on the respective issues affecting each of them and on costs within three weeks of receipt of the plaintiff’s submissions."
    }
}