{
    "case_title": "Tan Siew Bin Ronnie v Chin Wee Keong",
    "ncitation": "[2007] SGHC 168",
    "coram": "Chan Seng Onn J",
    "sections": {
        "[LawNet Admin Note: Click on the link to the PDF above to see Annex A]": "7       Dr Lai Chan See examined the plaintiff in 2001 some four and a half years after the accident. He evaluated the plaintiff’s permanent impairments in accordance with the criteria in the American Medical Association’s “Guides to the Evaluation of Permanent Impairment” (“Guide”) and found as follows: % Impairment ofWhole PersonNeck extension to 40º2%Neck flexion to 45º1%Neck rotation 65º to right1%Neck rotation 55º to left1%Neck lateral flexion 20º to right2%Neck lateral flexion 25º to left1%Combined neck impairment8%Vertigo, where the usual activities of daily living are performed without assistance except for complex activities9%Total Combined Impairment16%[note: 1] 8       Dr Lai opined that the plaintiff had a 16% total combined impairment of his whole person caused by the recurrent vertigo and the limitation in the range of his neck movements. The neck pains and headaches would affect the plaintiff’s mental concentration during pre-trial preparation and his mental agility at trial. His productive working hours would be reduced and stress would aggravate his symptoms. The plaintiff experienced recurrent vertigo, usually brought on by elevating his head after it had been held in a flexed position for some time. On the occasion that it occurred in court, it was a very distressing experience for him. Dr Lai concluded that the permanent impairments had adversely affected the plaintiff’s performance as a litigation lawyer. 9       On re-examination of the plaintiff in 2006, Dr Lai found some improvement in the plaintiff’s condition. Dr Lai reduced the total combined impairment rating to 14%. 10     In view of the supporting medical evidence, I accepted that the accident had caused the plaintiff to suffer from whiplash injury to the cervical spine with residual permanent disabilities, which included frontal headaches, neck pain and stiffness, giddiness and vertigo, although he was pain-free most of the time. I also accepted the evidence that the plaintiff’s residual disabilities adversely affected his work as a litigation lawyer to some degree, especially when the symptoms manifested themselves. However, he has learnt to cope by avoiding certain neck movements which would likely trigger the onset of vertigo. His condition has improved and stabilised since the accident. 11     The main difficulty was to assess the quantum of the damages to be awarded. A sensible way forward would be to examine the awards in other comparable cases and use them as a guide to assess the amounts that should be given in this case. I was fully mindful that each case has to be decided on its own facts.",
        "Pain, suffering and loss of amenities": "12     Counsel for the defendant submitted that the amount awarded for pain, suffering and loss of amenities should be about $16,000 whereas counsel for the plaintiff contended that it should be in the region of $35,000. 13     InKuan Whye Mun v Yeoh Woei Chi Nicholas(DC Suit No 964 of 2003) (“Kuan”), the plaintiff suffered from whiplash injury and was awarded $18,000 for pain and suffering, and $70,000 for loss of earning capacity. She had pain in her neck and back. The medical report of Dr Sayampanathan stated that in between visits to his clinic, her pain was very bad. She required pain killer injections and medication. The frequent injections she received led to the development of inflammation and painful lumps in both her buttocks. Both the neck and back injuries were severe to the extent that there were neurological problems. MRI scans of the cervical spine showed a reversal of the cervical lordosis. There was evidence of damage to the spinal disc at C5/6 level resulting in a small postero-central disc protrusion at the same level. In contrast, the plaintiff in the present case did not have neurological abnormalities or deficits. Dr Ho, the plaintiff’s medical witness, stated that there was no cervical root disease or spinal cord involvement. In my view, the plaintiff inKuansuffered a greater degree of pain and suffering than the plaintiff in the present case. 14     InDoris Chia Ming Lai v Wendy Woo Siew Mei(DC Suit No 1359 of 1999) (“Doris”), the plaintiff, a lawyer, was awarded $15,000 as general damages and $60,000 for loss of earning capacity after sustaining an extension injury of the neck with residual symptoms, which included giddiness, headaches and neck pain. These residual symptoms were likely to be permanent. The pain was of sufficient severity to interfere with her typing and reading. She complained of constant headaches, which would start at the beginning of the day and worsen as the day progressed. Side-to-side neck movements produced giddiness, and extension of her neck produced extreme giddiness. Her working hours were reduced because of the mental distractions from the constant neck pains and headaches. Using the evaluation criteria in the Guide, Dr Lai Chan See assessed the plaintiff to have a combined neck impairment of 7% and a giddiness impairment of 5%, giving a total combined permanent impairment of 12 %. 15     In the present case, the plaintiff’s headaches normally set in during the late afternoons after he had been concentrating at work. According to Dr Ho’s latest medical report dated 9 February 2006, the plaintiff’s clinical status had improved. His episodes of cervicogenic vertigo had become less frequent. His neck movements also improved, although restricted neck movement to the left remained. Persistent myofascial trigger points in the left neck, shoulder, scalp and jaw, and frequent severe tension-type headaches continued. I accepted that the plaintiff’s total combined permanent impairment, assessed at 16% (and later reduced to 14%) by Dr Lai, was greater than that of the plaintiff inDoris. 16     InKarrupiah Nirmala v Singapore Bus Services Ltd[2002] 3 SLR 415(“Karrupiah”), the plaintiff sustained hyperextension injury and was awarded $24,000 for pain and suffering and loss of amenities. The doctor explained that the ligament holding the front of the bone was tender and the joints at the back were injured and swollen. The swelling had put pressure on the nerve and caused pain. The plaintiff would have chronic neckache and episodes of radiculopathy. The injury aggravated her cervical spondylosis and accelerated its deterioration and this could, in the long term, lead to sufficient pain or neurological compromise so as to require surgery. 17     InNirumalan V Kanapathi Pillay v Teo Eng Chuan[2003] 3 SLR 601(“Nirumalan”), the plaintiff suffered whiplash injury to the spine with posterior disc prolapse at the C5/C6 and C6/C7 levels. His congenitally narrow spinal canal made him susceptible to complete paralysis should he suffer another jolt. His condition would continue to degenerate if there was no surgical intervention. He suffered from weakness in both hands, a stiff neck and frequent headaches. He was awarded $30,000 for pain and suffering. It would appear that the plaintiff inNirumalanwas in a far worse condition than the plaintiff in the present case who did not require any corrective surgery. 18     The AR’s award of $24,000 might appear generous when benchmarked against the $18,000 awarded inKuan. But assessing the damagesde novoon the basis of the evidence before the AR and the AR’s findings (seeTeo Seng Kiat v Goh Hwa Teck[2003] 1 SLR 333;Chang Ah Lek & Ors v Lim Ah Koon[1999] 1 SLR 82), I decided that an award of $24,000 for pain, suffering and loss of amenities was broadly fair and reasonable, considering the different degrees of severity of the injuries and the quantum awarded in other cases, the monetary inflation and the plaintiff’s age at the time of the accident. The amount given must be sufficient so as not to trivialise the pain, suffering, inconvenience from the permanent impairments, and the loss of enjoyment of amenities from the time of the accident, including the frustrations and other psychological effects arising therefrom, which the plaintiff would have to bear.",
        "Loss of earning capacity": "",
        "Background of the plaintiff": "19     After the plaintiff was admitted to the bar in March 1991, he joined M/s Murphy & Dunbar as a legal assistant and built up a profile in litigation work. In May 1995, he moved to M/s Donaldson & Burkinshaw as a partner. He resigned in June 1996 to start his own firm, M/s Ronnie Tan & Associates (‘RT & A’). Two months later on 2 September 1996, the unfortunate accident took place. The plaintiff was 36 years old at that time. On 1 July 1997, he joined M/s Mas & Partners. A year later, he moved to M/s WT Woon & Co. In May 2002, he left to start his own firm, Central Chambers Law Corporation.",
        "Income of the plaintiff": "20     The following were extracted from the income tax returns of the plaintiff:-  YearAnnual Earned Income1995$66,786.101996$85,783.801997$152,083.001998$95,653.001999$112,942.002000$124,823.002001$147,762.002002$102,905.002003$113,670.00 21     The income for 1997 was unusually high because the plaintiff closed down his own firm - RT & A - and sent out many bills for work done before 1997. Based on the income figures above, I would not be far wrong if I were to assess his income to be about $120,000 per annum at the time of the accident in September 1996 (based on the average income of $118,933 per annum for 1996 and 1997). From 1998 to 2003, his income fluctuated between $96,000 and $148,000 per annum, giving an average income of $116,292 per annum for this period. For simplicity, I would just adopt a slightly higher average post-trial income of $120,000 per annum for this assessment, which would also have allowed for some increases in earned income in later years.",
        "Evidence of loss of earning capacity": "22     To better understand how the injuries sustained in the accident had diminished his work capacity, and adversely affected his productivity and performance as a lawyer, I set out in full what the plaintiff affirmed in his affidavit: (i)      I am a litigation lawyer. Litigation work and its nature does have its effect on my condition. There are pressures from the clients and litigation deadlines. The hours are long and at times while managing shooting pains in the neck or between the eyes, my efficiency is reduced. I have no alternative but to slow down on my reading from about 3.30pm to 4.00pm onwards. I then carry on at a much slower pace. This is frustrating at times. (ii)     Long trials affect me say after the 3rdor 4thday. As a litigator involved in trials in the Subordinate Courts and the High Court, it is a challenge to manage the condition, at least for long trials. I have had instances when after the 2ndor 3rdday of hearing, I had to ask the trial judge for frequent breaks. There have been occasions when even opposing counsel had to help massage my upper spine and back for me. (iii)   Reading for long periods (1 to 2 hours) brings about shooting pains up my neck area. At times, I experience tightness over my shoulders and experience shooting pains up my neck. That always causes a mood swing. I become irritable and it affects my work and relationship with my colleagues and staff members. Even my clients have not been spared this. (iv)    I got bouts of giddiness. These episodes are actually feelings of light headedness with sensations of being afloat. There have been episodes of giddiness in Court and while I was driving. There was such an incident in the Subordinates Courts Bar Room when I felt giddy after speaking with a fellow solicitor. At that time, I had my head held towards the left side for about a minute or so while speaking with him. I recall that on one occasion when I had to appear before Justice Tan Lee Meng in the High Court, I had an attack of giddiness while driving to Court. When I arrived in Court, the learned Judge saw the state that I was in and asked me to adjourn the matter and to go back and rest. On another occasion when I drove out on a Sunday to buy food for my family, I had a similar attack of giddiness and spinning. There have been other countless occasions of feelings of spinning sensations and nausea. As advised by the doctors, I would either lie down or sit with my eyes closed until the episode passes. The last attack was in September this year after having dinner with my wife. I was in the middle of a difficult High Court trial during that week. (v)     My mood swings are still there. This has at times affected my clients, my colleagues and my staff. I have raised my voice and shouted at them on many occasions. Some of my clients have not been very sympathetic even when they know of my condition. 23     The plaintiff said that if not for the accident, he would have been able to earn more than what he had earned since 1997, although he could not say with certainty how much more that would have been. He decided to claim for loss of earning capacity and not loss of earnings.",
        "Assessment of loss of earnings / loss of earning capacity": "24     Apart from some bald assertions, the plaintiff could not produce credible evidence of (a) the amount of legal business he was compelled to turn away for the period between the date of the accident and the trial date; and (b) the extra income that he could otherwise have earned during that period, if not for the accident which reduced his work capacity and efficiency. If he had produced the evidence, I would have assessed such pre-trial loss of earnings accordingly. There was none. Furthermore, with the income of the plaintiff gradually trending upwards after the accident, it would be more difficult for the plaintiff to establish that he had in fact turned away legal work because of his injuries. Accordingly, I assessed his “loss of pre-trial earnings” to be zero. Having assessed the “loss of pre-trial earnings” to be zero, there would be no reason, as will be seen from the cases below, to award any amount for “pre-trial loss of earning capacity” on top of the “loss of pre-trial earnings”. 25     I shall explain further. The actual state of affairs between the time of the accident and the time of trial would be known. Hence, there would be no “unknown risks” or “unknown factors” exacerbating the loss which must be accounted for. In a sense, all such “unknowns”, would be known and manifested in the actual income earned for the pre-trial period. For instance, if there was a risk of termination, and he was in fact never terminated during the pre-trial period, the probability of termination during that period would be zero as no termination took place. Hence, in most cases, the assessment of pre-trial loss of earnings could be made with a fair degree of accuracy on account of the facts being already available, unlike that for post-trial losses. As such, even if the “pre-trial loss of earning capacity” were to be quantifiable, it should have been subsumed under “loss of pre-trial earnings” to avoid any unintended double counting: see also the case ofTeo Seng Kiat([18]supra). 26     Hence, it remained for me to assess the potential future financial losses arising from the injuries and the permanent diminished earning capacity of the plaintiff,ie, the “post-trial loss of earning capacity” or the “post-trial loss of earnings” as the case may be, from the trial date till the plaintiff’s retirement from work, which I will refer to as the “post-trial period.” 27     Before I did so, I considered the cases cited by counsel. InNirumalan([17] supra) no award for “pre-trial loss of earning capacity” was given as the plaintiff did not stop working and his pre-trial earnings were not affected although there was clear evidence that he had cut back on his work since the accident. Kan Ting Chiu J noted that with the injuries continuing to affect his ability to work, it was likely that the plaintiff might have to reduce his share of the firm’s earnings, or retire earlier than he would have liked. On the basis that the plaintiff would have worked for the next 15 years (post-trial) till he was 65 years old, and taking account of the fact that he, being the founding and managing partner, was not likely to be forced out from his firm in the future, Kan J awarded the plaintiff $180,000 for “loss of future earning capacity”. In awarding this amount, Kan J took into account the evidence of the neurosurgeon, Mr Campbell, that the plaintiff would only be able to work for three to four hours at a stretch before having to take a rest and carrying on again for a shorter period. His capacity to work had been accordingly reduced. 28     To have any meaningful comparison, it was important to know the annual earned income of the plaintiff inNirumalan. I asked counsel for the information. Defendant’s counsel helpfully produced a table of his income for the various years prior to and after the accident on 19 July 1991. I observed that the average earned income wasaround $$420,000 per annum(about $35,000 per month) for the years immediately preceding and after the accident. The award of $180,000 was approximately 5.14 months of the average monthly income. The assessment was concluded by the assistant registrar on 30 August 2002, some 11 years after the accident. 29     Counsel for the defendant submitted that in the present case, the plaintiff’s ability to work had been affected to a lesser extent than the plaintiff inNirumalanbecause the injuries and disabilities were less serious. Counsel submitted that a fair award for loss of earning capacity would be between $35,000 to $40,000 based on 3.5 to 4 months of the plaintiff’s average monthly salary of $10,000. On the other hand, counsel for the plaintiff contended that the amount ought to be about $480,000. 30     InTeo Sing Keng v Sim Ban Kiat[1994] 1 SLR 634(“Teo Sing Keng”), the Court of Appeal explained that an award for “loss of earning capacity” would generally be made in the following cases (at [40]): (1)     where at the time of trial, the plaintiff is in employment and has suffered no loss of earnings, but there is a risk that he may lose that employment at some time in the future, and may then, as a result of his injury, be at a disadvantage in getting another job or an equally well paid job. (2)     where there is no available evidence of the plaintiff’s earnings to enable the court to properly calculate future earnings, for example, young children who have no earnings on which to base an assessment for loss of future earnings. 31     The following passage of Syed Agil Barakbah FJ inOng Ah Long v Underwood[1983] 2 MLJ 324was endorsed by the Court of Appeal inTeo Sing Keng(at [38]): Now, the general principle is that an injured plaintiff is entitled to damages for the loss of earnings and profits which he has suffered by reason of his injuries up to the date of the trial and for the loss of the prospective earnings and profits of which he is likely to be deprived in the future. There must be evidence on which the court can find that the plaintiff will suffer future loss of earnings, it cannot act on mere speculation. If there is no satisfactory evidence of future loss of earnings but the court is satisfied that the plaintiff has suffered a loss of earning capacity, it will award him damages for his loss of capacity as part of the general damages for disability and not as compensation for future loss of earnings.(Ashcroft v Curtin, andRasidin bin Partorjo v Frederick Kiai.) It was applied by Syed Othman FJ (as he then was ) inMultar v Lim Kim Chet. There is a difference between loss of future earnings and loss of earning capacity. The important difference between the two is that compensation for loss of future earnings is awarded for real assessable loss proved by evidence. Compensation for diminution in earning capacity is awarded as part of general damages. (Per Lord Denning MR inFairley v John Thompson (Design and Contracting Division) Ltd.) 32     The Court of Appeal inTeo Sing Kengfurther held that where an award was made for loss of earning capacity, no deduction on account of income tax ought to be made in the assessment. Damages awarded for loss of earning capacity were meant to compensate for loss of, or a diminution in earning capacity, a capital asset, which would be non-taxable, unlike that for loss of earnings. 33     After considering the medical evidence, I did not think that the AR was wrong to have found clear evidence that the accident affected the plaintiff’s ability and capacity to work, and that he was not able to handle long trials without taking frequent breaks nor work at the same pace or intensity prior to the accident. These disabilities disadvantaged the plaintiff and caused him to suffer mood swings which potentially affected his relationship with his clients and colleagues at work. On the other hand, the AR recognized that the plaintiff did not suffer any neurological deficits, his disabilities were not so debilitating, and the degree of pain and discomfort might vary on a day to day basis or even fail to manifest itself on certain days. 34     On these facts, I agreed with the AR that $100,000 was a fair and adequate sum to compensate the plaintiff for his loss of earning capacity. In my assessment, I had considered the following: (a)    The plaintiff’s skills and training as a lawyer were not affected by the accident injuries. (b)    His productivity at work would be impaired to the extent he described. (c)    I did not think that the neck impairment (assessed by Dr Lai using the Guide) would hamper his work as a lawyer because the remaining ranges of neck movements were more than sufficient for reading, writing and litigation work. (d)    According to the plaintiff, he experienced vertigo about once in 2 to 3 months lasting between 20 to 60 minutes. Dr Lai originally assessed the vertigo impairment at 9%. I believed that vertigo would affect his ability to read and concentrate at work. With the reduction in overall impairment from 16% to 14% upon re-assessment by Dr Lai, it would be reasonable to adopt a 1% reduction in the vertigo impairment to 8%. I also noted that the plaintiff had learnt to avoid neck movements that would likely trigger the onset of vertigo. (e)    The frequent headaches and neck pains affected his concentration and caused him to be irritable. This would not be conducive to his relationship with his clients and colleagues at work. (f)     To avoid double compensation for the same loss, no account was taken of any of the above impairments that would affect his family and social life or occur outside of office hours. This would have been compensated under “pain, suffering and loss of amenities”. (g)    On account of his position as one of the founding members of a law firm, and with the present healthy employment situation for lawyers generally in Singapore, I did not assess the plaintiff to be at much risk of unemployment or of not obtaining comparable employment in the future as a result of his work-related impairments. Neither did I think that there was any real or substantial risk that the plaintiff’s employment would be pre-maturely terminated on account of his injuries. As such, I assessed this part of the loss of earning capacity to be nominal,iefor potential loss due to a weakening of his competitive position in the employment market resulting from his disabilities. (h)    The number of years that the plaintiff could go on working post-trial was another consideration. The impairments, risks and various imponderables would have to be assessed over a longer period for a younger person. However, the plaintiff here was nearly 47 years of age by the time of the AR’s award. I judged that he would have at least another 15 years of very active working life as a lawyer in his own firm, barring any untoward eventualities. Thereafter, I would expect some slowing down of pace. (i)     Comparisons were made with other whiplash cases in arriving at the proper quantum to be awarded, after making appropriate adjustments where possible for the different factual matrix, the different degrees of impairment, the different annual income levels, the different skill sets and so forth. (j)Karuppiah:- $24,000 was awarded to the plaintiff inKaruppiahfor pain, suffering and loss of amenities, which was exactly the same amount awarded to the plaintiff in the present case. I used that as an evidential proxy to make an assumption that the permanent diminution in mental and physical capacity for both the plaintiff inKaruppiahand the plaintiff in the present case were not too different so that there would be some common basis to start making a comparison of the quantum to be awarded in relation to the loss of earning capacity. The plaintiff inKaruppiahwas earning only $4,300 per month or $51,600 per annum at the time of the accident and the quantum of loss of earning capacity awarded was $70,000. Since the plaintiff here was earning $120,000 per annum (more than double that of the plaintiff inKaruppiah), then the plaintiff’s award should have been $163,000 on a proportional basis, for the same extent of impairment. Was the plaintiff’s award of $100,000 too low? (k)Nirumalan: The plaintiff inNirumalanwas awarded $180,000 for loss of earning capacity based on a post-trial working period of 15 years till the age of 65. But the plaintiff inNirumalanwas a very high income earner at $$420,000 per annum for the years immediately preceding and after the accident. Looking at the same working span of 15 years post-trial for the plaintiff in the present case, and having regard to the much lower income of the plaintiff at $120,000 per annum, the plaintiff’s award for loss of earning capacity should be $51,400 by applying a simple ratio calculation. Would this then indicate that the amount of $100,000 given to the plaintiff was too high? (l)     However, if I were to quantify the loss at a figure between the amounts awarded inKarrupiahandNirumalan, solely on account of the differences in annual incomes by taking the average of $163,000 and $51,400, the computation works out to $107,200 as the amount for loss of earning capacity for a person with an income of $120,000 per annum. This figure ($107,200) indicated to me that the $100,000 awarded to the plaintiff was not an unreasonable amount. It was neither too high nor too low if the amounts awarded toKarrupiahandNirumalanby other judges were used as a guide, after making adjustments to normalise those cases to a common annual income baseline of $120,000 per annum. Perhaps, that could be the very reason why judges often refer to other comparable cases for assistance whenever they need to perform the extremely difficult task of quantifying damages. (m)  One could, of course, say that this was simply not worth doing, if such complicated adjustments had to be made to provide a fairer basis for comparison. But where such adjustments that could be done are not even made, then there would not be much reliability in simply comparing awards made in other cases, disregarding any adjustments that could possibly be done to account for important differences in such matters as income levels, degrees of impairments and the number of years of working life remaining. (n)   With the plaintiff’s pre-tax income at about $120,000 per annum, any additional income earned would be taxed at 14% based on the 2007 income tax rates (provided the additional income did not move the income to the next tax bracket). It would be pertinent to note that the award of loss of earning capacity of $100,000 would be received tax-free by the plaintiff. If the tax rate of 14% were to be taken into consideration, the plaintiff would in effect be getting $116,279. Should this sum of $116,279 be paid as an annuity over the next 15 years at a 5.33% interest/discount rate,[note: 2]the annual payment would be $11,454.[note: 3]This additional pre-tax income of $11,454 per annum would effectively provide a 9.5% top up of the plaintiff’s pre-tax annual income of $120,000 over a period of 15 years. (o)    I then compared the vertigo impairment of8%(plus, perhaps, an additional percentage for the frequent headaches and neck pains affecting his concentration and productivity at work) with the9.5%annual income top up throughout the next 15 years that I had effectively given the plaintiff. In my view, this top up of 9.5% of the plaintiff’s annual income was more than fair and reasonable in the circumstances. This calculation served as another useful check to get a feel of whether or not the amount I awarded was grossly excessive or inadequate. This quick check showed that the amount even, when viewed from this perspective, was not grossly excessive or inadequate. 35     In conclusion, there was no satisfactory evidence available to properly compute the future loss of earnings for the plaintiff. But I was satisfied that the plaintiff had indeed suffered a loss of earning capacity for which substantial compensation ought to be given. Taking all relevant factors into account, I accordingly awarded him damages of $100,000, which was adequate to do justice to the plaintiff for his loss of earning capacity. This award for loss of earning capacity would necessarily be part of the general damages for the disabilities potentially affecting his employment and his income post-trial, and not as compensation for any particular assessed future loss of earnings, which I had hardly any evidence from which to make any quantification or assessment. Unlike the general damages for “pain, suffering and loss of amenities” for which interest would usually be awarded from the date of service of the writ to the date of judgment, no interest would be allowed for this award of “loss of earning capacity” because it was assessed on a post-trial basis.",
        "Interest": "36     With regard to the interestfor “General Damages for Pain and Suffering and Loss of Amenities” (item 2),the AR explained clearly why the plaintiff was not entitled to the full measure of pre-trial interest from the date of service of the writ to the date of her judgment. The AR (at [16] to [18] of her judgment) said: 16      It is trite that if the assessment of damages is delayed owing to no fault of the defendant, the court will take this into account in the award of interest:Lim Cheng Wah v Ng Yaw Kim[1984-1985] SLR 497. As pertinently observed by Justice Kan inNirumalan’scase, a plaintiff’s claim to pre-trial interest is diminished if the plaintiff is slow to prosecute his case since the defendant had not kept him out of his money and the defendant should not have to compensate the plaintiff for the latter’s own actions. If the court is to deny the plaintiff the usual interest award from the date of writ up to the date of judgment, the onus is then on the defendant to show the court, for example, that there was unreasonable and unjustified delay on the plaintiff’s part in prosecuting the action:Yip Kok Meng Calvin v Lek Yong Han[1993] 2 SLR 134. 17      It is undeniable that this case had taken an inordinately long time to complete. The accident occurred in 1997 and the writ was taken out in August 1999. It has been nearly eight years since the action was first commenced. Interlocutory judgment at 100% in favour of the plaintiff was obtained in January 2000. Thereafter, there were numerous applications for extensions of time by the plaintiff to comply with the filing of AEICs and the Notice of Appointment. Counsel for the defendant highlighted the plaintiff’s various breaches of court timelines, some of which were not remedied until many months after the expiry of the timelines. I also note the point made by counsel for the defendant that after directions were first given, extensions of time of more than two years were sought in respect of three summonses taken out by the plaintiff to finalise his medical evidence. While I accept that there were circumstances beyond the control of the plaintiff which contributed to the delay, such as the untimely demise of the plaintiff’s doctor, Dr Gopal Baratham, it is clear that there was unjustifiable delay in the prosecution of the action. For example, even if there was some precedent value in awaiting the outcome ofNirumalan’scase, there was still no good reason why another two years had to be taken after the conclusion of that case before parties were ready for the present assessment hearing. 18      Having regard to the exceptional delay, I am of the opinion that pre-judgment interest should only run for four years, taking into account the time required for the actual assessment hearing given the numerous witnesses. 37     I agreed with the reasons provided by the AR and affirmed the cut-off date for the interest. Since the cut-off date of31 August 2003 was well before the change of the default interest rate on 1 April 2007 from 6% to 5.33% per annum (Supreme Court Practice Direction No 1 of 2007), the plaintiff should be entitled to the relevant interest rate applicable for the period prior to the cut-off date. Accordingly, I varied the interest rate to 6% per annum. 38     As both parties did not succeed substantively in their appeals, I decided that each party should bear his own costs of the appeal.   [note: 1]I was not sure if Dr Lai made a mistake here and the figure should have been 17%.[note: 2]The courts have adopted 5.33% as the current default interest rate for judgment debts and this interest rate would be a useful proxy for the discount rate to be used in the annuity computation.[note: 3]I would be prepared to amend this figure under the slip rule under Order 20 Rule 11 of the Rules of Court if counsel, on the advice of an accountant, could show that I have made a mathematical error in my computation."
    }
}