{
    "case_title": "Go Go Delicacy Pte Ltd v Carona Holdings Pte Ltd and Others",
    "ncitation": "[2007] SGHC 97",
    "coram": "Mohamed Faizal AR",
    "sections": {
        "Introduction": "1          That the civil procedure rules, as encapsulated in the form of the Rules of Court (Cap 322, R5, 2006 Rev Ed) (“the Rules of Court”), are an indispensable tool in ensuring the proper dispensation of justice in the litigation process is a self-evident truism that can hardly be disputed. In this regard, central to the efficacy of the Rules of Court are the provisions therein that stipulate strict timelines that parties to court proceedings are not, in general, allowed to derogate from. Absent such timelines, the litigation process would be considerably more cumbersome and proceedings lengthened, all of which would no doubt hinder the overriding goal of facilitating the fair and expedient disposal of cases before the courts. 2          Nonetheless, given that the efficacy of the Rules of Court is, one posits, predicated upon the assumption that the forum in which the legal battle should be fought is that of the Courts (as should be plainly apparent from its phraseology,i.e.the Rulesof Court), should parties be obliged to remain filial to the timelines as envisaged therein if their primary assertion is that thelitigationprocess does not represent the most appropriate mechanism to govern the procedural aspects of the legal battle that will take place? Stripped of its verbiage, that was, in essence, the question that had to be grappled with, and considered, here.",
        "The Facts": "3          It may be of some utility, however, to preface any observations as to the merits of the matter before me with a brief elucidation of the factual matrix that forms its scaffold. The basic facts themselves were relatively straightforward, though I should stress that these purported facts (as canvassed by the plaintiff) had yet to stand up to the rigours of challenge in the light of the fact that the defendants had, for reasons that will soon become plainly evident, yet to file their defence to the action. Nonetheless, so as to provide a reference point for the ensuing discourse, I shall set out the basic facts as contended by the plaintiff in its Writ of Summons and Statement of Claim dated 20 March 2007 (“the Statement of Claim”). At the risk of reiteration, it should be noted that nothing in my decision turned on the veracity of the facts as stated hereinafter. 4          According to the plaintiff, on several occasions over the course of 2005, Mr Yap Teck Siong and Mr Lee Boon Hiok, who were the fourth and fifth defendants respectively, represented to three brothers, namely Kheh Thiam Hoo (“KTH”), Kheh Kim Chong (“KKC”) and Khek Lay Chin (“KLC”), that the first defendant, Carona Holdings Pte Ltd, was the owner and operator of a consumable product known as “GoGo Franks” and that they (i.e.the fourth and fifth defendants) had developed a marketing concept for the product and were looking to franchise it to third parties. 5          After purportedly coming to an in-principle agreement with the fourth and fifth defendants that they would be given the exclusive territorial rights to the “GoGo Franks” franchise in Singapore, sometime on or about 11 October 2005, KKC and KLC incorporated Go Go Delicacy Pte Ltd, the plaintiff in this action, and installed themselves as its directors and KTH as its manager. It would appear that the plaintiff’s incorporation was predicated primarily on its potential use as a vehicle for the proposed “GoGo Franks” franchise in anticipation of receiving confirmation as the sole and exclusive distributor of the product. 6          As a further step in anticipation of being awarded the said franchise, the plaintiff took up tenancy at Bukit Panjang Plaza, with the aim of setting up a “GoGo Franks” outlet there for a specified period, incurring in the process start-up costs of some $43,963.79. It was also contended that in doing so, the fourth and fifth defendants misled the plaintiff into purchasing numerous items that were represented by the fourth and fifth defendants to be necessary for the furnishing and setting up of the Bukit Panjang Plaza outlet. These items were purchased from a company related to the fourth and fifth defendants, Carona Fast Food Pte Ltd,i.e.the second defendant. Much to their chagrin, they were later to find out that the purchases from the second defendant were, in the main, superfluous and surplus to the requirements for the Bukit Panjang Plaza outlet. 7          In any event, after somewhat protracted negotiations, the plaintiff, on or about 13 April 2006, entered into an exclusive Franchise Agreement with the first defendant under which it was agreed that in consideration for paying certain sums of monies, the first defendant would provide the necessary documentation and know-how in relation to the running of the proposed “GoGo Franks” franchise (“the Franchise Agreement”). Though the precise details of the Franchise Agreement need not be expounded upon here, two matters that relate to it should be touched upon briefly at this juncture: first, under the Franchise Agreement, the plaintiff was duty-bound to purchase all “operating supplies”, food supplies in more common parlance, from a designated seller, in this case, Foodplex Trading Pte Ltd, who was the third defendant in this action; and second, that under Clause 23.13.1 of the Franchise Agreement (“the arbitration clause”), the parties contracted to resolve any disputes that may arise by means of arbitration.  The arbitration clause reads as follows: Any dispute arising out of or in connection with this Agreementincluding any questions regarding its existence, validity or termination shall be referred to and finally resolved by arbitration in Singapore in accordance with the rules of the Singapore Arbitration Centre for the time being in force which rules are deemed to be incorporated by reference into this clause… [emphasis added] 8          According to the plaintiff, though it rendered payment in accordance with the Franchise Agreement, the first defendant failed to perform its obligations as stipulated therein. Amongst others, the plaintiff alleged that the first defendant breached the terms of the Franchise Agreement by virtue of its failure to provide adequate training and by its purported entrance into separate franchise agreements with other third parties in breach of the exclusive franchising clause found therein. 9          Based on the above factual matrix, on 20 March 2007, the plaintiff filed this action against the five defendants (collectively, “the defendants”), in which it claimed,inter alia, as follows: (a)        Against the first defendant, for numerous breaches of the Franchise Agreement; (b)        Against the second defendant, for “forcing upon the plaintiff” the sale of the items that was effected in anticipation of the setting up of the Bukit Panjang Plaza outlet (see [6] above); (c)        Against the third defendant, for the provision of food supplies that were either spoilt or rotting, and hence, not fit for consumption (see [7] above); and (d)        Against the fourth and fifth defendants, for numerous misrepresentations across the entire spectrum of events. 10        Instead of taking the well-trodden path of filing a defence to the claim, on the day the defence was due (i.e.18 April 2007), the defendants, placing reliance on the arbitration clause as found in the Franchise Agreement, sought to have the dispute resolved by arbitration and applied for the proceedings to be stayed (“the stay application”) pursuant to s 6 of the Arbitration Act (Cap 10, 2002 Rev Ed) (“the Arbitration Act”). In the interest of completeness, the salient parts of s 6 of the Arbitration Act read as follows: 6.— (1)   Where any party to an arbitration agreement institutes any proceedings in any court against any other party to the agreement in respect of any matter which is the subject of the agreement, any party to the agreement may, at any time after appearance and before delivering any pleading or taking any other step in the proceedings, apply to that court to stay the proceedings so far as the proceedings relate to that matter. (2)   The court to which an application has been made in accordance with subsection (1) may, if the court is satisfied that — (a) there is no sufficient reason why the matter should not be referred in accordance with the arbitration agreement; and (b) the applicant was, at the time when the proceedings were commenced, and still remains, ready and willing to do all things necessary to the proper conduct of the arbitration, make an order, upon such terms as the court thinks fit, staying the proceedings so far as the proceedings relate to that matter. … (5)   For the purposes of this section, a reference to a party includes a reference to any person claiming through or under such party. 11        At this juncture, I should pause briefly to highlight that it is axiomatic that only parties to an arbitration agreement may rely on an arbitration clause to stay proceedings (if any support was required for this self-evident proposition, see Lawrence Boo, “Arbitration”, (2003) 4 SAL Ann Rev 48 (Singapore: Singapore Academy of Law, 2004) at para 3.19). Strictly speaking, as should be apparent from the above rendition of events, the sole signatories of the Franchise Agreement were the first defendant and the plaintiff. Nonetheless, in applying to have the judicial proceedings stayed againstall five defendants, counsel for the defendants, Mr Adrian Tan, contended that the second to fifth defendants were equally able to seek the benefit of the arbitration clause.  Mr Tan, in essence, canvassed what appeared to be a three-fold argument: first, that s 2 of the Contracts (Rights of Third Parties) Act (Cap 53B, 2002 Rev Ed) allowed the second to fifth defendants to place reliance on the arbitration clause notwithstanding the fact that they were non-signatories to the Franchise Agreement; second, that the second to fifth defendants were, in the circumstances, parties to the Franchise Agreement; and third, that the plaintiff, having seemingly admitted in various parts of the Statement of Claim that the second and fifth defendants were parties to the Franchise Agreement, were estopped from denying any contrary state of affairs thereafter. Needless to say, the plaintiff strenuously rejected these contentions, asserting, in the main, that each of its claims against the defendants was distinct and that the High Court remained the most appropriate forum for the resolution of the matter. For reasons that would be expounded upon at a more convenient stage, it would not be necessary for me to consider, and consequently, elaborate upon, the merits underlying each of these contentions. 12        Notwithstanding the fact that the above application to stay the matter was taken out by the defendants, conspicuously; no defence was filed by any of them. Indeed, to date, none of the five defendants have filed their defence to the action, nor have any of them applied to extend time to file their defence. Consequently, on 25 April 2007, one week after the defence had originally been due, the plaintiff took out an application for judgment in default of defence (“the default judgment application”). 13        At the conclusion of the proceedings before me, I granted the default judgment application, and made no order in relation to the stay application. As the reasoning that I adopted in arriving at the former decision suggests the conceptual symmetry of the relevant local cases on a point that appearshithertoto be the subject of some (academic) debate, I thought it of some utility to set out my reasons in full.",
        "The Arguments Before The Court": "14        From the earlier exposition of the case facts, it should be apparent that the two discrete applications that were before me necessitated the resolution of two interlinked, albeit discrete, questions: first, whether a plaintiff ought to be granted judgment in default of defence in a situation where an application for a stay of proceedings was still pending disposal, and second, if so, whether such a stay should be granted on the facts ofthisparticular case. However, at the commencement of the proceedings before me (and this was subsequently confirmed at the conclusion of the proceedings), both parties weread idemon the fact that if I were to find in favour of the plaintiff in the default judgment application, as a matter of course, the attendant question of whether there should be a stay of these proceedings becomes wholly moot since there would be, strictly speaking, no judicial proceedings to stay until an application to set aside the default judgment was made (see, in this regard,Patel v Patel[2000] QB 551). Accordingly, I restricted the arguments at first instance to those that the parties intended to canvass in relation to the default judgment application.  In this regard, sifting the wheat from the chaff, the question that was before me was, in my opinion, singular in nature and can be phrased as such: does a pending stay applicationipso factocease the applicability of the timelines under the Rules of Court for service of the Defence? 15        Counsel for the plaintiff, Mr Alfred Dodwell, contended that it does not. In his view, the question of whether time ceases to run had already been discussed, at length, in the recent High Court decision of Belinda Ang J (“Ang J”) inAustralian Timber Products Pte Ltd v Koh Brothers Building & Civil Engineering Contractor (Pte) Ltd[2005] 1 SLR 168(“Australian Timber”), a decision which he felt was squarely applicable in the circumstances. Placing sole reliance on the said case, he contended that it stood for the proposition that time would not stop merely because a stay application had been taken out and that, accordingly, the failure on the part of the defendants to remain filial to the timelines stipulated in the Rules of Court had been fatal to their case. 16        Mr Tan, prehaps unsurprisingly, canvassed the diametrically opposing view.  He pointed out that it was trite law that a party seeking to stay proceedings could not be compelled to file its defence while a stay application was pending final disposal: see, for example,Samsung Corp v Chinese Chamber Realty Pte Ltd and Others[2004] 1 SLR 382(“Samsung Corp”). Extending that logic, Mr Tan argued that it must follow that the timelines which would conventionally operate for a defendant to file its defence ceased to operate until the stay application had been fully disposed of. If, in fact, that were the case, Mr Tan suggested that a plaintiff could not apply for default judgment in default of defence, since the defence was, technically speaking, not due yet in the absence of any further timelines that were imposed by the courts.",
        "Analysis of the Law": "17        Commencing on my analysis of the parties’ respective contentions, I should highlight that, as the defendants rightly point out, it was conventional wisdom that the Court could not compel a defendant to file its defence while a stay application was pending final disposal. The motivations underlying such a stance were of no real dispute: it constitutes a trite principle of law that the privilege of a stay of judicial proceedings would be immediately lost if the party applying for such stay had taken a “step in the proceedings”. As correctly observed inHalsbury’s Laws of Singapore, vol 2 (Butterworths: Singapore, 2003) (“Halsbury’s Laws of Singapore”) at para 20.035 (and as cited approvingly in the High Court decision ofChong Long Hak Kee Construction Trading Co v IEC Global Pte Ltd[2003] 4 SLR 499(“Chong Long Hak Kee”) at [9]): It is generally accepted that any step [taken] which affirms the correctness of the proceedings or demonstrates a willingness or intention to defend the substance of the claim in court instead of arbitration may be construed as such. [emphasis added] 18        As such, as parties are deemed to have waived their contractual right to arbitration the moment they take a step that affirms the correctness of the court proceedings or a willingness to defend the substance of the matter in court, the filing of any pleadings, without caveat, is construed as a quintessential step that serves as a demonstration of the intention of the party to defend the substance of the claim in the judicial proceedings and, once such a step had been taken, the court no longer had any discretion to stay the proceedings: seeChong Long Hak Keeat [9]. 19        The motivations underlying the position that a defendant ought not to be compelled to file a defence in such circumstances can be seen from another, more practical, perspective – namely that a party should not be made to devote already limited resources to the running of two separate courses of action (one on the question of whether the judicial proceedings should be stayed, and the other on the substantive merits of the matter) at the same time. As was cogently reasoned by Woo Bih Li JC (as he then was) inYeoh Poh San and Another v Won Siok Wan[2002] 4 SLR 91(“Yeoh Poh Sun”), at [27]: The point is that while a defendant is seeking to stay the proceedings, whether by way of original application or an appeal, the defendant should not be required to meet the plaintiff’s claim on the merits.A defendant is entitled to focus his attention on the appeal for a stay and not be distracted by running two contradictory courses of action at the same time. [emphasis added] 20        Based on the reasoning above, I was of the view that the law, as it presently stood, was unequivocal in its support of the point that Mr Tan dealt with at length before me and in his submissions; namely that a defendant cannot be compelled tofile its defencebefore its stay application was heard and disposed of.  Indeed, even Mr Dodwell appeared to be agree, conceding at the commencement of the proceedings that the plaintiff would not be able, under law, to compel the defendants to file their defence. Nonetheless, in my view, the real crux of the issuevis-à-visthe default judgment application should be placed on a markedly different footing: the question that necessitated resolution here wasnotwhether the defendantscan be compelled to file a defence(a query which must unambiguously be answered in the negative), but the technically separate (though, no doubt, interlinked) matter of whether thetime for filing a defencewould continue to run. 21        Indeed, as I understood it, it was in this context that the plaintiff appeared to place heavy reliance onAustralian Timber. Given the plaintiff’s considerable dependence on the said decision, it would be of significant utility to take a closer look at the facts and reasoning in that case. The facts therein are quite straightforward. In that case, the plaintiff had commenced an action in the Subordinate Courts against the defendant for monies unpaid for work that had been done on behalf of the defendant. The defendant had applied to stay the action under s 6(1) of the Arbitration Act by virtue of an arbitration clause that existed in the contract between the parties. Much like the facts here, after applying to stay the judicial proceedings, the defendant failed to serve his defence. The plaintiff thus proceeded to obtain judgment in default of defence. The defendant consequently applied to set aside the said judgment.  The application was refused at first instance, though on appeal, the District Judge in chambers reversed that decision and set aside the default judgment.  This decision was itself appealed by the plaintiff to the High Court. 22        In the High Court, Ang J was of the opinion that the default judgment should not have been set aside and consequently, reversed the decision of the District Judge in chambers. In the course of her decision, Her Honour made several pertinent observations on the steps that a defendant must take if a plaintiff were to apply for summary judgment before a pending stay application had been heard and where the timeline for the filing of the defence had almost lapsed. Of especial importance in the matter that was before me were Her Honour’s observations at [16], wherein she noted as follows: …a pending stay application in itself does not stop time running for the service of the defence. The Rules of Court have their own self-contained provisions relating to the service of defence, time extension and default judgment.Unless and until there is a stay order to halt proceedings, the plaintiff is entitled to give notice to the defendant to serve its defence. It is for a defendant, faced with a 48-hour notice to serve its defence, to respond appropriately. A proactive approach should be adopted. The defendant could have seen the duty registrar to bring forward the hearing date of the stay application for immediate hearing as a matter of urgency or apply for an extension of time to serve the defence under O 3 r 4 and at the same time seek an urgent hearing of the matter… [emphasis added] 23        At first blush, given that they afford no real ambiguity, Her Honour’s views (as reproduced above) appeared to me to squarely apply on the facts of this case: juxtaposing the reasoning found in Her Honour’s observations onto the facts of this case, it would appear that once the defendants here had taken cognisance of the possibility of the plaintiff moving to apply for judgment in default (a fact that they would have been painfully aware of by the time the plaintiff gave the usual pre-requisite 48-hour notice on 20 April 2007), they should have taken the pre-emptive step of making a further application (an urgent one, if need be) to seek an extension of time or taken out an urgent application before the Duty Registrar to get the matter of the stay application heard on an urgent basis.  This, they failed to do. 24        Nonetheless, Mr Tan pinned his colours on the argument thatAustralian Timber(at least insofar as the comments reproduced above at [22] were concerned) was not applicable on the facts in the matter before me. His protestations, as I understood it, were two-fold: first, thatAustralian Timberwas easily distinguishable on the facts since that matter was one in which the court was considering the question of whether a default judgment should be set aside (a point which did not arise in this case), and second, that Her Honour could not have intended to create any artificial bifurcation between the failure to make an application to extend time and one to file a defence – in Mr Tan’s view, both actions would have amounted to a “step in the proceedings” which would have acted as ade factowaiver of the right to apply to stay the matter.  Curiously (and it is curious for reasons I will later set out), Mr Tan did not extend such a contention by canvassing the attendant argument that the observations made inAustralian Timberwere wrong in law and should not be followed. 25        Mr Tan’s first protestation, in my view, could be dealt with summarily.  In my opinion, the distinction highlighted by Mr Tan, was, in the circumstances, one without a difference. In fact, on close inspection, it was clear that the comments inAustralian Timber(as reproduced in [22] above) wereconsciously directedtothe precise situationin which the defendants found themselves –i.e.where a plaintiff began the process of applying for default judgment before a stay application has been disposed of. In that context, there appeared to be little merit to Mr Tan’s argument on this point. 26        Mr Tan’s second protestation, at least in the manner in which he couched it, was, I feel, equally bound to fail. To recapitulate, Mr Tan had suggested that Ang J could not have intended to have created a bifurcation between thefiling of a defenceand thefiling of an extension of time to file a defence.In my view, theconverseis true: the comments made inAustralian Timberwereclearly intendedto create a bifurcation between an application to extend time and one to file a defence.  Indeed, that this was so was patently evident from Ang J’s observations at [23] of the said decision, wherein Her Honour reasoned as follows: …an application by the defendant to extend time to serve the defencewill not constitute a step in the proceedings within the meaning of s 6(1) of the Arbitration Act…In the present case, the defendant clearly intends to seek a stay.An application to extend time would be to safeguard the defendant’s position pending the determination of the stay application as opposed to an act that seeks to contest the proceedings on its merits. [emphasis added] 27        Her Honour’s comments must be seen in the context of the domestic arbitration regime. As alluded to earlier, under the domestic arbitration regime, courts have no jurisdiction to stay proceedings where a party has “taken a step in the proceedings”, for it has long been accepted that the making of such a step is representative of the party’s waiver of the right to seek recourse to alternative dispute mechanisms to resolve the dispute. Given that conventional wisdom informs us that the filing of a defence without caveat would be tantamount to taking such a step in an action (see [17] to [19] above), Her Honour’s comments (that an application for a stay did not amount to a step in the proceedings) were, quite unambiguously, an allusion to the fact that a bifurcation did, in fact, exist betweenthe filing of a defenceand anextension of time to file a defence. Mr Tan’s secondary protestation therefore similarly could not be countenanced. 28        Accordingly, in the premises, I was not persuaded that either protestation on the part of Mr Tan constituted considerable barriers to the granting of default judgment. 29        If that represented the end of the matter, there would be no doubt as to where this decision must lie. Nonetheless, as I alluded to earlier (see [24] above), I found it curious that Mr Tan did not attempt to explicitly canvass the broader argument that the observations made inAustralian Timberwere wrong in law and therefore should not be followed. Indeed, though he may not have realised it, Mr Tan had, in fact, made an implied contention to that effect by suggesting that anextension of time to file a defencewas, in and of itself, a conceptual admission that was tantamount to a waiver, for it presupposes that a defence (with its attendant substantive discussion of the merits of the case) would have to be filed in due course. In my view, such a contention would be squarely at odds with Her Honour’s views as reproduced earlier (see [26] above) and invariably brought into sharp focus the consistency of the learned judge’s comments inAustralian Timberwith contemporary jurisprudence. 30        Such an argument would, in fact, not be wholly far-fetched, for the jurisprudential approach adopted inAustralian Timberappeared somewhat distinct from the approach that had been adopted in other jurisdictions. In the UK, for example, a request for an extension of time has, insomeinstances, been deemed to be evidence of an intention to deliver a statement of defence, thus constituting a deemed waiver of the right to arbitration (see the House of Lords’ decision inFord’s Hotel Co v Bartlett[1896] AC 1, thoughc/f London Sack & Bag Co Ltd v Dixon & Lugton Ltd[1943] 2 All ER 763). The same position appeared to have found favour in Malaysia as well: see the comments of the Malaysian Federal Court inSanwell Corp v Trans Resources Corp Sdn Bhd & Anor[2002] 2 MLJ 625(“Sanwell Corp”) at p 631. These would appear to be further buttressed by the observation made inHalsbury’s Laws of Singapore, at para 20.035, that “an application to extend time to file a defence” constituted aclearexampleof an action that would amount to “a step in the proceedings”. In this context, there would appear to be a considerable amount of academic and jurisprudential discourse that could form a viable platform on which Mr Tan could have challenged the rectitude of Her Honour’s observations inAustralian Timberand for him to contend that an application to extend time would, invariably, constitute a “step in the proceedings”. 31        Indeed, even when observed through the somewhat more myopic lens of its consistency withdomestic jurisprudence, at least one academic commentator has expressed the view thatAustralian Timbercannot be reconciled with domestic case law. Associate Professor Lawrence Boo (see Lawrence Boo, “Arbitration” (2004) 5 SAL Ann Rev 47 (Singapore Academy of Law: Singapore, 2005) at para 3.15 to 3.18) had suggested that the approach taken inAustralian Timbermay well be inconsistent with the Court of Appeal’s decision inSamsung Corp, in particular with the comments made by Chao Hick Tin JA (as he then was) in the latter decision where His Honour noted as follows (at [18]): The timeframe prescribed in the Rules of Court for the filing of Defence is a general rule and should be applied in the normal sort of a case where there is no dispute as to the jurisdiction of the court.Where, in a case, an application has been made for a stay of proceeding on the ground that the dispute ought to be referred to arbitration there is, in our opinion, much force in the contention that this question must first be determined before any further steps be taken in the proceeding. If the stay application should succeed, the dispute will be transferred to a different forum for determination.If it should fail, the court would no doubt make the necessary consequential orders, including setting the time-limit for the filing of Defence. [emphasis added] 32        Though Assoc Prof Boo’s commentary appeared to stop short of explicitly articulating the inconsistency that purportedly existed between the two cases, save to highlight that the comments made inAustralian Timber(see [22] above) had “unwittingly added a question mark to the practice in relation to the filing of the Defence”, it was clear (to me) that, in his view, the above extract as found inSamsung Corpwould support the proposition that the timelines that would otherwise conventionally operate under the Rules of Court in relation to the filing of the Defence would immediately cease to operate once an application for a stay is made. 33        If, indeed, Assoc Prof Boo was right, and the comments made inAustralian Timberwere at odds with those made inSamsung Corp,stare decisisbeing what it was, I would be bound to follow the approach adopted in the latter decision, being a decision of the highest court in this land.  Nonetheless, in my view, any inconsistencies underlying the reasoning adopted in the two cases were, for reasons I would highlight in due course, more perceived than real. 34        Nonetheless, before doing so, it would be appropriate to first deal with theconceptualconcerns that have been raised at [30] above.  It should be clear that the resolution of this turned on the interpretation that should be accorded to the phrase “step in the proceedings”. This phrase should not be taken literally, insofar as not every literal step, or application, would amount to a “step in the proceedings” that has the effect of waiving any right to seek arbitration. A contractual agreement to arbitrate is exactly that – acontractualagreement. Such contractual agreements do not oust the jurisdiction of the courts, which retain a residual discretion from the outset and even if and when the said court decides to stay the court proceedings in favour of arbitration. Accordingly, some steps, whether mandatory or otherwise, invariably have to be taken in court even if a party had the unstinting intention to request a stay of ongoing judicial proceeding in favour of arbitration. Quintessential examples of court-related “steps” that would not be tantamount to being “steps in the proceedings” and that would, consequently, not prejudice an applicant’s right to apply for a stay of proceedings, are legion and can easily be found in many reported decisions: see, for example,International SOS Pte Ltd v Overton Mark Harold George[2002] 4 SLR 226(“International SOS”) andStar Trans Far East Pte Ltd v Norske-Tech Ltd[1995] 3 SLR 631. 35        How, though, would the court discern as to what constitutes a step in the proceeding and what does not?  Conventionally, the task for the court in any such determination would be to ascertain the nature of the action taken and whether such action amounted to a clear and unequivocal intention to proceed with the matter in a judicial forum. Put another way, the court has to query whether the step taken amounts to a waiver of the right to arbitration insofar as such step amounted to a demonstration of a willingness to defend thesubstance of the claimin court: see, in this regard,Eagle Star Insurance v Yuval Insurance[1978] 1 Lloyds’ Rep 357 andKuwait Airways Corporation v Iraq Airways Co[1994] 1 Lloyds’ Rep 276. 36        Of course, the question of whether or not an act amounted to a demonstration of a willingness to defend the substance of a claim could only be answered in reference to the factual matrix that is actually before the court and by taking into account the parties’ motivations for taking any action in court objectively. As astutely observed in another academic commentary (see Michael Mustill & Stewart C Boyd,Commercial Arbitration, 2nded (Butterworths: London, 1989) at p 472): “The circumstances which accompany an act may be looked at to see whether the act amounts to an election to give up the right to a stay. Thus,an application to the Court which might otherwise amount to a step in the proceedings is deprived of this characteristic if the applicant makes it clear…that he intends to insist on a reference to arbitration” [emphasis added] 37        Lest it be suggested that this position has no relevance in the domestic context, I might add that this appeared to be consistent with domestic jurisprudence that highlights that any step taken need not be done at the expense of any right to stay the proceedings as long as such step is taken with the caveat that the appropriate reservations were made: seeAustralian Timberat [22] andWestLB AG v Philippine National Bank & Others[2007] 1 SLR 967at [40] to [43].  Though extrinsic to the reasoning that was relevant here, it may be useful to highlight that the view that a mere reservation would be sufficient to caveat any application that delved into the merits of the case as “a step in the proceedings” was not one that was unanimous: see, for instance, the reservations of the High Court inLian Teck Construction Pte Ltd v Woh Hup (Pte) Ltd and Others[2006] 4 SLR 1at [19]. 38        Reverting back to the discourse relevant to the matter at hand, it was therefore clear that the question of whether an application to extend time would be a “step in the proceedings” must be seen in the context of the factual matrix that is before the court: seeInternational SOSat [5].  Where a party seeks an extension of time for reasons extrinsic to the possibility of advancing the claim in an arbitral forum, for example, I would have no doubt that such an application for extension of time would constitute a step in the proceedings: see, in this regard, the comments inSanwell Corpon the Malaysian High Court decision ofUsahabina v Anuar bin Yahya[1998] 7 MLJ 691. These case facts, however, could not have been more different.  Here, if the defendants were to apply for an extension of time, there would have been no need to delve into the merits of the case, even on a superficial level.  Instead, all that the accompanying affidavit would have to highlight would be the fact that such an extension of time would be needed to accommodate the hearing of the pending stay application. Accordingly, when one takes cognisance of the backdrop underlying such an application, any application for extension of time taken out as a result of the need for a stay application to be disposed of first could not, in my view, be seriously canvassed to be tantamount to a “demonstration of a willingness to defend the substance of the claim in court”.  Putting it another way, it would be clear to all the parties concerned (and indeed, to the arbiter hearing the matter) that such an act had “been done manifestly without prejudice to an intention to invoke arbitration and merely to preserve the status quo until a summons to stay is promptly issued”: seeBlueflame Mechanical v David Lord Engineering Services8 Const LJ 263 (21 February 1992, transcript available on Lexis).  In these circumstances, I saw no reason why fidelity to the approach advocated inAustralian Timberwould be conceptually problematic. 39        That, however, was not the end of the debate, for whatever the conceptual merits ofAustralian Timber, if as Assoc Prof Boo appears to suggest, the said case could not be reconciled with the views of Chao JA inSamsung Corp(see [31] above), I would be bound, in law, to give effect to the latter. Nonetheless, with the greatest respect, I have to depart company with Assoc Prof Boo as to the interpretation that should be accorded to the observation inSamsung Corp. Whilst I accept that readin vacuo, one could well suggest that the above extract fromSamsung Corpshould be taken to mean that the timelines for the filing of the defence cease to be applicable the moment a party applies for a stay, in my view, to accord it such an interpretation would be to pay mere lip service to the underlying factual matrix in that case. In ensuring that the comments in question would not be read out of context, it was important to bear in mind that the issue of primary importance in that case was whether a party could apply for summary judgment where there had been a pending stay application. Given that the final order made by the Court inSamsung Corpwas that no O 14 application could be brought before the stay application has been fully disposed of, the attendant question that would no doubt have invariably plagued the mind of the court there would be whether such a decision would strip away a plaintiff’s right to apply for summary judgment thereafter given that no procedural timelines mandate any further filing of a defence in the event of a dismissal of the stay application.  When one takes cognisance of the concerns of the court there, it would immediately be appreciated that Chao JA’s comments were, in all likelihood, meant to do nothing more than to assuage and allay the concerns (on the part of potential plaintiffs) that defendants may attempt to frustrate any possible summary judgment application by delaying the filing of a defence after a failed stay application on the basis that there were no timelines that applied to the filing of a defence after the hearing of a stay application.  Put another way, His Honour was merely impressing the point that the court would be seised of further powers to impose further timelines where there has been an unsuccessful stay application so that a party would be compelled to file his defence and the plaintiff could proceed (if so desired) with a summary judgment application. In my view, His Honour was not, as apparently contended by Assoc Prof Boo, purporting to suggest that the timelines under the Rules of Court immediately cease to be applicable the moment a stay application is made. 40        That this must be the proper interpretation to be accorded to His Honour’s comments inSamsung Corpis further fortified by his approving reference to, and reliance on, the decision ofYeoh Poh Sun.  InYeoh Poh Sun, Woo JC had arrived at the conclusion that if a plaintiff insisted on the filing of a defence pending an appeal against an unsuccessful stay application, the defendant should apply for an extension of time. This, of course, predicated its applicability on the assumption that time continued to run in such an instance.  Given that the entire basis as to why time continued to run was that “there [was] no existing order for a stay” (seeYeoh Poh Sunat [17]), a state of affairs that was equally applicable to an application for a stayat first instanceas it was on adismissed stay application that was pending appeal, thatSamsung CorpcitedYeoh Poh Sunwith approval amounted to a strong indication that Chao JA could not have intended to suggest that timelines for the filing of a defence cease to be relevant once a stay application was filed. 41        Based on the above reasoning, I was of the opinion the two cases did not make strange bedfellows and were, instead, comfortably reconcilable in the following manner:Samsung Corpmerely stands for the proposition that a defendant could not be compelled to file a defence whilst an application for a stay in favour of arbitration was pending, a moot point in most instances since it was not likely that the plaintiff in most instances would even press the matter (as Woo JC noted inYeoh Poh Sunat [15]);Australian Timber, on the other hand, caters for the situation where a plaintiff does, in fact, decide to press the matter – in such circumstances, it informs us that the defendant has to be proactive in ensuring that the Court grants some form of concession to ensure that the defendant would not fall foul of the timelines stipulated in the Rules of Court. When seen in this context, it would be right to suggest thatSamsung Corp“must be read subject to”Australian Timber(see Jeffrey Pinsler,Singapore Court Practice 2006(LexisNexis: Singapore, 2006) at para 62/9/8) since the latter decision merely defines what must be done if a plaintiff decides, whatever his motivations, to file an application for a judgment in default of defence whilst a stay application is pending. 42        ThatAustralian TimberandSamsung Corpcould be reconciled was, in my view, most fortuitous, for there was a lot to recommend the approach that had been taken in the former decision. Any other position would be tantamount to suggesting that every single stay application, even if they were patently unmeritorious, would override the timelines that were to be adhered to till the stay application was finally disposed of. While this appeared, at first glance, to be a superficially seductive position, the demerits of such an approach were, in my view, all too apparent: any defendant desirous of delaying proceedings to suit his purposes would be immediately seised of a further weapon in his arsenal that would allow him to bring to a halt, albeit temporarily, any pending court proceedings by surreptitiously applying for a stay, notwithstanding the complete lack of any legal basis for doing so. To this end, the approach adopted inAustralian Timberpossessed the attraction of ensuring that onlyreasonableapplications for extension of time are granted (because if the application were patently bound to fail,e.g.there is no arbitration clause in the contract to even speak of, then the application for extension of time would no doubt be refused) and accordingly, had the effect of acting as a desirable sieve against those whose singular goal in applying for a stay would be to delay the expeditious resolution of the dispute. To put it simply: genuinebona fideapplications for a stay would in no way be prejudiced, but applications for a stay without the slightest iota of merit would, quite appropriately, be severely hampered. 43        For the above reasons, I was of the view that Ang J’s observations inAustralian Timberwere not only representative of the law in Singapore, but of significant merit given that they comport wholly with logic. Needless to say, I found no reason to depart from it. Juxtaposing the state of the law, as described above, to the facts that were before me, it would follow that the defendants should have taken a more pro-active approach once they received the 48-hour notice and should have either applied for an extension of time to file a defence, or have taken out an urgent application for their matter to be heard before time to file their defence expired. Given their failure to do either, I found in favour of the plaintiff in the default judgment application. 44        In the light of the conclusion I arrived at in the default judgment application, as parties had agreed at the onset of these proceedings, the attendant question of whether a stay of proceedings should be allowed became academic given the absence of proceedings on which any stay order might be attached. It was therefore unnecessary for me to proffer any views as to the substantive merits of the stay application.",
        "Conclusion": "45        All is not lost for the defendants, who, quite apart from exploring the usual route of appealing this decision, would still be able to take out an application to set aside the default judgment I granted. This, of course, gives rise to the attendant question of whether plaintiffs in general should take the course of action that the plaintiff in this case had taken.  In my opinion, where a stay application appears to be madebona fide(though I stress that I made no determination onthesefacts), justice is not best served by holding a Sword of Damocles over the defendants’ head by applying for judgment in default of defence.  In most conventional situations, all this achieves is the invariable escalation of costs, since a conscientious defendant would apply for an extension of time, which, forbona fideapplications, are no doubt bound to be granted as a matter of course. For that reason, as a matter of good practice, there may be considerable merit in not pressing for the filing of a defence if a defendant files what appears to be abona fideapplication for a stay of proceedings: see, once more, the comments made inYeoh Poh Sunat [15]. 46        For those reasons, I have to concede that the plaintiff’s default judgment application possessed somewhat of an artificial air, for it served to avoid a realistic disposal of the substantive question thatshouldhave been before me, namely whether the judicial proceedings should be stayed in favour of arbitration proceedings. Whatever my reservations, however, it was clear to me that the plaintiff’s arguments were technically correct in law and that the defendants should, for reasons discussed earlier, have applied for an extension of time. Though the Rules of Court should not be used as a trap for the unwary, and though my sympathies were very much with the defendants, exceptions should not be easily made in light of the ease of seeking recourse to the precautionary measures available in this instance. In the circumstances, I therefore had little option but to make the order that I did in favour of the plaintiff in its default judgment application. 47        As a corollary to the above, however, I was not inclined to make any order in relation to the defendants’ stay application at this juncture pending any further action that might be taken by either party to set aside or vary my ordervis-à-visthe default judgment application."
    }
}