{
    "case_title": "Dynamic Investments Pte Ltd v Lee Chee Kian Silas and Others",
    "ncitation": "[2007] SGHC 216",
    "coram": "Andrew Ang J",
    "sections": {
        "The facts": "25     As noted earlier, HHM comprises 118 apartment units with a total gross floor area of 21,695m2and a total share value of 452. As can be seen from the chart below, the apartments are of various sizes ranging from the smallest at 57m2to the largest (that being the plaintiff’s) at 642m2. Sale Proceeds – S$292,000,000.00Total Share Value – 452 SharesTotal Strata Area – 21,695m2   No.ofUnitsStrata Area (m2)Share ValueAmount by 50% Share Value & 50% Strata Area(A) [S$]Amount by 100% Share Strata Area(B) [S$]Amount by 100% Share Value(C) [S$]Difference(B) – (A)[S$]Difference(C) – (A)[S$]15731,352,617.17767,181.241,938,053.10(585,435.93)585,435.93512031,776,585.751,615,118.401,938,053.10(161,467.35)161,467.352512231,790,045.071,642,037.041,938,053.10(148,008.03)148,008.03114131,917,908.611,897,764.121,938,053.10(20,144.49)20,144.49214531,944,827.251,951,601.401,938,053.106,744.15(6,774.15)115031,978,475.552,018,898.001,938,053.1040,422.45(40,422.45)115131,985,205.212,032,357.321,938,053.1047,152.11(47,152.11)115331,998,664.532,059,275.961,938,053.1060,611.43(60,611.43)2017442,462,996.242,341,921.682,584,070.80(121,074.56)121,074.56517942,496,644.542,409,218.282,584,070.80(87,426.26)87,426.261018042,503,374.202,422,677.602,584,070.80(80,696.60)80,696.60518242,516,833.522,449,596.242,584,070.80(67,237.28)67,237.28119642,611,048.762,638,026.722,584,070.8026,977.96(26,977.96)120042,637,967.402,691,864.002,584,070.8053,896.60(53,896.60)120342,658,156.382,732,241.962,584,070.8074,085.58(74,085.58)120442,664,886.042,745.701.282,584,070.8080,815.24(80,815.24)120542,671,615.702,759,160.602,584,070.8087,544.90(87,544.90)120742,685,075.022,786,079.242,584,070.80101,004.22(101,004.22)121142,711,993.662,839,916.522,584,070.80127,922.86(127,922.86)121342,725.452.982,866,835.162,584,070.80141,382.18(141,382.18)1521842,759,101.282,934,131.762,584,070.80175,030.48(175,030.48)123442,866,775.843,149,480.882,584,070.80282,705.04(282,705.04)124442,934,072.443,284,074.082,584,070.80350,001.64(350,001.64)1024953,290,729.593,351,370.683,230,088.5060,641.09(60,641.09)127553,465,700.753,701,313.003,230,088.50235,612.25(235,612.25)329553,600,293.953,970,499.403,230,088.50370,205.45(370,205.45)133953,896,398.994,562,709.483,230,088.50666,310.49(666,310.49)164266,258,494.828,640,883.443,876,106.202,382,388.62(2,382,388.62) 26     The share value for the apartments range from 3 (for the smallest unit) to 6 (for the largest). As will be observed, the share value assigned to the units are not in proportion to the strata area of the apartments. If the total sale proceeds in the collective sale were divided amongst the apartments in proportion to the share value (“SV method”), the smallest unit (the only one with a strata area of 57m2) would receive half that allocable to the largest unit (the only one with a strata area well above all the other units). 27     In contrast, if the distribution was based purely on strata area (“SA method”), the largest unit would receive more than 11 times that which the smallest would obtain despite the fact that the smallest unit had half the share value of the largest unit. The contrast between the two units at opposite ends of the range is of course quite stark. But in between these two extremes, the picture is more diverse. 28     In respect of those units with a share value of 3, only those whose strata area was 141m2or less would benefit from the SV method, the remaining units standing to gain more from a distribution based on the SA method. 29     Similarly, for units with a share value of four, only those with a strata area of 182m2or less would benefit from a distribution based on the SV method, the others standing to gain more from a distribution based on the SA method. In contrast,allunits with a share value of five or more, would benefit more from a distribution based on the SA method rather than the SV method. 30     The plaintiff’s unit was therefore not alone, there being 45 other units which would have benefited from a distribution based solely on the SA method, though not to the same extent. 31     Under s 13(1) of the LTSA, the common property is held by the subsidiary proprietors as tenants-in-common proportional to their respective share value. The land on which HHM sits is, of course, the main part of the common property and the only component of the entire development that a purchaser under anen blocsale would be interested in since the value to the purchaser is in the redevelopment potential. It stands to reason that a distribution based solely on the SV method is not nearly as egregious as it might initially appear. It is, in my view, at least more defensible than one based solely on the SA method; the purchaser is not interested in the size of the apartment but the share of the land that comes with the apartment. 32     If the SA method of distribution was applied, it would favour 46 units and work against the remaining 72. The “Valuation Guidelines for Collective Sales” issued by the Singapore Institute of Surveyors and Valuers (“SISV Guidelines”) which was produced before the Board lists the SV method as one of the methods used in collective sales. In contrast, the SA method which is not listed has apparently not been used at all. It is not difficult to see why. 33     The SA–SV method serves as a compromise between the two methods. The SISV Guidelines point out that this method “would even out the differences in strata areas and share values where there are big discrepancies in both among the various units”. It is therefore not surprising that all five groups of property agents who made presentations to the SC recommended the SA–SV method. In the result, this was the method adopted in the collective sale agreement signed by subsidiary proprietors holding between them more than 80% of the share value. It represented the fairest of the three methods under discussion, serving to moderate the extremes which either of the other two methods would have led to. 34     Counsel for the plaintiff repeatedly stressed that the plaintiff had been deprived of about $2.38m in sale proceeds because of the adoption of the SA–SV method. I am firmly of the view that the alleged loss is purely hypothetical because the SA method would never have been accepted as it would have disadvantaged the owners of 72 out of 118 units in HHM. While dealing with hypothesis, the plaintiff should consider that if the SV method was used instead, the plaintiff would have received $2.38m less than under the SA–SV method! Clearly, the SA–SV method was a compromise. 35     One other point deserves mention. Under s 30(2) of the LTSA, the share value of a lot determines – (a)    the voting rights of the subsidiary proprietors; (b)    the quantum of the undivided share of each subsidiary proprietor in the common property; and (c)    the amount of contributions levied by a management corporation on the subsidiary proprietors of all the lots in a subdivided building. For reasons best known to the developers, the plaintiff’s lot was allocated a share value of 6 despite its strata area being preponderantly greater than all the other units. Of advantage to the plaintiff was that its share of contributions levied by the management corporation was lower than it would have been if a higher share value had been allocated. The plaintiff has benefited in this respect over the years from the start. However, the downside to allocation of a low share value was that the voting rights and the quantum of the undivided share in the common property were, likewise, reduced. This was a trade-off which would have been obvious from the start. 36     The plaintiff’s director and shareholder, Mr Chen Kung, who was also a director of the developer, admitted under cross-examination that he was involved in the development of HHM and was aware of the allocation of share values. As such, it lies ill in his mouth to allege that the distribution was inequitable. 37     I pause for a moment to consider another method of distribution listed in the SISV Guidelines,viz, that based on valuation of the units. Clearly, with anen blocsale (and therefore the demolition of the building(s)) in mind, the valuation of the units could not realistically be based purely on the strata area. The valuer would likely take into account what, in his view, each unit should receive in the distribution of sale proceeds. In the result, the difficulty in seeking a compromise between the SA method and the SV method would merely be transferred into the valuation of the units. 38     The reason for my brief detour at [37] above is only to demonstrate the fact that, from amongst the methods identified in the SISV Guidelines, there is no method obviously superior to the SA–SV method. In these circumstances, it escapes me how the plaintiff could have expected the Board to arrive at a finding that the choice of the SA–SV method was lacking in good faith. 39     In the result, I dismissed the appeal with costs."
    }
}