{
    "case_title": "Lim Ah Neu v Tan Tiow Jin",
    "ncitation": "[2007] SGHC 135",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The common facts": "2I shall first set out the undisputed facts before I refer to the parties’ conflicting versions of other events. Prior to 5 September 2006, the plaintiff resided with the defendant and his family at No 10 Wilmonar Avenue (“the defendant’s house”). Before the plaintiff moved into the defendant’s house in early 2001, she stayed with a younger son Tan Kim Seng (“Kim Seng”) and his family at No 161, Eng Kong Gardens (“Eng Kong Gardens”), which property belongs to the plaintiff. The plaintiff is a widow and her late husband was Tan Gim Huat who founded various companies which bear his name including Tan Gim Huat Holdings Pte Ltd (“the company”). 3     The POSB account was opened on 22 February 1990 in the joint names of the plaintiff and the defendant. After the plaintiff moved into the defendant’s house, the defendant kept the passbook of the POSB account (“the passbook”) so that he could do banking for her as the plaintiff was/is illiterate and her legs were weak, particularly after she underwent a gall bladder operation in April 2002. (The plaintiff came to court in a wheelchair). 4     The facts hereinafter set out were extracted from the affidavits of evidence-in-chief of the parties as well as the witnesses of the plaintiff. While the defendant was his only witness, the plaintiff called three witnesses besides taking the stand herself. The witnesses were her other childrenviz.Tan Cha Boh (Cha Boh), Tan Ah Jee (Ah Jee) and Kim Seng.",
        "The disputed facts": "",
        "The defendant’s case": "5I start first with the defendant’s version of events. According to the defendant, he approached the plaintiff for a loan of $300,000 in November 2002 as he had reached the limit of his overdraft facility with the Bank of China (“BOC”). The plaintiff told him that she did not have the cash but that she would ask for the repayment from the company of some moneys owed to her and she would lend the sum in turn to the defendant. There was no discussion on repayment or payment of interest on the amount to be lent. The defendant then arranged for the company to repay the plaintiff $300,000 (“the first loan”) which he deposited into the POSB account on 2 December 2002. 6     The plaintiff requested and the defendant withdrew $5,000 from the POSB account on 3 December 2002 and handed her the sum. The plaintiff told him she was only lending him $290,000 as she needed another $5,000 for Chinese New Year. 7     Accordingly, the defendant withdrew $290,000 from the POSB account in the form of a cashier’s order on 4 December 2002 which he then credited to his BOC account. 8     Some 2-3 weeks before Chinese New Year in 2003, the plaintiff asked for $5,000 cash with $3,000 in new notes. The defendant complied with her request, withdrew $5,000 from the POSB account on 15 January 2003 and handed her the amount. 9     The defendant would occasionally inquire of the plaintiff whether she required him to return the $290,000 but her answer was always no. 10   The Tan Gim Huat group of companies underwent a restructuring exercise in August 2005 whereby Kim Seng would sell all his shares to the defendant. The defendant needed $650,000 to fund his purchase but he only had $150,000. 11   The defendant then approached the plaintiff and told her of his problem. She insisted that the shares in the family companies must remain within the family. When he told her he was short of cash, the plaintiff told him that she would arrange for the company to repay moneys which were owed to her and she would then lend the sums to him. As with the first loan, no terms of repayment or interest were discussed. 12   The defendant arranged for the company to repay the plaintiff $500,000 (“the second loan”) which he deposited into the POSB account on 20 September 2005. He withdrew the sum by a cashier’s order on 22 September 2005 and deposited it into his account with the United Overseas Bank (“UOB”). 13   Between 14 November and 3 December 2005, the plaintiff was admitted into Gleneagles Hospital for a viral infection and was warded in the intensive care unit for two nights. Her health deteriorated as a result of the viral infection and after her discharge from hospital, she could not walk on her own again. However, due to the care she received at the defendant’s house and with regular consultations of her physician, the plaintiff’s health improved by June 2006. 14   The defendant received a letter dated 28 August 2006 (“the letter of demand”) from the plaintiff’s current solicitors (“the plaintiff’s solicitors”) demanding the return of her Singapore and Malaysian public listed shares, the passbook and the plaintiff’s identity card. There was no mention of the two loans. The defendant was shocked by the letter of demand as the plaintiff was still residing with him and she could have asked him personally for the return of the items demanded. 15   When the defendant questioned the plaintiff on the letter of demand, she claimed she did not know she had instructed solicitors, it was Kim Seng who brought her to the plaintiff’s solicitors and who had informed her she would be taking back her shares. 16   On 30 August 2006, the plaintiff’s nephew (“Sutjianto”), his wife and some other relatives gathered at the defendant’s house for their weekly Wednesday dinner. The defendant showed Sutjianto the letter of demand. Sutjianto inquired of the plaintiff whether she was responsible for the demands set out in the letter of demand, the plaintiff said she was not and repeated that Kim Seng was responsible. The plaintiff replied in the negative when Sutjianto asked if she wanted the plaintiff’s solicitors to continue acting for her. 17   The defendant then assisted the plaintiff to draft a letter dated 1 September 2006 to the solicitors to say she was withdrawing her instructions. Her thumbprint was affixed to the letter and it was witnessed by Sutjianto who interpreted the document into Hokkien for the plaintiff’s benefit. The defendant separately wrote to the plaintiff’s solicitors on 4 September 2006 to say that in view of the plaintiff’s withdrawal of instructions to the plaintiff’s solicitors, he would not be responding to the letter of demand. 18   On 5 September 2006 at about 11am, the plaintiff’s two eldest daughters Cha Boh (PW2) and Ah Jee (PW3) came to the defendant’s house unannounced and took the plaintiff away, informing the defendant’s maid that they would be taking the plaintiff out for a short while. The plaintiff left without taking any of her personal belongings or medication. Since then, she has not returned to the defendant’s house. (The two daughters had taken the plaintiff back to Eng Kong Gardens to reside with Kim Seng’s family). 19   The defendant received a reply from the plaintiff’s solicitors dated 12 September 2006 to his letter of 4 September 2006. The plaintiff’s solicitors stated the plaintiff had not withdrawn her instructions or discharged them from further acting for her and renewed their demand for the return of the plaintiff’s shares. On 14 September 2006, the plaintiff’s solicitors made a separate demand to the defendant for the return of the plaintiff’s passport, identity card and all her bank passbooks. 20   The defendant decided to return the two loans. On 15 September 2006, he deposited $800,000 into the POSB account. $790,000 was for repayment of the two loans while $10,000 was the defendant’s “ex-gratia” payment to cover the two amounts of $5,000 each that he had withdrawn from the POSB account for the plaintiff’s own use. However, the defendant refused to return the passbook. In a letter dated 19 September 2006 to the plaintiff’s solicitors, his former solicitorsinter aliawrote: As to the Bank Passbook which you have correctly pointed out is being held in joint names, our client contends that he has as much right over it as your client. Although there is an element of trusteeship in the monies kept in the said account, our client’s interests and duty and obligations in the account exceed the ambit of the trusteeship. In the circumstances and until and unless you can satisfy our client that his trusteeship and his duty and obligations are indeed abrogated, our client will continue to keep the Bank Passbook. 21   It was only after a further demand from the plaintiff’s solicitors dated 21 September 2006 that the defendant (through his present solicitors) returned the passbook to the plaintiff on 28 September 2006. 22   The defendant’s solicitors then received a letter dated 3 October 2006 from the plaintiff’s solicitors requiring the defendant to account for the four withdrawals he had made from the POSB account. The defendant was also required to transfer to the plaintiff’s trading account with the Central Depository Pte Ltd (“the CDP”), her shares and instrument derivatives (bonus issues, warrants, options, loan stock etc). The defendant’s solicitors replied on 5 October 2006inter aliato say that the plaintiff was aware of all four withdrawals and that transfer of her shares to the plaintiff’s CDP account could only be done if the defendant was furnished with particulars as well as a certified copy, of her identity card. The defendant’s solicitors indicated that the defendant would attempt to deliver the account requested by 28 October 2006. 23   The plaintiff’s solicitors’ reply dated 9 October 2006 denied the plaintiff had knowledge of any of the withdrawals. In the event, the defendant did not render an account by 28 October 2006 or at all because the plaintiff’s writ of summons was filed on 23 October 2006.",
        "The plaintiff’s case": "24   The plaintiff (PW1) denied having any knowledge of the four withdrawals. She further denied that the defendant had asked for and she had agreed to extend, loans to him and that she had asked him to make the two withdrawals of $5,000 each. In any case, she did not receive either sum. 25   The plaintiff’s two daughters testified that they would visit their mother once a week and speak to her on the telephone as well. They could not recall the plaintiff telling either of them that she had twice asked the defendant to withdraw cash of $5,000 for her use from the POSB account or that she had lent the defendant any money let alone $290,000 and $500,000. Cha Boh added that whenever the plaintiff needed money, she would be asked to withdraw funds from the joint POSB account which she maintained for more than 20 years with the plaintiff. 26   Kim Seng similarly testified that he visited his mother regularly (twice a month) when she was staying with the defendant. He also telephoned her in between his visits. He said his mother never mentioned to him she had asked the defendant to withdraw $5,000 let alone twice, from the POSB account. Whenever the plaintiff needed money, she would get it from Cha Boh who would withdraw funds from the joint account maintained by the two of them. 27   Kim Seng added that since September 1995, the plaintiff had extended a shareholder’s loan of $1,520,000 (“the shareholder’s loan”) to the company which sum was reflected in its books. The company’s books showed that the defendant withdrew $300,000 from the company’s overdraft facilities with UOB on 2 December 2002 and entered the withdrawal as a repayment of the shareholder’s loan. For the second loan of $500,000 the defendant similarly drew down on the company’s overdraft facilities with UOB on 20 September 2005 and booked the withdrawal as a repayment of the shareholder’s loan to the plaintiff in the company’s accounts.",
        "The evidence": "28   At the outset, I should point out that neither Cha Boh nor Ah Jee were challenged on their evidence as counsel for the defendant informed the court he would not and he did not, cross-examine them. On the principle enunciated inBrowne v Dunn(1893) 6 R 57, as the defendant failed to challenge the evidence of his two sisters, their testimony is deemed to have been accepted by him. The testimonies of Cha Boh and Ah Jee must of course be reviewed in tandem with the plaintiff’s testimony. 29   The plaintiff who was a feisty woman, was not afraid to challenge counsel for the defendant whenever he doubted her answers. Despite her advanced age, she was lucid and clear in her testimony. She repeatedly maintained that the defendant had cheated her. It emerged in the course of her cross-examination that the plaintiff moved from Kim Seng’s house at Eng Kong Gardens to stay with the defendant after the defendant’s wife died, as she wanted to take care of her eldest grandson by him and not as counsel for the defendant suggested to her, because she had fallen out with Kim Seng and/or with Kim Seng’s wife. The plaintiff alleged that the defendant changed (for the worse) after he remarried. It is not necessary for the purpose of my findings however to form any view on the veracity of this allegation. Suffice it to say that the plaintiff was clearly unhappy with what the defendant had done. Otherwise, being his mother, she would not have sued him in these proceedings and in another action relating to shares in the company. 30   When Kim Seng took the stand, counsel for the defendant attempted to show that Kim Seng (who denied the allegation) had instigated his mother to sue his eldest brother because he was not on good terms (which he admitted) with the defendant. Kim Seng denied he was unhappy with the defendant because the latter was instrumental in a family company Teck Jin Pte Ltd commencing a suit against Kim Seng. That was a separate issue according to Kim Seng. 31   Finally, I turn to the defendant’s testimony. It seemed strange that the defendant did not call Sutjianto (who is the son of the plaintiff’s younger brother) to testify, when he had relied on the incident set out in [16] above as well as on the plaintiff’s letter to the plaintiff’s solicitors (apparently witnessed by Sutjianto) dated 1 September 2006, to support his contention that Kim Seng instigated the plaintiff to sue him. Without Sutjianto to corroborate his testimony, whatever the defendant said regarding the conversation that took place between the plaintiff and Sutjianto on 30 August 2006 was hearsay. The court was left with only the choice of accepting either the evidence of the plaintiff or the defendant.",
        "The findings": "32   The defendant did not impress me with his testimony. He lacked conviction in his answers. It emerged in the course of his cross-examination that the defendant was a graduate of Nanyang University and had been a director (together with Kim Seng) of the company for many years now. Yet, he failed to obtain any semblance of consent from the plaintiff to prove she had agreed to make him the two loans. He also omitted to procure the plaintiff’s written request to the company to return $800,000 to her and he failed to arrange for directors’ resolutions to be passed, approving the return of $300,000 and $500,000 to the plaintiff on the shareholder’s loan by debiting the company’s overdraft facility with UOB with the two sums. 33   As the closing submissions tendered for the plaintiff rightly pointed out, if the defendant was able to procure the plaintiff’s thumbprint on the letter dated 1 September 2006 in [17] (leaving aside the plaintiff’s contention that she was forced to go to a lawyer’s office and was pressured to sign something she did not understand), the defendant could easily have prevailed upon the plaintiff to thumbprint her written consent to the two loans. The defendant’s explanation for his omissions were unconvincing – that from his father’s time, it had been the practice for any withdrawals to be evidenced by cheques which were then photocopied and sent to the company’s accountants together with the relevant bank statements. 34   The defendant’s testimony on the quantum of the first loan was vague – it was unclear whether he had asked the plaintiff for $300,000 or she had offered him $300,000 or, she had told him she could only lend him $290,000 when he asked for $300,000. Questioned why he paid her $300,000 for the first loan when he claimed to have borrowed only $290,000 from the plaintiff, the defendant explained (at N/E63) that the extra $10,000 was a “token sum” from him for the plaintiff’s help in lending him $790,000. I found this explanation unconvincing. In any event, the plaintiff was unlikely to have retained $10,000 for her own use as it was Cha Boh’s (unchallenged) testimony that the joint account she maintained with the plaintiff was the source of the plaintiff’s spending money. I similarly reject the defendant’s lame explanation (at N/E 55) that the plaintiff’s pocket money came from her joint account with Cha Boh while the two sums of $5,000 (which were substantial) he withdrew from the POSB account were used by the plaintiff to buy expensive gifts for many relatives who were getting married at the time. 35   I find that the defendant took the entire $300,000 for his own use. I could understand if the $10,000 represented interest charged by the plaintiff or offered by the defendant for her loans but it was the defendant’s own evidence that the loans were interest-free. 36   I have no doubts that the defendant did not ask for, let alone obtain the plaintiff’s permission, to borrow $800,000 from her by taking it from the shareholder’s loan (and utilising the company’s bank overdraft facilities in the process). The defendant’s own actions belied his claim that the plaintiff knew of the two loans. If indeed the plaintiff had extended the two loans and there were (according to the defendant) no timelines on repayment, there was no reason for the defendant to have returned the sums with such alacrity once the plaintiff found out. 37   The paragraph set out in [20] from the letter dated 19 September 2006 of the defendant’s former solicitors, was an exercise in verbiage which I could not comprehend and which (as evidenced by the cross-examination of the defendant) counsel for the plaintiff and the defendant himself could not understand either. Cross-examined on what he meant by the paragraph set out in [20], the defendant described it as “legal jargon” which he could not explain but disagreed when counsel put it to him that it was meaningless. The defendant’s refusal to return the passbook was a damning piece of evidence. I agree with the suggestion put by counsel for the plaintiff to the defendant, that his conduct was a delaying tactic to prevent the plaintiff and the defendant’s siblings from finding out the defendant’s unauthorised withdrawals. There was no valid reason for the defendant to refuse to return the passbook to the plaintiff as the moneys in the POSB account were hers, according to the defendant’s written testimony. 38   I would point out that while the entire tenor of the defendant’s evidence in court was on the basis that the moneys in the POSB account belonged to the plaintiff, in his defence filed on 22 November 2006, the defendant averred that the moneys belonged to him. As such, he pleaded that he was not obliged to account to the plaintiff. 39   It is my view that because of the close relationship between the plaintiff and her daughters/Kim Seng, it would only have been natural for the plaintiff to have informed her children at some point in time of the loans had the defendant indeed asked for them and she had been told of his withdrawals from the POSB account. 40   In the closing submissions tendered on his behalf, counsel for the defendant argued (in para 33) that the very fact the plaintiff made no demands for the return of the two loans in the letter of demand proved that the plaintiff was aware of the loans and that they were proper. This was an illogical argument. If anything, the lack of mention of the loans in the letter of demand supported the plaintiff’s case that she was unaware of the loans untilafterthe defendant returned the passbook to the plaintiff’s solicitors on 28 September 2006. The response from the plaintiff’s solicitors of 3 October 2006 [23] to the defendant’s solicitors was unequivocal, as can be seen from the following extract of their letter: The bank passbook shows inter alia the following withdrawals:  03/12/02$5,000.0004/12/02$290,000.0015/01/03$5,000.0022/09/02$500,000.00 Our client has no knowledge of these withdrawals. Please furnish the following information in relation to these withdrawals within five days from the date of this letter: (1)   To whom were the cashier’s orders for the $290,000 and $500,000 made out? (2)   Who received the 2 cash withdrawals; (3)   Why were our client’s monies paid to each of those payees and recipients? What was the purpose of each payment. 41   Accordingly, I award the plaintiff interlocutory judgment with costs on her claim. The defendant is ordered to account to the plaintiff for his use of the withdrawals of $5,000 (twice), $290,000 and $500,000 from the POSB account. In the event the defendant is found to have made profits and/or derived other benefits on the taking of the account, he shall pay or handover the same to the plaintiff together with interest (on the profits) at such rate and for such period as the Registrar shall in his discretion determine."
    }
}