{
    "case_title": "Lee Nyuk Lian v Lim Nia Yong",
    "ncitation": "[2007] SGHC 44",
    "coram": "Sundaresh Menon JC",
    "sections": {
        "Maintenance": "18        The petitioner is currently employed and residing in a rented flat. She sought an order for nominal maintenance of $1 per month. The respondent initially agreed to this but later resiled from this position on the basis of the allegation that the petitioner had converted a substantial sum of family money to her own use. As it was eventually concluded that this allegation should be left to be pursued elsewhere and should be ignored as far as the matrimonial proceedings are concerned, I see no basis not to make an order for maintenance in the amount sought and I do so accordingly.",
        "Custody and access": "19        The respondent sought sole custody of the children whereas the petitioner sought joint custody. The children are both boys, now aged 16 and 17. There was no dispute that the respondent should retain care and control of the children. 20        In my judgment, as far as possible, both parents should be encouraged to remain involved in the upbringing of the children. Mr Low accepted this as a sound premise. I accordingly order that both parties are to have joint custody with care and control to the respondent. 21        The petitioner is to have liberal access to the children. Mr Foong initially wanted me to fix the hours when access could take place. I did not think it appropriate to do this in the context of children of the age of these boys. In my judgment, it is preferable that the petitioner make the necessary efforts to reach out to her children and to encourage them to see her as often as she and they are willing and able. Both counsel eventually agreed with this approach.",
        "Distribution of the matrimonial assets": "22        The following were the only assets that I was asked to deal with in my order for distribution: (a)        HDB flat at Block 105, Bishan Street 12 #02-248, Singapore 570105 (“the HDB flat”); and (b)        House at No 32 Jalan Bukit Kempas 3, Taman Bukit Kempas, 81299, Johor Bahru, Malaysia (“the JB house”). This property is registered in the name of a company known as IDA Resources Sdn Bhd in which the petitioner and the respondent are the only shareholders. 23        The petitioner sought an order that she be entitled to a 50% interest in each of these properties. Although she initially wanted an order that the properties be sold and half the net proceeds be paid to her, Mr Foong made it clear that she was not pressing for an order that the properties be sold as long as she could realise her interest in them. 24        The respondent on the other hand initially maintained that the petitioner should get no share. Subsequently, after it was decided that the allegations concerning the payments made out of IDA Consultants Sdn Bhd would be disregarded for the purposes of these proceedings, Mr Low suggested that the fair and equitable share that the petitioner should be allowed, was between 10% and 20%.",
        "The facts": "25        The relevant facts were these. The parties had been married for a period of almost 14 years when the marriage broke down. If the relevant date is taken to be the date of the decree nisi, then the parties were married for around 15 years. The petitioner is aged 40 and the respondent, 49. Insofar as the HDB flat is concerned, this was acquired by the respondent during a previous marriage. There was no dispute that the HDB flat was acquired entirely through the respondent’s resources. Mr Foong confirmed that the petitioner did not make any direct or indirect financial contributions towards the acquisition of the flat. 26        At the material times, the petitioner was a housewife although for a period of time in the later part of the marriage, she provided administrative services to the company through which the respondent provided his professional services. The petitioner was the primary caregiver at home. She was also the primary housekeeper. The petitioner also contended that the respondent had travelled on work from time to time and when he did, she had been solely responsible for maintaining the home and caring for the children. At one stage, Mr Foong suggested that the petitioner was the sole caregiver and the only person doing housekeeping work to the exclusion of the respondent. He based this on the statement that she was “theonewho took care of our 2 sons’ daily needs” in her affidavit of means. I found this difficult to accept in the sense that the petitioner had felt able to leave the respondent with the children and must therefore have felt that the respondent was a capable parent. Indeed, in one of her affidavits, she said as follows: If I could, I would want to have care and control of them. But I cannot afford to. I know that the respondent loves them too. So I believe he can take care of them well. 27        In this light, it seemed unlikely to me that she could in all seriousness maintain that the respondent had no role whatsoever in caring for the family and providing welfare in the home. In any event, it could not be denied that since December 2003 when the petitioner left the matrimonial home, the husband had been the sole caregiver to the children as well as the sole person looking after and providing for the home. 28        As for the JB property, Mr Foong submitted that the petitioner had made some indirect financial contribution to that. The purchase was financed by a downpayment made by the respondent and by a mortgage he serviced. However, the parties had pulled down the house that had been there and had built a new home. A contractor was engaged and from the photographs exhibited, it was evident that this had been a major undertaking. The petitioner claimed that despite this, she had sourced workers; sourced and purchased materials; arranged deliveries; supervised and co-ordinated the building work; and carried out arduous labour. The respondent did not deny that the petitioner had been involved in this venture as had the respondent himself. However, he contended that she had exaggerated her contribution. 29        This was a project undertaken in the years of the marriage when they had dreams of building a home for their retirement and I have no reason to think that either of the parties exerted appreciably more or less efforts than the other. 30        The wife also contended that for a period of four years or so, she had done administration and accounts in the respondent’s business. It was evident that she had been involved in the administrative and accounting aspects of the companies through which the respondent did his work since this had led to his allegation that she had diverted some assets to her own use. 31        Lastly, both parties stated that they were making no claim in relation to the amounts in their CPF accounts. Indeed, Mr Foong said that I could ignore this for present purposes. I do note however that the respondent has declared that there is an amount of around $125,000 in his CPF account distributed among his ordinary, medisave and special accounts.",
        "The applicable legal principles": "32        The starting point of the analysis is S 112(2) of the Women’s Charter (Cap 353, 1997 Rev Ed) which provides as follows: 112(2)   It shall be the duty of the court in deciding whether to exercise its powers under subsection (1) and, if so, in what manner, to have regard to all the circumstances of the case, including the following matters: (a)        the extent of the contributions made by each party in money, property or work towards acquiring, improving or maintaining the matrimonial assets; (b)        any debt owing or obligation incurred or undertaken by either party for their joint benefit or for the benefit of any child of the marriage; (c)        the needs of the children (if any) of the marriage; (d)        the extent of the contributions made by each party to the welfare of the family, including looking after the home or caring for the family or any aged or infirm relative or dependant of either party; (e)        any agreement between the parties with respect to the ownership and division of the matrimonial assets made in contemplation of divorce; (f)        any period of rent-free occupation or other benefit enjoyed by one party in the matrimonial home to the exclusion of the other party; (g)        the giving of assistance or support by one party to the other party (whether or not of a material kind), including the giving of assistance or support which aids the other party in the carrying on of his or her occupation or business; and (h)        the matters referred to in section 114(1) so far as they are relevant. 33        It is evident that the section confers a very wide discretion upon the court to have regard to all the circumstances of the case including the specific matters enumerated in the section. 34        Section 112(2) was the subject of careful analysis and explication by Prakash J inYow Mee Lanat [29] to [34] and the following principles flow from that decision: (a)        In deciding what is a just and equitable distribution the court should have regard to all relevant circumstances including those listed in the case and this includes financial as well as non-financial contributions to the acquisition of assets and to the care of the family and the home; (b)        The court adopts a broad brush approach in determining what a just and equitable distribution would be. A party’s financial contributions to the acquisition of any particular matrimonial asset would not be principally determinative of how the asset is to be divided. The court is free to give as much or even more weight to other non-financial factors; and (c)        The court should establish the relevant factors and then determine what would be just and equitable and in this regard, the court should approach the issue without any predisposition towards an assumption that both parties have contributed equally towards the acquisition of assets. 35        Prakash J inYow Mee Lanalso noted that a marriage is not a business but a union where the spouses work together for a common goal. In this context even if they each have unequal abilities, this should not result in unequal rewards where they have consistently and over a long period made their respective contributions as best they could. 36        This approach was subsequently approved by the Court of Appeal inLim Choon Lai v Chew Kim Heng[2001] 3 SLR 225. (“Lim Choon Lai”). 37        Beyond these principles, it is useful to have regard to how the courts have applied the foregoing principles to arrive at a just and equitable distribution. InYow Mee Lan, Prakash J noted that the wife, though not as capable professionally and academically as the husband, had done her utmost to support him at home and in the business. She had worked almost throughout the course of a marriage lasting 26 years. She had also looked after the home and the children alone during the extensive periods the husband was travelling. Her commitment to the family and marriage was described as “total and unstinting”. The learned judge then concluded as follows at [42] – [46]: 42         To summarise, the marriage was a long one. The husband was the main income earner. The wife looked after the home and children and played a supporting role in the family business owned by the husband. It appears that she did not have either the knowledge or the talent which the husband did and could not herself have produced the substantial income he was able to generate. In these circumstances, what would be a just and equitable division of the assets? The District Judge placed great emphasis on the husband’s role as the income generator and considered that he should therefore have a major share of the assets. 43         With due respect, that approach no longer accords with the legislation which takes a wider view. It recognises that a marriage is not a business where, generally, parties receive an economic reward commensurate with their economic input. It is a union in which the husband and wife work together for their common good and the good of their children. Each of them uses (or should use) his or her abilities and efforts for the welfare of the family and contributes whatever he or she is able to. The partners often have unequal abilities whether as parents or as income earners but, as between them, this disparity of roles and talent should not result in unequal rewards where the contributions are made consistently and over a longer period of time. 44         In the present case, the wife contributed to the best of her ability both to the maintenance of the family and to the business. She provided essential backup on which the husband could rely. He was able to travel for long periods safe in the knowledge that both his home and his business were in reliable hands. No doubt someone else could have done the administrative work in Plymat which the wife did (the husband was at pains to denigrate her work as being merely clerical) but with someone else in charge, he would not have had the assurance that in the office his interests would not be undermined. 45         It is also relevant to my consideration that the wife’s claims to share in the husband’s assets do not extend to his CPF contributions, two of his club memberships and to his interest in Plymat itself which would otherwise be regarded as a matrimonial asset. This renunciation is of value to the husband. No doubt, as far as Plymat is concerned, its main assets are the skill and contacts of the husband and those obviously could not be divided between the husband and the wife. Notwithstanding that, it would still be possible to do a valuation of Plymat’s business and to award the wife a share of that value. 46         In all the circumstances of this case, I consider that the equitable division would be an equal division of those assets which the parties have asked to share in. … 38        InLim Choon Lai, the Court of Appeal considered that in the absence of reliable evidence on the exact monetary contributions made by each party to the purchase of the matrimonial home, the fairer view to take was that they had made substantially equal contributions. The Court of Appeal also concluded that the wife earned more and bore the main burden of supporting the family and providing for its welfare. Taking this into account, the Court of Appeal concluded the wife deserved the larger share and therefore awarded her a 60% share.",
        "My decision": "39        In the light of these authorities, I turn to the present case. This was a case involving a fairly long marriage of around 15 years. It is clear that the respondent had been the main source of the family’s income and so bore the substantial burden of paying for the two properties. Although the petitioner made some indirect contributions towards the JB property as they set about improving it, this was matched by the indirect efforts of the respondent who apparently undertook much of the design of that property quite apart from the direct financial contributions that he alone made. 40        The petitioner was the primary caregiver to the children and the home until she left in 2003. The respondent himself stated that he was preoccupied for years with his work and his efforts in designing and seeing to the construction of the JB property. Further, he did travel from time to time. But the wife’s contributions as the primary caregiver to the children are to be balanced against the fact that the husband has been playing this role exclusively since she left and will continue to do so for the foreseeable future. Indeed, the respondent has been having sole care and control of the children since December 2003 when they were aged 12 and 13 respectively and he will continue to have care and control under the present order. 41        It is also true that the petitioner did support the respondent in his business for some years. Further, the petitioner was not seeking any part of the respondent’s CPF contributions. 42        Taking all these factors into account and having weighed the monetary as well as the non-monetary contributions made by each party, I consider that the respondent deserved a larger apportionment of the matrimonial assets than the petitioner, but not to the extent suggested by the respondent. Rather, in my judgment, taking a broad brush approach, the fair and equitable distribution would be to grant the respondent 60% of the interest in these properties and to grant the petitioner 40% of the interest in these properties. 43        Both counsel had informed me that they were agreeable to my not making an order for sale. I therefore make the following orders in relation to these properties: (a)        Each of the properties is to be valued by a valuer acceptable to both parties (or in the case of the HDB flat, to the HDB) within 6 weeks from the date of this judgment; (b)        Within 12 weeks of the date of the valuation, the respondent is to pay the petitioner 40% of the net value of the two properties; (c)        Within 1 week of such payment, the petitioner is to deliver signed blank transfers and all the share certificates registered in her name in IDA Resources Sdn Bhd to the respondent at no cost; (d)        There shall be liberty to apply.",
        "Costs": "44        This brings me finally to the question of costs. Mr Foong submitted that his client was entitled to costs because the divorce had been granted on the basis of the respondent’s unreasonable behaviour. Further, he submitted on the authority ofTham Khai Meng v Nam Wen Jet Bernadette[1997] 2 SLR 27at [49]-[50] that the ancillary matters are part of the hearing of the petition and the same order should follow on the hearing of the ancillaries. Finally, he submitted that much time and effort had been expended on the ancillaries by reason of the respondent’s allegations as to the diversion of funds by the petitioner. 45        Mr Low on the other hand, submitted that each party should bear their own costs. 46        In my judgment seen in the whole, the petitioner has been substantially successful and should get her costs. It is also true that the proceedings were prolonged by virtue of the allegations of embezzlement made by the respondent. Further, the ancillaries came to be tried in the High Court only for that reason. 47        Both parties agreed I should fix the costs if I were minded to make an order for costs. Mr Foong submitted a figure of $50,000. In my view, this was excessive having regard to the work reasonably required to be done on behalf of the petitioner. The petitioner filed 5 affidavits against 9 that the respondent filed. The hearing took more than 2 days including the first appearance. There were also several attendances for directions. Taking all this into account, I fix the costs to the petitioner at the sum of $20,000 with reasonable disbursements to be taxed if not agreed."
    }
}