{
    "case_title": "Narindar Singh Kang v Law Society of Singapore",
    "ncitation": "[2007] SGHC 145",
    "coram": "Belinda Ang Saw Ean J; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "The facts": "2          The Applicant was called to the Bar on 9 April 1975. After completing his pupillage, he worked for six years in the Singapore Police Force. When he left in April 1981, he was holding the rank of Probationary Assistant Superintendent of Police. He then joined a law firm as a legal assistant in May 1981. In October 1981, he started his own legal practice under the name M/s N S Kang.",
        "Events leading to the Applicant’s striking off": "3          The Applicant was an advocate and solicitor of some 14 years’ standing when he was convicted on 15 December 1995 on the following charge: You, Narinder Singh s/o Malagar Singh, M/45 years, NRIC No S2000696Z, are charged that you in conjunction with one Hartej Singh Sidhu, a condemned prisoner, on 18 May 1995, at or about 5 pm, at Changi Prison, Changi Road, Singapore, did corruptly solicit for the family of the said Hartej Singh Sidhu, a gratification, to wit, a sum of $100,000/- from one Baldev Singh, the son of another condemned prisoner, Sarjit Singh s/o Anokh Singh, on account of Hartej Singh Sidhu exonerating the said Sarjit Singh s/o Anokh Singh by his signed statement, to wit, “I, Hartej Singh Sidhu c/o Changi Prison Cond No. 476/93 hereby state that Sarjit Singh c/o Changi Prison Cond No. 477/93 is innocent and was not involved in the drug trafficking transaction. The transaction was done by me solely.” of any complicity in the drug trafficking transaction concerned in Criminal Case No. 52 of 1991 and you have thereby committed an offence punishable under Section 5(a)(i) of the Prevention of Corruption Act, Chapter 241. 4          The Applicant had been assigned to act as counsel for one Hartej Singh Sidhu (“Hartej”) who appealed against his conviction on two charges of drug trafficking. Hartej had been convicted together with a second accused, Sarjit Singh s/o Anokh Singh (“Sarjit”), and both were sentenced to death on 21 January 1993. Another counsel, Mr N K Rajah (“Rajah”) was assigned to represent Sarjit. 5          On 18 May 1995, the day before Hartej and Sarjit were to be executed, the Applicant and Rajah went to Changi Prison to see their clients respectively at the request of Sarjit’s relatives who were hopeful that Hartej would make a confession which would save Sarjit from execution. Hartej initially refused to make a confession. However, he later signed a confession drafted by Rajah and handed it to the Applicant. Both lawyers then left Changi Prison along with Sarjit’s relatives. At the waiting area outside the main gate of Changi Prison, the Applicant told Rajah and Mr Baldev Singh (“Baldev”), who was Sarjit’s son, that his instruction from Hartej was not to hand over the confession until a sum of $100,000 was paid to Hartej’s family. Baldev asked if there was any guarantee that the confession would save his father’s life. However, Rajah dissuaded him from accepting the offer, telling him that it would not save his father because of the other evidence which had been adduced against Sarjit at his trial. 6          On the same evening, Baldev visited the Applicant in his office to seek his help in staying the execution. The Applicant asked if Baldev’s family had agreed to meet Hartej’s demand. He informed Baldev that there was no guarantee that the confession would save Sarjit from execution and suggested that Baldev contact Rajah for help. They were unable to contact Rajah and Baldev eventually left the Applicant’s office without the confession. 7          Rajah, after some consultation with his senior partner, decided to write to the Law Society of Singapore (“the Law Society”) about this incident. As a result of investigations ensuing thereafter, the Applicant was charged with and subsequently convicted under s 5(a) of the PCA. He was initially sentenced to five months’ imprisonment. His appeal against the conviction and sentence was dismissed. His sentence was enhanced to 12 months’ imprisonment by Yong Pung How CJ (seeNarindar Singh v PP[1996] 3 SLR 639). In particular, the following observations by Yong CJ (at 655–656, [59]–[60]) are particularly apposite in so far as they encapsulate the seriousness of the offence committed by a lawyer who, because of his seniority, ought in fact to have known better: It was further argued that any attempt to influence the President by using Hartej’s confession would probably have failed anyway. I have said earlier that I do not think this is relevant. Theharm to our justice systemwas done as soon as the appellant asked Baldev to pay for the confession. It is of no mitigating value to say that he did not really expect anyone to take the confession seriously. Finally, it was said that the appellant had already suffered grave, possibly irreparable, damage to his career; and accordingly, whilst the court might wish to send a message to other lawyers minded to act as the appellant had done, a heavy fine would suffice to give these lawyers the necessary warning. I have considered the facts of this case very carefully; and, in my view, a fine would be manifestly inadequate.As a senior member of the Bar and a former police officer, the appellant should have been all the more keenly aware of the need to guard against any abuse of our justice system. I find his conduct shocking and reprehensible. Indeed, having regard to all relevant circumstances, the sentence of five months’ imprisonment was manifestly inadequate.I note that inPP v Datuk Haji Harun bin Haji Idris[No 2[1977] 1 MLJ 15], for example, the accused, who was a senior political leader convicted of three charges of corruption, received an aggregate custodial sentence of two years. I am of the view that this is a case where the court should exercise its powers under s 256 of the Criminal Procedure Code (Cap 68) to enhance the sentence. The appeal against sentence is accordingly dismissed; and the period of imprisonment imposed on the appellant is hereby enhanced to 12 months. [emphasis added] 8          Thereafter, the Law Society applied byex parteoriginating summons under s 94A of the Legal Profession Act (Cap 161, 1994 Ed) (“the 1994 Act”)for an order that the Applicant be made to show cause why he should not be dealt with under s 83 of the 1994 Act. At the show cause hearing before the court of three judges, M Karthigesu JA, when delivering the grounds of decision of the court, found that the Applicant’s “willingness to assist Hartej in essentially getting a bribe in return for a confession implied a defect of character which made him unfit to be a solicitor” (seeLaw Society of Singapore v Narindar Singh s/o Malagar Singh[1998] 1 SLR 328at [13]). Karthigesu JA stated that “such conduct was inimical to the administration of justice, by tilting the balance in favour of those who can afford to pay for evidence” (at [17]). Striking the Applicant off the roll was, thus, the only suitable penalty in this case.",
        "State of affairs after the Applicant was struck off": "9          After the Applicant was struck off on 3 October 1997, his wife who was also a practising advocate and solicitor since 1979, took over his practice and has since run the firm for the past ten years. After his release from prison in the middle of 1997, the Applicant dabbled in some business ventures with friends, albeit unsuccessfully. In 2000, he started work as a legal consultant for a shipping company, M/s Kim An Shipping Co Pte Ltd (“Kim An”). In early 2002, he left them and joined M/s Sunrise & Co Pte Ltd, a sports company (“Sunrise”) where his job scope was similar to that at Kim An. As he had to undergo a coronary bypass operation in April 2003, he was incapacitated over the next three months. He left Sunrise and returned to Kim An on a part-time basis. In 2005, Kim An relocated to Thailand and the Applicant decided to start a small trading company which is still in operation today.",
        "The Applicant’s submissions": "10        The Applicant submitted that it had been almost 11 years since he had ceased practice and almost ten years since his name had been removed from the roll. He had served his imprisonment sentence of 12 months and, since then, had not committed any other offence. He had fully reformed, rehabilitated and was a person of good character. It was highly unlikely that he would re-offend. He stated that the consequences that he had to face made it an unforgettable lesson. Additionally, he provided seven testimonials in his affidavit in support of his application that he was a person of integrity, was trustworthy and had reformed. Four of the testimonials were from lawyers, including two Senior Counsel. 11        The Applicant explained his actions on 18 May 1995 as follows. He asserted that he was merely carrying out the final instructions of an assigned client who was to be hanged on the very next day. His conduct, or rather, misconduct, was not pre-planned and premeditated but occurred very much on the spur of the moment. He expressed regret at not being able to apply his mind to the situation at hand and for making such a gross error of judgment.",
        "The Attorney-General’s objections": "12        The Attorney-General objected to the Applicant’s application for restoration to the roll. The Attorney-General stated that the preservation of the honour of the legal profession and public protection was paramount. In the Applicant’s case, his previous offence “went to the heart of the administration of justice”. Although his frankness with Rajah about his client’s offer may have been indicative of the fact that he may not have realised how serious his conduct was, this lack of realisation was in itself disturbing when one considered the breadth of exposure the Applicant had to the criminal law prior to the incident, first as a police officer, and then as a practising lawyer. This incident could not be written off on the ground either of youthful naïvety or inexperience. 13        The Attorney-General acknowledged that there were mitigating factors present. There was no evidence that the Applicant had benefited financially from the arrangement. A time period of almost ten years had passed and during his time away from the legal profession, his family had experienced financial and emotional hardship. The Applicant had also adduced letters in support of his application, which expressed confidence in his character and reformation. 14        However, the mitigating factors did not address the underlying concern of whether the public would be adequately protected if the Applicant were to resume practice. In this respect, the Attorney-General was not confident that this would be the case and further submitted that the standing of the legal profession would also suffer detriment. In conclusion, the Attorney-General was unable to gloss over the Applicant’s actions as a momentary lapse of judgment. In the light of his experience and standing at the bar, his attempt to subvert the course of justice had to be viewed with seriousness. 15        A distinction was drawn between this present case and the recent case ofKnight Glenn Jeyasingam v Law Society of Singapore[2007] SGHC 105(“Glenn Knight”), which is in fact not only the most recent decision but is also (in our view) the leading decision in this particular sphere of the law. The Attorney-General submitted that the charges of criminal breach of trust and misappropriation inGlenn Knightwere distinguishable. The amounts in question were small and the sentences meted out were not lengthy custodial terms but maximum fines and a day’s imprisonment for each charge. Further, a longer period of time had passed since the applicant in that case was struck off and there was greater peer support through letters attesting to his character.",
        "A preliminary point": "16        Counsel for the Applicant, Mr Peter Cuthbert Low, raised a preliminary point, centring on s 102(2)of the Act, which states that “[a]ny application that the name of a solicitor be replaced on the rollshall be byoriginating summons, supported by affidavit, before a court of 3 Judgesof the Supreme Court of whom the Chief Justice shall be one” [emphasis added]. Mr Low requested, in the light of the provision just quoted, that the Chief Justice be part of the presentcoram. We pointed out to him, however, that because the Chief Justice, as the then Attorney-General, had sanctioned the prosecution against the Applicant which had led to his (the Applicant’s) conviction (and his subsequent striking off the roll), the Chief Justice’s presence on thecoramin the present application might beperceivedas being inappropriate. 17        Indeed, Ms Valerie Thean, appearing on behalf of the Attorney-General, agreed. She also pointed, however, to s 5 of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed), which reads as follows: Acting appointment 5.—(1) Whenever during any period, owing to illness or absence from Singaporeor any other cause, the Chief Justice is unable to exercise the powers or perform the duties of his office, such powers shall be had and may be exercised and such duties shall be performed by the Judge having precedence next after the Chief Justice who is present in Singapore and able to act during that period. (2)        For the purposes of this section, temporary absence in any part of Malaysia shall not be deemed to be absence from Singapore. [emphasis added] 18In our view, the above provision is, at least literally interpreted, appropriate to cover the present situation (for a similar provision, which was applied in the High Court decision ofAnwar Siraj v Tang I Fang[1982-1983] SLR 242, see s 5(5) of the Jurong Town Corporation Act (formerly Cap 209, 1970 Rev Ed, and presently Cap 150, 1985 Rev Ed)). However, we would have thought that basic principles of natural justice would, in any event, apply to a situation such as this and that s 102(2) of the Act should not be read so literally as to produce at least the likelihood that there would be a perception of unfairnessas well asan absurd result. Such an approach would, indeed, be contrary to the very purpose underlying the Act in general and s 102 in particular. We need say no more about the issue centring on the perception of unfairness as it is an obvious one. The second – the argument from absurdity – stems from the fact that if it is insisted that the Chief Justice be part of thecoram, all applicants in a similar situation to that of the present applicant will henceforth be unable to pursue their respective applications. Such a result comports with neither logic nor common sense. 19        An analogous situation was considered by the Judicial Committee of the Privy Council inJeyaretnam JB v Law Society of Singapore[1988] SLR 1(“Jeyaretnam”). In that case, the Board was of the view that what was then s 95(6) of the Legal Profession Act (Cap 161, 1985 Rev Ed) (“the 1985 Act”) (which provided that the proceedings on the summons to show cause “shall be heard by a court of 3 judges of whom the Chief Justice shall be one”) was “clearly not mandatory but directory only” (at 12, [37]). However, in that particular case, there was a further provision which supported the decision arrived at by the Board; this was the then s 95(8) of the 1985 Act (which is the present s 98(9) of the Act), and which read as follows: The Chief Justice or any other Judge of the Supreme Court shall not be a member of the court of 3 judges when the application under subsection (6) [the present subsection (7)] is in respect of a complaint made or information referred to the Society by him. 20It is true, however, that s 102 of the Act does not contain a provision similar to that just quoted. Nonetheless, for the reasons we have set out above (at [18]), there are both logical as well as practical reasons for the approach adopted in the instant proceedings. In any event, even inJeyaretnamitself, the Boardalsoreferred to what are, in effect, the application of principles of natural justice (at 12, [38]): It would be absurd that the Chief Justice should not be able to disqualify himself from sitting if the advocate and solicitor facing disciplinary charges was either a close relative or a sworn enemy or for any other good reason. The refusal of the objection [in the present case] was unfortunate … Justice might be done, but certainly could not be seen to be done. 21In any event, after consultation with his client, Mr Low stated that he had been instructed to proceed with the application. However, as we have noted above, there was not only good reason for constituting thecoramfor the present application in its present form but also that such an approach was justified based on legal principle, logic as well as common sense. 22        We turn now to a consideration of the application proper.",
        "The law": "23        Much argument centred around the general principles to be applied. It would therefore be appropriate, in our view, to clarify not only the principles that are to be applied in the context of an application for restoration or reinstatement to the roll but also how they are related to each other, as well as how they are to be applied. 24        However, before proceeding to do so, it is equally important to clarify what oughtnotto apply in applications of this nature. This is because, as the argument proceeded during the present application, at least two major misconceptions began to appear. It is therefore imperative to clear away inimical as well as misleading “legal underbrush”. 25        The first misconception is that sympathy for the applicantaloneissufficientto warrant a restoration to the roll. 26        The second misconception is as important and its “antidote” is as follows: The issue ofpunishmentisirrelevantto such an application. In short, the issue of punishment should otherwise beexcluded(this is in fact clearly established by the case law: see, for example, the oft-cited English decision ofEx parte Brounsall(1778) 2Cowp 829; 98 ER 1385 and the Supreme Court of Queensland decision ofGreg Gregory v Queensland Law Society Incorporated[2001] QCA 499at [17]). Indeed, the applicant would havealreadybeen punished under prior disciplinary and/or criminal proceedings and it would be unfair as well as unjust to punish him or her once again in proceedings related to restoration to the roll. Let us now turn – in a morepositivefashion – to the general principles proper. 27        The various general principles centre, of course, around s 102 of the Act, which reads as follows: Replacement on roll of solicitor who has been struck off 102.—(1) The court may, if it thinks fit, at any time order the Registrar to replace on the roll the name of a solicitor whose name has been removed from, or struck off, the roll. (2)        Any application that the name of a solicitor be replaced on the roll shall be by originating summons, supported by affidavit, before a court of 3 Judges of the Supreme Court of whom the Chief Justice shall be one. (3)        The originating summons shall be served on the Society which shall — (a)        appear at the hearing of the application; and (b)        place before the court a report which shall include — (i)         copies of the record of any proceedings as the result of which the name of the solicitor was removed from or struck off the roll; and (ii)        a statement of any facts which have occurred since the name of the solicitor was removed from or struck off the roll and which in the opinion of the Council or any member of the Councils [sic] are relevant to be considered or to be investigated in connection with the application. 28        By way of a few general observations, firstly it is clear, as this court observed inRe Ram Kishan[1992] 1 SLR 529(at 533, [14]), that “the onus will be on [the applicant] to convince a court of three judges that he is still a person on whose integrity and honour reliance may be placed”. 29        Secondly, “[t]he application of a person who has previously been struck off the roll for grossly improper conductmustnecessarily be subjected to stricter scrutinythan that of a new entrant to the profession who has no adverse record” [emphasis added] (seeRe Ram Kishan(at 533, [14])). Indeed, as Prof Tan Yock Lin has observed in his learned work,The Law of Advocates and Solicitors in Singapore and West Malaysia(Butterworths Asia, 2nd Ed, 1998) at p 101: It may not be altogether inaccurate to describe it as proof beyond reasonable doubt. If so, since the applicant can only be removed by proof beyond reasonable doubt, there is parity in requiring him to prove beyond reasonable doubt his fitness for replacement on the roll. The above observations may set the required standard a little too high. However, it is clear, in our view, that the burden of proof must necessarily be a heavy one and ought, in any event, to be higher than the normal civil standard of proof on a balance of probabilities. 30        Thirdly, as this court observed inRe Lim Cheng Peng[1987] SLR 486(at 488, [15]) “[t]he court may order restoration ‘if it thinks fit’” and, in the result, “[a] discretion is conferred by the legislature, which must of course be exercised judicially”. This leads to a closely related point. 31        Fourthly, the broad language utilised in s 102(1) of the Act is appropriate inasmuch as it is consistent with the inherent nature of the application in general and the corresponding decision by the court in particular. Put simply, the outcome of such an application isnecessarily dependent on the precise facts of the case itself. Prior precedents (of which there are, in any event, a dearth because such applications are, by their nature, rare in the first instance) are of assistance only to the extent that they enunciate general principles that are relevant to all applications. What must, however, be avoided is the temptation to follow theend resultof a prior decision whosestarting pointwasdifferent, owing to a different factual matrix. This would also signal to potential applicants the need for the assessment of theuniquecircumstances of their respective situations in relation to the applicable general principles, rather than a blind reliance on theend resultin prior decisions without more. This would, in turn, result in a more realistic assessment of the potential success of the application; it would also simultaneously encourage realistic applications and (correspondingly) discourage unrealistic ones. 32        Fifthly, as this court observed inRe Lim Cheng Peng([30]supraat 488, [15]): The court may order restoration ‘at any time’. There is no stipulation as to the period of [time] that must elapse between the date of the order striking the solicitor off the roll and the date of his application for replacement on the roll. 33        This point has since been clarified, in a more specific vein. As was recently observed by this court in its recent decision inGlenn Knight([15]supraat [11]–[12]): Although s 102 does not provide that a minimum period of time should have elapsed before an applicant may seek to be restored as an advocate and solicitor, it is a well-established rule thata significantly longer period than five yearsshould have passed before he should consider making such an application:Re Chan Chow Wang[1982-1983] SLR 413;Re Lim Cheng Peng[1987] SLR 486;Re Nirmal Singh s/o Fauja Singh[2001] 3 SLR 608(“Re Nirmal Singh”); andRe Gnaguru s/o Thamboo Mylvaganam[2004] SGHC 180. Thereasonfor this rule is that under s 83(1) of the [Act], the maximum period for which a lawyer may be suspended is five years, and a striking off should normally be more serious than a suspension. The courts have accordingly held that while an application for restoration to the roll might be made at any time, such an application would not be entertained unless it was made after a period significantly longer than five years from the time when the applicant was struck off the roll. He or she ought not to be placed in substantially the same position as one who has been suspended for the maximum period of five years under s 83(1) of the [Act]: see [13] ofRe Nirmal Singh. [emphasis added] We agree that nofixedtime frame ought to be stipulated simply because, as emphasised in our preceding observation, each case must necessarily turn on its own facts (see generally below at [56]–[59]). We are, however, generally of the view that an applicant will not (absent the most exceptional and/or egregious circumstances) be prevented from ever being restored to the roll; as this court observed inRe Chan Chow Wang[1982-1983] SLR 413(at 414, [6]): In principle, sentences of exclusion from the legal professionneed not be exclusive forever.[emphasis added] 34        Sixthly, whilst we are of course not bound by observations from both the Attorney-General as well as the Law Society, their views would clearly be a factor that the court would take into account in arriving at its decision. Indeed, in this regard, we agree with Mr Low that pursuant to s 38(1) of the Act, the Law Society is, in summary, one of the guardians of the legal profession; that particular provision itself reads as follows: Purposes and powers of Society 38.—(1) The purposes of the Society shall be — (a)        to maintain and improve the standards of conduct and learning of the legal profession in Singapore; (b)        to facilitate the acquisition of legal knowledge by members of the legal profession and others; (c)        to assist the Government and the courts in all matters affecting legislation submitted to it, and the administration and practice of the law in Singapore; (d)        to represent, protect and assist members of the legal profession in Singapore and to promote in any manner the Society thinks fit the interests of the legal profession in Singapore; (e)        to establish a library and to acquire or rent premises to house the library, offices of the Society or amenities for the use of members; (f)        to protect and assist the public in Singapore in all matters touching or ancillary or incidental to the law; (g)        to make provision for or assist in the promotion of a scheme whereby impecunious persons on non-capital charges are represented by advocates; (h)        to grant prizes and scholarships and to establish and subsidise lectureships in educational institutions in subjects of study relating to law; (i)         to grant pecuniary or other assistance to any association, institute, board or society in Singapore in the interests of the profession of law or of students for that profession; (j)        to afford pecuniary and other assistance to members or former members and to the wives, widows, children and other dependants, whether of members, former members or deceased members who are in need of any such assistance; (k)        to promote good relations and social intercourse among members and between members and other persons concerned in the administration of law and justice in Singapore; and (l)         to establish and maintain good relations with professional bodies of the legal profession in other countries and to participate in the activities of any international association and become a member thereof. 35        In this regard, we would therefore like the Law Society, henceforth, to not merely register whether or not it has objections to the application but to also furnish us thereasonsas to why it has adopted that particular position. 36        As we have mentioned, the Attorney-General’s views are also relevant; indeed, as this court observed inGlenn Knight([15]supraat [36]): This court must … consider the submissions of the Attorney-General carefully as he is charged with the duty of safeguarding the public interest. 37        We should also like to observe that the successful restoration of an advocate and solicitor to the roll has almost invariably been accompanied by a situation where both the Law Society as well as the Attorney-General have not objected to the application (see, for example,Re Lim Cheng Peng([30]supra)). 38        We turn now to two further factors (in effect, the seventh and eighth by way of general observations and principles hitherto made) that are often pivotal to applications of this nature. These factors correspond totwo broad areas of focus –bothof which areequallyimportant. Indeed, both interact – and are integrated – with each other. Both (in particular, the second) deserve more detailed elaboration. 39        The first is the focus on theapplicanthimself or herself. More specifically, the issue is whether or notthe applicant has demonstrated, through his or her conduct and actions during the interim period, that he or she has been fully rehabilitated and is now a fit person to be restored to the roll. Or is it likely that the applicant might, on the contrary, lapse into the same (or similar) conduct that resulted in he or she being struck off the roll in the first instance? In this regard, both the objective evidence of what he or she has been involved in during the relevant period (between being struck off the roll and applying for restoration to the roll) as well as references (particularly from members of the legal fraternity) would constitute the best evidence as to whether or not the question just posed ought to be answered in the affirmative. The categories of evidence are, of course, not closed and would include evidence of the applicant’s medical condition (in particular where it is alleged that the applicant is suffering from a medical condition that renders him or her unfit for practice, albeit through no fault of his or her own: see, for example, the decision of this court inRe Ram Kishan([28]supra). This particular consideration is, in many ways, a threshold one because if, for example, the applicant might lapse back into the same (or similar) conduct that resulted in he or she being struck of the roll in the first instance, then it is clear beyond peradventure that the applicant cannot be restored to the roll. It is important to note, at this juncture, that this (first) focusoverlapswith one key element of the second inasmuch as that in so far as the applicant is found to be fully rehabilitated and is now fit to be restored to the roll, tothatextent there isno likelihood of danger of any harm to the wider public. However, as we shall see, the second focus encompasses other elements as well. We return to the first focus, as this court observed inRe Chan Chow Wang([33]supraat 414, [6]): On the other hand, the court has a duty to perform to the suitors of the court and the profession of the law to take care that those who are readmitted to it are persons on whose integrity and honour reliance may be placed. The court shouldalso, in the public interest, on all the material before it be satisfied that the applicantis not likely to repeat the same offence or any other offence of a similar nature in the discharge of his professional dutiesbefore restoring him to the Roll. [emphasis added] 40        The second broad area of focus is on thepublic interest, which, as Prof Tan has aptly pointed out, “stands at a premium” (see Tan ([29]supra) at p 101).In this regard, thekey considerationsor elementsare, respectively, theprotectionof the publicand public confidenceinthe general reputation of the legal profession. This particular area of focus is broader than the first inasmuch as it extends beyond the applicant’s own circumstances and personal situation. It is, perhaps, best encapsulated in the following observations by L P Thean JA in a decision of this court inRe Nirmal Singh s/o Fauja Singh[2001] 3 SLR 608(at [19]–[20]): In exercising its powers under s 102 of the [Act], the court must consider as its primary duty the protection of the interests of the public and the profession as a whole over the interests of the applicant. In Re Ram Kishan… Yong Pung How CJ said at p 533: In taking out his application for replacement, the onus will be on [the applicant] to convince a court of three judges that he is still a person on whose integrity and honour reliance may be placed.In exercising its judicial discretion as to whether or not to replace the name on the roll, the court of three judges must consider as its primary duty the protection of the interests of the public and the profession as a whole over and above the interests of the applicant. The application of a person who has previously been struck off the roll for grossly improper conduct must necessarily be subjected to stricter scrutiny than that of a new entrant to the profession who has no adverse record.Unless the court is completely satisfied on all the material before it that there is no likelihood that the applicant will repeat the same offence or any other offence of a similar nature in the discharge of his professional duties, and that he is now deserving of re-admission to an honourable profession, the court should not replace his name on the roll. In thefinal analysis, the question was really whether or not,on all the materials available before the court, the applicant could be said to be one who was fit to have his name restored on the roll. The court must be every bit as jealous ofthe honourof those admitted to the Singapore legal profession as a man is of his ownreputation, forthe integrity of the professionis [dependent]whollyonthe character and virtueof its members. At the same time, we must be conscious ofthe ever-compelling need to protect the public from errant lawyers and the serious harm which such lawyers could inflict on the publicandthereputation of the legal profession. [emphasis in italics and bold italics added] 41        It is important to emphasise that whilst the possible (andspecific)harmwhich might be caused tothe publicis clearly a factor that must be considered, this is (as already mentioned above)related, in point of fact, to the issue as to whether or not theapplicantis sufficiently rehabilitated and therefore has ceased to pose a danger to the public in this particular respect.However, this factor is, as alluded to above,but oneof thetwoelementsof public interestwhich this court must consider. There is afurther(andsecond) element that has been captured – to some extent – in the last part of the quotation in the preceding paragraph. This relates tothe need to maintain public confidence in the general reputation and standing of the legal profession. Put simply, would the restoration of the applicant concerneddiminish public confidence in the general reputation and standing of the legal profession? Anegativeanswer to this question is, in our view, necessary before the applicant can be restored to the roll. In other words, the fact that the applicant can demonstrate to this court’s satisfaction that he or she has repented fully and will not commit the same (or a similar) disciplinary infraction again is a necessary,but not sufficient, condition for restoration to the roll. This was why although Mr Low stressed throughout the hearing before us that this particular requirement had been satisfied (a point which we need not decide for reasons that will be apparent in a moment), we were of the view that this was not sufficient – in and of itself. To this end, we emphasised at the hearing itself thatthe seriousness of the offence which led to the Applicant being struck off the roll in the first instancewas also an important consideration. This is related to the need to maintain public confidence in the general reputation and standing of the legal profession. That this is indeed the approach that ought to be adopted was emphasised very recently by Chan Sek Keong CJ in this court’s decision inGlenn Knight([15]supra), where his Honour made the following (and crucial) observations (at [43]): [W]e would like to emphasise that we havenotlaid downa general principlethat if an advocate and solicitor has beendisbarred for any particular lengthy period of time, say ten years and longer, he willautomatically be entitledto be restored to the rollifhe has asubsequent blemish-free history andreceivesthesupportofprominent members of the legal community. Each case must be decided on its own facts. One of the most important considerations must be the nature of the transgression that had resulted in his disbarment in the first place.The transgression, in terms of its criminality and its gravity, will invariably feature prominently in the court’s assessment of the adequacy of the period of time that has lapsed since the applicant has ceased practice. But equally, if not more, important would be its effect or potential effect on the integrity of the courts and the administration of justice. Every advocate and solicitor is an officer of the court and a serious failure to support and uphold the administration of justice cannot be lightly papered over notwithstanding the passage of time. It is not possible to enumerate all the material factors.Indeed, as a matter of principle, it is possible that the transgression of the advocate and solicitor could result in his being disbarred for a very long time (although we hope that this would be rare) if the nature of his misconduct shows he does not deserve to be restored to the roll. [emphasis added] 42        There are, in fact, many possible offences that may result in an advocate and solicitor being struck off the roll. Indeed, as Chan CJ has emphasised in the observations just quoted, it is impossible to even begin to attempt to enumerate the various permutations. However, one thing is abundantly clear: Each offence oftendiffersinseriousnessfrom the other. In other words, there are certain offences which are less serious but which nevertheless meet the threshold requirement that will result in the advocate and solicitor concerned being struck off the roll. On the other hand, there are other offences which are far more serious and which,a fortiori, result in the advocate and solicitor concerned being struck off the roll. In so far as theinitialdisciplinary proceedings are concerned, therefore, theresult(viz, the striking off the roll) is thesame. This is, in logic and principle, not surprising, for this is the harshest sanction that can be meted out by this court. 43However, it is clear, in our view, that in so far as theapplication for restoration to the rollis concerned, the situation isquite different. Atthisparticular juncture, thedifferenceinseriousnessof the respective offences that led to the advocate and solicitor being struck off the roll in the first instanceisrelevant – and may even (as in these proceedings) be decisive. In our view, such an approach is both logical as well as principled. In the present proceedings, however, Mr Low appeared to be arguing that there ought to be ablanketrule to the effect that once it can be demonstrated that the lawyer concerned is unlikely to commit the same (or a similar) offence, he or shemustbe restored to the roll. We must reject this argument. 44        As we have been at pains to point out, whilst the factor Mr Low just raised is a relevant one (which has, in fact, already been referred to above (at [39]), it isnottheonlyone; indeed, itcannotbe the only factor. This is because, as we have already emphasised above, the offences for which an advocate and solicitor can be struck off the roll might differ (on occasion,greatly) inseriousness. To accede to the blanket rule just mentioned would mean that an advocate and solicitor who was struck off for committing an offence that was extremely serious would (indeed, must) be treated in thesamemanner as an advocate and solicitor who had committed a much less serious offence (but which nevertheless merited the court in striking him or her off the roll) – provided it can be demonstrated to the court’s satisfaction that he or she will not commit the same (or a similar) offence again. Indeed, it is, in the nature of things, probable that an advocate and solicitor who has committed an extremely serious offence is less likely to commit the same (or a similar) offence again. At the very least, he or she is no more likely to commit the same (or a similar) offence compared to another advocate and solicitor who has committed a less serious offence. More importantly, theseriousnessof the offence committed by the advocate and solicitor in question has, in our view, a significant effect onthe general standing and reputation of the legal professioninthe eyes of the public. It bears repeating that we are here concerned with thelegitimacyof the legal professionfrom the public perspectiveand, to this end, treatingalloffencesalike,regardlessof theseriousnessassociated therewith (save only that the advocate and solicitor concerned can demonstrate to the court’s satisfaction that he or she is not likely to commit the same (or a similar) offence in the future) wouldnot meet this concern. Put simply, if an advocate and solicitor who has a committed aparticularly seriousoffence is treatedno differentlyfrom one who has committed amuch less seriousoffence (with both, conceivably, being entitled to be restored to the roll within roughly the same time frame), thepublicwould – and with good reason – wonder whether their interests were being taken into account in a serious and meaningful way.Indeed, the natural public expectation would be that an advocate and solicitor who has committed a particularly serious offence would have to wait a longer period to be restored to the roll compared to one who had committed a less serious offence, regardless of whether or not the same (or a similar) offence was likely to be committed in the future.We would go so far as to say that this would be an expectation held byallconcerned (including those within the legal profession itself)simply because it accords with logic, common sense and justice. 45        Put simply, the key question amounts to this: What kind of lawyer would this court be prepared to hold out to the public as being qualified both professionallyas well asethically to serve them? In a similar vein, Sir Thomas Bingham MR (as he then was) observed, in the English Court of Appeal decision ofBolton v Law Society[1994] 1 WLR 512 at 519 that “the essential issue” is “the need to maintain among members of the public a well-founded confidence that any solicitor whom they instruct will be a person of unquestionable integrity, probity and trustworthiness”. 46        Bearing the above principles in mind, let us turn now to the relevant facts in the present proceedings.",
        "Our decision": "47The interval between the date the Applicant was struck off the roll and the date of his application for restoration was nine years and six months. This is,prima facie, significantly longer than the five-year period mentioned earlier. More importantly, however, we should look at the two broad areas of focus turning on the public interest. Before proceeding to do so, we nevertheless note one other factor: that whilst the Law Society did not object to the present application, the Attorney-General (as we have already noted above) did. As the content of the Attorney-General’s objection has a bearing on the broad areas just mentioned, we will deal with it at the appropriate junctures. 48        Turning, then, to the question as to whether the Applicant is likely to commit the same (or a similar) offence again, even if we assume that this is in fact not the case, as we have already emphasised above, this is – and cannot be – the end of the inquiry. We need also to examine theseriousnessof the offence itself. Here, unfortunately, we found the application to be wanting. This also constituted the nub of the Attorney-General’s objection. As Ms Thean put it in her written submissions on behalf of the Attorney-General to this court, the Applicant was convicted of an offence that “went to the heart of the administration of justice”. The fact that the Applicant did not benefit from it did not in any way diminish the seriousness of the offence itself. Indeed, as she also points out, “[i]ts seriousness is reflected in the High Court’s decision to enhance the initial 5 month sentence to a substantial term of 12 months’ imprisonment upon his [the Applicant’s] appeal against his conviction and sentence”. In this regard, we are in fact mindful of the observations by Yong CJ quoted at [7] above. 49        We agree with the Attorney-General’s characterisation of the offence committed by the Applicant. The Applicant was, in effect, attempting to interfere (and, if successful, would have interfered) with the administration of justice. And, as Yong CJ pointed out, the Applicant ought, as a then senior and experienced member of the Bar, to have known better. The offence was therefore serious not only in itself but also cast a pall upon the administration of justice. Indeed, there has, to the best of our knowledge, not been a similar case like this before – or since. At this juncture, it is important to remind ourselves of thedeclarationwhich each lawyer makes when admitted as an advocate and solicitor of the Supreme Court. The declaration is to be found in s 24 of the Act, as follows: Declaration, duty and roll 24.—(1) Every person admitted as an advocate and solicitor of the Supreme Court shall make the declaration set out in subsection (2). (2)        Subject to any necessary modification to conform to the religious beliefs of the applicant for admission, the declaration shall be in the following form: “I, A.B., do solemnly and sincerely declare (and swear) that I will truly and honestly conduct myself in the practice of an advocate and solicitor according to the best of my knowledge and ability and according to law. (So help me God)”. [emphasis added] 50        It is a solemn declaration which, though outwardly simple, is pregnant with meaning. It is a declaration by the lawyer concerned that he or she will not only exercise his or her professional knowledge and skills to the best of his or her ability as well as according to law, but (and more importantly) that such knowledge and skills will be exercised “truly and honestly”. This signifies not merely a duty to oneself and to one’s client, but also to the court and to the attainment of justice and fairness generally. Indeed, the pursuit and attainment of justice and fairness is central to one’s role as an advocate and solicitor. Any conduct which sullies such an ideal not only damages the reputation of the lawyer concerned but (more importantly) constitutes a blow against this ideal – especially in the eyes of the public. This ideal is a very real one; as was observed by this court inLaw Society of Singapore v Tan Buck Chye Dave[2007] 1 SLR 581(“Dave Tan”) (at [14]–[16]): [I]t is true, as we shall elaborate upon below, that there are strong mitigating factors that operated in the respondent’s favour. However, thevery natureof the professional misconduct involved in the present proceedings is serious. It goes not only to the lawyer’s own honour and integrity as viewed on anindividualbasis but also has broadersocietalimplications as well. In the oft-cited words of Yong Pung How CJ, delivering the judgment of the court in the Singapore High Court decision ofLaw Society of Singapore v Ravindra Samuel[1999] 1 SLR 696(at [11]–[12]): … It is not simply a question of punishing the solicitor concerned. A further consideration must be what course should the court take to protect the public and to register its disapproval of the conduct of the solicitor. In the relevant sense, the protection of the public is not confined to the protection of the public against further default by the solicitor in question. It extends also to the protection of the public against similar defaults by other solicitors through the court publicly marking the seriousness of what the instant solicitor has done. The orders made must therefore accord with the seriousness of the default and leave no doubt as to the standards to be observed by other practitioners. In short, the orders made should not only have a punitive, but also a deterrent effect. There are also the interests of the honourable profession to which the solicitor belongs, and those of the courts themselves, to consider. The administration of justice can only proceed on the basis that solicitors can place reliance upon the honesty of the solicitors with whom they deal. The public too must be able to repose confidence in a profession which plays so indispensable a part in the administration of justice. Similarly, the courts of this country must be able to depend on the honesty and integrity of all practitioners appearing before them and to expect that they will maintain the highest standards of personal honesty and integrity in their dealings with the courts. It is not surprising that the observations quoted above have been cited so many times simply because, as this court pointed out inLaw Society of Singapore v Ong Ying Ping[2005] 3 SLR 583(at [63] and [64]): There is, in fact, an inherent, irreducible and non-negotiable public interest in the administration of justice in its multifarious forms(see also generally Tan Yock Lin, “Sentencing for Legal Professional Misconduct” (2000-01) 21 Sing L Rev 62). Should the fabric of the system of justice be torn (worse still, rent apart), the entire fabric of society itself will suffer as a consequence. The public institutions which constitute the foundation of the system of justice (and thisincludes, inter alia,the legal professionand the prisons, both of which were directly and adversely impacted in the present case) constitute not only an extremely important part of the basic structure of society but also simultaneously contribute to the stability and positive growth of that structure itself. All this necessarily entails ensuring that the integrity of the above-mentioned institutions which aid, as pillars, in facilitating the administration of justice is not sullied, tainted or undermined in any way. To this end, any misconduct, such as that perpetrated by the respondent in the present proceedings, can only undermine the system, not merely with regard to the specific situation concerned, but also with regard tothe very integrity as well as perception of the institution itself. [emphasis added in bold italics] The practice of law is not merely a business, although, on a practical level, it is undoubtedly the case that it is simultaneously a form of livelihood. It is also a noble calling that, in the final analysis, serves the public. The legitimacy, therefore, of the profession in the eyes of the public is of the first importance. Professional misconduct, such as that which exists in the context of the present proceedings, undermines this legitimacy. As this court observed inLaw Society of Singapore v Ahmad Khalis bin Abdul Ghani[2006] 4 SLR 308at [81]: … But does the legal profession deal only with the lowest common denominator? Put simply, is a solicitor’sprofessionalismowedonlyto those who have entered into a retainer with him or her? Is the legal profession a place where only economic pragmatism holds sway? This surely cannot be the case. The profession is a noble one – one that exists to serve the ends of justice and fairness. The cynicism that existsvis-à-visthe legal profession (unfortunately, across jurisdictions) is due precisely to the gap between ideal and actuality, especially in the eyes of the public. If the conduct of the “black sheep” in the profession results in the failure to attain the ideal of justice and fairness and, on the contrary, results in the precise opposite, this does not demonstrate the elusiveness of the ideal, still less that it is unattainable. In so far as the practice of the law is concerned, the ideal (of justice and fairness) is the actuality – andvice versa. There ought to be no dichotomy or schism between the two. There will always be a gap between ideal and actuality in the real world caused by those who do not hold fast to the highest standards of professional conduct required of them. But the numbers of such errant lawyers must be kept to the barest minimum possible. In this regard, we are heartened to note that there are lawyers who are to be found on the other end of the spectrum. They demonstrate that the ideal is not only attainable, but (in some instances) actually go beyond it. For example, they extend help to their clients beyond the boundaries of their respective retainers. Some go further: They engage inpro bonolegal work, helping those who would otherwise (for one reason or another) fall between the legal cracks. Such lawyers epitomise what is best and noblest in the profession. It is our hope that an ever-increasing proportion of the profession will be identified along these lines. In this regard, legal ethics starts, as it were, at home. Hence, we hope that the local law schools will inculcate, within their students, not only a passion for legal learning and its application, but also a deep and abiding sense of legal ethics. In this, the mission must be all-encompassing. We have in mind, in particular, not only the institutions which train lawyers for practice but all educational institutions that teach the law. This includes the training of para-legals as well. All these institutions constitute “law schools”, looked at from this broader perspective. Acultureof ethics and service must be developed. It is not an optional extra; it goes to the very heart of the law and of its practice. [emphasis in original] [emphasis in original] Prof Jeffrey Pinsler, in his seminal work,Ethics and Professional Responsibility: A Code for the Advocate and Solicitor(Academy Publishing, 2007), also aptly observes thus (at paras 01-108–01-109): The oath binds the person taking it for the entire length of his career, although the number of disciplinary actions taken against advocates and solicitors may indicate that it has too often been honoured in the breach. Three phrases ring out: “truly and honestly conduct myself”; “according to the best of my knowledge and ability”; and “according to law”. Referring to the oath that they had just taken, the Chief Justice, in his address to newly admitted advocates and solicitors on 20 May 2006, said: Bear in mind always that a lawyer’s first and foremost duty is to uphold the principles of honesty, integrity and professionalism. This is reflected in the oath that you have just taken this morning … . 51        Nevertheless, it is also true, as we pointed out inDave Tan(at [17]) that the interests of the lawyer cannot be ignored. However, despite the unusual circumstances and the sympathy we had for the Applicant, we were of the view that the present application was premature. We do note that the Applicant did tender to us a number of references – including at least four from senior members of the Bar (including two Senior Counsel). Nevertheless, we note that the last-mentioned references dwelt more on how the Applicant had already been amply punished. As we have pointed out above (at [26]), no issue of punishment can – and ought to – arise in applications of this sort in any event. More importantly, however, as this court explained inGlenn Knight([15]supraat [43], and see [41] above), such support, whilst a factor which we would obviously take into account, was not one that could overcome the factor relating to the seriousness of the offence referred to in the preceding paragraph (where, of course, the references concerned are not even helpful to begin with, that is the end of the matter: see, for example, this court’s decision inRe Gnaguru s/o Thamboo Mylvaganam[2004] SGHC 180). Indeed, the Applicant, in his submissions to us, sought to paint himself as, in effect, being a mere “conduit-pipe” for his client. We are unable to accept this facile explanation, especially since the Applicant was, at the material time, a senior and experienced lawyer. In any event, we take this opportunity to emphasise that an advocate and solicitor is not a mere “legal mercenary” or “hired gun”. Such a conception of the lawyer and legal practice is the very antithesis of the duty and ideals we have just set out above. It is a conception that is not merely impoverished; it technically encompasses a value, but one which is, in effect, a “non-value”. Embrace of it ensures that legal practice centres (if at all) merely on materialistic concerns and/or personal pride as well as personal aggrandisement. 52        We would now like to refer to our recent decision inGlenn Knight– in particular, why the situation in that case was so different from that in the present. It will be recalled that in that case, the advocate and solicitor concerned was restored to the roll. However, the applicant in that case had applied to this court for restoration to the roll aftermany years, and certainly for a significantly longer time compared to the application in the present case– specifically, it had been some12 years and eight monthsbetween the time he had been struck off the roll and the date of his application for restorationand 16 yearssince he had ceased duties as the Director of the Commercial Affairs Department (“CAD”). 53        More importantly, the applicant inGlenn Knighthad been convicted of a much less serious offence. He had been charged (in 1991) with,inter alia, having committed an offence under s 6(c) of the Prevention of Corruption Act (Cap 241, 1970 Rev Ed). He pleaded guilty and was convicted and sentenced to one month’s imprisonment. His sentence was, in fact,reducedonappealto one day’s imprisonment and a fine of $10,000 (or in default four months’ imprisonment). Disciplinary proceedings were subsequently brought against him and he was struck off the roll. As this court aptly observed (inGlenn Knightat [6]): Although the offence for which the Applicant had been convicted was not at all connected with the discharge of the Applicant’s professional duties as an advocate and solicitor, the court was of the view that it was inexcusable that the Applicant should have become a perpetrator of a crime of deceit when he was, at the time of the offence, charged with the responsibility of overseeing the investigation and prosecution of commercial crimes as Director of the CAD, a position of not inconsiderable significance within the legal profession and one which frequently placed the Applicant in the public eye. 54        Indeed, it was precisely because of the position held by the applicant at the time he committed the offence that an especially strict view was taken of his conduct. This also reminds us, once again, that the public interest (especially in so far as the general standing and reputation of the legal profession is concerned) is paramount. It should also be noted, at this juncture, that the applicant was also convicted of various offences under ss 403 and 408 of the Penal Code (Cap 103, 1970 Rev Ed) in 1998; however, “it was not disputed that these offences arose out of the [a]pplicant’s dealings prior to 1991, while he was still the Director of the CAD” (seeGlenn Knightat [21]). Nevertheless, this court also proceeded to observe thus (at [41]): Given the relatively small amount of money involved (and in the case of the car loan, that he hadmisusedrather thanmisappropriatedit, and that he had fully repaid it), the Applicant, in our view, had already been adequately punished for the offences he had committed. [emphasis in original] 55     Finally, it is significant, in our view, that there were no objections from both the Attorney-General and the Law Society in that case (seeGlenn Knightat [32]). 56        However, and returning to general principles, as has been observed above (at [33]), this does not mean that applicants willnever(absent the most exceptional and/or egregious circumstances) be restored to the roll. In this regard, the court itself cannot commit itself to a fixed time frame in advance, simply because the situation will change over time. Indeed, in the interim period, the applicant might conduct himself or herself in a manner that renders it impossible for the court to consider it appropriate to restore him or her to the roll (and see, for example, the Australian High Court decision ofIncorporated Law Institute of New South Wales v Richard Denis Meagher(1909) 9 CLR 655). Everything, as we have already emphasised, would depend on the precise factual situation at the material time. Nevertheless, we are of the view that, as a rough guideline only, the more serious the offence, the lengthier the period that must elapse between the time the applicant has been struck off the roll and the date of restoration to the roll. 57        In fairness to the Applicant, however, whilst we cannot (as we have just pointed out) obviously commit ourselves to an appropriate time at which a fresh application may be made to the court, some rough indication might not be inappropriate. Given all the circumstances, and assuming that the situation does not change for the worse, we would have thought that an appropriate juncture for a fresh application might be five years from now. We would, in this regard, emphasise, once again, the seriousness of the offence the Applicant had been convicted of and which constituted, in substance and effect, an attempt to interfere with the course of justice. However, two caveats are necessary even as this rough indication is given. 58        This first caveat is that this doesnotconstitute a promise or commitment from the court that a fresh applicationwillbe successful. It is necessary to emphasise thiseven iftheApplicant’sindividual position hasnot changed, simply because thebroader contextwill need to be taken into account as well at the time the fresh application is considered – given the fact that thepublic interestis an overriding factor. It is inadvisable to predict what the ethical ethos will be like in the legal profession in the future. We would hope that it would be better. However, the legal profession, whilst having a value system of its own, is inextricably linked or connected to the wider society it serves (and whose views and expectations are therefore also relevant); each has an impact on the other and, hence, the difficulty in predicting the state of the ethical ethos in the legal profession at any given point in the future. 59        The second caveat is that we must emphasise an obvious point once again – simply because it is of the first importance.Each application must be decided on its own facts. Indeed, in this particular area, it is especially needful to stress that the precedent value of prior decisions of this court is of minimal value – save in so far as they raise or discussgeneralprinciples. At the end of the day, the court must be satisfied, on the standard of proof set out at [29] above, that the applicant will be true to the declaration (which has been set out at [49] above). 60        We would also add that even if an applicant is successful in his or her application to be restored to the roll, the court can, in certain circumstances, impose necessary and appropriate conditions before it restores the applicant to the roll.",
        "Conclusion": "61As we have noted in detail above, the Applicant was convicted of a very serious offence which was not only committed in the course of performing his duty as an advocate and solicitor but which also, as the Attorney-General has pointed out (as mentioned at [12] above), “went to the heart of the administration of justice”. 62        After having carefully considered all the factors in favour of the Applicant, we arrived at the conclusion that they were, nevertheless, clearly outweighed by the grave nature of the offence which the Applicant was convicted of, and which led to his being struck off the roll. 63        In the circumstances, we were of the view that the present application was premature and apossible(and we put itno higherthan that) indication of an appropriate time for another application might be five years from now. We therefore dismissed the application, with costs to the Attorney-General’s Chambers. As it expressly stated that it was not seeking costs, we made no order as to costs in so far as the Law Society was concerned."
    }
}