{
    "case_title": "Tay Eng Chuan v Ace Insurance Ltd",
    "ncitation": "[2007] SGHC 212",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       The plaintiff, a professional engineer since 1982 and a remisier since 1988, acted in person in these proceedings. He commenced this Originating Summons (“OS”) seeking the following: (a)    that pursuant to the note, “it remains open to Applicant to argue that his right to maintain an action in law in the courts survive the extinction of the right to proceed by way of arbitration”, entered by the Honourable Justice V K Rajah at Page 5 of the Notes of Argument dated 30 March 2007 for the Originating Summons No. 2254 of 2006/A and pursuant to the insurance policy Double Guarantee Protector Policy No. SMXXX-XXXX85, the plaintiff be allowed to proceed by way of an action in law in this Honourable Court to claim from the defendant the insurance benefit under the said insurance policy for the loss of sight in his left eye caused by an accident on 12 November 2002; (b)    that pursuant to the said insurance policy, the defendant do pay the plaintiff the sum of $300,000 being the insurance benefit for the loss of sight in the plaintiff’s left eye caused by an accident on 12 November 2002; (c)    that the defendant do pay the plaintiff interest on the said sum of insurance benefit at the rate of interest pursuant to Section 12 of the Civil Law Act (Cap 43) or such other rate of interest as this Honourable Court deems just and for the period of time from the date in 2003 when the defendant was informed by their medical experts that the plaintiff’s left eye is completely blind by legal definition to the date the said sum of insurance benefit is paid or such other period of time as this Honourable Court deems just; and (d)    that the costs of this application and such further or other relief to be ordered as this Honourable Court may deem fit. 2       In turn, the defendant took out SUMS 2829 of 2007 (“the SUMS”) for an order that: 1       the plaintiff’s Originating Summons filed on 6 June 2007 be struck out under Order 18, rule 19(1)(a), (1)(b), (1)(d) and (3) of the Rules of Court (Cap 322) and/or under the inherent jurisdiction of the Court; 2       the costs of this application to be paid by the Plaintiff to the Defendants forthwith; and 3       such further or other orders and/or relief as this Honourable Court deems fit. It was stated in the SUMS that the ground for prayer 1 therein (to strike out the plaintiff’s OS) was that the prayers sought by the plaintiff in his OS disclosed no reasonable cause of action and that the further grounds for the said prayer 1 were set out in the defendant’s affidavit filed in support of the SUMS. 3       Both the OS and the SUMS were fixed for hearing at the same time on a normal summons hearing day. I granted the prayers sought in the SUMS and dismissed the OS with costs of $3,500 and reasonable disbursements to be paid by the plaintiff to the defendant.",
        "The plaintiff’s case": "4       On 12 November 2002, at about 1pm, the plaintiff was carrying a piece of wire mesh in his house. The wire mesh got caught between the wall and a pipe in the storeroom and hit his left eye. As a result, his left eye bled and he was conveyed to hospital in an ambulance. He had cornea laceration, iris laceration and traumatic cataract in his left eye. An emergency operation was performed the same day. He was subsequently discharged from hospital on 20 November 2002 but was re-admitted from 9 to 12 December 2002 for another operation to remove the lens of the left eye. 5       The plaintiff subsequently submitted claims on his policies with several insurance companies including the defendant. The plaintiff’s claim against the defendant was for the amount of $300,000 as the benefit under the Double Guarantee Protector Policy No. SMXXX-XXXX85 (“the insurance policy”) for the loss of sight in his left eye. A loss adjuster was appointed by the defendant to investigate the claim. The plaintiff was also examined by an eye specialist appointed by the defendant. That eye specialist confirmed that the plaintiff’s left eye was non-functional and was blind according to the World Health Organization definition and legal definition. 6       Two of the insurance companies (AXA and UOI) disputed the plaintiff’s claims. Both disputes proceeded to arbitration in 2003 and in 2004. The plaintiff was successful in the AXA arbitration. AXA applied to the High Court for leave to appeal against the arbitral award but leave was not granted. The UOI arbitration was kept in abeyance by consent to await the outcome of the AXA arbitration. However, UOI subsequently refused to abide by the outcome of the AXA arbitration and the UOI arbitration then proceeded and was concluded at the end of May 2007. 7       In June 2006, the plaintiff commenced an action to claim the benefit under another AXA insurance policy. AXA gave an undertaking to pay him the benefit within 7 days and was ordered by the High Court to pay the plaintiff pre-action and post-action interest on his claim. 8       The defendant admitted liability on 29 July 2003 and paid the plaintiff the Accidental Hospital Income Benefit under the insurance policy. It paid him $3,300 for the 11 days of hospitalization. 9       The insurance policy also provided two other benefits. For “total loss of lens in one eye”, 50% of the sum insured was payable. Similarly, for “total loss of sight in one eye”, 50% of the sum insured was payable. On 11 December 2003, the defendant paid the plaintiff $300,000 (being 50% of the sum insured and payable for the loss of lens in one eye). The defendant wanted him to sign a Discharge Voucher to acknowledge that the said payment was in full and final settlement of the claim in respect of Accidental Disability Benefit and any other benefits whatsoever that may be payable under the insurance policy as a result of the injury to his left eye and that he would waive all claims whatsoever that he might have under the insurance policy at that time. The plaintiff refused to sign the Discharge Voucher as it was clear to him that the defendant was attempting to make him forgo the benefit payable for the loss of sight in one eye. He eventually acknowledged receipt of a cheque for $300,000 from the defendant but wrote on the acknowledgement that he did not accept the contents of the defendant’s solicitors’ letter dated 11 December 2003 (which stated that the payment was in full and final settlement of the defendant’s liability under the insurance policy in respect of the plaintiff’s eye injury). 10     In January 2004, AXA obtained an order of court directing the plaintiff to attend another medical examination by its appointed eye specialist. On 29 January 2004, the defendant’s solicitors wrote to the plaintiff to state that they would review the matter upon receipt of the report on the further medical examination. However, upon receipt of the said report, the defendant did not review the matter but maintained that the $300,000 payment was in full and final settlement of the plaintiff’s claim. 11     On 23 May 2004, the plaintiff proposed that the defendant reconsider the claim after the conclusion of the AXA arbitration and that, if necessary, the dispute be referred to arbitration thereafter. The defendant refused the proposal. 12     As the plaintiff was very busy taking care of the AXA and UOI arbitration proceedings, he did not consider the insurance policy again until November 2006 when he applied to the High Court in Originating Summons No. 2254 of 2006 (“OS 2254”) for an order that the time for commencing arbitration proceedings be extended to 3 months after the conclusion of the UOI arbitration. OS 2254 was heard on 30 March 2007 by V K Rajah J. The learned judge dismissed the plaintiff’s application with costs fixed at $2,500 but added a note in his orders as follows: (Note: It remains open to Applicant to argue that his right to maintain an action in law in the courts survive the extinction of the right to proceed by way of arbitration). 13     As stated above (at [8] and [9]), the insurance policy conferred 3 benefits on the plaintiff. The payment of $3,300 and $300,000 by the defendant discharged its liability in respect of two of them, leaving the third benefit of “total loss of sight in one eye” still outstanding. The “total loss of lens in one eye” benefit covered the physical loss of the lens. The eye may still have functional vision after the loss of the lens. The “total loss of sight in one eye” benefit covered the loss of functional vision of the eye. After the loss of functional vision, the lens in the eye may remain intact. If both functional vision and lens were lost (as in the plaintiff’s case), both benefits for total loss of sight and of lens would be payable. The defendant should have paid the plaintiff the benefit in respect of total loss of sight in May 2003 after the doctors appointed by the defendant certified that the plaintiff’s left eye was non-functional and fulfilled the criterion of “loss of sight” in the insurance policy. Accordingly, the plaintiff sought the payment $300,000 and of interest thereon from May 2003 to date.",
        "The defendant’s case": "14     The defendant argued that the OS here disclosed no reasonable cause of action, was frivolous or vexatious and/or was otherwise an abuse of the process of court. It contended that the plaintiff’s claim was clearly time-barred by virtue of Part 10, clause 7 (under “general policy provisions”) of the insurance policy which reads: 7       Arbitration If any dispute or difference arises between the Company and any of the parties hereto concerning any matter arising out of this Policy, such dispute or difference shall be referred to arbitration in accordance with the provisions of the Arbitration Act, Chapter 10 of Singapore and any statutory modification or re-enactment thereof then in force within three (3) months from the day such parties are unable to settle the differences amongst themselves. Further, Part 9, clause 3 (“claims provisions”) states: 3       Terms and Conditions The due observance and fulfilment of the terms, provisions and conditions of this Policy insofar as they relate to anything to be done or complied with by the Insured Person, the Policyholder and/or the Policy Payer shall be a condition precedent to the liability of the Company to make any payment under this Policy. The dispute arose on 21 May 2004 when the defendant’s then solicitors informed the plaintiff that the defendant maintained that the plaintiff had not suffered from total loss of sight in one eye within the meaning of the insurance policy. The defendant had also relied on Part 1, clause 1(b), a provision qualifying the benefits set out earlier in the main body of clause 1, which states: 1       ACCIDENTAL DISABILITY BENEFIT … and provided that:- … b.      If a Benefit Amount is payable for loss of a whole member of the body, then Benefit Amounts for parts of that member cannot also be claimed. 15     The plaintiff understood that he had failed to comply with the said Part 10, clause 7 when he took out the application in OS 2254 for extension of time to commence arbitration. He did not appeal against the decision denying him the extension sought. 16     The defendant also submitted that the plaintiff ought not to have utilised the originating summons procedure in this case because there was substantial dispute as to the facts. However, this issue was not pursued vigorously. 17     As far as the defendant was concerned, the payment of $300,000 in December 2003 was a full and final settlement of the plaintiff’s claim. In January 2004, as the plaintiff was ordered by the court to attend another medical examination in relation to the AXA arbitration, the defendant decided that it would review the matter upon receipt of the further medical report. The plaintiff agreed to await the said review. 18     The further medical report was received on 13 February 2004. In May 2004, the plaintiff demanded a reply on his claim for total loss of sight in one eye. On 21 May 2004, the defendant replied that it was maintaining its position that the plaintiff had not suffered a total loss of sight in one eye within the meaning of the insurance policy. Medical reports on the plaintiff in May and August 2003 indicated that the plaintiff’s left eye could perceive light and hand movements at a distance of 6 feet although he could not count the number of fingers. The further medical report in February 2004 stated that the plaintiff’s left eye had “counting fingers” vision at a distance of 5 feet. The defendant also relied on Part 1, clause 1(b) in rejecting the plaintiff’s claim. When the plaintiff replied on 23 May 2004 to ask the defendant to reconsider its position after the AXA arbitration, the defendant refused the request. Nothing further was heard from the plaintiff until the service of OS 2254 on the defendant in January 2007.",
        "The decision of the court": "19     Order 18 rule 19 of the Rules of Court (R5, Cap 322) applies to an originating summons as if it were a pleading (see O 18 r 19(3)). 20     The note appended by V K Rajah J (see [12] above) to his orders merely clarified that the learned judge was restricting his decision to the matter directly before him, that is, whether the plaintiff should be given an extension of time to commence arbitration proceedings. The judge certainly did not thereby confer on the plaintiff a right to commence an action in court. The plaintiff still has to persuade the court that he could sue in a court of law in respect of a matter in which he had lost the right to proceed by way of arbitration as a result of non-compliance with the terms of the insurance policy. Prayer (a) of this OS, insofar it relied on the said note, was therefore misconceived. 21     The plaintiff relied on paragraph 20.046 ofHalsbury’s Laws of Singapore(Volume 2) which states: Contractual time bars may apply to bar either the claim or the arbitration. Where a contractual time limit bars only the right to proceed to arbitration, the parties may nevertheless proceed to litigate the dispute in the forum where jurisdiction could be established over the parties. Where the contractual time limit bars the claim in its entirety, a substantive defence accrues in favour of the respondent. Participation in the arbitration is not a waiver of the right to raise time bar as a defence. The jurisdiction of the arbitral tribunal is not affected by reason of a time bar defence. The statement of principle above must be read in the context of the contractual provisions in each case. In the instant case, a claimant under the insurance policy has to comply with the arbitration clause in the event of a dispute with the insurance company. There is a built-in time limit for doing so. The plaintiff accepted unequivocally that he breached the time limit when he took out OS 2254. The extension of time sought was not granted to him. He did not appeal against the decision of V K Rajah J and therefore, in the words of the judge, there was an “extinction of the right to proceed by way of arbitration”. 22     Unfortunately for the plaintiff, compliance with the arbitration clause is a condition precedent to establishing liability on the part of the defendant under the insurance policy (see Part 9, clause 3 at [14] above). Clearly, the dispute arose out of the insurance policy as the parties’ disagreement concerned the issues whether there was a total loss of sight within the terms of the insurance policy and whether the plaintiff could claim for loss of the lens as well as for loss of sight. Since the right to proceed by way of arbitration has been extinguished due to the plaintiff’s inaction, he is unable to lay the foundation for payment by the defendant. It could not sensibly be argued that his failure to comply with the arbitration clause is not fatal to his claim against the defendant because he then has an alternative route by way of legal action in court. The arbitration clause is not an option. It is a mandatory requirement before he can compel the defendant to pay (assuming of course that he succeeds in the arbitration). Put succinctly, “No arbitration, no liability”. 23     Even if non-compliance with a condition precedent would not cause the defendant any prejudice, that is immaterial. The defendant averred that it would suffer prejudice anyway because the plaintiff’s inaction for more than 2 years had caused the case to be treated as closed and no provision has been made for the claim. Further, the arbitration clause could hardly be said to be of such a capricious or unreasonable nature that the court ought not to enforce it. The defendant is entitled to insist on its contractual rights. The plaintiff’s contractual cause of action under the insurance policy has therefore disappeared. 24     The plaintiff argued that the arbitration clause did not exclude nor place any restriction on his right to commence an action in court. The normal limitation period of 6 years for actions founded on contract therefore applied and that period had not expired by the time he took out this OS. He also submitted that there was an inherent conflict between the arbitration clause and Part 10, clause 10 which reads: 10     Legal Action Subject to Clause 7 of this Part, no action shall be brought to recover on this Policy prior to the expiration of sixty (60) days after written proof of claim has been filed in accordance with the provisions of this Policy. Further, the plaintiff argued, Part 10, clause 8 also buttressed his contention that legal action was not barred. That clause provides: 8       Governing Law This Policy shall be governed by and interpreted in accordance with Singapore law. The Singapore courts shall have exclusive jurisdiction. 25     The said clauses 8 and 10 do contemplate the possibility of legal proceedings in court. As the defendant contended, both parties could agree to waive arbitration and refer a question or dispute for determination by the court. Neither party waived arbitration in this case. Further, there could be applications made to the court for interlocutory relief or for leave to appeal against or to set aside an arbitral award pursuant to the Arbitration Act. Arbitration proceedings would still have to take place first. Clause 10, which is subject to clause 7, could cover a situation where the defendant acknowledges liability but is tardy in payment. In such a case, the claimant has to wait 60 days before enforcing payment by action in court. Where court action is permissible, the agreed forum is Singapore and no other court in the world. These clauses do not detract from the fact that where there is a dispute or difference, arbitration is still the mandatory mode of resolution (unless the parties agree otherwise). 26     After the hearing of this matter, the plaintiff wrote to me to present further arguments. He referred to the defendant’s affidavit (at paragraph 31 thereof) where it was stated that the defendant’s first rejection letter of the claim was on 15 October 2003 and argued that the 3-month period to commence arbitration proceedings therefore expired on 15 January 2004. Nevertheless, the defendant wrote to him on 29 January 2004 to state that it would review the matter upon receipt of the further medical report. According to the plaintiff, the defendant had thereby waived the 3-month period for commencing arbitration and it was therefore incorrect to say that the dispute first arose on 21 May 2004. 27     It did not appear that such an argument about waiver was raised in OS 2254. Indeed, the notes of arguments in OS 2254 showed that the judge asked the plaintiff, “When was dispute created?” and he replied, “It should be from the time when Respondent rejected my proposal to arbitrate, ie, May 2004”. The plaintiff went on to say there that he asked for arbitration on 9 May 2004. The defendant’s counsel then confirmed to the judge that the defendant also took the view that a difference arose on 21 May 2004. Negotiations were going on between the parties even after the letter of 15 October 2003. In fact, as mentioned earlier, $300,000 was paid to the plaintiff on 11 December 2003. It is therefore clear from the above that there was no waiver of the time limit for arbitration. 28     In any event, on the facts of this case, it was clear to me that the claim for total loss of sight could not succeed because it would tantamount to double-claiming for the same injury (see Part 1, clause 1(b) at [14] above). Although the $300,000 paid to the plaintiff was for the loss of the lens (a part rather than the whole), he would not be entitled to claim for loss of sight (the whole) as well. It is the reverse situation from that set out in the said clause but the principle involved is the same – an insured cannot also claim for a broken window if he claims for destruction of the entire house. The “whole” here would encompass total loss of sight or loss of the entire eyeball. If the plaintiff succeeds in claiming for total loss of sight, then he must return the money paid for the loss of the lens. Obviously, an insured would claim for loss of the whole rather than the part thereof presumably because the former would entail a larger pay-out but both amounts happen to be the same in the insurance policy here. 29     For these reasons, I granted the defendant’s application in the SUMS and ordered the OS dismissed with costs."
    }
}