{
    "case_title": "Chiam Heng Luan and Others v Chiam Heng Hsien and Others",
    "ncitation": "[2007] SGHC 132",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1These cases concerned the future of the land and premises at No 145 Killiney Road (“the Property”) at which for many years the Mitre Hotel (a small but well-known hotel) (“the Hotel”) was operated. They were heard together as, basically, the reliefs asked for in both actions were the same and both involved exactly the same plaintiffs and exactly the same defendants. 2In the first set of proceedings, OS 830 of 2006 (“OS 830”), the main reliefs asked for were as follows: (a)a declaration that the lease of the first and second plaintiffs’ interest as tenants-in-common of a 40% share in the property at No. 145 Killiney Road (“the Property”) in favour of Mitre Hotel (Proprietors), the eighth defendant herein, has been validly terminated with effect from 31 March 2006 (at the latest) pursuant to a written Notice to Quit dated 7 November 2005; (b)an order that the Property be sold with vacant possession; (c)an order that the first and eighth defendants do deliver up possession of the Property to the plaintiffs within four weeks from the date of the order to be made herein for the purpose of enabling the sale of the property with vacant possession; and (d)an order that paragraphs 4, 5, 6 and 10 of the order of the High Court in Originating Summons No. 582 of 1996 made on 21 August 1996 (and varied on 18 September 1996) (“the Order in OS 582/1996”) shall continue to apply in relation to the present sale of the Property. 3In OS 1918 of 2006 (“OS 1918”) all the reliefs asked for were the same as in OS 830 with the exception of the first two prayers which asked for the following: (a)in the event that the Court in OS 830 rules that the leases of the plaintiffs’ respective interests in the Property in favour of the sixth and seventh defendants (as executors of the Estate of Chiam Toh Say, deceased), alternatively the eighth defendant, have not been validly terminated pursuant to the plaintiffs’ notices to quit dated 7 November 2005 and 24 April 2006, a declaration that the said leases of the plaintiffs’ respective interests in the Property have been validly terminated pursuant to the plaintiffs’ further notice to quit dated 9 October 2006; and (b)further or alternative, a declaration that the sixth and seventh defendants, alternatively the eighth defendant, has forfeited its lease in the Property on account of the following conduct: (1)operating a hotel on the Property without a valid licence; and/or (2)selling liquor on the Property without a valid liquor licence; and/or; (3)operating a private car park on the Property without any proper regulatory/government approvals. 4Although the proceedings were started by originating summons, there was considerable dispute of fact and it was not possible to decide the disputes on the basis of affidavit evidence alone. The matter was heard in open court and the deponents of all the affidavits were cross-examined. On 30 April 2007, I ordered that the Property was to be sold with vacant possession and that the first defendant was to give vacant possession of the Property to the solicitors handling the sale no later than four weeks before the scheduled completion date. I then made various consequential orders relating to the sale but reserved judgment on all other issues. This judgment therefore contains my reasons for the orders that I made and also deals with some of the other issues that were raised during the hearing.",
        "The facts": "5The Property is a fairly substantial piece of land (having an area of approximately 36,429 sq ft) located in a prime area of Singapore. It contains a large double-storey building which was probably built before the second world-war although the exact date of construction is not known. 6Prior to April 1948, a hotel called the “Windsor Hotel” was operated at the Property by the tenants of the then owners, Alkaff Realty Limited (“Alkaff Realty”). In April 1948, the Windsor Hotel was taken over by a partnership (“the original partnership”) comprising various members of the Chiam family and two family friends, John Dalton (“Dalton”) and RA Pranam (“Pranam”). The hotel was renamed “Mitre Hotel” and the same name was given to the firm. The original partnership paid Alkaff Realty a monthly rental of $600 in respect of the Property. This was the same rent as had been paid by the operators of the Windsor Hotel as the Property was subject to rent control. 7One of the original partners was Chiam Heng Luan. He testified that a few months after the original partnership commenced business, at the suggestion of his cousin, Chiam Toh Kai, another partner, four of the partners agreed to purchase the Property from Alkaff Realty. The agreed price was $61,000 and the purchase was completed in August 1948. Chiam Heng Luan was a purchaser but, as he was a seaman, he decided to put his share of the Property in his wife’s name. The co-owners (who hadpurchased as tenants-in-common) were: (a)Mdm Lim Wee Leng (wife of Chiam Heng Luan) – 4/10 undivided shares; (b)Chiam Toh Kai – 3/10 undivided shares; (c)Chiam Eng Aun– 2/10 undivided shares; (d)Chiam Toh Moo – 1/10 undivided share. 8None of the original co-owners is still alive. Their shares in the Property are now held by their estates or their successors and, in the case of Chiam Eng Aun, his interest has been disposed of to third parties. The current legal owners of the Property are as follows: (a)the estate of Lim Wee Leng, deceased, represented by her executors, Chiam Heng Luan and Chiam Ai Thong, who are, respectively, the first and second plaintiffs herein (40% share); (b)Nancy Ng Poh Chuan, third plaintiff (2% share acquired from the successor to Chiam Eng Aun); (c)Teo Soo Swan, fourth plaintiff (1% share acquired from successor to Chiam Eng Aun); (d)Teo Cheng Woon, fifth plaintiff (2% share acquired from the successor to Chiam Eng Aun); (e)Chiam Heng Hsien, first defendant (10% share acquired from his father Chiam Toh Moo); (f)Chiam Siew Juat, second defendant, Chiam Heng Lian, third defendant and Chiam Heng Thoon, fourth defendant, (each of whom is entitled to a 10% share in the Property by virtue of a deed of gift executed by their father Chiam Toh Kai); (g)Ong Soon Yong, fifth defendant (5% share acquired fromthe successor to Chiam Eng Aun); and (h)Chiam Heng Chow and Chiam Heng Tin, the sixth and seventh defendants respectively (who as executors of the estate of Chiam Toh Say, deceased, hold the 10% share that the deceased purchased from Chiam Eng Aun and held on trust for MHP). 9The arrangement between the partners of the original partnership was formalised in a Partnership Deed dated 24 March 1949.Apart from Dalton and Pranam, all the partners were members of the Chiam clan. They were Chiam Heng Luan, Chiam Toh Kai, Chiam Eng Aun, Chiam Toh Moo, Chiam Wee Liang, Chiam Toh Say, Chiam Toh Lew and Chiam Toh Tong. 10On 28 November 1951, the partners agreed to sell the original partnership business as at 30 November 1951 as a going concern to Chiam Toh Say for the sum of $260,000. This decision was subsequently documented in a deed of dissolution dated 26 February 1952 whereby,inter alia, the partners in the original partnership dissolved their partnership (as from 30 November 1951) and assigned to Chiam Toh Say absolutely, their respective shares, title and interest in the original partnership business including the tenancy of the Property and a one-tenth undivided share in the Property. From 1 December 1951 onwards, Chiam Heng Luan, Chiam Eng Aun, Chiam Wee Liang, Dalton and Pranam no longer had anything to do with the business. Chiam Toh Say, however, did not thereafter run the Hotel himself. Instead, the business was taken over immediately by a new partnership (“Mitre Hotel Proprietors”) (“MHP”) constituted between Chiam Toh Kai, Chiam Toh Moo, Chiam Toh Say, Chiam Toh Tong and Chiam Toh Lew. The partners of MHP formalised their relationship in a deed of partnership dated 28 February 1952 which stated that MHP should be deemed to have commenced on 1 December 1951 and would continue for a term of three years thereafter. 11In the deed of dissolution it was stated that the one-tenth undivided share in the Property belonging to the original partnership was to be conveyed to Chiam Toh Say by Chiam Eng Aun who was holding the same in trust for the original partnership. Consequently, on 29 September 1952, Chiam Eng Aun conveyed to Chiam Toh Say one out of his two undivided tenth shares in the Property. Three weeks later, on 21 October 1952, Chiam Toh Say executed a deed wherein he declared that he held that share on trust for MHP and the partners thereof for the time being. In subsequent litigation (Chiam Toh Say v Mitre Hotel[1991] SGHC 132), it was held that Chiam Toh Say also held the tenancy of the Property on trust for MHP. 12From inception of the tenancy right up to 2001, the Property was subject to the provisions of the rent control legislation and therefore the tenancy was a protected tenancy until rent control was abolished. The initial rent was $600 a month but, after a few years, it was increased to $660 a month. Presently, the rent remains at that level. 13MHP ran the Hotel from the time of its formation until it lost its licence to operate a hotel at the end of 2002. MHP had also operated a bar on the premises of the Hotel but its liquor licence ended on 31 December 2003. The partnership did not terminate after three years but is still in existence today. MHP was made the eighth defendant to these proceedings as it continued to assert its right to remain on the Property as a tenant. It appeared from the evidence that very little business is now being carried out by MHP at the Property. Apparently, it only lets out some rooms for functions and short term stays and was at pains to emphasise that no domestic service is provided to the occupants of those rooms. 14Chiam Toh Moo was the managing partner of MHP until April 1956 when Chiam Toh Say took over this position. In the 1970s, Chiam Heng Hsien became the managing partner of MHP, a position that he asserts is still his. For convenience, I shall hereafter refer to Chiam Heng Hsien as CHH. 15Over the years, there were several disputes over the business and the interests of the various parties in the Property and various court proceedings were commenced. Among these was Suit 8593 of 1984 in which Chiam Toh Say sued MHP, CHH and Chiam Toh Kai for,inter alia, a declaration that the tenancy of the Property was vested in him. Chiam Toh Say died before the suit was tried but it was continued by his executors. As far as the tenancy was concerned, the action was not successful since, as I noted above, the court held that Chiam Toh Say held the tenancy of the Property on trust for MHP and not in his own right. 16In 1995, Chiam Ai Thong was offered $45m for the Property. She then made several attempts to persuade the other co-owners to sell it. Whilst initially there was no consensus, eventually most of the co-owners agreed that this would be a desirable course of action. CHH, however, objected strongly to the proposed sale. In 1996, therefore, Chiam Ai Thong and her father, Chiam Heng Luan, filed OS 582 of 1996 (“OS 582”) whereby they asked for an order for the sale of the Property in lieu of partition. CHH opposed the application. The proceedings were heard by Kan Ting Chiu J who made,inter alia, the following orders: (a)the Property be sold in lieu of partition; (b)the Property be sold either with vacant possession (at a reserve price of $72 million); (c)the sale be by way of public tender, which [Chiam Heng Luan and Chiam Ai Thong] shall have conduct of; (d)the parties shall agree on the terms and conditions of sale, failing which these shall be settled by the court; and (e)if the sale is to be with vacant possession, the parties shall agree on a date when vacant possession is to be given. 17The Property was put up for sale by tender in December 1996. Three bids were received for the purchase of the Property with vacant possession at prices ranging between $50m and $73.3m. No bid was received for the purchase of the Property without vacant possession. All of the co-owners, except CHH, decided that one of the bids for purchase of the Property with vacant possession was acceptable. CHH later informed the other co-owners that in order for MHP to vacate the premises, it should be paid $29m. As the other co-owners were not willing to pay this amount (or the reduced amount of $21m put forward subsequently), Chiam Heng Luan and Chiam Ai Thong made an application in OS 582 for an order to compel CHH to deliver up possession of the Property. This application was supported by all the other co-owners apart from CHH. It was, however, unsuccessful. In his judgment dismissing the application (Chiam Heng Luan v Chiam Heng Hsien[1997] SGHC 238), Kan J said: 2.A partnership, [MHP] owns the business of the hotel and the tenancy of the property, which is under rent control. … 4.… [CHH] has twenty-one of the eighty eight shares in the tenancy and a one-tenth share in the property and is on the property because he is managing the hotel. The action is between the owners themselves; the partnership is not a party to it. … 10.I do not think that Order 31 of the Rules of Court can be invoked in the circumstances of this case to compel [CHH] to deliver up possession of the property. He is a partner of [MHP]. If the partnership agrees to give up the tenancy he would lose his right to remain on the property, but while the tenancy subsists, the owners cannot recover possession from him. Order 31 cannot operate against him in his capacity as manager of the partnership business because he is not, in this capacity, a party bound by the order of 21 August 1996. That is so even if he is concurrently a co-owner of the property and is in that capacity a party bound by the order of 21 August. 11.Having obtained the orders allowing the sale the owners have to recover possession from the tenants if they want to sell the property with vacant possession. They can work towards that in two ways. They can negotiate with the partners to vacate the property. If there is any disagreement between the partners themselves over the terms on which they would yield the tenancy, that has to be addressed before they negotiate with the owners. If there is no resolution by agreement, the partners may have to take the ultimate step of dissolving the partnership. The owners can also take legal action to recover possession from the partnership, if there are grounds for them to do that. 18As Kan J pointed out, one of the impediments in the way of recovering possession of the Property was the existence of rent control legislation. This situation changed when rent control was abolished by the enactment of the Control of Rent (Abolition) Act 2001. Until November 2005, however, none of the other co-owners of the Property took any further action to try to recover possession of it. On 7 November 2005, the first and second plaintiffs acting for estate of Lim Wee Leng served a notice to quit on MHP and purported to terminate the lease of the estate’s interest in the Property by giving MHP three months’ notice of termination. CHH responded on behalf of MHP by stating in a letter dated 5 December 2005 that MHP was formed to buy over the ‘Rights of Use’ of the Property when it was purchased and that the ‘Rights of Use’ could not be terminated by notice. The first and second plaintiffs did not accept this contention and took the position that the tenancy in favour of MHP was a periodic tenancy where rent had been paid every quarter, and therefore, one complete period of the tenancy would have expired on 31 March 2006 at the latest. As such, the first and second plaintiffs, considered that as at 31 March 2006, the MHP’s tenancyvis-à-visthe estate’s 40% share in the Property had ended. 19On 25 April 2006, the third, fourth and fifth plaintiffs each served a separate notice to quit on MHP in respect to his or her respective ownership interest in the Property. Each of the notices was dated 24 April 2006 and it gave MHP three months’ notice of the termination of the lease in respect of that plaintiff’s interest in the Property. On the same day, OS 830 was taken out by all five plaintiffs against the defendants claiming,inter alia, recovery of possession of the Property. 20OS 830 was resisted by CHH and by MHP. One of the grounds for resisting it was that the notice period had not expired when the summons was issued. Consequently, on 8 October 2006, the plaintiffs jointly served a further notice to quit on MHP stating that the leases in respect of their respective interests would terminate three months from the date of the notice, alternatively, on the expiration of the next complete period of the tenancy after the date of the notice. The next day, the plaintiffs commenced OS 1918. 21In the meantime, certain defendants to OS 830 had also been taking steps to terminate MHP’s lease. On 2 May 2006, Messrs Gurbani & Co acting on behalf of the second to fourth defendants gave MHP three months’ notice of termination of the lease of their interest in the Property. On 7 June 2006, Messrs T M Hoon & Co acting for the fifth defendant gave a similar three months’ notice of termination of the lease of his interest to MHP.",
        "The positions taken by the parties in the proceedings": "22The basic stand taken by each of the plaintiffs was clear:i.e., that the tenancy of MHP had been terminated either by notice or by breach of the tenancy agreement. The responses of the various defendants were quite distinct. 23CHH speaking for himself and, as managing partner, for MHP, asserted that MHP had a right to continue in occupation of the Property, notwithstanding the repeal of the Control of Rent Act (Cap 58, 1985 Rev Ed) (“the Act”) in April 2001 on the basis that there was an agreement/understanding between the co-owners and the partners for MHP to occupy the Property for its business for as long as it wished to. This took the form of a contractual or equitable licence granting MHP the right to occupy the Property for as long as it wished to. Alternatively, MHP claimed that there was an equity in its favour which had to be satisfied, at the very least, by an award of compensation. 24The second to fourth defendants contended that MHP did not have the right to occupy the Property for as long as it wished whether by virtue of an agreement or by virtue of its conduct over the years. Secondly, they submitted that the notice period of three months given by the various co-owners was a reasonable period of notice to terminate the tenancy. 25The fifth defendant asserted that he had no knowledge of the dealings between the family members who held most of the Property since he was an outsider who had acquired his interest as an investment. He agreed to the sale of the Property. He took no stand on the assertions made by CHH. 26The sixth and seventh defendants were agreeable to the sale of the Property with vacant possession. They did not agree that MHP had either an equitable or a contractual right to remain on the Property for as long as it wished. Whilst they took the position that the various notices to quit were invalid, they were prepared to waive the defects in the notices to quit if fair compensation was paid to MHP. They prayed for an order to be made for sale of the Property with vacant possession and for relief by way of compensation to be given to MHP for the loss of its tenancy. The stand taken by these two defendants was significant since, as I have noted above, as the representatives of the estate of Chiam Toh Say, they were the legal tenants of the Property (the beneficial tenant being MHP) and also the legal owners of a 10% share in the Property. 27Thus, the only serious resistance put up to the plaintiffs’ claim came from CHH. He also resisted the claim on behalf of MHP as its managing partner though the evidence showed that the other partners were either receptive to the idea of a sale as long as some compensation was paid to MHP or were not interested enough in the litigation to take a position before the court.",
        "The facts put forward to support the case made by CHH and MHP": "28CHH filed several affidavits setting out the facts which he asserted supported the case put forward by MHP. He gave a history of the acquisition of the Property and the operation of the Hotel. He stated that the original partnership was formed to take over the business of Windsor Hotel from the previous owners and to pay to repair parts of the building so as to enjoy the use of the Property thereafter. The balance sheet of the original partnership as at 31 December 1948 showed that in order to take over the business of Windsor Hotel, the original partners had to pay over $28,000 for the furniture and fittings and about $7,500 for the goodwill. At this time, it was agreed that rental should be fixed at a high rate of $600 per month (subsequently increased to $660 per month), which was more than 12% return per annum on the value of the Property, so that the co-owners would be able to realise their investment in a matter of years in return for permitting the original partnership to use the Property. 29CHH stated that Chiam Eng Aun told him that the intention behind the purchase of the Property was as a business investment for the original partnership. He was told this by Chiam Eng Aun in the 1980s at a time when the latter was still a co-owner of the Property though no longer a partner in the business. CHH asserted that the original partnership was formed to take over the Hotel and the co-owners agreed to give the original partnership the right to use the Property for its business as long as it wished to. In reliance on this, the original partnership paid one-third of the property tax levied on the Property and was responsible for its maintenance. Further, CHH said that before he died in 1961, his father, Chiam Moo, also told him of the partnership’s right to occupy the Property for as long as it wished to. 30CHH then referred to the differences among the original partners that resulted in the sale of the business of the original partnership to Chiam Toh Say in 1951 and the constitution of the new partnership MHP. He asserted that the arrangement with regard to the original partnership’s interest in the occupation of the Property did not change when MHP took over. This was because as the co-owners intended for the existing arrangement to be continued (especially in the light of the premium paid to the outgoing partners, which included two co-owners namely Chiam Heng Luan and Chiam Eng Aun) whereby MHP would have the right to use the Property for its business as long as it wished to. Therefore, in reliance on this, MHP took on the responsibility of paying rent, paying a portion of the property tax and also of maintaining the Property. 31In the early 1950s, Chiam Toh Moo was the resident partner of MHP and it was during this time that his family including his son, CHH (then aged about 5 years old), moved into the Property and resided there. In 1975, CHH took over the management of MHP, having been registered as a partner in November 1974. 32CHH asserted that the co-owners had intended that MHP could continue its use of the Property for as long as it carried on business. Pursuant to this, from the 1950s up to the time of the proceedings, MHP under the expectation, created and encouraged by the co-owners that it should have a certain interest, occupied the Property and used it for its business and not only paid rent but also one-third of the property tax levied, and was solely responsible for the maintenance of the Property. He stated that in 1949 or 1950, the original partnership had paid between $20,000 and $30,000 for repairs to the kitchen and bathrooms of the Hotel. CHH also produced some of the profits and loss accounts of MHP and various correspondence evidencing the payment of property tax and rent. He asserted that the co-owners relied on MHP to maintain the Property and produced correspondence in 1995 between himself and the solicitors for the first and second plaintiffs where he had confirmed that MHP had repaired and would continue to repair damaged portions of the building. He also gave evidence of substantial sums of money spent in 1995 ($30,000) and 2005 ($90,000) on repairs undertaken to the Hotel. From the accounts of MHP, it could be seen that over the years, at least $31,610.34 had been paid for property tax and at least $345,890.83 had been paid towards maintenance of the Property. The actual sums paid must have been more as the accounts were incomplete.",
        "The evidence given by the other parties": "33Chiam Heng Luan was the only witness in the proceedings who had participated in the original discussions leading to the formation of the original partnership and the purchase of the Property. His evidence was that the co-owners of the Property did not at any time agree to allow the original partnership (and subsequently, MHP) to use the Property for its business for as long as it wished to. Further, he did not agree that the original partnership (and subsequently, MHP) paid one-third of the property tax. When the Property was rented by himself, Chiam Toh Kai and the others from Alkaff Realty in April 1948, the agreement with Alkaff Realty was that the latter would pay the property tax up to 24% whilst the tenant would pay any additional property tax which was over and above 24%. This practice that the tenant of the Property would pay any part of the property tax over and above 24% continued when the co-owners purchased the Property from Alkaff Realty and leased it to MHP. 34When Chiam Heng Luan was cross-examined, however, he was not able to answer, substantively, most of the questions put to him. His typical response was that he could not remember or that the matter he was being asked about was in his affidavit or that the contract or agreement contained the truth. He also admitted that he was a seaman and often not at home and was not as involved in the partnership’s business as the other partners. 35The second plaintiff, Chiam Ai Thong, was born in 1955 and was unable to give any direct evidence on the agreement between the co-owners and MHP on the latter’s interest in the occupation of the Property. She was not involved with the Property or in the business of MHP until 1990. Her stand was that all that MHP had was a tenancy and that that tenancy was of little or no value. She maintained that MHP was not entitled to any compensation because all the amounts that it had spent in relation to maintenance, repairs and property tax were moneys spent in the course of its business and as a part thereof. 36The other witnesses were not able to give any positive evidence on what had happened in 1948 or 1951. This was either because they were not involved in those matters (not being from the generation that set up and ran the business) or because they were third parties who had acquired their interests in the Property very recently.",
        "The issues": "37The issues as framed by the plaintiffs were as follows: (a)whether MHP had discharged its burden of proving that there existed a contract entitling it to occupy the Property for as long as it wished; (b)even if such a contract existed, was it void, alternatively terminable at will, for being a contractual licence for an indefinite duration; (c)if the alleged contract was not void or terminable at will, was it nevertheless subject to any of the following implied terms: (i)that the contractual licence would lapse upon the dissolution of the original partnership in 1951, alternatively upon the death of the partners of MHP existing as at 1951; (ii)that the contractual licence would lapse upon MHP ceasing to operate a hotel business; (iii)that the contractual licence would terminate upon MHP carrying out any illegal activity upon the Property; If so, could the co-owners terminate the alleged contractual licence pursuant to any of these implied terms? (d)was the alleged contractual licence binding upon the third to the fifth plaintiffs and the fifth defendant, who were subsequent purchasers of interests in the Property and strangers to the alleged contract? (e)even if the alleged contractual licence was binding on the subsequent purchasers, should the court grant specific performance of it? (f)did MHP’s alternative claim in proprietary/equitable estoppel have any basis? (g)if an equity had arisen in favour of MHP, had that equity been exhausted on account of MHP’s lengthy enjoyment and occupation of the Property on extremely favourable terms? (h)if not, what would be the appropriate remedy to satisfy the alleged equity in MHP’s favour? (i)whether the first and second plaintiffs’ original notice to quit dated 7 November 2005 had validly terminated the lease of their 40% interest in the Property? (j)if not, whether the subsequent notices to quit sent on behalf of all the plaintiffs on 9 October 2006 had validly terminated the lease of their combined 45% interest in the Property; and (k)if not, whether MHP had nevertheless forfeited its lease in the Property on account of illegal conduct on the premises",
        "Contractual licence": "The arguments 38Mr Andre Maniam, counsel for CHH and MHP, submitted that the objective facts and contemporaneous documents supported the interest claimed by MHP and were consistent with CHH’s evidence as to what he understood from his father and Chiam Eng Aun to be the agreement or understanding between the co-owners and the original partnership. He contended that I should consider in particular the following documents and the inferences to be drawn from themviz, the original partnership deed; the minutes of partnership meeting on 28 November 1951; the deed of dissolution; the partnership accounts; and the partnership deed for MHP. 39The submission was that since 1948, MHP had been running its business at the Property. It had also maintained the Property and contributed towards property tax pursuant to agreements between itself and the co-owners to do so. It was contended that there was no dispute that such agreements had been concluded although they were not in writing. In the same way, it was said there had been an unwritten agreement stating that the partnership could remain on the Property in exchange for its contributions beyond rental. It was not surprising, Mr Maniam argued, that things were not fully documented given that the arrangement was essentially one between family members. Moreover the documents showed that even something uncontroversial like the tenancy was not consistently documented. 40Mr Maniam contended that the only sensible inference from the objective facts and documents was that the partnership had an interest beyond that of a rent controlled tenant. The original partnership, as shown by the 1948 balance sheet, had spent considerable sums on furniture and goodwill when it took over the business of Windsor Hotel and had also spent considerable sums on improvements to the Property. The amount spent on furniture, fixtures and fittings was $28,989.15 and goodwill had cost $7,500. The position taken by CHH was that these sums were paid to the co-owners, and the original partnership thus assisted the co-owners financially in the purchase of the Property. He recognised that Chiam Ai Thong disputed this as she considered that whatever the original partnership paid to take over the existing business was their concern, not the co-owners. Nevertheless, for the partnership to be expending these sums, Mr Maniam argued, was inconsistent with the co-owners being able to evict it with just three months’ notice (once the partnership ceased to be protected by rent control). 41Counsel also referred to the sum of between $20,000 and $30,000 that the original partnership had spent in about 1950 to reconstruct the kitchen and the bathrooms of the Hotel and to metal the dirt roads and the areas around the drains. He pointed out that Chiam Heng Luan had admitted during cross-examination that the Property was leaking and that repairs had to be carried out though he had not been able to remember how much money was spent on repairs by the original partnership. 42Mr Maniam argued that since under the rent control regime, the original partnership and later MHP was not obliged to undertake major maintenance works such as roof repairs nor to improve the Property, and the co-owners were not entitled to charge the tenant any premium for property tax or maintenance, those payments by the original partnership were attributable not to the rent controlled tenancy but to the agreement, understanding or expectation of the parties. Whilst the plaintiffs’ position was that MHP was merely a periodic tenant, yet the plaintiffs and the other co-owners had placed the burden of maintaining the Property entirely on MHP and the original partnership. He said that in the late 1940s/early 1950s it would have been inconceivable to the co-owners and the partners that the co-owners would be able to evict the partnership upon three months’ notice if rent control was no longer in place. Further, when the original partnership was reconstituted as MHP after Chiam Toh Say had paid a high price for the business assets, the parties could not have intended that the co-owners should be able to evict MHP with just three months’ notice. 43It was recognised that, at the outset, all the original co-owners were also partners and for them to evict themselves might not have crossed their minds. That did not mean, however, that if any co-owner ceased to be a partner or any partner ceased to be a co-owner, that MHP could be evicted with three months’ notice. In this connection, Chiam Siew Juat had admitted during cross-examination that after she acquired her share by deed of gift from her father sometime in 1979, it was unthinkable for her in her capacity as co-owner to evict her father and his partners and MHP. 44Mr Maniam also submitted that Chiam Toh Say had paid a premium when he purchased the assets of the original partnership. The price was $260,000 but the assets taken over at book value amounted to only $108,398.77. Net of sundry creditors the net value of assets taken over by Chiam Toh Say was $101,290.56. The price paid by Chiam Toh Say also meant that each of the partners of the original partnership would receive twice the amount credited to them in the capital account of the original partnership. Even if the total asset value of the partnership was taken as being some $192,662.18 as shown in the balance sheet as at 30 November 1951, Chiam Toh Say had paid a premium of at least $67,337.82 for the partnership’s business. Counsel argued that this premium showed that the partnership had a valuable interest in the continued occupation of the Property, an asset which was not valued in the books. The partnership’s goodwill was already reflected in the books as $20,000 and the premium paid was on top of such goodwill. There was no doubt, said Mr Maniam, that no such premium would have been paid had Chiam Toh Say or the others who became partners with him in MHP had considered that they could be evicted by a mere three months’ notice. 45Mr Maniam concluded that the fact showed that the co-owners granted the original partnership the right to use the Property for its business for as long as it wished to and this passed on to MHP, the reconstituted partnership, in 1951/1952. It could not have been in the contemplation of the co-owners to simply evict the partnership with three months’ notice at the time when the original partnership was formed, or when it was reconstituted as MHP, or thereafter up till the present date. 46Mr Harpreet Singh, SC, counsel for the plaintiffs, contended the opposite. His position was that CHH and MHP had failed to discharge the burden of proving that there was an agreement between the original co-owners and MHP entitling MHP to occupy the Property forever. Indeed, the overwhelming weight of the evidence pointed against this. 47First, MHP’s case was based on the alleged oral statements of two persons who are now deceased. Whilst that hearsay evidence might be technically admissible in evidence, the truth of the oral statements could not be fully tested in court. Further, the statements were self-serving and the credibility of CHH was open to doubt. The account of the agreement given by CHH was not credible because: (a)he had stated that the rental was fixed at $600 per month forever with no prospect of revision but such an arrangement was so far removed from commercial reality that it defied belief (note: while the Property was subject to rent control in 1948, at that time the legislation was temporary and was subject to annual renewals; it was not made permanent until 1953); (b)he claimed that the duration of the alleged agreement was “forever” with no prospect for any termination by the co-owners and would have the court believe that: (i)it was not limited to the lifetime of the original partners; (ii)it was not limited to the lifetime of the partners of MHP in 1951; (iii)it was not limited to CHH’s own lifetime; (iv)the interest would pass from generation to generation with no end; (v)partners would be free to sell their interests in MHP and new partners to step in to enjoy this right of use “forever” whilst the co-owners would find their rights of ownership encumbered forever; and (vi)it would even be possible for non-family members to become partners and enjoy the use of the Property forever; (c)he claimed that there would be no effect on the alleged agreement even if MHP ceased to operate a hotel business and started a completely different business but since CHH had admitted that his father had only told him the “broad details” of the alleged agreement, he had no basis to assert that it was the understanding of the parties that the licence was not limited to the operation of a hotel business but extended to any other business MHP might choose to enter; (d)CHH had asserted that sub-letting was permitted with no restriction whatsoever but this was not credible because there was no rational reason for the co-owners to limit themselves to $600 rent per month forever while permitting the partnership to sub-let at will and keep all the profits from the sub-letting; and (e)CHH also asserted that if MHP did not fulfil its obligation to maintain the Property, that breach would have no effect on the continuation of the licence but this was incredible and could not have been contemplated by the co-owners as they would not want to have to leave the Property in MHP’s hands even if it was not being maintained and yet be subject to action from the authorities for failure to maintain the premises since the authorities hold owners rather than tenants responsible. 48Thirdly, in Mr Singh’s submission, the alleged agreement failed to stand up to scrutiny when tested against the objective evidence and common sense. Here, he asked why ownership of the Property had not been transferred to MHP if the intention was to allow MHP to use it forever. In 1951, Chiam Toh Say had bought the 10% interest in the Property on trust for MHP. If MHP was to have indefinite use of the Property for $600 per month, this would have been a needless purchase. The term in the 1952 deed of partnership that MHP was to last for three years was also an indication that at that stage the parties did not contemplate MHP having the use of the Property forever. It also was contrary to commercial reality for the co-owners to borrow money on mortgage to pay the purchase price and take the risk of the mortgage when they knew that partners who were not owners would have full use of the Property and enjoy about 60% of all profits from the Hotel forever. 49Mr Singh also argued that the allegation that the original agreement provided for the partnership to pay one-third of the property tax for the time being was untrue. The agreement, as borne out by the contemporaneous documents, was for the co-owners to bear the whole of the property tax charged at the rate of 24% or less and if the tax rate was increased beyond 24%, for MHP to pay the additional tax. The allegation that the rent of $600 per month was artificially high and fixed at that level in order to allow the co-owners a quick return on their investment was untrue. The rent charged was the same rent that Alkaff Realty had charged the original partnership before the co-owners bought the Property and was also the rent paid by Windsor Hotel. 50Mr Singh did not agree either that the agreed consideration of $260,000 that Chiam Toh Say paid in 1951 to buy the business was set at this level to reflect the right of the original partnership to use the Property forever. He said that this allegation was not borne out by the contemporaneous documents. The accounts as at 1951 showed the partners’ capital accounts as being $130,000 and when this was added to $108,398.77 being the value of the assets taken over and the goodwill, the total was close to the purchase price. In any case, if the sum of $260,000 was referable to the right of use of the Property, there would have been some mention of it in the deed of dissolution or in the accounts as this was a valuable right for which the outgoing partners would have wanted to be compensated. To Mr Singh, it was also significant that all the parties had instructed solicitors to prepare a good number of other legal documents over the years between 1949 and 1952 and had also had accounts drawn up, yet none of the documents had mentioned the important agreement that the original partnership or MHP had a contractual right to use the Property forever. 51I should note also the submissions made by the other parties in relation to this issue. The second to fourth defendants submitted that there was no agreement between the original co-owners and the partners of the original partnership to allow the original partnership to occupy the Property for its business for as long as it wished to. This was because first, it was only CHH who alleged such a right existed and there was no evidence whatsoever that he had been authorised by the other partners of MHP to assert such a right. Second, CHH had no other witness to corroborate his allegation. It was his word against that of all the other co-owners and his knowledge was based on what he had been told by two people who were long deceased. Thirdly, Chiam Heng Luan, the only one of the original purchasers who was still alive, testified that no such agreement was made. During cross-examination, CHH accepted that Chiam Heng Luan was involved in the negotiations for the purchase of the Property and the partnership business. He also agreed that it would be fair to say that Chiam Heng Luan would know what was agreed between the co-owners and the partners. Therefore, it was submitted, there could not have been such an agreement since Chiam Heng Luan had denied its existence. Fourthly, all the other witnesses from the Chiam family had testified that no such right was ever brought to their attention. It was inconceivable that CHH was the only “chosen one” to be informed of such a right when all of the members of the families of the other co-owners did not know of the same and disavowed it. Finally, there was no documentary evidence of the agreement because although the parties had entered into various documents, none of them had either impliedly or expressly set out or referred to the alleged agreement. 52The sixth and seventh defendants who were trustees of a ten percent share in the Property and of the tenancy in trust for MHP also took the position that the alleged agreement to permit MHP to occupy the Property as long as it wished did not exist. This was because their father, Chiam Toh Say, who was MHP’s managing partner at the material time, never mentioned it to them. Secondly, if the right existed, their father would have made a claim for it when he sued CHH and MHP in Suit 8593 of 1984. Chiam Toh Say had claimed in that action that the tenancy vested in him personally but he did not make any claim for a right to occupy the Property for as long as he wished. The sixth defendant testified that his father would have made such a claim if the right existed because this right would be better than a tenancy. Analysis 53AsThe Law of Real Propertyby Megarry and Wade (6thEd, Sweet & Maxwell Limited 2000) puts it in part 17-001, a licence in regard to land is a mere permission which makes it lawful for the licensee to do what would otherwise be a trespass such as going on to the land to play a game or to store goods or to carry on business. There are various types of licence: bare licences, licences coupled with a grant, contractual licences and licences coupled with an equity. This case concerns an alleged contractual licence. Such a licence shares some of the characteristics of a lease. InPrinciples of Singapore Land Lawby Tan Sook Yee (2ndEd, Butterworths Asia 2001), the learned author distinguishes between a lease and a contractual licence states as follows (at p 501): Where the owner of land permits A to occupy the land for a fixed term and for a fee, A’s occupation can be under a lease or a licence. Where it is a licence it is a contractual licence. A lease is an interest in land while a contractual licence is not and is merely a contractual right. … A lessee has exclusive possession and so he may sue in trespass any person who enters without his consent. A licensee does not have exclusive possession. The author subsequently discusses whether exclusive possession automatically results in a tenancy and concludes that where there is exclusive possession coupled with payment of rentprima faciethere will be a tenancy unless such possession is within “exceptional circumstances” such as family relationship, service relationship or occupation under a contract for sale (see p 503). It bears emphasising that the contractual right granted by contractual licence is personal to the licensee. Unlike a tenant who can pass on his tenancy rights to a third party, a contractual licensee cannot convey his right of occupation to any one else. 54In the present case, there is no doubt that from the beginning the primary relationship between the co-owners and first, the original partnership, and later, MHP, was a relationship of landlord and tenant. What MHP sought to persuade me was that overlying that relationship or perhaps running parallel with it was a relationship of licensor and contractual licensee constituted by the alleged agreement by the co-owners that MHP could occupy the Property for as long as it wished. 55MHP cited a quartet of cases where the court had found a contractual licence to exist. I need to consider these in some detail. 56InHardwick v Johnson[1978] 2 All ER 935, the mother (the plaintiff) bought a house in her own name for her son and his wife (the defendant) to live in. The arrangement was that the couple were to pay the mother £7 a week but it was not clear whether that sum was for rent or was towards payment of the purchase price. The couple made some payments to the mother but after a year or so ceased to pay her anything. The marriage later broke down and the son left the house but the wife continued to live there with her child. The mother sought to recover possession of the house from the wife. 57Lord Denning MR treated the wife’s right to occupy the house as an equitable licence and decided that she could stay as long as she paid £28 a month and the mother could not revoke or determine the licence. He observed at p 938-939: So we have to consider once more the law about family arrangements … Family arrangements between parent and child are often not contracts which bind them … Nevertheless these family arrangements do have legal consequences; and, time and time again, the courts are called on to determine what is true legal relationship resulting from them. … In most of these cases the question cannot be solved by looking to the intention of the parties, because the situation which arises is one which they never envisaged and for which they made no provision. So many things are undecided, undiscussed, and unprovided for that the task of the courts is to fill in the blanks. The court has to look at all the circumstances and spell out the legal relationship. The court will pronounce in favour of a tenancy or a licence, a loan or a gift, or a trust, according to which of these legal relationships is most fitting in the situation which has arisen; and will find the terms of that relationship according to what reason and justice require … Of all these suggestions, I think the most fitting is a personal licence. The occupation of the house was clearly personal to this young couple. It was a personal privilege creating a licence such as we have often had: seeErrington v Errington and Woods[1952] 1 KB 290. I do not think it could properly be called a contractual licence because it is difficult to say that this family arrangement was a contract. The other two judges of the English Court of Appeal, Roskill and Browne LJJ, found that the arrangement amounted to the grant of a contractual licence to the son and daughter-in-law jointly to live in the house on condition that they paid the mother £28 monthly presumably because of the payment of the consideration. 58In another English caseTanner v Tanner[1975] 3 All ER 776, the plaintiff purchased the house so as to provide a home for his mistress (the defendant) and their children. The defendant gave up her rent-controlled flat to move into the house and also spent some money in furnishing it. Their relationship subsequently broke down and the plaintiff tried to repossess the house. The defendant resisted the claim on the ground that the house was hers and the children’s until the latter left school. The Court of Appeal found that the plaintiff bought the house in the contemplation and expectation that it would provide a home for the defendant and the children, and that she had provided consideration by giving up her flat and looking after the children. The court then held that in all the circumstances, a contract should be inferred whereby the plaintiff had granted the defendant a licence to have accommodation in the house for herself and the children so long as they were of school age and the accommodation was reasonably required by them. Whilst Lord Denning recognised that there was no express contract to that effect, he said: … but the circumstances are such that the court should imply a contract by him – or, if need be, impose the equivalent of a contract by him – whereby they were entitled to have the use of the house as their home until the girls had finished school. It may be that if circumstances have changed – so that the accommodation was not reasonably required – the licence might be determinable. (at p 780) I note here that in coming to this conclusion, Lord Denning was influenced by the view that the plaintiff had a legal duty to provide for the babies and that since the defendant mother was looking after them and bringing them up, he was under a duty to provide for her too. An additional and significant factor for both Lord Denning and Brightman J was that the defendant had given consideration by giving up her rent-controlled flat. In that situation, she could not be a bare licensee who could be turned out at short notice. 59The third case cited by Mr Maniam wasBinions v Evans[1972] Ch 359 (“theBinionscase”) where the defendant and her husband had been living in a cottage in the estate at which the defendant’s husband was employed. After the death of her husband the defendant continued to live in the cottage. The trustees of the estate entered into a written agreement with her under which she was permitted “to reside in and occupy” the cottage “as a tenant at will” and “free of rent for the remainder of her life or until determined” as provided in the agreement. The defendant undertook to keep the cottage in good repair, to occupy it herself as a private residence and to deliver vacant possession to the trustees upon her ceasing to live there. Subsequently, the trustees sold the cottage to the plaintiffs and in the sale, a special provision was inserted which protected the defendant’s right of occupation of the cottage. As a result of the provision, the price of the cottage was reduced. The plaintiffs later sought to recover possession of the cottage from the defendant. 60The Court of Appeal upheld the lower court’s decision that the plaintiffs held the cottage on trust to permit the defendant to reside in it during her life or as long as she desired. Lord Denning MR held,inter alia, that the agreement gave rise to a contractual licence. He said (at p 367): Seeing that the defendant has no legal estate or interest in the land, the question is what right has she? At any rate, she has a contractual right to reside in the house for the remainder of her life or as long as she pleases to stay. I know that in the agreement it is described as a tenancy: but that does not matter. The question is: What is it in reality? To my mind it is a licence, and no tenancy. It is a privilege which is personal to her. On all the modern cases, which are legion, it ranks as a contractual licence, and not a tenancy: … The other two members of the Court of Appeal agreed that the plaintiff had taken the cottage subject to the defendant’s right under the agreement and on a constructive trust to permit the defendant to reside there during her life or as long as she desired, but held that the defendant was a tenant for life within the meaning of the English Settled Lands Act 1925. One of these, Megaw LJ, was inclined to think that if there was no trust, the defendant would nonetheless be entitled to remain in occupation on the basis of an irrevocable contractual licence for which she had given consideration. 61The fourth case was the local decision ofTan Hin Leong v Lee Teck Im[2000] 3 SLR 85where the plaintiff’s father had given him a property but had procured that he executed a deed in favour of the father’s mistress, the defendant, allowing her to occupy the property at a nominal annual rental of $12. The deed stipulated that “the licence hereby granted is personal to the Occupier and shall automatically lapse upon her death”. Some years after the father’s death, the plaintiff sought to end the defendant’s occupation of the property on the basis that there was only a bare licence which he could terminate. The defendant asserted a contractual or equitable licence to stay on at the property. The High Court held that the deed had created a contractual licence which was not revocable at the will of the plaintiff. Selvam J reasoned as follows (at [30 to 33]): 30A careful reading of the deed reveals that the deed created a contractual licence as it is understood by equity lawyers today. It is not revocable at the whim and will of the plaintiff. It is not a licence for an indefinite period but one with inbuilt limitations. It is the kind of licence which a man would extract from his son to whom he gives the property as a gift but want to ensure that his wife has a roof over her head during her life. A court of equity will not view it as a bare licence terminable at the will of the son and turn out his mother. 31There was a contractual licence because right of occupation was created by a deed signed, sealed and delivered by the plaintiff and the defendant. It was a formal document executed with a serious intention. More importantly the parties acted on the terms of the deed for more than ten years. It provided for reciprocal rights and obligations. The defendant provided consideration by foregoing forever her right to make any claim adverse to the interests, rights and title of the plaintiff; by undertaking to expend money to keep the property in good repair; and by undertaking to pay a rental of $12 every year. 32The licence, however, was not coupled with an interest because the deed explicitly said so. Even though the defendant was required to pay ‘rent’ it was not a lease. The deed defined the right of occupation as a personal right. It cannot be an interest in land. It cannot devolve or be transferred to another party. Accordingly, there can be no proprietary estoppel. Express words of the deed excluded proprietary interest of every kind. 33The contractual licence is not revocable at will because there is an implied irrevocability at will. The implication arises from the fact that the deed defines the circumstances giving the right to end the right of occupation. If those circumstances cannot be established it is to last for the life-time of the defendant. The Court of Appeal[2001] 2 SLR 27upheld the decision on the same basis that on the true construction of the deed what was created in favour of the defendant was a contractual licence to occupy the property. 62On the basis of the foregoing authorities, Mr Maniam submitted that it was a viable proposition in law to state that MHP had a contractual or equitable licence to occupy the Property for its business as long as it wished to. The Singapore courts had expressly recognised that a purported revocation of a licence would not merely be met by allowing payment of damages in all cases and that the court could specifically enforce the licence by allowing continued occupation. 63I take a different view. The facts of the four cases are quite different from the facts before me. All of the cases involved the occupation of a property as a personal residence. Three of them were family or family type cases arising from the desire of one person in a personal relationship to provide accommodation for other persons in that relationship. In two cases, there was no document involved at all and the court had to infer the type of legal arrangement that existed from the circumstances. For that reason, it is not surprising that whilst a right of occupation was found in both those cases, the bases of the finding differed from one judge to another. Further, none of the occupants in those cases had any interest in the land they sought to occupy. They claimed and were given only personal rights. If an interest in land had existed like the interest which a tenant has in his landlord’s property, the outcome may have been different, perhaps less favourable to the claimant. (I note here that in theBinionscase, the purported creation of a tenancy at will was nullified by the court because the provisions of the document were inconsistent with such a tenancy and that was why Lord Denning needed to find a contractual licence to allow the defendant to remain in the premises). In each of the authorities cited therefore, there was a need to determine what the relationship was between the parties that allowed the occupant to occupy the premises concerned and to continue such occupation. In my judgment, those four cases are distinguishable from the case before me and whilst they illustrate the situations in which the court will find a contractual licence to exist, they do not, any of them, provide authority for the proposition that a contractual licence can co-exist with a tenancy. 64In the present case, the Property was occupied as a place of business and not as a personal residence. Whilst the co-owners and the partners were related to each other, the conferring of the tenancy on the partners did not result from a desire to provide a home for a vulnerable family member. The parties did not act out of love and affection but out of a desire to carry on business together and achieve a profitable situation for all. Theirs was a commercial relationship although they may have been motivated to go into business with each other by reason of their familial ties. The parties considered what sort of relationship they should have and they chose the relationship of landlord and tenant. This happened when one of the original partners persuaded the co-owners to purchase the Property and thus take over the position of landlord from Alkaff Realty. Throughout all the years that the original partnership and then MHP occupied the Property, all parties regarded the occupants as tenants. MHP enjoyed the protection of the Act until 2001 as shown chiefly by the freezing of the rental at $660 per month despite the inexorable rise over the decades of rental rates for commercial properties. It paid rent and it documented its payments as rent. Its legal position as occupant of the Property was documented in the contemporaneous documents as that of a tenant. In the deed of dissolution, as I have mentioned, one of the assets assigned to Chiam Toh Say by the original partners was their interest in the lease of the Property. There was even a court battle over the beneficial ownership of the tenancy and this resulted in the Court of Appeal holding that the tenancy was a business asset of the original partnership purchased by Chiam Toh Say and held by him thereafter on trust for MHP. There can be no dispute therefore about the primary relationship between MHP and the co-owners. 65Over the years, up to the mid 1990s at least, there was no whisper of any other type of relationship existing between the parties in addition to the landlord and tenant relationship. There may have been no need to do so because it was easier, as CHH said, and did, to rely for protection on the position of a tenant protected by the Act. But this could very well also have been because the parties never contemplated the existence of any other type of relationship. Even if I accept that it was the parties’ intention from the time the original co-owners acquired the Property that it should be used for the purposes of the partnership’s business and that the whole purpose of the acquisition was to give the original partnership security of tenure so it could run its business in peace without worrying that the landlord might try and recover possession, that does not mean that a contractual licence came into existence. When one legal relationship exists into which the facts can be fitted, why should the court be astute to find the existence of an additional relationship? Since the parties knowingly, as commercial men, took on the relationship of landlord and tenant, any terms on which they agreed relating to the occupation of the Property must be considered as terms of the tenancy agreement rather than as terms of a separate contractual relationship between them. It is also worth noting that any contractual licence that may have been given to the original partnership would have terminated when that partnership dissolved. Being a personal right it could not have been passed on to MHP. 66It appears to me that this case is much more akin to the decision inPocockv Carter[1912] 1 Ch 663 (“thePocockcase”) than to the four contractual licence cases that I have considered above. In thePocockcase, three parties entered into partnership for the term of the life of one of them – Susan Pocock. Susan Pocock was the lessee of the premises at which the business was carried on. The partnership paid the yearly rent due to the landlord for the premises. In December 1907, Susan Pocock brought an action against her co-partners for partnership accounts. Subsequently pursuant to an order in that action, the book debts, trade fixtures and articles used in the partnership as of September 29, 1910 were sold by private tender and the defendant was the purchaser. By the conditions of sale, the defendant was to have possession and pay his purchase money into court on October 20, 1910. The issue that arose was whether the defendant was liable to pay rent for the partnership premises from October 20, 1910 to November 11, 1911. It was held that the tenancy granted by Susan Pocock was a tenancy during the partnership only and terminated at the dissolution of the partnership on October 20, 1910 when its assets were sold. In the course of his judgment, Neville J said (at p 665 to 666): … I thought at first that it was a choice between inferring a tenancy from year to year, or a tenancy at will, but I now think the inference is that there was intended to be a tenancy during the continuance of the partnership. This inference is equivalent to the express terms of the tenancy which was dealt with inDoe v. Miles, and it appears to be the only inference which will enable the matter to be fairly dealt with. Nothing is said in the partnership deed about the terms on which the property was to be held by the partnership though it is plainly intended that the business should be carried on there. It is provided in general terms that all rent, rates, and taxes shall be paid out of profits before division, but there is no specific reference to the rent or tenancy under this particular lease. The rent, however, was paid by the partnership. If I were to hold that there was implied either a tenancy at will or a tenancy from year to year, the partner owning the premises could by giving notice have terminated the agreement before the end of the partnership and turned the other partner out of the premises. That would be a most unsatisfactory position and cannot, I think, have been contemplated by the parties. I must therefore infer that there was a tenancy during the partnership only, which terminated at the dissolution of the partnership on October 20, 1910. 67The above case indicates that just as the court is able to infer the terms of a contractual licence agreement from the circumstances under which the licensee took occupation of the property in question, the court is also able to infer the terms of a tenancy from the surrounding circumstances. Lord Denning declared in theHardwickcase that the court would find the legal relationship which was most fitting in the situation that had arisen and would find the terms of that relationship according to what reason and justice required. In this case, reason and justice require me to hold that the terms for which MHP contended must, to the extent that I find them proved, be terms of the tenancy and not terms of a contractual licence. This was not always my view. Indeed at the end of the hearing I indicated to the parties that in all likelihood MHP was a contractual licensee. Further reflection has, however, convinced me that that view was wrong. 68Looking at the circumstances under which the Property was acquired and bearing in mind the various submissions made by the plaintiffs and MHP, I have come to the conclusion that from the time the co-owners acquired the Property and became the landlords, the intention of the parties was that the term of the tenancy, first to the original partnership and subsequently to MHP, was to be for so long as the hotel business was carried on at the Property. This must have been the implicit understanding even if it was never made explicit. This understanding would also explain any premium that Chiam Toh Say paid the original partners in 1951. In coming to this conclusion, I have made an inference from the circumstances as they are disclosed in the evidence. 69On the other hand, it cannot have been contemplated that the tenancy was intended to last for as long as the partnership wished it to last notwithstanding that the partnership had moved out of the hotel business and was doing something else at the Property. In addition to the reasons given by Mr Singh, the following factors also appear to me to be significant. First, at the time the Property was acquired, it was being used as a hotel. The original partners took over the lease of the Property and entered into partnership because they wanted to carry on a hotel business at the Property. Second, when the partnership was reconstituted, by the partnership deed the new partners declared that they “mutually agree[d] to become partners in the business of Hotel Proprietors”. The name that they chose for the business, MHP, itself indicated that their predominant, if not sole, purpose was to run a hotel. Third, this was also the understanding that the co-owners had when they bought the Property from Alkaff Realty and that understanding could only have been confirmed when the original partnership was dissolved and the new partners (three of whom were also owners) took over the business and the tenancy and declared their intention to be in the hotel business. Fourth, over the years, no attempt was made to change the business of the partnership and it only ceased to run the Hotel when its hotel licence was lost. 70It was also, in my judgment, a term of the tenancy that the tenant would pay a portion of the property tax and would be responsible for the maintenance and repair of the Property as long as it carried on business there. Whilst the owners may not have been able to enforce these obligations during the time the Property was subject to the Act (I say this on the basis that requiring the tenant to do these things may have been considered to be levying a premium on the rent, something that was forbidden by the legislation), there was nothing to prevent the tenant from agreeing to undertake such obligations. It made sense for the original partnership and MHP to agree to bear such burdens (and for the owners to expect that the obligations would be fulfilled without the need to have recourse to legal means to enforce them) in view of the close relationship between them and the owners. The partners were all commercial people and as the Property had been acquired so that the partners could continue to carry on business there, they must have considered that these expenses were an integral part of the cost of doing business. From 1952 onwards if not earlier, MHP was itself a co-owner and thus itself had an interest in the maintenance of the Property beyond the use of the same for the Hotel. Further, as the sixth and seventh defendants submitted, the original partners of MHP owned between themselves and through MHP itself, six out of ten shares in the Property. As owners of the majority of the shares and property and the parties making profits out of the Property, it was only natural that the partners accepted the obligation to maintain it. 71I cannot find that there was any agreement (whether as a term of the tenancy or as contractual licence) to allow the original partnership or MHP to occupy the Property for as long as it wanted and under all circumstances. Mr Singh, in his submissions summarised in [47] above, gave cogent reasons why such an agreement would not be credible and would be in defiance of commercial reality. There was no direct oral or other evidence to substantiate that the agreement was as far reaching as CHH said. The only account of its terms was that given by CHH. CHH was, however, giving evidence about matters that had been told to him a very long time ago (about two decades in the case of what Chiam Eng Aun was supposed to have said) and also was giving self-serving evidence as he was maintaining the right of MHP to stay on the Property forever. There could have been gaps in his memory or he could have been exaggerating in order to support MHP’s case. Some of the claims he made about the extent of the agreement were incredible. In any case, in my view, it could not have been contemplated by the co-owners either in 1948 or in 1952 that they would never be able to realise their investment even when the Hotel had ceased to operate and the partnership was practically moribund with CHH, the sole partner in occupation, carrying out a desultory business by renting out a few rooms now and again. 72There is, however, a legal difficulty with the finding that the term of the tenancy was intended to be for as long as the original partnership or MHP carried on the hotel business. This is a difficulty that seems not to have been considered in thePocockcase. It is a basic principle that for a valid fixed term lease there must be certainty as to the length of the lease. A lease for an uncertain period is void but if the tenant nevertheless enters into possession and pays rent, the land then becomes held on a periodic tenancy. This principle was in some doubt afterIn Re Midland Railway Co’s Agreement[1971] Ch 725 but was reaffirmed in 1992 by the House of Lords. 73InPrudential Assurance Co Ltd v London Residuary Body[1992] 2 AC 386, Lord Templeman who delivered the leading judgment in the House of Lords, affirmed the principle that the requirement that a term must be certain applies to all leases and tenancy agreements. He stated (at p 394 to 395): […] I consider that the principle inLace v Chantler[1944] K.B. 368 reaffirming 500 years of judicial acceptance of the requirement that a term must be certain applies to all leases and tenancy agreements. A tenancy from year to year is saved from being uncertain because each party has power by notice to determine at the end of any year. The term continues until determined as if both parties made a new agreement at the end of each year for a new term for the ensuring year. A power for nobody to determine or for one party only to be able to determine is inconsistent with the concept of a term from year to year … In any event principle and precedent dictate that it is beyond the power of the landlord and the tenant to create a term which is uncertain. … A term must either be certain or uncertain. It cannot be partly certain because the tenant can determine it at any time and partly uncertain because the landlord cannot determine it for an uncertain period. If the landlord does not grant and the tenant does not take a certain term the grant does not create a lease”. In that case, the tenancy agreement provided that the tenancy should continue until the land was required by the council for the purpose of widening the adjoining highway. It was held that the lease purportedly created by the agreement was void and the land was held on a yearly tenancy created by virtue of the tenant’s possession and payment of yearly rent and that the landlord could determine it on six months’ notice. 74On the basis of the principle cited above, it follows that the intention of the term of owners and MHP that the term of the tenancy should be for as long as MHP carried on the hotel business was unenforceable (a fortioriif there had been an intention that the tenancy should last as long as MHP wanted it to). The tenancy, accordingly, was not for a fixed term. Instead, by virtue of MHP’s occupation and payment of rent either quarterly or monthly, the tenancy was a periodic one. It could therefore be determined by a notice to quit by either party. In this case, as the rent was either paid to the co-owners on a quarterly or monthly basis, they would be able to terminate the lease of their interest to MHP by giving the latter, at the longest, a quarter’s notice. Until 2001, however, they could not exercise this right because of the provisions of the Act. Despite the nullifying effect on the lease of the uncertain term intended to be created, I cannot find that a contractual licence was created in place of the intended lease for the reasons given in [63] to [65] above. It also appears to me that before rent control was abolished, MHP would never have dreamed of claiming that it had a contractual licence since such a claim opened it to the possibility of a demand from the owners for a substantial increase in the payments it made for occupying the Property. 75If I had found that a contractual licence existed, however, I would similarly have decided that the term of occupation granted by the contractual licence was for so long as the partnership was operating the Hotel on the Property and that in December 2002, when it lost the hotel licence or, at the latest, in December 2003 when it lost the liquor licence, the right to continue in occupation ended thus allowing the plaintiffs the right to ask for the return of the Property. The consideration for the contractual licence would have been the payment of a portion of the property tax and the obligation to maintain the Property.",
        "Proprietary/Equitable estoppel": "76In view of my decision above, I need not consider issues (b), (c), (d) and (e) set out in [37] above. Instead, I now consider whether MHP’s alternative claim of proprietary or equitable estoppel has any basis. 77Mr Maniam contended that the facts of the case had also given rise to an equity in favour of MHP that must be satisfied and that MHP could not be evicted from the Property by a three months’ notice to quit. This argument was based on the fact that since the 1950s, MHP, as the occupier of the Property, had contributed substantially to the initial repairs, paid substantial property tax and rent. It had also maintained and continued to maintain the Property, to the extent of effecting structural repairs. Counsel maintained that it would be unfair and unconscionable not to recognise MHP’s interest in the continued occupation of the Property beyond a mere periodic tenancy and that the co-owners of the Property were estopped from asserting otherwise by their conduct, representation and/or inaction. 78The applicable legal principles relating to this area of the law were comprehensively reviewed by Sundaresh Menon JC inHong Leong Finance v UOB LtdLtd [2007] 1SLR 292 at pp 341-352. They are, to summarise: (a)the three elements that must be shown to found an estoppel are representation, reliance and detriment; (b)for an estoppel concerning land it must be shown that the landowner permitted the claimant to have, or encouraged him in his belief that he had, some right or interest in the land, and the claimant acted on this belief to his detriment; (c)the principle that underlies the remedy is unconscionability. Where land is concerned, the question is whether the landowner said or did something that led the claimant to take a certain course of action which renders it unconscionable not to estop the landowner from his earlier position; (d)representation is a broad concept covering both direct statements and agreements as well as expectations that have been created or encouraged by the landowner but it does not allow the doctrine to be invoked where a party acts to his detriment in thehopethat he will be given an interest in the land. 79An important case dealing with the fourth statement set out above isAG of Hong Kong v Humphreys[1987] 2 All ER 387. That case emphasised the need for proof that the party sought to be estopped had “created or encouraged a belief or expectation” on the claimant’s part. The mere fact that the party sought to be estopped is fully aware that the claimant is acting to its detriment is insufficient. Proof is required that the detrimental conduct flows from the belief or expectation created or encouraged by the party sought to be estopped. 80Mr Singh submitted that the highest that MHP could pitch its case was that the co-owners agreed that MHP, as part of its occupation of the Property, should pay rent and part of the property tax and maintain the Property. He asked whether on account of those facts it could be said that the co-owners had said or done something that rendered it unconscionable not to estop them from asserting that MHP did not have the right to remain on the Property forever and did not have any other proprietary interest in the Property. In his submission, there was nothing remotely unconscionable about the co-owners’ conduct. First, they never represented, expressly or impliedly, to MHP that it would in addition to its rights as a rent controlled tenant, have the added right of remaining on the Property for as long as it wished. Secondly, until these proceedings were started, the co-owners were not even aware that MHP harboured the belief that it could remain on the Property for as long as it wished. Thirdly, while the co-owners knew that MHP was contributing towards property tax, they believed that that was part of the bargain struck to enable MHP to run the Hotel on the Property. Fourthly, while the co-owners did not contribute to the maintenance of the Property and were aware that MHP was doing this, that conduct must be seen in the context of MHP being in sole and exclusive possession of the Property and operating its hotel business there. There was nothing unusual about MHP incurring such expenditure when it stood to make a profit from the operation of the Hotel. This case had to be distinguished from the usual proprietary estoppel case in a family context where a family member was invited to occupy a property and thereafter incur substantial sums in improving that property in the expectation of receiving an interest in it. The maintenance expenditure incurred by MHP was wholly referable to its sole and exclusive possession of the Property to operate hotel business. It was not expenditure incurred in the belief or expectation that MHP would acquire a proprietary interest in the Property. 81As regards the first element of representation, the submission made for MHP was that it was always intended for MHP to enjoy the use of the Property and that the co-owners had intended that MHP could continue using the Property for its business as long as it wished to. Accordingly, the co-owners had created and encouraged an expectation in MHP that it should have a certain interest in the Property. I cannot accept this submission in its entirety as it is inconsistent with the findings that I have made. I have found that there was no intention that MHP should be able to use the Property for as long as it wished to. Rather, I have found that the intention was a more restrictive one and that it was that MHP could continue occupying the Property for as long as it was in the hotel business and that for a period of occupation it would pay a portion of the property tax and maintain the Property. 82In this context, the classic statement of the law on equitable interest by Lord Kingsdown inRamsden v Dyson(1866) LR 1 HL 129 is apposite. At p 170, Lord Kingsdown said: The rule of law applicable to the case appears to me to be this: if a man, under a verbal agreement with a landlord for a certain interest in land, or, what amounts to the same thing, under an expectation, created or encouraged by the landlord, that he shall have a certain interest, takes possession of such land, with the consent of the landlord, and upon the faith of such promise or expectation, with the knowledge of the landlord, and without objection by him, lays out money upon the land, a Court of equity will compel the landlord to give effect to such promise or expectation. … If, on the other hand, a tenant being in possession of land, and knowing the nature and extent of his interest, lays out money upon it in the hope or expectation of an extended term or an allowance for expenditure, then, if such hope or expectation has not been created or encouraged by the landlord, the tenant has no claim which any Court of law or equity can enforce. 83As his lordship went on to say, the whole question is within which class any particular claim would fall and that point would depend entirely on the effect of the evidence. In this case, as I have stated above, the evidence showed that there was an intention for first the original partnership and then MHP to occupy the Property for so long as it carried on the hotel business. MHP therefore had an expectation as to its usage of the Property which was created or encouraged by the actions of the co-owners. In reliance on that expectation, MHP has been paying the property tax and maintaining the Property even though such tenancy obligations may not have been legally enforceable during the period when the Property was governed by the Act. The facts of the case therefore establish that an equity has been raised in MHP which the court must recognise. 84The next question is as to the extent of that equity. Certainly that equity would have operated as an estoppel to prevent the owners from terminating the tenancy and recovering possession of the premises while the Hotel was still operating. Now that that business is defunct, is that the end of the equity or does the equity need to be satisfied in any additional way? 85Mr Maniam submitted that if the court found an equity in favour of MHP, then it would still be open to the court to determine the best way to satisfy the equity. The maximum extent by which the equity might be satisfied, he submitted, was to give effect to the parties’ intention (which he said was to allow MHP to remain in occupation for as long as it wanted) whilst the bare minimum would be to reverse the detriment suffered by MHP (for instance by taking an account of financial contributions made by MHP and the original partnership over the years and requiring repayment of that with interest). In order to satisfy the equity, the court should take into account the history of the matter, the expectations of MHP and the expenditure by MHP on the Property over 50 years. 86Mr Singh, on the other hand, submitted that the cases established that the court would only grant the “minimum equity” needed to do justice in all of the circumstances. In this regard, the courts are concerned to ensure that the remedy granted is not disproportionate to the detriment suffered as demonstrated by para 110.044 ofHalsbury’s Laws of Singapore(Vol 9(2), 2003 LexisNexis Singapore) which states: In many other situations, there may be an estoppel as where an expectation is created by acquiescence in expenditure on land; or by a representation which is detrimentally relied upon; but the equities must always be considered, and the court must decide what is the most appropriate form for the relief to take. It must ‘look at the circumstances in each case to decide in what way the equity can be satisfied’, approaching this task in a cautious way, in order to achieve ‘the minimum equity to do justice to the plaintiff’. 87He also cited the case ofSledmore v Dalby[1996] 72 P & CR 196 where it was found that the equity had been satisfied by enjoyment and was therefore exhausted. In that case, notwithstanding that an expectation had been created in the claimant’s mind by the land owner which caused the claimant to incur expenditure to carry out improvements, the court held that any equity arising had been fully satisfied because: (a)the claimant had lived rent free on the premises for over 18 years; (b)while the claimant had incurred the expenditure, he and his family had also enjoyed the benefit of such expenditure; (c)the land owner had also incurred expenditure of its own during that time. 88Mr Singh went on to submit that therefore, if an equity had arisen in MHP’s favour, it had been more than fully satisfied by reason of the following: (a)MHP had had enjoyment of the Property which was of a substantial area in Killiney Road at a paltry rent of $660 per month for over 50 years; (b)even when rent control was lifted in 2001, MHP had continued to pay rent of $660 per month. The rent was never increased; (c)throughout this period, MHP had continued to operate a profitable business on the Property and, since 1973 had made profits exceeding $1m. These were the net profits made after deducting the expenditure for maintenance and all other costs of business. 89As I have stated above, the equity that I have found operated to prevent the owners from demanding the return of the Property as long as the Hotel was operating and the Hotel was operated on the Property for over 50 years. That situation no longer exists. From the end of 2003 at the latest, the owners were no longer estopped from terminating the tenancy. Taking that important factor into account as well as those mentioned by Mr Singh and set out in [88] above which I accept as material, I take the view that the equity has been fully satisfied. There is one caveat to this, however. That is that I think that once MHP could no longer rely on the equity because its business had ceased, equally the owners could no longer rely on MHP to bear all the expenses of maintaining the Property and to pay a portion of the property tax. Therefore, I consider that the owners must refund to MHP all property tax payments and all maintenance expenditure incurred from the beginning of 2003 (i.e., the date falling immediately after the hotel licence was lost) up to the date of this judgment. Such amounts, together with interest at 6% per annum from the date they were incurred, shall be paid by the owners to MHP from the proceeds of sale of the Property.",
        "Validity of notices to quit": "90MHP submitted that if it had a contractual or equitable licence to occupy the Property for its business for as long as it wished to, the notices to quit served by the various parties were ineffective to terminate its interest and it was therefore entitled to remain in occupation of the Property. Even if MHP merely had an equity in the Property, that needed to be satisfied before it would be required to vacate. These objections cannot stand in the light of my findings above. 91The sixth and seventh defendants originally put forward a submission that the notices to quit given at various times were bad. Where the first notice to quit dated 7 November 2005 was concerned, the sixth and seventh defendants submitted that it was flawed for three reasons. The first was that s 72 of the Conveyance and Law of Property Act (Cap 61, 1994 Rev Ed) required that any notice required by that law be in writing and be served on a lessee or a mortgagor as the case may be. This notice was, however, only served on MHP and not on the sixth and seventh defendants who were the legal lessees holding the tenancy in trust for MHP. Secondly, the notice to quit was only from the first and second plaintiffs who owned 40% of the Property. There was no notice to quit from the third, fourth and fifth plaintiffs. Thirdly, the plaintiffs must have recognised the flaw in the first notice because they then served notices to quit from the third, fourth and fifth plaintiffs on 24 April 2006. This third objection need not be considered further because the mere issue of a second notice to quit cannot affect the validity of the first notice. 92I find no merit in the first objection. It is extremely technical. Whilst the sixth and seventh defendants were the legal lessees, they were bare trustees of the tenancy for MHP and, at all times during the tenancy, it was MHP who paid the rent, occupied the Property, maintained it and in all respects not only acted as the tenant but claimed rights as the tenant and dealt with others as the tenant. The cases ofJones v Phipps(1867-1868) LR 3QB 567,Hubbard v Highton[1923] 1 Ch 130 andTownsends Carriers Ltd v Pfizer Ltd(1977) 242 EG 813 cited by Mr Singh, all show that in similar circumstances, the court will give effect to the substance of the transaction and where trustees have allowed the beneficial tenants or owners to deal directly with the landlord or tenant as the case may be, the trustees cannot object to the validity of notices given to the beneficiary. 93As regards the notice to quit being only from the first and second plaintiffs, I agree that the first and second plaintiffs could only terminate the lease of their interest in the Property but this limitation does not negate the validity of the notice. Since that first notice was sent out on 7 November 2005, the third, fourth and fifth plaintiffs have served a similar notice to quit as have the second, third and fourth defendants and the fifth defendant. By the time of the hearing, notices to quit had been served in respect of 80% of the shares in the Property and the leases in respect of those shares had been terminated. It was clear from the submissions made on behalf of the sixth and seventh defendants that they really had no objection to giving vacant possession of the Property to the owners so that it could be sold. Their purpose in objecting to the validity of the notices to quit was to try and obtain some compensation for MHP. Upholding such technicalities, however, would not entitle MHP to compensation. The only effect of doing so would be to postpone the giving of vacant possession. Their ground for claiming compensation was simply that it was unfair for MHP to be ejected simply with three months’ notice after it had been a tenant for 50 years. That is a contention that I do not accept. 94I find that the notice to quit dated 7 November 2005 was valid and that as a result of it being issued, the lease of the first and second plaintiff’s interest in the Property to MHP terminated on 31 March 2006. I find too that the various other notices to quit issued by the other plaintiffs, the second to fourth defendants and the fifth defendant were also valid and that the leases of their respective interests in the Property to MHP would have terminated on the expiry of those notices.",
        "Sale of the Property": "95The effect of the termination of the tenancy by persons with an 80% interest in the Property was that as all these persons are tenants in common of the Property, they became entitled to possession of the Property and MHP became obliged to share possession with these co-owners. It had no right to exclude any of the co-owners from possession. The plaintiffs did not, however, terminate the lease of their interests to MHP because they wanted to share possession of the Property with CHH. What they wanted and asked me to grant was an order for sale of the Property with vacant possession. 96I granted the order prayed for since all but two co-owners had terminated the lease and the remaining two co-owners were CHH and MHP itself who would be highly unlikely to take any action to terminate the lease of their interests in the Property to MHP (assuming, that is, that MHP was capable of giving itself a lease of its interest in the Property). It was clear that both of them were resisting the termination of the tenancy but since I had found that their grounds for doing so could not be upheld, the basis on which MHP continued to occupy the Property had been removed even if, technically, it was still a tenant of CHH. 97Under s 18(2) of the Supreme Court of Judicature Act (Cap 322, 1999 Rev Ed) read with paragraph 2 of Schedule 1, the High Court has the power to partition land or order a sale in lieu of partition “where it appears necessary or expedient” to do so. It was pursuant to this section that Kan J ordered the sale of the Property in OS 582. It appeared necessary to Kan J to make an order for sale in 1996. By the time of the hearing before me, about a decade later, it appeared to me that it was equally necessary and expedient to order a sale of the Property in lieu of partition but this time with vacant possession. Apart from CHH, all the parties affected, including the trustees of MHP’s interests in the Property wished for a sale of the Property. The exercise of the co-owners’ rights to joint possession with MHP would not serve any practical purpose but would simply aggravate the existing friction between them and CHH. Further, the Property was not in a good state of repair and it was a valuable asset that was not being properly exploited for the economic benefit of all the owners. As Mr Singh submitted, there was no serious injustice that would be caused by the sale of the Property. This was not a case of a wife being evicted from her matrimonial home or an elderly person who may be put to great disadvantage if asked to leave his home. CHH had confirmed during cross-examination that he had other properties including a matrimonial home where his family lived. In any case, as a co-owner and as a partner, he would receive a substantial amount from the proceeds of sale and would be in a position, if he so desired, to buy other accommodation.",
        "OS 1918": "98In view of the findings that I have made in relation to OS 830, there is no need for me to deal with the issues raised by OS 1918.",
        "Conclusion": "99There shall therefore be a declaration that the lease of the first and second plaintiffs’ interest as tenants-in-common of a 40% share in the Property in favour of MHP was validly terminated with effect from 31 March 2006 (at the latest) pursuant to a written notice to quit dated 7 November 2005. I also declare that the subsequent notices to quit issued by the third, fourth and fifth plaintiffs, the second, third and fourth defendants and the fifth defendant, were valid notices to quit as the co-owners were, by the time such notices were issued, entitled to terminate the lease of their respective interests in the Property to MHP by a three months’ notice to quit. The order for sale with vacant possession and the consequential orders that I made on 30 April 2007 (as amended on 20 August 2007) shall, of course, stand. I further order that the co-owners shall each pay MHP his or her proportionate share of the sums payable to MHP under [89] above from his or her proceeds of sale of the Property. With respect to costs, although MHP has made submissions on costs, I would like further submissions from all parties on this issue which take into account the findings that I have made herein."
    }
}