{
    "case_title": "Law Society of Singapore v Bay Puay Joo Lilian",
    "ncitation": "[2007] SGHC 208",
    "coram": "Andrew Ang J; \n      Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA",
    "sections": {
        "Introduction": "1       This is an application by the Law Society of Singapore (“the Law Society”) pursuant to s 94(1) read with s 98 of the Legal Profession Act (Cap 161, 2001 Rev Ed) (“the Act”) for Bay Puay Joo Lilian (“the respondent”) to show cause as to why she should not be dealt with under s 83(2)(e) and/or s 83(2)(h) of the Act. The respondent is an advocate and solicitor of the Supreme Court of Singapore of some 27 years’ standing. At the material time, the respondent was a practising advocate and solicitor and a partner in the law firm of M/s Bay Tan and Partners (“the firm”) and handled conveyancing matters in the course of her work as a solicitor. 2       By way of background, it should be stated that this is the second disciplinary case that has been referred to this court arising from a series of well-executed sting operations designed to obtain evidence of touting by certain law firms suspected of procuring conveyancing work from real estate agents by giving referral fees. The first case wasLaw Society of Singapore v Tan Guat Neo Phyllis[2007] SGHC 207(“Phyllis Tan”). There is also an appeal to the Court of Appeal arising out of an application for leave for judicial review based on similar facts,viz,Wong Keng Leong Rayney v Law Society of Singapore[2007] SGCA 42(“Rayney Wong CA”).",
        "Background": "",
        "The charge": "3       Before the disciplinary committee (“the DC”) appointed by the Law Society, the respondent was charged with an amended charge of contravening s 83(2)(e) and/or s 83(2)(h) of the Act. Specifically, the charge was that at around 3.20pm on or about 18 March 2004, at the firm’s premises, the respondent attempted to procure the employment of herself to act in a conveyancing matter or matters, by offering to pay one Jenny Lee Pei Chuan (“Jenny”): (a)    a percentage-based referral fee of 10% of the respondent’s professional fees in a private property purchase to be referred to her; and/or (b)    a flat referral fee of $100 in Housing and Development Board (“HDB”) sale or purchase cases referred to her in future, and that she had thereby breached s 83(2)(e) and/or s 83(2)(h) of the Act.",
        "Agreement as to documents": "4       Before the DC, counsel for the Law Society and for the respondent agreed to admit in evidence (a) the agreed bundle of documents; and (b) the respondent’s bundle of documents. The agreed bundle of documents comprised the following: (a) the agreed statement of case (excluding the amended charge); (b) the complaint of Jenny contained in her statutory declaration dated 15 April 2004; and (c) the agreed transcript of the video recording made by Jenny of her meeting with the respondent (“the Agreed Transcript”). 5       Both counsel also agreed to the following: (a)    that the documents in the agreed bundle were authentic and that in the event of any inconsistency between any statement in Jenny’s statutory declaration and the agreed statement of case, the statement in the latter document would prevail; and (b)    that they would dispense with cross-examination of the relevant witnesses and rely entirely on the admitted documents to prove their respective cases. It should be noted that in the DC proceedings, the respondent informed the DC that she would not be arguing that the Agreed Transcript should be excluded on the ground that it was in the nature of entrapment evidence or that it had been illegally or improperly obtained.",
        "The facts": "6       According to the agreed statement of case, sometime around 29 February 2004, Jenny, a part-time private investigator and part-time real estate agent, was engaged by a private investigation agency, Dong Security & Investigation Agency, to assist in investigating whether certain law firms were touting for conveyancing work by offering monetary incentives to real estate agents. 7       Pursuant to her engagement, Jenny telephoned the respondent on 17 March 2004 claiming to be a real estate agent of a prospective purchaser who needed to engage a conveyancing lawyer. She followed up her telephone call with a face-to-face meeting with the respondent the next day (ie, 18 March 2004) at about 3.20pm (as reflected in the amended charge) at the firm’s premises. 8       During the said meeting, Jenny asked the respondent whether she would pay a referral fee for the purported conveyancing case which Jenny was proposing to refer to the firm. In response, the respondent wrote “10%” on a piece of paper and gave it to Jenny. When queried by Jenny as to what that meant, the respondent clarified that “10%” referred to ten per cent of the professional fees that the firm would receive from the client for the conveyancing transaction. This occurred approximately between the fifth and tenth minute of the conversation as reflected in the Agreed Transcript. It is useful to set out the relevant dialogue between the parties as recorded in the Agreed Transcript (“J” is Jenny, and “R” is the respondent): [J]:    … That mean [sic] like I say … what we mentioned yesterday on the phone, let’s say if I am going to refer this case to you, which is under negotiating [sic] because my buyer is actually out of town. I gave the offer to the seller and the seller came back to me but I can’t get hold of my buyer because he is out of town for a holiday until … he’s coming back until this Sunday … I will get in touch with him to see how the offer is like. … So I need to consult him. So if let’s say I am going to refer this case to you, what is the incentive like? [R]:    You are one, you are very direct. [J]:    Sorry I, sorry, I am … Sometime[s] doing this kind of business, market is bad. We want to have more deals with, is you have to come direct. [R]:    [T]he best … the best I can tell you is this. Is that … is that you got to give us a try first. You know, you have to work with us first and see whether you like us or not. And then, I mean start a relationship with us. That’s what I can tell you. [J]:    But what about the incentives? [She then went on at length about the various types of incentives and her preference for cash over voucher and payment in kind]. But then they giving [sic] me like vouchers and like holidays, chalet stays. But it is not really that … to me attractive. To be realistic enough in this world is hard cash money. Hard cash, where you really gain, you know you can see the figures, you can see the money; it is kind of a joy – I put it in a way. I am very straightforward is because – If I don’t feel comfortable talking to you I won’t bother to come, I mean to pay a visit. [R]:    True. [J]:    That is why I come out straight direct to check what is the incentive, like that, you are going to give to me if let us say I introduce this case to you. Because like I said, I told you I have one private and I have another HDB, which is EA. He is selling as a divorce case. [R]:    What is EA? [J]:    Executive Apartment. … [R]:    What kind of incentive are you looking at? [J]:    It is like … what do I get? Like I say, some firm give me $200 but it is in terms of vouchers. Some give me holiday stays, which is at what … NTUC resort. So what … what do you giving [sic] if, let’s say I give you the case? What are you giving me? Of course I hope cash. But if you telling [sic] me that … if you give … if you give me other thing then is okay. Just curious, so what are you actually giving me if I refer the case to you? [R]:    You want a direct answer from me? [J]:    You … it’s not … you can’t tell me? No, no, it’s not – maybe you can hint me. I get hints very fast one don’t worry. I get hints very fast one. [R]:Actually, very honestly, we are not infavourof doing it. But … and also we do not know your company. We do not know you and I do not know who recommended you so I am kind of worried, you see. [J]:    Oh OK, I understand. I understand. I understand. I understand. That’s why yesterday when I called you, I thought that the … [R]:    Yes, I mean - [[R]scribbles something on a piece of paper and shows it to[J].] [emphasis added] 9       The respondent also said that disbursements were not included, and a further discussion followed on how her fees were calculated after deduction of disbursements and various other items. The respondent then went on to ask for details of the private property and who the non-citizen purchaser was. To this latter question, Jenny replied that the purchaser was the wife, who was not working. The respondent then commented that it should not be a problem because she had done a couple of “them”, meaning, presumably, that she had done a couple of such transactions. Finally, the respondent considered the various legal aspects of the transaction and then proceeded to offer Jenny some legal advice on the transaction. 10     Subsequently, Jenny mentioned the possibility of referring HDB transactions to the respondent and a discussion ensued between her and the respondent, first on the legal fees generally charged for ordinary property transactions and then on the firm’s fees for HDB transactions in particular. Jenny then informed the respondent that a colleague of hers was looking for lawyers to handle his HDB transactions. Jenny made it clear she was looking for lawyers to introduce to her “colleague”. Jenny then asked the respondent what fee she would receive if she referred a HDB sale or purchase transaction. The respondent replied that she would pay a flat referral fee of $100 per case. She wrote down “$100” on a piece of paper and gave it to Jenny. Again, it would be useful to set out the relevant portions of the Agreed Transcript: [J]:    For such HDB cases, the referral fees and incentives, are they still the same as what you have told me? [R]:[W]e fix it at this. [[R]scribbles on a piece of paper.] [J]:    Per case? [R]:    Ya, you know? [J]:    So whether selling or buying? [R]:    OK, fine. Can. [J]:    No, I just want to find out so that I can know what I will be getting later on. [R]:    But actually maybe we are very honest. Let us say for example your client, in the case where he is selling, if his is a normal HDB loan, he doesn’t need a private lawyer. HDB can handle itself for him. HDB’s fees are very cheap you know, very nominal. $200, $300. But if you want a private lawyer, then it may be, well $600 – $800. If he has no discharge of mortgage, then maybe I am prepared to do for $600. … [emphasis added] 11     Jenny then enquired who would handle the case if the respondent was not around, and whether the respondent’s partner could handle the case in her absence. The respondent explained that she and her partner usually went on holiday together, and said that they in fact took very little leave. She also explained that they had not travelled much in the recent years due to certain family circumstances. Jenny then asked if she would have a chance to meet the respondent’s partner, whereupon the respondent offered to introduce her partner. Jenny then said she had to rush off but the respondent said it would only take a minute. Jenny agreed and the respondent introduced Jenny to her partner. 12     The amended charge against the respondent was formulated by the Law Society on the basis of the Agreed Transcript.",
        "The DC hearing and findings": "13     Based on the above facts, the DC was appointed pursuant to s 90 of the Act and was convened to hear and investigate the complaints against the respondent on 10 October 2005.",
        "The Law Society’s case": "14     The Law Society’s case before the DC was that the respondent was guilty of attempting to procure employment of herself as an advocate and solicitor to act in a conveyancing matter or conveyancing matters by promising to pay a commission to Jenny in exchange for referrals. In support of this, the Law Society relied on the conversation between Jenny and the respondent at the meeting of 18 March 2004: (a)    When asked whether she would pay a referral fee for the conveyancing transaction which Jenny was proposing to refer to the firm, the respondent wrote “10%” on a piece of paper and gave it to Jenny. (b)    When queried further, the respondent clarified that “10%” referred to ten per cent of the professional fees the firm would receive from the client for the conveyancing transaction. (c)    When Jenny asked what referral fee she would receive if she referred an HDB sale or purchase transaction, the respondent replied that she would pay a flat referral fee of $100 per case and at the same time wrote down “$100” on a piece of paper and gave it to Jenny.",
        "The respondent’s case": "15     In turn, the respondent submitted that the amended charge was not made out because: (a)    the respondent could not have attempted to procure the alleged employment as she did not have the requisite intention; (b)    it was Jenny who attempted to procure remuneration for herself in return for promising to procure employment for the respondent; and/or (c)    the employment in respect of which the respondent allegedly agreed or promised to pay Jenny was fictitious.",
        "The DC’s findings": "16     The DC considered the respondent’s submissions (as set out in the preceding paragraph) and rejected all of them. In its report dated 5 October 2006 (“the DC Report”), the DC found the respondent guilty of the amended charge on the following grounds. 17     Firstly, the DC concluded that the objective evidence as contained in the Agreed Transcript showed that the respondent had the intention of procuring employment for herself by offering or promising Jenny incentives or remuneration in exchange for referrals. The DC found that the following circumstances set out in the Agreed Transcript disproved the respondent’s assertion that she was merely “playing Jenny along” as she had alleged, in that: (a)    she did not at any time reject the suggestion of referral fees outright or say that it was wrong for her to offer such fees; (b)    she not only indicated her willingness to pay a referral fee, she also gave legal advice on the private property transaction; and (c)    she introduced her partner to Jenny, contradicting her assertion that she had seen through Jenny’s plan to ensnare her by this time. 18     Secondly, the DC rejected the respondent’s submission that she did not attempt to procure the employment of herself to act in the conveyancing matter (as alleged in the amended charge), but rather it was Jenny who sought to employ her to act for the purchaser in that matter. On this issue, the DC noted that while it was certainly true that Jenny was egging the respondent on to indicate that she would agree to give referral fees, it did not follow from this that the respondent was not attempting to procure employment for herself. In this respect, the DC reasoned that the two offers were not mutually exclusive and were in fact flip sides of the same coin. The Agreed Transcript showed that while the respondent was initially cautious, she eventually overcame her suspicions, at which point she clearly offered Jenny an incentive with a view to getting the work for the private property and the HDB transactions. On this basis, the DC found that the respondent did attempt to procure employment for herself in exchange for promising remuneration to Jenny. 19     Thirdly, the DC found that the amended charge was made out notwithstanding that the purchase transaction offered by Jenny was fictitious. The DC was of the view that although it was impossible for the respondent to complete the purchase transaction because it did not exist, such factual impossibility was not relevant to a disciplinary charge of attempted procurement. The DC referred to the illustrations in s 511 of the Penal Code (Cap 224, 1985 Rev Ed), which show that even in a situation where the subject matter of an attempted theft does not exist, the accused can still commit the offence of attempted theft. 20     The DC was of the view that the crucial issue in the proceedings was whether the respondent had the intention to procure employment in exchange for an agreement or promise to remunerate Jenny. Once that intention was shown to exist, the charged was proved. Accordingly, the DC found the respondent guilty of the amended charge. 21     However, the DC also concluded that the respondent’s misconduct was not of sufficient gravity for disciplinary action under s 83 of the Act, but was instead a matter for which a penalty should be imposed under s 93(b) and so imposed a penalty of $7,000. In doing so, the DC found several mitigating factors, including: (a) the presence of considerable pressure and urging from Jenny before the respondent finally yielded to temptation and indicated what referral fees she would pay; and (b) there was no harm or injury done to any person or client in this case. 22     The Law Society disagreed with the DC’s conclusion on the gravity of the respondent’s misconduct and filed an application under s 94(3)(b) of the Act for the respondent to show cause why she should not be dealt with under s 83(2) of the Act. It would appear that the Law Society’s application was prompted by the decision of this court inLaw Society of Singapore v Tan Buck Chye Dave[2007] 1 SLR 581(“Dave Tan”), in which the advocate and solicitor in question was suspended from practice for six months on similar facts.",
        "The issues before this court": "23     Before us, counsel for the respondent stated that he would maintain the three same submissions canvassed before the DC (see [15] above). However, in addition to these submissions, counsel added that the respondent would also contend that the evidence obtained by Jenny in relation to the respondent’s agreement to pay referral fees for conveyancing transactions was not admissible in evidence as it was illegally obtained. Counsel relied on the law as stated by the High Court inSM Summit Holdings Ltd v PP[1997] 3 SLR 922(“Summit”). As we have mentioned earlier, this issue was not argued before the DC. It would appear that counsel for the respondent surfaced this issue before us as a result of the appeal against the decision of the High Court in the case ofWong Keng Leong Rayney v Law Society of Singapore[2006] 4 SLR 934(“Rayney Wong HC”) which was heard by the Court of Appeal inRayney Wong CA([2]supra) just before the show cause proceedings in this court. 24     Accordingly, the issues canvassed before this court, which we will deal with in turn, are as follows: (a)    whether the evidence that the respondent offered referral fees ought to be excluded on the basis ofSummit; (b)    whether the respondent had the requisite intention in attempting to procure employment from Jenny; (c)    whether it was in fact Jenny who attempted to procure remuneration for herself in return for promising to procure employment for the respondent; and (d)    whether the fictitious and non-existent employment which the respondent allegedly agreed or promised to remunerate Jenny precluded her from being found guilty of the amended charge. 25     The Law Society has additionally contended that in any caseSummit(which concerned a private prosecution) should not be applied to disciplinary offences as the objectives of a disciplinary code of conduct are different from the objectives of a penal code. In view of our findings on the issues set out in [24], it is not necessary for us to address this issue. In any case, the same issue had been considered and rejected by the Court of Appeal in its decision inRayney Wong CA.",
        "Whether evidence ought to be excluded – theSummitexception": "26     It is convenient to consider first the issue of the exclusion of Jenny’s evidence only because if her evidence were excluded, there would be no evidence to support the amended charge and any further discussion in relation to the other issues would be academic. InSummit, the applicants, SM Summit and Summit CD, applied to quash three search warrants granted to Business Software Alliance (“BSA”) to search the applicants’ premises for infringing copyright and trade mark material. The magistrate had issued the search warrants in reliance on information which included a statutory declaration made by JC, a private investigator, in which he stated that, among other things, he had handed over eight master CDs to the assistant manager of SM Summit to duplicate. Four of the masters were counterfeit copies and contained infringing copyright works and registered trade marks belonging to three of BSA’s principals,viz, Microsoft Inc, Adobe Systems Inc and Autodesk Inc. Summit CD duplicated the masters and delivered them to JC upon payment of the agreed price. In his statutory declaration, JC alleged that the applicants had been engaged in counterfeiting CDs. 27     BSA relied on the House of Lords decision inRegina v Sang[1980] AC 402 (“Sang”) where it was held that illegally obtained evidence was generally admissible as evidence except where its prejudicial effect exceeded its probative value. BSA pointed out thatSangwas applied by the Court of Appeal inHow Poh Sun v PP[1991] SLR 220and contended thatSummitwas inconsistent withSang. However, the High Court inSummitdistinguishedSangon the basis that the conduct (of the law enforcement officer) inSanghad merely induced the defendant to commit the offence he committed, whereas in the case ofSummit, JC’s unlawful conduct itself constituted an essential ingredient of the copyright and trade mark offences committed by the applicants. Reading these two holdings or propositions together, the ruling inSummitappears to be that where anagent provocateurcommits an unlawful act designed to bring about, and which brings about, the charged offence, and the unlawful act itself constitutes an essential ingredient of the charged offence, the evidence should be excluded (“theSummitexception”). 28     Counsel for the respondent submitted that JC’s statutory declaration was disregarded on the ground that he had engaged in unlawful conduct designed to bring about the copyright and trade mark offences that the applicants were alleged to have committed, and Jenny’s statutory declaration should be treated correspondingly in this case. However, as will be seen, it is not clear whether theSummitexception applies only to evidence of the preceding unlawful conduct or whether it also includes evidence of the charged offence. There is a critical difference between the two scenarios. Where the only element necessary for theSummitexception to apply is a preceding offence designed to bring about the charged offence, then theSummitexception is no different from the situation inSang.If it includes the additional element that the preceding offence must also be an essential ingredient of the charged offence, then theSummitexception is likely to apply in very few situations. As a matter of fact, theSummitexception is merely an application of the decision of the High Court of Australia inRidgeway v The Queen(1995) 184 CLR 19 (“Ridgeway”), which the High Court inSummithad acknowledged. However,Ridgewaywas concerned with an offence with essential elements that are very different from those in a copyright or trade mark offence.Ridgewayhas been considered in detail in the decision of this court inPhyllis Tan([2]supra). 29     Be that as it may, and even assuming that theSummitexception is good law (which is not: seePhyllis Tan), the respondent in the present case must show that the conduct of Jenny is the same or substantially similar to the conduct of JC inSummitin order to invoke the said exception.We will now consider the evidence and the related arguments of the parties. The parties’ arguments 30     On the issue of preceding unlawful conduct, the respondent’s arguments, as set out in her skeletal arguments, are as follows: 12.    Likewise in the present case, Jenny Lee was a private investigator, not a public law enforcement officer. By requesting for a referral fee for referring conveyancing work to the Respondent, it is submitted that Jenny Lee was procuring the Respondent to commit an offence under section 5(b) of the Prevention of Corruption Act (Cap 241) (“PCA”), i.e. of corruptly offering a gratification, in terms of the referral fees, as an inducement for Jenny Lee referring conveyancing work to the Respondent ... 13.    By instigating the Respondent to make the corrupt offer, Jenny Lee herself would appear to have committed an offence of abetment of the corrupt offer, which is criminalised under section 29 of the PCA ... read with section 107 of the Penal Code (Cap 224) ... 14.    Jenny Lee’s conduct and the conduct of the Respondent are intricately bound up together: they are in the words of the DC, “flip side of the same coin”. It is submitted that this case is similar toSummit …and the principle for exclusion of the entrapment evidence procured by Jenny Lee applies here. In short, the argument is that Jenny’s unlawful act of abetment preceded and was designed to bring about the offence committed by the respondent, and therefore falls within theSummitexception. 31     In this connection, counsel for the respondent also submitted that although he had conceded before the DC that he was not taking up the point on entrapment evidence, he was entitled to withdraw the concession as he was not bound by a concession on the law. However, it may be noted that the DC pre-empted this point of law in the DC Report in holding that illegally obtained evidence was generally admissible against the defendant, except in rare instances where the court would exclude such evidence if its prejudicial effect outweighed its probative value (citingHalsbury’s Laws of Singapore, vol 10 (Butterworths Asia, 2000) at para 120.453). 32     The Law Society’s submission on this point is that in the case ofRayney Wong HC([23]supra), where the facts are “on all fours” with the present case, the High Court decided that there was no reason for excluding evidence obtained in similar circumstances by Jenny (the same Jenny) against the appellant. The Law Society has also pointed out that, in that case, the High Court had the benefit of hearing counsel for the Attorney-General before concluding that the DC in that case had not been wrong in admitting Jenny’s evidence, despite it having been procured by a private agent and not a state agent. Conclusion in relation to the issue of unlawful conduct 33     In our view, theSummitexception does not substantially fit the facts in the present case. InSummit, the High Court was concerned with the preceding unlawful conduct of JC which was designed to and did bring about the copyright and trade mark offences, and that the preceding unlawful conduct was an essential ingredient (the masters themselves were counterfeit) of the targeted offences. On the facts of this case, it is not clear how Jenny’s alleged unlawful conduct (abetment) could constitute an essential ingredient of the respondent’s allegedly corrupt offer made to Jenny. Furthermore, inSummit, the copyright and trade mark offences were criminal offences whereas, in the present case, the “charged offences” are only disciplinary infractions which are not criminal offences. 34     Apart from these substantial factual differences, we find it surprising that counsel for the respondent has found it expedient to advance an argument in a form which implies that his client has committed the offence of corruption under s 5 of the Prevention of Corruption Act (Cap 241, 1993 Rev Ed) (“PCA”) (offering a gratification to Jenny) in an attempt to exculpate the respondent from a charge of professional misconduct which does not even involve any dishonesty or fraud on her part. This would be the consequence of the “both sides of the coin” analysis which the DC accepted in relation to the argument based on procurement (see [38] below). We assume that neither counsel for the respondent nor the respondent herself fully appreciated or thought through the import of this submission. 35     In our view, the evidence shows that Jenny’s stratagem was to spin a credible story to the respondent and give her the opportunity to react in the way that Jenny’s client anticipated the respondent would do,ie, agree to pay a referral fee, as that was what the firm was suspected to have engaged in. Jenny’s objective was to procure the evidence to expose the unprofessional activities of a group of solicitors. Jenny’smodus operandi, although it involved an element of persistency in persuading her targets to agree to pay referral fees, cannot be said to be corrupt under the law. The nature of bribery or corruption involves the inducement of a public official or a private party to do a favour in exchange for a bribe or gratification. These two elements,viz, the giving of a bribe for a favour, are essential to the offence of bribery or corruption. In the present case, as in the cases in the same series, Jenny was not seeking a favour from the respondent for which she would pay a bribe. She was, in fact, purporting to do a favour to the respondent by agreeing to bring conveyancing work to her in return for payment of a referral fee. It may then be thought that Jenny was trying to bribe the respondent with conveyancing work in order to receive a bribe (the referral fee). This could be what counsel for the respondent had in mind when he made the argument set out at [30] above. But, even then, in our view, Jenny’s offer was not a bribe or a corrupt act for two reasons. First, there was no corrupt intent on her part as her only objective was to expose the professional misconduct of the respondent. If the scheme had been implemented, she would have paid the respondent a fee for work done, from which she would receive a referral fee (as in the case ofRayney Wong CA([2]supra)). She would be out of pocket in receiving back only a portion of her own money. Second, the respondent’s ordinary practice was conveyancing; she was not being asked to do Jenny or any of her clients a favour by undertaking her normal business. The respondent would be doing a favour for herself, and not Jenny, in undertaking the conveyancing work offered to her. That leaves the question of Jenny seeking a payment. In our view, there was no corruption in Jenny seeking a reward for doing a favour to the respondent provided the favour was not at the expense of her (Jenny’s) client. What is wrong, professionally, is for the respondent to agree to pay a referral fee to Jenny. In our view, the argument that Jenny had committed an offence under the PCA has no merit. 36     Accordingly, we find that the facts in this case are qualitatively and quantitatively different from those inSummit. For this reason, the respondent’s argument based on theSummitexception fails.",
        "Whether the respondent had the requisite intention": "37     The respondent’s submission is that the DC did not refer to the standard of proof in concluding that the respondent was guilty of the amended charge, and had it done so, it was possible that the DC might not have concluded that the respondent had the requisite intention to procure the employment of herself to act in conveyancing matters. This argument implies that the DC failed to apply the criminal standard of proof only because it omitted to say expressly that it did apply such a standard. In our view, this is an unjustified assumption and, given the lack of particularity in the argument, we reject it.",
        "Whether it was the respondent or Jenny who attempted to procure employment": "38     The respondent’s next argument is that it was Jenny who attempted to procure remuneration for herself (Jenny) in return for promising to procure employment for the respondent, rather than the respondent attempting to procure employment for herself in return for promising to pay a referral fee to Jenny. In support of this argument, the respondent emphasised the “overwhelming manner” in which Jenny sought to procure an offer of remuneration from the respondent. Ultimately, she succeeded and although the respondent finally succumbed and made the offer of remuneration which Jenny was “assiduously fishing for”, it was submitted that it would be “morally and … legally wrong … for the Court to hold that the Respondent is guilty of having attempted to procure employment from Jenny”. The respondent further submitted that in contrast to Jenny’s persuasion and instigation, the actual procurement for which the respondent has been charged with was so trifling that it should “perhaps be ignored on the basis of the maximde minimis non curat lex”. 39     On the question of what amounts to “procurement” in law, counsel for the respondent referred to two decisions,viz,Attorney-General’s Reference (No 1 of 1975)[1975] QB 773 andR v Castiglione[1963] NSWR 1. In the first case, Lord Widgery CJ said (at 779): To procure means to produce by endeavour. You procure a thing by setting out to see that it happens and taking the appropriate steps to produce that happening. In the second case, Sugerman J said (at 6): Such [reported authorities] as there is suggests that some element of persuasion or inducement or influencing is essential … This accords with the meaning in general of the word “procure”, which imports effort, care, management or contrivance towards the obtaining of a desired end ... We accept counsel’s submission that there was procurement on the part of Jenny. She has procured evidence that the respondent was prepared to pay a referral fee for conveyancing work. To procure this evidence, she resorted to some degree of subterfuge (or deceit) and persistence in getting the respondent to agree to pay a referral fee. Jenny was not offering the respondentreal employment.She wasmerely pretendingto do so, and that was the entire purpose of her meeting with the respondent. The whole meeting was a sting operation to obtain evidence against the respondent to show that she was prepared to give referral fees in return for referred conveyancing work. However, by succumbing to Jenny’s offers, the respondent was also effectively attempting to procure employment for herself with respect to Jenny’s clients. As the DC has found, this is just the reverse side of the same coin. For these reasons, we also reject the respondent’s argument on this point. 40     With regard to the argument that the respondent was somehow “overwhelmed” by the persistence or blandishments of Jenny in offering her not only private sector conveyancing but also HDB conveyancing, implying that but for such acts, the respondent would not have agreed to pay a referral fee, we find it rather difficult to accept that a solicitor with 27 years of practice at the Bar could so easily be “overwhelmed” by Jenny’s persistent urgings into agreeing to pay her referral fees. In our view, the cautious attitude the respondent displayed during the meeting shows that she was ready and willing to pay referral fees if she was satisfied that there was no risk involved. The Agreed Transcript clearly bears this out, as found by the DC. In our view, this is a case of a fruit that was ripe for the plucking. 41     We note that, in this respect, the DC at para 98 of the DC Report has accepted as a fact that there was considerable pressure and urging from Jenny before the respondent finally yielded to temptation, and that “[i]t is possible that the Respondent might not have offered referral fees if she had not been so persistently urged to do so”. On this basis the DC found that there was “inducement and entrapment” but that they “are not defences”. However, no argument has been advanced to us that entrapment evidence is not admissible in evidence (except to the extent that it is subsumed in theSummitexception) or that the court should find that the use of the entrapment evidence is an abuse of the disciplinary process (as argued before the Court of Appeal inRayney Wong CA([2]supra)). 42     With respect to the argument that the procurement in the present case should be treated by this court asde minimis, we would say that it is the argument itself that isde minimis,and that counsel for the respondent should study, assiduously, the following passage from the judgment of V K Rajah J (as he then was) inRayney Wong HC([23]supra) as follows (at [85]): A failure by significant numbers of the legal profession to abide by and observe these ethical standards would eventually drive the entire profession down the slippery slope of ignominy. Systemic ethical corruption will fray and ultimately destroy the moral fibre of the profession. In a race to the bottom, legal practices will expend more and more valuable time and resources competing with and out-foxing each other for business rather than focusing their efforts on effectively delivering premier services to clients and appropriately discharging their wider obligations to the community. While legal practices are necessarily run as profit-making businesses, this does not, and cannot, mean that ethical constraints should be perceived as inconveniences to be either accepted or ignored at will. Solicitors who take their obligations and roles seriously should not be disadvantaged by the less scrupulous who do not.",
        "Whether the fictitious employment precluded a finding of guilt": "43     On this point, the respondent’s counsel has submitted that on a plain and literal reading of s 83(2)(e) of the Act (and without reference to s 511 of the Penal Code or the law of criminal attempts generally), the offence in that provision envisages an actual employment being procured or attempted to be procured by the solicitor charged. It has no application where the employment procured is fictitious or non-existent, and is therefore an impossible employment. 44     In our view, whilst as a matter of logic it may not be possible to procure the impossible, the law does not preclude an attempt to do something which is impossible. The essence of an attempt is theintentionto commit the offence. The illustrations contained in s 511 of the Penal Code make it clear that an attempt to commit an impossible offence is also an offence. Section 511 provides as follows: 511.Whoever attempts to commit an offence punishable by this Code or by any other written law with imprisonment or fine or with a combination of such punishments, or attempts to cause such an offence to be committed, and in such attempt does any act towards the commission of the offence, shall, where no express provision is made by this Code or by such other written law, as the case may be, for the punishment of such attempt, be punished with such punishment as is provided for the offence: Provided that any term of imprisonment imposed shall not exceed one-half of the longest term provided for the offence. Illustrations (a)Amakes an attempt to steal some jewels by breaking open a box, and finds after so opening the box that there is no jewel in it. He has done an act towards the commission of theft, and therefore is guilty under this section. (b)Amakes an attempt to pick the pocket ofZby thrusting his hand intoZ’spocket.Afails in the attempt in consequence ofZ’shaving nothing in his pocket.Ais guilty under this section. The illustrations show clearly that the non-existence of the subject matter of an offence does not preclude an attempt to commit it: see the decision of the High Court inChua Kian Kok v PP[1999] 2 SLR 542. Accordingly, we agree with the DC’s decision that the respondent’s argument on this point was misconceived.",
        "Our decision": "45     For the reasons given above, we find that the disciplinary charges against the respondent have been proved and accordingly we make absolute the show cause order. This leaves us with the question as to the appropriate penalty to be imposed on the respondent.",
        "Penalty to be imposed": "46     Unprofessional arrangements of the nature involved in the present case are not new. To determine the appropriate penalty to impose on the respondent, we need to consider the past practice of this court. Three particular cases are relevant. First, inLaw Society of Singapore v Lau See-Jin Jeffrey[1999] 2 SLR 215(“Lau See-Jin Jeffrey”), the solicitor in question had entered into a “service fee” arrangement with the complainant for the latter to procure the former’s employment as a developer’s solicitor for a commercial project in China. In suspending the lawyer from practice for a period of five years, this court had observed (at [40]) as follows: In the present case, we considered that whilst the respondent had not acted dishonestly in agreeing to pay … a commission for procuring his employment … he had fallen short of the integrity and impartiality which are to be expected of a solicitor.A mere censure would not suffice as a charge under s 83(2)(e) of the Legal Profession Act is a serious charge.… [We thus] ordered the respondent to be suspended from practice for a period of five years … [emphasis added] It should be noted that the solicitor in that case had received a considerable amount of commission under this arrangement. 47     In the second case,Law Society of Singapore v Lee Cheong Hoh[2001] 2 SLR 80(“Lee Cheong Hoh”), the solicitor had paid his employee a 10% commission for procuring legal business for himself in relation to motor repairers’ claims against third parties over a period of more than three years. In suspending the lawyer in question for a period of three years, this court held (at [46]) that: Comparing the position in the present case with that inLau See-Jin Jeffrey, the difference lies in the fact that the person to whom Lee had paid a gratification/commission was an employee, and that inLau See-Jin Jeffreythe payment was agreed to be made to a third party. Furthermore, the commission which was agreed to be paid inLau See-Jin Jeffreywas 30%, a much higher percentage than in this case. Therefore, the misconduct in the earlier case could be considered to be graver. But this was not to say that a mere censure against Lee would suffice. The misconduct of Lee remained serious.A clear message must be conveyed to the profession as a whole that such unprofessional and unethical conduct could not be condoned. It also undermined the integrity and dignity of the profession. Therefore, we considered that it warranted a period of suspension.Three years was what we felt would fit the wrongdoing. [emphasis added] It should also be noted that the evidence before the court showed that the solicitor inLee Cheong Hohhad also received a considerable amount of fees under the arrangement although the judgment did not give any figures. 48     Finally, inDave Tan([22]supra), the solicitor had offered monetary incentives to individuals who had referred conveyancing work to him. In sentencing the said practitioner to a suspension of six months, this court observed (at [29]–[31]) as follows: … [T]the facts inLaw Society of Singapore v Lee Cheong Hohcan be distinguished from those that existed in the present proceedings. As inLaw Society of Singapore v Lau See-Jin Jeffrey…, the lawyer inLaw Society of Singapore v Lee Cheong Hohvigorously contested the charges levelled against him despite the clear objective facts to the contrary. It bears emphasising, once again, that the respondent in the present proceedings pleaded guilty to the charges concerned at the first available opportunity and never followed through on any of the proposed transactions. His conduct throughout, whilst not excusable, was, however, quite different from that of the lawyers inLaw Society of Singapore v Lau See-Jin JeffreyandLaw Society of Singapore v Lee Cheong Hoh. Balancing the overriding public interest considerations with what mitigating factors that could legitimately be taken into account in favour of the respondent, we made the show cause order absolute and suspended the respondent from practice for six months, and ordered that he bear the costs of the proceedings both before this court as well as in the tribunal below. We should add, however, that there were strong mitigating factors in the present case. If they had not been present, we would have been compelled to impose an even more severe sanction on the respondent. [emphasis added] 49     In view of the above, it will be observed that the respondent had not readily pleaded guilty despite the overwhelming evidence against her, in the form of the Agreed Transcript obtained from the video recording taken by Jenny. The mitigating factors material to the conclusion reached inDave Tanwere thus not as readily present in this case. 50     In our view, this case is slightly more serious thanDave Tanwhere Dave Tan had pleaded guilty readily. But it is much less serious than the cases ofLau See-Jin Jeffrey([46]supra) andLee Cheong Hoh([47]supra) where the arrangements were carried out for some time and money was paid for procuring legal work. In the case ofLee Cheong Hoh, the solicitor concerned was procuring legal work over a period of five years. In the circumstances, as the respondent in this case has been found guilty of one disciplinary charge ofattemptingto procure conveyancing work, we are of the view that an appropriate penalty would be nine months’ suspension from practice, effective immediately, to reflect the comparatively lower gravity of the respondent’s misconduct, and we so order.The respondent must also bear the costs of the proceedings both before the DC and this court."
    }
}