{
    "case_title": "Ong & Ong Architects Pte Ltd and Another v Yee Wei Chi and Another",
    "ncitation": "[2007] SGHC 109",
    "coram": "Dorcas Quek AR",
    "sections": {
        "The facts": "1          This case presents an intriguing conundrum concerning how the timing for application for summary judgment is affected by the addition of a new party to an action. In the present case, the relevant summary judgment is that of the defendants’ Counterclaim. 2          The undisputed facts are relatively uncomplicated. The original parties to the suit are the two defendants and the first plaintiff. The last pleading to be filed, the Reply and Defence to Counterclaim, was filed on 9 February 2007. It is the plaintiffs’ case that pleadings were then deemed to be closed 14 days after this date, i.e. on 23 February 2007. According to O 14 r 14 of the Rules of Court, the last day for the defendants to file for summary judgment on their Counterclaim was 28 days thereafter, on 23 March 2007. 3          At a pre-trial conference on 23 February, counsel for the first plaintiff indicated that they would apply to amend the Statement of Claim to add a new party. This summons (SUM 1020/2007) was filed on 9 March. I granted leave for the second plaintiff to amend on 26 March and gave consequential directions on the filing of the other amended pleadings. The plaintiffs’ Reply and Defence to Counterclaim (Amendment No. 1) was filed on 26 April. The defendants’ counsel assert that pleadings were deemed to be closed 14 days later, on 10 May, and that the last day to file for summary judgment was 7 June (28 days later). He submits that their summary judgment application against both plaintiffs, which was filed on 4 June (SUM 2413/2007), was well within time. 4          The plaintiffs, relying principally on Tay Yong Kwang J’s decision inUnited Engineers (Singapore) Pte Ltd v Lee Lip Hiong and others[2004] SLR 305,have applied to strike out the summary judgment application against both the first and second plaintiffs. The defendants’ summons included a second prayer to strike out certain paragraphs of reply and defence to counterclaim on the grounds that it was frivolous, vexatious and/or an abuse of process. The plaintiffs have also applied to strike out this prayer.",
        "The issues": "5          There are three issues to be determined: (a)        Whether closure of pleadings under O 18 r 20 is postponed by the amendment of pleadings; (b)        Whether closure of pleadings under O 18 r 20 is postponed by the addition of a new party; and (c)        Whether the defendants’ application under O 18 r 19 also ought to be struck out. 6          Issues (a) and (b) impinge on two conflicting concerns. The first is the necessity for the time of closure of pleadings to be determined with certainty. O 18 r 20 identifies when pleadings are deemed to be closed: (1)        The pleadings in an action are deemed to be closed — (a)  at the expiration of 14 days after service of the reply or, if there is no reply but only a defence to counterclaim, after service of the defence to counterclaim; or (b)  if neither a reply nor a defence to counterclaim is served, at the expiration of 14 days after service of the defence. 7          The time for closure of pleadings is a reference point for a few deadlines set out in the Rules of Court. Tay Yong Kwang J, at [33] of his decision inUnited Engineers,noted in this regard that: … O 18 r 20(1) fixes the deemed closure of pleadings with certainty so that it can fulfil its function as a reference point for the reckoning of time for one-time amendments to the writ of summons or the pleadings without leave of the court (O 20 rr 1 and 3); for the taking out of a summons for directions (O 25 r 1); and for the operation of automatic directions (O 25 r 8). There is also, at the close of pleadings, an implied joinder of issue on the pleading last served (O 18 r 14(2)(a)). 8          Since various timelines are predicated on the time for closure of pleadings, parties must be certain as to when time for automatic directions, application for summons for direction or application for summary judgment starts running. If pleadings may be “re-opened” intermittently, certainty will be compromised. Timelines for various events will also be constantly modified. 9          On the other hand, there is an equally compelling concern that all issues in dispute between the parties ought to be settled before pleadings are deemed to be closed. Extraneous events, such as amendment of pleadings or the addition of new parties, may very well add a new complexion to the dispute amongst parties. In such circumstances, the plaintiff would desire another opportunity to apply for summary judgment based on the latest issues in dispute. Alternatively, he may want to wait till a later time before applying for summary judgment. The deadline to make such an application is set out in O 14 r 14: No summons under this Order shall be filed more than 28 days after the pleadings in the action are deemed to be closed 10        A plaintiff who wishes to wait or to have a further opportunity to obtain summary judgment would be in favour of a “malleable” time for close of pleadings or one which may continually be postponed by extraneous events. However, an intrinsically flexible time for close of pleadings will invariably lead to uncertainty. The balance between these two concerns is not an easy one to strike. 11        With this backdrop in mind, I proceed to consider the three issues in turn.",
        "Issue (a): Whether closure of pleadings under O 18 r 20 is postponed by amendment of pleadings": "",
        "The decision in United Engineers (Singapore) Pte Ltd v Lee Lip Hiong": "12        Although Tay J had decided inUnited Engineersthat amendments of pleadings do not postpone closure of pleadings, the defendants have cast doubt on this decision. Defendants’ counsel argues thatUnited Engineerscontradicts Tay J’s earlier decision inChun Thong Ping v Soh Kok Hong[2003] 3 SLR 204, which suggests that summary judgment should not be applied for until after all the pleadings have been amended. InChun Thong Ping,the plaintiff appealed against the registrar’s decision to grant the second defendant unconditional leave to defend. He also applied to amend his Statement of Claim. Tay J held that where a plaintiff amended his Statement of Claim materially after the Defence has been served, he should not take out a summary judgment application until after the defendant had an opportunity to amend his Defence. 13        This apparently contradictory decision has already been adequately dealt with by Tay J inUnited Engineers.At [41], Tay J stated that the relationship between an amendment of pleadings and the time bar in O 14 r 14 did not arise inChun Thong Pingand that case must now be construed in light of the latest decision inUnited Engineer. 14        Furthermore, Tay J at [34] ofUnited Engineershad set out adequate reasons why amendment of pleadings should not re-open pleadings afresh, which I concur with: If an amendment is made with leave of the court after the deemed closure of pleadings and that leads to the postponement of the deemed closure, we would have the very curious situation of an amendment requiring leave of the court resulting in the parties again having the liberty to amend once without leave of the court. Similarly, assuming the plaintiff in an action has already taken out a summons for directions after pleadings are deemed to be closed and the pleadings are then amended with leave of the court. If the deemed closure of pleadings is postponed as a result, we would have an absurd situation where the plaintiff is required to take out another summons for directions after the second deemed closure. 15        The first reason in the above paragraph warrants further elaboration. It is anomalous if parties, by virtue of an amendment granted by the court, have an opportunity to amend their pleadings under O 20 r 3 without obtaining the leave of the court. This would mean that every time the court grants leave for amendment, the parties will not be required to seek the court’s leave for the next round of amendments. The limitation as to when a party can amend pleadings without obtaining leave of the court will be rendered illusory and meaningless. 16        Furthermore, the purpose of O 14 r 14 will be utterly defeated if the time for closure of pleadings were to be postponed every time an amendment is made. InUnited Engineer, Tay J had, on a purposive reading of Order 14, decided that O 14 r 14 had been introduced to “impose an absolute point beyond which no application for summary judgment may be taken out”. It is common for parties amend their pleadings more than once. Leave to amend may also be granted by the court “at any stage of proceedings” under O 20 rr 5 and 8. If such frequent amendments repeatedly postpone the time for closure of pleadings, there will be no certainty as well as no finality to the actual time for closure of pleadings. 17        In addition, there were ample authorities (Pleadings: Principles and Practice by Sir Jack Jacob QC and Iain S Goldrein;Hackwell v Blue Arrow Plc,the Times, 18 January 1996 andBannister v SGC plc[1997] 4 All ER 129) cited inUnited Engineersto buttress Tay J’s decision that amendment of pleadings do not re-open pleadings once they have been deemed closed. As such, I am not inclined to accept the argument that amendments made by the plaintiffs postponed close of pleadings.",
        "The decision in Sumikin Bussan Corp v Hiew Tech Seng": "18        Defendants’ counsel has also contended that the time for deemed closure of pleadings is not absolute. To support this contention, Judith Prakash J’s decision inSumikin Bussan Corp v Hiew Tech Seng[2005] 2 SLR 773was cited. However, I find this decision distinguishable as it was premised on quite different grounds. The plaintiff in that case obtained an extension of time to file a reply to each of the defendant’s Defences. Theraison d’etreof Prakash J’s decision was that the extension of time to file a reply resulted in pleadings not being closed until the expiry of the extended time. This is reflected in [15] of Prakash J’s decision: The framers of the Rules were also aware that O 3 r 4 allows the court to extend or abridge the period within which a person is required by the Rules to do any act in proceedings and therefore that the court has power to grant an extension of time for filing all types of pleadings including a reply. This power to grant an extension of time to file pleadings has been part of the court’s complement of powers for a long time and the effect that such an extension of time can have on an action is well known. The comment by the editors of theSingapore Civil Procedure 2003at paragraph 28/20/2, that whenever the time for service of a reply or defence to counterclaim has been extended by the court or by parties,the pleadings are not deemed to be closed until the expiry of such further time, though not buttressed by the citation of case authority,is a statement that reflects a well-established and long-held view of the law. It is a statement that has been found in similar form in successive editions of the EnglishSupreme Court Practice(Sweet & Maxwell) in relation to O 18 r 20 of the English Rules of the Supreme Court. (emphasis added) 19        Based on the above reasoning, O 18 r 20 did not apply until the further time for the relevant pleading – in this case the reply – had expired. In my view, this decision should be circumscribed within the specific narrow parameters which Prakash J was careful to delineate; it should only apply to cases in which the court has granted an extension of time to file a pleading which has yet to be filed in the proceedings. The extension in time results in     O 18 r 20 being construed according to the extended timelines. Hence, Prakash J’s carefully worded decision does not change Tay J’s decision concerning amendments of pleadings. 20        Defendants’ counsel relies on this case to suggest that time for close of pleadings is not static. While Prakash J did refer to “a moving deemed closure of pleadings” at [16], I do not construe her decision to stand for the proposition that there was more than one point of time for closure of pleadings. Prakash J in the above paragraph had clearly held that pleadings were not closeduntilthe expiry of the extended time. This suggests that there was onlyone timefor deemed closure of pleadings under O 18 r 20. In contrast, in the case of amendment of pleadings, the time for closure of pleadings would already have crystallised under O 18 r 20, as all the necessary pleadings would have been filed. Imposing a postponed time for deemed closure of pleadings will result in the problems adverted to above in [14] to [16]. I therefore disagree with the defendants’ submission that the decision inSumikincontradicts the case ofUnited Engineerand supports the contention that time for deemed closure of pleadings can be postponed by amendments. The plaintiffs’ amendments to their statement of claim did not postpone the time for closure of pleadings.",
        "Issue (b): Whether closure of pleadings under O 18 r 20 is postponed by the addition of a new party": "21        There has been no decision on this novel issue thus far. The amendments which the plaintiff made were essentially to add the second plaintiff to the action. Defendants’ counsel has relied on Andrew Ang J’s decision inVestwin Trading Pte Ltd v Obegi Melissa[2006] 3 SLR 573to submit that in a single action with multiple parties, pleadings would close against each defendant on the same date. 22        InVestwin Trading, there were eight defendants in the action. The eighth defendant was the last party to file its Defence. The plaintiffs made only one summary judgment application against all eight defendants, and the first to seventh defendants argued that the application was out of time as against them. Andrew Ang J disagreed, holding at [12] to [13] that there could only be one closure of pleadings in any action: That cannot be the case. Otherwise, the consequences would be that in a case such as this, where there are multiple parties in foreign jurisdictions and with the attendant delay in effecting service: (a)   close of pleadings will occur for each defendant on a different date; (b)   the time stipulated for taking out the summons for directions will expire as against each defendant on a different date; (c)   the plaintiff must therefore take out as many summonses for directions as there are defendants or risk being out of time; (d)   the court must give separate directions at separate hearings as regards how the plaintiff is to progress the action to trial as against each defendant; and (e)   in a personal injuries matter, different sets of automatic directions would take effect automatically, with different sets of deadlines running as against each defendant under O 25 r 8. Such outcome cannot have been intended. It is contradicted by the words of O 18 r 20 which contemplate onlyoneclose of pleadings in any given action and of O 25 r 1 which contemplate onlyonesummons for directions in any given action. Likewise, O 14 r 14 refers to an “action” in the singular form. 23        Andrew Ang J further reasoned that “it cannot be said that the matters in issue in the action have been properly crystallised until the last defendant has filed in its defence”. In Ang J’s opinion, requiring separate applications for summary judgment would lead to multiplicity of actions and wastage of costs. 24        I note that Ang J’s decision finds support in the English case ofBannister v SGB plc[1997] 4 All ER 129.The English court had to consider when pleadings closed for the purpose of calculating the time for automatic directions, which was 14 days after closure of pleadings under Order 17 rule 11 of the County Court Rules. Saville LJ opined as follows at [4.2] and [6.8]: 4.2 In an action commenced in the county court,pleadings are deemed to be closed14 days after the delivery of a defence in accordance with Ord 9, r 2 or, where a counterclaim is served with the defence, 28 days after the delivery of the defence (r 11(11)(a)). A defence is delivered in accordance with Ord 9, r 2 when it is delivered at the court office (Ord 9, r 2(6)). If all the original defendants deliver a defence the trigger date is calculatedfrom the date the last defence was delivered. The trigger date is not altered if a defence is later amended. … 6.8 The second difficulty to which we have referred has been partly resolved by the judgment of this court in Peters v Winfield, Churchill v Forest of Dean DC [1996] 1 WLR 604. There the court ruled that thetrigger date is to be calculated from the date of delivery of the last defence to be delivered by a defendant who was originally joined in the proceedings. (emphasis added)",
        "Whether Vestwin is distinguishable": "25        The pertinent question is whether the above principle applies to the instant case, such that the pleadings are deemed to be closed only 14 days after the first and second plaintiffs’ amended Reply and Defence to Counterclaim had been filed. This situation is somewhat different from a case when all the two plaintiffs werepresent from the very start of proceedings.Pleadings had already “closed” against the first plaintiff, before the court granted leave for the second plaintiff to be added. These circumstances did not arise at all inVestwin Trading,as all eight defendants were in the original action; new defendants were not added intermittently. 26        The UK court inBannisterrecognised this crucial distinction between: (a)        cases in which all parties concerned are in the original action; and (b)        cases in which new parties are subsequently added. 27        The court was aware that uncertainty would prevail if pleadings were re-opened in the latter situation. It therefore did not apply the earlier principle that pleadings would only close after the last defendant’s defence (or any subsequent pleadings) was filed, holding at [6.11]: So far as the third difficulty is concerned, if the trigger date has in fact been finally determined for the action as originally constituted (following the setting aside of any default judgment, if relevant), we are of the clear opinion that the rules make no provision for automatic directions to start running completely afresheach time a further defendant is joined to the action by later amendment.A timetable has now been set for the action, and since a plaintiff has to obtain an order from the court pursuant to Ord 15, r 1 if an additional party is to be added or substituted, that is the occasion when a prudent plaintiff will seek an order amending the original timetable. Alternatively, such a direction may be obtained at any time before the guillotine date. This is the procedure which was clearly envisaged by this court inPeters v Winfield, where its observations to this effect did not form part of its decision, and in our judgment it is clearly right. Otherwise time would start to run afresh automatically as soon as any newly joined defendant served a defence, without any occasion for the court to be able to exercise any control over the timetable. We cannot believe that this is what the draftsman of the rule intended. (emphasis added) 28        In my opinion, this distinction was correctly made. A fundamental difference between the two situations is that the time for closure of pleadings would have crystallised with respect to the original parties in situation (b). If closure of pleadings were postponed by the addition of parties atany stageof the proceedings, all the above problems relating to postponement of closure of pleadings due to amendments arise, namely: (a)        The parties will again be allowed to amend their pleadings once without obtaining leave of the court; (b)        If a summons for directions had been filed in relation to the first defendant, new summons for directions would be required to be filed again with respect to the new defendant. (c)        There will be a new set of automatic directions, if O 25 r 9 applies. (d)        More importantly, if the plaintiff had made a summary judgment application against the original defendant, he would be entitled to file another summary judgment application against the first defendant (together with the new defendant). 29        The last consequence is probably the most significant. In light of the clear pronouncement inUnited Engineersthat the time for applying for summary judgment cannot be extended, there can only beoneapplication for summary judgment and no “second bite at the cherry”. Otherwise, the addition of parties at any stage of the proceedings will revive the right for a plaintiff to have another opportunity to apply for summary judgment. In a similar vein, the court inBannisterrealised that there would be tremendous uncertainty if time ran afresh every time a new defendant was added; the automatic directions would be repeatedly changed. The court therefore opined that that could not have been the intention of the draftsman. 30        Moreover, there are no pressing reasons to file for summary judgment at a later time because a new party is added. In the case of amendments, it can at least be argued that the amendments have altered the basis of the claim and a second application for summary judgment is warranted. (This argument is however, trumped, by the problems a postponement in closure of pleadings would cause). In contrast, when a new defendant is added, the claim against the original defendant has not altered. There is no reason for the plaintiff, apart for convenience’s sake, to wait until pleadings are filed with respect to the other defendant, before applying for summary judgment against the first plaintiff.",
        "Where a new party is added before pleadings have closed against the first plaintiff": "31        The outcome would have been different if the second plaintiff was addedbeforepleadings closed against vis-à-vis the first plaintiff. The principle inVestwinshould apply and pleadings should then close at a later stage. Since there has been no crystallisation of the time for closure of pleadings, the above problems I projected will not arise. I find support for my conclusion in the reasoning of Saville LJ inBannisterat [6.11]: ..if thetrigger date has in fact been finally determined for the action as originally constituted(following the setting aside of any default judgment, if relevant), we are of the clear opinion that the rules make no provision for automatic directions to start running completely afresh each time a further defendant is joined to the action by later amendment. (emphasis added) 32        The trigger date for automatic directions inBannisterwas 14 days after close of pleadings. The court did not deem it just that new automatic directions should apply after the first trigger date for automatic directions had been determined. There is no elaboration on whether the court meant that the date of closure of pleadings should have crystallised, or whether the date for automatic directions had crystallised. I find that the relevant “cut-off” date should be thetime for the closure of pleadings. According to the Rules of Court, there are different “trigger dates” for automatic directions, summons for directions and summary judgment applications. They all have closure of pleadings as their common reference point. Hence, once the date for closure of pleadings has crystallised, all these trigger dates will be determined. Before such time has arrived, there will be no prejudice or difficulties for closure of pleadings to be fall on a later date because a new party has been added at an early stage. Once this time has passed, there will be inconvenience and uncertainty engendered by the setting of new trigger dates. 33        In the present case, pleadings were deemed closed against the first plaintiff on 23 February. The new plaintiff was then added on 26 March. Hence, the time for closure of pleadings as against the first plaintiff was not postponed by the addition of the second plaintiff. The defendants’ summary judgment application against the first plaintiff was therefore filed out of time and must be struck out.",
        "The second plaintiff": "34        The second plaintiff was not part of the proceedings when pleadings were deemed to be closed against the first plaintiff. It will be ludicrous to conclude that the last date for the defendant to apply for summary judgment against the second plaintiff was 23 March, before the second plaintiff was a party to the action. Further, the amended Counterclaim against the second plaintiff, as well as the second plaintiff’s Reply to Counterclaim, had yet to be filed when the time for summary judgment against the first plaintiff had expired. The defendants should only be required to file for summary judgment of their Counterclaim after the second plaintiff’s Defence to Counterclaim had been filed: O 14 r 1. It is therefore illogical to hold the defendant to an earlier deadline for its application for summary judgment against the second plaintiff. 35        Even in the case ofVestwin,Andrew Ang J considered only two options: (a) whether closure of pleadings against all defendants should be linked to closure of pleadings against the last defendant to file the defence; or (b) whether there were to be separate closure of pleadings in respect of each defendant. It was inconceivable for closure of pleadings against the last defendant to be premised on an earlier closure of pleadings in relation to other defendants. Hence, the deadline in relation to the second plaintiff in this case must be 28 days after closure of pleadings against this plaintiff, namely, 7 June 2007. 36        There are now two deemed closures of pleadings against the first and the second plaintiffs. This result appears to contradict Andrew Ang J’s decision inVestwinthat there should be only one closure of pleadings against all defendants in a case.Nonetheless, I have earlier noted that Andrew Ang J’s decision was made on the basis that there were more than one defendant from the start of the proceedings. 37        Moreover, the problems listed by Andrew Ang J are not insurmountable. First, Andrew Ang J noted that separate summons for directions had to be taken out in relation to each defendant. Once a new defendant is added, this step is unavoidable; any previous summonses for directions filed against the first defendant cannot possibly apply to the new defendant. Second, Andrew Ang J stated that different automatic directions would apply to different defendants, if the case involves personal injury. Again, when a new defendant enters the proceedings, he cannot be held to the earlier automatic directions. With regard to the complication that different directions will apply to different defendants, the English court inBannisterstated at [6.11] that “if an additional party is to be added or substituted, that is the occasion when a prudent plaintiff will seek an order amending the original timetable (of directions)”. The court was following the approach adopted in an earlier case inPeters v Winfield, Churchill v Forest of Dean DC[1996] 1 WLR 604 where Bingham MR also commented that the plaintiff should seek a variation in the court’s original timetable when a new defendant is added. Hence, postponement of any automatic directions with regard to the first plaintiff may be easily obtained. It will also be open to the defendant to ask for the later set of directions with regard to the second plaintiff to apply to the first plaintiff. 38        As such, the summary judgment application is not struck out against the second plaintiff.",
        "Whether extension of time to file summary judgment against the first plaintiff should be granted": "39        I recognise that in some situations, supervening events may alter the legal or factual basis of a claim, as was the case inTechmex Far East Pte Ltd v Logicraft Products Manufacturing Pte Ltd[1998] 1 SLR 483. In such circumstances, the plaintiff may find it unjust that he is unable to wait till all the issues are crystallised before he applies for summary judgment. I have decided above that the time for close of pleadings may not be easily altered by such events as this will result in too much uncertainty. It seems then that the court, instead of moving the time for deemed closure of pleadings, should extend time to file an application for summary judgment in such cases. 40        However, Tay J had concluded inUnited Engineersthat a purposive interpretation of O 14 r 14 made it necessary to conclude that the time bar to apply for summary judgment was an absolute one that could not be extended by the court. In Tay J’s opinion, the purpose of the introduction of this rule on 1 December 2002 was to establish an “absolute point beyond which no application for summary judgment may be taken out”. 41        I agree with Tay J’s opinion at [26] that this purpose would be negated if the court has to hear applications for extension of time and appeals emanating therefrom. I note thatTechmex Far East Pte Ltdwas decided in 1998, before O 14 r 14 was introduced in 2002. Chao Hick Tin J (as he then was) decided that a plaintiff could not be estopped from bringing a second summary judgment application if the factual or legal basis of a claim had been altered because of amendment to the pleadings. Chao J also remarked thatwhat would constitute a new factual or legal basis must vary from case to case.Therein lies the difficulty if the court were to grant extension of time in exceptional cases. There will be numerous situations in which the court has to assess whether the basis of the claim has been drastically altered. Satellite litigation concerning this issue will invariably occur. This will ultimately dilute the overall intention underlying O 14 r 14 – to provide for an absolute and certain deadline beyond which summary judgment applications cannot be made. Hence, in the absence of any clear provisions on when an extension of time to file a summary judgment application can be granted, the court should not exercise this power so as not to undermine the rationale underpinning O 14 r 14. The plaintiff in each case should have to resort to other provisions (O 18 r 19, O 27 for instance) when it has exhausted its opportunity to apply for summary judgment. 42        In any event, even if the court had the power to extend time, the circumstances in this instant case do not warrant such an extension. It was plain to the defendants that the hearing of the application to add the second plaintiff would fallafterthe deadline for the defendants to file summary judgment against the first plaintiff. On the day before the time for filing for summary judgment expired, there were still no new circumstances which had altered the basis of their claim against the plaintiff. The amendments had yet to be allowed; the new plaintiff was still not added in the proceedings. The defendants were not justified in letting the time under O 14 r 14 expire. They should have proceeded to file their summary judgment against the first plaintiff first to preserve their rights. If they were concerned that there would have been amendments such that the basis of the claim against the first plaintiff would have changed, the defendants could have sought leave to file the supporting affidavit under O 14 r 2 at a later time. If necessary, the parties could also request for this summary judgment application to be heard together with the subsequent summary judgment filed against the second plaintiff. In short, they were not entitled to simply wait on the assumption that the courtcould havegranted the plaintiffs’ application to add a new party at a later time. 43        I am also not convinced that the addition of the second plaintiff and the other amendments made to the statement of claim had modified the nature of the dispute between the parties. The addition of a new plaintiffper sedid not change the defendants’ existing Counterclaim against the first plaintiff. It was still alleged that the defendants were employed by the first plaintiff and had breached their duties owed to the first plaintiff. Hence, the defendants could still file for summary judgment against the first plaintiff. The other amendments made were also minor in nature; again the basis of the claim against the first plaintiff was not fundamentally altered. The only significant difference was the addition of a new party and the averment to a relationship between the first and second plaintiffs as associated companies. This could have been dealt with in the defendants’ subsequent summary judgment application against the second plaintiff. As I stated above, it was possible for arrangements to be made for both summary judgment applications to be heard together. As such, even if I could have granted the defendants an extension of time to file summary judgment against the first plaintiff, I would have declined to grant it.",
        "Issue (c): Whether the defendants’ application under O 18 r 19 also ought to be struck out.": "44        Prayer 2 of the defendants’ summons is for certain paragraphs of the plaintiffs’ Reply and Defence to Counterclaim to be struck out under O 18 r 19. Plaintiffs’ counsel have submitted that the court should also strike out prayer 2 against both plaintiffs based on the Malaysian decision inMohd Azam Shuja & Ors v United Malayan Banking Corporation Bhd[1995] 2 MLJ 851. The plaintiffs in that case had also filed a summons with two alternative prayers, namely for striking out of the defendant’s defence under O 14 r 21 of the Subordinate Courts Rules 1980, and alternatively, for summary judgment under Order 26A. The Malaysian Court of Appeal held at 858 that the plaintiff could not proceed with two prayers for striking out and summary judgment in one application: I entirely agree with Siti Norma Yaakob J and Haidar J that a plaintiff cannot proceed with both prayers for striking out and for summary judgment in one application. The reasons are obvious. Firstly, under O 26A of the SCR the primary emphasis is on the affidavit. No defence need be filed. In an application under O 14 r 21 of the SCR, there must be a statement of defence. Secondly, in an application under O 26A, the court has to decide whether there are triable issues which ought to be tried. 45        This issue concerns a matter of practice instead of substantive legal principles. I agree that there are different bases to an application for summary judgment and an application for striking out, though both may have the same effect. The decision to include both prayers in one summons is essentially motivated by a desire to save costs by applying for one, instead of two summonses. However, for practical purposes, the court will have to consider the entire application as if two summonses for two applications were filed. The time involved and the costs awarded would be similar to that of two summonses for summary judgment and striking out respectively. For greater clarity and efficient administration, one should not simply make a few unrelated applications which have different legal bases in a single summons. It is, of course, legitimate to include more than one prayer in the alternative if there is a logical link between them. An application for stay of proceedings, for instance, is often followed by an alternative prayer seeking extension of time to file a Defence. There is no such link here as the summary judgment and striking out applications are two discrete ways of obtaining judgment. I therefore agree with the Malaysian decision on the basis that it is good practice for the sake of efficient administration and clarity to file separate summons for unrelated applications. 46        In relation to the summons against the first plaintiff, I have already struck out the prayer for summary judgment as being filed out of time. The remaining prayers will be the O 14 application against the second plaintiff, and the prayer for striking out against both defendants. Based on the above reasons, I will strike out prayer 2 and order the defendants to file a separate summons for striking out against both plaintiffs. I also order that the time for the filing of such summons be backdated to the initial date of their summons. Any supporting affidavit for striking out should also be filed together with the new summons. The parties are at liberty to agree as to whether the application for striking out may be heard together with the summary judgment against the second plaintiff, or heard separately.",
        "Conclusion": "47        In the premises, only prayer one of the defendants’ summons (SUM 2413/2007) is struck out as against the first plaintiff. Prayer one still remains as against the second plaintiff. Prayer two is struck out against both plaintiffs, and the defendants are to file a new summons under O 18 r 19 against both plaintiffs. I will hear parties’ submissions on costs."
    }
}