{
    "case_title": "Brightway Petrochemical Group Singapore Pte Ltd v Ang Lily",
    "ncitation": "[2007] SGHC 154",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Background": "2       On 22 December 2006, the appellant offered the respondent the position of “Accountant”. The letter of offer stated that she would report directly to the “Financial Manager”. It further stated that:- Your monthly salary will be S$3000 and your probation period will be 3 months. Your monthly salary will be S$3500 after completion of probation. The Company has the right to relocate you and to terminate your employment with 30 days advance notice. 3     The respondent started work on 8 January 2007. It was not disputed that there existed a contract of service on the terms stated in the letter of offer. On 24 January 2007, the appellant terminated the respondent’s employment without giving her any prior notice. She had worked for only 2 ½ weeks and was still under probation at the time of termination. 4       Although the respondent’s services were terminated on 24 January 2007, her salary was paid until 31 January 2007. As such, the respondent was given 7 days’ pay (for the period from 25 January 2007 to 31 January 2007) in lieu of notice. However, the respondent took the position that she should be paid 30 days’ salary in lieu of the 30 days’ notice of termination stipulated in the letter of offer. As the dispute arose out of a term in the contract of service, the respondent lodged her claim with the Commissioner of Labour for the balance of 23 days’ salary (approximately 3 weeks’ salary) owed to her by the appellant. 5       A hearing was convened on 18 April 2007 under s 115 of the Act to inquire into the respondent’s complaint. The ACL allowed the respondent’s claim and awarded her the sum of $2,250[note: 1]being 3 weeks’ salary on the basis that:- (a)    the respondent was an employee within the meaning of the Act; (b)    since a 30 days’ notice was expressly provided for in the letter of offer, s 11(1) of the Act would apply; and (c)    the respondent was entitled to one month’s salary in lieu of the notice of termination.",
        "The issues in this appeal": "6       The following issues were raised by the appellant:- (a)    Whether the respondent was an “employee” as defined in the Act; (b)    Whether the notice period during probation was the same as that after confirmation, i.e. 30 days; and (c)    Whether the Commissioner of Labour had the power to inquire into the respondent’s complaint.",
        "Was the respondent an employee as defined in the Act?": "7       Counsel for the appellant (“counsel”) submitted that the respondent was an employee who was employed in a managerial, executive or confidential position. As such, she fell outside the ambit of the Act and the order of the ACL should be set aside on this ground alone. 8       Section 2 of the Act defines an ‘employee’ as: a person who has entered into or works under a contract of service with an employer and includes a workman… butdoes not includeany seaman, domestic worker, or any person employed in amanagerial, executive or confidential position…[emphasis added] 9       The appellant submitted that the respondent had admitted that she was employed as an “Accountant” and that was her job description/designation. Her job responsibilities included setting up the company accounts, which would require the expertise of a trained accountant. It would necessarily involve the possession of information relating to the financial position as well as the business transactions of the employer. 10     Counsel contended that the high salary paid whilst she was still on probation showed that hers was not merely a clerical position but one which required the employee to exercise managerial and executive functions. The respondent was not employed to fill a merely administrative position. Counsel further submitted that the accountant was “foundational” to the appellant’s growing business as the appellant was just starting operations. The respondent was the only accountant employed by the appellant at that time and she was expected to carry out all the functions expected of a competent accountant, including setting up the company’s accounts, which would necessarily give her access to information that would have an impact on the appellant’s trade or performance. The fact that the respondent did not carry out her duties as an accountant was a result of her incompetence rather than the “pompous title” given to the respondent. 11     I did not agree with counsel’s submission that the respondent was employed in a managerial, executive or confidential position. Halsbury’s Laws of Singapore [Vol 9, Employment (LexisNexis, 2007 Reissue, 2007)] states at footnote 13 in paragraph 100.002: The description ‘managerial, executive or confidential’ position although not defined by the said Act, must be ascertained from the terms, express or implied of the contract of employment, and includes those relating to the remuneration, designation and responsibilities of the employee as well as his qualifications. 12     Hence, all relevant factors must be taken into consideration, each given its appropriate weight. The respondent testified that she reported to the Finance Manager, which indicated to me that she was playing more of a supportive role although her designation stated in the job offer letter was “Accountant”. According to the respondent, she was in a new set up with only two of them in the Finance Department, namely, the Finance Manager and herself. Clearly, she did not have any supervisory functions nor any staff under her charge. The respondent further testified that her work involved setting up the company’s accounts, filing of vendor bills, issuing cheques, preparing payment vouchers, creating petty cash and payment voucher forms, booking air tickets for the staff, arranging for interviews for candidates for the operation manager, making enquiries of the medical checkup procedures and performing other duties assigned by the Finance Manager. Even though setting up the company’s accounts was one aspect of her work, I believed that she would probably be doing so under the direct supervision of the Finance Manager, whom she reported to. 13     She said she did not deal with salary or budgetary matters. There was no evidence that she had access to the appellant’s classified information or trade secrets. 14     After considering all the relevant circumstances and the nature of her employment, I came to the same conclusion as the ACL that the respondent’s duties and responsibilities were predominantly administrative and non-confidential in nature. 15     At the appeal hearing, I queried whether the respondent had a degree in accountancy, but was informed that she was a diploma holder. This fortified my view that she was not employed in a managerial, executive or confidential position, although I accepted counsel’s contention that the higher the salary, the less likely it would be a clerical position. But this was not the only factor that I had to take into account. On the whole, there was no reason for me to disturb the ACL’s finding that the respondent came within the definition of “employee” in the Act. 16     Before dealing with the next issue, I would briefly address some of counsel’s submissions. I could not find evidence to support counsel’s contention that the respondent’s failure to carry out her duties as an accountant was in fact the result of her “incompetence”, thus implying that it was only after the respondent was found incompetent that her job scope was reduced to a clerical or administrative nature. What was in evidence was that at 6 pm on 24 January 2007, she was called up. The respondent was then told that she was “not suitable” for the company and that she need not come to work the next day. The respondent asked for reasons but was not given any. I did not think that this evidence could reasonably support any inference that her original job scope was in fact managerial or executive in nature but was subsequently changed because of her incompetence. The Admin and HR Manager, Ms Lew, who represented the appellant had the opportunity at the hearing before the ACL to explain why the respondent was “not suitable” for the company and to state what the respondent’s job scope was originally intended to be and how it had to be changed due to her incompetence, if indeed the events had turned out that way. However, nothing along those lines was said by Ms Lew. In fact, when the ACL asked Ms Lew if she agreed with the evidence of the respondent in relation to the description of her duties and job scope, Ms Lew simply responded that she had “no objection”.",
        "Requisite notice period": "17Appellant’s counsel contended that the notice period of 30 days in the letter of offer was not applicable to the respondent as she was still under probation. It was applicable only to confirmed employees. Counsel relied on the evidence of Ms Lew that the notice period during probation (like the salary) was different for a confirmed employee. He then submitted that the one week’s pay in lieu of notice was more than sufficient in the present case as it accords with the common law. He citedTerence William Walsh v Peregrine Systems Pte Ltd[2003] SGHC 117(“Terence William Walsh v Peregrine”) where it was held by Tan Lee Meng J that: In the absence of any provision in an employment contract governing the notice period, an employee is entitled to reasonable notice of the termination of his employment contract. As for what is reasonable in each case, matters which are relevant include the nature of the employment, the period for which the employee was engaged, the employee’s length of service and the periods at which the employee was paid his remuneration. 18     In Terence William Walsh v Peregrine, the claimant had worked for 6 months and it was held that one month’s notice was not unreasonable. In the present case, counsel submitted that one week’s pay in lieu of notice was reasonable as the respondent had worked for only 17 days. 19     Counsel then referred me to s 10(2) of the Act which provides that: The length of such notice shall be the same for both employer and employee and shall be determined by any provision made for the notice in the terms of the contract of service, or, in the absence of such provision, shall be in accordance with subsection (3). 20     Section 10(3) provides that: The notice to terminate the service of a person who is employed under a contract of service shall be not less than — (a)    one day’s notice if he has been so employed for less than 26 weeks… 21     Relying on s 10(3) above, counsel submitted that in the absence of a notice clause for employees under probation, one day’s notice was sufficient notice to terminate the employment of the respondent who had worked for much less than 26 weeks. 22     I did not have to decide this issue as my decision below on the lack of jurisdiction of the ACL was sufficient to dispose of this appeal. I would only go so far as to say that I was inclined towards the legal position taken by the ACL, that 30 days’ notice for termination had to be given or in the alternative, the appellant would have to pay the respondent “a sum equal to the amount of salary at the gross rate of pay which would have accrued to the employee during the period of the notice” as required by s 11(1) of the Act. There is no salary ceiling prescribed for s 11(1), unlike that for s 33, Part IV and s 115. That the respondent was under probation did not take her outside the protection that s 11(1) afforded to her as an “employee” as defined in the Act. 23     The ACL reasoned that if the appellant intended a different notice period of termination to apply for persons under probation, this ought to have been explicitly provided for in the job offer letter. There was nothing from the evidence of either party suggesting that a different notice period even existed. She saw no basis to suspend the operation of the notice clause until the probation was over. She also pointed out that s 10(3) of the Act was not applicable as there was indisputably an express provision in the job offer letter that the termination notice should be 30 days. Where there is an express provision in the contract of service, as in this case, s 10(2) clearly spells out that the length of notice shall be determined by the provision made for the notice of termination in the terms of the contract of service itself. 24     The ACL was also mindful of the contra proferentum rule that any ambiguity should be resolved against the party drafting the terms, which in this case was the appellant. However, she was of the view that that there was no ambiguity in the interpretation of the clause providing for the termination notice period.",
        "Commissioner’s power to inquire into complaints under Section 115": "25     The power of the Commissioner for Labour (“Commissioner”) to inquire into and decide any dispute between an employer and his employee is governed by s 115 of the Act. 26     Section 115 provides as follows:- Commissioner’s power to inquire into complaints. 115*[note: 2]. —(1) Subject to this section, the Commissioner may inquire into and decide any dispute between an employee and his employer or any person liable under the provisions of this Act to pay any salary due to the employee where the dispute arises out of any term in the contract of service between the employee and his employer or out of any of the provisions of this Act, and in pursuance of that decision may make an order in the prescribed form for the payment by either party of such sum of money as he considers just without limitation of the amount thereof. (2)    The Commissioner shall not inquire into any dispute in respect of matters arising earlier than one year from the date of lodging a claim under section 119 or the termination of the contract of service of or by the person claiming under that section: Provided that the person claiming in respect of matters arising out of or as the result of a termination of a contract of service has lodged a claim under section 119 within 6 months of the termination of the contract of service. (3)    The powers of the Commissioner under subsection (1) shall include the power to hear and decide, in accordance with the procedure laid down in this Part, any claim by a subcontractor for labour against a contractor or subcontractor for any sum which the subcontractor for labour claims to be due to him in respect of any labour provided by him under his contract with the contractor or subcontractor and to make such consequential orders as may be necessary to give effect to his decision. (4)    In this section, “employer” includes the transferor and the transferee of an undertaking or part thereof referred to in section 18A. 27     One could reasonably assume that the corollary that flows from the footnote in the Act for s 115 is that s 33, Part IV and s 115 of the Act shall not apply to “other employees” who are in receipt of a salary exceeding $1,600 a month. The next question that comes to mind is: who are these “other employees”? 28     To find that out and to test that corollary, I looked at s 33 and Part IV of the Act both of which, like s 115, have a similar footnote to restrict the ambit of those sections. 29     Section 33 states as follows:- Priority of salary to other debts. 33*[note: 3]. —(1) This section shall apply to all workmen and to other employees who are in receipt of a salary not exceeding $1,600 a month (excluding overtime payments, bonus payments, annual wage supplements, productivity incentive payments and any allowance however described) or such other amount as may be prescribed by the Minister. 30     This section indicates that “workmen” is placed in one category and “other employees” is put into another category. “Workmen” is defined in the Act. However, it is not entirely clear as yet from the wording in s 33(1) whether the $1,600 salary ceiling qualifies both categories, or qualifies only the “other employees” category but not the “workmen” category. However, after reading the footnote in the Act that is applicable to s 33(1), I am inclined to interpret that the salary ceiling applies only to “other employees” for the purpose of s 33 but not to “workmen” at all. Workmen or manual labourers drawing a salary exceeding $1,600 remain covered by s 33. This helps to throw light on the meaning of the footnote in s 115, which is in exactly the same terms. 31     I turn next to Part IV of the Act which reads as follows:- PART IV*[note: 4] REST DAYS, HOURS OF WORK, HOLIDAYS AND OTHER CONDITIONS OF SERVICE 35.    The provisions of this Part shall apply — (a)    to workmen; and (b)    to employees who are in receipt of a salary not exceeding $1,600 a month (excluding overtime payments, bonus payments, annual wage supplements, productivity incentive payments and any allowance however described) or such other amount as may be prescribed by the Minister. 32     The structure of Section 35 makes it abundantly clear that all “workmen” have to be treated as a separate category of employees, who are not to be subject to any salary ceiling, whereas “other employees” who are not workmen are to be subject to the salary ceiling as stipulated in s 35 (b) and in Part IV’s footnote. Hence, s 35 clearly rules out the application of Part IV for employees, who are not workmen and who are in receipt of a salary exceeding $1,600 a month. Therefore, employees who are not workmen and who draw a monthly salary of $1,600 and below, are covered by Part IV. However, all workmen irrespective of their salary levels are covered by Part IV. 33     Parliament saw it fit to have the safeguards and benefits, for instance in relation to the number of rest days, hours of work, holidays and other working conditions, set out in Part IV apply to all employees earning $1,600 and below per month, and also to all workmen even though their salaries may exceed $1,600 a month. Parliament had carved out from the operation of selected provisions of the Act (namely s 33, Part IV and s 115 of the Act) those “other employees” who are not workmen drawing salaries exceeding $1,600 per month. It does not however follow that as a result, the other parts of the Act no longer apply to employees (as defined in s 2 of the Act), who are not workmen and who earn more than $1,600 a month. Where relevant, those other sections in the Act will continue to apply to them. 34     After considering the structure of the Act and the uniform application of the footnotes to s 33, Part IV and s 115, I concluded that s 33, Part IV and s 115 do not apply to employees who earn a salary exceeding $1,600 and who are not workmen. 35     This interpretation is supported by the Minister’s speeches recorded in the parliamentary reports for the sitting on 25 July 1994, which concerned the then raising of the salary ceiling in the Act. The Minister for Labour (Dr Lee Boon Yang) said:- ... the monthly salary ceiling in the Employment Act was last raised in July 1992 from $1,250 to $1,500. The salary ceiling applies only to non-manual employees, and is used to decide whether they are entitled to the statutory benefits stipulated in Part IV of the Employment Act. Based on this salary ceiling, non-manual employees whose monthly salary does not exceed $1,500 are entitled to these benefits which include: payment for overtime work, work on rest day and public holiday, annual leave, sick leave and maximum hours of work allowed. For non-manual employees with a monthly salary exceeding $1,500, the benefits stipulated in Part IV do not apply to them. Their entitlement to such benefits is dependent on what is agreed upon in their contracts of employment with their employers. For other protection and benefits such as claim for arrears of salary, termination of service and maternity benefit, they are covered under other provisions of the law. Sir, manual workers, on the other hand, are covered by all provisions of the Employment Act regardless of their salaries, similar to that of non-manual employees with a monthly salary not exceeding $1,500. The revision to the salary ceiling in 1992 allows more workers to be protected by the law. About three-quarters of the workforce are now given basic protection. Those covered include: employees holding junior positions such as administrative and clerical staff, service and sales personnel, production workers and machine operators. New graduates from the polytechnics are also protected by the higher ceiling. Managers, executives and professionals who are able to negotiate their own terms and conditions of employment are excluded from the coverage. ... Dr Lee Boon Yang: ... The salary ceiling is also applicable to section 115 of the Act. Currently, section 115 empowers the Commissioner for Labour to adjudicate claims arising from the provisions of the Employment Act and from employment contracts by non-manual employees who fall within the prescribed salary ceiling of $1,500 and all manual workers. It has been the practice of the Ministry to settle their disputes through conciliation. When they have problems with their employers, they can come to us and we will try to conciliate between the aggrieved employee and the employers. It is only after our conciliation has not been successful and we cannot find an amicable settlement that we take one step further by registering their claims for adjudication in the labour court. They could proceed to seek adjudication of their claims if they cannot resolve it amicably through conciliation. For the non-manual employees earning more than $1,500 per month, up to now, we can only provide them with our conciliation service, because the Commissioner, as the law stands, has no jurisdiction under section 115 to adjudicate their claims. Should the conciliation fail in such a case, ie, a non-manual employee earning more than $1,500 and has a problem with the employer and we cannot resolve it through conciliation, under the present situation, he would have to seek legal recourse on his own at the courts. 36     I agreed with the submission of counsel for the appellant that the ACL had erred in holding an inquiry pursuant to the respondent’s complaint as the respondent was not a “workman” and her salary was beyond the ceiling of $1,600 per month. Consequently, the ACL had no power to inquire into the respondent’s claim as s 115 of the Act only applies to non-workmen employees when they are in receipt of a salary not exceeding $1,600 a month.",
        "Requirement for leave of court to appeal to the High Court": "37     Towards the end of the hearing, counsel informed me that he had not obtained leave of the court to appeal against the decision of the ACL. He referred me to s 117 of the Act and s 21 of the Supreme Court of Judicature Act (Cap 322, 2007 Rev Ed), which I now set out below: (a)    Employment Act Right of appeal. 117. In the event of any person interested being dissatisfied with the decision or order of the Commissioner, he may, within 14 days after the decision or order, file a memorandum of appeal therefrom in the High Court; for the purposes of any such appeal, the decision or order of the Commissioner shall be deemed to be a decision of a District Court. (b)    Supreme Court of Judicature Act Appeals from District and Magistrates’ Courts 21. —(1) Subject to the provisions of this Act or any other written law, an appeal shall lie to the High Court from a decision of a District Court or Magistrate’s Court in any suit or action for the recovery of immovable property or in any civil cause or matter where the amount in dispute or the value of the subject-matter exceeds $50,000 or such other amount as may be specified by an order made under subsection (3) or with the leave of a District Court, a Magistrate’s Court or the High Court if under that amount. 38     If the respondent had brought her claim in the Magistrate’s Court and the decision of the Magistrate was appealed against, then s 21 of the Supreme Court of Judicature Act would apply as the amount in dispute would be below the prescribed ceiling. Leave of court would be required for an appeal to the High Court. 39     Here, the respondent lodged her claim with the Commissioner under the Act. The appellant’s right of appeal was governed by s 117 of the Act. Section 117 sets out its own procedure in that within 14 days after the decision or order of the Commissioner, the appellant has to file a memorandum of appeal therefrom in the High Court. Section 117 does not prescribe that the prerequisite leave of the District Court or the High Court must be obtained prior to filing the memorandum of appeal in the High Court if the subject matter of the dispute is $50,000 and below. As such, I took the view that no leave of court was required for an appeal brought under s 117 of the Act. 40    If I were wrong on this and that leave was indeed required as the amount in dispute was only $2,250, I would nevertheless have granted the appellant leave to appeal to the High Court as it involved a matter concerning the jurisdiction of the Commissioner to hear the complaint, and the legality of the order made. It was not merely an appeal against the decision on the merits of the respondent’s claim.",
        "Conclusion": "",
        "Order set aside": "41     As the ACL had exceeded her jurisdiction, I accordingly set aside her order dated 18 April 2007 made under ss 115 and 119 of the Act in respect of the respondent’s claim.",
        "Costs": "42     Counsel asked for costs to be awarded to the appellant after I allowed the appeal. An appellant whose appeal is allowed would normally be granted his costs. However, this was not a case that I would be minded to exercise my discretion in favour of the appellant. The amount in dispute was very small. I was not with the appellant’s counsel on a number of his arguments apart from the jurisdictional point in relation to the salary ceiling for non-workmen, which was determinative of the appeal. The respondent, who was not legally represented at the appeal, made no submission to oppose any of the legal arguments made by counsel on the lack of jurisdiction. She was also in no position to do so. She only addressed the court for a few minutes, explaining why she should be entitled to the remaining 3 weeks of her salary. At the hearing below, the appellant did not object to the jurisdiction of the ACL to hear the matter. It was a fresh point raised at the appeal. Under these circumstances, I decided that it was fair and appropriate that each party should bear his own costs. Accordingly, I made no order as to costs.",
        "Observation": "43     I would like to make the observation that in moving forward from here, the parties should act reasonably, and exercise some flexibility and pragmatism to resolve the matter expeditiously without the need to go through the formal legal process, and thereby avoid incurring further time, effort and expense in the process. After two rounds, the parties are essentially back to square one over a small monetary dispute. Does this mean that the respondent is now to pursue the matter in the Subordinate Courts, which will become the third round? Perhaps, the parties should take heed of how the ACL had decided on the merits of the case (never mind that I had set aside her decision) in order to settle the matter out of court. I would add that any of my comments in this judgment on the arguments of counsel pertaining to the merits of the case are not intended to be binding in any way, should the respondent decide to file her claim in the Subordinate Courts in the absence of a settlement. [note: 1]I noted that an approximate formula was used in the computation rather than the relevant prescribed formula in the Third Schedule of the Act, which should have been used had the Act applied to this case. In any event, the difference in the amount is not significant.[note: 2]*Section 33, Part IV and section 115 of the Act shall apply to other employees who are in receipt of a salary not exceeding $1,600 a month. — vide S 425/95 wef 1.11.95[note: 3]*Section 33, Part IV and section 115 of the Act shall apply to other employees who are in receipt of a salary not exceeding $1,600 a month. — vide S 425/95 wef 1.11.95[note: 4]*Section 33, Part IV and section 115 of the Act shall apply to other employees who are in receipt of a salary not exceeding $1,600 a month. — vide S 425/95 wef 1.11.95"
    }
}