{
    "case_title": "TT v TU",
    "ncitation": "[2007] SGHC 78",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "[EDITORIAL NOTE: The details of this judgment have been changed to comply with the Children and Young Persons Act and/or the Women's Charter]": "23 May 2007 Lai Siu Chiu J",
        "The background": "1       The petitioner TT (“the Wife”) and the respondent TU (“the Husband”) were married on 25 April 1993. The Wife was granted a decree nisi on 8 March 2005 on her divorce petition based on the Husband’s unreasonable behaviour. The Husband and the Wife are presently 42 and 38 years old respectively. The Husband is a Malaysian citizen while the Wife is a Singaporean. 2       The couple have two children: a daughter now aged 9 and a son now aged 7. With the consent of the Husband, the Wife has interim custody, care and control of the two children. By an order of court dated 30 July 2004, the Husband was granted interim access. By another order of court dated 1 November 2004, the Husband was granted weekly access as well as access on public holidays and during the children’s school vacations in March, June, September and December. By a second order of court made on 30 July 2004 (“the interim maintenance order”), the Husband was ordered to pay the sum of $4,000 per month as interim maintenance for the Wife and the children. The Wife and the Husband appealed against the interim maintenance order. Both appeals were dismissed on 18 November 2004. By a third order of court made on 17 October 2005, the interim maintenance sum of $4,000 was reduced to $2,750. On appeal by the Wife to a judge in chambers in the High Court on 30 November 2005, the interim maintenance figure was revised to $3,000. 3       On 19 January 2007, the ancillary matters relating to custody, maintenance and division of the matrimonial assets came up for hearing before me. I madeinter aliathe following orders after hearing the parties’ counsel: (a)    the parties would be given joint custody of the children with care and control to the Wife; (b)    access by the Husband to the children would be in accordance with the order of court dated 1 November 2004; (c)    the Husband’s weekday access (on Fridays) was varied together with his vacation access; (d)    the Husband was allowed telephone access to the children; (e)    the Husband was to continue to pay the Wife $3,000 per month by way of maintenance apportioned as to $1,600 for the daughter, $1,300 for the son and $100 for the Wife; (f)     if the children required special medical and/or dental treatment including but not limited to surgical procedures and braces, the Husband should pay for such treatment and in the event the children’s tuition fees were increased from their present rates, including tuition for Chinese, English and Mathematics, the Husband should pay the increase upon verification with the respective tutors; (g)    the matrimonial property at, Parkshore, (‘the Parkshore property”) would be sold in the open market within 90 days of my order pending which the Husband would continue to service the mortgage instalments and all outgoings as well as pay the renovation loan. The net sale proceeds would be divided between the Husband and the Wife in the ratio of 70:30; (h)    the property at Bayshore (“the Bayshore property”) would be sold forthwith with tenancy and the gross sale proceeds would be refunded pro-rata to the parties’ CPF accounts in accordance with the CPF Rules and Regulations with the parties bearing the cost of sale and incidental expenses equally; (i)     the Husband was allowed to retain his two Malaysian properties and the Wife was allowed to retain her assets ut the Husband would pay the Wife a lump sum of $260,000 as follows: (i)     $100,000 by end February 2007; (ii)   the balance of $160,000 by end April 2007; (j)     the Husband was to pay to the Wife by end February 2007 costs of hearing on the ancillary matters fixed at $5,000; (k)    the parties were to have liberty to apply. The Husband has appealed against my orders in paras 3(e), (f), (i) and (j) in Civil Appeal No. 18 of 2007. 4       Pursuant to the liberty to apply provision in the order of court made on 19 January 2007, the Wife’s solicitors requested a further hearing. I acceded to the request and heard the parties again on 22 February 2007. I then increased the Wife’s monthly maintenance sum of $100 to $600 and awarded costs of the hearing to her fixed at $800. The Husband has filed a second appeal (in Civil Appeal No. 27 of 2007) against my decision.",
        "The affidavits": "5       The Wife filed five affidavits of means while the Husband filed ten, with the ninth and tenth affidavits being filedafterthe first hearing on 19 January 2007. The Husband’s ninth affidavit was filed on my direction, as I required him to disclose additional documents after the first hearing on 19 January 2007. His tenth affidavit was filed without leave of court and was strongly objected to by counsel for the Wife. After she left the matrimonial home (the Parkshore property) on 12 March 2004 with the children, the Wife moved in with her parents while the Husband continued to reside at the Parkshore property. The Wife alleged that she moved out from the Parkshore property because of the Husband’s physical violence, which caused her to be hospitalised from 3 to 22 May 2004 and to undergo physiotherapy for her shoulder injury. As the Husband’s appeal pertained to my awards of maintenance and division of the matrimonial assets and not custody of or access to the children, I shall focus only on the contentious issues in my review of the parties’ affidavits. 6       The Wife is employed as an advertising programmes manager at a monthly salary of $7,250 (excluding transport allowance of $1,000). She disclosed the following assets in her affidavits: (a)    two insurance policies with Prudential Assurance Company Singapore Limited (“Prudential”), one an endowment policy for $50,000 with a surrender value of $13,862.27 and the other an investment linked policy with a surrender value of $44,306. The Wife has two other Prudential policies which she purchased using $15,000 from her CPF savings (special account). She further purchased a fifth Prudential policy for $10,000 using her CPF savings (ordinary account); (b)    $13,601.88, $22,046.60 and $30,000 in her ordinary, special and Medisave CPF accounts respectively, as at 8 June 2005; (c)    approximately $15,000 in two bank accounts; (d)    three branded watches and a ring worth a total of $10,000; (e)    joint ownership of the Parkshore property. 7       The Wife deposed that she had paid $40,000 from her own savings towards the purchase price ($930,000) of the Parkshore property in 2002 while the balance (about $120,000) of the 10% deposit came from the profits from the sale of the couple’s previous matrimonial home. The Wife claimed to have paid another $30,000 to $40,000 for “soft” furnishings such as curtains, plants and decorations for the Parkshore property. (This was not denied by the Husband save that he disputed her figures, contending she spent $10,000.) The Parkshore property was mortgaged to Hongkong & Shanghai Banking Corporation (“HSBC”) for a loan which monthly instalments the Husband serviced. The Wife estimated the Parkshore property to be worth about $760,000. The Husband had been in exclusive occupation of the same since she moved out in March 2004. 8       The couple also jointly owned the Bayshore property for which purchase in 2003 the Wife withdrew $238,471.33 (excluding interest) from her CPF account. A loan was also taken from HSBC to fund the purchase which monthly instalments the Wife serviced from her CPF account. The Wife deposed that the rental income (of $2,350) was taken by the Husband. 9       The Wife deposed that the children’s monthly expenses totalled $6,894 being $3,944 for the daughter and $2,950 for the son. Her expenses came to $11,346 while household expenses were another $4,137.92 per month. Consequently, the interim maintenance amount of $4,000 was clearly insufficient. The Wife claimed a total of $16,500 as monthly maintenance for herself ($9,200), the daughter ($4,000) and the son ($3,300). I shall return to the subject of the family’s and the individuals’ expenses later. 10     The Wife asked for the Parkshore and Bayshore properties to be sold and that she be given a share therefrom; it would enable her to purchase a private apartment comparable to the Parkshore property, as accommodation for herself and the children as she could not reside with her parents indefinitely with three persons crammed into one room. 11     The Wife painted a picture (while married) of having led a comfortable average middle-class lifestyle with the Husband. It was not however a lifestyle of the rich or upper middle class. The Wife deposed that she no longer had nor could she afford her previous lifestyle due to the Husband’s meanness after the parties separated. For instance, while he owned a motor vehicle (a Toyota Camry) which he purchased in 2005 to replace a previous car (a Toyota Harrier) which had been stolen in Malaysia in December 2003, she no longer had the use of any car and relied on taxis as transport for herself and the children. She no longer had the use of a supplementary Visa gold credit card with a credit limit of $9,000. The Husband had also refused to pay for the maid’s salary and levy. She therefore had to bear both items of expenditure after March 2004. 12     The Husband was (from February 2006 onwards) the Chief Executive Officer (“CEO”) of an advertising company (“present company”) earning a gross monthly salary of $12,100. In his first affidavit of means filed on 27 May 2005, he deposed he had the following assets:- (a)    joint ownership of the Parkshore and Bayshore properties. The Husband had utilised $100,231.56 (excluding interest) from his CPF savings for the purchase of the Parkshore property; (b)    rental income (net) from the Bayshore property of $699 per month; (c)    a Malaysian property jointly owned with his brother (“the brother”) located at Putri Palm, Putrajaya (“Putri Palm”), with rental income (net) of RM2.81 per month. The Putri Palm property had an estimated value of RM300,000. It was mortgaged to Maybank and the outstanding loan amount was RM295,337 (as of Dec 2004); (d)   another Malaysian property at Mont Kiara Pelangi Kuala Lumpur (“Mont Kiara property”), also mortgaged to Maybank which loan outstanding was RM169,119 (as of December 2004) and had an estimated value of RM400,000; (e)    the Toyota Camry bought on hire purchase and worth an estimated $88,000; (f)     seven insurance policies, four were with Prudential, one was with HSBC, another with American International Assurance Company Limited (“AIA”) and the last was with United Overseas Insurance (not United Overseas Bank (“UOB”) as the Husband deposed); (g)    shares in 12 companies listed on the Singapore Stock Exchange (“SGX”) with a total value of $27,588.21. (h)    5,000 stock options from his previous company (“previous company”) worth $5,000; (i)     unit trusts in two funds worth $10,936.73; (j)     six bank accounts with insubstantial funds; and (k)    $81,987.99, $30,351.16 and $70,718.09 in the ordinary, Medisave and Special accounts respectively of his CPF account. 13     The Husband claimed his monthly expenses totalled $9,743.78 excluding the maintenance obligation of $4,000. 14     The Husband deposed he made direct contributions towards the following matrimonial assets:- (a)    the Parkshore property - $100,231.56; (b)    the Bayshore property - $228,829.00; (c)    the Mont Kiara property – 100% and (d)    Putri Palm – 50%. 15     Over and above his direct financial contributions, the Husband claimed he made indirect contributions towards the above four properties by taking charge of all the work incidental to renting out the properties ([in the case of (b) to (d)]) and by taking charge of banking and loan-related issues and renovations ([in the case of (a)]). 16     The Husband deposed that the maintenance order of $4,000 was made in August 2004 when he was earning $16,280 per month (working for the previous company) whereas he was earning $4,180 less with his present company. He was therefore unable to afford to pay $4,000 maintenance and claimed to have been surviving on his savings. The Husband pointed out that the Wife was capable of supporting herself on her salary of $8,500 per month and therefore there should be no maintenance order in her favour. The Husband offered less than $3,000 by way of maintenance for the children and reiterated that he wanted joint custody of them with care and control to the Wife but with generous access to him. 17     The further affidavits that were filed by the parties in these proceedings centred on the Husband’s initial affidavit of means and subsequent affidavits. The Wife took issue with the Husband’s declared assets contending his affidavits were inadequate and he had failed to give full disclosure. Consequently, she applied for and was granted discovery in Summons No. 10858 of 2005 (“the Discovery application”) requiring the Husband to disclose a comprehensive list of documents. 18     On his part, the Husband applied by Summons No. 8501 of 2005 (“the Variation application”) to reduce the interim maintenance sum of $4,000 on the basis that he had lost his job with his previous company and there was a change in his circumstances – he no longer earned $16,280 a month. The Variation application was allowed on 17 October 2005 and the Husband was ordered to pay a reduced sum of $2,750 as interim maintenance to the Wife and children with (retrospective) effect from 1 February 2005. The Wife appealed against the reduction to a judge in chambers in the High Court. The Wife’s appeal was allowed on 30 November 2005 and the interim maintenance sum was revised to $3,000 per month. 19     The Husband’s current earning capacity as well as his assets was a hotly contested issue and took up the greater part of the hearing before me. 20     In her (second) affidavit filed on 11 November 2005, the Wife pointed out that the Husband was not just an employee but was also a director and shareholder of his present company; he had contributed to its paid-up capital as well as advanced to the company shareholder’s loans. A search on the company conducted in the Accounting and Corporate Regulatory Authority (“ACRA”) register showed that there was a new shareholder (“the new shareholder”). The share capital of the Husband’s present company was increased to $50,000 with the admission of the new shareholder. 21     Contrary to the Husband’s claim that the tenant of the Mont Kiara property would be moving out at end May 2005, the documents disclosed by the Husband in the Wife’s discovery application showed that the tenancy was for two years from 31 January 2004 to 30 January 2006 at RM4,000 per month rental. 22     The Wife pointed out that the Husband had failed to disclose (until ordered by the Discovery application) that he received sums of $75,639 and $48,395 from the Husband’s previous company in March and July 2004 respectively, before the interim maintenance order dated 30 July 2004 ( see [2]) for maintenance at $4,000. He had also failed to disclose a sum of $30,068 that his previous company paid him on 16 December 2004. When he first disclosed his income, the Husband only revealed his salary but did not disclose (until his fifth affidavit) that he received a bonus of $124,000. Yet he maintained he had been truthful and deposed in his para 54 as follows:- The Petitioner is again trying to misrepresent the situation by deliberately confusing and blurring the line between monthly salary and bonuses. I reiterate that I have accurately declared my monthly salary (without taking into account bonuses) and my annual salary (taking into account bonuses). 23     As a result of the undisclosed bonuses and the above additional payments from his previous company, the Husband’s 2004 employment income for year of assessment 2005 was $303,276 or on average $25,273.00 per month. 24     The Husband further omitted to disclose a sum of $54,243.15 he had received from his previous company on 12 January 2005 (which included severance pay). Yet the banking documents he disclosed showed no credit of this amount. After the Wife sought further discovery, the Husband revealed that he had deposited the sum into his Citibank account (“the Citibank account”) which was in his sole name and which he had not disclosed before he filed his fifth affidavit on 13 January 2006. The Husband’s explanation for his earlier omission (see his para 58) was that his earlier recollection of where he had deposited the cheque was wrong. In para 74 of the fifth affidavit, the Husband claimed that the moneys in the Citibank account belonged to the brother who requested him to transfer the moneys therein to their father (“the father”). 25     If the Husband’s assertion was indeed true, the question then arises, why would the Husband deposit his own money ($54,243.15) into that account when he had six bank accounts himself? I should also point out that the Husband’s earlier claim was that he had deposited the $54,243.15 into a joint account he held with the father with UOB (infra[46]) and the moneys in that joint account were used to defray the expenses of the household, the children and his parents. 26     The Wife pointed out that the Husband’s claim that he took home $9,099 a month from his present company was untrue. He had extended a shareholder’s loan of $2,000 to the company every month or $10,000 in total. As the loans were deducted from his salary, it meant he actually earned (net) $11,099 per month. What the Husband deposed he earned in 2005viz,$187,343 ($54,243 + $133,100 ($12,100 x 11 months) excluding a possible 13thmonth bonus did not tally with his own income tax for year of assessment 2006,which showed a figure of $158,024. 27     Despite the Husband’s reduced income, the Wife pointed out that it had not affected his lifestyle which had even improved. The Husband purchased the Toyota Camry in February 2005 for $96,000 as well as two additional insurance policies. In December 2004, he purchased a policy for an insured sum of $150,000 followed by another policy for an insured sum of $600,000 in February 2005. 28     In any case, the Wife accused the Husband of orchestrating his “adverse circumstances”. He had, contrary to the average person’s practice (of paying income tax after assessment either as a one-time payment or by GIRO instalments), actually paid tax of $24,500 on 20 April 2004 in advance, based on his estimated tax liability for year of assessment 2004. This was to support his claim he was “cash-strapped” (in his affidavit filed on 23 August 2005) before the interim maintenance order was varied. 29     The Wife also disputed the Husband’s claim he was cash-strapped for other reasons. First, the Husband had extended “loans” to his siblings and parents in order to deplete his own resources; these loans were also not disclosed until after the Discovery application. The breakdown of these loans is as follows:-  DatesAmounts and recipients(a)29/09/03$70,000.00 to the father(b)05/03/04$15,000.00 to the father(c)08/04/04$23,500.00 to the brother(d)24/07/04$43,000.00 to the brother(e)20/04/05$95,165.77 to the fatherTotal$246,665.77 30     As regards the loan in [29(a)], the Husband’s justification was that part thereof ($15,000) was a gift for the father’s 75thbirthday, $20,000 was for his mother’s holiday while the balance ($35,000) was to renovate and redeem the mortgage on his parents’ property in Kuala Lumpur. The Wife took issue with the third item ($35,000) as the bank statement produced by the Husband pertaining to the alleged redemption was dated July 2004 whilst the purported invoice (for RM50,413) for renovation works was dated 5 April 2004 with no substantiation of payment. 31     For the loan in [29(b)], the Wife asserted that the father had always been financially independent. Indeed the father supported six children through university in England, Australia and Singapore. Why would he suddenly need the Husband to pay $15,000 in March 2004 for renovations and payment of the father’s housing loan? 32     At this juncture I would also point out that the Husband’s explanations of the “loans” in [29] came onlyafterthe Wife had filed her affidavit on 26 July 2005 to resist the Husband’s Variation application of the interim maintenance order. In that affidavit, the Wife had questioned (see para 7) the Husband’s withdrawals totalling $198,266.64 from his DBS account (“the DBS account”). The figure of $198,266.64includedthe amounts in [29] above. 33     In relation to item (c) in [29], the Husband claimed the payment was for the use of a BMW car which he borrowed from the brother, (“the brother’s car”) after the Husband’s car was stolen at end 2003. The brother filed a supporting affidavit stating that after negotiations, the two of them agreed that $23,500 (at $2,000 per month) was a fair amount for the use of the brother’s car by the Husband from January to December 2004. 34     The Husband failed to disclose until after the Discovery application, that he had received a net sum of $39,272.09 from the insurers for the loss of the stolen car. The total insured sum received on 15 October 2004 was $102,000 and less the outstanding hire purchase loan owed to Oversea Chinese Banking Corporation (“OCBC”) Bank, he received $39,272.09. The Husband’s explanation (in his fifth affidavit) that he did not initially disclose the $39,272.09 because it had been depleted and “transformed” (whatever that meant) was unconvincing. In truth, he had been deliberately selective in disclosing his assets in his first affidavit of means. 35     The Wife had questioned thebona fidesof item (c) in [29] above – why did the Husband prepay the brother in April 2004 if it was for a whole year’s rental of the brother’s car? Why was the agreement between the siblings not disclosed before the interim maintenance order? I noted from the brother’s affidavit that it was affirmed in Shanghai, China on 11 October 2005. There was every likelihood that the brother was working or had been posted to Shanghai. It would not be unreasonable to assume that for the duration of the brother’s absence from Singapore, the brother allowed the Husband to use the brother’s car on condition that the Husband took care of petrol and other expenses incidental to such usage. It served no purpose (and I rejected the suggestion of the Husband’s counsel in that respect) to produce documents showing the average cost of the monthly rental for a BMW car. It was highly unlikely that a brother would charge another brother rental for usage of a car which was not being used by the former. If there were hire-purchase instalments on the BMW due and owing by the brother, that was another consideration altogether. No such evidence was produced by the Husband and/or the brother. 36     The brother’s affidavit went on to depose that in December 2004, the Husband was involved in an accident while using the brother’s car with the result that the brother’s car had to be scrapped. The brother said he was upset as the vehicle was still in good condition for at least another year and was worth $20,000. The brother said the Husband used the scrap value of the brother’s car plus the Partial Additional Registration Fee (“PARF”) and Certificate of Entitlement (“COE”) rebates to purchase the Husband’s new car. 37     The Husband claimed he compensated the brother for the loss caused by the premature scrapping of the brother’s car and paid the sum into the Citibank account. The brother deposed that the Citibank account was actually his but had been opened in the Husband’s name. Because of his concern over the Husband’s divorce proceedings and that the Citibank account may be confused with the Husband’s matrimonial assets, the brother claimed he instructed the Husband to close the Citibank account and pass the moneys therein to the father to hold on trust for the brother. 38     I note from the letter of the Land Transport Authority dated 29 December 2004 to the brother that the brother received $57,446 as PARF rebate and $10,054 as COE rebate, a total of $67,500, not $45,162 as the Husband stated in his affidavit filed on 8 September 2005. It was therefore misleading of the husband to depose that the rebate sum was $45,162 after deducting $22,338 as the cash deposit he paid for the Toyota Camry. This was yet another attempt by the Husband to minimise his cash assets. 39     The Wife pointed out that the loan of $43,000 (even if true) to the brother in [29(d)] was extended on 24 July 2004, just before the interim maintenance order was made. It was an asset which the Husband failed to disclose in his first affidavit of means. It was also noteworthy that the Husband deposed that the loan was repayable in July 2006. This meant the sum was available for division at the first hearing before me. 40     The Wife submitted that the contention of the Husband/the brother that the Citibank account belonged to the brother cannot be true in any case. Her counsel drew the court’s attention to the Husband’s statement that the Citibank account was opened with deposits totalling $95,155.24. I noted from the funds transfer form exhibited by the Husband (when the Citibank account was closed) that the sum purportedly transferred out to the father was $95,165.77. 41     In a subsequent affidavit (filed on 13 January 2006) the Husband disclosed Citibank’s breakdown for the initial deposit of $95,155.24 as follows:- (a)    $54,243.15; (b)    $1,640.00; and (c)    $39,272.09. 42     Since the Husband had admitted that the sum in [41(a)] was payment from his previous company in January 2005 (see [22]) and [41(c)] was part of the insured sum for the stolen Toyota Harrier (see [34]), he and the brother were equally untruthful in contending that the brother was the beneficial owner of the Citibank account. 43     As the Citibank account had a credit of $95,166.24 and the moneys were the Husband’s, he could not have been cash-strapped (as he claimed) at the time of the interim maintenance order. It was obvious therefore that he deliberately closed the Citibank account and transferred out the funds (purportedly to the father) in April 2005 in an attempt to hide his cash assets. 44     The Husband could not have been cash strapped earlier in any event because he received his February and March 2005 back pay from his present company in April 2005. The Husband deliberately withheld crediting the two cheques (each for $9,099) until 3 August 2005 (as reflected in his DBS account statement). This wasafterhe had filed his first affidavit of means (on 31 May 2005) andafterhe had filed his affidavit (on 22 July 2005) in reply to the Discovery application. The Husband’s excuse (see para 51 of his fifth affidavit) that he was too busy to deposit the cheques with his bank(s) until four months later, due to his extremely hectic and stressful schedule, defies belief. 45     I noted that being cash-strapped did not stop the Husband from buying a brand new car in January/February 2005 for $96,000. 46     There was yet another instance (highlighted by counsel for the Wife) of the Husband’s propensity to lie on oath. This concerned the Husband’s UOB I- Account (“the UOB account”) opened in the joint names of the Husband and the father, which was referred to earlier at [22]. The UOB account was not disclosed by the Husband in his first affidavit of means. When he eventually disclosed it (in his fifth affidavit), UOB’s statement for April 2005 showed there was a credit balance of $97,453.97. In the Husband’s fifth affidavit (filed on 13 January 2006 para 58) he claimed the UOB account was closed and the funds therein were transferred to the father’ account. Yet in the next breath, the Husband added that the father transferred some funds from the UOB account back to him over time in cash and by cheque. Why would the father transfer the funds back to the Husband unless it was the Husband’s money?",
        "The decision": "47     The many discrepancies between the Husband’s statements on oath and the documents he was forced to produce in discovery reinforced my preliminary view (after reading his affidavits) that the Husband had been less than candid in disclosing his assets. His conduct and unconvincing explanations, whenever he was caught out, spoke volumes of the Husband’s credibility and veracity. 48     I suspected, notwithstanding the Discovery application, that the Husband had still not revealed all his assets because it was not in his nature to do so, unless he was forced to and/or he was confronted with evidence that proved he was hiding other assets and/or lying; I shall cite an example. The Husband had asserted (in his first affidavit of means) that he was relying on his “savings” to make ends meet. Yet, he did not produce any documents to show what savings he had. Indeed, the particulars he furnished in para 8 of his first affidavit of his bank accounts (local and overseas) showed (as I stated earlier in [12(j)]) negligible credit amounts. One account with HSBC held jointly with the Wife was in fact an overdraft account with a negative sum of $10,523.06. According to the Wife, the HSBC account was in credit until at least 29 December 2003. 49     Although the Husband indicated in his fifth affidavit that the father would affirm an affidavit to confirm receipt of the Husband’s gift of $15,000, no affidavit was ever filed by the father. 50     Consequently, I was entitled (and which I did) to draw an adverse inference against the Husband. 51     I had given the Wife liberty to apply after the first hearing on 19 January 2007 due to four outstanding issues: (a)    the Husband’s 5,000 stock option from his previous company had not been exercised (see [12(h)]); (b)    whether the Husband received director’s fees from his present company; (c)    the proposed sale (verbally advised by his counsel) of the Husband’s shares in his present company; and (d)    the surrender values of the Prudential insurance policies. 52     I therefore ordered the Husband to file another affidavit to exhibit the annual returns from his present company, to give the status quo of his previous company’s stock options, update the court on the insurance policies and provide details of the proposed sale of his shares in the company. The Husband accordingly filed his ninth affidavit on 22 January 2007. 53     Before the second hearing on 22 February 2007 and after her receipt of documents from the Husband’s solicitors, counsel for the Wife wrote to the latter raising various queries. When she received no replies or no satisfactory replies, counsel for the Wife applied to the court for a further hearing, under the liberty to apply provision in the orders I made on 19 January 2007. 54     In his ninth affidavit, the Husband clarified that he did not convert his 5,000 share options from his previous company into shares because the exercise price ranged between $10.05 and $11.03 whereas the market price was less than $10.00. Consequently, the Husband allowed his share options to lapse. 55     The Husband exhibited his income tax assessments for 2005 and 2006 in the sums of $133,100 and $154,366.67 respectively, to prove that he did not receive any director’s fees from his present company. The annual returns of his present company as of 31 October 2006 that he exhibited had an item called Director’s Remuneration with the figures $89,250 and $162,709 for 2005 and 2006 respectively. The Husband gave no explanation of this item in his ninth affidavit. 56     The Husband had exhibited in his ninth affidavit the proposed sale and purchase agreement between himself as vendor and the new shareholder as purchaser. As the Husband’s present company had made losses in 2005 and 2006, the Husband claimed he was selling his 5,000 shares for a nominal $1.00. He deposed he had also agreed to waive his shareholder’s loan to the company. 57     The Wife was not satisfied with the Husband’s explanation of the discrepancies in his income as shown in the IR8A forms and his present company’s accounts. Her counsel pointed out that the Husband’s present company’s figures for his earnings contradicted the Husband’s earlier affidavits where he deposed he earned a salary of $12,100 from his present company. His total earnings for 2005 as at 31 October 2005 should be $108,900 ($12,100 x 9 months). For 2006, as he received no increment, his 12 months’ income as of 31 October 2006 should be $145,200 ($12,100 x 12 months). Yet, the Husband’s present company’s letter dated 9 February 2007 exhibited by the Husband stated he earned $162,709; he had not explained the surplus of $17,509. 58     The court’s attention was drawn to the following extract (item 4) from the accounts of the Husband’s present company ending 31 October 2006 headed “Directors’ receipt of and entitlement to contractual benefits”: Since the beginning of the financial year, no director has received or become entitled to receive a benefit which is required to be disclosed under section 201(8) of the Companies Act, Cap 50, by reason of a contract made by the company or a related corporation with the director or with a firm of which he is a member or with a company in which he has a substantial financial interestexcept that the directors have received remuneration from related corporations in their capacity as directors and/or executives of those related corporations. [emphasis added] 59     I ignored the Husband’s tenth and last affidavit as it was filed without my leave (see [5]). Consequently, whatever explanations the Husband sought to give on the discrepancies in his ninth affidavit touching on his income from his present company cannot be considered. It was typical of the Husband’s conduct. It was only when contradictions or inconsistencies in his affidavits and/or documents were raised by the Wife that he would try to explain; nothing was forthcoming from him voluntarily. 60     As the Husband was one of only two directors of his present company (according to the company’s accounts and confirmed by a search in ACRA), there was a possibility that he did receive remuneration from related corporations of his present company which he had failed to disclose. In any case, I noted that the Husband did not depose in his ninth affidavit that he did not receive such remuneration, that it was his co-director who was the recipient of such benefits. 61     In the light of the Husband’s previous affidavit history and his tendency either to bend the truth and/or depose to outright untruths, I agreed with counsel for the Wife that I could not/should not rule out the possibility that the Husband may have hidden other sources of remuneration from the court.",
        "Division of assets": "62     On 19 January 2007, I had awarded the Wife 40% (equivalent to $260,000) of the Husband’s known assets based on the following breakdown:-  (a)Cash$97,453.00(b)Car insurance amount (net)$39,272.00(c)Loans to brother ($23,500 +$43,000)$66,500.00(d)Share capital contribution to his present company$5,000.00(e)The previous company’s bonuses ($54,243.00 + $91,636)$145,879.00(f)Cash in banks ($87,742.78+$32,588.21+$10,936.73)$131,267.72(g)CPF savings$81,987.99(h)Value of Toyota Camry$11,000.00(i)Malaysian properties$100,000.00$678,359.71 This was rounded up to $700,000. 40% thereof was $280,000 which I then reduced by $20,000 to $260,000 in case there had been any double-counting. 63     I directed the Husband to pay the Wife the sum awarded by two instalments of $100,000 and $160,000 by end February and end April 2007 respectively. The first payment would hopefully enable the Wife (together with her share of the sale proceeds of the Parkshore property and her CPF savings) to purchase a home for herself and the children, since she could not continue to reside with her parents indefinitely. Allowing the Husband to pay the second and final instalment two months after the first payment would give him sufficient time to liquidate his assets for the requisite cash. 64     By the time of the further hearing before me, the Husband had filed his ninth affidavit. As stated earlier at [56], his ninth affidavit exhibited the draft sale and purchase agreement of the sale of his shares to the majority shareholder of his present companyviz,the new shareholder, not the signed copy. Consequently, the court could not be sure that the draft agreement (which bore the year 2006) would not be/could not be further amended. There was therefore no certainty that the Husband had waived repayment of his shareholder’s loan of $5,000 to the company or that the nominal price of $1.00 for the sale would not be changed. Even so, the reduction of $20,000 I had made on the Wife’s award would take care of both eventualities should my fears prove unfounded. 65     As earlier indicated at [50], I drew an adverse inference against the Husband and concluded he had failed to disclose all his assets. That being the case, awarding the Wife 40% of his known assets (she requested 75%) was neither unreasonable nor excessive viewed in the light of s 112(2) of the Women’s Charter (Cap 353,1997 Rev Ed) (“the Act”) bearing in mind the following factors: (a)    the parties had been married for more than ten years by the time the Wife left the matrimonial home in March 2004. (b)    the Wife should be given some recognition for being the primary caregiver of two young children besides being a working woman. (c)    the Wife had contributed directly towards the cost of acquiring the Parkshore and Bayshore properties and largely paid for the latter. (d)    although the Wife paid for the Bayshore property using her CPF savings and serviced the housing loan of HSBC through her CPF account (at $2,577.79 every month up to August 2006) until her account balance was insufficient, the Husband kept the rental income for four years. Even if I accepted his figure of $699 as the net rental against the Wife’s figure of $1,350, the Husband had collected $33,552.00 as rental income for 48 months. (e)    the Wife paid for the furniture and furnishings for the Parkshore property. (f)     the Husband had been enjoying exclusive occupation of the Parkshore property for more than two years. 66     The Wife claimed to have helped (albeit the extent was disputed by the Husband) in the interior decoration of the Mont Kiara or Putri Palm properties but I did not factor that contribution into her 40% share. I further omitted taking into account the surrender values of the various insurance policies maintained by the Husband. His counsel had given an estimated value of $87,742.78 to the policies in her submissions as the Husband, true to form, merely exhibited the policies’ particulars in his ninth affidavit but failed to explain or give their surrender values. 67     In contrast to the Husband, the Wife’s assets were not very substantial; her cash in the bank and CPF totalled $80,648.48 ($15,000 + $65,648.48). Apart from a request (in his solicitor’s letter dated 15 January 2007) that the Wife produce her notice of assessment for 2006, the Husband did not challenge the Wife’s assets as disclosed. As I had disregarded the surrender values of the Husband’s insurance policies, I similarly disregarded the surrender values ($58,168.27) of two of the Wife’s four insurance policies (see [6]). The three branded watches and a ring which she owned were gifts to her from the Husband. There was no reason to take them into consideration in dividing the matrimonial assets. Her assets amounted to 11% of the Husband’s known and/or declared assets of $678,359.71. 68     Division of matrimonial assets is never an exact science. An accurate division can be made only if parties honestly declare their assets. This was sorely lacking on the part of the Husband who I found to be both devious and dishonest in his affidavits. The court could only do the best with whatever evidence there was available and award a higher percentage to the wife (which I did) to take into consideration where, as was the case here, the declared assets of the Husband were not exhaustive. 69     In view of the acrimony between them, it was best to award a lump sum to the wife to achieve a clean break between the parties.",
        "Maintenance": "70     The sums initially awarded by way of monthly maintenance to the children ($2,900) and the Wife ($100) were well within the means of the Husband. I noted that while he was of the view the children only needed $2,947.18 (in his second affidavit) for maintenance and that the Wife could maintain herself on her earnings, the Husband claimed his own monthly expenses were $9,743.78 (see [13]), which sum exceeded the Wife’s total salary ($8,250). As my award of maintenance for the children was less than the Husband’s own estimate, it did not lie in his mouth to complain let alone to appeal against my figure.  The award of $2,900 for the children’s maintenance did not provide for increase in the children’s tuition fees nor for medical and/or dental treatment. Granted, (as the Husband deposed in his second affidavit) the children would not need to incur medical or dental charges every month but in the event they do, consultation and medication for the odd bout of influenza or infection needed to be provided for, more so for dental treatment and braces should the eventuality arise. Hence I included prayer (f) in [3]. 71     Section 114 of the Act required the court to take into account seven factors in determining the amount of maintenance to be paid to a wife. Save for subparas (e) and (g), the other considerations in subparas (a) to (f) were clearly applicable in our case. Under subpara (a), I was conscious that with her background (a polytechnic diploma as against the Husband’s university degree), the Wife’s future earning capacity could never match that of the Husband. As it was, she earned half what the Husband earned at his previous company. There was little doubt that the Husband had yet to achieve his maximum earning capacity. His employability was evidenced by the fact that he found a position with his present company immediately after leaving his previous company without a day’s break in-between and he would have a new job immediately after the sale of his shares and his departure from his present company. 72     Contrary to the Husband’s claims, he had no financial responsibilities to his family or siblings under s 114(b) of the Act. As for s 114(c), I had commented earlier at [11], that the couple enjoyed a comfortable middle-class lifestyle prior to the breakdown of the marriage. The Wife would probably not be able to afford that same standard of living henceforth on her own earnings. For instance, she could afford to own and maintain a car only if she utilised a substantial proportion of her own monthly income for the capital outlay required. She was entitled to look to the Husband (who could well afford it) to maintain her in the standard she had enjoyed prior to March 2004, pursuant to s 114(2) of the Act. The Wife had undoubtedly and conscientiously discharged her duties as a wife, mother and homemaker before the parties separated. Granted, she had exaggerated (so too the Husband on his expenses) her own as well as the children’s monthly expenses and in some instances she had double-counted her expenditure (an example being her claim she paid her parents $1,500 per month for living with them and further contributed another $1,500 to their household expenses excluding the expenses of the maid which she also bore). 73     Adopting the well-accepted broad brush approach, I felt that I had been unfair to the Wife in initially awarding her only a nominal sum of $100 for her own maintenance. Consequently, I increased the Wife’s maintenance sum by $500 from $100 to $600 at the second hearing. The increment was not so substantial as to cause an adverse impact on the Husband’s considerable financial resources let alone cause him hardship. At the same time, it would be of some assistance to the Wife for example, in helping her to defray the expense of a maid, which charges had previously been entirely borne by the Husband or to take care of medical or dental expenses which items I had ignored in arriving at my initial award of $100 maintenance to her.",
        "Costs": "74     I noted that the hearing on ancillary matters first came up for hearing before Tan Lee Meng J on 13 October 2006 but had to be adjourned because the Husband filed and served his (seventh) affidavit on 11 October 2006.  Costs of the adjournment were reserved. For the first hearing before me on 19 January 2007, I had to stand it down to the afternoon because the Husband had not produced the annual returns of his present company as well as information on the cash value of his share options from his previous company. Finally, I noted too that for the decree nisi granted on 8 March 2005, no order for costs was made. 75     Costs are in the discretion of the court and I chose to exercise my discretion in favour of the Wife because of the Husband’s persistent refusal to reveal the full extent of his assets despite the Discovery application. In view of the voluminous affidavits filed by both parties, I fixed costs at $5,000 for the first hearing and a further $800 for the second hearing, which hearing would have been unnecessary had the Husband voluntarily disclosed earlier the documents on his present company and information on the fate of his previous company’s share options."
    }
}