{
    "case_title": "Lee Seng Cheong and Others v Seah Bak Seng",
    "ncitation": "[2008] SGHC 1",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Purchases made by each plaintiff": "15     During the course of the trial, it became apparent that the particulars of the share purchases in the plaintiffs’ Amended Statement of Claim dated 31 January 2007 were inaccurate. This was because the total number of shares as pleaded added up to 2,130,000 shares, which was way in excess of the 1,750,000 shares that Lee later agreed the plaintiffs, PCMW and See Chak Wah, had purchased in total (NE p 62). During the trial, Lee tendered a document (marked as Exhibit P2) which matched the cheques to the respective purchasers and the shares purchased. P2 is reproduced as follows:",
        "Record of Purchase of Fotronics Placements Shares (RM 1.00 Per Share Unless Indicated)": "Name of BuyerBank & Cheque NoAmountPayable toNo of sharespurchased1Lee Seng CheongUOB 063297$13,636.27Fotronics Incorporated(S) Pte Ltd30,0002Lee Seng CheongUOB 063299$18,181.00”40,0003Lee Seng CheongSC 377674$100,000.00”220,0004Cheong Yin YuenSC 496361$9,091.00”20,0005Cheong Yin YuenSC 496364$27,273.00”60,0006Puan Chew MotorWorks Pte LtdDBS 741243$136,364.00”300,0007See Chak WahDBS 300200$22,727.00”50,0008Tan Kian HengPOSB 465535$22,727.28”50,0009Ramasamy SomasundaramPOSB 483071$22,727.30”50,00010Loo Yuh HueyDBS 555148$22,728.00”50,00011Lee Sea KianHLB (M)RM 100,000”100,00012Chia Wang NorPOSB 442190$9,091.00”20,00013Sim Eng CheeUOB 348208$4,545.50”10,00014Lee Seng CheongUOB 082173$130,434.00Seah Bak Seng*300,000UOB 082174$26,086.00(short payment of $0.20 for above)15Loo Yuh HueyDBS 000928$26,087.00Seah Bak Seng*50,000Purchase made after listing from Seah Bak Seng in February 200516Lee Seng CheongUOB 082181$131,233.00Seah Bak Seng300,00017Lee Seng CheongUOB 082182$43,913.00Seah Bak Seng100,000 * RM 1.20 per share 16     According to this table, the total number of shares purchased would be 1,750,000 shares. I accepted the figures produced in P2 as accurate. It should be borne in mind that the purchases in Items 6 and 7 were made by PCMW and See Chak Wah respectively, who did not join as plaintiffs to the present action. During cross-examination, Lee testified that he had reimbursed See Chak Wah in full for the latter’s shares (NE p 40). This was not disputed by the defendant. As stated before, PCMW was also paid back in full for the shares it had purchased. 17     The inaccuracies in the numbers had arisen because under the written agreements dated 11 August 2004, Lee had purchased some shares on behalf of Cheong Yin Yuen and PCMW. Thus, of the two written contracts that Lee entered into on 11 August 2004 for the purchase of a total of 670,000 shares (items 1 and 2 of [3]supra), Lee had only purchased 290,000 shares (30,000 + 40,000 + 220,000) for himself. The remaining 380,000 shares were purchased on behalf of PCMW (300,000 shares) and Cheong Yin Yuen (80,000 shares). Items 1 and 2 of paragraph 5 in the plaintiffs’ Amended Statement of Claim ([4]supra) were therefore inaccurate as they duplicated the shares of PCMW and Cheong Yin Yuen. I found that the plaintiffs had purchased a total of 1,400,000 shares. Adding PCMW’s 300,000 shares and See Chak Wah’s 50,000 shares, the total number of shares purchased from the defendant was 1,750,000. 18     In the appendix to their closing submissions, counsel for the plaintiffs tendered a re-amended Statement of Claim which purportedly contained the correct figures. I rejected the re-amended Statement of Claim as counsel had not tendered a formal application to effect the amendments sought and, in any event, the application was made too late in the day. During the trial, I made it very clear that any amendments to the Statement of Claim had to be by way of a formal application (NE p 98 line 15). A re-amended Statement of Claim attached as an appendix to closing submissions did not constitute a formal application. In any case, I did not think that the figures pleaded in the re-amended Statement of Claim were accurate.   I will now discuss whether the defendant had breached the agreements with the plaintiffs and if so, the remedies that the plaintiffs were entitled to.",
        "Shares purchased before the listing date of 31 January 2005": "19     I will first deal with the shares that were purchased by the plaintiffs before the listing date (the “Pre-Listing Shares”). These form items 1 to 15 of the table at [15] above (excluding items 6 and 7). 20     I found that the defendant had breached the contracts to sell the Pre-Listing Shares to the plaintiffs. The purpose of buying these shares from the defendant was to enable the plaintiffs to make a quick profit by selling the shares on the listing date or shortly thereafter should the share price be higher than the purchase price. The Pre-Listing Shares were thus purchased and fully paid forbeforethe listing date. The plaintiffs in this case were not institutional or sophisticated investors or long term investors. Rather, they were small-time investors hoping to make a ‘quick buck’. It was highly unlikely that the defendant did not know this. After all, Lee and the defendant had known each other for over 40 years. Lee regularly visited the defendant’s office in Singapore. Lee must have conveyed the plaintiffs’ intentions at some time or other when the transactions were being discussed with the defendant. 21     I therefore found that there was an implied term in the agreements between the plaintiffs and the defendant that the latter would deliver the Pre-Listing Shares before the date of listing, or at the very latest, on the day of listing. Such an implied term would give business efficacy to the agreements. I believed Lee’s evidence that he had in fact instructed the defendant two days before the listing date, on the listing day itself, and repeatedly thereafter to sell or transfer the plaintiffs’ shares to him so that he and the other plaintiffs could sell the shares. I found the defendant’s defence that he received no instructions whatsoever from the plaintiffs to be wholly unconvincing, particularly in light of the fact that the share price on the first day of trading was well above the purchase price, which would have enabled the plaintiffs to make a quick and fairly handsome profit.   It was unlikely that all eight plaintiffs would have stood by and done nothing for 2 ½ months from 31 January 2005 to 13 April 2005 while the opportunity to reap the profits by selling the listed shares on the MESDAQ was dissolving before their very eyes and quickly turning into losses as the weeks went by. The defendant’s defence suggested that at the time of listing and during the entire period when the market price of the shares was still above RM 1.00, not evenoneof the eight plaintiffs wanted to sell the shares to make a quick profit. I found this highly implausible. I found that the defendant had acted in breach of the contracts by delivering the shares extremely late on 13 April 2005, by which time the share price had dropped to about RM 0.90 per share (AB 32).",
        "Shares purchased in February 2005": "22     About two weeks after the listing of the shares, Lee purchased an additional 400,000 shares in February 2005 from the defendant at RM 1.00 per share (the “February 2005 Agreement”). At that time, the market price of the share was RM 1.08 per share. It was the plaintiffs’ case that the 400,000 shares were to be delivered immediately. On 14 February 2005, he paid for his purchase of the 300,000 shares (AB 30 and P2). On 21 February 2005, he paid for the balance of the 100,000 shares (AB 31 and P2) that he had purchased. 23     I found that there was an implied term in the February 2005 Agreement that upon the defendant’s receipt of the payment of the purchase price for the 400,000 shares, the shares were to be delivered immediately or soon thereafter to Lee. It could not possibly have been in the reasonable contemplation of any party to such a transaction that the traded shares purchased were meant to be delivered several weeks or an indefinite time after receipt of full payment, particularly when the market price at that time was only RM 0.08 above the price Lee paid for the shares and the share price was already quite volatile at that time. Obviously, Lee intended to have the shares delivered to him immediately or as soon as possible so that he could sell them quickly to profit from the small price differential. However, these shares were delivered more than seven weeks later on 13 April 2005. I found that the defendant had therefore acted in breach of the February 2005 Agreement by failing to deliver these shares immediately or soon after Lee had paid for them.",
        "Alleged Loan Agreement in July 2005": "24     Before discussing the remedies available to the plaintiffs, I should add a few words about the alleged loan agreement in July 2005. In my view, the alleged loan agreement was not a genuine one but merely a method devised by the defendant to mask the true nature of the transaction,vizto refund PCMW for the 300,000 Fotronics shares it had purchased (through Lee’s assistance) from the defendant. During cross-examination, Lee testified as follows: A:      This Puan Chew Motor actually I suffered a lot, day and night kept calling me, pressing very hard on me that, you know, what happened to the shares. So I was thinking, since I’ve already reim-reimbursed See Chak Wah. I don’t know, I told ---I approached the defendant. I said, “Look, I cannot take it anymore”. Since then I lost my sleep almost every night even until yesterday. So the important thing now is to settle with Puan Chew. I couldn’t take it anymore. Perhaps I think go and look for a bank and, er, you know, get the loan settled with him first. I was actually trying to help the defendant. Maybe that is the --- the only solution, if he doesn’t have the money to pay Puan Chew. … A       What you should do now, sometimes in the middle of 2005, I really cannot take it any more and told Puan Chew, “Look, you know the defendant and his younger brother who was the chairman of Fotronics also. You know them very well also, why not I take you to their office. You go and settle among themselves”. Puan Chew agreed. And, er, I was there. Puan Chew --- there was Lim Puan Chew and the defendant and his younger brother, four of them --- four of us in the chairman’s office, locked up. And, er Puan Chew started asking back for money, asked --- at first he asked for, “What happened to the shares? Who sold the --- my shares at four--- 1.40 and above? And now the share price had dropped so much, I want back my money.” So the defendant and the young – and the younger brother, the chairman agreed, “I give you full refund, okay, ask Puan Chew to come and collect the full amount one week later.” I went to--- because I --- I was with them most of the time. I went one week later and the defendant gave me a cheque, full amount, hundred and thirty over thousand dollars. I got the cheque, I was very happy. Ct     Payable to whom? Cheque was payable to whom, this hun---one--- A       Payable to this, er, Puan Chew Motor. Ct     And then? A       I was very happy. At least I solved one problem. Got the cheque, I said, “Let me run across the road”. Puan Chew’s workshop just across the road, across the office only. I delivered the cheque but I was stopped. Ct     Stopped by who? A       No. You signed here, acknowledge --- acknowledge re--- receipt of this amount and put down that this money was actually, you know, a loan that he arranged for me and charged me at seven and a half per cent per annum. My goodness and told me: “Bank in this cheque into your account. You issue a cheque, pay to Puan Chew tomorrow”. I said, “What is the purpose of doing this? You just give the cheque, refund to him, that’s it”.But I was told that, “No, no, no. If other people were to know, they will also come after him. To---in order to avoid all these things, all these troubles, no, you bank into your account”. [emphasis added] It should be clarified that the cheque in question was a cash cheque for S$136,364 (AB 37) and not a cheque made payable to PCMW. That was why Lee was able to deposit the cheque into his account before re-issuing a cheque (AB 38) from his bank account for the same amount to PCMW. 25     I found Lee to be a credible witness. I accepted Lee’s testimony that the defendant devised this method of payment because he wanted to prevent other plaintiffs from learning that PCMW had succeeded in getting a refund directly from the defendant and he did not want the other plaintiffs to similarly hound him for refunds. I believed that Lee had acknowledged the loan agreement because he was under tremendous stress at that time as Lim Puan Chew kept pressing Lee for the money. Counsel for the defendant contended that there was no reason for the defendant to refund PCMW the money as the contract was between the defendant and Lee, not PCMW. I was not convinced by this technical argument. Clearly, the defendant knew that it was PCMW and not Lee who purchased the 300,000 shares at RM 1.00 per share from him. If at all, Lee was merely acting as the agent for PCMW (a disclosed principal) in the purchase of these shares from the defendant. It should be noted that payment to the defendant for the purchase price was by way of a cheque dated 11 September 2004 from PCMW (and not from Lee) for S$136,364 (the equivalent of the purchase price of RM300,000 at that time). It would have been clear to the defendant that it was PCMW and not Lee who was paying him for the purchase of the 300,000 shares. At paragraph 24 of the defendant’s affidavit, the defendant in fact acknowledged that Lim Puan Chew was one of the other buyers of the shares from him. On evaluation of the evidence as a whole, I found that the cash cheque (AB 37) was not a loan to Lee but in truth, a refund of the purchase price by the defendant to PCMW for the 300,000 shares which the defendant failed to deliver by the listing date as agreed.   Consequently, I ordered the defendant to return S$852 to Lee with interest to run from 5 September 2005, the date on which that sum was paid.",
        "Remedies": "",
        "Time of the Essence": "26     In the Amended Statement of Claim, the plaintiffs claimedinter aliathe return of the purchase priceandloss of profits on the shares they had purchased from the defendant. I allowed the plaintiffs’ claim for the return of the purchase price but disallowed the claim for loss of profits. I also ordered the plaintiff to transfer 2,050,000 shares (inclusive of stock splits and dividends) back to the defendant.   I should add at the outset that counsel cited no authorities to assist me on the general principles of law that were applicable to this case. 27     In my view, time was of the essence in relation to the contracts in question,viz,the contracts for the purchase of the Pre-Listing Shares and the February 2005 Agreement.   It is established law that in contracts for the sale and purchase of securities traded in a securities exchange, time is generally of the essence of the contract with regards to payment of the purchase price by the purchaser to the vendor and the delivery or transfer of the shares by the vendor to the purchaser, as the prices of such shares would be subject to fluctuations not only from day to day but also within each trading day:ReSchwabcher(1908) 98 LT 127;Hare v Nicoll[1966] 2 QB 130 (“Hare”) at 147;Huang Chang Hsun Francis v Hwang & Yusoff Securities Sdn Bhd[1992] 2 MLJ 305. This was particularly true where the share prices were volatile and the shares were of a highly speculative nature and liable to considerable fluctuations in value:Hareat 142;Grant v Lapid Developments Ltd[1996] BCC 410at 415. I had already found that it was an implied term that the Pre-Listing Shares were to be delivered to the plaintiffs by the listing day. On the facts, clearly the price of Fotronics shares was already volatile from the first day of listing on the MESDAQ. It was thus crucial that those shares were transferred to the plaintiffs on or before the listing date so that the plaintiffs could sell, as and when they desired, the shares which they had already paid for in full well before the listing date. Time was therefore of the essence of these contracts. Similarly, time was also of the essence in relation to the shares under the February 2005 Agreement, which were purchased about two weeksafterthe listing date. Lee paid for these shares on 14 and 21 February 2005 respectively. Again, these shares should have been transferred to Lee immediately or soon thereafter upon payment being received, and certainly not some seven to eight weeks later on 13 April 2005, which was a date chosen by the defendant himself at his own whim and fancy. 28     In this case, it was notexpresslystipulated in the contracts that time was to be of essence. However, it is established law that time mayimpliedlybe of the essence of the contract where the circumstances of the case or the subject matter of the contract indicate that the time for completion is of the essence:British and Commonwealth Holdings plc v Quadrex Holdings Inc[1989] 1 QB 842. In my view, it was clear from the surrounding circumstances of the transactions and the very nature of the transactions themselves that time was to be of essence in these contracts. 29     My finding that time was of the essence meant that the implied term that the Pre-Listing Shares were to be delivered by the listing date was a condition, and not a warranty or an intermediate term. Similarly, time was also of the essence in relation to the delivery or transfer of the 400,000 shares purchased under the February 2005 Agreement and paid for in February 2005. The defendant had breached this condition by transferring all the shares to Lee’s share account only on 13 April 2005. As such, the plaintiffs were entitled to terminate the contract and claim damages for the breach. When the defendant effected the transfer of the shares to the account of Lee on 13 April 2005, Lee (acting for himself and on behalf of the other plaintiffs) chose not to accept the very late performance of the contract or the very late delivery of the shares. This was obvious from the fact that he refused to deal with the shares and demanded an explanation from the defendant (NE p 74). Lee also told the defendant that the plaintiffs would hold him responsible for the non and/or late delivery (Lee’s affidavit dated 22 June 2007 at [12]). In my view, the plaintiffs had lawfully terminated the contract and they were entitled therefore to claim for the damages they had suffered.",
        "Measure of Damages": "30     We then come to the issue of the measure of damages that the plaintiffs were entitled to. The plaintiffs claimed for loss of profits and the return of the purchase price. I only allowed the plaintiffs’ claim for the return of the purchase price. 31     A claim for loss of profit in this case is essentially a claim for expectation loss – the plaintiffs are to be placed, in so far as money can do it, in the position they would have been in had the contract been performed. As the price when the shares were first listed was about RM 1.40 per share, the plaintiffs claimed a loss of profit of RM 0.40 per share for the Pre-Listing Shares. For the shares purchased under the February 2005 Agreement, the plaintiffs claimed a loss of RM 0.08 per share as the market price at the time of purchase was RM 1.08 per share. 32     To make out a claim for damages for expectation loss, it is trite that the claimant has to prove with a reasonable degree of certainty the value of his expectations. If the claimant is unable to discharge this burden of proof, he will have to rely on the reliance measure of damages (typically known as damages for wasted expenditure) or on the restitutionary measure of damages. The restitutionary measure seeks to restore to the claimant of the breach any benefit he had conferred on the perpetrator of the breach. 33     Applying the above principles, I found that the plaintiffs were not entitled to succeed in their claim for loss of profits as they had not discharged their burden of proving, with reasonably certainty, the value of their expectation loss. The plaintiffs’ claim for a loss of profit of RM 0.40 per share was necessarily based on the assumption thatallthe plaintiffs without exception (including PCMW and See Chak Wah) would immediately sell their shares on the first day of listing, and that they would have been able to sell all the 1,750,000 pre-listing shares at the price they wantedieRM 1.40 per share. The evidence did not go so far as to support such an assumption being made. Firstly, it was not clear that all the eight plaintiffs would have wanted to sell their shares at the same time. It will be recalled that a large majority of the plaintiffs purchased the shares directly from the defendant under different contracts and they paid the defendant directly via their own cheques. The various plaintiffs apparently had their own brokers to deal with their shares (NE p 28 line 15). Further, different plaintiffs might have different appetites for risk and might hold their shares for varying periods of time before selling them, in which case the loss of profits would differ for each plaintiff. The starting share price on the first day of listing was RM 1.40 and later rose to RM 1.48. But by the afternoon, it fell to about RM 1.30 (NE p 33). After that, it steadily and rapidly declined and by mid-February 2005, the share price was around RM 1.08. In April 2005, the share price further dropped to about RM 0.90. Thus, even within the course of a day or just a few weeks, the share price had fluctuated greatly. An investor with a greater appetite for risk might have held on longer to the shares (perhaps harbouring hopes that there might be a rebound in the share price before selling), in which case awarding him a profit of RM 0.40 per share would be overcompensating him. Secondly, even if there was evidence to suggest that all eight plaintiffs would unanimously agree to sell all their shares at the same time, there was no certainty that they would have been able to dispose of all their shares immediately when the market opened,ieat RM 1.40 per share, considering that there would also be many others who might be queuing and rushing to sell on the first day of listing. Thus, it was not realistic to infer that all the Pre-Listing Shares purchased by all the plaintiffs would have been successfully sold in the MESDAQ at RM 1.40 per share. It was also not unreasonable to infer that at least some of the plaintiffs might have wanted to hold their shares for a longer period to see if the share price would increase any further, in which case the extent of their profits (or even losses) would be unclear. Similarly, considering that the share price was volatile and the price was following a downward trend in February 2005, it was unclear whether Lee would have managed to sell all the 400,000 shares purchased under the February 2005 Agreement at RM 1.08 per share even if the defendant had promptly transferred the shares to Lee’s share trading account on the following day after the cheques for payment had been cleared. 34     In summary, as the plaintiffs could not prove their expectation loss with a reasonable degree of certainty, I was disinclined to allow this head of claim. To do so would result either in under-compensation or overcompensation for some or all of the plaintiffs. 35     I was therefore of the view that damages should be assessed on the restitutionary measure of damages,ie,based on the purchase price the plaintiffs paid for the shares. 36     In my order, I held that the defendant was to pay the plaintiff a total amount of RM 1,520,000. This sum was derived as follows:  Buyer/PlaintiffDate PurchasedShares PurchasedPurchase Price Paid RM1Lee Seng CheongAug 200430,00030,000Aug 200440,00040,000Aug 2004220,000220,000Jan 2005300,000360,000 (RM1.20 per share)Feb 2005300,000300,000Feb 2005100,000100,000(bought from See Chak Wah)Aug 200450,00050,0002Cheong Yin YuenAug 200420,00020,000Aug 200460,00060,0003Tan Kian HengAug 200450,00050,0004Ramasamy SomasundaramAug 200450,00050,0005Loo Yuh HueyAug 200450,00050,000Jan 200550,00060,000 (RM 1.20 per share)6Lee Sea KianAug 2004100,000100,0007Chia Wang NorAug 200420,00020,0008Sim Eng CheeAug 200410,00010,000Total No ofShares: 1,450,000Grand Total:RM1,520,000 Even though See Chak Wah was not a plaintiff in this action, I awarded RM 50,000 as being due to Lee because Lee paid See Chak Wah in full for his shares and had effectively bought over the latter’s shares (see [16]supra) and stepped into the shoes of See Chak Wah for the purpose of claiming a refund of the purchase price from the defendant. I excluded the amount paid by PCMW (RM 300,000). This follows from my earlier holding that the defendant had already reimbursed PCMW in full and there was no genuine loan agreement as alleged by the defendant. I did not order the defendant to refund the purchase price in Singapore dollars (as per P2) for the plaintiffs who paid for the share purchases in Singapore dollars. These were Malaysian shares traded in MESDAQ in RM. In all the written contracts, the purchase price was stated in RM and not Singapore dollars. Any refund of the purchase price should in my view be in the same currency in which the purchase price was originally quoted in the contracts and in which the payment was to be made.   A person who did not have the currency in which the purchase price was quoted would have to pay the equivalent amount of the purchase price in the currency available to him, to be converted to the currency stipulated for the purchase price for the purpose of payment. In this case, it was RM. Accordingly, I ordered the refund of the purchase price for the shares to be in RM.   Any gains or losses in converting the RM back to Singapore dollars or for that matter, to any other currency, is a matter for the plaintiffs since they had agreed to purchase Malaysian shares priced in RM. 37     I also ordered the plaintiffs to transfer 2,050,000 shares back to the defendant. Of these 2,050,000 shares, 1,450,000 shares belonged to the plaintiffs (including the 50,000 shares that Lee purchased from See Chak Wah) and the remaining shares belonged to the other parties (including PCMW’s 300,000 shares). During cross-examination, it was also revealed that the plaintiffs had received some dividends on the shares and that there was also a one-for-one bonus issue (NE p 79). I therefore ordered that all dividends received and any stock splits should be accounted for and repaid or transferred back to the defendant respectively. 38     I also dismissed the defendant’s counterclaim. The defendant had failed to prove to my satisfaction that Lee had requested the defendant to purchase 400,000 shares on Lee’s behalf between 7 November 2005 to 8 December 2005 for a total consideration of RM 104,409.63 (approximately RM 0.26 per share). Lee appeared to be unaware of these transactions and I was inclined to believe him. The document adduced by the defendant in support (exhibit SBS-5 of defendant’s affidavit dated 19 July 2007) apparently showed that part of the shares were paid for by a transfer of cash from a different person,vizone “Lim Eng Chong”. Lee’s account might have been used for unauthorised transactions or trading by the defendant. I noted the defendant’s evidence (NE p 113 to 115) that he had been putting extra shares in the share account of Lee, which he said were to be held in trust for him, because as a director the defendant could not trade without having to make an announcement. The defendant said that it would be easier if he asked someone else, for instance Lee, to hold the shares in trust for him and if that person sold the shares on his behalf then the defendant need not make any announcement. I was inclined to believe Lee that he did not hold any shares in trust for the defendant. I did not think that Lee knew anything about the extra shares transferred to his trading account until he saw the contract note from Avenue (AB32) informing him that he had bought 2,050,000 shares on 8 April 2005 at a price of RM 0.90 on the basis of a “Direct Business Trade Retail”. It would appear that the defendant had no qualms using Lee’s trading account for his own purposes and to house his shares for trading to avoid having to make announcements. I did not accept the defendant’s evidence that Lee had requested the defendant to purchase 400,000 shares for him between 7 November 2005 and 8 December 2005. For these reasons, I dismissed the defendant’s counterclaim for RM 104,409.63. 39     In accordance with the view I had taken of the alleged loan agreement, the defendant’s counterclaim for the repayment of the loan and interest was also disallowed."
    }
}