{
    "case_title": "Heng Lee Suan v YTC Hotels Ltd (trading as Paramount Hotel)",
    "ncitation": "[2008] SGHC 111",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "2       This was a most unfortunate case. The plaintiff is an ophthalmologist who, with her brother Lee Kwang (“the brother”), practises at two clinics, one located at Gleneagles Hospital and the other at Mount Elizabeth Hospital, Singapore. By all accounts, the joint practice of the plaintiff/the brother was/is very successful. 3       The plaintiff was/is a member of the choir of the Bethesda Frankel Estate Church (“the Church”). The Church had organised a choir camp (“the retreat”) between Friday 2 September and Sunday 4 September 2005 at the Hotel. The retreat was a stay-in camp which purpose was to improve the technical skills and spiritual growth of the choir members. The Church organised the retreat as a package with every participant (including the plaintiff) paying a subsidised sum of $140. The Church collected $140 from each of the participants and paid the Hotel directly. 4       The plaintiff drove herself to and checked into the Hotel at about 5pm on 2 September 2005. Her room-mate was Lindis Szto Cheng Lian (“Lindis”) who was the choir director at the material time. 5       After dinner on Saturday 3 September 2005, there was a concert lasting 1½ to 2 hours. Later, the plaintiff, Lindis, and the plaintiff’s other lady friend Ria Boon (“Ria”) had their non-alcoholic welcome drinks provided by the Hotel. At about 10.30pm, the plaintiff decided to go to a nearby petrol kiosk (which housed a 24 hours convenience store) to buy a loaf of bread for the Church’s communion service on Sunday morning. The plaintiff declined Lindis’ offer to accompany her. 6       According to the plaintiff (who was dressed in jeans and wearing jogging shoes at that time), she walked to her car which was parked in the surface car park at the front of the Hotel. She walked through the Hotel’s well-lit lobby, then out through the main sliding doors onto the marble flooring and descended the three black granite steps (“the steps”) in the direction of the driveway (on the right) leading to the car park. 7       The plaintiff said she placed her left foot on the first step leading down from the lobby level. She then attempted to find the second step with her right foot but due to the dim lighting, missed the step, stumbled and fell, twisting her right ankle in the process. The plaintiff said she experienced excruciating pain and lay on the ground for a while, unable to get up. 8       A taxi eventually drove up to the front of the Hotel, some passengers alighted, inquired if she was alright but left before she could reply. After a while, some bellboys came out of the Hotel to take luggage inside. They approached the plaintiff, said something she could not recall and then left. Subsequently, the bellboys returned, pulled the plaintiff up to stand on her left foot and brought a chair for her to sit on. 9       At this juncture, a friend of the plaintiff, one Quek Lee Choo (“Quek”), and her husband saw what had happened. The plaintiff claimed it was so dim that Quek and Quek’s husband initially mistook the plaintiff for a drunk who was vomiting; they eventually realized it was the plaintiff. 10     The plaintiff telephoned the brother to take her to hospital. At the same time, the plaintiff contacted Ria to tell Ria of the mishap and to say she was unable to continue with the camp. After a few minutes, Lindis and Ria came down from their rooms to the plaintiff’s aid. They removed her right shoe and requested for an ice pack and bandages from a bellboy, Aidil Bin AB Rahman (“Aidil”). Aidil brought a bandage and a bag of ice. The two ladies used the bandage to immobilize the plaintiff’s leg while the ice was used to reduce the swelling on her right ankle. 11     A lady from the Hotel’s front desk, who turned out to be the senior front-desk manager Tan Sor Cheng Jenny (“Tan”), suggested that the plaintiff see a doctor at a nearby clinic. The plaintiff declined, informing Tan that she herself was a medical practitioner and she had called the brother to come to take her to hospital. Tan then left. 12     The brother subsequently arrived and the plaintiff was taken by him to Gleneagles Hospital at about 11.45pm where an orthopaedic surgeon who attended to her took x-rays which revealed that the plaintiff had suffered a bad fracture cum dislocation of the bones of her right ankle. The surgeon performed an emergency operation on the plaintiff the same night. Screws were inserted into her right ankle. These were only removed on 31 October 2005 while other implants were to be removed 12 to 18 months after the accident. 13     The plaintiff was unable to work from the date of the accident until the beginning of November 2005. She claimed that she still suffers pain and stiffness in her right ankle, her mobility is affected and there are keloid scars on the right side of the ankle. One of her medical reports stated that the plaintiff would experience chronic swelling and aching of her ankle and she also has an increased risk of osteoarthritis in that ankle.",
        "The pleadings": "14     The plaintiff commenced this suit a year later in September 2006. In her statement of claim, she allegedinter alia, that the defendant was negligent in that: (a)    the steps of the Hotel were not adequately lit; and (b)    it failed to ensure that the top edge of the steps leading from/to the front entrance were constructed in a colour that would differentiate the top of the steps from its surroundings. 15     In the defence, the defendant denied that the Hotel had been negligent. The defendant contended that the accident on 3 September 2005 was caused solely by the negligence of the plaintiff in not taking due care and attention when descending the steps and in failing to keep a proper lookout.",
        "The evidence": "16     Apart from the plaintiff (PW1), there was no eye-witness to the accident. The plaintiff’s witnesses of fact were Lindis (PW2) and Quek (PW3) while those for the defendant were Aidil (DW3), Tan (DW2) and the Hotel’s general manager Claude Ricca (DW1). Both parties had expert witnesses. The plaintiff’s experts were an architect, Johnny Tan Cheng Hye (‘Johnny Tan”), and a mechanical/electrical engineer, Ng Eng Kiong (“Ng”), while the defendant’s expert testimony came from electrical engineer, Peter Adcock (“Adcock”).",
        "The plaintiff’s case": "17     The facts narrated at [3] to [13] above were essentially extracted from the plaintiff’s affidavit of evidence-in-chief (“AEIC”). In her cross-examination, the following additional facts came to light: (a)    the plaintiff was in charge of programme planning and speakers at the retreat, including taping of the speeches of the speakers (for which she brought her own tapes); (b)    prior to the retreat, she had visited the Hotel once to check on its suitability for the retreat; (c)    there was a full programme (see Agreed Bundle of Documents “AB” at 33) for the 63 participants of the retreat on Saturday 3 September 2005, commencing at 8am and ending at 10pm; (d)    the plaintiff had slept at about 11.30pm on Friday 2 September 2005 and woken up at 7.30am the following morning. 18     In cross-examination, the plaintiff denied that she was tired (due to her heavy clinic schedule) when she checked into the Hotel. She also denied what she had allegedly said to Lindis immediately after the accident and which conversation Aidil overheard and deposed to in his AEIC (para 9). This was to the effect that she had been busy the whole day, she was tired and she was not concentrating when she walked down the steps. 19     The testimonies of Lindis and Quek were not helpful at all as they arrived at the scene of the accident after the plaintiff had fallen. Lindis (no doubt in an attempt to help the plaintiff) took it upon herself to write to the Hotel’s general manager on 6 September 2005 to recordinter aliathat (i) the accident took place; (ii) it had caused the plaintiff much inconvenience as well as loss of patients/income; and (iii) the lighting at the entrance of the Hotel was inadequate and there was a lack of definition in or marking at the edges of the steps. Lindis’ letter also recorded her appreciation of Aidil’s help. 20     In her written testimony, Lindis also recounted an incident where she had visited the Hotel on the occasion of her niece’s birthday some years earlier and her mother almost fell at the front steps due to the poor lighting. She deposed that the lighting on 3 September 2005 had not improved since the earlier incident even though she had told the reception staff of the near accident involving her mother. 21     In cross-examination, Lindis revealed the plaintiff “did not say very much” after she fell – the plaintiff only said “I fell down from the steps”, “it’s very painful” (Notes of Evidence (“N/E” at 75) and she did not mention that she was tired. (I would add that similar answers were given by Quek when the same questions were put to her during cross-examination).",
        "The defendant’s case": "22     Nothing turns on the testimony of the defendant’s general manager Claude Ricca (“Ricca”) who has held his post since 1 March 2001. Ricca deposed that as far as he was aware, no other hotel guest or person had made claims similar to the plaintiff’s during his seven years’ tenure with the Hotel (AEIC at para 8) (despite its high occupancy of up to 90% for its 250 guestrooms). He therefore denied that the Hotel was responsible for the plaintiff’s fall on the steps and asked for her claim to be dismissed. I should add that during cross-examination, Ricca revealed that after the accident and after his receipt of Lindis’ letter dated 6 September 2005 (see [19] above), he informed the Hotel’s engineer and for some 2-3 weeks thereafter, yellow safety strips were added to the edge of the steps. However, because of the heavy human traffic, the safety strips were eventually worn-out and removed but they were not replaced. Ricca candidly admitted that there was no replacement for aesthetic reasons. 23     Tan had made a security incident report (see AB 3-4) of the plaintiff’s accident, in compliance with the Hotel’s procedures. Tan testified that her (undated) report was prepared in response to Lindis’ letter (at [19] above). As her report was largely based on what Aidil told her, it serves little purpose to refer to the same particularly when Aidil had made a separate report. Tan testified (N/E 155) that she had asked Aidil at the scene of the accident how the plaintiff fell and Aidil had told her, “Oh, she missed her step and she fall [sic]”. When he was interviewed by Ricca (after 6 September 2005), Aidil also said the plaintiff had tripped. 24     I turn my attention now to the security incident report made by Aidil (“Aidil’s report”) that was exhibited in his AEIC. In Aidil’s report, he stated, “I happened to notice a local female who had tripped at the Hotel Driveway staircase”. During cross-examination, Aidil clarified that he did not actually see the plaintiff fall. At the material time, he was at the bell desk which was located just inside the sliding doors of the main entrance. He had seen the plaintiff walking out from the lobby but not when she fell. She had fallen by the time Aidil saw her again. 25     Although Aidil’s report, like Tan’s, was undated, questioning by the court confirmed that Aidil’s report was preparedafter3 September 2005. In fact, Aidil’s report was prepared after Ricca’s receipt of Lindis’ letter dated 6 September 2005. This was obvious from the last sentence therein which stated: For your info’, A [sic] few days later I received a “thank you letter” from the guest. The sentence was incorrect as it was Lindis and not the plaintiff who wrote the thank-you note on or about 6 September 2005, on behalf of the Church choir. 26     I would add that in addition to Aidil’s report, he had given a statement on 12 April 2006 (“Aidil’s statement”) (see AB 29) to the loss adjuster of the defendant’s insurers who were investigating the plaintiff’s claim (after receipt of the plaintiff’s solicitors’ letter of demand dated 29 March 2006). Aidil’s statement (after narrating the plaintiff had fallen) contained the following sentences: Sensing that she had fell [sic].I immediately rendered assistance to her. I asked if she was alrite [sic] and she told me that she had miss [sic] her steps and fell. She then told me that the function she had attended had ended very late. 27     Neither in Aidil’s report nor in Aidil’s statement did he mention what he said in para 4 of his AEIC (affirmed on 3 October 2007) where he deposed: At around 10.30pm, I saw the Plaintiff walk past the bell-desk towards the hotel main entrance. She seemed to be in a hurry… 28     The above paragraph should be contrasted with the plaintiff’s AEIC (affirmed on 8 October 2007) where she said in para 10: …It was a dry night. I was not in a hurry. I was alone… The certificate of exchange showed that the parties exchanged AEICs on 8 October 2007. Therefore para 10 of the plaintiff’s AEIC could not have been a response to para 4 of Aidil’s AEIC. I shall return to this observation later in my findings.",
        "The expert evidence": "29     Having disposed of the factual evidence, I turn my attention next to the experts’ testimony starting with that called by the plaintiff. As stated earlier (at [16]), the plaintiff’s first expert was Johnny Tan (PW4). An architect with more than 26 years of experience, Johnny Tan’s brief from the plaintiff’s solicitors in September 2005 was to give his opinion on: (a)    the materials used on the steps of the Hotel’s entrance; (b)    the design of the steps; and (c)    the lighting conditions at the entrance to the Hotel. Johnny Tan visited the Hotel on the same morning he was briefed. 30     According to Johnny Tan’s report (AB 129-130) (a)    the flooring outside the main entrance of the Hotel was light coloured marble while the steps (including the risers) were dark coloured with light grooves at the steps’ edge forming a roughened textured finish. There was no differentiation of colour at the edge of the steps to make the change in levels more clearly noticeable; (b)    the design of the steps was in compliance with existing building codes relating to height of risers and width of treads; (c)    at the Hotel entrance, there was indirect light reflected from the ceiling from sets of light fittings fixed to two poles at the driveway. The light fittings were fixed such that illumination from them was thrown up to the ceiling of the driveway canopy and reflected down to the driveway and the steps. The lighting design made the entrance dim. 31     Johnny Tan opined that it was a combination of factors,vizthe dim lighting, the dark colour of the steps, the lack of differentiation of colours at the edge of the steps and the curvature of the steps that contributed to the plaintiff’s tripping and falling on 3 September 2005. 32     In the course of cross-examination, counsel for the defendant drew Johnny Tan’s attention to various iconic buildings in Singapore,vizOCBC Centre, OUB Centre, Republic Plaza, the (former) Standard Chartered Building (at No 6 Battery Road), the URA Centre as well as the Subordinate Courts Complex and the Family & Juvenile Court – all had steps made of homogenous materials with edged lines at the nosing but no differentiation in the steps. Although there were no building codes that specified that the nosing should be of a different colour from the steps, Johnny Tan opined that it was prudent to do so. 33     While he agreed there was no great physical contrast between each of the steps in the examples produced by the defendant (aside from roughening of the edges of the steps for Standard Chartered Building), Johnny Tan pointed out that the examples were offices or buildings that were used predominantly during the day, unlike the Hotel. 34     In re-examination, Johnny Tan pointed out that the steps of those iconic buildings (save for Republic Plaza) were all of a much lighter colour than the Hotel’s and in the case of the (former) Standard Chartered Building, the building’s steps were well lit from direct overhead lighting. As for the URA Centre, although its steps were light coloured, the authorities had put a yellow strip at the edge of the lowest step to differentiate it from the ground level because the riser of that step was uneven. 35     Johnny Tan referred to The Esplanade as an example of a building that had different nosing at the steps. After some questioning by the court, it emerged that Johnny Tan meant the interior steps at the first level of the Esplanade leading to the concert hall and to the theatre on the lower level; I shall revert to this building later (see [80]). 36     The plaintiff’s other expert witness, Ng (PW5), was also briefed in September 2005 and he prepared two reports, one dated 5 October 2005 (“Ng’s first report”) (AB 134-142) and the second dated 17 December 2007 (“Ng’s second report”) (AB 143-144) which was a response to the report of the defendant’s expert, Adcock. 37     Ng has had more than thirty years’ experience as an electrical engineer and was in charge of designing lights for numerous buildings (commercial and residential) in as well as outside, Singapore. Since 1990, he has been with Squire Mech Pte Ltd, a firm of consulting mechanical and electrical engineers. 38     Ng’s first report was done after he had visited the Hotel at night on 24 September 2005 at around 9.30pm to take illumination measurements. 39     Ng’s term of reference was to investigate the lighting level at the entrance of the Hotel and to determine its adequacy, in relation to relevant codes and industry practice. In this regard, Ng’s first report referred to: (a)    Singapore Standard CP 38: 1999, “Code of Practice for Artificial lighting in buildings”; (b)    “Code for Lighting” (AB 200), The Chartered Institution of Building Services Engineers (CIBSE), United Kingdom; (c)    British Standard/European Standard. BS EN 12464-1: 2002, “Light and lighting - Lighting of work places”; and (d)    Lighting handbook 9thedition, Illuminating Engineering Society of North America. 40     Based on the light readings (which were measured in lux) that he took, Ng opined that the lighting was poor at the steps. To elaborate, Ng obtained the following illumination readings (at AB 139) and which were relied on by the plaintiff in her pleadings:  AreaLux readingsExternal area adjacent to the Hotel’s glass door entrance22-26The top landing of the steps (Hotel ground level)11.4Tread 1of the steps10.7Tread 2 of the steps9.6Bottom landing (driveway level)8.8Centre of driveway4.5  Ng testified that a person descending from one tread to the next on the steps would find it difficult to differentiate the tread edges of the steps. Ng concluded that poor lighting would have been a “major contributing factor” to the plaintiff’s fall at the steps (AB 142). 41     Besides his two reports, Ng produced (see exhibit P1) night photographs that he had taken of 12 local hotels showing their frontages and lighting, as comparables. He concluded therefrom that all the hotels shown in P1 had better lighting than the Hotel. The most brightly lit of these hotels was Park Royal at Kitchener Road, with an illumination of 200 to 300 lux on its front steps (comparable to lighting in our courts), whilst the most dimly lit was the Golden Landmark Hotel at Victoria Street which had an illumination of 25-50 lux at the curb at its front entrance (the hotel has no front steps). 42     By way of comparison (in re-examination at N/E 327), Ng testified that when cinema halls dim their lights before the start of shows, the lighting is about 20 lux and this drops to about 2-3 lux when the shows commence. 43     Under cross-examination (N/E 248), Ng clarified that local codes for lighting requirements covered functional not aesthetic lighting and he was unable to say which category the Hotel’s main entrance lighting came under as he did not know who designed it. If it was designed by an engineer, it would likely to be functional lighting whereas if the lights had been designed by lighting consultants, it would have been aesthetic lighting. 44     Although Ng conceded under cross-examination that some comments in his first report were outside his term of reference (vizwhere he made a finding on the cause of the plaintiff’s fall), he contended that he was entitled (based on his experience) to render his views on the lighting at the Hotel in relation to the steps. 45     Ng’s second report essentially disagreed with the findings made by the defendant’s expert, Adcock, who classified the steps of the Hotel as external space based on definitions by the Urban Redevelopment Authority (“URA”) and Building Control Authority (“BCA”). Adcock had used the checklist of the National Parks Board (“the NPB”) for footpath lighting as his guide. Ng pointed out that the front entrance of the Hotel was its main thoroughfare as it dealt with arriving/departing guests and the loading/unloading of luggage to/from vehicles. Although the entrance area and the steps were not enclosed or interior space, it was still part of the Hotel’s building. As people had to negotiate the steps to get into and out of the Hotel, Ng felt that the area around the steps could not be governed by park lighting standards and “a higher illumination level ought to apply” (para 3). 46     Ng’s second report (para 4) also pointed out that the lighting requirement for an area “is determined by the need to provide adequate illumination for safety and movement”. Consequently, determination of the requisite illumination level cannot be simply based on classification of the space as “external” or “internal” but by the tasks or activities that take place in the space. Ng observed that Adcock’s report showed a sudden drop in lighting level from the better lit lobby to the steps, a ratio of 9 to 10.1. Ng’s second report concluded with this comment: It is common knowledge that when people move from a bright area to a darker place, the human eyes has [sic] a problem to adapt. Such a contrast and darkness would have given visual handicap and may give rise to a loss of balance leading to a fall. 47     I turn now to Adcock’s report dated 6 November 2007 (AB 146 to 156). Adcock, who is from Arup Singapore Pte Ltd (“Arup”), was tasked with reviewing the reports of the plaintiff’s experts on the illumination levels at the Hotel’s entrance. In preparing his report, Adcock visited the Hotel at least three times and took illumination measurements on the second visit on the night of 17 October 2007. 48     Adcock’s readings did not differ greatly from those taken by Ng (see [40] above) as can be seen from the following figures (AB 154):  AreaLux readingsInterior area adjacent to Hotel’s entrance door65 - 92Exterior area adjacent to Hotel’s entrance24.5 -38.1Top landing of steps14.7 - 21.6Tread 1 of the steps7.5 - 9.5Tread 2 of the steps6.9 - 8.1Bottom landing (driveway)6.5 - 7.9Centre of the driveway3.4 Adcock’s report had a range of lux readings because he took measurements at three of the six pole columns located at the driveway of the Hotel. He opined that any variances between his readings and those taken by Ng were attributable to the different light meters they used and to the locations of the light meters when readings were taken. 49     Adcock confirmed that the illumination levels at the Hotel’s entrance area complied with the requirements of the NPB for outdoor lighting and was adequate. In his report (at AB 156), Adcock concluded that the change in illumination level from the interior lobby’s lighting to the external area “[did] not pose a sudden change in human eye perception”. 50     In cross-examination, Adcock’s attention was drawn to the UK lighting guide CIBSE for the outdoor environment and to para 4.11 in particular which pertained to hotels, motels and restaurants. It was noted therefrom that the recommended illumination level for “steps and hazards” was 50 lux, that for “walkways and pathways” was 10 lux while for the category “under canopy”, it was 100 lux. (This third category was relevant because the entrance of the Hotel was sheltered by canopies or giant umbrellas). CIBSE recommended 75 lux as maintained illuminance for in/out ramps (at night). 51     I should point out that Adcock’s classification of the Hotel’s entrance area as external space was based on a letter dated 19 September 2007 (at AB 163) to the defendant’s solicitors from the Hotel’s architects, Alfred Wong Partnership now known as AWP Pte Ltd (“AWP”). In the letter, AWP informed the defendant’s solicitors that when the Hotel was constructed (which was in 1984 according to Arup’s search in the records of the BCA), the M&E Consultants (Rankine & Hill) were in charge of lighting and they provided the design for the umbrella structures at the entrance. AWP added that the area in front of the main entrance steps and the porch structure was regarded as external space; the porch structure was open-sided and meant as a covered vehicular drop-off point. Based on URA and BCA guidelines/definitions, the area was regarded as external “non gross floor” area.",
        "The issue": "52     The only issue for the court’s determination is, what caused the plaintiff’s fall? Was her fall due to inadequate lighting and/or the dark colour of the steps as the plaintiff contended or, was it due to the plaintiff’s own carelessness/fault that she tripped as the defendant contended?",
        "The law": "53     The plaintiff’s claim was based on contract (as a paying guest of the Hotel) and in tort (as an invitee of the defendant who owed her a duty of care since she was an occupier of the Hotel). There can be no dispute that the defendant’s obligations to the plaintiff as their contractual entrant was to take reasonable care to ensure that the Hotel’s premises were safe for her and the purposes of its other guests. In their submissions, the defendant argued, relying on Michael F Rutters’ textbookOccupier’s Liability in Singapore and Malaysia(Butterworths: Singapore, 1985) at 114, that the standard of care owed to contractual entrants and the standard of care owed to invitees were similar. 54     As for occupiers’ liability, the law is succinctly set out inIndustrial Commercial Bank v Tan Swa Eng[1995] 2 SLR 716, where the presiding judge in the appellate court, Lai Kew Chai J, said (at 719): At common law, a person is an invitee if he is on private or public premises for a business purpose of material benefit to the occupier. This is usually referred to as a ‘common interest’ as the invitee himself more often than not also has an economic interest in being on the premises. Bank customers such as Song and Sit at the material time were undoubtedly invitees on the bank’s premises and would have been there with the bank’s consent. The duty owed by an occupier to an invitee is stated by Willes J inIndermaur v Dames[(1886) LR 1 CP 274] in the following terms: And with respect to such a visitor [invitee] at least, we consider it is settled law, that he, using reasonable care on his part for his own safety, is entitled to expect that the occupier shall on his part use reasonable care to prevent damage from unusual danger which he knows or ought to know; and that, where there is evidence of neglect, the question whether such reasonable care has been taken, by notice, lighting, guarding or otherwise, and whether there was contributory negligence in the sufferer, must be determined by a jury as a matter of fact… In short, the duty of an occupier to an invitee would be to prevent damage or injury from anyunusual dangers on the premises he knows or ought to knowand whichthe invitee does not know about. (emphasis in original) 55     Singapore’s law on occupiers’ liability follows the common law whereas in England, the common law position no longer applied after the enactment of the UK Occupiers’ Liability Act 1957 (“the 1957 Act”). Consequently, English case law after the 1957 Act is not applicable to Singapore (including the case ofMaguire v Sefton Metropolitan Borough Council[2006] EWCA Civ 316 cited by the plaintiff). 56     In order to succeed on her claim whether in contract or in negligence, the plaintiff would have to prove: (a)    there was a breach of duty on the part of the defendant in failing to keep the steps reasonably safe and/or there was unusual danger regarding the steps which she was not made aware of; and (b)    the breach of duty on the defendant’s part caused her to fall on 3 September 2005.",
        "The findings": "57     The Hotel is a three star establishment situated in a residential neighbourhood at Marine Parade Road in the Katong suburb of Singapore. It cannot therefore be compared to hotels, particularly five star hotels, in the Orchard Road or even Marina Bay areas. A better comparison would be The Garden Hotel at Balmoral Road, as it is also sited in a residential area comprising mainly of low-rise and high-rise flats. By the same token, the defendant’s reliance on a number of iconic buildings in Singapore (at [32]) that had steps of homogenous materials but with no differentiation was not an accurate comparison – the steps of those buildings were light in colour (save for Republic Plaza) and they were mainly commercial buildings or buildings with human traffic mostly during the day. 58     I had indicated to counsel that I would make a site visit to look at the accident area. In fact, I visited the Hotel twice (in May and June 2008) on a Friday evening on both occasions, at about 10pm. 59     In my visits, I noted that the front porch of the Hotel had six octagonal-shaped or inverted umbrellas supported by six pole columns. Lights for the entrance and driveway were provided by 12 sets of flourescent lamp downlights recessed into the ceiling at the main entrance as well as at the left and right end of the ceiling. A pair of what Ng described as high-pressure mercury vapour lights were mounted on each of the six pole columns and they shone onto the underside of the umbrellas; these lights were then reflected down onto the driveway and the steps. Photographs of the Hotel’s front entrance as well as of the steps were taken by, and can be seen in the reports of, the parties’ respective lighting experts. 60     As for the steps, they were curved and constructed of granite with grooves at the edge or nosings. I had inquired of Ricca when he was in the witness stand (at N/E 103) and he had confirmed that no changes were made to the steps after the date of the accident (3 September 2005). There was no suggestion by Ricca or from the plaintiff’s counsel that the lighting arrangements or illumination levels outside the main entrance of the Hotel had been changed after and as a result of the accident.The preservation of the status quo as at 3 September 2005 was subsequently confirmed by a letter to court from the defendant's solicitors dated 7 July 2008.Of course light bulbs would have been changed periodically due to wear and tear considerations. 61     In my visits, I noted that the lobby of the Hotel was well-lit (as opposed to being brightly lit). I did not form the impression that there was a great contrast between the lighting in the lobby and that immediately outside the main entrance such that the eyes needed time to adjust to the light differential. While the steps were dark because of their colour, they were nonetheless easily discernible and were well-grooved. Indeed, when I walked through the surface car park at the front of the Hotel (which right side the plaintiff was heading to at the time of the accident), I was surprised to note that I was able to see the dials of my watch to check the time. 62     I therefore disagree with Lindis’ complaint in her letter to Ricca (at [19]) that the lighting at the entrance of the Hotel was inadequate and there was a lack of definition at the edge of the steps. I would add that I disregarded Lindis’ testimony (at [20]) that her own mother nearly fell some years earlier at the steps, for lack of corroborative evidence. Even if Lindis only made a verbal complaint to the Hotel over the near incident, she could have called her mother to testify. She did not, and she also did not give any reason for her omission. Consequently, Ricca’s testimony that in his experience, no accident (apart from the plaintiff’s) involving guests or visitors had ever occurred at the steps was unchallenged, under the principle enunciated inBrowne v Dunn(1893) 6 R 67,vizif evidence is not challenged in cross-examination, the court may take it that the evidence is accepted and not disbelieve the evidence. 63     I should point out that in her closing submissions, the plaintiff relied onGillmore v London County Council[1938] 4 All ER 331 (“Gillmore v London County Council”) andProtheroe v The Railway Executive[1951] 1 KB 376 (“Protheroe v The Railway Executive”) to contend that the fact that there were no other accidents did not mean that the Hotel’s lighting was adequate. InGillmore v London County Council, the plaintiff, who was participating in a fitness class organised by the defendant council, slipped and injured himself while performing an exercise on a dance hall which was fairly highly polished. The high court in England held that the plaintiff was entitled to recover damages for the injury he sustained on the basis that the defendant’s duty was to provide a floor that was reasonably safe in the circumstances, which it failed to do. InProtheroe v The Railway Executive, the plaintiff, who was a railway season ticket holder, caught his foot in a crack between a paving stone and one of the coping stones along the edge of the station platform belonging to the defendant, resulting in a fracture of his foot. The plaintiff succeeded in his claim against the defendant for damages on the ground that there was implied in the contract of carriage a warranty that that part of the premises which a passenger was bound to use for the purpose of access to or dismounting from a train was reasonably safe. 64     Although the defendant’s counsel lent the court a light meter for the purpose of taking illumination measurements, I decided against doing so for various reasons:- (i) I am not an electrical engineer and/or lighting expert and may not take the readings correctly; (ii) there was not such a vast difference between the readings taken by the parties’ experts (see [40] and [48]) as to require readings being taken by a neutral party; and (iii) the best and most sensible way to judge the adequacy of the lighting at the Hotel’s frontage was a visual inspection, which was what I did. 65     I turn now to the evidence. It was the plaintiff’s case (in her AEIC) that she was not in a hurry to go out on the night of 3 September 2005 to get a loaf of bread. The reason given in her closing submissions (at para 8.3) was that there was no necessity since it was the end of the day, it was a weekend and there was no danger of any 24 hour store closing. That may well be true but I had earlier noted (at [17]) that the plaintiff and the other participants of the retreat had had a packed schedule that Saturday and on her part, the plaintiff had slept late the previous night and awoken early on Saturday morning. It would not be unreasonable to assume that the plaintiff must have been tired come 10.30pm when she decided to drive out to buy a loaf of bread. It would also not be unreasonable to assume that a person in the plaintiff’s position would be anxious to run her errand and return to the Hotel quickly, so that she could go to bed after a long day. 66     I had also observed earlier (at [28]) that in para 10 of her AEIC, the plaintiff specifically stated she was not in hurry. This was a strange and defensive comment to make. It could not have been in response to Aidil’s AEIC as the plaintiff had not then read Aidil’s testimony, where he deposed that “she seemed to be in a hurry” (see [27]). In other words, unless a person isina hurry, it is my belief that it would not occur to him/her to say he/she isnotin a hurry. It seemed to me that the plaintiff’s comment of not being in a hurry was a pre-emptive move to ward off any allegations of negligence on her part. 67     Both Lindis and Quek had testified that the plaintiff did not say very much when they went to her aid after she fell. That may well be true because she was in great pain. What I found surprising to say the least was their common testimony that the plaintiff did not say how she came to fall. It would have been only natural for anyone in the position of Lindis and Quek to have asked the plaintiff “What happened?” When she replied, “I fell”, they would have followed up by asking her,“How did you fall?”, and the plaintiff would have told them. It was therefore more likely than not that Aidil did overhear what the plaintiff told the two ladies (but which she denied),vizshe missed her step and fell. 68     I did not find the testimony of the plaintiff’s first expert, Johnny Tan particularly helpful, save to note that he confirmed that the Hotel had complied with the relevant building regulations in the construction of the steps. 69     Next, I turn to the testimony of the other experts. In the reports of the respective electrical engineers, the lux readings of Ng and Adcock were not vastly dissimilar. Both were also in agreement that the grooves at the nosing/edges of the steps were meant to give the user a better grip. What they disagreed on was the level of lighting at the steps and the Hotel entrance that would be considered adequate for the safety of guests and visitors to the Hotel. 70     As I stated earlier (at [61]), I did not think the lighting at the frontage of the Hotel was inadequate. I had also commented (at [57]) that it would not be comparing like with like to peg the Hotel against the twelve hotels shown in the photographs (exhibit P1) taken by Ng, due to their vastly different locations. It was Adcock’s evidence (in re-examination at N/E 408) and which I accept, that hotels sited in commercial areas would be/could be more brightly lit. In the case of the Hotel and The Garden Hotel, lighting would have to be more muted, to ensure there were no complaints from neighbours that the quiet enjoyment of their dwellings and their sleep was disturbed or distracted by bright lights emanating from the hotels at night. 71     It would be appropriate at this juncture to look at The Garden Hotel as a comparison to the Hotel. In the course of the trial, I had informed parties that I visited this hotel last November or December for a meal. I had then found the main/front entrance of the hotel to be fairly dark so much so that I had to keep a constant eye on the ground in walking to and from the front surface car park as well as watch myself on the steps leading to its main entrance (and holding onto the railings), to make sure I did not trip. By contrast, the frontage as well as the surface car park of the Hotel were much better lit. I revisited The Garden Hotel immediately after my second inspection of the Hotel to satisfy myself that I was right in my earlier conclusion and indeed I was. Consequently, while the locations of the two hotels were comparable, their level of lighting was not. 72     For easier understanding of the comparisons, I found that the lighting at the front entrance (not the car park) of The Garden Hotel would be a few levels above those in cinemas when their lights are dimmed for the showing of advertisements and trailers (which would be 20 lux according to Ng’s testimony at [42]) before a film is actually screened. The Hotel’s entrance on the other hand was considerably brighter even though the lobby area of the Hotel adjacent to the main entrance did not have readings anywhere near 200-300 lux (which would be the brightness in courtrooms). Adcock’s readings at that area of 65-92 lux (at [48]) meant there was not a vast contrast between the brightness of the interior and the immediate exterior of the Hotel (24.5 to 38.1 lux) such that (according to Ng) the human eye would have a problem in adapting to the sudden change. (I note that Ng did not have comparative lux readings of the lobby area just inside the main entrance of the Hotel). 73     In the parties’ closing submissions (not unexpectedly), they adopted diametrically opposite stands. The plaintiff argued that the defendant should comply with the lighting codes Ng relied on (at [40] above) while the defendant submitted otherwise. I would add that the plaintiff conceded that the codes Ng referred to provided recommendations of, and not mandatory minimum, lighting values. In other words, the codes’ objective was to provide guidance. I note too that the letter of AWP (at [51] above) clearly stated that lighting consultants Rankine & Hill designed the lights. By Ng’s own criterion (at [43] above), it would seem that the canopy lights outside the Hotel were not functional but aesthetic lighting, to which local lighting codes did not apply. 74     Did the lighting codes apply? At the outset, I am in agreement with Ng’s view (at [46] above) that determination of the requisite illumination level cannot be simply based on classification of the space as “external” or “internal” but by the tasks or activities that take place in the space. Consequently, I do not agree with Adcock that merely because the area outside the Hotel was not enclosed space, the lighting requirements need only comply with those prescribed for parks or the outdoors by the NPB. Outdoor lighting levels at that area would clearly be inadequate. However, I do agree with Adcock that the area of the steps would be a transition area (N/E 383) between indoors and outdoors and consequently, neither the codes (applicable to indoor lighting) nor the NPB guidelines (applicable to outdoor lighting) should apply totally or be totally excluded. 75     The plaintiff submitted that the lighting level at the steps should not be 10 lux but 50 lux based on the recommendation in the CIBSE code at [39(b)]. The defendant on the other hand submitted that low illumination levels per se did not mean that the lighting was inadequate. Who is right? 76     The sensible approach was not to apply the recommended lighting levels (of whichever party) in vacuo but to do what I stated earlier (at [63]) I had done – conduct a visual inspection to determine whether the lighting at the particular area of the Hotel was adequate for the activities which went on there,viz(according to Ng at [45] above) the arrival and departure of the Hotel’s guests/visitors and the loading/unloading of luggage to/from vehicles. It bears remembering too that at night, taxis and private vehicles would provide additional illumination by their headlights when they arrive at and depart from the Hotel’s entrance.",
        "The decision": "77     Having carried out the visual inspection exercise and evaluated the evidence presented in court, I find on a balance of probabilities that the plaintiff’s fall on 3 September 2005 was not due to the dark colour and lack of differentiation of the steps but due to her own negligence. I have already indicated (at [61]) that the lighting at the entrance of the Hotel was adequate. 78     It was more likely than not that the plaintiff hurried out of the Hotel that night to buy a loaf of bread. For whatever reason, (be it she was not paying attention or she was tired and/or she had broken the rhythm of her walk/stride from the lobby), the plaintiff missed the second tread of the steps, tripped, fell and fractured her ankle. Even if the colour of the steps had been lighter or the nosing had been more defined (by coloured strips) and/or the lights at the entrance had been much brighter, I doubt the plaintiff’s accident could have been avoided, as she pleaded in her statement of claim. 79     The duty of the defendant as occupier of the Hotel (see [54] above) was to prevent injury or damage being caused to the plaintiff as an “invitee” from unusual danger which the defendant knew of or ought to know. It would be straining the meaning of the words to classify three ordinary, curved and gentle steps leading to and from the front entrance of a hotel establishment as a source of “unusual danger”. It is more than likely that the plaintiff would not have fallen had she paid more attention to her surroundings and exercised some care that night. The Hotel should not and cannot be held responsible for her own carelessness. 80     In this regard I refer to the example given by the plaintiff’s expert Johnny Tan. He had referred to the steps at The Esplanade (see [35] above) as an example of a building that had different nosing at its steps. I have had occasion to use the steps in question (numbering about ten) quite often, when I listen to music or watch performances at the Esplanade Concert Hall and the Theatre respectively. Although the steps are light in colour, have distinctive edges and are not curved, anyone who is foolhardy enough to rush or hurry down the steps would more likely than not fall. A person who suffers a fall under such circumstances would only have himself to blame. I see no difference between that scenario and the plaintiff’s case. 81     In this regard, I should point out that the claims of the successful plaintiffs inGillmore v London County CouncilandProtheroe v The Railway Executive([63]supra) were very much dependent on the particular facts in those cases. They serve at best as examples of the types of situations where the court will hold that the occupier of premises owes a duty of care to invitees. Our facts here were very different. 82     In the light of my findings, it would also not be necessary for me to determine whether McCardie J's decision inMaclenan v Segar[1917] 2 KB 325 “Maclenan v Segar”-that the standard of care owed to invitees (under a contract) and hotel guests contained an implied warranty and was therefore higher than that indicated inIndermaur v Dames([54]supra) was correct (as the plaintiff contended) or should not be followed (as the defendant submitted) because of the decision inBell v Travco Hotels Ltd[1953] 1 All ER 638 (“Bell v Travco Hotels Ltd”). In this latter case, their lordships in the Court of Appeal chose to followGillmore v London County CouncilandProtheroe v The Railway Executiveand distinguishedMaclenan v Segar. I also note that no subsequent decision has followedMaclenan v Segarand that the appellate court's decision inBell v Travco Hotels Ltdseems to suggest a distinction is to be drawn between occupier's liability for the interior and the exterior of a hotel.",
        "Conclusion": "83Accordingly, I dismiss the plaintiff's claim. As Offers to Settle under Order 22A of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) were exchanged between the parties, I shall hear arguments on costs on another day."
    }
}