{
    "case_title": "Low Cze Hong v Singapore Medical Council",
    "ncitation": "[2008] SGHC 78",
    "coram": "Chan Sek Keong CJ; \n      Andrew Phang Boon Leong JA; \n      V K Rajah JA",
    "sections": {
        "Background": "2       Dr Low is a consultant ophthalmologist at C H Low Surgical Centre Pte Ltd situated at Mount Elizabeth Medical Centre. He has been practising as an ophthalmologist since 1972. Toh Seng, accompanied by his son, Mr Toh Tian Hock, and his daughter, Ms Toh Khek Cheng, first consulted Dr Low at his clinic on 26 June 2002. 3       Prior to consulting Dr Low, Toh Seng had been treated for glaucoma in both eyes by Dr Peter Tseng (“Dr Tseng”), Senior Consultant Ophthalmic Surgeon at the Singapore National Eye Centre (“SNEC”), for almost ten years. Toh Seng had been blind in his right eye for many years and his left eye was nearly totally blind. Toh Seng had sought treatment from Dr Tseng on 4 June 2002 for high right intraocular pressure at 40mmHg and was prescribed Gutt Timpilo and Gutt Trusopt (eyedrops) and Diamox tablets. When Dr Tseng saw Toh Seng again on 5 June 2002 and 18 June 2002, Toh Seng’s intraocular pressure had dropped to 20mmHg. This was within the normal range. 4       At his initial consultation with Dr Low, Toh Seng had informed Dr Low that for the previous ten years, he had been treated by Dr Tseng at SNEC for glaucoma. Immediately after Dr Low examined Toh Seng during this consultation, he recommended cataract surgery for Toh Seng’s left eye and a trabeculectomy (glaucoma drainage surgery) with a Molteno tube implant for the right eye. Although Toh Seng’s subsequent complaint to the SMC was about the treatment on both eyes, proceedings were ultimately instituted only for the treatment on the right eye. 5       During this first consultation, Toh Seng complained of severe headaches and pain in his right eye. Dr Low diagnosed Toh Seng to be suffering from neovascular glaucoma with raised intraocular pressure of 58mmHg in the right eye. That was about three times the pressure of a normal eye. Dr Low recommended that Toh Seng undergo trabeculectomy with a Molteno implant to reduce the high intraocular pressure. According to the expert opinion placed before us, a trabeculectomy involves making a small “trap door” on the sclera of the eye to allow the fluid causing high intraocular pressure to drain out into the sub-conjunctival space of the eye; a Molteno implant is essentially a tube that encourages the continuous flow of the fluid. Two days later, Dr Low performed the cataract surgery on the left eye as well as the trabeculectomy with the insertion of a Molteno tube on the right eye. He charged Toh Seng a total of $9,292.66 for the procedure on both eyes. The trabeculectomy procedure on the right eye alone cost $3,800.00. 6       Unfortunately, Toh Seng suffered an extrusion of the Molteno tube in early August 2002. After consultations with Dr Low and seeking second opinions, Toh Seng underwent surgery at Tan Tock Seng Hospital to remove the Molteno tube on 10 September 2002. This surgery was performed by another ophthalmologist. Toh Seng subsequently filed a complaint against Dr Low with the SMC on 29 October 2003. 7       Dr Low filed his reply to the complaints committee of the SMC (“the Complaints Committee”) on 8 January 2004. Thereafter, on 16 November 2004, the SMC sent a letter to both Toh Seng and Dr Low to clarify,inter alia, whether other treatment options were offered and whether the relative benefits and risks of these options were discussed. Toh Seng and Dr Low responded on 26 and 28 November 2004 respectively. 8       The Complaints Committee thereafter wrote a letter to Dr Low dated 27 April 2005 notifying him that some aspects of the complaint would be referred to a disciplinary committee of the SMC. On 23 November 2006, Dr Low received a notice of inquiry from the SMC together with an expert report prepared by Assoc Prof Paul Chew (“AP Chew”). The notice of inquiry laid out the two charges of professional misconduct under s 45(1)(d) of the Medical Registration Act (Cap 174, 2004 Rev Ed) (“the Act”) levelled against Dr Low. 9       The first charge read: That you DR LOW CZE HONG are charged that on or about 26 June 2002, you did recommend glaucoma drainage surgery to your patient, one Toh Seng (“the Patient”) to reduce the high intraocular pressure in his right eye for the purposes of alleviating the pain in his right eye and headaches suffered by the Patient, when you knew or ought to have known that it was not the appropriate treatment. The particulars of this first charge, were,inter alia: … iii.     Glaucoma drainage surgery was not appropriate as a first line treatment for the Patient. iv.     The standard practice as a first line treatment is:- a.      to evaluate medical therapy by optimizing the anti-glaucoma medication for the Patient; and b.      if medical therapy is found to be unsatisfactory, to offer to the Patient other non-invasive procedures such as laser cyclophotocoagulation. 10     The second charge read: That you DR LOW CZE HONG are charged that on or about 28 June 2002, you did perform glaucoma drainage surgery (“the Surgery”) on your patient, one Toh Seng (“the Patient”) without informing him of all treatment and surgical options available to him, and without sufficiently explaining to him the risks, side-effects and nature of the Surgery, and thereby failed to obtain the informed consent of the Patient for the Surgery that was carried out on him. The particulars of the second charge were,inter alia: … iii.     During your consultation with the Patient, you failed to inform the Patient of any other treatment and surgical options available to him. You also failed to sufficiently explain to him the risks, side-effects and nature of the Surgery. 11     Dr Low claimed trial before the disciplinary committee chaired by Prof John Wong (“the DC”), and the inquiry was held on 30 July 2007, 31 July 2007 and 27 August 2007. The other members of the DC were Assoc Prof Ong Biauw Chi (who replaced Assoc Prof Gilbert Chiang on 5 January 2008), Prof Chacha Pesi Bejonji and Ms Wong Mui Peng (who was the lay member). The legal assessor advising it was Mr Giam Chin Toon SC. On 5 January 2008, the DC came to the following conclusions on the first charge (at para 13 of its verdict): (a)    It is not appropriate to recommend therapy, especially invasive therapy, to patients with chronic medical conditions without seeking input from the patient’s primary doctor, especially in the absence of an emergency, and in this case, when there is a non-functioning organ. (b)    It is not appropriate to reject a proper trial of medication in a patient with a non-functioning organ, especially when an invasive procedure is being considered, and especially when the risk of side-effects of a limited trial is acceptable. (c)    It is not appropriate to reject other forms of therapy on the grounds that the doctor is not familiar with the therapy, or because the therapy is not available in their institution, when such therapy is available in the public institution in Singapore. 12     For the second charge, the DC found (at para 20 of its verdict) that: Based on the evidence of all the witnesses, the medical records produced and your testimony relating to this charge, the Committee does not accept that other than drainage tube surgery, you had offered the other options to the patient as you had testified. The Committee is fully satisfied that there was no balanced discussion of risk versus benefit in this case to allow the patient to make an informed consent. 13     It is worthy to note that Dr Low was not faulted for thefailureof the trabeculectomy he had performed, but for the inappropriateness of the treatment. Before passing sentence on Dr Low, the DC made the following pertinent observations on Dr Low’s conduct (at para 22 of the verdict): The Committee has carefully considered the submission in mitigation by counsel for you, Dr Low Cze Hong. However the Committee is of the view that your action, by such a senior member of the medical profession, is a serious breach of professionalism.The Committee has to send a clear signal to the profession that inappropriate treatment cannot be tolerated. The Committee also stresses the critical importance of patients understanding all options available, and the risks and benefits of these options, especially when treatment is elective. [emphasis added] The DC then passed the following sentence: (a)    that [Dr Low] be fined the sum of $7,000; (b)    that [Dr Low] be censured; (c)    that [Dr Low] give a written undertaking to abstain in future from the conduct complained of or in any similar conduct; and (d)    that [Dr Low] pay the costs and expenses of and incidental to the proceedings, including those of the solicitor of the [SMC] and the Legal Assessor.",
        "Grounds of appeal": "14     Before us, Dr Low appealed against his conviction on both charges. For the first charge, he disputed each of the three conclusions reached by the DC. With regards to the first conclusion (see [11] above), he contended that: (a)    Contrary to evidence, the DC failed to recognise that Toh Seng was suffering from an acute onset of neovascular glaucoma during his first consultation with Dr Low, and not the chronic angle-closure glaucoma treated by Toh Seng’s primary physician (Dr Tseng). (b)    The DC erred in law, as the allegation that Dr Low had failed to consult Toh Seng’s primary physician before undertaking invasive surgery was not pleaded in the charge, nor were any particulars thereof pleaded, in the amended notice of inquiry dated 16 July 2007. As such, the DC took into account extraneous matters. (c)    Contrary to evidence, the DC failed to recognise that neovascular glaucoma was intractable to medical therapy. (d)    Contrary to evidence and/or in error of law, the DC incorrectly drew a distinction between the treatment of a sighted and non-sighted glaucomatous eye. 15     With regards to the second conclusion (see [11] above), Dr Low contended that: (a)    Contrary to evidence, the DC failed to recognise that neovascular glaucoma was intractable to medical therapy. (b)    Contrary to evidence, the DC failed to recognise that surgical intervention, in particular, trabeculectomy with a Molteno implant which was performed on Toh Seng, was an appropriate treatment for neovascular glaucoma. (c)    No evidence was provided at the inquiry on whether the risk of side effects of a limited trial of medication was acceptable. (d)    Contrary to evidence and/or in error of law, the DC incorrectly drew a distinction between the treatment of a sighted and non-sighted glaucomatous eye. 16     With regards to the third conclusion (see [11] above), Dr Low contended that: (a)    The DC failed to recognise that surgical intervention, in particular, trabeculectomy with a Molteno implant, was an appropriate treatment for neovascular glaucoma, and, as such, there was no reason for Dr Low to refer Toh Seng to another institution for alternative treatments. (b)    The DC erred in law because the allegation that Dr Low had essentially failed to refer Toh Seng to another institution for alternative therapy was not pleaded in the charge, nor were any particulars thereof pleaded, in the amended notice of inquiry dated 16 July 2007. As such, the DC took into account extraneous matters. 17     Furthermore, Dr Low contended that the DC had erred in law in taking into account the opinion evidence of Dr Tseng on the appropriateness of his treatment and management of Toh Seng, when Dr Tseng was not an expert witness, but a witness of fact. Moreover, the DC erred in law in failing to recognise that there was a responsible body of professional opinion, logically held, that supported his treatment and management of Toh Seng,ie, that surgical intervention via a trabeculectomy with a Molteno tube was an appropriate treatment for Toh Seng’s neovascular glaucoma. 18     For the second charge, Dr Low asserted that Toh Seng and his family were aware of the nature of the surgery, and the risks of the procedure and the availability of other treatment options had been explained to him. 19     Before analysing these grounds of appeal, it is perhaps appropriate to first outline the powers of this court in hearing appeals emanating from decisions of disciplinary committees of the SMC. This case also presents a timely opportunity for us to examine the scope of the term “professional misconduct” as employed in the Act.",
        "Scope of “professional misconduct”": "20     To recapitulate, Dr Low was charged under s 45(1)(d) of the Act for professional misconduct. Section 45(1) reads as follows: 45.—(1) Where a registered medical practitioner is found or judged by a Disciplinary Committee — (a)    to have been convicted in Singapore or elsewhere of any offence involving fraud or dishonesty; (b)    to have been convicted in Singapore or elsewhere of any offence implying a defect in character which makes him unfit for his profession; (c)    to have been guilty of such improper act or conduct which, in the opinion of the Disciplinary Committee, brings disrepute to his profession; (d)    to have been guilty ofprofessional misconduct; or (e)    to have contravened section 64, 65 or 67, the Disciplinary Committee may exercise one or more of the powers referred to in subsection (2). [emphasis added] 21     In examining whether the DC had erred in law in the present case, one has to first establish the standards demarcated by the term “professional misconduct”. Before the DC, counsel for Dr Low forcefully submitted that SMC’s Ethical Code and Ethical Guidelines (January 2002) (“the SMC Ethical Code”) defined “professional misconduct” as being akin to “infamous conduct” (at p 26). “Infamous conduct” had been judicially defined as involving “some moral turpitude, fraud or dishonesty or such persistent and reckless disregard of duty” inDudley Ernest Lyncoln WagerFelix v General Dental Council[1960] AC 704 (“Felix”). Counsel for Dr Low relied onFelixfor his submission that professional misconduct must involve conduct of moral turpitude or fraud or dishonesty. 22     In our view, the definition of “professional misconduct” suggested by counsel for Dr Low should be categorically rejected. The relevant excerpt of the SMC Ethical Code (at p 26) reads: Whether the conduct complained of amounts to professional misconduct is to be determined by the rules and standards of the medical profession. Professional misconduct isakinto the expression “infamous conduct in a professional respect”. The expression “infamous conduct in a professional respect” has been judicially defined in the case ofAllinson v General Council of Medical Education and Registrationas follows: “If it is shown that a medical man in the pursuit of his profession, has done something with regard to it which would be reasonably regarded as disgraceful or dishonourable by his professional brethren of good repute and competency, it is open to the [Council] to say that he has been guilty of infamous conduct in a professional respect.” [emphasis added in bold italics] 23     We note that while the SMC Ethical Code states that professional misconduct isakin, it does not equate it or deem it to be identical, to infamous conduct. That was why it specifically referred to the wide definition used inAllinson v General Council of Medical Education and Registration[1894] 1 QB 750 (“Allinson”) which did not contain any reference to moral turpitude, fraud or dishonesty. That said, this continuing reference to “professional misconduct” being somehow sired by the concept of “infamous conduct in a professional respect” is not altogether helpful and should perhaps now be dropped altogether. 24     It also bears noting that inFelix, Lord Jenkins had understandably given a restrictive definition to the term “infamous conduct in a professional respect” because, as rightly pointed out inTan Sek Ho v Singapore Dental Board[1999] 4 SLR 757(“Tan Sek Ho”) at [13.5], at that time, a finding of infamous conduct necessarily resulted in the harsh penalty of removal from the medical or dental register of the UK. It will therefore be helpful to now examine how the term “infamous conduct” has been gradually jettisoned. 25     In 1969, the Medical Act of that year in the UK (c 40) substituted the phrase “infamous conduct in a professional respect” to “serious professional misconduct” and this stipulation was re-enacted in the Medical Act 1983 (c 54) (UK). This was accompanied by alternative punishments such as suspensions. 26     Likewise in Singapore, the Medical Registration Act (Cap 174, 1985 Rev Ed) was amended in 1998 (by Act 5 of 1997) where the phrase “infamous conduct in a professional respect” was substituted with the less flatulent phrase “professional misconduct”. During the second reading of the Medical Registration Bill (Bill 2 of 1997) on 25 August 1997, this amendment was explained thus (seeSingapore Parliamentary Debates, Official Report(25 August 1997) vol 67 at col 1566 (Yeo Cheow Tong, Minister for Health)): Today, doctors are disciplined only if they are convicted of any heinous offence, or are guilty of infamous conduct in a professional respect. This istoo restrictivea definition of the offences for which disciplinary action can be taken by the [SMC]. The proposed amendments will allow the SMC to discipline doctors who have been guilty of any improper act or conduct which brings disrepute to his profession, or who have been guilty of professional misconduct. [emphasis added] 27     In other words, the replacement of the old term “infamous conduct” with the new term “professional misconduct” by Parliament was not merely a change in linguistic semantics but rather one of real substance. The new term “professional misconduct” plainly embraces a wider scope of conduct for which disciplinary action can be taken by the SMC. It is thus apposite to understand how the term “professional misconduct” has been interpreted in other Commonwealth jurisdictions. In interpreting the term “professional misconduct”, this court is not constrained by the references in the SMC Ethical Code to the definition of the term being “akin to the expression ‘infamous conduct in a professional aspect’”. This is a legal issue in which the courts are better placed to ascertain Parliament’s intention. In any event, the interpretation of the phrase “professional misconduct” in the SMC Ethical Code cannot govern the meaning of the phrase as it appears in s 45(1)(d) of the Act. This would be akin to the tail wagging the dog. In our view, the SMC, in clarifying the scope of “professional misconduct”, may have taken an unduly restrictive view in seeking to maintain an umbilical cord to the concept of “infamous conduct”. This is no longer relevant today in fleshing out the meaning of “professional misconduct” for the reasons we now give. 28     In the UK, the statutory language now used in the corresponding legislation is “serious professional misconduct”. Lord Clyde inJohnRoylance v General Medical Council(No 2) [2000] 1 AC 311 (“Roylance”) gave a thorough exposition of that term (at 331–333) which merits reproduction in full: Misconduct is a word of general effect, involving some act or omission which falls short of what would be proper in the circumstances. The standard of propriety may often be found by reference to the rules and standards ordinarily required to be followed by a medical practitioner in the particular circumstances. The misconduct is qualified in two respects. First, it is qualified by the word “professional” which links the misconduct to the profession of medicine. Secondly, the misconduct is qualified by the word “serious.” It is not any professional misconduct which will qualify. The professional misconduct must be serious. The whole matter was summarised in the context of serious professional misconduct on the part of a registered dentist by Lord Mackay of Clashfern inDoughty v.General Dental Council[1988] A.C. 164, 173: “In the light of these considerations in their Lordships’ view what is now required is that the General Dental Council should establish conduct connected with his profession in which the dentist concerned has fallen short, by omission or commission, of the standards of conduct expected among dentists and that such falling short as is established should be serious. On an appeal to this Board, the Board has the responsibility of deciding whether the committee were entitled to take the view that the evidence established that there had been a falling short of these standards and also entitled to take the view that such falling short as was established was serious.” In the present case the critical issue is whether, if there was misconduct, the misconduct was “professional misconduct.” As counsel for the General Medical Council pointed out it is not simply clinical misconduct which is in issue. Professional misconduct extends further than that. So it is not simply misconduct in the carrying out of medical work which may qualify as professional misconduct. But there must be a link with the profession of medicine. Precisely what that link may be and how it may occur is a matter of circumstances. The closest link is where the practitioner is actually engaged on his practice with a patient. Cases here may occur of a serious failure to meet the necessary standards of practice, such as gross neglect of patients or culpable carelessness in their treatment, or the taking advantage of a professional relationship for personal gratification. But certain behaviour may constitute professional misconduct even although it does not occur within the actual course of the carrying on of the person’s professional practice, such as the abuse of a patient’s confidence or the making of some dishonest private financial gain. InAllinson v.General Council of Medical Education and Registration[1894] 1 Q.B. 750, 761, infamous conduct in a professional respect was held to be established where a doctor by public advertisement had warned the public to avoid other practitioners and recommended them to apply to himself. Lord Esher M.R. adopted, at pp. 760–761, the definition which Lopes L.J. propounded in the same case of “at any rate one kind of conduct amounting to ‘infamous conduct in a professional respect.’” The definition was that such conduct could be established: “If it is shown that a medical man, in the pursuit of his profession, has done something with regard to it which would be reasonably regarded as disgraceful or dishonourable by his professional brethren of good repute and competency …” Lord Esher M.R. then observed, at p. 761: “The question is, not merely whether what a medical man has done would be an infamous thing for any one else to do, but whether it is infamous for a medical man to do ... There may be some acts which, although they would not be infamous in any other person, yet if they are done by a medical man in relation to his profession, that is, with regard either to his patients or to his professional brethren, may be fairly considered ‘infamous conduct in a professional respect,’ and such acts would, I think, come within section 29.” But that definition is clearly not, and was not intended to be, exhaustive or comprehensive. To take the point a stage further, serious professional misconduct may arise where the conduct is quite removed from the practice of medicine, but is of a sufficiently immoral or outrageous or disgraceful character. An example can be found inA County Council v.W.(Disclosure)[1997] 1 F.L.R. 574, where a question arose whether the alleged sexual abuse by a father of his daughter, the father being a medical practitioner, could constitute serious professional misconduct. It was argued that any sexual abuse was too remote from the father’s occupation as a doctor since it was outwith any medical treatment of a child. But Cazalet J. held, at p. 581, that: “it seems to me that this doctor can be said, if he has sexually abused his daughter, to have demonstrated conduct disgraceful to him as reflecting on his profession and/or indeed conduct disgraceful to him as a practising doctor.” What is important here is not only the fact that disgraceful behaviour remote from the carrying on of a professional practice may constitute serious professional misconduct, but also that the duty of a doctor to himself, if not to his profession, exists outwith the course of his professional practice. One particular concern in such cases of moral turpitude is that the public reputation of the profession may suffer and public confidence in it may be prejudiced. But moral turpitude is not the only kind of case outwith the conduct of a medical practice which may constitute serious professional misconduct. InMarten v.Royal College of Veterinary Surgeons Disciplinary Committee[1966] 1 Q.B. 1 a farmer who was also a veterinary surgeon was found to have failed to give adequate care for animals on his farm. He was not guilty of any moral turpitude, but his conduct was held to constitute conduct disgraceful to him in a professional respect. Lord Parker C.J. observed, at p. 9: “But if the conduct, though reprehensible in anyone is in the case of the professional man so much more reprehensible as to be defined as disgraceful, it may, depending on the circumstances, amount to conduct disgraceful of him in a professional respect in the sense that it tends to bring disgrace on the profession which he practises. It seems to me, although I do not put this forward in any sense as a definition, that the conception of conduct which is disgraceful to a man in his professional capacity is conduct disgraceful to him as reflecting on his profession, or, in the present case, conduct disgraceful to him as a practising veterinary surgeon.” Marten was found on account of his work as a farmer to be guilty of conduct disgraceful to him as a practising veterinary surgeon. [emphasis added] 29     InIn re A Solicitor[1972] 1 WLR 869, Lord Denning MR observed (at 873), that negligence “may amount to a professional misconduct if it is inexcusable and is such as to be regarded as deplorable by his fellows in the profession”. Accordingly, what one can distil from the leading English authorities is that professional misconduct requires more than mere negligence, but need not go so far as to require moral turpitude, fraud or dishonesty. 30     Further guidance can be usefully found in the High Court of New Zealand case ofMcKenzie v Medical Practitioners Disciplinary Tribunal[2004] NZAR 47(“McKenzie”) which endorsedthe following test for professional misconduct(fromOngley v Medical Council of New Zealand(1984) 4 NZAR 369 at 375): Has the practitioner so behaved in a professional capacity that the established acts under scrutiny would be reasonably regarded by his colleagues as constituting professional misconduct? [W]ith proper diffidence, it is suggested that the test is objective and seeks to gauge the given conduct by measurement against the judgment of professional brethren of acknowledged good repute and competency, bearing in mind the composition of the Tribunal which examines the conduct. Counsel inMcKenzie(at [64]) also cited a passage from an earlier unreported New Zealand case (B v Medical Council of New ZealandAuckland High Court, 8 July 1996) which helpfully sets out the roles the court and the disciplinary committee play in the disciplinary process: [T]he inclusion of lay representatives in the disciplinary process and the right of appeal to this Court indicates that usual professional practice, while significant, may not always be determinative: the reasonableness of the standards applied must ultimately be for the Court to determine, taking into account all the circumstances including not only the usual practice but also patient interests and community expectations, including the expectation that professional standards are not to be permitted to lag. The disciplinary process in part is one of setting standards. 31     The Australian courts have generally followed the test inAllinson([23]supra). The Supreme Court of Victoria inCampbell v The Dental Board of Victoria[1999] VSC 113, after reviewing several Australian authorities, endorsed the following test used inAdamson v Queensland Law Society Incorporated[1990] 1 Qd R 498at 507): The test to be applied is whether the conduct violates or falls short of, to a substantial degree, the standard of professional conduct observed or approved by members of the profession of good repute and competency … 32     Counsel for the SMC relied onPillai v Messiter (No 2)(1989) 16 NSWLR 197 (“Pillai”) where the New South Wales Court of Appeal considered the statutory test of “misconduct in a professional respect” under the Medical Practitioners Act 1938 (NSW). Kirby P said (at 200): “Misconduct” means more than mere negligence: The words used in the statutory test (“misconduct in a professional respect”) plainly go beyond that negligence which would found a claim against a medical practitioner for damages:Re Anderson[& the Medical Practitioners Act1938–1964(1967) 85 WN (Pt 1) (NSW) 558], (at 575). On the other hand gross negligence might amount to relevant misconduct, particularly if accompanied by indifference to, or lack of concern for, the welfare of the patient: cfRe Andersonat (575). Departures from elementary and generally accepted standards, of which a medical practitioner could scarcely be heard to say that he or she was ignorant could amount to such professional misconduct: ibid. But the statutory test is not met by mere professional incompetence or by deficiencies in the practice of the profession. Something more is required.It includes a deliberate departure from accepted standards or such serious negligence as, although not deliberate, to portray indifference and an abuse of the privileges which accompany registration as a medical practitioner: cfAllinson(at 760-761). These are the approaches which have been taken in our courts. They have been taken in the courts of England where such misconduct is alleged. And they have similarly been taken in the courts of the United States. The entry inCorpus Juris Secundum, vol 58, (1948) at 818, reads: “Both in law and in ordinary speech the term ‘misconduct’ usually implies an act done willfully with a wrong intention, and conveys the idea of the intentional wrongdoing. The term implies fault beyond the error of judgment; a wrongful intention, and not a mere error of judgment; but it does not necessarily imply corruption or criminal intention, and, in the legal idea of misconduct, an evil intention is not a necessary ingredient. The word is sufficiently comprehensive to include misfeasance as well as malfeasance, and as applied to professional people it includes unprofessional acts even though such acts are not inherently wrongful. Whether a particular course of conduct will be regarded as misconduct is to be determined from the nature of the conduct and not from its consequences.” [emphasis added] 33     Samuels JA said (at 208): It was not disputed that acts or omissions in the course of professional practice if so grossly negligent as to attract the strong reprobation of professional brethren of good repute and competence might amount to misconduct in a professional respect, although wholly lacking in moral obliquity:Ex parte Meehan; Re Medical Practitioners Act[1965] NSWR 30;Re Anderson & the Medical Practitioners Act 1938-1964(1967) 85 WN (Pt 1) (NSW) 558 andQidwai v Brown[1984] 1 NSWLR 100. It is necessary, however, for professional reprobation to be established by the evidence of an appropriately qualified person or persons. 34     As we have seen, the Commonwealth authorities we have outlined above are unequivocal in rejecting moral turpitude, fraud or dishonesty as a necessary element of professional misconduct. In providing content to the concept of professional misconduct, bothRoylance([28]supra) andPillaigave examples of how departures from accepted standards could constitute professional misconduct. We agree with this approach. In this connection, a useful symmetry may perhaps be drawn with how the legal profession regulates professional misconduct under s 83(2)(b) of the Legal Profession Act (Cap 161, 2001 Rev Ed) (“LPA”). 35     Pursuant to s 83(2)(b) of the LPA, an advocate and solicitor may be censured if he is guilty of: … grossly improper conduct in the discharge of his professional duty or guilty of such a breach of any usage or rule of conduct made by the Council [of the Law Society] under the provisions of [the LPA] as amounts to improper conduct or practice as an advocate and solicitor[.] This court inLaw Society of Singapore v Ahmad Khalis bin Abdul Ghani[2006] 4 SLR 308(“Ahmad Khalis”) at [77] citedRe Marshall David[1972-1974] SLR 132at 138, [23] for the observation that “grossly improper conduct in the discharge of his professional duties” means that the conduct of the lawyer is “dishonourable to him as a man and dishonourable in his profession”. More importantly, the spirit of the LPA provision is to ensure that “the conduct of the [advocate and] solicitor concerned meets the high levels of professionalism expected of practising lawyers” (Ahmad Khalisat [80]) and it is “of the first importance that the focus be on the maintenance of the highest standards of professional and ethical conduct”(at [75]). 36     In the same vein, this approach applies with equal force to the medical profession under the supervision of the SMC. The importance of maintaining the highest level of professionalism and ethical conduct has been duly acknowledged by the SMC in the Introduction section of the SMC Ethical Code (at p 1): The medical profession has always been held in the highest esteem by the public, who look to their doctors for the relief of suffering and ailments. In modern medical practice, patients and society at large expect doctors to be responsible both to individual patients’ needs as well as to the needs of the larger community. Much trust is therefore endowed upon doctors to do their best by both.This trust is contingent on the profession maintaining the highest standards of professional practice and conduct. … … The SMC has the role of promulgating the Ethical Code and Ethical Guidelines on acceptable professional practice and behaviour and has the responsibility to exercise its duty to discipline members of the profession who fail to uphold the high standards demanded by society. This Ethical Code represents the fundamental tenets of conduct and behaviour expected of doctors practising in Singapore. The Ethical Guidelines elaborate on the application of the Code and are intended as a guide to all practitioners as to what SMC regards as theminimumstandards required of all practitioners in the discharge of their professional duties and responsibilities in the context of practice in Singapore.It is the view of the SMC thatserious disregard or persistent failure to meet these standardscan potentially lead to harm to patients or bring disrepute to the profession and consequently may lead to disciplinary proceedings. [emphasis added] 37     This excerpt pithily highlights the concerns and objectives of the SMC in discharging its regulatory duties in relation to the medical profession. The SMC Ethical Code therefore serves a crucial role in providing an ethical “compass” to guide doctors on what the acceptable standards are from which a departure may constitute professional misconduct. In summary, we accept Kirby P’s suggestion inPillai([32]supra) that professional misconduct can be made out in at least two situations: first, where there is an intentional, deliberate departure from standards observed or approved by members of the profession of good repute and competency; and second, where there has been such serious negligence that it objectively portrays an abuse of the privileges which accompany registration as a medical practitioner seeMcKenzie([30]supra) at [61]).",
        "Role of the court in hearing appeals from decisions of the SMC": "38     Section 46(7) of the Act provides for an avenue of appeal for a medical practitioner aggrieved by the decision of a disciplinary committee of the SMC as follows: Any person who is aggrieved by any order referred to in subsection (6) [an order of the disciplinary committee] may, within 30 days after the service on him of the notice of the order, appeal to the High Court against the order; and any such appeal shall be heard by 3 Judges of the High Court and from the decision of that Court there shall be no appeal. 39     In considering an appeal, a court will be slow to interfere with the findings of the disciplinary committee unless the grounds in s 46(8) of the Act are satisfied. Section 46(8) provides: In any appeal to the High Court against an order referred to in subsection (6), the High Court shall accept asfinal and conclusiveany finding of the Disciplinary Committee relating to any issue of medical ethics or standards of professional conduct unless such finding is in the opinion of the High Courtunsafe, unreasonable or contrary to the evidence. [emphasis added] 40     It is trite that s 46(8) of the Act mirrors the approach under the common law. This court inTan Sek Ho([24]supra) andChia Yang Pong v Singapore Medical Council[2004] 3 SLR 151has accepted the approach adopted by Lord Hailsham of St Marylebone LC inJulius Libman v General Medical Council[1972] AC 217. Lord Hailsham explained (at 221) that it would be difficult to displace a finding or an order of a disciplinary committee: … unless it can be shown that something was clearly wrong either (i) in the conduct of the trial or (ii) in the legal principles applied or (iii)unless it can be shown that the findings of the committee were sufficiently out of tune with the evidence to indicate with reasonable certainty that the evidence had been misread. [emphasis added] 41     More recently, the Privy Council inGhosh v General Medical Council[2001] 1 WLR 1915 emphasised that whilst great deference would be paid to the views of the disciplinary committee, this must not lead to an effective abdication of the court’s appellate jurisdiction. Lord Millett held (at [34]): InEvans v General Medical Council(unreported) 19 November 1984 the Board [of the Privy Council] said: “The principles upon which this Board acts in reviewing sentences passed by the Professional Conduct Committee are well settled. It has been said time and again that a disciplinary committee are the best possible people for weighing the seriousness of professional misconduct, and that the Board will be very slow to interfere with the exercise of the discretion of such a committee … The committee are familiar with the whole gradation of seriousness of the cases of various types which come before them, and are peculiarly well qualified to say at what point on that gradation erasure becomes the appropriate sentence. This Board does not have that advantage nor can it have the same capacity for judging what measures are from time to time required for the purpose of maintaining professional standards.” For these reasons the Board will accord an appropriate measure of respect to the judgment of the committee whether the practitioner’s failings amount to serious professional misconduct and on the measures necessary to maintain professional standards and provide adequate protection to the public. But the Board will not defer to the committee’s judgment more than is warranted by the circumstances. 42     We respectfully endorse the view expressed by Lord Millett. This court will not give undue deference to the views of the disciplinary committee in a way which will effectively render nugatory the appellate powers granted by s 46(7) of the Act. Nevertheless, the courts will also have to heed the salutary reminder given by Lord Phillips of Worth Matravers MR inCouncil for the Regulation of Health Care Professionals v General Medical Council and Ruscillo[2005] 1 WLR 717 (at [78]): Where all material evidence has been placed before the disciplinary tribunal and it has given due consideration to the relevant factors, the council and the court should place weight on the expertise brought to bear in evaluating how best the needs of the public and the profession should be protected. 43     Bearing these considerations in mind, we now review the various grounds of appeal pursued by Dr Low.",
        "The first charge on inappropriate treatment": "",
        "Failure of the DC to recognise that Toh Seng was suffering from acute neovascular glaucoma": "44     Dr Low’s case was that even though Toh Seng had been treated for chronic angle-closure glaucoma at the SNEC, he had diagnosed Toh Seng with acute neovascular glaucoma during the first consultation on 26 June 2002. According to Dr Low, neovascular glaucoma was intractable to medical therapy. Counsel for Dr Low contended that the DC’s usage of the phrase “patients with chronic medical conditions” to describe Toh Seng under the first conclusion (see [11] above) showed how the DC did not appreciate his diagnosis fully. 45     A review of the relevant documentary evidence led us to reject this myopic assertion. The statement of facts[note: 1]had expressly acknowledged Dr Low’s diagnosis of neovascular glaucoma. The expert report tendered by AP Chew also recognised Dr Low’s diagnosis. The notes of evidence[note: 2]also attested to the fact that the chairman of the DC was very much alive to the diagnosis: Chairman:         I just want to seek clarification between page 14 of your notes, para C, the statement, there was a recurrent [sic] of the neovascular glaucoma was lead [sic] to the erosion and failure of the surgery. Then I like to match this to page 52, your para G, G for Golf. So I’m trying to understand. The tube failed because of infection or did it fail because of neovascular glaucoma? Dr Low:    Actually it fails [sic] because of extrusion. … [emphasis added] 46     In our view, the context of the first conclusion evidenced that the usage of the phrase “chronic medical conditions” was to signify that Toh Seng had had a ten-year history of being treated at SNEC by Dr Tseng and it was therefore incumbent on Dr Low to seek input from Dr Tseng since no emergency was involved. We therefore did not think that the DC had overlooked the fact that Dr Low had diagnosed Toh Seng to be suffering from neovascular glaucoma. Whether this diagnosis was correct is an altogether different issue. 47     The crux of the matter before the DC really was whether Dr Low’s treatment, administered just two days after the first consultation, without reference to his previous history, was appropriate for the purpose of reducing the high intraocular pressure for an unsighted eye belonging to a 78-year-old patient who had had a ten-year history with SNEC.",
        "That certain particulars had not been pleaded and did not fall within the charges": "48     Dr Low asserted that nowhere in the charges or the particulars thereof did the following allegations appear: (a)    that his treatment was inappropriate for an unsighted eye; (b)    that he should have consulted Dr Tseng; and (c)    that he failed to refer Toh Seng to another institution. 49     In relation to the failure to refer Toh Seng to another institution, the DC made no finding to the effect that Dr Low had failed to refer Toh Seng to another institution. The precise conclusion reached by the DC (see conclusion (c) set out at [11] above) was that Dr Low was wrong to have rejected other forms of therapy because he was not familiar with those other therapies, or because the alternative therapies were not available in his practice. There was thus no need to plead the allegation that Dr Low had failed to refer Toh Seng elsewhere since that was not an element of the conclusion reached. 50     In relation to the remaining alleged imperfections to the charges, we were satisfied that Dr Low was not in any way “misled or prejudiced by the allegedly faulty charges” (seeAhmad Khalis([35]supra) at [62] citingChew Seow Leng v PP[2005] SGCA 11at [24]). 51     Dr Low had attempted to justify why he did not obtain Toh Seng’s medical records right from the outset in his letter dated 8 January 2004 to the Complaints Committee. Dr Low wrote:[note: 3] From my thorough clinical examination I was convinced that he indeed had previous history of glaucoma and it was not necessary for my treatment to obtain records from Dr Peter Tseng to enable me to treat him further. In his letter he [Toh Seng] had said that Dr Tseng had told him that he could do nothing for him. From my knowledge of Dr Tseng’s practice, Dr Tseng does not do glaucoma drainage surgery, as glaucoma drainage surgery was not his area of specialty. and subsequently testified that:[note: 4] I would not need to have a full detail of what Dr. Peter [Tseng] was doing because I know for a fact, in fact, it is in the literature that medical treatments do not work in neovascular glaucoma and especially in the long term. 52     In so far as the distinction between a sighted and unsighted eye was concerned, AP Chew’s expert report that was furnished to Dr Low together with the notice of inquiry had drawn this very distinction. The particulars of the first charge also stated that Toh Seng had “no light perception in his right eye”. Dr Low, in the same letter to the Complaints Committee, also stated that Toh Seng was told “there could be relief of the pain [in his eye] either by removal of theblindand painful eye or alternatively in order to preserve cosmesis, to do a glaucoma drainage operation to help release the fluid trapped in the eye”. Accordingly, it cannot be said that any surprise or prejudice was occasioned to Dr Low by the failure to allege that Dr Low’s treatment was inappropriate for an unsighted, as opposed to a sighted, eye. 53     Further, we were of the view that the allegation that Dr Low had failed to seek input from Dr Tseng quite clearly arose from the contents of the first charge. The relevant portion of the charge reads: “when you knewor ought to have knownthat it was not the appropriate treatment” [emphasis added] (see [9] above). This must be read together with guideline 4.1.1.1 of the SMC Ethical Code which states: A doctor is expected to have a sense of responsibility for his patients and to provide medical care only after an adequate assessment of a patient’s conditionthrough good history taking and appropriate clinical examination. Put simply, the charge alleged that Dr Low ought to have known that the invasive procedure he recommended was inappropriate in the circumstances because, among other reasons, he ought to have done an adequate assessment of Toh Seng’s medical history. The first charge cannot be challenged on this account. 54     Turning our focus now to whether this aspect of the charge has indeed been made out, it must be noted that the SMC Ethical Code does not require doctors to unearth the complete medical history of a patient in every conceivable situation. What is mandated is anadequateassessment having regard to all the circumstances of the treatment. Plainly the urgency and/or nature of the treatment will be crucial factors in assessing the amount of delving that may be required. In this connection, the first conclusion reached by the DC under the first charge (see conclusion (a) at [11] above) spoke volumes about what it would consider to be adequate in the present case. To recapitulate, the first conclusion reads: It is not appropriate to recommend therapy, especially invasive therapy, to patients with chronic medical conditions without seeking input from the patient’s primary doctor, especially in the absence of an emergency, and in this case, when there is a non-functioning organ. Put in another way, the DC was of the view that before a doctor recommendsinvasivetherapy to a patient withchronicmedical conditions, it is essential to seek input from the patient’s primary doctor in the absence of an emergency. 55     We have no doubt that this is a sensible application of guideline 4.1.1.1 of the SMC Ethical Code in the present circumstances. Dr Low knew Toh Seng had been receiving medical therapy at SNEC for the glaucoma afflicting his right eye. Toh Seng had come to see him for treatment of that eye, and not for an unrelated ailment. The medical records would be patently relevant to better understand the history, cause, treatment and management of the conditions afflicting Toh Seng’s eye so that a fully-informed, considered opinion could be reached by the doctor before recommending invasive therapy in the absence of an emergency. Further, it was the veryfirstconsultation by Toh Seng. After Toh Seng informed him that he had been seeing Dr Tseng at the SNEC for the past ten years, Dr Low made no attempt to investigate Toh Seng’s medical history in this regard. He appeared to have treated the consultation by Toh Seng as simply as would a general practitioner in seeing a patient with a common cold. 56     It will be recalled that in his letter to the Complaints Committee dated 8 January 2004 (see [51] above), Dr Low did not deny that he made no attempt to seek input from Dr Tseng. In our view, this was a bold attempt to brush aside the need to inquire further on the pretext that he was satisfied of his own unshakeable diagnosis. Unfortunately for him, his subsequent testimony (see [51] above), that he did not need to have full details of how Dr Tseng had treated Toh Seng because neovascular glaucoma was intractable to medical therapy, only served to further underscore his failings in this regard. Dr Low himself had admitted that the aim of the treatment he administered wasnotto cure neovascular glaucoma, but to reduce intraocular pressure. What he therefore ought to have done was to assess the medical history of Toh Seng to evaluate the suitability of the various methods to reduce intraocular pressure – perhaps Dr Tseng himself had already evaluated the various possible treatment methods. If Dr Low had in fact checked with Dr Tseng, Dr Low would have discovered that just eight days before seeing Dr Low, Toh Seng’s high right intraocular pressure was successfully controlled by medical therapy. The mere fact that neovascular glaucoma is intractable to medical therapy therefore does not completely absolve Dr Low from his ethical duty under guideline 4.1.1.1 of the SMC Ethical Code. 57     Counsel for Dr Low also attempted to draw a bright line between the angle-closure glaucoma which Dr Tseng was treating Toh Seng for, and the neovascular glaucoma which Dr Low had diagnosed Toh Seng with. He submitted that since both were different conditions, seeking input from Dr Tseng was unnecessary. This argument smacked of a vain attempt to cure a lack of foresight with hindsight: Dr Low would not have known Dr Tseng’s diagnosis of angle-closure glaucoma unless he had consulted Dr Tseng. Indeed, Dr Tseng might well have diagnosed Toh Seng with neovascular glaucoma. To put it bluntly, Dr Low was clearly proceeding blindly and with unjustified haste. 58     It is of course arguable that Dr Low was seeking to use a relatively permanent method of reducing the intraocular pressure and therefore eschewed medical therapy; the good intentions of Dr Low, if this was true, ought not to be faulted. Nonetheless, what the DC faulted him for under its first conclusion (set out at [54] above) was theprocesshe adopted in recommending the invasive therapy. The DC has now articulated what in its view ought to be the prevailing standard (see [13] above). 59     To conclude, it was our view that the first charge contained the allegation that Dr Low ought to have known that his treatment was inappropriate in the circumstances outlined above (at [53]–[56]). We were satisfied from the evidence that the DC did not err in its first conclusion under the first charge.",
        "That Dr Tseng should not have acted as an expert witness": "60     The next ground raised by Dr Low was that expert opinion was elicited from Dr Tseng even though Dr Tseng was called as a witness of fact. It was undisputed that Dr Tseng was called as a witness of fact by the SMC. We note from the notes of evidence that counsel forbothparties had sought to elicit expert opinion from Dr Tseng during their respective cross-examinations. Whilst this was far from ideal, we were of the view that no prejudice was occasioned to Dr Low. This can be seen from how counsel for Dr Low even sought to rely on Dr Tseng’s expert opinion in his submissions. Moreover, the DC had relied mainly on the expert report provided by AP Chew. This will be evident from our discussion in the next section.",
        "That the DC failed to recognise that Dr Low’s treatment was appropriate and therefore there was no reason to refer Toh Seng elsewhere": "61     The gravamen of the SMC’s first charge against Dr Low was that the treatment he recommended to Toh Seng was not the appropriate treatment. According to the SMC’s expert witness, AP Chew, the usual approach to a blind eye with neovascular glaucoma with raised intraocular pressure was to ensure that the intraocular pressure was optimally controlled with topical anti-glaucoma medication, failing which non-invasive methods, such as a laser to the ciliary body or laser cyclophotocoagulation, could be used and repeated once or twice where necessary; with a trabeculectomy being the least favoured option. The cheapest effective management was to remove the eye and replace the eye with an artificial cosmetic shell, but AP Chew clarified in his testimony that that was also not a preferred remedy. In giving evidence, he emphasised categorically that a trabeculectomy was not indicated for blind eyes since it was an invasive surgery with risks and without any real benefit to vision. 62     In his testimony, AP Chew did not mince his words in explaining why he had characterised the treatment performed by Dr Low as being “hasty and aggressive” in his report:[note: 5] Ms Ho [SMC’s counsel]: Yes, so you were telling us why you said that it was hasty and aggressive in this particular case to carry out drainage tube surgery. Dr Chew:Well, it is a large operation, and it is invasive surgery. In the presence of a very high pressure to put in a tube would lower the pressure very suddenly resulting in potential bleeding and coagulate fusion within the eyes. This is usually something we try to avoid especially when the eye has visual potential.When the eye has no visual potential, the idea of doing surgery generally is discouraged because there’s not much value to the patient’s vision that you can restore by doing surgery. And hence, the term aggressive in the sense that it is a large surgery for an eye that does not have vision. [emphasis added] The DC also sought to clarify what Dr Low meant by using the word “aggressive”[note: 6]: Dr [Gilbert] Chiang: I’m not clear why do you say it’s aggressive. Dr Chew:      Because the implant is [an] invasive surgery into a non-sighted eye with no likelihood of restoring vision. We, usually, [have] a discussion with our patients to say that they should not go for invasive surgery because of the risks it contains without any real benefit of vision. Since pain can be controlled by non-invasive methods, this would be what we are taught to do as a first line. Dr Chiang:     Okay, but you mentioned that actually any complication is actually 2 to 3%, right? Dr Chew:      2 to 3% is the rate that we have in our publications. Dr Chiang:     And your subject studies are those with non-functioning eye? Dr Chew:      No, we don’t do tubes on non-vision, non-seeing eyes. Dr Chiang:You don’t do tubes on non-seeing eye? Dr Chew:No, we do not. Dr Chiang:So in this case, your view is that this is a non-seeing eye, and therefore a tube should not have been put in position. Is that correct? Dr Chew:That is why we felt that it was aggressive. [emphasis added] 63     Conversely, Dr Low’s expert witness, Dr Cheah Way Mun (“Dr Cheah”), stated in his report that medical therapy was not effective for neovascular glaucoma and that was evident from how Toh Seng’s intraocular pressure had increased even after receiving medication from Dr Tseng. He stated that the Diamox tablets prescribed by Dr Tseng could only help to lower eye pressure in the short term but could cause damage to the kidneys and liver when taken in the long term. In relation to laser cyclophotocoagulation raised by AP Chew, Dr Cheah stated that that was a new form of treatment in 2002. It was used in the teaching centres at the National University of Singapore and at the SNEC but was not available at the Mount Elizabeth Medical Centre in June 2002. Further, he asserted that the glaucoma drainage surgery of the kind performed by Dr Low had a long track record of safety and efficacy and was common practice in New Zealand, Australia and the UK. 64     Dr Low further relied on how AP Chew had testified that the complication rate for a trabeculectomy with a Molteno implant was only 2% to 3%. We therefore queried counsel whether there was any data on what the complication rate for a 78-year-old patient like Toh Seng would be but they were unable to assist this court. Interestingly, we noted that the Chairman of the DC had put the same question to AP Chew but AP Chew was unable to provide the relevant information. Bearing in mind that the patient in this case was 78 years old, we therefore did not think it was appropriate for Dr Low to rely on the general figure of 2% to 3% in the present case. He had no statistical studies to support such an assessment of the risk pattern for patients of an advanced age. As a matter of common sense, one would think, given the age of Toh Seng, an invasive procedure would be the very last resort to be employed only after all available alternative treatments were discussed, explored and considered inappropriate. It seems to us that Dr Low proceeded with the procedures with inappropriate haste. 65     The SMC also called Dr Tseng to prove that when Dr Tseng prescribed medication to Toh Seng on 4 June 2002, Toh Seng’s intraocular pressure dropped to 20mmHg within a day and on 18 June 2002, it was still at that level. Dr Tseng testified that at that time, he saw no need to offer any further treatment since medical therapy had effectively reduced Toh Seng’s intraocular pressure. 66     In relation to medical therapy, Dr Cheah warned that a long-term use of Diamox could produce severe side effects. AP Chew concurred with him. However, Dr Tseng confirmed in his testimony that 4 June 2002 was the first time Toh Seng was prescribed Diamox. The medical history of Toh Seng was not one where he had been on a regular course of Diamox. This considerably bolstered the SMC’s case that Dr Low ought not to have opted for an invasive procedure without first investigating the medical history of the patient and considering the feasibility of medical therapy. 67     If medical therapy was ineffective or inappropriate for that particular patient, AP Chew stated that laser cyclophotocoagulation should have been the next treatment of choice. Dr Low, however, asserted that laser cyclophotocoagulation would have been difficult to perform given the presence of blood in Toh Seng’s eye. That would diffuse the power of the laser and obstruct the view of the ciliary body which was to be burnt. Dr Cheah also testified that laser cyclophotocoagulation would not have reduced intraocular pressure in the short run. In this connection, the DC had asked AP Chew whether laser cyclophotocoagulation could have been performed on Toh Seng:[note: 7] Chairman:      … Can I ask you, in the presence of rubeosis [abnormal blood vessel growth in the iris] and hyphema [blood in the eye], would that be a contraindication to any form of laser therapy because the operator may not be able to visualize the ciliary body? Dr Chew:      It would not be a contraindication to cyclophotocoagulation which does not require direct visualization of the ciliary body. It’s put over an anatomical landmark a few millimetres behind the cornea limbus, so consequently, the ciliary body is not usually directly visualized. It’s just placed in about the right position.  68     At the end of the day, it must be recognised that the DC, as a body made up of medical professionals, had scrupulously evaluated expert opinion from both parties and it was well entitled to prefer the expert evidence rendered by AP Chew over that of Dr Cheah. InSakthivel Punithavathi v PP[2007] 2 SLR 983, the court outlined the approach which should be adopted by the courts in dealing with conflicting expert evidence (at [75]): Generally speaking, the court should also scrutinise the credentials and relevant experience of the experts in their professed and acknowledged areas of expertise. Not all experts are of equal authority and/or reliability. … [A]n expert with … relevant clinical experience may often prove to be more credible and reliable on “hands-on” issues … This approach would likewise apply to tribunals such as the DC in the present case. Dr Cheah’s speciality is in paediatric ophthalmology. He does not specialise in the treatment of glaucoma. He had not performed a single trabeculectomy with a Molteno implant or laser cyclophotocoagulation procedure in his 27 years of practice. On the other hand, AP Chew is the Chief of the Department of Ophthalmology at the National University Hospital, and he is an eminent glaucoma specialist who has published many papers in that field. 69     Accordingly, there was no reason for us to disturb the DC’s considered preference for the expert opinion given by AP Chew in reaching its second conclusion under the first charge (see conclusion (b) set out at [11] above),viz, that it was not appropriate to reject a proper trial of medication in a patient with a non-functioning organ, especially when an invasive procedure was being considered, and especially when the risk of side-effects of a limited trial was acceptable. 70     Further, it was made apparent through cross-examination that Dr Low did not have a good working knowledge of laser cyclophotocoagulation as a treatment method and,a fortiori, its effectiveness. That was precisely why he did not offer laser cyclophotocoagulation as a treatment. The following exchange bears this out:[note: 8] Ms Ho:     Ok, and you have literature to confirm that it is a prescribe[d] or indicated therapy for non sighted eye, as in drainage tube surgery? Dr Low:    I do not have specific information in that regard in, for that particular point but I’m aware through many years of using [Molteno] implant that it successfully brings down the pressure … … Ms Ho:     … Is it your evidence that you are not familiar with the procedure of Laser Cyclophotocoagulation? Dr Low:    Yes. Ms Ho:     And in your view is it your evidence that, that is one of the reasons why you did not offer this option to your patient? Dr Low:    Yes. Ms Ho:     Would you agree with [AP Chew’s] evidence that in such a case if the surgery or the treatment option is not familiar to you but is in the best interest of the patient you should refer or get a second opinion? Dr Low:    No. Ms Ho:     You disagree with that position? Dr Low:    Because I, I don’t know that procedure is workable ok. From my experience is Pan Cyclo CryTherapy [sic] I reckon the laser also will be as ineffective as a Plan Cyclo and will cause more pain, so my attitude is no point ok trying to pursue it in a great way alright, and especially it comes from an institution that has all the lasers and if you’re not offer the treatment to him I have to treat him in the best way I know. Ms Ho:     Yes, are you saying that you are not aware that Laser Cyclophotocoagulation is a standard treatment option? Dr Low:    It is not a standard treatment. Ms Ho:     Ok, then are you saying you did not know that it was relevant to this patient? Dr Low:    Yes, it’s not relevant to this patient, as far as I know. Ms Ho:     Ok, [i]sn’t it then prudent for you to send the patient for a second opinion if that was something you were not familiar with and could possibly be an option? Dr Low:    First of all I don’t know that this procedure was in existence in, among all the doctors in Mount [Elizabeth Medical Centre], we should normally send, he come [sic] from institution and I’ll assume that he, whatever was available in institution would have been provided to him. So if that was not available … and if they had gone through the rounds in institution and the patients finally land on you, you have to do what you are capable of doing and if you are not aware of this other procedure that was touted to be working and I don’t believe it work very well too er, then it is, how can I refer to someth [sic], recommend something that I don’t even know will work? … Ms Ho:     Yes, so, I just want to be clear that you were not familiar with … Cyclophotocoagulation? Dr Low:    Correct. Ms Ho:     Is it your, your position that the fact that you did not have the Laser and G Probe suitable to do the Laser Cyclophotocoagulation … procedure was a reason or 1 of the reasons why you did not offer that as a treatment option? Dr Low:    Yes. 71     Pertinently, Dr Cheah admitted during cross-examination that laser cyclophotocoagulation had been available since the 1990s:[note: 9] Ms Ho:     I put it to you that the laser cyclophotocoagulation with the solid state laser and G probe was not a new modality to treat glaucoma in 2002 because it has been present since the early 1990s. Dr Cheah: To me it is a new thing, to most doctors in the private practice, it is a new thing. Ms Ho:     But you accept that it is an available treatment since the 1990s. Dr Cheah: We are aware of that. 72     Since Dr Low was a senior visiting consultant at SNEC at all material times, he ought to have been aware that laser cyclophotocoagulation treatment was available at the SNEC. By reason of the SMC Ethical Code (at pp 3–4) it rightly behoves a doctor to keep abreast of medical knowledge relevant to his practice and ensure that his clinical and technical skills are maintained. It is manifestly insufficient for Dr Low, as a specialist, to simply rely only on treatment methods with which he was familiar. His ignorance about laser cyclophotocoagulation as an available treatment underscored rather vividly his failure to discharge his duty in the best interests of his patient, and indeed, just as importantly, his quite apparent failure to keep abreast of relevant medical developments in his area of specialisation. We found this rather disturbing. 73     The DC was hence also fully justified in reaching its third conclusion under the first charge (see conclusion (c) set out at [11] above),viz, that it was inappropriate to reject other forms of therapy because Dr Low was not familiar with those therapies, or because the alternative therapies were not available at Dr Low’s clinic. We would add that a doctor’s professional responsibility to keep abreast of medical knowledge is all the more vital as it will assist the doctor to better appreciate the limits of his own competency as mandated by guideline 4.1.1.6 of the SMC Ethical Code. The guideline reads: A doctor should practise within the limits of his own competence in managing a patient. Where he believes that this is exceeded, he shall offer to refer the patient to another doctor with the necessary expertise. The present case provides a classic illustration of how easily a doctor can fall into the false assumption that the management of a particular patient is within his competence when he fails to keep abreast of medical developments relevant to his practice. We are constrained to emphasise that all medical practitioners must uncompromisingly strive to remain updated through continuing education. 74     For the above reasons, we were satisfied from the evidence that each of the three conclusions reached by the DC under the first charge had been fully made out.",
        "The second charge on lack of informed consent": "75     Under the second charge, the DC found on the evidence that Dr Low failed to: (a) inform Toh Seng of other treatment options; and (b) explain the risks, side-effects and nature of the trabeculectomy with a Molteno implant. A doctor’s ethical duty with regards to informed consent is encapsulated in guideline 4.2.2 of the SMC Ethical Code, which reads: It is a doctor’s responsibility to ensure that a patient under his care is adequately informed about his medical condition and options for treatment so that he is able to participate in decisions about his treatment. If a procedure needs to be performed, the patient shall be made aware of the benefits, risks and possible complications of the procedure and any alternatives available to him. … As a related observation, the importance of keeping proper medical records in accordance with guideline 4.1.2 of the SMC Ethical Code will become apparent later in these grounds. Guideline 4.1.2 states: Medical records kept by doctors shall be clear, accurate, legible and shall be made at the time that a consultation takes place, or not long afterwards. Medical records shall be of sufficient detail so that any other doctor reading them would be able to take over the management of a case. All clinical details, investigation results, discussion of treatment options, informed consents and treatment by drugs or procedures should be documented. Bearing this in mind, we analyseseriatimthe allegations that Dr Low failed to inform Toh Seng of: (a) alternative treatment options; and (b) the risks, side-effects and nature of the trabeculectomy with a Molteno implant.",
        "Failure to inform Toh Seng of other options": "76     In this regard, the SMC relied primarily on the testimony of Mr Toh Tian Hock (“Toh TH”) and Ms Toh Khek Cheng (“Ms Toh”). Toh TH and Ms Toh had accompanied their father, Toh Seng, during his first consultation with Dr Low. Toh TH gave testimony to the effect that no options were offered by Dr Low:[note: 10] Ms Lim [Dr Low’s counsel]:          Dr Low’s case is that he advised your father and yourself as well as your sister since she was present on the treatment options for your father’s right eyes [sic]. Toh TH:        It was no priority to us. Ms Lim:        Ok. Ok I’m just going to put the options that were offered by Dr Low just on the record. Ok the first option was to do nothing with the right eye. Do you agree or disagree? You don’t know? Toh TH:        I’m not aware of it. Ms Lim:        Ok. The second option was to remove the right eye. Do you agree or disagree? Toh TH:        again I’m … Ms Lim:        Not sure? Toh TH:        I’m not 100% sure. I’m not aware of it. Ms Lim:        Ok. So you are also not 100% sure whether the third option which was to freeze part of the right eye was also offered? Toh TH:        Say say again. Ms Lim:        Ok. The third option was to freeze part of your father’s right eye. Can you say whether that was offered or are you not sure? Toh TH:        I totally didn’t. Never hear about it. Freeze the eye uh? Ms Lim:        Fourth option was laser treatment. Can’t remember? And ultimately the option that was recommended by Dr Low and which your father did do, the glaucoma surgery right? Which is the insertion of the tube and so on. Toh TH:As we remember there is no option as you said. It’s a little headache. We will just put a tube and that’s it. Ms Lim:        And Dr Low’s recommended this option because this was the quickest way to lower the pain in your father’s eyes. Toh TH:That’s all we were told. The tube can get rid of the headache. Ms Lim:        The purpose was to stop the headaches that your father was experiencing. Toh TH:        Yes Ms Lim:        Dr Low’s case is also that he explained the risks and the complications of the glaucoma surgery to your father. You disagree? Ok. And I have to put Dr Low’s case to you as well that the risks and complications include failure of the surgery, infection and the tube sticking out of the eye. Toh TH:        No[.] [emphasis added]  77     The second witness for the SMC, Ms Toh, admitted that her memory of the events were hazy. However she wrote a contemporaneous e-mail dated 26 June 2002[note: 11]to her siblings after the first consultation with Dr Low. Her e-mail, excerpted below, made no reference whatsoever to any options offered by Dr Low: Dr Low said that dad’s right eye is completely damaged by glaucoma, so nothing can be done here. But due to the building up of fluid pressure on the retina, he will do a small incision to drain out the fluid and may put in a small permanent “pipe” to drain out future fluid. This is to prevent dad getting all the severe headaches he is having. With this operation, he may not need to put eye drops in future. The overall impression we gathered from the testimonies of Toh TH and Ms Toh was that during the first consultation, Dr Low had couched the trabeculectomy with a Molteno implant as a safe, simple, straightforward procedure which would get rid of the headaches Toh Seng was suffering from. He did not provide options. Indeed, that was precisely how Dr Low had sought to characterise the procedure under cross-examination. 78     On the other hand, Dr Low’s defence was canvassed in his letter to the Complaints Committee dated 28 November 2004. He wrote that he had offered four other options: (a) drainage tube surgery; (b) removal of the eye; (c) cyclocryotherapy; and (d) laser therapy (clarified as laser trabeculoplasty). On cross-examination, Dr Low qualified his position by conceding that all these options were mentioned only “generally”, in “rapid discussion”, “not in detail” and “in passing” because he did not believe that any of these options were effective. He further elaborated that: (a) removal of the eye was something he would do only if the eye was unsightly; (b) cyclocryotherapy was a blind procedure because the doctor would not know where exactly the ciliary body was and the procedure would destroy the ciliary body; and (c) laser therapy was generally futile, difficult and dangerous. 79     When counsel for the SMC asked why he had put forward these options which he did not think were standard treatment options, Dr Low’s answer was starkly telling:[note: 12] Ms Ho:     You were putting forth all possible options even though they were not part of the standard treatment options. Dr Low:    We, we talk in general to patients every, every possibility under the sun ok, because if we can treat, this is, this [sic] are all the options nowadays in this Environment, we tell him yeah you don’t treat, you can treat, you can go and see somebody else. It’s all up to you and especially a CSC [Civil Service Club] cardholder that’s the last person we want to treat. Instead of focusing on offeringviabletreatment options, Dr Low had to take this farcical position of claiming to have talked about “every possibility under the sun” in an attempt to justify why he said he had offered these options even though he thought that none of the options were workable. This inevitably invited a further assessment of the credibility of his entire testimony. 80     More critically, his case notes made no mention ofanyof these options, other than “Opn. Rt relief of pain & headache” (which meant “operation on right eye for relief of pain and headache”) and “KIV: Rt Trabeculectomy/ ± Molteno Implant”.[note: 13]As we will see again later in these grounds, such bare documentation in flagrant breach of guideline 4.1.2 of the SMC Ethical Code exemplified Dr Low’s rather cavalier approach to record keeping. Whilst we were aware that the charge Dr Low faced was not that he had failed to keep proper records, the lack of documentation in his case notes certainly did not assist him in his assertion that he had discussed other treatment options. Having considered all the evidence, we unhesitatingly agreed with the DC that Dr Low had not discussed any options with Toh Seng and/or his family members.",
        "Failure to explain the risks, side-effects and nature of the trabeculectomy": "81     We next turn to the allegation that the risks, side-effects and nature of the trabeculectomy performed on Toh Seng were not fully explained. AP Chew expressed the view that in order to obtain informed consent in the present case, it was incumbent on the doctor to explain the following: (a)    why a trabeculectomy with a Molteno implant was necessary since the tube implant would remain in the patient’s eye for many years; (b)    the risks of extrusion of the tube; (c)    the risks of infection to the tube implant; (d)    the possibility that the tube could be blocked; (e)    that a breakdown of the wound could cause the tube to shift; (f)     that surgery would cause a lot of scarring; (g)    the need for extensive post-operation anti-inflammation medication; and (h)    that anti-glaucoma medication would still be needed. 82     Toh Seng and Toh TH’s testimonies were that Dr Low proffered none of the above. On the other hand, Dr Low’s entire defence was predicated on the phrase “guarded prognosis” which he wrote in his case notes. During examination-in-chief, Dr Low explained that “guarded prognosis, it is my code word to say that I discuss all the problems with the patient. I know the chance is not good, there [are] some risks, there [are] some benefits, there is some possible complication … Now if it is very good, I won’t write anything about it”.[note: 14] 83     Subsequently, under cross-examination about the discussion of treatment options, Dr Low asserted he had “put a summary”[note: 15]of the discussions in his case note. When quizzed further on this alleged “summary”, he again relied on thesamephrase “guarded prognosis” and said that “Yeah, I’ve written guarded [prognosis], that implies I’ve discussed options available to him”.[note: 16]We saw this as a feeble attempt to impute from the words “guarded prognosis” various imaginative meanings going well beyond anything they could reasonably bear. In the light of how guideline 4.1.2 of the SMC Ethical Code (see [75] above) requires the documentation of,inter alia, treatment options and informed consents, we found the lone phrase “guarded prognosis” to be woefully inadequate. The egregiousness of Dr Low’s conduct in this regard was aptly captured in the DC’s verdict where, before passing sentence on Dr Low, it emphasised the significant weight it placed on a doctor’s ethical duty to obtain informed consent from a patient (at para 22): The Committee also stresses thecriticalimportance of patientsunderstandingall options available, and the risks and benefits of these options, especially when treatment is elective. [emphasis added] 84     Additionally, Dr Low attempted to attack the credibility of the witnesses, by alleging,inter alia, that the focus of Toh TH and Ms Toh was on Toh Seng’slefteye, because the primary reason Toh Seng had consulted him was to restore vision in the left eye. Although the DC had the benefit of witnessing the demeanour of the witnesses, we had nevertheless carefully reviewed the evidence to satisfy ourselves that its findings were properly grounded. We saw no basis on which to differ from the DC’s conclusions on the credibility of the witnesses. 85     Lastly, Dr Low produced on 12 July 2007 a consent form signed by Toh Seng which attested that “I … have been fully informed of the possible risks of operation or infection”. That consent form was only partially complete – save for his signature, Toh Seng did not fill up his name and National Registration Identity Card number. Counsel for SMC characterised the consent form as one merely of formality and not substance and submitted that even Dr Low had treated the consent form as insignificant since he had failed to produce it when queried by the Complaints Committee on 16 November 2004. Further, a nurse at Dr Low’s clinic, June, had attested to witnessing Toh Seng’s signing of the consent form, but she was not called to give evidence. An adverse inference could be drawn against Dr Low for failing to have done so. 86     In our view, an analogy with the legal profession is again apposite to elucidate the proper attitude professionals should adopt in applying the relevant professional ethical rules to their daily work. InLaw Society of Singapore v Tan Phuay Khiang[2007] 3 SLR 477, this court said (at [100]): It is also axiomatic that it is the spirit and intent, rather than just the plain letter, of the professional ethical rules that breathe life and legitimacy into the standards that are relevant in assessing whether a lawyer has discharged his professional obligations. Thus, a lawyer who merely takes cursory steps to explain the nature of the documents may be held liable for breach of his professional duties:Law Society of Singapore v Vardan Vasantha Lakshmi[2007] 1 SLR 240… Notwithstanding that the SMC Ethical Code does not enjoy statutory force unlike the Legal Profession (Professional Conduct) Rules (Cap 161, R 1, 2000 Rev Ed), the SMC is charged under the Act to regulate the conduct and ethics of the medical profession. To this end, the SMC Ethical Code is an embodiment of the ethical values the SMC strives to inculcate in each member of the medical profession, and, in so doing, raise the overall standards of professional practice and conduct. In this connection, it is imperative for doctors to internalise the ethical responsibilities under the SMC Ethical Code and to duly perform them not just in letter, but in accordance with its spirit and intent. 87     In J K Mason, R A McCall Smith & G T Laurie,Law and Medical Ethics(Butterworths LexisNexis, 6th Ed, 2002), the writers comment (at para 1.36): [O]ne of the most important roles of the [General Medical Council of the UK] has been to fill the gap in constraining such actions as are not actionable yet which would not be expected of the ethical practitioner. We take this opportunity to commend the SMC in sending a strong signal that the ethical duties of a doctor must be adhered to at a level that is commensurate with the high level of trust and esteem that society reposes in the medical profession. The DC has illuminated, through its verdict and observations, a clear vision of the standards it expects from members of the medical profession in order for them to uncompromisingly maintain the highest standards of professionalism and ethical behaviour. 88     The medical profession is a historically venerated institution. Its hallowed status is founded upon a bedrock of unequivocal trust and a presumption of unremitting professional competence. The basic premise underpinning the doctor and patient relationship is that all medical practitioners will infallibly discharge their duties in the time-honoured and immaculate traditions of this singularly noble profession. Unfortunately, this is not always the reality. Regrettably, and indeed reprehensibly, a few doctors abuse what should be an inviolable relationship when they prescribe unnecessary treatment and/or overcharge. From time to time, professional lapses and incompetence surface. Needless to say, such errant conduct must be painstakingly policed and effectively deterred if the medical profession is to continue to rightfully occupy its unique position in society. All it needs is a few recalcitrant practitioners to diminish the stature and standing of a revered and respected institution. The SMC plays a pivotal role in ensuring it does not. It is heartening that the SMC has shown a determined and uncompromising attitude in this instance to maintain the highest standards so as to protect the public and to preserve the reputation of the profession. We hope that other disciplinary tribunals will be guided by this approach and continue to demand the highest professional standards from their colleagues. We further recommend that the SMC circulates to all its members the verdict of this disciplinary committee. This will assist in further sensitising the medical profession to the very important practical issues that have arisen in these proceedings.",
        "Delay in the proceedings": "89     Prior to the conclusion of the hearing, we observed that three years had elapsed between the time Toh Seng first lodged his complaint with the SMC and the time Dr Low was served with a notice of inquiry. To facilitate a better understanding of the events, we requested that the SMC tender a chronology of events leading up to the inquiry. In these grounds, we wish to highlight one point from our review of the chronology tendered by counsel for the SMC: Although they were instructed in May 2005, counsel for the SMC took one entire year to simply review the file and to liaise with the various witnesses. Whilst that did not affect our decision in this case, we must remind counsel that any unjustified delay will not only unnecessarily prolong the anxiety of the doctor being investigated, but may also be detrimental to the witnesses’ recollection of relevant events. The SMC ought to approach the prosecution of disciplinary cases with greater swiftness and vigour. Justice must not only be done but must be seen to be done promptly. Otherwise, the process will itself become the punishment.",
        "Conclusion": "90     In the light of the above reasons, we saw no basis to disagree with the findings of the DC and therefore dismissed the appeal with costs. ________________[note: 1]At para 6.[note: 2]At p 462 of Dr Low’s affidavit[note: 3]See letter exhibited at p 85 of Dr Low’s affidavit.[note: 4]See transcript exhibited at p 401 of Dr Low’s affidavit.[note: 5]See transcript exhibited at p 368 of Dr Low’s affidavit.[note: 6]See transcript exhibited at pp 392–393 of Dr Low’s affidavit.[note: 7]See transcript exhibited at pp 390–391 of Dr Low’s affidavit.[note: 8]See transcript exhibited at pp 439, 440–445 of Dr Low’s affidavit.[note: 9]See transcript exhibited at p 480 of Dr Low’s affidavit.[note: 10]See transcript exhibited at pp 352–353 of Dr Low’s affidavit.[note: 11]See exhibit at p 82 of Dr Low’s affidavit.[note: 12]See transcript exhibited at p 431 of Dr Low’s affidavit.[note: 13]See exhibit at p 102 of Dr Low’s affidavit.[note: 14]See transcript exhibited at p 409 of Dr Low’s affidavit.[note: 15]See transcript exhibited at p 422 of Dr Low’s affidavit.[note: 16]See transcript exhibited at p 423 of Dr Low’s affidavit."
    }
}