{
    "case_title": "Chia Kin Tuck v Chia Ee Moey and Others",
    "ncitation": "[2008] SGHC 75",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The parties": "",
        "": "2        The persons in these proceedings are: Chia Kin Tuck-       plaintiff, and ex-husband of Leong Choon Kum (the fourth defendant);Chia Ee Moey-first defendant, sister of the plaintiff;Tse Sai Chee-second defendant, brother of the plaintiff;Chai Cheo Moey-third defendant, sister of the plaintiff;Leong Choon Kum-fourth defendant, ex-wife of the plaintiff. The plaintiff and the first to the third defendants are the children of the late Chong Siew Kum.",
        "The proceedings affecting the property": "3       After Chong Siew Kum died in 1996, her children engaged in litigation over the beneficial ownership of the property. The registered proprietors of the property were the plaintiff, the first defendant and the second defendant. On 29 October 2004, Andrew Ang JC declared that the plaintiff, the first defendant and the second defendant are the beneficial owners of the property in equal shares, and ordered that the property is to be sold. Ang JC’s decision was upheld by the Court of Appeal on appeal. 4       After their entitlements to the property were determined, the parties could not agree between themselves on the sale of the property. In March 2007, the second defendant applied for directions for the sale of the property. This was opposed by the plaintiff and the first defendant, and on 21 June 2007, I made an order that the property is to be sold on the open market on terms to be agreed or settled by the Court. There was no appeal against the order, and the mode and terms of sale have been settled. Under the terms, the plaintiff would receive from the sale of the property an amount well in excess of the amount he has to pay to the fourth defendant under the order of court of 16 November 2004 (see [7]). 5       In the course of preparation for the sale of the property, a caveat lodged by the fourth defendant came into issue. All the parties acknowledged that unless the caveat is removed, the title to the property is encumbered, and the property could not be sold.",
        "The caveat": "6       The caveat is caveat No CV/152183L dated 16 December 2004 lodged by the fourth defendant against the plaintiff’s interest in the property. The interest claimed by the fourth defendant was described as: an estate or interest in the land as being entitled to 30% of the registered proprietor’s interest in the land pursuant to an Order of Court dated the 16thday of November 2004 in the High Court in Divorce Petition No. 1621 of 1998 [the divorce proceedings between the fourth defendant and the plaintiff.] 7       The order of court of 16 November 2004 was made by Lai Siu Chiu J. The order was made in an appeal by the fourth defendant against an order of a District Judge dated 1 August 2003 in the divorce proceedings on the division of the matrimonial property,inter aliathat: In the event the High Court in Originating Summons No.554 of 2002/A finds that the property known as 19 Ringwood Road, Singapore 437415 belongs to the estate of the [plaintiff’s] late mother and the [plaintiff] is then entitled to 50% of the said property, the [plaintiff] shall pay the [fourth defendant]a further sum equivalent to15% of the [plaintiff’s] additional 16.66% share in the said property based on the value of the said property at $5,200,000. [Emphasis added] Lai J’s order was that: The appeal is allowed insofar as the Appellant’s share in 19 Ringwood Road has been increased up to 30% and she is awarded an additional $30,000-00.",
        "The joining of the fourth defendant in these proceedings": "8       The most efficacious way to overcome the difficulty presented by the caveat was for an arrangement to be made with the fourth defendant for her to withdraw her caveat with secure safeguards for her interests, but the fourth defendant was not amenable to such an arrangement. 9       In the circumstances I ordered the fourth defendant to be joined as an additional party under O 15 r 6(2)(b) of the Rules of Court (1997 Rev Ed) so that the withdrawal of her caveat can be considered with her knowledge and participation.",
        "The application for the withdrawal of the caveat": "10     Following the joinder of the fourth defendant, the second defendant filed an application for orders,inter alia, that: 2.         Within 14 days of the making of this Order, the 4thDefendant shall at her costs execute a withdrawal (hereinafter referred to as “WCV”) of the caveat which she has lodged against the registered one-third undivided share of the Plaintiff in the Property, being Caveat No. CV/152183L dated 16 December 2004 and deliver the executed WCV and the registration fee for the WCV to the Solicitor on the condition that the Solicitor shall release the said WCV only: - (a)          for the purpose of and upon the completion of the sale of the Property to the purchaser to whom the parties have contracted to sell the Property; and (b)          upon receipt of the purchase price from the purchaser, and upon settlement of the accounts amongst the parties, the Solicitor shall:- (i)    retain the net proceeds of the sale apportionable to the Plaintiff in respect of his said share of the Property (“Disputed Money”) and distribute the Disputed Money to the Plaintiff and/or the 4thDefendant and/or other persons and in the manner as directed in a letter issued to the Solicitor jointly by both the Plaintiff and the 4thDefendant, or, (as the case may be) as directed by further order of this Court. 3.         From the date of the making of this Order, the 4thDefendant shall:- (a)          not lodge any other caveat, order of court or instrument at the Singapore Land Registry (“SLA”) against the Plaintiff’s said registered share of the Property or against the Property without leave of this Court; and (b)          at the 4thDefendant’s costs execute all such instruments and other documents or do such things as shall be necessary within 14 days of being notified in writing by the Solicitor to withdraw or cancel such caveat, order of court or instrument including all such, if any, as the 4thDefendant may have lodged at the SLA prior to the making of this Order (but excluding Caveat No. CV/152183L which remains to be dealt with under paragraphe 2 hereof). 4.         In the event of the 4thDefendant failing to comply with the orders made in paragraphs 2 and 3 hereof, the Registrar of the High Court shall be empowered to, in the Registrar’s discretion, affirm all statutory declarations, execute all instruments and documents and do all things in place of the 4thDefendant. 5.         Without prejudice to such other specific orders made hereof, the Plaintiff, the 1stDefendant, the 2ndDefendant and the 4thDefendant (where applicable) shall execute sign, seal, deliver and perfect all acts and deeds and deliver unto the purchaser conveyances, assignments, surrenders, releases, transfer, deeds, instruments, deed of variation, or such other assurances; and do all such acts and things as may be necessary or expedient for the purpose of effecting or perfecting the sale and in default thereof the Registrar of the High Court shall be empowered to execute such instruments or other documents on the Plaintiff, the 1stDefendant, the 2ndDefendant and the 4thDefendant (where applicable) behalf. 11     When the application came on for hearing before me, counsel for the fourth defendant, Mr Manimaran raised a series of complaints and objections to the application which I found to be misguided. The fourth defendant’s case is simply that she has not received from the plaintiff the money awarded to her in the divorce proceedings. After she lodged the caveat on the property, she had not taken any action to recover the money from the property. She would have difficulty in doing that as she is not a registered proprietor of the property and is claiming a doubtful interest in the one-third interest of the plaintiff. 12     It was evident to me that if the property can be sold by the plaintiff, the first defendant and the second defendant with the safeguards incorporated in prayer 2(b)(i) of the application to safeguard the fourth defendant’s interest, the fourth defendant would recover the full sum due to her without effort and expense of her own. 13     For that reason, I granted the plaintiff’s application, as it placed the fourth defendant in a win-win position because her caveat will not be removed unless the property is sold and she is paid, or the payment is secured.",
        "Validity of the caveat": "14     In the course of writing these short grounds, it has come to my notice that the fourth defendant’s caveat may not be a valid caveat. 15     The fourth defendant lodged her caveat on the strength of the order of court of 16 November 2004 (see [7]). That order varied an earlier order of 1 August 2003 in the divorce proceedings. The order of court of 1 August 2003 awarded to the fourth defendanta sumequivalent to15% of the plaintiff’s additional 16.66% share of the property, and the 15% was increased to 30% plus $30,000 under the order of court of 16 November 2004 (see [7]). 16     Under these orders, the fourth defendant was to receive a sum of money to be determined with reference to the value of the property, but she was not awarded any interest or share in the property itself. The order of court of 16 November 2004 did not give her any estate or interest in the property that was claimed in the caveat as set out in [6]. 17     A serious question therefore arises whether the fourth defendant had the requisiteinterest in landfor her to lodge a valid caveat against the property under s 115 of the Land Titles Act (Cap 157, 2004 Rev Ed) (“the Act”). 18     Section 115(1) states: Any person claiming an interest in land (whether or not the land has been brought under the provisions of this Act), or any person otherwise authorised by this Act or any other written law to do so, may lodge with the Registrar a caveat in the approved form … “Interest” is defined generally in s 4 to mean “any interest in land recognised as such by law, and includes an estate in land”. It will be difficult to argue that the order of court of 16 November 2004 gave the fourth defendant such an interest in the property. 19     For the purpose of supporting a caveat, a broader scope of interests is recognised by the Act. Section 115(3) provides that for this purpose: … a person claiming an interest in land shall include a reference to any of the following persons: (a) any person who has an interest in the proceeds of sale of land, not being an interest arising from a judgment or order for the payment of money; and (b) a person who has obtained an injunction in respect of an estate or interest in land. Nevertheless the fourth defendant does not come within these classes of persons as she was entitled to receive payment from the plaintiff from the date of the order, and did not have to wait for the property to be sold and to collect the money that is due to her from the proceeds of sale. Even if her entitlement was tied in to the sale proceeds, it arose from an order for the payment of money and fell outside the provision. 20     If the fourth defendant did not have the necessary interest to lodge a caveat on the property, an application can be made to remove the caveat on that basis, and the caveat may be removed without any safeguards for the fourth defendant’s entitlement under the order of court of 16 November 2004. 21     Against this backdrop, the fourth defendant had opposed the application for the withdrawal of the caveat on the terms set out, and is appealing against the order for removal, with the consequential costs and delay to the sale of the property and the receipt of the money due to her."
    }
}