{
    "case_title": "Tsu Soo Sin nee Oei Karen v Ng Yee Hoon",
    "ncitation": "[2008] SGHC 30",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "4       Sometime after the death of the late father and after the Will had been read, Tony, Boon Wan and Boon Poh met at Tony’s house at the latter’s invitation. Guat Hwa was present but not the defendant. Either Tony or Boon Wan apparently proposed that when the beneficiaries received their share of the estate, they would each give a portion thereof to the sisters. Boon Poh did not raise any objections to the proposal. 5       On 21 November 2002, Tony, Boon Wan, Boon Poh, the plaintiff, Guat Hwa, the defendant and the defendant’s husband Tay Lee Tee (“Tay”) met at the defendant’s residence at No. 33 Fort Road. At this meeting, Tony explained that with the defendant’s help, the assets (comprising mainly of shares in listed companies) of the estate had been realized and the net sum available for distribution to the beneficiaries was $4,585,013.53. (Divided equally between the beneficiaries, each would receive $1,528,337.85). Tony handed cheques dated 21 November 2002 each in the amount of $1,528,337.85 to the plaintiff and to Boon Poh. (The cheques of $1,528,337.85 each will be referred to as “the estate’s cheques” collectively or singularly as “the estate’s cheque”). 6       Tony then added that when Boon Wan was alive, the beneficiaries had agreed to contribute a sum of $2m for distribution amongst the sisters. He then handed to the defendant his own cheque for $666,668 issued in her favour. The plaintiff similarly took out her cheque book and wrote out a cheque for the sum in the defendant’s favour which she also handed to the defendant. Both cheques were post-dated to Monday 25 November 2002. Boon Poh did not have her cheque book with her but she was not asked to return home (at No. 59 Fort Road which is opposite the defendant’s house) to retrieve her cheque book to issue a cheque. In any case, Boon Poh indicated she wanted to wait until the estate’s cheque had cleared before she issued her own cheque for $666,666. (The three cheques from Tony, the plaintiff and Boon Poh would total $2m). 7       According to the defendant, Boon Poh telephoned her on or about 25 November 2002 to say the estate’s cheque had cleared and Boon Poh had prepared a cheque for $666,666 (“Boon Poh’s cheque”) which the defendant could pick up. The defendant went over to Boon Poh’s house and collected Boon Poh’s cheque which was also issued in the defendant’s favour and dated 26 November 2002. 8       The cheques from Tony and the plaintiff were cleared on 25 November 2002 while Boon Poh’s cheque was cleared on 26 November 2002. After the total sum of $2m had been credited to the defendant’s account with the United Overseas Bank Ltd (“UOB”), Tay issued cheques each in the amount of $500,000 to Guat Hwa and Geok Baw. The defendant personally handed Guat Hwa’s cheque to Guat Hwa and arranged for Geok Baw’s cheque to be delivered to Geok Baw’s daughter Bee Lay at the office of Siong Guan Pte Ltd (“Siong Guan”), the family company where Bee Lay worked. 9       The defendant did not pay 500,000 to Geo Eng. Geo Eng’s husband is Tan Hak Siang (“Tan”) who had taken a loan of $500,000 for Yew Say Pte Ltd (“Yew Say”) from Tay sometime in February 1998. Yew Say was the family business of Tan. A month later, Tan approached Tay again for financial assistance. This time Tan wanted a standby letter of credit for his new business Yew Say International which was set up to import fruits from New Zealand for sale to China. After discussing amongst themselves, the defendant and Tay agreed to help Tan. Tay arranged for a standby letter of credit to be issued for a maximum amount of $3m in favour of the New Zealand Apple and Pear Board from whom Tan bought his fruits. 10     Tan and his family business ran into difficulties with the result that the standby letter of credit was called upon in the amount of $2,568,913.19. Tan had agreed to be personally liable for the loans taken by the company to the limit of $3,176,000. Tan did not pay the sum owed to Tay and in 2000, he and Geo Eng were adjudged bankrupts. Tay filed a Proof of Debt in the amount of $2,568.913.19 against Tan’s bankrupt estate on his own and on behalf of the defendant. Tay excluded therefrom the sum of $500,000 Tan had borrowed personally for the reason that he did not want to add to Tan’s debts, thinking Tan would repay the personal loan if and when Tan had the means. 11     The defendant therefore intended that Geo Eng’s share of $500,000 should be setoff against what Tan owed to her and/or to Tay. The defendant informed Tony of her intention soon after the meeting in [5]. Tony (who was aware of Tan’s debt to his sister and brother-in-law) indicated he would speak to Geo Eng. 12     Shortly thereafter, Tony informed the defendant that Geo Eng had agreed to allow the defendant to retain Geo Eng’s ¼ share of the $2m as part payment of the amounts owed by Tan to Tay and the defendant. Consequently, neither Tay nor the defendant issued a cheque to Geo Eng for $500,000. 13     After receiving $500,000, the defendant expended the moneys by way of annual gifts (which amounts increased over the years) to her three children. She would inform her children the source of the gifts and thank her brother and two sisters-in–law for their generosity. She had already thanked all three benefactors on 21 November 2002. 14     On 11 August 2006, Tony commenced proceedings against the plaintiff in the previous actions. In Suit No 514 of 2006, Tony and Siong Guan jointly sued the plaintiff for the return of loans totalling $870,000 taken by Boon Wan in her capacity as his legal representative. In Suit No 79 of 2007 (which was initially commenced in the lower courts but subsequently transferred to the High Court), Tony sued the plaintiff to recover a loan of $110,000 he had made to her personally after Boon Wan’s demise. 15     Soon after Tony’s commencement of the previous actions, the defendant received a letter from the plaintiff’s solicitors dated 14 September 2006 demanding the return of the sum, on the ground that the same had been paid under duress or compulsion. The letter alleged that Tony, in his capacity as the executor of the estate, had threatened the plaintiff on or about 21 November 2002 that he would not release Boon Wan’s share ($1,528,337.85) of the estate to the plaintiff unless she made out a cheque for the sum. In the alternative, the plaintiff’s solicitors alleged that the plaintiff paid the sum to the defendant under the mistaken belief that Tony had a legal right to withhold from the plaintiff Boon Wan’s share of the estate until she had paid the sum. 16     The plaintiff’s solicitors demanded repayment of the sum from the defendant within seven days failing which action would be commenced for its recovery. The defendant through her solicitors responded that the plaintiff’s demand for repayment of the sum was “misconceived”. The defendant did not accede to the plaintiff’s demand for repayment even after two further letters from the plaintiff’s solicitors dated 15 January and 18 January 2007. Consequently, the present suit was filed by the plaintiff on 22 January 2007. 17     It was the plaintiff’s case that she was told by Boon Poh on or about 8 January 2007 that the latter did not recall any meeting with Boon Wan and Tony prior to Boon Wan’s demise, where there was a discussion followed by agreement, that when the beneficiaries received their shares of the estate, they would give a portion to the sisters. 18     While this suit was still pending, Boon Poh’s solicitors wrote to the defendant’s solicitors on 3 September 2007[note: 1]asserting that at the meeting she attended during Boon Wan’s lifetime with Tony and Boon Wan (soon after the late father’s demise), Tony had proposed a figure of $1m to the sisters. Boon Poh’s solicitors claimed that Boon Wan did not respond or agree to the proposal as Tony had claimed at the meeting on 21 November 2002. Boon Poh said she herself kept quiet on the proposal for $1m. The letter added that the first time Boon Poh heard the figure of $2m as the amount to be given to the sisters was at the meeting itself on 21 November 2002. The letter concluded with the comment that Boon Poh“does not wish to be involved in the current on-going disputes between the parties concerned”.",
        "The pleadings": "19     In her (re-amended) statement of claim, the plaintiff alleged that Tony had orally represented to her at the meeting on 21 November 2002 that prior to his death, Boon Wan had orally agreed with Tony and Boon Poh (“the agreement”) that each of them as beneficiaries, would give a portion of their inheritance when received, to the sisters in equal shares. The plaintiff was therefore misled into believing the existence of the agreement and that Boon Wan’s share thereof was the sum she paid to the defendant. The plaintiff alleged that in reliance on Tony’s representation, she was misled into paying the sum to the defendant to give effect to the agreement. 20     The plaintiff said she subsequently ascertained from Boon Poh that the agreement did not exist. Consequently, the plaintiff had paid the sum under a mistake. 21     In the alternative, the plaintiff averred that the sum was paid to the defendant under duress or compulsion or as a result of imposition, extortion or oppression. The plaintiff alleged that on 21 November 2002, Tony in his capacity as the executor of the estate, had threatened not to release Boon Wan’s share of the estate to her (as the proposed administratrix of his estate) unless the plaintiff issued a cheque for the sum to the defendant. 22     The defendant’s (amended) defence denied that the sum was paid by the plaintiff under a mistake or under duress or compulsion. She reiterated that there was an agreement reached between Tony, Boon Wan (when he was alive) and Boon Poh that the beneficiaries would give a sum of $2m to the sisters to be shared between them equally. The defendant averred that it was Boon Wan who had made the proposal as the sisters were not beneficiaries of the estate. Boon Wan’s proposal was discussed at Tony’s house in the presence of Guat Hwa and the beneficiaries (including Boon Wan) agreed. 23     The defendant averred that the agreement was first and foremost an expression of the wish and intent of Boon Wan, Tony and Boon Poh. In addition, it was a valid and enforceable agreement between the three persons. 24     After Boon Wan’s death, Guat Hwa had verbally informed the plaintiff of Boon Wan’s wish and intention to make a gift of part of his inheritance to the sisters and of the agreement. The defendant added that the plaintiff had endorsed the agreement and did not raise any objections. The defendant added that the plaintiff had on many occasions told the defendant and the other sisters that it was unfair that they were not beneficiaries under the Will of the late father. 25     The defendant then narrated what transpired at the meeting on 21 November 2002 as set out in [5] to [6] above. She therefore contended that there was no mistake of fact or law as the plaintiff was under a legal obligation to pay the sum. 26     Even if it was paid under a mistake, the defendant asserted that the plaintiff was not entitled to recover the sum as the defendant had changed her position after receipt of the sum from the plaintiff. One of the reasons given was that half the total sum of $2m was paid to two of the sisters while Geo Eng’s share was used to partially discharge the debt owed to the defendant and to Tay by Geo Eng’s husband Tan. 27     In the alternative, the defendant contended that the plaintiff voluntarily made a gift of the sum to the defendant who received the sum on behalf of the sisters. 28     In the further alternative, the defendant contended that the plaintiff was estopped from recovering the sum. 29     In her Reply, the plaintiff reiterated that the agreement did not exist. She averred that the agreement was in any event unenforceable by virtue of s 7(2) of the Civil Law Act (Cap 43, 1999 Rev Ed) (“the Act”) as it amounted to a disposition of an equitable interest or trust by the beneficiaries and it was not made by the beneficiaries in writing as required. Even if the sum was a gift to the sisters, the plaintiff contended that it was paid by mistake as the plaintiff was led to believe (which turned out to be untrue), Boon Wan had allegedly agreed with Tony and Boon Poh that each of them as beneficiaries would give a portion of their share from the estate to the sisters. 30     The plaintiff denied that the defendant had changed her position as after receiving the sum as alleged in the defence. She averred that there was no valid debt due from Tan to the defendant and Tay as alleged. Further, as a bankrupt, Geo Eng had no capacity to consent to any setoff of any alleged debt due from Tan to the defendant and Tay. Accordingly, the defendant did not change her position as she had retained at least $1m of the $2m she received and was thereby enriched by the sum paid by the plaintiff. 31     The plaintiff contended she was not estopped from recovering the sum as she had made no representations to the defendant. She asserted that Tony, being the sole executor of the estate (of which she was a beneficiary as the administratrix of Boon Wan’s estate), had the capacity to exert influence on her as he was holding onto Boon Wan’s share of the estate as of 21 November 2002. The plaintiff reiterated that Tony had threatened not to release Boon Wan’s share of the estate unless she made out a cheque in the sum to the defendant.",
        "The evidence": "32     Besides the plaintiff, Boon Poh was the only other witness for the plaintiff’s case. Boon Poh declined to file an affidavit on the plaintiff’s behalf. She gave her testimonyviva voceon a subpoena issued by the plaintiff, a fact which I shall return to later. The defendant’s witnesses were herself, Tony, her three sisters and her husband.",
        "The plaintiff’s case": "33     The plaintiff’s written testimony narrated in considerable detail what transpired at the defendant’s house on 21 November 2002. She deposed at her para 15 as follows: I recall that Boon Poh too, was unhappy in having to part with such a large portion of her inheritance. However, like me, I could see that she was also pressured to comply and I learnt that she eventually gave her own cheque of $666,666 dated 26 November 2002 to Yee Hoon after her cheque from Tony was cleared. 34     The plaintiff then recounted how her relationship with Tony deteriorated over the following four years culminating in the previous actions. She then sought to justify this suit (in para 19 of her affidavit-of-evidence in-chief) on the basis she was duty-bound, as the administratrix of her husband’s estate to put the facts on recordvizthat she was pressured at the meeting on 21 November 2002 to comply with the demand of the sisters (whom she unkindly described as “covetous”) to part with the sum to the defendant. Hence, the plaintiff explained, she instructed her solicitors to write the letters dated 14 September 2006 (in [15]) and 3 October 2006 (where she asserted that the agreement to give the sum was unenforceable) to the defendant’s solicitors. However she took no further steps until January 2007 when she met Boon Poh. She then discovered that the agreement was never made during Boon Wan’s lifetime, which revelation in her words made her “furious” as she felt she had been duped and misled. 35     The plaintiff testified that she drafted and procured Boon Poh’s signature to, a letter dated 8 January 2007[note: 2]addressed to the plaintiff’s solicitors thatinter aliastated: I wish to categorically refute that there was never such a meeting and agreement and that no fixedsums of monies were decided as gifts to the sisters. I confirmed that my deceased husband had also never spoken of such arrangements with Oei Tjiong Bin prior to his death. My father-in-law has also stated clearly that he will not give more wealth to the daughters as in his life he has distributed substantial assets to each of his daughters. I reserve the right to decide whatever portions of money I wish to gift to whomever [sic] I please and to benefit whomever without undue coercion, pressure and duress from the Administrator of Oei Tok Kek’s estate. The freedom to decide was not accorded to me at the time of distribution of the sum of $1,528,337.85 to the beneficiaries of OTK. 36     The plaintiff added that she would not have parted with the sum had she known that there was no basis for the payment as she would be liable to account to the other beneficiaries of her husband’s estatevizher two daughters. 37     The plaintiff then commented on the defencein extensoin the rest of her affidavit, a task which I thought should best be left to her solicitors in their closing submissions on her behalf. 38     I would observe at this juncture that the plaintiff’s entire case hinged on what Boon Poh told her. Boon Poh’s testimony was therefore crucial to the court’s determination of whether Boon Wan (in his lifetime) had indeed agreed with Tony and Boon Poh herself, to give a portion of his and their shares of the estate to the sisters. In the event the court rejected Boon Poh’s testimony, the plaintiff fails in her claimin limine. 39     As stated earlier (at [32]) Boon Poh refused to file an affidavit of her evidence-in-chief. Further, she instructed solicitors to hold a watching brief for her in these proceedings “to protect her” (according to Boon Poh’s own explanation) although one is left to wonder – protection from who or what danger? I turn now to her testimony. 40     Nothing turns on Boon Poh’s evidence-in-chief. It was her cross-examination that was revealing. Boon Poh’s attention was drawn to an apparent contradiction between her oral testimony (and what she told the plaintiff in January 2007) and what her solicitors said in their letter dated 3 September 2007 (see [18]). Although Boon Poh testified there was no meeting between she, Tony and Boon Wan (during his lifetime) at which there was a discussion on giving the sisters a portion of the beneficiaries’ share from the estate, her solicitors’ said letter (para 1) confirmed that such a meeting did take place and that Tony had proposed thereat to give $1m to the sisters. Not unexpectedly, counsel for the defendant made much of Boon Poh’s contradictory stand in the defendant’s closing submissions. 41     Boon Poh explained[note: 3]that the meeting referred to in her solicitors’ letter of 3 September 2007 was not “an official meeting”. She did not consider it a proper meeting because neither she nor Boon Wan gave their views on Tony’s proposal; in fact, Boon Wan was pacing about when Tony spoke (which claim both Tony and Guat Hwa denied). Guat Hwa apparently also said nothing. Boon Poh’s understanding of a meeting was one where notice was first given, there was an agenda, there was a person to chair the meeting and where attendees must participate in the discussion. 42     Boon Poh revealed that at the meeting in 2000, Tony produced a Will in English from the late father which surprised her as she was aware that the late father had executed a Will in Chinese. Questioned on the relevancy of the English Will to the issue at hand, Boon Poh claimed that Tony had announced that if she and Boon Wan did not agree to giving the $1m to the sisters, he had a “trump card”vizthe English Will but when questioned, she was unable to explain what Tony meant by those words. 43     Boon Poh’s attention was drawn to Guat Hwa’s affidavit evidence where Guat Hwa had deposed that the late father’s Will in English was read in the presence of Guat Hwa, Boon Wan and Boon Poh at Tony’s house. Guat Hwa added that Tony had requested Boon Poh to read out the Will in English but Boon Poh had declined due to her poor understanding of English. It was Boon Wan who read the Will in English while the contents were explained by Tony. Confronted with Guat Hwa’s testimony by counsel for the defendant, Boon Poh denied[note: 4]that the event took place. 44     As for the contentious meeting on 21 November 2002, Boon Poh testified she understood the purpose was for Tony to distribute the estate of the late father. She reiterated that she kept quiet when Tony announced each beneficiary would have to come out with $666,666 for the sisters. 45     Questioned by both the court and counsel for the defendant[note: 5]on why she did not immediately object and inquire of Tony the reason for the change in figures from $1m to $2m, Boon Poh’s feeble answer (which was no explanation at all) was:“I did not ask him at that time”.Not only did Boon Poh fail to question Tony at the time, she admitted that she never asked him at all subsequently on the reason for the 100% increase in the amount to be given and which was given, to the sisters. 46     Boon Poh alleged that Tony had said “If you don’t agree, then don’t distribute”which she understood to mean that the beneficiaries would not receive the estate’s cheques if they refused to give $2m to the sisters. Told by counsel for the defendant that she could have gone to court to demand payment if Tony refused to hand over the estate’s cheques to the beneficiaries, Boon Poh demurred saying that she would never think of going to court over family matters. She felt she had no choice but to accede to Tony’s demand. Although she claimed to be angry with Tony’s highhandedness, Boon Poh did not express her feelings. 47     I should add that when questioned by the court on Tony’s remark above, Boon Poh said it was “ambiguous” and she was unsure whether his comment could also mean that if she and the plaintiff did not agree, there was no need to distribute $2m to the sisters. 48     It was however not disputed that Boon Poh did not give her cheque for $666,666 on 21 November 2002 to the defendant in exchange for the estate’s cheque. Her explanation was that Tony wanted her to issue the cheque for $666,666 on the spot. However she did not have her cheque book and she wanted the estate’s cheque to be cleared first before she would issue her own cheque. Pressed by counsel and the court on whether she was forced by Tony to issue her cheque, Boon Poh admitted (after some prevarication) that she was not. However she said she was a little “suspicious” of the estate’s cheque and waited for 5 days (until the same was cleared) before she issued her own cheque. 49     Boon Poh claimed that the defendant chased her thereafter for the cheque (her version differed from the defendant’s evidence). The defendant telephoned her once on 21 November 2002 after she returned home and again on the following day. Boon Poh’s cheque was issued to the defendant on 25 November 2002 (but postdated to 26 November 2002) after she was told by her bank that the estate’s cheque had cleared. 50     Boon Poh revealed that she had met Tony a second time in 2000 at his office after the occasion [42] when the Will in English was read. She had then offered to give 10% of her share as a beneficiary when he raised the subject of giving $1m to the sisters. She claimed that Tony reacted with the comment:“If you are going to give so little, then you might as well not give it. It is not as if you have no money. Why are you so greedy?”which comment angered her.",
        "The defendant’s case": "51     I turn now to the defendant’s evidence. The defendant explained she was tasked by Tony to sell the shares held in listed companies by the late father. She monitored the prices of the shares and from August to October 2002, she sold all the shares for a gross sum of $4,863,223.41. It was after she had credited into the estate’s bank account all the sale proceeds of the shares so sold that Tony called for the meeting on the evening of 21 November 2002. The purpose was to distribute to the beneficiaries their share of the estate as well as to distribute $2m to the sisters, pursuant to the agreement Boon Wan, Tony and Boon Poh had reached earlier. 52     It was the defendant who made telephone calls to inform the plaintiff, Boon Poh and Guat Hwa of the meeting and the purpose, although the defendant could not recall whether she also told the plaintiff of the intention to distribute $2m to the sisters. However, the defendant assumed the plaintiff must have been aware of this other purpose as otherwise there was no reason for the meeting to be held at the defendant’s house, if the defendant (and Guat Hwa) were not to be involved. 53     The defendant’s written testimony narrated what transpired at the meeting on 21 November 2002. She deposed that Tony explained to all five persons present that the estate had assets that totalled $4,873,376.40, from which he was entitled to and did deduct $288,962.87 (as a creditor of the estate for moneys he had expended on the late father’s medical expenses, various miscellaneous and funeral expenses). Of the balance $4,585,013.53, Tony said that two of the beneficiaries would receive $1,528,337.84 while the third would receive $1,528,337.85. 54     Tony then added that when Boon Wan was alive, the beneficiaries had agreed to contribute a total sum of $2m to be divided amongst the sisters. He said he would contribute $666,668 towards the $2m while the plaintiff and Boon Poh would each contribute $666,666. Tony produced two receipts, one showed how the sum of $4,873,376.40 was to be divided while the other showed how the sum of $2m was arrived at. On her part the defendant produced tables she had prepared showing the names, quantities and selling prices of the shares she had sold for the estate. 55     The defendant narrated that for the sake of convenience, Tony suggested that all three cheques for the $2m should be issued in favour of the defendant so that the defendant could issue cheques to the other sisters for $500,000 each. The defendant helped Tony to write out the estate’s cheques, he signed them and she then handed one each to the plaintiff and to Boon Poh. Tony retained the estate’s cheque made out to his name and handed to the defendant his cheque for $666.668. 56     The defendant deposed that the plaintiff then took out her own cheque book and wrote out a cheque to the defendant for the sum. There was no indication from the plaintiff that she was unhappy about writing the cheque nor did she protest. The plaintiff had then handed her cheque to the defendant without hesitation. The plaintiff then turned to Boon Poh and said “What about you?” Boon Poh replied that she had not brought her cheque book and that she would issue her cheque for $666,666 once the estate’s cheque was cleared. 57     The defendant said she thanked both Boon Poh and the plaintiff for their gifts on her own behalf as well as on behalf of Geo Eng and Geok Baw who were not present. Neither the plaintiff nor Boon Poh showed reluctance to give the sum to the sisters, when they acknowledged the defendant’s gratitude for their generosity. 58     The defendant stated she had and maintained a good relationship with the plaintiff (whom she met from time to time at family gatherings and sometimes spoke to on the telephone). Indeed, when the defendant’s daughter married in July 2003, the plaintiff generously gave $1,000 as a wedding gift. The plaintiff never once mentioned to the defendant that she had given the sum unwillingly or that she had been forced into parting with the sum and wanted it back. 59     The defendant’s evidence that the plaintiff never once complained (before her solicitors’ letter dated 14 September 2006) about giving the sum or that she had been coerced into giving the sum was echoed by the other sisters, Guat Hwa, Geo Eng and Geok Baw when they took the stand. Geo Eng refuted the plaintiff’s claim (in [30]) that she was a bankrupt pointing out that her bankruptcy order (in Bankruptcy No. 731 of 2000) was annulled in 2001. 60     The defendant revealed that it was only Guat Hwa amongst the sisters who had expressed unhappiness (to Boon Wan with whom Guat Hwa was closest) at being left out of the Will. The defendant on her part accepted that she would not inherit any of the late father’s assets. That was why the defendant thanked the beneficiaries for their generosity in giving up part of their inheritance to the sisters. 61     It was the common testimony of Guat Hwa and the defendant that the plaintiff had encouraged them to “fight” for their share of the estate. The plaintiff had apparently voiced to the defendant and to Guat Hwa (before and after Boon Wan’s death) her opinion that it was not right that the late father should have favoured his sons over his daughters. Counsel for the plaintiff challenged this testimony while cross-examining Guat Hwa. He pointed out that the Will was only seen by the plaintiff on 22 April 2002, which was after Boon Wan’s demise (on 14 April 2002). Therefore, the plaintiff could not have known about the sisters’ exclusion from the Will before 22 April 2002. Guat Hwa (like the defendant) explained that the plaintiff was aware of the fact as the late father had made no secret of his intentions during his lifetime. 62     In Guat Hwa’s written testimony, she deposed that it was Boon Wan who first mooted the idea of giving the sisters part of the beneficiaries’ inheritance after she had complained of being left out of the late father’s Will. It was also Boon Wan who requested her to arrange a meeting with Tony (and Boon Poh) to discuss how they should give some money to the sisters. 63     Guat Hwa referred to an incident which caused the plaintiff to change her attitude towards Guat Hwa. In 2004, Guat Hwa overheard the plaintiff shouting at Tony on the street where she (Guat Hwa) lived. Subsequently, she understood from the defendant that the two were quarrelling over a safe. Thereafter the plaintiff’s relationship with Tony and his siblings soured particularly after the plaintiff was sued in the previous actions. The plaintiff ceased all contact with the defendant and Guat Hwa, even though prior thereto the plaintiff was on cordial terms with the two sisters. 64     Tony who was a key witness for the defendant, explained why he and Boon Wan wanted to share their inheritance with the sisters. From the time the late father was discharged from hospital in late 1998 until his death on 12 October 1999, the defendant and Guat Hwa had visited the late father daily (sometimes twice a day) at his residence at No 45, Fort Road to help take care of the late father when his private nurse was not around. Consequently, when Guat Hwa informed Tony of Boon Wan’s intention to give something to the sisters, Tony was very supportive. He felt that the two sisters should receive something from the late father for their devotion to him and the fact that they bore him no grudge, even though they knew he would not leave them anything in his Will. Geok Baw the eldest sister on the other hand was not really well-off and would greatly benefit from her brothers’ gift. 65     When Guat Hwa contacted Tony to arrange a meeting to discuss giving the sisters a share of the late father’s estate, Tony in turn contacted Boon Poh to attend the meeting. According to Tony, Boon Poh had then said to him (in the Hokkien dialect) that“we must definitely give them [ie the sisters]. If we did not give them something we would be scolded to death.” 66     Tony corroborated the defendant’s version of what transpired at her house on 21 November 2002. He also confirmed he had spoken to Geo Eng (who agreed) on the defendant’s behalf about setting-off Geo Eng’s share of the $2m against the debt owed by Tan to the defendant and Tay. 67     As for his altercation with the plaintiff in 2004, Tony deposed that the plaintiff’s contractors turned up one day at No 45 Fort Road without prior notice and wanted to take away a safe. Tony refused as the safe belonged to him and he had given it to the late father to use. The plaintiff had not informed him beforehand. After the contractors had left, the plaintiff herself showed up and insisted that the safe belonged to Boon Wan. Tony explained again that the safe belonged to him. The plaintiff became angry, shouted at him and accused Tony of taking advantage of a widow. Tony told the plaintiff to speak to her lawyers and she then left in a huff. 68     Since that incident and more so after he sued her in the previous actions, the plaintiff was hostile to Tony as well as to the sisters.",
        "The submissions": "69     The plaintiff’s pleaded case was that she paid the sum under a mistake of fact and/or law and/or under duress and was entitled to its recovery. Alternatively if the sum was a gift, the plaintiff contended that the gift was void under s 7(2) of the Act. 70     The plaintiff’s submissions relied heavily on Boon Poh’s evidence and argued that on a balance of probabilities, the plaintiff had proven there was no agreement reached during Boon Wan’s lifetime between Tony, Boon Wan and Boon Poh, that the sisters should be given $2m by the beneficiaries from their share of the estate. 71     The defendant on the other hand argued that none of the plaintiff’s assertions were sustainable at law and her claim must fail.",
        "The law": "72     It would be apt therefore at this juncture to turn to the relevant law, starting with s 7(2) of the Act. The section states: (2)    A disposition of an equitable interest or trust subsisting at the time of the disposition must be in writing signed by the person disposing of the same or by his agent lawfully authorised in writing or by will. 73     In the plaintiff’s closing submissions, she had argued that if there was an oral agreement during Boon Wan’s lifetime for the beneficiaries to distribute $2m from their inheritance to the sisters, it amounted to a disposition of an equitable interest or trust by the beneficiaries of the estate. The estate was then unadministered and the disposition was not in writing and signed by the persons disposing of the samevizthe beneficiaries. As the oral agreement did not comply with s 7(2) of the Act, the plaintiff contended that the oral agreement was unenforceable at law. 74     The defendant on the other hand argued that s 7(2) of the Act did not apply on the facts and the plaintiff’s argument was misconceived. I accept the defendant’s argument as, on its plain wording, the section prevents the disposition of an equitable interest if the disposition is not in writing. It has no application to the disposition of alegalinterest or to a gift of cash as in this case. There would have been a disposition of a subsisting equitable interest when a donor disposes of his equitable interest by way of an assignment or by contracting to assign the equitable interest to the donee, or by directing the owner of the legal interest to hold it in trust for a third party or by declaring himself (the donor) to be a trustee for the third party of such interest (per Romer LJ inTimpson’s Executors v Yerbury (HM Inspector of Taxes[1936] 1 KB 645 at 664). 75     However, in this case, the issue concerned an agreement between beneficiaries that when they received their inheritance under the Will, they would give an amount totalling $2m to the sisters. The beneficiaries were not in any way disposing of any equitable interest or trust to the sisters. Once the beneficiaries received the estate’s cheques, they no longer had an equitable interest in the estate as their interests had been converted into cash. 76     This was unlike the situation inTeo Song Kwang (alias Richard) v Gnau Lye Chan & Anor[2006] SGHC 2, relied on by in the plaintiff. In that case, the plaintiff had alleged that he had an oral agreement with the first defendant that the latter would waive all claims to a beneficial interest in the estate of the first defendant’s deceased daughter and she would transfer all the deceased’s assets to the plaintiff. I had there held that the alleged waiver agreement was unenforceable as it amounted to an assignment of an equitable interest and was not in writing as required under s 7(2) of the Act. It was an equitable assignment because at law, the first defendant as the sole beneficiary under an intestacy, had no interest or property in the personal estate of the deceased until administration of the deceased’s estate was completed and distribution made according to such law. Unlike our case here, the deceased’s estate was still under administration when the plaintiff there sued to enforce the oral agreement. 77     Although it was not part of the plaintiff’s pleaded case and therefore I can ignore it, in her opening statement (para 37) and in para 32 of her affidavit evidence, the plaintiff referred to another mistakevizshe paid the sum thinking there was a legally enforceable agreement between Tony, Boon Wan and Boon Poh. This was a new allegation altogether and differed from the mistake of law referred to in the plaintiff’s solicitors’ letter dated 14 September 2006 (see [15] above). 78     I turn now to this substantive issuevizwas there really a mistake in the plaintiff’s payment of the sum and if so, was it a mistake of fact or law? The plaintiff’s pleadings did not specify whether the mistake she made was one of fact or law although it would appear that she was relying on the former, save for the reference to s 7(2) of the Act which would be a mistake of law. 79     At law, to succeed in a claim to recover moneys paid under a mistake of fact or law, a claimant must prove: (i)     that he operated under a mistake; (ii)    he would not have paid but for the mistake. 80     It should be noted that the mistake here was not a common mistake shared by the parties but a unilateral mistake on the part on the plaintiff. According toChitty on Contracts29thedition Vol 1 (at p 403 para 5-063), a mistake on the part of one party as to the terms of the contractif known to the other party, may affect the contract. I do not think this principle would apply in this case for the reason that appears in [87]. 81     BesidesChitty on Contracts, the other authoritative textbook relied on by counsel for the defendant as to when money paid under a mistake of fact can be recovered was Goff & Jones’The Law on Restitution2007 7thedition. The learned authors of the second book (at p 187) stated that the claimant will succeed if he can show that he would not have made the payment if he had not been mistaken. The mistake however had to be distinguished from ignorance, misprediction, omission and doubt. Money paid under any of these four factors would preclude the claimant from recovery, so too if it was paid pursuant to a compromise to settle an honest claim. A classic example of a claimant who assumed the risk of making payment under a compromise and which was held not to be an operative mistake is the case ofInfo-communications Development Authority of Singapore v Singapore Telecommunications Ltd (No. 2)[2002] 3 SLR 488. 82     The burden was on the plaintiff to prove that she would not have paid the sum but for her mistake and which mistake was recognised at law as an operative mistake. If the plaintiff paid the sum despite having doubts that her late husband had committed himself to making the payment (since she said he never told her during his lifetime), the law is clear – she is precluded from recovering the sum. If the plaintiff paid the sum taking the risk that there may not have been an agreement reached between Boon Wan, Tony and Boon Poh during Boon Wan’s lifetime to share their inheritance with the sisters, she cannot recover the sum. If the plaintiff paid the sum thinking that there was an enforceable agreement which agreement she would honour on Boon Wan’s behalf as the administratrix of his estate, this again is not an operative mistake. 83     The plaintiff had testified during cross-examination[note: 6]that she did not object when Tony brought up the subject of each beneficiary giving $666,666 to the sisters because she did not want disputes with other members of the Oei family. The Australian High Court inDavid Securities Pty Limited v Commonwealth Bank of Australia[1992] 175 CLR 353held that in such a scenario, the plaintiff cannot recover, citing (at p 372) the following passage from Latham CJ’s judgment inWerrin v The Commonwealth(1938) 59 CLR 150 at 159: The principle appears to me to be quite clear that if a person, instead of contesting a claim, elects to pay money in order to discharge it, he cannot thereafter, because he finds out that he might have successfully contested the claim, recover the money which he so paid merely on the ground that he made a mistake of law. 84     The plaintiff’s alternative claim was that she had paid the sum under economic duress, fearing Tony’s threat (as the estate’s executor) that if she did not issue her cheque for the sum, he would withhold Boon Wan’s share of the estate and not release to her the estate’s cheque. 85     The defendant’s closing submissions referred to the Privy Council decision inPao On & Others v Lau Yiu Long & Others[1980] AC 614 which decision recognised economic duress (although it was not made out on the facts of the case). Lord Scarman, who delivered the judgment of the law lords had this to say (at pp 635/636): …At common law, money paid under economic compulsion could be recovered in an action for money had and received:Astley v Reynolds(1731) 2 Str. 915. The compulsion had to be such that the party was deprived of “his freedom of exercising his will” (see p 916)….The commercial pressure alleged to constitute such duress must, however, be such that the victim must have entered the contract against his will, must have had no alternative course open to him, and must have been confronted with coercive acts….Recently two English judges have recognised that commercial pressure may constitute duress the pressure of which can render a contract voidable: Kerr J inOccidental Worldwide Investment Corporation v Skibs A/S Avanti[1976] 1 Lloyd’s Rep 293 and Moccata J inNorth Ocean Shipping Co Ltd[1979] QB 705. Both stressed that the pressure just be such that the victim’s consent to the contract was not a voluntary act on his part. In their Lordships’ view, there is nothing contrary to principle in recognising economic duress as a factor which may render a contract voidable provided always that the basis of such recognition is that it must amount to a coercion of will, which vitiates consent. It must be shown that the payment made or the contract entered into was not a voluntary act. I shall return to the above criterion when addressing the plaintiff’s plea of duress in my findings.",
        "The findings": "Was the payment made by Mistake? 86     It was the plaintiff’s case that she paid the sum to the defendant under a mistaken belief because she was told that prior to his demise, Boon Wan had agreed with Tony and Boon Poh that each of them would as beneficiaries of the estate, give a share of their inheritance to the sisters, to be apportioned equally between them. 87     The defendant did not dispute the plaintiff’s understanding in [86] as she too shared the same belief. As the defendant’s understanding was no different from the plaintiff’s, what then was the mistake? 88     The plaintiff had also maintained that no quantum had been determined or agreedbeforethe meeting on 21 November 2002 on how much the sisters would receive from the beneficiaries. She then asserted that in fact there was no agreement reached amongst the beneficiaries at all on the proposed gift. 89     If, as the plaintiff contended, no quantum was mentioned by the beneficiaries of what they would give to the sisters, there can be no mistake as to the amount to be given. The mistake (if any) can only relate to the existence of the agreement itself. 90     It is significant that although the plaintiff (by her own evidence) discovered from Boon Poh the non-existence of the agreement on or about 8 January 2007 (see [17] above), she had demanded four months earlier (by her solicitors’ letter dated 14 September 2006) the return of the sum from the defendant. This immediately throws into doubt thebona fidesof this suit and the veracity of the plaintiff’s testimony (see [34]) that it was her duty to her daughters as the administratrix, to recover the sum which formed part of their inheritance from Boon Wan. My view is reinforced by the absence of the sum as a debt due to the estate, in the estate duty returns filed by the plaintiff for Boon Wan’s estate. On the plaintiff’s own evidence[note: 7], this suit was a tit-for-tat action by her, prompted by the previous actions that Tony initiated against her five months earlier (in August 2006). 91     It is necessary to return to Boon Poh’s testimony at this stage. Based on her evidence in [39] to [49], I have come to the conclusion (contrary to the plaintiff’s submissions that she was honest and reliable) that Boon Poh’s testimony was not credible. All she has done is to sow further discord between the plaintiff and Tony, caused their strained relationship to deteriorate further and resulted in the defendant being sued unwittingly. 92     Even if she was not untruthful (as the defendant’s closing submissions said she was) Boon Poh was an unreliable witness. A truthful witness would not have to instruct a counsel to hold a watching brief “to protect her” merely because she was taking the witness stand. 93     To elaborate, Boon Poh had informed the plaintiff that there was never any meeting or agreement reached during Boon Wan’s lifetime soon after the late father’s passing, that the beneficiaries would give a portion of their inheritance from the estate to the sisters when received. She reiterated this in the statement that the plaintiff drafted (at [35]) and which she voluntarily signed. Yet, without any prompting, Boon Poh through her solicitors had written to the defendant’s solicitors exactly three weeks before this trial (see [18]) where she did avolte face– she then asserted that there was indeed such a meeting where Tony proposed $1m instead of the $2m he said on 21 November 2002 was the agreed sum. This drastic change has to be viewed in the light of Boon Poh’s testimony that she did not consider that particular meeting to be a proper meeting in her understanding – with proper notice being given accompanied by an agenda, with a chairperson and discussion from participants (see [41] above). In the course of cross-examination, Boon Poh revealed (at [50] above) that there was another occasion when she met Tony at his office in 2000 and she had offered 10% of her share from the estate to the sisters. That would seem to suggest that there was an agreement in principle by her (contrary to her denial) to give the sisters something. 94     Boon Poh’s testimony therefore contained the following versions: (a)    there was no meeting where the beneficiaries discussed giving a share of their inheritance to the sisters, hence there was no agreement; (b)    there was a meeting where the beneficiaries discussed giving $1m to the sisters but no agreement was reached; (c)    it was agreed in principle that the beneficiaries would give a share of their inheritance to the sisters, no quantum was agreed but Boon Poh was only willing to part with 10% of her inheritance. If she could shift her position three times on such a crucial issue, how could Boon Poh be considered a reliable witness? Moreover, her answers during cross-examination and to the court’s questions were highly unsatisfactory as can be seen from [45] to [47] above. 95     If indeed Tony had unilaterally increased the gift from the beneficiaries from $1m to $2m as Boon Poh claimed, why did she not object? Her lack of explanation (at [44]) again reflected poorly on her credibility. 96     There was yet another instance where Boon Poh’s evidence was unsatisfactory. She had testified that Tony claimed he had a trump cardvizan English version of the Will, in the event the beneficiaries refused to share their inheritance with the sisters. Yet, she was unable to explain the significance of the English version of the Willvis a visTony’s trump card. Given Guat Hwa’s testimony (which I prefer) that the reading of the Will (in English) was done at Tony’s house by Boon Wan after Boon Poh declined Tony’s invitation to read it (due to her poor command of the English language), I reject Boon Poh’s denial that such an event took place. 97     The plaintiff’s closing submission stated (in paras 20-21) that Boon Poh had no reason to lie. In support, the plaintiff relied on an incident narrated in Guat Hwa’s affidavit (at para 68) where in early 2007 Guat Hwa had met Boon Poh (in the presence of Boon Poh’s daughter). Boon Poh (when told by Guat Hwa about this suit) had replied that the plaintiff not she, wanted the sum back. My short answer to this professed assurance on Boon Poh’s part is, if the plaintiff succeeds in her claim, Boon Poh would similarly be able to recover the sum from the defendant without more. 98     The plaintiff’s credibility as a witness was not much better than Boon Poh’s. Her testimony was also unsatisfactory as can be seen from the following observations. 99     In para 15 of her written testimony (see [33]), the plaintiff had deposed that Boon Poh was equally unhappy about parting with such a large portion of her inheritance but like her, Boon Poh felt pressured to comply. This was a complete distortion of the evidence and was rebutted by Boon Poh’s own testimony (in [48]) that Tony did not force her to issue Boon Poh’s cheque. To recapitulate, Boon Poh did not bring her cheque book to the defendant’s house that evening. She could not have been pressured to give her cheque for $666,666 as she was not even asked to return to her house (although it was just across the road) to bring her cheque book back to the defendant’s house. Boon Poh did not issue her cheque that evening but five days later, based on her admission that she wanted the estate’s cheque to be cleared first. Contrary to Boon Poh’s claim, I do not believe the defendant chased Boon Poh repeatedly for her cheque. 100  It was also the plaintiff’s contention (at para 31 of her submission) that mere silence on the part of Boon Poh did not amount to acceptance by Boon Poh of the proposal by Boon Wan/Tony to give a share of their inheritance to the sisters. Granted, that is the position at lawvis a visacceptance of contracts. However, it bears remembering as the defendant pointed out (at para 88 of her closing submissions) that the agreement to make a gift was reached in the context of a family gathering. As Tony himself said during cross-examination[note: 8], Boon Poh could have voiced her objections to the gift or to the quantum if she did not agree. Why didn’t she? In the context of a family gathering, it was not unreasonable of Tony and Boon Wan to assume from her silence that Boon Poh agreed to their proposal. It is inconceivable that the plaintiff could have thought of enforceability of such a family agreement in the legal sense. Consequently, the plaintiff’s contention that she laboured under the mistaken impression that the agreement was legally enforceable is incredible and a convenient afterthought. It cannot amount to an operative mistake at law. 101  The defendant’s testimony on the other hand was consistent throughout. Her evidence that an agreement had been reached between the beneficiaries to give the sisters $2m was corroborated by the testimony of her witnesses viz Guat Hwa (DW2), Geok Baw (DW6) and Tony (DW3). I am mindful that it was in the interests of the sisters to say the agreement existed as they were the recipients of the largesse. Even so, I did not get the impression that any of the three sisters were untruthful. What I found remarkable both in these proceedings and in the previous actions was the defendant’s lack of rancour against a sister-in-law who had sued her. She bore no ill-will against the plaintiff and showed no hostility against her either, a sharp contrast to the plaintiff’s attitude towards her and the defendant’s siblings especially Tony. 102  I should add that the plaintiff’s submissions placed great store on who had arrived last for the meeting on 21 November 2002. She concluded that the last person must have been Boon Poh as she had testified (and which Boon Poh corroborated). The plaintiff further submitted that the defendant, Guat Hwa and Tony were untruthful witnesses as they could not recall who arrived last for the meeting and yet they could recall other events (or in Tony’s case, he could recall that at the meeting neither the plaintiff nor Boon Poh’s facial expression and/or body language indicated they disagreed with his proposal). With respect, I cannot see the correlation between a person’s poor recollection of the order of attendees who came for a family meeting and his/her credibility. 103  I find that there was indeed an agreement (initiated by Boon Wan) between the beneficiaries that they would contribute equally towards a gift of $2m to the sisters. The figure of $2m was also agreed during Boon Wan’s lifetime and if not, then it was certainly agreed by the time of the meeting on 21 November 2002 where Tony’s proposal of each beneficiary giving $666,666 met with the tacit consent of both the plaintiff and Boon Poh.",
        "Was there consideration for the agreement to make it enforceable?": "104  Here, I refer to para 93 of the defendant’s closing submissions. It is a fundamental principle of contract law that an agreement is enforceable if the parties intend it to be legally binding and it is supported by consideration. Consideration is defined as either a detriment to the promisee or some benefit to the promisor. Thus, consideration may move from the promisee to a third party instead of to the promisor (seeChitty on Contractssupra [80] at pp 237-238 paras 3-036/3 to 3-039). 105 Consideration may consist of either a performance rendered by the promisee or by a promise to render a performance ie each party makes a promise to the other, but neither party has yet rendered any performance (seeChitty on Contracts supraat p 219 para 3-008). A classic example of this would be mutual wills as can be seen from the case ofInre Dale[1994] Ch 31. There, a husband and wife agreed to leave all their respective estates to their son and daughter in equal shares and made wills accordingly. The agreement was allegedly meant to be binding and irrevocable. The husband passed away without revoking his will but the wife subsequently altered hers before she died. The daughter claimed that the son held his share as trustee for himself and her. The daughter succeeded in her action. The English Court noted that the husband had performed his part of the agreement but even if he had not, the promise itself would be good consideration if the performance of a promise was good consideration. The court held that the promise to dispose of the estate as agreed was a detriment to the promisor even though he would be leaving the property in the way that he wished and even though there was nothing in law to prevent him from revoking his will. 106  Consequently, a promise to make a gift to a third party would constitute a sufficient detriment and where the parties make mutual promises to make such a gift, each promise may be consideration for the other. Here, Boon Wan, Tony and Boon Poh each promised they would give the sisters $2m from their inheritance and it constituted consideration for the other’s promise. Hence, the agreement between them was an enforceable agreement. 107  At law, an agreement that would be enforceable against a person personally during his lifetime would be enforceable against his executor or administrator after his death. The agreement would have been enforceable against the plaintiff in her capacity as the administratrix of Boon Wan’s estate had she refused to honour it.",
        "Did the plaintiff pay the sum under duress?": "108  It is to be noted that on 21 November 2002, the plaintiff had, without any prompting, taken out her cheque book, written out a cheque for the sum and handed it to the defendant. She had then (according to the defendant whose evidence I accept) turned to Boon Poh and said “What about you?” This was not the conduct of a person who was reluctant to or who felt pressured to and/or was intimidated to make a gift. 109  As the plaintiff’s cheque was post-dated to 25 November 2002, she could easily have stopped payment on the cheque (to which she agreed during cross-examination[note: 9]). Her explanation (after some prevarication) that she did because it was not in her nature to do so and if she had to give she would, was both lame and unconvincing. 110  The above observation effectively puts paid to the plaintiff’s allegation that she gave the sum under duress. The plaintiff is as feisty as she is abrasive. As a school principal, she did not strike me as someone who would be easily cowed let alone by a mild mannered person like Tony. Nothing in Tony’s conduct could amount to a coercion of the plaintiff’s will such as to vitiate her consent to pay the sum. Bearing in mind the test fromPao On & Others v Lau Yiu Long & Others([85]supra), the plaintiff’s payment of the sum cannot be said to be anything other than a voluntary act. 111  Further, Tony as the executor of the estate, could not at law withhold payment from a beneficiary named in the Will. The plaintiff with her level of education would surely have known that. She was the intended administratrix of Boon Wan’s estate and must have been aware of her duties and obligations as such (see [90] above). If indeed Tony had withheld the estate’s cheque from her (or Boon Poh), the plaintiff could have taken him to court to compel him to pay her. Likewise, Boon Poh. 112  As I find that the plaintiff did not pay the sum under duress, it is unnecessary for me to go on to consider whether she is barred from recovering the sum due to laches and acquiescence. Had I found for the plaintiff on the issue of mistake, it is likely that I would have denied her claim as she did nothing for more than four years after paying the sum. The sisters had no cause to believe that the sum was other than a gift to them to be shared equally. 113  Similarly, had there been a need to consider the defence of estoppel, I would have ruled in the defendant’s favour, for the same reason stated in [112]. In this regard, I reject the plaintiff’s submission that the defendant had not altered her position to her detriment after receiving the sum.",
        "Should the plaintiff have sued in her capacity as the administratrix of Boon Wan’s estate?": "114  The defendant had questioned the plaintiff’s cause of action. The plaintiff had sued in her personal capacity even though she claimed to have paid the sum in her capacity as the administratrix of Boon Wan’s estate. In her closing submissions, the plaintiff countered this argument (at para 51) by pointing out that on 21 November 2002 when the sum was paid, she had only been granted letters of administration for Boon Wan’s estate (on 1 July 2002), but the grant thereof was not extracted until 24 May 2006. Consequently, the plaintiff argued, she had no formal capacity to sue as the administratrix of Boon Wan’s estate when the writ herein was issued on 22 January 2007, relying onWong Ah Moy v Soo Ah Choy[1996] 3 SLR 398(“Wong’scase”). 115  InWong’scase, the plaintiff/appellant claimed to be the lawful widow of the estate of one Theng, having married him according to Chinese customary rites in 1952 and by whom she had six children. In 1964, Theng married the defendant/respondent at the Registry of Marriages. The plaintiff applied for and obtained a grant of letters of administration to Theng’s estate. She then commenced an action against the defendant seekinginter aliaa declaration that the sale proceeds of certain immoveable properties which were in the defendant’s name, were held on trust by the latter for Theng. The plaintiff obtained (ex parte) an interim injunction to restrain the defendant from disposing of or dealing with the defendant’s assets. The defendant on her part filed a caveat against the plaintiff’s grant of the letters of administration. She followed up by applying to discharge the injunction and also to strike out the plaintiff’s action alleging the plaintiff lacked the capacity to sue because the plaintiff had not extracted the grant of letters of administration. The defendant succeeded in her applications while the plaintiff failed in her application to amend her writ of summons to specify that her action was brought in her alternative capacity as a beneficiary of the estate and on behalf of her children as beneficiaries. 116  The plaintiff successfully appealed to the Court of Appeal. The appellate court held that the beneficiary of an unadministered estate was not without remedy as he may institute an action to recover the assets of the estate where special circumstances could be shown. The Court of Appeal added that the plaintiff had shown there were special circumstances as her failure to extract the grant of letters of administration to the estate of Theng was her inability to obtain the necessary clearance from the Commissioner of Estate Duties; she was unable to file the estate duty affidavit owing to her inability to specify the properties belonging to the estate which were held by the defendant. 117 It can be seen from the above synopsis of the facts thatWong’s case does not help the plaintiff. She hadextractedthe grant of letters of administration to Boon Wan’s estate on 24 May 2006 and had therefore the capacity to sue as his administratrix when she commenced this suit on 22 January 2007. Why didn’t she? 118  The defendant’s submissions (at para 15) pointed out that the plaintiff’s issuance of the writ in her personal capacity coupled with the fact that the sum was not listed in the estate duty returns as a debt due to Boon Wan’s estate (see [90]) meant that the plaintiffdid notmake the gift as a matter of legal obligation but voluntarily as a gift in her personal capacity, to give effect to her late husband’s express wish and intention. In any case, the plaintiff drew the cheque for the sum from her personal bank account. I am therefore in agreement with the defendant’s submission on this point.",
        "Conclusion": "119  I therefore find on a balance of probabilities that the plaintiff has failed to discharge the burden to prove her case on the grounds of mistake, economic duress and unenforceability under s 7(2) of the Act. There being no unjust enrichment on her part, there is no legal obligation on the defendant to return the sum to the plaintiff. 120  Consequently, I dismiss the plaintiff’s claim with costs to the defendant to be taxed on a standard basis unless otherwise agreed. [note: 1]See AB194[note: 2]See AB136[note: 3]N/E 48[note: 4]N/E 52[note: 5]N/E 53-54[note: 6]N/E21-22[note: 7]N/E 28-29[note: 8]N/E 98[note: 9]N/E 20"
    }
}