{
    "case_title": "PT Tenar Indoam Oil Services v Third Wave Group Ltd",
    "ncitation": "[2008] SGHC 18",
    "coram": "Andrew Ang J",
    "sections": {
        "Ordinary commission": "10     In respect of their claim for Ordinary Commission, the plaintiff referred to the Commission Schedule at Appendix B of the Agency Agreements. This was pleaded at para 6(a) [erroneously numbered as 5(a)] of the Statement of claim read with Annex A thereto. A summary of the plaintiff’s claim for Ordinary Commission was set out as follows: Commission due (Annex A)  No.YearAmount (US$)1199716,253.802199829,527.4331999 (estimated)16,222.28420002,355.485200145,034.196200246,825.687200325,400.11Total:221,618.97 11     The Statement of Claim itself did not explain expressly why the plaintiff was claiming discrepancies in Ordinary Commission. Annex A thereto merely set out the particulars of the invoices, commission as computed by the plaintiff, commission paid and the discrepancies. 12     An examination of the invoices and related documents, however, showed that the plaintiff claimed for shortfall in the payment of Ordinary Commission because, according to the plaintiff, it was entitled to: (a)    commission based on the value of the plaintiff’s invoice (ex-Jakarta Price) and not the value of the defendant’s invoice (ex-Singapore Price); (b)    commission on products lost in hole as if they were sale transactions; (c)    commission on invoices which, the defendant said, customers had not paid,ie, bad debts (this item of claim was dropped at the trial); (d)    commission for inspection services rendered to customers; (e)    commission for “redressing” (see definition in [46] below) of PBL tools; (f)     commission for new products introduced after the date of the 1st Agency Agreement on the same basis as in Appendix B; and (g)    commission based on Appendix B for specially negotiated transactions. 13     In summary, at para 9(a) of their Defence and Counterclaim, the defendant pleaded that apart from the Agency Agreements there was another agreement (“Commission Agreement”) made partly orally, partly in writing and partly by conduct whereunder it was agreed: (a)    that all commission payable under the Agency Agreements were to be computed on the basis of ex-Singapore Price; (b)    no commission was payable with respect to inspection of tools, redressing of PBL tools, the products and/or the replacement of any parts or consumables. (c)    commission was payable with effect from 1 December 2001 in respect of charges billed to customers as a result of a product being lost in hole at specific rates (depending on brands) based on the replacement cost for such lost product. (It was the defendant’s case that prior thereto, no commission was payable for lost products except for Redback Roller Reamers.) 14     The defendant further pleaded in para 9(a) that from time to time during the term of the 2nd Agency Agreement, when new products were included for purposes of the agency, the Commission Agreement was varied in that the plaintiff and defendant would agree on special rates of commission for such products. (It is curious that the defendant pleaded a variation of the Commission Agreement rather than the 2nd Agency Agreement. That could have been because the defendant was seeking to circumvent what was thought to be an obstacle in cl 11.4 of the 2nd Agency Agreement which required any amendment to be in writing signed by both parties.) 15     In reply, the plaintiff insisted that the only agreements entered into by the parties were the Agency Agreements and denied the existence of the Commission Agreement, citing cll 11.3 (which stated that, if there was any conflict or inconsistency between the terms of the Agency Agreement and any other agreement between the parties, the Agency Agreement would prevail) and 11.4 (see [14] above) of the Agency Agreements. 16     The defendant submitted that if indeed there was no Commission Agreement then, on the defendant’s view as to the products and the type of transactions covered by the Agency Agreements, the plaintiff would have no basis to claim commission in respect of new products and transactions which were neither sale nor rental transactions. The defendant added, however, that as the transactions had undeniably taken place with the full involvement of the plaintiff who had entered into contracts with customers, issued invoices to customers and accepted commission payments in respect of the same, the plaintiff would be estopped from denying the existence of the Commission Agreement. 17     The starting point is to establish what exactly the plaintiff was authorised to do under the Agency Agreements and what commission was agreed to be paid by the defendant to the plaintiff. 18     The defendant submitted that the transactions which the plaintiff was authorised to enter into and for which it would be entitled to commission under the Agency Agreements were sale and rental of the “Products” therein defined. The defendant argued that it followed that unless the parties separately agreed, commission would be paid only for sale and rental transactions in respect of the “Products” and nothing else. 19     The defendant further argued that the “Products” were limited to products referred to in Appendix D to the respective Agency Agreements. Appendix D to the 1st Agency Agreement was as follows: Third Wave Group Ltd., Associated Companies, and Principals •        Third Wave Group Ltd. •        TW Engineering Services Ltd. •        TW Gearhart Ltd. (Redback Roller Reamers, Stabilizers and PDC Backream Cutters •        Well-Flow Technologies (Wellbore Cleanup Chemicals and Casing Brushes) •        HE Drilling and Fishing Tools (S) Pte Ltd. (Hydra Jars, Accelerators, Shock Tools, and Fishing tools). Appendix D to the 2nd Agency Agreement was wider and provided as follows: “Companies, Associated Companies and Principals” Third Wave Group Ltd – Associated Companies and Principals covered under this agreement, as follows: •        Third Wave Group Ltd. •        TW Engineering Services Ltd. (petroleum engineering services, consultants, etc.) •        TW Gearhart Ltd. (Redback Roller Reamers, PDC back ream cutters, Replaceable Blade IB stabilizers and all other Redback products) •        HE Drilling & Fishing Tools (S) Pte Ltd. (Houston Engineers drilling and fishing tools inclusive of their entire product line, ie hydra jars, accelerators, shock tools, hydra thruster, bumper subs, and fishing equipment, etc.) •        Well-Flow Technologies (wellbore cleanup chemicals and cashing brushes) •        Downhole Products Plc. (Spir-o-lizers rotating bushings, Spir-o-loks locating collars, reaming shoes, etc. •        Bronco Asia Ltd. – rig parts and supplies. However, in neither of the Agency Agreements was Appendix D specifically referred to. 20     In support of the above contentions, the defendant raised the following points quoting from the very poorly drafted Agency Agreements: (a)    In the Agency Agreements, “Products” was defined as – [T]he products sold and serviced in the conduct of the Business known as Third Wave Group Ltd. include (sic) all products represented and or owned by the company. “Business” was defined as – [A]ll of the business of Third Wave Group Ltd. and associated companies and principals* consisting of the sales/service and rental of it’s (sic) products. (* “and principals” included in the 2nd Agency Agreement) “Company” referred to “Third Wave Group Ltd”. (b)    Appendix B of the 1st Agency Agreement provided as follows: “Commission Sale” Rental:       10% (ten percent) if no withholding tax is taken Rental:       5% (five percent) if withholding tax is taken Sales:         7.5% (seven and a half percent) on all sales orders Other Sales: on negotiated sales orders, the commission will be discounted on a prorated basis equal to the discount off of list price or commission will be paid on a case by case basis as mutually agreed between the “Agent” and “Company”. Appendix B of the 2nd Agency Agreement was identical except that it had an additional paragraph relating to Territorial Commission in the following terms: b).    Territorial Commission–any sales or rental of products represented herein, covered under this agreement which occur outside of the “Territory” but are for use by clients in the Territory, the AGENT will be paid a commission rate of three (3) percent of the Ex-Singapore based price list, excluding freight, duties, packaging, etc. The defendants pointed out that Appendix B throughout referred only to “sales” and “rental”. (It should also be pointed out that although under cl 6.1 of each of the Agency Agreements commission was payable “as specified in Schedule A”, in fact there was no Schedule A. Both parties, however, appear to have accepted that reference ought to have been to Appendix B.) (c)    Although Appendix D to both Agency Agreements was not specifically referred to in the body of the Agency Agreements either, the defendant argued that Appendix D was intended to identify the products covered under the Agency Agreements. The defendant pointed out that Appendix D to the 2nd Agency Agreement was expanded to cover products not included in Appendix D to the 1st Agency Agreement. It therefore lent support to its contention that the products covered under the Agency Agreements were limited to those represented or owned by the defendant at the time of the execution of the relevant Agency Agreement; it did not extend to products which at any time thereafter became represented or owned by the defendant unless expressly included by amendment of Appendix D. 21     The defendant contended that whenever a new product was introduced which fell outside Appendix D or if the plaintiff was to be involved in a transaction which was neither a sale nor a rental of products, the parties would discuss and agree whether commission was payable and, if so, at what rate. According to the defendant, this was in fact done. Hence, in the Defence and Counterclaim, the defendant pleaded that from time to time during the term of the 2nd Agency Agreement, when new products were introduced, the Commission Agreement was varied and the parties would agree special rates of commission for such products. The defendant contended that the transactions involving new products and those which were neither a sale nor rental of products could not have been carried out unless the parties had agreed. The defendant further pointed out that where commission was payable, it had indeed been paid by the defendant. The defendant therefore contended that it was not open to the plaintiff to argue that all transactions over the 6-year period had to be captured under the 1st or 2nd Agency Agreements. 22     The plaintiff, on the other hand, denied the existence of the Commission Agreement and insisted that the commission schedule in Appendix B applied to new products regardless of when they were introduced. It argued that under para 9(a)(viii) of the Defence, the defendant had accepted that new products did fall under the Agency Agreements and that the only part of the Agency Agreements that had to be varied was that relating to the commission payable in respect of such new products. It further contended that no variation could be relied upon in the absence of agreement in writing as required by cl 11.4 of the Agency Agreements. 23     I agreed with the defendant that as a matter of construction the Agency Agreements did not contemplate automatic inclusion of new products and that the products in the Agency Agreements were limited to those set out in Appendix D of the respective Agency Agreements. The very fact that Appendix D to the 2nd Agency Agreement was an expanded version of that in the 1st Agency Agreement supported such a construction; if the plaintiff was correct, there would have been no need to expand Appendix D. 24     Accordingly, new products could be included only by agreement between the parties. In my view, para 9(a)(viii) of the Defence and Counterclaim was intended to be read in that light so that the variation therein referred to involved both the inclusion of the new products and the special rates of commission. 25     The other point on which the parties disagreed was whether the Agency Agreements, as drafted, covered only sales and rental transactions. The plaintiff submitted that sales included “lost in hole” transactions. It also argued that it was entitled to commission for inspection services and “redressing” as if they were rental transactions. On its part, the defendant disputed that inspection services were rental transactions. Whilst not disputing that commission was payable for “redressing” services it sought an exception with respect to such services performed for PBL tools claiming that to be a term of the Commission Agreement. We shall deal with each of the issues relating to Ordinary Commission in the paragraphs following.",
        "Commission based on ex-Singapore price": "26     The Agency Agreements were silent as to whether Ordinary Commission was to be based on ex-Singapore prices or ex-Jakarta prices. The defendant’s position as stated above was that the omission was supplied by the Commission Agreement under which the parties agreed that the Ordinary Commission was to be based on ex-Singapore prices. According to the defendant, this Commission Agreement was made partly in writing, partly orally and partly through conduct. Where the contract is only partly written, nothing in the authorities prevents the court from looking at the way the parties acted for the purpose of ascertaining what terms were agreed but not written down: Kim Lewison,The Interpretation of Contracts(Sweet & Maxwell, 3rdEd, 2004) at p 91. Therefore inWilson v Maynard Shipbuilding Consultants AB[1978] QB 665, the English Court of Appeal held that where one cannot ascertain from the terms of the contract itself what was agreed about a relevant term, one may look at what happened and what the parties have done under the contract during the whole contemplated period of the contract for the limited purpose of ascertaining what that term is. 27     Applying this principle, the evidence in our case shows that although the question was raised in correspondence between the parties, no express agreement appeared to have been reached in the correspondence. The conduct of the parties, however, suggested that the plaintiff had accepted that computation be based on ex-Singapore prices. 28     On numerous occasions, the plaintiff signed, without protest or reservation, bank payment vouchers prepared on that basis. The plaintiff’s witness, Hari Mulia Rahardjo (“Rahardjo”), admitted that he had checked the bank payment vouchers and corresponding invoices before he signed. He later sought to retract, but in my view the explanation was a lame effort. Equally lame was his explanation that although he “accepted” payment of commission based on ex-Singapore prices, he never agreed. This was so despite Mark Alan Souders (“Souders”) (defence witness) agreeing under cross-examination that Rahardjo and his sister Nita Febin (who also signed payment vouchers) were simply acknowledging receipt of payment. In my view, the state of mind of the plaintiff’s representatives ought to be objectively determined on the evidence. The evidence suggested to me that the parties agreed to computation of the commission on the basis of ex-Singapore prices. 29     An illustration will assist. Rahardjo sent a telefax dated 11 September 1997 seeking an urgent meeting with Souders after he became aware that commission was calculated on the basis of the ex-Singapore prices. He admitted that there was a discussion thereafter during which he was told that the commission was properly based on the ex-Singapore price but that he did not agree. Surprisingly, a few minutes later, he said he could not remember whether he had a discussion with the defendant’s representatives. 30     Furthermore, Rahardjo confirmed that about a week after the said telefax of 11 September 1997, the plaintiff accepted payment of commission based on the ex-Singapore price. Rahardjo himself signed both the bank payment voucher and the cheque in respect of the said payment. All that he could say was that he accepted payment but did not agree. 31     Did the plaintiff inform the defendant of its disagreement? The only evidence produced by the plaintiff in this regard consisted of a few e-mails sent in 2003afterthe 2nd Agency Agreement had been terminated. The plaintiff disagreed that it had not informed the defendant of its disagreement. But, if so, the inevitable question was why the plaintiff gave Souders the right to operate the HSBC account singly in November 1997 (shortly after Rajardjo’s telefax dated 11 September 1997). Even more inexplicable was the plaintiff’s failure to insist that the 2nd Agency Agreement (signed less than three months later) stipulate that commission ought to be computed with reference to the ex-Jakarta price. 32     To both questions, the answer of Rahardjo in short was “I don’t know”. Rahardjo later tried to mitigate the damage his answers caused but I found his explanation unbelievable. In fairness, I should add that part of Souders’ evidence was not satisfactory either. Para 9(a)(iii) of the Defence had averred that in so far as the Commission Agreement was made partly orally, it was made at meetings and/or discussions between Souders (acting for the defendant) and Rahardjo (acting for the plaintiff) prior to the execution of the 1st Agency Agreement. However, the evidence in his affidavit of evidence-in-chief, when tested under cross-examination, did not quite bear out the pleading. It was at best inconclusive. Similarly, the defendant’s averment that the parties had agreed in writing that the plaintiff’s ordinary commission was to be based on ex-Singapore prices was not borne out by the evidence. Nevertheless, for the reasons given above, on balance I found for the defendant in regard to the question whether commission was to be based on ex-Singapore prices. 33     Whilst the plaintiff argued that the parol evidence rule applied which precluded the court from looking at extrinsic evidence beyond the four corners of the Agency Agreements, in this case proviso (b) to s 94 of the Evidence Act (Cap 97, 1997 Rev Ed) permits the court to consider such evidence. Proviso (b) states: (b)    the existence of any separate oral agreement, as to any matter on which a document is silent and which is not inconsistent with its terms, may be proved; in considering whether or not this proviso applies, the court shall have regard to the degree of formality of the document. 34     As I have reasoned in the preceding paragraphs, I found that the defendant has proved the existence of a separate oral agreement where the plaintiff had accepted from its conduct that commission was to be calculated based on ex-Singapore price. Such agreement was not inconsistent with the terms of the Agency Agreements since the latter were silent as to whether commission was to be calculated based on ex-Singapore or ex-Jakarta prices. 35     The words “oral agreement” in the proviso are not to be interpreted strictly; it includes all unwritten agreements whether come to by words of mouth or otherwise.Sarkar on Evidence(16thEd, 2007), notes at 1473 that “unwritten agreement though implied from the acts and conduct of the parties is none the less oral”, citingMayandi v Oliver22 M 261: 8 MLJ 196;Radha Ramam Chowdry v Bhowani Prosad Bhowmik12 CLJ 439: 6 CWN 60;Lakhatulla v Bishwambhar12 CLJ 646;Lakshmi Charan Majumdar v Nabadwip Chandra Pandit56 C 201. 36     This interpretation of the words “oral agreement” is consistent with the position at common law.Chitty on Contracts, vol 1 (Sweet & Maxwell, 29thEd, 2004) at para 12-103, states that in the common law equivalent of proviso (b), the collateral contract or warranty may be oral or informal. 37     Furthermore, the plaintiff’s reliance on cl 11.4 of the Agency Agreements (which required any modification to be in writing signed by both parties) to preclude the collateral contract from being considered is, in my view, misplaced. As I have mentioned, the Agency Agreements were completely silent as to whether commission was to be calculated based on ex-Singapore or ex-Jakarta prices. There was nothing to be modified in the Agency Agreements and cl 11.4 is inapplicable in this regard.",
        "“Lost in hole” transactions": "38     I am of the view that “lost in hole” transactions were not sale transactions within the spirit and intendment of the Agency Agreements prior to their specific inclusion in 2001. (According to Souders, this inclusion became possible because the defendant had managed to persuade the manufacturers to pay a commission.) 39     When a tool is lost in a well or hole, what the customer pays is compensation for the lost tool. Although this takes the form of payment for a replacement, technically, the customer did not purchase or otherwise acquire title to the replacement. The tool was leased by the manufacturer through the defendant and the plaintiff to the customer. When the customer paid compensation, the replacement originated from the manufacturer and remained the property of the manufacturer. There was no sale transaction as such. 40     Besides, Rahardjo himself admitted that he was unaware whether the defendant marked up the price and made a profit from such transactions. In those circumstances, it did not seem reasonable that the plaintiff should insist on charging a commission.",
        "Inspection services": "41     As noted earlier, the defendant’s position was that under Appendix B to the Agency Agreements, commission was payable only for sales or rental transactions. In Annex A of the Statement of Claim, the plaintiff claimed commission for inspection services as if they were rental transactions. Initially, Rahardjo’s evidence was that inspection services should be treated as rental transactions because withholding tax was payable. Clearly there was no legal or logical basis for such contention and in re-examination Rahardjo sought to backtrack from this untenable position. 42     The plaintiff also sought to support its claim by referring to the word “serviced” in the definition of “Products” in the Agency Agreements which read as follows: [T]he products sold andservicedin the conduct of the Business known as Third Wave Group Ltd. include all products represented and or owned by the company. “Business” was defined as – [A]ll of the business of Third Wave Group Ltd. and associated companies and principals* consisting of the sales/serviceand rental of it’s (sic) products. (* “and principals” included in the 2nd Agency Agreement) [emphasis added] The plaintiff’s construction is untenable as it focuses solely on the word “serviced” or “service” in the above definitions without regard to the contract as a whole. 43     Under cl 4.1 of the Agency Agreements, the plaintiff’s authority was limited to procuring the sale or rental of the products. More importantly, the plaintiff’s entitlement to commission under Appendix B was limited to sales and rental transactions. While the definition of “Products” and “Business” contemplated that the defendant would render services as part of its business, Appendix B entitled the plaintiff to commission only for sales and rental transactions. Rahardjo agreed under cross-examination that the plaintiff was entitled to commission only on sales and rental transactions. This can be seen from an extract from the transcript of Day 3 of the proceedings at p 243 set out below: Q      What I am suggesting to you, I don’t want to waste the Court’s time is that in this agency agreement, there is a list of duties the plaintiff has to do, a list of duties defendants have to do, who is supposed to work on certain items, okay. It doesn’t mean that every single costs and expenses has to be borne by the defendant or that the plaintiff is entitled to commission on every single thing that is charged to the customer whether at cost or otherwise. You are only entitled to be paid commission on sale and rental transaction, would you not agree? A       Yes, I agree that, yes. The documents produced for these proceedings show that no commission was ever computed or paid in respect of inspection service. This was confirmed by Rahardjo. 44     It was significant that in the defendant’s invoices to the plaintiff, commission was never computed on charges for inspection services. Rahardjo and Nita Febin signed bank payment vouchers which clearly did not provide for commission for inspection services. As before, the familiar refrain from Rahardjo was: “I signed it and received it but that doesn’t mean I agreed to it.” As I noted at the trial, that was strange. Rahardjo’s explanation was that he did not want to interrupt the cash flow and thought he could resolve matters with the defendant later. But it was never resolved. 45     For six years the plaintiff continued to sign the bank payment vouchers and accepted payment without qualification. One would have expected that, if truly they disagreed, they would have signed under protest or put in some qualification. Instead, as noted earlier, the plaintiff conferred on Souders the right to sign singly for the HSBC account and made no attempt to change the arrangements between the parties when they signed the 2nd Agency Agreement. I therefore held that no commission was payable on charges for inspection services.",
        "Redressing": "46     “Redressing” refers to the change of worn out parts of a rental product and generally the cleaning of the product before it is rented out to another customer. The costs of redressing were borne by the customer who last rented the product before the redressing. The dispute between the parties with regard to redressing is identical to that in relation to inspection services. Whereas the defendant maintained that no commission for redressing was provided for in Appendix B to the Agency Agreements, the plaintiff argued that redressing ought to be treated like rental transactions. There was one difference though. 47     The defendant said that because they were able to mark up the redressing charges when such services were performed by PT BJ Services (an Indonesian company), they agreed to pay the plaintiff commission at 10%. This agreement to pay commission for redressing save and except for PBL tools was, according to the defendant, a term of the Commission Agreement. However, under cross-examination, Souders agreed not only that redressing was contemplated in the Agency Agreements but that it fell under rental and, accordingly, commission was payable to the plaintiff. 48     It should also be noted that, unlike inspection, in the case of redressing commission had been paid from the start. Given Souders’ acceptance that redressing was part of rental, I could not accept that redressing of PBL tools was to be treated differently in the absence of proof of agreement between the parties to that effect. Accordingly, I held that commission was payable for redressing of PBL tools.",
        "Commission on new products": "49     Much has already been said in this regard in paras 14 to 24 resulting in my holding that as a matter of construction the Agency Agreements did not contemplate automatic inclusion of new products, the “Products” covered by the Agency Agreements being limited to those owned or represented by the defendant as at the respective dates of the Agency Agreements,ie, the products set out in Appendix D to each of them. I need only add a few further remarks. 50     First, the evidence favoured the defendant. Thrice in the course of cross-examination, Rahardjo admitted that the products covered by the Agency Agreements were limited to those owned or represented by the defendant. And yet, each time he would backtrack and assert otherwise. I found Rahardjo’s evidence to be unreliable. 51     I accepted the evidence of Souders that as new products were introduced the defendant’s proposed commission structure for each was duly implemented,ie, the commission was computed according to such structure and paid to the plaintiff. Rahardjo and Nita Febin signed documents verifying the computation of the commission as set out in the defendant’s invoices as well as documents effecting payment of such commission without protest or reservation. And yet, two years after termination of the 6-year relationship, the plaintiff came to court alleging they never agreed. 52     Second, to the plaintiff’s objection that the Commission Agreement had to be in writing as required by cl 11.4 of the Agency Agreements, I observe that with respect to new products both parties had dealt with each other on the basis of the terms of the Commission Agreement relating thereto and it was not open to either to deny those terms. Given that the Agency Agreements did not apply to new products, cl 11.4 had no application. The agreement reached between the parties with regard to new products was a separate agreement and not a modification or amendment of the Agency Agreements. Accordingly, cl 11.4 did not apply. Besides,if the Commission Agreement did not exist, and since the Agency Agreements did not apply to new products, the plaintiff would have been paid commission to which they were not contractually entitled. 53     Whilst on the subject of new products, I note that the plaintiff secured an admission by Souders that two products identified in paras 83 and 84 of his affidavit of evidence-in-chief,viz, “DHP reamers to Maxus” and “Canon products to Pertamina” werenotnew products. Rather, they were “negotiated orders” as to which “the commission structure was modified to take into account special considerations”. 54     As such, they did not fall within para 9(a)(viii) of the Defence and Counterclaim which applied only to new products. Neither was there any separate pleading regarding the negotiated orders or the applicability of Appendix B, para (a) of which made provision for “negotiated orders”. The plaintiff therefore submitted that such omission was fatal. 55     Order 18 r 8 of the Rules of Court (Cap 322, R5, 2006 Rev Ed) reads as follows: Matters which must be specifically pleaded (O.18, r.8) 8. — (1) A party must be in any pleading subsequent to a statement of claim plead specifically any matter, for example, performance, release, any relevant statute of limitation, fraud or any fact showing illegality — (a)    which he alleges makes any claim or defence of the opposite party not maintainable; (b)    which, if not specifically pleaded, might take the opposite party by surprise; or (c)    which raises issues of fact not arising out of the preceding pleading. The principle behind the rule is that a party who has a specific ground of defence or claim must set this out so that the issues between the parties are clear and that they have notice of what the other intends to prove at the trial: Jeffrey Pinsler,Singapore Court Practice 2006(LexisNexis, 2006) at para 18/8/4 (“Pinsler”), citingRe Robinson’s Settlement,Gant v Hobbs[1912] 1 Ch 717 (“Re Robinson’s Settlement”). The White Book makes clear, however, that the rule does not prevent the court from giving effect in proper cases to defences which are not pleaded:Singapore Civil Procedure 2007(Sweet & Maxwell Asia, 2007 Ed) at para 18/8/1, p 268 (“White Book”). 56     To my mind, whilst the general rule remains that a party is bound to his pleadings, the overarching principle behind this rule is that prejudice must not have been caused to the plaintiff in the conduct of his case. That the justice of the case is the overriding concern is axiomatic. 57     In relation to O 18 r 8, the Malaysian Court of Appeal inBoustead Trading (1985) Sdn Bhd v Arab-Malaysian Merchant Bank Bhd[1995] 3 MLJ 331held at 342: [W]here a party has failed to set out the material facts in his pleadings, but there is occasioned no surprise to his opponent, a court may, in the interests of justice, permit the point to be taken. The authorities have rightly demonstrated that the courts will examine each case on its own facts to determine whether the other party was prejudiced or taken by surprise. Goh Phai Cheng JC inChua Gek Kuon v Seow Chai Seng[1992] 1 SLR 270, at [10] to [13], scrutinised the statement of claim carefully to hold that the defendant was not taken by surprise when the plaintiff adduced evidence of traffic lights at trial even though the statement of claim did not have any reference to traffic lights. 58     Recently, inMain-Line Corporate Holdings Ltd v United Overseas Bank Ltd (First Currency Choice Pte Ltd, third party)[2007] 1 SLR 1021, whilst Tay Yong Kwang J held at [75] that a defence of innocent infringement must be positively pleaded, he nevertheless considered the issue in the absence of such pleading because “it was alluded to in evidence and can be dealt with without causing injustice to any party” and the “relevant facts are already before the court”. 59     In our case, the defendant should be allowed to rely on the defence that the two orders were specially negotiated orders. Whilst not specifically pleaded, the material facts had been raised, not just cursorily, but in full detail in Souders’ affidavit of evidence-in-chief with accompanying exhibits. From the counsel’s cross-examination of Souders, I conclude that the plaintiff was well aware of this defence. It is also significant that the plaintiff’s counsel did not contend in his closing submissions that the plaintiff had been taken by surprise. The mischief that O 18 r 8 is aimed at is absent in the present case. 60     That one should not lose sight of the principle behind the rule was demonstrated by Lord Normand inGeo W McKnight(1947) 80 L1 LRep 419, where he said (at 423): [T]he court is not bound by the pleadings of parties and must proceed upon the evidence on which it deems to be most accurate and trustworthy. This principle was endorsed inThai Kenaf Co Ltd v Keck Seng (S) Pte Ltd[1993] 2 SLR 92, where the court – despite the pleadings concentrating on whether there was a valid assignment of the benefit of certain contracts – held that the evidence clearly showed that a company had acted as an agent for the plaintiffs even though this was not pleaded in the statement of claim. Similarly, in addition to finding that the plaintiff was not taken by surprise, I find that the evidence clearly showed that the two orders were specially negotiated orders. 61     InLee Chee Wei v Tan Hor Peow Victor[2007] 3 SLR 537, where one party specifically failed to plead for damages to be assessed, VK Rajah JA held that the party had pleaded for “damages in lieu of specific performance” and this has satisfied the requirement of fair warning. In this regard, he noted at [63]: InLim Eng Kay v Jaafar bin Mohamed Said[1982] 2 MLJ 156, the court awarded special damages notwithstanding that they had been incorrectly pleaded as general damages, amply illustrating the pragmatic judicial approach that eschews refusal of a claim purely on account of a technical error of pleading. As aptly noted by Lai Kew Chai J inLea Tool & Moulding Industries Pte Ltd v CGU International Insurance plc[2001] 1 SLR 413at [16], “our procedural laws are ultimately handmaidens to help us achieve the ultimate and only objective of achieving justice as best we can in every case [and should] not [be] permitted to rule us to such an extent that injustice is done’. InChwee Kin Keong v Digilandmall.com Pte Ltd[2004] 2 SLR 494(at [85]) the court observed: Rules of court which are meant to facilitate the conduct of proceedings invariably encapsulate concepts of procedural fairplay. They are not mechanical rules to be applied in a vacuum, devoid of a contextual setting. 62     That left me with one last objection by the plaintiff,viz, that the agreement which the defendant alleged had been reached on the negotiated orders had not been reduced into writing as required by cl 11.4 of the Agency Agreements. 63     All I need to say is that para (a) of Appendix B, specifically provided for such negotiated orders and allowed commission to be paid “on a case by case basis as mutually agreed” between the plaintiff and the defendant. Clause 11.4 therefore did not apply since there was no “modification” of the Agency Agreements.",
        "Territorial commission": "64     Territorial commission was additionally provided for in Appendix B to the 2nd Agency Agreement in the following terms (also quoted above at [20]): b).       Territorial Commission–any sales or rental ofproducts represented herein, covered under this agreement which occur outside of the “Territory” but are for use by clients in the Territory, the AGENT will be paid a commission rate of three (3) percent of the Ex-Singapore based price list, excluding freight, duties, packaging, etc. Two areas of dispute arose between the parties in this regard. The first related to “rig parts and supplies” (“Bronco Products”) which were manufactured by Bronco Asia Ltd’s associated company in Houston, Bronco Mfg. Inc. The second related to Canon Products.",
        "Bronco Products": "65     In computing territorial commission payable to the plaintiff in respect of Bronco Products, the defendant excluded the freight from Houston to Singapore for the reason that the freight was charged back to the customer at cost. The plaintiff, however, insisted that, as provided under Appendix B, territorial commission was to be based on the ex-Singapore price. 66     During the trial the plaintiff asked for and was provided with copies of all documents relating to freight charges for almost all invoices totalling several hundred. In none of them was the plaintiff able to find proof that the defendant had added a mark-up on the freight costs. The defendant contended that it was unreasonable of the plaintiff to ask for commission on the basis of the ex-Singapore price when the defendant made no profit on the freight from Houston to Singapore. The fact, however, is that Appendix B did provide for territorial commission to be at 3% of the ex-Singapore price. 67     The defendant’s argument amounted to insisting that the ex-Houston price had to apply as though the customer had bought the Bronco Products ex-factory. But the fact is that the customer did not. 68     Rahardjo was confronted with the question why the plaintiff did not ask for territorial commission on the sale of Canon Products similarly to be computed on the basis of ex-Singapore prices. He was unable to give a satisfactory answer apart from suggesting that perhaps the plaintiff forgot. To be fair, however, the defendant itself had argued that the Canon Products were not even included in the products covered by the Agency Agreements as they became available only in 1999, long after the 2nd Agency Agreement had been signed. 69     According to the defendant, it was for that reason that the rate of territorial commission was exceptionally agreed at 1%. It should further be noted that the customers for the Canon Products arranged for their own freight forwarders to collect the products from the factory in Houston. Clearly, the sale was ex-factory and it would have been unreasonable for the plaintiff to have chosen to ignore that fact even if the Canon Products were covered by the 2nd Agency Agreement. The same considerations did not apply to the Bronco Products. Accordingly, I held that territorial commission on Bronco products should be calculated at 3% of the ex-Singapore prices as provided under Appendix B.",
        "Canon Products": "70     Under cross-examination, Rahardjo agreed that Canon Products were not “rig parts and supplies” described in Appendix D. Besides, as was mentioned earlier, Canon Products became available long after the 2nd Agency Agreement was signed. They were therefore not included in Appendix D. There was therefore no basis for the plaintiff to insist on territorial commission being charged in accordance with Appendix B. 71     The parties separately agreed a rate of 1% and this had been implemented as agreed. The plaintiff’s claim for shortfall in the payment of territorial commission in respect of the Canon Products therefore failed.",
        "VAT penalties": "72     The plaintiff claimed that they incurred penalties for late payment of VAT to the Indonesian authorities. The defendant denied the plaintiff’s claim and put the plaintiff to strict proof thereof. In particular, the defendant contended that the plaintiff had not shown that the penalties were incurred in relation to the plaintiff’s invoices issued under the Agency Agreements. The plaintiff conceded that it conducted other business apart from acting as Agent for the defendant under the Agency Agreements. However, it maintained that such other business was only vis-à-vis Pertamina and Caltex with respect to whom there was no possibility of VAT penalties being payable by the plaintiff since both Pertamina and Caltex paid VAT directly to the Indonesian tax authorities. 73     The defendant’s counter was that the plaintiff had not proved that its only other customers were Pertamina and Caltex. In support thereof, the defendant pointed to many missing invoices issued by the plaintiff for other products and services which, if produced, could have shown that the plaintiff had other customers apart from Pertamina and Caltex for products and services unrelated to the defendant. The burden of proof was on the plaintiff and they ought to have produced the missing invoices. 74     In those circumstances, I declined the plaintiff’s invitation to find on a balance of probabilities that the VAT penalties incurred related to customers under the Agency Agreements.",
        "Employee tax and penalties": "75     The plaintiff claimed the sum of IDR229,950,535 from the defendant in respect of: (a)    taxes payable in respect of employees engaged by the plaintiff on behalf of the defendant; and (b)    penalties imposed by the tax authorities for failure to pay promptly. Appendix C to the Agency Agreements expressly provided that the defendant was to pay the taxes of all employees engaged by or for the defendant. 76     The defendant’s Souders was the one who engaged the 11 employees in question to carry out services for the defendant, placing them under the official employment of the plaintiff as the defendant did not have a legal presence in Indonesia. Souders also paid the salaries of the 11 employees from the HSBC account. 77     The defendant sought to imply four duties the plaintiff had to perform. As set out in para 9(d)(ii) of the Defence and Counterclaim they were as follows: (a)    The defendant needed the plaintiff to advise them as to which employees were employed by the plaintiff for the defendant and whether the terms of employment required the plaintiff to pay the employee’s income tax or whether the employee would bear this himself; (b)    If the plaintiff was to bear the tax, then the plaintiff was to prepare the tax forms, pay the tax and to invoice the defendant; (c)    If the employee was to bear the tax, then the plaintiff was to withhold the tax, prepare the form and pay the tax to the Indonesian authorities; and (d)    To collect a statement from the Indonesian tax authorities at the end of the year evidencing such payment. 78     Given Souders’ active participation, there was no room for the suggestion that the defendant needed to be advised who the 11 employees were and what the terms of their employment were. Similarly, as Souders paid the salaries, there was no room for any implication that the plaintiff was to withhold from the salary of an employee any tax payable. However, as the plaintiff was the official employee, it ought to have complied with Indonesian tax laws and reported the employees’ income accordingly. 79     Clause 3.1(n) of the Agency Agreements required the plaintiff to – [F]ile any tax returns in the territory to the appropriate authorities on behalf of Third Wave Group Ltd. as required by law, after written approval by Third Wave Group Ltd. … In my view, that provision was wide enough to require the plaintiff to file returns in regard to the employees’ income. 80     Rahardjo had alleged that Souders told him not to name the employees as the plaintiff’s and to leave it to the defendant to pay tax at their end. It was obvious that the defendant could not possibly have paid taxes in respect of the employees as it did not have a legal presence in Indonesia. Rahardjo, of course, knew this. Even if Souders had so requested, Rahardjo should have insisted on the plaintiff complying with the Indonesian tax laws. 81     The defendant also raised doubts whether the documents disclosed supported the plaintiff’s claim. It relied on the expert evidence of Nicholas James Graham to challenge the plaintiff’s claim. I must say that I was not at all persuaded by the evidence of the witness. Quite apart from the failure to comply with O 40A r 3 of the Rules of Court (Cap 322, R5, 2006 Rev Ed) (or perhaps consistently with the omission to comply), the witness failed to show the independence expected of an expert witness. I do not wish to recount the many instances during his cross-examination which betrayed his lack of independence as these were spelt out in great detail in the plaintiff’s closing submissions. Suffice it to say that I was satisfied on the balance of probabilities that the plaintiff did suffer the payment of tax and penalties in respect of the 11 employees. However, I allowed recovery of the taxes only as provided for in Appendix C. For the reason earlier given, the plaintiff was not entitled to be indemnified in respect of the penalties.",
        "CNOOC Contract claim": "82     The plaintiff claimed the sum of US$291,474.86 which it averred the defendant had wrongfully remitted to itself from the plaintiff’s HSBC account. On that claim, as with most of the others in the action, there was much dispute about the facts. So far as I was able to make out, the essential facts were these: (a)    Some time in April 2003, the plaintiff was awarded a contract by CNOOC SES Ltd for the rental of fishing products and services (“the CNOOC Contract”). (b)    By this time (ie, April 2003) the 2nd Agency Agreement had been terminated and the defendant had appointed PT Tiga Ombak (“PTTO”) as its agent in Indonesia. (c)    The CNOOC Contract required products and services of Smith International Inc (“Smith Inc”) and was for the duration of three years from April 2003 to April 2006. (d)    However, no agreement was reached between Smith Inc. and the plaintiff prior to the commencement date of the CNOOC Contract. As such, Smith Inc requested the defendant to assist. (e)    In the circumstances, Smith Inc caused its subsidiary in Indonesia, PT Smith Tool Indonesia (“PT Smith”) to supply the fishing products and services required for the CNOOC Contract to the defendant’s agent, PTTO. (f)     PTTO in turn supplied the fishing products and services to the plaintiff who supplied the same to CNOOC and by August 2003 PTTO had issued 15 invoices totalling the sum of US$162,126.01. (g)    On 29 August 2003, the defendant effected payment of the sum of US$141,474.86 to PTTO in settlement of the 15 invoices less a discount granted, 10% VAT and 6% withholding tax. The 10% VAT and 6% withholding tax were withheld by the plaintiff for direct remittance to the Indonesian tax authorities. PTTO in turn settled the 15 invoices issued by PT Smith. (h)    Subsequently, PT Smith supplied further fishing products and services to PTTO who in turn supplied the same to the plaintiff and, by November 2003, PTTO had issued another 17 invoices to the plaintiff totalling the sum of US$224,434.20. (i)     On 20 November 2003, the representatives of the plaintiff and the defendant effected an advance payment of US$150,000 to PTTO towards partial settlement of the 17 invoices less a discount granted, 10% VAT and 6% withholding tax. According to the defendant, PTTO in turn remitted the full sum of US$150,000 to PT Smith as advance towards the settlement of the 17 invoices issued by PT Smith to PTTO. (j)     Around early 2004, it was agreed between Smith Inc (acting on behalf of PT Smith), the plaintiff and the defendant (attending on behalf of PTTO), that PTTO would completely withdraw from the arrangement so that the plaintiffs may enter into a direct agreement with PT Smith with regard to the provision of fishing products and services for the CNOOC Contract. (k)    Pursuant to the agreement reached, PTTO cancelled the 17 invoices issued to the plaintiff so that the advance of US$150,000 paid by the plaintiff could be credited to its account with PT Smith. PT Smith in turn cancelled the 17 invoices which they had issued to PTTO. 83     It was clear that it was the defendant who effected the first payment of the US$141,474.86 and that at the time it did so, the 2nd Agency Agreement had terminated. As such, it did not have authority to do so. On the evidence, however, the defendant was not unjustly enriched as alleged by the plaintiff since the remittance was to PTTO in payment of the 15 invoices issued by PTTO. 84     In its closing submissions, the plaintiff made a passing allegation that the defendant had committed the tort of conversion. This was not pleaded but even if it were the claim would fail. At common law, a distinction is drawn between physical money (as in notes and coins) and money as currency. Lord Mansfield inMiller v Race(1758) 1 Burr 452, 97 ER 398, explained it thus: The true reason is, upon account of the currency of it: it cannot be recovered after it has passed in currency [ie has become part of the general supply of money]. So, in case of money stolen, the true owner can not recover it, after it has been paid away fairly and honestly upon a valuable and bona fide consideration, but before money has passed in currency, an action may be brought for the money itself. 85     On the facts of the case before me, it was clear that there was no way that any physical money could be identified, payment having been made by remittance from the HSBC account. I also did not accept that such payment caused the plaintiff to lose its leverage in its negotiation with PT Smith as to the appropriate commission the plaintiff ought to receive. 86     As noted above, there were further invoices rendered subsequent thereto totalling US$224,434.20 and when the second payment of US$150,000 was made, the plaintiff had taken care to withhold sufficient money for leverage purposes. It was also clear the plaintiff consented to and countersigned the second payment. Accordingly, its claim against the defendant in respect of that payment was also without merit.",
        "Defendant’s counterclaim": "",
        "Loan of US$132,035.82": "87     The defendant alleged that it made loans totalling US$132,035.82 which the plaintiff failed to repay. According to the defendant, seven loans or advances (both terms having been used synonymously) were made by way of cheques drawn on the HSBC account and the loans were evidenced by seven bank payment vouchers each identifying the payment as an advance to the plaintiff. Of the seven vouchers, two were signed by Rahardjo and three by Nita Febin. Initially, the plaintiff denied receipt of the last two payments but ultimately Rahardjo admitted that in fact they had been utilised to pay the plaintiff’s withholding tax and corporate income tax. However, both Rahardjo and Nita Febin claimed that they signed the bank payment vouchers blindly without realising that the payments were described as loans. I found that hard to believe. 88     The plaintiff also argued that even assuming the payments were loans, the amounts stated on the cheques and in the bank payment vouchers were in Indonesian currency totalling IDR 1,138,197,888. That appeared to me to be correct. I, accordingly, held that the plaintiff was liable to the defendant for the total loan amount if IDR 1,138,197,888.",
        "Defendant’s claim for US$207,472.12 or, alternatively, an account of the moneys paid into and out of the HSBC account": "89     The defendant claimed the sum of US$207,472.12 which it said the plaintiff “wrongfully remitted” from the HSBC account. In the alternative, the defendant prayed for an account of the moneys paid into and out of the HSBC account. Initially, both Souders and another of the defendant’s directors, Kees, insisted that the defendant’s claim for the said sum was legitimate. However, under cross-examination, they had to concede that both the claim for the said sum of US$207,472.12 and the prayer for an accounting were “baseless”. This was after they had been forced to admit that by April 2004 all the moneys in the HSBC account were derived from the CNOOC Contract, the defendant having earlier been paid for all invoices rendered by it pursuant to the Agency Agreements. 90     Given that the defendant had in early 2004 distanced itself from the CNOOC Contract, it could have no claim to any money in the HSBC account. On the contrary, by the defendant’s own calculations, the defendant owed the plaintiff US$15,215.63 for territorial commission. The claim for the US207,472.12 therefore failed. For the same reasons, the defendant had no right to call for an account of the moneys in the HSBC account.",
        "Conclusion": "91     In the result, I gave judgment for the plaintiff – (a)    For ordinary commission with respect to redressing of PBL tools at the same rate as for rental; (b)    For territorial commission with respect to Bronco Products on the ex-Singapore prices as provided in Appendix B to the 2nd Agency Agreement; and (c)    For recovery of employee taxes in the sum of Indonesian rupiahs 219,697,125. In regard to the counterclaim, I gave judgment to the defendant for recovery of the loan amount of Indonesian rupiahs 1,138,197,888. 92     At the request of counsel, submissions on costs were fixed for hearing on a later date. At the hearing on costs, I awarded the plaintiff half the costs in its action and, likewise, I granted the defendant half the costs in the counterclaim. I shall deal only with the costs awarded to the plaintiff in view of its appeal. 93     Ordinarily, costs should of course follow the event and a successful party who had acted neither improperly nor unreasonably should not be deprived of any part of his costs:Tullio v Maoro[1994] 2 SLR 489. 94     InRe Elgindata Ltd (No 2)[1993] 1 All ER 232, the English Court of Appeal laid down the following principles (conveniently set out in the headnotes): The principles on which costs were to be awarded were (i) that costs were in the discretion of the court, (ii) that costs should follow the event except when it appeared to the court that in the circumstances of the case some other order should be made, (iii) that the general rule did not cease to apply simply because the successful party raised issues or made allegations that failed, but that he could be deprived of his costs in whole or in part where he had caused a significant increase in the length of the proceedings, and (iv) that where the successful party raised issues or made allegations improperly or unreasonably the court could not only deprive him of his costs but could also order him to pay the whole or part of the unsuccessful party’s costs. The fourth principle implied, moreover, that a successful party who neither improperly nor unreasonably raised issues or made allegations which failed ought not to be ordered to pay any part of the unsuccessful party’s costs … Those principles were adopted by our Court of Appeal inTullio v Maoroas well as in several later cases before the Court of Appeal. 95     Order 59 r 6A of the Rules of Court (Cap 322, R5, 2006 Rev Ed) which came into effect on 15 December 2001 provides: In addition to and not in derogation of any other provision in this Order,where a party has failed to establish any claim or issue which he has raisedin any proceedings,and has thereby unnecessarily or unreasonably protracted, or added to the costsor complexity of those proceedings, the Court may order that the costs of that party shall not be allowed in whole or in part, or that any costs occasioned by that claim or issue to any other party shall be paid by him to that other party, regardless of the outcome of the cause or matter. [emphasis added] As was observed by the Court of Appeal inProgress Software Corp (S) Pte Ltd v Central Provident Fund Board[2003] 2 SLR 156at [52]: The crux of O 59 r 6A is thus whether the other party has unnecessarily added to the costs of the proceedings. 96     It will be recalled that the plaintiff had five principal heads of claim (see para 8 above). Under the first head, “Ordiinary Commission” – there were seven separate areas in which the plaintiff claimed for alleged shortfall in the payment of Ordinary Commission (see para 12 above). Of the seven, it succeeded only in one. Of the remaining four principal heads, it succeeded in two, in each case only partially. The unsuccessful claims took up a large part of the time for the proceedings. 97     More importantly, the plaintiff had caused the proceedings to be protracted because its key witness, Rahardjo, wasted a lot of time by backtracking on his evidence and giving different answers to the same question. This led to his cross-examination taking 8½ days. 98     I therefore did not consider that the plaintiff deserved the full costs and awarded it half the costs only."
    }
}