{
    "case_title": "Ong Jane Rebecca v Lim Lie Hoa and Others",
    "ncitation": "[2008] SGHC 44",
    "coram": "Choo Han Teck J",
    "sections": {
        "Introduction": "1   The proceedings before me were applications by the plaintiff and the first defendant for a review of the learned Assistant Registrar Ms Dorcas Quek’s (“the AR”) taxation of Bill of Costs No 118 of 2006 (“BC 118”). BC 118 was filed by the plaintiff on 29 May 2006, having been awarded costs of the inquiry proceedings (“the Inquiry”) in Originating Summons No 939 of 1991 (“OS 939”) against the first defendant. Briefly, the AR awarded a total sum of £78,981.66, HK$217,132.37 and S$559,853.45 for section 3 of BC 118 (in regard of the plaintiff’s disbursements for the Inquiry) and a sum of S$50,000 for section 2 of BC 118 (in regard of the plaintiff’s solicitors’ costs for taxation of section 3 of BC 118). Taxation of section 1 of BC 118 (in regard of the plaintiff’s legal costs for the Inquiry) was stayed by an order of court dated 7 November 2006 and does not form part of the subject matter for review here.",
        "Review of section 3 of BC 118": "2   The plaintiff has sought a review of most of the items taxed under section 3 of BC 118. Of significance are 96 items of disbursements, totalling £133,592.20, that were charged to the plaintiff’s supplementary American Express credit card (“Credit Card Disbursements”) given to her by one Norman Frenchman (“Norman”). The Credit Card Disbursements consisted mainly of courier charges of documents, costs of hotel accommodation, miscellaneous business services rendered by the hotels, costs of air travel (to and from Singapore) and excess baggage charges. They were all disallowed by the AR on the basis that the plaintiff had failed to show that the Credit Card Disbursements were her disbursements. The AR held that the plaintiff had only made a bare assertion that she had repaid Norman the Credit Card Disbursements that were charged to him on the supplementary card and that she had tendered no evidence on when she paid for the Credit Card Disbursements and whether she paid for all of them. The AR further added that given the considerable amount of the Credit Card Disbursements, it was very plausible that Norman could have agreed to pay for the plaintiff without her having to return the full sum. 3   After the AR had given her decision on the Credit Card Disbursements on 14 May 2007, Norman filed an affidavit on 11 June 2007 whereby he testified that he had never at any point reached an agreement with the plaintiff that would exonerate her from repaying him the sums incurred by her under the supplementary card. Norman further testified in his affidavit that the plaintiff has so far repaid him all the Credit Card Disbursements save for the sum of £24,962.62 (“the remaining debt”). Norman’s affidavit was, however, not admitted as evidence by the AR at the next taxation hearing on 4 July 2007. The first defendant argued at the hearing that, notwithstanding Norman’s affidavit, no proof of debt had been filed in respect of the claim by Norman in the plaintiff’s Individual Voluntary Arrangement (“IVA”) in UK and both the “Claim” and “Agreed Claim” columns in the plaintiff’s IVA statement reflected “£0.00”. An IVA is a scheme of arrangement made under the UK insolvency law. The AR agreed that the remaining debt was not proved in the plaintiff’s IVA in UK. In the AR’s own words: It [was] only Norman Frenchman’s word in his affidavit, and Plaintiff (in her statement of affairs). There [was] no clear evidence that these were the sums that the Plaintiff was obliged to pay Norman. There [was] also no certainty as to the correctness of the quantum owed. The AR (relying on the authority ofBraga v Braga[1949] SLR 52(“Braga”)) also took the view, in respect of the remaining debt, that liability to repay (in contrast to an expense actually paid out by a party) is insufficient to constitute a proper disbursement that could be recovered under taxation. Thus, the AR declined to change her decision on the Credit Card Disbursements. 4   Before me, the plaintiff argued that the AR was wrong to have rejected Norman’s clear evidence. The plaintiff also sought leave to adduce letters from the plaintiff’s IVA supervisors (leave to adduce such evidence below was denied) so as to explain the significance of the “Claim” and “Agreed Claim” columns in the plaintiff’s IVA statement and to explain that although no proof of debt has been filed by Norman, he is, nevertheless, entitled to make a claim later when there are sufficient funds to enable a distribution to the plaintiff’s creditors. The plaintiff also took issue with the AR’s definition of “disbursement” for the purposes of taxation and argued that “disbursement” is not limited to actual payment or expenditure, but should include a loan or debt. 5   Leaving aside the question of the definition of “disbursement” (which I will deal with later at [10], and, in any event, has no bearing on the Credit Card Disbursements) and considering the evidence before me on the whole, I am of the view that the AR’s order on the Credit Card Disbursements should not be disturbed, and I do not think that granting the plaintiff leave to adduce the letters from the plaintiff’s IVA supervisors will make a difference to this outcome (and accordingly, leave is disallowed). The bottom line remains that Norman has not filed a proof of debt in respect of the remaining debt, and if he was indeed bent on recovering all the Credit Card Disbursements from the plaintiff, he would have done so. Further, there is only a bare assertion from Norman that the plaintiff has so far repaid him £108,629.58 out of the Credit Card Disbursements. He has not exhibited any cheque or evidence in his affidavit to show how the alleged payment of £108,629.58 was made to him and when they were made to him. I find it puzzling how the plaintiff, in the first place, managed to secure funds to repay Norman, given that she is under the IVA regime in UK. It seems more probable than not that Norman was prepared to pay for all the plaintiff’s expenses incurred on the supplementary card, especially since he had allowed her a free hand in chalking up huge expenses on the supplementary card. Given the lack of evidence that the plaintiff had paid for all the Credit Card Disbursements, I would agree with the AR’s decision to disallow these 96 items. 6   Besides the Credit Card Disbursements, the plaintiff, interestingly, also sought to claim the sum of £625.00 (item 110), being the estimated costs for an airplane ticket for travel to Singapore from London on 10 March 2001. The AR disallowed this item as she was of the opinion that the airplane ticket, which was redeemed using “airline miles” was not a disbursement “made” by the plaintiff as it was merely a “hypothetical disbursement”. The plaintiff submitted that the AR was wrong in disallowing item 110 and averred that in previous arguments on the plaintiff’s costs before the Honourable Justice Lai Siu Chiu (“Lai J”), the cost of air miles was held to be a “cost” or “expenditure” borne by the plaintiff and thus allowed there. The plaintiff further submitted that the definition of “disbursement” was wide enough to include item 110. 7   The plaintiff did not produce the relevant court order or notes of evidence to prove Lai J’s decision. However, in principle, I do not see why air miles cannot be a proper disbursement that could be recovered in taxation. There is no reason why a plaintiff who pays for an airplane ticket should be better off (in taxation) than one who decides to redeem an airplane ticket using his or her air miles for whatever reason (be it that he or she was out of funds at the material time or just wanted to save some money). However, during the hearing of the review before me, it transpired that the air miles used to redeem the air ticket, although belonging in name to the plaintiff, were accumulated through the use of the supplementary card given by Norman to the plaintiff. In consequence, I do not think that item 110 should be allowed. 8   In regard of the other items that the plaintiff claimed that should have been allowed by the AR (or should have been allowed in full and not discounted), the plaintiff made mostly bare assertions that these items were wrongly disallowed or discounted. From her grounds of decision, I am of the view that the AR has addressed her mind to all the relevant considerations in deciding to disallow or to discount these items. As such, I see no reason to disturb the AR’s order in respect of these items. 9   In contrast to the plaintiff’s application, the first defendant’s application for review concerns only three aspects of the AR’s decision – the sum of HK$217,132.37 allowed by the AR for the costs of the plaintiff’s Hong Kong solicitors, Robert Wang & Co (items 221-222), the sum of £62,898.56 and S$6,033.85 allowed by the AR for the costs of the plaintiff’s Hong Kong accountant, C J Walton (“Walton”) (items 174-176 and 324-325) and the sum of S$496,995.60 allowed by the AR for the costs of the plaintiff’s Singapore accountants, PricewaterhouseCoopers (“PWC”) (items 389-393). The first defendant argued that the amounts allowed by the AR for these three sets of costs were manifestly excessive. The first defendant also pointed out that in respect of the costs of PWC and Walton, the plaintiff has so far only paid PWC a total sum of S$278,015.76 and Walton a total sum of £8,350.00 and S$2,380.85 out of the respective total bills. Thus, the plaintiff should, at most, only recover the actual sums that she has paid out. 10  In regard of the first defendant’s latter contention above, there would be a need to decide if disbursements that are not actually paid out, but are due as outstanding debts, can be recovered as costs. The first defendant relied on O 50 r 24 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) which prescribes the form that bills of costs should take and states that a bill of costs must set out three separate sections, including one section for “all disbursementsmadein the cause or matter” (O 59 r 24(1)(c)). The first defendant submitted that O 59 r 24(1)(c) clearly provides that only “disbursementsmadein the cause or matter” can be claimed in taxation. The first defendant also placed reliance on the case ofBraga([3]supra) where Gordon Smith J held the following (in the context of the then O 62 r 40 of the Rules of Court which provided that “[t]he Registrar shall require vouchers for all disbursements over ten dollars”): It is equally clear that it would be contrary to all precepts of taxation and also contrary to public policy to allow on taxation disbursements which havenot been madeand are not vouched. I can understand an adjournment for production of a receipt when the disbursement has already been made or even an allowance subject to the production of the receipt, provided such is in existence at the time and such receipt has merely been overlooked or mislaid. [emphasis added] Order 59 r 24(1)(c) and the above passage fromBragaonly require disbursements to be “made” before they can be claimed in taxation, but do not go as far as to define what “disbursement” is and whether the word includes an outstanding debt incurred by a party. If “disbursement” is wide enough to include an outstanding debt that is payable, then such debt actually incurred by a successful litigant can be said to be a disbursement that has been “made”. Thus, the question is whether “disbursement” can include an outstanding debt. Counsel for both parties agreed that there is no statutory definition of “disbursement” (O 57 r 1(1) merely provides that ““costs” includes fees, charges,disbursements, expenses and remunerations”) and it appears that no local case has construed “disbursement” for the purposes of taxation. As such, both counsel cited numerous dictionary definitions of “disbursement” in support of their contentions. It seems to me, based on these definitions, that the word “disbursement” has a rather wide meaning. The meaning of “disbursement” was examined by the Untied States Court of Appeal for the Eleventh Circuit inCash Cow v US Trustee296 F.3d 1261, which is a case cited by the plaintiff. In that case, the court was trying to construe the meaning of “disbursement” under 28 U.S.C. § 1930(a)(6). In doing so, the court discussed the meaning of “disbursement” in general, and the comments of the court in this regard are helpful; the court, after considering nine dictionaries and their definitions of “disbursement” took the view that the word “disbursement” was wide enough to include loans (at 1263-1264): Given the way that the word \"disbursement\" has been used in the caselaw, and that the caselaw in a variety of jurisdictions interprets \"disbursement\" broadly in various contexts, we follow our precedent in In re Jamko, 240 F.3d 1312 (11th Cir. 2001) and hold that the plain meaning of \"disbursement\" and the plain meaning of28 U.S.C. § 1930(a)(6)as applied in this case require Cash Cow to pay the Trustee its required quarterly fees on the consumer loans made by Cash Cow to its customers, as well as Cash Cow's other disbursements, payments, or capital which flowed from the bankruptcy estate. This Court has examined nine dictionaries and their definitions of \"disburse\" and \"disbursement.\" Oxford English Dictionary (2d Ed. 1991); Merriam-Webster's Collegiate Dictionary (10th Ed. 1993); New Shorter Oxford English Dictionary on Historical Principles (1993); Random House Unabridged Dictionary (2d Ed. 1993); Webster's Third New International Dictionary of The English Language, Unabridged (1993); Webster's New World College Dictionary (3d. Ed. 1997); Random House Webster's College Dictionary (1997); Oxford American Dictionary and Language Guide (1999); Black's Law Dictionary (7th Ed. 1999). The general consensus is that a \"disbursement\" is defined as either (a) the action or fact of disbursing, or (b) that which has been disbursed, money or funds paid out, or expenditure. To \"disburse\" means (a) to pay out or expend money; (b) to pay or defray costs, expenses, or charges; (c) to distribute; or (d) to pay for or on account of some thing. These definitions do not restrict the meaning to a payment or an expenditure. Contrary to the argument that a \"loan does not fall within the common and ordinary meaning of the term 'disbursement,'\" Webster's Third New International Dictionary of the English Language, Unabridged uses this as an example of the use of the word: \"disbursement of the loan has been completed.\" 11  For purposes of taxation, the general rule should be that disbursements claimed should beexpenses thathave been paid. However, I am of the view that the word “disbursement” is wide enough to also include loans or debts properly incurred by a party for the purposes of litigation, provided that it is proven that these loans or debts are due and payable and would be paid after taxation. Evidence such as invoices or bills must be tendered to prove this to the court’s satisfaction, before these loans or debts can be recovered as disbursements in taxation. Such a construction of “disbursement” is sensible, for if the word is limited strictly to only actual expenses paid out by a party, a poor but successful litigant might be denied recovery of what should be his or her rightful amount of costs. Accordingly, the plaintiff should not be prevented from recovering more than the sums that she had actually paid out to PWC and Walton. Nevertheless, it should be reiterated that the general rule is that disbursements claimed should be expenses actually incurred and paid out, unless there are reasons for not paying them before taxation. 12  It remains to be considered if the three sets of costs allowed by the AR were manifestly excessive. In respect of the sum awarded for PWC’s costs (which is the crux of the first Defendant’s application given its amount), the AR had first deducted S$112,540.50 (for work which had no connection with the Inquiry) from the total bill of PWC to arrive at a figure of S$709,993.72, before applying a global discount of 30% to obtain a final sum of S$469,995.60. The first defendant pointed out that the AR had failed,inter alia, to adequately take into account the fact that the plaintiff had commenced an action against PWC for negligence in which she is claiming substantial damages. This alone, in my opinion, cannot be a reason for reducing the amount awarded for PWC’s costs. Damages recovered from PWC (if the suit against PWC is successful) is to compensate the plaintiff for her losses incurred as a result of PWC’s breach of duty of care and is not the same as costs recovered by the plaintiff in respect of PWC’s costs. It cannot be that the plaintiff should be worse off in taxation because she has chosen to commence a suit against PWC for negligence. However, it appears that the plaintiff has, to date, only paid PWC the sum of S$278,015.76 because she alleges that the bill rendered by PWC is unreasonable, given that part of the work it did for the Inquiry turned out to be irrelevant and, consequently, PWC, in her view, was negligent. Yet, at the same time, the plaintiff submitted the full bill of PWC for taxation, alleging that such costs were reasonably incurred for the Inquiry. It thus appears that the plaintiff has somewhat taken a contradictory stance. Nonetheless, I am of the view that the plaintiff’s position in the suit against PWC and the plausible outcome in that suit should have no bearing on the present taxation, which concerns costs of the Inquiry inanothersuit,ie, OS 939. 13  I am also of the view that the sum of S$469,995.60 awarded by the AR is fair and reasonable in the circumstances. As mentioned, the AR had first deducted a sum of S$112,540.50 (for work which had no connection with the Inquiry) from the total bill of PWC before applying a global discount of 30%. The initial deduction of a lump sum of S$112,540.50 and the subsequent discount of 30% have adequately accounted for the fact that some parts of the report were irrelevant and the fact that PWC had misapprehended the scope of the Inquiry and had proceeded on the wrong and additional basis of wilful default in its report (instead of just a simple common inquiry as ordered by Chao Hick Tin J in OS 939). These factors, together with the excessive time and personnel used by PWC, were all considered by the AR before she concluded that a broad brush approach was to be adopted and a discount of 30% was to be applied here. Accordingly, I am not inclined to vary the sum awarded by the AR for PWC’s costs. 14  As for the amounts awarded for the costs of Walton and Robert Wang & Co, I find no reason to interfere with the AR’s decision as she has applied her mind to all the circumstances of the case in arriving at the sums. Accordingly, the costs awarded for these two set of costs will also not be varied.",
        "Review of section 2 of BC 118": "15  In respect of the review of section 2 of BC 118 for the plaintiff’s solicitors’ costs (claimed at S$100,000) for work done in the taxation of section 3 of BC 118, the AR was of the view that the taxation hearing here did not warrant having two solicitors, but, nonetheless, took into account the fact that “[t]here was more work to be done by one solicitor” in the present case in arriving at her decision to award a sum of S$50,000. I see no reason to disturb the AR’s decision in these circumstances.",
        "Conclusion": "15    In conclusion, I affirm the AR’s decision below."
    }
}