{
    "case_title": "Chow Kwok Ching v Chow Kwok Chi and Others and Other Suits",
    "ncitation": "[2008] SGHC 100",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       In these three consolidated suits (“oppression actions”), the plaintiff, Chow Kwok Ching, seeks relief under s 216 of the Companies Act (Cap 50, Rev Ed 2006) (“the Act”) in respect of three companies in which he is a shareholder and director namely, Chow Cho Poon Pte Ltd (“CCPL”), Associated Development Pte Ltd (“ADPL”) and Lee Tung Company (Pte) Ltd (“Lee Tung”) (and together “the companies”). The other defendants in these oppression actions are the plaintiff’s elder brothers, Chow Kwok Chi (“Chi”) and Chow Kwok Chuen (“Chuen”). They are both also shareholders and directors of all the companies and the plaintiff’s complaint is that they have conducted the affairs of the companies in a manner which oppresses him or disregards his interests and have also procured acts of the companies which unfairly discriminate against him. 2       The reliefs sought by the plaintiff are as follows: (a)    an order that Chi and Chuen purchase all of the shares in the companies held by the plaintiff including all shares which he is beneficially entitled to as a beneficiary of: (i)     the estate of Chow Cho Poon, deceased (“the Estate”); (ii)   the estate of Grace Chow, deceased at a fair value to be determined by a firm of accountants to be appointed by the court; or (b)    alternatively, an order that the three companies be wound up pursuant to s 216(2)(f) of the Act. Since the companies are only nominal defendants in the oppression actions references in this judgment to “the defendants” should be read as references to Chi and Chuen only unless otherwise stated. 3       These actions were started in mid 2005. They were not ready for trial until early 2007. At the end of April 2007, Chi filed applications to wind up the companies on the ground that it would be just and equitable for the court to make such an order. The winding up applications were heard in July 2007 before the hearing of the oppression actions started. I heard both sets of cases. In November 2007, I delivered judgment in the winding up applications ([2007] SGHC 197]) and ordered that all three companies be wound up. That decision has been appealed against and the Court of Appeal has reserved its judgment on the appeal. As things stand, therefore, the companies have been wound up and it would not be possible for me, if I find in favour of the plaintiff, to grant him either of the reliefs sought until the decision of the Court of Appeal is known, and then only if the winding up orders are set-aside. I do, however, still have to decide the issues raised in these actions as such decision would determine, at the least, which party would be entitled to the costs of the proceedings.",
        "Background": "4       The plaintiff’s father, Chow Cho Poon (“Mr Chow”) set up CCPL in 1962, Lee Tung in 1969 and ADPL in 1976. He and his wife, Grace Chow (“Mrs Chow”), ran the companies until they died. Their three sons had very little to do with the companies whilst Mr and Mrs Chow were alive. The companies were incorporated in Singapore and carried on business here. The three sons, however, lived and worked in Hong Kong most, if not all, of their adult lives. The eldest son, Chi, and the youngest son, the plaintiff, are practising ophthalmologists whilst the middle son, Chuen, is an architect and developer. 5       All the companies are in the business of holding real property for investment. The various properties are rented out and the bulk of the companies’ revenue comes from rental collections. The most valuable single property is Chow House at 140 Robinson Road which is a multi-storied office building owned by ADPL. In January 2005, a firm of valuers provided a desktop valuation of the immovable assets owned by each of the companies. It was estimated that CCPL’s properties were worth $11.1m whilst Lee Tung’s were worth $17.3m and Chow House was worth $30.5m. No more recent valuation has been carried out but, as is well-known, property prices in Singapore have risen quite substantially since early 2005. The combined value of the companies is therefore likely to be very substantial. 6       Mr Chow died on 3 August 1997. According to his will, save for a small legacy in favour of his daughter, the Estate was to be distributed amongst his widow and three sons. Whilst each of the others received a 2/7thshare in the Estate, Chuen received only 1/7th. Initially, the executors of the Estate were Mrs Chow and Mr Dennis Lee Kim Yew (“Dennis Lee”). They were succeeded by the three brothers but the latter were unable to make any headway in administering the Estate due to their inability to agree on the steps that needed to be taken. As a result of this stalemate, the plaintiff applied for an independent party to be appointed to administer the Estate in place of the three brothers and, on 5 October 2005, the court appointed Gerald Loong Sie Kiong (“the Administrator”) as the independent administrator of the same. 7       The plaintiff and his brothers received shares in the companies as gifts from their father. The other shareholders of the companies are the estates of Mr and Mrs Chow. The breakdown of the shareholdings in each company is as follows:  CCPL:NameNo of shares%(1) Ching5,21521.29(2) Chi5,71223.31(3) Chuen6,20225.31(4) The Estate7,28729.74(5) Mrs Chow’s estate840.34Total24,50099.9ADPL:NameNo of shares%(1) Ching750,00016.66(2) Chi750,00016.66(3) Chuen750,00016.66(4) The Estate1,500,00133.33(5) Mrs Chow’s estate750,00116.67Total4,500,00299.98Lee Tung:NameNo of shares%(1) Ching70.17(2) Chi2476.17(3) Chuen671.67(4) The Estate1,53038.25(5) Mrs Chow’s estate1,149 ordinary shares53.721,000 preference sharesTotal4,00099.98 8       Mrs Chow died on 1 December 2002. Prior to her death, she had made a deed of trust whereby she gave her assets to her children. Each of her sons received 30% of her assets whilst her daughter was given ten percentthereof. By the time of her death, each of the sons had been a director of the companies for some years. They had, however, not taken the lead in managing the companies having left that task to their mother. It might be more accurate to state that it was Mrs Chow who continued to manage the companies and did not cede much power to her sons. Be that as it may, it was only on her death that the plaintiff and his brothers became the main parties responsible for the management of the companies and had to take steps to run them. They soon found themselves at odds. It is the events relating to the management of the companies that occurred after 2002 that gave rise to these oppression actions. 9       As the brothers intended to continue to live and work in Hong Kong, they had to appoint local staff to manage the day-to-day affairs of the companies. In early December 2002, after an interview in which all three brothers participated, they appointed one Ms Jeslyn Goh Kwee Moi, (“Jeslyn Goh”) to be the company manager of Lee Tung. Although Jeslyn Goh was employed by Lee Tung, she was told during the interview that her job scope would include managing CCPL and ADPL as well. Jeslyn Goh was told that she would be in charge of the day-to-day administrative and operational matters of all three companies in the absence of the directors, although major decisions would be made by them at board or general meetings. 10     In March 2003, one Ms Sng Chor Heah was appointed as the company secretary of all the companies. Then, in August 2003, a company called Astute Consultants Pte Ltd (“Astute”) was engaged by the companies to provide them with accounting services. The owner and manager of Astute is one Winston Loong Sie Yoke (“Winston Loong”). He is a chartered certified accountant, a chartered secretary and a chartered financial consultant. Winston Loong was, until 1989, a senior partner of Messrs Chan Kum Chee & Co which had been the auditor of the companies since their incorporation. When he left Chan Kum Chee & Co, he set up Astute and another business, Messrs Winston Loong & Co. The latter firm was in the business of providing corporate and secretarial services to corporations. Ms Sng Chor Heah resigned her position on 12 January 2004. On 16 January 2004, Winston Loong was appointed the new company secretary for the three companies and Messrs Winston Loong & Co were engaged to provide the necessary corporate services. It must be noted that Winston Loong and Chuen had known each other since they were in primary school. After Winston Loong’s appointment, he became very active in the affairs of the companies. One of the plaintiff’s major complaints relates to the way that he alleges Jeslyn Goh and Winston Loong behaved towards him when he was dealing with them in connection with the affairs of the companies.",
        "The complaints": "11     In his closing submissions, the plaintiff summarised his complaints as follows: (a)Transfer of CCPL shares That Chi and Chuen transferred shares belonging to Mr Chow’s estate to themselves only and not to all three brothers; (b)Unauthorised Directors’ “Loans” That Chi and Chuen misappropriated company funds for their personal use; (c)Dividends and Directors’ Fees That Chi and Chuen refused to pay out dividends and instead declared high directors’ fees; (d)Exclusion from Management That Chi and Chuen excluded the plaintiff from the management of the companies. (e)Payment to third parties That Chi and Chuen wrongfully caused payment of moneys belonging to the companies to be made to third parties; (f)Rent free concession to Astute That Chuen gave Astute a 4-month rent-free period; and (g)Replacement cheques That Chi and Chuen delayed for several months the issuance of replacement cheques to the plaintiff. 12     It should be noted that not all the complaints relate to all the companies. The parties, however, have not allocated specific complaints to specific companies. Nor have the defendants argued that the individual companies should be treated differently on the basis that some of the complaints do not apply to them. The parties have been content to approach the complaints and their responses thereto in the round. I will, therefore, deal with the complaints in the same way and if I find them, or some of them, to be justified, I will apply those findings to all three companies. 13     The various complaints made by the plaintiff have been rejected by the defendants on two bases. The first is that factually, they are either misconceived or inaccurate or not justified. The second is that, to the extent that they may be accurate, they do not support an allegation of oppression. 14     These oppression actions were first filed in January 2005. The first version of each Statement of Claim was filed on 20 May 2005. This pleading was amended three times thereafterviz, on 10 March 2006, 15 August 2006 and, finally, on 27 July 2007, during the course of the hearing. The plaintiff had ample opportunity to consider how to frame his complaints and to determine what exactly it was in the conduct of the defendants or their affairs that had oppressed him and he was given three opportunities to reframe his case. Accordingly, whether or not the plaintiff has succeeded in establishing his case must be determined strictly with reference to his pleadings. It would not be fair to the first and second defendants to find that they acted oppressively in relation to matters that were not pleaded and that therefore they did not have a chance to answer. It is also relevant in connection with this matter of fairness that the documentation was voluminous and the matters that the defendants had to deal with spanned a number of years, falling both before and after the commencement of the proceedings.",
        "Transfer of CCPL shares": "15     The factual background to this complaint is as follows. During his lifetime, Mr Chow had taken various loans from the companies. After his death, the then executors of the Estate, Mrs Chow and Dennis Lee, had filed an estate duty affidavit confirming the amount of indebtedness to be $23,121,224.60. This indebtedness increased thereafter as the companies made new loans to the Estate for various purposes including payment of estate duty. By 31 May 2005, the books of the companies recorded that the Estate owed the companies approximately $34m. The Estate did not have sufficient liquid assets to repay these debts and the companies were therefore unable to recover the same. The administration of the Estate could not be completed as the debts were outstanding and no distribution of its assets could take place until this issue had been resolved. 16     According to the respective articles, each company has a first and paramount lien upon all the shares registered in the name of a member for his debts and other liabilities to the company. The articles also give the directors power to enforce such lien by selling the shares and appointing some person to execute an instrument of transfer of the shares so sold. In September 2004, Winston Loong wrote to the three Chow brothers who were then the trustees of the Estate, to advise them on how the liabilities of that estate could be settled. He put forward six possible options. Of these, his recommendation was that the companies carry out a selective share purchase from the executors of the Estate and set off the purchase price of the shares against the Estate’s debts to the companies. Mr Loong testified that he considered this a viable solution to the debt issue as it was relatively straightforward. It would not involve any outlay of cash by any party, save for professional fees. The companies’ cash reserves would also be preserved for their needs. 17     Chi and Chuen agreed to the proposal. On their instructions, Mr Loong instructed Knight Frank Pte Ltd (“Knight Frank”) to conduct a desktop valuation of the properties held by the three companies. The following steps were then taken to put the proposal into effect: (a)    on 5 July 2005, letters were issued to the Estate demanding that the debts due and owing to it by the companies be repaid within 14 days. The letters of demand were sent to the three brothers as the trustees of the Estate, to the registered address of the Estate and to M/s Lee & Lee, the Estate’s solicitors; (b)    pursuant to notices issued on 7 and 12 July 2005, board meetings of the companies were held on 20 July 2005. As the debts had not been repaid, resolutions were passed at these meetings for Mr Loong to take all necessary steps to recover the debts and to be assisted in this by the law firm of Madhavan Partnership (“M/s MP”); (c)    on 22 July 2005, the companies sent letters to the Estate to notify it that the companies would be exercising their rights of lien as prescribed under the various articles of association; (d)    on 21 September 2005, pursuant to notices issued on 13 September 2005, board meetings were held at which resolutions were passed authorising the directors to: (i)     adopt the share valuation reports of 30 August 2005 stating the values of the shares of the companies, issued by KPMG Corporate Finance Pte Ltd (“KPMG”); (ii)   offer for sale to the existing shareholders of each company the shares of the Estate held by each company as lien holder at the share prices determined by KPMG; (iii)  offer for sale to the respective companies the shares left over should any of the existing shareholders fail to take up their allotment of the Estate shares, and then to register such shares under the joint names of Chi and Chuen acting as trustees on the purchasing companies’ behalves; (e)    on 21 September 2005, the companies sent letters to all the shareholders offering them the Estate’s shares. None of the shareholders accepted the offers; (f)     pursuant to notices issued on 31 October 2005, board meetings of the companies were held on 7 November and resolutions were passed whereby the shares of the Estate in each company were to be transferred into the names of Chi and Chuen to be held by them on trust for the purchasing company or companies; (g)    Chi and Chuen signed various declarations of trust dated 28 September 2005 and 21 October 2005 in respect of the shares that they would be holding on behalf of the companies; and (h)    the transfers of the shares were effected some time in November 2005. 18     The plaintiff’s pleaded complaint in relation to the above transactions was contained in a sub-paragraph of para 23 of the Statement of Claim Amendment No. 3 in each of the actions. In para 23 itself, the plaintiff had pleaded that the first and second defendants had been conducting the affairs of the companies in disregard of his interest and/or in a manner that unfairly discriminated against him. In sub-para d of the pleading in Suit 70 of 2005 which concerned CCPL he averred: The First Defendant with the support of the Second Defendant in purported exercise of a lien and sale of the shares of the Estate of Chow Cho Poon, deceased in the Chow Family Companies in September 2005: (1)    reduced the shares of the Estate of Chow Cho Poon deceased in the Company from 7,287 shares (in which the Plaintiff is entitled to 2/7thi.e. 2082 shares) to 2,978 shares; and (2)    increased his shares in the Companies from 5,712 shares to 10,021 shares. Paragraph 23d of Suits 71 of 2005 and 72 of 2005 were inpari materiawith the paragraph cited above except that of course the numbers of shares mentioned were different. 19     In his closing submissions, however, the complaints that the plaintiff made in relation to the exercise of the lien and sale of the shares were considerably wider than simply dissatisfaction with the increase in Chi’s shareholding. He complained that: (a)    Chi and Chuen had started the process some time in December 2004 without his knowledge. The plaintiff only learnt what they were up to on 13 September 2005 when he received notice of a directors’ meeting held to pass resolutions to authorise the sale of the shares to the respective companies; (b)    the instructions given to Knight Frank Pte Ltd and KPMG to carry out their respective tasks were given without the plaintiff’s knowledge; (c)    his brothers had disregarded his protests over the transfers of the shares which he had made in letters dated 20 September 2005, 7 October 2005, 21 October 2005 and 5 November 2005; (d)    Chi had left it to Winston Loong to handle the plaintiff and had taken Winston Loong’s advice that the shares should be transferred into the names of Chi and Chuen; (e)    his brothers and Winston Loong had ignored the plaintiff’s requests to be added as a joint shareholder; (f)     his brothers had ignored MP’s advice that an application should be made to court for determination as to the validity of the share buy-back scheme; (g)    his brothers had signed the transfer forms on behalf of the Estate despite the fact that they were not the personal representatives of the estate at the time in view of the appointment of the Administrator and had disregarded the request of the Estate to stay their hands on the matter; (h)    the transfer was eventually set aside on 27 October 2006 on an application made by the Administrator and, as a result, there was a significant amount of wasted expense (stamp fees incurred on the transfers amounted to $63,700 and professional fees and expenses paid to Winston Loong amounted to $48,000); (i)     the plaintiff suffered a loss in voting power and became unable to prevent the passing of special resolutions; and (j)     his brothers had not as yet given effect to the court order that the share transfers should be reversed. As far as the complaint numbered (g) is concerned, in my view as this complaint relates to actions of Chi and Chuen which they effected as purported trustees of the Estate, it cannot be regarded as a complaint of oppression in their capacity as directors of the companies. Accordingly, I will disregard that complaint for present purposes. I note too that the evidence was that the transfer forms were signed before the appointment of the Administrator although they bore dates subsequent to that appointment. 20     The plaintiff accepted that in order to establish oppression, he must, in the words of Lord Wilberforce inRe Kong Thai Sawmill (Miri) Sdn Bhd[1978] 2 MLJ 227(“Kong Thai Sawmill”), show that there has been a visible departure from the standards of fair dealing and a violation of the conditions of fair play which a shareholder is entitled to expect. He pointed out that in two subsequent cases, factual situations in which the majority shareholders had taken action to reduce the minority shareholder’s shareholding in the respective companies, had been found by the court to be unfairly prejudicial to the interest of the minority shareholder. These situations applied here. The plaintiff submitted that there had been in this case a visible departure from the standards of fair dealing by Chi and Chuen in relation to the transfers of the shares. There had also been ample evidence that they were aware of the plaintiff’s interest and had made an evident decision to override that interest or brush it aside. Whilst Chi and Chuen had claimed that the shares in the companies were not meant for themselves personally, they had effected the transfers despite the plaintiff’s objections. Why had they done so? The obvious answer was that they wanted to increase their voting powers at the expense of the plaintiff. The plaintiff also asserted that Chuen had his own particular motive for this move. He had inherited only 1/7thof the Estate whilst Chi and the plaintiff had each inherited 2/7thsof the Estate. The plaintiff emphasised that Chi had testified that Chuen was the only son who may have stood to benefit from the enforcement of the lien because having received a smaller share in the Estate, he had a real interest in reducing the size of the Estate and in increasing the value of the companies. 21     Chi and Chuen asserted in response that they had made a legitimate and justifiable decision on behalf of the companies to exercise their respective liens over the shares held by the Estate. They also submitted that the plaintiff’s protests were legitimately disregarded and that he had not been prejudiced as a result. Their decision to recover the debts due from the Estate was not, they said, a visible departure from the standards of fair dealing and was not burdensome, harsh or wrongful. 22     For his own part, Chi submitted that the driving forces behind the implementation of the share buy-back scheme were Winston Loong and Chuen. Chuen had strongly supported Winston Loong’s proposal made in September 2004 and Chi had simply gone along with the advice. Chi’s primary intention was to utilise Winston Loong’s skills and expertise in order to find a way of repaying the debts of the Estate to the companies so that the estate could be administered. He decided that supporting the exercise of the lien would serve two purposes. First, it would unlock the Estate. Secondly, as far as the companies were concerned, since the debts were substantial there was clearly a fiduciary duty on the directors to act in the best interests of the companies by recovering them. Therefore, supporting the scheme was a fulfilment of Chi’s fiduciary duties to the companies. He had nothing to gain personally from seeking to enforce the debts of the Estate in this way. Of the three brothers, only Chuen stood to gain more by the enforcement. Nevertheless, Chi supported the exercise of the lien as there was reason to believe that the debts were recoverable. 23     The essential plank of Chuen’s submission was that there could be no question of prejudice to the plaintiff in his capacity as a shareholder by reason of the transfer of the shares belonging to the Estate because: (a)    the recovery of the Estate’s debts was clearly in the best interests of the companies; (b)    the shares subject to the liens were offered for sale to all shareholders (including the plaintiff) first before the shares were sold and/or transferred to the companies; and (c)    the appropriate resolutions were passed at each and every stage. 24     There are various aspects of the complaint to be dealt with. First, there was the allegation that the process was started in December 2004 without the plaintiff’s knowledge and that he only found out about what his brothers were up to in September 2005. I accept the submission made for the defendants that the complaint that the plaintiff only knew what was being done in September 2005 is unfounded. Prior to that date, there were several communications involving the plaintiff on the matter of debts of the Estate and the possibility of repayment of such debts by way of exercise of the lien. On 18 March 2004, Winston Loong had written to the plaintiff highlighting the provisions in the companies’ articles of association granting the companies a first and paramount lien over the shares. Then, Winston Loong’s letter (sent in September 2004) indicating that the sale of the shares was a possible method of resolving the liabilities of the Estate was a letter that was sent to all three brothers. Next, there was a board meeting of ADPL on 5 October 2004 attended by all three brothers at which the matter of recovering the debts was discussed and Chi had noted that the debts were secured against the shares. The plaintiff also received the notices of the board meeting held on 20 July 2005 in respect of the resolutions to be passed authorising Winston Loong to take all necessary steps for the companies to recover the debts. In his capacity as trustee of the Estate, he had also been sent the letters from the companies (dated 22 July 2005 and signed by Winston Loong as company secretary) by which the companies notified the Estate that as it had not responded to their demands for repayment of the outstanding debts, they would proceed to enforce their right of lien by sale under the articles of association within the next seven days. He would have been aware therefore that this method of recovering the debts was being adopted even before he received the notices of board meetings dated 13 September 2005 notifying him that the meetings were being called to discuss and approve the exercise of the lien. 25     The defendants do not dispute the assertion that Knight Frank’s appointment in December 2004 was made without the plaintiff’s knowledge or concurrence. Neither do they dispute that the same applies to the instructions given to KPMG in August 2005 to prepare a share valuation report. In my view, however, these were matters of detail which had to be undertaken in order to give effect to the proposal to exercise the companies’ lien over the shares and as long as the plaintiff was kept abreast of the main steps that were being taken for this purpose, it was not fatal that he was not consulted on all the details. 26     A major point that has to be determined in regard to this complaint is whether it was in the best interest of the companies to exercise the lien over the shares of the Estate. The defendants submitted that bearing in mind the substantial amount of the debts and the long period for which the same had been outstanding, it was clearly in the best interests of both the companies as creditors and the Estate as debtor for the debts to be repaid as soon as possible. I agree that it was in the companies’ best interest to procure repayment of the outstanding indebtedness. Although the companies had been accumulating the debts for some time this could not go on indefinitely. In addition, while the Estate and Mrs Chow’s estate remained unadministered, the companies were continuing to lend funds to both estates for the purpose of maintaining their assets in good condition. This drain on the finances of the companies would only cease when the administration of both estates was completed and this latter event could not take place until, for one reason or another, there was no longer any extant indebtedness. 27     In his Statement of Claim, the exact complaint pleaded by the plaintiff in relation to the exercise of the lien was that Chi “with the support of” Chuen, had exercised the companies’ liens over the shares of the Estate and this had reduced the Estate’s shares while increasing Chi’s shares in the companies. Looking at the pleading alone, therefore, it would seem that the plaintiff’s unhappiness arose from the very fact of the exercise of the lien (regardless of which shareholders had thereafter held the transfer shares on trust and for and on behalf of the companies). The plaintiff did not plead that the transfer of the shares of the Estate to Chi and Chuen jointly (instead of to the three brothers jointly) was an act of oppression. In his submissions, however, the crux of his complaint was that he had not been afforded the opportunity to hold the shares jointly with his brothers on trust for the companies. He took the position that he had been prejudiced by this transfer because his voting power in the companies had been severely affected as a result of the additional shares that Chi and Chuen held. 28     In relation to the pleaded complaint, during cross-examination, although the plaintiff persisted in taking the position that Chi and Chuen should have made an application to court to be allowed to exercise the lien, he conceded that the companies had a right to sell the Estate’s shares under their respective articles of association. He also admitted that he had no objections to the companies exercising their rights of lien over those shares: Q: Is it your position that you object to this whole exercise being done? A: No, I don’t object, but I hope to – that the company – for the benefit of the company, they should have considered carefully, because they – there is a conflict of interest and [MP] has instructed them to apply to the court for a court ruling. In court he also confirmed that he had no objections in principle to buying the shares in his capacity as a shareholder. He had written a letter (dated 21 October 2005) in which he had stated “I wish to put on record that I am prepared to accept the offer but it is subject to my receiving a complete and satisfactory response to my above concerns”. When questioned about this letter, the plaintiff agreed that what he wanted was for the auditor to certify the value of the shares and if that had been done, he would have been prepared to buy the shares at that value. He was then asked whether it was correct that he really did not have any objection in principle to the exercise of the lien to recover the debt and his response was “I have no objection in principle to buying the shares in the capacity of a shareholder”. In view of this evidence, it is clear that it was not the exercise of the lienper sethat the plaintiff objected to or the natural consequence that the number of shares of the Estate in the companies was reduced. In the circumstances, no argument can be accepted that the exercise of the lien by itself was an act of oppression. 29     That does not conclude this issue. There was also the pleaded allegation that Chi had by the exercise of the lien increased his shares in the companies. In addition, in his submissions, the plaintiff asserted that Chuen had a “real interest” in reducing the size of the Estate and stood to benefit most from the transfer of shares from the Estate to the companies as he received only 1/7thshare of the Estate. In response to Chuen’s argument that this is an unpleaded point and cannot be raised, the plaintiff argued that Chuen was being unnecessarily pedantic. By the exercise of the lien, not only Chi but also Chuen increased their shares in the companies and Chuen was therefore trying to hide behind legal formalism in order to avoid liability. I do not accept this argument. If the plaintiff had pleaded that Chuen had had an ulterior motive for supporting the exercise of the lien, Chuen would have been able to ask him for particulars of that allegation and would have been able to respond to it. The allegation could then have also been dealt with in Chuen’s affidavit of evidence-in-chief. As this allegation was not pleaded, I do not think it is correct for it to have been the basis of a submission. 30     In any case, I agree with the defendants that there was no increase in the shares held by Chi and Chuen personally in the companies by reason of the exercise of the lien. Documentation executed by them as well as board resolutions of the three companies made it clear that they were holding those shares on trust for the purchasing companies because the articles of association of the companies provided that shares therein could not be held by other corporations. They had been advised by Winston Loong that this prohibition did not preclude the transfer of the shares to them to hold on trust for the companies. Their respective beneficial interests in the companies did not increase by reason of the exercise of the lien nor did they derive any personal benefit from holding the shares. It should be noted that the first and second defendants did not exercise any voting powers in respect of the additional shares after the sales had been completed. Instead, at meetings held thereafter, they voted their original shareholdings only. 31     The argument that Chuen stood to benefit most from the steps taken to recover the Estate’s debts, since the size of the Estate would be reduced while Chuen’s shares in the companies would be enlarged, does not stand up to scrutiny. As submitted by Chuen, that argument is premised on the fallacious assumption that the recovery of the debts by the companies would result in a reduction in the net value of the Estate. The assumption ignores the Estate’s obligation to pay its debts and thus, that a calculation of the Estate’s net value would have to take into account the liabilities of the same (including the debts owing to the companies). The repayment of the debts to the companies therefore would simply reflect the true net worth of the Estate and would not alter the beneficiaries’ relative entitlements under the Estate or otherwise reduce the net worth of the Estate. Furthermore, the beneficiaries’ entitlement to a distribution of the assets held by the Estate is subject to repayment of such debts. Accordingly, there can be no issue of any unfair prejudice to the plaintiff or unfair benefit to Chuen or Chi for that matter as a result of the exercise of the lien to recover the debts. In any case, any alleged reduction in the net value of the Estate would not constitute unfair prejudice to the plaintiff in his capacity as a shareholder of the companies. 32     Another complaint of prejudice related to the wastage of the stamp fees and professional fees incurred by the companies in relation to the exercise of the lien and share transfers. The plaintiff said that these amounts were wasted as the share transfers were set aside by way of an order of court dated 27 October 2006 made in OS 729 of 2004 (“OS 729”). This complaint was, again, unpleaded. It should have been pleaded. I will not deal with it except to note three things: (a)    when the setting-aside order was made, it was also ordered that the issue of such fees and costs were to be reserved to the judge hearing OS 729. At that stage it would be decided who should bear these costs and until it is ordered that the companies are to bear the same, it is premature to describe such fees and costs as having been wasted; (b)    the existence and quantum of the debts are now the subject of separate proceedings instituted by the companies (these being derivative actions started by Chuen with the consent of the court) against the Estate and these actions should result in the authoritative determination of those points. The extent to which the companies succeed in their claims would also have an impact on who should pay for the “wasted costs”; and (c)    the plaintiff’s assertion that he had repeatedly protested against the transfer of the shares and since Chi and Chuen had disregarded these protests, they should be responsible for the wasted costs of the exercise was somewhat disingenuous in that the letters that the plaintiff referred to which contained his earlier objections to the transfers show that his main grievance was that the transfers were to be in favour of Chi and Chuen alone and he himself was not to be made a joint transferee. 33     The plaintiff also complained that his brothers had ignored MP’s advice that an application should be made to court for a determination as to the validity of the share buy-back scheme. In July 2005, MP wrote to Winston Loong stating, among other things that as senior counsel had already given an opinion on 30 June 2005 that there was a debt owing from the Estate to the companies, an application should be made to “Court for a declaration and/or determination of your proposal that the three companies buy back their shares from the Estate … in order to meet the payment of the debt of the deceased. This will help resolve the dispute between the litigants [iethe parties to these oppression actions] on the issue of whether a debt is owing by the Estate to the three companies”. This is another unpleaded allegation. If it had been pleaded, Chi and Chuen could have given evidence as to what had prompted them not to follow the suggestion made by MP and I would have been able to determine the validity of their reasons for so acting. As it was, neither of them gave evidence on this point in their affidavits of evidence-in-chief. It would not be right to criticise them on the basis of a ground on which they were not attacked in the pleadings. 34     Three of the plaintiff’s sub-complaints were connected. These were that his requests to be added as a joint shareholder were ignored, that Chi had left it to Winston Loong to handle the plaintiff and had taken the latter’s advice that the shares should be transferred into the names of Chi and Chuen alone and, that he had suffered a loss in voting power and had become unable to prevent the passing of special resolutions. None of these complaints were expressly pleaded but I think that the complaint that the plaintiff should have been made a joint holder of the shares bought by the companies is implicit in para 23d and I will therefore deal with it. In dealing with it, I am not holding that it was wrong for the first and second defendants to implement the scheme to enforce the companies’ liens. I think that they acted in good faith in doing so and in exercise of their duties to have primary regard for the interests of the companies. That in itself, however, does not mean that the way in which this scheme was implemented could not have been unfair to the plaintiff. 35     In relation to this argument, Chi’s submission was that it was never his intention to exercise any of the voting rights that came with the Estate’s shares. In fact, he never once sought to exercise any additional voting rights gained by the share transfer. Chi and Chuen’s position as expressed in their letter of 22 September 2005 was that although they wanted to work closely with the plaintiff, they found it was more expedient and beneficial for the companies that the shares be registered in their joint names. They were advised by Winston Loong that if the shares were transferred to them in joint names, they would merely be trustees of the shares for the companies and could not treat the shares as their own. Winston Loong said that since the two men would be holding the shares on trust only, it did not cross his mind to include the plaintiff as a joint trustee. He also stated in court that he did not think it necessary to have three trustees when two would be sufficient. Chi testified that when he received the plaintiff’s protests about not being made one of the transferees, he had asked Winston Loong about the issue. The latter’s response was that it was less troublesome if the shares were put into two names rather than into three names and this would also be more convenient if in the future the ownership of the shares needed to be changed again. Chi also submitted that since trustees have a duty to work together and since the plaintiff had a difficult personality and was unable to work with his brothers, putting the shares into all three names would inevitably have given rise to difficulties. Chuen took a similar position: he had simply accepted Winston Loong’s recommendation as to how the shares should be held. He would have been more than happy with the plaintiff as a co-trustee since holding the shares was just a formality. He too, however, submitted that Winston Loong’s view that it was less troublesome for the shares to be held on trust by Chi and Chuen was understandable in view of the plaintiff’s propensity for disagreeing with his brothers over minor details relating to the management of the companies and the fact that by the time the liens were exercised and the Estate’s shares transferred in late 2005, the oppression actions were already underway. 36     I do not agree that Chi and Chuen can evade responsibility for the decision not to make the plaintiff a co-trustee in respect of the shares by stating that they were simply acting on Winston Loong’s advice. They were the directors of the companies and they had the duty to assess for themselves what the correct course of action should be. Since the shares were going to be held on trust, the natural course would have been to make all the directors of each purchasing company the joint holders of that company’s shares. The only down side to having all three brothers as trustees would have been that a disagreement among them as to how the voting rights of the shares should be exercised would have meant that no voting rights could be exercised. This disadvantage, however, was only a theoretical one as both Chi and Chuen claimed that they never intended to exercise those voting rights anyway. Thus, it would not have been troublesome as they claimed for the transferred shares to be held in the names of all three brothers. Winston Loong had also advised that if the shares had to be transferred again, it would be easier to accomplish this if there were only two trustees. That might be so but it was basically only speculation that the plaintiff would not agree to execute a transfer if the same was validly required in the interests of the company concerned. In any case, if any of the trustees refused on spurious grounds to execute any documents relating to the shares, court assistance could be applied for at the ultimate expense of the defaulting trustee. Accordingly, it appears to me that Chi and Chuen did not have a valid reason to disregard the plaintiff’s requests that he be made a joint trustee. Instead, they were only too willing to go along with Winston Loong’s suggestion because they found dealing with the plaintiff to be very difficult. 37     The next question is whether this refusal could be regarded as a disregard of the plaintiff’s interest or as unfairly discriminating against the plaintiff. In this respect, it was the plaintiff’s complaint that once his brothers were the trustees of the companies’ shares, they would be able to exercise the voting rights attached to those shares so as to prejudice him. The fact that such voting rights had never yet been exercised by Chi and Chuen did not, the plaintiff submitted, help them. They had not, he said, produced any evidence in court to show that there were occasions on which they could have but did not exercise their rights. The point remained that the benefit to them was that they could have exercised those rights had they wanted to when the occasion arose. 38     It is difficult, looking at the shareholdings objectively, to see what additional benefit Chi and Chuen derived from the transfer of the trust shares to them, at least in respect of ADPL and Lee Tung. Prior to the transfers, each of the brothers held 16.66% of the shares in ADPL. This meant that in any general meeting, the plaintiff could be outvoted by Chi and Chuen acting together. However, because the total number of shares held by the two of them was only 33.32% they could not pass any special resolution even when acting together. The transfer of the Estate’s shares to Chi and Chuen did not change this position because it gave them only an additional 33.33% making a total of 66.66% which was still under the percentage required for the passing of a special resolution. The same position applied in Lee Tung as can be seen from the share percentage figures set out in [6] above. In the case of CCPL, however, whilst Chi and Chuen would not have been able, prior to the transfers, to pass any special resolution on their own (though they could have outvoted the plaintiff in relation to ordinary resolutions), after the transfers, they would have had this power since they would have held 78.36% of the shares. 39     In support of his case, the plaintiff cited the authority ofRe Cumana Ltd[1986] BCLC 430in which a minority shareholder complained that the majority shareholders had implemented a scheme to reduce his shareholding in the company. The trial judge found his conduct to be “clearly unfairly prejudicial” to the interests of the minority shareholder. The difference between that case and this is that here the intention behind the scheme was not to reduce the plaintiff’s interest in the companies. In fact, the plaintiff’s beneficial interest in the shares of the Estate remained completely unaffected. In addition, the new voting rights acquired by Chi and Chuen were never used by them against the plaintiff as trustees for the plaintiff. The same arguments apply to distinguish the case ofClemens v Clemens Bros Ltd[1976] 2 All ER 268 that was also relied on by the plaintiff. In that case, there were two shareholders, an aunt holding 55% of the shares and the niece holding 45% of the shares. The directors (including the aunt) proposed to increase the share capital in such a way that the niece’s shareholding would be reduced below 25%. The aunt voted in favour of the resolutions and the court subsequently set them aside. It held that there was an irresistible inference that the resolution had been framed in order to put complete control into the hands of the aunt and her fellow directors and to deprive the niece of her existing rights as a shareholder with more than 25% of the vote. 40     In any case, the transfers of the shares have been set-aside and there is now no possibility of the first and second defendants exercising any additional voting rights by reason of those transfers. If there had been any oppression of the plaintiff caused thereby, that oppression has ended. The fact that the first and second defendants have yet (at least up to the date of submissions) to execute the re-transfers in favour of the companies, although rightly criticised by the plaintiff, is not in itself oppressive since they are not asserting any beneficial rights in the shares at all. 41     I have come to the conclusion that no real prejudice has been caused to the plaintiff by virtue of the fact that his requests to be made a joint trustee were not acceded to. This evidence tends, however, to add weight to other complaints made by the plaintiff with reference to his role in the management of the companyiethat his brothers were not inclined to include him in the management but preferred to take decisions on their own without paying regard to his wishes or views. This is something I will come back to later.",
        "Interest on the alleged debts": "42     The plaintiff submitted that an issue that was related to the transfer of the shares was the issue of interest imposed by the companies on the Estate. He argued that this was done because Chuen wanted to inflate the debt allegedly owing by the Estate in order to “mitigate” what the plaintiff described as “the effect of the lesser(sic)share which Chuen would receive (ie1/7th) from [the Estate]”. 43     The plaintiff did not plead the imposition of interest on the Estate’s debts as an item of oppression in his Statement of Claim. He brought up the question of interest in a sub-paragraph to para 2a. of his Reply (Amendment No. 1). This was the paragraph in each pleading where the plaintiff had averred that despite his objections, the first and second defendants had caused the companies to exercise a lien on the shares of the Estate knowing that the Estate might challenge the companies’ purported lien. Particulars of this pleading included, in each case, the following sub-paragraph: (4)    As for the imposition of 6% interest or any interest on the Alleged Debt, the Director’s Resolution dated 16 January 2004 was passed by the 1stand 2ndDefendants without regard to the Plaintiff’s objection of short notice and without any agreement by Chow Cho Poon, deceased (when he was alive) or the Estate to pay any interest. It can be seen that nowhere in that pleading was the assertion that the motive for the imposition of interest was the desire on Chuen’s part to somehow reduce the discrepancy between his interest in the Estate and that of his brothers. Nor was there an allegation that Chi agreed to this course for the same improper motive. As the motive was material and was not pleaded, I consider that it must be disregarded. The first and second defendants had no opportunity to address this assertion in their pleadings or their evidence-in-chief and it would not be correct to consider the plaintiff’s submissions on the point or to make findings thereon. 44     The position regarding the imposition of interest on the Estate’s debts as being an act of oppression is more ambiguous since it was pleaded though not, as it should have been, in the Statement of Claim. Even if I disregard the pleading point, however, I do not think that it is possible to find that this action was oppressive to the plaintiff in his capacity as a shareholder. Any reduction in the net value of the Estate that would have resulted from the imposition of interest on its debts would not have prejudiced the plaintiffquashareholder. If he did suffer any unfair prejudice or detriment by reason of the interest paid by the Estate, such loss would have been incurred in relation to his position as a beneficiary of the Estate. In fact, it appears to me that the plaintiff in his position as a shareholder of the companies could only gain from the increase in the companies’ assets by reason of the interest paid by the Estate. No doubt there was a downside to the companies from the imposition of interest and that was that they had to pay tax on such interest but, in theory at least, the amount of interest collected should have exceeded the amount of tax payable and the result would have been a gain to the companies. 45     Although it is not necessary for me to go into detail on this issue given my finding above, I also agree with the submission that on the evidence, the management decision by the boards of the companies at the material time to impose interest on the Estate’s debts had a rational basis and was taken in good faith. It is worth noting that originally the imposition of interest was agreed to by all the directors although the plaintiff subsequently changed his mind. The plaintiff was not unfairly prejudiced by this management decision.",
        "Unauthorised directors’ loans": "The plaintiff’s case 46     The plaintiff complained that Chi and Chuen had been guilty of the improper use of funds belonging to the companies under the pretext that these were loans. He asserted that the so-called “loans” were company funds which had actually been misappropriated by his brothers. The particulars of this complaint were that: (a)    Chuen and Chi had, on many occasions between 2003 and April 2006, taken “loans” from the companies; (b)    the “loans” were taken without the prior knowledge, consent or approval of the plaintiff or despite his objections; (c)    in three cases, without the prior knowledge, consent or approval of Chi and the plaintiff, $90,000 [$10,000 (November 2006) + $50,000 (March 2007)] in “loans” were taken by Chuen; (d)    the “loans” were for Chi’s and Chuen’s personal purposes; (e)    the “loans” were not for the benefit of the companies; (f)     much of the “loans” remain unpaid; (g)    the “loans” were unsecured; (h)    the “loans” were without a charge being made for interest; (i)     the “loans” were not authorised by the board of directors; (j)     the “loans” were of considerable amounts; and (k)    Chi and Chuen accepted – just before the trial was due to commence – that the “loans” were improper and no further “loans” should be made to them. 47     Dealing with the evidence, the plaintiff submitted that in the main, the loans were taken by Chi and Chuen to defend themselves against the following law suits: (a)    OS 729 which he had instituted against them in order to,inter alia, procure the setting aside of the share transfers; (b)    OS 863 of 2004 which Mrs Betty Sheares, their sister, commenced against all three brothers in their capacity as executors of Mrs Chow’s estate; (c)    the oppression actions; and (d)    Suit 248 of 2005 which the plaintiff filed against Chi and Chuen relating to Mr Chow’s estate in Australia. 48     Many of the loans comprised payments made to three firms of lawyers,vizM/s Yeo Leong & Peh (M/s YLP”), M/s MP and M/s Allen & Gledhill and many of these loans were taken out after the commencement of the actions listed above. The plaintiff asserted that the first and second defendants had surreptitiously used the funds of the companies to fend off the law suits mounted against them and they were able to do this because they were in control of the funds and of Jeslyn Goh and Winston Loong. They had ignored his various protests against the improper use of company funds and in this connection he referred to letters written dated 6 July 2005 and 5 October 2005. 49     The plaintiff pointed out that the “loans” were not described in the relevant company records as loans taken by Chi and Chuen. Instead, in various cash vouchers, they were described as “interim loan from the executors to the estate”. Similar descriptions appeared in the monthly accounts and ledger books. It was not clear from the documents to which estates the loans were made. In any case, the descriptions in the documents were misleading as the funds were lent to Chi and Chuen and not to either parent’s estate. 50     In further support of his argument that his brothers did not truly intend to take loans, the plaintiff referred to various passages from the cross-examination. First, Chi said during cross-examination that the Estate should bear the legal costs incurred in OS729. He asserted that the decision for the Estate to borrow the fees from the companies was made by Chuen and himself. They did not discuss this decision with the plaintiff because they were not on speaking terms with him. Next, Chuen stated during cross-examination that these loans should have been charged to the Estate. Further in her evidence-in-chief, Jeslyn Goh had stated that the description on the payment vouchersie“interim loans from the executors to the estate” was based on her understanding of the defendants’ instructions that the loans were for legal fees incurred in respect of matters relating to the Estate. It was only in court that Chuen agreed that having been sued as trustees of the Estate, he and Chi would have to pay the legal fees first and then it would be decided later whether the fees could be recovered from the Estate or not. There was also evidence that the companies had each paid $10,000 to M/s MP in relation to the oppression actions at a time when the companies were not parties to the actions. The payment vouchers for such payments did not state that the same were loans to either Chi or Chuen. Chi who was the only defendant who had entered appearance at that time, gave evidence that he had taken the view that the $30,000 should be borne by the companies and not by himself but he later agreed that the money had been paid for his benefit alone. 51     It was therefore submitted that Chuen had lied when he affirmed in his affidavit of evidence-in-chief that the loan had been properly documented in the companies’ ledgers and vouchers. The plaintiff asserted that the defendants had only acknowledged liability for the purpose of defending themselves. They had taken the monies for their personal use and not as loans in the first place. They claimed that the management accounts reflected the sums as loans but those accounts were drafts which had not been signed by them. Further they had refused to sign the audit confirmation slips acknowledging the amounts they had taken. 52     The plaintiff also considered the mode by which the payments had been made to be telling. All the payments were made in cash via Standard Chartered Bank account No. 16-2-039411-9 (“SCB account”). A total of $519,522.00 was drawn out of the SCB account for Chi and Chuen’s personal expenses although this account was only meant for salaries and operating expenses of the companies. Jeslyn Goh who operated the SCB account had testified that the payments to M/s YLP were made in cash and this had been done on instructions from Chi. Chi on the other hand testified that he did not know why she had paid the bills in cash. The plaintiff pointed out that the funds in the SCB account had been deposited there through cheques drawn on Lee Tung’s account with the Hong Kong Shanghai Bank (“HSBC account”) and such cheques had been signed by both the defendants. He asked why they could not have issued cheques directly to M/s YLP from the HSBC account. His answer to that question was that his brothers had intended to create a distance between the payments and themselves so they could avoid liability for the loans. 53     The defendants had, even after these oppression actions were started, continued to withdraw monies from Lee Tung and CCPL to pay legal costs incurred by them. The subsequent withdrawals amounted to $85,670.00 and had been effected despite letters of protest sent in July and October by the plaintiff. The defendants had ignored the plaintiff’s protests against the misuse of company funds in the same way that they disregarded his objections to the transfers of the shares. Unlike their parents who had convened directors’ meetings to authorise loans to themselves and abstained from voting on the matter, the defendants did not secure board approval for the loans they took out. They could not have convened a meeting to approve the loans as the plaintiff would have objected. And, as Chuen conceded in court, he and Chi would have had to abstain from voting on resolutions relating to the loans. 54     In support of his submissions, the plaintiff noted that inKong Thai Sawmill,Lord Wilberforce held that improper drawings by way of loans were material as evidence of “oppression” and “disregard”. He highlighted that whilst the loans taken in that case had been repaid, in the oppression actions very substantial amounts of the misused funds remain unpaid by Chi and Chuen. Also while interest had been paid on the loans taken inKong Thai Sawmill,his brothers had not offered to pay any interest on the amounts they had taken. 55     The plaintiff also cited the Malaysian decision ofRe Coliseum Stand Car Services Ltd[1972] 1 MLJ 109where the applicant complained of two loans that had been taken out without the directors’ approval. Abdul Hamid J found that the loans had not been made for the benefit of the company and stated that even though they had been repaid the loans constituted an improper use of the company’s funds. He said: As regards the two loans, one to himself and the other to his son, although it would appear that they had been repaid, there is nothing to show that these loans were made for the benefit of the company. To my mind, it constituted an improper use of the company’s funds. It was quite improper for the company, controlled entirely by the first respondent, to authorize the use of the company’s funds for a purpose unconnected with the company’s affairs. In this regard, I would like to state that whilst I agree that in the circumstances of that case it was not proper for the director in that case to borrow money from the company, this does not mean that directors of a company can only borrow money from it if the purpose of the loan would benefit the company. Directors of exempt private companies can take loans from their companies in appropriate circumstances: the articles must permit it (or at least, not prohibit it), the company should not be under capitalised and the borrowings must have been duly authorised (which was not the case in the authority cited). In such a case, it would not be improper for a director to take a loan from his company simply because the loan was taken for his personal use. The defendants’ case 56     Both the defendants denied that their actions in taking the loans from the companies had been oppressive of the plaintiff in any way. First, they said all loans were clearly recorded in the monthly accounts which were sent to the plaintiff. There was therefore no issue on the loans having been taken surreptitiously or without the plaintiff’s knowledge. The plaintiff had agreed in court that he had received these accounts each month and that the same had reflected these monies as loans taken out by the directors to pay their solicitors, M/s YLP. A typical statement of the monthly account of Lee Tung to which the general ledger entries were appended clearly showed the amount owed by each director with the words “M/s YLP” placed in parenthesis next to the names of Chi and Chuen. The plaintiff had also agreed in cross-examination that he had been kept informed of all the financial operations of the companies. He had stated that his wife or his accountant had looked through the management accounts every month and if there were entries that needed his attention they would bring this up to him and discuss them with him. 57     The defendants relied on evidence given by Jeslyn Goh to explain why some of the loans were initially dubbed “interim loans from the executors to the Estate”. She said that this description was given by her and the estate referred to was the estate of Mr Chow. She had not questioned Chi and Chuen about the precise purpose of the loans and the description reflected her own understanding of their instructions. When she was asked why she had described the payment in the way she did, she replied that she understood from Chi and Chuen that it was a loan to them, paying for the expenses of the Estate. She later said that the written description was wrong due to her poor English. The defendants asserted that the plaintiff was trying to make too much out of this grammatical mistake. In any case, they submitted, the plaintiff was not misled by the error. Instead, at all material times, he would have been aware from the monthly management accounts that the payments constituted loans to Chi and Chuen for the legal fees charged by M/s YLP. Indeed, he had never questioned whether these payments were loans despite raising various queries with Jeslyn Goh regarding the precise nature of M/s YLP’s legal fees. The plaintiff’s knowledge of the character of the payments (despite the somewhat misleading description in the vouchers) was also shown in several of his letters to his brothers where he had referred to them as loans and had objected to them on the basis that his consent for them had not been sought. He never asserted that he had been misled by the companies’ records. 58     The defendants further explained that they had initially thought that they could recover from the Estate the expenses incurred in defending themselves for their actions as executors. By crediting all the payments to the lawyers to their individual accounts, the defendants clearly took responsibility for themvis-à-visthe companies. Nevertheless they wanted the accounting records to show clearly that even though they had agreed to cover the expenses initially, as executors they would ultimately look to the Estate to indemnify them against legal costs incurred on its behalf. 59     It was submitted that the plaintiff’s assertion that the defendants never had any intention to repay the loans was entirely speculative. The fact that the loans were recorded in the books of the companies as their directors loans meant that Chi’s and Chuen’s primary liability for the outstanding loansvis-à-visthe companies was undisputable in law and the borrowed amounts were effectively secured against the value of their respective shareholdings in their companies. In any case it was odd for the plaintiff to complain about loans taken by the other directors when he himself had an outstanding loan of $1.2 million shown in the books of CCPL. It was only when Jeslyn Goh and Winston Loong wrote to him about his outstanding loan that the plaintiff had complained about the loans taken by his brothers. Since the plaintiff had not paid any interest on his loan it was hypocritical for him to complain that no interest had been levied on the loans to his brothers. 60     The defendants argued that it was not wrong for them to take loans from the companies without the support of board resolutions. They asserted that Mr and Mrs Chow had both taken numerous loans without resolutions being passed, it being the accepted and settled practice of the companies since the time of Mr and Mrs Chow for interest-free loans to be extended to directors or shareholders as and when the need arose with no fixed term of repayment. It had also been the practice of the companies that directors’ or shareholders’ expenses were frequently paid by the companies on their behalf and debited as loans against their personal, running accounts for expenses. After the deaths of Mr and Mrs Chow, the companies continued to pay for current expenses on behalf of both estates in relation to the upkeep and maintenance of the properties of the same. The records of the companies made clear that both Mr Chow and Mrs Chow owed far more to the companies than was permitted by the resolutions that had been passed. As the plaintiff had never previously taken issue with the “unauthorised” loans extended to his parents and their estates, it was inconsistent for him to complain that the loans extended to the defendants were granted without formal board approval. 61     Chi dealt with the assertion that payments were made in cash so as to aid in disguising the transactions. He relied on the explanations given by him in court and by Jeslyn Goh in her affidavit. This was that monies would be transferred from CCPL into the SCB account and that he and his brother would sign cheques based on Jeslyn Goh’s request for money to top-up the SCB account whenever its credit balance fell below $10,000. All payments made on behalf of Chi and Chuen were made from the SCB account and Jeslyn Goh was authorised to make cash withdrawals from this account. This method facilitated the payment of the companies’ expenses without requiring Chi and Chuen who resided in Hong Kong having to sign cheques every time a payment had to be made. Due to the fact that the SCB account did not have a cheque book, Jeslyn Goh could not make payment with a cheque even if she wanted to. It was a misinterpretation of the facts to say that the cash payments showed that Chi and Chuen were trying to furtively take the companies’ money for themselves. Chuen noted that Winston Loong had taken the view that in the context of the companies it was not unusual for the payments to M/s YLP to be made in cash since most of the time payments of the companies’ expenses had been made this way. He also argued that the mode of payment was irrelevant for the purpose of determining whether the plaintiff had been unfairly oppressed as a shareholder of the companies. The mode of payment did not change the character of such payments as loans. 62     Chi submitted that for the reasons given earlier it had been reasonable for him to ignore the protests that the plaintiff had made and to continue to take loans from the companies. In any event, the plaintiff had failed to show the prejudice that he had suffered by reason of the loans taken. Chi would eventually repay the loans and, since the companies had been ordered to be wound up, whatever sums were outstanding in his account with the companies would be set off against the value of his shares. As far as the complaint that interest was not charged on his loans was concerned, Chi submitted that no interest was charged on the plaintiff’s loans either and therefore he had not suffered any prejudice. 63     In his submissions, Chuen pointed out that he and his brother had also described the payments to themselves as loans owing by them to the companies. This was also apparent from their defences filed in the oppression actions. Prior to the filing of his closing submissions, the plaintiff had never challenged this description of the payments. Further, he had not claimed ignorance that the loans had been taken by Chi and Chuen from the companies. Although the plaintiff’s lawyers questioned his brothers on the witness stand as to why the payments had been made in cash, he did not put it to either of them that the reason for this was so as to conceal the loans made by the companies in order to avoid having to repay such loans. Therefore, the belated attempt by the plaintiff to claim that his brothers had attempted to “hide the loans” or otherwise “create distance between the payments and themselves so that they could avoid liability for the loans” must be disregarded. 64     In respect of the plaintiff’s allegation that Chi’s and Chuen’s true intention was to make their late parents’ estates liable for the loans taken to pay legal costs incurred by the defendants in their capacity as trustees, Chuen submitted that this argument glossed over the indisputable fact that both he and his brother accept that they are personally liable to repay these loans to the companies. Whether they would be entitled to recover these costs from the two estates would depend on whether there was any finding that they had acted improperly as trustees. This was the view that they had taken. Chuen pointed to the following evidence given by Chi during the course of cross-examination: Court:      So this bill was the bill of only two of the trustees? A:           Yes, this bill was paid by two of us. We were thinking at the end of it all, when the dust all settled then we would discuss amongst ourselves, the mother’s estate, whether the mother’s estate should pay it or whether each of us should bear it. It was pointed out that this view was not inconsistent with the law. Order 59 r 6(2) of the Rules of Court (2006 Rev Ed) states that: Where a person is or has been a party to any proceedings in the capacity of trustee, personal representative or mortgagee, he shall, unless the Court otherwise orders,be entitled to the costs of those proceedings … out of the fund held by the trustee or personal representativeor out of the mortgaged property, as the case may be, and the Court may otherwise order only on the ground that the trustee, personal representative or mortgagee has acted unreasonably or, in the case of the trustee or personal representative, has in substance acted for his own benefit rather than for the benefit of the fund. [Emphasis added] 65     Chuen noted that the companies kept records of all sums borrowed by their directors and shareholders as well as of all expenses paid by the companies on behalf of these individuals. These advances were duly noted in the monthly management accounts which were then despatched to all the directors to keep them apprised of the companies’ finances. In Chuen’s view the plaintiff had tried, unsuccessfully, to distinguish the loans taken by Mr Chow, Mrs Chow and himself from those taken by the defendants. In cross-examination, the plaintiff was asked whether he agreed that the practice of the companies had always been the directors had running accounts with the companies and expenses paid on their behalf would be debited against those accounts and from time to time the directors would deposit money into the companies in order to pay off or reduce the running accounts. The reply that the plaintiff gave was: The practice has been that the directors have a running account with the company when there is money in that account. This reply was given despite the fact that the plaintiff had agreed that the companies had advanced money on behalf of his wife even when her running account was in deficit and had done so for Chi even when his running account was in deficit. 66     Chuen also considered that the plaintiff was not telling the truth when he denied in his affidavit of evidence-in-chief that he had ever borrowed any money from CCPL or any of the companies. This denial had been made in the face of the ledger balance in CCPL that showed the plaintiff had an outstanding loan of $1,213,192.27. This loan was further supported by a loan confirmation dated 9 April 2001 which was addressed to CCPL’s then auditors M/s Chan Kum Chee & Co. It appeared to have been signed by the plaintiff and confirmed that the sum of $1,213,192.27 was owed by the plaintiff to CCPL. The plaintiff was shown a copy of the loan confirmation and asked whether the signature on it was his. He responded “It looks like my signature”. He also conceded in cross-examination that in the course of reviewing the monthly management account for CCPL in December 2004 he had checked the entry pertaining to his loan of $1,213,192.27 from CCPL and had accepted it though his reply to a later related question was somewhat cagey: Q:        You had admitted that you owe $1.2 million to the company, Chow Cho Poon Pte Ltd; correct? A:         I accepted the figures, but its due to further discussion as it was carried in the books for some time. In 2002, the plaintiff had paid a penalty imposed by the Comptroller of Income Tax on him for his failure to declare the taxable benefits from the grant of the interest-free loan of $1,213,192.27 to him by CCPL. Chuen noted that in court the plaintiff had stated that Mr Chow had taken the loan and recorded it against the plaintiff’s account in the ledgers of the company without the plaintiff’s consent. In the course of re-examination, however, the plaintiff had conceded that that sum or at least part thereof had been taken for his benefit in that Mr Chow had taken the money from CCPL in order to purchase shares and property for the plaintiff in Australia. He recognised that there would be a liability on his part to repay money used to buy shares for him. 67     The submission was also made that the loans to the defendants were authorised. During the board meetings of the companies held on 7 March 2003, the directors resolved that any two of the three directors could sign cheques, financial instruments and documents on behalf of the companies. Thus, the loans extended to the defendants had been approved by two out of the three directors. The fact that the plaintiff was not one of the directors approving them did not render the loans unauthorised. Both brothers contended that there was no practice that the loans had to be approved by way of a resolution passed at a duly convened board meeting and that the parties to whom such loans were to be extended would have to abstain from voting on such resolution at the board meeting. They drew attention to various payments made by the companies on behalf of the directors and shareholders that had been recorded as loans in the books of the companies without resolutions having been passed with respect to such payments. An example was the payment of $55,000 on behalf of Mrs Chow in respect of professional fees for preparing and submitting her income tax returns for the year of assessment 2000. Another example related to payments on behalf of the plaintiff’s wife. Even where resolutions had been passed, these had often been retrospective so as to ratify loans that had already been extended. My attention was drawn to such resolutions passed in August 1992 and August 1993. It was also pointed out that there was nothing in the minutes to indicate that directors who were affected by such resolutions had abstained from voting on them. 68     Chuen’s final submission on this point was that taking of loans did not constitute a continuing oppression because the practice had ceased. He noted that at a meeting with the plaintiff on 25 January 2007, Chi agreed as a matter of goodwill to stop the established practice of the directors taking loans from the companies. Chuen himself was not a party to the agreement. In April 2007, he had instructed Jeslyn Goh to make payment of $80,000 to his solicitors and to set off this sum against his director’s fees. Subsequently, Chi had instructed Jeslyn Goh to ask Chuen to return the sum of $80,000 to the companies. Upon receipt of Chi’s request, Chuen agreed to return the sum. He argued that because the majority of the directors (ietwo out of the three) had agreed to cease the established practice of the companies extending loans to directors, he had accepted the majority rule. This in no way constituted an admission that the previous loans (which had been approved or agreed to by two of the three directors) were unauthorised or improper or otherwise not in accordance with the accepted practice of the companies. Chi and Chuen’s recent agreement to change the established practice did not render the previous loans taken improper. Given the undisputed fact that the practice had now ceased, the plaintiff could no longer complain that there was any continuing oppression against him in this respect. My decision 69     I should first of all state that as these companies are exempt private companies, it was not illegal for them to make loans to their directors. Additionally, there was no evidence that the companies were under-capitalised. There was substantial evidence that the companies had a practice of not only making payments of the directors’ personal expenses on their behalf but also of making direct loans to them. This practice was followed from the time the companies were founded by Mr Chow and it was not surprising given that they were the corporate embodiments of his own businesses. It was a practice that both Mr and Mrs Chow agreed on and took advantage of. Given this background it was also understandable that strict corporate forms were not followed at the time that the companies were run by Mr and Mrs Chow. They sometimes had resolutions passed to authorise their borrowings but at other times they disregarded this formality. Also, on occasion they did not abstain from voting in favour of resolutions that affected their own interests. 70     The question is, however, whether this practice could continue after Mrs Chow died and her sons took over the running of the companies. Whilst the sons could not and would not object to advances made to their parents, this did not mean that each of them was automatically entitled to treat the companies in the same way as his father and mother hadieas a ready source of cash. I accept the plaintiff’s view that after the parents’ death, the old way of using the companies’ funds as if they were the personal funds of the shareholders and directors could not continue. The three brothers were not in the same position as their parents had been and there was the additional factor of other interests in the companies, these being mainly interests of the two estates and any creditors those estates had and the interest of their sister (small though it may be). The directors therefore had a duty to meet and discuss the policy on loans and only take loans that had been properly authorised. The three brothers had to decide on the extent to which loans to directors from the companies were permitted. There was no evidence that the three directors or even two of them ever got together and explicitly set out the conditions for loans. The argument that it had been agreed that any two of them could sign cheques and that therefore the loans were in order is puerile. It may have been arguable had there been only two directors on the board. It is not maintainable in the present situation when two directors were taking money for personal use without the prior consent of the third. 71     Further, I do not accept that the plaintiff was not entitled to complain about the loans taken by his brothers simply because there was a large debit balance on the plaintiff’s account. That debit balance was irrelevant to this point because it had been outstanding for many years and the loans it represented had been taken when Mr Chow was alive and had been authorised by him. The other brothers did not have such substantial indebtedness at the time of Mrs Chow’s death. It was only thereafter that their debit accounts increased. I also take note of the peculiar way in which some of the loans were taken. Whilst I accept that Chi and Chuen had no intention of not repaying borrowed moneys, there does seem to have been some confusion as to whether they were borrowing moneys on their own behalf or on behalf of the estates. There should have been more clear thinking about what they were doing. Chuen testified that the loans were made to the Estate and that he had every intention of making the Estate bear the costs. This was not the correct position to take. 72     It also seems to me that the defendants did not want the plaintiff to know that they were using moneys to pay lawyers’ bills to defend themselves in relation to the various suits he had taken against them. I do not believe that the way in which these loans were described in the payment vouchers was simply a grammatical mistake. I also think that these loans should not have been disbursed in cash and that Winston Loong’s excuse that it was all right as many payments were made in cash is not an acceptable one. There was no reason why Jeslyn Goh could not have prepared cheques for the various payments that the lawyers required and sent these to Hong Kong to be signed in the usual way. I note the conflict of evidence between Jeslyn Goh and Chi in that whilst the former said that she had issued instructions for the cash payments, Chi said he did not know why Jeslyn Goh paid cash. In this respect, I accept Jeslyn Goh’s evidence because as an employee she would not have paid such large sums in cash without instructions from her employer. There was no evidence that she was anything except a diligent employee who always acted on instructions. I also accept that whilst the plaintiff may have been sent the monthly management accounts and ledger entries, he would not have realised the extent and nature of the loans until discovery in this action. 73     I have, accordingly, come to the conclusion that it was wrong of the defendants to have taken loans from the companies in the way that they did. The plaintiff’s protests were ignored consistently until January 2007 and even then it was only Chi who took note of them. Chuen made a further borrowing in March 2007 and only returned the money subsequently when Chi protested strongly. Whilst therefore the practice of taking loans from the companies had ceased by the time the proceedings came on for hearing, the transactions would, as in theKong Thai Sawmillcase, remain evidence of oppression or disregard.",
        "Dividends and directors’ fees": "74     The plaintiff complained that his brothers disregarded his pleas that dividends be declared. He said the failure to declare dividends was detrimental to his interests as a member and shareholder. 75     The evidence was that the companies consistently made profits and this continued after Mrs Chow’s death in December 2002. Although the various articles of association provided for the payment of the dividends from profits, the defendants decided not to declare any dividends in any year after 2002. Instead, they passed resolutions awarding all directors what the plaintiff termed “extravagant” directors’ fees. The plaintiff wrote letters in 2003, 2004 and 2005 complaining about this policy. 76     The plaintiff’s affidavit contained the following table showing directors’ fees paid since 2001:  Year Ending31 DecemberCCPLADPLLee Tung2001$ 45,000$ 45,000$ 45,0002002$192,307.68$315,308$192,307.682003$230,769.24$307,692.30$230,769.242004$450,000$562,500$450,0002005$450,000$562,500$450,0002006$450,000$562,500$450,000 77     The plaintiff had several complaints about this level of fees: (a)    they were not justified by the work done by the three brothers in managing the companies since their main business was that of collecting rent and no significant work was required from the directors to make this income; (b)    at an extraordinary general meeting (“EGM”) held on 29 May 2006, the plaintiff’s proxy asked what the reason was for the high directors’ fees being proposed at that meeting. Winston Loong replied that it was that Chi and Chuen felt that they deserved an increment in their remuneration as they had worked hard in defending the companies against a claim by a minority shareholder (iethe plaintiff). The plaintiff considered this an absurd reason for declaring high directors’ fees; (c)    prior to Mrs Chow’s death, each director received only about $11,250 from each company making a total of $33,750 annually; (d)    although ADPL made the least profits and had the least accumulated profits, the directors’ fees declared for ADPL in 2004 were the highest among the three companies at $562,000. This sum wiped out the bulk of the revenue for the year and left the balance of $175,198 as profit; and (e)    in 2006, Chi and Chuen declared directors’ fees for that year before it had even come to an end and without knowing the performances of the individual companies. Chi and confirmed in court that he did not think about performance before recommending the amount of directors’ fees. 78     The plaintiff further argued that Chi and Chuen clearly preferred their own interests over that of the shareholders in consistently approving high directors’ fees for themselves and refusing to declare dividends. He calculated that the dividends that he and his brothers would have received as beneficiaries of the two estates would have been as follows: NameCCPLADPLLee TungTotalThe plaintiff$145,972.28$191,517$137,218$474,707.28Chi$155,062.28$191,517$164,218$510,797.28Chuen$144,943.71$164,732$119,379$429,054.71 79     The total directors’ fees that each of the directors had received was $487,500. Whilst the plaintiff might have received slightly more as director’s fees, the defendants had received a lot more when the amounts for both of them are considered together: the combined amount that Chi and Chuen had received in the form of directors’ fees was $975,000 which exceeded the combined amount of $939,851.99 they would have received in the form of dividends. Had the same amount been declared as dividends instead of directors’ fees, the other shareholders would have received the following dividends:  ShareholderCCPLADPLLee TungTotalThe Estate$133,830$187,000$172,125$492,955Mrs Chow’s Estate$1,530$93,750$241,740$337,020 80     The plaintiff argued that if those dividends had been declared the amounts due to the estates could have been used to repay some of their debts. Further, the defendants had purportedly borrowed money on behalf of the two estates from the companies and thereby incurred further debts on behalf of the estates. This would not have been necessary had dividends been declared. 81     The plaintiff was aware that an argument might be made that the prejudice suffered by the estates would not be relevant in an oppression action brought by him. He therefore submitted that s 216 of the Act did not require the estates to be made parties to the action in order for the prejudice suffered by them to be considered since s 216(1)(a) referred to the powers of the directors being exercised “in a manner oppressive to one or more of the members … including himself”. Further, the plaintiff was a beneficiary of the two estates and was prejudiced in turn by his brothers’ refusal to declare dividends. 82     The plaintiff referred to the case ofRe S Q Wong Holdings (Pte) Ltd2 MLJ 298 where Chan Sek Keong JC held that whilst directors have a discretion whether or not to recommend a dividend, this discretion must be exercised fairly and honestly in the interests of the company. He further held that directors would not be acting fairly or honestly if the discretion was exercised to deny the shareholders their rights for collateral purpose. The plaintiff said that in this case, not only was non-payment of dividends unfair to him but the collateral purpose behind the defendants’ actions was that they had wanted to favour Chuen by paying directors’ fees instead of dividends. This was because each of the directors including Chuen received the same amount of fees whilst if dividends had been paid out, Chuen would have received less than the plaintiff because he was only entitled to 1/7thof the Estate’s shares in the companies whilst the plaintiff was entitled to a 2/7thshare therein. The defendants’ submissions 83     Both Chi and Chuen took the position that the companies were under no obligation to declare dividends annually or to declare dividends in place of directors’ fees. It had never been the practice of the companies to declare dividends. Instead, their practice had been to remunerate the shareholders-directors by paying them directors’ fees. In such circumstances, there could have been no legitimate expectation on the plaintiff’s part to receive dividends. There was no basis to complain of oppression on this ground particularly since the plaintiff had received substantial directors’ fees and these fees were equivalent to the fees received by his fellow directors. 84     Secondly, in respect of the argument that the no dividend policy was oppressive to the rights of the Estate and Mrs Chow’s estate, the plaintiff had agreed under cross-examination that neither the administrator of the Estate nor his sister had complained that dividends had not been declared. As regards the assertion that substantial directors’ fees had “wiped out” the bulk of the revenue for the year and this had prejudiced him, Chi argued that this statement did not explain how his rights as a member had been prejudiced even if the assertion were true. 85     It was further submitted that the court must take the entirety of the circumstances into account when weighing whether there had been oppression in relation to the dividend policy. It was pertinent that what the plaintiff had actually received by way of director’s fees was more than what he would have received the total amount of the directors’ fees had been distributed to members by way of dividends. In fact it was Chi who had suffered a loss from the decision to pay directors’ fees instead of dividends. This was shown in tables drawn up by Chi. In summary, the plaintiff’s gain and Chi’s loss from the payment of fees instead of dividends was as follows: Director’s FeesThe plaintiff’s dividendsChi’s dividendsCCPL$150,000$145,972$155,062ADPL$187,500$191,517$191,517Lee Tung$150,000$137,218$164,218Total$487,500$474,707$510,807 It was therefore untenable for the plaintiff to claim that Chi had oppressed him by voting in favour of paying directors’ fees instead of dividends. 86     In respect of the complaint that the fees were too large and undeserved, the plaintiff had not shown how he had suffered prejudice. He had not turned down his share of director’s fees and had doggedly pursued his replacement cheque for the fees that he had not encashed. The difference between the present case andRe SQ Wong Holdingswas that the plaintiff was both a shareholder and a director and therefore received money through director’s fees whereas in the case cited, the complainant shareholder was not a director and accordingly the no dividend policy meant he did not get any money at all. Further, it had never been the plaintiff’s pleaded case that the amount of directors’ fees paid out was excessive and therefore oppressive to him. His pleaded case was that he wanted dividends to be paid out instead of directors’ fees and he had thus been deprived of the dividends which would otherwise have been paid out to the estates. 87     Chuen in his submissions dealt with the argument made by the plaintiff that Chuen would benefit more than the plaintiff from the payment of directors’ fees than the payment of an equivalent in dividends. This argument was completely fallacious because it assumed that any dividends declared in favour of the parents’ estates would have been paid out to the three brothers in accordance with their respective entitlements. This disregarded the well-established principle that beneficiaries under a will have no beneficial (much less legal) interest in the assets held by an estate until the estate has been properly administered and the assets distributed. Thus, until the administration of the Estate had been completed, none of the brothers would have been entitled to receive any dividends which the companies may otherwise have paid out to either of the estates. Therefore there was no basis in law for the plaintiff to calculate his share of the dividends payable by the companies in the manner which I have reproduced at [78] above. It follows from this that the plaintiff’s calculation of the “additional” benefits which Chi and Chuen would have collectively received by way of payment of directors’ fees in lieu of dividends must be disregarded. 88     It was submitted that the plaintiff had nolocus standito complain on behalf of the estates. In his statement of claim, the plaintiff had said that his complaint was that Chi and Chuen were “depriving (him) of dividends which included dividends payable to the Estate of Chow Cho Poon”. In his closing submissions, however, the plaintiff had stated that he was objecting to the non-payment of dividends on behalf of the estates as the estates had been prejudiced by this course. Chuen submitted that he had nolocus standito do so and that the proper plaintiffs for such a complain would be the estates. Chuen did not agree with the plaintiff’s interpretation of s 216(1)(a) of the Act and argued that a literal interpretation of that section would show that the prejudice to the estates could only be considered if it was also a prejudice that had been unfairly suffered by the complainant himself (iein this case) in his capacity as a shareholder. My findings 89     With respect to this complaint, I consider that the defendants’ arguments are more substantial than those put forward by the plaintiff. The plaintiff was not unfairly discriminated against nor prejudiced in any way by the decision to pay directors’ fees and high directors’ fees rather than dividends. The plaintiff received the same amount of directors’ fees as his brothers did. If dividends had been declared rather than directors’ fees, he would have received less in aggregate as dividends would have had to be paid to the two estates as well. The dividends paid to the estates would have belonged to the estates and would have been available for their use, either to pay their respective expenses or their respective debts. These dividends would not have been passed on to the beneficiaries of the estates (including the plaintiff) as the administration of the estates was not completed at the material times. That meant also that the difference between the plaintiff’s inheritance and Chuen’s inheritance would not have affected the amount of dividends received by either since they would have received only the dividends to which they were directly entitled because of their direct shareholdings in the companies. Thus, the plaintiff’s argument of a collateral motive does not stand up to scrutiny. The shareholders who were adversely affected by the no-dividend policy were the estates but they were not the complainants in the case and the plaintiff had nolocus standito complain on their behalf. I agree with the defendants’ reading of s 216(1)(a) that the oppression complained of must be oppression that affects the complainant and not only another shareholder who is not also a complainant. I also agree that this argument was not open to the plaintiff as it was not pleaded. The complaint about the quantum of the directors’ fees paid was one that was not pleaded and cannot be considered. In any event, the plaintiff did not show how the high quantum of the fees was oppressive to him since he was an equal beneficiary of the amount declared.",
        "Exclusion from management": "90     The plaintiff’s submission in this regard was that the defendants had acted oppressively against him in that they: (a)    excluded him from the management of the companies; (b)    entrusted the management of the companies to Jeslyn Goh and Winston Loong; (c)    denied him access to information and documents; and (d)    conducted the board and general meetings in disregard of his wishes and the interests of the companies. He also had a number of miscellaneous complaints relating to the management of the companies. 91     The plaintiff described the background as follows. During Mr Chow’s lifetime he and Mrs Chow managed the companies personally, assisted by a Ms Tan Ai Yong. Mrs Chow added Chi and Chuen as directors of CCPL and ADPL in 1999 even though she knew the three brothers could not get along. This was because she wanted them to work with the plaintiff in managing the companies. Up till then (and from 1993), the plaintiff had been the only son on the board of directors of CCPL and ADPL. It was in those circumstances that the plaintiff expected to participate in the management of the companies jointly with his brothers. General management and information and Jeslyn Goh THE PLAINTIFF'S CASE 92     The plaintiff had no quarrel with Jeslyn Goh’s appointment to oversee the day-to-day management of the companies. His complaint was in relation to her alleged subsequent failure to keep him informed of the affairs of the companies. He disputed his brothers’ assertion that she was acting “under the supervision of directors and shareholders”. On the contrary, he said, the evidence adduced showed that she was acting under the direction of the defendants and to the exclusion of the plaintiff. She reported only to the defendants. Further, on their instructions Jeslyn Goh deliberately kept the plaintiff in the dark in relation to important matters regarding the affairs of the companies. She would not respond to the plaintiff’s enquiries directly. Instead she would seek instructions from the defendants before responding. 93     The plaintiff noted that in evidence Jeslyn Goh had admitted that she dealt largely with the defendants in respect of the day-to-day administration of the companies. The evidence showed that: (a)    from early 2004, acting with accordance with Chi’s instructions, Jeslyn Goh began to direct more of her requests for instructions to Chuen rather than Chi; (b)    in relation to payment of company expenses, Jeslyn Goh would send Chi a list of the cheques required. He would then prepare the same and send them to Chuen for countersignature. There was no evidence that Jeslyn Goh had informed the plaintiff of the expenses that needed to be paid; (c)    when Jeslyn Goh received notices from the Building Control Authority (“BCA”) on the dilapidated condition of the properties, she sought instructions only from Chuen; (d)    the tender exercise in respect of the renovation of the toilets at Chow House (“the renovation work”) and the interviews of potential contractors were undertaken by Jeslyn Goh, Winston Loong and Chuen; (e)    Jeslyn Goh did not report or furnish information on these contractors to the plaintiff despite Chi’s indication on 16 January 2004 that she would give the plaintiff documents relating to the renovation work; (f)     when the plaintiff visited Chow House on 26 August 2004, Jeslyn Goh informed him that the contract documents had been kept in Winston Loong’s office but the plaintiff was not given access to these documents by Winston Loong’s staff; (g)    the break-in at Chow House in October 2003 was reported only to Chi and Chuen but not to the plaintiff and the subsequent investigation report was sent to them but not to the plaintiff; and (h)    there were at least four instances when Jeslyn Goh sought instructions from Chi and Chuen to reply to the plaintiff’s enquiries. 94     The plaintiff referred to Jeslyn Goh’s explanation that she had not sought instructions from him on the affairs of the companies because he had once told her not to contact him. The plaintiff denied having given her such instructions. He asserted that it could be seen from the numerous letters that he had written to her that the plaintiff was concerned about the operations of the companies and was keenly interested in receiving information and participating in the decision-making process. It was therefore not credible for her to defend her failure to report to and seek instructions from the plaintiff on the ground of an alleged instruction from the plaintiff not to contact him. 95     The plaintiff also pointed to Jeslyn Goh’s evidence during cross-examination that she took instructions from Chi in relation to financial issues and from Chuen in respect of the other operations of the companies. He submitted that her responsibilities went beyond the day-to-day affairs of the companies. She had acted on the defendants’ instructions in arranging for funds to be withdrawn from the companies for their personal use and she had assisted them to disguise these withdrawals as “interim loans of the executors to the Estate”. 96     The evidence showed that Jeslyn Goh had been given full access to the moneys in the SCB account. When the SCB account was set up, Jeslyn Goh had been made an authorised signatory which meant that she could withdraw any amount from it that she desired. Chuen had said in court that there was a control system to guard against misuse of the account by Jeslyn Goh. This system was that she was required to submit a request to Winston Loong for his approval before withdrawing funds and that Winston Loong was supposed to check on the amount withdrawn thereafter. During cross-examination, however, both Jeslyn Goh and Winston Loong confirmed that there was no such arrangement. Jeslyn Goh did not need to tell Winston Loong how much she was drawing and he did not ask her about her withdrawals. Winston Loong testified that he had kept the SCB account passport for a few months and thereafter he had relinquished it to Jeslyn Goh. The plaintiff submitted that thus there was no limit on the amount that Jeslyn Goh could withdraw from the SCB account for the personal use of the defendants. 97     The plaintiff also asserted that Chi and Chuen had misappropriated moneys belonging to the companies when they instructed Jeslyn Goh to withdraw large sums for their personal use. The particular transaction that the plaintiff emphasised was Chuen’s instruction to Jeslyn Goh given in March 2007 that she should withdraw $80,000 for his personal use. That instruction was given without Chi’s knowledge and was contrary to Chi’s earlier instructions. Despite this, Jeslyn Goh withdrew the money and it was used to pay Chuen’s legal fees. This showed her allegiance to Chuen. 98     Next, the plaintiff referred to the evidence that his brothers had requested him not to interfere with Jeslyn Goh’s duties. In a letter dated 10 June 2004, Winston Loong stated that: On this [the break-in at Chow House in October 2003] and other similar matters, your co-directors wish to state that JG has been appointed to oversee these companies’ day-to-day operations and has been given full autonomy. They do not wish to interfere with her management as long as matters are under control. It was submitted that this piece of evidence and Jeslyn Goh’s account of how closely she worked with the defendants contradicted the latter’s position that she should be left alone to manage the affairs of the companies. Chi and Chuen had divided between themselves the roles needed to run the companies and excluded the plaintiff from any role. When the plaintiff asked relevant questions, he was told not to interfere. The defendants were clearly serving their own interests with the intention that the plaintiff be kept in the dark about, and kept out of, the affairs of the companies. As a result of Jeslyn Goh’s persistent refusal to give him information, the plaintiff had to propose a resolution to be passed at the directors’ meeting on 5 October 2004 to authorise Jeslyn Goh to answer his queries directly without the need to obtain approval from Winston Loong or the other directors. The defendants refused to discuss the resolution and it was not put to the vote. THE DEFENDANTS' CASE 99     The defendants submitted that the concept of “participation” in the management of the companies had to be viewed in the context of the nature of those companies and how the plaintiff had previously participated in their management during the parents’ time. They said that if the background facts were borne in mind, it would be clear that they had never excluded the plaintiff from participating in the management of the companies. 100  As the business of the companies was to hold property and collect rental income that business and the daily operations were largely within the competence of the staff from the ground and could generally be left to them. As and when the staff required guidance on such matters, they could approach one or more of the directors for assistance. As for major decisions involving the companies, those remained subject to the consideration and approval of the directors and shareholders at the relevant meetings. 101  During the time of Mr and Mrs Chow, the day-to-day administrative and operational matters were handled by Ms Tan Ai Yong although both parents were frequently in the office. Therefore, there was nothing unusual with the arrangement instituted by the brothers whereby the day-to-day management was left to Jeslyn Goh and the accounting matters were left to Winston Loong. Since the three brothers were in Hong Kong, the arrangement was reasonable, expedient and in the best interests of the companies. Indeed, the plaintiff himself had accepted in court that, as a director, his role was not to “micro manage” the companies and there would be people on the ground doing the work. The defendants had testified that they were happy to let Jeslyn Goh and her team handle day-to-day matters and in fact did so. Therefore the plaintiff was neither singled out nor prejudiced by this arrangement. The plaintiff himself had not taken a part in the management of the companies whilst his mother was alive. He had been content to leave the operations to Ms Tan. It was only after Jeslyn Goh and Winston Loong were appointed that he began to issue incessant letters querying about the companies’ affairs. 102  Dealing with the complaint regarding access to information and documents, it was pointed out that the plaintiff’s pleaded case was that the defendants had denied him “access to information on the company so that he could not make considered decisions to manage the company”. In his further and better particulars of the statement of claim filed on 19 December 2005, the plaintiff particularised the denial of access to information as relating solely to (a) the company resolutions dated 23 November 1992; and (b) the statements and correspondence with CCPL emanating from Westpac Banking Corporation (“Westpac”). 103  With regard to those two items, it was submitted that this information had been given to the plaintiff and therefore his complaint was unfounded. The plaintiff had admitted in his affidavit of evidence-in-chief that when he visited Winston Loong’s office in August 2004, he had been shown copies of the various resolutions he had asked for (ieincluding the 23 November 1992 resolution). By way of his letter to Jeslyn Goh dated 28 March 2005, the plaintiff also confirmed receipt of the company resolutions dated 23 November 1992. It was also relevant that his requests for these resolutions had nothing to do with the companies. Instead, they had to do with the furtherance of the plaintiff’s own personal interest as a beneficiary of the Estate. The plaintiff had admitted in court that he had wanted to see the resolution in order to determine whether he could remove the companies’ auditors for including interest imposed on the Estate’s debts in the audited accounts. 104  As regards the Westpac statements, during examination in chief, the plaintiff had confirmed that he did obtain copies of the Westpac documents. In any case, it was the plaintiff who was the director who had all along corresponded directly with Westpac with regard to CCPL’s account. The plaintiff had confirmed in court that the Westpac bank statements had been sent to him by the bank and that he had knowledge of them. 105  It was asserted that the plaintiff had contributed to the unpleasant nature of the visit to Chow House in August 2004. He had turned up without prior notice and had followed Jeslyn Goh around with a tape recorder. Despite this, Jeslyn Goh had tried her best to accommodate his queries at short notice. As for Winston Loong, since he had not been informed beforehand of the visit, he was out of the office and could not attend to the plaintiff. Although Winston Loong did invite the plaintiff to wait for him to return to his office if the plaintiff required assistance, the plaintiff chose not to do so. The plaintiff was in any case provided with a whole series of documents during his visit. 106  The defendants also pointed to other evidence showing that the plaintiff had been provided with a great deal of information about the companies. As a director, the plaintiff had the right to inspect the companies’ general accounting records. The plaintiff had not asserted that he had been denied access to such records. It had been the practice of the companies to provide the directors, including the plaintiff, with management accounts on a monthly basis. These accounts were very detailed and included balance sheets, profit and loss statements, general ledger entries, bank statements and schedules of rental income received by the companies. In court, the plaintiff admitted that he had been kept informed of all the financial operation of the companies but sought to qualify his admission by stating that he had sometimes needed clarification. He also admitted that when he had questions about the accounts, he would not hesitate to write a letter to obtain clarification. The entries in respect of which he required further clarification related to the loans advanced to Chi and Chuen to pay M/s YLP’s legal fees. It was submitted that he could not have been misled by any error in the description of these loans. Instead, as a party to the proceedings which Chi and Chuen were defending through M/s YLP, the plaintiff knew full well what the payments to M/s YLP were for and these payments had been correctly recorded in the management accounts as loans against Chi’s and Chuen’s running accounts with the companies. As for other queries that he had in relation to the management accounts, the plaintiff had accepted in cross-examination that he could and did clarify them with Winston Loong or Jeslyn Goh. The latter had also confirmed in re-examination that she had supplied the plaintiff with the documents he had asked her for relating to payments to M/s YLP. As evidence of how much information had been given to the plaintiff, Chuen annexed to his written submissions a long list of all the documents and information on the operations of the companies that had been sent to the plaintiff from time to time. 107  The defendants noted that the plaintiff had not cited any authorities where the court had found a shareholder to have been oppressed as a result of the denial of information to him. They considered that the denial of information would have to be very severe before it could be said to amount to an act of oppression against the shareholder. InGuan Seng Co v Tan Hock Chan[1990] 2 CLJ 761, no audited accounts had been prepared for seven years and no AGM held for six years. The Ipoh High Court held that, on the facts, there was no oppression by the majority shareholders, although the minority shareholders “have not been informed of the details of the running of the company since 1980” and this amounted to the disregard of the interests of such minority shareholders. 108  The defendants also relied onLim Cheng Huat Raymond v Teoh Siang Teik[1996] 3 SLR 605. The Court of Appeal in that case took the view that, in considering a plaintiff’s complaint of exclusion from management of a company, the history of the matter, the surrounding circumstances and the reality of the situation should be looked at. The company in that case was a holding company and, as such, the Court of Appeal found that there was “hardly any ‘management’ of the company in any real sense”. In the circumstances, the Court of Appeal found the plaintiff’s allegations that he had been deliberately excluded from the management of the company to be unfounded. 109  The defendants submitted that in the present case and bearing in mind the nature of the companies and the past practice pertaining to them, it was clear that the plaintiff had been furnished with more than sufficient information and documents relating to the companies. Therefore, the plaintiff’s claim in oppression on the ground of denial of information and/or exclusion from management is unfounded. JESLYN GOH'S APPOINTMENT AND BEHAVIOUR 110  Chuen considered that leaving the day-to-day operations to Jeslyn Goh or asking her to revert to the plaintiff’s queries since she was the manager of the companies could not amount to an act of oppression against the plaintiff. 111  In any case, even if she had failed to keep the plaintiff informed about the affairs of the companies, such failure on her part did not amount to an act of oppression of the plaintiff by the defendants. Indeed, Chi, Chuen and Jeslyn Goh herself had all confirmed in evidence that neither of the defendants had ever instructed Jeslyn Goh to deny the plaintiff access to any information to which he was entitled. Thus, any failure by her to keep him informed even if established could not be attributable to them as acts of oppression of the plaintiff. 112  Chi also submitted that no conscious decision had been made by either Jeslyn Goh or Winston Loong to disregard the plaintiff. They had instead reacted naturally to his coarse, overly suspicious and hostile demeanour and the plaintiff only had himself to blame for the strain and unhappiness in his relationship with them. Jeslyn Goh’s evidence was that when she first joined Lee Tung, she had taken the initiative to seek instructions from all three directors and update them on the operational affairs of the companies. The plaintiff, however, appeared hostile when she did so. He made sure from the outset that she knew that M/s Lee & Lee were his lawyers and in that context, expressly told her that her salary would not be “worth it”. He also instructed her not to contact him. He said that he would communicate with her via facsimile if he required anything from her. 113  Chi considered that the plaintiff had behaved unreasonably in relation to Jeslyn Goh. He cited the instance of a letter she had written to the plaintiff to which he had responded “The letter I sent and dated 28thMarch 2005 in regards to safe deposit boxes was addressed to and intended for Dr Chow Kwok Chi, not Ms Jeslyn Goh. Please inform me in what capacity did(sic)you write to me”. In Chi’s opinion, it was unreasonable for the plaintiff to scold Jeslyn Goh simply because Chi had asked her to give an answer to a question which Chi himself was unable to answer. Another example of unreasonable behaviour was the plaintiff’s habit of sending numerous duplicate copies of his letters to the companies’ office. He had also inundated the facsimile machines of Chi and Chuen with copies of his letters until they became fed-up and blocked receipt of facsimiles from the plaintiff. Jeslyn Goh responded in her affidavit to the plaintiff’s allegation that she had torn up his letters on instructions from Chuen. She stated that she had never been instructed by Chuen to tear up the plaintiff’s letters nor had she ever torn up such letters unless they were duplicates of letters that he had already sent. 114  Chi submitted that in the light of her unpleasant encounters with the plaintiff, Jeslyn Goh would, naturally, have been hesitant and reluctant to contact the plaintiff unless the matter was really urgent. This was particularly so in the light of his instructions that she should not contact him. Any trepidation that Jeslyn Goh might have felt in communicating with the plaintiff was entirely of his own doing and could not be attributed to the defendants. She reported more to the other brothers because she was more comfortable with them and because they took active steps to be involved in a positive and substantive way in the running of the companies. They made an effort to help whilst all the plaintiff did was to question and criticise. 115  The plaintiff had set out various minor incidents which had occurred in the course of the companies’ operations from 2003 to date as examples of how he had been oppressed by Chi and Chuen through Jeslyn Goh’s conduct. The bulk of these incidents fell into three categories: complaints relating to the SCB account, complaints relating to correspondence with the BCA and complaints relating to Chow House. 116  The SCB account was needed to make petty cash disbursements and pay the salaries of the staff of Lee Tung and the maids at the residence of Mrs Chow, miscellaneous cleaning and security service fees and miscellaneous expenses of the companies and the estates. Although the account was opened in Chuen’s sole name, the moneys in it were reflected in Lee Tung’s books as belonging to Lee Tung and copies of the bank statements were attached to Lee Tung’s monthly management accounts. The plaintiff had complained that in December 2002, he had co-signed a cheque of $30,000 for the companies when the payee’s name had been left blank and that when he later wrote to Jeslyn Goh about this cheque, she had not given him a proper answer. He complained that it was ludicrous of her to ask him to go to Singapore to get the information. Chuen gave an explanation why this answer had been given – it was meant to convey to the plaintiff that if he wanted to see the original banking documents, he would have to go to the office to do so. Chuen explained in court: The information – you know, if you understand my brother correctly, giving him a copy, he will ask, “Where is the truth? Where is the original?” The plaintiff himself had noted in a letter that Chuen had said that if the plaintiff required further information, he should go down to Chow House “where it is placed”. In any case, the plaintiff’s complaints were not relevant because he had conceded at trial that he did not rely on the incident of the $30,000 SCB cheque as an act of oppression. 117  The plaintiff had said that he was raising this incident as an illustration of his trust in his brothers. It was submitted that, however, the evidence showed that he did not trust them and did not want to work with them. Despite being invited by Chi to do so, the plaintiff did not provide any alternative suggestion on a practical arrangement for the companies to effect miscellaneous payments. From the time he became a director, the plaintiff had not made any real contribution towards the business of the companies nor had he made himself available to assist Jeslyn Goh and Winston Loong. Instead he had simply written numerous letters to them and his brothers setting out detailed queries and complaints which did little to advance the companies’ interests. 118  As regards the plaintiff’s complaints that, without his knowledge, Jeslyn Goh had discussed correspondence received from the BCA with Chuen and sought his advice on the same, Chuen found it difficult to understand the true nature of this complaint. Correspondence with the BCA formed part and parcel of the operational affairs of the companies as they are property holding companies. This correspondence related primarily to the mandatory periodic inspection of such properties for the purposes of the Building Control Act (Cap 29, Rev Ed 1999). The companies own several old shop-houses and therefore the plaintiff must or should have known that the BCA would require periodical inspections of these properties and would require maintenance work to be done on them. Jeslyn Goh approached Chuen for his help because of his undisputed experience in dealing with buildings. Given that both Jeslyn Goh and Chuen had acted in the best interests of the companies in dealing with the BCA’s requirements, the plaintiff had no basis to complain about such acts carried out for the benefit of all the shareholders. The plaintiff himself had never assisted in the maintenance and upkeep of the properties and had not asserted that he wished to deal with the operational issues. When cross-examined by Chuen’s lawyers about the nature of his complaint, the plaintiff admitted he was only taking issue with the “lack or no information” given to him about the correspondence between the companies and the BCA. He did not voice any substantial complaints about the way these issues had been handled so his main objection seemed to be that he was not consulted before the BCA’s enquiries were dealt with. 119  Chuen submitted that failure to obtain the plaintiff’s approval in respect of the companies’ correspondence with the BCA and/or prior to the maintenance or periodic inspection of the properties could not amount to oppressive conduct. That was particularly so when the plaintiff had not shown any interest in dealing with such operational affairs of the companies and also had conceded that he had no issue with Jeslyn Goh taking charge of such day-to-day affairs. Further, whenever the issues raised by the BCA could not be solved in the ordinary course of business, the matter would be referred to all directors for their consideration at a board meeting. 120  The next complaint dealt with the renovation work. Jeslyn Goh had informed Chuen that the toilets were in a dire state and had been complained about by many tenants. Chuen took the view that it would be best to completely renovate them and instructed Jeslyn Goh to obtain at least three quotations and proposals for these works. This was done and Chuen and Jeslyn Goh reviewed the quotations and took the view that Kumpulan Akitek (and their contractor, Prospec) would be the most suitable firm to carry out the work. Chi noted that he himself had received very little information about the renovation work prior to the meeting and submitted that he and the plaintiff as directors did not need to be made aware of all details of the process. At the meeting of the board of ADPL on 16 January 2004 a resolution was passed authorising the company to accept Prospec’s tender for the renovation of the toilets at Chow House at a cost not exceeding $60,000 per floor. The works commenced thereafter and were completed in July 2005 at a total cost of $215,102.85 which was less than the budgeted amount of $240,000. 121  Chuen noted that the plaintiff’s allegation that he and Chi “have something to hide about Kumpulan Akitek” and “took pains not to reveal” its identity by naming Prospec in the agenda for the board meeting was an unpleaded allegation. It was also not supported by the evidence as the monthly management accounts and payment vouchers had clearly identified Kumpulan Akitek as the party carrying out the works. As for the plaintiff’s further assertion that Jeslyn Goh had not furnished him with information received from the potential contractors, that was not sustainable as he had received the notice of board meeting which stated the proposed contractor and the quotation for the works. 122  In court, the plaintiff had stated that he had no doubt that the tenants had been complaining about the toilets. He asserted, however, that it would be unreasonable for the directors to renovate the toilets without discussion with the other directors as the building was very old. It was then pointed out to him that a meeting to discuss the renovation work was held on 16 January 2004 and that he had not attended that meeting due to another commitment. The next question was whether he was suggesting that decisions could not be made unless he was present. The plaintiff’s response was that he was not suggesting that. He was simply saying that for major decisions, it would be good to have a discussion. Subsequently he confirmed that he was not suggesting that the renovation work was in any way a misuse of the power of the directors and it was just that he hoped “we would have a discussion on it with the design and the plans”. 123  On the break-in at Chow House on 17 October 2003, it was true that Jeslyn Goh did not report the matter to the plaintiff immediately after the event. She had explained that this was because the break-in was a minor incident since nothing had been stolen, the only damage (broken locks) was easily repaired, the cost of repair work was recoverable from the insurance policy and steps had been taken to prevent similar incidents from occurring in future. Jeslyn Goh had reported the matter to the police and had obtained a report from a security firm on the break-in which gave advice on how to prevent similar incidents in the future. The defendants submitted that her behaviour was not unreasonable since the plaintiff had given her standing instructions not to contact him. 124  On 24 March 2004, the plaintiff had written to Jeslyn Goh for a full report on the incident. She provided him with the same in April 2004. She also gave him the report from the security company and from the police. Accordingly, the plaintiff had subsequently been given all necessary information and could not be said to have been unfairly prejudiced as a shareholder of the companies. 125  In relation to the plaintiff’s assertion that “Jeslyn was prepared to defy Chi’s express instructions. Her allegiance with Chuen is paramount …”, Chi’s position was that he was prepared to accept that Jeslyn Goh had a closer relationship with Chuen than with the other directors because it was Chuen who had taken the leading role in directing the operational aspect of the companies and had worked closely with her. When he and Chuen had asked the plaintiff “not to interfere with her (Jeslyn Goh’s) management as long as matters are under control”, they were simply trying to protect her from being plagued by a barrage of questions and demands from the plaintiff. If the plaintiff had actually asked to play a bigger management role, Chi would have been very happy to let the plaintiff take over what he had been doing. Winston Loong THE PLAINTIFF'S CASE 126  The plaintiff then turned to Winston Loong. In his view, the latter was Chuen’s crony. For financial compensation, Winston Loong plotted with Chuen to transfer the shares and also to keep the plaintiff in the dark on the affairs of the companies. He asserted Chuen had kept quiet about his early relationship with Winston Loong. Chuen had also terminated the services of the previous accountants in August 2003 without consulting the plaintiff. He then engaged Astute as accountants, also without informing the plaintiff. It was only after Astute’s appointment that Winston Loong was introduced to the plaintiff. 127  Winston Loong had considerable influence over the operations of the companies. This derived from his position as company secretary (from 16 January 2004), from his position as alternate director to Chi and Chuen (from 21 September 2005 to 9 February 2007) and as financial consultant to Chi and Chuen concerning the Estate. He was given so many roles because Chuen wanted someone he could trust to carry out his own and Chi’s instructions in relation to the companies. They used Winston Loong to respond to the plaintiff’s letters to them (the plaintiff gave several examples of occasions when he had written to his brothers and the replies to his letters had come from Winston Loong) and he charged the companies for his time spent. At one point, Winston Loong had even asked the plaintiff to pay for his time taken in responding to the plaintiff’s queries. This was not information sought from Winston Loong himself and he had dealt with the queries on the instructions of the other two directors and therefore there was no valid reason for him to ask the plaintiff to pay for his time. After Winston Loong’s appointment, the plaintiff had difficulty in obtaining information about the companies. 128  The plaintiff also complained about the incentive of a four month rent free period that Astute was given to become a tenant at Chow House. This concession was given by Chuen without consulting either the plaintiff or Chi. Astute was paid a monthly fee of $5,000 to do the accounts for the companies and to keep one staff member at the companies’ office on a full-time basis. 129  The plaintiff complained that Winston Loong had on many occasions withheld critical information from him. It was the plaintiff’s case that this was done with the knowledge and approval of his brothers and pursuant to their instructions. The information withheld from the plaintiff related to: (a)    contracts relating to the renovation work; (b)    resolutions of the companies; (c)    appointment of Knight Frank; (d)    appointment of KPMG; (e)    appointment of MP to obtain legal opinion from senior counsel in Tan Rajah & Cheah; (f)     legal opinion dated 13 June 2005 given by Tan Rajah & Cheah; (g)    legal opinion given by Lim Hua Yong & Co; and (h)    advice on the enforcement of lien. 130  In May and June 2004, the plaintiff wrote several letters to Winston Loong asking for copies of the company resolutions dated 23 November 1992 and for clarification of certain entries in the accounts. Winston Loong replied on 10 June 2004 but the plaintiff did not find this reply satisfactory and decided to visit the companies’ offices to look at the documents himself. He arrived on 26 August 2004 and was able to inspect the board resolutions. He was, however, prevented by one of Winston Loong’s employees, one Mr Ghanshyam, from taking photocopies of documents. Mr Ghanshyam informed the plaintiff that Winston Loong was not in the office and he did not want the plaintiff to take photocopies of documents. The conversation between the plaintiff and Mr Ghanshyam was recorded and it showed that Mr Ghanshyam asserted he was acting on Winston Loong’s instructions. On the same day, the plaintiff asked Jeslyn Goh to show him the contracts for the renovation work. He was told that these documents were with Winston Loong and he could only see them when the latter was in the office. The plaintiff then asked about some documents from Westpac and Jeslyn Goh stating that she was acting on Chuen’s instructions, said that she had to seek Winston Loong’s approval before showing them to the plaintiff. 131  The plaintiff gave some particulars about how he was prejudiced by being kept in the dark about what was going on. He said that had he known about the appointment of KPMG, he would have participated in the process of giving instructions and information to KPMG in order for them to arrive at a more accurate valuation of the companies. As regards the appointment of the senior counsel to give advice on the recoverability of the debts, the plaintiff complained that it was not clear from the opinion received what documents had been furnished to counsel by Winston Loong to enable him to form the opinion. Had the plaintiff known before hand of counsel’s appointment, he would have sought their opinion on whether Mr Chow could be considered liable for the debts when there were discrepancies in the payment vouchers which purportedly contained Mr Chow’s acknowledgement of the loans. At the same time he would have consulted counsel whether the companies could impose interest on the debts. As it was, the issue of interest on the debts was not addressed in the opinion. 132  The plaintiff submitted that the failure to keep him informed of the appointment and appointments was deliberate. It was evidence of the defendants’ intention to exclude him from management decisions and from questioning their intentions to enforce the lien to recover the debts allegedly due from the Estate. 133  As regards his complaint that Winston Loong had failed to advise him on the steps to be taken to recover the loans from the Estate, the plaintiff referred to paragraph 123 of Winston Loong’s affidavit of evidence-in-chief. He stated: Given that [the plaintiff] had taken the clear position in his letter to me dated 30 September 2004 that he had not appointed me to advise him on the settlement of the Estate’s liabilities to the Family Companies and would not be bearing any part of my charges, I did not approach [the plaintiff] further on the matter. I had thought that, if both Chi and Chuen were receptive to my proposal of a selective share buy-back, I could then proceed to take steps to convene the necessary Board and/or general meetings for the Family Companies and leave it to Chi and Chuen to discuss the proposal directly with [the plaintiff] at the appropriate forum. The plaintiff considered this excuse to be disingenuous. Winston Loong was paid for his professional services by the companies not by Chi and Chuen. Therefore, there was no basis for him to suggest that he was not obliged to report to the plaintiff as well. 134  As regards the payment to Lim Hua Yong & Co in April 2006, the plaintiff said that had this not been reflected in the monthly ledgers, he would not have found out that advice had been sought from this law firm. Curiously, the legal opinion sought by Winston Loong from the firm was verbal and there was no evidence as to what the advice was. The payment voucher stated that the payment was for “professional advice for perusing and reviewing documents relating to the lien”. Winston Loong did not explain why he did not convey the advice to the plaintiff. The plaintiff surmised that it was because he did not want the plaintiff to know what he was doing in respect of the recovery of debts from the Estate. THE DEFENDANTS' CASE ON WINSTON LOONG 135  It was submitted that the plaintiff had not produced any evidence to support his allegation that Winston Loong had deliberately breached his professional duties in exchange for financial rewards from Chi and Chuen. The only basis for the plaintiff’s accusations was that Chuen and Winston Loong were primary schoolmates but he had not been able to show that they were close or had even kept in touch after they left school until they made contact again at the 25thanniversary reunion of their class. There was no evidence also to rebut Winston Loong’s testimony that he had dealt with Chi and Chuen on an equal basis in the course of working for the companies. He had not been partial to Chuen simply because of their having been in the same primary school. Winston Loong was a very capable and well-qualified and experienced accountant and held the position of accountant and company secretary for a substantial number of companies. In cross-examination, the plaintiff had admitted that Winston Loong was qualified to hold the appointments he held in the companies. 136  As regards the plaintiff’s allegation that Winston Loong had been handsomely paid $136,407.90 for this services to Chi and Chuen, the submission was that this serious allegation was not supported by the evidence: the sum of $136,407.90 could not be considered excessive in the light of the amount and nature of the work done by Winston Loong for the companies over the period of three to four years in question. He had played a substantial role in advising the directors on various issues, in particular the substantial issues pertaining to the recovery of the Estate’s debt and the exercise of the lien over the Estate’s shares as a means of satisfying the Estate’s debts. Indeed, the plaintiff had received $487,500 in directors’ fees for the year of 2006 alone, when he had made little (if any) contribution to the companies’ business and operations. 137  It was submitted that the plaintiff was not oppressed by Winston Loong’s multiple roles in the companies. The allegation that Winston Loong had been introduced into so many roles because Chuen wanted someone he could trust to carry out Chi’s and Chuen’s instructions and to take their side against the plaintiff, was an example of the plaintiff’s paranoia. The insinuation that the former accountant had been terminated in August 2003 in furtherance of this sinister plot was not supported by the evidence. On the contrary the contemporaneous evidence showed that the services had been terminated because of a potential conflict of interest. 138  The plaintiff’s complaint that he had not been aware of Astute’s appointment was not justified. The evidence was that he had been informed of it very shortly after the appointment in August 2003 and Winston Loong had gone to Hong Kong in September 2003 to introduce himself to the directors and shareholders and begin familiarising himself with the affairs of the companies. He had, however, to leave the meetings because the plaintiff had objected to his presence at the general meeting since he was not an officer of the companies. Winston Loong’s subsequent appointment as company secretary was due to the unexpected resignation of Ms Sng who had had to be replaced at short notice. In any case there was nothing objectionable about a company’s accountant being its company secretary or otherwise being related to it. 139  Chi and Chuen also dealt with the plaintiff’s assertion that Winston Loong had failed to keep him informed of the companies’ affairs. It was submitted that even if he had done so (which was denied), such inaction on Winston Loong’s behalf could not be considered to be an act of oppression by Chi and Chuen. Various submissions were made in respect of the list of items of information (see [129] above) that the plaintiff had complained had been withheld from him. 140  First relating to the renovation work, that was an issue that was primarily handled by Chuen as his expertise and experience as an architect qualified him to handle the maintenance and operational issues pertaining to the properties. The plaintiff was not selectively excluded from this process. Chi too was uninformed of this issue but he was happy to leave the matter to Chuen to handle it since that was not his area of expertise. In any case, the plaintiff had later received the quotations and proposals for the renovation work. Second, in respect of the 1993 resolutions, Chi had no personal knowledge of this episode. He did not instruct Winston Loong or his staff to withhold any documents from the plaintiff. Third, the next six issues were all matters concerning enforcement of the lien over the Estate’s shares. They were pursuant to Chi and Chuen’s legitimate decision to seek to recover the debts due to the companies. The appointment of Knight Frank, KPMG, MP and Lim Hua Yong & Co were all consequential to the basic decision to recover the outstanding loans from the Estate. The fact that the scheme to recover the debts were not successful could not be counted against the defendants since they had relied on the professional advice given by Winston Loong. Chi did not gain any advantage for himself by pursuing this option and had always relied on Winston Loong’s advice as the latter was an experienced and qualified professional. Further, since the scheme had been set aside, any alleged non-provision to the plaintiff of information relating to the exercise of the liens would now be entirely irrelevant for the purpose of considering the plaintiff’s claim in oppression. He had suffered no prejudice as a result. 141  Winston Loong had commissioned the reports from Knight Frank and KPMG without first obtaining the plaintiff’s approval because resolutions passed at the board meetings on 20 July 2005 had given him the authority to take the necessary steps to enforce the lien or recover the debts. One of the necessary steps was the valuation of the companies’ assets, including the properties, and the affixing of a price for the companies’ shares. Expert advice was needed on such matters. 142  The KPMG report was issued on 23 August 2005. Copies of it and the Knight Frank report were sent out to all directors on 15 September 2005. The reports were adopted at the board meetings on 21 September 2005. The plaintiff had confirmed in court that he did not object to the obtaining of the reports. Instead, he identified his unhappiness as being that he would have loved to discuss the matter with his brothers but was denied the opportunity to do so. In his submissions, he said that he would have given KPMG information so that the valuation would have been more accurate. It was submitted that he had had ample opportunity to discuss the reports. He had notice of the board meetings and could have attended them but did not do so. His stated concern that the KPMG report was based on outdated information was not credible. The administrator of the Estate had never challenged the accuracy of the reports. He had only questioned the validity and quantum of the Estate’s debts. 143  Chuen dealt with the plaintiff’s complaint that he and Chi had had from time to time requested Winston Loong to respond to the plaintiff’s letters on their behalf. He said that since Winston Loong was the companies’ accountant and secretary and worked closely with Jeslyn Goh with regard to the affairs of the companies, it was not unreasonable for Chi and Chuen who were not directly handling these matters to ask Winston Loong to reply directly to the plaintiff’s queries. Winston Loong himself had confirmed that he had more knowledge on various questions regarding corporate secretarial and accounting matters than the directors had. The plaintiff had nothing to complain about as long as he got a proper reply. He did not allege that the responses were inadequate. 144  As regards the assertion that Winston Loong had charged the plaintiff for answering his queries, Chuen submitted that there was only one incident when Winston Loong had made a request to this effect. This happened when the plaintiff wrote to Winston Loong on 16 December 2004 asking for information relating to almost all the transactions enumerated in the companies’ monthly management accounts for September and October 2004. After receiving the letter, Winston Loong spent a substantial amount of time going through the documents supporting each of the transactions so that he could reply to the plaintiff on the matter on 2 February 2005. As the defendants took the view done by him in replying to the plaintiff’s letter did not amount to work done on the companies’ behalf, they asked Winston Loong to request that the plaintiff pay for such work. The plaintiff did not pay. 145  In May 2004, the plaintiff asked questions about several matters which had occurred in the companies before Winston Loong was appointed. In order to answer these queries (which related to matters that occurred as far back as 1962 and 1981), Winston Loong had to spend time going through the companies’ old records. In the end, Winston Loong billed the companies for the time spent. 146  The defendants also rebutted the complaint that Astute had, unjustifiably, been given an incentive to move to Chow House. In their view, there was a commercially justifiable reason for this. There was nothing improper with a prospective tenant being given an incentive to move to a building as old as Chow House. Further, it would be advantageous for the companies to have their accountant located in the same building as a paying tenant. Chuen’s testimony was that ADPL usually gave prospective tenants a two-month rent-free period. In this case, there had been negotiations about the rent to be charged and because Chuen wanted to maintain the rent at a certain level in view of the market outlook, he agreed to a four-month’s rent-free period instead of a lower rental. The decision had been made by Chuen but Chi had subsequently agreed to it. The fact that the plaintiff disagreed with such a business decision made by the majority of the directors did not mean that he had been oppressed as a shareholder. 147  The plaintiff had complained that Winston Loong had failed to advise him on the steps regarding the recovery of the Estate’s debts and/or the enforcement of the lien. The defendants said that this allegation had to be considered in its proper context. They had first asked Winston Loong to provide such advice in early 2004. On 18 March 2004, Winston Loong had advised the plaintiff that he would be assisting the three brothers in taking steps to settle the debts. Then in September 2004, he had advised them of the various options available. On receipt of this letter, the plaintiff wrote to Winston Loong to make it clear that he had not appointed Winston Loong to advise him on the matter and would not bear any part of Winston Loong’s charges. In view of this, it was not unreasonable for Winston Loong to take the view that the plaintiff need not be informed contemporaneously of any step taken by him and/or his detailed views on the recovery of the debts and the exercise of the lien. He made sure, however, that the plaintiff was given all notices of meetings and therefore had the opportunity to attend all meetings held to discuss the issue. By the time concrete steps were being taken to recover the debts, these oppression actions had already been started and in these circumstances the plaintiff could, and did, obtain most of the information and documents sought by him in the course of the oppression actions. Therefore, there was no evidence that he had been unfairly prejudiced or otherwise oppressed by Winston Loong’s alleged failure to update him on every step taken by the companies to recover the debts. 148  Chuen submitted that to the extent of his entitlement under the law, the plaintiff had never been unfairly denied access to material information relating to the companies or for participating in their management. What the evidence showed was that by persistently asking for various information and documents from Chi, Chuen, Jeslyn Goh and Winston Loong, the plaintiff was not really interested in advancing the interests of the companies. He was only trying to make it difficult for Chi and Chuen to perform their duties to the companies. In particular, his various requests for information and documents and/or complaints was substantially motivated by his personal desire to prevent the companies from recovering the Estate’s debts. Conduct of board and general meetings THE PLAINTIFF'S CASE 149  Turning to the complaint about the conduct of board and general meetings, the plaintiff laid stress on his legal entitlement as a director and shareholder. He highlighted the following observation of Romer LJ inRe H.R. Harmer Ltd[1958] 3 All ER 689: I accept the submission of counsel for the petitioners that shareholders are entitled to have the affairs of a company conducted in the way laid down by the company’s constitution. Members are entitled to expect that their board shall perform its functions as a board and that the proceedings of the directors shall be carried out in a normal and orthodox manner. They are entitled to the benefit of the collective experience of the directors, and to expect that the directors and each of them can freely express their views at board meetings and that regard shall be had to what they say and to resolutions properly passed. If the board is browbeaten and either ignored or overruled by one of its number, in this case the father who was the chairman, in reliance on his superior voting power, the proprietary interests of the minority shareholders cannot fail to be affected and a case of oppression within s 210 is, in my judgment, made out. 150  As regards the issue of notice in relation to the calling of directors’ meetings, the Hong Kong case ofSeg Investment v Seg International Securities (HK) Ltd[2005] HK 1633was cited by the plaintiff for the proposition that the length of the notice should be reasonable in all circumstances. The underlying reasons for reasonable notice are set out in the judgment of Deputy Judge A To as follows: 10.    The Articles and Table A are silent as to the formal requirements of an adequate notice, such as the length of the notice, the information as to the nature of the business to be transacted and whether such notice must be in writing. Unlike shareholders, directors are agents of the company who have to deal with the day to day affairs of the company as and when they arise. They may have to make urgent decisions which are within their authority to make. A company cannot function if there are stringent rules as to the formal requirements of notice of any directors’ meeting. Thus unless the articles of association require otherwise, notice of a board meeting may be given orally: seeBrowne v La Trinidad(1887) 37 Ch D 1. The notice may be a very short one, but it must given a reasonable time before the meeting to enable the director to whom the notice is given to attend: seeBroadview Commodities Pte Ltd v Broadview Finance Ltd[1983] HKLR 384[1983] 2 HKC 578andBrowne v Trinidad(1887) 37 Ch D 1. Unless the articles of association provide otherwise, there is no need to state the business to be transacted at the meeting : seeLa Campagnie de Mayville v Whitley[1896] 1 Ch 788. 11.    However, the absence of any provision in the articles of association as to the formal requirement of a notice does not mean that the majority directors may conduct the proceedings capriciously or arbitrarily. … The purpose of the notice is to enable directors to attend the meeting so that the company may have the benefit of receiving the collective wisdom and contribution of all directors before deciding its action. The overriding principle is that such notice must be reasonable in all the circumstances. 12.    So far as the length of the notice was concerned, short as it may be, it must be such as would allow the recipient adequate time to present himself at the meeting, otherwise the purpose of the notice is defeated. However, this is not an inflexible rule. What is reasonable depends on all the circumstances. If there are pressing decisions which cannot be delayed until all directors are available, the board would have to hold a meeting at such short notice as would enable as many directors as possible to attend without risking the consequence any failure to take prompt action may cause. 13.    The general rule that it is not necessary to state in the notice the nature of the business to be transacted at the meeting is also not an inflexible one. It is also subject to the overriding consideration of reasonableness in all the circumstances. It is not a rule without qualification. If it were, some directors at a meeting may, upon finding it opportune to do so, pass any resolution which they know would not be passed had other directors been present at the meeting. That could not be right. The result would be a state of anarchy. In my view, that rule only applies where the business to be transacted are the ordinary business of the company. If there are important or extraordinary business which is proposed to be transacted at the meeting, some notice of the nature of the business to be transacted must be given. As I said inThe Grande Properties Management Limited and Sun Wah Ornament Manufactory LimitedHCA 4741/2001, it is a cardinal principle in the law of meetings that notice of meeting must be sufficiently detailed to enable a member who knows nothing of the matter to decide whether he need to attend the meeting, or whether he can safely let the resolution be passed without further inquiry. Adapting that principle to a board meeting, the principle is that the more important is the business to be transacted, the greater is the need to state the nature of the business to be transacted in the notice. 151  The various articles of association of the companies in this case contain provisions specifying the notice periods to be observed when general meetings are called. The articles, however, do not provide for any particular notice period to be observed when a directors’ meeting is called. 152  The plaintiff pointed out that Winston Loong had confirmed that generally the plaintiff was not consulted when meetings of the board as well as annual general meetings (“AGMs”) were convened. Except for one occasion, Winston Loong consulted only Chi and Chuen when deciding on the time and place for meetings. He submitted that the evidence showed that his schedule was not considered at all and, as soon as the dates of the meetings had been decided by Chi and Chuen, the meetings would proceed as scheduled. Further, the evidence was that the manner in which Chi and Chuen conducted both directors’ and general meetings prejudiced the plaintiff. 153  In support of his assertion that Chi and Chuen proceeded with meetings at a time and place of their choosing without giving reasonable notice to the plaintiff and without complying with the various articles of association, the plaintiff relied on various pieces of evidence. 154  First, he cited the instance of the AGM held on 7 March 2003. At that meeting, Chi had tendered a piece of paper proposing that three additional resolutions be passed. These were to ratify the decision that any two directors be authorised to sign cheques and financial instruments on behalf of the companies, to ratify instructions given to M/s YLP to act on behalf of the companies on various legal matters and to pay certain club dues. These resolutions had not been on the agenda of the notice of meeting sent out previously and when the plaintiff had enquired if any other business would be discussed at the AGM, Chi had given him a negative answer. At the AGM, despite the plaintiff’s objections to the new resolutions, they were passed without much discussion. The plaintiff pointed out that during cross-examination Chuen had admitted that the failure to give sufficient notice of the additional resolutions was Chi’s fault. 155  The second instance was of the directors’ meeting for each of the companies held on 16 January 2004. In June 2003, Ms Sng, the then company secretary, advised the plaintiff that in the absence of a specific notice period in the articles of association, reasonable notice of directors’ meeting should be given and that it was the practice of the companies to give seven days’ notice. Winston Loong had agreed with this view after some prevarication. Notwithstanding that, notice of the 16thJanuary meeting was given only on 14 January 2004. The purpose of the meetings was to accept Ms Sng’s resignation, to appoint Winston Loong as secretary of the companies and to discuss the question of imposing interest on loans. In respect of the ADPL meeting, it was additionally proposed that Jeslyn Goh and Winston Loong be authorised to accept a specific tender for the renovation work. The plaintiff objected to the short notice of the meeting as he had an operation to perform at the scheduled time. He asked for the meetings to be adjourned but Chi and Chuen did not agree and proceeded with the meetings in his absence. 156  The plaintiff submitted that most of the resolutions were not of an urgent nature and the directors were not required to make decisions on two days’ notice. Ms Sng had already resigned and it was not critical to pass the resolution to accept her resignation. The companies’ auditors had not indicated that a replacement had to be found immediately. Further, s 171(4) of the Act provides that the office of the company secretary may be left vacant for six months and any other company officer may undertake the duties of the company secretary until such appointment. There was therefore no urgency to pass the resolution to appoint Winston Loong as company secretary and it was reasonable for the plaintiff to ask for more time to consider the proposed appointment. As for the issue of the renovation work, prior to notice of the meeting, the plaintiff had had no indication that renovations were contemplated. He was not given information on the proposed works in time for the meetings. The evidence of Winston Loong, Jeslyn Goh and Chuen was that Winston Loong and Chuen himself had been working on this issue since October 2003. There was nothing apart from Chuen’s bare allegations to support his assertion that immediate action on the renovations was required. 157  The plaintiff also took issue with the fact that the proposed resolution stated that the contractor to be appointed would be Prospec FE Pte Ltd (“Prospec”) when the company which had submitted the quotation was called Kumpulan Akitek. The plaintiff thought that Chi and Chuen had something to hide about Kumpulan Akitek and therefore took pains not to reveal the identity of the entity which would do the works. In any case, if the issue of the renovations was a critical one, why was it not dealt with at length. Chi admitted that the discussion on this issue took only five minutes. 158  As regards the resolution to impose interest at six percent per annum on the Estate’s debts, Chuen had agreed during cross-examination that this was not an urgent issue which required a resolution on two days’ notice. This was a matter that had been on Chuen’s mind since August 2003. The plaintiff submitted that his brothers were intent on imposing interest and that was why they did not agree to postpone the meeting. They did not want the plaintiff to attend the meeting and ask awkward questions on the issue. THE DEFENDANTS' RESPONSE 159  The stand taken by the defence was that the plaintiff had to show that there had been a visible departure from the standards of fair dealing and that it could not reasonably be expected by the plaintiff that the affairs of the companies would be conducted with superhuman punctiliousness and meticulousness. The following passage fromMinority Shareholders’ Rights and Remedies(Lexis Nexis, 2ndEd, 2007) by Margaret Chew was cited in support of this proposition: In so far as procedural irregularities are concerned, the fact that the majority’s management of the company has caused it to fall short of requirements in the company’s articles or the Companies Act may not be considered unfair vis-à-vis the minority.It isnot expectedthat the affairs of the company would be conducted withsuperhuman punctiliousness and meticulousness. After all, the common law provides for ratification of procedural breaches by the majority and currently, section 392 of the Companies Act provides for the regularisation of irregularities where no substantial injustice is caused. Furthermore, breaches of the Companies Act have appropriate sanctions provided. Therefore,isolated irregularities may not amount to oppressive behaviour. Oftentimes, however, procedural infringements that form the subject of minority complaint are symptomatic of a greater problem of disharmony between controlling and non-controlling shareholder factions. It is suggested that anendemic failure to comply with the company’s constitution or the Companies Act could amount to oppressive or unfair conduct under section 216, for it jeopardises the system of minority shareholders’ safeguards provided by the legislature in the Companies Act … So, in most circumstances, it could be safe to say that there is an implied understanding amongst shareholders inter se that the constitution and the Companies Act would be complied with,to the best of the abilities of the management and the administration, withleewaygiven for theoccasional lapse(but not wheresubstantial injusticeis caused). [Emphasis added] 160  The defendants’ submission was that in this case there was no endemic failure to comply with the companies’ constitutions or the Act such as to amount to oppressive or unfair conduct under s 216. 161  First, during cross-examination, the plaintiff had retracted some of his complaints. He claimed that such “complaints” were actually only his “suggestions” to his brothers. For example, in relation to their voting in favour of the proposed resolution at the board meetings on 7 March 2003, that any two or three directors could jointly sign cheques, the plaintiff admitted that there was no need for all three directors to sign cheques. He said this was merely a suggestion he had made and that when his brothers disregarded his suggestion, they were free to do so. Another example was the complaint made by him in his affidavit in regard to the meetings of 26 September 2003. He made no reference to these meetings in his closing submissions. He must have dropped this complaint. 162  Secondly, the meetings had not been conducted in a manner that was substantially different from how they were conducted during Mrs Chow’s time. For instance, meetings by way of telephone conference were sometimes conducted at that time. Thirdly, any procedural improprieties were isolated instances and had been rectified. The plaintiff’s request that additional proposed resolutions be inserted into the agenda for the board meetings on 5 October 2004 were finally carried out. Since the resolutions had been reinstated, the defendants could not understand how the plaintiff could still allege that his request had disregarded. 163  Regarding his complaint that the plaintiff was not consulted beforehand on the place and time for the companies’ meetings, the defendants could not see how this amounted to oppression. Nowhere in the Act or the memoranda and articles of association is there any requirement that all members and directors must be consulted on the time and place of the meeting before notice of the meeting can be issued. 164  The plaintiff had complained that he was given short notice of the board meeting on 16 January 2004 and 11 March 2005. He was also not happy with the fact that the companies’ AGMs were held on 5 October 2004 shortly after the conclusion of the board meetings the same day. It was submitted that the complaint was not justified as there was no requirement in any of the articles for a minimum number of days’ notice of a board meeting to be given to the directors. During cross-examination the plaintiff had asserted that usually seven days notice should be given though if the matter was extremely urgent, a meeting could be called within one or two days. He agreed that this was not stated in the articles. He also agreed that although his lawyers had written to protest the short notice, they had not asserted that the meeting could not be held because a specified period of notice had not been complied with. 165  Responding to the plaintiff’s point that it was not necessary to hold the meeting on 16 January 2004 in order to appoint a replacement company secretary since the Act allows six months for such vacancy to be filled, Chuen averred that the board has the prerogative to decide when a new appointment should be made. The plaintiff himself had agreed in court that the directors had the right to make the appointment at any time within six months and need not wait till the end of that period. Chi considered that it was necessary to appoint a replacement company secretary urgently. All the directors being resident in Hong Kong, it was necessary for a qualified and experienced company secretary to be appointed to ensure that board meetings and shareholders’ meetings were properly convened and recorded and all statutory registers of the companies were properly maintained. 166  The plaintiff had asserted that his brothers gave short notice of the meetings as they did not want him to attend them to ask awkward questions about why interest should be imposed on the Estate. On 14 January 2004, however, the plaintiff had already written to Winston Loong to state that he agreed that interest should be charged by the companies to the Estate though he believed that this should be a unanimous decision of the directors and therefore he wanted to know what the other directors recommended. Thus, at that time, Chi and Chuen had no reason to believe that the plaintiff would ask any awkward questions regarding interest at the meetings. They themselves supported the imposition of interest. In those circumstances they said, a board meeting would not even have been necessary since all the directors had agreed on the course of action. 167  During cross-examination, the plaintiff had tried to resile from the statement he made in his letter of 14 January 2004,ie: I refer to your letters dated 17 December 2003 and 9 January 2004 concerning ‘amount owing by the Estate of Chow Cho Poon’ to the above three companies. I agree that interest should be charged by the company to the Estate. However I believe this should be unanimous decision by all the directors, and I await to hear what the other directors recommend. The effect of his testimony in court was that the foregoing statement should not be taken at face value but meant that the plaintiff had a preliminary view that would have to be considered in relation to the other directors’ opinions and that he hoped that it would be a unanimous decision by the trustees of the Estate. The defendants contended that following passages from the cross-examination are instructive: Mr Yim :Thank you. Two things spring out from this letter before the directors’ meeting on 16thJanuary 2004. First you were agreeable that interestshould be charged by the company to the estate, am I not right?A :I believe, but at that time ……A :I am of the belief at that time that interest should be charged awaiting directors’ discussion and latest development.Q :I don’t know where you get that qualification to that simple sentence that you wrote yourself, Dr Chow.A :All right. I just read from your record… No, I was – It was a preliminary view that would have to be considered in relation to the other directors’ opinions and recommendations and also later developments.…A :No, what I said at that time was –Court :Yes?A :-- that I hoped it would be a unanimous decision by the directors but that it also has to be unanimous decision by the trustees of the estate of Chow Cho Poon.Mr Yim :In your letter there was no mention about “unanimous decisions of trustees”. You say quite clearly “unanimous decision by all the directors”, plain and simple, right?A :I also say I await to hear what the other directors recommend and I want to hear the latest development, meaning that we may have to seek legal opinion as to whether we can do that or not. I am afraid my letter is taken out of context. 168  In the light of the evidence, it was submitted that there was no basis for the plaintiff to allege, as he had in his affidavit, that the holding of the meeting with two days’ notice was to allow Chi and Chuen to “bulldoze their way to pass the resolutions concerning the imposition of interest for the loans owed by [the Estate] and the upgrading”. This was especially so when in court the plaintiff accepted that his preliminary view had been taken into account. Subsequently, the plaintiff had written to his brothers stating that he was “astounded” to see the minutes of the 16thJanuary 2004 meetings but had not mentioned in that letter that he objected to the imposition of interest on the Estate. 169  The plaintiff had also commented that the issue of the renovation work could not have been a critical one as it could not have been discussed in detail since the entire meeting for ADPL took only five minutes. The response was that this was how long it took for the resolution to be passed and that there was no reason for it to have taken any longer when it was not disputed that the toilets of Chow House were in a dire state. There was also no prejudice to the plaintiff since the majority of the directors supported the resolution and it was passed for the benefit of ADPL. 170  Turning to the board meetings of 11 March 2005, the plaintiff’s complaint was that he received the notices of the meetings only on 10 March 2005. Winston Loong had testified that the notices and agendas were despatched to all directors at the same time and neither of the others had complained about late receipt of the same. In any case, the defendants said, the meetings were meant only to decide whether EGMs of the companies should be convened on 5 April 2005. Therefore, this could not have oppressed the plaintiff or unfairly prejudiced him or unfairly discriminated against him. 171  In relation to the board meetings and AGMs of 5 October 2004, the complaint was that the notices for the AGMs were issued on 17 September 2004 even before the directors had passed the necessary resolutions to call them. He asserted that at least 14 days’ notice from the time of the directors’ approval of the audited financial statements had to be given for the AGMs. The response was, of course, that no such requirement was specified in the articles and further that short notice may be cured by the presence of all members of the company (seeShackleton on the Law and Practice of Meetings(Sweet & Maxwell 10thEd, 2006) (“Shackleton on the Law and Practice of Meeting”) at 137. It was submitted that where the directors and shareholders were the same persons and the directors had already approved the audited financial statements at a board meeting, it was pedantic to insist that another 14 days elapse so that the AGM could be convened for the same persons to approve the audited financial statements in their capacity as shareholders. No prejudice was caused to the plaintiff by the manner in which the meetings were held since, as he agreed in court, he had received the audited accounts well before the date of the AGMs. 172  The defendants dealt with the plaintiff’s complaints regarding the resolutions proposed at the board meetings of 5 October 2004. His first complaint was that the additional resolutions proposed by him had been amended without reference to him by Winston Loong. The defendants considered the amendments reasonable because the original resolutions focused on the plaintiff himself and the amendments made broadened them so that they applied to all the directors. The plaintiff himself had agreed during cross-examination that it was reasonable to resolve that any director and not just the plaintiff would have the right to inspect the companies’ books and that such a resolution would give him the same freedom as the others. In his closing submissions, the plaintiff had admitted that the proposed amended resolutions appeared neutral. The defendants also argued that there was no basis for the plaintiff to object to the amended resolution that any two of the three directors be authorised to instruct solicitors on behalf of the companies for an opinion on whether the Estate was indebted to them. It was not logical for him to insist that he alone be authorised to give such instructions. In any event, all the additional resolutions the plaintiff had proposed were reinstated when he objected to Winston Loong’s amendments. So there was no prejudice to him. The fact that his reinstated resolutions were not passed thereafter was not indicative of unfair prejudice to him as it was clear from the amendments that had been proposed that Chi and Chuen wanted resolutions that applied to all directors and not just the plaintiff. 173  There were complaints about items not stated in the agenda being raised at the meetings of 20 July 2005 and 5 May 2006. The response regarding the additional proposed resolutions for the board meetings on 20 July was that the plaintiff was notified of them when he received the additional agenda dated 12 July 2005 and that he would have received this by 18 July 2005. The resolutions were not hidden from him but he chose not to attend the meeting. As regards the 5 May 2006 resolutions, they were duly passed. 174  The next complaint related to the EGM of ADPL on 29 May 2006. None of the brothers attended it in person. Chi and Chuen listened to the proceedings over the telephone and proposed that the directors’ fees for the year be paid immediately. The plaintiff objected that he was not given due notice of the amendment to the proposed resolution. Nicolas Cheong, a legally trained person and the plaintiff’s proxy at this meeting, considered that the approval of directors’ fees at an EGM called for the purpose of setting the amount of the fees, was only unusual and not wrong as a matter of law. He admitted that the plaintiff had suffered no prejudice because Winston Loong had accepted Nicolas Cheong’s objection to the amendment and Chi and Chuen then voted on the unamended resolutions for two out of the three companies. As for the third company, they passed the amended resolution. The defendants submitted that there was no prejudice to the plaintiff by reason of this vote as Nicolas Cheong had testified that he was instructed to vote against the proposed resolutions to pay the directors’ fees in any event, whether they remained in their original forms or were amended. 175  A number of the meetings were held by telephone conference. The plaintiff objected to this. He alleged that conduct of the meetings in this way was intended to discriminate against him and exclude him from managing the companies. The defendants said that since the plaintiff deliberately chose not to attend any meeting held by telephone conference, he should not have complained about additional matters being raised at such meetings. In any case, additional matters may be discussed under the “Any other business” portion of the agenda in the notice of meetings as long as the chairman is agreeable and the majority passes the resolution. This response they said applied to directors’ meetings on 20 July 2005, 21 September 2005 and 7 November 2005. The plaintiff had acted irrationally by simply refusing to participate in board meetings, even if he could physically attend, so long as he thought that there would be one party participating by way of telephone conference. There were meetings scheduled for 15 August 2006 which the plaintiff refused to attend even though he was in Singapore for the meetings because of his discovery that his brothers had not flown down to attend them. He then complained that he was shocked to find out that the meetings proceeded via teleconference after all. He had deliberately chosen not to attend the meetings even when he was in Singapore and was invited to attend. The defendants submitted that holding the meetings in this way had not oppressed the plaintiff or caused his interests to be disregarded or prejudiced. 176  Chi noted that in the plaintiff’s objections to teleconference meetings, he had relied on the fact that Winston Loong had initially advised that under the articles of the companies, this mode of meetings was not permitted. In court, the plaintiff had agreed that while his mother was alive, there had been some teleconference meetings but he asserted that these meetings were basically to discuss matters concerning the Estate with some company matters thrown in. He was shown documents indicating that at least one of these meetings had dealt with the companies’ business because the matter discussed was the appointment of a new company secretary. He was then asked whether he agreed that there were meetings of the companies in which telephone conferencing was employed, never mind that at the same meetings Estate matters may also have been discussed. The plaintiff’s response was “No, I think it was estate matters in which company meetings were put in”. Chi categorised this response as pedantry on the plaintiff’s part. The plaintiff was clearly aware and had been involved in telephone conferences discussing the companies’ affairs prior to his mother’s death. He was not prejudiced by the decision to conduct board meetings in this way either before or after his mother’s death and he was simply trying to inconvenience his brothers and make their lives as directors of the companies as difficult as possible. Chi also submitted that teleconferencing was an acceptable option to himself and Chuen because they were not comfortable meeting in person as a result of the shouting matches and rows that had occurred during physical board meetings. He testified that such physical meetings were not pleasant to persons in the vicinity as there were quarrels and loud voices. In fact there had been so much disagreement at one meeting held at the premises of Deloitte & Touche that that organisation had refused to provide a venue for a subsequent meeting. 177  The defendants noted that the articles of association do not prescribe how meetings should be conducted. Considering that the three directors lived in Hong Kong, that Chuen often travelled overseas and that Winston Loong or Jeslyn Goh would have to attend the meetings to provide information on the affairs of the companies, conducting meetings by way of telephone conference would be convenient. Chuen citedShackleton on the Law and Practice of Meetingsin support. The text at 246 states: It is not essential to the validity of an act of the board that the directors shall, at the time of reaching a binding decision, have been all assembled together in one place under one roof. In today’s conditions, for example, directors situated in several different places can be connected for a conference by telephone or television; provided it had been duly convened as such, this would constitute a valid board meeting. The case ofRe Associated Color Laboratories[1970] Carswell BC 8 cited by the plaintiff was distinguished on the basis that the articles of association of the company concerned provided that a director who was to be absent from British Colombia or who resided outside British Colombia could appoint an alternate to attend and vote at meetings. The British Colombian Supreme Court considered that the framers of the articles, having made such specific provision, did not contemplate directors meeting over the telephone. Chuen also cited a more recent Australian case,Wagner v International Health Promotions(1994) 15 ACSR 418 where the judge held that there was no need for directors to gather physically together at a directors’ meeting and they could “meet together” within the meaning of the articles as long as there was a meeting of minds made possible by modern technology. 178  The plaintiff had complained about proposed resolutions having to be seconded before they could be tabled for discussion. At the 12 April 2005 meetings, no one seconded his proposed resolution to instruct senior counsel to advise on the recoverability of the loans taken by the two estates and his assertion was that the requirement of a seconder was meant to defeat his attempts to have issues discussed at the meetings. The response was that the plaintiff had ample opportunity to raise issues during meetings but he refused to attend them. Nevertheless, he still managed to raise many issues in writing. The articles do not specify how meetings are to be conducted and even the plaintiff had admitted that it was up to the directors to decide whether to require a seconder. More importantly, if there was no seconder to the resolution, it would not be passed because there were only three directors in the companies. 179  The plaintiff had made the following complaints in relation to the minutes of meetings: (a)    that the minutes were inaccurate; and (b)    that the minutes were either not sent to him or sent to him after much delay. 180  The inaccuracy complaint was made in respect of the minutes of 5 October 2004 meetings. The plaintiff said that his objection to the proposed resolution to transfer Chuen’s shares to Rice Properties Pte Ltd had not been recorded. The response was that the fact stated in the minutes,ie, that the resolution had been passed by a majority of directors present and voting, was accurate. Chi had agreed to the proposal as Rice Properties Pte Ltd was owned and controlled by Chuen. In any event, the transfer did not take place as the plaintiff’s objections were taken into consideration. 181  Another inaccuracy pointed out in the same set of minutes was that they showed that the plaintiff objected to a particular resolution when he had in fact abstained from voting. Chuen did not see how this inaccuracy was evidence of oppression or disregard or prejudice. 182  In relation to the second complaint, the response was that the circulation and keeping of minutes was Winston Loong’s job and neither Chi nor Chuen had instructed him not to circulate minutes to the plaintiff. The evidence showed that Winston Loong only sent minutes when asked and not as a matter of course. This practice was defended on the basis that there was no requirement under the Act or in the articles for minutes to be automatically circulated to all directors and shareholders. Winston Loong testified that he had not asked either Chuen or Chi for permission to send minutes to the plaintiff and that a note to this effect typed on a letter from the plaintiff asking for minutes had not been prepared by him but by his staff as he had not been in the office at the material time and the staff were unsure whether they should send the minutes to the plaintiff as the oppression actions had already been commenced. Whilst Winston Loong had not been prompt in sending the plaintiff the minutes he requested, this was not the fault of his brothers. In any case, the plaintiff was not prejudiced as he eventually received the documents. Further, the minutes were merely a record of what had occurred and in most cases, the plaintiff was well aware of what had happened. He had, for example, tape recorded the proceedings during certain of the meetings and at other meetings, his proxy, Nicolas Cheong, had been present. If the plaintiff needed the minutes urgently, he could simply have picked up the telephone and asked Winston Loong to send them over by facsimile transmission. He never did that. He knew he could get all the documents he needed through the discovery process in the oppression actions. Miscellaneous complaints relating to management OPENING OF THE SCB SAFE DEPOSIT  BOX 183  The plaintiff’s complaint here was that because the resolution passed by the directors on 20 July 2005 to open the companies’ safe deposit box at SCB was not sent to that bank, the box could not be opened. The plaintiff accused his brothers of refusing to put this resolution into effect. Up to the time of the trial, the box had still not been opened. The plaintiff also claimed that at the trial Chi had sought to embellish his case when he stated that Jeslyn Goh had persuaded SCB to break open the safe without the requisite three working days’ notice. The plaintiff had submitted that this evidence was only an afterthought as there was no documentary evidence that the bank had acceded to Jeslyn Goh’s request or that the plaintiff had been informed of such concession. 184  Chi submitted that his evidence on this point was fully corroborated by Jeslyn Goh who had stated in her affidavit that because she had impressed upon SCB that two of the three directors had flown in to Singapore from Hong Kong to open the safe deposit box on 5 April 2005, the bank had agreed to have its contractor present to break open the box if the keys could not open them. Jeslyn Goh recalled that on the morning of 5 April 2005, the AGMs had proceeded in a meeting room at Chow House. She heard the plaintiff raise his voice and thereafter he walked out of the room in an angry manner. He was followed by Chi and Mr Allan Tan (Chuen’s proxy at the meeting) who tried to persuade him to stay on for the meetings. Chi also asked the plaintiff to stay on so that both of them could inspect the safe deposit box in the afternoon. The plaintiff ignored them. He did not attend the AGMs nor did he attend at SCB in the afternoon to inspect the box. 185  Chi had testified that thereafter the box had not been opened because he did not want to open it in the absence of the plaintiff. He said that he and Chuen were afraid that if they opened the box and the plaintiff was not there, they would be held responsible for anything that might be lost. It was submitted that Chi and Chuen had a real and substantiated fear that the plaintiff would accuse them of helping themselves to the contents of the box when he was not present when it was opened. This explanation was entirely believable given the plaintiff’s character. The plaintiff himself did not do anything further to follow up on the issue. AUDITED ACCOUNTS 186  The plaintiff made complaints in connection with the audited financial statements tabled on 5 October 2004, 31 August 2006 and 15 September 2006. He asserted that Winston Loong and his brothers did not care to observe the proper procedures because they convened AGMs when the accounts had not been signed. Further, the AGMs were fixed on the same days as the directors’ meetings and it would be at those meetings that the draft audited financial statements would be signed by Chi and Chuen. 187  The defence response to this assertion was that it was not uncommon for small privately held companies to hold AGMs on the same day as the board meeting. Further, there was no prejudice suffered by the plaintiff from this practice. The Act (s 203) does not stipulate that signed audited financial statements have to be given 14 days before the AGM. It contemplates that the financial documents laid before the AGM have to be audited, not that they have to be signed by the directors. In any case, the audited statements were sent to the plaintiff in advance of the AGMs and since he had received monthly accounts every month, there was nothing in the audited statements that would surprise him. The plaintiff himself had not pin-pointed the prejudice caused to him by the procedure he complained about.",
        "My findings": "188  I think that much of the difficulty that was experienced over the years had its source in the strained relationship between the three brothers and in particular between the plaintiff and his two elder brothers. The plaintiff’s own personality unfortunately contributed to the strain. Whilst Mrs Chow was alive, there was no difficulty with the management of the companies as her sons deferred to her. Once she died, however, a new management style had to be adopted. It was clear, since all the directors were not resident in Singapore that they had to appoint local staff to handle day-to-day affairs. This was easily agreed on and Jeslyn Goh was appointed. What they should have done next was to demarcate the areas of responsibility of each of them so that they would each have a role to play in overseeing the management of the day-to-day affairs. This was not done in conference between the three and this omission together with the plaintiff’s own difficult personality allowed a state of affairs to develop where the two elder brothers were the supervisors and the plaintiff, though not expressly excluded from management, was given no precise role and treated as a non-executive director. His complaint I think was basically that he wanted to be an executive director in the same way as he perceived his brothers to be. On the other hand, he did not encourage Jeslyn Goh to approach him for decisions and it was clear from his correspondence with his brothers and the staff that he was inclined to nitpick and was not willing to accept information at face value but would keep on digging for more and more information. To an extent, he was paranoid, but this paranoia was also fed by the way that the others reacted to his requests. 189  Whilst I accept the submission that there was not very much management to be done of the companies, some things had to be done by the directors and could not be left to the staff. The main areas where input from the directors was required were in relation to finance and the maintenance of the companies’ properties and dealings with the authorities. Chuen’s leadership in relation to the maintenance of the properties might have been an obvious course but the plaintiff was not given any opportunity to indicate whether he wished to assist in this area. As for finance, this was a matter that he could have assisted in but here the responsibility seems to have been assumed by Chi without any prior discussion with the plaintiff. I should state here that I do not accept the plaintiff’s allegations that Chi and Chuen had misappropriated moneys belonging to the companies when they made withdrawals from the SCB account since all moneys taken by them were eventually debited to their current accounts with the companies as loans. 190  On the whole, the plaintiff was given a great deal of information about the companies, especially financial information. Most of his complaints about not having information were exaggerated. There were, however, occasions when he was not kept informed as he should have been. The glaring example was the incident of the break-in at Chow House. The plaintiff should have been told about this, as the other directors were, when it happened. It was no excuse to say that nothing was stolen and the damage was slight. As a director, he would have wanted to participate in discussions on investigations and on remedial action. He was not given this opportunity. Furnishing him very much later with all the reports obtained did not make up for the earlier default. 191  I think that Jeslyn Goh was deficient in her dealings with the plaintiff. I am cognisant of the difficulties that she faced when dealing with the plaintiff. He would not always accept her answers and would keep on pressing her for more details. He was always not polite or pleasant to her. These difficulties probably inclined her towards taking the easier course of dealing primarily with Chi and Chuen and not contacting the plaintiff unless absolutely essential. Jeslyn Goh usually gave the plaintiff what he wanted but she took time to do so and in relation to him, she was reactive rather than proactive. Chi and Chuen could have helped both the plaintiff and Jeslyn Goh by sitting down with the plaintiff and coming to some agreement with him on the way that day-to-day matters should be handled. They never did this due to their own difficulties with him and to that extent they contributed to the stressful situation in which Jeslyn Goh found herself and the later accusations that the plaintiff made of her preferring to deal with them and favouring them. They criticised the plaintiff for not making any real contribution towards the business of the companies whilst averring that they had made an effort to help while instead of just questioning and criticising the way the plaintiff had done. They did not seem to appreciate that they also had a responsibility to have proper discussions with the plaintiff to work out what contribution he could make to the companies. Due perhaps to the strained relationship between them and the plaintiff and the fact that a few early physical meetings had resulted in heated altercations, I think that Chi and Chuen decided that they could not deal with the plaintiff in person and could not discuss matters with him. They too were unwilling to be proactive in relation to him and his needs and views. 192  I do not accept the insinuation in the plaintiff’s submissions that Jeslyn Goh was knowingly assisting Chi and Chuen to take moneys out of the companies which they should not have and to disguise the purpose of these withdrawals. Having said that, it is my view that Chi and Chuen did not draw up a proper system for the use of the SCB account. They did not impose sufficient control over the account. The way it was run made it easier for them to borrow moneys from the companies without the plaintiff’s prior knowledge or approval. 193  I do not think that in itself the way that the correspondence with the BCA was handled was oppressive to the plaintiff. What was wrong was that as I have pointed out above, there had been no proper discussion and demarcation of responsibilities. It was for the companies’ benefit of course that these matters were dealt with by Chuen as he had the necessary expertise which his brothers did not. That having been said, the essential unfairness to the plaintiff lay in the way in which this area was taken over by Chuen without prior discussion. 194  The plaintiff’s complaints about Kumpulan Akitek and Prospec also seem to me to be exaggerated. The plaintiff had accepted that the toilets in Chow House needed improvement. In the end, he did not have any real complaint about the work done. His dissatisfaction was with the fact that he had not been given a chance to discuss the plans and proposals in detail. In this regard the plaintiff was excluded from the decision making. He was not shown all the quotations obtained and the papers presented at the board meeting related only to Chuen’s preferred contractor. From this incident as well as from others, it seems to me that the plaintiff wanted to be intimately involved in the business even though physically that would have been difficult. His brothers on the other hand, secure in the knowledge that what they were doing was being done for the benefit of the companies, were happy to by-pass him and his opinions except when board and general resolutions had to be passed. The plaintiff’s ambitions might not have been practical and his participation would probably have led to inconvenience and delay because of his meticulous and rather suspicious approach to matters, but Chi and Chuen made no real effort to involve him in any way. 195  Turning to Winston Loong, I see no merit in the plaintiff’s complaint about the four-month rent-free period that Astute was given. This was a commercial decision and even if it was not justified commercially, the amount that ADPL lost by giving a four-month rent-free period instead of the usual two-month rent-free period, was minimal and could not constitute unfair prejudice to the plaintiff. 196  I also do not accept the criticism that Chi and Chuen caused the companies to spend money by unnecessarily asking Winston Loong to respond to the plaintiff’s letters to them. First, in many cases, Winston Loong was in a better position to respond since he had daily contact with the companies’ affairs. Second, some of the plaintiff’s enquiries required detailed investigation and again Winston Loong was better placed to do the investigation and provide the necessary answers. The plaintiff, as Chi and Chuen pointed out, had also asked Winston Loong to provide historical information about the companies and it was only fair that the time he spent dealing with these queries be paid for. The plaintiff should have paid for such time when the questions asked were more in regard to his own interests in the estates rather than in the interest of the companies. 197  I do not think that there was anything sinister in Chuen’s employment of Winston Loong as insinuated by the plaintiff. The plaintiff did not establish any close relationship between Chuen and Winston Loong before the appointment. At the time of his appointment, there was no reason for Winston Loong to favour Chuen as against the other two brothers. The plaintiff got off on the wrong foot with Winston Loong when, quite unnecessarily, he had Winston Loong ejected from a meeting in Hong Kong on the basis that he was not entitled to be there. Winston Loong had travelled to Hong Kong to introduce himself to Chi and the plaintiff but the plaintiff rejected the opportunity to get to know Winston Loong better and ascertain for himself the qualifications and abilities of the companies’ new accountant. In treating Winston Loong this way, he was taking out his anger at Chi and Chuen for having appointed him accountant without the plaintiff’s prior knowledge and approval. That was unreasonable on the part of the plaintiff and it is no wonder that subsequently Winston Loong preferred to deal with Chi and Chuen. They, for their part, could and should have insisted that Winston Loong deal with the plaintiff in the same way as he dealt with them but did not. Having said this since the plaintiff had indicated to Winston Loong that he had not appointed the latter to advise him on the settlement of the Estate’s liabilities to the companies, I consider Winston Loong was not obliged to direct each and every piece of correspondence on this matter to the plaintiff as long as he kept the plaintiff informed and involved in his capacity as a director. The documentation shows that this was done and the plaintiff was given as much information and documentation as would be normal to give a non-executive director who was not playing a direct part in giving instructions. 198  I also accept the defendants’ submission that the plaintiff had not been able to support his allegation that Winston Loong had deliberately breached his professional duties in exchange for financial rewards from Chi and Chuen. The sums paid by the companies to Winston Loong were not excessive in the light of the period of time involved and the work done by him. The allegation that the previous accountant’s services were terminated as part of a plot was also unsubstantiated and, in fact, contrary to the evidence in the case. 199  On the other hand, I think the evidence did show that Winston Loong preferred to deal with Chi and Chuen than with the plaintiff. Whilst he did furnish the plaintiff with information asked for by the plaintiff, he sometimes took a while to do so. He made sure that the plaintiff was given notices of all meetings that were called but he did not take into account the plaintiff’s schedule or consult the plaintiff before scheduling the meetings. He was not proactive in relation to the plaintiff and I think it is fair to conclude that he preferred not to deal with the plaintiff or involve him in matters of the companies. His attitude to the plaintiff was clearly shown when he suggested that the transfer of the Estate’s shares be made to Chi and Chuen only. No doubt not more than two trustees were required for this purpose but he never considered that the plaintiff should be one of the trustees. Whilst Winston Loong’s attitude is not surprising in view of the way that the plaintiff treated him, Chi and Chuen should have known better and, as with Jeslyn Goh, had a responsibility to ensure that Winston Loong did not unfairly exclude the plaintiff from contributing to decisions on company matters. Instead, they impliedly condoned his behaviour to the plaintiff. 200  Turning to the complaint about the conduct of board and general meetings, I think that some of the plaintiff’s complaints were petty and pedantic. As there were no notice periods prescribed in the articles, only reasonable notice of board meetings needed to be given. In most cases a few days’ notice (not seven days) would have been sufficient but I do agree that in relation to the meeting of 16 January 2004, the notice was short and since the plaintiff had clearly indicated he had a prior appointment, the meeting should not have proceeded on that date. It was also not proper of Winston Loong to consult only Chi and Chuen in deciding on the time and place for the meetings. He should either have consulted none of the directors (and then adjusted the meetings as far as possible to suit them all) or all of them. 201  As regards the meeting of 16 January 2004, there was no urgency to proceed on that date. The meeting could have been adjourned at least once in an attempt to accommodate the plaintiff. Whilst of course it was helpful to have a new company secretary, there was no urgency to make the appointment within four days of the resignation of the previous one. As for the resolutions concerning the renovation work, the condition of the toilets in Chow House had been so dire for so long that a few days delay in considering the matter and determining how to proceed would not have had any adverse effect on ADPL. As for the resolution to impose interest at 6% on the Estate’s debts, this too was not urgent as Chuen himself conceded during cross-examination. It seems to me that the plaintiff was right when he said that his brothers did not want him to attend the meeting. That was not, however, in my view, because they thought he would ask awkward questions about the interest issue. As far as they were concerned, they had grounds to believe that he agreed with the proposal and therefore would not have expected to have a disagreement on it if he had attended it. They probably expected some unpleasantness about one issue or another and therefore thought it expedient to proceed in his absence. I should also state here, for the avoidance of doubt, that I accept that when Chi and Chuen passed the resolutions passed on 16 January 2004, they did so in good faith believing that the same were in the interests of the companies. 202  As for the board meetings of 11 March 2005, although the notice was short, the matter to be discussed at the meetings was not material as it dealt only with convening EGMs of the companies on 5 April 2005. Still this incident was evidence of a pattern in Winston Loong’s dealings with the plaintiff. 203  I accept the submission for Chi and Chuen that there is no substance in the complaint that the notices for the AGMs on 5 October 2004 were issued before the directors had passed the necessary resolutions to call them. Since the directors and shareholders were the same persons and the directors approved the audited financial statements at the board meeting of 5 October 2004, it was, I agree, pedantic to insist that another 14 days elapse for the calling of the AGM for the same persons to approve the audited financial statements in their capacity as shareholders. I also accept the submission that no prejudice resulted to the plaintiff from the initial amendment of the resolutions that he proposed at the board meetings of 5 October 2004. 204  The issue of the teleconference meetings is a vexing one. On the one hand, I see no difficulty in principle for directors to meet via a teleconference as long as there is nothing in the articles of the company concerned which disallows such a meeting. In the present case, the articles do not contain any provision which either expressly or impliedly (as in theRe Associated Color Laboratoriescase) prevent teleconference meetings. Given that and the fact that prior to Mrs Chow’s death there had been some teleconference meetings, it was not reasonable for the plaintiff to always refuse to attend teleconference meetings or for him to leave meetings when he found out that his brothers would be participating via the telephone. On the other hand, the persistent use of this mode of meeting by Chi and Chuen in the face of the plaintiff’s objections thereto, could be regarded as an indication that they did not want the plaintiff to attend the meetings or, at the least, that they did not want to meet him at the meetings and have a face to face discussion with him. 205  Dealing with other minor complaints, the minutes should have been sent to the plaintiff promptly especially on those occasions when he did not attend the meetings. However, there was no proof of prejudice caused to the plaintiff by such delays. The failure to open the SCB box can be partially ascribed to the plaintiff himself. He could have been cooperative in April 2005 and gone down to the bank to see whether the box would be opened by the bank especially since Chi asked him to do so. Whilst I think that the fears expressed by Chi and Chuen about the dangers of opening the box in the plaintiff’s absence were exaggerated (they could have asked an independent third party to be present), I can understand that reaction in view of the plaintiff’s suspicious attitude towards his brothers. Finally, the complaints made by the plaintiff about the audited financial statements tabled on 5 October 2004, 31 August 2006 and 15 September 2006 were petty ones. 206  On balance, I have come to the conclusion that although the plaintiff’s complaints were in many cases exaggerated and his troubles were often contributed to by his own unreasonable behaviour and bullying way with others, the plaintiff was excluded from the management of the companies by his brothers in a way that unfairly discriminated against him. It was clear that the defendants were happy to proceed without the plaintiff’s participation. They observed the forms of notification and provision of information, but the substance was that they disregarded him and his views on many matters and, indeed, tried to avoid having to deal with his views.",
        "Payment to third parties": "207  The plaintiff’s complaint concerns payments made to: (a)    M/s YLP; (b)    M/s MP; (c)    Winston Loong & Co; (d)    Rice Management; (e)    Kumpulan Akitek; (f)     Astute; (g)    Knight Frank; (h)    KPMG; (i)     William Sin & Co; and (j)     Lim Hua Yong & Co. He asserted that generally these entities were engaged by Chuen and/or Chi without consulting him or keeping him informed because his brothers wanted to further their own interests. The plaintiff was excluded from the operations and affairs of the companies in connection with these entities and payments. Therefore, the plaintiff submitted that the conduct of his brothers was oppressive. 208  In my judgment, there was little substance in these complaints. Apart from the payments made to M/s YLP and MP, all the expenses that the plaintiff complained about were incurred for and on behalf of the companies. The real complaint of the plaintiff, as his closing submissions made plain, was that the entities had been engaged without consulting him first. I have dealt with the substance of that complaint earlier. The plaintiff did not challenge the fact that the expenses were incurred legitimately in the interests of the companies or for the purposes of the estates of Mr and Mrs Chow. That being the case the payment of the expenses could not, in itself, be oppressive of him. 209  As for the payments to M/s YLP and MP, those were made in respect of solicitors’ fees. They were properly recorded as loans from Lee Tung to Chi and Chuen. Chi and Chuen had not disputed that they borrowed moneys to pay for their personal legal expenses. I have dealt with these loans earlier and I see no need to say more about them.",
        "Replacement cheques": "210  The plaintiff’s complaint concerned two cheques both dated 22 March 2003 for the sum of $100,000 which were issued to him in payment of his director’s fees due for the year ended 31 December 2002 in respect of CCPL and Lee Tung. The plaintiff presented the cheques for payment after the six-month validity period. Therefore the cheques were dishonoured. He then asked Jeslyn Goh several times to replace the cheques. She sought instructions from Chi and Chuen and at one stage informed his solicitors that he had to give reasons for the replacement of the cheques. Eventually at the meeting of 5 October 2004, the plaintiff proposed a resolution to authorise the issue of the cheques. Even so, it was only in November 2004 that they authorised the issue of the replacement cheques. The plaintiff took the view that his brothers had withheld issuing the cheques deliberately to punish him and this conduct had unfairly discriminated against him. 211  Chuen submitted that if he had been asked to countersign the replacement cheques, he would have done so. However, he was never asked. In any event, even if there was delay in providing the plaintiff with the replacement cheques, this did not amount to conduct oppressive of him as a shareholder. He did receive the cheques and he encash them. 212  Chi submitted that it was the plaintiff’s own inaction that caused the cheques to be dishonoured. He had not collected them even though Jeslyn Goh asked him to. He was the cause of the delay in presenting the cheques and Chi and Chuen were justified in asking him to explain why he had failed to present the cheques for payment in time. 213  This incident was an example of the bad relationship between the brothers. No doubt the plaintiff was at fault in not collecting and presenting the cheques on time. However, replacing the cheques was a simple administrative matter and Chi should have ensured that it was done promptly. There does seem to have been a bit of an intention to aggravate the plaintiff in this regard. It is, however, difficult to regard this as oppressive conduct since the deficiency was cured long before the oppression proceedings were started.",
        "Conclusion": "214  I have found certain of the plaintiff’s complaints to be have been made out. There was conduct on the part of his brothers which was oppressive to him particularly in regard to their use of company funds without his knowledge even though they had no intention of misappropriating any such funds and in regard to their complacency in conducting the management of the companies without his participation. If the companies had not already been wound up, I would have ordered them to be wound up under s 216. It is quite clear from the evidence that it is impossible for all three brothers to cooperate. During the period in question, Chi and Chuen managed to work together but their relationship appears to have changed somewhat in the course of the proceedings. In any case, given the longstanding bad relationship between them and the plaintiff and the plaintiff’s own personality and character, there is little prospect of things improving. If the companies were to go on, there would either be new allegations of oppression made or the companies would simply stagnate because no decisions could be taken. 215  Thus, the plaintiff has succeeded in his case. However, I do not think that the plaintiff is entitled to his full costs of his action because he made many complaints that were unjustified or exaggerated and the parties and the court’s time had to be taken up dealing with these complaints. He also raised points which had not been pleaded and yet, being serious allegations (egthe assertion that Winston Loong was Chuen’s crony and acted accordingly) had to be dealt with at length by the defendants. Further, there were a number of examples where the plaintiff had substantially conceded points on the stand yet these points were reiterated in his closing submissions thus forcing the defendants to deal with them. In the circumstances, I think it is fair that the plaintiff be entitled to recover only 65% of his costs from the first and second defendants."
    }
}