{
    "case_title": "Insigma Technology Co Ltd v Alstom Technology Ltd",
    "ncitation": "[2008] SGHC 134",
    "coram": "Judith Prakash J",
    "sections": {
        "The tribunal's decision": "12     The tribunal noted, at [87] of the Decision, the “strong international public policy … in favour of the arbitration of international commercial disputes” and the uniform acceptance that “where parties have included an arbitration agreement in their commercial contracts it is incumbent upon an arbitrator or a court to make every effort to give effect… to the parties’ agreement.” Recognising that the language of Article 18(c) was “the sort of formulation which teachers and textbooks would admonish practitioners to avoid” (at [88]), the tribunal emphasised that its defects did notipso factomean that the clause was invalid; the parties’ clear agreement that disputes be resolved through arbitration warranted every reasonable effort being made to give that agreement effect. 13     In the tribunal’s opinion, it was “clear enough” that the agreement was for the SIAC to administer the arbitration “in accordance with” the ICC Rules (at [94]). The real issue was therefore whether this prescription was practicable. Considering the language of Article 18(c), the tribunal reasoned (at [101]): The starting point for the Tribunal is the language contained in Article 18(c). Although it is clear that the Parties have agreed to conduct their arbitration “in accordance with ICC Rules”, it is equally clear that they have agreed that such proceedings would be administered by the SIAC. In agreeing to this formulation, neither Party could reasonably have expected that the resulting arbitration would be a “pure” ICC arbitration proceedingsimpliciter. In fact, such an arbitration wouldnotbe an ICC arbitration at all, but something different. That “something different” is precisely what the Parties bargained for, namely, an arbitration conducted in accordance with the procedures prescribed by the ICC Rules but administered by the SIAC. 14     Furthermore, as a matter of law “the rules of an arbitral institution can be legally divorced from the administration of an arbitration by that institution.” (At [104], citingBovis Lend Lease Pte Ltd v Jay-Tech Marine & Projects Pte Ltd[2005] SGHC 91(“Bovis Lend Lease”)). The adaptation of ICC Rules for administration by other institutions was also not unheard of in practice (at [105]). Thus there was no ambiguity or uncertainty fatal to Article 18(c). 15     Nor was Article 18(c) inoperable due to a lack of capacity on the part of the SIAC to administer an arbitration conducted in accordance with the ICC Rules. Having obtained SIAC’s confirmation that it would be prepared to administer the arbitration in accordance with the ICC Rules, as well as a proposal that the SIAC Secretariat, Registrar and Board of Directors perform the roles of the ICC Secretariat, Security-General and Court respectively, the tribunal was satisfied that the SIAC was capable of administering the arbitration in accordance with Article 18(c); performingmutatis mutandisthe functions assigned by the ICC Rules to the ICC. The tribunal thus found (at [86]) that “the arbitration agreement contained in Article 18(c) of the License Agreement is valid, enforceable and capable of being performed.” 16     The tribunal also decided (at [116]) that the plaintiff’s objection to its constitution was “flawed”: While it is true that the SIAC’s confirmations of appointment of the members of the Tribunal were made by reference to the SIAC Rules, and that this Tribunal has now found that the ICC Rules should be applied, this does not in our view render the Tribunal emasculated or have any effect at all on its powers. The process by which the Tribunal was appointed was in accord with the agreement of the Parties, and whether the confirmation of the appointments by the SIAC was made with reference to the SIAC Rules or the ICC Rules would have made no difference at all to the outcome. 17     As for whether the defendant had breached Article 18(c) by first commencing the arbitration before the ICC, the tribunal considered this issue moot, since that arbitration had been withdrawn with the plaintiff suffering no detriment. 18     Finally, the tribunal found that the defendant had satisfied the requirement imposed by Article 18(c) that the parties conduct “friendly consultations” before submitting disputes to arbitration. There was no need to decide whether the “friendly consultations” provisions constituted legally enforceable obligations because consultations did take place when the parties met on 24 February 2006 to discuss the issues in dispute. The clause merely required that consultations take place, and not that they result in settlement. 19     The tribunal therefore concluded that Article 18(c) was a valid arbitration agreement and that the defendant had not breached it by initially commencing arbitration before the ICC or by failing to engage in or refer the dispute to “friendly consultations” for 40 days.",
        "Issues": "20     Before this court, the plaintiff raises the following issues: (a)    Whether Article 18(c) is a valid arbitration agreement; and if so, (b)    Whether the tribunal was validly constituted by the SIAC in accordance with the ICC Rules; (c)    Whether the defendant breached Article 18(c) by first commencing the Arbitration before the ICC Court of Arbitration; and (d)    Whether the defendant breached Article 18(c) by failing to engage in “friendly consultations” for the requisite 40 days and/or by not referring the dispute to “friendly consultations” between the parties. 21     In the textJurisdiction and Arbitration Agreements and their Enforcementby David Joseph QC (2005, Sweet & Maxwell, London) (“Jurisdiction and Arbitration Agreements”), it is stated (at para 13.28) that the power of the court in deciding whether the tribunal had jurisdiction is not limited to reviewing the tribunal’s decision for error, but involves a re-hearing, including if necessary the calling of witnesses already heard by the tribunal. This statement was based on the authority of a number of first instance English decisions that considered the meaning and effect of s67 of the English Arbitration Act 1996. Whilst I am not aware of any authority on the point in connection with the Model Law, it is my view that, under this legislation too, the court’s jurisdiction to decide on the jurisdiction of an arbitral tribunal is an original jurisdiction and not an appellate one. This is clear from the wording of Article 16(3) of the Model Law. It simply provides for the court “to decide the matter” of jurisdiction after the tribunal has made a ruling that it has jurisdiction. This is not language implying that the court’s powers to act are of an appellate nature. Although the word “appeal” does appear within the Article, the context in which it is found is the specification that there should be no appeal against the decision of the court on jurisdiction. 22     There are also good reasons why the court should have the power to hear the matter afresh rather than to take the position of an appellate body. These are enumerated in the same paragraph ofJurisdiction and Arbitration Agreementsand are as follows. First, if the court was limited to a process of review, it might be reviewing the decision of a tribunal that itself had no jurisdiction to make such a finding. Second, the procedure to determine jurisdiction is available to a party that took no part in the arbitral proceedings; if the court was confined to a review of the tribunal’s decision this would greatly undermine the ability of the challenging party to make its case. Third, if there is to be a challenge on an issue of fact, the court should not be in a worse position to make an assessment than the tribunal, and should therefore be able to examine witnesses in the usual way. Accordingly, therefore, a party is entitled to raise an objection to jurisdiction before the judge that it had not raised and argued before the arbitrator. However, “a failure to raise a specific point before the arbitrator is likely to be relevant as to weight.” (Jurisdiction and Arbitration Agreementsat [para 13.35].)",
        "Whether the arbitration agreement in Article 18(c) of the Licence Agreement was valid": "23     The plaintiff argues that Article 18(c) of the License Agreement is void for uncertainty. It raises essentially the same arguments against the validity of Article 18(c) as those summarised at [49]-[65] of the tribunal’s Decision: 49.    The [plaintiff] says that the plain and ordinary meaning of Article 18(c) is that arbitration would beadministeredby the SIAC,usingICC Rules. The [plaintiff] says that is what the Parties bargained for. The issue for this Tribunal’s determination, says the [plaintiff], is whether this bargain constitutes a valid arbitration agreement. … 54.    The key to the [plaintiff’s] argument is the assertion that the SIAC cannot administer the ICC Rules. This is because, the [plaintiff] says, the ICC Rules have many unique features which cannot be administered by an institution other than the ICC. 24     In addition, the plaintiff now asserts that Article 18(c) “was a disastrous compromise. An arbitration conducted under the ICC Rules would mean that the arbitration award would have the ICC’s hallmark of quality. An arbitration without the involvement of the ICC Secretariat and Court is not an arbitration which bears the ICC’s hallmark of quality”. According to the plaintiff, the “question which then arises is: when the parties bargained for an ICC institutional arbitration, what is it that they want[ed]?” The plaintiff alleges that by construing the clause to provide for SIAC-administered arbitration under the ICC Rules with the relevant SIAC bodies substituting the roles of the corresponding ICC bodies, the tribunal rewrote the clause. 25     I do not accept this line of argument. It is obvious from the clause, taking an objective view of its wording, that the parties did not bargain for an ICC institutional arbitration, but for an SIAC administered one and even that was not to be institutional in nature because they intended the SIAC to apply the rules of the ICC in administering the proceedings. By specifying a different set of procedural rules that was not the SIAC’s in-house rules, the parties showed their desire for an ad hoc arbitration. Thus, by asserting that the parties bargained for an ICC institutional arbitration, it is the plaintiff who is trying to rewrite the clause. 26     The proper issue, and the primary one in the present application, is therefore whether an arbitration agreement may validly provide for one institution to administer an ad hoc arbitration in accordance with the procedural rules of another. There is, in principle, no problem with one institution administering arbitration proceedings in accordance with another set of rules chosen by the parties. Craig, Park & Paulsson,International Chamber of Commerce Arbitration,Oceana Publications, Third Edition 2000 state at 714-715: When parties resort toad hocarbitration under rules other than those of UNCITRAL, they have nevertheless the option of requesting that the ICC constitute an arbitral tribunal, or designate arbitrators in place of defaulting parties. In 1997, the ICC received 5 requests for such a nomination. 27     Furthermore the same text states at 715: As repeatedly noted, the ICC Arbitration Rules are flexible, inspired by the fundamental principle that the parties are free to decide rules of procedure (seeArticle 11 of the Rules, further described in Section 16.01). There is thus no objection in principle to the parties’ stipulation in the arbitration clause that the arbitration follow a set of more complete rules, such as the UNCITRAL Arbitration Rules or those of a trade association active in the relevant trade. Indeed, such a stipulation may have the positive effect of relieving the arbitral tribunal later from having to choose rules of procedure against the wishes of a party (or perhaps both parties). On the other hand, reference to two different sets of arbitration rules must be made with great care so as to avoid the type of inconsistency that would render the arbitration inoperative. For example, a stipulation that the parties wish to have an ICC-administered arbitration applying UNCITRAL Rules is of doubtful efficacy. There are significant potential inconsistencies between the two, notably the fact that ICC awards are necessarily scrutinised for approval by the ICC Court of Arbitration while the UNCITRAL Rules contemplate no such step in the process. The ICC is unwilling to administer proceedings fundamentally different from its own basic concepts; it does not wish to lend its authority to an arbitration that does not allow the ICC Court to exercise its customary control. To be certain that the procedure is operational, it is thus advisable to make clear that in an ICC-administered arbitration the ICC Rules take precedence, and that additional rules of procedure are referred to only to fill gaps. 28     Thus, the administering or supervising authority and the procedural rules adopted for the arbitration do not have to be of the same institution as long as the choices made do not result in significant inconsistency. In my view, the present case is not one where reference to two different sets ofarbitration rulesmay lead to inconsistencies rendering the arbitration inoperative. Here, only the ICC rules have been designated, and the SIAC as administering body has confirmed that it would be able to follow the ICC rules, substituting the appropriate corresponding actors to perform the functions of the ICC Secretariat, Secretary General, and Court. This adaptation would be within the degree of flexibility allowed by the ICC Rules since the ICC Rules recognise the autonomy of the parties as a guiding principle. As this is an ad hoc arbitration and not an ICC arbitration, following the parties’ intentions would not entail requiring the ICC to “administer proceedings fundamentally different from its own basic concepts” or to “lend its authority to an arbitration that does not allow the ICC Court to exercise its customary control.” 29     The position taken by the plaintiff  when it responded to the defendant’s request for arbitration before the ICC was significant. At that stage, it was the plaintiff’s contention that the ICC was not the institution contemplated to administer the Arbitration. Instead, it argued that Article 18(c) of the Licence Agreement required the parties to submit the Arbitration to the SIAC. In the course of these arguments, the plaintiff relied on a paper by the SIAC in which the latter had stated that it was prepared to administer an arbitration under ICC Rules.  The plaintiff also argued that “an arbitration administered by the SIAC costs less than one administered by the ICC and this was one of the reasons why the parties selected the SIAC as the administering institution”. Thus, the plaintiff considered at that time that the clause provided for an arbitration to be administered by SIAC according to the ICC Rules. This was in stark contrast to its position before me that what had been intended was an arbitration conducted by the ICC itself so as to vest the proceedings with the ICC’s “authority”. 30     It is true that in the same set of arguments, the plaintiff designated the arbitration clause as a pathological one, stating: Alternatively, Article 18(c) may be viewed as a pathological arbitration clause and the Court must decline jurisdiction; see Craig, Park & Paulsson,International Chamber of Commerce Arbitration, Third Editionand “Inaccurate References to the ICC” by Jean Benglia (Annex B). That, however, was a cursory and alternative submission and the main position taken was for an SIAC-administered arbitration in accordance with ICC Rules. 31     There is also no reason the arbitration cannot in fact be administered by the SIAC in accordance with the ICC Rules. To begin with, it is clear and undisputed that the parties intended to resolve disputes by arbitration (after “friendly consultations”) rather than litigation. As the tribunal observed, all reasonable efforts should be made to give effect to the parties’ intention to arbitrate. Specifically, the intention of the parties here appears to be to provide for ad-hoc arbitration. As Redfern and Hunter inLaw and Practice of International Commercial Arbitration(2004, Sweet & Maxwell, London) (“Redfern and Hunter”) explain at 47: An ad hoc arbitration is one which is conducted pursuant to rules agreed by the parties themselves or laid down by the arbitral tribunal. Parties are free to work out and establish rules of procedure for themselves, so long as these rules treat the parties with equality and allow each party a reasonable opportunity of presenting its case. 32     Similarly, I noted inBovis Lend Leaseat [17]-[18]: It is difficult to fit an ad hoc arbitration into the format of a SIAC arbitration and if the parties do not intend the SIAC to carry out such functions, they will find that many of the SIAC procedural rules cannot apply to their arbitration.Difficulties of adaptation aside, however, there is no rule of law that prevents the parties from doing exactly what they did. One of the most important principles in arbitration law is that of party autonomy. This is not only reflected in s 23 of the Act but has also been recognised by this court inJurong Engineering Ltd v Black & Veatch Singapore Pte Ltd[2004] 1 SLR 333.Party autonomy means that the parties are free to decide how their arbitral tribunal is to be constituted and how the arbitration proper is to be conducted.[Emphasis added] The tribunal’s view at [103] that “in any contest between the principles of freedom of contract and party autonomy, against competing claims based on ‘institutional self-interest’, the former should prevail” is consistent with the opinion that I expressed in the earlier case. 33     In the absence of an administering authority, the adoption of the ICC Rules is likely to be construed as designating the ICC to be the institution conducting the arbitration. Further the selection of a particular institutional arbitral body to conduct the arbitration will be construed as also selecting the rules of that body to govern the procedure adopted in the arbitration.Jurisdiction and Arbitration Agreementsstates at para 4.27: In many cases parties will expressly agree to submit disputes to a particular institutional arbitral body…. An agreement to refer disputes to such a body will be deemed to incorporate an agreement to abide by the rules and procedures of that body in force at the time arbitration is commenced. Not only will the arbitration be governed by that institution’s rules but it will also be administered by that organisation. 34     The present case, however, despite the nomination of the SIAC as the body to conduct the arbitration, is not an example of institutional arbitration by the SIAC, since the arbitration agreement specifically designated the use of ICC Rules instead. Thus, this isprima faciean agreement forad-hocarbitration by the SIAC. Such an agreement is neither objectionable in principle, nor in fact objected to by the SIAC, which on the contrary was happy to administer the arbitration (though perhaps it was a bit too enthusiastic in also proposing to adopt its own rules, referring only to the ICC Rules for guidance). By designating a separate administering authority, the parties indicated that the adoption of the ICC Rules was not a selection of the administering authority but only an agreement for the arbitration to take place by reference to those rules. 35     Redfern and Hunter do warn that it is not advisable to try to adopt or adapt institutional rules for use in ad hoc arbitration, since such rules make repeated references to the institution and will not work properly or effectively without it (at p 49-50). This observation bolsters the plaintiff’s arguments to some extent. The arrangement provided for in Article 18(c) would be unworkable if the SIAC was unable to provide similarly equipped actors to fulfil the roles that the ICC Rules gave to the institutional bodies of the ICC. However, while it might not be advisable to use the ICC rules for most ad hoc arbitrations because of the need for an administering body, if the ad hoc arbitration nominates a substitute institution to administer the arbitration and such substitute can arrange organs to carry out similar functions to those carried out by the different parts of the ICC apparatus, there should be no practical problem, as well as no objection in principle, to providing for such a hybrid ad hoc arbitration administered by one institution but governed by the rules (as adapted where necessary) of another. This freedom is inherent in the flexible nature of arbitration, especially ad hoc arbitration. In any case, inefficiency alone cannot render a clause invalid so long as the parties had agreed and intended for the arbitration to be conducted in this manner. 36     On the facts of the present case, even if Article 18(c) was uncertain as originally drafted, the uncertainty has been cured by the parties’ conduct as well as SIAC’s confirmation. There is merit to the defendant’s argument that freedom of contract should inform the construction of the clause – arbitration allows for flexible procedural rules and there is no reason parties should not be able to choose to arbitrate utilising the SIAC’s administration but following  the rules of another body if this is workable within the SIAC framework. In this case, the SIAC has given its consent and assured the tribunal of its preparedness to have the SIAC Secretariat, Registrar and Board of Directors perform the functions of the ICC Secretariat, Secretary General and Court. The plaintiff’s conduct too is illustrative of the parties’ intentions. Even if the original language of Article 18(c) was uncertain, and could have conceivably have been struck down as invalid, the plaintiff’s proposal to give effect to the clause by an ad hoc arbitration administered by the SIAC but incorporating the ICC Rules, should be taken as a mere clarification or modification of the clause. The former would mean that Article 18(c) is valid as it stands, while the latter would require the defendant to consent to rather than contest the plaintiff’s interpretation. On the facts, the defendant actually did recommence the arbitration before the SIAC in accordance with the plaintiff’s “proposal”. The plaintiff cannot now in good faith dispute the jurisdiction of the tribunal constituted in accordance with the position it had itself put forward earlier.",
        "Whether the arbitral tribunal was validly constituted by the SIAC in accordance with the ICC Rules of Arbitration": "37     This issue concerns whether the tribunal was actually constituted in accordance with the ICC Rules as required by Article 18(c). The plaintiff strenuously argues that the tribunal was originally constituted in accordance with the SIAC rules instead, with the SIAC Chairman appointing the third arbitrator Dr Moser. This does not mean, however, that there was a violation of the ICC Rules. An extract of the 23 January 2007 letter from the defendant’s lawyers is telling: Article 8(4) of the ICC Rules provides that, in the absence of the parties’ agreement upon another procedure, the ICC Court makes the appointment. The [defendant] and the [plaintiff] did in fact agree in previous correspondence, while the proceedings [were] before the ICC, that the third arbitrator would be jointly nominated by Professor Pryles and Mr. Hwang. We informed SIAC of such agreement in our letter to you dated 23 November 2006. However, it would appear from the [plaintiff’s lawyers’] 11 January fax that the [plaintiff] has now resiled from that agreement. 38     As the plaintiff acknowledges in its submissions, on 2 February 2007 the SIAC wrote to the parties stating that Prof Pryles and Mr Hwang were agreeable to Dr Moser acting as presiding arbitrator. Further, and more importantly, the plaintiff actually agreed to Dr Moser’s appointment as shown in its lawyer’s letter dated 14 February 2007 to the defendant’s lawyers which stated that the plaintiff “[agreed] to the appointment of Dr Moser as Chairman of the Arbitral Tribunal by agreement between the two co-arbitrators, Mr Hwang and Professor Pryles,pursuant to Article 8(4) of the ICC Rules”. Thus, despite formally reserving its right to argue that Article 18(c) was pathological, the plaintiff actually acknowledged that the tribunal was properly constituted pursuant to the ICC Rules. 39     Article 8(4) of the ICC Rules provides for each party to nominate one arbitrator for confirmation by the ICC and for the third arbitrator to be appointed by the ICC Court “unlessthe parties have agreed upon another procedure for such appointment, in which case the nomination will besubject to confirmationpursuant to Article 9”. [Emphasis added] Thus the appointment by the ICC Court is merely a default; since the parties here did agree to the appointment of Dr Moser as agreed between Mr Hwang and Prof Pryles, the ICC Rules did not require that the ICC Court make the appointment. They only required that the appointmentbe confirmedpursuant to Article 9. This article provides for confirmation by either the ICC Court or the Secretary General. 40     The steps by which the arbitral tribunal was constituted were as follows: (a)    the defendant nominated one arbitrator; (b)    the plaintiff nominated one arbitrator; (c)    the plaintiff and the defendant agreed upon “another procedure for the appointment” of the third arbitrator, namely by agreement between the two co-arbitrators who then proceeded to appoint Dr Moser; and (d)    the SIAC confirmed the appointment of all three members of the tribunal. 41     The SIAC Rules (2ndEd) provide for the same appointment mechanism as set out above,ieparty selection of the two co-arbitrators with the third arbitrator selected by the co-arbitrators (Article 8.1 of the SIAC Rules, 2ndEd). 42     As the defendant submitted, whether the “SIAC” or “ICC” labels were used in connection with the constitution of the tribunal would not be determinative of whether the tribunal was constituted in accordance with the arbitration agreement. In order to determine that question, the court must decide what the substantive appointment procedure was. As shown by the analysis of the ICC Rules and the SIAC Rules, it is possible for a procedure for the appointment of an arbitral tribunal to be simultaneously “in accordance” with more than one set of rules, simply by virtue of the fact that the two sets of rules are to the same effect on that issue, and irrespective of whether the procedure is carried out by reference to only one set of rules. 43     Since the appointment procedures under the ICC Rules as incorporated by reference into Article 18(c) and under the SIAC Rules (2ndEd) are the same, I agree with the submission that the tribunal was correct in stating that the “process by which the Tribunal was appointed was in accord with the agreement of the Parties, and whether the confirmation of the appointments by the SIAC was made with reference to the SIAC Rules or the ICC Rules would have made no difference at all to the outcome” (at para 116 of the Decision). Thus, the tribunal was actually constituted by the SIAC in accordance with (albeit without express reference to) the ICC Rules, and it was validly constituted under Article 18(c) of the License Agreement.",
        "Whether the defendant  breached Article 18(c) by first commencing the arbitration before the ICC Court": "44      The tribunal considered this issue and rejected the plaintiff’s arguments. It accepted that technically the defendant’s initial referral of the dispute to the ICC was not in compliance with the arbitration agreement. It held however that there was no basis for taking the matter further as the ICC arbitration had been terminated and the breach had thereby been cured. Further, the plaintiff had adduced no evidence to show that it suffered any prejudice as a result of the commencement of the ICC arbitration. 45     I see no reason to come to a different conclusion. The plaintiff’s arguments on appeal are not convincing. It contends that there was never any agreement between the parties that the arbitration that was before the ICC could be transferred to the SIAC. In my view, this is irrelevant as there was never any process that could be regarded as a transfer even if technically such a thing were possible, which I think is doubtful. No progress was made in the ICC proceedings at all since, from the beginning, the plaintiff had disputed the validity of the proceedings and the tribunal was not fully constituted before the defendant accepted the plaintiff’s point and took steps to commence the SIAC-administered arbitration. As the defendant submitted, the arbitration currently pending before the SIAC cannot be the same arbitration as the ICC arbitration which has been withdrawn. No issue of transfer or agreement on transfer or necessity for any agreement to transfer can, therefore, arise.",
        "Whether the defendant breached Article 18(c) by failing to refer the dispute to “friendly consultations” between the parties or engaging in the same for the requisite 40 days": "46     This issue relates to the first two sentences of Article 18(c) ie : Any dispute arising out of or in connection with this Agreement, including any question regarding its existence, validity, or termination, shall be referred to executive representatives of the Parties for settlement through friendly consultations between the Parties. In case no agreement can be reached through friendly consultation within 40 days from either Party’s notice to the other for commencement of such consultations, the dispute may be submitted to arbitration for settlement by either Party. 47     The plaintiff contends that no friendly consultations took place after the defendant issued its Notification of Breach and Termination on 17 January 2006. Whilst acknowledging that the parties’ representatives met in Suzhou on 24 February 2006 concerning the issues in dispute, it asserts that this meeting did not comply with the friendly consultations requirement because the defendant was unwilling to compromise its claim and its representative (the plaintiff claimed) stormed out of the meeting. 48     Two main questions fall to be decided in relation to this part of Article 18(c) and these were raised both before the tribunal and before the court. The first is whether the friendly consultation provision is a condition precedent to the commencement of arbitration proceedings,iewhether it is a legally binding and enforceable requirement to be observed before either party can ask for the dispute to be arbitrated. The second is whether the requirement was complied with in this case. 49     The tribunal did not find it necessary to come to a conclusion on the first issue. Instead it preferred to consider all the evidence that both parties had placed before it (both adduced relevant documents and also oral evidence which was subject to cross-examination) and come to a decision on the facts. It held (at para 131 of the Decision): The evidence adduced by the witness testimony of both Parties shows that representatives of the Parties did meet in Suzhou on 24 February 2006 concerning the issues in dispute between them. Although it may be true as the [plaintiff] suggests that the [defendant] was unwilling to compromise its claims in the course of its discussions with the [plaintiff’s] representatives, this does not negate the fact that “consultations” took place. The clause merely requires that consultations take place, not that they result in agreement. Of course, the parties may debate whether the “consultations” were “friendly” or not. While the evidence suggests that the interviews between the representatives were tense, it cannot be said that they were overtly hostile. Accordingly, assuming, without deciding, that the contractual provisions were enforceable, we find that the requirement imposed by Article 18(c) that Parties conduct “friendly consultations” was satisfied in this case. 50     I, too, do not think I need make a finding on the enforceability of the provisions although my own view is that on balance they are unenforceable because they are vague and subjective especially in relation to the meaning of the words “friendly” and “consultations”. There is no particular procedure set down for the parties to follow. The case ofCable and Wireless plc v IBM United Kingdom Ltd[2002] 2 All ER (Comm) 1041 (“Cable and Wirelesscase”) which the plaintiff relied on in support of its position that the relevant provisions were legally binding did not really help it because the wording of the clause found to be binding in that case (which clause required the parties there to follow an alternative dispute resolution (“ADR”) procedure) was far different. In the course of his judgment, Colman J said: [23] There is an obvious lack of certainty in a mere undertaking to negotiate a contract or settlement agreement, just as there is in an agreement to strive to settle a dispute amicable, as in thePaul Smithcase. That is because a court would have insufficient objective criteria to decide whether one or both parties were in compliance or breach of such a provision. No doubt, therefore, if in the present case the words of cl 41.2 had simply provided that the parties should ‘attempt in good faith to resolve the dispute or claim’, that would not have been enforceable. [24] However, the clause went on to prescribe the means by which such attempt should be made, namely ‘through an [ADR] procedure as recommended to the parties by [CEDR]’. The engagement can therefore be analysed as requiring not merely an attempt in good faith to achieve resolution of a dispute but also the participation of the parties in a procedure to be recommended by CEDR. Resort to CEDR and the participation in its recommended procedure are, in my judgment, engagements of sufficient certainty for a court readily to ascertain whether they have been complied with. Thus, if one party simply fails to co-operate in the appointment of a mediator in accordance with CEDR’s model procedure or to send documents to such mediator as is appointed or to attend upon the mediator when he has called for a first meeting, there will clearly be an ascertainable breach of the agreement in cl 41.2. It can be seen from that extract that the clause being considered in theCable and Wirelesscase was a very much more tightly worded and prescriptive clause than the relevant portion of Article 18(c). Later in his judgment, Colman J observed that although contractual references to ADR which did not include provision for an identifiable procedure would not necessarily fail by reason of uncertainty, the important consideration would be “whether the obligation to mediate was expressed in unqualified and mandatory terms or whether … the duty to mediate was expressed in qualified terms” (at p 1051). In the case before me, interpreting a direction to hold “friendly consultations” as a mandatory injunction to have recourse to a form of alternative dispute resolution would be a strained and unnatural construction of the term. Indeed, in my view, a direction to hold “friendly consultations” is more equivalent to a direction to “attempt in good faith to resolve the dispute” than to a mandatory mediation order. I, however, do not express a concluded decision on the first issue. 51     I am content to base my decision on the second issue on the finding made by the tribunal that in fact the parties had complied with the obligation imposed by cl 18(c) because of the meeting that they held on 24 February 2006. In this connection, it is my view that the clause does not require the parties to consult with each other for a period of 40 days as the plaintiff appeared to think. What it requires is that the friendly consultation should take place within 40 days of either party’s notice to the other. This happened. The meeting was suggested on 17 January 2006 by the defendant and it took place on 24 February 2006 which was a date falling within the 40-day period. As stated above, the tribunal heard evidence from the witnesses who attended the meeting and came to the conclusion that it complied with the friendly consultation requirement. I accept that finding. I have not heard the witnesses although their witness statements were produced to me. I have not had the opportunity of observing them when their evidence was being tested by cross-examination. The tribunal was in a better position to assess the factual disputes than I am and to decide whether or not the meeting merited the description “friendly” or not. I do not think it would be correct for me to substitute my own opinion based only on paper evidence for the conclusions that the tribunal came to after its hearing.",
        "Conclusion": "52     In the result, this application fails and is dismissed with costs to the defendant."
    }
}