{
    "case_title": "Relfo Ltd (in liquidation) v Bhimji Velji Jadva Varsani",
    "ncitation": "[2008] SGHC 105",
    "coram": "Judith Prakash J",
    "sections": {
        "Background": "3       The plaintiff company was incorporated in the United Kingdom in January 1996. From the time of its incorporation up to June 2001, the defendant, Bhimji Velji Varsani, a citizen of the United Kingdom, and his brother each held 25% of the plaintiff’s shares. Mr Gorecia and his wife held another 25% of the plaintiff’s share capital. There were two other minority shareholders. The defendant’s father, Mr Gorecia, and the two minority shareholders were the directors of the plaintiff. 4       The plaintiff was incorporated to carry on the business of property and land development. In June 2001, it sold a property for approximately £4m. After the sale, the plaintiff’s tax liability was estimated to be about £1.26m. At a board meeting held on June 2001, it was agreed that a sum of £3,546,518 net of tax would be distributed to the then shareholders of the plaintiff as dividends. This sum was duly paid out as agreed to all the shareholders except Mr Gorecia and his wife. Concurrently, all the other directors apart from Mr Gorecia resigned and Mrs Gorecia was appointed a director of the plaintiff. On the same day, all the other shareholders, including the defendant, transferred their shares in the plaintiff to Mr and Mrs Gorecia at nominal values. Thereafter, the Gorecias were the plaintiff’s only directors and shareholders. 5       The plaintiff’s business operations from July 2001 onwards consisted of various loans made by the Gorecias to a connected company. Mr Gorecia also caused the plaintiff to make various purported investments in the Ukraine and in Moscow. Some funds were invested in the money markets. 6       On 26 April 2004, the UKIR issued a Notice Warning of Legal Proceedings to the plaintiff in relation to the tax liability incurred in 2001. The Notice stated that the plaintiff owed UKIR £1,409,871.30 and that payment in full settlement had to be made before 10am on 3 May 2004. As at 30 April 2004, the plaintiff had a balance of £506,707.62 in its bank account with HSBC. This was insufficient to pay the UKIR and Mr Gorecia who had said that he had previously advanced the plaintiff a sum of £100,000 in director’s loans. 7       No payment was made to the UKIR on 3 May 2004. Instead, on 4 May 2004, Mr Gorecia gave instructions for a sum of £500,000 to be transferred from the plaintiff’s HSBC account into the account of one Mirren Ltd (“Mirren”), a company registered in the British Virgin Islands. 8       On 5 May 2004, a sum of US$878,479.35 was remitted to the defendant’s account with Citibank, Singapore branch (“Citibank account”). The party that remitted this sum was another company, Intertrade Group LLC (“Intertrade”). On 10 May 2004, the sum of US$878,469.35 (after deducting US$10 for bank charges) was credited into the defendant’s Citibank account. Three days later, the defendant transferred a sum of US$100,000 from his Citibank account to Mr and Mrs Gorecia. 9       The next development was that on 23 July 2004, it was resolved at a meeting of the plaintiff’s members that the plaintiff be wound up voluntarily as it could not by reason of its liabilities continue its business. The same meeting further resolved that one Mark Reynolds of Valentine & Co be appointed as liquidator of the plaintiff. At the first meeting of the plaintiff’s creditors held later that same day, however, the creditors’ nomination of Mark Reynolds as liquidator was rejected. Instead, the creditors resolved to appoint one Timothy James Bramston of Kingston Smith & Partners LLP to be liquidator of the plaintiff. His appointment was supported by the plaintiff’s majority creditor, the UKIR. The only other creditor of the plaintiff at that time was Mr Gorecia and the debt owed to him was only a fraction of that owed to the UKIR. 10     Mr Bramston is an accountant who specialises in insolvency related matters, particularly in investigative insolvency work involving making claim-based recoveries on behalf of creditors. Prior to his appointment as liquidator of the plaintiff, he had worked on many occasions for the UKIR; his estimate was between 50 and 100 times. About 80% of Mr Bramston’s business came from the UKIR. Mr Bramston testified that, generally, he was approached by UKIR to handle cases where the insolvent company had a possible claim against a third party on the basis that he would become liquidator of the company in order to prosecute its claim on a no win/no fee basis. Mr Bramston would work with a team of people including solicitors and counsel who were prepared to do the work on the same basis. Expenses for disbursements would be funded by the company in liquidation or, if there were no assets available, by Mr Bramston’s firm. If the recovery was successful, Mr Bramston would recover his expenses and be paid a fee. The amount remaining would be paid to the creditors of the companies. 11     In this particular case, Mark Reynolds, the person nominated by the Gorecias to be the liquidator, telephoned Mr Bramston and advised the latter that he was not comfortable with the case. Mr Bramston then contacted an officer in the UKIR who investigated the case and decided that it was a matter on which the UKIR needed to take an overview. The first creditors’ meeting was therefore attended by two officers from UKIR and, at their request, by Mr Bramston. Those were the circumstances in which the UKIR decided to appoint Mr Bramston to be the liquidator. He accepted that appointment on his usual “no win/no fee” terms. 12     Mr Bramston stated that as the plaintiff’s liquidator, it was his responsibility and duty to investigate the plaintiff’s affairs and to try and recover the plaintiff’s assets where possible. He duly commenced such investigations and also appointed a firm of solicitors to advise him on all issues pertaining to the liquidation of the plaintiff. 13     By August 2004, Mr Bramston was of the view that the Gorecias may have been in breach of several sections of the UK Insolvency Act stemming from various purported investments and transfers of funds which they had caused the plaintiff to make. These actions had resulted in the plaintiff incurring a loss of at least £2,125,963.53. As a consequence, action was taken against them by the UK Insolvency Service. In the event, both Mr and Mrs Gorecia were disqualified from acting as directors for varying periods. 14     In the meantime, Mr Bramston met Mr Gorecia to discuss and negotiate a settlement with regards to the plaintiff’s claims against Mr and Mrs Gorecia. The discussions culminated in the settlement agreement dated 29 October 2004 (“the Settlement Agreement”) entered into between the Gorecias and Mr Bramston as liquidator of the plaintiff. By this agreement, the liquidator agreed to accept £700,000 in “full and final settlement of all claims of whatsoever nature, whether existing or in contemplation arising from or incidental to the liquidation of Relfo Limited against Mr and Mrs Gorecia and/or the Gorecia family”. This settlement agreement was ratified by the approval of the plaintiff’s majority creditor, the UKIR, given on 1 November 2004. The Gorecias duly paid the settlement amount. 15     At the time of the Settlement Agreement, Mr Bramston was informed by Mr Gorecia that the £500,000 that had been transferred by the plaintiff to Mirren on 4 May 2004 was for an investment involving the purchase of a container of computer goods to be distributed in Moscow. Mr Gorecia said that this investment was lost when the company in which the plaintiff had invested through Mirren was placed in liquidation. Mr Bramston, however, made further investigations to see whether he could recover any money in respect of this asset. These investigations eventually led to the discovery of the money in the defendant’s Citibank account.",
        "The proceedings": "16     As pleaded in the Statement of Claim (Amendment No. 1) filed on 17 September 2007, the plaintiff’s case against the defendant is as follows: (a)    in their capacities as directors of the plaintiff, Mr and Mrs Gorecia owed the plaintiff fiduciary duties including the duty to act in good faith and in the best interests of the plaintiff and a duty not to act for a purpose collateral to and/or against the purposes conferred by the plaintiff’s articles of association; (b)    further, as directors of the plaintiff, Mr and Mrs Gorecia were trustees of such of the plaintiff’s assets and property that were in their possession or control; (c)    on 4 May 2004, a day after the deadline imposed by the UKIR for payment of outstanding tax, in breach of fiduciary duty and/or in breach of trust, Mr Gorecia instructed HSBC to transfer the sum of £500,000 (approximately US$890,050) from the plaintiff’s HSBC account; (d)    on 5 May 2004, written instructions were given by Mr Gorecia to transfer the sum of US$878,479.35 to the defendant’s Citibank account for “Payment on behalf of CORN Ltd (Kiev, Ukraine), Loan Agreement No. 2412/01-1 dated 24.12.2001”. The same day, the sum of US$878,479.35 was transferred from one Intertrade Group LLC to the Defendant’s Citibank Singapore Account. The originator to beneficiary information for this transfer was stated as “Payment on behalf of Corn Ltd (Kiev, Ukraine) Loan Agreement No. 24/12/01/01 dd. 24.12.2001 less charges”. On 10 May 2004, the sum of US$878,479.35 was credited to the defendant’s Citibank account. This made the defendant the ultimate beneficiary of substantially the whole of the £500,000 that was transferred out of the plaintiff’s HSBC account on 4 May 2004. Later on 13 May 2004, a sum of US$100,000 was transferred from the defendant’s Citibank account to Mr and Mrs Gorecia; (e)inter aliathe following particulars of the transfers were given: (1)    on 4 May 2004, Mr Gorecia instructed HSBC to transfer the sum of £500,000 to Mirren’s account with Rietumu Banka. The transfer appeared to be made pursuant to an agreement entitled “Loan Agreement 01-03/UK” entered into between Mirren and the plaintiff; (2)    on 5 May 2004, by way of a letter to Mirren, Mr Gorecia instructed Mirren to transfer the sum of US$878,479.35 “For credit to Citibank Singapore (Swift: CITISGSG) A/C: 36072698, Attn: Nri Tsu; favouring Mr B V Varsani (a/c holder’s name) Customer No: 111504 (a/c number). Payment on behalf of CORN Ltd (Kiev, Ukraine), Loan Agreement No. 2412/01-1 dated 24.12.2001”. This amount represented the sum of US$890,050 less the US$11,570.65 that Mirren appeared to be entitled to retain pursuant to a document titled “Protocol No. 1 issued in addition to the Loan Agreement #01-03/UK”; (f)     there was no record on the plaintiff’s books of account and the plaintiff’s statement of affairs as at 23 July 2004 that showed any outstanding liability owing from the plaintiff to either Corn Ltd or to the defendant that would justify the above transfers since the transfers were not in payment of any benefit for or purpose of the plaintiff or for any debt owed by the plaintiff to the defendant, the defendant had received or applied to his own use the sum of US$878,479.35; (g)    the plaintiff claimed the said sum from the defendant under a constructive trust by which he held the same on trust for the plaintiff in that he: (1)    assisted in the dishonest breach of trust by Mr Gorecia with actual or constructive knowledge; and/or (2)    received trust property (the US$878,479.35) with actual or constructive knowledge of the dishonest breach of trust of Mr Gorecia. 17     The defendant first filed his defence on 3 May 2007. He made substantial amendments to this defence on 11 July 2007 and made some minor amendments on 28 September 2007. In its final form, the defence averred: (a)    the defendant ceased to be shareholder of the plaintiff on 27 June 2001; (b)    the defendant had no knowledge of the alleged transfer of £500,000 from the plaintiff to him; (c)    the defendant was not the ultimate beneficiary of the sum of £500,000 and it was never transferred from Mirren to his Citibank account on 10 May 2004 or any other date; (d)    the defendant did receive US$878,479.35 in his Citibank account on 5 May 2004 but this money came from Intertrade; (e)    the defendant disputed the authenticity of the letter dated 5 May 2004 purportedly from Mr Gorecia instructing Mirren to pay him US$878,479.35; (f)     the defendant averred that the alleged “Protocol No. 1” pleaded in paragraph 13(b) of the statement of claim was an unsigned document and/or a forgery; (g)    the defendant averred that all liabilities owed by Mr Gorecia to the plaintiff resulting from his alleged breach of trust and/or breach of fiduciary duties were settled pursuant to the Settlement Agreement; (h)    if the defendant was liable to the plaintiff, the plaintiff’s rights against Mr Gorecia and the defendant had been compromised or extinguished pursuant to the Settlement Agreement; (i)     in the further alternative, as the defendant had paid a sum of US$100,000 to the Gorecias, the plaintiff’s claim at its highest was only US$788,479.35; and (k)    in the further alternative, the plaintiff’s claim was a claim by the liquidator for the sole benefit of the UKIR and that was not allowed under private international law. 18     The trial commenced on 18 February 2008. Evidence for the plaintiff was given by Mr Bramston and Mr Mark Bishop, a lawyer working with the English legal firm of Healys Solicitors who were the solicitors employed by Mr Bramston. When the plaintiff’s evidence was complete, the defendant, although he had filed an affidavit of evidence-in-chief, elected not to give evidence and submitted that there was no case to answer.",
        "The issues": "19     The main issues that arise in this case are: (a)    whether the defendant is liable to account to the plaintiff on the ground of knowing receipt of the sum of US$878,479.35; (b)    whether the defendant dishonestly assisted Mr Gorecia in his breach of trust or breach of fiduciary duty by receiving the sum of US$878,479.35 into his Citibank account; (c)    whether the plaintiff’s claim against the defendant is, in substance, an indirect enforcement of foreign revenue laws and if so, whether the claim is enforceable under private international law; and (d)    whether the conclusion of the Settlement Agreement prevents the plaintiff from maintaining a claim against the defendant. 20     In considering the evidence and the arguments, I bear in mind that the test of whether there is no case to answer is whether the plaintiff’s evidence at face value establishes a case in law or whether the evidence led by the plaintiff was so unsatisfactory or unreliable that its burden of proof had not been discharged. SeeBansal Hermant Govindprasad v Central Bank of India[2003] 2 SLR 33(“Bansal”) andLim Swee Khiang v Borden Co (Pte) Ltd[2006] 4 SLR 745. In this respect, the plaintiff has only to establish aprima faciecase. Aprima faciecase is determined by assuming that the evidence led by the plaintiff is true, unless it is inherently incredible or out of all common sense or reason. Further, if circumstantial evidence is relied on, it does not have to give rise to an irresistible inference as long as the desired inference is one of the possible inferences. SeeHalsbury’s Laws of Singapore,(2006 Re-issue) vol 10, para 120.025 at p 39. AsHalsbury’salso says in the same paragraph: Put another way, the evidence is subjected to a minimal evaluation as opposed to a maximal evaluation … If, however, there is no evidence in support of any fact in issue, or any evidence is manifestly unreliable and should be excluded from that score, a submission of no case to answer will succeed.",
        "Knowing receipt": "21     In order to make the defendant liable to account to the plaintiff as a constructive trustee on the ground of knowing receipt of the sum of US$878,479.35, the plaintiff has to establish the following elements: (a)    that the plaintiff’s assets have been disposed of in breach of trust and/or fiduciary duty; (b)    that the defendant has beneficially received assets which are traceable as representing the assets of the plaintiff that had been wrongfully disposed of; and (c)    the defendant has knowledge that the assets that he received are traceable to a breach of trust or fiduciary duty such that it would make it unconscionable for him to retain the benefit of the assets. 22     The first element is not, on the facts of this case and on the law, difficult for the plaintiff to satisfy. A director is obliged to act honestly and would have acted in breach of fiduciary duty owed to the company if he did not exercise his discretion to actbona fidein the interest of the company. As such, the test is whether an honest and intelligent person in Mr Gorecia’s position, taking an objective view, would have reasonably concluded that the transfer of the £500,000 to Mirren and/or the transfer of the sum of US$878,479.35 to the defendant’s Citibank account were in the plaintiff’s interest. 23     In the course of liquidation of the plaintiff, Mr Gorecia made a report and a statement of affairs. He explained to the liquidator that the £500,000 was transferred in relation to a transaction involving the sale of computer parts in Moscow. He also claimed that the transaction was by way of a loan. No loan agreement was found in the plaintiff’s papers. There was no documentary evidence to show that the plaintiff actually bought the computer parts. As Mr Bramston explained, for a transaction like this, one would have expected to see some sort of prospectus and due diligence documents, purchase orders and documents evidencing the receipt of funds. These were not in the plaintiff’s files. Further, there was no correspondence regarding the liquidation of the company in Moscow with which the plaintiff purportedly transacted. There was absolutely no information other than what Mr Gorecia told the plaintiff’s creditors. One might also have expected to see a proof of debt form or some sort of claim filed with the aforesaid company on behalf of the company. Mr Gorecia had claimed that the £500,000 was “lost with no realistic prospects of return”. However, as mentioned, there was no correspondence to evidence any effort to recover the money or even investigate what the status of the Moscow company was. 24     Despite Mr Gorecia’s claims, the plaintiff submitted that it was apparent from the document retrieved from HSBC, the HSBC Priority Payment Form, that the £500,000 transferred out of the plaintiff’s HSBC account on 4 May 2004 was actually transferred to Mirren. This was significant as it contradicted Mr Gorecia’s information. 25     The plaintiff submitted that in the absence of any supporting evidence, it was clear that Mr Gorecia’s explanation for the transfer of the money was not substantiated and that the transfer had not been shown to be commercially justified. It considered it to be telling that in the affidavit that Mr Gorecia had filed in this suit on 15 October 2007, he had not explained the contradiction between his statements in his director’s report of July 2004 and the information contained in the HSBC Priority Payment Form (a document that was not originally found within the plaintiff’s possession and was only retrieved by Mr Bramston in the course of his subsequent investigations). Mr Gorecia’s reluctance to give an explanation for the express contradiction indicated a guilty mind and one could infer from it that the transfer of the £500,000 on 4 May 2004 was not abona fidetransfer but was effected against the interest of the plaintiff. 26     I accept the plaintiff’s submissions in this connection. The plaintiff’s evidence supports the assertion that the transfer in question was not effectedbona fidefor the benefit of the plaintiff. Accordingly, Mr Gorecia acted in breach of fiduciary duty in instructing that it be effected. 27     The second element presents more difficulty. The plaintiff’s submission was that the evidence showed thatprima faciethe defendant had received assets that were traceable as representing the funds wrongfully transferred from the company by Mr Gorecia. It was not disputed that this money left the plaintiff’s HSBC account on 4 May 2004. It was also not disputed that the defendant did receive the sum of US$878,479.35 on 5 May 2004. The plaintiff contended that there was sufficient circumstantial evidence available for the court to make the inference that the sum of US$878,479.35 (equivalent to 98.7% of US$890,050 or £500,000) represented the traceable assets of the original amount transferred out of the plaintiff’s HSBC account to Mirren. 28     In support, the plaintiff citedEl Ajou v Dollar Land Holdings[1994] 2 All ER 685 where the English Court of Appeal noted the following in reference to the findings of the trial judge: The question was dealt with by Millett J (see [1993] 3 All ER 717 at 734-736). He said that the plaintiff was unable, by direct evidence, to identify the moneys in the Keristal No 2 account with the money which Mr D’Albis had sent to Panama only a few weeks before. However, he thought that there was sufficient funds, though only just, to enable him to draw the necessary inference. He continued (at 734-735): One of the two sums received in the Keristal No 2 account was $1,541,432 received on 12 May 1986 from Bank of America. That corresponds closely with the sum of $1,600,000 transferred to the Bank of America, Panama on 1 April 1986. In relation to the later transaction, Bank of America may, of course, merely have been acting as a correspondent bank in New York and not as the paying bank; and the closeness of the figures could be a coincidence. It is not much, but it is something; and there is nothing in the opposite scale. The source of the other money received in the Keristal No 2 account is not known, but from the way in which the Canadians appear to have dealt with their affairs, if one sum came from Panama, then the other probably did so, too. After considering other points on each side, the judge said that the fact remained that there was no evidence that the Canadians had any substantial funds available to them which did not represent proceeds of the fraud (see at 735). He concluded (at 736): In my judgment, there is some evidence to support an inference that the money which reached the Keristal No 2 account represented part of the moneys which had been transmitted to Panama by the second tier Panamanian companies some six weeks previously, and the suggestion that it was derived from any other source is pure speculation. (Per Nourse LJ at 692-693) 29     The English Court of Appeal upheld the inferences drawn by Millett J and this, the plaintiff submitted, established that the court could rely on circumstantial evidence in determining whether the assets received were traceable as representing the assets of the plaintiff. 30     The plaintiff submitted that the court could infer that the defendant received the US$878,479.35 representing substantially the whole of the £500,000 transferred out of the HSBC account from the following circumstantial evidence: (a)    the close proximity of the timing of the transfers. The sum of US$878,479.35 was received by the defendant only one day after £500,000 was transferred out of the plaintiff’s HSBC account by Mr Gorecia; (b)    Mr Gorecia, the defendant and the defendant’s family share close personal and business ties and have jointly invested in a number of transactions where the plaintiff’s funds were used in such joint investments. It was Mr Gorecia who had authorised the payment of £500,000 to Mirren on 4 May 2004 and the defendant who was the subsequent recipient of the US$878,479.35 into his Citibank account; (c)    the sum of US$878,479.35 received by the defendant closely corresponds to the original sum of US$890,050 transferred out of the plaintiff’s HSBC account and is some 98.7% of the original sum; (d)    the precise figure of US$878,479.35, the SWIFT transfer references, the account numbers, and the remitting party of the sum of US$878,479.35 into the defendant’s Citibank account all matched the information Mr Bramston obtained from Healys and the circumstances set out in an e-mail dated 15 December 2005 from one Timur Kudaev to Mr Bishop of Healys as to how Mirren was instructed to facilitate the transfer of the US$878,479.35 into the defendant’s Citibank account; (e)    the express admission by the defendant in his defence filed on 3 May 2007 that the defendant “received a sum of US$878,479.35 into his Citibank Singapore Ltd account no. 111504 from Mirren Limited on 10 May 2004” and that “(t)o the best of the defendant’s knowledge, Guy Dagan and/or Corn Ltd may have then used funds from Mirren Ltd to make repayment to the defendant’s family of US$878,479.35 …”. These were positive facts raised by the defendant and showed that the defendant was expecting a payment of a sum from Mirren or for Mirren to facilitate the payment of such a sum; (f)     the positive affirmation and admission by the defendant that Mirren and Intertrade are related companies. The defendant has admitted in his defence dated 3 May 2007 that “Mirren was part of the said Corn Ltd group of companies, and it remitted money on behalf of Corn Ltd.”. The defendant has further taken the position in the defendant’s opening statement dated 13 February 2008 that the US$878,479.35 came from Corn Ltd’s associated company, Intertrade. Mirren and Intertrade are clearly related and/or associated companies within the Corn Group; and (g)    the subsequent transfer by the defendant of a sum of US$100,000 to Mr Gorecia on 12 May 2004, some eight days after the defendant received the sum of US$878,479.35 from Intertrade. Mr Gorecia was the same person who had authorised the transfer of US$890,050 from the plaintiff’s HSBS account to Mirren on 4 May 2004. 31     The defendant’s submission was that the plaintiff had not succeeded in proving that he was the ultimate beneficiary of the money paid out of the plaintiff’s HSBC account. In his argument, the various documents relied on by the plaintiff did not support the plaintiff’s case. 32     In relation to the HSBC Priority Payment Form, the defendant noted that the beneficiary bank named on the form was the Rietumu Bank in Latvia and the payment was for “Re Loan Agreement 01-03/UK”. The screen shots and consolidated statements from Citibank Singapore, the second set of documents relied on by the plaintiff, showed that a sum of US$878,479.35 was received into the defendant’s Citibank account from Ukio Bankas in Lithuania paid on behalf of Intertrade. The payment was stated to be “on behalf of Corn Ltd (Kiev Ukraine) Loan Agreement No. 2412/01-1 dated 24.12.2001”. The defendant argued that the Citibank documents could not possibly corroborate the information in the HSBC Priority Payment Form as all the information on the two documents did not match; the amounts, the loan agreement numbers and the source of the funds (the countries of origin) were all different. Further, the Citibank statements and screen shots could not corroborate the information Mr Bramston received from Healys as the e-mail from Timur Kudaev was not sent contemporaneously and therefore could have been fabricated after the event to support the position that the money received by the defendant was linked to Mirren. 33     The third document relied on by the plaintiff was a e-mail dated 15 December 2005 from a person calling himself Timur Kudaev to Mr Bishop. The plaintiff had conceded that the attachments to the e-mail were hearsay and therefore inadmissible. By the same token, the contents of the e-mail should also be inadmissible. It clearly offended the hearsay rule as the maker could not even be identified. The maker was not called to give evidence and the e-mail literally popped up from nowhere as both Mr Bramston and Mr Bishop gave evidence that it was unsolicited. The plaintiff wished to rely on the contents of the e-mail as evidence that Mirren had been directed to facilitate the transfer of the money to the defendant. As the contents of the e-mail were hearsay, it was dangerous to rely on it as the evidence could very well be false. Mr Bramston did not have personal knowledge of how the funds flowed from Intertrade to the defendant. He said that he received and relied on certain information from sources or from enquiry agents or from a character called “Vlad”. All the alleged information was hearsay and not before the court. There was no way for the court to ascertain the truth of what Mr Bramston had been told and he himself had conceded that he would not take any of these reports as gospel truth. 34     The defendant noted that the plaintiff, while conceding that the sum of US$878,479.35 was remitted by Intertrade and not by Mirren, had asserted that Mirren was instructed to facilitate the transfer of the sum of US$878,479.35 to the defendant’s Citibank account on 5 May 2004. Mr Bramston had put forward two possible theories on how the money could have flowed from Mirren to Intertrade. The first was that the money came from Mirren, was passed to Intertrade and then went on to the defendant’s account. The second was that the money was transmitted from Intertrade to the defendant’s account and then Mirren had reimbursed Intertrade. Mr Bramston had, however, conceded during cross-examination, that he had no evidence to support the assertion that money had flown between Mirren and Intertrade and that he did not know whether the contents of the e-mail from Timur Kudaev was true. The defendant argued that the third explanation as to how the sum of US$878,479.35 had ended up in the defendant’s account, was that the money which was remitted to Mirren was entirely separate from the money sent to the defendant. Mr Bramston had accepted this as a possibility. It was submitted that the plaintiff had not established aprima faciecase because Mr Bramston was not certain of the plaintiff’s position and was speculating. 35     The defendant submitted that the most likely scenario was that the money received by the defendant had nothing to do with the money remitted to Mirren. The reasons for this were: (a)    the moneys related to two different loan agreements; (b)    the loan agreement 2412/01-1 in respect of which the payment to the defendant’s account was made had nothing to do with the plaintiff as it was an investment by Mr Gorecia and the defendant only; (c)    the sums remitted and received were not the same and the plaintiff was not able to explain the significant difference of US$11,570.65; (d)    the sums were transmitted too close in time for there to be a correlation between the remittance to Mirren and the receipt by the defendant. The defendant received the sum of US$878,479.35 in Singapore via Lithuania on 5 May 2004 (the instruction to transfer the money must therefore have been given to Ukio Bankas at least one day before 4 May 2004). This was one day after Mr Gorecia had remitted the money from the plaintiff’s account to Mirren’s account in Latvia. Considering the fact that the United Kingdom is eight hours behind Singapore, it was impossible for the plaintiff to show that the money received by the defendant on 5 May 2004 was the same money remitted to Mirren in Latvia on 4 May 2004 (which had to be sent to Mirren in Latvia first, then sent to Intertrade in Lithuania then to Singapore. All US dollar transfers must be sent through New York). These must be two separate and unrelated sums of money; (e)    there was no evidence of any connection or association between Mirren and Intertrade; (f)     the Gorecias had managed the plaintiff at all material times after July 2001. The defendant’s family had ceased to have an interest in the plaintiff in 2001 and there is no evidence from the plaintiff to show that the defendant was involved in the plaintiff or that his family had moved any funds from the plaintiff to Mirren or to Intertrade; (g)    Mr Bramston’s credibility was dented when he retracted the allegation in his affidavits that the defendant had no basis to receive money from Corn Ltd and that Corn Ltd may not have a legitimate business. He conceded that those were his impressions and that Corn Ltd appeared to be doing well until 2004; and (h)    Mr Bramston also retracted his allegation that there are “close” personal and business ties between the Varsani family and the Gorecias. 36     It was the defendant’s position that the plaintiff could not rely on paragraphs in his defence filed on 3 May 2007 because the defence had been amended and the pleadings referred to were no longer before the court. By virtue thereof, no reliance could be placed on those admissions. The “admissions” state that the defendant received the sum of US$878,479.35 from Mirren but the document showed the money came from Intertrade on 5 May 2004 to hold the defendant to his “admission” would be contrary to the evidence. The defendant was entitled to correct his mistake. Counsel cited the case ofWarner v Sampson[1959] 2 WLR 109 where the English Court of Appeal had held that once pleadings are amended, what stood before the amendment is no longer material before the court and the court must regard the pleadings as they stand. He submitted that the earlier pleading was irrelevant and inadmissible evidence. 37     Moreover, in the original defence, the defendant had maintained that the sum of US$878,479.35 was from Corn Ltd and his alleged admission must be seen in the light of his explanation under para 6(u) of that defence that “to the best of the defendant’s knowledge”, Corn Ltd “may” have used funds from Mirren. The alleged admissions were made in error as the Citibank documents clearly showed that the money was not from Mirren but from Intertrade. 38     I have considered the plaintiff’s and defendant’s submissions in the light of the law that the plaintiff only needs to prove aprima faciecase and that, as Rajendran J said at first instance inCentral Bank of India v Hermant Govindprasad Bansal[2002] 3 SLR 190, so long as there is someprima facieevidence that supports the essential limbs of the plaintiff’s claim, then the failure of the defendant to adduce evidence on its own behalf would be fatal to the defendant. 39     In my judgment, the plaintiff has established the essential limbs of its case. The evidence adduced is sufficient for me to infer that the money received in the defendant’s account is traceable to the money sent out of the plaintiff’s HSBC account on 4 May 2004. Although the quantum of each sum is different, the amounts are very similar to each other, the difference being only 1.3%. The timing is also significant: the defendant received the money very shortly after the plaintiff’s bank account was emptied. Although as the defendant submitted, it is not possible that the funds went straight from Mirren to Intertrade to the defendant, in view of the different banks and countries involved, it is possible to infer that Intertrade sent the money to the defendant knowing, or being assured, that it would shortly receive an equivalent amount from Mirren. Although the e-mail from Timur Kudaev is not direct evidence of the transfers and being hearsay cannot be relied on, its existence served as a springboard for Mr Bramston’s investigations. It set out the path for him to follow and the information it contained was, at least to a degree, found to be accurate when the defendant’s Citibank Singapore account was found to have received the sum it did when it did. 40     The plaintiff has also shown that the Gorecias and the defendant’s family engaged in common business transactions and were co-investors from time to time even though Mr Bramston had to concede that these were not enough to prove a “close” relationship. Mr Gorecia and the defendant himself were by the defendant’s own admission involved in a loan transaction. They had known each other at least since the days of their common interest in the plaintiff and although the defendant may have sold that interest to the Gorecias in 2001, thereafter he continued to deal with Mr Gorecia. 41     I note the points that the defendant made about the amendment of his pleading. Whilst it is correct that once his defence was amended, the court would have to consider his case on the basis of the amended defence, this does not mean that on a submission of no case to answer I cannot take account, as part of the evidence supporting an inference, of what he had said in a previous pleading particularly when the same appeared to be an admission. The defendant, if he had taken the stand, would have been asked to explain why his pleading took the form that it did originally if it was incorrect. The defendant did not take the stand and this question not only remains unanswered but his silence gives rise to the inference that at the time of the pleading, the defendant must at the least have known something of Mirren to have admitted that the money came from that company and to have asserted that Mirren was part of the Corn Ltd group and remitted the money on behalf of Corn Ltd. This admission also showed that Mirren and Intertrade are related. It is true as the defendant submitted that in fact the money did not come directly from Mirren but was remitted into his account by Intertrade. However, the substance of the plaintiff’s allegation was that in some way the money went from its HSBC account to or through Mirren in order that the defendant’s account could be credited. Taken in that light, the admission by the defendant would not have been a mistake. 42     In the final version of the defence, the defendant admitted that he had paid US$100,000 to the Gorecias from the amount of US$878,469.35 credited to his Citibank account. He did not explain why paid the Gorecias this sum. One possible inference is that he was simply sending back to them part of the money that they had arranged to send him. In the absence of any explanation from the defendant, there is no reason for me to discount that inference. Also, he claimed to be entitled to set off this sum if found liable to refund the larger amount to the plaintiff. No reason for such entitlement was given. In the absence of an explanation, I am left to infer that the assertion is that the plaintiff cannot ask for the US$100,000 because it was on the plaintiff’s instructions that he paid the sum over to the Gorecias. If that was the case he would have known the plaintiff to be the originator of the funds. 43     I accept the plaintiff’s submissions on the point and I hold that there is sufficient evidence to establish aprima faciecase that the sum of US$878,479.35 sent to the defendant’s Citibank account on 5 May 2004 represents the traceable portion of the sum of £500,000 sent out of the plaintiff’s HSBC account on 4 May 2004. 44     I now turn to the third element. The plaintiff has to show that the defendant has knowledge that the assets that he received are traceable to a breach of trust or fiduciary duty such that it would make it unconscionable for him to retain the same. In this regard, inComboni Vincenzo v Shankar’s Emporium (Pte) Ltd[2007] 2 SLR 1020, it was held that the test for determining whether this element has been satisfied is to ascertain if there was such a want of probity on the defendant’s part as to make it unconscionable for him to retain the payments. 45     The plaintiff submitted that in this case, the defendant’s want of probity was shown by the following evidence: (a)    the close connection between the defendant and Mr Gorecia as shown by: (1)    the various investments between the defendant’s family and Mr Gorecia; (2)    the close business ties between the defendant’s family and Mr Gorecia; (3)    the use of Mr Gorecia as a conduit for payments from Corn Ltd from July 2002 to January 2004 as shown in various bank statements and Mr Gorecia’s own witness statement made in different proceedings; and (4)    the use of Mr Gorecia as the Varsani family’s representative in a loan agreement relating to Corn Ltd. (b)    The defendant and his family continued to have knowledge about and interest in the plaintiff’s affairs and the running of the plaintiff by Mr Gorecia as shown by: (1)    the various investments of the defendant and the defendant’s family which involved the plaintiff. Such investments necessarily involved the mingling of funds from the defendant and his family with funds from the plaintiff. Hence, the defendant would have known that Mr Gorecia used the plaintiff’s funds to enter into investments with him and his family; (2)    the fact that there was a private arrangement between the defendant’s family and Mr Gorecia for the defendant’s family to contribute partially to the payment of £700,000 made by Mr Gorecia to the plaintiff under the Settlement Agreement. In his affidavit of 5 September 2007, the defendant had stated that the reference in cl 3 of the Settlement Agreement to payment by a “third party” actually meant payment by the Varsani family. The Settlement Agreement was entered into in respect of the plaintiff’s claim against the Gorecias for the loss of approximately £2.1m; (3)    the admission by the defendant in para 4 of the original defence that the receipt of US$878,479.35 in his Citibank account was from Mirren would indicate that the defendant knew the true nature of this payment; and (4)    on 13 May 2004, eight days after the defendant received the sum of US$878,479.35 from Intertrade, the defendant transferred £100,000 to Mr Gorecia. (c)    according to Mr Gorecia, the defendant and his family knew that the monthly repayments by Corn Ltd of US$50,000 would come from Mr Gorecia. Such monthly repayments had ceased by January 2004. Therefore, when the defendant received a one-time payment of the sum of US$878,479.35 from Intertrade as purported payment on behalf of Corn Ltd, the defendant should have made enquiries as to the basis and origins of this payment as it was not paid in accordance with the normal procedure and amounts. The defendant failed to do so for obvious reasons. 46     The defendant submitted in response that the plaintiff had failed to impute knowledge or dishonesty. There was no evidence adduced by the plaintiff capable of showing the court that the defendant knew that the sum of US$878,479.35 received by him came from the plaintiff or that Mr Gorecia allegedly had some involvement in his receipt of the said sum. Mr Bramston had stated that he accepts that Corn Ltd is a real business and that its documents show that Mr Gorecia had invested into Corn Ltd. Mr Bramston also said that both Mr Gorecia and the defendant’s father had told him that Mr Gorecia had, in making this investment, done so on behalf of both himself and Mr Varsani in the proportions one-third for himself and two-thirds for Mr Varsani. 47     On the issue of the defendant’s dishonesty, Mr Bramston had in fact conceded that he was not making any allegation of dishonesty against the defendant but only against Mr Gorecia. 48     It should be noted, however, that recently, inFirstlink Energy Pte Ltd v Creanovate Pte Ltd[2007] 1 SLR 1050(“Firstlink Energy”), Justice Andrew Ang reiterated that dishonesty is not an essential element in an action for knowing receipt. Further, Ang J emphasised that the both the English and local authorities appeared to agree on the need for some form of knowledge on the part of the defendant that “the assets were traceable to a breach of duty” and that “such knowledge need not be as high as actual dishonesty”. This suggests the barometer is not set as high as that of actual dishonesty. 49     It is not easy for the plaintiff to establish knowing assistance since none of the principals involved including Mr Gorecia gave evidence, and Mr Bramston had to rely on inferences from documents, timing and statements made to him by Mr Gorecia. There is also no direct evidence of knowledge that the assets were traceable to a breach of duty on the part of Mr Gorecia. Although the plaintiff argued that the defendant must have known about the Notice issued by UKIR in April 2004, there was no evidence to substantiate that argument. Therefore, any finding of knowledge has to be based on inference. 50     In his earlier affidavits, the defendant had stated that the Corn Ltd loan repayments were made in regular sums of US$50,000 per month and that this schedule was followed from July 2002 up to January 2004 so that a total of US$950,000 of the US$2.5m loan had been repaid by then. It was therefore unusual for the sum of US$878,479.35 to be paid in May 2004 – it was an irregular amount and it did not represent either the four instalments due from February to May 2004 or the balance of the loan. This surely would have called for some enquiry on the part of the defendant. There was no evidence of any such enquiry but instead the purported repayment was shortly thereafter reduced by US$100,000 repaid to the Gorecias. Why was that done? Then, there was the involvement of the Varsani family in payments to be made under the Settlement Agreement which basically was to settle claims that the plaintiff had against the Gorecias for misuse of its funds. No explanation was given for this either. One inference to be drawn from that was that the defendant knew that the money in his Citibank account had come from the plaintiff and thus had to be repaid to the plaintiff. This is an inference that the defendant could have rebutted by giving evidence. The defendant had in his earlier affidavits while denying close personal ties with the Gorecias, stated that his family and the Gorecias were business partners. In such business dealings, Mr Gorecia used the plaintiff as his investment vehicle. It can therefore be inferred that the defendant knew that moneys coming from Mr Gorecia were likely to have emanated from the plaintiff. 51     I have found this the most difficult part of the case but I have concluded that on balance, there is sufficient evidence for me to infer that the defendant knew that this payment was unusual and that there was no good reason for that amount to be transferred to his Citibank account. From that and his later return of part of the amount, and his family’s participation in the Settlement Agreement, I infer that he knew that the money emanated from a breach of duty. It would therefore be unconscionable for him to retain it. 52     Having come to this conclusion, I do not need to deal with the ground of dishonest assistance. I should state, however, that the plaintiff cannot really proceed with this ground in the light of Mr Bramston’s concession that he did not accuse the defendant of dishonesty. In any case, there is insufficient evidence for me to find dishonesty on the part of the defendant.",
        "Would allowing the claim be enforcing a foreign revenue law?": "53Dicey, Morris and Collins on The Conflict of Laws(Sweet & Maxwell, 14thEd 2006) states that there is a well-established and almost universal principle that the courts of one country will not enforce the penal and revenue laws of another country (see para 5-020). InGovernment of India v Taylor[1955] 2 WLR 303, Lord Keith of Avonholm citing the Irish case ofPeter Buchanan Ltd v McVey[1955] AC 516 (“Peter Buchanan”) which he described as an “admirable judgment” observed that it illustrated two propositions: (a)    that there are circumstances in which the courts will have regard to the revenue laws of another country; and (b)    that in no circumstances will the courts directly or indirectly enforce the revenue laws of another country. Lord Keith then went on to consider the explanation for the rule. He noted that one explanation was that “enforcement of a claim for taxes is but an extension of sovereign power which imposed the taxes, and that an assertion of sovereign authority by one State within the territory of another, as distinct from a patrimonial claim by a foreign sovereign, is (treaty or convention apart) contrary to all concepts of independent sovereignties”. Having said this, his Lordship indicated that whatever the explanation was, there was “a solid basis of principle for a rule which has long been recognised and which has been applied by a consistent train of decisions”. I note that Lord Keith’s explanation of the basis of the rule is one that has been accepted and endorsed in many subsequent cases. 54     It is relevant to note that inGovernment of India v Taylor, the plaintiff had brought an action in the United Kingdom against the liquidators of an English company that had been voluntarily wound up. The English company had traded in India and incurred capital gains tax. When the company was wound up, the plaintiff filed a proof of debt but the liquidator rejected the plaintiff’s claim on the basis that the company’s assets could not be used to satisfy a foreign government’s claim for taxes. The Court of Appeal agreed with the liquidator and the subsequent appeal to the House of Lords was equally unsuccessful. Viscount Simonds stated in his judgment at p 306: My Lords, I will admit that I was greatly surprised to hear it suggested that the courts of this country would and should entertain a suit by a foreign State to recover a tax. For at any time since I have had any acquaintance with the law I should have said as Rowlatt J said in theKing of the Hellenes v Brostron: “It is perfectly elementary that a foreign government cannot come here – nor will the courts of other countries allow our Government to go there – and sue a person found in that jurisdiction for taxes levied and which he is declared to be liable to in the country to which he belongs”. That was in 1923. 55Government of India v Taylorwas a case where the foreign government tried to directly enforce its revenue laws. As the extract from Lord Keith’s judgment makes clear, however, both direct and indirect enforcement of a foreign state’s revenue laws are prohibited. Indirect enforcement occurs where the foreign state (or its nominee) in form seeks a remedy, not based on the foreign rule in question, but which in substance is designed to give it extra-territorial effect. Thus, the court must not look at the form alone but also at the substance and the effect of the claim to determine if it is an indirect enforcement of a foreign state’s revenue claim. 56     This is illustrated by the Privy Council case ofHuntington v Attril[1893] AC 150. There, Lord Watson said: The Court appealed to must determine for itself, in the first place, the substance of the right sought to be enforced; and, in the second place, whether its enforcement would, either directly or indirectly, involve the execution of the penal law of another State. Were any other principle to guide its decision, a Court might find itself in the position of giving effect in one case and denying effect in another, to suits of the same character, in consequence of the causes of action having arisen in different countries; or in the predicament of being constrained to give effect to laws which were, in its own judgment, strictly penal. … no proceeding, even in the shape of a civil suit, which has for its object the enforcement by the State, whether directly or indirectly, of punishment imposed for such breaches by the lex fori, ought to be admitted in the Courts of any other country. 57     The defendant submitted that the plaintiff’s claim could not succeed because of the application of the principles cited above. The defendant’s case is that the sole object of the present proceedings is to collect a debt owing to the UKIR and if the court were to decide for the plaintiff, the only result would be that every cent collected, after deduction of the liquidator’s fees, would go to the UKIR. The UKIR will not collect revenue for the Singapore Government and the Singapore court should not collect revenue for the UKIR or the tax department of any other country. To do so, in the absence of any treaty, would start a dangerous precedent. 58     The defendant relied on the cases that I have cited above and in particular, onPeter Buchananwhere, he submitted, the facts were very similar to those before me. InPeter Buchanan, the plaintiff company was a company which had been put into liquidation by the revenue authorities of Scotland in respect of a very large claim for excess profits tax and income tax. The liquidator was really a nominee of the revenue. The defendant was the majority shareholder and managing director of the plaintiff company. The defendant set up a series of transactions with the purpose of transferring the funds of the plaintiff company to Ireland and then he decamped to Ireland so as to avoid paying taxes. The liquidator caused the plaintiff to sue the defendant to recover the moneys transferred. The summons claimed an account of all moneys due to the company by the defendant as director, trustee and agent and payment of all sums so found due. The Irish court considered the various cases on the enforcement of foreign revenue and penal laws and held that although the transaction was a dishonest transaction designed to defeat the claim of the revenue in Scotland, the claim had to be rejected because proceedings were in substance an attempt to enforce the Scottish revenue laws in Ireland and the Irish court would not lend its aid for this purpose. 59Peter Buchananwas followed by the English High Court inQRS 1 Aps v Frandsen[1999] STC 616(“QRS 1 Aps”). There the defendant, F, owned certain companies and had disposed of these companies’ assets for cash which was then used to acquire the defendant’s share in the companies. In March 1995, the Danish tax authorities claimed corporation taxes plus interest from the companies. The companies had no assets and their only creditor was the Danish tax authorities. The Danish tax authorities appointed a liquidator for the companies and funded actions brought by the companies against F commenced in both England and Denmark claiming restitution of the value of their assets which were disposed of to finance the purchase of F’s shares. The companies’ claim was limited to the sum claimed by the Danish tax authorities. The High Court struck out the plaintiff’s case. On appeal, the English Court of Appeal (see [1993] 3 All ER 289] found the facts inQRS 1 Apswere indistinguishable fromPeter Buchananand stated that it could equally be said of the appellants’ claim that as was said of the liquidator’s claim in theBuchanancase, “that the sole object of the suit is to collect tax for a foreign revenue, and … this will be the sole result of a decision in favour of the plaintiff”. The appeal was accordingly dismissed. 60     In response, the plaintiff first submitted that the principle that the court would not assist in the direct or indirect enforcement of a foreign revenue law is an archaic common law principle of private international law which has not yet been applied by the courts in Singapore. I should state straightaway that I do not accept that submission. It is clear from the authorities that the principle is not archaic – it has been applied many times in the last few years. Secondly, although there has hitherto been no direct application of the principle here, its existence has been recognised by this court. SeeBhagwandas v Brooks Exim Pte Ltd[1994] 2 SLR 431. 61     The next submission was that in substance the claim was not a claim brought for the sole purpose of enforcing a foreign revenue debt. The plaintiff argued thatPeter Buchanancould be distinguished from the present case. InPeter Buchanan, the Supreme Court of Ireland was able to hold that the whole object and purpose of the liquidation proceedings and of the liquidator’s claim against the defendant was to collect a revenue debt because: (a)    the Scottish Inland Revenue had petitioned to wind up the company; (b)    the Scottish Inland Revenue had personally appointed a liquidator to “chase the tax”; (c)    the liquidator had worked “hand in glove” with the Scottish Inland Revenue to recover the dissipated assets; (d)    the Scottish Inland Revenue was the only known creditor of the company; and (e)    the liquidator and the Scottish Inland Revenue had admitted that any recoveries would go towards the payment of the revenue debt by reason of the priority in Scotland of a revenue debt. 62     Maguire CJ who delivered the judgment of the Supreme Court of Eire had further observed at p 533: It is argued that while a company is in liquidation it is still a company and operates in Scotland by its liquidator. A foreign State, it is said, recognises the title given to a liquidator by the laws of his country. I agree that if the payment of a revenue claim was only incidental and there had been other claims to be met, it would be difficult for our courts to refuse to lend assistance to bring assets of the company under the control of the liquidator. But there is no question of that here. The position seems clearly to be as found by the trial judge, that these proceedings were started in Scotland with the purpose of collecting a tax – and that apart from costs and the expenses of the liquidator any moneys recovered will inevitably pass to the Revenue. 63     The plaintiff noted that the Australian courts had stated that the principle inPeter Buchananshould be read narrowly. InAyres v Evansfederal34 A.L.R. 582 (at first instance) and 39 A.L.R. 129 (on appeal) (“theAyrescase”),Peter Buchananwas not followed. The Federal Court of Australia held that the principle enunciated inPeter Buchanandid not apply where a liquidator commences an action in discharge of his duties to recover assets of the company in liquidation. The court also held that the principle does not apply if there are other creditors apart from the foreign revenue authority. 64     On the facts, the plaintiff submitted that the defendant has failed to substantiate his allegation that “this claim is in reality an exercise of revenue collection for the UKIR”. The evidence showed that the liquidator had acted independently of the UKIR in both the liquidation proceedings and in the commencement of the present action. The defendant has not adduced any evidence, whether direct or otherwise, which showed that the liquidator was in fact acting as a nominee or mere puppet of the UKIR. 65     Further, the following factors showed that the substance of the plaintiff’s claim did not amount to an indirect enforcement of a foreign revenue law as: (a)    the plaintiff was placed into liquidation by the plaintiff’s directors; (b)    the plaintiff had two creditors when this action was commenced; (c)    the liquidator is not being funded by the UKIR and has not received any indemnity. The liquidator has confirmed in evidence that he bears the financial risk of any unsuccessful recovery; and (d)    the UKIR is not directing this action or the liquidation proceedings. 66     As I see the matter, the persuasiveness ofPeter Buchananhas not been affected by theAyrescase. That case involved a very different situation. First of all, there were a number of creditors, not only the revenue authorities. Secondly, the application was made to the Australian court pursuant to s 29(2)(a) of the Australian Bankruptcy Act 1966 and it was an application made pursuant to two letters of request from the High Court of New Zealand for the aid of the Federal Court of Australia to enable the Official Assignee of a New Zealand bankrupt’s estate to obtain control of the bankrupt’s property in Australia. At the appeal stage, it was held that the provisions of s 29(2)(a) left no room for the application for the rule of public policy that a court should not assist the enforcement of a foreign revenue debt. In any case, this rule did not apply when the applicant was seeking to get in property for the benefit of ordinary creditors as well as revenue authorities. It was also observed that a request under s 29(2)(a) was different in nature from an action seeking to enforce a claim based upon a cause of action. Thus, the decision inAyrescase was based largely on the interpretation of the governing statute. That decision does not apply to a claim based upon a cause of action like the present. 67     As the defendant pointed out,Ayreswas not followed in the subsequent case ofRe Tucker (Jersey)[2001] BIPR 876.InRe Tucker, an English bankrupt had four creditors at the time of his bankruptcy petition. His liability to the UKIR was in excess of £18.5m. After the appointment of the bankrupt’s trustee, two of the creditors were paid off by third parties or released. An application was made to the Royal Court in Jersey to determine whether the court would allow an application by the trustee to “act in the aid of and be auxillary to the High Court” for the purpose of discovering documents and examining a solicitor so that the trustee may determine whether certain assets belong to the bankrupt and whether to commence proceedings to recover the assets. Just before the hearing commenced, one of the creditors withdrew his claim leaving the UKIR as the only creditor of the bankrupt. The application was rejected on the basis that the UKIR was the sole creditor in the English bankruptcy and it was funding the trustee such that the trustee’s application was in effect a request to examine an individual in a tax bankruptcy and constituted an indirect attempt to enforce a tax debt and was therefore contrary to public policy. The court commented thatAyresseemed to go beyond the established English and Irish cases and it was extending the exception to the rule that no state would enforce the tax legislation of another state. The court observed that since at the time of the hearing, there was only one creditor,Ayreswas not applicable but, even if it were, the court was not prepared to follow it. 68     I turn to consider whether the facts of this case are distinguishable fromPeter Buchananas asserted by the plaintiff. The first point of distinction was that the plaintiff was put into liquidation by its own directors and not by the revenue authorities unlikePeter BuchananandQRS 1 Aps. That is true although the reason the plaintiff was put into liquidation was the issue of the Notice by the UKIR which made it plain to the Gorecias that action was about to be taken against the plaintiff to recover the amounts due to the UKIR. 69     The second distinction that the plaintiff sought to draw was that it had two creditors when the action was commenced,vizthe UKIR and the Gorecias themselves who had lodged a claim for £100,000. By the time the proceedings came before me, however, there was only one creditor remaining, the UKIR, as the Gorecias had withdrawn their claim on 3 November 2007. By their solicitors’ letter the Gorecias explained that they had not to that date filed a proof of debt because after entering into the Settlement Agreement they no longer regarded themselves as creditors. The situation here is akin to that inIn Re Tuckerwhere at the time the action was started, there was more than one creditor. By the time of the hearing, on 7 July 1988, however, the UKIR was the only creditor, the other creditor, one Michael Harris, having withdrawn his claim about two months earlier, on 13 May 1988 to be precise. The judge inIn Re Tuckerdid not look into the motivation behind the withdrawal and neither will I though it seems likely that the Gorecias’ claim was formally withdrawn so as to facilitate the defendant’s arguments on this issue. Of course, had Mr Bramston had the Gorecias’ claim in the forefront of his mind when he concluded the Settlement Agreement, he would have insisted that they formally waive their claim as part of that agreement, so ensuring that the UKIR was the only remaining creditor. Mr Bramston agreed in court that he had overlooked the Gorecias’ claim at the time and that otherwise he would have ensured that it was compromised as well so he cannot really complain about the withdrawal however opportunistic it was. Since, when the hearing started there was only one creditor left, the distinction the plaintiff sought to draw does not exist. 70     The next two factors can be considered together. The plaintiff argued that this was not a claim by the UKIR because it was not funding the liquidator and was not directing this action or the liquidation proceedings. In my view, these differences are only superficial. It must be remembered that Mr Bramston was not the Gorecias’ choice of liquidator. They appointed someone else and it was the UKIR that decided to replace the original liquidator with Mr Bramston. Secondly, Mr Bramston is not the standard type of liquidator who is appointed to administer the assets of the company in liquidation. He is a liquidator who is appointed to pursue claims. This is his main area of practice and the UKIR is his main client. UKIR appointed him as liquidator because it considered that there were claims that could be pursued by the plaintiff to recover funds which funds could be used to repay the outstanding taxes. The fact that Mr Bramston works on a no win no fee basis should not be allowed to obscure the prime purpose of his appointmentieto recover funds for the creditors. Since the only creditor of the plaintiff is the UKIR, the funds will go to the UKIR as Mr Bramston agreed in court. There is no need for the UKIR to direct the liquidation since it knows that Mr Bramston will have to pursue the plaintiff’s claims if he is to receive any payment for his work. Mr Bramston and the UKIR are of one mind in that they both see the purpose of his appointment as being to enforce claims belonging to the plaintiff. 71     I am, accordingly, satisfied that this claim is an attempt to indirectly enforce the revenue laws of the United Kingdom. Therefore, I cannot assist the plaintiff. I considerPeter Buchananto be a highly persuasive authority which should be applied in Singapore as it was in England in theQRS 1 Apscase and in Jersey inIn Re Tucker. InPeter Buchananitself, the court was clear that the defendant had been the perpetrator of a dishonest scheme to defraud the revenue authorities. The Jersey court also considered the bankrupt to be dishonest. Yet, in both those cases, relief was denied. In this case, the defendant was not dishonest. The dishonesty lay with Mr Gorecia. Whether the liquidator can pursue Mr Gorecia further depends on the interpretation of the Settlement Agreement. However, the plaintiff also has a claim against Mirren, for what it is worth.",
        "Conclusion": "72     In view of my conclusion in [71] above, there is no need for me to consider the final defence which was that the Settlement Agreement precluded the plaintiff from bringing the suit against the defendant. 73     In the result, this action fails and must be dismissed with costs."
    }
}