{
    "case_title": "Ong Wui Jin and Others v Ong Wui Teck",
    "ncitation": "[2008] SGHC 72",
    "coram": "Andrew Ang J",
    "sections": {
        "Background to the application": "2       The parties to this application were siblings. The deceased passed away sometime on 8 January 2005. According to an affidavit made by the first applicant in the action below, the deceased’s health condition deteriorated markedly in the midst of a heated quarrel between the first applicant and the respondent/defendant at the deceased’s home. An ambulance was called and the paramedics who attended to the deceased were of the view that her condition was very critical. The deceased was then immediately conveyed to hospital whereupon she died half an hour later (see paras 57 to 59 of the first applicant’s affidavit of evidence-in-chief dated 16 May 2006). 3       The main issue before the trial judge below was whether the Will executed by the deceased on 3 January 2005 (“the Will”), providing for a sum of $50,000 to be returned to the respondent and the remainder of her estate to be distributed equally among her surviving children, was valid. At the present hearing, I was told that the value of the deceased’s estate was worth around $700,000. 4       According to the first applicant (see in general paras 39 to 60 of his affidavit of evidence-in-chief dated 16 May 2006), the applicants were “very upset” with the respondent as the Will meant that the latter would receive $50,000 more from the deceased’s estate. The applicants also thought that the Will did not reflect their mother’s true intention. Thus, on 5 January 2005, the first applicant approached a lawyer and arranged for the latter to visit the deceased on 7 January 2005. The lawyer took instructions from the deceased and stated that he would prepare a fresh will and return the next day to have the deceased execute it. The deceased passed away on 8 January 2005 without executing a fresh will. 5       The applicants then sought to challenge the validity of the Will. After a 21-day trial, the district judge held that the Will was valid. In the brief grounds given on 31 December 2007, the district judge,inter alia, held: Having regard to the totality of the evidence, I am satisfied that the will of the Deceased was valid. In this regard, I accept the evidence of Spring Tan and Lin Xiaoli. I am also satisfied that the Deceased had testamentary [capacity], as supported by the evidence of Dr Ng Beng Yeong, the psychiatrist, as well as that of Dr N Nagulendran, an expert engaged by the Defendants to review and provide evidence whom the Defendants, elected not to call as a witness and whom the Plaintiffs subsequently called. I am also satisfied that the Defendants have not furnished any concrete evidence that the will was signed as a result of any undue influence or fraud. It is pertinent to note that Spring Tan, like Leroy Solomon, is an advocate and solicitor. She was present at the execution of the Will together with Lin Xiaoli, the certified interpreter. It is also pertinent to note that the 1stand 2ndDefendants were present at the time the Will was executed and were aware of the disputed clause. As such, there do not appear to be any suspicious circumstances and the Defendants, had they wanted to dispute the Will, should perhaps have raised it directly there and then. As for the Deceased’s supposed desire for equal distribution throughout, it must be recognized that firstly, it has not been clearly shown. Even if it had been, it is the testator’s prerogative to change her mind, which she may well have as evidenced by the 1stDefendant’s communication with Spring Tan to change the Will and also the subsequent instructions of Leroy Solomon Tan. It is however clear that the fresh Will was never executed. I should perhaps also add that the desire for equality as the testator’s consistent intention as advanced by the Defendants is somewhat inconsistent with the 2ndDefendant’s own evidence that the testator had wanted to give her the house, diamond ring and additional monies on the 2ndday of Chinese New Year. All things considered, I am satisfied that the said Will was valid. 6       Being dissatisfied with the district judge’s decision, the applicants then decided to appeal to the High Court. The notice of appeal was, however, served on 16 January 2008 and the service being two days out of time, the present application seeking a retrospective extension of time was made.",
        "The law": "7       The principles governing the court’s discretion to extend time had been recently restated by the Court of Appeal inLee Hsien Loong v Singapore Democratic Party[2008] 1 SLR 757(“LHL”). The four factors which the court would consider in an application for an extension of time to file or serve a notice of appeal are: (1) the length of the delay; (2) the reasons for the delay; (3) the chances of the appeal succeeding; and (4) the prejudice caused to the would-be respondent if an extension of time was in fact granted. The Court of Appeal stressed at [28] that all four factors were of equal importance and should be balanced amongst one another, having regard to all the facts and circumstances of the case concerned. It was also stated that if the delay wasde minimis, the court might not need to conduct an inquiry into the reasons for the delay: at [21]. 8       With specific regard to the third factor, namely, the chances of the appeal succeeding, the Court of Appeal observed at [20] that the merits of the case would be of signal importance where the appeal was a hopeless one as notwithstanding even a very short delay, an extension of time should generally not be granted as to do so would be an exercise in futility.",
        "My decision": "9       The matter first came before me on 21 February 2008. In view of thede minimisdelay, I was inclined not to inquire any further into the reasons of the delay. That aside, the respondent’s affidavit filed on 19 February 2008 challenged the application to extend time on the grounds,inter alia, that there were no merits to the appeal. I then adjourned the hearing to allow the applicants the opportunity to file reply affidavits. Four reply affidavits were filed. In this regard, the merits of the applicants’ appeal were addressed by way of counsel for the applicants Mr Dodwell’s affidavit-in-reply filed on 6 March 2008. At para 22 of the said affidavit, it was stated that: There is [sic] clearly inconsistent statements as to the mother’s ‘true will and intent’ and that is why it would be most prudent and in the interest of justice that a High Court Judge, who are [sic] clearly more apt and known for their more profound legal skills and aptitude, clearly acknowledged as being the top legal minds of Singapore to review the whole of the evidence, the whole case and determine if truly the alleged Will was valid. I humbly submit that there is a marked difference between a determination that is made by a High Court Judge and that of a District Court Judge, and that the whole purpose of the Justice System is for parties to have their matters resolved on substantive issues, and the Rules of Court have allowed for the Courts to be imbued with inherent jurisdiction and the ability to extend time, and determine any other indiscretions of the procedural justice, which is a means to the eventual end of having the matter determined on the substantive issues before the Courts. 10     At para 32, he continued: There was never any doubt that if either party lost at first instance, there will be an appeal on this matter. There are valid grounds for the appeal, as it is [sic] Learned District Judge may have failed to consider that a subsequent will, though unexecuted, may still reflect the true intent of the deceased, and case law appears to indicate so. This issue of validity of an unexecuted will have never [sic] been considered by this Honourable Courts before, and it will be a novel point for due consideration by the High Court at the appeal of this matter. There is also the challenge on the issues of (i) want of knowledge and/or approval, (ii) undue influence and (iii) duress. 11     Finally, counsel stated, at para 36: … It is clearly a matter of public interest as the facts in this case will determine the proper roles and procedure of lawyers in the execution of wills, it will determine on [sic] the issue of want of knowledge and/or approval which appears not to have been dealt with by these Honourable Courts prior to this case and also on the issue of undue influence and/or duress pertaining to the execution of the will. 12     At the hearing before me on 31 March 2008, counsel for the applicants reiterated that the matter had been closely contested and that there were issues as to the deceased’s knowledge of the contents of the Will, duress and/or undue influence. He added that the appeal was not simply based on findings of facts and that there were issues of law involved as well. 13     Counsel for the respondent resisted the application on the basis that the applicants had failed to show that the appeal would not be a hopeless one. In particular, counsel pointed out to me that the applicants had at no point alluded to any error of fact or law in the brief grounds provided by the district judge, or that the findings made by the district judge were against the weight of the evidence. 14     Mr Dodwell’s views at para 22 of his affidavit-in-reply ([9] above) were, to put it mildly, unwarranted. Likewise, in the light of the Wills Act (Cap 352, 1996 Rev Ed), I gave little weight to the “novel” legal issue that an unexecuted will could still be valid under Singapore law. 15     As for the deceased’s lack of knowledge and the allegations of undue influence and/or duress, the district judge had found that the deceased had testamentary capacity when the Will was made and that there was no concrete evidence of undue influence or fraud. These were clearly findings of fact and it is trite law that an appellate court would not reverse such findings unless they were plainly wrong or against the weight of the evidence: seeAlagappa Subramanian v Chidambaram s/o Alagappa[2003] SGCA 20at [13]: Before we go on to deal with these issues, it is important to note that they arise from disputes of fact. The holdings of the judge are not challenged on the basis that they are wrong in law. They are challenged on the basis that he came to wrong conclusions of fact. An appellate court will not reverse the findings of fact made by the judge of first instance unless such findings are plainly wrong or against the weight of the evidence. SeeSeah Ting Soon t/a Sin Meng Co Wooden Cases Factory v Indonesian Tractors Co Pte Ltd[2001] 1 SLR 521. Further, where a judge at a trial has come to a conclusion as to which witnesses are creditworthy and which are not, an appellate court will generally defer to such conclusions. However, in deciding whether the trial judge was plainly wrong, the appellate court will evaluate the quality of the evidence given by the witnesses by testing it against inherent probabilities or against uncontroverted facts. SeePeh Eng Leng v Pek Eng Leong[1996] 2 SLR 305. 16     Thus, bearing in mind that this was largely an appeal against the trial judge’s findings of fact, I would have thought that any reasonable counsel would point out the deficiencies, if any, in the grounds provided by the district judge. Notwithstanding the fact that the grounds were brief, the applicants could have referred to the evidence tendered in the trial below to mount aminimumchallenge on the findings made by the trial judge,ie, place some evidence before me which supports the contention that the deceased did not have testamentary capacity or that there had been undue influence or duress at the time the Will was made. While I am mindful that the court’s role at this stage is not to go into a full-scale inquiry on the merits of the case, counsel ought to have done more than simply harp on the point that this was a factually complex matter involving the evidence of multiple witnesses. 17     I would add that the matter was adjourned for over a month since the first hearing for the applicants to address the issues raised by the respondent in his affidavit filed on 19 February 2008, one of which was that “[t]he Plaintiffs had in fact failed to show any substantive grounds to challenge the said decision of the trial judge or show that there was any fundamental errors with the decision of the District Court or trial Judge” (see para 22 of the said affidavit). Further, counsel for the respondent had also pointed out during the second hearing on 31 March 2008 that the applicants had failed to allude to any error of fact or law in the brief grounds provided by the district judge. 18     In LHL, the Court of Appeal was of the view that an applicant bore the onus of showing that the appeal would not be a hopeless one. The court stated, at [63]: In this regard, an important observation has to be made at the outset: Before this court, the applicant did not address the main reasons why the Judge did not grant the adjournment application. This was,ipso facto, fatal to the present applications – at least in relation to the present factor. As we shall see, the applicant raised issues before this court that were at best peripheral and at worst irrelevant in a bid to extend the time for appealing. 19     In the present application, counsel for the applicants had been given multiple opportunities to mount aminimumchallenge on the trial judge’s brief grounds but for some inexplicable reason, he chose not to do so. Instead, he raised legal arguments that were inconsequential and sought refuge in vague generalitiesvis-à-visthe findings made by the trial judge. Thus, bearing in mind that this was a factual appeal and there was not even the slightest attempt to challenge the trial judge’s findings, I had little alternative but to conclude that there was no real prospect of success in the appeal and that the appeal would be a hopeless one. Accordingly, I exercised my discretion not to grant the application.",
        "Whether leave to appeal required": "20     At the hearing on 31 March 2008, counsel for the respondent briefly raised the issue whether leave to appeal to the High Court was required as the amount in dispute was only $50,000. It is true that in effect the dispute was whether the respondent was entitled to the $50,000 payment under the Will, the remainder of the estate having to be divided equally between the siblings in any event, either pursuant to the Will or upon intestacy. If the $50,000 had to be shared, each of the siblings would receive $10,000. However, I observed that in the court below, the applicants had premised their caveats against the grant of probate on the complaint that the Will was invalid, as opposed to simply challenging the specific clause in the Will providing for the return of $50,000 to the respondent. Hence, the appeal was technically over the validity of the entire Will. 21     The applicable principles on whether leave to appeal was required could be found inHailisen Shipping Co Ltd v Pan-United Shipyard Pte Ltd[2004] 1 SLR 148, where the Court of Appeal stated that, at [15]: Reverting to the instant case, the question to ask is what was the “subject matter” before Ang J. Here, we must observe that while PUS was only claiming for $170,000, which ordinarily should have been commenced in a District Court, it had to be commenced in the Singapore High Court because it was anin remaction. What was before Ang J was not the claim of $170,000 of PUS but the questions of whether the warrant of arrest of the vessel should be set aside and, if so, whether there should be an order for an assessment of damages. Both these questions were the “subject-matter” before Ang J which she answered in the affirmative. Neither of them bore any specific value. Indeed, the damages to be assessed was wholly at large. The claim of PUS in the main action could in no way limit the damages suffered by Hailisen due to the wrongful arrest. Therefore, the matter did not fall within s 34(2)(a) and no leave was required. 22     Thus, I was of the view thatprima facie, I had the jurisdiction to rule on the extension of time issue as the subject matter of the trial below was technically the validity of the Will which I thought had no specific value. While a monetary value could be assigned to the deceased’s estate, I did not think the same could be done in respect of the appointments of executors and trustees,etc. In the premises, I was of the view that no leave to appeal was necessary. 23     Be that as it may be, in the result, I disallowed the application for the foregoing reasons with costs fixed at $500."
    }
}