{
    "case_title": "Chip Hup Hup Kee Construction Pte Ltd v Ssangyong Engineering & Construction Co Ltd",
    "ncitation": "[2008] SGHC 159",
    "coram": "Lim Jian Yi AR",
    "sections": {
        "The facts": "6       The construction works in question were a part of the proposed Marina Bay Sands Integrated Resort. The Respondent is the main contractor for the construction works in relation to the hotel portion of that project, and the Claimant was appointed the sub-contractor for the reinforced concrete structural works of that portion of the project by means of a letter of acceptance dated 3 September 2007. The sub-contract sum was for $12,000,000. 7       Various disputes arose between the parties, boiling down to cross-allegations of contractual breaches by both parties. On 21 April 2008, the Claimant served Progress Claim No. 5 on the Respondent for the sum of $1,616,207.149. Under s 11 of the SOP Act, the deadline for the Respondent to submit its payment response was 12 May 2008 (i.e. 21 days after the service of Progress Claim No. 5). However, no payment response was served by the end of this period. 8       On 17 May 2008, by way of letter, the Claimant reminded the Respondent to provide its payment response. However, there was still no payment response forthcoming during the dispute settlement period mandated under s 12 of the SOP Act (i.e. the 7-day period after 12 May 2008). 9       On 22 May 2008, after the expiry of the dispute settlement period, the Claimant gave the Respondent a Notice of Intention to Apply for Adjudication as required by s 13(2) of the SOP Act. On the same day, the Claimant submitted its Adjudication Application for Progress Claim No. 5 (“the Adjudication Application”) under s 13(1) of the SOP Act to the Singapore Mediation Centre (“SMC”) as an authorised nominating body. The application identified the contract type as a construction contract for the provision for works and services, and that the nature of the dispute was a “failure to respond with payment response.” The claimed amount was $1,103,101.49. 10     The following day, 23 May 2008, the SMC served a copy of the Adjudication Application on the Respondent, as required by s 13(4) of the SOP Act, and informed the Respondent that it had to lodge its Adjudication Response within seven days. 11     The Respondent provided a copy of Payment Certificate No. 5 to the Claimant on the same day, which certified the value of the works done to be only $659,196.82. It further listed certain back-charges allegedly owed by the Claimant to the Respondent totalling $515,635.01. According to the Respondent, these had arisen for four reasons: (a)    There were defects in the works done by the Claimant’s workers which had to be rectified by the Respondent; (b)    The Claimant had failed to provide sufficient workers and the Respondent instead provided the workers; (c)    The Claimant had failed to provide certain materials; and (d)    The Claimant’s breach of safety regulations at the site had caused a penalty to be levied, which the Respondent had paid. 12     On 29 May 2008, the SMC notified the Claimant that Mr Goh had been appointed as the Adjudicator. On 30 May 2008, the Respondent submitted Adjudication Response SOP/AA22/2008, which included Payment Certificate No. 5 as a supporting document. On 4 June 2008, the Claimant’s solicitors wrote to the Adjudicator objecting to, among other things, the inclusion of Payment Certificate No. 5 and the reasons for withholding amounts stated therein. The Respondent’s solicitors wrote back on 6 June 2008, disagreeing with that position. 13     In the meantime, the parties were still fighting over related issues on the site. The sub-contract was terminated sometime in late May or early June 2008. The parties dispute who had repudiated the sub-contract. In other developments, on 3 June 2008, the Respondent had commenced Suit No. 379 of 2008 against the Claimant, and also applied for an interim injunction by way of Summons No. 2403 of 2008 to compel the Claimant to vacate the project site. The latter injunction was granted on 3 June 2008. The suit was discontinued on 21 July 2008. 14     The parties attended an Adjudication Conference on 13 June 2008 at the Adjudicator’s office. The Adjudication Determination in favour of the Claimant was issued on 25 June 2008, containing the following terms: (a)    the Respondent shall pay to the Claimant the adjudicated amount of $1,103,101.49; (b)    the adjudicated amount was due and payable on 16 June 2008; (c)    the Respondent shall pay to the Claimant interest at the rate of 5.33% per annum on the adjudicated amount of $1,103,101.49 from 16 June 2008 until the date of full payment; (d)    the costs of the adjudication being the Adjudication Application Fee of $535.00 (inclusive of GST) and the Adjudicator Fee of $6,420.00 (inclusive of GST) shall be borne entirely by the Respondent. 15     The Respondent did not pay any part of the adjudicated amount by the date specified, and the Claimant commenced the present originating summons pursuant to s 27 of the SOP Act on 3 July 2008 in order to obtain leave of court to enforce the Adjudication Determination in the same manner as a judgment or order of the court. This was granted. The Respondent then filed this present summons under s 27(5) of the SOP Act and paid the unpaid portion of the adjudicated amount into court as security as required by the provision. The summons prayed that: (a)    The Adjudication Determination be set aside and a fresh adjudication be fixed; and (b)    The order of court granting leave to the Claimant to enforce the Adjudication Determination in the same manner as a judgment or order of court be set aside. 16     Prayers for a stay of proceedings or a holding of security by the court pending final determination of the substantive dispute by a court or arbitration tribunal contained in the summons were not pursued at the hearing before me.",
        "The issue stated": "17     In the Adjudication Determination, the Adjudicator stated that there were two issues before him. These were: (a)    Whether s 15(3) of the SOP Act precluded him from considering Payment Certificate No. 5 and the reasons given by the Respondent for withholding amounts due to the Claimant found in the Adjudication Response and the annexed documents; and (b)    Whether he had jurisdiction to deal with the Adjudication Application when the sub-contract between the parties had been terminated. 18     The second question was answered in the affirmative. The Respondent did not make any arguments before me on that point and I will not discuss it further. 19     The first question is the heart of the present application. Section 15(3) of the SOP Act states: The respondent shall not include in the adjudication response, and the adjudicator shall not consider, any reason for withholding any amount, including but not limited to any cross-claim, counterclaim and set-off, unless — (a)    where the adjudication relates to a construction contract, the reason was included in the relevant payment response provided by the respondent to the claimant; or (b)    where the adjudication relates to a supply contract, the reason was provided by the respondent to the claimant on or before the relevant due date. 20     The Adjudicator noted that it was not in dispute that Payment Certificate No. 5 was provided neither within the 21-day period stipulated under s 11 of the SOP Act nor the 7-day dispute settlement period stipulated in s 12(4) of the SOP Act. His holding can be found at [31] of the Adjudication Determination: I do not accept the Respondent’s contention that section 15(3) [of the SOP Act] allows them to include in their Adjudication Response the reasons for withholding payment when those reasons had earlier been communicated to the Claimant [via payment responses to earlier payment claims]. The language of section 15(3)(a) is clear and unambiguous. It refers to“reason(s) included in a relevant payment response by the respondent to the claimant.”The reasons given by a respondent in a payment response to an earlier progress claim do not fall within the meaning of the expression“reason(s) included within a relevant payment response”in section 15(3)(a). In my view, a “relevant payment response” for the purposes of section 15(3)(a) must be a payment response to a payment claim submitted by a claimant which is the subject of an adjudication application. Such a construction is in fact supported by section 11(2) of the Act which requires a payment response provided in relation to a construction contract by a respondent to identify the payment claim to which it relates. In our instant case, the payment claim submitted by the Claimant was their Progress Claim No. 5 and since no payment response was given by the Respondent pursuant to either section 11(1) or 12(4) of the [SOP Act] to the Claimant’s Progress Claim No. 5, I am therefore precluded by section 15(3) of the [SOP Act] from considering the reasons given by the Respondent in their Adjudication Response. I have considered and do not accept the reasons advanced by [the] Respondent in their Written Submissions for me to consider the reasons given in their Adjudication Response for withholding payment to the Claimant. If I do so, it would mean that I will disregard the prohibition in section 15(3) of the [SOP Act]. [emphasis in original] 21     The Adjudicator then quoted a breakdown of the claimed amount from the Notice of Intention to Apply for Adjudication. He obtained clarification from the Claimant that the claimed amount of $1,103,101.49 was arrived at after subtracting certain payments and deductions in respect of Progress Claim Nos. 3 and 4 from the amount of $1,616,207.15 in Progress Claim No. 5. He concluded at [41] of the Adjudication Determination as follows: As there was no valid payment response from the Respondent to challenge the Claimant’s claim and section 15(3) of the Act directs me not to consider any reason included by the Respondent in their Adjudication Response for withholding any amount due to the Claimant where the reason was not included in [a] valid payment response, I accepted the Claimant’s valuation of the work done for its Progress Claim No. 5 and the outstanding amount for that claim. 22     Before me, the Respondent argued that the Adjudicator was wrong to interpret s 15(3) of the SOP Act to completely exclude all aspects of the Respondent’s case, and that such an interpretation constituted a failure to carry out his quasi-judicial responsibilities to ensure that justice was done; in particular, he had failed to comply with his obligations to abide by the rules of natural justice as required under s 16(3) of the SOP Act.",
        "The SOP Act and foreign legislation": "23     The SOP Act is based on Building and Construction Industry Security of Payment Act 1999 of New South Wales (“the NSW Act”), which in turn is based on the UK Housing Grants, Construction and Regeneration Act 1996 (“the UK Act”). The broad aims of these enactments are similar to ours and the structural similarities, in particular relation to the NSW Act, are striking. In the proceeding analysis, I will therefore make reference to cases from these jurisdictions where appropriate. Where differences are material, this will also be highlighted.",
        "Preliminary issues: The scope of the present application": "24     As a preliminary but important point, I wish to make two brief comments on the scope of setting aside applications under the SOP Act. My first point relates to whether the substantive merits of an adjudicator’s determination ought to be examined by a court hearing a setting aside application. The boundaries of such applications under the SOP Act are not entirely clear. Indeed, reference to setting aside in the SOP Act is only oblique. Section 27(5) of the SOP Act states: Where any party to an adjudication commences proceedings to set aside the adjudication determination or the judgment obtained pursuant to this section, he shall pay into the court as security the unpaid portion of the adjudicated amount that he is required to pay, in such manner as the court directs or as provided in the Rules of Court (Cap. 322, R 5), pending the final determination of those proceedings. 25     What is clear is that the setting aside application is not an appeal. The SOP Act already provides a limited right of reviewing the substantive correctness of the adjudication determination through the adjudication review procedure under ss 18 and 19. (I say it is limited because there is only such a right for the respondent, and then only if the adjudicated amount exceeds the relevant response amount by a prescribed amount: s 18(1) of the SOP Act. The prescribed amount is presently $100,000: s 10(1) of the Building and Construction Industry Security of Payment Regulations (Cap 30B, Regulation 1) (“the SOP Regulations”). Section 18(1) of the SOP Act presupposes that there has been a payment response made and thus is also not available to respondents who fail to give a payment response.) The panel of review adjudicators may substitute their determination of the appropriate adjudication amount for the previous adjudication determination. 26     Given the availability of the adjudication review procedure, it is not surprising that a court considering a setting aside application should not be concerned with substantive issues. Such was the view of the parties before me, who agreed not to touch upon the merits of the Adjudication Determination during the hearing. The Respondent did, however, touch briefly on the merits of the Adjudication Determination in his written submissions for the sake of completeness, but did not press these matters at the hearing. 27     It is possible, though I express no firm view on this, that there may be discretion for a court to refuse to set aside an adjudication determination, even in cases where the technical grounds for doing so have been met, where such setting aside would merely result in a re-hearing by the adjudicator, who would simply reach the same decision as before. As I will discuss in greater detail later, the SOP Act leans in favour of timely and cost-effective dispute resolution, and where it can be shown that a re-hearing would not make a difference, it would certainly not be consistent with those aims to have a re-hearing just for form’s sake. But again, this issue was not before me and I merely raise the subject for future consideration. 28     The second point I wish to make concerns whether I am limited to considering jurisdictional issues only in hearing this application. The Claimant had initially argued that there was no jurisdictional issue to be tried and there was thus no ground for me to set aside the Adjudication Determination. It argued that the proper approach was for the Court to ask if the adjudicator had considered the right question, and that if he had, then even if he came to the wrong conclusion, he would still be acting within his jurisdiction. It was submitted that such a decision should not be interfered with. 29     The question asked by the Adjudicator in this case was whether he could consider the reasons for withholding payments which were not included in a relevant payment response under s 15(3) of the SOP Act. This was a question of law. It may be that an error in answering that question would merely be a non-jurisdictional error of law, which is what the Claimant’s argument is suggesting. But I think that it is more important to note that the question raises issues of natural justice. The adjudicator’s obligation to comply with the rules of natural justice is enshrined in s 16(3) of the SOP Act. My own view is that a court examining a setting aside application can review the adjudicator’s decision for compliance with those requirements, quite apart from issues of jurisdiction. As the Claimant himself eventually conceded during the hearing on my prompting, a breach of natural justice would constitute grounds for setting aside the Adjudication Determination. 30     In New South Wales, it was previously the case that judicial review of an adjudicator’s determination was not available for all non-jurisdictional errors of law:Musico v Davenport[2003] NSWSC 977. However, inBrodyn Pty Ltd v Davenport[2004] NSWCA 394, Hodgson JA for the New South Wales Court of Appeal stated that beyond jurisdictional errors, an adjudication determination also had to comply with what he called “basic and essential requirements” of the existence of a determination. Natural justice forms one of these basic and essential requirements, as he explained at [57]: The circumstance that the legislation requires notice to the respondent and an opportunity to the respondent to make submissions (ss17(1) and (2), 20, 21(1), 22(2)(d)) confirms that natural justice is to be afforded to the extent contemplated by these provisions; and in my opinion, such is the importance generally of natural justice that one can infer a legislative intention that this is essential to validity, so that if there is a failure by the adjudicator to receive and consider submissions, occasioned by breach of these provisions, the determination will be a nullity. 31     The abovedictais exactly on point for the instant case. If the Respondent is right that s 15(3) of the SOP Act did not prevent the Adjudicator from consider its reasons for withholding payment, then the latter must have committed a breach of natural justice by ignoring the Respondent’s submissions. 32     Likewise, under s 108(2)(e) of the UK Act, an adjudicator is obliged to act impartially, just as in s 16(3) of the SOP Act. It has been established in that jurisdiction that a breach of natural justice is a reason not to enforce an adjudication determination:AMEC Capital Projects Ltd v Whitefriars City Estates Ltd[2005] BLR 1, a case involving allegations of apparent bias. 33     The two points made above are consonant with those of the learned author ofSecurity of Payments and Construction Adjudication(LexisNexis, 2005), who states at p 497 in relation to the SOP Act: Given that a challenge against an adjudication determination is typically advanced on either jurisdictional grounds or on the allegation of a breach of the principles of natural justice and that a challenge is not an appeal against the decision of the adjudicator, it would follow that the court in determining the case for a challenge does not have to theoretically revisit the matters dealt with by the adjudicator with respect to both questions of fact and of law. This feature, therefore, distinguishes an adjudication review under the Act from a legal challenge against an adjudication determination. However, in considering whether the adjudicator has exceeded his jurisdiction, it is frequently necessary for the court to launch into a review of those issues of fact and law which pertain to jurisdiction. In these cases, the attention of the court may also be drawn to the approach of the adjudicator in the making of the determination in relation to the application of the principles of natural justice.",
        "Substantive issue: Whether the Adjudicator was right not to consider the Respondent’s reasons for withholding payment": "34     Although the Respondent apparently put its arguments solely in terms of s 15(3) of the SOP Act, I found that it was really making a two-prong argument. The first prong was that s 15(3) of the SOP Act ought to be interpreted in such a manner as to oblige the Adjudicator to consider the Respondent’s reasons for withholding payment. I think the Respondent’s main submission on this point was that s 15(3) of the SOP Act did not apply to cases where there was no payment response submitted, such as the present case, because of considerations of natural justice. I propose to deal with this argument in the following manner: First, I would examine what a literal reading of the provision suggested. Next, I would consider whether the requirements of natural justice obliged me to interpret the provision in a different manner. This would involve a general discussion of the policy behind the SOP Act and how this ought to colour the interpretation of s 15(3) of the SOP Act, as well as a more particular consideration of whether the Adjudicator’s approach denied the Respondent a fair hearing. 35     The second prong was not so clearly highlighted in the Respondent’s submissions as a distinct line of argument, but I think it is in fact an argument in the alternative to the first. The Respondent sought to argue that other provisions of the SOP Act, in particular s 16(7), obliged the Adjudicator to consider all the documents and information available to him, which would include Payment Certificate No. 5, the Adjudication Response and the submissions made thereon.",
        "Interpretation of s 15(3) of the SOP Act": "Literal interpretation 36     The first question to ask is whether Payment Certificate No. 5 could be construed as a payment response. In that regard, does the reference to the “relevant payment response” in s 15(3) of the SOP Act refer to payment responses made in time, or can it also refer to late payment responses? If it is the latter, then the Adjudicator should have considered the reasons contained in Payment Certificate No. 5, even though it was not tendered in either the earlier 21-day period or the later 7-day dispute settlement period. 37     From a literal reading, the latter interpretation is not supported. A “payment response” is defined in s 2 of the SOP Act as (in relation to a construction contract) “a response to a payment claim made by a respondent under section 11 (1) or 12 (4)”. Both of these provisions deal with the specific timelines in which a payment response may be provided. The former provision reads: A respondent named in a payment claim served in relation to a construction contract shall respond to the payment claim by providing, or causing to be provided, a payment response to the claimant — (a)    by the date as specified in or determined in accordance with the terms of the construction contract, or within 21 days after the payment claim is served under section 10, whichever is the earlier; or (b)    where the construction contract does not contain such provision, within 7 days after the payment claim is served under section 10. 38     The latter provision, under subsection (b), stipulates that even if a respondent has failed to provide a payment response under the s 11(1) deadline, he still has a second chance to do so during the subsequent dispute settlement period. For completeness, it should be noted that the dispute settlement period is defined in s 12(5) of the SOP Act as “the period of 7 days after the date on which or the period within which the payment response is required to be provided under section 11 (1).” 39     It follows that a payment response is a response which is made during either of these two periods. As noted by the Adjudicator, Payment Certificate No. 5 was only issued after these two periods had expired. Thus, it cannot be considered as “the relevant payment response” under s 15(3) of the SOP Act. In effect, by a literal reading of the provision, there can no such thing as a “late” payment response; any purported response tendered out of time is not a payment response at all. Following this logic, the Respondent had failed to provide any payment response. A plain reading of s 15(3) of the SOP Act would thus support the adjudicator’s decision not to consider any of the Respondent’s reasons why it withheld payment at all. Consistency with natural justice 40     The Respondent appears to accept that Payment Certificate No. 5 was not a payment response because it was not tendered in time. The focus of its argument was that, nevertheless, s 15(3) of the SOP Act could not be interpreted in a manner which prevented it from raising its reasons for withholding payment at the adjudication hearing as such an interpretation would be inconsistent with natural justice. The Respondent would have been deprived of an opportunity to have his case heard. The proper interpretation of s 15(3) of the SOP Act, the Respondent argued, would be to confine it to cases where a payment response had been tendered and not, as in the present case, where there was no payment response. 41     In support of this argument, the Respondent submitted that Parliament would have intended the SOP Act to be fair and just. As a general proposition, that submission is undoubtedly correct. A passage fromWaugh v Pedneault[1949] 1 WWR 14at 15, was cited to me: The Legislature cannot be presumed to act unreasonably or unjustly, for that would be acting against the public interest. The members of the Legislature are elected by the people to protect the public interest, and that means acting fairly and justly in all circumstances. Words used in enactments of the Legislature must be construed upon that premise. That is the real “intent” of the Legislature. That is why words in an Act of the Legislature are not restricted to what are sometimes called their “ordinary” or “literal” meaning, but are extended flexibly to include the most reasonable meaning which can be extracted from the purpose and object of what is sought to be accomplished by the statute. 42     The same principle has been forcefully described in another much-cited passage by Lord Bridge inLloyd v McMahon[1987] AC 625 at 702: My Lords the so-called rules of natural justice are not engraved on tablets of stone. To use the phrase which better expresses the underlying concept, what the requirements of fairness demand when any body, domestic, administrative or judicial, has to make a decision which will affect the rights of individuals depends on the character of the decision-making body, the kind of decision it has to make and the statutory or other framework in which it operates. In particular, it is well-established that when a statute has conferred on any body the power to make decisions affecting individuals, the courts will not only require the procedure prescribed by the statute to be followed, but will readily imply so much and no more to be introduced by way of additional procedural safeguards as will ensure the attainment of fairness. 43     In the present case, not only is there an obligation to read the SOP Act in accordance with the rules of natural justice, but also, adherence to such rules is prescribed in the SOP Act itself. Section 16(3) of the SOP Act reads: An adjudicator shall — (a)    act independently, impartially and in a timely manner; (b)    avoid incurring unnecessary expense; and (c)    comply with the principles of natural justice. 44     In the instant case, the Respondent has alleged that its submissions on the reasons why it was entitled to withhold payment were not heard by the Adjudicator. This is an invocation of the rule of natural justice which stipulate that every man has a right for his defence to be heard, otherwise known asaudi alteram partem. Such a rule, as has been colourfully stated by Fortescue J inR v University of Cambridge(1723) 1 Str 557, is of ancient and noble vintage: I remember to have heard it observed by a very learned man upon such an occasion, that even God himself did not pass sentence upon Adam, before he was called upon to make his defence. ‘Adam, says God, where art thou? Hast thou not eaten of the tree, whereof I commanded thee that thou shouldst not eat?’ And the same question was put to Eve also. 45     The point has been reiterated by the Court of Appeal in the recent case ofKay Swee Pin v Singapore Island Country Club[2008] 2 SLR 802at [7]: A duty to act fairly involves a duty to act impartially. Procedural fairness requires that the decision-maker should not be biased or prejudiced in a way that precludes a genuine and fair consideration being given to the arguments or evidence presented by the parties:Halsbury’sat para 10.050. It is also a cardinal principle of natural justice that no man shall be condemned unheard. Compliance with theaudi alteram partemrule requires that the party liable to be directly affected by the outcome of the disciplinary proceedings should be given notice of the allegation against him and should be given a fair opportunity to be heard. 46     These rules are simple to state and uncontroversial, but as usual, the devil is in the details. Was it a breach of natural justice for the Adjudicator to have disregarded the reasons for withholding payment put forth by the Respondent in its Payment Certificate No. 5 and its Adjudication Response? The purpose of the SOP Act 47     As I have stated earlier, the literal reading of s 15(3) of the SOP Act clearly supported the Adjudicator’s decision. In such a case, a court would be leery of legislating from the Bench by imputing a different interpretation to those clear words. Lord Reid has stated inWiseman v Borneman[1971] AC 297 at 308: Natural justice requires that the procedure before any tribunal which is acting judicially shall be fair in all the circumstances, and I would be sorry to see this fundamental general principle degenerate into a series of hard and fast rules. For a long time the courts have, without objection from Parliament, supplemented procedure laid down in legislation where they have found that to be necessary for this purpose.But before this unusual kind of power is exercised it must be clear that the statutory procedure is insufficient to achieve justice and that to require additional steps would not frustrate the apparent purpose of the legislation.[emphasis added] 48     What then was the apparent purpose of the SOP Act? The Act, enacted on 1 April 2005, came into being during a time of grave difficulty for the construction industry. The rationale for the legislation was spelt out by the Minister of State for National Development at the Second Reading of the Building and Construction Industry Security of Payment Bill (“the SOP Bill”) on 16 November 2004 at Col 1112: Progress payments are made periodically throughout the project's duration. Parties lower down the value chain usually fund their work in advance and collect payments thereafter. These downstream players will therefore be adversely affected if those upstream fail to make prompt payment for work done or materials supplied. Contractual terms also tend to favour those higher up the chain. For example, parties downstream are subject to the \"pay when paid\" clause, whereby they get paid only when those upstream have been paid. The parties who have not been paid for work done are also not permitted to suspend work. In some instances, they are also required to pay liquidated damages ifthey suspend work. The SOP Bill will preserve the rights to payment for work done and goods supplied of all the parties in the construction industry. It also facilitates cash flow by establishing a fast and low cost adjudication system to resolve payment disputes. Affected parties will have the right to suspend work or withhold the supply of goods and services, if the adjudicated amount is not paid in full or not paid at all. […] Sir, this Bill cannot be expected to resolve every payment issue and all the payment woes in the industry. However, by upholding the rights of any party in the industry to seek payment for work done or goods supplied, this Bill will help to deter and weed out the practice of delaying or withholding payment without valid reasons. The speedy and low cost adjudication process will expedite the resolution of genuine payment disputes so that cashflow will not be disrupted. It will identify contractors who are facing financial difficulties early, before they cause more problems downstream. 49     The efficiency of the adjudication process and the assurance of a smooth cash flow even in the event of disputes are thus hallmarks of the SOP Act. In this respect the SOP Act is no different from the UK Act. Dyson J inMacob Civil Engineering Ltd v Morrison Construction Ltd[1999] CLC 739said at [14]: [… ] The intention of Parliament in enacting the Act was plain. It was to introduce a speedy mechanism for settling disputes in construction contracts on a provisional interim basis, and requiring the decisions of adjudicators to be enforced pending the final determination of disputes by arbitration, litigation or agreement: see s. 108(3) of the [UK Act] and para. 23(2) of Pt. I of the Scheme. The timetable for adjudications is very tight (see s. 108 of the [UK Act]). Many would say unreasonably tight, and likely to result in injustice. Parliament must be taken to have been aware of this. […] It is clear that Parliament intended that the adjudication should be conducted in a manner which those familiar with the grinding detail of the traditional approach to the resolution of construction disputes apparently find difficult to accept. But Parliament has not abolished arbitration and litigation of construction disputes. It has merely introduced an intervening provisional stage in the dispute resolution process. […] 50     These special considerations influence how the established canons of natural justice would be applied in relation to the SOP Act. I have quoted Lord Reid’s comment that “the so-called rules of natural justice are not engraved on tablets of stone”: at [42] above. There are numerous other learned pronouncements to the same effect: Lord Denning MR inR v Gaming Board for Great Britain ex p. Benaim and Khaida[1970] 2 QB 417 at 439, saying that “it is not possible to lay down rigid rules as to when the principles of natural justice are to apply: nor as to their scope and extent. Everything depends on the subject-matter”; or Sachs LJ inRe Pergamon Press Ltd[1971] Ch 388 at 403, stating that “in the application of the concept of fair play there must be real flexibility.” Justice, whether performed by a court, a tribunal or any quasi-judicial body, is a balancing exercise between thoroughness and timeliness. More formal settings, such as litigation through a court, would tend to emphasis the former. The adjudication process under the SOP Act instead chooses a quicker, but somewhat less thorough, means of achieving justice. This is a general theme which pervades the SOP Act and in itself is not a ground for saying that natural justice has been denied. 51     I accept that a respondent would face what are admittedly rather tight deadlines for the submission of its payment response under ss 11(1) and 12(4) of the SOP Act. A respondent has, depending on the terms of the contract, only between 7 to 21 days in which it can make its response. This can pose certain difficulties in some cases where the payment claim raises many complicated issues which the respondent must address. (In relation to the following paragraphs, I would expressly reserve my views on whether it is possible to do natural justice for a respondent in the timelines given in cases of exceptional complexity or where the claimant delivers a payment claim just before a long holiday period: c.f. Judge Toulmin CMG QC’s comments inAWG Construction Services Ltd v Rockingham Motor Speedway Ltd[2004] TCLR 6at [123] in relation to the UK Act.) 52     But for the usual case, and certainly for the present case, it is important to understand that the efficiency of the process places pressures on everyone else involved as well. Under s 13(1) of the SOP Act, the claimant must make his adjudication application within 7 days of the date when his entitlement to make such an application arises. An adjudication application served out of time will be ignored by the adjudicator: s 16(2)(a) of the SOP Act. The adjudicator himself has, subject to the agreement of the parties, only between 7 to 14 days from the commencement of the adjudication to make his adjudication determination: s 17(1) of the SOP Act. 53     Furthermore, while it may seem that the timelines lean in favour of the claimant, it must be remembered that the adjudication determination reached at the end of the process is only an interim determination made in order to promote a smooth cash flow. While such determinations are binding on the parties under s 21(1) of the SOP Act, the rights of any party to challenge the adjudication determination in any proceeding before a court or tribunal or in any other dispute resolution proceeding are unaffected: s 21(3) of the SOP Act. Section 34(1) of the SOP Act also makes it clear that parties are free to pursue any other dispute resolution proceeding concurrently with the adjudication process. In making the preceding comments, I am not saying that defects in procedure in one set of proceedings can be ignored so long as some rectification can be made in different proceedings. Rather, the adjudication process must be understood in its larger context, being, as it were, the handmaiden of more formal dispute resolution procedures, in that it supplies timeliness where the other kinds of proceedings provide thoroughness. 54     The Respondent argued that the Claimant would not be prejudiced by its more liberal interpretation of s 15(3) of the SOP Act as, although Payment Certificate No. 5 was not technically a payment response, it still informed the Claimant the case which the Respondent was going to mount; that is, the Claimant would not have been caught by surprise at the adjudication hearing. 55     I was not persuaded by this argument. It is the very objective of the SOP Act to have strict deadlines which encourage parties to make their respective cases known to the other side as early as possible. Allowing a respondent who has not provided its reasons for withholding payment in a recognised payment response will in effect mean that there is no penalty, perhaps apart from costs, from ignoring the deadlines. Nothing will stop a respondent from submitting his reasons for withholding payment just before, or even together with, his adjudication response. Insofar as natural justice is concerned, it is theclaimant’sright to know the opposing case which is jeopardised. 56     Also, if s 15(3) of the SOP Act were to apply only to respondents whodidtender a payment response, it would result in the perverse situation where such respondents were in a worse position than respondents who did not tender any payment response at all. Such a situation is obviously unfair. 57     Furthermore, there is a strong connection between the general policy of efficiency described above at [48] and [49] and the more specific concern embodied in s 15(3) of the SOP Act, which is that the respondent should make the reasons for withholding payment known as early as possible in the proceedings. Ironic as it may seem, the goal of the entire adjudication process is not to reach an adjudication determination. The SOP Act recognises that the fastest and most efficient means of disposing of the dispute is through settlement, and this ideal is enshrined in the dispute settlement period provided for in ss 12(4) and 12(5) of the SOP Act. In order for such dispute settlement negotiations to even take place, it is essential for the SOP Act to encourage the parties to air their respective positions as early as possible. Hence, from this angle, it is not unreasonable to require a respondent to make his reasons known sooner rather than later. In this respect, no purpose is served by allowing him to play with his cards close to his chest. 58     The position I have articulated above is generally consistent with reported decisions by various adjudicators under the SOP Act. InCompany BO v Company BP[2006] SGSOP 12, there was no payment response served, whether in the initial 21-day period or the subsequent 7-day dispute settlement period. However, an adjudication response was served with what the adjudicator called “an attached payment response.” The respondent argued that s 15(3) of the SOP Act only applied when there was no payment response, but did not preclude the adjudicator from considering a late payment response attached to the adjudication response. This argument was rejected by the adjudicator who noted: 31     The [SOP] Act has very stringent timelines with respect to payment claims, response and due debts. As evident in sections 8, 10 and 11, it will not even tolerate contractual terms that specify unduly long time periods to resolve payment issues. The intention is obviously to ensure speedy payment for work done and improve contractor’s cash flow. Seen in this light, the “relevant payment response” of section 15(3) must be made before the adjudication application in accordance to the time frame allowed for in the Act. 32     As rightly pointed out by the Claimant, a timely payment response would have enabled the Claimant to make an informed decision whether to even begin adjudication. A late payment response is similar to no payment response and section 15(3) of the Act would apply. [emphasis in original] 59     Similarly, inAA Pte Ltd v AB Pte Ltd[2005] SGSOP 1, the respondent tendered a letter in response to the claimant’s payment claim within 21 days of the receipt of the payment claim. It was argued that this letter constituted a payment response. However, the adjudicator found that the letter could not be so considered. He went on: 63     However, even if I am wrong on this point and the alleged payment response could somehow be construed to be a valid payment response, I do not think such a finding assists the Respondent’s position in this adjudication. It does not state any response amount nor does it state that the Respondent is withholding the entire amount. […] No reasons were offered by the Respondent which relate specifically to the sums withheld against any of the components making up the claim. […] 64     Section 15(3) of the Act provides that in such a situation “the adjudicator shall not consider any reason for withholding any amount, including but not limited to any cross-claim, counterclaim and set off”. Accordingly, by virtue of section 15(3), I have no mandate to consider any reasons for withholding any amount advanced should these be raised now by the Respondent at this stage of proceedings. 60     On the other hand, the Respondent raised somedictainAR Pte Ltd v AS Corp[2006] SGSOP 6, at [22], where the adjudicator said: In the absence of any payment responseoradjudication response from the Respondents, I have no grounds to reject the rates adopted by the Claimants in their variation claims and in their claim for the Works as deviating from the terms of the Sub Contract. [emphasis added] 61     The Respondent’s argument was that the use of the word “or” suggested that the provision of an adjudication response without a payment response would have led to a different result. I do not think the adjudicator was trying to make that point, and if he was, I would nevertheless prefer the approach of the cases cited earlier. 62     Before I leave this subject, I should say that instruction can be drawn from the approach in New South Wales. What we call a payment response is termed a “payment schedule” in s 14 of the NSW Act. The provision states: (3)    If the scheduled amount is less than the claimed amount, the schedule must indicate why the scheduled amount is less and (if it is less because the respondent is withholding payment for any reason) the respondent’s reasons for withholding payment. (4)    If: (a)    a claimant serves a payment claim on a respondent, and (b)    the respondent does not provide a payment schedule to the claimant: (i)     within the time required by the relevant construction contract, or (ii)    within 10 business days after the payment claim is served, whichever time expires earlier, the respondent becomes liable to pay the claimed amount to the claimant on the due date for the progress payment to which the payment claim relates. 63     It should be noted that the NSW Act provides two time periods for the submission of a payment schedule. The first is under s 14(4) and the second is under s 17 of the NSW Act: (2)    An adjudication application to which subsection (1) (b) applies cannot be made unless: (a)    the claimant has notified the respondent, within the period of 20 business days immediately following the due date for payment, of the claimant’s intention to apply for adjudication of the payment claim, and (b)    the respondent has been given an opportunity to provide a payment schedule to the claimant within 5 business days after receiving the claimant’s notice. 64     Another provision of note is s 20 of the NSW Act, which provides for the adjudication response by the respondent. Section 20 states: (2A) The respondent may lodge an adjudication response only if the respondent has provided a payment schedule to the claimant within the time specified in section 14(4) or 17(2)(b). (2B) The respondent cannot include in the adjudication response any reasons for withholding payment unless those reasons have already been included in the payment schedule provided to the claimant. 65     Finally, s 22 of the NSW Act provides: (2)    In determining an adjudication application, the adjudicator is to consider the following matters only: (a)    the provisions of this Act, (b)    the provisions of the construction contract from which the application arose, (c)    the payment claim to which the application relates, together with all submissions (including relevant documentation) that have been duly made by the claimant in support of the claim, (d)    the payment schedule (if any) to which the application relates, together with all submissions (including relevant documentation) that have been duly made by the respondent in support of the schedule, (e)    the results of any inspection carried out by the adjudicator of any matter to which the claim relates. 66     These provisions are interpreted strictly. InTaylor Projects Group Pty Limited v Brick Dept Pty Limited and Ors[2005] NSWSC 439, a payment claim was served on the respondent on 5 January 2005. The respondent was thus supposed to have served its payment schedule by 19 January 2005. The respondent tendered a “payment schedule” only on 20 January 2005 at about 10 a.m., disputing the sum payable. On the same day, at about 5 p.m., the claimant asserted the respondent’s failure to tender a payment schedule in time and notified the respondent of its intention to apply for adjudication under s 17(2)(a) of the NSW Act if a payment schedule was not tendered within five business days thereafter. Later that same day, the respondent informed the claimant by fax that the document served on 20 January 2005 was a payment schedule served in time as the payment claim had been served on 6 January 2005 and not the day before as the claimant asserted. On 27 January 2005, the respondent sent a fax to the claimant stating that a payment schedule had already been served within time, and the claimant’s request for a payment schedule was thus unnecessary. 67     The adjudicator determined that the payment claim had indeed been served on 5 January 2005 and thus the “payment schedule” of 20 January 2005 was out of time. The claimant had given its s 17(2)(b) notice on 20 January 2005 at 5 p.m., and the respondent thus had to provide a payment schedule within 5 business daysthereafter. The faxed document provided earlier that morning at 10 a.m. did not satisfy that requirement as it was servedbeforethe notice and there was no other payment schedule tenderedafterthe notice. In such circumstances, the adjudicator could not consider the respondent’s payment schedule and its adjudication response (see s 20(2A) of the NSW Act). 68     In seeking to have the adjudicator’s decision declared void it was argued by the respondent that it had indeed submitted payment schedule, albeit falling between the ss 14(4) and 17(2)(b) periods, but such an error was “a technical infringement incapable of causing prejudice to the claimant or adjudicator” which would nonetheless” substantially prejudice the respondent’s rights in the adjudication process.” Requiring the respondent to re-submit a payment schedule for form’s sake just after it had submitted an earlier (albeit out-of-time) payment schedule would “promote public inconvenience.” 69     The court upheld the adjudicator’s decision. In adopting a strict construction of the NSW Act provisions, the court said: 49     The point was made inEmagthat the whole of the rationale underpinning the procedures laid down by the Act is directed at providing a quick and efficient set of procedures permitting recovery of progress payments and the quick resolution of disputes in that regard; that the time limits under the Act are strict and that the consequences of not complying with stipulated time limits may be significant. In my view it is simply critical for a rigid approach to be taken to compliance with the terms of the Act, particularly for the reason that the legislation provides for a fast dual-track interim determination, reserving the parties’ final legal entitlements for subsequent determination. … 51     [The respondent’s] submissions as to “technical infringement” and “time-frames and requirements” set up by section 17(2)(b) are rejected. The Act requires to be construed in the orthodox fashion—in accordance with the ordinary meaning of the words used. 70     A similarly strict approach is taken with regards to situations where a respondent has tendered a payment schedule in time, but is seeking to rely on reasons for withholding payment not contained in its payment schedule but only in its adjudication response. InMultiplex Constructions Pty Ltd v Luikens and Another[2003] NSWSC 1140 at [67] Palmer J said: … The evident purpose of s 13(1) and (2), s 14(1), (2) and (3), and s 20(2B) is to require the parties to define clearly, expressly and as early as possible what are the issues in dispute between them; the issues so defined are the only issues which the parties are entitled to agitate in their dispute and they are the only issues which the adjudicator is entitled to determine under s 22. It would be entirely inimical to the quick and efficient adjudication of disputes which the scheme of the Act envisages if a respondent were able to reject a payment claim, serve a payment schedule which said nothing except that the claim was rejected, and then “ambush” the claimant by disclosing for the first time in its adjudication response that the reasons for the rejection were founded upon a certain construction of the contractual terms or upon a variety of calculations, valuations and assessments said to be made in accordance with the contractual terms but which the claimant has had no prior opportunity of checking or disputing. In my opinion, the express words of s 14(3) and s 20(2B) are designed to prevent this from happening. 71     The Respondent tried to distinguish these cases on the basis that under the NSW Act, the failure to file a payment schedule results in the respondent becoming liable to pay the claimed amount on the due date for the progress payment to which the payment claim relates: s 14(4) of the NSW Act. A respondent then has a choice whether he wishes to recover the debt or apply for adjudication: s 15(2)(a) of the NSW Act. Under our Act, a failure to file a payment response does not give rise to a payable debt and a claimant still had to obtain an adjudication determination first. The Respondent submitted that this distinction explained why a strict approach was adopted. 72     I do not think that the existence of the respondent’s liability under the NSW Act once it fails to tender a payment schedule is a crucial in this respect. Section 14(4) of the NSW Act merely provides the claimant a short-cut to obtaining payment at its option. The provision of such an option to the claimant does not affect the rationale for the early provision of reasons by the respondent in respect of the adjudication process (that is, the adjudication hearing and the consequent determination). Not a denial of a fair hearing 73     The Respondent submitted that the approach taken by the adjudicator would mean that a respondent who did not submit a payment response would in effect not be entitled to any adjudication at all, since he was not entitled to raise any reasons for withholding payment. It was argued that s 12(2) of the SOP Act sets out two situations where a claimant may make an adjudication application. Section 12(2)(a) of the SOP Act contemplated a situation where a claimant disputed a payment response which had been tendered, while s 12(2)(b) of the SOP Act contemplated another situation where there was no payment response tendered. In both cases, s 13(1) of the SOP Act applied, and that provision states: A claimant who is entitled to make an adjudication application under section 12 may, subject to this section,apply for the adjudication of a payment claim disputeby lodging the adjudication application with an authorised nominating body. [emphasis added] 74     According to the Respondent, the effect of s 13(1) read with s 12(2)(b) of the SOP Act was that there had to be an “adjudication” even when there was no payment response. That word, in its plain and ordinary meaning, meant “the act or process of trying and determining judicially.” Thus, in order to enable the adjudicator to perform an adjudication, the respondent ought to be allowed to air its views. It followed that s 15(3) of the SOP Act should be interpreted to be limited to situations where a payment response had been tendered. 75     In my view, there are two points which should be borne in mind. The first is that natural justice requires that a respondent be given a fairopportunityto be heard. There is no requirement that in every case a party is actually heard and it is entirely possible for a party to forfeit his right to be heard through some procedural default. In the instant case, it is clear that the SOP Act does afford a respondent the opportunity to be heard. In regard to the hearing of a respondent’s reasons why payment was withheld, the SOP Act specifies that such hearing is contingent on the reasons being provided in the payment response tendered within certain timelines. What has really happened in this case was that the Respondent chose not to avail itself of the opportunity to be heard on its reasons for withholding payment. 76     But even if a respondent who failed to submit a payment response is not allowed to put forward its reasons why it withheld payment, it does not follow that it would be denied any sort of hearing at all.Quite unlike what the Respondent sought to suggest, it is not the case that the adjudication process becomes a mere rubber-stamping exercise in favour of the claimant. The adjudicator is still obliged to exercise his discretion in a number of matters which a respondent is fully entitled to raise. 77     For instance, I think it is quite undisputable that a respondent can raise procedural arguments based on facts which had arisen only after the due date for a payment response has passed. InAU v AV[2006] SGSOP 7, no payment response had been filed in time. The adjudicator found that he had jurisdiction to adjudicate on the question raised by the respondent in its adjudication response of whether the notices and adjudication applications were filed in time in relation to the first two of three payment claims (or “tax invoices” as they were called in the case). He said: 10     […] However, the procedural arguments not raised by the Respondent on the 1st and 2nd tax invoices being out of time for this adjudication could not possibly be a part of the payment response since the argument could only be raised after time for the adjudication application begins to run in accordance with the Act. 11     This being the position, the procedural objection does not fall within the provisions of Section 15(3) of the Act. This is therefore a matter an adjudicator needs to consider under Section 16(2) of the Act which directs that an adjudicator shall reject any adjudication application that is not made in accordance with Section 13(3)(a), (b) or (c) of the Act which I shall accordingly deal with below. 78     Similarly, inCompany BQ v Company BR[2006] SGSOP 13, the adjudicator was of the view that the respondent’s failure to provide a payment response did not stop him from hearing the respondent’s arguments on whether the subcontract was excluded from the SOP Act because it was allegedly made within a period not exceeding 6 months from 1 April 2005 (regulation 4(a) of the SOP Regulations). He also thought it proper to consider whether the adjudication application was made prematurely, and whether it was irregular as it stated a different claimed amount from the payment claim annexed to it and the payment claim submitted to the respondent. 79     The more difficult question is whether an adjudicator may deal with arguments regarding the validity of the payment claim on which the adjudication is based. InAU v AV(above at [77]), the adjudicator thought that s 15(3) of the SOP Act excluded any argument that the third tax invoice did not comply with content requirements of s 10(3) of the SOP Act and regulation 5(2) of the SOP Regulations and thus was an invalid payment claim. He agreed, at [21], with the claimant’s submission that the respondent should have raised this issue in its payment response. 80     InAA Pte Ltd v AB Pte Ltd(above at [59]), the adjudicator was prepared to consider a jurisdictional question of whether there was “a contract made in writing” between the parties as required by s 4(3) of the SOP Act. He also considered whether the payment claim was made out of the time stipulated in s 10(2) of the SOP Act. Finally, he also heard an argument that a purposive reading of the dispute settlement provisions of the SOP Act mandated that the claimant should alert the respondent to consider a settlement during the dispute settlement period. However, he refused to consider the respondent’s argument that the claimant had failed to submit a performance bond, which was a condition precedent to it making any payment claim under the contract. The respondent argued that the claimant was thus not entitled to have submitted any payment claim at all. The adjudicator said at [72]: The Respondent could well be justified in withholding some part of the payment as a result of the Claimant’s inexplicable refusal to hand over the documents sought by them, but for the purpose of the Act the merits of this recourse cannot be considered by an adjudicator until it has been asserted as a reason for withholding payment in a proper payment response. […] 81     These authorities can be contrasted with another case which suggests that the invalidity of a payment claim can be raised before the adjudicator even if these were not contained in any payment response. InCompany BO v Company BP(above at [78]), the adjudicator allowed the respondent to contend that s 10(1) of the SOP Act permitted a claimant to serve only one payment claim in respect of a progress payment; that the payment claim submitted was a final claim which the SOP Act did not apply to; and that the payment claim was submitted late. While the adjudicator eventually did not find these objections to have merit, he nonetheless gave them consideration. He had these words to say at [23] about the claimant’s argument that it was impermissible to raise these issues as they were not contained in the adjudication response: I am not convinced by this argument. The [SOP] Act does not prohibit parties from raising issues after the application and response. In section 17(3)(g), the adjudicator shall consider “…the submissions and responses of the parties”. Section 17(3)(g) also allows the adjudicator to consider “… any other matter that the adjudicator considers to be relevant.” [emphasis in original] 82     My own preference is for a stricter interpretation of s 15(3) of the SOP Act. The invalidity of a payment claim is a reason for withholding payment that would have been known at the time when the payment claim was submitted, and as such, it ought to have been included in a payment response. However, this issue was not squarely before me and I make no definite decision on it. 83     Whether or not the invalidity of a payment claim can be brought up when such a reason was not asserted in a payment response, it is clear that even in cases where no payment response has been tendered, it is possible for a respondent to at least argue that there were procedural irregularities arising after date on which the payment response was supposed to be filed, if the facts so permit. An adjudicator is obliged to make a determination on those issues and it is incorrect to say that an adjudication would be a mere rubber-stamping exercise. Conclusion on natural justice and s 15(3) of the SOP Act 84     The Respondent is essentially urging me to read additional requirements into s 15(3) of the SOP Act in order to make that provision conform to what it submitted was natural justice. Recalling Lord Reid’s dicta inWiseman v Borneman(above at [47]), I conclude that it was not clear that the statutory procedure under the SOP Act was insufficient to achieve justice. A plain and literal reading of s 15(3) of the SOP Act would not result in the Respondent being denied a fair opportunity to be heard. Indeed, the “additional steps” suggested by the Respondent—in this case, the dis-application of s 15(3) of the SOP Act to cases where no payment response was submitted—would frustrate the apparent purpose of the legislation.",
        "Consideration of the documents available to the adjudicator": "85     Apart from the above submission, the Respondent also relied on s 16(7) of the SOP Act, which states: An adjudicator's power to determine an adjudication application is not affected by the failure of — (a)    the respondent to provide a payment response or lodge an adjudication response; or (b)    any of the parties to comply with the adjudicator's call for a conference of the parties or any other requirement made or direction issued by the adjudicator, and in the event of any such failure, the adjudicator may determine the application on the basis of the information and documents available to him. 86     It was argued that, quite apart from any restrictions placed by s 15(3) of the SOP Act, this provision directed the adjudicator to give his consideration to whatever documents and arguments were before him. In the instant case, even if the Respondent was prohibited from raising its reasons for withholding payment, the Adjudicator still ought to have given consideration to Payment Certificate No. 5 and the reasons contained therein as well as the arguments raised orally at the hearing. It was thus incorrect for him to have simply accepted the Claimant’s figures without more. 87     I do not accept this argument. In the first place, the provision is clearly permissive rather than mandatory. Furthermore, its obvious purpose was to enable an adjudicator to continue with the adjudication despite any attempts to hold up the process by any party. It does not compel the adjudicator to give consideration to any matter not contained in s 17(3) of the SOP Act. The learned author ofSecurity of Payments and Construction Adjudication(above at [33]) explains at p 370: The intent of this subsection, no doubt, is that an adjudicator may proceed with the adjudication in the face of such non-compliance and the adjudication determination may not be impeached merely on the basis that the adjudicator proceeded without the particular submission or information being received by the adjudicator or the attendance of one of the parties at the conference. 88     At this point, I should also deal with two cases cited by the Respondent which appear support the proposition that while the adjudicator cannot consider reasons for withholding payment not contained in an adjudication response, he nonetheless may examine the available documents to see whether they support the claimant’s claimed amount. 89     I will deal with the easier case first, that ofCompany CH v Company CI[2006] SGSOP 18. In response to a payment claim, the respondent tendered to the claimant a letter which allegedly showed that (a) the claimant had agreed to increase a discount from 8% to 14.5%, and (b) that the claimant agreed to be paid when the respondent was paid by a third company (“the 9th November Letter”). The 9th November Letter was annexed to the respondent’s adjudication response, which raised these two same reasons. The adjudicator held that the 9th November Letter was not a payment response and there was no other document produced which could be considered a payment response. He held that he was precluded by s 15(3)(a) of the SOP Act from considering the reasons given in the adjudication response, but proceeded to consider whether the 9th November Letter had been served on the claimant, whether it did indeed show that an agreement to increase the discount had been reached, and finally, whether the letter contained a “pay when paid” clause which was prohibited under s 9(1) of the SOP Act. 90     I do find this case somewhat odd, and but it is likely that the adjudicator was only pointing out that the respondent’s case had no merit even if the 9th November Letter was considered a valid payment response, rather than saying that the reasons in the 9th November Letter could be considered despite the fact that the reasons in the adjudication response could not. 91     The more difficult case is that ofCompany BZ v Company CA[2006] SGSOP 16, in which the adjudicator noted at [8] that the absence of a payment response meant that he had to exclude from his consideration the respondent’s counterclaim for delay and the reasons given for withholding other amounts that the respondent had only set out in the adjudication response and after, but he continued: “Nonetheless, Imay determine the application on the basis of the information and documents available tome in accordance with section 16(7)” [emphasis in original]. He proceeded to consider whether the claimant was entitled to add an amount previously left out of its payment claim; what the amount of contractual back-charges to be deducted from the claim was; and whether the claimant was entitled to certain “standby charges” for two subcontracts. It is notable that he did not agree with all the claimant’s calculations and arrived at his own figures, and even more interestingly, heard counter-arguments from the respondent on the number of days which should have been used to calculate the standby charges (at [19]). 92     In New South Wales, the position taken there appears support the approach in the above case. InPacific General Securities Ltd and Another v Soliman and Sons Pty Ltd and Others[2006] NSWSC 13, it was argued that the adjudicator was wrong to have simply accepted the claimed sum without examination. Brereton J held at [82]: …the adjudicator's duty is to come to a view as to what is properly payable, on what the adjudicator considers to be the true construction of the contract and the Act and the true merits of the claim, and while the adjudicator may very readily find in favour of the claimant on the merits of the claim in the absence of a payment schedule or adjudication response, or if no relevant material is advanced by the respondent, the absence of such material does not entitle the adjudicator simply to award the amount of the claim without addressing its merits, which as a minimum will involve determining whether the construction work identified in the payment claim has been carried out, and what is its value. 93     With respect, it appears to me that such an approach has the effect of letting the respondent introduce his reasons for withholding payment through the backdoor. It could be very soundly argued that the respondent ought to have raised all these issues in its payment response but did not do so, and the fact the adjudicator may have identified the possible reasons himself should not excuse the respondent from this duty. My own view is that where there are no reasons provided in any valid payment response, the adjudicator cannot examine whether the claimant’s claim is supported by the documents. Save for the permissible procedural or jurisdictional objections identified earlier, the adjudicator must accept the claim at its face value. 94     One might think this harsh—what if the payment claim states an obviously incorrect amount, either through innocent mistake or deliberate overcharging, completely unsupported by the documents or the facts? One answer to this is that the more obvious the error, the more reason why the respondent could have simply pointed this out in a valid payment response. Furthermore, this approach avoids the problem of the adjudicator having to decide whether he is merely making sure that the claimed amount is supported by the documents or whether he is impermissibly addressing the respondent’s reasons why he withheld payment. In my mind, making such distinctions will be a futile hair-splitting exercise because it is evident that one generally applicable reason why the respondent would have withheld payment is because the claimed amount is not supported by any documentary evidence. As I have stated in relation to s 15(3) of the SOP Act, I am of the view that a strict interpretation is more consonant with the overall purpose and structure of the SOP Act. 95     Further, I believe that there are certain crucial differences between the SOP Act and the NSW Act which would not permit us to follow their approach on this point. It would be recalled that s 15(3) of the SOP Actexpresslyprohibits an adjudicator from considering any reason for withholding payment which is not included in the relevant payment response. In contrast, while the NSW Act prohibits a respondent from including such reasons in its payment response, it contains no corresponding prohibition on the adjudicator from considering the same reasons. Thus, s 16(7) of the SOP Act, to the extent that it permits the adjudicator to consider the available documents and information, must be read in conjunction with the prohibition in s 15(3) of the SOP Act. 96     For these reasons, I reject the Respondent’s argument that the Adjudicator was incorrect in adopting the Claimant’s figures without further examining whether they were supported by the documents provided, including Payment Claim No. 5.",
        "Conclusion": "97     The SOP Act has created an interesting sub-species of quasi-judicial body. I would not go so far as to say that adjudication is “rough and ready” justice, as some have suggested, but it is true that the balance is distinctly tilted away from thoroughness and in favour of timeliness. It may well be that in another context, if such procedures were applied to a final determination of rights, it could be legitimately asked whether natural justice has been done. But in the context of the SOP Act, it is always important to bear in mind that the adjudication determination is only a quick interim determination aiming to ameliorate the plight of weaker parties in construction sub-contracts. The procedure works in tandem with other dispute resolution mechanisms and this larger picture should not be forgotten. This rationale supports a strict interpretation of the SOP Act provisions. For these reasons, I refused to set aside the Adjudication Determination. I will hear parties on the issue of costs."
    }
}