{
    "case_title": "Over & Over Ltd v Bonvests Holdings Ltd and Another",
    "ncitation": "[2008] SGHC 226",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       This dispute arose from Over & Over Ltd’s (“Over & Over”) claim for relief against oppressive and/or unfairly prejudicial conduct under s 216 of the Companies Act (Cap 50, 2006 Rev Ed). Over & Over is a minority shareholder of Richvein Pte Ltd (“Richvein”), which is the second defendant. At the conclusion of the trial, I dismissed Over & Over’s claim. Over & Over has filed an appeal. I now provide my written reasons.",
        "Background": "2       Over & Over, a company incorporated in Hong Kong, is an investment vehicle of the Lauw family. Lauw Siang Liong (“LSL”) and John Loh (“JL”) are the only shareholders and directors of Over & Over, JL being LSL’s son. 3       Bonvests Holdings Ltd (“Bonvests”), the first defendant, is a company listed on Singapore Exchange Limited with approximately 59.68% of its shares held by Goldvein Holdings Pte Ltd (“Goldvein”). In turn, Goldvein is a company controlled by the Sianandar family. Henry Ngo (“HN”) and Dijtu Sianandar (“DS”), who are brothers, are members of the Sianandar family. 4       Sometime in 1978, the Sianandar family was considering buying a piece of land along Scotts Road to develop a hotel. Through a mutual business associate, DS and LSL met each other and expressed interest in participating in a joint venture to develop that piece of land. There were some discussions (the extent to which is in dispute) between the two families in relation to the proposed joint venture. 5       Further to these discussions, Richvein was incorporated on 20 August 1980 as a joint venture company between Over & Over and Bonvests. At the beginning, 70% of the shares of Richvein were held by Unicurrent Finance Limited (“Unicurrent”) and 30% of the shares of Richvein were held by Over & Over. Unicurrent is an investment holding company incorporated in Hong Kong and is owned by the Sianandar family (with 99% of its shares held by HN and the remaining 1% held by DS). Unicurrent subsequently transferred one share to BHL Investments Pte Ltd (which is a company owned by the Sianandar family)[note: 1]. On 23 September 2003, the 70% shareholding (less one share) originally held by Unicurrent was transferred to Bonvests[note: 2]. This transfer to Bonvests is one of the grievances of Over & Over as I shall elaborate on later. 6       After Richvein was incorporated, it purchased the land at Scotts Road and developed a hotel on it known as Sheraton Towers Singapore. The construction of the hotel was completed in December 1985 and the hotel has operated on the premises since then. Sheraton Towers Singapore is Richvein’s sole business and main asset. 7       During the trial, Over & Over called on JL and LSL as their witnesses. Bonvests called on HN and DS as their witnesses. However, I did not give much weight to LSL’s testimony since there was evidence that he had a failing memory and could not remember much of what had happened in the past. DS gave evidence that after the incorporation of Richvein, he left it entirely to HN to manage Richvein and his evidence was, in any event, shaky and unreliable. The bulk of the evidence regarding the history between the parties came from JL and HN.",
        "The Disputes": "8       Over & Over relied on three events which took place in the past six years and argued that these three events were oppressive and/or unfairly prejudicial to it. The three events were: (a)    the transfer of Unicurrent’s 70% shareholding in Richvein to Bonvests in 2003 (“the Share Transfer”); (b)    the rights issue conducted by Richvein in October 2006, under which Richvein issued 66 million new shares to its shareholders at $0.38 per share (“the Rights Issue”); and (c)    three contracts entered into between Richvein and parties which were related to Bonvests and/or HN (“the Related Party Transactions”) comprising: (i)     a contract dated 11 May 2006 with Colex Holdings Ltd for waste disposal services; (ii)   a contract dated 28 July 2006 with Integrated Property Management Pte Ltd for cleaning services; and (iii)  a hotel management contract dated 12 December 2005 with Henrick International Hotels & Resorts Pte Ltd (subsequently renamed “The Residence Hotels & Resorts Pte Ltd”). 9       It is therefore appropriate that I first set out the circumstances in relation to the three events in some detail.",
        "The Share Transfer": "10     Article 30 of Richvein’s Articles of Association (“Richvein’s Articles”) initially restricted the transfer of shares to a non-member of the company as follows:[note: 3] Shares may be freely transferred by a member or other person entitled to transfer to any existing member selected by the transferor, but save as aforesaid, and save as provided by Article 35 hereof, no share shall be transferred to a person who is not a member so long as any member or any person selected by the Directors as one whom it is desirable in the interest of the Company to admit to membership is willing to purchase the same at fair value. 11     The first mention of any transfer of shares in Richvein from Unicurrent to Bonvests was made on 29 May 2002 at the AGM of Richvein (the “2002 AGM”). 12     The minutes of the 2002 AGM stated: Transfer of Shares The Chairman informed the shareholder’s representative of Over & Over Limited, Mr Melvin Lee Tiong Choon, of Unicurrent Finance Limited’s (“Unicurrent”) intention, that at an opportune time Unicurrent will sell its entire holdings of 70,000,000 ordinary shares representing 70% of the issued capital of the Company to Bonvests Holdings Limited. Mr Melvin Lee Tiong Choon, the representative of the other shareholder, Over & Over Limited, expressed no objections to Unicurrent’s proposed sale of shares. RESOLVED that with no objections from Over & Over Limited’s representative, Unicurrent Finance Limited would at an opportune time, sell its entire holdings of 70,000,000 ordinary shares representing 70% of the issued capital of the Company to Bonvests Holdings Limited. 13     Over & Over objected to the accuracy of the minutes as it claimed that no vote or approval of the proposed transfer (“the proposed Share Transfer”) was called during the 2002 AGM. After receiving the minutes of the 2002 AGM, Melvin Lee (who attended the 2002 AGM on Over & Over’s behalf) wrote to Richvein’s company secretary on 27 June 2002 requesting for the resolution to be deleted[note: 4]. 14     After the 2002 AGM on 29 May 2002, discussions on the proposed Share Transfer continued between Over & Over and Bonvests. There was a series of letters between HN and LSL. 15     Thereafter, on 27 June 2002, HN called LSL to discuss the proposed Share Transfer. Then, LSL was still considering whether or not to approve the proposed Share Transfer and he suggested selling Over & Over’s shares in Richvein to Bonvests during the conversation. However, HN apparently said to LSL that it would not be justifiable for Over & Over to do so as the proposed Share Transfer was at a discounted rate.[note: 5] 16     On 8 August 2002, an Extraordinary General Meeting (“EGM”) was held to discuss the ‘proposed transfer of [Unicurrent’s] entire shareholdings in [Richvein] to [Bonvests]’[note: 6]. The minutes of the EGM showed that Over & Over was interested in selling its 30% stake in Richvein together with Unicurrent to Bonvests. The EGM was adjourned to explore such a possibility. Over & Over alleged that Bonvests had offered to buy Over & Over’s stake in Richvein on or around 15 August 2002 on certain terms which entailed a cash payment[note: 7]. However, HN denied offering to pay in cash[note: 8] 17     JL gave evidence that a meeting was held on 11 September 2002 between,inter alia, LSL and HN to discuss the proposed Share Transfer[note: 9]. On the same day, Over & Over rejected Bonvests’ offer[note: 10]. Thereafter, in a letter dated 17 September 2002 from HN to Over & Over’s solicitors, HN asked for a letter confirming that Over & Over did not intend to sell its shareholding in Richvein to Bonvests, and that Over & Over grant a waiver for Unicurrent to sell its shares to Bonvests. Over & Over’s solicitors wrote back to HN on 18 September 2002 confirming that Over & Over did not intend to sell its shareholdings in Richvein. However, Over & Over’s solicitors were, at that time, waiting for their client’s instructions on the waiver. 18     On 20 September 2002, HN wrote a letter to Over & Over’s solicitors[note: 11]: 1.       I refer to your letter of 18 September 2002 in which you confirmed that your clients do not intend to sell their shareholdings in the Company. 2.       You also mentioned that you are still waiting for your client’s instructions on the waiver regarding the transfer of shares from Unicurrent Finance Limited to Bonvests Holdings Limited. 3.       As I had set out several times earlier the transfer of my 70% interest in the Company is an internal group restructuring. As I had mentioned before, it could be through Unicurrent transferring the 70% or through myself injecting Unicurrent into my Bonvests Group. 4.       To all intents and purposes, nothing will be changing in terms of my business relationship with your clients before and after the internal group restructuring for me as 70% shareholder and your clients as 30% shareholder. The waiver of the transfer is merely a cordiality and there is no real need to await for your clients to revert on it. 19     On 23 September 2002, Over & Over’s solicitors wrote to HN[note: 12]: Further to our letter dated 18 September 2002, our clients wish to propose that the relevant articles in the Articles of Association of the Company be amended so that the shareholders of the Company could freely transfer their shares in the Company to any party notwithstanding that the transferee is not an existing member of the Company. In other words, there will be no pre-emptive rights for the transfer of shares in the Company. If you are agreeable to the above suggested amendment, the waiver from our client would not be needed in respect to the transfer of shares in the Company from Unicurrent Finance Limited to Bonvests Holdings Limited. However, if you require our clients to give their waiver before the amendment of the articles, our clients are prepared to do that on the understanding that the relevant articles will be amended. 20     HN responded in a letter dated 29 October 2002[note: 13], undertaking on behalf of Unicurrent to amend Richvein’s Articles to remove all pre-emption rights. Having given such an undertaking, HN took the view that Over & Over had thus waived its pre-emption rights under Richvein’s Articles in connection with the proposed Share Transfer. An EGM was convened on 8 November 2002 and it was resolved during this EGM that the pre-emption clauses in Richvein’s Articles would be removed[note: 14]. The Share Transfer was completed on or around 23 September 2003[note: 15].",
        "The Rights Issue": "21     I come now to the circumstances leading to the Rights Issue. Richvein had obtained banking facilities from DBS Bank on 25 November 2002 (the “2002 Loan”), under which Over & Over[note: 16]and JL[note: 17]executed corporate and personal guarantees respectively for 30% of the loan granted by the Development Bank of Singapore Ltd (“DBS Bank”). Similarly, Bonvests and HN executed corporate and personal guarantees respectively for 70% of the loan granted by DBS Bank. The tenure of the 2002 Loan was for 5 years from the date of draw-down, or in any case up to 26 November 2007. 22     In 2003, after the Share Transfer, HN successfully procured DBS Bank to release him as a personal guarantor. JL also requested DBS Bank to release him as a personal guarantor of the 2002 Loan[note: 18]but did not succeed[note: 19]. 23     On 19 September 2006, HN procured from DBS Bank an offer of a revised financing package (the “Refinancing Package”) for Richvein for another five years. The Refinancing Package required a corporate and personal guarantee from Over & Over and JL respectively for 30% of the loan. The Refinancing Package had an interest rate which was 0.65% lower than the 2002 Loan[note: 20]. This would have saved Richvein about $162,500 a year in interest costs. The Refinancing Package offer was open for 7 days (i.e., up to 26 September 2006). In a letter dated 26 September 2006, Over & Over and JL declined to extend their respective guarantees to the Refinancing Package. 24     It appeared that after receiving Over & Over’s letter dated 26 September 2006, Kwa Beng Seng (“KBS”), the financial controller for Richvein, spoke to a DBS Bank officer with regards to the requirement for corporate and personal guarantors for the 30% portion of the loan under the Refinancing Package. In a handwritten note addressed to HN that was written on the same letter from Over & Over dated 26 September 2006, KBS stated[note: 21]: I also spoke to Teresa of DBS. She said that if the requirement of corporate & personal guarantor is not met, the Bank has to re-consider the offer and the approval seeking process will need to be re-done. The pricing may or may not change. 25     Lee Tiong Choon (also known as Melvin Lee) also gave evidence. He was the general manager of Gallant Investment Pte Ltd, another company owned by the Lauw family and would act on instructions from LSL and occasionally from JL. His evidence was that on or about 12 October 2006, he and two other persons met with Ms Loong Wai Leng, the vice-president of DBS Bank in charge of the loan to Richvein. Ms Loong had said that the guarantees in question were not mandatory but the absence thereof would result in a higher interest rate being charged. In any event, there was apparently no further development in respect of the Refinancing Package and it was not taken up. 26     In the meantime, Richvein issued a notice dated 4 October 2006 to convene a board meeting (on 11 October 2006) for the purpose of convening an EGM to pass a proposed Rights Issue (the “Rights Issue EGM”). The notice to convene the board meeting did not provide any reason for the Rights Issue. The Rights Issue would raise about $25 million by issuing up to 66,000,000 new ordinary shares at S$0.38 per rights share[note: 22](the “Rights Issue”). Before the notice to convene the board meeting was sent out, there were some discussions between HN and KBS in relation to the Rights Issue. In a memorandum dated 2 October 2006 to HN, KBS wrote[note: 23]: Size & Pricing of Rights Issue 1.      The current loan principal as at 30 September 2006 is $25.1 million. … 2.      Considering Sheraton/Richvein’s current cash position, a $25 million non-renounceable rights issue is necessary if all the banking facilities are to be cancelled with immediate effect. 3.      There are at least three ways to price the rights issue: (a)$1.00per share which was the basis for the right issue (conversion of shareholders’ loans) in 2002; (b) most recently audited (i.e. FY2005) net asset per share of$0.3728, or (c) audited net asset per share adjusted for revaluation of land and building in Dec 2005 ($191 million) of$1.0622. 4.      Assuming that Over & Over Limited does not take up the rights issue, Bonvests’ shareholdings will increase from 70% to: (a) Rights Issue at $1.00 per share … % held by Bonvests … = 74.777% (b) Rights Issue at $0.3728 per share … % held by Bonvests … = 80.107% (c) Rights Issue at $1.0623 per share … % held by Bonvests … = 74.539% 5.      In proposing a rights issue, management is entitled to believe that all shareholders will show continuous support and take up its rights. In my view, a pricing using audited net asset value (without valuation adjustment) per share of $0.3728(that will result in the maximum dilution of Over & Over Limited’s share if it does not take up the rights) is not difficult to justify. We can check this position with our auditors and lawyers if we are pursuing this course of action. [emphasis added] 27     After JL saw the notice to convene the board meeting, he responded in a letter dated 7 October 2006[note: 24], to request an adjournment in order to ‘appraise the financial and operational performance of [Richvein] and thus the necessity or usefulness of the rights issue exercise’. JL’s request was rejected by Richvein in a letter to Over & Over on 9 October 2006[note: 25]. Thereafter, the board meeting was held as planned on 11 October 2006. During the board meeting, both HN and Long Sie Fong (“LSF”) (the directors of Richvein who were nominated by Bonvests) voted in favour of convening the Rights Issue EGM, while JL voted against convening the Rights Issue EGM[note: 26]. LSF was also the general manager of Richvein. 28     I would add that even if JL were not aware of the purpose of the Rights Issue when he sent his letter dated 7 October 2006 to seek an adjournment of the board meeting, he was aware on 11 October 2006 because it was his own evidence that HN had stated at that board meeting that the purpose was to repay the 2002 Loan. 29     After the board meeting to convene the Rights Issue EGM was held, Over & Over wrote to Richvein to ask for detailed profit and loss statements of Richvein and Henrick (Singapore) Pte Ltd (“HS”) for 2002 to 2005 on 12 October 2006[note: 27]. Richvein replied on 16 October 2006, stating that the information Over & Over requested could be found in the audited accounts which Over & Over already had[note: 28]. Over & Over wrote back on 17 October 2006, asking for detailed profit and loss statements as it claimed that the audited accounts did not contain the same[note: 29]. KBS, in a handwritten note on Over & Over’s letter of 17 October 2006, wrote to Mr Ngo proposing not to respond. KBS wrote[note: 30]: Speaking as an accountant, the audited accounts of Richvein contained sufficient information for general purpose analysis. Over & Over already has sufficient information. 30     Later, on 19 October 2006, Over & Over again wrote to Bonvests to ask for the profit and loss statements[note: 31]. Richvein did not respond to Over & Over’s letter. 31     On 26 October 2006 (the day of the Rights Issue EGM), Over & Over wrote to Richvein requesting for the Rights Issue EGM to be postponed to the end of that financial year[note: 32]. However, the request was rejected and the Rights Issue EGM was held on 26 October 2006. During the Rights Issue EGM, the proposed Rights Issue at S$0.38 per rights share was passed, with HN and LSF voting in favour of and JL voting against the Rights Issue[note: 33]. 32     Thereafter, provisional allotment letters (“PALs”) were issued by Richvein to the respective shareholders. Under the PALs, the last day for acceptance was 3 November 2006, or 8 days after the Rights Issue EGM.[note: 34]The amount payable by Over & Over under the Rights Issue was $7,524,000. Each PAL required an attached Form of Acceptance to be completed ‘together with a remittance made payable to [Richvein] for the amount due and payable on acceptance. ‘However, each Form of Acceptance for Rights Issue mentioned, ‘We enclose our cheque for S$ _____ payable to [Richvein] …’. Over & Over then assumed that its payment had to be by way of a local cheque. By two letters dated 27 October 2006, Over & Over requested to make payment by telegraphic transfer. In one of the letters, it indicated that payment would be made from an overseas bank account. Over & Over’s request was rejected by Richvein on 27 October 2006[note: 35](for its first request) and on 30 October 2006[note: 36](for its second request). According to Over & Over, payment by telegraphic transfer would have been the most convenient mode of payment since it did not have a Singapore bank account from which a cheque could be issued to Richvein[note: 37]. Later, Over & Over also requested (on 1 November 2006) for an extension of the last date of payment for the Rights Issue to 9 November 2006[note: 38]. According to Over & Over, it required the extension of the payment deadline as the Rights Issue coincided with the Lebaran public holiday [Hari Raya Aidilfitri] in Indonesia (where some of its funds were), during which certain banks and businesses were closed for about 2 weeks[note: 39]. As that request was also rejected, Over & Over eventually accepted the Rights Issue on 3 November 2006 by submitting its Form of Acceptance with the requisite cheque payment.",
        "The Related Party Transactions": "33     As mentioned above at [8], Richvein had entered into the following contracts: (a)    a contract dated 11 May 2006 with Colex Holdings Ltd for waste disposal services (the “Colex Contract”); (b)    a contract dated 28 July 2006 with Integrated Property Management Pte Ltd (“IPM”) for cleaning services (the “IPM Contract”); and (c)    a contract dated 12 December 2005 with Henrick International Hotels & Resorts Pte Ltd (“HIHR”), subsequently named The Residence Hotels & Resorts Pte Ltd for hotel management (the “HIHR Contract”). 34     It was not in dispute that Bonvests and/or HN held substantial shareholdings in Colex, IPM and HIHR. 35     On 30 July 1984, HN gave a notice to the directors of Richvein pursuant to the (then) s 131(4) & (7A) of the Companies Act (Cap 50) (“the 1984 Notice”), stating his interest in,inter alia[note: 40]:  Name of CompanyNo of SharesBonvests Holdings Limited33,250,000(Deemed Interest)Colex (Singapore) Pte Ltd1,510,000(Deemed Interest)Colex Management Pte Ltd2(Deemed Interest) 36     On 27 June 1991, HN gave a notice to the directors of Richvein pursuant to s 156(4) and 156(8) of the Companies Act (“the 1991 Notice”), stating that he was a director of HIHR and that he had the following interests in HIHR:[note: 41]  Name of CompanyNo of SharesHenrick International Hotels & Resorts Pte Ltd532,770 37     Further, on 9 November 1992, HN gave a notice to the directors of Richvein under s 156(4) and s 156(8) of the Companies Act (“the 1992 Notice”), stating his interest in,inter alia[note: 42]:  Name of CompanyNo of SharesBonvests Holdings Limited132,824,712(Deemed Interest)Colex Management Pte Ltd500,000(Deemed Interest)Colex (Singapore) Pte Ltd1,400,000 Ordinary(Deemed Interest)110,000 Management(Deemed Interest)Henrick (Singapore) Pte Ltd750(Deemed Interest)Henrick International Hotels & Resorts Pte Ltd532,770(Deemed Interest)Integrated Property Management Pte Ltd500,000(Deemed Interest) 38     Colex (Singapore) Pte Ltd (“Colex (Singapore)”) was subsequently listed publicly and changed its name to Colex Holdings Limited (“Colex Holdings”) in 1999.[note: 43] 39     While Over & Over’s complaint related to the Colex Contract entered into in 2006, it was not disputed that Richvein had entered into a contract with Colex (Singapore) from as early as 1997. Between 1997 and 2006, Richvein entered into some renewal contracts with Colex (Singapore) and Colex Holdings for waste disposal services. For the period between 1 June 1999 and 31 May 2000, no written contract could be found but this did not necessarily mean that the written contract did not exist. In any event, whether it existed or not was immaterial for present purposes. 40     As regards IPM, it was not disputed that Richvein had entered into a contract with IPM prior to 2006, from as early as 1998. In 1998, Richvein had entered into a contract with IPM for two years at a charge of $19,580 per month for maintenance of common areas and car park and $2,700 a month for carpet cleaning[note: 44]. In both 2000 and 2002, Richvein entered into two-year contracts with IPM and was charged $29,500 a month for daily and periodic cleaning fees and $3,800 for adhoc cleaning fees[note: 45]. In 2004, 2005 and 2006 respectively, Richvein contracted with IPM for daily and periodic cleaning services at $29,500 per month (with no adhoc fees payable) for one year[note: 46]. 41     The HIHR Contract involved a slightly longer and more complicated history going back to 1991. Richvein had terminated its hotel management agreement with ITT Sheraton on or about 30 June 1991[note: 47]. On 19 July 1991, HN sent the Lauw family a letter requesting them to sign a resolution to allow Richvein to enter into a management agreement with HIHR. JL responded in a letter dated 25 July 1991, seeking more time to consider the matter and asking a number of questions in relation to the management contract with HIHR. In particular, JL raised the concern[note: 48]that: The shareholding of [HIHR] is principally Goldvein Pte Ltd and Bonvest Holdings Ltd, of which Goldvein is wholly owned by Bonvest. As such, Bonvest effectively owns [HIHR]. At the same time, the majority shareholders of Bonvest also control Unicurrent Finance Ltd, the majority shareholders of Richvein. The way I see it, the whole arrangement looks like funds are being diverted from Richvein to the same group of companies to which Unicurrent Finance Ltd belongs. All this is, in my opinion, not in the long term interests of Richvein and is, in particular, prejudicial to the rights of the minority shareholders of Richvein. 42     In HN’s reply to JL’s letter by a letter dated 29 July 1991, HN gave reasons as to why Richvein should contract with HIHR. HN, in his letter, also made the following offer[note: 49]: After your discussion with Mr Djitu in Jakarta, you indicated your willingness to invest in the region of 5 to 10% holding in [HIHR]. To this end I was willing to form an affiliated company that would preserve a 5 percent interest for your side. My actions in this matter have been wholly ethical and the development of a strategy to maintain the hotel’s existing market position and protect the combined interest of all parties is not at all self serving. I urge you to consider my earlier invitation to participate in an affiliate of [HIHR] that would manage the Sheraton Towers. 43     In response to HN’s letter dated 29 July 1991, JL wrote two letters to Richvein. In the first letter dated 1 August 1991[note: 50], JL reiterated how the proposed contract with HIHR amounted to diverting money of Richvein to its majority shareholder and how he saw no reason that Richvein could not take over the management of the hotel by employing the people HIHR intended to employ. JL took the view that the proposed management contract was ‘prejudicial’ and ‘unfairly discriminated’ against Richvein’s minority shareholder. JL then stated that if HN intended to proceed with the Management Contract, Over & Over was prepared, in principle, to sell all their shares in Richvein[note: 51]. 44     JL’s second letter dated 8 August 1991 was substantially similar to the first, except that it mentioned a meeting on 7 August 1991 during which it was suggested that Unicurrent buy over all Over & Over’s shares in Richvein. However, HN did not agree to do so at the meeting. The second letter ended with JL asking HN to ‘seriously reconsider the matter so that an amicable solution can be attained’[note: 52]. 45     Richvein responded to JL’s letter (dated 8 August 1991) on 2 September 1991, stating that it was not possible for Richvein to manage the hotel itself by employing the necessary people because it was necessary to provide compensation packages that included stock participation for at least two key employees whose participation in the management of the hotel was important[note: 53]. It was intended that 25% of the shares in HIHR would be held by the two employees, with Bonvests holding the remaining 75% of HIHR’s shares. Richvein proposed that HIHR form a subsidiary, to be known as HS, to manage the hotel. Over & Over was offered the chance to subscribe for some of the shares in HS, with HIHR to hold the remaining shares in HS. I need not set out the details supporting the proposed shareholding structure in HS. 46     In a fax dated 4 September 1991 to Richvein, Over & Over rejected Richvein’s offer[note: 54]: 5.       We are not making an offer to have 30% of the shareholding of Henrick Singapore, neither are we endorsing the Management Contract with Henrick International or the setting up of Henrick Singapore, however, we are of the view that since the proposal is for Henrick Singapore to run Sheraton, Over & Over should have a 30% share in Henrick Singapore and not 15%. The proportion of shares should not be diluted by the shareholding of Carl Kono and William Hau. 6.       Further, and notwithstanding (5) above, we would like to point out that although the Ngo family only owns 60% of the shares in Bonvests, they would have majority control of Bonvests and consequently have control over Henrick International and Henrick Singapore (since Bonvest will be holding the majority shares in Henrick International directly and indirectly in Henrick Singapore). Further, Bonvests owns 75% in Henrick International and therefore can pass special resolutions in Henrick International. Over & Over would also not be able to object to any special resolution in Henrick Singapore as Henrick International would have 85% of the shares and since Bonvests effectively controls Henrick International. As such, the fact that Ngo family only owns 60% in Bonvests does not detract from the fact that the Ngo family will retain and have the ability to exercise full control over Henrick International and Henrick Singapore. 47     Richvein, in its response dated 5 September 1991 to Over & Over, stood by its letter dated 2 September 1991. Subsequently, Richvein issued a notice to convene a board meeting on 23 September 1991 to approve its entry into a management contract with HIHR[note: 55]. JL, in a letter dated 23 September 1991 addressed to the directors of Richvein, objected to Richvein’s entry into the management contract as, in his view, it would only benefit the majority shareholders.[note: 56] 48     At the board meeting held on 23 September 2001, it was eventually resolved that Richvein (instead of HIHR, as initially suggested (at [45] above) would incorporate HS, which was to be 75% held by Richvein and 25% held by the two key employees, Carl Kono and William Hau. Richvein would enter into a management contract with HS for HS to manage the hotel and charge Richvein ‘a fee of 3% on revenue and 8% on adjusted gross operating profit’[note: 57]. In turn, HS would ‘pay a lump sum of $100,000 or 2% - 5% of [HS’] gross income at the sole discretion of HN, whichever is higher’[note: 58]to HIHR. Effectively, it was agreed that Richvein would contract with HS (in which the two key employees would have a stake), and in turn, HS would sub-contract with HIHR to provide such management services (“the three-tier arrangement”). 49     About 11 years later, by 2002, HN was of the view that the reason for setting up HS (to provide equity incentive to certain employees) was no longer applicable since those employees had left. Therefore, on 26 March 2002, HN informed JL by letter that Richvein intended to terminate the management contract with HS and that Bonvests would provide administrative support to Richvein instead[note: 59]. Over & Over objected[note: 60]. At Richvein’s AGM on 29 May 2002, it was resolved that any decision on the management contract with HS would be deferred to the next AGM[note: 61]. In 2003, the issue was raised again. HN stated in a letter to JL dated 15 January 2003 that the reason for wanting to liquidate HS was that the original objective of setting it up (to allow for equity participation by certain employees) was no longer relevant since those employees had left[note: 62]. Furthermore, there was approximately $10,000 savings from eliminating the need to incur compliance costs to maintain HS. HN suggested that the administrative support services could be taken over by HIHR directly. HN further suggested that HIHR would charge Richvein a flat fee of $100,000 a year[note: 63]instead of charging HS based on the formula previously agreed upon (above at [48]). JL’s solicitors replied on 6 February 2003, stating that it was not agreeable to the voluntary liquidation of HS[note: 64]but no reason was given. 50     However, by a board resolution of HS dated 8 December 2005 signed by HN and KBS, it was resolved to terminate the management agreement between Richvein and HS[note: 65]. The termination of the management agreement took effect from 1 January 2006[note: 66]. On 12 December 2005, HIHR entered into a ‘General Administration Services Agreement’ with Richvein, with HN signing on HIHR’s behalf and LSF signing on Richvein’s behalf[note: 67]. This agreement is the HIHR Contract referred to above (at [33(c)]). The service fee payable thereunder was $100,000 per year.",
        "The Law on Minority Oppression": "51     Having set out the three events in some detail, I now consider the law on minority oppression. Section 216 of the Companies Act states: Personal remedies in cases of oppression or injustice 216.—(1) Any member or holder of a debenture of a company or, in the case of a declared company under Part IX, the Minister may apply to the Court for an order under this section on the ground — (a) that the affairs of the company are being conducted or the powers of the directors are being exercised in amanner oppressiveto one or more of the members or holders of debentures including himself or indisregardof his or their interests as members, shareholders or holders of debentures of the company; or (b) that some act of the company has been done or is threatened or that some resolution of the members, holders of debentures or any class of them has been passed or is proposed whichunfairly discriminatesagainst or isotherwise prejudicialto one or more of the members or holders of debentures (including himself). [emphasis added] 52     Section 216 appears to provide four alternative limbs under which relief may be granted – oppression, disregard of a member’s interest, unfair discrimination or otherwise prejudicial conduct. As I mentioned in [1], Over & Over’s claim was based on oppression and/or unfairly prejudicial conduct . 53     When s 181, the precursor to s 216 of the Companies Act was passed in Singapore in 1966, the Explanatory Statement to theCompanies Bill, 1966stated: Clause 181 is an important provision designed to give a remedy to minority interests who are being oppressed by the majority. An endeavour has been made to incorporate in the clause the improvements recommended by the Jenkins Committee. 54     In theReport of the Company Law Committee 1962 (“Jenkins Committee Report”), the Jenkins Committee stated (at [204]): In Elder v Elder & Watson Ltd 1952 S.C. 49, it was said by Lord Cooper (at p. 55) with reference to the meaning of oppression in section 210 \"the essence of the matter seems to be that the conduct complained of should at the lowest involve avisible departure from the standards of fair dealing, and a violation of the conditions of fair playon which every shareholder who entrusts his money to a company is entitled to rely\".This statement accords with our own view as to the intention underlying section 210 as originally framed, namely that it was meant to cover complaints not only to the effect that the affairs of the company were being conducted in a manner oppressive (in the narrower sense) to the members concerned but also to the effect that those affairs were being conducted in a manner unfairly prejudicial to the interests of those members. We think that the section should be amended to make this clear, and also to make it clear that it is to cover particular acts which are oppressive to or unfairly prejudice the interests of the complaining members as well as to courses of conduct having those effects. [emphasis added] 55     TheJenkins Committee Report(inter alia) made the following recommendation (at [212(c)]): [I]t should be made clear that section 210 [of theUK Companies Act 1948] extends to cases where the affairs of the company are being conducted in a manner unfairly prejudicial to the interests of some part of the members and not merely in an “oppressive” manner; 56     Accordingly, the words “unfairly prejudicial” are supposed to be wider than “oppressive” but there was no definitive guidance as to what each meant. 57     Thelocus classicusfor an action under s 216 of the Companies Act is inRe Kong Thai Sawmill (Miri) Sdn Bhd[1978] 2 MLJ 227(“Re Kong Thai Sawmill”). In that case, the Privy Council, in construing the Malaysian equivalent of s 216(1)(a), held: [F]or the case to be brought within s 181(1)(a) [in pari materia with s 216(1)(a)] at all, the complaintmust identify and prove \"oppression\" or \"disregard\". The mere fact that one or more of those managing the company possess a majority of the voting power and, in reliance upon that power, make policy or executive decisions, with which the complainant does not agree, is not enough. Those who take interests in companies limited by shares have to accept majority rule. It is only when majority rule passes over into rule oppressive of the minority, or in disregard of their interests, that the section can be invoked. As was said in a decision upon the United Kingdom section there must be avisible departure from the standards of fair dealing and a violation of the conditions of fair play which a shareholder is entitled to expectbefore a case of oppression can be made (Elder v Elder & watson Ltd1952 SC 49):their Lordships would place the emphasis on \"visible\". Andsimilarly \"disregard\" involvessomething more than a failure to take account of the minority`s interest: there must be awareness of that interest and an evident decision to override it or brush it aside or to set at naught the proper company procedure (per Lord Clyde inThompson Drysdale1925 SC 311, 315). Neither \"oppression\" nor \"disregard\" need be shown by a use of the majoritys’ voting power to vote down the minority: either may be demonstrated by a course of conduct which in some identifiable respect, or at an identifiable point in time, can be held to have crossed the line. [emphasis added] 58     InLim Swee Khiang and Anor v Borden Co (Pte) Ltd[2006] 4 SLR 745(“Lim Swee Khiang”), Chan Sek Keong CJ explained (at [80]-[82]): 80 The law on acts that are considered oppressive to a minority shareholder or in disregard of his interests is settled. Although the courts have been slow to intervene in the management of the affairs of companies (see for exampleRe Tri-Circle Investment Pte Ltd[1993] 2 SLR 523) on the ground that a minority shareholder participates in a corporate entity knowing that decisions are subject to majority rule, s 216 of the CA enjoins them to examine the conduct of majority shareholders to determine whether they have departed from the proper standard of commercial fairness and the standards of fair dealing and conditions of fair play:Re Kong Thai Sawmill (Miri) Sdn Bhd[1978] 2 MLJ 227at 229. 81 InRe Kong Thai Sawmill (Miri) Sdn Bhd, Lord Wilberforce described the disregarding of minority interests as something more than a failure to take account of the minority interests, such as an awareness of the minority interest and an evident decision to override it or brush it aside. InIn re Five Minute Car Wash Service Ltd[1966] 1 WLR 745 at 752, Buckley J made it clear that the director in that case had to have “acted unscrupulously, unfairly or with any lack of probity”. Margaret Chew, author ofMinority Shareholders’ Rights and Remedies(Butterworths Asia, 2000) pertinently states at pp 107 and 108 that: Section 216 of the Companies Act was conceived and passed with the objective of protecting minority shareholders from majority abuse. In order to offer effective and comprehensive protection, section 216 confers on the courts a flexible jurisdiction to do justice and to address unfairness and inequity in corporate affairs. … The courts may be said to be empowered under section 216 of the Companies Act to re-lay the boundaries of what is or is not fair as between corporate participants. 82 A clear exposition of the rationale underlying s 216 of the CA is found in the judgment of Lord Hoffmann inO’Neill v Phillips[1999] 1 WLR 1092, a case under s 459 of the Companies Act 1985 (c 6) (UK), which corresponds materially to our s 216 CA. Lord Hoffmann said (at 1098–1099): In section 459 Parliament has chosen fairness as the criterion by which the court must decide whether it has jurisdiction to grant relief. It is clear from the legislative history ... that it chose this concept to free the court from technical considerations of legal right and to confer a wide power to do what appeared just and equitable. But this does not mean that the court can do whatever the individual judge happens to think fair. The concept of fairness must be applied judicially and the content which it is given by the courts must be based upon rational principles. … Although fairness is a notion which can be applied to all kinds of activities, its content will depend upon the context in which it is being used. Conduct which is perfectly fair between competing businessmen may not be fair between members of a family. In some sports it may require, at best, observance of the rules, in others (“it’s not cricket”) it may be unfair in some circumstances to take advantage of them. All is said to be fair in love and war. So the context and the background are very important. In the case of section 459, the background has the following two features. First, a company is an association of persons for an economic purpose, usually entered into with legal advice and some degree of formality. The terms of the association are contained in the articles of association and sometimes in collateral agreements between the shareholders. Thus the manner in which the affairs of the company may be conducted is closely regulated by rules to which the shareholders have agreed. Secondly, company law has developed seamlessly from the law of partnership, which was treated by equity, like the Roman societas, as a contract of good faith. One of the traditional roles of equity, as a separate jurisdiction, was to restrain the exercise of strict legal rights in certain relationships in which it considered that this would be contrary to good faith. These principles have, with appropriate modification, been carried over into company law. The first of these two features leads to the conclusion that a member of a company will not ordinarily be entitled to complain of unfairness unless there has been some breach of the terms on which he agreed that the affairs of the company should be conducted. But the second leads to the conclusion that there will be cases in which equitable considerations make it unfair for those conducting the affairs of the company to rely upon their strict legal powers. Thus unfairness may consist in a breach of the rules or in using the rules in a manner which equity would regard as contrary to good faith. 59     Although it was said inLim Swee Khiangthat s 459 of the United Kingdom Companies Act 1985 (“UK Companies Act 1985”) corresponds materially to our s 216, it is useful to bear in mind that s 459(1) of the English legislation (as amended by the Companies Act Schedule 19, paragraph 11) is in terms different from our s 216. Section 459(1) states: A member of a company may apply to the court by petition for an order under this Part on the ground that the company’s affairs are being or have been conducted in a mannerwhich is unfairly prejudicialto theinterests of its membersgenerally or of some part of its members (including at least himself) or that anyactual or proposed act or omission of the company (including an act or omission on its behalf) isor would be so prejudicial. [emphasis added] 60     As can be seen, the focus of s 459 is on “unfairly prejudicial” conduct. It does not have the four limbs in our s 216(1) (a) and (b). Thus, it is no wonder that Lord Hoffman stressed that the English Parliament had chosen fairness as the criterion by which a court must decide whether it has jurisdiction to grant relief. 61     Although the Privy Council inRe Kong Thai Sawmillhad explained what “oppression” and “disregard” each involves, it did not actually suggest that the four limbs in s 216(1) (a) and (b) are distinct. Also, whileLim Swee Khiangappeared to endorseRe Kong Thai Sawmill, Lim Swee Khiangalso appeared to favour a common threshold of unfairness. 62     Indeed, in the earlier case ofTeo Lay Swee and Ors v Teo Siew Eng and Ors[2001] SGHC 29, Prakash J said at [21]: Although there are four alternative grounds for establishing a case under s 216 of the Act, as counsel for the defendants submitted,the common thread that runs through them is that there must be some element of unfairness in relation to the treatment of the minority shareholderthat must be established in order to obtain relief from the court. The present case did not, in my opinion, disclose any element of unfairness in the way that the plaintiffs were being treated or in the loss that they would sustain if the course adopted was that proposed by the defendants. [emphasis added] 63     InNg Sing King v PSA International Pte Ltd[2005] 2 SLR 56(“Ng Sing King”), Rubin J also took the view that the common thread underlying s 216(1) was that of unfairness (at [93]): 93 There appear to be three alternative bases for establishing liability under s 216 – oppression, disregard of a member’s interest and unfair discrimination or prejudice. However, it is now recognised that there should be no minute distinction between these individual terms, and that the common thread underlying the entire section is the element of unfairness:Tong Keng Meng v Inno-Pacific Holdings Ltd[2001] 4 SLR 485. The Court of Appeal inLow Peng Boon v Low Janie[1999] 1 SLR 761adopted this stance by construing s 216 broadly and using “fair dealings” as the litmus test. The quintessential litmus test in s 216 is therefore as Lord Wilberforce aptly put it in the seminal case ofRe Kong ThaiSawmill (Miri) Sdn Bhd[1978] 2 MLJ 227at 229, in relation to the Malaysian equivalent of our s 216: [T]heremust be a visible departure from the standards of fair dealingand a violation of the conditions of fair play which a shareholder is entitled to expect before a case of oppression can be made (Elder v Elder & Watson Ltd[1952 SC 49]): their Lordships would place the emphasis on “visible”. [emphasis added] In a similar vein, Buckley LJ, in delivering the judgment of the English Court of Appeal inRe Jermyn Street Turkish Baths Ltd[1971] 3 All ER 184, defined oppression in the following manner at 199: In our judgment, oppression occurs when shareholders, having a dominant power in a company, either (1) exercise that power to procure that something is done or not done in the conduct of the company’s affairs or (2) procure by an express or implicit threat of an exercise of that power that something is not done in the conduct of the company’s affairs; and when such conduct isunfair… to the other members of the company or some of them, andlacks that degree of probity which they are entitled to expect in the conduct of the company’s affairs... [emphasis added] [emphasis in original] 64     However, insofar as Rubin J relied onRe Kong Thai Sawmillto support his view that the common thread underlying s 216 was that of unfairness, I note thatRe Kong Thai Sawmilldid not state that the common thread (underlying the Malaysian equivalent of s 216) was that of unfairness. Rubin J had applied the Privy Council’s explanation of ‘oppression’ (which is only one of the limbs) as the ‘quintessential litmus test’ for s 216. 65     InWalter Woon on Company Law(Sweet & Maxwell Asia, 3rd Ed, 2005) (at [5.52]-[5.58]) (“Woon on Company Law”), there is an analysis of the four individual limbs of s 216 separately which provide some explanation for each individual limb. However, there is nothing inWoon on Company Lawwhich suggests that the four individual limbs are distinctive. Further, the editors note at [5.62]: … On the one hand, our s 216 is wider than s 459 of the United Kingdom Companies Act 1985 and s 232 of the Australian Corporations Act 2001. The marginal note was amended to reflect the width of the section. Judges can therefore take this cue to adopt a flexible approach and construe the provisions broadly. On the other hand, a liberal approach is liable to lead to uncertainty in the law and prolonged and expensive litigation which a small company can ill afford, although at the moment there seems to be no sign of a floodgate of litigation over s 216. The future development of s 216 will thus depend not only on conceptual arguments but also on how it has operated in practice. One thing is, however, clear.The trend is to construethe individual terms in the section broadly and not quibble over particular words. ‘[It] is now recognized that there should be no minute distinction between these individual terms, and that teh [sic] common thread underlying the entire section is the element of unfairness’ (Ng Sing King v PSA International Pte Ltd[2005] SGHC 5). 66     Margaret Chew, author ofMinority Shareholders’ Rights and Remedies(Butterworths Asia, 2000) also takes the view that the general approach of unfairness is preferable (at p 119-120): Upon either of the four grounds being established – ‘oppression’, ‘disregard of interests’, ‘unfair discrimination’ or ‘prejudice’ – the member may pursue a personal action under section 216 of the Companies Act for relief either against the company or those responsible for the ‘oppression’, ‘disregard of interests’, ‘unfair discrimination’ or ‘prejudice’ … section 216 covers the four grounds aforementioned distinctively and disjunctively. It is, however, submitted that any exercise in further defining or refining each of the expressions ‘oppression’, ‘disregard of interests’, ‘unfair discrimination’ or ‘prejudice’, in order to ascertain any differences in their meaning and application looks to be a frustrating one. It would be futile, if not impossible, to split pedantic hairs over the precise and exact meaning of the medley phraseology favoured by the legal draughtsman. The fruit of such labour could only add uncertainty and confusion. 67     At p 121, the author continues: The expressions in the Singapore, Malaysian, UK and Australian provisions – ‘oppression’, ‘disregard of interests’ (or ‘contrary to interests’), ‘unfair discrimination’ and ‘prejudice’ (or ‘unfair prejudice’) – all point toward behaviour on the part of the majority shareholders or the controllers of a company that departs from the standards of fair play amongst commercial man. Traditionally, such behaviour would have attracted the dyslogistic labels of unfair, improper, unjust or inequitable. Other unflattering labels have included the lukewarm tag of ‘reprehensible’ to the fiery rebuke of ‘tyrannical’.It is such opprobrious behaviour, it is submitted, that the legal draughtsmen of section 216 of the Companies Act and its foreign equivalents, sought to impugn. Therefore, rather than distinguishing one ground from the other in section 216, the four grounds set out therein ought to be looked at as a compound one, the purpose of which is to identify conduct which offends the standards of commercial fairness and is deserving of intervention by the courts.To this end, the combined language of section 216 is suggestive, descriptive and evocative. Section 216 of the Companies Act was conceived and passed with the objective of protecting minority shareholders from majority abuse. In order to offer effective and comprehensive protection, section 216 confers on the courts a flexible jurisdiction to do justice and to address unfairness and inequity in corporate affairs… The discretionary power of the courts under section 216 is notoriously wide.Thus, in determining the scope of section 216, rather than deciphering the precise nuance of each of the expressions ‘oppression’, disregard of interests’, ‘unfair discrimination’ and ‘prejudice’, a compendious interpretative approach, with an emphasis on the rationale and purpose of section 216, is hereby advocated. [emphasis added] 68     I agree with the approach advocated by Margaret Chew. The cases also suggest that there is no meaningful distinction between all four limbs in s 216 and the common thread is some element of unfairness which would justify the invocation of the court’s jurisdiction under s 216. 69     Before me, Over & Over did not argue that there was any distinction between each limb. Instead, Over & Over argued that the court will grant relief where there is a ‘visible departure from the standards of fair dealing and a violation of the conditions of fair play’.[note: 68]Neither did Bonvests argue that there were four distinct limbs in section 216[note: 69]. Accordingly, I proceeded on the basis that Over & Over needed to show that the three events it complained of were so unfair as to invoke s 216. Such a concept of fairness is to be applied judicially and its application by the courts must be based upon rational principles (O’Neill v Phillips[1991] 1 WLR 1092 at p 1098). Not every unfair conduct would necessarily bring s 216 into play. 70     I now consider some principles which have been applied in relation to an action under s 216 of the Companies Act. 71     First, not every breach of the Company’s articles of association or shareholder’s agreement will invoke s 216. InKumagai Gumi Co Ltd v Zenecon Pte Ltd and Ors[1995] 2 SLR 297at p 310, the Court of Appeal held that breach of the company’s articles of association did not necessarily equate to oppressive conduct: In so doing, technically there was a breach of the pre-emptive provisions of the articles of association of KPM, butwe do not think that such breach in the circumstances could be considered as oppressive conducton the part of Low or Zenecon or in any breach of any understanding reached with Kumagai. [emphasis added] 72     InNg Sing King, Rubin J held that the same was true in relation to a breach of a shareholder’s agreement. Furthermore, Bonvests argued that for relief to be granted under s 216, Over & Over had to show ‘substantial prejudice and detriment’ as a result. In short, Bonvests argued that prejudice is an essential element under s 216. To support its contention, Bonvests citedNg Sing King, where Rubin J said at [96]: It does not necessarily follow, however, that breach of any expectations enshrined in the Agreement is tantamount to oppressive conduct. Admittedly, breach of these terms would disappoint the shareholders’ expectations. Nonetheless, many other factors have to be considered to ascertain whether the breach resulted in unfairness, such as whether the breach was deliberate, whether it was a significant breach in disregard of a major expectation and whether any detriment was caused to the aggrieved shareholder.Above all, the plaintiffs have the onus of showing that the breach prejudiced their interest in some way.In this respect, Jonathan Parker J inRe Blackwood Hodge plc[1997] 2 BCLC 650underscored the importance of satisfying the court that harm has been caused by the breach. The following pronouncement at 673 is especially apposite: [T]he petitioners must establish not merely that the [company] directors have been guilty of breaches of duty in the respects alleged, but also that those breaches caused the petitioners to sufferunfair prejudicein their capacity as preference shareholders. As Neill LJ said inRe Saul D Harrison & Sons plc[1995] 1 BCLC 14at 31: The [relevant] conduct must be both prejudicial (in the sense of causing prejudice or harm to the relevant interest) and also unfairly so: conduct may be unfair without being prejudicial or prejudicial without being unfair, and it is not sufficient if the conduct satisfies only one of these tests ... On the facts of this case, the court decided that the petitioners did not show that they had suffered any unfair prejudice by reason of the breaches of duty by the directors.In the same vein, the presence or absence of loss is a significant factor to be taken into account in relation to the alleged breaches of the Agreement. [emphasis added] 73     The above passages appeared to support Bonvests’ proposition that prejudice is an essential element in an action under s 216. However, Over & Over argued thatNg Sing Kingought not to be followed because the case did not consider the difference between the English position under s 459(1) of the UK Companies Act 1985 and the local position under s 216[note: 70]. Over & Over submitted that under the English provision, prejudice is a pre-requisite whereas under s 216 of the Companies Act, there is no such pre-requisite. 74     In the earlier case ofRe a Company (No. 005685 of 1988), ex parte Schwarcz[1989] BCLC 427(“ex parte Schwarcz”), the court interpreted s 459(1) of the UK Companies Act 1985 to mean the following: Under s 459(1) the condition that must be satisfied if the court is to give relief under s 461 is that the company's affairs are being or have been conducted in a manner which is unfairly prejudicial to the interests of some part of the members, including the petitioners, or that any actual or proposed act or omission of the company (including an act or omission on its behalf) is or would be so prejudicial.Four points on the wording of the section are to be noted: (1) the relevant conduct (of commission or omission) must relate to the affairs of the company of which the petitioners are members; (2)the conduct must be both prejudicial (in the sense of causing prejudice or harm) to the relevant interests and also unfairly so: conduct may be unfair without being prejudicial or prejudicial without being unfair and in neither case would the section be satisfied; (3) the test is of unfair prejudice, not of unlawfulness, and conduct may be lawful but unfairly prejudicial; (4) the relevant interests are the interests of members (including the petitioners) as members, but such interests are not necessarily limited to strict legal rights under the company's constitution, and the court may take into account wider equitable considerations such as any legitimate expectation which a member has which go beyond his legal rights. [emphasis added] 75     It is clear fromex parte Schwarczthat the requirement of prejudice (in the sense ofcausingprejudice and harm) was derived from the wording of s 459(1) of the UK Companies Act 1985. 76     I have already said that the common thread under s 216 is some element of unfairness. In my view, prejudice is a factor, and perhaps, a very important one in the overall assessment, but I do not think that it is an essential requirement. 77     I now consider whether Over & Over may rely on any of the three events mentioned.",
        "The Court’s Conclusion on the Share Transfer": "78     Over & Over argued that Richvein was a quasi-partnership because of[note: 71]: (a)    the fact that Richvein is a small private company with two main shareholders only; (b)    the personal relationship between the Lauw family and the Sianandar family (involving mutual trust, goodwill and confidence); and (c)    the terms of an oral joint venture agreement between the parties to invest together. It was unnecessary for me to conclude whether Richvein was a quasi-partnership as I shall elaborate below. 79     Over & Over’s argument was that the oral agreement to invest together consisted of the following terms[note: 72]: (a)    Richvein was to be incorporated to own and manage the hotel business; (b)    the Sianandar family was to hold 70% of the shares in Richvein and the Lauw family was to hold the remaining 30%, with such division of shares to remain so long as the joint venture continued; (c)    JL would be appointed as a director of Richvein, representing the interests of the Lauw family while HN would be appointed as a director of Richvein, representing the interests of the Sianandar family, and the Sianandar family would have the power to appoint another director to Richvein; (d)    when JL was unavailable, LSL would be the alternate director representing the Lauw family and Over & Over on the Board of Richvein; (e)    the profits and losses of Richvein were to be shared by the Sianandar family and the Lauw family in the proportion of their respective shareholdings; (f)     Richvein was to acquire the land at 39 Scotts Road on which the hotel was to be constructed; (g)    Richvein was to manage the hotel to be constructed at the site, with the Sianandar family (through HN) responsible for the management of Richvein, and HN would be reasonably remunerated by Richvein for his services; (h)    the Lauw family was to be consulted on all important decisions and would be informed of the development and performance of Richvein’s business; (the “Important Decision Term”); (i)     Richvein would eventually be listed on The Stock Exchange of Singapore (as it then was) through an initial public offering; (the “Listing Term”); (j)     if either party wished to sell its shares, it would have to offer the shares to the other party first. In order to realise their investment, both parties envisaged the possibility of exit by selling their respective shares individually after the successful public listing of Richvein’s shares or by selling their stakes together to interested buyers (the “Exit Term”). 80     During cross-examination, HN agreed that the Sianandar family and the Lauw family had reached an oral agreement only on the following terms with respect to the joint venture: (a)    that the Sianandar family would be represented by two directors in Richvein, while the Lauw family would be represented by one director[note: 73]; (b)    that the building of the hotel would be funded by the Sianandar family and the Lauw family in the proportion of 70% to 30% respectively[note: 74]; (c)    that the profits and losses of Richvein were to be shared by the Sianandar family and the Lauw family in the proportion of 70% to 30% respectively[note: 75]; and (d)    that the Sianandar family, through HN, would be responsible for the management and operations of Richvein[note: 76]. 81     I come now to Over & Over’s allegations about the Important Decision Term, the Listing Term and the Exit Term. 82     First, Over & Over made no mention of any oral agreement until 14 March 2007[note: 77], when it sent Bonvests a lawyer’s letter alleging oppression and/or unfair prejudice even though several events took place before 2007 in which the terms of the oral agreement, if it existed, would have been breached. For example, Unicurrent’s proposed sale of its 70% stake in Richvein to Bonvests would have been in breach of the Exit Term. Arguably, it would also have been in breach of the Listing Term if, as Over & Over was suggesting, the Share Transfer meant that the Sianandar family would no longer be interested in listing Richvein since their shares in Richvein were in any event held by a public listed company. However, Over & Over did not mention at the material time the Exit Term or the Listing Term[note: 78]. 83     Furthermore, when JL wrote to HN on 7 October 2006 to express his frustration about not being released as a personal guarantor (prior to the Rights Issue), his reply suggested that there was no specific term like the Exit Term or the Listing Term[note: 79]: May I take you back to the 1970’s and 1980 when you and I started this venture. As far as I distinctly recall, we were partners, ready and willing to put in our efforts and cash to start the hotel business. You had your own company to front your investment. I had mine. You agreed to be majority and I minority.There was no issue not being able to work or co-operate with one another. There was no necessity even for me to insist on minority right as against the majority. It was simply “you and I” on this business venture. [emphasis added] 84     Thirdly, JL’s explanations as to why he did not make any mention of any specific oral agreement were inconsistent. During cross-examination, JL implied that although he had had the benefit of lawyers advising him at the time of the proposed Share Transfer, he was not aware that he had any legal recourse.[note: 80]However, JL then gave a different account and alleged that he never once asked his lawyers whether an oral agreement was enforceable. JL’s evidence then was that he raised the terms of the oral agreement subsequently when he found out that oral agreements could be enforced in 2007.[note: 81] 85     I accepted that there might have been some understanding as between the parties with respect to important decisions, but such an understanding was of an informal nature. Furthermore, on the totality of the evidence, Over & Over failed to establish the existence of the Listing Term and the Exit Term. Even if such terms existed, this did not help Over & Over for reasons I will elaborate on below. 86     Over & Over alleged that the sale of shares from Unicurrent to Bonvests in 2003 was oppressive or unfairly prejudicial because[note: 82]: (a)    the Share Transfer made it less likely that Richvein would be listed, and thus HN’s actions were contrary to the objective of the joint venture to pursue a mutual business opportunity and exit strategy for both the Sianandar family and the Lauw family; (b)    the Share Transfer was contrary to the terms of the joint venture agreement between the two families (that neither the Sianandar family nor the Lauw family should be left holding shares in Richvein where the other party had already exited from Richvein or had put itself in a position to be able to unilaterally exit from Richvein); (c)    HN had procured Over & Over’s consent by threatening to use the back-door approach; and (d)    since the back-door approach was an attempt to circumvent the mutual exit strategy agreed upon in the joint venture and Richvein’s Articles, HN’s conduct during the negotiations was contrary to the terms and spirit of the joint venture. 87     It is undisputed that HN had told Over & Over that he could circumvent the pre-emption rights in Richvein’s Articles by injecting Unicurrent into Bonvests sometime before 20 September 2002. Over & Over might well have viewed this as a threat but it had to take a position. It could have asserted that this was a breach of the spirit or substance of the Exit Term but it did not do so. Instead, Over & Over used this opportunity to negotiate for the removal of the pre-emption rights in Richvein’s Articles which Bonvests agreed to and implemented. As Over & Over consented to the Share Transfer and obtained the removal of the pre-emption rights, I was of the view that it was not open to Over & Over to complain about the Share Transfer later. 88     Over & Over also argued that the Share Transfer rendered it less likely for Richvein to be listed as envisaged under the joint venture, since the Sianandar family could realize its investment in Richvein by selling its shares in Bonvests. In Over & Over’s view, this would result in Over & Over, as a minority shareholder, having to deal with people whom it had not intended to work together with. It seemed to me that since Over & Over had consented to the Share Transfer and obtained the removal of the pre-emption rights for its benefit, it was also not open to Over & Over to raise this complaint. 89     In the circumstances, it was not open to Over & Over to try and raise reasons to complain several years later about the Share Transfer.",
        "The Court’s Conclusion on the Rights Issue": "90     Over & Over argued that the Rights Issue was oppressive and/or unfairly prejudicial to Over & Over because[note: 83]: (a)    it was called by HN out of personal pique and, from Richvein’s perspective, without any commercial justification; (b)    it was called for the purpose of diluting Over & Over’s 30% shareholding in Richvein in the event Over & Over was unable to subscribe for the rights shares allotted to it; and (c)    it was conducted in a manner which was deliberately un-conducive for Over & Over to subscribe to the rights shares allotted to it. 91     Over & Over stressed that there was no urgency to repay the 2002 Loan in October 2006 as it was not due until November 2007. 92     Secondly, Richvein had cash and short-term deposits of about $5.28 million and was making profits every year from 2002. As it turned out, Richvein was able to and did repay shareholders’ loans amounting to about $14.4 million from 5 December 2006 to 30 August 2007, although this was done after the 2002 Loan had been repaid. Over & Over submitted that HN had accepted that even if the Rights Issue had not been implemented and if the shareholders’ loans were not repaid, Richvein would have been able to repay DBS about $19 million of the $25 million outstanding, by November 2007. As for the balance of $6 million, there would have been no difficulty in obtaining refinancing when the hotel site was worth at least $191 million. Also, no alternative means of repaying the 2002 Loan had been discussed or explained. 93     Over & Over submitted that HN had accepted the following in cross-examination: (a)    there was no commercial justification, from Richvein’s perspective, for the Rights Issue; (b)    it was neither necessary nor prudent to call for the Rights Issue in October 2006 for the purpose of repaying the 2002 Loan; and (c)    the Rights Issue had been called for out of personal pique, because HN was ‘frustrated’ and ‘irritated’ with JL, and as a reaction to JL’s refusal to extend his personal guarantee. 94     I need to refer only to a few of the extracts which Over & Over relied on. In relation to (a) and (c) above: Cross-examination of HN[note: 84] Q:     And you did not do, in this time, October 2006, any cash-flow analysis to see how the bank loan or whether the bank loan could be repaid in full by November 2007, when it became due; correct? A:      Yes. Q:     So you did not do any of these things; you simply decided you wanted to have immediate repayment of the bank loan in October 2006. Correct? A:      That’s correct. Q:     And that was a reaction to the fact John Loh did not agree the re-financing with him having to provide the personal guarantee; right? A:      Yeah, because of my frustration with him. Q:     So it was a reaction to him – A:      That’s correct. Q:      -- right?So it’s the fact that you were frustrated and you were reacting to Mr John Loh’s refusal to give a personal guarantee; there’s no other commercial reason to repay the bank loan immediately in October 2006? A:       Yes. Q:     You did not take into account the interest of Richvein and all the shareholders; you took into account the fact that you were frustrated. Right? A:      It is not true, your Honour. As I mentioned, by take up the DBS re-financing loan, they were saving 165,000 a year. Is it not shown that I have taken out the minority interest in the company? Q:     Mr Ngo, I’m not referring to the fact that you went to seek re-financing and managed to negotiate savings of interest; right? I’m referring to your decision to call a rights issue in October 2006 to immediately repay off the DBS loan in full. That was a decision not taking into account the interests of the company and the shareholders, but taking into account your personal frustration; correct? A:      That’s correct. Cross-examination of HN[note: 85] Q:     Mr Ngo, can you confirm that after [Over & Over] refused to provide guarantees, you made the decision that “Fine, rights issue should be called to raise the money to repay DBS Bank immediately”? A:      Yes, your Honour. The reason being is that I am so frustrated, and each time the company want to do something, the minority shareholder always jam me. For instance, without even agreeing to provide a personal guarantee and corporate guarantee, and knowing fully that by renegotiating with the bank, a better interest rate, saving the company 165,000 a year, and he refuse. And on top of that, your Honour, the letter offer by DBS Bank have a deadline; by one week I have to accept this letter offer. And finally, I decided at that point in time, no point to waste a lot of time to argue about this issue. So the only solution I feel that the right issue is the best solution to pay off the bank loan. On top of that, there are numerous comment by Over & Over in the shareholder meeting or director meeting that when shareholder loan can be repaid, when dividend can be paid. I explained to them, and firstly to Mr Melvin, under the term and condition of the bank loan, the first thing, we had to repay the bank loan first, before shareholder loan be repay. So because of this position, I thought this the only way for me to release my claim to deal with these people. In conclusion, your Honour, I am in charge of the company. I care for my company. There is a saving of 265,000 [sic] a year. Is it very difficult, is it mean a lot to the other shareholder to provide 30 per cent personal guarantee and corporate guarantee, which it has done right from beginning, when we borrowed the loan from the bank? It is nothing new, your Honour. 95     In relation to (b) above: Cross-examination of HN[note: 86] Q:     And what is being stated by the plaintiff in this paragraph, that they: “… wish to emphasize that without the cash flow statement and a projection of the profitability of the hotel operations, we will not be able to conscientiously discuss the necessity for the rights issue.” What they are saying is logical; correct? A:      Yes. Q:     And would you agree, Mr Ngo, that it’s a valid commercial concern? A:      Yes. Q:     But, Mr Ngo, even though all this was being stated, it didn’t really matter to you, because you had made the decision already; you already made the decision to go for the rights issue and pay back the loan. Right? A:      That’s correct. Q:     You see, Mr Ngo, it is correct for me to say that you made the decision to go ahead and call for the rights issue and to repay back the loan immediately because you were frustrated with John Loh’s conduct in relation to the personal guarantee, and not because it is necessary or prudent to pay back the loan as of October 2006; right? A:      That’s correct. Q:     So if someone was to say, Mr Ngo, that it is necessary and prudent to call for a rights issue to pay back the loan as of October 2006, that is actually not true; right? A:      Yes. 96     Over & Over also relied on the memorandum sent by KBS to HN dated 2 October 2006 (see [26] above) which discussed the pricing of the Rights Issue and stated that at a unit price of $0.3728 ‘that will result in the maximum dilution of Over & Over Limited’s share if it does not take up the rights is not difficult to justify.’ As mentioned above at [31], the Rights Issue was eventually priced at $0.38 per rights share. 97     Over & Over also relied on the haste in which the Rights Issue was implemented, including the refusal to grant an adjournment of the board meeting or the Rights Issue EGM or to provide more financial information. It also relied on the refusal to vary the mode of payment or extend time to pay. 98     It submitted that the entire process, from the notice of the board meeting dated 4 October 2006 to the deadline to subscribe for the Rights Issue (by 3 November 2006) took only one month. The PALs were issued immediately after the Rights Issue EGM and parties were given eight days to subscribe. Over & Over’s requests for an adjournment of the board meeting or the EGM were refused even though there was no urgency. 99     Secondly, Richvein’s refusal to accept payment by telegraphic transfer was completely unreasonable as it would have made no difference whether payment was made by cheque or by telegraphic transfer. Over & Over, a company incorporated in Hong Kong, did not have a bank account in Singapore from which a cheque could be issued. It did not even have the amount required ($7,524,000) in its bank account in Hong Kong at that time. It had to obtain funds from the Lauw family’s businesses in Indonesia and hence its request to pay by telegraphic transfer. Over & Over had also requested for an extension of time to 9 November 2006 to pay for its allocation in view of the Lebaran public holiday in Indonesia and this request was rejected. Eventually, Over & Over sent the funds to LSL’s Singapore bank account from which a cheque was issued and it paid for its allocation on 3 November 2006. 100  Over & Over also pointed out that Bonvests was prepared to borrow money (if necessary) at an interest rate higher than the 2002 Loan in order to subscribe for its portion of the Rights Issue. It submitted that this reinforced its submission that the Rights Issue was an attempt to dilute Over & Over’s stake. 101  I was of the view that it was important to bear in mind the background leading to the Rights Issue. The 2002 Loan was due for payment the next year,ie, November 2007. While HN accepted that there was no urgency to pay back the loan in 2006, another witness, Yeo Wee Kiong, who is a director of Bonvests, mentioned a reason for doing so in re-examination. He said[note: 87]: I was in favour of the rights issue and subscribing for it, because of course I – we had a – I had a reason. The reason was that the loan was – the loan of Richvein was maturing in 2007, and it was already coming to the end of 2006. So if we do not get the loan matter resolved by that time, in a matter of one, two months later, it will be the end of the year, and the loan in Richvein will become, instead of a long-term loan, it will become a short-term loan, a current loan, and that would make the financial statement of Richvein – putting it into a rather precarious position, because it would be – there would be more current liabilities than there are more current assets, and that’s not something that is prudent. So we supported a rights issue to make sure that a long-term asset like a hotel in Richvein was supported by long-term money. Long-term funds is in the form of the rights issue. 102  As I mentioned, this evidence only surfaced during Mr Yeo’s re-examination, neither was it mentioned by HN at all as a reason for wanting to raise funds in 2006 to pay the 2002 Loan. It seemed to me to be a belated attempt to explain some urgency to repay when HN had accepted that there was no such urgency. In any event, it was not wrong for HN to look into the question of re-financing one year before the 2002 Loan was due for payment. Indeed, he was not faulted for doing that. 103  HN had managed to get a re-financing package on better terms,ie, interest being charged at a rate lower than the 2002 Loan. Yet, Over & Over and JL did not agree to provide their guarantees for 30% of the loan. In evidence from JL, it was clear that the real issue was his being required to provide his personal guarantee when HN did not have to provide a personal guarantee for 70% of the loan. Indeed, after the Share Transfer some years earlier, HN had managed to get himself released as a personal guarantor but JL did not succeed then (see [22]). This state of affairs irked JL to the extent that he was not prepared to give his personal guarantee for the re-financing package. 104  Ironically, I found that it was JL who was behaving unreasonably. DBS Bank had released HN and Unicurrent from their respective guarantees because Bonvests, a public listed company, had given its guarantee (for 70% of the 2002 Loan). JL was therefore not in a similar position as HN since Over & Over was a HK$2 company with its shares in Richvein being its only asset. Yet, JL was adamant about not continuing to provide his personal guarantee. It appeared not to matter to him what disadvantages this would entail. The evidence at trial was that DBS Bank might still have extended a loan but on less favourable terms to Richvein. 105  True, HN could have used some of the cash of Richvein and/or its revenue to repay part of the 2002 Loan but, in any event, a loan of some amount, whether $6 million or more, would still be required. True, HN could have gone to other banks or financial institutions and would probably have got a loan but on what terms? Also, he was faced with an unreasonable shareholder who had already refused to accept a re-financing package which appeared to him (HN) to be reasonable. Furthermore, JL also did not pursue re-financing with any bank except for a query made by his staff on or about 12 October 2006 with DBS Bank, see [25] above. 106  I noted that JL was unable to explain satisfactorily why he considered the Rights Issue to be an unreasonable option, in principle. He kept on insisting that Richvein should have tried to obtain a loan first and thought it would only be right to have the Rights Issue if a loan were not available. Yet, he was the one who torpedoed the DBS re-financing package. The only reason why he insisted on a loan as the obvious priority was because ‘every company borrows money’.[note: 88]Yet, that in turn would have entailed interest costs. 107  In any event, the crux of the matter was not whether there were other means of raising some or all the money to pay the 2002 Loan but whether the Rights Issue in the circumstances was unfair. The availability of other means of repayment in itself did not make the Rights Issue unfair. 108  As mentioned, HN did not come up with the idea of the Rights Issue at the outset. The Rights Issue was called because of JL’s intransigence. I could well understand HN’s frustration. That is why HN’s responses in cross-examination, which Over & Over relied on, must be considered in context. It also seemed to me that such responses were also given out of pique. 109  While the 2002 Loan need not be repaid immediately in October 2006, it was a matter which HN wanted dealt with after having been thwarted by JL. 110  I was of the view that HN’s responses, which Over & Over relied on, did not suggest that HN was hoping to dilute Over & Over’s interest with the Rights Issue. There is a difference between being frustrated with JL/Over & Over and trying to fix them in the manner suggested. 111  As for KBS’ memorandum (see [26] again), it suggested that HN did consider the possibility that Over & Over might refuse to subscribe for its portion of a rights issue. KBS’ memorandum addressed the maximum dilution depending on the pricing but that is different from saying that HN was aiming for a dilution. While the price of $0.38 per rights share might result in maximum dilution, there was no suggestion by Over & Over that the price itself was unjustifiable. Presumably, Bonvests itself would also want to pay the minimum price justifiable. 112  The refusal to grant an adjournment of the board meeting or the Rights Issue EGM or to furnish more information to JL must also be considered together with JL’s requests. Did JL really require more time or information? Over & Over had been receiving the audited accounts of Richvein every year and monthly management accounts. In fact, JL was not able to elaborate more specifically during cross-examination what kind of additional information he was seeking. 113  As for the alleged haste in which the entire exercise was completed, I did not think that one month or eight days was unduly short given the fact that Over & Over had been given adequate notice of the Rights Issue EGM. 114  As for the mode of payment being by cheque, HN said he had left such details to be determined by the company secretary. Even if this were true, it is also true that he could have given instructions to accept payment by, say, telegraphic transfer or to extend time for subscription when the respective requests were made. However, the background circumstances had been frustrating to him. To use his words, ‘I thought Over & Over tried to be funny with me’.[note: 89] 115  As far as HN was concerned, he did not want to be bothered any more with requests from JL. As regards the point that Over & Over did not have a bank account in Singapore, the fact was that eventually Over & Over subscribed for its portion of the Rights Issue on time using LSL’s personal cheque drawn on a bank account in Singapore. 116  Insofar as Over & Over was saying that it did not have available funds in Singapore to subscribe, it had known for some time before the EGM that HN was pushing ahead with the Rights Issue. 117  Besides, Bonvests also did not have ready cash to subscribe for its portion of the Rights Issue. That was why it was considering taking a loan to do so. It seemed to me that the fact that it was prepared to borrow money at a higher rate of interest than the 2002 Loan was not so much an indication of its intention to dilute Over & Over’s stake but of HN’s frustration with JL. In any event, the subsequent repayments of part of shareholders’ loans would have alleviated any temporary need to borrow. 118  There was no prejudice to Over & Over. In all the circumstances, I did not think that HN and Bonvests had acted unfairly in respect of the Rights Issue.",
        "The Court’s Conclusions on the Related Party Transactions": "119  Over & Over did not dispute that the 1984, 1991 and the 1992 Notices (see [35] to [37] above) had been given. Over & Over’s complaint was that: (1) there was no subsequent disclosure to the board of Richvein in respect of any change in HN’s interest in those companies; and (2) there was no specific disclosure to the board of Richvein of Bonvests’ and/or HN’s interests in the transactions before Richvein assented to those contracts[note: 90]. Further, Over & Over questioned whether there was commercial justification for entering into the contract with HIHR. In particular, while Over & Over accepted that there was ostensible commercial justification for the Colex Contract and the IPM Contract, it doubted whether the price of all the disputed contracts were reasonable and in the best interests of the company. 120  Under s 156(4) of the Companies Act, a general notice is sufficient declaration of interest in relation to any transaction if,inter alia, the director’s interest is not ‘different in nature or greater in extent than the nature and extent so specified in the general notice at the time the transaction was made’. Over & Over did not give any evidence to show how HN was in breach of s 156(4) by virtue of his interest in the related companies beingdifferent in natureorgreater in extentfrom the time of the latest applicable notice to the time the transactions were entered into. However, s 156(9) provides that s 156 is in addition to and not in derogation of any rule of law or any provision in the articles restricting a director from having any interest in transactions with the company. 121  Over & Over relied on Article 92 of Richvein’s Articles which stated[note: 91]: No director shall be disqualified by his office from contracting with the Company either as vendor purchaser or otherwise nor shall any such contract or any contract or arrangement entered into by or on behalf of the Company in which any Director shall be in any way interested be avoided nor shall any Director so contracting or being so interested be liable to account to the Company for any profits realised by any such contract or arrangement by reason only of such Director holding that office or of the fiduciary relation thereby established butit is declared that the nature of his interest must be disclosed by him at the meeting of the Directors at which the contract or arrangement is determined on if his interest then exists or in any other case at the first meeting of the Directors after the acquisition of his interest and no Director shall as a Director vote in respect of any contract or arrangement in which he is so interested as aforesaid and if he does so his vote shall not be counted. [emphasis added] 122  Article 92 required HN to disclose the nature of his interest in any transaction which is determined at a director’s meeting of Richvein, orin any other case, at the first director’s meeting after his interest is acquired. Arguably, Article 92 still required HN to disclose his interest ineverycontract or arrangement whether the contract was discussed and determined at a board meeting or not. However, mere non-compliance of Article 92 would not necessarily warrant a finding of unfairness, see [71] above. 123  As regards Over & Over’s argument that Bonvests bore the burden of proving that the pricing under each of the Related Party Transactions was reasonable and in Richvein’s best interests, Over & Over did not plead that the pricing, or any other term, was disadvantageous to Richvein[note: 92]. Indeed, JL confirmed during cross-examination that he was not raising any complaint about the terms of the Related Party Transactions[note: 93]. He was complaining about non-disclosure per se. In such circumstances, it was not open to Over & Over to argue that it was for Bonvests to establish that the contracts were in fact reasonable and in the best interests of Richvein. Likewise, it was not pleaded or alleged in evidence that there was no commercial justification for the contract with HIHR. 124  JL gave evidence that he had seen the 1984, 1991 and 1992 Notices under which HN disclosed his interests in Colex, IPM and HIHR. This would suggest that JL knew or ought to have known of HN’s interests in the three companies. 125  When Mr  Yeo proceeded to ask JL whether he had known that Richvein had contracted with each of the three companies, JL initially agreed that he had been aware that both Colex and IPM had contracted with Richvein several years before May 2007.[note: 94]However, JL then changed his evidence and said that he had not been aware of the contracts which Colex and IPM each had had with Richvein.[note: 95]. I was of the view that JL had known at least that Richvein had been contracting with businesses related to HN or Bonvests. 126  My view is reinforced by the fact that Richvein’s audited accounts for the years 2003 to 2006 have a paragraph on “Related Party Information”, which listed significant transactions with related parties (although the specific names were not disclosed). Under the expenses section of the “Related Party Information”, there was an item for “Cleaning service fees to fellow subsidiaries”, which indicated a payment by Richvein for such services. The amounts were $433,632 for the year ending 2003[note: 96], $469,686 for the year ending 2004[note: 97], $474,440 for the year ending 2005[note: 98]and $472,254 for the year ending 2006[note: 99]. In my view, JL would have realised from these accounts that there were contracts between Richvein for cleaning services with ‘fellow subsidiaries’ related to HN or Bonvests as JL’s family businesses were not the related parties involved. Yet, Over & Over did not bother to make any inquiry until 17 April 2007 which was after Over & Over’s solicitors had written in March 2007 to allege that it had been oppressed or unfairly prejudiced. 127  The cleaning fees reflected in Richvein’s audited accounts related to contracts which Richvein had had with Colex and IPM. JL accepted this in cross-examination. The 2006 contracts with Colex and with IPM were renewal contracts with no additional disadvantageous term to Richvein. 128  Likewise, the same audited accounts disclosed generally that management fees were being paid to fellow subsidiaries. Again, there was no query then by JL. The fees were those paid by Richvein to HS who in turn made some payments to HIHR. In 2006, the fees would have been paid by Richvein direct to HIHR. 129  Moreover, it did not lie in Over & Over’s mouth to complain that HIHR had no employee or that a large proportion of the management fee paid by Richvein to HIHR would subsequently be re-directed to Bonvests. Under the three-tier arrangement which I elaborated on at [48], and which Over & Over had agreed to, HIHR was already receiving payment for services rendered although, at that time, the payment was routed through HS. HS had become redundant, for the reasons I have set out. Removing HS saved compliance costs. HIHR was not receiving more from Richvein than what it had received from HS. Indeed, HIHR was being paid a flat fee of $100,000 whereas under the three-tier arrangement, HS could have received 2% to 5% of HN’s gross income if that was higher than $100,000 (see [48] again). 130  The complaint about Richvein’s contract with HIHIR was therefore devoid of merit. 131  For the above reasons, I rejected Over & Over’s allegation of unfairness in respect of the three Related Party Transactions.",
        "Conclusion": "132  I would add that even taking all three events (the Share Transfer, the Rights Issue and the Related Party Transactions) into account cumulatively did not lead to a conclusion of any unfairness for the purpose of s 216. I agreed with Bonvests’ submissions that this action was Over & Over’s attempt to compel Bonvests to buy its shares in Richvein, which was a going concern making profits over the last few years. 133  In the circumstances, I dismissed Over & Over’s claims and ordered Over & Over to pay Bonvests the costs of this action to be agreed or taxed, excluding the costs and disbursements of Bonvests’ expert witnesses who were not called. I elaborate that I did not allow Bonvests the fees and disbursements of its expert witnesses because it was unnecessary to involve such witnesses in the first place. I accept that the omission to call a witness to the stand does not always mean that the fees and disbursements of that witness will necessarily be excluded. 134  I also ordered Over & Over to pay Richvein’s costs fixed at $7,000 as the substantive dispute was between Over & Over and Bonvests, not with Richvein. _________________ [note: 1]John Loh’s Affidavit of Evidence in Chief at [17] [note: 2]10Agreed Bundle of Documents (“AB”) at 3912 [note: 3]1AB at p 42 [note: 4]6AB 2655 [note: 5]6AB 2661 [note: 6]6AB 2676 [note: 7]Plaintiff’s Closing Submissions (“PCS”) at [55] [note: 8]Transcripts, 28 July 2008 p 76-77 [note: 9]JL’s Affidavit of Evidence in Chief at [66] [note: 10]PCS at [59] [note: 11]7AB 2766 [note: 12]7AB 2771 [note: 13]7AB 2926 [note: 14]7AB 2956 [note: 15]10AB 3911 [note: 16]8AB3118 [note: 17]8AB 3120 [note: 18]10AB 3930 [note: 19]10AB 3931 [note: 20]13AB 4985 [note: 21]13AB 4979 [note: 22]13AB 5006 [note: 23]13AB 5004 [note: 24]13AB 5008 [note: 25]13AB 5009 [note: 26]13AB 5020 [note: 27]13AB 5022 [note: 28]13AB 5023 [note: 29]13AB 5028 [note: 30]13AB 5028 [note: 31]13AB 5031 [note: 32]13AB 5052 [note: 33]13AB 5054 [note: 34]14AB 5064 [note: 35]14AB 5069 [note: 36]14AB 5072 [note: 37]PSC at [116]-[117] [note: 38]14AB 5087 [note: 39]PSC at [119] [note: 40]1AB 180 [note: 41]1AB 335 [note: 42]3AB 727-728 [note: 43]Transcripts, 24 July 2008 at p 62 [note: 44]5AB 1891 [note: 45]17AB 6176 and 6AB 2662 [note: 46]11AB 4214, 12AB 4398 and 13AB 4864 [note: 47]2AB 344 [note: 48]2AB 348-349 [note: 49]2AB 354-355 [note: 50]2AB 356 [note: 51]3AB 356-357 [note: 52]2AB 358-359 [note: 53]2AB 362 [note: 54]2AB 366 [note: 55]2AB 377 [note: 56]3AB 382 [note: 57]2AB385 [note: 58]3AB 383-385 [note: 59]6AB 2606 [note: 60]6AB 2621 [note: 61]6AB 2648 [note: 62]9AB 3586 [note: 63]9AB 3586 [note: 64]9AB 3608 [note: 65]12AB 4497 [note: 66]12AB 4498 [note: 67]12AB 4508 [note: 68]PCS at [13] [note: 69]Defendant’s Closing Submissions at [4]-[5] [note: 70]Transcripts, 6 August 2008 p 96-97 [note: 71]PCS at [25] [note: 72]PCS at [27] [note: 73]Transcripts, 28 July 2008 p 9-10 [note: 74]Transcripts, 28 July 2008 p 11 [note: 75]Transcripts, 28 July 2008 p 12 [note: 76]Transcripts, 28 July 2008 p 15 [note: 77]15AB 5389 [note: 78]Transcripts, 21 July 2008 p 65 [note: 79]13AB 5007 [note: 80]Transcripts, 21 July 2008 p 55 [note: 81]Transcripts, 21 July 2008 p 67-68 [note: 82]PCS at [64] [note: 83]PCS at [137] [note: 84]Transcripts, 29 July 2008 p 17:2-18:13 [note: 85]Transcripts, 29 July 2008 p 12:22-14:6 [note: 86]Transcripts, 29 July 2008 p 54:24-56:2 [note: 87]Transcripts, 1 August 2008 p 22:1-18 [note: 88]Transcripts, 23 July 2008 p 72 [note: 89]Transcripts, 29 July 2008 p 71:17-18 [note: 90]PCS at [147] [note: 91]1AB 50-51 [note: 92]Bundle of Pleadings, p 98 [note: 93]Transcripts, 25 July 2008, p 63-64 [note: 94]Transcripts, 24 July 2008, p 48-49 [note: 95]Transcripts, 24 July 2008, p 52 [note: 96]11AB 4117 [note: 97]11AB 4318 [note: 98]12AB 4540 [note: 99]14AB 5280"
    }
}