{
    "case_title": "XP v Public Prosecutor",
    "ncitation": "[2008] SGHC 107",
    "coram": "V K Rajah JA",
    "sections": {
        "Dramatis personae: The key witnesses": "5       I set the stage by briefly introducing the key witnesses for the Prosecution as well as highlighting the main issues arising from their testimonies.",
        "The complainants": "6       The first complainant, E, entered the School in Secondary 1 in 2001. Soon after, he joined the swimming and water polo CCAs. He was 16 years old and in Secondary 4 when he first alluded vaguely to the alleged incidents when he met with Mrs AA and the Principal (see [2] above), though, and rather crucially, E’s account of his meetings with Mrs AA and the Principal differed from theirs. He graduated from the School at the end of 2004 and was no longer a student of the School when the formal complaint to the Principal was made on 30 April 2005. Both his complaints, it bears reiterating, were about alleged incidents that had taken place some four years earlier. At the time of the trial he was 18 years old. 7       The second complainant, D, joined the School in 2003 as a Secondary 1 student. He was allegedly molested by the appellant in 2004 when he was 14 years old. At the time of the trial he was 16 years old. The other two complainants at the trial, B and C, joined the School in 2001 and 2002 respectively. B, like E, was 13 years old when the alleged offence occurred, and C alleged that he was molested at the ages of 12, 15 and 16. At the time of the trial, B was 18 and C was 17. The four complainants were good friends though E claimed that they had drifted apart after he left the School. 8       Two other complainants, W and G, whose accusations the Prosecution initially crystallised into charges but later withdrew, also testified for the Prosecution. W and G gave evidence relevant to the 15th charge; W claimed to have slept on the other side of D when the alleged groping incident occurred. Despite D himself testifying, to the contrary, that he had slept next to C, the Judge nevertheless decided that she “could not ignore” the evidence of W and G that D had “told them that he was ‘freaked out’ by the [appellant’s] conduct the morning after they had seen him sleeping next to the [appellant] as this casual remark confirmed that he was still affected by the incident the next morning” (GD at [239]).",
        "The other prosecution witnesses": "9       Ms BB was E’s mathematics teacher when he was in Secondary 2. E said he would sometimes go to her classroom after school to chat. He testified that in 2003 he told her about the alleged “sports check” incident, but Ms BB later corrected, in her testimony, her initial statement to the police and affirmed unequivocally that the conversation only took place in 2004, after the appellant had returned to the School. This of course did not sit well with E’s evidence. I carefully assessed her testimony. There is no reason not to accept the entirety of her testimony. Indeed, the Judge did not find her to be an unreliable witness. Rather, for apparently implausible reasons, she sought to rely on Ms BB’s earlier statement despite her very cogent reasons for departing from it (see [47] and [48] below). 10     Mrs AA was the head of department of CCAs. At a casual lunch at Wisma Atria in 2004, E and another complainant, C, told Mrs AA that they were unhappy about the appellant sleeping in close proximity with members of the water polo team. She testified that she advised E to lodge a complaint with the School, and E said he would do so after the national swimming competition in July 2004. 11     Among the other boys called as prosecution witnesses were O, the water polo team captain in 2004–2005, K and H. The appellant’s counsel vigorously emphasised that their testimonies contradicted D’s evidence that the appellant had slept next to him. A water polo team coach, Coach 2, also testified for the Prosecution. His testimony undermined the Prosecution’s case but the Judge did not rely in any significant way on his evidence for reasons which are not entirely clear.",
        "The defence witnesses": "12     The Defence called the Principal, whom the Prosecution conceded “came across as an honest witness”. The Principal’s testimony also departed in some aspects from his police statement in relation to the 17th charge. He explained that his recollection in court was more reliable as he had not been adequately prepared for the police interview when he gave his statement. The Judge rejected his testimony, finding that he was unable to explain why he had given two versions about the alleged incident (GD at [160]–[162]). Despite the Principal himself recanting from his earlier police statement (Exh P95), the Judge allowed it to be substituted for his oral testimony under s 147(3) of the Evidence Act (Cap 97, 1997 Rev Ed), and relied on it as “a critical piece of evidence” which, among other things, “revealed that the [appellant] had admitted to the Principal that he had given a massage to E in the portakabin” (GD at [166]). 13     The remaining two of the three water polo coaches, Coach 1 and Coach 3, also testified for the Defence, as did the swimming coach, Coach 4. Their evidence supported crucial aspects of the Defence’s case theory.",
        "Decision below": "14     After setting out the chronological background leading to the charges and distilling the crux of the evidence and relevant legal issues raised in the course of the trial, the Judge first considered as preliminary issues whether: (a) the complainants were credible and reliable young witnesses; and (b) whether there was evidence of collusion. She then considered the evidence relating to each of the three convictions. Most unfortunately, she did not explain or give her reasons in relation to the numerous charges of which the appellant was acquitted. Why did she arrive at wholly different conclusions despite relying on the conduct and evidence of the other two complainants in deciding that their original complaints were genuine and not concocted together (see GD at [39]–[50])? Specifically, she found that B and C only mentioned the appellant’s inappropriate behaviour to their counsellor and parents respectively when they were compelled to. Both B’s counsellor and C’s father testified that they were visibly uncomfortable and unforthcoming, and that C even broke down (GD at [39]–[42]). Yet, notwithstanding all this, the Judge did not find these two complainants unusually convincing, unlike E and D. In relation to D’s complaint, the Judge also relied on the testimonies of W and G, whose charges had been earlier withdrawn (GD at [239]). I found this rather troubling; see [64]–[70] below. 15     The Judge dismissed the Defence’s allegation of collusion on the basis that E did not expect Ms BB to act on the information and “only experienced disappointment when she did not probe further” (GD at [32]). Nor did she find his conduct during the meeting with the Principal in August 2004 suggestive of an attempt to frame the appellant, notwithstanding that E did not disclose to the Principal the alleged incidents in 2001 (GD at [33]). With respect, this was an issue she ought to have assessed more carefully and delved further into. While in sexual offences, particularly those involving young victims, there is quite often, and understandably, a time lapse or delay in the revelation of the incident, one has to wonder whether E’s curious reticence over the 2001 allegations, despite having purportedly earlier ventilated his grave unhappiness about the appellant’s conduct with the other boys, taken cumulatively with his entire testimony and character, undermined his credibility in a significant manner. 16     The Judge “did not doubt that the boys got together to gripe about the [appellant’s] conduct and they probably did agree to do something against him” (GD at [37]) during a hostel stay at the school premises in March-April 2004 (“the 2004 Hostel Stay”, see GD at [30]). However, she dismissed all likelihood that the two gatherings during the 2004 Hostel Stay supported the appellant’s allegation of collusion, and considered (at [38]) that: The evidence also strongly suggested that [the boys] were not aware of each other’s complaints before the meeting with the Principal on 30 April 2005. If indeed there was a common plan to fabricate false allegations against the [appellant], they would have acted in unison in some way and this was clearly lacking on the evidence. With respect, this was a rather peculiar conclusion to draw; indeed, the converse is more likely as the boys must have known of each others’ grievances as well as precisely why they were meeting the Principal, as they were close friends with a common cause. 17     Having assessed their testimonies, the Judge found E and D to be “forthright and honest witnesses who gave a coherent and convincing account of the molest incidents that concerned them” (at [56]). Further, she found that their evidence was “satisfactorily corroborated in certain material aspects” (ibid). On the 16th and 17th charges (ie, the first two of the Charges set out at [2] above) involving the first complainant, E, the Judge believed E’s testimony and found that his animosity towards the appellant did not create a reasonable doubt that he could have falsely accused the appellant. She was also inclined to view E’s complaints to his teachers Ms BB and Mrs AA, as well as to the Principal, as showing that his complaints were genuine and motivated by a noble desire to protect his juniors from the appellant’s inappropriate conduct. 18     The Judge found that the 17th charge was not inherently flawed and that E’s evidence on what happened in the portakabin was “not inherently incredible” (GD at [132]–[142]), nor was his “selective” recollection damaging to his credibility. In particular, she found the Principal’s police statement (Exh P95) to be a “critical piece of evidence as it confirmed E’s evidence that he had reported to the Principal in August 2004 that he had been taken to the portakabin by the [appellant] and that the [appellant] had given him a massage without [him wearing] his T-shirt” (at [166]). She thus accepted E’s account notwithstanding evidence that the portakabin was an unlikely location as it was fully exposed to passers-by. The Judge also rejected the Defence’s arguments that no offence had been committed on the evidence, since the appellant had merely given a massage to the complainant and had stopped when asked to do so. 19     As for D, the Judge found that the appellant himself had admitted in his police statement (Exh P89) to sleeping next to D and sharing D’s sleeping bag as a blanket with him. This was sufficient to corroborate D’s account so that D’s further allegation that the appellant had groped his buttocks and tugged at his shorts could be believed. The Judge also decided that D had “good reasons for not reporting the incident” and did not collude with the others to fabricate his allegation (at [243]–[247]). 20     The appellant was judged to be an unreliable witness principally because his evidence on the stand was contradicted by his two police statements, Exhs P84 and P89. In particular, the Judge took the appellant’s answers in Exh P89 as effective corroboration of D’s evidence that they had slept next to each other and shared D’s sleeping bag as a blanket. The Judge also found that the appellant’s evidence was contradicted by the Principal’s police statement (but not his testimony) as well as Mrs AA’s evidence. She therefore decided that there was no reasonable doubt as to the appellant’s guilt and accordingly convicted him of the Charges. I will deal specifically with the Judge’s analysis in discussing the Charges sequentially below.",
        "The law on collusion and corroboration": "21     When the Defence alleges collusion amongst the complainants, the burden is on the Prosecution to prove beyond a reasonable doubt that there was indeed no collusion to make a false complaint. This iron rule has been established in cases such asKhoo Kwoon Hain v PP[1995] 2 SLR 767(“Khoo Kwoon Hain”),Lee Kwang Peng v PP[1997] 3 SLR 278(“Lee Kwang Peng”) andLoo See Mei v PP[2004] 2 SLR 27(“Loo See Mei”). The Defence, though, has first to establish that the complainants have a motive to falsely implicate the accused. As Yong Pung How CJ explained inGoh Han Heng v PP[2003] 4 SLR 374at [33]: [W]here the accused can show that the complainant has a motive to false implicate him, then the burden must fall on the Prosecution to disprove that motive. This does not mean that the accused merely needs to allege that the complainant has a motive to falsely implicate him. Instead,the accused must adduce sufficient evidence of this motive so as to raise a reasonable doubt in the Prosecution’s case. Only then would the burden of proof shift to the Prosecution to prove that there was no such motive.[emphasis added] 22     This phraseology is similar to that employed inLoo See Meiat [40], that “the Prosecution bears the burden of proving that the complainant …had no reasonto falsely implicate the accused” [emphasis added]. However, this is perhaps an insufficiently precise formulation of the test. All the Prosecution has to prove beyond reasonable doubt is that the “witnessdid notfalsely implicate the accused” [emphasis added] (Loo See Meiat [41]). Of course the two are closely intertwined since one would be unlikely to falsely accuse another without some prior motive, but what really matters in the final analysis is whether it can be established that the witness did or did not in fact falsely implicate the accused. Motive and conduct remain legally distinct concepts and ought not to be conflated. The Prosecution can successfully rebut allegations of collusion without having to prove beyond a reasonable doubt that the witnesses in question had no motive or reason to make a false complaint, if, for example, there were independent eyewitnesses or other real evidence independently establishing the truth of the complaint. If the witness could not possibly have made a false complaint, then his motive is irrelevant. Conversely, a finding that the witnesses in question had no motive to make a false complaint would often (and not invariably) lead to the conclusion that they did not in fact do so, but this in itself is not the determinative inquiry in considering the possibility of collusion. 23     In the present case, the appellant’s allegations of collusion were based on the complainants’ close friendship and their obvious resentment towards him for being a harsh, interfering disciplinarian who was strict with training and took upon himself the task of overseeing their studies. The appellant, a teacher since 1997, asserted that he only encountered difficulty with the boys’ attitude in 2004 when he returned from his overseas studies. According to the appellant, the team had become slack and ill-disciplined and had lost their drive during his absence. His persistent attempts to remould them resulted in frequent scolding, reprimands, recriminations and open confrontations with the more aggressive boys, especially E. Counsel for the appellant argued that it could not have been mere coincidence that the four complainants were close friends (with E and D being particularly close). 24     The Judge correctly appreciated, citingLee Kwang PengandKhoo Kwoon Hain, that the burden was on the Prosecution to prove beyond reasonable doubt that there was no collusion (GD at [28]–[29]). However, she did not appear to have adequately considered the complainants’ close friendship, opportunity and motives for collusion raised by the Defence, and did not properly apply this requirement in determining that “the allegations of collusion were not borne out and the complainants in this case did not collude to give false evidence against the [appellant]” (at [29]). She reiterated, without substantively addressing the Defence’s plausible arguments (at [39]), that: I was also not convincedthat there was a conspiracy to fabricate false allegations against the [appellant] after examining the conduct of and the roles played by the complainants … in the events that led to the lodging of the complaints with the Principal on 30 April 2005. [emphasis added] 25     The Prosecution argued that her reference to “not [being] convinced”, though regrettable, was merely an unpropitious choice of words, and that the Judge did in fact carefully consider whether there existed any reasonable possibility of collusion among the complainants. While I agree that the Judge’s conclusions should not be read in isolation, it does appear that the Judge simply did not or could not satisfactorily explain why she found an absence of collusion. She took a broad-brush approach without condescending into the very specific charges levelled against the boys by the appellant. This lack of reasoning does seem to subtly suggest that she could have unconsciously erred in placing the burden of proof of collusion on the Defence, contrary to the stated rule. The Judge’s confusion in applying the burden of proof is most evident in [42] of the GD where she concluded rhetorically: As can be seen, the complainants only mentioned the [appellant’s] inappropriate behaviour when they were “impelled” to talk about their incidents by their parents. This was hardly the behaviour of boys who were allegedly scheming to lay false complaints against the [appellant]. Their discomfort in discussing such matters with their own parents or mentioning this to their friends showed that they did not treat molest allegations lightly and would use them as a tool of revenge. Why would any student fabricate an allegation that he had been sexually molested by a teacher and open himself up to intense scrutiny and uncomfortable attention not just from his friends and his school mates, but also from his teachers, parents and his relatives just because he is very angry with his teacher? 26     Why indeed? This, with respect, was precisely the wrong question to ask. The issue was notwhya student might risk “intense scrutiny and uncomfortable attention” to sabotage a resented teacher, butwhetherthere existed a reasonable possibility of collusion to falsely accuse the appellant, whom the complainants undisputedly resented. Besides, there are any number of possible motivations to falsely accuse someone; the short answer could well be, as the Judge anticipated but found incredible, simply “because he is very angry with his teacher” (ibid)! It is entirely plausible that when such a complaint is made, the complainant may either be unaware of or have failed to think through the consequences. The short point is that the query posed by the Judge to herself does not admit of a single unequivocal answer. In my view, the Judge misdirected herself on this issue. 27     As for the treatment of a complainant’s testimony where the case literally turns on one person’s word against another’s, there is no formal legal requirement for corroboration (see s 136 of the Evidence Act), nor is it a strict rule that judges must remind themselves of the danger of convicting based on the testimony of one complainant. However, there is good reason for the case law-devised reminder that a complainant’s testimony must be unusually convincing in order to prove the Prosecution’s case beyond a reasonable doubt without independent corroboration (see generallyPP v Mohammed Liton Mohammed Syeed Mallik[2008] 1 SLR 601). I now turn to the origins of this requirement. 28     The phrase “unusually convincing” appears to have been first borrowed inKhoo Kwoon Hain([21]supra) at 776, [44] from a 1949 Kuala Lumpur criminal appeal case,Public Prosecutor v Mardai[1950] MLJ 33, in which Spenser-Wilkinson J (citing no direct authority) declared (at 33): Whilst there is no rule of law in this country that in sexual offences the evidence of the complainant must be corroborated; neverthelessit appears to me, as a matter of common sense, to be unsafe to convict in cases of this kind unless either the evidence of the complainant is unusually convincing or there is some corroboration of the complainant’s story.It would be sufficient, in my view, if that corroboration consisted only of a subsequent complaint by the complainant herself provided that the statement implicated the accused and was made at the first reasonable opportunity after the commission of the offence. [emphasis added] 29     There has been some not altogether fruitful academic debate about the sufficiency of corroboration in the guise of a subsequent complaint by the complainant; s 159 of the Evidence Act allows as corroboration “any former statement made by such witness, whether written or verbal, on oath, or in ordinary conversation”, though only to buttress the witness’s credibility by showing that his testimony in court is consistent with his previous statements. Corroboration in theBaskervillesense is clearly to be preferred,ie,the corroborating evidence must be independent and must confirm in a material particular that the accused committed the offence (seeThe King v Baskerville[1916] 2 KB 658; Jeffrey Pinsler,Evidence, Advocacy and the Litigation Process(LexisNexis, 2nd Ed, 2003) (“Pinsler”) at pp296 and 309). The better view is that elegantly espoused by Yong Pung How CJ inKhoo Kwoon Hainat [50]: [I]f Spenser-Wilkinson J meant inPP v Mardaithat a mere corroboration by virtue of s 159 [of the Evidence Act] is sufficient to remove the caution that the complainant’s testimony must be unusually convincing, then I respectfully disagree. If the complainant’s evidence is not unusually convincing, I cannot see how the fact that she repeated it several times can add much to its weight. 30     However, the abiding, indeed, overriding, concern remaining in the final assessment must be whether a reasonable doubt continues to exist: seePinslerat p 297, unhesitatingly affirming that: The more recent authorities have departed from the technical application of the corroboration warning. Moreover, where supporting evidence is required, the courts have stressed that they are primarily concerned about whether guilt has been proved beyond reasonable doubt by thetotality of the evidencerather than whether corroborative evidence in the strictBaskervillesense exists. [emphasis added] 31     Nevertheless, the highlighted proposition in Spenser-Wilkinson J’s judgment has understandably found favour in our jurisprudence for its inherent pragmatism and intuitive good sense. It does nothing, however, to change the ultimate rule that the Prosecution must prove its case beyond a reasonable doubt, but it does suggest how the evidential Gordian knot may be untied if proof is to be found solely from the complainant’s testimony against the accused. In other words, the “unusually convincing” standard sets the threshold for the complainant’s testimony to be preferred over the accused’s evidence where it is a case that boils down to one person’s word against another’s. 32     As Yong Pung How CJ said inTeo Keng Pong v PP[1996] 3 SLR 329at 340, [73]: I would add that there is nothing magical about the words ‘unusually convincing.’ They are but another way of saying that the witness’s testimony was so convincing that the prosecution’s case was proven beyond reasonable doubt, solely on the basis of that evidence. and again inTang Kin Seng v PP[1997] 1 SLR 46at [44]: In my view,the right approach is to analyse the evidence for the prosecution and for the defence, and decide whether the complainant’s evidence is so reliable that a conviction based solely on it is not unsafe.[emphasis added] 33     This reminder should not, however, be confined to the categories of witnesses who are supposedly accomplices, young children or sexual offence complainants. Prof Michael Hor (Michael Hor, “Corroboration: Rules and Discretion in the Search for Truth” [2000] Sing JLS 509 rightly observes (at 518) that the categorical approach is both under- and over-inclusive: It is clear that witnesses of potentially doubtful credibility may fall outside these categories: witnesses with a grudge against the accused, or witnesses who stand to gain something by incriminating the accused. … Conversely, there are witnesses who are within the classic corroboration categories, but whose credibility is not any more in question than any other witness ... The judges look silly directing the jury or themselves that it is dangerous to convict on the uncorroborated testimony of potentially reliable witnesses who happen to fall within the classic corroboration categories. 34     If “unusually convincing” is shorthand for “convincing enough to prove the Prosecution’s case beyond a reasonable doubt without corroboration”, then the short answer to this observation is simply that witnesses within the categories who are reliable are most often unusually convincing, and their testimonies can support a conviction. Since the warning is not a rule of law and as s 136 of the Evidence Act expressly does away with the formal, legal need for corroboration, a judge who concludes that a witness’s testimony is unusually convincing will not be bound to formally direct himself as such. If the appellate court disagrees on the evidence that the witness was unusually convincing, or finds a reasonable doubt notwithstanding the ostensible credibility of the testimony, then the conviction will be set aside because a reasonable doubt exists, andnot becausethe judge did not remind himself of the standard. Thus the standard or test viewed in isolation might be misleading in so far as it might be interpreted to suggest that an unusually convincing witness’s testimony could overcome even materially and/or inherently contradictory evidence to prove guilt beyond reasonable doubt. The phrase “unusually convincing” is not a term of art; it does not automatically entail a guilty verdict and surely cannot dispense with the need to consider the other evidence and the factual circumstances peculiar to each case. Nor does it dispense with having to assess the complainant’s testimony against that of the accused, where the case turns on one person’s word against the other’s. Assuming that there is no other evidence, the witness must thus be “unusually convincing” to the point where the court can safely say his account is to be unreservedly preferred over that of another. It cannot be employed as a fig leaf to mask internal inconsistencies or evidential gaps in the Prosecution’s obligation to establish its case theory beyond any reasonable doubt. 35     It also goes without saying that if the witness’s testimony is not unusually convincing, then the standard of proof will not be met and other evidence (or a confession) must be led to secure a conviction. Such evidence, if corroborative of the witness’s account, might then contribute to discharge the Prosecution’s legal burden of proof. Obviously, even where there is corroboration, there may still not be enough evidence to convict; for example, if there is other conflicting evidence, then that can be enough to produce reasonable doubt. Thus corroboration alone cannot support a conviction – the test uncompromisingly remains that ofproofbeyond reasonable doubt.The only real value in this guideline therefore is to remind all that, in a case where no other evidence is available, a single witness’s testimony can constitute proof beyond reasonable doubt – but only when it is so unusually convincing as to overcome any doubts that might arise from the lack of corroboration. 36     In the present case, it is noteworthy that there was absolutely noBaskervillecorroboration (see [29] above) for the two charges concerning the first complainant, E, while the third charge raised conflicting evidence on several material points. Having summarised the relevant evidential principles, I now turn once again to the factual matrix.",
        "The Charges": "37     The first two charges related to E and concerned incidents that supposedly took place in 2001. No statement by E had been recorded by the School as E was no longer its student when the complaints were investigated by the School prior to being lodged with the police. It bears mention that the 2001 complaints were also conspicuous for their lack of corroboration from other witnesses even though such witnesses existed and could have been found. The main issues were the consistency of E’s own evidence and the linking of his evidence with that of the other witnesses to ascertain if they could form an unbreakable evidential chain.",
        "The 2001 “sports check” charge": "38     E testified that in early 2001 (when he was 13 years old) during a swimming training session at Toa Payoh Swimming Complex, while he was resting by the side of the pool, he observed the appellant requesting his swimming coach (Coach 4) to excuse E temporarily from training. The appellant told him that he was going to conduct a minor “sports check” and led him to a changing/store room where water polo equipment was stored. In the room, E testified that the appellant closed the door and again informed him that he intended to conduct a “sports check” on his back. E agreed as he understood this to mean that the appellant was going to check for injuries. He noticed that the appellant was carrying a clipboard, a pen and a plastic ruler. 39     During the check, E testified that the appellant stood behind him and massaged the back of his shoulders with his thumbs for 10–20 seconds to ascertain whether he felt any pain. Then the appellant instructed him to bend forward so he could check to see if his back was straight. E felt a ruler being placed on the middle of his back as he bent forward. The appellant then removed the ruler and wrote something on the clipboard. E testified that he was then told to stand up straight and the appellant squatted in front of him to massage his legs from his calves to the top of his thighs. When he reached the groin area, he allegedly asked E to pull down his trunks, which E did, “a little bit”.[note: 1]The appellant remarked that he need not to be shy and requested that he pull them down a little bit more. E did so but without “revealing anything to him yet”.[note: 2]The appellant then told him to “just pull down [his] trunks”[note: 3]and E obeyed, pulling them down to his knees. E testified that the appellant then proceeded to massage the right side of his groin area, touching his penis and pushing it aside with his left hand in the process. He then massaged the left side of his groin. After that, the appellant told E to pull up his trunks. E sought permission to use the toilet so that he could leave. He testified that the appellant followed him out of the room back to the training pool where he summoned another boy to follow him. 40     E testified that he felt deeply traumatised when he had to pull down his trunks, and was so frightened and “rooted to that spot”[note: 4]during the incident that he did not dare ask the appellant to stop. Only after he had pulled up his trunks again did he summon “enough courage”[note: 5]to ask to be excused. After training that day E remembered discussing the incident with some of his teammates, comparing the differences in the nature of the checks that they had received, including whether they had had to pull down their trunks. After this discussion he claimed he was reassured and did not mention this incident again while he was in Secondary1. 41     Strangely, at no point did or could E in his testimony identify any of the boys who had gone through a sports check that day despite sustained probing by the appellant’s counsel. Considering that it was undisputed that the appellant conducted sports checks only on one occasion in early 2001, E’s fellow complainant, B, must have been present since he too alleged that the appellant had molested him during a sports check. However, though E testified that he had discussed the check with his teammates afterward, he was unable to name a single one, explaining that they were unfamiliar to him at that time and all looked the same in their swimming trunks. This rather implausible explanation aside, E also testified that he was rooted to the spot in fear when the appellant allegedly touched his penis, but he was reassured that there was nothing out of the ordinary about his experience when he later compared notes with his friends. Yet he did not recollect who or how many boys he discussed the sports check with, nor was he able to recall what was discussed and why his mind was put at ease following what had allegedly been a traumatic experience. Considering that it is not the Prosecution’s case that all the boys were touched inappropriately, it is difficult to fathom how E’s account can be at all credible, much less unusually convincing. 42     It was undisputed that there was no corroboration of E’s evidence. Pertinently, K and Coach 2, both prosecution witnesses, testified that the door to the changing/store room remained open throughout and that there were boys waiting or participating in ball-handling exercises outside the room. This contradicted E’s testimony that the appellant closed the door behind him and then proceeded to check his back before molesting him. 43     Coach 4 also testified that he had only spoken to the appellant on three occasions, and the appellant had never once asked to excuse a boy from swimming training. The Judge “did not give much weight to this … because [Coach 4’s] recollection did not quite gel with the [appellant]’s own evidence” (GD at [114]). Yet the appellant never admitted to pulling E out of swimming training, nor did anyone but E allege that he had done so. There was simply no plausible basis given for preferring E’s testimony to Coach 4’s unequivocal and precisely consistent evidence. 44     Indeed, it cannot be disputed that E’s complaints to Ms BB and Mrs AA, which might be construed as referring to the sports check incident (he told Ms BB he had been touched and Mrs AA testified that E said his trunks had been lowered slightly, with no mention of the appellant touching his penis), could not constitute corroboration even under s 159 of the Evidence Act. Here too, however, the Judge, rather puzzlingly, resolved the discrepancies in favour of the Prosecution, interpreting or explaining away the other independent adult witnesses’ testimonies so that they awkwardly hewed to E’s account. The Judge concluded (GD at [130]): No doubt that there were discrepancies between E’s evidence and the evidence of other witnesses on the back check incident. I, however, found that these discrepancies were not of the nature that they could be taken as an indication that … E was deliberately concocting his evidence. After all, there was a two-year time gap between the complaint in 2004 and the court proceedings and this may have caused E and the other witnesses to have inaccurate recall. 45     Another important issue was when E informed Ms BB that the appellant had touched him inappropriately. It was a critical part of the Judge’s conclusion that there had been no collusion among the complainants and that E had told Ms BB about the alleged 2001 sports check incident in 2003, before his relationship with the appellant irreversibly soured in 2004. As the judge stated (at [31]): … E would have had no cause to fabricate allegations against the [appellant] prior to 2004 and … if he did indeed report a wrongdoing against the [appellant] before 2004, it could not have been the result of any collusion amongst the complainants. This was a critical point because E testified that when he realised in 2003 that the [appellant] [might] have behaved inappropriately towards him when he was in secondary one, he had told his teacher, Ms BB … that the [appellant] had “touched” him. … I was of the view that this was clear and untainted evidence of improper conduct on the part of the [appellant] in 2001 that attacked the theory of collusion at its roots. [emphasis in original] 46     While corroboration in the sense of a previous complaint, according to s 159 of the Evidence Act andPublic Prosecutor v Mardai([28]supra), is not corroboration by independent evidence and should not be given such weight (seeKhoo Kwoon Hain([21]supra) at 776–777, [48]–[50]), I would nevertheless agree that the implication in the present case of when E mentioned the alleged touching to Ms BB is important because the appellant does not argue that prior to 2004, E or any of the boys would have had reason to resent him. However, it could not with any degree of plausible certitude be determined that the conversation took place in 2003. 47     First, the Judge erred in finding that E told Ms BB about having been touched in 2003. Ms BB herself, who, on any criterion, was an independent and truthful prosecution witness, clarified on the stand that the conversation took place in 2004 after the appellant had returned from his studies, and that E had revealed this to her in a half-serious manner. She clarified that her initial recollection that the conversation happened in 2003 was wrong because she only remembered that E was then in upper secondary and assumed that he was in Secondary 3. She later remembered that the rumours about the appellant being gay had already started circulating, thus it had to be in 2004 (see [84] below). Despite Ms BB’s very cogent reasons and her own unequivocal confirmation that the conversation took place in 2004, the Judge preferred the initial date of 2003, and took this to “substantiate the Prosecution’s case that E’s complaints against the [appellant] were untainted with hate” (GD at [174]). 48     Second, the Judge erred in extrapolating further from this finding,ie, that the conversation took place in 2003, that the appellant therefore did in fact molest E in 2001 at a store room at Toa Payoh Swimming Complex during a sports check by telling him to pull down his trunks and touching his penis. It was common ground that the most E conveyed to Ms BB was a half-serious one-liner that he had been “touched” by the appellant (GD at [121]). The Judge also noted (at [122]) that “it wasoddthat [Ms BB] did not even deem it fit to query E further with the view either to take some action or to discourage or scold E if he indeed was joking” [emphasis added]. Ironically, it is alsooddthat despite this legitimate concern, the Judge then went on to airily brush it aside. Even assuming that Ms BB’s explanation can be rejected and the conversation did take place in 2003, this fact can only be of minimal weight in proving consistency as well as in bolstering E’s credibility. It should not have been viewed as corroboration even under s 159 of the Evidence Act because it was a vague passing remark made half in jest that solicited no reaction from Ms BB.",
        "The 2001 portakabin charge": "49     E testified that a few months after the alleged sports check incident, while he was still in Secondary 1, he attended his first water polo team camp during one of the school holidays at the former premises of X Secondary School. According to him, during a “rest and relax” period one afternoon, between 2.30pm and 3.00pm, the appellant approached him and led him to the portakabin that was being used as the prefects’ room. He attested that the appellant unlocked the portakabin, closed the door behind them and then switched on the air-conditioning and the music-player in the portakabin (GD at [66]). Inside the portakabin the appellant asked E to sit on the sofa, sat next to him and requested that he remove his T-shirt. The appellant then started massaging his back and after a while asked E to lie on the sofa facing up. The appellant later proceeded to massage E’s temples, slowly moving down to massage his shoulders. After that, he massaged E’s chest area until E felt uncomfortable and said he did not actually need a massage. The appellant asked E if he was certain, E said yes, and the appellant told him he could leave. E put on his T-shirt and immediately left the room. According to him the incident lasted about five minutes (GD at [67]). The Judge noted at [68]: E explained that he felt uncomfortable and stopped the massage as he felt that the massage may proceed further down – “So after massaging my shoulders I was feeling uncomfortable when he was going massaging [sic] further down my shoulders.” He was not able to tell the Court which part of his chest the [appellant] was massaging when he began to feel uncomfortable but he stated that the [appellant] was rubbing his chest when he decided to stop him –“I cannot really remember which part of the chest. He was like moving downwards towards the chest and when he was rubbing my chest I said that I was ok. I do not think I need a massage.” [emphasis in original] 50     This account was conspicuous for the glaring and deeply troubling absence of a crucial particular in the original charge: the allegation that the appellant had rubbed E’s nipples. As the Judge noted at [99], the Defence mounted no less than four challenges to the validity of the original charge during the course of the trial: first, when E was testifying; second, after he had finished testifying; third, when the Prosecution closed its case; and fourth, during closing submissions. At the close of the Prosecution’s case the charge was amended pursuant to an application by the Prosecution and only then was the reference to the rubbing of E’s nipples removed. The Judge found (at [100]) that: [T]here was some evidence in support of the said charge under section 354 [of the Penal Code] albeit the description of the actual nature of the criminal force applied on E needed to be amended. In any event, I held that this was not the appropriate time to consider such an application. She thought (at [104]) that: [C]onsidering where the massage was conducted, the manner in which it was conducted and the reaction of E, it was extremely difficult to infer that the [appellant] only intended a regular massage ... Surprisingly, the Judge did not subsequently consider the significance of E’s failure to state specifically that his nipples had been rubbed; she seemed to have ignored this preliminary issue in reasoning that E’s allegations were “not inherently incredible” (GD at [110]), notwithstanding that there was no single clear account of the incident to be discerned from the evidence. This was plainly wrong. The original charge could only have been formulated on precisely what the complainant had originally disclosed to the investigating officer (“IO”). The complainant’s failure to repeat such a fundamental allegation that formed the essence of the original charge, on the stand, despite some rather pointed and lengthy questioning by the Judge herself was, and should have been recognised as, a very disturbing development that severely compromised E’s credibility and the overall strength of the charge. 51     Given the complainant’s about-turn on this particular allegation, the charge in any form simply could not stand, and it is therefore unnecessary for me to decide whether massaging the complainant on his shoulders towards his chest would be an outrage of modesty under s 354 of the Penal Code because the precise facts and circumstances of the allegation remain so fundamentally dubious. For good measure, I should state that I do not, however, find that the Judge “descended into the arena” as the appellant’s counsel strenuously contended. Though she probed the complainant quite extensively, both parties always had opportunities to respond and question the witness further. Given the outcome of these proceedings, it is not necessary to address this issue further, though I must add that I was somewhat surprised by the extensive questioning undertaken by the Judge. A more appropriate procedure would have been for the Judge to indicate to counsel the areas that required further probing and to suggest that this be delved into. While it is always legitimate for judges to query witnesses, this should be for the purpose of clarification and not to establish any intuitive preconception about the matter. Care should be taken to ensure that the questioning is not objectively perceived as being directed towards achieving a particular outcome.",
        "The 2004 June camp charge": "52     The second complainant, D, accused the appellant of having groped his buttocks in the middle of the night during a four-day camp at the School from 6 June to 9 June 2004. D could not remember which night the alleged incident occurred, but in cross-examination he agreed that it must have been the first night because he did not anticipate that the room would be cold. There was independent evidence on this charge, but both the prosecution and defence witnesses’ recollections were somewhat conflicting and did not quite match D’s version of events. 53     D testified that during the camp he slept in the aerobics room in the Movement Centre with about 30 other boys and the appellant. The boys had placed exercise mats to cover the floor and slept on them with their sleeping bags. D testified that on one night before bedtime, while D was laying out his mat, the appellant approached him and asked whether he could borrow D’s sleeping bag. D agreed and handed it to the appellant before completing his toilet routine. When he returned to go to sleep, all the mats were occupied except for two mats next to C, one of the four unsuccessful complainants at trial. D slept between C and the appellant, with the appellant sleeping on D’s right. However, the appellant and D did not in fact share the sleeping bag as a blanket that night; D did not know where his sleeping bag was and as it was cold, he tried to share C’s. 54     In the middle of the night around 3.00am, while D was sleeping on his side facing C he felt a hand stroking or groping his right buttock cheek, then moving to the middle of his backside to his left buttock cheek. D testified that he was a light sleeper and knew it must be the appellant groping him because the appellant was the only person there on his right. When he felt the appellant touching him, he tried to indicate that he was waking up by moving slightly, and the appellant withdrew his hand. However, a few minutes later D felt the appellant tugging or trying to pull down his surfer shorts. He made some noise, turned around and looked at the appellant angrily. D testified that the appellant, lying on his side facing him, then immediately withdrew his hand and went back to sleep. Shocked, D took C’s mobile phone and went outside to call his girlfriend. They talked for about an hour but he did not tell her what had just happened. After that, he went back to sleep and nothing else happened for the rest of the night. 55     D emphatically testified under cross-examination that he did not report this incident to anyone during the camp, and denied knowing about or having been present at a meeting with Coach 1 in August 2004, during which Coach 1 asked about ten boys whether any of them had been touched inappropriately by the appellant. D stated that if he had attended the meeting, he would certainly have disclosed to Coach 1 what had happened during the June 2004 camp. As the Judge noted, his fellow complainants, G and W, on the other hand, testified that he had mentioned the incident to them the next morning (GD at [244], fn 174). Yet the Judge, despite considering D to be unusually convincingvis-à-visthe other unsuccessful complainants, mystifyingly appeared to prefer the latter’s evidence to that of D on this point. The Defence contended that reasonable doubts were engendered by several aspects of this charge: to begin with, it was far from certain whether the appellant had even slept next to D on any of the three nights of the camp. The Judge appeared to base her conviction on this finding, as if it followed naturally that the allegation must then be true. Putting aside the logical deficiencies of such reasoning, it was wildly improbable that D would have returned to sleep next to the appellant if he had really been molested. It was far from clear that there was no other place for him to sleep that night. Curiously, the Judge did not inquire into or establish this. In any case, there was real doubt as to whether the appellant had even slept next to D, in the first place. Did the appellant sleep next to D? 56     The Judge inexplicably accepted in the face of contradiction by six witnesses that the appellant had slept next to D. This includedthree prosecution witnesseswho testified that the appellant slept on a pile of mats in the corner of the room on all three nights of the camp. Objectively speaking, this alone would have been sufficient to raise a reasonable doubt that the appellant would have molested D, since it is not the Prosecution’s case that the appellant stealthily crept up to D during the night to molest him. 57     Furthermore, the evidence that D slept next to the appellant was itself dubious in so far as it was principally corroborated by another boy, W, who had coincidentally accused the appellant of massaging his buttocks in April–May 2004, a charge that was abruptly withdrawn prior to the trial below. W was adamant that he had been sleeping beside D that night, with the appellant sleeping on the other side of D. When confronted with D’s own persistent account that C had been sleeping next to him, W said, “That is not true. He must be mistaken or something.”[note: 6]Indeed! This worrying response speaks volumes. Did the appellant and D share D’s sleeping bag? 58     D’s credibility was further, significantly and unmistakably, corroded by his evidence on the sharing of his sleeping bag. His testimony during cross-examination was rather different from the initial account he had recited in his written statement and during examination-in-chief. In his statement to the School, D alleged that the appellant had approached him to share D’s sleeping bag as a blanket because it was cold and he (the appellant) did not have one. D had unequivocally declared that he and the appellantsharedthe sleeping bag, and that in the middle of the night the appellant had groped his buttocks. However, in the course of cross-examination he later strenuously dissociated himself with this statement, concluding with a disconcerting volte-face, “[t]he truth is I didn’t share my sleeping bag with himat all”[note: 7][emphasis added]. While it was not necessary for the Prosecution to prove that the appellant and D shared a sleeping bag as a blanket, D’s subsequent equivocation on a fact so inextricably intertwined to his account of the alleged groping was fundamentally detrimental to his credibility and the overall cogency of the Prosecution’s case. I could not agree with the Prosecution’s proffered explanation that by “share”, what D initially meant was that he lent his sleeping bag to the appellant entirely that night. That was not what D meant or said. It is clear from the appellant’s police statement, Exh P89 (“P89”), which the Judge took as corroboration for D’s evidence, that the sharing of the sleeping bag there referred to the appellant and D jointly using it as a blanket. D’s inexplicable about-turn on the stand in relation to this material particular should surely have raised doubts as to whether he was similarly mistaken about the sleeping positions, and indeed whether the alleged molest occurred at all. 59     The Judge appeared to have ignored all these flaws in accepting D’s account, relying also on P89. This was despite the presence of cogent evidence compromising its probative value. Having “accepted the contents of the answers in A37 to A39 in Exhibit P89 as being an accurate record of what the [appellant] had informed the IO during the recording of the statement”, the Judge “found that the answers materially contradicted the [appellant]’s evidence in Court andconfirmed D’s testimony that the [appellant] had slept beside him and shared his sleeping bag on one night during the June 2004 camp” [emphasis added] (GD at [437]). This perplexing conclusion will be addressed below at [63]. Weight of the appellant’s statement P89 60     The material portion of P89 in issue reads as follows: Q37) Sometime in 1stweek of June 2004 during the bonding camp at Gymnasium Aerobic room, [D] informed that around 9 pm, you approached him and asked whether he could share the sleeping bag with him. Is that correct? A37) Yes, I remembered that I had asked him to share the sleeping bag as a blanket. Q38) On that night, did you slept [sic] beside [D]? A38) Yes, we had shared the sleeping bag as a blanket. Q39) At about 3 am, [D] alleged that you grabbed his right buttock followed by stroking the middle are [sic] and to the left buttock. What do you have to say about this? A39) I would not do such a thing intentionally. There is a possibility that I could have accidentally knock [sic] his buttock while I was sleeping. 61     The appellant suffers from ventricular tachycardia, a chronic heart ailment he has had since 1998 or 1999. An attack of this ailment results in a rapid racing of the heart and affects blood pressure, judgment and mental cognition. It is undisputed that the appellant suffered a severe attack on 9 June 2005, the day his first police statement, Exh P84 (“P84”), was recorded. The appellant was admitted to the Accident & Emergency Department of the Singapore General Hospital in the early hours of 10 June 2005 and was immediately warded in the intensive care unit. The appellant testified that when he was brought to the hospital he had intense palpitations, low blood pressure resulting in dizziness, disorientation and nausea, and his heart rate was over 200 beats per minute. He was placed on a drip and did not manage to snatch any sleep at all during the entire night. Sometime after 6.00am on 10 June 2005 the appellant asked to be discharged and subsequently returned to the police station to continue giving his statement. This statement, P89, was recorded from 3.25pm that day, with the appellant having had no sleep in the interim after his discharge from hospital. The Judge “accepted that the [appellant] became unwell during the early hours of the morning of 10 June 2005 and that he had been treated and kept under observation at the SGH’s Emergency Medicine Department until about 6 am” (GD at [393]). However, she “found that he was not suffering from severe fatigue or trauma … nor was he unwell when he gave his statements on 9 June and 10 June 2005” (at [404]). On my part, I am not at all sure that this was an appropriate assessment to be made, given the plainly traumatic and enervating events of the previous night. 62     While P89 was not the subject of avoir dire, counsel for the appellant contended that little weight should be accorded to the appellant’s apparent admissions in it. In any case, it was an exculpatory statement and not a confession. The Prosecution submitted that its exculpatory nature and the appellant’s denials to other allegations in P89 showed that he was in full possession of his mental faculties and had not really been affected by the episode the night before. The Judge appeared to agree, finding at [397]–[404]: As for his health condition on 10 June 2005, I noted that the [appellant] was not admitted for treatment in the hospital and was just kept under observation after he was treated. … The undisputed facts were that the [appellant] chose to return to the police station the next day to continue with the interview and he did this on his own volition. He had insisted on proceeding with the interview even though he had been given 3 days of medical leave by the hospital and he had been given the option by the IO to postpone the interview. If he had decided to do this, it must have been because he believed that he was fit and able to continue with the interview. In any event, the interview time was changed from 10 am to 3.00 pm and this would have allowed the [appellant] sufficient time to get some rest after his discharge from the hospital. … Having considered the evidence, I could not infer any improper conduct or improper exercise of power on the part of the IO when the [appellant] was placed under arrest. The IO confirmed that the arrest of the [appellant] was effected in accordance with the usual practice of the specialised team in Tanglin Police Divisional HQ that investigates sexual crimes. The IO also denied handcuffing the [appellant] or doing so to intimidate the [appellant]. He stated that he only handcuffed the [appellant] when he was taken to his house for investigations. As the arrest per se was proper and in accordance with the provisions of the law, I found no reason to infer that the IO had effected the arrest to intimidate or create oppressive conditions. As such, whatever the [appellant] may have felt, it was mostly self-imposed. Based on the above, I found that he was not suffering from severe fatigue or trauma … nor was he unwell when he gave his statements on 9 June and 10 June 2005. 63     I agree that the conduct of IO was on the face of it “procedurally” proper. In recording P89 on 10 June 2005 he had first sought the appellant’s confirmation that he was well and advised him that since he had three days’ medical leave he did not have to give further statements until after his medical leave was over. The IO also asked whether the appellant had consulted his lawyer and whether he still wanted to give his statement. The appellant replied affirmatively. In the course of the appeal hearing, Ms Teh, however, informed me that this consent had in fact never been sought. This lends some support to the appellant’s contention that he was anxious not to upset the IO and had mistakenly hoped to bring the investigations to a speedy closure. His almost desperate attempts to appear co-operative were solely directed towards this objective. Still, P89 was voluntarily given and its admissibility is not in issue. However, in the light of the undisputed medical events between the recording of P84 (see [61] above) and P89, full weight surely cannot be accorded to P89. Furthermore, the ostensible admissions made by the appellant in P89,viz, that he shared D’s sleeping bag with D as a blanket, were completely and paradoxically denied by the complainant, D, himself! Yet the Judge ignored D’s about-turn on the stand and found as a fact that he had shared the sleeping bag as a blanket with the appellant, relying on the appellant’s statement in P89 to discredit his defence and convict him. Indeed, while the Judge gave much leeway to salvage the complainants’ credibility in the face of materially contradictory evidence from Prosecution and defence witnesses alike, she showed considerably less sympathy towards the appellant. Considering the medical difficulties the appellant experienced immediately prior to the recording of P89, as well as the fact that what he admitted to in P89 was in any case refuted by none other than the complainant D, I would not, unlike the Judge, accord any significant weight to P89. There is one further observation I ought to make. The IO testified that the statement accurately recorded every exchange between him and the appellant and that P89 faithfully recorded all that transpired between them at that point of time. The appellant, on the other hand, maintained that several matters discussed were not recorded. Having examined the entire statement, I am hard put to accept that it is indeed a faithful record of everything that transpired between them. There were several abrupt changes of topic. It would be strange for there not to have been a preliminary discussion between them before each new area was plunged into.",
        "Significance of acquittals on the other six similar charges": "64     The Judge was satisfied that the Prosecution had proved beyond reasonable doubt the Charges for which the appellant was convicted, but “was not satisfied that the Prosecution had proved the charges beyond reasonable doubt for the remaining charges” (GD at [14]), and accordingly acquitted the appellant of those six charges. She continued (at [16]): As the Appeal only concerns the three charges for which I convicted the [appellant], I will only set down the reasons for my decision for these three charges and deal with the evidence put forth in relation to them. Reference to the evidence pertaining to the other charges will only be made where necessary. 65     Procedurally, this approach cannot be technically faulted, especially considering the length of the trial and the sheer volume of evidence produced. However, in the context of this case, where all the charges were similar in nature and the Defence was strenuously arguing that all four complainants had colluded to make the accusations falsely, it was, in my view, imperative for the Judge to explain why she reached different decisions on six of the nine similar charges. Without going so far as to say that the acquittals on the six charges would themselves constitute a reasonable doubt as to the three convictions, they certainly would affect the complainants’ collective credibility and the Prosecution’s overall case. 66     Of the nine charges preferred against the appellant, the other six charges involved two other complainants, with B alleging one count substantively similar to the 2001 “sports check” charge concerning E, and C alleging five counts ranging from touching the groin area to the most serious of the nine charges, that the appellant put his hand on his penis and stimulated it. B was also the complainant whose father organised the parents and other complainants prior to the lodgement of the police report. In particular, C’s evidence was taken as corroboration for D’s on the 15th charge (the third of the Charges set out at [2] above). This is significant because the other two complainants’ credibility must be assessed in the light of the fact that the appellant was acquitted of the charges originating from their accusations. Where several similar charges emanate from a few complainants who also give evidence to corroborate each other, and the accused is convicted of some charges but acquitted of the rest, the judge ought to give reasons for deciding differentlyvis-à-visthe different complainants, especially if he or she also relies on their evidence in making a finding of guilt on some charges. 67     The inference to be drawn from the acquittals is that the other two complainants were in all likelihood not unusually convincing, but the troubling question that remains cryptically unanswered is whether they were nevertheless credible enough to refute the existence of any reasonable possibility of collusion among the boys, as well as acceptable as corroboration for the three convictions. It is not in dispute that “even if a witness is found to have lied on a matter, it does not necessarily affect his credibility as a whole” (Ng Kwee Leong v PP[1998] 3 SLR 942at [15]). The Prosecution rightly argued that the assessment of a witness’s credibility was not a science and could not be precisely calibrated on a scale of truthfulness. I accept that the complainants could be believed on some issues and not others without necessitating the conclusion that their testimonies were entirely incredible. However, in the present case, aside from the Charges not having been made out, it was also difficult to dismiss outright the allegations of collusion. This is why it was important for the Judge to give reasons for the acquittals, so that her assessment of the credibility of the other complainants could assist in the determination of whether there existed a reasonable doubt pointing to collusion. The implications of her silence may be briefly illustrated here. 68     First, the accusations levelled by the others against the appellant were substantially similar in fact. Two other sports check complaints were made, but the Judge gave no inkling as to why the appellant was acquitted of those but convicted of the charge relating to E. In the absence of any assessment relating to the other witnesses’ testimonies, the foremost inference is that the other two complainants were disbelieved, while E was believed because he was “unusually convincing”. If this is the case, one is left wondering why E was more convincing than the other witnesses. Was it simply a matter of demeanour? Did the other complainants fabricate their complaints? 69     Second,assumingthe Judge did not find these complainants credible, she could have erred in holding that there was no collusion amongst the complainants. Their lack of credibility in relation to the accusations against the appellant urgently needed to be addressed in assessing their credibility apropos the Defence’s allegations of collusion. While it may well be that a witness who does not tell the truth with respect to one issue may nevertheless be believed on another issue, a critical assessment of the witness and his testimony is necessary to determine on what issues he is to be believed, and, of paramount importance,whyhe is nevertheless to be believed on those issues. 70     In the circumstances of the present case, having upheld only three out of an initial fusillade of 19 charges, many of which were substantively similar (and it may be noted that the three convictions related to the least serious accusations), it was imperative for the Judge to give reasons for the acquittals, to dispel any plausible impression of arbitrariness. The questionable import of the Judge’s choice of language in holding that she “was also not convinced that there was a conspiracy to fabricate false allegations against the [appellant]” (GD at [39]) aside, it is mildly alarming, to say the least, that she explained this conclusion only by reasoning that the conduct of B and C (two boys whose complaints did not justify convictions), in reporting the matters, “was hardly the behaviour of boys who were allegedly scheming to lay false complaints against the [appellant]” (GD at [42]). In reasoning that the difficulty in making the complaints to their parents and the counsellor was perfectly plausible and understandable because of embarrassment and discomfort, the Judge left a legal void in not offering her reasons for acquitting the appellant on these charges, since she had disregarded B’s and C’s delays in making the complaints as a factor adversely affecting their credibility. This was also a rather curious assessment of those complainants’ credibility, since a finding that the complaints were genuine must have supportedboththe conclusion of no conspiracy as well as the appellant’s guilt as inseparable, logical conclusions, and not one without the other. Despite the lengthy GD, the Judge gave no clue as to the solution for the fundamental conundrum implicit in her verdict: If all the complainants were to be believed, why did she only convict the appellant of the three charges relating to E and D? Further, if indeed all the complainants were to be believed and there had been no collusion, how and why did she bifurcate this aspect of the evidence from the other complainants’ credibility on the alleged incidents contained in the charges of which she acquitted the appellant?",
        "The complainants’ credibility": "71     I freely and readily acknowledge that a trial judge is usually much better placed than an appellate judge to assess a witness’s credibility, having observed the witness testifying and being cross-examined on the stand. However, demeanour is not invariably determinative; contrary evidence by other witnesses must be given due weight, and if the witness fails to recall or satisfactorily explain material facts and assertions, his credible demeanour cannot overcome such deficiencies. As I explained inPP v Wang Ziyi Able[2008] 2 SLR 61at [92]–[96], an appellate judge is as competent as any trial judge to draw necessary inferences of fact not supported by the primary or objective evidence on record from the circumstances of the case. 72     While an appellate court should be more restrained when dealing with the trial judge’s assessment of a witness’s credibility, there is a difference between an assessment of a witness’s credibility based on his demeanour, and one based on inferences drawn from the internal consistency in the content of the witness’s testimony or the external consistency between the content of the witness’s evidence and the extrinsic evidence. In the latter two situations, the trial judge’s advantage in having studied the witness is not critical because the appellate court has access to the same material and is accordingly in an equal position to assess the veracity of the witness’s evidence (seeJagatheesan s/o Krishnasamy v PP[2006] 4 SLR 45(“Jagatheesan”) at [40], citingPP v Choo Thiam Hock[1994] 3 SLR 248at 253, [12]). 73     Particularly applicable to this case are the following observations I made inJagatheesanat [40]–[43]: 40     … An apparent lack of appreciation of inconsistencies, contradictions and improbabilities can undermine the basis for any proper finding of credibility: seeKuek Ah Lek v PP[1995] 3 SLR 252at 266, [60]. The real tests are how consistent the story is within itself, how it stands the test of cross-examination and how it fits in with the rest of the evidence and the circumstances of the case;perLord Roche inBhojraj v Sita RamAIR (1936) PC 60 at 62. 41I must caution, however, that even when the trial judge’s evaluation of a witness’s credibility is based on his demeanour, this will not invariably immunise the decision from appellate scrutiny. InPP v Victor Rajoo[1995] 3 SLR 417, the Court of Appeal disagreed with the trial judge’s findings of fact which were, in that case, primarily based on his impression of both the accused and another witness as well as the manner in which they gave their evidence. Writing for the court, L P Thean JA held as follows at 431, [49]–[50]: The learned trial judge’s acceptance of the accused’s evidence was based mainly on his impression of AB and the accused and the manner in which AB and the accused gave evidence. These factors are of course important and play a vital role in the determination of the veracity and credibility of their evidence.However, it is equally important to test their evidence against some objective facts and independent evidence. InPP v Yeo Choon Poh[[1994] 2 SLR 867] at p 878 Yong Pung How CJ delivering the judgment of this court said: As was held by Spenser-Wilkinson J inTara Singh & Ors v PP[1949]MLJ 88 at p 89, the principle is that an impression as to the demeanour of the witness ought not to be adopted by a trial judge without testing it against the whole of his evidence. It is also helpful to remind ourselves of what Ong Hock Thye FJ said inAh Mee v PP, at p 223: To avoid undue emphasis on demeanour, it may be well to remember what was said by Lord Wright, and often quoted, from his judgment inPowell & Anor v Streatham Manor Nursing Home[1935] AC 243, at p 267 of the possibility of judges being deceived by adroit or plausible knaves or by apparent innocence. [emphasis added] 42     I should also add that, in my view, reliance on the demeanour of witnessesalonewill often be insufficient to establish an accused’s guilt beyond reasonable doubt. In this respect, the astute observation of Lord Bridge of Harwich in the Privy Council decision ofAttorney-General of Hong Kong v Wong Muk Ping[1987] AC 501 at 510 is apposite: It is a commonplace judicial experience that a witness who makes a poor impression in the witness box may be found at the end of the day, when his evidence is considered in the light of all the other evidence bearing upon the issue, to have been both truthful and accurate. Conversely, the evidence of a witness who at first seemed impressive and reliable may at the end of the day have to be rejected. Such experience suggests that it is dangerous to assess the credibility of the evidence given by any witness in isolation from other evidence in the case which is capable of throwing light on its reliability[.] 43     The appropriate balance to be struck between the advantages admittedly available to the trial court and the concomitant need for an appellate court to discharge its constitutional duty in ensuring that a conviction is warranted is perhaps best captured by the Canadian Supreme Court inHer Majesty The Queen v RW[1992] 2 SCR 122at 131–132: The trial judge has the advantage, denied to the appellate court, of seeing and hearing the evidence of witnesses. However, as a matter of law it remains open to an appellate court to overturn a verdict based on findings of credibility where, after considering all the evidence and having due regard to the advantages afforded to the trial judge, it concludes that the verdict is unreasonable. A verdict is unreasonable if, in the words of s 261 of the CPC, the trial judge’s decision is against the weight of the evidence or wrong in law. If the Prosecution has not proved its case beyond any reasonable doubt a conviction would be wrong in law. [emphasis in original, emphasis added in bold italics] 74     In the present case, despite examining and apparently dissecting the witnesses’ testimonies with admirable diligence, the Judge did not appreciate their serious inconsistencies, glossing over them as immaterial and regrettably appearing to resolve almost every ambiguity in favour of the Prosecution. The Judge found E (at [107]) to be “a consistent and clear witness. When he was forgetful, it was about details which were peripheral in nature or which he did not consider as important at that point in time.” However, her forgiving dismissal of the contradictory evidence provided by other witnesses, including prosecution witnesses, was quite unsatisfactory. She stated baldly at [112]: The fact that water polo boys were subjected to a back check in 2001 was not in dispute. The issue was whether the back check on E was conducted in the manner described by him. I found that E gave a clear and credible description of what transpired during his back check. Firstly, in relation to the evidence of the other water polo boys who testified that there was only one back check session and that the door to the storeroom was kept opened throughout this session, I felt that these inconsistencies were not fatal to the Prosecution’s case.Just because the door was not locked when the other boys were checked, it did not mean that the door was not locked when the check on E was conducted. Further, just because the other witnesses were only able to recall going through one back check, it did not mean the [appellant] only conducted one back check session or that all the boys were checked on the same day.[emphasis added] 75     This simply cannot be the basis for any conviction. The standard of proof is of course proof beyond reasonable doubt, not beyond every conceivable or hypothetical possibility. Certainly the fact that the door was not locked when the other boys were checked did not absolutely preclude the door from having been locked when E was being checked. However, given that the Prosecution could not produce a single independent witness from any of the boys or coaches present at that training session to testify that the door was ever shut, there must exist at least a reasonable doubt, if not a compelling inference, that the door was indeed left open as the boys took turns to be checked while doing exercises outside the room. 76     Similarly, the Judge was somewhat too enthusiastic in preferring E’s account of the alleged portakabin incident, dismissing as immaterial the Defence’s arguments that the portakabin was the most unlikely location for the appellant to have molested E, and that E’s complaint to the Principal about the alleged incident was inconsistent with his evidence in court. The Judge quite categorically decided (at [137]) that: [O]nce the Principal’s statement to the police dated 21 February 2006 … wherein it was stated that the [appellant] had taken E to the portakabin and had given him a massage after asking him to take off his T-shirt was admitted as part of evidence under section 147(3) of the Evidence Act, the issue about it being an unlikely place to carry out the massage or that the cabin could not be locked from the inside became an immaterial issue. … [T]he Principal’s statement to the police in this regard had the effect of the Principal telling the police that the [appellant] had admitted to him that he (the [appellant])had broughtE to the portakabin and hadgiven him a massage without his T-shirt... With this evidence, the contradictory evidence on the location of the portakabin, the visibility of the interior of the container/portakabin and the state of the locking mechanism had no effect on the credibility of E’s evidence. [emphasis in original] 77     Given that the Principal himself testified that he might have been mistaken in his police statement and the very cogent arguments raised in relation to the implausibility of E’s account, the Judge should not have been so ready to find E’s evidence “indirectly corroborated” (GD at [154]) and to accept it. Nor could this so-called admission by the appellant to the Principal constitute a sound enough basis to support a finding that the appellant was not a credible witness. 78     In the present appeal, neither complainant was unusually convincing, often responding in cross-examination with “I don’t know” or “I cannot remember”. Their close friendship and obvious intense dislike for the appellant also gave some credence to the Defence’s allegations of collusion.",
        "The friendship between E and D": "79     The Judge found (GD at [35]–[36]) that: [T]here was no evidence that [E] kept close contact with the other complainants. This fact was clearly shown by the fact that it was B’s father and not one of the other complainants who had approached him and asked him whether he would be willing to “testify” against the [appellant]. … What was most telling was the fact that during the meeting with the Principal on 30 April 2005, E was not asked by any other complainant or parent about what allegedly happened to him in 2001. If indeed E was a central figure in the conspiracy to fabricate the allegations against the [appellant], one would have expected him to work in unison with the other complainants in 2005 to raise the complaints to the Principal or at the very least, one would expect him to be in contact with the other complainants. In any event, E was no longer in [the School] in 2005 and was no longer “suffering” under the control of the [appellant]. It was difficult to see why he would be motivated to subject himself to the ordeal of police investigations and court proceedings just to join his ex-team mates in a plan to “destroy” the [appellant]. 80     However, she also acknowledged (at [51]) that: The complainants were close friends who were studying in the same school in 2004 and 2005 and were water polo team mates. Further, the complainants admitted that they did discuss this matter although it was not done with any intent to collude. This, to me, was to be expected especially since it was quite natural for boys who are close friends and going through the same ordeal to talk with each other. It would be rather artificial to expect them to suddenly moderate or alter their behaviour just because of pending police investigations. In a way, their conduct was similar to the [appellant’s] discussions with the coaches and former students at the Coffee Bean at Holland Village and at Anchor Point to discuss certain events that were relevant to his defence. Nevertheless, the Judge firmly concluded that the risk of contamination was negligible with regard to the evidence of E and D (at [53]). 81     The appellant argued that the Judge erred in dismissing the possibility of collusion between E and D because the two complainants remained particularly close friends even though E had graduated from the School in 2004. Counsel for the appellant pointed out that the two complainants had admitted to holding hands and resting their heads on each others’ shoulders, and their “testimonials” on the social networking website, Friendster, from 2004 to 2006 also demonstrated a close friendship. D also testified at trial that his sister knew E. While E testified that he was generally not particularly close to the other complainants during the three months preceding the release of the General Certificate of Education Ordinary Level examination results in 2005, he trained with the affiliated junior college water polo team, where C and B also trained, and sparred with the school team before the March 2005 competition. Pointing to the fact that the two complainants E and D were photographed together at a party in September 2006 after the trial was underway, counsel for the appellant asserted that they had clearly not lost touch or drifted away after E left the School. This concern is not without substance. 82     In the light of this evidence that the complainants’ close friendship clearly endured, the Judge should at least have assessed this concern in greater depth in determining whether they might have colluded tofalselymake the accusations against the appellant.",
        "Whether the complainants were unusually convincing witnesses": "83     In finding E and D to be unusually convincing witnesses, the Judge resolved almost every ambiguity in the evidence in their favour, and unevenly glided over several glaring inconsistencies raised by the other evidence. Even if the Judge found the complainants to be entirely credible, even unusually convincing witnesses, the contradictions raised by other evidence, such as Coach 4’s testimony, and that of at least two prosecution witnesses as to the sleeping positions during the June 2004 camp, would have sufficed to create a reasonable doubt that disenabled the Prosecution from discharging its burden of proof in so far as D was concerned. 84It is common ground that sometime in 2004 during or after the 2004 Hostel Stay (see [16] above) but before the June camp (when D was allegedly groped), E mischievously planted an unsubstantiated rumour amongst his teammates that the appellant was gay. While neither E nor D could remember when exactly E was confronted about the rumours and was asked to stop them, Coach 1 testified that in late July or early August 2004, about two weeks before the meeting during which he asked the boys if any of them had been touched inappropriately by the appellant, he and the appellant had lunch with some of the boys including E and D. At that lunch, E admitted to having spread the rumour. E later sent an SMS to his teammates apologising for the rumour and clarifying that it was not true. This corresponded roughly with E’s evidence that the appellant approached him to “clear things up” and asked him to inform his teammates that the rumour was untrue (see GD at [90]–[92]), as well as the appellant’s evidence on the lunch and on approaching E (see GD at [289]–[295]). While I would not attribute undue significance to this incident, or take it as conclusive proof that E’s and D’s complaints were as baseless as the rumour, it is curious that D, having been warned by his friend E that the appellant was allegedly gay, did not later mention the alleged groping incident to E, not even to affirm E’s suspicion. For that matter, it might also be considered curious that E did not tell his juniors or even D about what had allegedly happened to him in 2001, as that would certainly have put them on guard. The complainants’ behaviour, on reflection, did not quite comport with their testimonies. 85     As discussed above, in the light of the serious inconsistencies in the two complainants’ evidence, with E failing to reprise the most essential particulars in the original charge relating to the alleged portakabin incident, and D recanting inexplicably on the similarly crucial matter of whether he and the appellant shared a sleeping bag, it could not be said with certitude that the complainants wereunusuallyconvincing witnesses. Their credibility was eroded by their own contradictory statements and further shaken by inconsistent testimonies from other credible witnesses, prosecution and defence alike.",
        "The appellant’s credibility": "86     The Judge did not specifically address the appellant’s credibility, but noted that it was “a critical part of his defence that all the complainants had fabricated the allegations as he did not commit any of the acts alleged” (GD at [22]). In finding that there was no collusion (despite the contradiction of acquitting the appellant of charges stemming from complaints which she considered legitimate) and that E and D were “unusually convincing” witnesses (GD at [109] and [224] respectively), the Judge necessarily found that the appellant was not a credible witness. This finding was presumably founded on the unsatisfactory explanations of his guarded admissions in his police statements, which apparently contradicted his defence of complete denial at trial. In addition, the Judge also appeared to conclude adversely on the appellant’s credibility based on his evidence in thevoir direfor his first statement to the police recorded on 9 June 2005,ie, P84 (see [61] above). 87     The Judge addressed at some length the Defence’s challenge to the admissibility of P84. I agree with the Judge’s finding in thevoir direthat P84 was made voluntarily and was correctly admitted, but full weight should not have been accorded to either P84 or P89, the second statement given on 10 June 2005 (discussed at [61]–[63] above). As the Judge acknowledged at [356], the appellant had been suffering from recurrent idiopathic left ventricular tachycardia since 1998 or 1999, and would be short of breath, dizzy and disoriented when he got an attack. During a serious attack his body would get stiff and he would feel numb. The Judge also accepted a letter dated 16 August 2006 from Singapore General Hospital confirming that he was seen at the Department of Emergency Medicine in the early hours of 10 June 2005 for this problem. The recording of P84 had concluded on 9 June 2005 at 3.50pm. However, the Judge seemed sceptical that the appellant would have already felt ill about 12 hours before he was admitted to hospital. She “was compelled to find that even if the [appellant] was ill during the recording of [P84], his condition was not as severe as he suggested” (at [359]). Further, she found (at [363]) that: [The appellant] was capable of comprehending the questions and providing answers to the questions on his own even during the last hour of the recording of the statement. Once I rejected his claim that he was ill, I also rejected his claim that he merely scanned the contents of the statement and he did so within two minutes because of his health condition. 88     Having concluded that both the appellant’s statements P84 and P89 had been made voluntarily and that his comprehension had not been impaired by his medical condition, the Judge then listed several discrepancies between the appellant’s testimony and his police statements (at [374]–[385]), ranging from whether he had massaged boys’ thighs on other occasions to whether he had admitted to sleeping next to D. Several of these discrepancies related to facts irrelevant to the Charges, and were in reality no more material than the numerous inconsistencies perforating the complainants’ evidence. The Judge appeared to base her finding of the appellant’s credibility largely on the issue of whether the statements had been made voluntarily. While I agree that the statements were voluntarily made, from a technical standpoint, and therefore admissible, the Judge was, with respect, too quick to conclude, and not quite justified in extrapolating from thevoir direfor P84, that the appellant “showed that he had no qualms in embellishing his evidence and he was on occasion prone to exaggeration” (at [344]). Most importantly, the Judge’s finding was premised almost entirely on the appellant’s admission in P89 that he had shared D’s sleeping bag with him as a blanket. As discussed above at [58]–[63], in the light of D’s most inexplicable but unequivocal denial of his earlier allegation that they had shared the sleeping bag as a blanket, the appellant’s credibility should have been acknowledged to be on par with D, at the very least, on this particular issue. 89     Given my finding that the Prosecution did not prove its case beyond a reasonable doubt, I need make no finding on the appellant’s credibility. However, in fairness to the appellant, I should mention that some of the Judge’s criticisms about his testimony were unwarranted: there was simply not enough sturdy evidence to conclude that the appellant had no “qualms in embellishing his evidence”.",
        "Burden of proof – “beyond reasonable doubt”": "90     The presumption of innocence is the cornerstone of the criminal justice system and the bedrock of the law of evidence. As trite a principle as this is, it is sometimes necessary to restate that every accused person is innocent until proved guilty. As Viscount Sankey LC authoritatively declared inWoolmington v The Director of Public Prosecutions[1935] AC 462 at 481-482 (most recently approved inTook Leng How v PP[2006] 2 SLR 70at [27]): Throughout the web of the English Criminal Law one golden thread is always to be seen, that it is the duty of the prosecution to prove the prisoner’s guilt subject to what I have already said as to the defence of insanity and subject also to any statutory exception. If, at the end of and on the whole of the case, there is a reasonable doubt, created by the evidence given by either the prosecution or the prisoner, … the prosecution has not made out the case and the prisoner is entitled to an acquittal. No matter what the charge or where the trial, the principle that the prosecution must prove the guilt of the prisoner is part of the common law of England and no attempt to whittle it down can be entertained. 91     In other words, as the English Court of Criminal Appeal put it inR v Dennis Patrick Murtagh and Kenneth Kennedy(1955) 39 Cr App R 72 at 83, it is “not for the accused to establish their innocence”, save of course in certain special circumstances expressly mandated by Parliament. There are sound policy reasons for this stance. InJagatheesan([72]supra) at [46], [48] and [59], I pointed out: 46     The requirement that the Prosecution has to prove its case against an accused beyond reasonable doubt is firmly embedded and entrenched in the Evidence Act (Cap 97, 1997 Rev Ed) (“EA”) as well as in the conscience of the common law. In fact, this hallowed principle is so honoured as a principle of fundamental justice that it has been accorded constitutional status in the United States (In re Winship, 397 US 358 (1970) (“Winship”) and in Canada (R v Vaillancourt[1987] 2 SCR 636). It is a doctrine that the courts in Singapore have consistently emphasised and upheld as a necessary and desirable prerequisite for any legitimate and sustainable conviction: see, for example, [Teo Keng Pongv PP[1996] 3 SLR 329] at 339, [68]; most recently applied by the Court of Appeal inTook Leng How v PP[2006] 2 SLR 70... … 48     … Every conviction must hew to an identical touchstone. Such a standard is not so stringent as to mean that every item of evidence adduced should be isolated, considered separately and rejected unless the Prosecution satisfies the trial judge that it is credible beyond reasonable doubt: SeeNadasan Chandra Secharan v PP[1997] 1SLR 723 at [85]. All the principle requires is that upon a consideration of all the evidence presented by the Prosecution and/or the Defence, the evidence must be sufficient to establish each and every element of the offence for which the accused is charged beyond reasonable doubt. … 59     [The] threshold below which society will not condone a conviction or allow for the presumption of innocence to be displaced is the line between reasonable doubt and mere doubt. Adherence to this presumption also means that the trial judge should not supplement gaps in the Prosecution’s case. If indeed gaps in the evidence should prevail so that the trial judge feels it is necessary to fill them to satisfy himself that the Prosecution’s burden of proof has been met, then the accused simply cannot be found legally guilty. In short, the presumption of innocence has not been displaced. 92     The Court of Appeal inTook Leng Howalso adopted Denning J’sdictainMiller v Minister of Pensions[1947] 2 All ER 372 at 373 explaining what constitutes a reasonable doubt: Proof beyond reasonable doubt does not mean proof beyond the shadow of a doubt. The law would fail to protect the community if it admitted fanciful possibilities to deflect the course of justice. If the evidence is so strong against a man as to leave only a remote possibility in his favour which can be dismissed with the sentence “of course it is possible, but not in the least probable,” the case is proved beyond reasonable doubt, but nothing short of that will suffice. 93     It can also be distilled from the established jurisprudence that a reasonable doubt is a reasoned doubt, “a doubt for which one can give a reason, so long as the reason given is logically connected to the evidence” (perWood JA inR v Brydon(1995) 2 BCLR (3d) 243 at [44], cited inJagatheesanat [53]). A reasonable doubt must be capable of distinct articulation and be founded in the evidence submitted which is essential to support a conviction; it must react to a weakness in the case offered by the Prosecution. The trial judge must thus be careful to objectively reason through the evidence, and state precisely why and how it supports the Prosecution’s theory of the accused’s guilt, rather than simply state that he or she has been subjectively satisfied beyond reasonable doubt (seeJagatheesanat [55]–[56]). 94     If the evidence is insufficient to support the Prosecution’s theory of guilt, and if the weaknesses in the Prosecution’s case reveal a deficiency in what is necessary for a conviction, the judge must acquit the accused, and with good reason: it simply has not been proved to the satisfaction of the law that the accused is guilty, and the presumption of innocence stands unrebutted. It is not helpful, therefore, for suggestions to be subsequently raised about the accused’s “factual guilt” once he has been acquitted. To do so would be to undermine the court’s finding of not guilty and would also stand the presumption of innocence on its head, replacing it with an insidious and open-ended suspicion of guilt that an accused person would be hard-pressed to ever shed, even upon vindication in a court of law. I have no doubt that prosecutions are only commenced after careful investigation and prosecutorial discretion is never lightly exercised, but the decision of guilt or innocence is constitutionally for the court and the court alone to make. The court cannot convict if a reasonable doubt remains to prevent the presumption of innocence from being rebutted. In that result, there is no room for second guessing or nice distinctions; there is only one meaning to “not proved” and that is that it has not been established in the eyes of the law that the accused has committed the offence with which he has been charged.",
        "Conclusion": "95     In convicting the appellant on three charges but acquitting him of six others, the Judge was duty-bound in the context of these proceedings to provide reasons for differing conclusions on the appellant’s guilt apropos the various complainants. This is especially since the facts alleged in most of the charges were substantially similar, and even more so given that the Judge “found” that there was no prevailing reasonable possibility of collusion amongst the four complainants. She also erred in resolving almost every doubt or inconsistency in favour of the Prosecution, while being decidedly unforgiving of the appellant’s inconsistent police statements, even though it was undisputed that he had been hospitalised the night before due to a severe recurrence of his chronic heart ailment. Had there really only been immaterial creases in the complainants’ testimonies, there would have been no basis to draw an adverse inference as to their credibility. However, this was not the case. The discrepancies within each complainant’s testimony, as well as the contradictions thrown up by both prosecution and defence witnesses alike, raised several serious doubts as to the veracity of the allegations that, in the final analysis, could not be dismissed. The Prosecution’s evidential platform on each charge was simply not sturdy enough to discharge the burden of proof beyond reasonable doubt. 96     While the appellant’s general behaviour with his students is not in issue here, I notice that he acknowledged exchanging massages with the boys, while sometimes bonding with them through other activities that brought them into close physical proximity. Such conduct alone cannot and does not constitute the criminal offence of outraging modesty. Nevertheless, one cannot ignore the fact that all teachers are indeed in a position of considerable authorityvis-à-vistheir young charges, and must be cautious never to find themselves in situations where there is a potential to harmfully exploit that relationship. It is almost impossible to exaggerate the importance not merely of propriety, but the appearance of propriety, in the teacher-student relationship. In seeking to play an active role so as to make a meaningful difference to the lives of their students, teachers must always be mindful never to cross the boundaries of personal and cultural proprieties and should be ever conscious of respecting their students’ privacy and personal space. Potentially compromising situations should be avoided at all costs. Should there be a need for student-teacher bonding involving any form or degree of physical contact, this should invariably take place in the open, and, in any event, only in the presence of others, without occasioning even the slightest hint of impropriety. 97     The present appeal has shown conclusively and irrefutably that the legal burden of proof hasnotbeen discharged and that the presumption of innocence remains unrebutted as a result. First, both complainants werefarfrom unusually convincing: both their testimonies wereinternally inconsistentin material particulars and the Judge erred in resolving practically every contradiction in the Prosecution’s favour. Second, the Prosecution’s case wasinherently untenable, having been contradicted on important points by both prosecution and defence witnesses alike. Finally, and most crucially, the Defence had most definitely raised severalreasonable doubtsas to the appellant’s guilt when assessed against the objective evidence. In the circumstances, while I may entertain some misgivings about the propriety of certain aspects of the appellant’s conduct, the convictions were plainly unsafe and had to be overturned. It follows inexorably from this that the appellant is not guilty of the Charges and the appeal must accordingly be allowed. 98     The Prosecution’s case is only one side of the story; our adversarial system requires and ensures that the defence be fully ventilated should one exist. In each and every case, it is the constitutional role of the judges to carefully and dispassionately evaluate the deficiencies of the Prosecution’s and/or the Defence’s case theory on the sole basis of legal proof and not mere suspicion or intuition. “The search for truth is a search for epistemic justification for belief in the disputed propositions of fact.” (Prof Ho Hock Lai,A Philosophy of Evidence Law: Justice in the Search for Truth(Oxford University Press, 2008) at p 84.) The question for the court in every case is not whether it suspects the accused has committed the crime but whether the Prosecution has proved beyond any reasonable doubt that he has indeed committed it. It is trite that courts can never convict on the basis of suspicion and/or intuition. Such is the conclusion demanded by and enshrined in that cardinal principle, the presumption of innocence, upon which is founded the most elemental rule of the criminal justice system: that the Prosecution must establish guilt beyond any reasonable doubt. Objective and not subjective belief is the essential touchstone of guilt, and there is simply no place for subsequent speculation or implication that an acquitted accused may be “factually guilty”. Who makes that determination? The adversarial system that we have adopted requires the Prosecution to conscientiously and irrefutably ensure that an unbreakable and credible chain of evidence secures the guilt of the accused. It is not flawless in that perfectly proper prosecutions may sometimes fail because of unexpected frailties in the evidential links. Our system is, however, an eminently credible, pragmatic and effective one that tempers idealism with a healthy dose of realism. The rules are clear and precise, and neither the Prosecution nor the Defence can or should complain if they fail by them. By rigorously demanding and upholding exacting standards from both the Prosecution and the Defence alike, the courts are able to ensure that public confidence in our legal system does not falter. 99     Let me conclude by reiterating certain observations that I made inJagatheesan([72]supraat [61]): An accused is presumed innocent and this presumption is not displaced until the Prosecution has discharged its burden of proof. Therefore, if the evidence throws up a reasonable doubt, it is not so much that the accused should be given the benefit of the doubt [but] as … [that of] the Prosecution’s case simply not being proved. In the final analysis, the doctrine of reasonable doubt is neither abstract nor theoretical. It has real, practical and profound implications in sifting the innocent from the guilty; in deciding who should suffer punishment and who should not.The doctrine is a bedrock principle of the criminal justice system in Singapore because while it protects and preserves the interests and rights of the accused, it also serves public interest by engendering confidence that our criminal justice system punishes only those who are guilty. [emphasis added] 100  It remains for me to place on record my appreciation to counsel for the commendable industry they have so ably demonstrated in the preparation and presentation of their respective cases. While I have not accepted a number of points made by counsel, I have nevertheless found most of them helpful in arriving at my final determination. ________________ [note: 1]GD at [60], referring to notes of evidence (“NE) vol 2 p 604C.[note: 2]GD at [60], referring to NE vol 2 p 604D.[note: 3]Ibid.[note: 4]NE vol 2 p 716C.[note: 5]NE vol 2 p 715F.[note: 6]NE vol 4 p 1327E.[note: 7]NE vol 3 p 1152F."
    }
}