{
    "case_title": "Grays LLC v Law Society of Singapore",
    "ncitation": "[2008] SGHC 70",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The complaints": "4       The plaintiff’s complaint arose out of two letters of the respondents to the plaintiff dated 10 February 2006 and 14 February 2006 in connection with an action before the High Court in which GLLC acted for the plaintiff and TPC acted for the defendants. 5       The plaintiff’s letter of complaint dated 20 March 2006 came with an accompanying chronology. The letter read: This letter is by way of a written complaint about the conduct of 2 lawyers in private practice, namely Mr Mark Lim (“ML”) and Ms Leong Kit Wan (“LKW”), of M/s Tan Peng Chin LLC (“TPC”). GRAYS LLC (“Grays”) represent the Plaintiffs in Suit No. 24 of 2005/N (“Suit No. 24”), and TPC represent the Defendants. We feel that the conduct of these 2 lawyers has not been of a standard to be expected of members of an honourable profession, and officers of the Supreme Court. We are of the opinion that the conduct of the said lawyers has fallen below the standard prescribed by the Legal Profession (Professional Conduct) Rules (“LPPCR”), with particular reference to the following Rules: 1.      Rule 47. “An advocate and solicitor shall treat his professional colleagues with courtesy and fairness”. 2.      Rule 53A. “An advocate and solicitor shall not take unfair advantage of any person or act towards anyone in a way which is fraudulent, deceitful or otherwise contrary to his position as advocate and solicitor”. [Emphasis in the original] Since ML and LKW had joint conduct of Suit No. 24 for TPC, there are certain aspects of the Complaint which relate to either ML or LKW, or both, but we are unable to say who was primarily responsible. Our complaint concerns the following: 1.      Statements made in, and the background to, letters dated 10 February 2006 and 14 February 2006 written by TPC to us. These letters were copied to the learned Registrar, under the reference Suit No. 24. These letters would therefore have been passed to the Honourable Justice Lai Siu Chiu, who is presently about to render her judgment in the said Suit. 2.      In their Letter dated 10 February 2006 … TPC purportedly voiced allegations made by WordWave International Asia Limited (“WW”) to the effect that Grays had “misled” WW into providing copies of the transcripts of the trial of Suit No. 24, at a reduced rate. The clear implication of TPC’s 10 February 2006 letter was that Grays had improperly obtained a pecuniary advantage by deception. [Emphasis in the original] 3.      In their Letter dated 14 February 2006 … which was the 2ndletter TPC wrote to us that day, TCP [sic] alleged that we had obtained the said transcripts“surreptitiously”. This accusation was made in the face of our detailed explanation of the events, which proved that we had purchased the WW transcripts after fully informing WW of our status as the Plaintiffs’ solicitors, and that we had not made any mention of purchasing additional transcripts. [Emphasis in the original] 4.      We also refer in this complaint to thesubsequent correspondencebetween ourselves and TPC, much of which was also copied to the Court, and within whichcertain misleading and highly questionable statementswere made by TPC. [Emphasis added] Neither the “subsequent correspondence” nor the “misleading and highly questionable statements” were identified in the letter or in the submissions tendered in these proceedings.[note: 1] 6       At the commencement of the hearing of the suit, TPC’s clients arranged to purchase transcripts of the notes of evidence from Wordwave International Ltd (“WW”), but the plaintiff’s clients did not do that. At the conclusion of the hearing of the suit, when parties were ordered to make written submissions, GLLC approached TPC for the transcripts. A file note of TPC dated 2 February 2006 recorded that Mr Simon Dominic Jones (“SDJ”), a director of GLLC, offered to pay TPC half the cost to get the transcripts, and this was referred to in a letter from TPC to GLLC dated 6 February 2006, informing them that “our client has no objections making a copy of the transcripts available to you immediately upon your firm’s undertaking that it will pay half the cost (ie. $3,251.08), within 7 days of receipt of the transcripts.” 7       In the event, GLLC or its clients decided not to pay TPC half the cost for the transcripts and did not obtain the transcripts from TPC. Instead, it obtained the transcripts directly from WW, paying the rate of $639 at $1 per page charged by WW for additional copies. 8       Although two letters were the subject matter of the complaint, it is necessary to refer to some other letters to understand the events. In the letter of 10 February 2006 (the first letter complained of), the respondents stated: We understand from the Court’s agent, Wordwave International Asia Ltd (“Wordwave”) that you had contacted Wordwave on 3 February with an urgent request for “additional copies” of the transcripts. Wordwave has also indicated that they feel they were misled by you into providing a copy of the transcripts at the “additional copy rate”. Further, Wordwave has informed us that the Plaintiff is not willing to pay for half the costs of the transcripts. A copy of a fax from Wordwave to our firm dated 8 February 2006 confirming these matters is attached. We are of the view that the Plaintiff should pay for half the costs of the transcripts (i.e. $3,251.08) in accordance with the usual practice. Kindly therefore let us have the sum of $3,251.08 by 5 pm on 14 February 2006. All our client’s rights are reserved in the meantime. The attached letter of 8 February 2006 from WW stated: Grays Law contacted our office on 3 February with an urgent request for “additional copies” of the transcripts for the above trial, which we supplied to them, having agreed to charge them at the additional copy rate. It was our understanding from what they told us that they were merely orderingadditionaltranscripts, rather than original copies, and accordingly we feel that we were misled by them on this issue. [Emphasis in the original] On Monday, 6 February, our office contacted Grays Law to inform them that the fee for an additional copy of the transcript is based on the understanding that the parties concerned have jointly requested for the transcription previously; and that we will bill them 50% of the cost of producing the transcripts as we will require to reimburse your firm accordingly. Should they not agree to share the transcription costs with your firm, they should not be able to receive a copy of the transcripts. Their response was that they were not willing to pay half the costs and that they would return the transcripts to us today. However, they indicated that they had already made use of the transcripts in preparation for their submissions. 9       This letter brought a response from GLLC dated 13 February 2006. In the letter, GLLC referred to a telephone conversation between SDJ and ML: 8.      … on the morning of 2 February 2006, our Mr Jones telephoned your Mr Mark Lim to inquire, how much the Defendants had paid for these transcripts, and what sum they would require to make copies available to the Plaintiffs. At this stage, Mr Jones did not have the Plaintiffs’ instructions to make any such a purchase, but was simply asking if such an arrangement might be agreeable to the Defendants, and, if so, their asking price for copies of the transcripts. 9.      Mr Lim then informed Mr Jones that the Defendants had paid “between $6,000.00 and $9,000.00” for the transcripts, and that he should make a written request offering to pay 50% of the original purchase price for a copy. In view of the fact that the Plaintiffs’ Closing Submissions were due to be filed by 8 February 2006, Mr Jones asked if a response to any such written request could be given immediately, or at least the following day. Mr Lim replied that he could not say when a reply would be forthcoming, but we should send our request anyway. [Emphasis in the original] Going backwards in time, GLLC recounted that: 2.      Around 31 October 2005, the Plaintiffs’ former counsel, M/s Wee Swee Teow & Co (“WST”), contacted WW and were told that copies of the transcripts of the tape recorded notes of evidence of the trial would cost about $8.50 per page. The Plaintiffs considered that this was too expensive and also unnecessary for the preparation of oral submissions. They therefore instructed WST not to purchase the said WW transcripts, and to prepare the submissions using the verbatim notes of evidence as taken by WST at trial. 10     It is to be noted that although GLLC did not act for the plaintiff in the action in October 2005, SDJ was involved in the case at that stage as he was a member of Wee Swee Teow & Co at that time.[note: 2] 11     The respondents replied to this letter in its 14 February 2006 letter (the first of two letters of the respondents of that date and not the subject of the complaint) that: It is obvious from your letter that your client was well aware of the costs of the transcripts (ie. $8.50) as early as 31 October 2005. Our client has clearly indicated through our letters to the Registrar of the Supreme Court, which were copied to your client’s previous solicitors M/s Wee Swee Teow & Co, that they were reviewing the transcripts, yet your client did not make any request for copies of the same from our client. For the record, immediately following the telephone conversation between your Mr Simon Jones and our Mr Mark Lim on Thursday, 2 February 2006, we wrote to our client to inform them of your client’s request. We received our client’s instructions on Monday, 6 February 2006 … We wrote immediately to you to confirm that our client has no objections in providing your client a copy of the transcripts upon your client’s confirmation that it would pay half the costs of the transcripts. You replied on 7 February 2006 to confirm that your client no longer requires the transcripts. 12     When GLLC responded on the same day stating: The charge of $8.50 per page is quoted by WordWave (“WW”) in their website as being payment for a transcription service which includes “3 hard copies (one for the Judge andtwo copies for the parties)” … We were unaware of this fact until after you had accused us of “misleading WW”. [Emphasis in the original] The respondents then wrote their second letter of 14 February 2006 (the subject of the complaint) to say that: We are surprised that you claim to have been unaware that the transcripts provided by WordWave were at a discounted rate of S$1 per page, when, by your own admission, you were aware that the normal charges are $8.50 per page. We should also highlight that it is WordWave, clearly an independent and neutral party, which stated that they “feel that [they] were misled by [you].” We were not even aware of your communications with WordWave until we were contacted by them on 8 February 2006. At that time, we had not received your client’s Closing Submissions, and were not aware that you had access to the transcripts. [Emphasis in the original] The rest of your letter seeks to deflect attention from the simple issue of whether your client should pay for its share of the costs of the transcripts,which your client appears to have obtained surreptitiouslyand which your client has utilized. We do not intend to “litigate” on these irrelevant matters by correspondence. Suffice to say, we shall address these allegations in full if necessary. [Emphasis added]",
        "The reasons for the plaintiff’s application under s 96": "13     The plaintiff’s reasons for its application fell into two heads, (i) that the inquiry committee did not act fairly in the conduct of the proceedings, and (ii) that the finding of the inquiry committee was against the weight of the evidence. 14     The first head, that the inquiry committee did not act fairly, was divided into three sub-heads, (i) that the inquiry committee criticised the plaintiff, (ii) the inquiry committee failed to inform SDJ of the respondents’ written explanation, and (iii) the hearing was not conducted fairly.",
        "(i) The inquiry committee criticised the plaintiff": "15     The plaintiff submitted: 26.    … (T)he IC made several specific findings in its Report, which are highly critical of both the Plaintiffs and [SDJ]. These findings relate to professional competence, honesty and truthfulness and are therefore extremely serious matters. 27.    It is submitted that one conclusion which must inevitably be drawn from the Report is that, on the evidence before them, the members of the IC unanimously found that ML’s version of the telephone conversation he had with [SDJ] on 2 February 2006 was truthful, and correspondingly, that [SDJ’s] account lacked credibility.[note: 3] 16     The inquiry committee’s duty was to consider the complaint and the respondents’ response, and to decide if the complaint should be formally investigated by a Disciplinary Committee. In discharging that duty, the inquiry committee had to consider and evaluate the evidence presented and the conduct of the parties involved. In that process, the inquiry committee may accept one party’s account of the disputed issues over the other party’s. The rejection of the unsuccessful party’s versionper secannot be regarded as unfairness. 17     The plaintiff’s grievance was not limited to the rejection of the complaint, but to some highly critical findings it alleged the inquiry committee made against SDJ and GLLC. The criticisms by themselves cannot be a ground for applying for the appointment of a Disciplinary Committee to investigate the complaint. The primary question was whether the inquiry committee was right in its finding that no action be taken on the complaint. If the finding was wrong, then the plaintiff’s application will be granted, whether or not the criticisms were made. If the finding was correct, the criticisms cannot be a ground for allowing the application.",
        "(ii) The inquiry committee failed to inform SDJ of the respondents’ written explanation": "18The plaintiff acknowledged that a complainant has no right to an oral hearing before an inquiry committee and that it is within the inquiry committee’s discretion whether to hear a complainant.  Nevertheless, the plaintiff argued that: 33.    …(T)he wide procedural discretion of the IC is subject to one overriding requirement of natural justice, once the members had decided to call upon TPC to answer the Complaint, and had passed a copy to TPC under LPPCR Rule 86(6)(a) [correctly s 86(6)(a) of the Act]. … 39.    As advocates and solicitors of the Supreme Court, ML and LKW were automatically entitled to a reasonable opportunity to be heard, once they had received a copy of the Plaintiffs’ Complaint. 40.    While the IC was aware that [SDJ] is also a member of the Singapore Bar, he was not accorded the same opportunity to rebut the personal allegations made against him by TPC, despite the fact that he is a director of the Complainants in this matter. 19     This argument revealed a failure to distinguish the rights of a party complained against from the rights of a complainant. It is axiomatic that a party complained against has the right to know the complaint against him, and the right to defend himself, and these rights are incorporated in s 86(6) of the Act. 20     The plaintiff and SDJ were not parties complained against, and their rights and interests before the inquiry committee were fundamentally different from that of the respondents. It is telling that the plaintiff did not contend that the rules of natural justice or the Act and the rules made thereunder required that a respondent’s written explanation should be supplied to the complainant, because they do not. The inquiry committee has the discretion to disclose the whole or a portion of the written explanation to a complainant, but that is discretionary, and a complainant has no entitlement to it. 21     The plaintiff relied on SDJ’s status as an advocate and solicitor as a reason for him to be supplied with the respondents’ written explanation to enable him to rebut personal allegations against him. If there is such a right of rebuttal, that right should extend to all complainants. The plaintiff acknowledged that such a right does not extend to all complainants. The fact that SDJ is an advocate and solicitor cannot give him any additional entitlement that is not available to other complainants. In any event, there were no personal allegations made against SDJ in the written explanation. The respondents presented their account of the events, which differed in parts from the plaintiff’s account, but nothing in the explanation can be said to be a personal attack of SDJ.",
        "(iii) The hearing was not conducted fairly": "22     The plaintiff submitted: 46.    … (T)he IC appeared to have predetermined the issue of [SDJ’s] credibility as a witness prior to the 11 October 2006 hearing, without showing any interest in what he said … and that [PM] explicity stated that the evidence of [JJ] and [HH] was“irrelevant”, without asking either of them a single question, or even enquiring what their evidence was about.[note: 4][Emphasis in the original] 23     SDJ deposed in his affidavit filed in support of the plaintiff’s application that Mr Peter Madhavan (“PM”), the chairman of the inquiry committee was: 36. … very hostile to me personally without advising me of the reason for his attitude. In fact he fired questions at me by way of cross-examination, and made bare statements of fact, without explaining the context within which his questions were framed, or informing me why the IC were clearly very unsympathetic to our complaints, and was reluctant to hear supporting evidence adduced by the Plaintiffs’ witnesses. He elaborated that: 38. I recall that the first thing that PM said to me personally was a bare assertion that, on 2 February 2006, I had concluded an agreement with ML [Mark Lim] to purchase the WW transcripts at half the cost paid by TPC. 39. My reply was to the effect that this was certainly not the case, since I had no mandate from my clients … to pay half of the $6,000.00 to $9,000.00 … for the possible use of the transcripts for a very short period of time, and for a specific limited purpose. Moreover, I stressed to PM that ML had not even been able to confirm during our conversation that I would have use of the WW transcripts before my closing submissions were due to be filed on 8 February 2006. 40. … In any event, since the Plaintiffs’ summary of my conversation with ML on 2 February 2006 was certainly not denied in TPC’s reply to us dated 14 February 2006 … I was very surprised to hear PM directly contradicting my own evidence, without him informing me of the basis of his assertions. 41. At this point, PM simply moved on to another line of questioning. … 24     Two other members of GLLC also filed affidavits referring to the hearing before the inquiry committee. They were Mr Jayagobi Jayaram (“JJ”), an associate director of GLLC, and Ms Helen Ho (“HH”), the office manager of GLLC. 25     JJ in his affidavit also deposed that PM had made the assertion that there was an agreement to pay half the transcript charges, but HH made no mention of such an incident in her affidavit. (PM, in the hearing before me, testified that he asked SDJ if there was a concluded agreement, but he did not tell SDJ that there was a concluded agreement.) With regard to PM’s alleged hostility towards SDJ, JJ recalled that PM criticised SDJ for not obtaining the transcripts immediately when they were available after the trial in October 2005, and HH stated that PM criticised SDJ’s “past conduct regarding the trial notes”. It is significant that HH made no mention of any assertion of any agreement to pay the costs of the transcripts, and SDJ made no mention of the criticism of his failure to obtain the notes earlier. 26     The inquiry committee in its report did not find that there was any concluded agreement by the plaintiff to pay half the cost of the transcripts. In its report, the inquiry committee accepted as accurate a file note of ML of the telephone conversation of 2 February to the effect that SDJ had requested for the transcripts and said that his clients will pay half the cost of the transcripts, and ML informed him that he had to take his clients’ instructions on the request. 27     Against this background, two points can be made. First, whether there was no basis for PM to assert that there was a concluded agreement on 2 February 2006 that the plaintiff was to pay half the cost as that was not alleged by the respondents. Second, as the inquiry committee did not find that there was a concluded agreement to pay half the cost, it cannot be said to have treated the plaintiff or SDJ unfairly on this issue. 28     There was another grievance about the conduct of the hearing of 2 February 2006. SDJ also deposed in his affidavit of 3 April 2007 that: 45. … HH [Helen Ho], who was originally supposed to have misled WW by requesting copies of the transcripts at the “additional copy” rate, was told by PM that her evidence was “irrelevant” to the inquiry, and she was not asked a single question. [Emphasis in the original] This indicated that PM spoke directly to HH. This account is at variance with the account in SDJ’s subsequent affidavit of 14 August 2007 that: [A]t the conclusion of the hearing, I asked the Chairman whether the IC had any questions for HH and JJ, to which the Chairman replied that their evidence was “irrelevant”. [Emphasis in the original] indicating that PM was replying to a question from SDJ, and this later account was repeated by JJ and HH in their affidavits filed in support of this application. While nothing turns on whether the alleged remark was made to HH or to SDJ, the discrepancy showed that recollection of the events was inexact. 29     PM, in his affidavit filed in these proceedings on 25 June 2007 described the hearing thus: 7. I wish to categorically deny all the accusations, insinuations and suggestion of any bias and unfairness that SDJ had made against me and the other IC members. As far as I’m concerned, I ensured that the inquiry was conducted in a fair manner for all parties concerned. 8. The proceedings were conducted in compliance with the rules of natural justice. As this is an inquiry, the panel members and myself have appraised ourselves of the nature of the complaint and the response from the Respondents through the Bundle of Documents that were submitted to us prior to the hearing. The inquiry in the view of the members was really to clarify matters that were found in the written complaint and the Respondents’ reply. There were no cross-examinations undertaken by us as alleged. 9. I recall that at the commencement of the inquiry, I raised certain clarifications with the three witnesses for the complainants, namely SDJ, HH and JJ, and SDJ took it upon himself to answer all our inquiries. Both the other witnesses, namely HH and JJ, were passive observers. 10. After I had clarified matters with the complainant, in particular SDJ who was responding to our queries, I then asked the other members of the panel whether they had any other questions or clarifications from the complainants and as they had none, I then asked all the witnesses before us whether they had anything else to add. None of them responded with any questions and I therefore thanked them for their attendance. I recall clearly that SDJ then stood up to pack his files and he asked me “Is that all? Is that all you are going to ask us?” I said “Yes, as we only inquire into what is relevant”. I do believe that both HH and JJ, who alleged in their respective affidavits that I said that “their evidence is irrelevant” must have misheard me. I said “what is relevant”, rather than “irrelevant”. Both HH and JJ, I recall, remained passive throughout the entire inquiry and seemed to have left entirely to SDJ to respond to queries from the panel. 11. The complainants have alleged that I was aggressive and conducted the inquiry in an accusatorial manner. I really do not know how they came to such a conclusion as I believe that members of the panel and myself conducted the inquiry in a manner which fellow lawyers would have been comfortable with. I also believe that all the courtesies have been extended to them. 30     There is no significant difference between the accounts of SDJ and PM. It is evidence that PM and the other members of the inquiry committee did not question HH and JJ. By either account, PM indicated that it was not necessary to question them. The question is whether the plaintiff has reason to feel aggrieved that the inquiry committee did not question JJ and HH. JJ was not mentioned in the letter of complaint and the chronology. In the circumstances, the inquiry committee would not know if he had any role in the events in question. As for HH, it was mentioned in the chronology that she had dealt with WW in the acquisition of the transcripts. There was no mention that she had any dealings with TPC or the respondents, as indeed, she had not. SDJ, on the other hand, was shown to have been actively engaged with TPC and WW over obtaining the transcripts. 31     It is well established that the inquiry committee was not obliged to hear JJ or HH or anyone from GLLC. The Court of Appeal has made clear inSeet Melvin v The Law Society of Singapore[1995] 2 SLR 323at 341 that: The concept of fairness in IC proceedings need not extend to affording the complainant a right to an oral hearing. endorsing an earlier finding by Chan Sek Keong JC inYusuf Jumabhoy v The Law Society of Singapore[1988] SLR 236to that effect. 32     When an inquiry committee feels that there is a need to seek clarification on a complaint or a written explanation, it can seek the clarification. In this case, PM had raised with SDJ matters relating to the purchase of the transcripts. SDJ felt that PM was hostile towards him. He complained that PM made “bare statements of fact, without explaining the context within which his questions were framed.” 33     When SDJ was questioned by counsel for the Law Society during the hearing before me, he elaborated: What happened was, Mr Peter Madhavan, the chairman addressed the first question to me by name, which was a---a---a statement which I won’t go into, he continued with some follow-up questions and then everything was addressed to me, sometimes by name, sometimes “You”, “You did this”, “you should have known”, “You, you, you” and the “You” was always me “Simon Jones” nothing to do with Ms Ho or Mr Jayaram. I didn’t take it upon myself. Everything was directed at me.[note: 5] and All the points were raised by Mr Madhavan in---in either a statement form or there--- there must have been some questions, they can’t remember any specific question. So he was running the show, so when he said to me, “Have you anything to add?” Seeing he’d just been criticising me for 10 to 15 minutes non-stop, I just said, “No”. Because I was almost shell-shocked at the time. Then, I said to him, “Aren’t you going to ask them anything?” Because I understood he was running it as a---as---as asking what he wanted response on---not giving us a chance to present our case. He hadn’t given me any chance to present anything up to that point.[note: 6] and Mr Madhavan, he demote me, speaking to me, when he---when he clarified, he said that---that the---the propriety rights to the WordWave transcripts had passed from WordWave to Tan Peng Chin and WordWave had no---no right to sell to us and I should have known that. That’s what his position was and I didn’t feel like debating it with him.[note: 7] 34     SDJ’s account of the exchanges does not give the sense that PM made accusations against him or forced him to make admissions against his will. While he found PM’s manner brusque, SDJ did not complain that he was not allowed to respond to the issues raised. It is evident that while SDJ was surprised and upset by the tone and pace of the questioning, PM’s intention was to clarify some issues with him. 35     It must be kept in mind that the inquiry committee’s duty was to consider the plaintiff’s complaint against the respondents in connection with the two letters. The focus of the inquiry committee was to look into the circumstances in which the two letters were written, and decide whether to transfer the matter to a Disciplinary Committee for a formal investigation. In those two letters, the respondents were referring to information they received from WW in the letter of 8 February from WW to TPC, and they did not make any allegations of their own regarding the communications between SDJ, JJ, HH or any other member of GLLC and WW on the request for the transcripts. 36     Seen from this standpoint, there was no strict necessity to question SDJ, JJ or HH on their dealings with WW, because the respondents had written to the plaintiff solely on the basis of WW’s account of the events between WW and the plaintiff. The respondents had no direct knowledge of the communications between the plaintiff and WW. 37     The plaintiff evidently had a different perception of the hearing of the inquiry committee. It was anxious to justify and defend its dealings with WW and to put forward its case on the complaint. If it had attended the hearing with the understanding that the inquiry committee was not investigating into WW’s letter, or GLLC’s dealings with WW, but was inquiring into the respondents’ two letters, it would see that evidence from JJ and HH with regard to the application to WW had little or no bearing on the issue.",
        "Whether the inquiry committee’s conclusion was against the weight of the evidence": "38     The plaintiff took objection to the respondents’ letter of 10 February 2006 which stated “Wordwave has also indicated that they feel they were misled by you into providing a copy of the transcripts at the “additional copy rate”. The respondents had forwarded a copy of WW’s letter to them dated 8 February 2006 where WW had stated, “we feel that we were misled by [the plaintiff] on this issue.” 39     Factually, the respondents’ letter was quite unobjectionable insofar as it was only conveying WW’s account of the events relating to GLLC’s application for the transcripts. When the inquiry committee concluded that there was no necessity to send this complaint to the Disciplinary Committee for formal investigation, there is no basis for the plaintiff to complain that the inquiry committee’s finding was made against the weight of the evidence. 40     With respect to the letter of 14 February 2006 that the plaintiff complained of, the issue was whether that statement “your client appears to have obtained surreptitiously” the transcripts at the rate charged for additional copies was in contravention of Rules 47 and 53A. This letter was written against the background that SDJ knew as far back as October 2005 that the charge for the transcripts was $8.50 a page and the evidence of the respondents that the issue of the plaintiff’s clients paying half the cost of the transcripts was raised on 2 February 2006. 41     The letter did not add to the earlier letter of 10 February except that in the earlier letter, the allegation of misleading came from WW and in the letter of 14 February 2006, the respondents alleged that the transcripts were surreptitiously obtained at the lower rate. 42     The plaintiff in its letter of complaint laid emphasis on the fact that: … in the face of our detailed explanation of the events, which proved that we had purchased the WW transcripts after fully informing WW of our status as the Plaintiffs’ solicitors, and that we had not made any mention of purchasing additional transcripts. 43     This calls for a reference to the “detailed explanation” in GLLC’s letter of 13 February 2006, portions of which have been set out at [9] hereof. In the letter, the plaintiff enclosed copies of emails exchanged between it and WW over the period 2 February to 6 February 2006 relating to GLLC’s request for the transcripts from WW. The exchange enclosed to GLLC’s letter ended with an email from WW to the plaintiff dated 6 February 2006: This is with reference to the above-mentioned matter for which we sent a copy of the transcripts to your office upon your request on Friday, 03 Feb 06, and quoted at the fee of $1.00 per page based on the fees for additional copies of the transcripts. Kindly be informed that the abovefee of $1.00 per page for additional copies of the transcripts is applicable only if the party had initially placed a request for the transcripts. [Emphasis added] Our records retrieved show that M/s Tan Peng Chin LLC was the only party that initially placed a request for the transcription for this matter and they paid the full cost (S$6,102.54) for transcribing the court hearings. As M/s Wee Swee Teow & Co did not request for transcription for this trial previously, therefore subsequent parties who request for the transcripts will have to share the costs. This being the case, we regret to advise that the total amount payable for the transcripts for your party is $3,051.27, being 50% of the total amount paid by M/s Tan Peng Chin LLC. We shall reimburse this amount of $3,051.27 to M/s Tan Peng Chin LLC. Please do not hesitate to call us if you have any questions. We sincerely apologised for the inconvenience caused. 44     When WW supplies transcripts, it charges rates between $8.50 per page to $13, depending on the turnaround time for their production, and it charges a standard rate of $1 per page for additional copies. In this case, it charged TPC $8.50 a page for the first three sets of transcripts (two for the parties and one for the judge), which is the rate for a turnaround of five working days. 45     When the respondents wrote the letter of 14 February 2006, they had WW’s email of 6 February 2006 and the letter of 8 February 2006, stating that WW felt that the plaintiff had misled them, and they received from the plaintiff a copy of WW’s email of 6 February 2006 wherein WW had informed the plaintiff that it should be paying $3,051.27, half the full cost for the transcripts instead of $639 on the discounted rate for additional copies. As GLLC had not purchased the transcripts itself or with TPC, it was not entitled to purchase them as additional copies at the reduced rate. 46     How would the respondents have understood the two communications from WW? WW had told the plaintiff that it should be paying for half the transcript cost, and they told the respondents that GLLC had requested foradditional copiesof the transcripts. 47     Against this backdrop, the respondents in their letter of 14 February 2006 reiterated that “the simple issue of whether your client should pay for its share of the cost of the transcripts, which your client appears to have obtained surreptitiously and which your client has utilized.” When the respondents wrote the letter of 14 February 2006, there was indeed an issue between WW and the plaintiff, and WW had complained of being misled by the plaintiff. Although the word “surreptitiously” was not used by WW, it was clear that WW did not consider the plaintiff was forthright when it requested for additional copies. So, when the respondents wrote the letter of 14 February 2006 as a follow-up to the letter of their letter of 10 February 2006, they shared WW’s view of the transaction. In addition to that, it bears remembering that the letter was written against the background that the plaintiff and its clients knew that they had to pay half the full cost for the transcripts if they wanted to get the transcripts from TPC. 48     In fact, WW had written again to the plaintiff and the respondents on 16 February 2006 that “(w)e … stand by our comment that we feel that we were misled by Grays …”. While this letter came after the respondents wrote their letter of 14 February 2006, it was received by the plaintiff before it made its complaint against the respondents, and this letter is relevant in the evaluation of the merits of the plaintiff’s complaint against the respondents. 49     Was the plaintiff justified in complaining that the respondents had contravened Rules 47 and 53A when they wrote the letters? The inquiry committee came to the conclusion that it was not. I find that the plaintiff has not shown that the conclusion was made against the weight of the evidence. 50     The plaintiff also complained over the fact that the two letters were copied to the Registrar of the Supreme Court. The plaintiff accused the respondents of doing that with the intention to prejudice the plaintiff or its client in the eyes of the court. The plaintiff should have sufficient faith that no court is likely to be influenced by a dispute over the payment for transcripts. The charge was unjustified because the respondents did not copy the letters to the court to complain, but had forwarded them with the notation “for your information and guidance, if appropriate”. Insofar as the cost of the transcripts could be an element of the cost of the action, the respondents cannot be said to have acted unprofessionally by sending the copy of the letter to the Registrar for the purposes stated.",
        "Conclusion": "51     I agree with the inquiry committee’s and the Council’s finding that the plaintiff’s complaint should not be forwarded to a Disciplinary Committee for investigation. The plaintiff’s application is dismissed with costs. ________________ [note: 1]see Plaintiff’s Submissions, para 4[note: 2]Chronology/Comments of the Plaintiff, para 7[note: 3]Plaintiffs’ Submissions, paras 26 and 27[note: 4]Plaintiffs’ Submissions, para 46[note: 5]Notes of Evidence page 41[note: 6]Notes of Evidence page 43[note: 7]Notes of Evidence page 44"
    }
}