{
    "case_title": "Wing Hak Man and Another v Bio-Treat Technology Ltd and Others",
    "ncitation": "[2008] SGHC 165",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Background facts": "4       Wing is the founder of Bio-Treat. Wing was the Executive Chairman, the Non-Executive Chairman as well as the Executive Director of Bio-Treat until October 2006. Wing was also the sole owner of Fullway Group Limited (“Fullway”), a company incorporated in the British Virgin Islands (“BVI”). Fullway was the corporate vehicle used by Wing to hold 289,050,000 (37.39%) ordinary shares in Bio-Treat. Yiu is Wing’s wife. She was the sole owner of Star Choice International Limited (“Star Choice”), a company incorporated in the BVI which Yiu used to hold 39,808,000 (5.15%) ordinary shares in Bio-Treat. 5       Bio Treat is a company incorporated in Bermuda on 22 August 2003. On 16 February 2004, the company was listed on the Main Board of the Singapore Stock Exchange Securities Trading Limited and its shares were and are still traded in Singapore. The business and operations of the company, however, are wholly in People’s Republic of China. Bio-Treat has described itself as one of China’s leading companies in the development and application of biotechnology for the treatment of waste and wastewater. According to the Statement of Claim, Bio-Treat is managed from its office in Hong Kong Special Administrative Region (“Hong Kong”) by the other three defendants. At all material times, Wing was based in Bio-Treat’s Shanghai office. D2 was an independent director of Bio-Treat. He was a member of the Nominating Committee as well as the Remuneration Committee of Bio-Treat until his resignation on 31 July 2007. He is a lawyer by profession. D4 is an independent director of Bio-Treat. Kwok, who is an accountant, is the present Chairman of the Audit Committee of Bio-Treat. He is also a member of the Nominating and Remuneration Committees of Bio-Treat. For completeness, I should mention that at the time of the hearing of the plaintiffs’ appeal and the stay applications, the third defendant, Dennis Chan Kong (“D3”), had not been served with legal process. D3 is the Chief Executive Officer and Executive Director of Bio-Treat. He was appointed a member of the Remuneration Committee on or about June 2006.",
        "The claim in conspiracy by unlawful means against the defendants": "6       This case is quite clearly pleaded as an unlawful means conspiracy. The foundation of the conspiracy claim is that the defendants conspired to injure the plaintiffs by the unlawful means of fraudulent misrepresentations and those misrepresentations caused them damage. It was alleged that Wing was fraudulently misled and induced into signing documents purportedly to set up the Wing Family Trust. Reliance was also placed on other specific categories of unlawful acts pleaded in paragraphs 12 and 21 of the Statement of Claim. They include: (i) the incorporation of a web of BVI companies as the means and conduit for the fraudulent transfer and/or divestments of the plaintiffs’ shares in Bio-Treat held through Fullway and Star Choice; (ii) the allegation that the defendants wrongfully and dishonestly wrested control of the plaintiffs’ shares in Bio-Treat by fraudulently transferring them to other BVI companies and then selling them and/or fraudulently transferring the shares first in the open market on or about 19 September 2007 and then to Dongguan Baosheng Environmental Investment Co Ltd (“Dongguan Baosheng”) through Precious Wise Group Limited on or about 28 September 2007; (iii) the allegation that the defendants conspired to and did lodge false and/or misleading announcements on the Singapore Stock Exchange (“SGX”) to mislead the general public as to the state of affairs of Bio-Treat; (iv) the allegation that the defendants fraudulently induced Wing to “sell” some of his shares in Bio-Treat to pay compensation to key employees affected by the cancelled option programme; and (v) the allegation that the defendants fabricated and/or orchestrated Wing’s resignation as Executive Chairman, Non-Executive Chairman and Executive Director of Bio-Treat to hamper or impede his ability to investigate the fraudulent share transfers. 7       The aforementioned categories of unlawful acts are set out one by one in detail below (see [8] to [15]). Notably, the wrongdoings were pleaded as an ongoing overall conspiracy that was joined by the various defendants at unspecified times ranging between May 2005 and September 2007. Pausing at the alleged wrongdoings, by way of comment, even though the plaintiffs may in a proper case sue, for example, Bio-Treat in its own capacity, the act in question will not serve as “unlawful means” for the tort of conspiracy unless the plaintiffs can demonstrate that the individual act was performed in concert. In other words, whilst a party may join in the execution of the conspiracy at a different time and may not be exactly aware of what the other conspirators have actually agreed to do, to be liable for the tort of conspiracy, the party in question, nonetheless, must be sufficiently aware of the surrounding circumstances and share the same objective as the others (seeOCM Opportunities Fund II, LP and others v Burhan Uray (alias Wong Ming Kong) and Others[2004] SGHC 115at [49] (“OCM Opportunities”)). In the present case, the shared objective was to deprive the plaintiffs of their shares in Bio-Treat and the proceeds from any related sale of the shares. The loss to the plaintiffs was stated to be in excess of S$400 million. 8       I begin with the misrepresentations made by D2. The claim against the defendants stemmed from the setting up of a trust known as the Wing Family Trust. The trustee of the Wing Family Trust is a New Zealand company called Wing Enterprise Trustee Company Limited. It was alleged that the defendants fraudulently incorporated the trustee company without the plaintiffs’ consent or agreement. The unlawful means was the making of false representations to Wing in the following circumstances. On or about May 2005, D2 raised to Wing the idea of setting up a family trust which would hold the plaintiffs’ shares in Bio-Treat for Wing and his family. On or about 7 May 2005, at the Dynasty Club in Wanchai, Hong Kong, Wing signed the documents required to set up the trust relying on D2, and one Tan Siok Chin, who was then Bio-Treat’s company secretary, to translate and interpret the relevant documents. He did as he was told and signed at the places indicated in the documents. On or about 27 October 2006, Wing apparently learned that the Wing Family Trust was set up from an SGX announcement dated 9 May 2005. The news must have been shocking as D2 had allegedly represented to Wing that Yiu’s signature was required for the execution of the documents setting up the trust and Wing had not informed Yiu about the trust as he knew she would be against the idea. On her part, Yiu claimed that she did not sign any documents relating to the Wing Family Trust. 9       Pursuant to the Wing Family Trust, Wing purportedly gave up the entire issued capital of Fullway, comprising one ordinary share, to Energy Castle Limited, a BVI company. Similarly, Yiu purportedly gave up the entire share capital of Star Choice, comprising one ordinary share, to Herofaith Limited. However, the shares in Bio-Treat remained registered in the names of Fullway and Star Choice. Pausing here at the transfers, it is the plaintiffs’ case that Yiu’s signature on the documents were forged or tampered with, and/or alternatively, the defendants had fraudulently misled Wing into believing that both his and his wife’s signatures were required for the trust to be set up.[note: 1]Wing claimed that his signature on the Notice of a Substantial Shareholder’s Interests/Change in Interests/Cessation of Interests dated 7 May 2005 (“the Notice of 7 May 2005”) was forged and/or tampered with.[note: 2]Returning to the ownership change, this change coupled with the setting up of the Wing Family Trust led to the following results. Wing Enterprise Trustee Company Limited holds 100% of all the shares in Key Advance Limited, a BVI company, which in turn now holds 100% of the shares in the capital of Energy Castle Limited and Herofaith Limited. Energy Castle Limited holds 100% of all shares in the capital of Fullway while Herofaith Limited holds 100% of all shares in the capital of Star Choice. To reiterate, it is the plaintiffs’ case that the Wing Family Trust and the BVI corporate entities like Energy Castle Limited, Herofaith Limited and Key Advance Limited were used to facilitate the fraudulent transfer of the plaintiffs’ shares in Bio-Treat, and to take control of the plaintiffs’ shares and finally to dishonestly benefit from the proceeds of any sale and/or divestment of the shares at will.[note: 3] 10     Moving on to D4’s role in the alleged conspiracy, it is the plaintiffs’ pleaded case that “due to [Kwok’s] involvement in the web of companies, [Kwok] plays a major role in the Conspiracy.”[note: 4]Of significance is his connection with the corporate directors of Fullway and Star Choice who are Intersmart Profits Limited and Winning Faith Limited. The plaintiffs’ plea against D4 is that he is a director and shareholder of Lam, Kwok, Kwan & Cheng CPA Limited which is the holding company of the corporate directors. It is also their pleaded case that D2’s firm J Chan, Yip, So & Partners acted as company secretary to some of the BVI entities including Fullway and Star Choice “in order to facilitate the fraudulent transfers”.[note: 5] 11     This leads me to the SGX announcements. The plaintiffs’ plea in the Statement of Claim is that D3 was responsible for the SGX’s public announcements (including the false and misleading ones) and it was D3 who participated in the conspiracy by lodging the inaccurate and misleading SGX announcements on the fraudulent share transfers. Specifically against Bio-Treat, the plaintiffs’ contention is that the announcements and notices submitted by the company were fraudulent because the alleged share transfers never took place. The SGX announcement of 9 May 2005 to announce the plaintiffs’ purported transfers of shares in Bio-Treat from Fullway and Star Choice to Energy Castle Limited and Herofaith Limited respectively was “a guise to mask the transfer of shares with credibility”.[note: 6] 12     The next unlawful act in the conspiracy to defraud the plaintiffs was the sale of the shares in September and October 2007. On 19 September 2007, Fullway sold 10,451,754 shares in Bio-Treat in the open market at an average price of SGD 0.8685.[note: 7]Notice of the sale was given by the corporate directors of Fullway in a letter dated 20 September 2007 to Bio-Treat at its office in Hong Kong. Notably, Fullway’s letter of 20 September 2007 was signed by two directors of Intersmart Profits Limited, Tang Ming and Cheng Dong Long who are based in China. With the sale, Fullway’s shareholding dropped to 29.6% of the share capital in Bio-Treat. That led to the issuance of the Notice of Change in Substantial Shareholding Interest dated 20 September 2007 which was signed by Tang Ming on behalf of Intersmart Profits Limited and Cheng Dong Long on behalf of Winning Faith Limited. The SGX announcement of 21 September 2007 was lodged by D3 on behalf of Bio-Treat. 13     A further sale of 262,523,436 shares in Bio-Treat (representing 29.6%) was made by Key Advance Limited to Precious Wise Group Limited through its acquisition of all the shares in Energy Castle Limited. This acquisition by Precious Wise Group, a wholly owned subsidiary of Dongguan Baosheng gave the latter an indirect interest in the 262,523,426 shares. The SGX announcement relating to this acquisition was lodged by D3 in October 2007. 14     In relation to Wing’s sale of 50 million shares to purportedly compensate the key employees affected by the cancelled option programme which was announced on 22 December 2005, the pleaded case is that as part of the conspiracy, the defendants induced Wing to “sell” 50 million shares in Bio-Treat by falsely representing to Wing that he would receive part of the sale proceeds from the sale of the shares. The conspiracy as alleged was to defraud Wing of the proceeds of the sale of the shares. On 16 January 2006, D3 made an SGX announcement and issued a press release which announced Wing’s sale of 50 million shares and the distribution of part of the proceeds to compensate key employees. Wing claimed that he did not receive any part of the sale proceeds, and the key employees had also denied receiving any compensation. It was alleged that D2 and D4 were or must have been the intended beneficiaries of the alleged compensation from the sale proceeds. 15     Finally, as for Wing’s purported resignations, Wing claimed that he did not agree to relinquish his positions and maintained that his purported resignations as Executive Chairman, Non-Executive Chairman and Executive Director of Bio-Treat were fabricated and/or orchestrated to impede his ability to detect and/or investigate the fraud and/or conspiracy perpetrated against him.[note: 8]There were two SGX announcements on these matters. The first was dated 10 February 2006 and it stated that Wing had relinquished his positions as Executive Chairman and Executive Director with effect from 10 February 2006. A further SGX announcement on 11 October 2006 related to Wing’s retirement as Non-Executive Chairman. Wing said that his letter of resignation as director of Bio-Treat was a forgery. He saw that letter on 27 October 2006 at the office of FMG Corporate Services Pte Ltd (“FMG”), the company secretary of Bio-Treat.",
        "Stay Applications": "16     I begin with some general observations. First, the parties named two jurisdictions, Singapore or Hong Kong, as theforum conveniensfor the resolution of the plaintiffs’ claims against the defendants. Second, the relevant substantive law is in all likelihood the same in both jurisdictions. There was no meaningful debate to the contrary. Third, the arguments mainly focused on Stage One of the test inSpiliada Maritime Corporation v Cansulex Ltd[1987] AC 460 (“Spiliada”). The plaintiffs had not by way of affidavit evidence sought or identified some procedural or other legitimate advantage to be found in one jurisdiction but not the other. For completeness, I should mention that after the hearing on 7 March 2008, counsel for the plaintiffs, Mr Adrian Tan, in his letter dated 17 March 2008 sought to introduce factors to satisfy Stage Two of theSpiliadatest. Principally, Mr Tan contended that the dispute centres on the particular procedures and regulations governing the Singapore investment market and for that reason, he submitted, the ends of justice require that the court dismisses the stay applications. Elaborating, he argued that the fraudulent notices and announcements targeted the Singapore investor. Shareholders and investors would have been affected by those fraudulent notices and announcements as a false market was created. Mr Tan also surmised that Bio-Treat’s reason for resisting proceedings in Singapore was to avoid prosecution under the Securities and Futures Act (Cap 289, Rev Ed 2006), if the plaintiffs’ case was proved. Mr Tan’s arguments are tenuous and unconvincing. Counsel for Bio-Treat, Mr Edwin Tong, rightly submitted that none of the points advanced in Mr Tan’s letter are supported by affidavit evidence. Not only are the provisions of the legislation referred to separate and distinct from the civil claims here, it is hard to imagine how the defendants would be able to avoid prosecution under the Securities and Futures Act by simply moving the litigation to Hong Kong. Lastly, in relation to the stay applications, it is also not disputed that the legal burden is on the defendants to satisfy the court that Singapore is not the natural or appropriate forum and that Hong Kong is the more appropriate forum for the trial of the action.",
        "Applying the Spiliada test - Stage One": "17     The main factors that are relevant to this case at the first stage of theSpiliadatest include the following (seeRickshaw Investments Ltd and another v Nicolai Baron von Uexkull[2007] 1 SLR 377at 15 (“Rickshaw Investments”) : (i) general connecting factors; (ii) the jurisdiction in which the tort occurred; (iii) the choice of law; and (iv) concurrent proceedings in another forum. (i) General connecting factors 18Bio-Treat is a company incorporated in Bermuda but its registered office is in Hong Kong.[note: 9]Although the shares of Bio-Treat are listed in Singapore, it has no office or operations in Singapore. As stated, its business and operations are in China. It is accepted that at all material times, D2 to D4 were in charge of the Hong Kong office which is responsible for the day-to-day management of Bio-Treat. Lau Cheuk Lun (“Lau”), the Chief Financial Officer and Company Secretary of Bio-treat deposed in his affidavit that, at all material times, all meetings of the Broad of Directors of Bio-Treat, Audit Committee, the Nominating Committee and the Remuneration Committee were held in Hong Kong and, occasionally, in China.[note: 10] 19     For the defendants, it was further pointed out that the plaintiffs are holders of Hong Kong passports and are resident in Shanghai. D2 to D4 are also holders of Hong Kong passports and are based in Hong Kong. Lau reconfirmed two things: First, the two Singaporean independent directors of Bio-Treat, Mr Lim Yu Neng and Ms Cheng Fong Yee, were appointed much later on 31 July 2007 after the alleged conspiracy. Second, the share transfer agent of Bio-Treat’s share registrar, the Bank of Bermuda Limited in Bermuda, had no management responsibilities which remained with D2 to D4 in Hong Kong. The share transfer agent was Boardroom Corporate & Advisory Services Pte Ltd (formerly known as Lim Associates (Pte) Ltd) (“Boardroom”). According to Lau, Boardroom acts on the instructions of Bio-Treat and its administrative responsibilities are principally: (i)     Keeping recordof the ownership of the shares of Bio-Treat; (ii)   Issuing and cancelling share certificates of Bio-Treat to reflect changes in ownership; and (iii)  Processing lost, destroyedor stolen certificates. 20     In addition, the corporate company secretaries appointed from time to time by Bio-Treat, namely FMG and Tricor Singapore Pte Ltd (“Tricor”), assisted the company in relation to corporate matters such as filing Bio-Treat’s audited accounts; preparing and facilitating Bio-Treat’s Annual General Meeting; maintaining and updating Bio-Treat’s statutory records and facilitating Bio-Treat’s announcements in relation to,inter alia, change of directors, auditors and company secretaries.[note: 11]Lau deposed that notices of substantial shareholder’s and/or directors’ interests in Bio-Treat’s securities or changes of interests were received in the Hong Kong office. This makes sense as Bio-Treat has no offices in Singapore. According to Lau, after receipt of the notices, Bio-Treat would make the SGX announcements which were either prepared by the Hong Kong office or the share transfer agents.[note: 12]The announcements made by Bio-Treat on SGXNET included the announcements made on 9 May 2005, 16 January 2006, 21 September 2007, 1 October 2007 and 10 October 2007. Attached to the SGX announcements were press releases issued under Bio-Treat’s letterhead with its address in Dongguan City, Guangdong Province, China. 21     It is also noteworthy that Fullway and Star Choice are BVI companies with a care of address in Hong Kong, namely 1502, Wing On House, 71 Des Voeux Road, Central, Hong Kong.[note: 13]The corporate directors of Fullway and Star Choice are Intersmart Profits Limited and Winning Faith Limited. The holding company of the corporate directors is Lam, Kwok, Kwan & Cheng CPA Limited and it is located in Hong Kong. D2’s law firm in Hong Kong is J Chan, Yip So & Partners and it allegedly acted as company secretary to Fullway, Star Choice and some BVI companies. 22     On the opposite end of the scale, are other factors which Mr Tan drew attention to in support of his submissions that Singapore is the forum with which this action has the most natural connection. They are: (a)    Bio-Treat’s disclosure obligations are governed by Singapore law and regulated by the SGX. (b)    All the accounts and records relating to the shareholding of Bio-Treat are kept in Singapore as its company secretaries, share transfer agent and branch register are in Singapore. Documents divesting Wing of his control of Bio-Treat were filed in Singapore. (c)    All Annual General Meetings were convened in Singapore. At the Annual General Meeting held on 30 October 2006, D2 and D3 as directors of Bio-Treat announced that Wing was no longer the company’s chairman as he had not attended any company meetings in 2006. (d)    Singapore law governs the transfer of the shares. 23     In my judgment, the Singapore connections highlighted by Mr Tan are not compelling given the nature of the dispute. I will deal with the governing law of the transfer separately (see [36] to [37] below). As I see it, the only factor of any relevant connection to Singapore is that the shares in Bio-Treat are listed in Singapore and the regulatory paper work to comply with the Listing Manual is done in Singapore. Significantly, the factors with a Hong Kong connection outweigh the Singapore factors on convenience. Amongst the connecting factors in favour of Hong Kong is the location of witnesses which I will come to shortly (see [39] to [43] below). (ii) Natural forum: Singapore or Hong Kong 24     The main focus under Stage One was the issue of the location of the conspiracy. It is common ground that the place of the tort isprima faciethe natural forum for determining the claim. Goff LJ inThe Albaforth[1984] 2 Lloyd’s Rep 91 at [96] observed: Now it follows from those decisions that, where it is held that a court has jurisdiction on the basis that an alleged tort has been committed within the jurisdiction of the court, the test which has been satisfied in order to reach that conclusion is one founded on the basis that the court, so having jurisdiction, is the most appropriate court to try the claim where it is manifestly just and reasonable that the defendant should answer for his wrongdoing. This being so, it must usually be difficult in any particular case to resist the conclusion that a court which has jurisdiction on that basis must also be the natural forum for the trial of the action. If the substance of an alleged tort is committed within a certain jurisdiction, it is not easy to imagine what other facts could displace the conclusion that the courts of that jurisdiction are the natural forum. 25     TheAlbaforthprinciple is well established and was recently approved and followed by the Court of Appeal inRickshaw Investments. From the point of view of Stage One, Andrew Phang JA at [40] observed: However, we must emphasise that the result that is arrived at through the application of theAlbaforthprinciple is only the prima facie position and/or a weighty factor pointing in favour of that jurisdiction….[B]ut this is only one of the factors to be taken into account in the overall analysis, albeit a significant one. 26     It must be remembered that this is a multi-party and multi-jurisdiction case. From the point of view offorum conveniensin relation to the question of whether the unlawful transactions pleaded involved, a conspiracy, the task at hand is to find the one single place where the whole conspiracy could be regarded as having been committed in substance. This is known as the “substance of the tort” test and, as to how this test is to be applied in the light of the plaintiffs’ pleaded case, Mr Tong referred to the case ofMetall und Rohstoff AG v Donaldson Lufkin & Jenrette Inc[1990] 1 QB 391 (which was overruled inLonrho Plc v Fayed[1992] 1 AC 448 on other aspects). The test requires the court, in deciding where the alleged conspiracy took place, to “look back over the series of events” constituting the elements of the tort and ask where in substance did the cause of action arise. Mr Tong submitted that applying the “substance of the tort” test, the alleged tort of conspiracy occurred in Hong Kong based on the plaintiffs’ pleaded case. 27     It seems to me that the question in each case must be to ascertain what the true object of the agreement entered into by the conspirators was. In that connection, one must look to the actual conduct which was contemplated by the conspirators. Mance J inGrupo Torras SA & Anor v Al-Sabah & Ors[1999] CLC 1469at 169 helpfully identified some of the factors the court takes into consideration in the substance of the tort test. They include the identity, importance and location of the conspirators, the place(s) of any agreement or combination, the nature and place(s) of the concerted action, the nature and place(s) of any unlawful act or means, the plaintiff(s)’ location and the place(s) where he or it suffered loss. 28     Mr Tong approached Stage One by drawing out the likely issues in the plaintiffs’ own pleaded case which he argued pointed to a conspiracy in Hong Kong. Counsel for D2, Mr Devinder K Rai, and counsel for D4, Mr Rajendran Kumaresan agreed and adopted the reasons advanced by Mr Tong in support of the contention that the natural forum for determination of the dispute with the plaintiffs is Hong Kong and not Singapore. The main reasons are as follows. First, the discussions to set up the Wing Family trust were held and the documents purportedly for that purpose were executed in Hong Kong. Both events took place on or about 7 May 2005. Second, the evidence in relation to the conspiracy, if there was a conspiracy at all, would be mainly acquired from individuals and entities in Hong Kong. Mr Tong explained that the various announcements on the SGX were lodged by Bio-Treat in compliance with the Listing Manual and they were not overt acts pursuant to the conspiracy as alleged by the plaintiffs. As such, Bio-Treat’s SGX announcements in Singapore had nothing to do with its role as a conspirator. In support of his submissions, Mr Tong explained that based on the plaintiffs’ pleaded case, the alleged conspiracy took place on or about 7 May 2005. Like everything else that happened after that date, the SGX announcement of 9 May 2005 was a consequence or outcome of the alleged conspiracy. It related to the change in the shareholder’s interest in Fullway and Star Choice. 29     In response, Mr Tan submitted that there is no way for the court to establish when the conspiracy was hatched. The various transactions identified in [8] to [15] were advanced as overt acts carrying out the conspiracy and from which the court is invited to infer agreement. He relied upon the following matters that took place in Singapore: (a)    Share scrips had to be physically delivered to the Central Depository Pte Ltd (“CDP”) in Singapore according to the CDP rules; (b)    Notice(s) of change in shareholding were lodged with SGX in Singapore; and (c)    Fraudulent announcements were made with SGX in Singapore. 30     The entire conspiracy, Mr Tan argued, was made up of a series of acts which included the continuing acts involving the SGX announcements. The principal acts committed by the defendants were at various times, namely on or around 7 May 2005, 19 September 2007 and 28 September 2007. The SGX announcements in Singapore were part of the conspiracy that included the making of false announcements on the SGX to mislead the general public as to the state of affairs of Bio-Treat.[note: 14]Wing claimed that much of the conspiracy in Singapore was “uncovered in Singapore vide the SGX announcements” that were lodged on behalf of Bio-Treat. Mr Tan concluded that the tort was committed in Singapore as the bulk of the overt acts of conspiracy which caused the harm took place in Singapore. 31     Mr Tan’s arguments are, on balance, not persuasive having regard to other matters. First and significantly, Mr Tan’s conclusion that Singapore was the place where the bulk of the overt acts which caused the harm took place contradicted Wing’s first affidavit filed on 20 January 2007 in support of the plaintiffs’ application to serve the Writ of Summons on D2 in Hong Kong. In his affidavit, Wing acknowledged that only a part of the conspiracy was committed in Singapore, that is to say “the false and/or misleading announcements on SGX in Singapore to mislead the general public as to the state of affairs of the 1stDefendant”. Mr Tong reminded the court that the plaintiffs’ own case asserts that their shareholding in Fullway and Star Choice were allegedly misappropriated at the time the relevant share transfers were effected on or about 7 May 2005 pursuant to the Wing Family Trust arrangements. Logically, the change of shareholders of the BVI companies, (ieFullway to Energy Castle Limited and Star Choice to Herofaith Limited), would have occurred before the Notice of May 2005. If that was the case (and the court adjudicating the tort has to resolve it), the SGX announcement of 9 May 2005 would have no part in procuring an event which was already in the past. As it was argued, the SGX announcements would be in compliance with the SGX regulations and were not overt acts from which the court is invited to infer agreement. 32     Second, as Mr Tong rightly contended, the allegation of fraud on the CDP account must be discounted as it was not an averment in the Statement of Claim. The pleadings made no reference to the CDP, and there was no plea of fraud on the CDP during the delivery of the physical share scrip. 33     With the factors referred to by Mance J inGrupo Torras SA & Anor v Al-Sabah & Orsat 169 ( see [27] above) in mind, the one single place where the whole conspiracy could be regarded as having been committed in substance, in my view, is Hong Kong. The heart of the alleged deception of the plaintiffs, if deception there was, must have taken place in Hong Kong. It was the place where D2 to D4 were all resident and is where for the most part they carried out their duties in connection with Bio-Treat’s Hong Kong office. It was the place where D2 through his law firm and D4 through his accounting firm had apparently enabled the shareholding of the BVI companies to change. 34     The objective of the conspiracy (if there was a conspiracy at all) was to unlawfully deprive the plaintiffs of their beneficial ownership of the shares in Bio-Treat. This could only be accomplished by means of misrepresentations to Wing as to the purpose of the Wing Family Trust and the requirements for setting up the trust. Such misrepresentations induced Wing and his wife to set up the trust in circumstances where no such trust would otherwise have been set up. Reliance, being the most significant element of the misrepresentation, was placed on the misrepresentations in Hong Kong. It was said that Wing would not have signed the papers had the truth been told. If anything, the common objective was pursued by providing documents to sign in Hong Kong. That had to be the mechanism for afflicting harm because the establishment of the Wing Family Trust had enabled Wing’s shareholding in Fullway to change to the ownership of Energy Castle Limited. I understand that Wing has alleged that his signature on the Notice of 7 May 2005 that advised the change of interest in relation to Fullway and Star Choice to Energy Castle Limited and Herofaith Limited pursuant to the Wing Family Trust was a forgery as he did not sign it 35     The desirability of a single trial taking place in Hong Kong is that the case of conspiracy against Bio-Treat, if such it was, can be fully determined there together with D2 and D4, bearing in mind the pleaded case that D2 to D4 were the operating minds in the management of Bio-Treat through their designations, involvement and/or control of various key committees in Bio-Treat. (iii) Choice of Law 36     Mr Tan relied uponInternational Credit & Investment Co (Overseas) Ltd and Another v Adham and others[1994] 1 BCLC 66for the proposition that where shares are concerned, the place in which the shares are situated will determine the applicable law. He argued that Singapore law is the applicable law as the shares that were taken away from the plaintiffs were the shares of a company listed and traded in Singapore. Mr Tan also citedEng Liat Kiang v Eng Bak Hern[1995] 3 SLR 97in support of the stay appeal. That case concerned an application for stay of proceedings on the ground that claims relating to shares in the Malaysian companies and land were situated in Malaysia. The plaintiffs relied on this case for the proposition that the Court of Appeal had said that the question whether the appellant would have committed a breach of Malaysian company law and also breach of the listing requirements of the Kuala Lumpur Stock Exchange was for the Malaysian courts to decide. Likewise, Mr Tan argued that should the plaintiffs succeed in their claims, an issue that would arise is whether Bio-Treat has committed any breach of the Singapore regulations and the listing requirements of the SGX, and this should be left to the Singapore court to decide. 37     As explained, this case is about false representations made in Hong Kong. Reliance was placed on the representations in Hong Kong and loss was caused there when Wing signed some documents that changed the shareholding in Fullway and Star Choice. The applicable law in relation to the tort in question is the law of Hong Kong. The issues of compensation will be governed by the law of Hong Kong. I agreed with Mr Tong thatEng Liat Kiang v Eng Bak Hernis distinguishable on the facts. Mr Tong rightly pointed out that the relief that is sought in the Statement of Claim is to restore to the plaintiffs’ ownership of the shares in Fullway and Star Choice, and that has to do with the BVI share registers of the respective BVI companies and probably the corporation laws of BVI, rather than Singapore law. As for the sale of the shares in September and October 2007, there is little information on the transactions before the court. Suffice it to say that a claim for damages is the only remedy by virtue of s 130J of the Companies Act (Cap 50, 2006 Rev Ed). The buyer’s title is unaffected and the party perpetrating the fraud has to pay damages (seeWalter Woon on Company Law, 3rdEdition, Sweet & Maxwell 2006 at para 15.41). On the pleaded facts as examined earlier, I did not consider the sale of the shares in September and October 2007 as compelling connecting factors that dictated a different conclusion in favour of Hong Kong. 38     Another point advanced as a choice of law question by Mr Tan in his written submissions was this: Would the Hong Kong Courts be able to rule and decide on issues relating to the Singapore Statutes and regulations and/or the Company’s obligations under Singapore laws and regulations? Mr Tong rightly submitted that Bio-Treat’s disclosure obligations are governed by Singapore law and regulated by the SGX but the disclosure obligations and SGX regulations are not the substantive issues in dispute. Besides, Mr Tong has not challenged any of the announcements as the SGX announcements were lodged in compliance with the SGX listing obligations. (iv) Witnesses and documents 39     The list of potential witnesses was included in Mr Tong’s written submissions. The witnesses for Bio-Treat, D2 and D4 are located in Hong Kong and China. The plaintiffs themselves are holders of Hong Kong passports and resident in Shanghai. D2 to D4 are resident in Hong Kong. D2’s law firm J Chan, Yip So & Partners is in Hong Kong and it was company secretary to the BVI companies. D4’s accounting practice of Lam Kwok Kwan & Cheng CPA Limited is based in Hong Kong. The two directors of Intersmart Profits Limited and Winning Faith Limited are Tang Ming and Chen Dong Long who are resident in China. Besides, the key employees involved in the cancelled option programme are resident in China. Key Advance Limited, Energy Castle Limited and Herofaith Limited are BVI companies. Precious Wise Group Limited and Dongguan Baosheng are based in China. On the issue of Wing’s resignations, Mr Tong explained that they were raised in the meetings of the board of directors and relevant committees of the company held mostly in Hong Kong or occasionally in China. Furthermore, the overwhelming majority of the attendees at the meetings of the board and committee members and who are likely to give evidence on the discussions regarding Wing’s resignations are resident either in Hong Kong or China. 40     Of the Singaporean witnesses, the plaintiffs have named Tan Siok Chin and Maureen Low. The plaintiffs acknowledged that Tan Siok Chin has been cooperative thus far and it was not suggested that she would cease to be cooperative. Tan Siok Chin’s name also appeared in Bio-Treat’s list of witnesses. As for compellability of a witness, this factor was considered in Good Earth Agricultural Co Ltd v Novus International Pte Ltd[2008] 2 SLR 711under Stage One. The compellability of Tan Siok Chin as a witness was raised by Mr Tan but it is a factor that affects both sides if the proceedings are in Hong Kong. Maureen Low is from FMG and it was she who showed Wing his purported resignation letter as director of Bio-Treat. That letter was faxed to Maureen Low on 27 October 2006 from Bio-Treat’s Hong Kong office. On the plaintiffs’ own case, the resignation letter and the forgery must have been done in Hong Kong. In any case, Wing’s resignation is not disputed by the defendants. The plaintiffs have not identified the members of the Inquiry Committee (“IC”) and the Independent Review Task Force (“IRTF”) and it is unclear how their evidence would have a bearing on the pleaded case. Mr Tong said that, at the time the IC and the IRTF were convened to investigate the plaintiffs’ claims, the shares of Fullway, Star Choice and the shares of Bio-Treat were already transferred to third parties, and Wing was no longer a director of the company. Wing’s explanation was that the evidence of the IC was relevant as it centres on Bio-Treat’s position, namely the IC had investigated Wing’s claims and had dismissed them. Rightly or wrongly, their findings are separate and do not bind the courts. 41     In the circumstances, in terms of expense and convenience for the purposes of calling witnesses, Hong Kong is obviously the more convenient forum since only two witnesses from Singapore need to travel to Hong Kong as compared to the larger number of people (including the plaintiffs and Hong Kong defendants) that have to travel to Singapore. There is one other consideration which supports a stay and it is this. D2 and D4 as the directors of Bio-Treat are accountable to the shareholders and it is likely that they will be testifying on behalf of Bio-Treat as well as in their own personal capacity. The presence of Bio-Treat in Singapore is a neutral factor. 42     In relation to documentary evidence, the plaintiffs argued that most of the documentary evidence on the transfer of shares in Bio-Treat was in Singapore. The share transfer forms and the Notices of Change in a Shareholders’ Interest are located in Singapore because the corporate company secretaries appointed by Bio-Treat, namely FMG and Tricor, and share transfer agent are in Singapore and they will have records of these documents. I did not attach much weight to the plaintiffs’ claim about Singapore being the more appropriate forum in terms of location of documents. On the contrary, the material paper trail is most likely to be located in Hong Kong. I accepted Mr Tong’s submissions that any information and/or documents in the possession of the Singapore company secretaries and the share transfer agent would be available from Bio-Treat’s office in Hong Kong. In the case of D2 to D4, documents in their possession are likely to be located in Hong Kong. The documentary evidence included documents signed and executed in Hong Kong in relation to the setting up of the Wing Family Trust; documents relating to the appointment of Intersmart Profits Limited and Winning Faith Limited as directors of Fullway and Star Choice; documents relating to the relationship between J Chan, Yip, So & Partners and the BVI corporate entities; and documents relating to the relationship between Lam, Kwok, Kwan & Cheng CPA Limited, Intersmart Profits Limited, Winning Faith Limited and/or any other relevant BVI corporate entities. 43     The plaintiffs in their further submissions dated 20 March 2008 made reference to a report dated 7 March 2009 which was prepared by the Health Sciences Authority (“HSA”). In that report, HSA opined that the signature in a letter to Lim & Associates sent by Star Choice to arrange a share split of its shares in Bio-Treat was a forgery. That letter is dated 12 January 2005 and not 12 May 2005 as advised by Drew & Napier. How this January letter which is several months before the alleged fraudulent misrepresentation is relevant has not been explained nor has it been made an issue in the pleadings. (v) Proceedings in China 44     Bio-Treat referred to proceedings in China against Wing which they said was another factor that pointed the dispute away from Singapore. The proceedings in China related to the cessation of Wing’s duties and responsibilities as the director and legal representative of one of Bio-Treat’s subsidiaries in China. Both sides have filed conflicting affidavits as to the current status of the proceedings in China. The disagreement centred on whether the proceedings commenced by Bio-Treat’s subsidiary against Wing have been withdrawn. I did not think the proceedings in China counted as a factor under Stage One. The subject matter of the action in Singapore is different save for one overlapping issue - Wing’s resignations - but then again his purported resignations were peripheral to and did not relate to the core of the alleged conspiracy. 45     In conclusion, the defendants’ submissions are much stronger, and upon an objective appraisal of the connecting factors under Stage One, the balance comes down firmly on the side of the defendants in favour of Hong Kong as the more appropriate forum for the determination of the plaintiffs’ claim against the defendants.",
        "Stage Two": "46     As explained in [16] above, under Stage Two of theSpiliadatest, there are no compelling grounds for asserting that notwithstanding that Hong Kong is theforum conveniensthe interests of justice require that the Singapore action should not be stayed.",
        "Defence filed by second defendant": "47     The plaintiffs’ Writ of Summons was served out of jurisdiction on D2 on 31 November 2007. D2 entered an appearance on 19 December 2007 and his defence was due on 8 January 2008. Before the due date, D2’s solicitors, Acies Law Corporation (“Acies”) wrote on 4 January 2008 requesting an extension of time of one week to file and serve D2’s defence. Drew & Napier replied on 7 January 2008 agreeing to the extension requested but stated that the indulgence did not extend to any interlocutory application(s). Acies did not reply to Drew & Napier. D2 did not file his defence on the due date,i.e.8 January 2008. 48     However, the next day, D2 applied for a stay of all further proceedings in Singapore on the ground offorum non conveniens. In the same application, D2 asked that the time to file and serve D2’s defence be extended pending the final disposal of the stay application. D2’s application was fixed for hearing on 23 January 2008. 49     On 9 January 2008, the Assistant Registrar allowed Bio-Treat’s application and ordered a stay of further proceedings against Bio-Treat. On the same day, Drew & Napier sent a 48-hour notice to file and serve D2’s defence failing which the plaintiffs would obtain judgment against D2. On the same evening, Acies wrote to Drew & Napier as follows: 1. We refer to your fax of today’s date. 2. As you are aware, we have filed an application for stay of proceedings on the basis offorum non conveniens. In addition, we have filed an application for extension of time to file the Defence pending the determination of the forum issue. 3. Further, you are also aware that the learned Assistant Registrar, Mr Teo Guan Siew today has ruled that Singapore is not the appropriate forum for the determination of the issue in this Suit. 4. In the light of our application which is scheduled for hearing on 23 Janaury 2008 and in the light of the learned Assistant Registrar Teo Guan Siew’s ruling, we would be grateful if you could confirm that we withhold filing our client’s Defence pending the disposal of our said application. 5. In this regard, we would be grateful if you could confirm the same by 4.00pm on 10 January 2008. 50     Drew & Napier replied on 10 January 2008 as follows: … 2. We are in the midst of getting clients’ instructions and will revert as soon as possible. 3. All our clients’ rights are expressly reserved. 51     Before expiry of the 48-hour notice, Acies on 11 January 2008 filed and served D2’s Defence. It was intended to operate as a holding defence pending the hearing of Summons No 94 of 2008 on 23 January 2008. 52     It is with these background facts in mind that I turn to the three issues before me. The first concerns the late filing of Summons 94 of 2008. Second, the 48-hour notice to file D2’s defence. Third, the Defence and how it impacts the stay application, if at all.",
        "Breach of O 12 r 7 (2) and extension of time under O 3 r 4 of the ROC": "53     On the first issue, Mr Tan pointed out that the Summons No 94 of 2008 was filed out of time contrary to O 12 r 7(2) which reads as follows: A defendant who wishes to contend that the Court should not assume jurisdiction over the action on the ground that Singapore is not the proper forum for the dispute shall enter an appearance and, within the time limited for serving a defence, apply to Court for an order staying the proceedings. 54     At the hearing, Mr Rai accepted that the application was late. However, he pointed out that the delay was not inordinate as it was late by 12 hours. Mr Tan took issue, not with the duration of the delay but with the lack of explanation for the lateness. In my view, the reason for the delay is found in the affidavit filed on behalf of D2 in support of the stay application. Apparently, when Mr Rai wrote on 4 January 2008 for time to file D2’s defence, he did not have instructions to apply for a stay of proceedings. Mr Rai’s request was expressly made without prejudice to any interlocutory application that D2 might take out. Later on as paragraph 6 of his affidavit made clear, Mr Rai received instructions to apply for a stay of the proceedings in Singapore. That explained his application to extend the time to file and serve the defence pending final disposal of the stay application as D2 seemingly had only secured a week’s extension from the plaintiffs. Paragraph 7 of the affidavit states: On 7 January 2008, the plaintiffs’ solicitors wrote to us granting us a one week’s extension of time to file the 2ndDefendant’s Defence. 55     D2 and his lawyers were mistaken that they had an extra week to file the Defence. The misimpression was evident at the time the affidavit was affirmed. Summons No 94 of 2008 and the supporting affidavit were filed on 9 January 2008 at 12.39 pm. According to Mr Rai, Summons No 94 of 2008 was served on the same day but he did not indicate the time of service. Drew & Napier’s 48-hour notice was faxed on 9 January 2008 at 2.18pm. Certainly, by the time Mr Rai received the 48-hour notice, he must have realised the mistake for he immediately wrote to Drew & Napier. I have set out the text of the letter above (see [49]). 56     Drew & Napier’s reply of 10 January 2008 was unhelpful. It left Mr Rai in a dilemma. The letter stated: 1. We refer to your letter dated 9 January 2008. 2. We are in the midst of getting clients’ instructions and will revert as soon as possible. 3. All our clients’ rights are expressly reserved. 57     Mr Rai waited as long as he could to hear further from Drew & Napier and when he could wait no longer, he proceeded to file the holding defence two hours before expiry of the 48-hour notice. Having regard to the overall facts and circumstances, there being no prejudice to the plaintiffs, I allowed Mr Rai’s oral application to extend time for filing Summons No 94 of 2008.",
        "48-hour notice to file defence": "58     In my judgment, the 48-hour notice to file and serve D2’s defence was inappropriate and unjustified in the circumstances of the pending stay application. Recently, V K Rajah JA inCarona Holdings Pte Ltd and others v Go Go Delicacy Pte Ltd[2008] SGCA 34(“CaronaHoldings”) at [33] and [34] approving the comments of Woo Bih Li JC (as he then was) inYeoh Poh Seng v Won Siok Wan[2002] 4 SLR 91at [21] (which is aforum non convenienscase) on the very same point said that ordinarily a defendant should not be asked or compelled to file his defence whilst the stay application was pending in that a defendant should not be made to adopt two contrary courses of action simultaneously. I have not been told whether the 48-hour notice was given before or after Drew & Napier was served with the stay application. Be that as it may, in the present case, Drew & Napier’s letter of 10 January 2008 clearly included the reservation of the right to obtain judgment in default of defence. By then Drew & Napier were already aware of the pending stay application, and the reservation meant that the countdown of the 48-hour notice period was to continue until contrary instructions were obtained. It must be remembered that D2 was sued as a co-conspirator with Bio-Treat and the latter had just succeeded in staying the Singapore proceedings. Drew & Napier’s stance on 10 January 2008 in the light of the Assistant Registrar’s stay order in favour of the Bio-Treat and D2’s pending stay application which was the same as Bio-Treat’s was patently unreasonable and unwarranted.",
        "Effect of filing the Defence on the stay application": "59     This leads me to the Defence filed by D2. Was the filing of the Defence a step in the proceedings that answered the substantial claim and impliedly affirmed D2’s willingness to go along with the determination of the dispute by the Singapore courts? 60     It was contended by Mr Tan that D2, by filing his Defence, had submitted to the jurisdiction of the Singapore court, and as such his stay application should be dismissed. In addition, the averment in the Defence that expressly reserved D2’s right to take out any application to strike out the plaintiffs’ claim was tantamount to his submission to this jurisdiction. In support of his contention, Mr Tan citedPP Persero Sdn Bhd v Bimacom Property & Development Sdn Bhd[1999] 6 MLJ 1for the proposition that the inclusion of a striking out application in the stay application would constitute a step in the proceedings to bar the stay application. 61     In response, Mr Rai submitted that the Defence was a holding defence filed to pre-empt a default judgment. As such it was not filed with the intention of abandoning D2’s stay application in favour of allowing the action to proceed against him in Singapore. It was as Mr Rai called it, an act of self-defence for by that late stage, there was insufficient time before the expiry of the 48-hour notice to seek an extension of time from the court. In filing the Defence, he made it clear in the Defence itself that it was without prejudice to the stay application. Paragraph 1 of the Defence expressly reserves the second defendant’s position in the following terms: This Defence is filed without prejudice to the application made on behalf of the 2ndDefendant to stay all proceedings in Singapore and/or any other application which the 2nddefendant may make to strike out the Plaintiffs’ Statement of Claim. 62     In my judgment, the question which arises from the debate is whether the terms of the reservation incorporated in the Defence was proper and valid. I make two points. The first concerns incorporation of the reservation in the Defence. In principle, a reservation of rights may be incorporated in the Defence as was the case inChong Long Hak Kee Construction Trading Co v IEC Global Pte Ltd[2003] 4 SLR 499(“Chong Long Hak Kee Construction”). Rajah JA inCarona Holdingsat [101] agreed with Tay Yong Kwang J’s views expressed inChong Long Hak Kee Constructionthat it is possible to preserve the right to stay the proceedings with a properly worded reservation in the pleadings. However, as Rajah JA at [101] alerted, “it is of course conceptually possible for an earlier reservation [in the Defence] to be subsequently waived by clearly inconsistent conduct”. That was what happened inChong Long Hak Kee Construction.In that case, the reservation of the defendant’s right to apply for a stay was incorporated in the Defence and Counterclaim. Unfortunately, the defendant later on undermined itself by giving its own 48-hour notice to the plaintiff in respect of this Counterclaim. Tay J held that the service of the 48-hour notice by the defendant was clearly a step in the proceedings within the meaning of s 6 of the Arbitration Act (Cap 10, 2002 Rev Ed). In the present case, paragraph 1 of the Defence is a properly worded reservation that the Defence is filed without prejudice to the stay application. 63     I now come to the next query: Did the filing of a holding Defence in the circumstances of this case exhibit an unequivocal, clear and consistent intention to have the dispute determined by the Singapore courts as opposed to another foreign forum? In the context of the arbitration regime, the filing of a defence would affect the court’s statutory jurisdiction to grant a stay of proceedings under s 6 of the Arbitration Act. This statement is to be read in the light ofChong Long Hak Kee Construction. In contrast, a stay of proceedings on grounds offorum non conveniensor an exclusive jurisdiction clause, as the case may be, is about the Singapore court declining jurisdiction in favour of another more appropriate jurisdiction. Ultimately, under either regime (as the analysis of various authorities by the Court of Appeal inCarona Holdingsdemonstrates), the relevant inquiry is whether the filing of a defence demonstrates the party’s unequivocal, clear and consistent intention to have the dispute determined by this court (per V K Rajah JA inCorona Holdingsat [99], referring toRepublic of Philippines v Maler Foundation[2008] 2 SLR 857at [80] as an illustration of such an intention). 64     In the present case, the filing of the holding Defence viewed against the background facts of the case did not demonstrate acquiescence or an acknowledgment that the dispute should be determined in Singapore as it was the proper forum. D2’s conduct was not inconsistent with an earlier reservation of rights in his pleadings. Consistent with the reservations made in paragraph 1, the Defence as filed was not a substantive defence on the merits of the plaintiffs’ pleadings. It was a holding Defence of three paragraphs. I have already mentioned the first paragraph. Paragraph 2 is a bare denial of the allegations in the Statement of Claim. The next and last paragraph is a general traverse denying each and every allegation in the statement of claim. On the facts, nothing inconsistent happened after the Defence was filed to undermine the reservation in paragraph 1 of the Defence. In any case, there is no suggestion that paragraph 1 was a disingenuous reservation thereby undermining the pending stay application. There was no election to abandon D2’s pending application for a stay of the proceedings in favour of allowing the action to proceed against him in Singapore. 65     I turn to Mr Tan’s contention that reference to an application to strike out the plaintiffs’ statement of claim is fatal to the stay application. I agreed with Mr Rai that paragraph 1 of the Defence contemplates a possible prospective striking out application which is not the same thing and is distinguishable from the facts inPP Persero Sdn Bhd v Bimacom Property & Development Sdn Bhdwhere a prayer to strike out the writ was also included in the stay application. In this case, there was no prayer in the stay application filed by D2 to strike out the plaintiffs’ writ or pleadings. 66     For these reasons, I rejected Mr Tan’s contention that by his Defence, D2 had compromised his stay application and accepted Singapore as the appropriate forum to determine the dispute.",
        "Result": "67     The orders which I made on the matters before me were: (i) The plaintiffs’ appeal in RA No 11 of 2008 be dismissed with costs fixed at $8,000. (ii) Time for filing Summons No 94 of 2008 be extended. Prayer 1 of Summons No 94 of 2008 be allowed with costs fixed at $3000. (iii) Prayer 1 of Summons No 280 of 2008 be allowed with costs fixed at $2000. _________________ [note: 1]Statement of Claim para 21(vi) [note: 2]Wing Hak Man’s 2ndaffidavit exhibit marked “WHM-6” at p 178 [note: 3]Statement of Claim para 21(vii) & (xiv) [note: 4]Statement of Claim para 21 (xiii) [note: 5]Statement of Claim para 16 [note: 6]Statement of Claim para 21(xi) [note: 7]Wing Hak Man’s 2ndaffidavit exhibit marked “WHM-6” at p179 [note: 8]Statement of Claim para 21(xxx) [note: 9]Lau Cheuk Lun’s 1staffidavit para 7 note: [10]Lau Cheuk Lun’s 1staffdavit paras 17(b), 21, 36 to 38 [note: 11]Lau Cheuk Lun’s 3rdaffidavit para 10 [note: 12]Lau Cheuk Lun’s 3rdaffidavit para 17 (3) & (4) [note: 13]Lau Cheuk Lun’ 3rdaffidavit para 15 & exhibits marked “LCL-5” [note: 14]Wing Hak Man’s 1staffidavit para 3(2)."
    }
}