{
    "case_title": "Regalindo Resources Pte Ltd v Seatrek Trans Pte Ltd",
    "ncitation": "[2008] SGHC 74",
    "coram": "Andrew Ang J",
    "sections": {
        "Rule B Attachment": "5       A Rule B Attachment in aid of claims being pursued outside of the United States is apparently of ancient origin in the United States. According toAqua Stoli Shipping Ltd v Gardner Smith Pty Ltd, 460 F.3d 434 (“Aqua Stoli”) at 445, an attachment order could be obtained at anex partehearing on demonstration that: (1) there is a validprima facieadmiralty claim against the respondent; (2) the respondent cannot be found within the court district; (3) the respondent’s property may be found within the district; and (4) there is no statutory or maritime law bar to the attachment. In this regard, the United States Court of Appeals for the Second Circuit (“the Second Circuit”) inAqua Stolirejected the needs-plus-balancing test applied by the court below, holding instead that there was no need for a claimant to justify the need for security. 6       The novelty surrounding a Rule B Attachment is the deployment of the procedure to attach bank credits in an electronic fund transfer (“EFT”) when the credits pass transiently through an intermediary financial institution in the United States. As observed by the Second Circuit inReibor International Ltd v Cargo Carriers (KACZ–Co) Ltd, 759 F.2d 262 at 266: … Often, when a person in one foreign country makes a payment in U.S. dollars to someone in another foreign country, the payment clears through New York. 7       It therefore came as no surprise that a seemingly innocuous transfer of US$249,975 was frozen and attached by the intermediary clearing bank, in this case The Bank of New York, as the funds were being electronically routed from the plaintiff’s bank account in Singapore to a bank in Jakarta. 8       The legality of EFT attachments under Federal Law was recognised by the Second Circuit inWinter Storm Shipping Ltd v TPI, 310 F.3d 263 (“Winter Storm”), which held that “EFT funds in the hands of an intermediary bank may be attached pursuant to Admiralty Rule B(1)(a)”. Further, the court also noted that a maritime attachment did not require a relationship between the property attached and the underlying charterparty. The decision inWinter Stormto allow the attachment of EFT funds has been criticised by banking entities, and inAqua Stoliat 446, the Second Circuit made the following observation by way of a footnote: The correctness of our decision inWinter Stormseems open to question, especially its reliance onDaccarett, 6 F.3d at 55, to hold that EFTs are property of the beneficiary or sender of an EFT. BecauseDaccarettwas a forfeiture case, its holding that EFTs are attachable assets does not answer the more salient question ofwhoseassets they are while in transit. In the absence of a federal rule, we would normally look to state law, which in this case would be the New York codification of the Uniform Commercial Code, N.Y. U.C.C. Law §§ 4-A-502 to 504. Under state law, the EFT could not be attached because EFTs are property of neither the sender nor the beneficiary while present in an intermediary bank. 9       While the above footnote stopped short of departing fromWinter Storm, it did,prima facie, raise some doubts on the reasoning behindWinter Storm. The issue of whether the New York courts are still bound byWinter Stormwas considered by the New York District Court inGeneral Tankers Pte Ltd v Kundan Rice Mills Ltd, 475 F.Supp.2d 396 at 399, where the court held thatWinter Stormremained as good law given that it had not been overruled, and that the Second Circuit was bound by a decision of a prior panel unless and until its rationale was overruled, implicitly or expressly, by the Supreme Court or the Second Circuiten banc. As this well-settled procedure was not followed inAqua Stoli, it follows that theratio decidendiinWinter Stormremains undisturbed. 10     Reverting to the present case, Regalindo applied to the New York District Court to vacate the Attachment Order and one of the grounds relied upon was that an EFT in the hands of an intermediary bank was not a tangible or intangible property within the meaning of Rule B. The said application was heard on 25 March 2008 and was dismissed as, notwithstanding the fact that the rule inWinter Stormis currently the subject of an appeal, the court was of the view that pending the verdict of that appeal,Winter Stormremained as good law. In the circumstances, as the United States courts are best positioned to interpret and apply their own laws, this court would assume that the funds attached by The Bank of New York have been attached in accordance with the laws of the United States.",
        "The law governing anti-suit injunctions": "11     It is well settled that the court’s jurisdiction to restrain foreign proceedings is exercised on the basis of the “ends of justice” and that there are several distinct and discrete grounds on which the court could grant an anti-suit injunction; see Dicey, Morris & Collins,The Conflict of Laws, vol 1 (Sweet & Maxwell, 14th Ed, 2006) (“Dicey & Morris”) at pp 502–503: The English court may restrain proceedings brought abroad in breach of a contract not to sue, or in breach of a contract to be bound by the result of English proceedings, to sue only in England, or to submit disputes to arbitration. The court will also restrain proceedings which interfere with the “due process of the courts”, or with the court’s jurisdiction to decide cases pending before it. Thus the court will enjoin proceedings taken abroad to recover foreign assets, whereby the party taking them will obtain an unfair advantage over other claimants in an English administration, or bankruptcy or winding up. It is also clear that the court may restrain foreign proceedings which are “oppressive or vexatious” in the traditional sense. 12     The law relating to the granting of anti-suit injunctions is well settled. InBank of America National Trust & Savings Association v Djoni Widjaja[1994] 2 SLR 816, the Court of Appeal adopted the principles enunciated by the Privy Council inSociété Nationale Industrielle Aerospatiale v Lee Kui Jak[1987] AC 871 (“Aerospatiale”). InAerospatialethose principles were summarised succinctly by Lord Goff at 892: The law relating to injunctions restraining a party from commencing or pursuing legal proceedings in a foreign jurisdiction has a long history, stretching back at least as far as the early 19th century. From an early stage, certain basic principles emerged which are now beyond dispute. First, the jurisdiction is to be exercised when the “ends of justice” require it: seeBushby v. Munday(1821) 5 Madd. 297, 307,perSir John Leach V.-C);Carron Iron Co. v. Maclaren(1855) 5 H.L. Cas. 416, 453,perLord St. Leonards … This fundamental principle has been reasserted in recent years, notably by Lord Scarman inCastanho v Brown & Root(U.K.) Ltd.[1981] A.C. 557 and by Lord Diplock inBritish Airways Board v. Laker Airways Ltd.[1985] A.C. 58, 81. Second, where the court decides to grant an injunction restraining proceedings in a foreign court, its order is directed not against the foreign court but against the parties so proceeding or threatening to proceed. … Third, it follows that an injunction will only be issued restraining a party who is amenable to the jurisdiction of the court, against whom an injunction will be an effective remedy: see, e.g.In reNorth Carolina Estate Co. Ltd.(1889) 5 T.L.R. 328,perChitty J. Fourth, it has been emphasised on many occasions that, since such an order indirectly affects the foreign court, the jurisdiction is one which must be exercised with caution: see, e.g.Cohen v Rothfield[1919] 1 K.B. 410, 413,perScrutton L.J., and, in more recent times,Castanho v Brown & Root(U.K.) Ltd.[1981] A.C. 557, 573,perLord Scarman. 13     InKoh Kay Yew v Inno-Pacific Holdings Ltd[1997] 3 SLR 121, the Court of Appeal again applied theAerospatialeprinciples and added at [25] that: … In our opinion, it must be only in the clearest of circumstances that the foreign proceedings are vexatious or oppressive before an injunction can be granted and justified. Otherwise any injunction so granted would not only be against Lord Goff’s principles but also a deprivation of the rights of a party to sue in the jurisdiction which is most convenient for him and which he is clearly entitled to.",
        "Whether the New York Proceedings breached the arbitration agreement": "14     In the case at hand, the plaintiff had submitted that “where foreign proceedings are commenced in breach of an exclusive jurisdiction clause or arbitration agreement, the English Courts have granted an anti-suit injunction without even considering the question of vexation and/or oppression”. In this regard, the alleged arbitration agreement between the parties provides as follows: Any dispute if arising from this Charter Party to be settled by Arbitration in Singapore and English Law to apply. Each party to appoint an arbitrator should they be unable to compromise, the decision of an umpire selected by them to be final. If one party fails appointment of an arbitrator within seven clear days after notice of appointment of arbitrator given by the other party, the party who has appointed an arbitrator may appoint that arbitrator to act as sole arbitrator. The award of the sole arbitrator to be final. Arbitration cost to be for account of the losing party or else stated by arbitrator(s). Arbitrator(s) should be commercial shipping man (men). LMAA clause to apply for amounts up to USD 50,000. 15     InThe Lisboa[1980] 2 Lloyd’s Rep 546 (“The Lisboa”), the jurisdiction clause in question read: Any and all legal proceedings against the Carrier shall be brought before the competent court at London, which shall have exclusive jurisdiction, subject to appeals, if any, pursuant to English Law, unless the Carrier expressly declares his option for other jurisdiction or expressly agrees to submit to other jurisdiction. 16     Denning LJ held that the phrase “any and all legal proceedings” should be construed as relating only to proceedings to establish liability and did not extend to proceedings to enforce a judgment or award or to obtain security. On that basis, it would follow that in the present case, in the absence of clear and unequivocal language in the arbitration clause, the retention of securityper sein New York by the defendant would not be inconsistent with the agreement to arbitrate, if any.",
        "Whether the New York Proceedings were vexatious or oppressive": "17     I now turn to consider whether the New York Proceedings were vexatious or oppressive. On this point, the plaintiff has submitted that: (a)    the advantages offered by the Rule B Attachment were available only in New York which was not the natural forum and this was evidence of oppression; (b)    there was a distinction between ship arrest and a Rule B Attachment. While the former is a recognised proceeding in most maritime states, the latter is unique to the United States; and (c)    the attachment of funds would hamstring the plaintiff’s cash flow and was highly disruptive to the ordinary and proper conduct of its business. 18     The defendant, on the other hand, submitted that an anti-suit injunction, if granted, would deprive it of a legitimate juridical advantage. Before moving on to deal with the parties’ points, it would perhaps be opportune again to refer toDicey & Morrison the question of vexation and/or oppression, at pp 504–505: It has been held that vexation or oppression may be indicated by the following: subjecting the other party to oppressive procedures in the foreign court, especially a party with no substantial connection with that jurisdiction; bad faith in the institution of the proceedings, or the institution of proceedings which are bound to fail; extreme inconvenience caused by the foreign proceedings; multiplicity of actions, especially where the foreign action might spawn further consequential litigation which might not be reconcilable with the foreign decision; bringing proceedings which interfere with or undermine the control of the English court of its own process; bringing proceedings which could and should have formed part of an English action brought earlier; bringing proceedings for no good reason in a court which will disregard an express choice of English law. If a prima facie case of oppression or vexation has been made out by the applicant the respondent will be entitled to show why it would nevertheless be unjust for an injunction to be granted: the interests of both parties must be borne in mind. The respondent may point to substantive or procedural advantages, available to him in the foreign court, which will be lost if the injunction is granted. But if these advantages are available to him only in a forum which is not the natural forum, they will be given little weight, and may even be themselves seen as evidence of oppression. 19     The defendant was not entitled to pre-judgment security under Singapore law as its claim did not entitle it to invoke thein remremedies afforded by the High Court (Admiralty Jurisdiction) Act. Further, the defendant had not, at least at the outset, alleged that there was a risk that the plaintiff would dissipate or conceal its assets or put them out of reach of the defendant. Unable to obtain security in Singapore, the defendant invoked the New York District Court’s maritime jurisdiction to obtain the same. 20     InQ&M Enterprises Sdn Bhd v Poh Kiat[2005] 4 SLR 494, Andrew Phang JC stated at [25] that: The importance of international comity cannot be underestimated. The domestic courts of each country must constantly remind themselves of this point – if nothing else, because of the natural tendency towards favouring domestic law over foreign law. In days of yore, the domestic legal system was probably the main – if not sole – focus simply because in those days, jurisdictions on the whole were less interconnected. So it is understandable if the focus was on the domestic law, simply because the law of foreign jurisdictions was, in the nature of things then, rarely raised. This is no longer the case. Nevertheless, it ought to be emphasised that the signal importance of the domestic legal system cannot be gainsaid either. Extreme positions on either side of the legal spectrum ought to be avoided. For example, international comity oughtnotto be accorded if to do so would offend the public policy of the domestic legal system (here, of Singapore). However, that having been said, legal parochialism must also be eschewed. Such tunnel vision is, as I have mentioned, no longer an option. It will only cause the legal system adopting such a limited vision to atrophy, even in the medium-term, not to mention the long-term. This will, of course, have detrimental effects on the broader social structures, of which the law is an integral part. 21     To my mind, the above dicta by Phang JC lends support to the proposition that we should not automatically favour domestic law over foreign law. The fact that the remedies sought in the New York Proceedings were not available in Singapore should not automatically mean that an anti-suit injunction ought to be granted. 22     In my view, if a party could satisfy the court that there was good reason behind its institution of the foreign legal process, the court, in deciding whether to grant an anti-suit injunction, would have to balance the hardship caused to the plaintiff by the foreign proceedings against the defendant’s need to invoke the foreign process; seeAerospatialeat 896, where Lord Goff stated: … since the court is concerned with the ends of justice, that account must be taken not only of injustice to the defendant if the plaintiff is allowed to pursue the foreign proceedings, but also of injustice to the plaintiff if he is not allowed to do so. So the court will not grant an injunction if, by doing so, it will deprive the plaintiff of advantages in the foreign forum of which it would be unjust to deprive him. 23     In the present case, the defendant stated that there was a real likelihood that the plaintiff would not be able to satisfy the arbitration award if the defendant succeeded in the arbitration. While the plaintiff had a paid-up capital of S$2m, the net worth of the plaintiff was only S$290,212, the latest available audited financial statements showing an accumulated loss of S$1,709,788 over the years. This was the reason why the defendant decided to seek advice on the possibility of obtaining security for its claim. Its United States lawyers advised that there was an available remedy under United States law which would assist the defendant in obtaining security for its arbitration claim in Singapore. Accordingly, the defendant made an application to the New York District Court for a Rule B Attachment Order. 24     The defendant further averred that its need for security was even greater now as the directors of the plaintiff had on 1 February 2008 set up three companies, namely, Regalindo Holdings Pte Ltd, Regalindo Logistics Pte Ltd and Regalindo Mines Pte Ltd. All the three companies share the same registered office as the plaintiff; Regalindo Mines Pte Ltd was in fact carrying on the same business as the plaintiff. Further, the directors and shareholders hold the shares of these three newly incorporated companies in the same proportion as their current shareholdings in the plaintiff. To the defendant, these were indications that the directors might no longer be carrying on business through the plaintiff but have diverted its business to the three newly incorporated companies. 25     The plaintiff replied stating that its net asset value of S$290,212 in 2006 was a much improved position from the previous year’s figure of S$105,831, and that it had made S$184,381 in profits in 2006. The fact that the defendant had conducted background checks on the plaintiff during the course of the parties’ negotiations for the time charter was also highlighted but, it seems to me, that is not a pivotal fact in the present circumstances. 26     As for the three newly incorporated companies, the plaintiff stated that none of them was set up to take over the plaintiff’s business and no part of the latter’s business was diverted to any of them. The companies were set up as part of a plan to build up the brand name of Regalindo and expand into areas of business complementary to the business carried on by the plaintiff.",
        "My decision": "27     Having regard to all of the relevant facts, I am of the view that notwithstanding the fact that Singapore is the natural and proper forum for the resolution of the dispute, an anti-suit injunction restraining the New York Proceedings should not be granted. While the New York Proceedings could have a disruptive effect on the plaintiff’s business, it cannot be said that the defendant’s resort to the New York Proceedings was unwarranted. In my view, any reasonable person in the defendant’s shoes would be concerned with the plaintiff’s ability to satisfy an eventual arbitral award, if any. 28     This concern would no doubt be heightened by the fact that the plaintiff’s shareholders incorporated three new companies on 1 February 2008. Although the incorporation was carried out before the plaintiff had notice of the New York Proceedings, it is pertinent to note that the defendant had accepted the plaintiff’s repudiatory breach and terminated the time charter on or around 4 January 2008. Therefore, by 1 February 2008, the plaintiff would have known or ought to have known that there was a real prospect of litigation. Taking an objective view of the matter, the incorporation of the new companies might well have been a defensive measure taken by the plaintiff’s shareholders to pre-empt the consequences of the plaintiff’s insolvency in the event the defendant prevailed in the time charter dispute. Or it might also have been a way of circumventing the difficulties posed by the Rule B Attachment Order. As to this, there is of course no evidence. In any event, to my mind, the fact that the companies were incorporated raises serious doubts on the plaintiff’s willingness to satisfy an arbitral award, if made. 29     While the New York Proceedings were taken out before the companies were incorporated, I can see no cogent reason why I should not take this fact into account in determining whether to restrain them. InEvergreen International SA v Volkswagen Group Singapore Pte Ltd[2004] 2 SLR 457, it was said at [41] that: The question for consideration is whether the conduct of the defendants in continuing with the Belgium proceedings is vexatious or oppressive and is hence unconscionable. Lord Hobhouse inTurner v Grovit[2002] 1 WLR 107 at 117 explained that the power to make the restraining order is dependent upon there being wrongful (“unconscionable”) conduct of the party to be restrained of which the applicant is entitled to complain and has a legitimate interest in seeking to prevent. He said that the word “unconscionable” is derived from English equity law. Injunctive relief is based on equity. The words “vexatious” or “oppressive” have been used in relation to the conduct of the party to be restrained. They are derived from “the basic principle of justice”. 30     Thus, it is evident that the court’s power to grant an anti-suit injunction is based upon equity. In the premises, I do not think that equity ought to be blind to a party’s conduct, albeit after commencement of the foreign proceedings. 31     Having regard to all of the above, I am of the view that notwithstanding the possible (I emphasise “possible” rather than “probable”) hardship that might be caused to the plaintiff by the New York Proceedings and the fact that the defendant would not have been able to obtain pre-judgment security under Singapore law, the balance favours the defendant. I, accordingly, decline to grant the orders sought by the plaintiff. That said, I might perhaps add that if theonlycomplaint that Seatrek had against Regalindo was the latter’s poor financial standing, the end resultmighthave been different. 32     I will hear the parties on costs."
    }
}