{
    "case_title": "Wong Shan Shan v Public Prosecutor",
    "ncitation": "[2008] SGHC 49",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "The appellant’s background": "3     The appellant is the youngest of four children. She and her family migrated from Hong Kong. According to the mitigation plea, she has been mostly left to her own devices as her older siblings, having married, do not live with her. Her parents make frequent trips to Hong Kong. 4     Dr Kenneth G.W.W. Koh (“Dr Koh”) of the Institute of Mental Health examined the appellant on two occasions when she was remanded in Woodbridge Hospital (“the hospital”) for the period 18 July to 1 August 2007 following her arrest. He reported that the appellant had been studying for her GCE ‘O’ levels as a private student. She had worked as a kindergarten assistant, a cashier and a cleaner, maintaining each job for a few months at most. For the two months preceding Dr Koh’s examinations, the appellant had been staying alone as her parents had returned to Hong Kong. 5     Dr Koh reported that the appellant had been having various long-standing tiffs with her neighbour, a Sikh couple (Mr and Mrs Singh). The appellant had told him that they had undergone mediation at the subordinate courts in July 2006. The appellant said that things settled down for a while after the mediation, but the mutual harassment resumed. No other details of the disputes were given. 6     According to Dr Koh, the appellant was seen once by the National University Hospital’s Psychiatric Team over her problems with her neighbours, but was discharged after one visit. He reported that the appellant was neat in appearance and there were no symptoms or signs of mania or depression. She denied alcohol or substance abuse. She did not exhibit any psychotic behaviour during her stay at the hospital. Her mother, however, reported that she had odd beliefs, such as claiming that Mr Singh and his wife placed charms on her through their toilet bowl. She thus poured bleach into the toilet bowl daily and taped it up with masking tape. She also avoided water pipes when she walked in the void deck area. Apparently, the appellant also had a litigious streak: she had called the police to settle disputes with her own brother. 7     Dr Koh’s diagnosis was that the appellant may have an early paranoid psychosis or a paranoid personality. However, she was not of an unsound mind at the time of the offences. He recommended that her family maintained closer ties with her and ensured that she continued with further psychiatric treatment either in Singapore or Hong Kong, should the family decide to move there.",
        "The offences": "8     In relation to the vandalism charges, according to the statement of facts, which the appellant admitted to without qualification, closed-circuit television (CCTV) footage revealed that she had, on 14 July 2007 at about 12.27pm, used a black spray can on the door and main gate of unit #10-35 of her block of flats. The same CCTV footage showed that on 15 July 2007 at about 6.00pm, the appellant used a black marker pen to write a vulgar expression with a reference to unit #14-39 on the side of the wall outside the same unit. The occupants of unit #14-39 were Mr and Mrs Singh. Unit #10-35 was owned by the Housing Development Board (HDB). 9     The charges taken into account related to incidents of vandalism committed in the same block on 29 August 2005, between 4 and 5 September 2005, 3 April 2006, 29 January 2007, 3 March 2007, 19 June 2007, 2 July 2007 and 7 July 2007. In some of these incidences, the abusive messages were also aimed at Mr and Mrs Singh. 10    As for the intentional harassment charges, Mr Singh’s handphone had received 19 SMSes from the appellant’s handphone from 17 to18 June 2007.   These contained vulgar and racist remarks in local pidgin. Mrs Singh received 20 SMSes of a similar nature from the appellant from 15 to 17 June 2007.",
        "The decision below": "11    The defence counsel highlighted the appellant’s personal situation to the district judge, particularly her young age and Dr Koh’s diagnosis, and pleaded for the court to grant a lenient sentence. Counsel added that her family intended to take the appellant back to Hong Kong after the conclusion of this matter so that her parents could care for her there. Notably, there was no request for probation. The prosecution did not submit on sentence, except that the appellant was a serial offender, and that the nature of the remarks made were inflammatory and racist. 12    The district judge took into account the following factors: (a)   The acts of vandalism were committed on HDB property, which was “public property” under s 2 of the Vandalism Act. (b)   The vandalism was also committed using spray paints or marker pens which made removal of the marks difficult. Under s 3 of the Vandalism Act, the appellant would have been punished with caning as the vandalism was committed using indelible substances, but for the fact that she was female. (c)   The offences were committed over a period of time, thus necessitating the use of CCTV cameras. Such acts were easy to commit but hard to detect. (d)   The magnitude of the vandalism acts, committed over several floors of the same block of flats, was extensive. (e)   The offences were deliberately committed and not impulsive acts. The messages were abusive and motivated by malice, and were intended to harass Mr and Mrs Singh. (f)   According to the defence counsel, although inpatient treatment had been suggested at a previous pre-trial conference, the family was not able to afford inpatient treatment for the appellant and she only managed to attend two or three appointments. The district judge was not optimistic that the appellant’s parents would be able to adequately supervise the appellant and ensure her continuing psychiatric treatment in Singapore.",
        "My decision": "13    I was cognisant of the fact that there were significant aggravating factors in this case. The extent of the damage caused is particularly notable. InRaja s/o Shevalingam v PP(MA 195/92/01), the accused, also 19 years old, damaged the flushing system of a public toilet out of spite, because he had quarrelled with the toilet caretaker. Repairs to the damaged property cost only about $60. The accused, who had a clean record, was sentenced to 3 months’ imprisonment and three strokes of the cane. That was a single isolated instance of vandalism with a relatively low cost of repair, in contrast to the acts of vandalism perpetrated by the appellant in the present case, which are more serious in this respect. 14    The fact that the acts were committed as a “spree” amounting to “a calculated course of criminal conduct” is also a strong aggravating factor, as was noted inFay v PP[1994] 2 SLR 154(Fay). In that case, the accused was sentenced to two months’ imprisonment and three strokes in respect of each of the two vandalism charges. 15    The motivation behind the attacks is a relevant factor—vandalism for the purpose of money-lending, for instance, is regarded as an aggravating factor:Chua Boon Liang v PP(MA 256/92/01) andSoh Chik Seng v PP(MA 56/93/01). The instant case can be considered more serious than the offences committed by the accused inFaybecause of the particularly vociferous and personal nature of the vandalism attacks, which clearly identified the victims. In contrast, Fay’s vandalism spree was not personally targeted at any particular individual, and was the product of mischief rather than spite. 16    However, although this case certainly had some significant aggravating factors, I was somewhat surprised that neither the defence counsel nor the court below appeared to consider the possibility of a non-custodial sentence. The respondent before me pointed out that the court below had indeed considered how the family would be unlikely to support her psychiatric treatment, and submitted that this showed that the court below had found probation to be inappropriate. But even if this were so, the court below did not even call for a probation report before making this decision. The fact that the court below may not have fully appreciated the full range of sentencing options which could have been appropriate in the case of the appellant is the main reason that I found the sentence imposed to be manifestly excessive. 17    Our courts are empowered to make a probation order under the Probation of Offenders Act (Cap 252, 1985 Rev Ed) (“the Act”). There are certain requirements which must be met before a probation order can be even considered. Under s 5(1) of the Act, the offence for which the accused has been convicted must be one for which the sentence is not “fixed by law”. Also, where the accused has been convicted of an offence for which a specified minimum sentence or mandatory minimum sentence of imprisonment or fine or caning is prescribed by law, a probation order can only be made if the accused is between 16 and 21 years of age at the time of his conviction, and has not been previously convicted of such offence. 18    Undoubtedly, if these requirements are not met, there is no need for the court to even consider the possibility of probation. But if the converse is true, under the same provision, the court may make a probation order if it is “expedient” to do so, “having regard to the circumstances, including the nature of the offence and the character of the offender”. 19    It is clear that before a court makes a probation order, it should call for a probation report (or pre-sentence report), submitted by a probation officer, which will contain full information about the accused and his home and social environment, the probation officer’s views on the suitability of probation for the accused, as well as details of a supervision plan. This report will assist the court in deciding whether it is “expedient” to grant a probation order, as well as the terms of that order. The value of a well-crafted probation report can be seen inGoh Lee Yin v Public Prosecutor[2006] 1 SLR 530, where the court overturned a sentence of two and a half months’ imprisonment in favour of 24 months’ probation imposed on a 24 years old kleptomaniac. The court noted at [33] and [48] that the probation report was “detailed and comprehensive” and included a “meticulously crafted” supervision plan that spelt out clearly how the accused would be supervised throughout the day and made to take her medication. 20    However, a court may decide that it will not call for a probation report, essentially ruling out probation as a sentencing option. Such a course of action would obviously be correct in cases where the basic criteria, discussed earlier, are not even met. In other cases, the court must make a preliminary assessment whether, even if the accused does meet the basic criteria, probation is not a realistic option on the facts of the case. 21    The youth of the accused is a particularly powerful consideration, and rehabilitation (whether through probation or other sentencing options) is usually the primary sentencing objective: see generallyPublic Prosecutor v Mohammad Al-Ansari bin Basri[2007] SGHC 187. Thus, if the accused is young (i.e. between 16 and 21 years of age), a first offender, and convicted of a relatively less-serious crime, a court should order a probation report, even if probation was not raised by the defence. It should not jump the gun by making its own assessment as to the accused’s suitability of probation without the benefit of such a report. As stated by Yong Pung How CJ inPublic Prosecutor v Mok Ping Wuen Maurice[1999] 1 SLR 138: 22     The judicial practice has been to require a probation report before sentencing a young offender. As per Ambrose J inTan Kah Eng v PP[1965] 2 MLJ 272: It is desirable that, as far as possible, the first offender under the age of 21 years should be kept out of prison, unless the offence is so serious that a sentence of imprisonment has to be imposed. 23     InTeo Siew Peng v PP[1985] 2 MLJ 125, some four young appellants, none of whom was above the age of 19 at the time of the offence, were first offenders who pleaded guilty to a sentence of gang robbery and were sentenced to terms of imprisonment. On appeal, the court held that the appellate court would not alter the sentence imposed by the lower court unless it had erred in principle or that the sentence was manifestly excessive. In this instance, the appellate court did interfere for it was felt that the reformative factors involved in sentencing, the probation reports, the character and antecedents of the appellants had not been adequately considered. Quoting fromR v Smith[1964] Crim LR 70: In the case of a young offender there can hardly ever be any conflict between the public interest and that of the offender. The public have no greater interest than that he should become a good citizen. The difficult task of the court is to determine what treatment gives the best chance of realizing that object. That realization is the first and by far the most important consideration. The sentence of imprisonment was thus set aside and substituted with binding-over orders. 22    In the instant case, all of the criteria I mentioned earlier were met. There is also one further consideration that the district judge did not seem to give much weight to. The psychiatrist had said that the appellant may have an early paranoid psychosis or a paranoid personality. The acts constituting the offences that she was charged with were certainly consistent with that preliminary diagnosis. This was another factor favouring the calling of a probation report. 23    The function of a probation report is to equip the court in making a more informed sentencing decision. In the United Kingdom, the Report of the Interdepartmental Committee on the Business of Criminal Courts (Cmnd. 1289, 1961) noted that “the cardinal principle is that a sentence should be based on comprehensive and reliable information which is relevant to the objectives in the court’s mind” (para 323). This sentiment is also applicable in Singapore. It must be borne in mind that at this stage, the only question is whether a report should be commissioned. It may well be that after the probation report is given the court finds that probation is not suitable. And even if the probation officer recommends probation, the court may still reject it. See, for instance, the case ofWu Si Yuan v Public Prosecutor[2003] SGHC 7, where although the probation report recommended a 24-month probation, the court decided that because the proposed probation programme had various flaws and the accused’s family circumstances were not conducive to rehabilitation, a custodial sentence was warranted. Conversely, seePublic Prosecutor v Chen Huanye[1999] SGHC 48at [2] and [4], where despite the probation officer’s “trepidation” and “misgivings” about the difficulties in supervising the accused (aged between 14 and 16 years) during probation, Choo Han Teck JC nevertheless made a probation order of three years. In exceptional circumstances, an accused who appearsprima faciesuitable for probation (in that he satisfies the criteria spelt out above) can nonetheless be given a custodial sentence without the court ordering a probation report. 24    If the lower court has sentenced the accused without ordering a probation report when it should have done so, it is open to the appellate court to make that order and consider the appropriate sentence after the report is made. That is what I would have done in the instant case had the appellant not commenced serving her sentence. However the appellant was unable to post bail and although her appeal had been expedited, by the time I heard it she had served more than half the sentence of imprisonment. It was highly unlikely that the probation report could be completed before she served the entire sentence. I must stress that in the absence of a probation report, I cannot make any finding as to whether or not probation would have been appropriate in the present case. 25    For the reasons given above and in the circumstances of the case, the district judge ought to have called for a probation report before considering the sentence. It is unfortunate that this was not done, and this is compounded by the fact that the appellant was unable to raise bail so that she could remain outside prison pending appeal. Having served more than half her sentence of imprisonment, it was inappropriate in my view to order a probation report. I therefore proceeded to consider the appropriate sentence, taking into consideration the fact that a probation report ought to have been ordered. I also bore in mind other mitigating factors, not least her age, lack of previous convictions and most importantly, her mental condition, as well as sentencing precedents cited earlier. I was of the view that the most appropriate sentence in the circumstances would be to reduce the sentence of imprisonment in such a manner that would enable her to be released on the day of the appeal. This means that on the day of the appeal she would have served the sentences for the two vandalism charges (which were ordered to run concurrently) as well as the two one-week default imprisonment in lieu of fines for the harassment charges. 26    At the hearing, the appellant, who represented herself, repeatedly drew my attention to her aspirations to become a policewoman in the future, for which she apparently could not have a criminal record. While this was a laudable ambition, it did not figure in any way in my decision to allow the appeal. I advised her that even with the custodial sentenced imposed (albeit much reduced), it was not impossible for her criminal record to be spent. The appellant has more than one conviction on the register and is therefore disqualified under s 7C(f) of the Registration of Criminals Act (Cap 268, 1985 Rev Ed) from having her record spent by operation of s 7B(2). However she could still apply to the Commissioner of Police under s 7D to have the record treated as spent."
    }
}