{
    "case_title": "Heow Mee Han and Others v Cheong Hock Kiam",
    "ncitation": "[2008] SGHC 27",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "The decision of the court": "18     InLassiter Ann Masters v To Keng Lam[2004] 2 SLR 392(“Lassiter”), the Court of Appeal drew a distinction between the adduction of fresh evidence in an appeal against a registrar’s decision made on affidavit evidence alone (as in an interlocutory application) and in an appeal against a registrar’s decision made after hearing oral testimony (such as an assessment of damages). For the latter category, the Court of Appeal adopted a modified version of the well-known three conditions set out inLadd v Marshall[1954] 1 WLR 1489. In exercising the discretion whether or not to admit fresh evidence on appeal in a case in the latter category, the judge should bear in mind the following conditions: (a)    the party seeking to admit fresh evidence must show sufficiently strong reasons why that evidence was not adduced at the assessment before the registrar. (b)    the fresh evidence must be such that, if given, it would probably have had an important influence on the result of the case, though it need not be decisive. (c)    the fresh evidence must be apparently credible, though it need not be incontrovertible. The Court of Appeal also stated (at [26]): In passing, we would add that we do not see any reason why these conditions should not also apply to other similar proceedings conducted by the Registrar, such as the taking of accounts or the making of inquiries. 19     It is therefore clear that the conditions set out by the Court of Appeal in [18] above apply to the present proceedings. The onus is on the defendant to persuade me that the evidence contained in her post-hearing affidavit of 10 September 2007 ought to be admitted. 20     The defendant has not denied that the three sets of documents in question were in her possession, custody or control at all material times. She certainly could not deny this as she was the managing director of Grand City and also the Singapore trustee of the deceased’s estate. She took the position at the hearing below that the estate duty certificate was sufficient to prove the alleged indebtedness in respect of Grand City and therefore saw no need to produce other evidence to convince the AR. 21     In my view, this was not a sufficiently strong reason to admit the new evidence. The defendant was the accounting party. She should be acutely conscious of her duty to satisfy the court that all items in her account were properly documented. It was apparent that the estate duty certificate by itself would not prove a debtowing to Grand Cityespecially since the amount did not even tally with the financial statements of Grand City. The financial statements were also hopelessly nebulous, bearing in mind that there were six directors (including the deceased) in Grand City at the relevant time. The plaintiffs’ solicitors had also asked for further documentary proof of the alleged debt more than a year before the hearing below. 22     The defendant’s lackadaisical attitude was shown by the fact that she only bothered to start looking for the documents after the AR gave her decision, which was 26 days after the conclusion of the hearing (see paragraph 3 of the defendant’s affidavit of 10 September 2007 at [13]). Further, there were several months between the time that interlocutory judgment was entered against the defendant and the deadline for her to furnish the account. She could not therefore claim that she had insufficient time to locate the documents for the hearing below. As the Court of Appeal inLassitersaid (at [45] of the case), “Any party who comes to court seeking to play a “cat-and-mouse” game cannot expect sympathy or indulgence”. The same applies to a party who waits for the court to decide, then seeks to augment its evidence with material in its possession when the ruling goes against it. Moreover, it is plain that admission of the new evidence would entail a re-hearing before the AR with further cross-examination and possibly the calling of more witnesses. 23     I accept that the new evidence, if admitted, could have an important bearing on the issues decided by the AR and that the documents were, on their face, genuine ones. I note also that the amount of the alleged debt was not consistent in the various documents produced before the AR and in the new evidence. However, as the defendant failed at the first threshold for the admission of fresh evidence, I disallowed the application to admit the documents in question. 24     On the substantive matters decided by the AR, I agree that the evidence before her fell far short of establishing the alleged debt to Grand City for the reasons already canvassed. This was especially so when the defendant here is the trustee of the estate and also one of the beneficiaries of any money that may eventually go to Grand City. She is effectively both the debtor and creditor and it is therefore incumbent on her to fulfil her role as trustee in a way that leaves no room to doubt her accounts. 25     As for the withdrawal of the sum of more than $5m from the bank accounts, it was for the defendant to furnish satisfactory evidence on the deceased’s alleged instructions to her but she has failed to do so. Even if the withdrawal and distribution were not done by her in her capacity as the Singapore trustee (as the deceased would still be alive then), she would still be liable to account for the money as she claimed to have been given a power of attorney. Strangely, no power of attorney has been shown to the court and the defendant has not explained how and when $5m was distributed among the Singapore family within a matter of days. She has chosen not to call even one member of her family to testify that he/she did indeed receive a portion of the $5m. I therefore also agree that the defendant has failed to show that the $5m was not part of the estate’s assets. 26     In any event, I agree with the plaintiffs’ submissions (at [16] and [17] above). Whether or not there was a debt owed to Grand City and irrespective of the amount of assets left in the estate, the defendant still has to transfer 50% of the Hotel Grand Central shares to the plaintiffs. I am also of the view that the alleged debt would be a Singapore debt. 27     There was therefore no merit in the defendant’s appeal. I dismissed it with costs to be taxed or agreed."
    }
}