{
    "case_title": "Lim Chen Yeow Kelvin v Goh Chin Peng",
    "ncitation": "[2008] SGHC 119",
    "coram": "Chan Seng Onn J",
    "sections": {
        "The dispute": "1       This action was brought by the plaintiff in his capacity as the sole executor and trustee of the estate of Lim Bee Bee (“Bee Bee”). The defendant is Bee Bee’s boyfriend, who had cohabitated with Bee Bee from March 2003 till her untimely death on 9 January 2007. 2       The dispute was over the United Overseas Bank Limited (“UOB”) Time Deposit Account No: 385-XXX-XXX-X in the joint names of Bee Bee and the defendant (“joint account”). This account was initially in Bee Bee’s sole name. On 25 June 2004, the defendant was added as a joint/alternate signatory to the account and the sole account was therefore converted into a joint account. It was not disputed that all the monies in the joint account were contributed by Bee Bee and no contribution whatsoever was made by the defendant. On this basis, the plaintiff argued that the presumption of resulting trust applied and monies in the joint account should revert to and form part of the estate of Bee Bee. On the other hand, the defendant submitted that the monies belonged to him as the joint account holder by virtue of his right of survivorship. 3       At the trial, the plaintiff led evidence to show that Bee Bee loved and cared for him (including his family and his mother) so much that she intended to give everything to him (including the monies in the joint account) and the plaintiff relied,inter alia,on Bee Bee’s last will, to evidence this. Plaintiff’s counsel submitted,inter alia, that Bee Bee could not have preferred to benefit the defendant over her immediate “family” (not used by counsel in the true sense of that word as it excluded Bee Bee’s own brother and sister but included the plaintiff (Bee Bee’s nephew) and the plaintiff’s mother (Bee Bee’s sister-in-law)), forsaking all such “family ties” between herself and the plaintiff and the plaintiff’s family. The defendant’s case was that the defendant and Bee Bee (both divorcees) lived together as if they were husband and wife, and by adding the defendant as a joint account holder subsequent to the execution of her last will, she clearly intended to give him the monies in the joint account as she dearly loved him. 4       In this case, three men featured prominently in Bee Bee’s life: her ex-husband, the plaintiff and later, the defendant. To try to determine what Bee Bee’s real intentions were with regards to the monies in the UOB joint account, it was necessary to understand Bee Bee as a person, her character, her generosity and her relationship with these three men. Of some importance was the question why she made the first will giving everything to her ex-husband, why she later made a second will giving everything to the plaintiff and why she subsequently allowed the defendant to become a joint account holder with a right of survivorship in the UOB joint account, in which she kept practically all the proceeds of the sale of her Australian property.",
        "Who was Bee Bee?": "5       Bee Bee was born on 20 January 1955. She had two brothers, Rosli Lim Bin Abdullah @ Lim Hui Seong (“Rosli”) and Lim Wee Kim (“Wee Kim”), and one sister, Lim Bee Lian (“Bee Lian”). Rosli was the eldest followed by Wee Kim and Bee Lian. Bee Bee was the youngest of the family. Bee Bee’s younger brother, Wee Kim, married Molly Neo Ah Heaw (“Molly”) and the plaintiff is their son (and only child of the marriage). Molly and Bee Bee were thus sisters-in-law and the plaintiff is the nephew of Bee Bee. 6       In 1973, Bee Bee started work as an air stewardess with Singapore Airlines (“SIA”) when she was 18. Both counsel informed me that she was the “face of SIA”, which I understood to mean that she was once the poster girl in the advertisements of SIA during the earlier days of the airline. In 1976, Bee Bee married one Michael Cheong (“Michael”), an air steward. 7       Realizing that air stewardesses had a “shelf life”, she decided to pursue a career which could sustain her for a longer period. When she left the airline industry, she attended at the hair dressing school “Morris Masterclass” in London. After completing her course, she returned to start a hair design and beauty salon business as a sole proprietor in 1978 with some money borrowed from her auntie and close friends. Later in 1988, she registered it as a limited exempt private company and named it Matchpoint Hairdesign & Beauty Salon Pte Ltd (“Matchpoint”). Its business premises was at Blk 340 Ang Mo Kio Ave 1, Street 32, #01-1687, which comprised a shophouse on the ground floor and a residential unit (the “flat”) above the shophouse. Matchpoint later purchased the business premises. 8       Matchpoint was run as a family business. Bee Bee and Michael were in charge of the business. Molly took care of the marketing and cooking (of both lunch and dinner) for the family and employees of Matchpoint, for which she received a gratuity of about $250 per month, which was later increased to $450 per month after her husband passed away. Bee Bee treated Molly and the plaintiff very much as part of her “family”. 9       According to the plaintiff, Bee Bee was a successful hair stylist leading a glamorous life. She was also a savvy business woman who had built Matchpoint from scratch. She was bubbly and had a vivacious personality.",
        "Bee Bee’s relationship with the plaintiff and Molly": "10     The plaintiff’s evidence was that Bee Bee always looked after him as her son, especially after the plaintiff’s father passed away in 1981 at the young age of 29 when the plaintiff was only 7 years old. She would shower him with gifts from her travels during the time she was an air stewardess. She spoilt him, never turning down his requests. Bee Bee and Michael did not have any children of their own and they adopted the plaintiff as their godson. 11     At the invitation of Bee Bee, the plaintiff and his parents moved into the flat sometime in 1979 and stayed with Bee Bee. In 1980, Molly and her family moved out as they had successfully applied for their own flat at Blk 646 Ang Mo Kio Lord 6 #06-4911. 12     After leaving school, the plaintiff started work at a hair salon in Yishun for a few months and thereafter worked for Michael as a sales executive, selling hair care products to hair salons. Michael was a director of both Matchpoint and his own business. The plaintiff also worked for Bee Bee at Matchpoint during the weekends. At the insistence of Bee Bee, the plaintiff started working full time at Matchpoint in 1999. He was about 25 years old at that time. 13     The plaintiff found that it was fun working at Matchpoint. When they were not working, Bee Bee, Molly and the plaintiff (or those present) would spend time chatting about any topic. He had great affection for his aunt, and he believed that she felt the same affection for him.",
        "Bee Bee’s marriage, separation, divorce and her first will": "14     Bee Bee and Michael had a very stormy relationship during the 1980s. They had bitter arguments at Matchpoint over Michael’s womanising, gambling and his demands for money from Bee Bee. The plaintiff would try to comfort her as these quarrels left her distraught. 15     In June 1983, she decided to separate from her husband. In the deed of separation, she covenanted with Michael that each should live separate and apart and be free from marital control and each would have full independence in his or her affairs, and both parties agreed to free each other from their duty to cohabit. Bee Bee also ensured in the deed that their separation should not in any way adversely affect their joint business in MatchPoint and they mutually covenanted to do their utmost for the benefit of the business including the preservation of the status quo and to indemnify each other against all debts or liabilities that the other might subsequently contract. 16     Despite her many bitter quarrels with Michael, the legal separation and Michael’s unabated philandering, I understood from the evidence of the plaintiff and Molly that Bee Bee continued nevertheless to love Michael deeply. They continued to stay together in Matchpoint after the separation. 17     On 13 April 1987, Bee Bee filed a petition for divorce on the ground that the marriage had irretrievably broken down, statinginter alia, that: (a)    She and Michael had abided by the deed of separation; (b)    Michael had shown indifference to the marriage and detachment to her, remaining uncommunicative and unapproachable; (c)    Michael had further shown repugnance over any intimacy and had ignored her whenever the subject of marriage cropped up; (d)    The marriage had broken down to the extent that Michael had shown no feeling and affection for her and for all intents and purposes, lived a separate life from her; (e)    She had questioned Michael about his registration as a guest in Great Eastern Hotel, Macpherson Road on 29 July 1986 and Michael admitted committing adultery with another woman. 18     However on 20 November 1987 when Bee Bee made her last will and testament (the “first will”), she still gave all her real and personal property to Michael. One would imagine that Bee Bee, having already filed for divorce, would not bequeath anything to Michael in her will. Why then did she give everything to Michael in her will? With their marriage on the verge of breaking up and if she really had to make a will, why did she not decide then to leave everything in her will to the plaintiff, for whom she had great affection? Instead, she left nothing to the plaintiff in this first will of hers. 19     All this perhaps could only be fathomable if one could understand that Bee Bee’s “great affection” for the plaintiff as her godson and nephew was very different from and cannot be equated with Bee Bee’s “love” for Michael, which I understood from the evidence of the plaintiff and Molly to have been one of “romantic and intimate love and affection”. It must have been the “romantic and intimate love and affection” that influenced her to bequeath everything she had to Michael and to him alone, in spite of everything that Michael had done which caused her emotional grief and to file for divorce. 20     Despite Bee Bee’s unhappiness with Michael’s philandering, her legal separation from Michael for more than 4 years since June 1983 and her petition for divorce in April 1987, Michael remained the “love of her life”, a description that the plaintiff himself had given on how Bee Bee felt about Michael. I believed that it was “love” that enabled her to remain so forgiving and so generous to Michael in her will after all that he had done. “Great affection” for the plaintiff appeared to have taken second place. Her “love” for Michael took precedence. Indeed if the amount of legacy Bee Bee intended to provide for a person in her will were to be a reflection of the extent of Bee Bee’s love, care and concern for that person, then it would appear that she showed far more love, care and concern for Michael than she did for the plaintiff and the plaintiff’s family at least during the period of 12 years from 1987 (the first will) to 1999 (the second will). 21     About three months after making her will, the divorce proceedings ended and they were eventually divorced in January 1988. Notwithstanding their divorce, Bee Bee and Michael did not make a clean break according to the plaintiff. They continued to live with each other for short periods of time. It was only much later that Michael left Matchpoint. 22     As could be seen, Bee Bee was indeed quite an extraordinary lady who tolerated all of Michael’s philandering and yet, she could still continue to cherish that “love” she had for Michael.",
        "Events leading to the change of Bee Bee’s first will": "23     When the plaintiff grew older, Bee Bee often talked to him about her relationship with Michael. Bee Bee told him that Michael was the love of her life and it was difficult for her to let go. She always thought of Michael as a brilliant person and a businessman but he could not remain loyal and faithful to her. She also confided in the plaintiff that Michael was having an affair with a Korean air stewardess. At the material time, he was having another affair with one of Matchpoint’s junior hairstylists. 24     Bee Bee told the plaintiff that she could accept all his affairs save for the one with Matchpoint’s then junior hair stylist. She viewed this as a smite to her as the “lady boss”. Michael promised that he would cut ties with the junior hair stylist. But in 1999, Bee Bee discovered that Michael had continued his affair with the junior hair stylist breaking his promise not to do so. That was the last straw for Bee Bee. It was the last betrayal so to speak, and it must have been so emotionally upsetting and painful for Bee Bee that she decided to change her first will. She must have been so deeply hurt that she decided to give everything instead to the plaintiff. 25     Bee Bee brought the plaintiff to the office of M/s Drew and Napier and executed a new will on 16 November 1999 (the “second will”) and revoked her previous will. Bee Bee appointed the plaintiff as the sole executor and trustee and named the plaintiff as the sole beneficiary of all her assets. 26     The lawyer handling the matter recorded the following short attendance note: Attendance Note: she read her new Will and said it was alright. She said she would inform her husband but felt it was also necessary for us to tell him of the change in her Will. A letter was dictated to be sent to him. 27     The letter from Drew and Napier dated 24 November 1999 stated: We act for Ms Lim Bee Bee. We are instructed by our client to inform you that she has changed her last Will dated 20 November 1987. Accordingly, she has asked us, to inform you that you are free to change your Will if you so wish. 28     The above manner in which Bee Bee handled her affairs indicated to me that she would make her intentions known clearly, especially in matters concerning her assets, and what would become of them after her death. There were no ifs and buts so to speak. 29     Bee Bee also told the plaintiff that she would leave everything to him upon her death instead of her ex-husband because Michael had essentially betrayed her by breaking that promise to her. After Michael’s betrayal, I believed that she really had no one else left to devote her love and affection except her nephew and godson. It was no surprise to me then that she executed the second will, this time leaving everything she had to the plaintiff. But it must be remembered that at this point of time, the defendant had not yet entered her life, which complicated matters for the plaintiff as the evidence would later show. 30     Counsel for the plaintiff relied heavily on this second will to show that Bee Bee’s intention had been all along to give all the monies in the UOB joint account to the plaintiff. Since Bee Bee never altered or revoked her second will, it indicated that her position remained the same. 31     However, as the evidence would later show, the personal situation of Bee Bee changed substantially after the second will and she had taken steps to convert her sole account into a joint account on certain terms and conditions. See [79] to [84] below. It must be remembered that Bee Bee always retained the right and ability to change her mind on how her money should be distributed. Changing her will was not the only course open to her and she could always, for example, make aninter vivosgift. As would be explained later, I found that she intended to give those monies in the joint account to the defendant.",
        "Matchpoint to be given to the plaintiff": "32     The only person who could really shed light on Bee Bee’s intentions would be Bee Bee herself. Sadly she passed away. Without her evidence, the court would have to rely on documentary evidence such as her wills and the mandate she had signed with regards to the joint account; other witnesses’ testimonies on her conduct and her manner of dealing with her assets and properties when she was alive; and any other reliable oral evidence of what she had said to the witnesses concerning her intentions with regards to her assets and properties at different points of time in her life (which could well change from time to time). All the relevant evidence would have to be carefully evaluated, weighed and analysed before the court eventually makes any finding of fact on the question of her true intention with regards to the monies in the UOB joint account. 33     Molly stated in her affidavit that Bee Bee often mentioned that Matchpoint would be handed to plaintiff when he was ready. During her conversations with Bee Bee,Bee Bee always said that should she pass away, whatever she owned would belong to the plaintiff. However Molly did not make clear in her affidavit during which of the following periods of Bee Bee’s life did those conversations (in italics in the previous sentence) take place: (a)    Could they have taken place during the period from 1978 (when she started Matchpoint) to November 1987 (when she executed her first will)? I doubted that such conversions would have taken place during this period as it was prior to the execution of the first will in which she bequeathed everything to Michael and nothing to the plaintiff. (b)    Could these conversions have taken place during the period from November 1987 to November 1999 (when she executed her second will)? I doubted it because if Bee Bee had passed away during this period, everything she owned would have gone to Michael and not to the plaintiff under the terms of her first will. (c)    Could these conversions have occurred during the period from November 1999 to June 2004 (before she converted her UOB account into a joint account with the defendant)? Perhaps so, because this was the period before she took the trouble in June 2004 to add the defendant as a joint account holder to the UOB account holding the Australian fixed deposits. (d)    Could these conversations have continued in the period from June 2004 (after the creation of the joint account) to January 2007 (when she passed away)? I did not think that those conversations would likely have continued during this latter period since the defendant had entered Bee Bee’s life in a very intimate way and she had specially taken the trouble and effort to set up the joint account in June 2004. Furthermore, she never changed the joint status of that account at any time thereafter. Even if she did mention during this period to Molly that whatever she owned would belong to the plaintiff, it was more likely than not that Bee Bee meant it in a very general way. She probably did not mean to cover the monies in the UOB joint account. It was very significant that she never revealed to either the plaintiff or Bee Bee that she had in fact converted the UOB account into a joint account with the defendant as the other joint/alternate account holder. 34     Though Molly might have wished to imply that those alleged conversations did continue after Bee Bee converted her UOB account into a joint account with the defendant, I had my doubts in the light of the vagueness and lack of clarity of her averments in her affidavit in relation to the periods during which those alleged conversations took place. To have greater evidential value, Molly should have specified more clearly in her affidavit whether or not these conversations (in italics above) had also occurredafterBee Bee had converted her UOB account into a joint account with the defendant. I could not attribute much evidential value to this part of Molly’s evidence if it was meant to show that Bee must have intended also to devise and bequeath the monies in the UOB joint account to the plaintiff (apart from Matchpoint and all her other real and personal property). 35     The plaintiff said that Bee Bee had openly declared to her family, friends and customers that Matchpoint would be transferred to the plaintiff eventually. The plaintiff testified that he had put his heart and soul into this business so that Bee Bee would not have cause to be disappointed with him. Furthermore, Matchpoint was the business that provided for the plaintiff and his family until the present. 36     After the plaintiff joined Matchpoint full time in 1999 (which was in the same year that the second will was executed), Bee Bee slowly handed over control of Matchpoint to him. As part of her plan to groom the plaintiff as her successor, she arranged for the plaintiff to attend various courses in hair styling. This evidence corroborated other evidence that Bee Bee was the kind of person who would plan far ahead. She did not appear to me to be a person who would merely leave things to chance or would leave things unresolved if it was in her power to do something about it. 37     According to Molly, she was aware that the Bee Bee had planned to move out from the residential unit above Matchpoint when she finally retired. She had enquired about HDB units at the Toa Payoh HDB hub. Bee Bee told Molly that she would use the monies/interest from her Australian dollar account to pay for a new place as she would qualify to buy a HDB Studio Apartment when she was 55 years old. She added that a studio apartment was very cheap and she could purchase it in her sole name. This again showed the planner that was Bee Bee. 38     She said that when she retired, she did not want to see Matchpoint again. The plaintiff would be looking after the business and she could enjoy herself, free from troubles. In 2006, she told Molly that when she moved out, she wanted the plaintiff and Molly to move back to stay at Matchpoint.",
        "Bee Bee’s investment in a property in New South Wales, Australia": "39     Bee Bee was a successful business woman with varied investments. In May 1994, she purchased a flat in Australia known as Unit 203, Darling Court at Haris Street, Pyrmont NSW (“Darling Court”). On 6 May 1994, Bee Bee granted a power of attorney to her sister, Bee Lian, who was ordinarily resident in Sydney to handle the purchase and later the sale of Darling Court. Before she sold the property, it was rented out and Bee Bee used the rental income to support Bee Lian financially by paying for Bee Lian’s children’s education in Australia. When Bee Bee sold the property, Bee Bee also made a gift of A$50,000 to Bee Lian. When asked if Bee Bee was a very generous woman, the plaintiff agreed that she was. But when asked if Bee Bee could also be generous towards the defendant, the plaintiff did not think so because the defendant was financially self-sufficient and they were together just for companionship. From Bee Bee’s conduct, she appeared to me to be a very generous person. 40     In late 2003, Bee Bee took steps to sell Darling Court. It was eventually sold for about AUD$348,000. After making a gift of AUD$50,000 to Bee Lian and after deducting the loan repayments, legal costs and expenses, the balance of the sale proceeds amounting to AUD$258,427.37 was paid by way of cheque to Bee Lian, acting as proxy for Bee Bee. Thereafter, Bee Bee authorized Bee Lian to telegraphically transfer the sum of AUD$240,500 to the UOB Account No 385-XXX-XXX-X. Prior to this transfer, Bee Bee had AUD$16,909.96 placed on a 12 month fixed deposit commencing on 30 October 2003. 41     Bee Bee had apparently “bought over” this UOB account from her brother Rosli. At the date of her death 9.1.2007, the balance in the UOB account stood at AUD$273,069.43, which formed the subject matter of this suit.",
        "Plaintiff’s evidence on the UOB joint account": "42     The plaintiff made the following averments in his affidavit to show that the monies in the UOB joint account were intended to be given to him: (a)    Bee Bee had referred to the joint account as “my Australian account”. (b)    Due to the superior exchange rate and the better bank interest rates for foreign currencies, Bee Bee stated that this method of investment was more economically sound than investment in property alone. (c)    Bee Bee wanted to accumulate this superior interest and “grow” her money in that way. (d)    Bee Bee intimated to the plaintiff sometime in 2006 that the monies in the Australian account would be given to the plaintiff to help financially with the operation of Matchpoint. It had been her intention that Matchpoint would be given to the plaintiff when she passed away. (e)    The plaintiff believed that Bee Bee knew the sum of monies was essential to keep Matchpoint running should she suddenly pass away. Putting it into a joint account with the defendant would allow the monies to be withdrawn without the formalities of probate. Under the circumstances, there could be continuity in the running of Matchpoint. (f)     Bee Bee did not specifically mention that the defendant held the Australian account jointly with her. However, she stated unequivocally that if she were to pass away, the defendant would “take the money out” and return it to the family. [My observations: I observed that Molly supported the plaintiff’s evidence in this regard when she said that in or around late 2006, during one of her conversations with Bee Bee regarding the defendant, Bee Bee told Molly that the defendant was a civil servant, an honest and religious man, who was not greedy and financially self sufficient. Bee Bee added that in these circumstances, he would “take the money out” and return it to benefit the plaintiff’s family if she were to pass away. Molly alleged that this conversation took place a few months before her death. At this juncture, it would be appropriate for me state that I found this evidence of the plaintiff, which Molly corroborated, to be rather contrived. Why would Bee Bee refuse even to tell either the plaintiff or Molly about the existence of the UOB joint account with the defendant as a joint account holder with her, and yet tell the plaintiff “unequivocally” that the defendant would “take the money out” and return it the family? This evidence that Bee Bee had stated that so “unequivocally” sounded rather contrived and unbelievable. The plaintiff did not seem even to have asked or clarified with Bee Bee how it was possible for the defendant to “take the money out” of her account after her death, and what “money” she was talking about. Neither did Molly. Second, there was also no evidence that this was ever said in the hearing of the defendant so that the defendant would have been informed clearly by Bee Bee that it was his duty to “take the money out and return it to the family” after her death. If the defendant were to be constituted as a trustee by Bee Bee, it did not appear to me on the evidence that Bee Bee had ever told the defendant that he was only to be a mere trustee for the monies in the joint account which were meant for the benefit of the plaintiff and his family, and that he was not entitled beneficially to the money in the joint account upon her death.] (g)    Bee Bee told the plaintiff sometime in 2006 that she wanted to use the balance and/or interest in the Australian account to purchase a studio apartment for senior citizens in her own name. (h)    The plaintiff admitted having no sight of the bank records of the Australian account during Bee Bee’s lifetime. [My observations: Contrast this evidence with the defendant’s evidence that he had been shown the UOB joint account bank statements by Bee Bee.] (i)     The transaction records obtained from the bank subsequent to her death showed that the account was mainly used for the accumulation of interest. (j)     Only two withdrawals were made of AUD9,000 in October 2004 and AUD3,000 in October 2005 at the time of the expiry of the fixed deposits by Bee Bee. (k)    Bee Bee had told the plaintiff that she thought of the defendant as an honest man and not greedy by nature. She said that the defendant was entirely self-sufficient financially. (l)     The plaintiff then concluded in his affidavit that he verily believed that under these circumstances, Bee Bee had no qualms about the plaintiff being a joint account holder, that Bee Bee could only have intended that the monies would be used as working capital of Matchpoint or be given to the plaintiff absolutely, and that, as Matchpoint was the company which provided for the plaintiff and his family, these were practically the same thing. [My observations: The above had more to do with the plaintiff’s own analysis, inferences and conclusions, which were in my view of little value and weight as they did not constitute evidence of what Bee Bee had told the plaintiff when she was alive. As I had stated earlier, I was all the time at the trial focussed on searching for, examining and considering evidence of what Bee Bee had in fact said, told them or had done during her lifetime so that such evidence could be closely scrutinized and analysed to determine what her real intentions were with regards to the joint account.] (m)  The plaintiff further asserted his firm belief that Bee Bee was savvy and knowledgeable enough to make the arrangement (i.e.putting the defendant as a joint account holder) such that formalities of probate would not need to be undertaken before the family could receive the monies, and there would be no hindrance to the cash flow of Matchpoint should she pass away suddenly. [My observations: First, from the manner this was asserted in the affidavit, it was clear to me that this was not what Bee Bee had in fact told the plaintiff. Second, it was another one of those conclusions and beliefs of the plaintiff, which was probably more suited for submissions by counsel than as evidence in an affidavit for the trial. Third, the essential logic of the plaintiff’s belief and conclusion escaped me. Why did she not put the monies in the joint account with the plaintiff as this would have been the most convenient, straightforward and logical way to do it. It was not as if the plaintiff was an infant in 2004. Even if that were the case, why did Bee Bee not arrange to have Molly as the joint account holder? In any event, in June 2004 when the conversion to a joint account was made by Bee, the plaintiff was already 30 years old, married with two children, and presumably a responsible husband and father. Why was there the need to go through the convoluted route to use the defendant to hold the money basically in trust for the plaintiff? I could find no plausible or sensible explanation if the assertions of the plaintiff were correct. The explanation offered by the plaintiff during cross-examination (part of which had a factual element) was that Bee Bee could not trust the plaintiff with money. The plaintiff’s “head would become too big” for his own good if he had so much money (i.e. were he to be made a joint account holder). If what the plaintiff said were true, it would be incongruent that Bee Bee was able to trust him with her business in Matchpoint, which she had already willed to him, and yet Bee Bee did not trust him enough to add him as a joint account holder for the monies in the joint account, which the plaintiff alleged she had intended for the business of Matchpoint. In my judgment, the plaintiff was simply concocting his evidence during his cross-examination that Bee Bee did not want to have him as a joint account holder with her because at that time Bee Bee could not trust him with so much cash but she had instead trusted the defendant, who would then have to hand it over to the plaintiff upon her death.] 43     With regards to the manner of operation of the UOB joint account during Bee Bee’s lifetime, counsel for the plaintiff submitted that after the addition of the defendant’s name to the joint account, Bee Bee maintained total control over the joint account. The defendant could not demonstrate that he had procured or asserted any control over the account after 25 June 2004. He had little or no knowledge of any dealings with the account. This would be evidence in the plaintiff’s favour from which one could infer that Bee Bee treated the monies exclusively as hers and she never intended to give the monies to the defendant. But this piece of evidence by itself was certainly not sufficient in my view to change my overall finding, which was based on an evaluation of the totality of the evidence rather than a microscopic analysis of each piece of evidence standing alone. 44     I noted in the evidence that during Bee Bee’s lifetime, she never made withdrawals from the UOB joint account for the benefit of Matchpoint in 2006 and 2007, which indicated that Matchpoint was not in any cash flow crunch. All that was ever adduced by the plaintiff in court was that Matchpoint was financially tight but never in trouble. Further, there was no evidence that in the months prior to Bee Bee’s death in January 2007, Matchpoint was not doing well and that the business would not survive without the monies from the UOB joint account for Matchpoint’s cash flow, which was what the plaintiff attempted to portray. Counsel for the plaintiff wanted me to infer that Bee Bee could not have acted to prejudice the financial health of Matchpoint by giving away her largest “liquid asset” to the defendant. 45     In response, counsel for the defendant rightly emphasised that Matchpoint, through the hardwork and business acumen of Bee Bee: (a)    Generated enough income to purchase the Australian property, which she used to generate rental income for Bee Lian’s daughter’s education; (b)    Earned Molly enough money to purchase her own HDB flat; (c)    Earned Molly enough money so she could save at least $40,000 which she used to pay for the renovation of the plaintiff’s matrimonial home; (d)    Earned the plaintiff enough money so that he could, with the joint income of his wife, afford his own HDB flat; (e)    Earned the plaintiff enough money to purchase a large MPV, even if it was used for Matchpoint’s customers; (f)     Earned the plaintiff enough money to hold a fairly lavish wedding dinner; (g)    Enabled the plaintiff to upkeep his two children and pay for his trips to China; (h)    Was financially stable enough to pay for various holiday trips, including one trip to Japan in which she paid for the defendant; and (i)     Generated enough money to fully pay for the shop it occupied which would now be worth anywhere between $800,000 to $1,000,000. 46     The above showed to the contrary that Matchpoint was doing fairly well and was financially stable up to the time of her death, thereby extinguishing any possible inference that giving away her largest “liquid asset” to the defendant would have prejudiced the financial health of Matchpoint. Bee Bee did not deem it fit even once to take any money from her UOB joint account to help out in the finances or cash flow of Matchpoint. No audited accounts were produced by the plaintiff show in what way Matchpoint was in financial trouble (if any). Since January 2007 till the date of this trial in June 2008, no evidence was produced to show any financial crisis was experienced, which proved that the monies in the UOB joint account were never in fact needed for the cash flow of Matchpoint, and that Matchpoint in the months leading up to the time of Bee Bee’s demise in January 2007 was not in dire need of cash infusion. 47     As for the interest free loan of $48,000 she took from the defendant (see [70] to [76] below), this did not, to my mind, indicate that any real cash flow problem had arisen in Matchpoint that could not be overcome. It was simply shrewd financial planning by Bee Bee as she could then continue investing her monies in an high interest bearing fixed account in Australian dollars to generate good interest income and to take advantage of any possible currency appreciation of the Australian dollar against the Singapore dollar, whilst using an interest free loan provided by the defendant for the operating cash flow of Matchpoint. Further, Matchpoint had an overdraft bank account secured on its property. Bee Bee, as a savvy businesswoman must have known that the bank would charge a fairly high interest rate on overdrawn amounts in Matchpoint’s overdraft account. Using the “interest free” money from the defendant’s loan was certainly the better alternative. Once again, it reinforced my view that Bee Bee was also a financially savvy and prudent lady, who want to would reduce Matchpoint’s borrowing costs if she could, and she did. 48     In any event, with the large amount of money she had in the UOB joint account, I believed that she did not really need to take the relative small loan from the defendant from the very beginning. But as explained earlier, she did it out of very sound business and investment reasons. Further, she could easily have repaid the $48,000 loan in full at any time if the defendant wanted the money back (eg by liquidating some of the Australian fixed deposit or using Matchpoint’s overdraft facility).",
        "Defendant’s relationship with Bee Bee from the perspective of Molly and the plaintiff": "49     The plaintiff, in attempting to bolster his claim at the trial, initially attempted to downgrade the close intimate, romantic and loving relationship that he knew existed between the defendant and Bee Bee to that of a platonic relationship by referring to them as mere “companions”. Molly, who knew more, also did the same by referring to Bee Bee and the defendant as “friends” and when counsel for the defendant cross-examined Molly on whether they were more than just friends, she testified that their feelings towards each other were as between friends and “not husband and wife”. 50     Both the plaintiff and Molly refused to acknowledge that, to all intents and purposes, Bee Bee and the defendant were living together as husband and wife, although Bee Bee was apparently quite open about it. In fact, the plaintiff said that Bee Bee was “very open” and “very liberal”. 51     By not being forthright under cross-examination and by slanting their evidence initially to suit the plaintiff’s case, when both of them ought to have known of the nature of Bee Bee’s relationship with the defendant, it did to some extent affect their credibility and did cause me to scrutinise carefully whether they could be telling or embellishing the truth when it came to the other crucial disputed aspects of the case. Of course, I must still carefully consider all the relevant circumstances surrounding and pertaining to each disputed fact before I decide whether to believe or disbelieve their evidence on each disputed fact, and there were a number of disputed facts in this case. It would be wrong to disbelieve every aspect of the plaintiff’s or Molly’s evidence simply because I disbelieved them on one part of their evidence or for that matter, they had been shown not to have been forthright in another part of their evidence. 52     For clarity, I have set out below the evidence that the plaintiff and Molly gave (to shore up the plaintiff’s claim) that Bee Bee and the defendant were not living together as husband and wife and were not in a loving and romantic relationship. According to the plaintiff, Bee Bee told him that her relationship with the defendant was due to a need for companionship. Bee Bee told the plaintiff that the defendant had proposed to her but she declined for the following reasons: (a)    Both Bee Bee and the defendant were not young anymore and marriage at their age would be pointless; (b)    They were companions and this arrangement was suitable and did not need to be changed. 53     Although they lived together, the plaintiff said that they carried out their financial affairs as two separate households. Bee Bee paid for all the household expenses pertaining to the shophouse and the flat. 54     Molly asserted that the Bee Bee never regarded the defendant as part of her family and Bee Bee had always represented in her lifetime that she would look after the plaintiff and her family. 55     Molly averred in her affidavit that although, they lived under the same roof, Bee Bee and the defendant kept separate lives. He spent most of his time pursuing the sport of table tennis. Bee Bee was a private person who enjoyed spending time by herself. Even on weekends, they seldom went out. Their characters were also opposite. Bee Bee was a very efficient person who enjoyed getting things done immediately. She was also a former flight stewardess and a savvy business woman who was bubbly and vivacious. On the other hand, the Defendant was laid back. He had a very “honest” appearance and seemed like a simple man. Bee Bee would complain to Molly me that the defendant took ages to perform even simple tasks. 56     During their conversations, Bee Bee told Molly the following about the defendant:- (a)    He was an officer in the Army and should be honest; (b)    He was a divorcee; (c)    He was very thrifty; (d)    He was self sufficient; (e)    He was very careful with his money; and (f)     He was not a greedy man. 57     Bee Bee said that she appreciated these qualities in the defendant as Michael, her ex-husband, always placed too much emphasis on money. According to Molly, Bee Bee told her that the defendant did propose to her at the start of their relationship. However, Bee Bee did not want to get married again and that the arrangement she had with the defendant was suitable given their circumstances. 58     The defendant was described as “boring” by the plaintiff compared to the sports car driving, long haired and flamboyant Michael. Basically, the defendant, a career warrant officer in the airforce, was the exact opposite of Michael. According to the plaintiff, Bee Bee had said that the defendant was a “dull person”. The plaintiff even gave evidence that Bee Bee did not feed the defendant the way she fed Michael. The plaintiff said that Bee Bee did not like many of the overseas trips with the defendant. At this juncture, I would pause to observe that if the plaintiff did not embellish his evidence, then I could not understand why she still went with him on holidays overseas time and time again. 59     The plaintiff further said that Bee Bee complained a lot about the defendant, yet never separated from him. The plaintiff wanted to create the impression that Bee Bee was unhappy with the defendant and their relationship was nothing much to speak about when compared to that with Michael. So counsel for the defendant in cross-examination asked the plaintiff if he knew or did not know whether Bee Bee was happy with the defendant. The plaintiff reluctantly admitted that when they were together, they appeared to be loving. 60     In the plaintiff’s closing submissions, counsel had no alternative, in the light of the fairly overwhelming evidence (including photographic evidence), but to concede that Bee Bee and the defendant had a “boyfriend/girlfriend” relationship but qualified that concession by stating that the defendant’s averment of “great love” was overstated.",
        "Defendant’s evidence of his relationship with Bee Bee": "61     The defendant gave evidence that both he and Bee Bee studied in Willow Ave Secondary School from 1969 to 1972. After they left school, they lost touch for some 30 years. They met again at the school gathering at Raffles Town Club in December 2002. They renewed their friendship and started dating. Their feelings towards each other grew and later, they fell in love. Upon hearing that the defendant’s ex-wife was taking over his interest in his matrimonial flat, Bee Bee invited the defendant to move in and live with her. He did so sometime in March 2003 and shared the same bedroom with her. 62     The defendant averred in his affidavit that he lived with Bee Bee, for all intents and purposes as her husband, from March 2003 till her death. 63     According to the defendant, both of them had bitter experiences of married life and the divorce proceedings thereafter. Both of them (now divorcees) chose not to be married but were content to live together as husband and wife at the flat above the shop premises of Matchpoint. This evidence was corroborated by Molly’s admission during cross-examination that she heard Bee Bee talk about her sexual relationship with the defendant. 64     The following averments in the defendant’s affidavit constituted crucial evidence in support of the defendant’s defence: 18     During our time together, I was introduced to all of Bee Bee’s family as her boyfriend. We always attended all family functions like New Year dinners and ceremonial visiting at her father’s home & brother’s home together as a couple. We were acknowledged by Bee Bee’s family as a couple. We really shared their lives together. 19     She used to tell me that knowing me was the best thing to happen to her in life and that he had given her happiness. 20     In the four years we were together, we never quarrelled before but had always supported each other when either encountered difficulties in life. I know this is hard to believe that after our divorce experiences, all we wanted to do was to look after each other. 21     As a couple, we toured Japan, Bangkok, Genting Highlands & the last place was Angkor Wat in Cambodia. As we were financially sound, we paid for our own expenses save for the trip to Bangkok where I paid for everything. 22     Bee told me one day in 2004 that she had sold off her property in Australia and that she had deposited the proceeds in her UOB bank account. She told me that we were in effect husband and wife, though not married, she was very happy with me and she intended to pass the money in that bank account to me in the event of her death. She said that if anything were to happen to her, she would make me rich. 23     I remember it was a Saturday when Bee Bee asked me to follow her to her bank. We both went down to the branch and she asked the counter staff how she should go about adding my name as a joint name in the account and for the necessary forms to do so. 24     I remember signing all the documents that the staff gave to me to sign. She had clearly wanted to add my name as a joint name so that I would be beneficiary of the monies should she pass on before me. 25     I remember clearly that it was her decision to also make the signing mandate as an “and/or” mandate to draw money from the account. 26     We both left the money in the account, largely untouched, to earn interest. Every time when she received the statement of account, she would tell me ‘dear our money is growing’. 27     Bee Bee did tell me that she did not think it was necessary to change her will as she was of the view that the rule of the right of survivorship applied to the bank account, i.e., should either of us die first, then the other would indisputably be entitled to the entire sum of monies. 28     ….. 29     I was aware of the contents of the will long before it was opened as Bee Bee had shared with me everything. This is the extent of how much we had shared our lives together. 65     Having seen him testify and having seen the photographs of them together and the way they stood next to each other or held each other, I had no hesitation in accepting his evidence above. I however doubted that Bee Bee would ever have used the words “the rule of the right of survivorship” when she spoke to the defendant (see paragraph 27 above). Nevertheless, I accepted the defendant’s evidence in his affidavit that Bee Bee had told the defendant something to the effect that if she passed away, the defendant would get the monies in the UOB joint account, which counsel in the affidavit had paraphrased in legal language as “the rule of the right of survivorship”. Counsel in my view should generally avoid inserting legal language into affidavits which would not represent what witnesses actually said, because it might create an air of artificiality, which could then throw that evidence into some doubt. A non-legally trained person would not likely use legal terms or legal language in their ordinary conversations. 66     The defendant was religious and a keen follower of Soka Buddhism. He certainly was not a serial philanderer. He was devoted to Bee Bee and to her alone as far as I could see. I asked the defendant: Court:       Can you tell me what is the most wonderful thing you have done for her? All I hear is a lot of things she’s done for you. What do you think is the most wonderful thing you have done for her? Witness:    I return her love. I al—I—I love her. I love her deeply also. And I know that she’s sick. I always listen to her problem. And in fact, she told me that, er, in her life, the best thing that happened is knowing me and that she got no regret knowing me because I gave her lots of happiness and, er, she also say that I’m a man of no vice, that means I don’t womanise, I’m not a gambler; I’m a sincere, truthful man. 67     That spontaneous answer above sounded as if it came from his heart. The defendant further testified that after Bee Bee passed away, he could not sleep properly for the next 10 days. For the first 3 days, he could not even close his eyes. He was very, very sad. During the daytime, he could not focus because she was always on his mind. There were many, many nights he cried thinking of her. The pain was sometimes unbearable for him. Whenever he thought of the happy times they were together, and how nice she was to him, the defendant would start crying. Even till today, the defendant had been praying for her daily in his morning and evening prayers, with each prayer lasting about 10 minutes. At the anniversary of her death in January this year, the defendant said he actually went to the sea to throw some flowers as Bee Bee’s ashes were scattered at sea. 68     I was impressed by his evidence of the depth and sincerity of his love for Bee Bee. It was quite apparent to me that he truly loved her. For Bee Bee, it must have been a breath of fresh air and a world of difference between the defendant and her ex-husband Michael. I could see that the defendant was very devoted to her and adored her. The cynic might say, of course, that was the case because Bee Bee was pretty and very generous towards him. The more important question was whether Bee Bee reciprocated his love, and what could have been the natural consequences of the power of that love, and what acts of generosity (if there was any at all) that could have flowed it. On this, I had no difficulty in concluding from the evidence that she probably loved him just as much as he loved her. I did not believe that she would not have been generous to the man she now loved dearly. 69     Soon after her death, the plaintiff gave the defendant notice to move out. In order to avoid a nasty dispute, the defendant moved out. This evidence signalled to me that there could be underlying currents, and perhaps even ill-feelings between the plaintiff and the defendant, that was simmering between them even before Bee Bee’s death. I would not be surprised that the thought that Bee Bee might give something to the defendant in her lifetime (to the detriment of the plaintiff, who knew that he was the sole beneficiary of Bee Bee’s will) might well have crossed the plaintiff’s mind even before Bee Bee’s demise. Basically, the closer the defendant was to Bee Bee, the greater would be the threat to the size of the plaintiff’s inheritance from Bee Bee’s will.",
        "The defendant’s $48,000 loan to Matchpoint": "70     The defendant gave evidence that at the beginning of 2004, Bee Bee informed the defendant that she needed money to renovate Matchpoint and to pay for the stocks she ordered for the salon. Matchpoint was not doing well in 2004. Bee Bee said that Matchpoint needed “hard cash”. The defendant clarified in his evidence that it wasafterthe UOB joint account had been set up on 25 June 2004 that Bee Bee asked the defendant how much he could lend to her. To help out, the defendant offered to lend to her his savings of $48,000, which Bee Bee accepted. The defendant thereafter issued a cheque dated 28 June 2004 and it was made payable to Matchpoint. Bee Bee told the defendant that his loan to Matchpoint was recorded in her 2004 business accounts. 71     As the loan was given only 3 daysafterthe date the UOB joint account was set up, counsel for the plaintiff had used that close time interval to suggest that the joint account was set up as a security for the defendant’s loan of $48,000. This issue would be considered with in more detail later in [105] below. 72     At this juncture, it would be pertinent to note that this $48,000 constituted almost the entire cash savings of the defendant (apart from his CPF monies and some money tied up in his Supplementary Retirement Scheme). This money came from the sale of the defendant’s 4 room HDB flat after his divorce. I regarded that it was quite generous and trusting of him to lend essentially to Bee Bee his entire life savings without any interest and with no specified repayment date. 73     To help in the daily expenses since he was living with her, the defendant had also offered to pay her $5,000 which was about $100 per month, in the fourth year of his living with her. The defendant proposed to Bee Bee that the $5,000 be deducted from the $48,000 business loan leaving a balance of $43,000 to be repaid. 74     Later in 2006, after Bee Bee heard that the defendant’s son from his 1stmarriage needed money for his education, she started to repay the defendant the money by way of cheques and cash. From the balance of $43,000, only $8,000 was left to be repaid. 75     As I explained in [105] below, the loan taken from the defendant in 2004 was due more to Bee Bee’s shrewd financial planning rather than an absolute need for cash, as she had ample liquidity with the large amount of cash (albeit in Australian dollars) in the UOB joint account. 76     I would not be surprised that Bee Bee would be deeply touched by the depth of his love, care and concern for her that he was so ready to lend to her nearly all the cash savings he ever had at that time. The defendant literally emptied his bank account to give that loan to Bee Bee. The defendant might have been “dull” and uninteresting, but Bee Bee valued him for his other qualities and would in all probability have reciprocated the defendant’s love, care and concern for her.",
        "Joint account not known by other family members": "77     The defendant’s evidence was that the UOB joint account was a matter only between Bee Bee and himself. Bee Bee believed that there was no need for others to know. The defendant asserted that it was he who told Bee Lian, Rosli and the plaintiff about the UOB joint account after Bee Bee’s death. They did not know about it. Molly herself admitted that Bee Bee never told her that the defendant was the second name in the UOB joint account. The inference from this important fact was that Bee Bee kept it a secret from them as she probably knew that they would not be happy with what she did as it meant that the plaintiff would not be getting the money in that UOB account should she pass away. If Bee Bee had told them of it, they would immediately view the defendant as an intruding third party, entering Bee Bee’s life, encroaching on and threatening the plaintiff’s rightful share of the inheritance under Bee Bee’s second will. Unnecessary tensions, jealousy and ill will would arise. Their feelings could also be hurt that Bee Bee did not care as much for them and was instead caring for the defendant so much as to give him all the monies in the UOB joint account. Disclosing the secret would be sowing the seeds of jealousy, hatred and ill-will in her “family”. 78     I would not believe that the thought never passed the minds of the plaintiff and Molly that Bee Bee was entitled at anytime to change her will once again. In my view, it was insightful of Bee Bee to have kept that fact a secret not only from Bee Lian and Rosli, but also from the plaintiff and Molly, whom she was so close to. Indeed, if she had intended the beneficial interest in the account to remain with the plaintiff, there would have been no need to hide that secret. If she had intended the defendant merely to hold the money in trust for the plaintiff or Molly, then it was in my view, more likely than not, that Bee Bee should have told the plaintiff and Molly (in order to safeguard their interests) that the defendant was merely a trustee holding the monies in the UOB joint account for them as beneficiaries. This would also ensure that the defendant could not simply assert otherwise after her death that the monies in the joint account were his should he survive her. There was also no evidence from Molly or the plaintiff that they had also heard Bee Bee informing the defendant that he was a trustee of the monies for either the plaintiff or Molly or for both of them. What I had was evidence to the contrary from the defendant that Bee Bee had told him that he would be the beneficiary of the monies in the joint account should she pass on before him. I believed the defendant’s evidence.",
        "The Terms and Conditions of the UOB joint account": "79     The UOB application form dated 25 June 2004 to convert the UOB account to a joint personal account in the joint names of Bee Bee and the defendant had the specific condition of signature that either one was authorised to sign. In the form was a choice of “*All/Any/Either _____ to sign”. “All/Any” was deleted and the word “one” filled in at where the blank space was. Both account holders Bee Bee and the defendant agreed to be jointly and severally bound by the bank’s prevailing terms and conditions governing the operation of the relevant account, which included the following term and condition: 9.4    In the event of death of a joint account holder (except in the case of joint accounts designated as trust or executors’ accounts), the amount standing to the credit of the joint account shall be heldfor the benefitand to the order of the survivor(s) (regardless of the terms of the Account mandate) …. (Emphasis mine.) 80     What could not be disputed was that on the morning of 25 June 2004, she had specially taken the defendant with her to her bank and asked for the necessary forms, signed the forms and included the defendant’s name as the 2ndname with full authority to operate the account on an “either one” basis. It was a deliberate and purposeful act on her part, which had been planned for and done with the intention to add him as the joint account holder with the mandate that the defendant was entitled to use and withdraw the monies in the joint account at any time and with the further intention that “the amount standing to the credit of the joint account shall be heldfor the benefitand to the orderof the survivor.” These underlined words in the bank’s terms and conditions, which both the defendant and Bee Bee agreed to, constituted very strong evidence of what Bee Bee’s true intentions were, namely that he, the defendant, was to have the money beneficially if he survived her. The monies were clearly not meant to be held in trust for her estate upon her death as that would be contrary to the express term and condition above in clause 9.4. Clause 9.4 was unambiguous and clear in its construction and meaning. There was also a further differentiation made for trust accounts by use of the words in the brackets – “(except in the case of joint accounts designated as trust or executors’ accounts)” – in clause 9.4. 81     I found as a fact that Bee Bee knew exactly what she was doing and that she fully understood that it was a joint account with the right of “survivorship”, and more importantly, she did intend, as expressed in clause 9.4 that upon the death of one account holder, the bank was to hold the account balance, not only to the order of the survivor but also for the benefit of the survivor. Bee Bee therefore intended the defendant to have not only the legal interest but also the beneficial interest in the monies in the joint account. I disagreed with the submission of the plaintiff that these bank documents effecting the conversion were of little or no significance when deciphering Bee Bee’s intentions and were not accurate reflections of the intentions of the parties. 82     In the light of the evidence that emerged from the plaintiff’s own witnesses, and the fact that Bee Bee was a savvy businesswoman, counsel for the plaintiff in his submissions had no alternative but to accept that Bee Bee knew that the defendant could draw out any or all of the monies in the joint account after 25 June 2004. However, counsel then contended as follows:- 219   However, the relevant question is whether she knew that thebeneficial interestwould pass to the Defendant on 25 June 2004. 220   As it is highly doubtful whether the bank documents effecting the conversion were explained at all to Bee Bee, to infer that she intended to transfer the beneficial interest is, unsafe. 221   Even if she had such knowledge, she cannot have intended for such a course of action. In all likelihood, Bee Bee was of the view that the 1999 Will would address the Joint Account. 222   On an application of the law, one of the Defendant’s key arguments must fall. The bank documents (notwithstanding a survivorship clause) are simply not indicative of Bee Bee’s intent.” 83     I disagreed that those bank documents did not constitute evidence that were indicative of Bee Bee’s intent. I also could not fathom counsel’s argument (in paragraph 221 of his written submissions) that even if Bee Bee had knowledge that the beneficial interest would pass to the defendant, she could not have intended for such a course of action. Then the question that would naturally follow would be why did she execute the conversion to a joint account in the first place. 84     It must be borne in mind that the plaintiff was in no position to give any evidence (or to contradict any evidence from the defendant) on what had taken place at the bank when Bee Bee and the defendant were both there to execute the bank documents. The defendant gave evidence that the bank officer had explained the documents to both of them. Even if I were to reject any suggestion from the defendant’s evidence that the bank officer had explained the documents in detail to them, nevertheless I found that it was probable that the brief substance and general purport of those documents were explained to them, as it was an account conversion. Bee Bee and the defendant were conversant in English could read the documents for themselves if they wanted to. Even if it were true that there was no explanation whatsoever given by the bank officer attending to them, it was more likely than not that Bee Bee (including the defendant) being non-legally trained lay persons would have simply assumed that the monies in the joint account would belong both legally and beneficially to the survivor. In my judgment, it was not probable that Bee Bee would have known the existence of the legal concept that the beneficial interest remained with her because all the monies in the joint account were contributed by her, and therefore it would be held on resulting trust for her or for her estate should she pass away and only the legal interest passed to the defendant as the survivor, unless it could be shown that she had intended to pass him the beneficial interest. That complicated and perhaps even confusing concept would have eluded most non-legally trained persons. I found that Bee Bee, a lay person, would have simply acted based on her own beliefs and her own factual and legal assumptions (even though they might have been erroneous in law) that for a joint bank account, the survivor would be simply entitled to take for his own use and benefit all the monies remaining in it, pure and simple with no ifs and buts. If that were to be the case, then the fact would still remain that she would have intended it to take effect in that way (i.e. that the monies would belong entirely to the defendant upon her demise) as that would be in accordance with those beliefs and factual assumptions of hers. These assumptions would also be consistent with the evidence of the defendant that Bee Bee had often told him that “Dear, our money is growing” (which plaintiff’s counsel in his own submissions at paragraph 226 had characterised as a “constant assurance of the defendant’s beneficial interest”). To find a different intention from what Bee Bee had herself believed (albeit somewhat erroneously as a lay person) to be the effect of a joint bank account, it would in fact have defeated the real intention that Bee Bee had when she executed the conversion of the sole account into a joint account with the defendant.",
        "Bee Bee’s health": "85     Bee Bee was diagnosed with diabetes in 1999. She was prone to fainting spells. Upon discovering that she was diabetic, she must have realized that unless her diabetes could be controlled, her health would deteriorate. She fainted twice in public with the defendant. 86     After Bee Bee’s health problems began, Molly noticed that Bee Bee began to feel fatigued and suffered from mood swings, which became especially pronounced during the few months leading up to her passing. However, Bee Bee still kept a busy working schedule. Molly would ask her to take it easy and told her that there was no need to work so hard as she was already well off. She wanted to earn more money for Matchpoint so that it would be in good financial health when the plaintiff took over. According to Molly, Bee Bee was also worried about the expenses that the plaintiff would incur with regards to his children. 87     It was during one of these fainting spells that she passed away on 9 January 2007. The cause of death stated in her death certificate was diabetic nephropathy (renal impairment) and diabetes mellitus. 88     Prior to her death, Bee Bee, the planner, had made known to Molly what she wanted done should she pass away, and this included the burning of paper offerings and that her ashes should be scattered in the sea. She knew that her health was deteriorating and she seemed to be making early preparations for the inevitable.",
        "The defendant’s proposals to settle": "89     Counsel for the plaintiff contended that the defendant’s conduct after Bee Bee’s demise demonstrated the defendant’s own belief that the monies in the joint account did not belong to him. The defendant was himself uncertain of his position. 90     The plaintiff’s evidence was that various proposals were made by the defendant (after Bee Bee’s death) on how the monies in the joint account should be dealt with. It was not disputed that the defendant’s first proposal was as follows: (a)    The defendant would take 40%; (b)    He would give 30% to Bee Bee’s brother (Rosli); (c)    He would give 30% to Bee Bee’s sister (Bee Lian) in Australia. 91     However, the plaintiff alleged that the defendant had told him that his first proposal was in line with what Bee Bee wished. When the defendant was subsequently told by the plaintiff that Rosli was not interested, the defendant said he would then keep the 30% he offered to Rosli if Rosli did not want it. The defendant would then have 70% and Bee Lian would have 30% (i.e. the second proposal). 92     As the defendant kept changing his proposals, the plaintiff said he did not believe that the percentage distribution in the first proposal was what Bee Bee had wished, especially Bee Bee never told the plaintiff about the distribution described by the defendant. The plaintiff said that on 10 April 2007, the defendant called and informed the plaintiff of his third proposal to split the balance in the UOB joint account between them equally. The plaintiff did not agree. When the defendant made no headway, he asked to speak to Molly. 93     Molly’s evidence was that on the 6thday after the Bee Bee’s passing, the defendant spoke to her and the plaintiff at the flat above Matchpoint. The defendant said that they should make the Bee Bee “happy” by dividing the monies in her Australian dollar UOB joint account as follows: 40% to himself; 30% to Rosli; 30% to Bee Lian. Sometime later, Rosli told Molly that he did not want a 30% share in these monies. Molly relayed this information to the defendant. On hearing this, the defendant said that his share should then increase to 70%. 94     On 10 April 2007, after speaking with the plaintiff for a lengthy period of time, the defendant spoke to her and raised the following issues: (a)    The plaintiff wanted the monies returned to the estate. If that happened, he would get nothing; (b)    He now wanted to split the monies in the account 50/50 between himself and plaintiff; (c)    He could get lawyers to draft an agreement to split the monies in this way; (d)    There was no need to go to court to settle this issue. 95     The defendant denied telling the plaintiff that he offered these sums of money because it was what Bee Bee wanted. After Bee Bee had passed away and after the plaintiff knew that the money was in a joint account, the plaintiff insisted that he was entitled to the money as the sole beneficiary of the estate. The defendant tried to convince him that this was not Bee Bee’s intent but the plaintiff refused to listen. 96     The defendant further testified that he had initially offered to share the monies in the joint account with Rosli and Bee Lian, out of respect for Bee Bee’s memory and he told them that “we will not to fight”. 97     According to the defendant, it was because the plaintiff wanted all the money in the joint account and had said he would fight for it, that he then offered the plaintiff a 50% share of the monies (with nothing for Rosli and Bee Lian) to settle the matter. The defendant also told the plaintiff not to fight in court as it would be a waste of money. Since the plaintiff rejected the 50% offer, the plaintiff said he withdrew all his offers. 98     Counsel for the plaintiff submitted that it was not believable that the defendant would have been so generous, given his very thrifty nature, in offering up to 60% of the balance monies in the account (i.e. under the first proposal) unless the defendant himself did not believe that he was entitled to the monies. I did not think the defendant’s rational and reasonable conduct in attempting to resolve the dispute could be viewed as evidence that the defendant did not therefore believe the monies in the joint account belonged to him. In fact, the defendant’s conduct could just as well be explained in another way in that the manner in which he offered to share the money in different proportions and with different persons at different times indicated that he was calling the shots. This was more the behaviour of a person who thought the money was his rather than the behaviour of a person who believed that the money belonged to the plaintiff as the sole beneficiary of the estate. The fact he did not even offer anything to the plaintiff in his first proposal showed he never believed that the plaintiff was even entitled to the monies in the joint account. Instead, in his first proposal, the plaintiff preferred to share it with persons who did not get anything under Bee Bee’s second will. 99     In any event, I did not think much could be inferred from the various proposals the defendant was making to settle the matter. The plaintiff in hindsight perhaps should have quietly settled the matter with the defendant instead of going to court and thereby putting into the public domain the whole of Bee Bee’s life and her relationship with the three men in her life.",
        "My findings on the monies in the UOB joint account": "100  As I had stated earlier, Bee Bee was a person who was not likely to leave things to chance. On matters of importance, her actions were deliberate and considered. She changed her will when she felt she had to. She did not appear to me to be the kind of person who would do things without a purpose. She planned for the future as best as she could. 101  It would be appropriate to collate some instances showing Bee Bee’s careful planning and firm action:- (a)    Upon realizing that air stewardesses had a “shelf-life”, she took a major step to attend a course in hair dressing with a view to starting a salon and hairdressing business, Matchpoint. The fact that the business not only survived for many years but thrived and prospered (as evidenced by the assets she eventually accumulated at the time of her death) showed that she must have made many important and correct business decisions during the many years she was in control of Matchpoint. (b)    In June 1983, when she decided to separate from her husband, she covenanted with Michael in a deed of separation to make her wishes clear that each should live separate and apart from and be free from marital control and each shall have full independence in his or her affairs and both parties agreed to free each other from their duty to cohabit. More importantly, she also ensured in the deed that their separation should not in any way adversely affect their joint business in MatchPoint and they mutually covenanted to do their utmost for the benefit of the business including the preservation of the status quo and to indemnify each other against all debts or liabilities that the other might hereafter contract. (c)    The way Bee Bee took steps to change her will on 16 November 1999 after she found out Michael’s final betrayal showed her decisiveness and her purpose. She also gave instructions to her lawyers to inform Michael that she had changed her first will which I believed was meant to send a clear message to Michael. (d)    She even informed Molly what was to be done with her ashes upon her death, when she knew her health was failing. 102  I therefore also gave considerable weight to her deliberate and considered action to include the defendant as a joint signatory and to convert her UOB account into a joint account with the defendant. I found that she, as a savvy businesswoman even without reading the terms and conditions of the joint account she signed, would have known generally in layman terms that the defendant who was the other joint account holder would be entitled to the money upon her death. I found that it was with this background knowledge that she decided to go to the bank with the defendant to convert the UOB account into a joint account in June 2004. Very significantly, this conversion to a joint account was done after she had changed her will in 1999, giving everything to the plaintiff. It was not likely that Bee Bee would have wanted a situation that would be open to doubt as to whom the monies of the UOB joint account should go to after her death. 103  If she really intended to have the plaintiff inherit also the monies in the UOB joint account, she would have known that she needed to do nothing to the UOB account. By doing nothing and simply leaving it as a sole account in her name, the plaintiff would inherit those monies in UOB account under the second will. It was that simple and I was quite certain that Bee Bee knew it. 104  If indeed the plaintiff’s suggestion was that Bee Bee wanted to avoid probate and let the plaintiff have these monies quickly so that the business of Matchpoint and the plaintiff’s family would not suffer any cash crunch while waiting for the probate process, then surely Bee Bee should have added either the plaintiff or Molly (or both) as the joint account holders with her for the UOB account. Instead, Bee Bee did the opposite and made the defendant the joint account holder. This action of hers spoke volumes and indicated to me clearly what the likely or probable intention of Bee Bee was. I also rejected the imaginative suggestion from the plaintiff (and his counsel) that Bee Bee would have intended the defendant to be a trustee of the monies after her death, so that he would take out the money and hand it over to the plaintiff or Molly because Bee Bee trusted the defendant to do so. It was not as if the plaintiff was a minor in August 2004 when Bee Bee converted the UOB account into a joint account with the defendant. It was not as if the plaintiff could not be trusted with handling the monies in her UOB account such that Bee Bee had to protect the plaintiff by having the defendant hold it in trust for the plaintiff. At the time of the account conversion in June 2004, the plaintiff was already a grown man, 30 years of age and married with two children. He was supposed to be gradually taking over the business of Matchpoint. To imagine that Bee Bee might have thought that the plaintiff was financially irresponsible and could spend the money quickly, which was why she had to resort to having the defendant take care of the monies in the UOB account first and later hand over the money to them upon her death, was simply too ludicrous. In my view, this evidence was a pure figment of the plaintiff’s imagination. His explanation that Bee Bee did not want the plaintiff to be “big headed” and was using the defendant to “control” him, which was why she never made the plaintiff a joint account holder, was contradicted by the evidence of Molly that the plaintiff was reliable and trustworthy as he grew older. 105  Another reason offered by the plaintiff was that Bee Bee had made the defendant a joint account holder in order to provide security to the defendant for his loan of $48,000 to Matchpoint. As the UOB joint account was set up only three days before the defendant lent the money, I was fully alive to the possibility of the two matters being linked. Therefore, I had to be extremely careful in analysing the evidence. But on closer examination of the whole circumstances of this case, I did not believe that the real reason for setting up of the joint account, which in fact took place before the making of the loan, was to provide the security of the defendant’s loan.First, the defendant’s evidence was that Bee Bee asked for the loanonly afterthe UOB joint account had been set up, and not before.Second, there was no clear assertion by either by the plaintiff or Molly that Bee Bee had in fact told them that she added the defendant’s name as a joint account holder to the UOB account because the defendant wanted it done as his security for the $48,000 loan. One had to distinguish between what Molly or the plaintiff themselves imagined, believed or perceived to be Bee Bee’s reason as opposed to Bee Bee herself actually telling Molly or the plaintiff her reason. As the plaintiff and Molly in the course of the trial offered a large variety of reasons for Bee Bee’s act of adding the defendant as a joint account holder, it appeared to me that they were merely conjecturing multiple plausible reasons why Bee Bee did it (which included the rather strange reason that the defendant’s name was added in order to “protect” the plaintiff and Molly from Bee Lian coming after them for the monies in the joint account) as opposed to actually having been told of the specific reason by Bee Bee herself.Third, the fact that neither the plaintiff nor Molly in fact knew that the defendant was a joint account holder reinforced my impression that Bee Bee never in fact told Molly or the plaintiff any of her reasons for adding the defendant as a joint account holder (as that would necessarily have entailed a disclosure of the existence of the joint account with the defendant). What was clear to me was that Bee Bee never told them that the defendant was a joint account holder.Fourth, why would Bee Bee want to provide cash security of some S$280,000 (roughly the Singaporedollars equivalent for A$240,000) for a mere loan of $48,000. It made no sense to me.Fifth, there was the risk of the defendant withdrawing the whole amount in the joint account for himself at anytime, which risk would have been unacceptably high if Bee Bee never intended the monies in the joint account as a gift to him. Between 25 June 2004 (the date of the joint account) and the 28 June 2004 (the date of the defendant’s cheque for $48,000), the defendant could theoretically have withdrawn all the money in the joint account and yet make no loan to Bee Bee.Sixth, Bee Bee, being the savvy businesswoman that she was, would have known that she could simply issue him a cash cheque for $48,000 from Matchpoint’s existing overdraft bank account (which had been secured on the paid up property of Matchpoint) if indeed Michael needed some security for his loan. There is yet another possible alternative. The fixed Australian dollar cash deposit could also be readily pledged as security to the bank to obtain a personal overdraft bank facility in Bee Bee’s own name to enable her to issue her own cheque to the defendant for $48,000 as security for the loan. Basically, it would have been stupid and foolhardy for Bee Bee to make the defendant a joint account holder to an account with a cash deposit equivalent of S$280,000 as security for a mere loan of $48,000 when there were other much safer and better methods to provide security if indeed the defendant had required that as a prerequisite for his loan.Seventh, if Bee Bee really intended to provide security, another simple solution would have been to set a joint account with the defendant with an amount limited to $48,000, which should be sufficient cash security to satisfy the defendant and then leave the balance of the equivalent of S$232,000 with only herself as the sole account holder. That would have been prudent, pragmatic and practical. But again she did not do so.Eighth, when the S$48,000 loan was eventually paid down until a very small amount of $8,000 was still owing to the defendant, Bee Bee still took no steps to withdraw all the monies in the joint account, terminate it and then place them in a new fixed deposit under her sole name. The amount of the security remained unchanged throughout, and in fact, it was growing larger with the accumulated interest added in, whilst the quantum of the outstanding loan was diminishing.Ninth, if Bee Bee allegedly could not even trust the plaintiff with the money, why was she then trusting the defendant with her money? Why was she incurring the huge financial risk of the defendant running off with the S$280,000 security if Bee Bee never intended it to be a gift to the defendant, if not in an absolute sense during her lifetime, then at least in the sense as described by Snell’s Equity, 31stEdition in the following passage at p 579: If it is money paid into a joint bank account, A will probably retain power to withdraw some or all of it during his life; the gift to B may be explicable as being “an immediate gift of a fluctuating and defeasible asset consisting of the chose in action for the time being constituting the balance in the bank account.” 106  From the overall evidence, I found as a fact that Bee Bee fully understood the implications of a joint account and that the surviving account holder would be entitled to the monies under the terms and conditions spelt out in the bank documents for the UOB joint account. She might not have heard of the legal term “right of survivorship”, but I was quite certain she understood the effect of the “right of survivorship” and the effect of the term that “the amount standing to the credit of the joint account shall be heldfor the benefit… of the survivor” when she converted her UOB account into a joint account with the defendant. According to the testimony of the defendant, the bank officer had also generally explained the implications of the joint account to both Bee Bee and the defendant. I accepted that evidence. 107  I believed that her conversion to the joint account was done with the layman understanding and knowledge that the defendant would be the beneficiary of the monies in the UOB joint account should she pass away before him, and it was not merely to constitute him as the legal owner of the monies, with the beneficial interest lying somewhere else. I would very much doubt that a lay person like Bee Bee, at the time when she signed the bank documents for the joint account, would be thinking that the beneficial interest could be separated from the legal interest and that the defendant as the joint account, would merely have the legal interest if he survived her, but she (and consequently her estate) would retain the beneficial interest if she pre-deceased the defendant. As such, Bee Bee’s expectation would probably be the layman’s expectation that the survivor would be fully entitled to the balance of the monies in the joint account. 108  I believed that Bee Bee, by purposely changing the account into a joint account, had intended to avoid a troublesome situation where the estate would, after her death, go after the monies in the joint account. Instead of going to the lawyers and incurring the legal expense of amending the will to bequeath all the monies in the UOB account to the defendant, the cheaper and far more convenient way to effect that intention was simply for Bee Bee to go to the bank and include the defendant’s name in the account as a joint account holder. Being the successful businesswoman she was in the hairdressing trade, I doubted that she would not normally choose the most efficient, easiest, cheapest and quickest way to achieve her aims. Looking at it from a different angle, putting the defendant instead of the plaintiff as the joint account holder would surelynotbe the best, the surest, the safest and most efficient way to deal with the monies in the UOB account were her intention to give those monies to the plaintiff and not the defendant. That in my view would be quite out of character for her. She was dealing with a fairly large sum of money in the account, and I did not think it was a matter that she would have treated lightly and without due consideration. 109  Despite all that was said of the “great affection” she had for the plaintiff, I found as a fact that Bee Bee had clearly intended to give something to the defendant, whom I think I would not be far wrong to describe as the “second love of her life”. I could see that the defendant truly loved her and she must have reciprocated that. She had already provided a very substantial amount to the plaintiff and his family, and through the plaintiff, also to Molly, by leaving to the plaintiff the entire business of Matchpoint (which was a viable and if not, also a thriving business and which also included the fully paid business premises and the flat above worth probably in total over a million dollars) to the plaintiff in her second will. It was not as if Bee Bee had deserted them and gave them absolutely nothing. Bee Bee must have decided that the defendant deserved to have something and that was why she decided to make him a joint account holder to ensure that he would get all the monies in her UOB joint account should she pass away. She had made plans to confer the benefit of the right of survivorship with not only the legal interest but also the beneficial interest going to the defendant in respect of the monies in the UOB joint account, and I was certainly not minded to frustrate the intention and careful planning of this extraordinary lady. I would be doing so if I were to allow the plaintiff’s claim. 110  The final nail that sealed the fate of the plaintiff’s case was the evidence that Bee Bee, up to the time of her death, was fully ambulatory despite her illness and she could therefore have easily have gone to the bank herself, if she wanted to, to withdraw all the monies in the UOB joint account and set up a new account in her sole name or set up a joint account together with the plaintiff if she no longer intended to give the monies to the defendant and wanted now to give those monies in the joint account to the plaintiff or his family in order to take better care of them (on the basis that giving them Matchpoint, the business premises and the flat were not enough). Bee Bee did not do so, and it must be remembered that she was a decisive woman and who would plan and not leave things to chance.",
        "Analysis of the law": "",
        "Ambit of the survivorship clause": "111  Counsel for the plaintiff referred me toNiles v Lake[1947] 2 D.L.R. 248, where the Supreme Court of Canada held that although the survivor became the legal owner of the joint bank account, the survivor held it on resulting trust for the estate as the deceased joint account holder had contributed all the money that went into the joint account and there was no evidence to show that the survivor was to get any beneficial interest. InNiles v Lake, the survivorship clause read as follows: “It is understood and agreed by the undersigned with each other and with the said Bank that the death of one or more of the undersigned shall not affect the right of the survivors or any one of them or of the sole survivor to withdraw all of the said moneys and interest from the said Bank and to give a valid and effectual discharge or receipt therefore….” 112  Kerwin J said at p 252 that while it was true that the legal property in the chose in action was vested in the joint account holders was now vested in the survivor, equity raises an equitable interest in the deceased by virtue of the doctrine of resulting trusts, and there was nothing in the bank document signed by the joint account holders to cut down that equitable interest. Kerwin J then added: The language (i.e. in the bank document) is no more absolute or unequivocal than in a deed of land or a transfer of shares of stock by the owner to the joint names of the transferor and transferee. “In fact”, as pointed out in the second edition of Hanbury’s Modern Equity, p. 213, “cases oftransferby one person into the joint names of himself and a stranger are in no way different frompurchasesby one person in the joint names of himself and a stranger, in which cases the presumption most certainly arises.” 113  Taschereau J. after reviewing the authorities said at 256 and 258: All these authorities, as well as many others which it would be superfluous to cite here, clearly indicate that a mere gratuitous transfer of property, real or personal, although it may convey the legal title, will not benefit the transferee unless there is some other indication to show such an intent, and the property will be deemed in equity to be held on a resulting trust for the transferor. ….. The words “shall be the joint property of the undersigned” or “right of survivorship” and “all monies in the account to be joint property of the undersigned” are indeed apt words to convey a legal title to the fund, but not to convey the whole fund beneficially. Something more than a mere transfer is required to destroy the presumption of a resulting trust and an intimation of such an intent must appear in the document itself, or as a result of evidence which reveals the intention to benefit the transferee. 114Niles v Lakedid not quite advance the plaintiff’s case because that case could be distinguished on the basis that the survivorship clause on the bank’s standard form there was quite different in that, unlike the present case, there was no clear indication that in the event of the death of a joint account holder, the amount standing to the credit of the survivor would be held forhis benefit, which would then have made very clear that the survivor not only had the legal interest, but also that he was to have the beneficial interest in the balance of the monies in the joint account. Further, whether or not the deceased joint account holder had intended a gift must be decided on all the facts and circumstances of each case, and generally, it would be indeed rare for two cases to have almost similar facts.",
        "Role of presumptions in the court’s fact finding process": "115  InSaylor v Madsen Estate[2006] D.L.R. (4th) 597 (“Saylor”), a decision of the Ontario Court of Appeal, LaForme J.A. succinctly set out the instances when a presumption of resulting trust might arise, the role of presumptions, and the evidential value of bank documents to ascertain the parties’ intention. The learned judge also laid down in a very practical way the approach that the court should take in analysing the evidence (including the bank’s standard documents the parties had executed for their joint bank account) in order to ascertain the intention of the deceased transferor: [14] Generally speaking, and in the context of this case, a resulting trust is presumed where a person makes a gratuitous transfer of property into another person’s name, or into the joint name of him or herself and another. There is then a presumption that the transferee intended to transfer legal title, but retain beneficial title. This presumption may be rebutted by evidence showing that the transferor intended a gift. The Role of the Presumptions [24] Reliance on the presumptions has diminished because the courts are now first examining all the evidence to determine the transferor’s intent. That is to say, courts are tending to examine the evidence in its entirety, and base findings regarding intention on all the facts. It will only be where the evidence itself is unclear that reliance on the presumptions becomes necessary. Cullity J., inYau, supra, demonstrates this approach wherein he states that the overall aim is to discern the intention of the transferor: [T]he historical origins of the equitable presumptions are generally ignored and their justification is most commonly found in the extent to which they reflect, and correspond with, the more likely intentions of a transferor or purchaser. The relationship that is said to give rise to a presumption of advancement “is no more than a circumstance of evidence which may rebut the presumption of resulting trust”. [25] This approach reflects what I believe to be a sensible and modern approach to an analysis of the presumptions. I take comfort in knowing that other knowledgeable jurists and scholars also share this view: seeDreger (Litigation Guardian of ) v. Dreger(1994), 5 E.T.R. (2d) 250 (Man. C.A,);Cooke v. Cooke Estate(2005), 16 E.T.R. (3d) 108 (B.C.C.A.). Indeed, my colleague, Gillese J.A. inEssentials of Canadian Law: The Law of Trusts(Irwin Law: Concord, 1996), advocates the approach that there is no need to resort to the presumptions where evidence of intention is clear. This approach is both contemporary and reasonable since the overall purpose is, after all, to ascertain the transferor’s intention. Intent at the Time of the Transfer – The Bank Accounts [26] It was forcefully argued -- and I think with some persuasion -- that the uncontested evidence of bank documents establishes joint accounts as beingper seevidence of intent to gift. This, it might be said, taken together by way of analogy with the above referenced law in Ontario, as it exists with respect to spouses and as clarified in s. 14 of theFamily Law Act, demonstrates a clear intention to advance a gift to Ms. Brooks. [27] Bank documents can be strong evidence of a party’s intention at the time the parties signed them.I do not, however, agree that the bank documents should be assigned presumptive value when trying to determine a party’s intention.The probative value of such documents, like any other relevant evidence, can only be ascertained after an assessment of the totality of the relevant evidence. As this case demonstrates, the document does not always provide accurate evidence of the parties’ intent. [28] A judicially created presumption, which places documents at the top of the evidentiary ladder, may bring some predictability to the factual question of a party’s intention, but it will do so, in my view, at the expense of the fact finding process. Triers of fact routinely determine questions of intention without any judicially created presumptions. I am confident that they can do so where bank documents constitute part of the evidentiary picture. …. [31] The more recent bank agreements provide for a right of survivorship so it can no longer be said that the documents do not define rights as between the joint account holders. However, there is no reason to treat the documents as dispositive of the actual relationship between the parties. Documents remain a piece of evidence – perhaps a very important piece of evidence – going to the intention of the parties who created the document. Nevertheless, the weight to be assigned to such documents in any given case must be left to the trier of fact. The Approach to Joint Accounts [32] By way of summary then, I would approach the issue of the joint accounts in this case as follows. First, the court should have evaluated the whole of the evidence, including the bank documents, to determine whether there was a clear intention at the time of the transfer on the part of the late father to gift the joint accounts to Ms. Brooks. Second, if, the intention of the late father remained unclear after this evaluation, then the court should have resorted to an analysis of the application of the presumptions of advancement or resulting trust. (Emphasis is mine.) 116  I respectfully agree with what LaForme J.A. had said above and I also adopted the very helpful approach he had set out in analysing the totality of the evidence to decipher the intention of Bee Bee. If the court could discern a clear intention on the part of the deceased to gift all the monies in the joint account to the survivor from the evidence before it, then there should be no need to apply any presumption of a resulting trust to aid the fact finding or decision making process. Only when the court is not able to find any clear intention or if the evidence is inconclusive either way as to what the deceased’s real intention might be, then in this rather limited and exceptional situation (where the evidence is so finely balanced on either side) should the court apply the evidential presumption of a resulting trust to tilt the balance in favour of the estate of the deceased (who solely contributed the monies in joint account). In effect, the estate’s entitlement to the beneficial interest stemmed from the judicial application of the legal presumption of a resulting trust in a situation where the deceased’s intention remained inconclusive even after a careful examination of the totality of the evidence. Looking at it in another way, the surviving party “A”, who contributed nothing to the joint bank account, therefore carries the burden of proving that the deceased “B” intended to give “A” not only the legal interest but also the beneficial interest in the monies in the joint bank account upon the demise of “B”. If “A” fails to discharge that burden, then the monies in the joint bank account reverts to the estate of “B” under a resulting trust. Although “A” holds the legal interest, the estate of “B” will have the beneficial interest.",
        "No presumptive value in bank documents": "117  The next question whether or not the survivorship clause in the bank’s joint account document should be assigned any presumptive value was answered at paragraph [27] of the judgment of LaForme J.A above. I agreed with the learned judge that these bank documents should not be assigned presumptive value when ascertaining the intention of a party. Similarly, the fact that the account was a joint account with a right of survivorship in my view should also not be assigned any legal presumptive value for the purpose of ascertaining the intention of the deceased joint account holder. I noted that paragraph [27] of LaForme J.A.’s judgment above was cited with approval by the Court of Appeal inLow Gim Siah v Low Geok Khim[2007] 1 SLR 795at [53]. Accordingly, it would be wrong to elevate survivorship clauses in the bank documents to the status of a legal presumption similar to the legal presumption of a resulting trust. The bank documents including the survivorship clause governing in part the operation of the joint bank account should simply be regarded as one aspect of the overall evidence in the court’s determination of the likely intention of the deceased with respect to the beneficial interest in the monies that the deceased had contributed to the joint account in his lifetime. 118  If so, then how are the bank documents to be evaluated as part of the overall evidence? Again LaForme J.A. had answered that question in paragraph [27]. I do recognise that bank documents do not invariably provide accurate evidence of the parties’ intent. Neither is the other extreme true that bank documents can never provide any accurate evidence of the parties’ intent. In my judgment, the terms and conditions that the parties have agreed to in the bank documents is a good starting point for any evidential search for the intention of the deceased as part of the judicial process of fact finding. When the terms and conditions are well drafted and have stipulated clearly how the legal and beneficial interests in the monies outstanding in the joint bank account are to be dealt with upon the death of a joint account holder, and when the parties have been made or are fully aware of these terms and conditions (or at least the substance of these terms and conditions) before they inked their signatures to signify their acceptance of those terms and conditions , then these bank documents can provide strong evidence of the parties’ intent (in particular that of the deceased) at the time the parties executed the documents. In short, while bank documents may have strong evidential value, they do not have legal presumptive value. 119  In the midst of writing my grounds of decision, Prakash J issued her written grounds of decision inCollars Muriel Esther de Jesus @ Muriel Ester De Jesus Collars & Anor v Sandra Audrey JudeCollars[2008] SGHC 110(“Collars”). There the deceased and the two plaintiffs signed the Application Form and the signing instructions contained in the Form were that payment orders could be given by any one of the account holders and any one of the account holders would also be able to receive the funds in the Lombard account. It also provided that as a joint account the funds in the Lombard account were to be paid to the surviving party or parties to the account. The two plaintiffs were the surviving parties to the joint account with the deceased. The defendant and the two plaintiffs were the three beneficiaries under the deceased’s will in equal shares. On the burden of proof, Prakash J said at [30] that: 30     InTan Seng Pow v Tan Seng Hock[1992] SGHC 104, Warren Khoo J had to deal with a similar problem of whether money held in a bank account that was held jointly by a deceased and someone else belonged, on the death of the deceased, to her estate or to the surviving account holder. The money in the account had come entirely from the deceased. The learned judge proceeded on the basis that since all the money in the account had come from the deceased that money was beneficially the deceased’s alone while she was alive. He then agreed that the presumption was, in the case of a joint account that the survivor was to take the whole of the benefit of the account in the absence of a contrary intention. The onus would therefore be on the person who was challenging the right of the survivor to the money in the account to show that it was not the intention of the deceased that the survivor should have the proceeds. Following that decision, I concluded that the defendant in this case had the onus of showing that it was not the deceased’s intention that the moneys in the Lombard account should go to the plaintiffs and not to her estate. 120  In [38], the learned judge reached the following conclusion: 38     I concluded that the defendant had not been able to discharge the burden on her to prove that the deceased did not intend the plaintiffs to receive the money to the exclusion of her estate by virtue of the operation of the right of survivorship. I was also satisfied that the circumstances of the case showed a positive intention on the part of the deceased to give the moneys in the Lombard account to the plaintiffs. 121  As the authorities that were cited to me did not appear to have been considered in the case ofCollarsand as counsel before me also did not have the opportunity to submit on that recent judgment, I would, with respect to the learned judge, not depart from the legal position that I had taken.",
        "Presumption of advancement": "122  In the case of established categories of relations (e.g. husband and wife, parents and children), Rajah JA inLau Siew Kim v Yeo Guan Chye Terence and Another[2007] SGCA 54said at [108]: ....in the case of bank accounts heldand operatedjointly by persons in the established categories of relationships, there will be a strong inference that the rule of survivorship is intended to apply. This may be reinforced, if there exist bank documents which prescribe and declare the operation of survivorship in relation to the joint account; such documents could constitute cogent evidence of the parties’ intention that the absolute benefit of the account should devolve to the surviving joint account-holder. Nevertheless, this needs to be assessed in relation to the factual matrix: [seeLow Gim Siah([76]supra) at [51]. 123  Counsel for the defendant urged me to expand the categories of relationships to include cohabiters so that the defendant could have the benefit of the presumption of advancement. Although Bee Bee and the defendant were to all intents and purposes living together as husband and wife for 4 years, nevertheless they were not legally married. As such, I did not think that any presumption of advancement could arise under the present state of the law in Singapore. I would not venture to say what future developments in the law might bring and whether the presumption of advancement would cover suchde factorelationships in the future. But at the moment, it would not.",
        "Presumption of resulting trust": "124  Both counsel agreed that a rebuttable legal presumption of resulting trust had arisen on the facts of this case, principally because it was not disputed that all the monies in the UOB joint account was contributed by Bee Bee solely. Nothing came from the defendant. Counsel for the defendant graciously agreed with counsel for the plaintiff that the burden therefore fell on the defendant to prove on a balance of probability that Bee Bee intended to gift the monies in the UOB joint account to the defendant; and therefore it was for the defendant to rebut the legal presumption of resulting trust by adducing reliable evidence of contrary intention, failing which the plaintiff’s claim would be allowed. Based on the Court of Appeal authorities (Low Gim Siah v Low Geok KhimandLau Siew Kim v Yeo Guan Chye Terence and Another)that counsel had submitted to me, I agreed that would be the correct legal position in Singapore. 125  For completeness, I would set out below the relevant parts of the Court of Appeal decisionLau Siew Kim v Yeo Guan Chye Terence and Another: Presumption of resulting trust 34     Resulting trusts are presumed to arise in two sets of circumstances. These circumstances were appositely summarised by Lord Browne-Wilkinson inWestdeutscheat 708 as follows: Under existing law a resulting trust arises in two sets of circumstances: (A) where A makes a voluntary payment to B or pays (wholly or in part) for the purchase of property which is vested either in B alone or in the joint names of A and B, there is a presumption that A did not intend to make a gift to B: the money or property is held on trust for A (if he is the sole provider of the money) or in the case of a joint purchase by A and B in shares proportionate to their contributions. It is important to stress that this is only apresumption, which presumption is easily rebutted either by the counter-presumption of advancement or by direct evidence of A’s intention to make an outright transfer … (B) Where A transfers property to Bon express trusts, but the trusts declared do not exhaust the whole beneficial interest … Both types of resulting trust are traditionally regarded as examples of trusts giving effect to the common intention of the parties. A resulting trust is not imposed by law against the intentions of the trustee (as is a constructive trust) but gives effect to his presumed intention. [emphasis in original] Resulting trusts of the second type operate to “fill the gap” in the beneficial ownership of property where an express trust fails. Resulting trusts of the first type, on the other hand, are commonly termed “presumed resulting trusts”, and, as is apparent from the passage above, thepresumptionof resulting trust only applies to the first set of circumstances discussed by Lord Browne-Wilkinson. As the present case concerns the issue of presumptions, no more needs to be said regarding resulting trusts of the second type. 35     There is an important distinction between the presumption of resulting trust and the resulting trust itself. The presumption is an inference of a fact drawn from the existence of other facts, whereas the resulting trust is the equitable response to those facts, proved or presumed: see Robert Chambers,Resulting Trusts(Clarendon Press, Oxford, 1997) at p 32. The difference between them is explained inResulting Trusts (ibid)as follows: The facts which give rise to the presumption of resulting trust are (i) a transfer of property to another, (ii) for which the recipient does not provide the whole of the consideration. The facts which give rise to the resulting trust itself are (i) a transfer of property to another, (ii) in circumstances in which the provider does not intend to benefit the recipient. Robert Chambers has quite appropriately highlighted two essential points: first, that the lack of consideration required for the presumption isnota requirement for the resulting trust; and second, that the lack of intention to benefit the recipient required for the resulting trust is precisely the fact being inferred when the presumption is applied. It is thus apparent that a resulting trust may arise independently of the presumption so long as it can be shown that the transfer was not intended to benefit the recipient; and, in a similar vein, a resulting trust may notnecessarilyariseeven ifthere was no consideration, if it can be shown that the transfer wasindeedintended to benefit the recipient.",
        "Application of the presumption of resulting trust and the burden of proof": "126  Since the legal presumption of a resulting trust had arisen on the facts of this case, that presumption must be applied as a matter of law once there is insufficient evidence to make a factual finding (based on all the relevant facts and circumstances of the case) whether or not the deceased had intended to give the monies in the joint account to the surviving joint account holder. If a numerical analogy were to be used, then the equivalent situation would be a 50/50 case, where the result could easily go either way. When faced with that situation, the court cannot make no decision. It must still adjudicate the dispute and decide who gets to keep the monies. The legal solution rests therefore with the application of the presumption of resulting trust (once that arises on the facts), which then supplies the answer to the question - whose burden it is to prove that the deceased transferor had intended to give his or her monies in the joint account to the survivor; and the answer is: the survivor bears that burden. If the survivor fails to overcome that burden, then the law will presume that the deceased transferor did not intend to give the monies to the survivor and the estate will consequently be entitled to the monies in the joint account. 127  In other words, once the legal presumption arises, the burden rests with the survivor to prove on a balance of probability that the deceased transferor had intended to give the monies in the joint account to him, failing which the action will be resolved in favour of the deceased’s estate under a resulting trust, and the beneficiaries of the deceased’s estate will then be entitled to the monies in the joint account. Essentially, where the evidence on the deceased’s intention remains unclear or evenly balanced at 50/50 on either side, then the estate of the deceased, who contributed to the joint account during the deceased’s lifetime, will succeed in the action because of the legal presumption of a resulting trust, which is no more than an evidential mechanism derived from common experience and understanding of how ordinary sane human beings would usually behave and conduct themselves. Where their own monies are concerned, they would normally not intend to make a gift to a stranger (including a joint account holder) in the absence of any consideration. As Rajah J.A. said at [37] inLau Siew Kim: 37     It is therefore clear, from this jurisprudential analysis, that the presumption of resulting trust is aninferenceor even anestimateas to what a party’s intention is likely to be, based on certain assumptions arising from a set of given facts. It stems from a rationalisation of human behaviour derived, in turn, from common experience and the societal climate. Accordingly, the instances for the application of the presumption must not remain stagnant; instead, they must necessarily change with time as behaviour, lifestyle and attitudes change.",
        "Conclusion": "128  Fortunately in this case, sufficient evidence was placed before me and I was able from the totality of the evidence to make a factual finding on a balance of probability that Bee Bee had intended to give the monies in the UOB joint account to the defendant. The monies in the UOB joint account therefore belonged both legally and beneficially to the defendant. 129  The evidence in this case clearly yielded a solution and therefore displaced the need to apply any legal presumption of a resulting trust to help resolve the question on what was Bee Bee’s intention. This evidential mechanism was simply not required to be called to solve any evidential problem although on the facts of this case, that legal tool was available. 130  If one prefers to look at it from the point of view of the burden of proof, I would hold that the correct position in law is that the burden rests with the surviving joint account holder to show that the intention of the deceased joint account holder was to give the survivor all the proceeds in the joint account (originally contributed by the deceased), failing which the estate of the deceased will be entitled to all the said proceeds. 131  I accordingly dismissed the plaintiff’s action with costs to be taxed or agreed. All that remains for me to say is that the plaintiff is simply too greedy."
    }
}