{
    "case_title": "Wong Lai Keen and Others v Allgreen Properties Ltd and Another Matter",
    "ncitation": "[2008] SGHC 155",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Events leading up to the Sale and Purchase Agreement": "2       I turn now to the detailed background facts. Between 26 August 2006 and February 2007, the majority owners entered into a collective sale agreement (“the Collective Sale Agreement”) with one another for the sale of all their 25 residential units and the common property in the property. The minority owners did not sign the Collective Sale Agreement. 3       Pursuant to cl 4 of the Collective Sale Agreement, the majority owners confirmed and ratified the appointment of a sale committee (“the Sale Committee”), whichinter aliawould be the majority owners’ agent for the purpose of negotiating and finalising the collective sale and obtaining any necessary orders from the STB (see cl 4.3.2.1 of the Collective Sale Agreement.) 4       Clause 10.1 of the Collective Sale Agreement stated: “The Sale Price shall be applied by the Solicitors in accordance with the terms of this Agreement and apportioned as set out in Schedule F.”[note: 1]Schedule F sets out a method of apportionment which essentially ensured that the subsidiary proprietors of each unit ended up with a share of the sale proceeds proportionate to the share value and strata area of that unit. 5       The Sale Committee appointed Colliers International (Singapore) Pte Ltd (“Colliers”), a firm of international valuers, as the property consultants to market the property and advise them on the open market value and hence the reserve price of the property. In seeking to determine the reserve price for the property, Colliers had determined the price on a per square foot (“p.s.f.”) per plot ratio (“p.p.r.”) basis which worked out to be about $336 p.s.f.p.p.r. After taking into account the development charge, which at the time it estimated to be about $7.6m, Colliers recommended a minimum reserve price of $30m (as reflected in the definition of “Reserve Price” in cl 1.1 of the Collective Sale Agreement). 6       The development charge is a tax levied on a developer who redevelops a piece of land, thereby resulting in an enhancement of its value. This charge is typically calculated based on the difference between the value of the proposed development and the development baseline. The development baseline is, in turn, pegged to the value of the subject land, or previous highest value for which a development charge has been paid. Broadly speaking, the higher the development baseline, the lower is the development charge payable. In the context of a collective sale of all the units in a condominium for the purposes of redevelopment, the development charge payable will have a direct effect on the price a developer would pay for the land as this is a direct cost of developing the land. 7       In January and February 2007, an invitation to submit offer (“ISO”) for the property was conducted by Colliers on behalf of the majority owners. In conjunction with the ISO, an investment memorandum was prepared by Colliers to invite developers to submit their offers (“the Investment Memorandum”).[note: 2]The Sale Committee decided not to apply to the URA to ascertain the actual development baseline; thus, the parties involved could only work on the basis of estimates of the development charge payable (“the estimated development charge”). In the Investment Memorandum, Colliers marketed the property on the basis of a base plot ratio of 0.835 (which was the 1980 approved Gross Floor Area), resulting in the estimated development charge being $7,189,663. The chairman of the Sale Committee, Wong Lai Keen, averred that this was because of Colliers’ advice that the alternative method of ascertaining the development charge payable on the basis of the Gross Floor Area was “a good guide”.[note: 3]However, it was apparent from an e-mail sent by Colliers to the Sale Committee dated 9 April 2007 (set out at [39]infra) (“the 9 April 2007 e-mail”) that the Sale Committee had decided against making a development baseline enquiry because it felt that the subsidiary proprietors of the property were unlikely to agree to pay for the extra cost (which had been quoted by an architectural firm at $11,000). 8       After the ISO closed on 13 February 2007, Colliers wrote to the subsidiary proprietors of the property on 14 February 2007 to inform them that several offers for the purchase of the property had been received, the highest of which was Allgreen’s bid of $34m. Allgreen’s bid was premised on the estimated development charge being about $7.6m.[note: 4]",
        "The Sale and Purchase Agreement": "9       On 26 April 2007, the Sale Committee, on behalf of the Majority Owners, entered into the Sale and Purchase Agreement with Allgreen, pursuant to which the Sale Committee, for and on behalf of the Majority Owners, agreed to sell and Allgreen agreed to purchase all 31 units and the common property in Regent Garden, for $34m. At all material times, Allgreen was represented by Yeo-Leong & Peh LLC (“YLP”), while the majority owners were represented by Tan & Au LLP (“T&A”). 10     The following are the material clauses of the Sale and Purchase Agreement[note: 5]: Cl 3(5): Notwithstanding anything herein provided, the sale and purchase of the Property is conditional and subject to the approval of the Strata Title[s] Board (“the Board”) to the sale herein.For the avoidance of doubt, if the Board dismisses the Vendors’ application for causes which can be rectified by the Vendor, then any reference herein to the order of the Board shall include such order of the Board upon subsequent applications by the Vendor after rectification has been done by the Vendor. In the event the Board does not approve the sale due to causes which the Vendor [is] unwilling to rectify or otherwise, all monies paid by the Purchaser towards the purchase of the Property shall be refunded to the Purchaser without any interest, compensation or deduction whatsoever and the Purchaser shall have no claim whatsoever against the Vendor but without prejudice to any other rights or remedies available to the Vendor at law or in equity against the Purchaser. Each party shall bear their or his own solicitors’ costs in the matter. Cl 3(6): The Vendor shall apply to the Board for the Board’s Order within 3 months from the date of this Agreement. The Vendor undertakes to expeditiously procure such application to the Board using [its] best endeavours. Cl 3(8): If at any time on or before the expiry of 12 months from the date of this Agreement, all the ownersshall unanimously consentto the Collective Sale and the sale herein, then the condition set out inClause 3(5) hereofshall be deemed to be satisfied. [emphasis added] 11     Clause 24 of the Sale and Purchase Agreement was a material replication of cl 10.1 of the Collective Sale Agreement (see [4]supra), and stated: The Purchase Price shall be distributed according to the terms of the collective sale agreement made between the Vendors and according to the Method specified thereunder and as stipulated inSchedule C. [emphasis in original] Schedule C of the Sale and Purchase Agreement reproduced Schedule F of the Collective Sale Agreement. 12     The Sale Committee engaged DTZ Debenham Tie Leung (SEA) Pte Ltd (“DTZ”) to carry out a valuation of the property. In their valuation report dated June 2007 (“the first valuation”), DTZ advised that the open market value of the property after,inter alia, deducting the estimated development charge of $7,636,447, was $33.1m.[note: 6]",
        "The application to the STB": "13     Armed with the consent of more than 80% of the subsidiary proprietors, the majority owners made the application to the STB as envisaged in cl 3(5) of the Sale and Purchase Agreement on or about 23 July 2007.[note: 7]On 27 July 2007 the minority owners filed their objections and supplemental objections to the collective sale with the STB. The STB then directed that the majority and minority owners enter into mediation. Between 3 September and 24 October 2007, the majority owners filed affidavits to respond to the objections filed by the minority owners, and to state why the collective sale for the property should proceed. 14     Meanwhile on 23 July 2007, pursuant to an application by Allgreen to ascertain the actual development charge payable, the Urban Redevelopment Authority wrote to Allgreen and the Sale Committee (“the 23 July 2007 URA letter”) to inform Allgreen that the development charge payable was $950,894.00 (“the actual development charge”). It should be noted that this is about $6.6m less than the estimated $7.6m in the ISO. 15     It appears that, at the first mediation before the STB on 4 September 2007, the solicitor from T&A, Ms Carolyn Tan, informed the STB of the 23 July 2007 URA letter advising on the quantum of the development charge. The STB indicated that the incorrect valuation (based on the earlier overestimation of the development charge) would be a ground for dismissing the majority owners’ application for a sale order. The STB directed the Sale Committee to obtain fresh valuation reports to ascertain the true market value of the property as at the date of the Sale and Purchase Agreement,ie, 26 April 2007. Final mediation was ordered to be held on 15 October 2007.[note: 8] 16     The Sale Committee instructed DTZ to review their valuation. In September 2007, DTZ issued its revised valuation report (“the second valuation”) in which it stated that the open market value of the property as at 26 April 2007 was $39.7m based on the development charge advised by the URA on 23 July 2007.[note: 9]The Sale Committee also instructed an independent valuer, HBA Group Property Consultants Pte Ltd (“HBA”) to conduct a fresh valuation of the property to confirm its true market value as at 26 April 2007. 17     At the final mediation session on 15 October 2007, the STB was informed of the second valuation by DTZ. As no settlement appeared to be in sight, the STB hearing was fixed on 30 January 2008. Subsequently, in HBA’s valuation report dated November 2007, HBA advised that the market value of the property was $42m as at 26 April 2007 (“the third valuation”).[note: 10]",
        "The minority owners’ consent to sale and aftermath": "18     Negotiations took place between Ms Carolyn Tan from T&A and Ms Jennifer Yeo from YLP at a meeting on 19 November 2007 (“the 19 November 2007 meeting”) pertaining to the disparity between the estimated development charge and the actual development charge, and the possibility of Allgreen increasing the purchase price. The parties differ on the outcome of the 19 November 2007 meeting and I shall discuss this further at [66]et seqbelow. 19     Between 26 and 28 November 2007, Allgreen procured the consent of all the minority owners to the sale of Regent Garden by offering additional payments to them (“the additional payments to the minority owners”). The amount of these payments has not been disclosed. The last of the minority owners consented to the sale on 28 November 2007. As Allgreen did not have in its possession the original copies of the Sale and Purchase Agreement and Collective Sale Agreement (which were in the possession of T&A), the minority owners indicated and expressed their consent by executing deeds of consent (“the deeds of consent”) and signing on photocopies of the Collective Sale Agreement. 20     On 26, 27 and 28 November 2007, the minority owners wrote to the STB, each advising that he or she had agreed in writing to sell his or her unit in the property to Allgreen, and withdrawing his or her objection to the collective sale. 21     Subsequently, by a letter dated 30 November 2007, YLP wrote to T&A as follows: 2.      We are pleased to inform you that unanimous consent to the Collective Sale [Agreement] and the sale in the [Sale and Purchase] Agreement has been obtained. The certified true copies of the respective consent letters and withdrawal notices to the Strata Title[s] Board issed by the [minority owners] of Regent Garden are attached for your record. 3.      In view of the aforesaid, pursuant to Clause 3(8) of the [Sale and Purchase] Agreement, the condition set out in Clause 3(5) of the [Sale and Purchase] Agreement shall be deemed to be satisfied. … 6.      Meanwhile, kindly proceed to withdraw the application to the Strata Title[s] Board for the Board’s order by03/12/07. We would appreciate it if you could cc us a copy of the withdrawal notice and keep us posted of developments in this regard. [emphasis in original] 22     The majority owners later appointed Wong Tan & Molly Lim LLC (“WTL”) as their solicitors in respect of the dispute concerning the sale of the property. WTL sent a letter dated 19 December 2007 (“the 19 December 2007 WTL letter”) to YPL,inter aliastating the majority owners’ position that Allgreen had wrongfully breached and repudiated the Sale and Purchase Agreement as well as an alleged further agreement (“the alleged Further Agreement”) that Allgreen and the majority owners had entered into during the 19 November 2007 meeting (this is discussed in detail at [66]et seqbelow).[note: 11]WTL claimed that by making the additional payments to the minority owners so as to cause an unequal and disproportionate amount to be distributed to all the subsidiary proprietors of the property, Allgreen had acted contrary not only to Schedule C of the Sale and Purchase Agreement, but also the implied terms in the Sale and Purchase Agreement and the alleged Further Agreement. WTL stated that the majority owners accepted Allgreen’s wrongful repudiation of the Sale and Purchase Agreement and alleged Further Agreement, and therefore that the majority owners would treat themselves as being discharged from the same. A further letter to similar effect dated 4 January 2008 was sent to YLP, in which WTL requested YLP to arrange for the return of Allgreen’s copy of the Sale and Purchase Agreement for cancellation.[note: 12] 23     Allgreen in turn appointed Drew & Napier LLC (“D&N”) to act for it in respect of the dispute concerning the sale of the property. By a letter dated 8 January 2008, D&N responded to WTL’s letters dated 19 December 2007 and 4 January 2008 as follows: 3.       Your allegation that our clients have breached the [Sale and Purchase] Agreement and the grounds on which that allegation [is] premised are without basis, as is your allegation that our clients had given any indication that they were willing to enter into, or entered into a further agreement with your clients. 4.       Contrary to your assertions, there was no mistake as regards the sale price and neither was the transaction entered into in bad faith. 5.       Further, as there has now been unanimous consent as to the sale of [the property], clause 3(5) of the [Sale and Purchase] Agreement is deemed to be satisfied. Your assertion that the sale of Regent Garden is conditional upon a sale order being obtained from the Strata Titles Board is erroneous. 6.       Accordingly, your clients have no basis to terminate the [Sale and Purchase] Agreement. It continues to subsist and remains enforceable. 7.       However, it is clear from your letters of 19 December 2007 and 4 January 2008 that your clients have evinced a clear and unequivocal intention to no longer be bound by the [Sale and Purchase] Agreement, including their obligation under the [Sale and Purchase] Agreement to complete the sale and purchase of [the property]. 8.       In the circumstances, we have instructions to commence proceedings against your clients for specific performance of the [Sale and Purchase] Agreement as well as all remedies available to our clients at law and in equity. … 10.     Our clients reserve the right to accept your clients’ repudiation and claim damages against your clients, including damages for loss of profit being the difference in value between the sale price of $34 million and the market value of [the property]. …",
        "The STB hearing": "24     At the STB hearing on 30 January 2008, the STB concluded that the transaction was not in good faith taking into account the sale price, and accordingly dismissed the application (“the STB decision”).[note: 13]An appeal against the STB decision was filed on 26 February 2008 in Originating Summons No 254 of 2008 (“OS 254/2008”).",
        "The applications": "25     In OS 54/2008 filed on 10 January 2008, the members of the Sale Committee commenced proceedings against Allgreen on a representative basis, each suing in his or her capacity as well as on behalf of the other majority owners of the property. The members of the Sale Committee sought the following alternative remedies: (a)    A declaration that the majority owners were no longer bound by and were discharged from further performance of the Sale and Purchase Agreement by reason of there being no approval given by the STB for the sale of the property to Allgreen (ie, the condition in cl 3(5) of the Sale and Purchase Agreement was not satisfied: see [10]supra). (b)    An order for rescission of the Sale and Purchase Agreement by reason of the parties’ mistake regarding the development charge payable resulting in the parties agreeing to the sale price of $34m, which was at gross undervalue for the property, or rectification of the said agreement by increasing the sale price to reflect the development charge. (c)    A declaration that the parties had entered into the alleged Further Agreement under which Allgreen had agreed to top up the sale price of the property by not less than $5.7m with an order for specific performance of the Sale and Purchase Agreement and the alleged Further Agreement. (d)    A declaration that Allgreen were in wrongful breach and repudiation of the Sale and Purchase Agreement and/or the alleged Further Agreement, which the majority owners had accepted such that they were released from their obligations under the Sale and Purchase Agreement and/or the alleged Further Agreement and entitled to damages. 26     Allgreen filed OS 90 of 2008 on 18 January 2008 naming the majority owners as the defendants. The substantive relief was a declaration that the Sale and Purchase Agreement was valid and subsisting (“Prayer 1”), an order that the majority owners withdraw their application to the STB for collective sale of the property (“Prayer 2”), an order that the majority owners complete the sale and purchase of the property on the terms of the Sale and Purchase Agreement (“Prayer 3”) and an order for damages in lieu of or in addition to specific performance (“Prayer 4”). By Summons No 547 of 2008 (SUM 547/2008) filed on 5 February 2008, the majority owners applied for leave to issue a third party notice against the minority owners on the ground that it was necessary on account of the majority owners seeking a determination of the following issues:[note: 14] (a)    whether Allgreen, directly or indirectly, had entered into a separate agreement or made arrangements with the minority owners (singly or collectively) under which the minority owners would receive extra sums in addition to their respective shares of the sale price of $34m; (b)    if so, whether (i) the minority owners had wrongfully procured or induced Allgreen to breach the Sale and Purchase Agreement and Collective Sale Agreement; and/or (ii) the minority owners and Allgreen had unlawfully conspired with each other to injure and/or to cause loss to the majority owners by unlawful means, namely by allowing the sale of the property to Allgreen to proceed at a gross undervalue and/or by causing the minority owners to receive a disproportionately larger sum for the sale of their respective units than the majority owners; (c)    if so, an order that the minority owners are liable to the majority owners for damages for all loss and damages arising in consequence; (d)    whether the damages payable to the majority owners should be the sum of $5.7m or $7m (see [66]infra); (e)    whether by executing the deeds of consent, the minority owners are deemed parties to the Collective Sale Agreement and/or Saleand Purchase Agreement; (f)     whether the minority owners can be said to have unanimously consented to the collective sale of the property at the price of $34m and on terms set out in the Collective Sale Agreement and Sale and Purchase Agreement; (g)    whether, even if the minority owners could be deemed parties to the Collective Sale Agreement and/or Sale and Purchase Agreement, the minority owners were in breach of the Collective Sale Agreement, in particular cl 9.1.16 thereof; and (h)    whether the minority owners were required to account to the majority owners for the extra sums received or to be received by them and to disgorge any and all such sums received, to be distributed amongst all the subsidiary proprietors of the property in accordance with the sharing arrangements under the Saleand Purchase Agreement and Collective Sale Agreement.",
        "Preliminary issue": "27     I shall first deal with a preliminary issue raised by WTL. This was that Allgreen could not apply for an order of specific performance of the Sale and Purchase Agreement as it was contrary to the STB decision (which WTL called “the STB order”) and the court’s jurisdiction to interfere with that decision arose only where there was an appeal on the points of law (see WTL’s submissions for OS 54/2008 at [17]). I found this objection to be misconceived. Under s 84A of the Act STB has the power to order a collective sale which is binding on all subsidiary proprietors, even those who have not consented to the collective sale (see s 84A(2) of the Act). The decision of the STB in this case was to decline to order a collective sale. There is no power on the part of the STB to prohibit a collective sale where all the owners have agreed to it. While s 84A(6) provides for the STB to approve an application for collective sale even where no objection has been filed, this pertains to the situation where there is no unanimous consent and, an application having been made to the STB, the minority owners have not filed any objection within the time limit in s 84A(4). Read in the context of the whole of s 84A, it is clear that s 84A(6) recognises that in such a situation the majority owners still require an order for sale from the STB notwithstanding that no objection has been filed. 28     The parties in the present case are not asking me to re-visit the STB’s decision and make an order for sale – that is the subject of an appeal against the STB’s decision in OS 254/2008 (see [26]supra). The present applications are based on private contract (viz, the Sale and Purchase Agreement, Collective Sale Agreement and/or the alleged Further Agreement) and it was eminently within this court’s jurisdiction to hear them. Thus, I turn now to the issues in the case.",
        "Issues to be determined": "29     The first issue to be determined was whether the Sale and Purchase Agreement subsisted and was binding on the majority owners. This turned on the determination of several sub-issues: (a) whether there had been a common mistake in relation to the actual development charge so as to invalidate the Sale and Purchase Agreement; (b) whether Allgreen had breached any terms (express or implied) of the Sale and Purchase Agreement, Collective Sale Agreement and/or the Act by offering or making the additional payments to the minority owners; and (c) whether there was unanimous consent under cl 3(8) of the Sale and Purchase Agreement such that cl 3(5) of the same agreement was deemed to be satisfied. 30     I found that: first, there was no common mistake such as to affect the validity of the Sale and Purchase Agreement because there is clear evidence that the majority owners had full knowledge that the estimated development charge was precisely that – only an estimate. Thus, they entered into the Sale and Purchase Agreement having decided to take the risk of any increase in the development charge. Secondly, there was no express or implied term in the Sale and Purchase Agreement, Collective Sale Agreement and/or the Act prohibiting the additional payments to the minority owners. Thirdly, cl 3(8) was satisfied by the deeds executed by the minority owners. 31     This brought me to the second issue, which was whether there was a further agreement that Allgreen would pay at least $5.7m to the majority owners. I found that there was no such further agreement, and that even if there was, it was only oral and therefore, being a contract for the sale of immovable property, no action could be brought on it under s 6(d) of the Civil Law Act (Cap 43, 1999 Rev Ed)(“Civil Law Act”). 32     Accordingly, I gave an order in terms of prayers 1 and 3 of OS 90/2008, with the date for completion of the sale of the property fixed on 16 May 2008. For the avoidance of doubt, I also declared that the minority owners were bound by the terms of the Collective Sale Agreement and the Sale and Purchase Agreement. 33     I refused the application for leave in SUM 547/2008 on the following grounds. Issues (a), (g) and (h) were not necessary to the determination of OS 90/2008. In respect of issues (b)(i) and (ii), (c) and (d), I had already determined that there was no breach of the Saleand Purchase Agreement (as well as the Collective Sale Agreement and/or the Act) and thus there was no question of wrongful conduct on the part of Allgreen and the minority owners. Issues (e) and (f) had been answered in the positive in determining OS 90/2008 (see [32]supra). 34     OS 54/2008 was accordingly dismissed. 35     I shall now elaborate on the reasons for my decision.",
        "Common mistake": "36     WTL submitted that the Sale and Purchase Agreement, and in particular the sale price of $34m, had been based on a common mistake as to the actual development charge for the property. At all times prior to the 23 July 2007 URA letter (see [16]supra), the Sale Committee and Allgreen had been under the impression that the actual development charge would be in the region of $7m. As a result of this mistake, Allgreen had offered and the Sale Committee had agreed to accept $34m as the price for the property (which was slightly higher than the first valuation of $33.1m). WTL referred me toGreat Peace Shipping Pte Ltd v Tsavliris Salvage (International) Ltd[2003] QB 679 (“The Great Peace”) and argued that the test for whether the mistake was such as to render the subject matter of the parties’ agreement essentially and radically different from what the parties believed to exist was satisfied, since the conditions set out inThe Great Peace(at [76] of that case) had been fulfilled: both Allgreen and the majority owners had assumed that the development charge would be in the region of at least $7m; neither party had warranted that the development charge would be in the region of $7m; it was neither party’s fault that the development charge was mistakenly estimated; the fact that the development charge was grossly overestimated resulted in the sale price of the property under the Sale and Purchase Agreement being an undervalue, which prompted the STB to dismiss the application for the collective sale; and the mistake in the development charge, which in turn caused the property to be grossly undervalued, was a vital attribute of the consideration (being the sale price) to be provided, since a high development charge would lower the open market value and hence sale price of the development. 37     On the other hand, D&N submitted that the majority owners were fully aware that they had used an estimated development charge for the purpose of determining the sale price of the property under the Sale and Purchase Agreement; that they had rejected Colliers’ advice to ascertain the actual development charge payable; and that although Allgreen had offered to make the sale price subject to any changes in the development charge which was payable, the majority owners had deliberately and consciously rejected this offer in favour of locking in the sale price at $34m in order to ensure certainty of sale. In support of its submissions, D&N referred me to an exchange of e-mail between Colliers’ representative and the Sales Committee. In the 9 April 2007 e-mail, Colliers had informed the Sales Committee as follows:[note: 15] Dear Sale Committee, Following the meeting on 2 April 2007 at M/s Yeo-Leong & Peh’s office, we note that the subject of the development baseline for Regent Garden was brought up again by Ms Wong Lai Keen [see [7]supra]. If you all can recall, the subject of the development baseline was brought to attention soon after our appointment by the sale committee as the marketing agent sometime in July 2006. For buildings approved prior to 1 September 1989, there is a requirement for an architect to recompute the Gross Floor Area (GFA) of the building according to the new definition of GFA when a Development Baseline enquiry is made. We obtained a verbal quotation of $11,000/- from M/s Cyril K H Seah Architects to recompute the GFA, and this was conveyed to the sale committee then.The sale committee felt that owners were unlikely to pay for the extra cost, considering that the MC funds could not be used for this purpose. Hence, the development baseline enquiry was not made. However, for our marketing purposes, we applied at our own cost to URA for the planning records to obtain the approved GFA for Regent Garden based on the submission plans back in 1980. The approved GFA in 1980 was indicated as 5880.44 sq m, which translates to a plot ratio of 0.8355.This was of course subject to the usual disclaimer that it shall not be construed as the development baseline, but it will at least provide the developers with a guide as to the estimated development baseline, in lieu of an official baseline enquiry reply… [emphasis added] Wong Lai Keen’s response to this was:[note: 16] After much deliberation, the Sale Committee has decided not to subject the [Sale and Purchase Agreement] to any development baseline. We need to have more certainty of sale. 38     The following passage fromChitty on Contracts, vol 1 (Sweet & Maxwell, 29th Ed, 2004) (“Chitty on Contracts”) (at para 5-052) is a helpful summary of the present state of the law on common mistake: In cases in which there is some other common mistake [other than as to the existence or ownership of things] as [to]the surrounding facts, or perhaps the law, the contract may be void butonly if the mistake means that performance of the contract would be impossible, orwould be essentially or fundamentally different to what was contemplated by the parties. There are rival formulations of the principle. One is Lord Atkin’s, that a common mistake as to the quality of the subject matter may render a contract void if it makes the thing without the quality essentially different from the thing as it was believed to be [perBell v Lever Brothers, Ltd[1932] AC 161 at 218]. The other is the Court of Appeal’s inThe Great Peace, that a common mistake may render a contract void if it makes the contractual adventure impossible… Both make it clear that it will only be in exceptional circumstances, when the mistake makes the contract completely different to what the parties both thought they were about, that the contract will be void for common mistake. [emphasis added] 39     It should further be noted that whatever the formulation used, a contract will not be void for common mistake if one of the parties has assumed responsibility for the risk of that mistake: seeChitty on Contractsat para 5-054. InThe Great Peace, Lord Phillips of Worth Matravers MR stated (at [84]): Once the court determines that unforeseen circumstances have, indeed, resulted in the contract being impossible of performance, it is next necessary to determine whether, on [a] true construction of the contract, one or [the] other party has undertaken responsibility for the subsistence of the assumed state of affairs.This is another way of asking whether one or other party has undertaken the risk that it may not prove possible to perform the contract…[emphasis added] 40     In the present case, the Sale and Purchase Agreement was not void for common mistake for the following reasons. First, it is clear that the common mistake must be as to an existing state of affairs (ie, fact) or law (see 5-052 inChitty on Contracts, set out at [40]supra; see alsoThe Great Peaceat [76]). Given that the majority owners knew that the estimated development charge was precisely that – an estimate – there could have been no material common mistake as to facts (such as the actual development charge or actual market value of the property). 41     In any case, the key point is that the majority owners had assumed the risk that the actual development charge would be higher than the estimated development charge by consciously deciding not to make a development baseline enquiry and by not making the sale subject to any development baseline (see [39]supra). They had chosen to enter into the Sale and Purchase Agreement in the knowledge that the figure of around $7m was an estimate of the development charge and cannot now be allowed to escape their contractual obligations merely to escape what has turned out to be a bad bargain. It should also be noted that the assumption of risk was not one-sided. Had it turned out that the development charge payable was in fact much higher than the estimated development charge, the Sale and Purchase Agreement would have been equally enforceable against Allgreen. Indeed this was the very essence of the decision of the Sale Committee not to subject the collective sale to any development baseline as they wanted to have “more certainty of sale” (see [39]supra). In respect of the development charge, the bargain between the parties was that Allgreen was to bear the risk of it being higher than the $7m-odd estimated and it would correspondingly receive the benefit of it being less than that sum.",
        "Additional payments to the minority owners": "42     WTL submitted that, by agreeing with the minority owners to make additional payments to them, Allgreen had acted in breach of the Sale and Purchase Agreement. The equitable distribution of the sale proceeds envisaged in cl 24 of the Sale and Purchase Agreement (which materially reproduced cl 10.1 of the Collective Sale Agreement) and Schedule C of the Sale and Purchase Agreement (which materially reproduced Schedule F of the Collective Sale Agreement - see [13]supra) had been dislodged by the additional payments to the minority owners which resulted in them receiving a disproportionately larger amount of money than the majority owners for the units of the same strata area and share value. WTL also argued that it was implicit in cl 3(8) of the Sale and Purchase Agreement that any negotiations for the procurement of unanimous consent should not be carried out to the detriment of the majority owners. It argued that the making of the additional payments to the minority owners was also in violation of the objects and intents of the Act which was to ensure that the sale proceeds would be fairly distributed amongst all owners such that no one owner is treated less favourably than another. 43     D&N submitted that nothing in the Sale and Purchase Agreement, Collective Sale Agreement or the Act expressly prohibited the making of the additional payments to the minority owners. Clause 24 of the Sale and Purchase Agreement (materially reproducing cl 10.1 of the Collective Sale Agreement) expressly referred to the “Purchase Price” of the property, which is the $34m. It was clear that it was this $34m that had to be apportioned in accordance with Schedule C (materially reproducing Schedule F of the Collective Sale Agreement). There was nothing in the Sale and Purchase Agreement or the Collective Sale Agreement which stipulated that any payments made over and above the sale price under those agreements had to be apportioned in accordance with the method of apportionment in the schedules, or that no payments over and above the sale price could be made to any of the owners of the property, whether by Allgreen or by the other owners. Similarly, there was nothing in the Act which prohibited developers from either negotiating directly with minority owners or providing them monetary incentives in order to procure their consent to a collective sale. 44     D&N further argued that WTL had not fulfilled their burden of proving that an implied term against the making of the additional payments to the minority owners existed, pointing me to the authority ofLoh Siok Wah v American International Assurance Co Ltd[1999] 1 SLR 281(“Loh Siok Wah”) (at [29]). It pointed out that the more complex a contract, the less room there is for implied terms (especially where solicitors are involved):Jani-King (GB) Ltd v Pula Enterprises Ltd[2008] 1 All ER (Comm) 451;Oshawa v Village Shopping Plaza1989 ACWSJ Lexis 18518 (at [18] to [20]). D&N referred me to the affidavit of Tan Tiong Cheng (Managing Director of Knight Frank Pte Ltd) filed on 18 January 2007 in OS 90/2008 to show that the practice of offering additional payments to minority owners to procure their consent to the sale of the relevant property is widely adopted within the industry. It contended that, in light of such industry practice, the majority owners would have made express provision in the Collective Sale Agreement and/or Sale and Purchase Agreement if they did not want such payments to be made. 45     I found that there was no express provision against the making of the additional payments to the minority owners in the Collective Sale Agreement or Sale and Purchase Agreement. Clause 24 of the Sale and Purchase Agreement clearly provides that the method of apportionment set out in Schedule C pertains to the Purchase Price. Although “Purchase Price” is not explicitly defined in the Sale and Purchase Agreement, cl 1 clearly provides that Allgreen shall purchase all 31 units and the common property in the property for $34m. (The Collective Sale Agreement is even clearer: cl 10.1 refers to “the Sale Price” which is defined in cl 1.1 as “the total Sale Price of All Units in accordance with this Agreement”.) No express provision is made in either agreement as to the legitimacy or distribution of any payments made in addition to this purchase or sale price. 46     As for the existence of the implied term, the following conditions (which may overlap) are set out inLoh Siok Wahat [29] for the implication of a term into a given contract: (1)    [the term] must be reasonable and equitable; (2)    it must be necessary to give business efficacy to the contract, so that no term will be implied if the contract is effective without it; (3)    it must be so obvious that “it goes without saying”; (4)    it must be capable of clear expression; and (5)    it must not contradict any express term of the contract. 47     It is apparent that condition (2) is in fact the “business efficacy” test while condition (3) is the “officious bystander” test: seeForefront Medical Technology (Pte) Ltd v Modern-Pak Pte Ltd[2006] 1 SLR 927(“Forefront Medical Technology”) at [28] to [31]. InForefront Medical Technology, the Court of Appeal decided that these two tests are in fact integrated and complementary, in the sense that “the ‘officious bystander’ test is the practical mode by which the ‘business efficacy’ test is implemented” (Forefront Medical Technologyat [36]). In other words, to quote Scrutton LJ inReigate v Union Manufacturing Company (Ramsbottom) Limited[1918] 1 KB 592 at 605 (quoted with approval inForefront Medical Technologyat [35]; see alsoTelestop Pte Ltd v Telecom Equipment Pte Ltd[2004] SGHC 267at [68]): [a] term can only be implied if it is necessary in the business sense to give efficacy to the contract; that is, if it is such a term that it can confidently be said that if at the time the contract was being negotiated some one had said to the parties, “What will happen in such a case,” they would have both replied, “Of course, so and so will happen; we did not trouble to say that; it is too clear”. 48     The court will not lightly imply terms into a contract (especially contracts negotiated between parties at arms’ length, as in the present case) and the majority owners have not persuaded me that an implied term against the making of the additional payments to the minority owners exists. Without such a term, the Sale and Purchase Agreement was still perfectly capable of performance, in the sense of the sale of the property to Allgreen for the price of $34m, and thus the “business efficacy” test (as integrated with the “officious bystander” test) was not fulfilled. WTL’s argument that it was implicit in cl 3(8) that any negotiations for the procurement of unanimous consent should not be carried out to the detriment of the majority owners is also weak. Quite apart from the fact that it does not pass the business efficacy test, it begs the question of what constitutes “detriment” to the majority owners. The fact that the majority owners now have to sell the property below its “market value” cannot suffice, since under ordinary contractual principles parties cannot be allowed to escape a properly formed contract simply because it turned out to be a bad bargain after they had ascertained what the development charge was. Nor can the fact that the majority owners end up receiving disproportionately less than the minority owners constitute “detriment”, since WTL would then be making the proposition that although the majority owners had, at the time of signature, been perfectly willing to sell their units at a particular price, the fact that the minority owners will receive a larger sum in order for the sale to proceed is somehow detrimental to the majority owners even though this will permit the sale to be carried out on exactly the same terms as the majority owners had contracted for in respect of their units. 49     I note that WTL had cast aspersions on the evidence of Tan Tiong Cheng as to the alleged industry practice of the making of additional payments to the minority owners (in WTL’s skeletal submissions in response to D&N’s submissions made on 28 February 2008 at [64] to [68]). However, I had in any case given little weight to this evidence in reaching my decision that WTL had failed to satisfy the test for implying a term against the making of the additional payments to the minority owners. 50     It remains to deal with WTL’s submissions in respect of the Act. Since the unanimous consent of the owners of the property had been obtained there is no need for an order by the STB under s 84A of the Act in order for the Sale and Purchase Agreement to be binding on all the owners (see [59]infra). 51     For these reasons, I found that there was no express or implied term in the Sale and Purchase Agreement, Collective Sale Agreement and the Act prohibiting the additional payments to the minority owners. It follows that there was in fact no wrongful repudiation of the Sale and Purchase Agreement (and Collective Sale Agreement) by Allgreen to be accepted by the majority owners and thus I did not order any damages to be paid to the majority owners. It also follows that the minority owners are entitled to retain these additional payments and are under no obligation to share the additional payments they have received from Allgreen with the majority owners.",
        "Whether cl 3(5) of the Sale and Purchase Agreement was fulfilled": "52     WTL submitted that, the parties having agreed in cl 3(5) of the Sale and Purchase Agreement (see [10]supra) that the sale to Allgreen of the property was “conditional and subject” to the STB’s approval, the parties were discharged from the Sale and Purchase Agreement since the STB had not approved the sale during the STB hearing. It further submitted that cl 3(5) could not be deemed to be fulfilled by virtue of cl 3(8) of the Sale and Purchase Agreement (see [12]supra) for the reasons set out below. 53     Firstly, the minority owners could not have unanimously consented to the sale as they were not even parties to the Collective Sale Agreement. The minority owners had purported to consent to the Collective Sale Agreement between 26 and 28 November 2007. This was outside the permitted time as defined in cl 1.1 of that agreement (ie, a period of six months from the first subsidiary proprietor’s signature on 26 August 2006). That being the case, they were only entitled to become parties to the Collective Sale Agreement with the approval of the Sale Committee, which was not obtained in the present case. They could not by signing the deeds of consent (see [21]supra) unilaterally make themselves parties to the Collective Sales Agreement. To support this prerequisite of approval by the Sales Committee, WTL relied on: cl 3.5 of the Collective Sale Agreement which provides that a person who is not party to the Collective Sale Agreement has no right under the Contracts (Rights of Third Parties Act)(Cap 53B, 2002 Rev Ed) to enforce any term of that agreement; apparently well-known and established principles that a non-party to an agreement cannot unilaterally make itself party to the agreement without the prior approval of the existing parties thereto; and cl 4 of the Collective Sale Agreement, in particular cl 4.3.2.1, which constituted the Sales Committee as the agent for the consenting owners under the Collective Sale Agreement and cl 4.2.7, which gave the Sales Committee the authority to sign on behalf of those consenting owners any documents required by the purchaser for the purposes of or incidental to such a sale. 54     Secondly, WTL submitted that “unanimous consent” must mean that the minority owners consented to the sale of the property to Allgreen on the same and identical terms as those agreed to by the majority owners as set out in the Collective Sale Agreement and Sale and Purchase Agreement, so as to be in complete accord with the majority owners. In particular, the minority owners must have also agreed to sell their respective units on a collective basis for a total sale price of $34m and for each of the owners to get a share of the sale price of $34m based on the method of apportionment set out in Schedule F of the Collective Sale Agreement (which is the same as that in Schedule C of the Sale and Purchase Agreement). The additional payments to the minority owners, although it would not affect the distribution of the $34m received as the sale price under the Sale and Purchase Agreement, would effectively result in the minority owners getting a larger proportion of the actual sale proceeds as compared with majority owners having units of equivalent strata area or share value, displacing the agreed method of apportionment under which owners were to receive a share of the proceeds in proportion to the strata area or share value of their units. Therefore, there could be no unanimous consent under cl 3(8) such as would fulfil cl 3(5) of the Sale and Purchase Agreement. 55     Thirdly, cl 3(8) was intended for the benefit of the parties. It could not have been contemplated by the parties that cl 3(8) would be used in a manner that would result in loss to the majority owners (as they would have to sell their units below the market price, which WTL submitted was at least $39.7m for the property: see [18]supra), wrongful gain to Allgreen (since it would get the property for less than its market value) and disproportionate gain to the minority owners (see [44]supra). 56     D&N submitted that it was not necessary to obtain the STB’s approval for the sale of the property. There were two ways in which sale of the property could be achieved: first, the statutory route via an application to the STB under s 84A of the Act (as envisaged in cll 3(5) and (6) of the Sale and Purchase Agreement); and secondly, the contractual or common law route whereby all the subsidiary proprietors of the property could unanimously consent to the sale (as envisaged in cl 3(8)). In respect of WTL’s arguments pertaining to whether the minority owners were parties to the Collective Sale Agreement, the key provision pertaining to permitted time was cl 3.1.4 of that agreement. Clause 3.1.4 provided that the Collective Sale Agreement would expire if subsidiary proprietors holding at least 80% of the share values of the property did not sign the Collective Sale Agreement within the permitted time. However, the requisite 80% consent had been obtained in the present case and the Collective Sale Agreement did not expire. There was nothing in cl 3.1.4 or indeed the rest of the Collective Sale Agreement to prevent other subsidiary proprietors from becoming party to the Collective Sale Agreement after the permitted time, and in fact, cl 3(8) of the Sale and Purchase Agreement envisaged that either party had up to 12 months from the date of the Sale and Purchase Agreement to procure the consent of the minority owners,ie, after the permitted time and indeed even after the application to the STB for an order of sale. It was ludicrous to suggest that the minority owners had to be or were represented by the Sale Committee in signing up to the Collective Sale Agreement, since prior to such signing they would not have indicated their consent to being bound by its terms, including those clauses constituting the Sales Committee as agent and representative of the consenting owners. Finally, D&N contended that the minority owners had expressed their consent to the Collective Sale Agreement in the same manner as the majority owners. D&N pointed out that there was no real difference between the cases of one of the majority owners, Alias B Mhd Sarif (who had signed a letter on 21 February 2007 expressing his consent to Collective Sale Agreement,[note: 17]followed by signing on a copy of the Collective Sale Agreement[note: 18]), and one of the minority owners, Li Hang, who had signed a deed of consent and signed on a copy of the Collective Sale Agreement.[note: 19]D&N referred me to cl 3.4 of the Collective Sale Agreement, which allowed for execution of the Collective Sale Agreement on separate copies thereof and at different times. 57     In my view, it was clear that the failure to obtain approval for the collective sale of the property at the STB hearing was not fatal to the Sale and Purchase Agreement. An application to the STB under s 84A of the Act is only necessary where there is no unanimous consent by the subsidiary proprietors of the property in question. This is also evident from the statement of then Minister of State for Law, Associate Professor Ho Peng Kee, at the Second Reading of the Land Titles (Strata) (Amendment) Bill[note: 20]that: [N]o application needs to be made to the Strata Titles Board if all the owners agree to thesale. In other words, application to the Board is not a pre-requisite to all en-blocsalesbut only when there is no unanimous consent. The terms agreed to by the parties in the Sale and Purchase Agreement also leave no doubt that the parties had contemplated that the approval of the STB would not be necessary where there is unanimous consent. Although cl 3(5) states that “the sale and purchase of the Property is conditional and subject to the approval of the Strata Title Board”, cl 3(8) provides that (and it is worth setting out the clause again in full): If at any time on or before the expiry of 12 months from the date of this Agreement, all the ownersshall unanimously consentto the Collective Sale and the sale herein, thenthe condition set out in Clause 3(5) hereofshall be deemed to be satisfied. [emphasis added] 58     I turn next to the question of whether cl 3(8) of the Sale and Purchase Agreement was satisfied. There is no definition of the terms “the Collective Sale” or “the sale herein”, but I accept WTL’s interpretation of these as referring to the Collective Sale Agreement and the Sale and Purchase Agreement respectively. 59     In respect of WTL’s first submission on cl 3(8) (see [55]supra), the relevant clauses of the Collective Sale Agreement are set out for ease of reference: 3.1.2 This Agreement shall be executed by the subsidiary proprietors of the units having not less than eighty percent (80%) of the share values as shown in the schedule of strata units for the [property] within the permitted time. … 3.1.4 This Agreement shall expire and be of no further effect upon any of the following events arising (whichever is earlier):- 3.1.4.1    if only subsidiary proprietors holding less than eighty percent (80%) of the share values in the [property] sign this Agreement within the permitted time; or 3.1.4.2    if within twelve (12) months from the date the subsidiary proprietors of the units having not less than eighty per cent (80%) of the share values as shown in the schedule of strata units for the [property] have signed this Agreement 3.1.4.2.1 There is no Contract of Sale; and 3.1.4.2.2. Where applicable, an application to the STB has not been made pursuant to the terms of the Contract of Sale and/or this Agreement. 3.1.4.3.   The completion of the Collective Sale to the Purchaser and the delivery of vacant possession in accordance with the terms of the Contract of Sale. 60     I was of the view that the provision relating to “permitted time” in cl 3.1.4.1 merely pertains to the period within which subsidiary proprietors holding at least 80% of the share values in the property must sign the Collective Sale Agreement, in order for it to remain in force. There is no provision in either the Collective Sale Agreement or Sale and Purchase Agreement mandating that the minority owners must obtain approval from the Sale Committee before they could become party to the Collective Sale Agreement. The provisions relied on by WTL did not in fact support this proposition. Clause 3.5 of the Collective Sale Agreement, which provides that a party who is not party to the Collective Sale Agreement has no right to enforce any term of that agreement, merely begs the question of how one becomes a party to the agreement. Clause 4 does not create an all-powers agency but instead provides for the authority of the Sale Committee to act on behalf of the consenting owners in certain specific matters or situations and which do not include the approving of the entry into the Collective Sale Agreement of subsidiary proprietors who had not earlier consented to it. Indeed, the term “Consenting Owners” is simply defined in cl 1.1 of the Collective Sale Agreement as “the subsidiary proprietors who have signed this Agreement”. This must be read together with cl 3.4 which provides that the Collective Sale Agreement “shall be regarded as executed notwithstanding that it is executed on separate copies thereof and at different times”. Thus, in practice, a subsidiary proprietor is deemed to have consented to the Collective Sale Agreement so long as he executes,ie, signs on a copy of that Collective Sale Agreement, within 12 months from the date of the Sale and Purchase Agreement (see cl 3(8) of the Sale and Purchase Agreement). This is precisely what the minority owners did in this case: see [21]supra. The claim that “well-established contractual principles” that a non-party cannot unilaterally make itself party to an agreement without the prior approval of the existing parties thereto also holds no water, since if this is the case, it must also logically mean that every majority owner who comes onto the Collective Sale Agreement must seek the approval of the existing parties,viz, the Collective Sale Committee, yet WTL had itself accepted that no such approval was required for the majority owners. 61     As for WTL’s second submission on cl 3(8) (see [56]supra), I have already explained how the additional payments to the minority owners do not in fact dislodge the method of apportionment stipulated by the Collective Sale Agreement and Sale and Purchase Agreement (see [47]supra). Thus, there is no basis to say that the minority owners had not consented to the terms of these agreements. 62     Finally, in respect of WTL’s third submission on cl 3(8), there was in fact no “wrongful gain to Allgreen” as I have already decided above that the additional payments to the minority owners which resulted in their consent to the Collective Sale Agreement and Sale and Purchase Agreement were not in breach of those agreements or the Act (see [53]supra). For the same reason, it cannot be argued that cl 3(8) cannot operate in a situation where there is “disproportionate gain to the minority owners”. Nor can it be said that cl 3(8) could not be relied on where this resulted in loss to the majority owners, since such an argument would contravene the well-established principle that parties to a valid contract cannot excuse themselves from its terms merely because they turn out to have made a bad bargain. 63     For these reasons, I found that cl 3(8) of the Sale and Purchase Agreement had been satisfied, such that the condition of sale in cl 3(5) of the same agreement was deemed to be satisfied. Therefore, the Sale and Purchase Agreement subsisted such that the majority owners were obliged to complete the sale thereunder.",
        "Alleged Further Agreement": "64     WTL submitted that at the 19 November 2007 meeting, the parties had reached the alleged Further Agreement (see [24]supra) under which Allgreen agreed to pay the majority owners an amount of money on account of the fact that the actual development charge had turned out to be below the estimated development charge on which the $34m offer had been based (“the additional sum”). WTL submitted that the additional sum could be computed as follows: (a)    $5.7m – being the difference between the sale price of $34m and $39.7m (the second valuation: see [18]supra); (b)    $6.35m – being the difference between the sale price of $34m and $40.35m (the average of the second valuation of $39.7m and the third valuation of $41m: see [19]supra); or (c)    $6,685,553.00 – being the difference between the actual development charge of $950,894.00 and the estimated development charge of $7,636.447.00. 65     WTL referred me to the affidavit of Ms Carolyn Tan filed on 22 January 2008, in which Ms Carolyn Tan averred that (at [31]): The meeting [between her and Ms Jennifer Yeo (the solicitor from YLP) on 19 November 2007] therefore concluded on the basis and understanding that [Allgreen] and the Sale Committee represented by Jennifer and [her] respectively agreed in principle for [Allgreen] to pay an Additional Sum equivalent to the savings in the development charge payable at the very minimum (“the Further Agreement”), and that Jennifer would revert to [her] with [Allgreen’s] instructions on whether they were agreeable to the Additional Sum being increased to $6.85 million. This was to salvage the deal for [Allgreen] by assisting them to overcome the valuation problem in the sale price. 66     However, WTL was unable to point to any direct documentary evidence of the alleged Further Agreement. I was referred to [32] of Ms Carolyn Tan’s affidavit filed on 22 January 2008 for the explanation for this: After that meeting, I called Ms Wong [Lai Keen] [see [7]supra] to inform her of the positive development and the Further Agreement reached. Ms Wong then enquired whether I should have the Further Agreement and the fact that Jennifer was to revert to me on [Allgreen’s] position as to the request for payment of the Additional Sum of $6.85 million confirmed in writing. I assured Ms Wong that there was no need for that. Based on Jennifer’s standing in society and my great respect and regard for Jennifer and the fact that we had hitherto enjoyed a good working relationship, I saw no reason nor necessity to request from Jennifer or to put on record what we had agreed upon in writing. 67     D&N submitted that Allgreen did not agree with the majority owners’ account of what had transpired during the without prejudice discussions between the parties. According to the affidavit evidence of Ms Jennifer Yeo:[note: 21] There was no agreement whether in principle or otherwise on any ‘settlement’. Neither was there any ‘in principle’ understanding that there would be any settlement. Further, I expressly told Ms Carolyn Tan that I had no mandate at all to agree to any kind of settlement on behalf of the Defendant. She was told repeatedly that there must first be an offer in writing for the Defendant’s consideration. 68     However, D&N contended that even if I were to accept the minority owners’ account, there was no basis in law for the alleged Further Agreement. First, there was a lack of agreement on the amount to be paid under the alleged Further Agreement, which rendered it uncertain. D&N tabulated the different amounts that the majority owners had claimed were to be paid to the majority owners under the alleged Further Agreement.[note: 22]It pointed out that the majority owners were trying to circumvent this fundamental uncertainty by asking the court to decide on the appropriate computation of the sum to be paid (see [66]supra). It contended that the lack of agreement on the amount to be paid was further corroborated by the fact that a draft supplemental agreement which had been sent by T&A to YLP on 29 November 2007 (“the draft supplemental agreement”) was left blank where the amount that Allgreen had allegedly agreed to pay should have been stipulated.[note: 23] 69     Secondly, the alleged Further Agreement was not enforceable as s 6(d) of the Civil Law Act (Cap 43, 1999 Rev Ed) states that: No action shall be brought against… any person upon any contract for the sale or other disposition of immovable property, or any interest in such property… unless the promise or agreement upon which such action is brought, or some memorandum or note thereof, is in writing and signed by the party to be charged therewith or some other person lawfully authorised by him. The alleged Further Agreement was a variation of a contract for the sale of immovable property and was also subject to the requirements of this section:Chitty on Contractsat para 4-015. The alleged Further Agreement was clearly not in writing and the draft supplemental agreement failed to constitute a memorandum or note thereof, since such a memorandum or note must evidence in writing all the material terms of the agreement, including the price:Tay Joo Sing v Ku Yu Sang[1994] 3 SLR 719at [19] (“Tay Joo Sing”). 70     D&N submitted that the fact that the alleged Further Agreement was a mere afterthought on the majority owners’ part was clear from the evidence. In various correspondences to YLP after the alleged meeting between Ms Carolyn Tan and Ms Jennifer Yeo on 19 November 2007, T&A had not once mentioned the alleged Further Agreement.[note: 24]It was only in the 19 December 2007 WTL letter (see [24]supra) that the existence of the alleged Further Agreement was first raised. 71     D&N also submitted that there was no consideration for the alleged Further Agreement, since in exchange for the additional sum to be paid under it, the majority owners merely promised to use their best endeavours to obtain the STB’s approval for the sale of the property, which they were already obliged to do under cl 3(6) of the Sale and Purchase Agreement. Finally, it advanced the argument that the alleged Further Agreement had been obtained by economic duress,viz, the possibility that the Sale and Purchase Agreement might not be completed because the majority owners would object to the sale at the STB hearing. 72     I found that there was no further agreement entered into between the parties. It was difficult to believe that Ms Carolyn Tan and the Sale Committee would have chosen not to confirm such an important agreement in writing. The absence of documentary evidence could only have meant that the parties did not in fact arrive at any such further agreement. In my view, the draft supplemental agreement was the offer in writing made by T&A (on behalf of the Sale Committee) to Allgreen to make an additional payment to the majority owners, which Ms Jennifer Yeo had averred she requested from Ms Carolyn Tan.[note: 25]Allgreen had not accepted this offer and thus no further agreement was formed. As for the lack of mention of the alleged Further Agreement in subsequent correspondence between the parties, WTL claimed that the reason for this was that after YLP had informed the majority owners that unanimous consent had been obtained in the letter dated 30 November 2007 (see [23]supra), the Sale Committee had become disenchanted with Allgreen and decided to seek further advice from WTL instead (thus leading to the first mention of the alleged Further Agreement in the 19 December 2007 WTL letter: see [24]supra). I was not convinced by this argument. The letter from T&A to YLP on 6 December 2007 is revealing. It states at para 6:[note: 26] …[P]lease confirm that the Minority Owners have agreed to the apportionment formula for the sale proceeds and that your clients have not agreed to pay an additional sum to them. If so,then the additional sums your clients have agreed to pay the Minority Owners must be included in the Sale Price and distributed according to the apportionment formula in the Collective Sale Agreement and the Sale & Purchase Agreement.[emphasis added] 73     The Sale Committee was not so disenchanted with Allgreen as to refrain from making the request in the emphasised portion of this quote. Indeed, such a request should have been entirely unnecessary if the alleged Further Agreement had indeed been reached at the 19 November 2007 meeting. Thus, my conclusion was that there was in fact no such further agreement. 74     In any case, even if the alleged Further Agreement had been reached at the 19 November 2007 meeting, it was only oral and not made in writing signed by the party to be charged, and therefore under s 6(d) of the Civil Law Act no action could be brought on it as it pertained to a contract for the sale of immovable property. WTL argued that the alleged Further Agreement was a collateral agreement not involving the acquisition of land but rather pertaining only to the making of additional payment, and thus did not have to satisfy s 6(d) of the Civil Law Act:Chitty on Contractsat 4-016. However, that paragraph fromChitty on Contractsstates: If a collateral agreement, not involving the acquisition of land,is entered into at or before the time of making a written contract concerning land, the collateral agreement does not have to be evidenced in writing. [emphasis added] 75     In the present case, the alleged Further Agreement was not entered into at or before the making of the Sale and Purchase Agreement and thus it could not be considered a collateral contract so as to escape the requirements in s 6(d) of the Civil Law Act. I accepted D&N’s submission thatTay Joo Singmade it clear that the draft supplemental agreement could not constitute a note or memorandum of the alleged Further Agreement so as to satisfy s 6(d) of the Civil Law Act, because the draft supplemental agreement did not contain the key term – the amount to be paid. 76     For the reasons above, I found that WTL’s arguments on the alleged Further Argument could not stand. It was thus unnecessary to canvass the arguments on uncertainty, consideration and economic duress. At the risk of stating the obvious, it should also be noted that the majority owners could receive no damages for the repudiation of an alleged Further Agreement that did not in fact exist.",
        "Fraud on the Revenue": "77     It remains to deal with one last point. WTL submitted that the purchase of the minority owners’ units would have to be stamped for a sum including the additional payments to the minority owners. To the extent this is not done, Allgreen would be committing fraud on the Inland Revenue Authority of Singapore (“IRAS”). I accepted D&N’s response it is for Allgreen to persuade IRAS that the sale price of the property is $34m and that the additional payments received by each minority owner are not relevant for the purposes of stamp duty. There is no suggestion that Allgreen will suppress any information from IRAS. It is for IRAS to determine what stamp duty is ultimately payable by Allgreen.",
        "Costs": "78     I ordered the majority owners to pay the costs of SUM 547/2008 to the minority owners. The costs of OS 90/2008 (not including SUM 547/2008) and OS 54/2008 were ordered to be paid by the majority owners to Allgreen, to be taxed if not agreed. _________________ [note: 1]Plaintiff’s Bundle of Documents Vol 1 filed on 26 February 2008 in OS 90/2008 at Tab 1. [note: 2]Plaintiff’s Bundle of Documents Vol 1 filed on 26 February 2008 in OS 90/2008, at Tab 2.[note: 3]Wong Lai Kin’s second affidavit filed on 19 February 2008 in OS 54/2008 at [57] to [58].[note: 4]See Wong Tan & Molly Lim’s submissions for hearing on 28 February 2008 at [65].[note: 5]Plaintiff’s Bundle of Documents Vol 1 filed on 26 February 2008 in OS 90/2008 at Tab 4.[note: 6]1st-44thDefendants’ Bundle of Documents filed on 16 April 2008 in OS 90/2008 at Tab 7.[note: 7]See transcript of the STB hearing at p 62, in Plaintiff’s Bundle of Documents Vol 3 filed on 26 February 2008 in OS 90/2008 at Tab 32.[note: 8]See Annex 1 to the letter from WTL to YLP dated 19 December 2007, in Plaintiff’s Bundle of Documents Vol 3 filed on 26 February 2008 in OS 90/2008 at Tab 14. See also Wong Lai Keen’s first affidavit filed on 21 January 2008 in OS 54/2008 at [30].[note: 9]1st-44thDefendants’ Bundle of Documents in OS 90/2008 filed on 16 April 2008 at Tab 11.[note: 10]ibidat Tab 12.[note: 11]Plaintiff’s Bundle of Documents Vol 3 filed 26 February 2008, at Tab 14.[note: 12]ibid, at Tab 16.[note: 13]See the official transcript of the STB hearing, in Plaintiff’s Bundle of Documents Vol 3 filed 26 February 2008 at Tab 32.[note: 14]See Wong Lai Keen’s affidavit filed on 5 February 2008 in SUM 547/2008 at [13].[note: 15]Plaintiff’s Bundle of Documents Vol 3 filed 26 February 2008 atTab 18.[note: 16]id.[note: 17]See Wong Lai Kin’s first affidavit in OS 54/2008 filed on 21 January 2008 at p 116.[note: 18]See Plaintiff’s Bundle of Documents Vol 1 in OS 90/2008filed on 26 February 2008 atTab 1.[note: 19]See Ng Peck Chin’s affidavit in OS 254/2008 filed on 26 February 2008, at p 410.[note: 20]Hansard Report, Parliament No. 9, Session No. 1, Sitting No. 4 (Sitting Date 31 July 1998) at Column 603.[note: 21]Jennifer Lai-Peng Yeo’s first affidavit filed on 12 February 2008 in OS 54/2008 at [34].[note: 22]See Plaintiff’s Skeletal Submissions filed on 26 February 2008 in OS 90/2008 at [177].[note: 23]See Plaintiff’s Bundle of Documents Vol 3 filed on 26 February 2008 in OS 90/2008 at Tab 28.[note: 24]See, for example, T&A’s letter dated 6 December 2007, at Plaintiff’s Bundle of Documents Vol 3 filed on 26 February 2007 in OS 90/2008 at Tab 30.[note: 25]Jennifer Lai-Peng Yeo’s first affidavit filed on 12 February 2008 in OS 54/2008 at [34].[note: 26]Plaintiff’s Bundle of Documents Vol 3 filed on 26 February 2008 in OS 90/2008 at Tab 30."
    }
}