{
    "case_title": "Ting Kang Chung John v Teo Hee Lai Building Construction Pte Ltd and Others",
    "ncitation": "[2008] SGHC 200",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The background": "4       The plaintiff had filed the OS on 21 September 2006 seeking the following reliefs: (a)time for the plaintiff to issue the Arbitration award be extended to 15 April 2005; (b)    the defendants do jointly and severally pay the plaintiff the sum of $199,178.40 being the arbitrator’s fee outstanding and due under the Arbitration; (c)     Costs. (Subsequently, the plaintiff amended the OS to include an alternative prayer for his fees to be taxed). 5       Before the OS could be heard, the second defendant applied to court on 18 October 2006 under summons no. 4827 of 2006 (“the second defendant’s application”) for inter alia discovery and inspection of certain pages in the Award. The second defendant’s application was dismissed on 1 November 2006 against which decision he appealed to a judge in chambers in RA314 of 2006 (“the second defendant’s appeal”). The second defendant’s appeal was dismissed on 30 November 2006. 6       Numerous other applications were made to court by the parties but mostly by the couple. The net result was to delay the hearing of the OS indefinitely. Further, the couple chose to act in person although eventually, the third defendant appointed solicitors to represent her. 7       Amongst the many interlocutory applications filed in the OS was summons no. 5671 of 2007 (“the plaintiff’s application”) wherein the plaintiff prayed for inter alia an injunction. The plaintiff’s application (filed on 27 December 2007) although not endorsed as ex-parte, was heard on an ex-parte basis and was granted on 2 January 2008 (“the injunction order”) by Justice Lee Seiu Kin (“Lee J”). The injunction order contained the following salient prayers: (a)    the second and third defendants must not remove from Singapore or in any way deal with or diminish the value of any of their assets which are in Singapore whether in their own name or not and whether solely or jointly owned up to the value of $250,000; (b)    this prohibition includes the asset represented by the property known as No 2 Siglap Valley, Singapore 455810 (the property) or the net sale money (hereinafter referred to as “the net proceeds of sale”) after payment of any mortgagees/CPF charge and sale expense if it has been sold; (c)    the second and third defendants to be prohibited from collecting the sum of $250,000 out of the net proceeds of sale from the purchasers Mdm Chiu Chi Ling and Mr Ng Tien See (hereinafter referred to as “the purchasers”) in the completion of sale of the property; (d)    the purchasers be authorised to pay the said $250,000 out of the net proceeds of sale to the plaintiff’s solicitors (M/s Ng & Koh) at the completion of sale of the property and such payment be deemed good and sufficient discharge of the purchasers’ obligation with respect to their purchase price to the extent of the said $250,000 at the completion of sale of the property; (e)    upon receipt of payment of the said $250,000 from the purchasers, the plaintiff’s solicitors shall hold the same as stakeholders pending the resolution of this Originating Summons, including the costs of the action herein. 8       According to his affidavit filed in support of the plaintiff’s application, the plaintiff discovered from a caveat lodged by the aforesaid purchasers, that the property had been sold for $3.06m, by an option that was exercised by the purchasers on 26 October 2007. The sale would probably be completed some time in January 2008 based on the usual timelines of 12 weeks for completion after an option is exercised. 9       The plaintiff deposed that since October 2007, the couple had been waging interlocutory battles with him which (the plaintiff believed) were made in bad faith and designed to delay the hearing of the OS beyond the completion date of the sale of the property. The plaintiff referred to an affidavit filed by the second defendant in September 2007 in the second defendant’s application to discharge himself from bankruptcy. In that affidavit, the second defendant had revealed the sale of the property and that he would receive cash of $600,000 after paying off the outstanding mortgage on the property. The plaintiff believed the couple would spirit the cash amount out of his reach after selling the property. 10     In his affidavit filed in support of the OS as well as for the plaintiff’s application, the plaintiff elaborated in detail the reasons for the OS and what transpired in the arbitration proceedings. He explained that he had accepted the appointment of arbitrator on 10 December 2001 on the basis that he was to have the power to issue an award on his own fees. This was to avoid becoming embroiled (as turned out to be the case) in disputes between the defendants over his fees. The plaintiff relied on cl 37 of the building contract for the property which incorporated the arbitration rules published by the SIA and on rule 16; it empowered the arbitrator not only to make a binding award on the merits of the arbitration but also on the costs (including the arbitrator’s fees) incurred in the arbitration. 11     Apart from an initial deposit of $43,500, the plaintiff deposed that he had not received any further payment for his fees as arbitrator and the balance of $198,700 of his fees of $242,200 was still outstanding. 12     In relation to the arbitration proceedings itself, the plaintiff deposed that the hearing was scheduled for November 2002. However, the couple applied on 20 November 2002 in OM 26 of 2002 (“the OM”) to remove him as the arbitrator and for refund of the sum of $8,250 they had paid him. Consequently, the arbitration hearing was vacated. The OM was dismissed on 21 January 2003. The arbitration was then rescheduled to be heard in June 2003. However, because of the second defendant’s appeal in Civil Appeal No. 10 of 2003 (against the dismissal of the OM), the June 2003 was again vacated. After Civil Appeal No. 10 of 2003 was dismissed on 18 August 2003, the plaintiff rescheduled the arbitration to November 2003. According to the plaintiff, these repeated rescheduling of hearing dates resulted in extra time being spent on interlocutory hearings and he had to refresh his memory on the merits of the arbitration. 13     The first defendant then made an application to the plaintiff on 19 November 2002 on the couple’s failure to pay their share of the deposit of the arbitration fees. 14     The first defendant attended the hearings on 19, 21 and 24 November 2003 but the couple did not turn up; neither did their witnesses. Nevertheless, the plaintiff directed all the defendants to file their written submissions by December 2003. Only the first defendant complied with the plaintiff’s directions. 15     The plaintiff acknowledged that the arbitration award was due in February 2004 but explained that he had by then assumed the Presidency of the SIA and, his commitments as president kept him fully occupied. These commitments included negotiations on the new legislation called The Building and Construction Industry Security of Payment Act Cap 30B 2006 Rev Ed (which first came into effect on 3 January 2005 for certain sections) and the Household Shelter regulations. 16     Apparently, the second defendant had also complained about the plaintiff to the police, newspapers and to the Ministry of Home Affairs. It necessitated the plaintiff spending time to attend to the complaints as well as to the second defendant’s Magistrate’s Complaints in CM002943-04 and 002436-04. These were resolved in February 2005 when the magistrate’s court declined to proceed further on the complaints. 17     Only then was the plaintiff able to concentrate on preparing the Award. which he published on 15 April 2005. However, despite waiting for a year, neither the first defendant nor the couple collected the Award. 18     After the Award was issued, the defendants challenged the plaintiff’s fees. However, none of the defendants applied to court to tax the plaintiff’s fees. After waiting for more than a year either for the defendants to collect the Award or to pay his fees, the plaintiff commenced the OS. 19     After the commencement of the OS, the couple resisted the hearing of the OS by filing one interlocutory application after another. After they failed in their applications, the couple failed to pay the costs awarded to the plaintiff. As a result, the plaintiff took out a writ of seizure and sale (“the WSS”) against the property. The couple applied to set it aside and the WSS was discharged in October 2007 when the plaintiff’s costs of $1,500 were paid. 20     The couple was made bankrupt at end 2006. When he was informed of this in September 2007, the plaintiff filed a proof of debt against the couple’s bankrupt estates. Their only asset then was the property. However, the couple managed to raise $25,000 and paid off the creditor who petitioned for their bankruptcy; they were discharged from bankruptcy in October 2007. The plaintiff’s debt however was not paid as it was felt (by the bankruptcy court) that the claim was too complex. 21     Thereafter, the second defendant launched further applications against the plaintiff, essentially for discovery of documents. The second defendant had also filed an appeal, after he failed in his application of 12 December 2007 to have the OS dismissed and for a committal order against the plaintiff (on the ground that the plaintiff had not complied with discovery orders made in the second defendant’s favour). Those applications/appeals covered the period October 2007 to 17 January 2008. (The second defendant’s appeal on his unsuccessful attempt to have the OS struck out was subsequently heard on 17 January 2007 and was dismissed). 22     The plaintiff deposed he was prompted to apply for the Mareva injunction (which in essence was his application although not so stated) as he feared that if the second defendant’s then appeal (in RA400 of 2008) was heard on 17 January 2008, the couple would have achieved their aim. By then the sale of the property would have been completed before the plaintiff could mount any execution proceedings. 23     Pursuant to the order of court dated 2 January 2008, the sum of $250,000 enjoined by the injunction order was not paid to the couple or to the plaintiff’s solicitors as stakeholder but was paid into court. 24     On 10 January 2008, the third defendant applied in summons no. 124 of 2008 (“the discharge application”) for the injunction order to be discharged. I heard and dismissed the discharge application on 11 February 2008 but reserved costs to abide the outcome of the hearing of the OS for which I directed the Registrar to give an early date. 25     Under s 34(1)(c) of the Supreme Court of Judicature Act Cap 322 2007 Rev Ed (“the SCJA”), the third defendant should have written to my court within seven days of 11 February 2008, requesting me to hear further arguments before she appealed against my decision, if her request was rejected. She did not. 26     On 22 February 2008, the third defendant applied to court under summons no. 834 of 2008 (“the extension application”) seeking an extension of time to submit her request for further arguments. In her affidavit filed in support of the extension application, the third defendant explained that she was under the impression that she could appeal against my decision within one month of 11 February 2008 and she was unaware of s 34(1)(c) of the SCJA until she gave instructions to her counsel to appeal on 21 February 2008. She deposed that for two previous applications heard by Justices Woo Bih Li and Tay Yong Kwang, when the second defendant appealed against their decisions, his notices of appeals (made in person) were accepted by the Registry without his first having applied to the two judges for further arguments. 27     I allowed the extension application on 22 May 2008 and directed that the third defendant’s request for further arguments should be put in by 12 noon of Monday 26 May 2008. I reserved costs of the application to abide the outcome of the hearing of the OS. 28     The third defendant duly complied with my direction and her counsel submitted a request for further arguments by the deadline I had imposed. I considered the request but did not accede to it as I was of the view that no new arguments had been raised over and above those already canvassed by her counsel at the hearing on 11 February 2008. The third defendant has now filed a notice of appeal (in Civil Appeal No. 80 of 2008) against my decision in refusing to discharge the injunction order.",
        "The third defendant’s arguments": "29     The third defendant pointed out that although the injunction order was obtained on 2 January 2008, her counsel was only served with the order of court on 4 January 2008. As of 11 February 2008 when the discharge application was heard, neither the couple nor the third defendant’s counsel had been served with the plaintiff’s application in [6] which led to the injunction order. In fact, the third defendant’s counsel had to obtain a copy from the High Court registry. 30     The third defendant argued that the plaintiff’s application had not complied with Practice Direction No. 2007 rule 41 which govern applications for injunctions. Although the plaintiff’s application was not stated to be ex-parte which meant it was to be an inter-partes application, the couple was not notified or served with the papers and the plaintiff proceeded to obtain the injunction ex-parte from Lee J. 31     The plaintiff’s affidavit deposing the couple would have surplus cash of $600,000 from the sale of the property was also incorrect. There was also no evidence to support the plaintiff’s claim that the couple would spirit away the sale proceeds that they receive. 32     Further, the plaintiff should have taken action straightaway after publishing his Award in April 2005. The delay was twofold: first, in the publication of the Award which took one year and four months instead of 60 days as stipulated under cl 14.1 of the SIA Rules with time being of the essence; second, in the enforcement of the plaintiff’s fees. An injunction is an equitable remedy and the plaintiff’s delay was a classic example of laches which is a good defence to a claim for equitable relief. Moreover, according to Justice Andrew Ang (who heard RA241 of 2006 which was the second defendant’s appeal against the stay of proceedings order granted to the first defendant for Suit 348 of 2006), the arbitration had been “abandoned” due to the delay involved. 33     Counsel for the third defendant pointed out that the bankruptcy court had examined the plaintiff’s proof of debt and found that the debt was neither proven nor contingent. So no amount was determinable as being payable to the plaintiff. What was even more damaging to the plaintiff was the fact that he was seeking the court’s leave to have his fees taxed. Questioned by the court, counsel for the third defendant alleged that the plaintiff had botched up the arbitration and he would be contending at the hearing of the OS that the plaintiff was not entitled to any fees. 34     It was further alleged that there was no full and frank disclosure by the plaintiff who inter alia omitted to inform Lee J that: (a)    he had made two previous (unsuccessful) applications to obtain security from the couple: by attempting to appoint a receiver for the property and auction it to recover his unpaid costs of $1,900 and by a WSS and lodging a caveat against the property to recover another set of costs ($1,500); (b)    his proof of debt had been rejected by the bankruptcy court as the Assistant Registrar opined that the plaintiff’s fees had not been determined and would not be known until after the outcome of the OS. 35     The second defendant (who appeared in person) associated himself with the submissions tendered on the third defendant’s behalf. He pointed out that the plaintiff was fully aware that an option had been granted for the property and that it had to be extended because of the plaintiff’s caveat. Yet, the plaintiff waited for more than three months before he applied for the injunction order. Further, it took the plaintiff more than a year to write a 6 page award. 36     The second defendant added that it was untruthful of the plaintiff to allege that the couple had made many discovery applications when it was the plaintiff’s own disclosure of documents that resulted in a need on their part to discover further documents from him. The second defendant complained that because of the plaintiff’s caveat on the property and the plaintiff’s delay in withdrawing it when the property was sold, the couple had to pay extra interest to the mortgagee bank DBS. Moreover, the net sale proceeds received by the couple were just over $400,000 not $600,000 of which sum the couple received less than $200,000 (because $250,000 was paid into court pursuant to the injunction order). The couple are disallowed from buying a public housing flat until 13 months have lapsed after the sale while $250,000 of their money was not available to them as collateral for their business. They had also lost the house which was the subject of the arbitration by the plaintiff. 37     The second defendant described the plaintiff’s action as oppressive and the court should therefore set aside the injunction. He questioned why the plaintiff was only going after the couple when his action was against all three defendants. It was unfair and unjust to freeze the couple’s funds when they had a counterclaim against the plaintiff and there was no solid evidence that they would dissipate their funds as the plaintiff alleged.",
        "The plaintiff’s submissions": "38     Counsel for the plaintiff denied that his client was aware of the option. The plaintiff only had the purchasers’ caveat at the time the plaintiff filed his affidavit for the OS. Counsel explained that the plaintiff was fearful that the couple may spirit away the sale proceeds of the property because the plaintiff had seen a letter written by the couple (or one of them) to the Official Assignee applying for permission to go to Malaysia in order to raise the funds to discharge their bankruptcy. As it turned out (according to the second defendant), the couple eventually procured two Singaporeans to facilitate payment to their creditors in the last quarter of 2007. Counsel pointed out that the couple had the resources to find the funds to pay off their creditors as and when it suited them and not otherwise. 39     Counsel acknowledged that the plaintiff’s application was not headed ex-parte or certified as ex-parte but submitted that was only an irregularity. He pointed out that it was the Registry that decided to inform only the plaintiff of the hearing date because of the need for secrecy; it was not the plaintiff’s decision not to inform the couple of the plaintiff’s application. 40     Counsel set out the history of the contentious proceedings between the parties particularly on the second defendant’s four attempts (between October 2006 and December 2007) at seeking discovery from the plaintiff. When the second defendant failed in these and other applications, he appealed. On her part, the third defendant applied to strike out the OS and appealed when she failed in her application. Counsel alleged that the second defendant’s persistence at jamming the machinery of litigation by his incessant interlocutory applications and appeals (quoting from Justice Tay Yong Kwang’s grounds of decision for RA400 of 2007 in[2008] SGHC 54) was aimed at delaying the OS hearing so that the couple could collect the proceeds from the sale of the property and siphon them away before the plaintiff could obtain judgment and execute against them. 41     Counsel cited Halsbury’s Laws of Singapore 2002 LexisNexis Singapore vol 4 page 326-327 para 50.376 and 50.378 (that the plaintiff had a good arguable case and there was the risk of dissipation of assets) to support the plaintiff’s argument that there was a need for an injunction against the couple pending the hearing of the OS. Contrary to the second defendant’s submission, counsel pointed out that time was not of the essence in the issue of the Award. Time was of the essence only in relation to the plaintiff’s acceptance of his nomination as arbitrator, not for the issuance of the Award.",
        "The decision": "42     I dismissed the discharge application as I was of the view that the status quo should be preserved until the hearing of the OS for which I directed an early hearing date to be fixed. Undoubtedly, on the principles applicable to injunctive relief (see Halsbury’s Laws of Singapore in [41] supra), the plaintiff had satisfied the court that: (i)      he had a good arguable case; (ii)    the property was an asset within the court’s jurisdiction, and (iii)   there was a fear that the couple did not intend to pay the plaintiff’s claim should he succeed in obtaining judgment. 43     I address next the third defendant’s argument in relation to Practice Direction 2007 Rule 41 (“the Rule”) onex parteapplications for injunctions. The Rule states: (1)    Order 29, Rule 1 of the Rules of Court provides that an application for the grant of an injunction may be made ex parte in cases of urgency. However, the cases ofCastle Fitness Consultancy Pte Ltd v Manz[1989] SLR 896andThe Nagasaki (No. 1)[1994] 1 SLR 434take the position that an opponent to an ex parte application, especially where the application seeks injunctive relief, should be invited to attend at the hearing of the application. (2)    In view of this, any party applying ex parte for an injunction (including a Mareva injunction) must give notice of the application to the other concerned parties prior to the hearing. The notice may be given by way of facsimile transmission or telex, or, in cases of extreme urgency, orally by telephone. The notice should inform the other parties of the date, the time and place fixed for the hearing of the application and the nature of the relief sought. If possible, a copy of the ex parte summons should be given to each of the other parties. At the hearing of the ex parte application, in the event that some or all of the other parties are not present or represented, the applicant’s solicitors should inform the Court of the attempts that were made to notify the other parties or their solicitors of the making of the application. (3)    The directions set out in sub-paragraph (2) need not be followed if the giving of the notice to the other parties, or some of them, would or might defeat the purpose of the ex parte application. However, in such cases, the reasons for not following the directions should be clearly set out in the affidavit prepared in support of theex parteapplication. 44     Granted, there was non-compliance with the above Practice Direction by the plaintiff. The question that arose for consideration was whether the plaintiff had brought himself within the exception in (3) above – were there valid grounds for the plaintiff to fear that the couple would dissipate the balance sale proceeds of the property if he did not apply for the injunction order? 45     To answer the question I have posed, it is necessary to look at the history of the OS. In the ordinary course of events, an Originating Summons filed in the High Court on 21 September 2006 would have/should have been disposed of within 18-24 months; this was not the case for the OS. The year 2008 is drawing to a close and the OS has yet to be heard. Why? The delay is mainly attributable to the conduct of the couple particularly that of the second defendant, in filing an appeal against the decision of (almost) every judge who has ruled against him on his/the couple’s applications. 46     Apart from his appeal against my decision in Civil Appeal No 80 of 2008, [2], the second defendant has filed the following Notices of Appeal in the OS: (a)    Civil Appeal No. 15 of 2008 – appeal against the decision of Woo Bih Li J given on 17 January 2008; (b)    Civil Appeal No. 21 of 2008 appeal against the decision of Tay Yong Kwang J given on 4 February 2008; (c)    Civil Appeal No. 172 of 2008 -- appeal against the decision of Choo Han Teck J given on 26 September 2008; Unless and until the above appeals as well as Civil Appeal No 80 of 2008 are disposed of, the OS proper cannot be heard. 47     I note from the cause papers index of the OS that the second defendant continues with his seemingly tireless efforts of filing one application after another against the plaintiff. Yet the second defendant complained before this court that it was the plaintiff who had taken out repetitive action against him and the third defendant. The last application filed by the second defendant was on 7 August 2008 viz summons no. 3458 of 2008 which the court below did not grant on 20 August 2008 (because the second defendant refused to proceed arguing that the Assistant Registrar (“AR”) lacked the jurisdiction to set aside the orders made by another AR, which was the subject matter of the summons). The second defendant then promptly filed RA348 of 2008 against the Assistant Registrar’s decision. The appeal was heard and dismissed by Choo J on 26 September 2008 and is now the subject of the second defendant’s Notice of Appeal No. 172 of 2008. 48     It bears remembering too that the plaintiff had to resort to the drastic measure of taking out a WSS [33(a)] (which was set aside on the couple’s application) before he was paid his costs of $1,500 for an unsuccessful interlocutory application of the second defendant. 49     The pattern of the second defendant’s past conduct leaves little doubt that that he and the third defendant are unlikely to be willing to pay the plaintiff’s costs and claim should the plaintiff eventually succeed in the OS, unless the plaintiff’s claim was first secured. I am certain of this surmise notwithstanding the couple’s protestations that they have no intention of running away from their obligations should the plaintiff succeed. The couple may not dissipate the balance sale proceeds of the property but it is highly unlikely they will utilise the same to discharge the plaintiff’s debt, because of the obvious animosity between the couple and the plaintiff, arising out of the arbitration proceedings. Indeed, to say the parties are at loggerheads would probably be an understatement. 50     I move next to the issue of the plaintiff’s alleged failure to make full and frank disclosure in the hearing before Lee J. At the outset, I should correct the misconception that the plaintiff’s obligation to make full disclosure is absolute. That is not the law. A party applying for injunctive relief must make full and frank disclosure of material facts. In Tay Long Kee Impex Pte Ltd v Tan Beng Huwah (trading as Sin Kwang Wah)[2000] 2 SLR 750(cited by the third defendant), the Court of Appeal defined “material facts” as those which were material for the judge to know in dealing with the application, although it need not be decisive. Were the two facts in [34] so material that had he been informed, it would have made a difference to Lee J’s decision whether to grant the injunction? I think not. Had it been this court that heard the plaintiff’s application and had counsel for the plaintiff informed me of the plaintiff’s two previous unsuccessful attempts to levy execution proceedings to recover his costs, it would not have made any difference to my discretion; I believe I would still have granted the injunction order. The fact that the plaintiff had to resort to such drastic measures to recover comparatively small amounts of costs showed that the plaintiff was driven to desperation or, the couple would not pay the plaintiff’s costs otherwise or both. As for not disclosing that the plaintiff’s proof of debt had been rejected, that omission is neither here nor there. It should not have made one iota of difference to the court since it was precisely because of that rejection that the plaintiff filed the OS to recover his arbitrator’s fees. 51     Even where material non-disclosure had been established, the Court of Appeal in the above case held that the court nevertheless retained a discretion either to continue the ex parte order or grant a fresh order, depending on the nature of the non-disclosure and the circumstances of the case. Further, the fact that there had been non-disclosure of a material fact to the first judge did not prevent the grant of further relief at a subsequent application when that fact was fully before the court (see Brink’s-Mat Ltd v Elcomb & Ors [1988] 3 All ER 188).",
        "Conclusion": "52     I considered all the relevant factors involved and decided that the most equitable solution under the circumstances would be to maintain the status quo, let the injunction order remain but have an early hearing date for the OS. Unfortunately, because of the second defendant’s many pending appeals, my direction cannot be implemented."
    }
}