{
    "case_title": "Jiang Haiying v Tan Lim Hui and Another Suit",
    "ncitation": "[2009] SGHC 42",
    "coram": "Andrew Ang J",
    "sections": {
        "Background facts": "3   The plaintiff (Jiang Haiying) is a Chinese national and a permanent resident in Singapore. He had set up a shipping company in Singapore known as Dehai Marine Shipping (Singapore) Pte Ltd (“Dehai Singapore”) with the assistance of Tan Lim Hui (“Tan”), the defendant in Suit No 531 of 2007. Through the introduction of Tan, the plaintiff got to know Sim Poh Ping (“SPP”), the defendant in Suit No 530 of 2007. SPP ran a company called Vita Holdings Pte Ltd (“Vita”). 4   Sometime in August 2001, the plaintiff transferred 50,000 and 490,000 shares in Dehai Singapore to Tan and SPP respectively (“the Transfer”). This transfer was at the core of the dispute. The plaintiff asserted that he was informed by Tan that the transfer was necessary in preparation for the listing of Dehai Singapore and that, at all material times, Tan and SPP (“the defendants”) were to hold the shares in trust for him. However, the defendants denied that there was any trust and that the Transfer was made to reward them for their help and continuing role in the prospective listing of Dehai Singapore then. These denials were maintained even in the face of the following written acknowledgments made by Tan and SPP, respectively, on 19 November 2001, as follows: This letter is to confirm that Mr Jiang Haiying as at 19thNovember 2001 has a total of 50,000 shares of DEHAI MARINE SHIPPING (SINGAPORE) PTE LTD OF S$1/- PAR VALUE EACH under the name of Tan Lim Hui. This letter is to confirm that Mr Jiang Haiying as at 19thNovember 2001 has a total of 490,000 shares of DEHAI MARINE SHIPPING (SINGAPORE) PTE LTD OF S$1/- PAR VALUE EACH under the name of Sim Poh Ping. (Strangely, even though the written acknowledgment by Tan stated that he held 50,000 Dehai Singapore shares under the name of the plaintiff, the written submissions by counsel for Tan argued that 54,000 shares of the same was transferred to Tan by the plaintiff.) 5   On or about 1 March 2003, SPP sold the 490,000 shares in Dehai Singapore that he had received from the plaintiff to his sister, SPH, for $2m. The plaintiff claimed that he was unaware of this sale. In any case, after the sale of SPP’s shares to SPH, the shareholding of Dehai Singapore stood as follows: ShareholderNumber of DehaiSingapore SharesPercentage of DehaiSingapore SharesThe plaintiff(Jiang Haiying)426,00043.9%Tan54,0005.6%SPH490,00050.5% 6   Subsequently, on 30 June 2004, the plaintiff, Tan and SPH transferred all their Dehai Singapore shares to Vita, as part of the listing process for Vita. In consideration thereof, 2,775,941 shares in Vita were issued to a company known as Kingley Agents Ltd (“Kingley”) whose shares were, in turn, held by the plaintiff, Tan and SPH in the following proportions:  ShareholderNumber of KingleySharesPercentage ofKingley SharesThe plaintiff(Jiang Haiying)31231.2%Tan21621.6%SPH47247.2% (It will be noted that the percentage shareholdings of the plaintiff, Tan and SPH in Dehai Singapore were different from their respective shareholdings in Kingley. More will be said about this later.)  Thus, the plaintiff, Tan and SPH effectively exchanged their Dehai Singapore shares for Kingley shares. In this way, Tan no longer owned the 50,000 Dehai Singapore shares which the plaintiff had transferred to him in August 2001. Subsequently, on 30 November 2004, the aforementioned 2,775,941 Vita shares held by Kingley were subdivided into approximately 46,265,683 Vita shares. Of these, Tan’s share, as held through Kingley, was 2,384,829 Vita shares. 7   The plaintiff claimed that he did not understand the terms under which his Dehai Singapore shares were to be transferred to Vita even though he had signed the relevant agreement. This was because he was unable to read the agreement in the English language without translation. Instead, the plaintiff proceeded with the transfer based on his trust in Tan. Subsequently, having discovered the number of Kingley shares he ought to be entitled to, the plaintiff became unhappy with what he perceived to be “a completely inequitable and one-sided” distribution in favour of the defendants and SPH: see the plaintiff’s affidavit filed on 19 November 2007 at para 5. It was also at this time that the plaintiff claimed he discovered that the Dehai Singapore shares he had reposed in SPP had been transferred to SPH. 8   According to the plaintiff, in order to assuage his dissatisfaction with the number of Kingley shares received, he entered into a sale and purchase agreement (“the SPA”) on 31 March 2006 to sell his 312 shares in Kingley to SPH and two other individuals. The consideration for this sale was $7m to be paid in three instalments. It is cl 16 of this SPA that the defendants are relying on in their application for a stay of proceedings in favour of arbitration. Clause 16, reproduced as follows, states: Any dispute, whether contractual or not, arising out of or in connection with this Agreement (including any question regarding its existence, validity or termination) shall be referred to and finally resolved by arbitration in Singapore in accordance with the Arbitration Rules of the Singapore International Arbitration Centre (“SIAC Rules”) for the time being in force, which rules are deemed to be incorporated by reference into this clause, save that Rule 32 of the SIAC Rules and the provisions of the International Arbitration Act (Cap. 143A) shall not apply. 9   After the SPA was concluded, the plaintiff commenced three actions. In Suit No 530 of 2007, the plaintiff claimed against SPP for conversion of the 490,000 Dehai Singapore shares transferred to SPP in August 2001 on the basis that SPP had sold the shares without the plaintiff’s consent (see [5] above). In Suit No 531 of 2007, the plaintiff prayed for a declaration that Tan was holding 2,384,829 Vita shares, through Kingley, in trust for the plaintiff. (No conversion is claimed since the plaintiff knew that Tan had sold the 54,000 Dehai Singapore shares that the plaintiff gave Tan: see [6] above). The third action was Suit No 553 of 2007 where the plaintiff claimed against SPH for the return of Vita warrants that he contended was held in trust for his benefit. In that action, SPH applied, successfully, for a stay of proceedings pursuant to cl 16 of the SPA. 10  At the hearing before the AR below, SPH applied to be made a defendant in both Suit Nos 530 and 531 of 2007. At the same time, SPH and the defendants together applied to have both suits stayed in favour of the said arbitration in [9] above. 11  After considering the arguments made by both parties, the AR made the following orders: (a) The application by SPH and the defendants to have the proceedings in Suit Nos 530 and 531 of 2007 stayed be dismissed. (b) The application by SPH to be added as a defendant to both suits be allowed. (c) The defendants to pay costs of $3,500 to the plaintiff.",
        "Parties’ submissions": "",
        "The defendants’ submissions": "12  The defendants appealed against the AR’s decision not to stay the proceedings. In support of this appeal, counsel for the defendants, Mr Wendall Wong (“Mr Wong”) made the following arguments: (a) The claims alleged by the plaintiff against the defendants in Suit Nos 530 and 531 of 2007 are intimately intertwined with the SPA such that the doctrine of equitable estoppel applied; (b) The defendants were the intended beneficiaries of the SPA; (c) There was a collateral contract between the plaintiff and SPP such that SPP could rely on the SPA; and (d) Allowing the proceedings in Suit Nos 530 and 531 of 2007 to continue would risk inconsistent results with Suit No 553 of 2007 (mentioned above at [9]). 13  Furthermore, if I were not minded to stay the actions, SPH also applied to withdraw her initial application to be added as a defendant to the suits, which was granted by the AR. The reason for this was not far to find. The only reason why SPH applied to be added as a defendant in the first place was to strengthen the defendants’ case for a stay of proceedings since SPH was a party to the SPA while the defendants were not. However, if I was not minded to allow the stay, SPH’s continued participation in these proceedings would not only have served no purpose but might even have been detrimental to SPH’s interests.",
        "The plaintiff’s submissions": "14  In the circumstances, counsel for the plaintiff, Mr N Sreenivasan (“Mr Sreenivasan”) confirmed that the plaintiff had no objections to SPH’s application to withdraw as a defendant. 15  With regard to the defendants’ application for a stay of proceedings, Mr Sreenivasan refuted the defendants’ argument that there was a relationship between these proceedings and the SPA. He argued that the plaintiff was not seeking shares in Kingley nor disputing SPH’s title in Kingley shares. As the defendants were not parties to the SPA, the SPA was wholly irrelevant to the present proceedings. In this respect, Mr Sreenivasan relied on the decision of Lai Sui Chiu J inGo Go Delicacy Pte Ltd v Carona Holdings Pte Ltd[2008] 1 SLR 161(“Go Go Delicacy”), where it was held that a court cannot compel non-parties to an agreement (containing an arbitration clause) to arbitrate their dispute. 16  Furthermore, Mr Sreenivasan also submitted that under the SPA recital (D) of the preamble (“Recital (D)”), where the plaintiff gave up his right of action “against the Company and its subsidiaries, the directors and/or the shareholders of the Company and its subsidiaries”, did not cover Tan nor SPP. That was because Recital (D) only referred to the assignment of the plaintiff’s rights under a particular loan agreement, not a general assignment of all of the plaintiff’s rights against the class of persons mentioned above. In any case, SPP did not fall within the class of persons. 17  Finally, Mr Sreenivasan pointed out that under cl 17 of the SPA the plaintiff’s rights against third parties to the SPA, such as the defendants, were expressly reserved.",
        "The decision of this court": "18  After considering the submissions of all parties, I dismissed the appeal against the AR’s decision. I disallowed the application for a stay of proceedings in favour of arbitration but allowed SPH to be withdrawn as a defendant. I now set out the reasons for my decision.",
        "The privity rule": "19  It is well-established that, generally, non-parties to an arbitration agreement cannot participate in an arbitration conducted pursuant to the agreement. This principle is a natural offspring of the rule in contract that a third party cannot enforce rights arising under a contract to which he is not a party (“the privity rule”). In this respect, Associate Professor Lawrence Boo’s comments in his contribution to the Singapore Academy of Law Annual Review 2003 are apposite. In the chapter entitled “Arbitration” (2003) 4 SAL Ann Rev 48, the learned author wrote as follows (at p 53): 3.19   It is axiomatic that only parties to an arbitration agreement may participate in it. … [The author examines the case ofKiyue Co Ltd v Aquagen International Pte Ltd[2003] 3 SLR 130(“Kiyue”).] 3.23   … Third parties, who are strangers and uninvolved in the transaction, are certainly not parties to the arbitration. 20  In the case ofKiyue, PG Seraya Investment Pte Ltd (“PGSI”) was a major shareholder and Kiyue Co Ltd (“KCL”) a minor shareholder of Aquagen International Pte Ltd (“AIPL”). Separately, PGSI, AIPL and a third company were shareholders of Anchorville Pte Ltd (“Anchorville”), pursuant to a shareholders agreement (the “Anchorville Shareholders Agreement”). KCL, however, was not a shareholder of Anchorville. The Anchorville Shareholders Agreement included a clause for arbitration in the event of a dispute. As it turned out, PGSI claimed that the Anchorville Shareholders Agreement had been frustrated and that it was released from all its obligations thereunder. PGSI then commenced arbitration proceedings against AIPL. Even though independent legal advice obtained for AIPL was that AIPL should contest the claim in arbitration, PGSI, as majority shareholder of AIPL, ordered AIPL not to do so. 21  KCL, as minority shareholder of APIL, tried to intervene in the arbitration between PGSI and AIPL as it was of the view that it was unfair for PGSI to sue AIPL and then order AIPL not to contest the claim. However, KCL was not a party to the Anchorville Shareholder Agreement. As such, it applied under s 216A of the Companies Act (Cap 50, 2006 Rev Ed) for leave to intervene in the arbitration. Despite holding that “[i]t [was] manifestly wrong for a controlling shareholder to sue its subsidiary and then order it not to defend”, Choo Han Teck J felt compelled to disallow the application based upon a statutory interpretation of s 216A(2). Implicit in his judgment is the acceptance that KCL had no right to participate in the arbitration proceedings. 22  Similarly, inGo Go Delicacy([15]supra), Lai J disallowed an application for a stay of proceedings in favour of arbitration. In so doing, she held that: A court cannot compel non-parties to an agreement that contains an arbitration clause to arbitrate their dispute merely because one defendant is a party to that agreement. Although that decision was later reversed on appeal, the Court of Appeal approved of Lai J’s statement as quoted above: seeCarona Holdings Pte Ltd v Go Go Delicacy Pte Ltd[2008] 4 SLR 460at [7]. Hence, it remains an undisputed principle of law in Singapore that entities cannot be compelled to arbitrate pursuant to an arbitration agreement to which they were not parties. The corollary is also generally true. Third parties cannot compel arbitration by invoking an arbitration agreement to which they were not parties. 23  However, the privity rule, while strict, is not absolute. This is highlighted inHalsbury’s Laws of Singapore, vol 2 (LexisNexis, 2003 Reissue) (“Halsbury’s”), at [20.020], reproduced as follows: The parties to the arbitration agreements would normally be the signatories to those agreements. There are however, several situations where non-signatories may be considered a party to the arbitration agreement. Such situations may arise by way of incorporation of an arbitration agreement by reference; or an assumption of rights or liabilities to a contract with an arbitration clause (for example assignment, novation); or where the agreement was entered into by an agent; or the corporate veil-piercing on the basis of alter ego principle; or by the operation of the doctrine of estoppel. An exception to the principle of privity of contract has also been created to allow third party beneficiaries to pursue claims against a promissor in arbitration. 24  In the present case, the defendants did not, nor can they, deny that they were not parties to the SPA. The SPA expressly named four individuals, two of which were the plaintiff and SPH, as parties to the agreement. Neither Tan nor SPP was named as a party to the SPA. Hence, for the defendants’ application for a stay of proceedings to succeed, they would have to show that an exception to the privity rule was applicable such that the plaintiff should be made to arbitrate his disputes with them.",
        "Whether the claims alleged by the plaintiff against the defendants are so intertwined with the SPA that the doctrine of equitable estoppel is applicable": "25  The English case ofThe Smaro[1999] 1 Lloyd’s Rep 225 (“TheSmaro”) is often cited as authority for the operation of estoppel in an arbitration context. In that case, sellers of a vessel, known as the Smaro, sold the vessel to one Roussos “or company to be nominated” pursuant to a Memorandum of Agreement (“MOA”). The MOA contained an arbitration clause. In the event, the company that was nominated to take delivery and transfer of the Smaro was one Ocean Laser Shipping Ltd (“Ocean Laser”). Subsequently, it was discovered that, at the time of delivery, the Smaro was suffering from damage which led to engine breakdowns. Roussos alleged that the sellers had breached the MOA by selling the Smaro in that condition and attempted to start arbitration proceedings between the sellers and Ocean Laser. The sellers contended that they did not contract to arbitrate disputes with Ocean Laser. 26  Mr Justice Rix held, on an interpretation of the MOA, that Ocean Laser was a contracting party to the MOA. Therefore, Ocean Laser could be validly added as a party to the arbitration proceedings. Furthermore, the learned judge expressed the following sentiments (at 242–243): I would be loathe to think that where a claim by party A to a contract with party B has been submitted to arbitration under that contract’s arbitration clause, another claim based on identical facts brought by a third party to the same contract, party C, could not (without the agreement of B) be referred to the same arbitration but would have to be referred under an entirely new arbitral submission. No authority has been cited to me which compels me to determine that that would have to be done. I know of course that arbitration is a consensual process: but where the relevant parties are bound to arbitrate, I do not see why the respondent’s refusal to recognize party C’s submission of his claim to the same arbitrators can force parties A and C to arbitrate in separate arbitrations. It would mean that where an arbitration had been commenced in error by one only of two or more joint contractors, then the absent party could not (without the respondent’s agreement, which there would be no incentive to give) join the same arbitration, even though his absence might be crucial to the success of a joint contractors’ claim. It would mean that where it was uncertain which of two contracting parties held a claim, they could not (without the respondent’s agreement) claim as alternative claimants in the same arbitration once an arbitration had been commenced by one only of them. The vice of that (apart from waste of time and resources) is the danger of inconsistent decisions in separate arbitrations, for at the respondent’s option a different tribunal could be enforced in the second arbitration. I can see that the position is different where the claimants cannot agree between themselves on a single arbitrator or single arbitration; and I recognize that each arbitration agreement can spawn several arbitrations (see Mustill & Boyd at pp. 505–506). Such considerations do not, however, to my mind necessitate separate arbitrations in a case like the present. 27  Two important observations about Mr Justice Rix’s opinion that a third party may join a pre-existing arbitration must be immediately noted. First, the learned judge’s view was made in circumstances where the third party was also a party to the contractual agreement which was being arbitrated. His use of “third party” did not mean a non-party but, literally, a third party (ie, another party) to the multi-party contract. Second, the third party’s claim must be based on identical facts to the facts upon which the arbitration proceeding had commenced. Thus, the application of the doctrine of estoppel, as conceived inThe Smaro([25]supra), had a very limited scope. 28  Mr Wong also cited two American cases as authority for the expansion of the equitable estoppel doctrine. I was not convinced that those cases reflected the state of the law in Singapore. Besides, an examination of the cases revealed that, on the facts, those two cases were not applicable to the present cases in any event. InSunkist Soft Drinks, Inc. v Sunkist Growers, Inc.,10 F.3d 753 (11thCir. 1993) (“Sunkist”), Sunkist Growers was the exclusive owner and licensor of the “Sunkist” trademark. Sunkist Growers granted a licence to Sunkist Soft Drinks to market and sell “Sunkist” soft drinks. The licence agreement contained an arbitration clause. Subsequently, one Del Monte Corporation (“Del Monte”) bought over Sunkist Soft Drinks from Sunkist Soft Drinks’ parent company and absorbed Sunkist Soft Drinks under Del Monte’s beverage division. Later, Sunkist Growers asserted ten claims against Del Monte and Sunkist Soft Drinks variously in tort and in contract, arising out of Del Monte’s alleged interference with the Sunkist Growers–Sunkist Soft Drinks licence agreement. Del Monte filed a motion to compel arbitration on the grounds that Sunkist was contractually bound to arbitrate its claims under the terms of the licence agreement. 29  The United States Court of Appeal for the Eleventh Circuit decided, after reviewing several American cases, that Sunkist Growers was estopped from avoiding arbitration even though Del Monte was not a party to the licence agreement. The basis for its decision was as follows (at 757–758): … these decisions rest on the foundation that ultimately, each party must rely on the terms of the written agreement in asserting their claims. … Therefore, the focus of our inquiry should be on the nature of the underlying claims asserted by Sunkist [Growers] against Del Monte to determine whether those claims fall within the scope of the arbitration clause contained in the license [sic] agreement. … Essentially, Sunkist [Growers] contends that Del Monte, through its management and operation of [Sunkist Soft Drinks], caused [Sunkist Soft Drinks] to violate various terms and provisions of the license [sic] agreement. Each claim asserted by Sunkist [Growers] makes reference to the license [sic] agreement. Although Sunkist [Growers] does not rely exclusively on the license [sic] agreement to support its claims, each claim presumes the existence of such an agreement. We find that each counterclaim maintained by Sunkist [Growers] arises out of and relates directly to the license [sic] agreement. Thus, inSunkist, while the third party was not party to the contract unlike the situation inThe Smaro, there remained a very close connection between the third party (ie, the non-party, Del Monte) and the agreement (containing the arbitration clause) because the terms of the written agreement had to be relied on for claims against the third party to be made. As such, the court was able to surmise as follows (at 758): The nexus between Sunkist’s [Growers] claims and the license [sic] agreement, as well as the integral relationship between [Sunkist Soft Drinks] and Del Monte, leads us to the conclusion that the claims are “intimately founded in and intertwined with” the license [sic] agreement. Therefore, we hold that Sunkist [Growers] is equitably estopped from avoiding arbitration of its claims. 30  The fact that the underlying contract must be relied on was also decisive in the second American case ofChoctaw Generation Limited Partnership v American Home Assurance Company, 271 F 3d 403 (2ndCir. 2001) (“Choctaw”). InChoctaw, the defendant, American Home Assurance Co (“American Home”), issued an $81m surety bond to secure the performance of one Bechtel Power Co (“Bechtel”) under a construction contract (“the Construction Contract”) between Bechtel and the plaintiff, Choctaw Generation Ltd, under which Bechtel was building a power-generation facility for the plaintiff. The project was delayed. The plaintiff sought liquidated damages in an ongoing arbitration with Bechtel pursuant to the arbitration clause of the Construction Contract. To obtain payment of the liquidated damages pending the outcome of the arbitration, the plaintiff drew down in full a $33m letter of credit which American Home had procured pursuant to the surety bond. The plaintiff then demanded, pursuant to the construction contract, that American Home replenish the letter of credit until the full $81m was drawn down to fund the rapidly accruing liquidated damages. American Home disputed its contractual requirement to do so and argued that the dispute was subject to arbitration. 31  The United States Court of Appeal for the Second Circuit agreed with American Home. The court opined as follows (at 406): The controversy between [the plaintiff] and American Home under the Bond could hardly be more closely bound to the dispute now in arbitration between [the plaintiff] and Bechtel under the Construction Contract. The surety contract incorporates by reference the underlying Construction Contract. And the present dispute concerns the duty to replenish a letter of credit maintained under the Construction Contract, and requires a ruling as to whether that duty is independent of certain others in the context of the Construction Contract as a whole. And, it reiterated (at 407): American Home’s argument – and presumably Bechtel’s position in the arbitration – is that since [the plaintiff] and Bechtel have stipulated that there is a bona fide dispute as to whether the delay in provisional acceptance is being caused by force majeure, there is no duty to replenish the letter of credit. … In short, it is American Home’s (and presumably Bechtel’s) position that [the plaintiff]’s drawing down of the letter of credit was an act in breach of the Construction Contract. … In short, the controversy presented on this appeal is linked textually to the Construction Contract, and its merits are bound up with the dispute now being arbitrated between [the plaintiff] and Bechtel. 32  Hence, inChoctaw([30]supra), the decisive factor was that there was a very close connection between American Home and the Construction Contract (which contained the arbitration clause) as the Construction Contract was referenced in the surety agreement; whether there was a breach of the surety agreement depended entirely on an interpretation of the Construction Contract. Accordingly, the court held that the plaintiff was estopped from denying arbitration to American Home. 33  In my view, even if the American cases reflected Singapore law, the facts of the present cases are far removed from those inSunkistandChoctaw. In the present cases, the plaintiff claimed against Tan as trustee and SPP in restitution, alleging that Tan and SPP held the 50,000 and 490,000 Dehai Singapore shares the plaintiff had transferred to them, respectively, in August 2001, in trust for him. These claims have little to do with the SPA that the plaintiff later signed with SPH and two others for the sale of Kingley shares. The claims alleged by the plaintiff against the defendants bore no relationship, much less were they “so intertwined”, with the SPA. 34  Mr Wong tried to establish some connection by arguing that Recital (D) and cl 5.2(b)(v) of the SPA stated that the plaintiff gave up his right to sue the defendants. The two relevant clauses are reproduced, as follows: Recital (D): The Vendor has further agreed to assign all of its rights and obligations under the Loan (as defined below) to the Purchasers and/or their designated person(s). Upon the entering into of this Agreement, the Vendor agrees that he will have no further claims whatsoever against the Company and its subsidiaries, the directors and/or the shareholders of the Company and its subsidiaries. Clause 5.2(b)(v): 5.2  On Completion Date, the Vendor shall deliver to eachof the Purchaser: … (b) certified true copies of the resolutions passed by the board of directors of the Company: … (v) the duly signed letters of resignation (in agreed form) of the Vendor as director of each of the Company, its subsidiaries and associated companies (where applicable), with a statement confirming that he has, as of the Completion Date, no further claims whatsoever against the Company and its subsidiaries, the directors and/or shareholders of the Company and its subsidiaries. The “Loan” mentioned in Recital (D) was defined in the SPA as follows: “Loan”means the sum of S$2,678,376.67 due or owing to the Vendor by the Company as at the Completion Date, pursuant to a shareholders loan extended from the Vendor to the Company. Under cl 2.2 of the SPA, the rights of the vendor under this Loan were to be assigned to SPH and the two other purchasers. 35  To begin with, it may be stated that SPP did not fall within any of the class of persons mentioned in Recital (D). The plaintiff’s agreement not to claim against the classes of persons listed in Recital (D) was clearly in relation to the Loan only. It was evident to me that the second sentence of Recital (D) was apropos the first sentence, which recited the plaintiff’s agreement to assign his rights under the Loan to the purchasers. Hence, in the second sentence of Recital (D), the plaintiff was confirming (albeit anomalously in the recital) that he would have no further claimsunder the Loanagainst the Company and its subsidiaries, the directors and/or the shareholders of the Company and its subsidiaries. 36  I now go on to cl 5.2(b)(v). It must first be said that this provision should properly have appeared as cl 5.2(c) rather than as sub-item (v) under cl 5.2(b) which was intended to list out the matters in respect of which resolutions were to be passed by the board of directors of Kingley. 37  The provisions [which I shall continue to refer to as cl 5.2(b)(v)] are in the main unexceptional. They require the vendor to deliver to each of the purchasers duly signed letters under which he resigns from directorship of the company (ie, Kingley), its subsidiaries and associated companies and confirms that he has, as of the completion date, no further claims against “the Company and its subsidiaries, thedirectors and/or shareholders of the Company and its subsidiaries”. Except for the words in italics which were addedex abundanti cautela, such a clause is a “boilerplate” provision found in practically all sale and purchase agreements where a shareholder cum director sells his stake in the company. I do not think it is tenable for the defendants to contend that the italicised words were intended to waive the plaintiff’s rights against the defendants outside of the four corners of the SPA. 38  Firstly, SPP would not qualify under the italicised words as he was neither a shareholder nor a director of Kingley or any of its subsidiaries. Secondly, although Tan (as a shareholder and director of Kingley) was technically within the description, it cannot be explained why, if the intention was to release both Tan and SPP, Tan alone should have been released. Besides, if the intention was to release them, it is odd that they would not have been specifically named with sufficient particulars of the plaintiff’s rights alleged to have been waived. 39  In sum therefore, I was of the view that the plaintiff did not, whether under Recital (D) or cl 5.2(b)(v), give up his rights against the defendants arising from the Transfer. 40  Clause 17 of the SPA also supported my conclusion that the plaintiff did not give up his right to sue the defendants under the SPA. Clause 17 of the SPA provides as follows: CONTRACTS (RIGHTS OF THIRD PARTIES) ACT The Parties agree that any other person who is not a Party to this Agreement shall have no rights under the Contracts (Rights of Third Parties) Act, Chapter 53B of Singapore to enforce any term of this Agreement. 41  Mr Wong also argued that by claiming that the defendants held the Dehai Singapore shares in trust for him, the plaintiff was disputing Tan’s or SPH’s shares in Kingley, contrary to the terms of the SPA. With respect to SPH’s shares, this was totally untrue. The plaintiff was not disputing that SPP had sold the 490,000 Dehai Singapore shares (that SPP had received from the plaintiff in August 2001) to SPH which SPH, in turn, exchanged for Kingley shares. As against SPP, the plaintiff was simply claiming for damages in conversion. The plaintiff was not disputing SPH’s ownership of his Kingley shares. With regard to Tan, a distinction must be drawn between legal and beneficial ownership. It is true that the plaintiff was challenging Tan’s beneficial ownership of Tan’s 216 Kingley shares since it was the plaintiff’s claim that Tan held those shares in trust for him (given that they flowed from the 54,000 Dehai Singapore shares which the plaintiff claimed Tan held in trust for him). However, this did not mean that the plaintiff was disputing Tan’slegal ownershipof Kingley shares as set out in the SPA. In short, the plaintiff was not disputing Tan and SPH’s title to their Kingley shares as set out in the SPA. 42  As such, this case did not in any way resemble those ofThe Smaro,SunkistandChoctaw. Unlike the three aforementioned cases where the agreement containing to the arbitration clause was heavily relied on and was the basis for the plaintiffs’ and/or defendants’ claims, the SPA, in the present case, had no relation to the claim by the plaintiff. Nor did the SPA need to be pleaded for the defendants to mount their defence that the Dehai Singapore shares were transferred to them in consideration for their help in relation to the proposed listing of Dehai Singapore. As such, the present dispute was not one that was so closely intertwined with the SPA such that the plaintiff was estopped from denying the defendants arbitration.",
        "Whether the defendants were the intended beneficiaries of the SPA": "43  Mr Wong submitted that another way in which the defendants could rely on cl 16 of the SPA was if they were the intended beneficiaries of the SPA. The American case ofWesley Locke v Ozark City Board of Education, 910 So. 2d 1247; 2005 Ala. Lexis 55 (“Wesley Locke”) was cited as authority for this proposition. InWesley Locke, the plaintiff was an umpire at a baseball game for Carroll High School when he was attacked and injured. Carroll High School did not provide any police protection. The plaintiff sued the Ozark City Board of Education (“the Board”) for breach of a contract between the Board and the Alabama High School Athletic Association (“AHSAA”). The plaintiff alleged that Carroll High School, through the Board, was a member of the AHSAA and was, therefore, required to follow the rules and regulations of the AHSAA. The AHSAA Directory provides that all school principals have the duty to provide adequate police protection at athletic events. The plaintiff contended that he was an intended third party beneficiary of this contract. By not providing police protection at the baseball game, the Board had breached its contract with AHSAA and, as an intended beneficiary, the plaintiff claimed he was entitled to damages. 44  In deciding for the plaintiff, the Supreme Court of Alabama stated the conditions for a third party beneficiary to enforce a contract, citingFranklin Fire Ins Co v Howard, 230 Ala. 666, 667–68, 162 So. 683, 684 (1935) as follows: To recover under a third-party beneficiary theory, the complainant must show: 1) that the contracting parties intended, at the time the contract was created, to bestow a direct benefit upon a third party; 2) that the complainant was the intended beneficiary of the contract; and 3) that the contract was breached. Applying the law to the facts ofWesley Locke, the court noted that the contract between the Board and AHSAA specifically provided that principals were to “provide good game administration and supervision by providing … adequate police protection”. As the court held that game administration and supervision necessarily involved umpires, both the Board and AHSAA intended for the contract to benefit umpires like the plaintiff. As such, the plaintiff succeeded in his case. 45  Such a third party beneficiary exception to the privity rule has not yet been recognised in Singapore (outside of the Contracts (Rights of Third Parties) Act (Cap 53B, 2002 Rev Ed) which did not apply in the present case). Interestingly,Halsbury’s([23]supra) seems to have accepted such a proposition at [20.020]. However, the Malaysian case,Bauer (M) Sdn Bhd v Daewoo Corp[1999] 4 MLJ 545, which was cited as authority does not, in my view, stand for the proposition thatHalsbury’sattributes to it. 46  Even if I accepted thatWesley Lockewas applicable in Singapore, it was also clear to me, in any case, that parties to the SPA did not intend for the defendants to be beneficiaries of the SPA. The facts of the present case are far removed fromWesley Locke. From a plain reading of the SPA, it only concerned with three objectives: (a) The sale of the plaintiff’s 312 Kingley shares to SPH and two others (see cl 2.1 of the SPA); (b) The assignment of a loan, which was owed by Kingley to the plaintiff, to the buyers of the Kingley shares (see cl 2.2 of the SPA); and (c) The release of any claims the plaintiff might have against specified persons, as stated under cl 5.2(b)(v), within the four corners of the SPA. Accordingly, it was difficult to understand how the defendants could be the intended beneficiaries of the SPA, in their capacity as recipients of Dehai Singapore shares from the plaintiff. 47  Mr Wong argued that a purposive interpretation should be adopted in understanding the purpose of the SPA, taking into account the background circumstances. However, even so doing did not help the defendants’ case. The plaintiff’s affidavit at paras 5(10 ) and (11), filed on 19 November 2007, recorded his reason for selling his Kingley shares, reproduced as follows: 5. (10)    After Dehai Singapore was injected into Vita, Vita became listed in Singapore. Although the listing was a joyous event initially, the dream turned sour when I discovered that the share distribution was completely inequitable and one-sided in favour of the Sims and Tan.My investment was simply not commensurate with my shareholding, despite the promises that it would be the case. 5. (11)    As a result of the dispute, I decided that I wanted out of the company. [emphasis added] Later, at paras 10(1) and (2), the plaintiff elaborated: 10. (1)    The distribution of shares in Vita was convoluted andmany shareholders did not get the number of shares which were promised to them. As Tan was the person in charge of thedistribution of the shares, I was increasingly frustrated and upset and could no longer take his twisting and turning. 10. (2)    I requested Wong Kim Chow (“Wong”), a shareholder in Vita and a mutual friend, to arrange a meeting with Sim PP and Sim PH. On or about 23rdMarch 2006, I met Sim PP and Sim PH at Katong Hostel to negotiate the sale of my shares. [emphasis added] From the above, it appeared that the plaintiff was unhappy with the 312 Kingley shares which represented 31.2% of the Kingley shares issued he received from his investment of 426,000 Dehai Singapore shares. This was understandable as the 426,000 Dehai Singapore shares represented 43.9% of Dehai Singapore shares. On the other hand, Tan’s 5.6% shareholding in Dehai Singapore gave him 21.6% of Kingley shares. Thus, the plaintiff felt that Tan had taken advantage of the plaintiff’s illiteracy in the English language to obtain a favourable shareholding for himself in Kingley. 48  Hence, the objective of the SPA was to settle the unsatisfactory consideration the plaintiff received for his 426,000 Dehai Singapore shares. This, according to the plaintiff, was what he meant when he said, in his affidavit filed on 18 October 2007 in the matter of Suit No 553 of 2007, that “the Defendant offered the sum of S$7 million to me forallmy shares” (at para 6(11) and I thought that settlement by selling my shares would resolveallmatters” (at para 7). In my view, the plaintiff was clearly referring to the 426,000 Dehai Singapore shares he legally owned as of 31 March 2006 (when the SPA was signed) and not, as asserted by Mr Wong, the 540,000 Dehai Singapore shares which were held in trust for him by Tan and SPP (50,000 and 490,000, respectively). On that construction, the plaintiff did not intend to release the defendants from their liabilities as trustees of the 540,000 Dehai Singapore shares merely by signing the SPA. 49  Therefore, even if Singapore law recognised a third party beneficiary exception to the privity law (which contention I did not accept), the exception did not apply in the present case as the defendants were not released from their liabilities as trustees of 540,000 Dehai Singapore shares.",
        "Whether there was a collateral contract between the plaintiff and SPP": "50  It was also contended, on behalf of SPP (but not Tan), that a collateral contract existed between SPP and the plaintiff which settled all disputes in respect of the 490,000 Dehai Singapore shares that the plaintiff transferred to SPP in August 2001. 51  Traditionally, the existence of a collateral contract has been acknowledged as an exception to the privity rule although, strictly speaking, it is not an exception as such: the collateral contract argument rests on a finding by the court that the third party is not a third party but is a party to the collateral contract on which the claim is based. The nature and legal requirements of a collateral contract were laid down by Belinda Ang Saw Ean JC inLemon Grass Pte Ltd v Peranakan Place Complex Pte Ltd[2002] 4 SLR 439(“Lemon Grass”). I reproduce the relevant paragraphs, from [116] to [119], as follows: 116     A collateral contract is an agreement distinct from the main contract. A court must therefore find all the usual legal requirements of a contract having been fulfilled with respect to the collateral agreement before it can be enforced. 117     What this means is that the statement purporting to be the contractual promise in such a collateral contract must be promissory in nature or effect rather than representational:De Lassalle v Guildford[1901] 2 KB 215; [1900–3] All ER Rep 495;Wells (Merstham) v Buckland Sand and Silica Co[1965] 2 QB 170; [1964] 1 All ER 41;Esso Petroleum Co v Mardon[1976] QB 801 at 826. The plaintiffs must establish the agreement of the parties to its terms. Thus, to succeed in a claim founded on a collateral contract, the plaintiffs have to prove certainty of the terms. 118     It is for the party seeking to rely upon the collateral contract who has to bear the burden of establishing that both parties intended to create a legally binding contract: Ralph Gibson LJ inKleinwort Benson v Malaysia Mining Corp[1989] 1 All ER 785 at 796. 119     They must also establish consideration, which in the case of a collateral contract is easy to prove. All that is required is the promisee [the plaintiffs] entering or promising to enter into a principal contract with the promisor [the defendants]. 52  A case in which a collateral contract was successfully pleaded isShanklin Pier Ld v Detel Products Ld[1951] 2 KB 854 (“Shanklin Pier”). In that case, the defendant paint manufacturers warranted to the plaintiffs, the owners of a pier, that the paint they sold would last for seven years. In reliance upon that representation, the plaintiffs instructed the contractors whom they employed to use the defendants’ product to re-paint the pier, pursuant to which the contractors entered into a contract with the defendants. The paint lasted for only three months. The plaintiffs sued the defendants. The defendants argued that the warranty did not give the plaintiffs any cause of action. McNair J rejected the argument and held that there was a collateral contract between the plaintiffs and the defendants, a term of which was that the paint would last seven years. The consideration provided by the plaintiffs for the collateral contract was the instructions they gave to their contractors to buy paint from the defendants. 53  Although the court, inLemon Grass([51]supra), had held that a collateral contract had to fulfil all the usual legal requirements of a contract, it is clear that often courts have adopted a very flexible approach to the identification of such contractual requirements. It is in this respect that the collateral contract can be said to be an exception to the privity rule. The case ofNew Zealand Shipping Co Ltd v A M Satterthwaite & Co Ltd[1975] AC 154 (“The Eurymedon”) is one such example. 54  InThe Eurymedon, the plaintiff held a bill of lading, a clause of which provided wide exemption from liability for the carrier of the goods and any independent contractor involved in their carriage. The goods were damaged by the defendants who were the stevedores engaged as independent contractors by the carriers. The Privy Council held that the defendants could rely on the exemption clause even though they were not a party to the bill of lading. This was because the bill of lading created a collateral contract, initially unilateral but capable of becoming mutual, between the plaintiff and the defendants. The performance of stevedoring services by the defendants was acceptance of, and consideration for, the unilateral contract. 55  That this construction of a collateral contract was rather forced was pointed out by a dissenting judge inThe Eurymedon. Viscount Dilhorne stated as follows (at 170): … clause 1 of the bill of lading was obviously not drafted by a layman but by a highly qualified lawyer. It is a commercial document but the fact that it is of that description does not mean that to give it efficacy, one is at liberty to disregard its language and read into it that which it does not say and could have said or to construe the English words it contains as having a meaning which is not expressed and which is not implied. The clause does not in my opinion either expressly or impliedly contain an offer by the shipper to the carrier to enter into an agreement whereby if the appellant performed services in relation to the goods the shipper would give it the benefit of every exemption from and limitation of liability contained in the bill of lading. Be that as it may, it is now quite well-established, as demonstrated inShanklin Pier([52]supra), that collateral contracts may be used to circumvent the privity rule. 56  Mr Wong argued that applying the above cases to the instant case, the germane term of the collateral contract was that the SPA was to be executed in full and final settlement ofalldisputes between SPP and the plaintiff. I disagreed with that submission. Despite the amplitude of the collateral contract doctrine, no collateral contract between the plaintiff and SPP could be found in the present case. I found it difficult to establish that there was an intention to create legal relations, as required byLemon Grass([49]supra) and acknowledged inThe Eurymedon([51]supra). As mentioned earlier, it does not appear that the plaintiff had in mind the 490,000 shares that SPP held in trust for him when he entered into the SPA, much less the waiver of his rights in relation thereto. His only concern was to receive adequate consideration for the 426,000 Dehai Singapore shares registered in his name. 57  Furthermore, and this distinguishes this case fromShanklin PierandThe Eurymedon, no consideration can be attributed to SPP under any purported collateral contract. To my mind, the only conceivable consideration was the $7m that the plaintiff received pursuant to the SPA. However, this consideration moved from the purchasers of the plaintiff’s Kingley shares, not SPP. This was unlikeThe Eurymedonwhere the defendants actually performed services for the benefit of the plaintiff. InShanklin Pier, the plaintiffs provided consideration by instructing their contractors to buy paint from the defendants. Nothing of the sort could be found in the present case. The affidavit of SPH made it clear that she entered into the SPA of her own accord (and not on the instructions of SPP). SPH stated in para 18 of her affidavit, filed on 26 October 2007, as follows: The Plaintiff had discussed with me his problems, and therefore I was aware that he had a dispute with Tan Lim Hui over distribution of shares in the Initial Public Offering of Vita.I concludedthat buying over the Plaintiff’s shares in Kingley (through which his interest in Vita was held) was probably the best way to appease him, and put an end to all conflicts, including that between him and Tan. [emphasis added] Clearly, SPH did not act at the behest of SPP in agreeing to the SPA. As such, no consideration for the proposed collateral contract could be found.",
        "Risk of inconsistent results with arbitration": "58  Finally, Mr Wong argued that not allowing the application could result in inconsistent rulings. As mentioned at [9] above, the plaintiff had commenced Suit No 553 of 2007 against SPH for the return of Vita warrants which, according to him, were held in trust for him. This action was stayed in favour of arbitration as Lai Siu Chiu J determined that this dispute arose out of the SPA. On behalf of the defendants in the present case, it was submitted that the operative facts surrounding the plaintiff’s claims against SPH (which are the subject of arbitration) and the plaintiff’s claims against the defendants are the same: all touching upon the SPA. 59  Mr Wong cited the case ofWaste Management, Inc. v Residuos Industriales Multiquim, S.A. de C.V., 372 F.3d 339; (5thCir. 2004 (“Waste Management”), as authority. In that case, a former parent company, WM, sued the subsidiary, RIMSA, to collect moneys WM had paid on a letter of credit. RIMSA had entered into a leasing agreement with Bethlehem, an equipment leasing company, which required a guarantee. WM provided this guarantee and secured it with a letter of credit (“the Letter”). Subsequently, WM sold its RIMSA shares to Onyx pursuant to a Stock Purchase Agreement which contained an arbitration clause as well as a general release between WM and RIMSA. RIMSA defaulted on its payments to Bethlehem and the company then collected on the Letter. Onyx then initiated arbitration to settle WM’s claims against it. At the same time, WM also sued RIMSA. 60  The United States Court of Appeals for the Fifth Circuit allowed RIMSA’s application to stay the proceedings against it in favour of joining the arbitration already ongoing between WM and Onyx. The reasons for its decision were as follows: First, it is clear that the same major operative facts – the details of the Letter and its negotiation – largely control the resolution of both the equitable claims being litigated and the contractual claims being arbitrated. … Further, … when WM claims RIMSA was unjustly enriched when WM paid Bethlehem’s draw on the Letter, while also claiming that Onyx breached the [Stock Purchase Agreement] in not reimbursing WM, it is trying to recover thesamepayment, for which both RIMSA and Onyx have refused to pay and for which both are allegedly liable. Finally, there is a valid concern here about the integrity of the arbitration and the preservation of Onyx’s and WM’s rights to that contractual agreement. Allowing the instant litigation to proceed would risk inconsistent results, and “substantially impact” the arbitration. … Fundamentally, we have one dispute: Who, if anyone, should reimburse WM for the $795,000 it paid to Bethlehem (through the Letter) as a result of RIMSA’s default? 61  As with the third party beneficiary exception, I was not sure that the potential for inconsistent rulings is an accepted exception to the privity rule. Like the AR, my view was that the potential for inconsistent rulings could not outweigh the strict rule that arbitration may only proceed when both parties had consented to it. 62  In any case, even if the principles inWaste Managementwere applicable in Singapore, the critical factors inWaste Managementare not found in the instant case. The “major operative facts” are not common to both Suit Nos 553 of 2007 and to the present proceedings. In the former suit, the material facts revolved around the events of 4 October 2006 when an oral agreement between the plaintiff and SPH regarding the Vita warrants was alleged to have taken place. In the latter, the operative facts related to the plaintiff’s transfer of his Dehai Singapore shares to the defendants in August 2001. Second, the plaintiff does not seek double recovery as his claims were based on separate causes of action against different persons.",
        "Conclusion": "63  In summary, it was evident to me that there were no grounds to stay the present suits and that the general rule that arbitral proceedings had to be consensual ought to be followed here. 64  In the circumstances, I ordered that the appeals be dismissed with costs to be fixed at $5,500 excluding disbursements. However, the application for SPH to be withdrawn as a defendant was allowed."
    }
}