{
    "case_title": "Kor Beng Shien and Another (administrators of the estate of Ko Kim Hock, deceased) v Lee Poh Lee",
    "ncitation": "[2009] SGHC 267",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "3       Between October 1996 to 23 August 2005, the deceased, a licensed crane operator, ran Transcrane, which is in the crane services business, as a sole proprietorship. 4       According to Kor, who is the deceased’s brother, the deceased borrowed $10,000 from Ngai, who is the deceased’s nephew, to set up Transcrane. Kor said that he accompanied the deceased to open Transcrane’s first bank account with OCBC Bank. He added that the deceased bought Transcrane’s first crane with a loan given by OCBC Bank and Focal Finance. The first instalment was paid with a cheque from this OCBC account. 5       Kor testified that he helped to bank in cheques for Transcrane on a daily basis from October 1996 until 1 September 1998 as the deceased was rather busy operating his crane for his customers. He said that he stopped banking in cheques for Transcrane after he became a remisier on 1 September 1998. 6       In August 1999, another crane was purchased under hire purchase arrangements, with financing provided by DBS Finance. 7       In 2000, the deceased was hospitalised because of liver problems. Subsequently, it was determined that he had liver cancer. 8       In 2004, the deceased arranged with DBS Bank for Lee to become a co-signatory of Transcrane’s DBS Bank account and for the bank statements to be sent to Lee’s home address. Lee claimed that these arrangements indicated that he had an interest in the business. 9       In August 2005, the deceased vomited blood and had to be rushed to hospital. Lee was aware of this. 10     On 23 August 2005, the deceased died at 12.38 pm. Three hours later, at 3.38 pm, Transcrane’s book-keeper, Mr Sum Fook Hong (“Sum”), arranged for the sole proprietorship to be “converted” to a partnership between the deceased and Lee. An on-line declaration was made in the records of the Accounting and Corporate Regulatory Authority (“ACRA”) with respect to the “partnership”. 11     Lee attended the funeral of the deceased and gave his family a Transcrane cheque for $1,500, which he claimed was for the deceased’s wages. This cheque was not banked in by the deceased’s family. 12     Since 23 August 2005, Lee has been running Transcrane as a “partnership” with the deceased. 13     The plaintiffs asserted that Lee and Sum knew that the deceased had already passed away when they converted Transcrane from a sole proprietorship to a “partnership” on 23 August 2005 and they alleged that the conversion was done to wrongfully deprive the deceased’s estate of Transcrane. However, Lee and Sum claimed that they did not know that the deceased had passed away when ACRA’s records were amended to reflect a “partnership” between the deceased and Lee. 14     As the parties could not resolve their dispute regarding the ownership of Transcrane, the plaintiffs instituted the present proceedings.",
        "Whether Lee is the Sole Beneficial Owner of Transcrane": "15     As the deceased was the sole proprietor of Transcrane when he passed away on 23 August 2005, Transcrane is, without more, part of the deceased’s estate and Lee’s attempt to create a partnership with the deceased after the latter’s death cannot be countenanced. 16     Although Lee had tried to become the deceased’s partner on 23 August 2005, he did not assert in his defence that the deceased was his partner or that he had a share in Transcrane. Instead, he pleaded that he is thesolebeneficial owner of Transcrane. When Lee was represented by his former counsel, he pleaded that the deceased held Transcrane on his behalf under an express trust. However, during the trial, his present counsel, Ms Joyce Fernando, sought and was given leave to amend Lee’s defence to introduce a resulting trust as an alternative to the express trust. In view of this, the question before the court is whether Lee has proven that he is the sole beneficial owner of Transcrane by virtue of an express or a resulting trust and not whether there was a partnership or some other business arrangement between Lee and the deceased.",
        "Whether there was an express trust": "17     In regard to the alleged express trust, Lee stated in his AEIC filed on 5 January 2009 at [12] as follows: The verbal understanding between us was that he will help to front the business and work as one of my crane operators whilst I will handle all the start up costs, financials and the business of Transcrane. There was never any agreement between us to share the profits because he will be paid a salary which was loosely fixed at $1,000.00. 18     Lee conceded that only he and the deceased knew about the trust arrangements and he furnished no evidence to corroborate his assertion that an express trust had been created. There is no reason why Transcrane should be handed over to him on a platter solely on the strength of his uncorroborated assertion that he had an oral agreement with the deceased that the company was to be held on trust for him.",
        "Whether there was a resulting trust": "19     Lee’s assertion that there was a resulting trust in his favour also did not rest on solid ground. As for when such a trust arises, inWestdeutsche Landesbank Girozentrale v Islington LBC[1996] AC 669, Lord Browne-Wilkinson explained at p 708 as follows: Under existing law, a resulting trust arises in two sets of circumstances: (A) where A makes a voluntary payment to B or pays (wholly or in part) for the purchase of property which is vested either in B alone or in the joint names of A and B, there is a presumption that A did not intend to make a gift to B: the money or property is held on trust for A (if he is the sole provider of the money) or in the case of a joint purchase by A and B in shares proportionate to their contributions. It is important to stress that this is only apresumption, which presumption is easily rebutted either by the counter-presumption of advancement or by direct evidence of A’s intention to make an outright transfer…. (B) Where A transfers property to B onexpress trusts, but the trusts declared do not exhaust the whole beneficial interest …. Both types of resulting trusts are traditionally regarded as examples of trusts giving effect to the common intention of the parties. A resulting trust is not imposed by law against the intentions of the trustee (as is a constructive trust) but gives effect to his presumed intention.[emphasis in original] 20     Lord Browne-Wilkinson’s view was endorsed by the Court of Appeal inLau Siew Kim v Yeo Guan Chye Terence[2008] 2 SLR 108. 21     Lee claimed that there was a resulting trust in his favour because he had financed the setting up and operation of Transcrane. In his AEIC filed on 5 January 2009, he stated at [24] as follows: Transcrane’s assets, namely the cranes used in its operations, were being purchased using my funds. In the beginning, I provided for all the outgoings such as workers’ salary, petrol/diesel for the cranes, parking fees, road tax, licence for the cranes and other incidentals for maintaining and operating the cranes. 22     Lee claimed that all his contributions to Transcrane were in the form of cash and that he had no receipts for his payments. Apart from failing to provide adequate evidence to prove that he had providedallthe money required for the setting up and running of the business, Lee conceded that he did not put any money into Transcrane’s first bank account, which was opened at OCBC bank when the business was started. Furthermore, he accepted that the deceased had borrowed $10,000 to put into this account. The relevant part of the cross-examination is as follows: QAm I right to say that you did not come up with a single cent to open a bank account in OCBC under the name of Transcrane Services .. in October 1996?AThat’s correct.Q[So your assertion] that all the funds in establishing Transcrane came from you should be wrong, given the fact that you have not come up with a single cent. Yes or no?AThat’s not right. I only paid the first instalment and I paid so much for the first instalment andso [the deceased] felt bad about it, so he went to borrow 10,000 [to put into the OCBC account].[emphasis added] 23     Apart from there being no proof that Lee had paid the first instalment for the crane purchased by Transcrane, his explanation that his financial contribution to the company made the deceased feel “bad” and led the latter to contribute $10,000 to open Transcrane’s OCBC account made no sense whatsoever. 24     It is noteworthy that there is evidence that the deceased dealt with the accounts of Transcrane as if he was the sole proprietor. From 1996 to 1999, the deceased kept all the monthly statements from OCBC bank and he made many withdrawals from the bank account of Transcrane for his own purposes. In fact, he even used money earned by the company for the payment of shares purchased on his behalf by his nephew Kor. In contrast, Lee could not show that he dealt with the accounts of Transcrane during this period. Had Lee really been the sole beneficiary of the business of Transcrane from the very start, it would have been prudent for him to have been a signatory of the company’s cheques during this period. 25     The evidence of Sum, the person who prepared the accounts of Transcrane, should also be considered. Sum made it clear when he was cross-examined that he did not know anything about Lee’s alleged financial contributions towards the setting up of Transcrane or that the business of Transcrane was held on trust by the deceased for Lee. He added that he prepared Tanscrane’s accounts on the basis of a sole proprietorship. In short, Sum gave no support to Lee’s claim that he is the sole beneficial owner of Transcrane by virtue of a resulting trust. 26     Lee’s actions after learning in 2003 that the deceased was terminally ill did not suggest that he was thesolebenefi     cial owner of Transcrane. In his AEIC filed on 5 January 2009, Lee stated at [27] – [28] and at [31] as follows: 27As a matter of fact, when the deceased fell ill in or around 2003, he had intimated to me that it may be time to take over Transcrane as the sole proprietor because he told me that he had terminal liver cancer and he had not much time left. I was very saddened when I heard this because we are good friends after all.28He however had told me that I should change the business registration and add my name and be registered as a partner of Transcrane….31The truth is that the deceased fulfilled his role as a trustee when he knew that he could no longer function as such and sought to transfer the business back to me. The deceased knew that he had not much time left to handle his affairs and had sought me to do asmooth return of the business. Furthermore, it is clear thatby then the extenuating circumstances which prevented me from having my name in the business no longer exist so I could go ahead to register it.[emphasis added] 27     If, as Lee alleged, the deceased wanted to effect a “smooth return” of the business to him, Transcrane should have been transferred to him in 2003 and the company’s records should have been amended to show that he is the sole proprietor of Transcrane. Lee could not provide a satisfactory explanation as to why he did not protect his interest by having the business transferred to him after he learnt that the deceased was terminally ill in 2003. He clutched at straws when he said that he thought that the deceased might recover after a liver transplant. 28     In any case, if Lee is the sole beneficial owner of the business, a question arises as to why he arranged for the business to be converted to a partnership on 23 August 2005 and why he continues to operate Transcrane as a “partnership” with a dead man. Moreover, he files his income tax returns on the basis that he is only entitled to 50% of the profits of Transcrane. Lee blamed Sum for advising him that he had no choice but to continue with the “partnership”. However, Sum sang a different tune as he testified that he was merely following Lee’s instructions. 29     In truth, the nature of the business relationship, if any, between the deceased and Lee in relation to Transcrane cannot be determined because of lack of evidence. What needs to be reiterated at this juncture is that a party is bound by his or her pleadings. Lee’s only defence to the plaintiffs’ claim is that he is the sole beneficial owner of Transcrane on the basis of either an express or resulting trust. After considering all the evidence and after having assessed the witnesses, I hold that it was not proven that Lee is the sole beneficial owner of Transcrane by virtue of either an express trust or a resulting trust. 30     It follows that Lee must account to the plaintiffs for Transcrane’s profits as from 23 August 2005. The amount due to the plaintiffs will be assessed by the Registrar. The plaintiffs are also entitled to possession of the heavy vehicles claimed by them and to damages if the said vehicles are not delivered. 31     The plaintiffs are also entitled to costs.",
        "Lee’s Counterclaim": "32     As I have found that Lee has failed to prove that the deceased held Transcrane on trust for him, his counterclaim for the $63,656.21 which was allegedly withdrawn from Transcrane’s bank account by the plaintiffs need not be considered as he has no right to the money in the said account. 33     As for Lee’s claim that he lent $14,985.33 to the deceased, there was insufficient proof of such a loan. In fact, the cheque for this amount was issued from Transcrane’s bank account and not from Lee’s own bank account. 34     For the reasons stated, Lee’s counterclaim is dismissed with costs."
    }
}