{
    "case_title": "XZ v YA",
    "ncitation": "[2009] SGHC 51",
    "coram": "Chao Hick Tin JA",
    "sections": {
        "Introduction": "1This was an appeal by the appellant against the decision of the district judge (“the DJ”) in: (a)    dismissing Maintenance Summons No 7419 of 2006 (“MSS 7419/2006”), which was the appellant’s application for a downward variation of Maintenance Order No 1168 of 2005 (“MO 1168/2005”); and (b)    allowing Maintenance Summons No 5550 of 2007 (“MSS 5550/2007”), which was the respondent’s application for enforcement of maintenance arrears which stood at $20,208.10 as at 11 April 2008. After hearing arguments of counsel for both parties, I allowed the appeal in part to the effect that I reduced the monthly maintenance payable by the appellant to the respondent under MO 1168/2005 by $1,000. I now give my reasons.",
        "Background": "2I shall first set out the salient facts of the case. The appellant and the respondent were an estranged couple when the appeal came for hearing before me. I was informed by counsel that the parties were then in the midst of seeking a divorce. At the time of the hearing before the DJ, the appellant was a 38-year-old pilot whilst the respondent was a 39-year-old customer service engineer. The couple married in 1995 and have two sons, aged nine and five at the time of the hearing. 3Sometime in 2005 the relationship between the parties became strained because the respondent believed that the appellant was having an affair with a cabin crew. In order to avoid any conflict, the appellant moved out of the matrimonial home in September that year to live with his mother for a period of time before he moved back to the matrimonial home. In October 2005, the respondent applied for maintenance for herself and her two sons by way of Maintenance Summons No 5941 of 2005. On 8 November 2005, the appellant, who was not legally represented, entered into a consent maintenance order, MO 1168/2005 (“the Consent Order”), which provided that the appellant was to pay maintenance of $4,500 monthly with effect from 1 October 2005 with yearly increments of $300 capping at $6,000 in the year 2010. The Consent Order providing for the maintenance payable by the appellant to the respondent for approximately the next five-year period was as follows: 1       [The appellant] shall pay [the respondent] monthly maintenance of $4,500.00, for the maintenance of [the respondent] and 2 children with effect from 01 October 2005 till 01 December 2005. 2       Thereafter, [the appellant] shall pay as follows: I.       $4,800.00 shall be paid per month for a period of 12 months with effect from 01 January 2006. II.      $5,100.00 shall be paid per month for a period of 12 months with effect from 01 January 2007. III.    $5,400.00 shall be paid per month for a period of 12 months with effect from 01 January 2008. IV.    $5,700.00 shall be paid per month for a period of 12 months with effect from 01 January 2009. 3       $6,000.00 shall be paid per month with effect from 01 January 2010. The Consent Order did not spell out the component amounts which constituted the various monthly sums payable to the respondent for the respective specified periods. It was thus not possible to determine how each sum was derived since the figures were a result of compromise between the parties. 4On 29 December 2006, the appellant filed MSS 7419/2006 seeking a downward variation of the maintenance payable by him to the respondent from $5,100 to $3,300. Subsequently, the respondent filed Maintenance Summons No 5549 of 2007 (“MSS 5549/2007”) and MSS 5550/2007 seeking an upward variation and enforcement of arrears respectively. The DJ heard all three applications. He allowed MSS 5550/2007 and ordered the husband to pay the outstanding arrears in monthly instalments of $1,500. He dismissed both MSS 7419/2006 and MSS 5549/2007 but gave liberty to the appellant to apply for a downward variation in the event that the total sums paid to him by his employer (inclusive of his salary, allowances and bonuses) for a preceding year were substantially reduced (by at least $500) or if the respondent’s take-home salary of $1,831 should increase substantially (by at least $400). To facilitate such an application, the DJ also ordered both parties to send to each other their annual Inland Revenue Authority’s notice of assessment within 14 days of receiving the same (see [2] of the DJ’s grounds of decision inXZ v YA[2008] SGDC 244(“the GD”)).",
        "Issues": "5       The appellant was dissatisfied with the outcome of MSS 7419/2006 and MSS 5550/2007 and brought the present appeal. Whilst counsel for the appellant raised a whole host of issues during the hearing, the thrust was really to ask for the monthly maintenance sum to be reduced. In substance, the two key issues before the court were the following: (a)    Did the appellant agree to the terms of the Consent Order because he had been induced to do so by the respondent’s misrepresentation that she had quit or would be quitting her job? (b)    Was the Consent Order unworkable because of the DJ’s failure to take into account the appellant’s true disposable income and the respondent’s unreasonable expenses? 6       The provisions governing maintenance by a husband for his wife and children are set out in ss 72 and 69(4) of the Women’s Charter (Cap 353, 1997 Rev Ed). The DJ addressed this at [3]–[4] of the GD. The parties were not in dispute as to the law. It was also not in issue that even a consent order could be varied if there was a material change in circumstances or other good cause. I shall now proceed to deal with each of the issues set out at [5] aboveseriatim.",
        "Whether there was misrepresentation leading to the entering of the Consent Order": "7       The first issue involved an allegation by the appellant that he had been induced to enter into the Consent Order by the respondent’s misrepresentation in or around September 2005 that she had quit or would be quitting her job and would be staying at home to look after the children full-time. He contended that, if not for such a misrepresentation by the respondent, he would not have agreed to such a large part of his total income being paid over to the respondent for her and the children’s maintenance. 8       The DJ examined the appellant’s affidavits and found that he had given a “heavily” inconsistent account as regards the wife’s continued employment (see [11] of the GD). The appellant initially claimed that the respondent had quit her job in September 2005 and that he had agreed to the Consent Order based on the fact that the wife was unemployed and was a full-time mother looking after the two children. In his later affidavit, he shifted his position and deposed that the respondent had said that shewouldquit her job to look after the children full-time. The respondent’s version, on the other hand, was simply a flat denial that any such misrepresentation had taken place and she asserted that the appellant knew all along that she was employed. Admittedly, this was a discrepancy, but I would not have thought that it was such a grave one. After all, the senses of both claims were quite close and whether one described it in one way or the other would depend on the time frame that was being referred to. It would not be unusual for one to indicate that he or she intended to quit employment before the actual quitting took place. The DJ had referred to other discrepancies in the evidence of the appellant which also undermined his credibility but which I need not go into. All these discrepancies, while germane, paled in comparison to the very significant events which are alluded to at [11]–[13] below and which, in my judgment, fatally undermined the respondent’s testimony. 9       After assessing the affidavits as well as the testimony from both parties on the stand, the DJ accepted the respondent’s testimony. The DJ said at [17] of the GD: The court was convinced that the husband’s account of the events concerning the wife’s employment could not withstand close scrutiny. His accounts differed materially and it was difficult to accept that he had been deceived by the wife into believing that she had resigned from her job with “G” company in order to get him to agree to the sums stated in the [Consent Order]. The wife’s account on the other hand was more reasonable and likely. She had never left the employ of the company and it was only in January 2006 for domestic reasons that she changed to working part-time with the same employer. 10     I was conscious that, ordinarily, on a question relating to a finding of fact, an appellate court should be slow to disturb such a finding. The rationale for this has been eloquently explained by Lord Shaw of Dunfermline inClarke v Edinburgh and District Tramways Company, Limited1919 SC (HL) 35 at 36-37, a passage which has been endorsed in numerous subsequent cases, including those of the Singapore courts: When a Judge hears and sees witnesses and makes a conclusion or inference with regard to what is the weight on balance of their evidence, that judgment is entitled to great respect,and that quite irrespective of whether the Judge makes any observation with regard to credibility or not. I can of course quite understand a Court of appeal that says that it will not interfere in a case in which the Judge has announced as part of his judgment that he believes one set of witnesses, having seen them and heard them, and does not believe another. But that is not the ordinary case of a cause in a Court of justice. In Courts of justice in the ordinary case things are much more evenly divided; witnesses without any conscious bias towards a conclusion may have in their demeanour, in their manner, in their hesitation, in the nuance of their expressions, in even the turns of the eyelid, left an impression upon the man who saw and heard themwhich can never be reproduced in the printed page. What in such circumstances, thus psychologically put, is the duty of an appellate Court? In my opinion, the duty of an appellate Court in those circumstances is for each Judge of it to put to himself, as I now do in this case, the question, Am I – who sit here without those advantages, sometimes broad and sometimes subtle, which are the privilege of the Judge who heard and tried the case – in a position, not having those privileges, to come to a clear conclusion that the Judge who had them was plainly wrong?If I cannot be satisfied in my own mind that the Judge with those privileges was plainly wrong, then it appears to me to be my duty to defer to his judgment.[emphasis added] 11     However, during the hearing before me, counsel for the appellant submitted that the DJ, in coming to the conclusion that the evidence of the respondent was more reliable, had erred in not considering the fact that when the respondent filed the complaint for maintenance in October 2005 by way of MSS 5941/2005, she had indicated that she was “unemployed” in her sworn application before District Judge Tan Peck Cheng.[note: 1]I queried counsel for the appellant whether what was stated in the complaint was brought to the attention of the DJ to which her reply was in the negative. 12     I was of the view that the complaint was a crucial piece of evidence which went to the heart of the factual dispute between the parties and gave a wholly different complexion to the issue. The complaint was made by the respondent before the court on 18 October 2005. I had no doubt that, had the attention of the DJ been drawn to this document, he would have serious misgivings about the respondent’s version that she did not tell the appellant, at the material time, that she was unemployed or was about to quit her job. Although the DJ had gone into great lengths to explain why the version given by the respondent was more believable, this document undermined all that. It was true that the appellant did not see the complaint or the specific entry stated therein and therefore was not affected thereby. Indeed, the appellant did not say that he had read the complaint either. But this was not material. The question to ask is: Why did the respondent state in the complaint that she was unemployed when at all material times she was employed by the same employer? In fact, she never left the employment of her employer except when, for domestic reasons, she opted from January 2006 to work part-time with the same employer (see [9] above where this finding of the DJ was quoted). Why did she state an obvious untruth? The irresistible inference was that the respondent, having earlier informed the appellant that she had either quit her job or was about to quit her job in order to take care of the kids, and in order to obtain a larger amount for maintenance, had to maintain that façade. So she had to state in the complaint that she was unemployed. In my opinion, the document clearly supported the appellant’s version that, at the time the Consent Order was entered into, he had been labouring under the impression, brought about by what the respondent had told him, that she had stopped working or was about to stop working. The respondent knew fully well that the complaint would have been available to the appellant and therefore felt the need to indicate in the complaint that she was “unemployed” so as to corroborate the story that she had given to the appellant. It does not lie in the respondent’s mouth to claim that she did not take the complaint seriously because the complaint stated expressly that the complainant was examined on oath and that the information she had given for the application was true and correct.[note: 2] 13     There was another set of events which was wholly consistent with the appellant’s version. At [15] of the GD, the DJ stated that the respondent “had taken no pay leave on some days from October 2005 to December 2005 in order to prepare their elder son for Primary One”. In fact, in the month of November 2005 alone, the respondent took some 15 days of “no pay” leave, out of which only two days were for attending court. Why was there a need to take “no pay” leave as early as November 2005 (or in the words of the DJ, “from October 2005”) to prepare the child for primary school? I could understand it if that was done in December 2005 and even then it need not be for more than a couple of days. This set of events, viewed against the backdrop of what the respondent had told the appellant, was again deliberately created to make it appear that the respondent had indeed left her employment. 14     Finally, I should mention that the DJ, at [17] of the GD, also referred to and relied on the appellant’s own admission that he had noticed the respondent leaving the house wearing office attire in the mornings and returning late in the afternoon or evenings from Monday to Friday. However, what was critical was not the time frameafterthe Consent Order was entered into, but the time framepriorto that when the representations made by the respondent that she was unemployed or about to quit employment would surely have affected the appellant in agreeing to the terms of the Consent Order. 15     In the result, I had to respectfully differ from the DJ (though I have to reiterate that his attention was unfortunately not drawn to what was stated in the complaint) and hold that the respondent did make the representation to the appellant that she had left or was about to leave her employment and would become a full-time mother to the two children and that this representation affected the appellant’s calculation as to the amount he was prepared to give as maintenance for the respondent and the two children. This misrepresentation was a material circumstance warranting a downward revision of the maintenance amount payable under the Consent Order.",
        "Whether the Consent Order was workable": "16     The next issue pertained to the “unworkability” of the amounts set out in the Consent Order because the DJ had failed to take into account the appellant’s true disposable income and the respondent’s unreasonably inflated expenses. The appellant claimed that, in order to pay the maintenance sums under the Consent Order, he had to borrow money and dispose of some of his assets. 17     Counsel for the respondent emphasised to the court that the Consent Order was entered into after an hour’s negotiation between the respondent’s counsel and the appellant outside the court and there was nothing to indicate that the appellant was incapable of calculating his sums. Counsel further pointed out that the appellant was a fastidious man since, for the purposes of MSS 7419/2006, the appellant was able, though then not represented, to prepare a very detailed list of expenses in his affidavit sworn on 28 March 2007. 18     Counsel for the appellant pointed out to the court that the appellant was unrepresented at the time the Consent Order was entered into and that he had deposed in an affidavit sworn on 24 January 2008 that, at the time the Consent Order was entered into, what he was most concerned about was the custody, care and control of his children. The appellant stated that, at that time, he had not done a proper assessment of his earnings and expenses. One particular expense which was substantial, and which the appellant said he had not taken into account, was his overseas allowance of about $3,300 which, according to him, was fully consumed by him overseas. 19     In this connection, I saw no reason to depart from the position taken by the DJ after he had carefully considered the true state of expenses of both parties. In the course of argument, I had pointed out to counsel for the appellant that an educated person like the appellant did not require legal representation in order to be able to calculate his earnings and expenses properly. That leaves me to add only two other points. 20     The first relates to the list of expenses put up by the appellant exhibited in his affidavit sworn on 28 March 2007, where the appellant listed his expenses for meals as follows: Meals (local and overseas): $350 I recognised that this was an extremely low figure and could well be erroneous. It might be possible to budget $350 a month purely for meals taken locally but that might be difficult to accomplish when factoring in meals taken overseas. I was, however, not minded to give the benefit of the doubt to the appellant since it was a figure provided by the appellant himself. In any event, on a larger view of things, this figure had little overall impact because, in a later list of expenses put up by the appellant in an affidavit sworn on 24 January 2008, the appellant appeared to have corrected himself and listed his expenses for meals as follows: Food (local): $400 I noted that the DJ considered, based on all the evidence before him (see [18] of the GD), that the appellant’s income was sufficient to pay the sums ordered in the Consent Order. Bearing in mind the sum I intended to reduce from the sums set out in the Consent Order on the ground of the respondent’s misrepresentation (see [23] below), I was not minded to make any further reduction of the maintenance sum payable in each of the respective periods in question based on the ground that the appellant had made a mistake in calculation when he agreed to the terms of the Consent Order. 21     The second point relates to the appellant’s contention that the court ought to take into account the fact that he had to spend $1,075.30 monthly on the children, which included sums for their insurance, outdoor expenses, clothing and personal care, special occasions, toys, books, stationery, kinder gym and childcare expenses (see [7] and [9] of the GD). The DJ observed (at [9] of the GD): Again under cross-examination, the husband conceded that there was no court order to oblige him to pay the various expenses amounting to $1,075.30 that he claimed he still spent on the children but he insisted that he had to spend a sum of $617 on them during access periods. This voluntary expenditure whilst entirely laudable was something that the court felt had to be disregarded. The children were in the care and control of the wife and she was obliged to maintain them from the monies ordered in the Consent Order. The husband could not advance a case that his obligations in the [Consent Order] should be reduced because he would be incurringvoluntaryexpenses on the children. There was neither any obligation on him to incur these voluntary sums nor any assurance that he would always continue to do so. [emphasis in original] 22     It seemed to me that the DJ might not have fully appreciated what the real point which the appellant sought to make was when he said that he had to spend $1,075, or at least $617, per month on the two children during his weekend access to them. Of course there was no court order compelling him to pay for the expenses of the children. The appellant was just reminding the respondent, and in turn the court, that such expenses should not be disregarded when determining the appropriate sum he could afford as maintenance for the upkeep of the respondent and his children. Putting it specifically, he was saying he had to feed and support the two children for at least eight days in a month and such expenses must be given due recognition in the overall calculation. His contention was that, in determining the appropriate maintenance to be paid to the respondent, what must not be forgotten was that he needed to spend on the children too, including feeding them, during the periods of access, in the same sense that the respondent needed to spend on herself and the children during the period when they were under her care and control. It would not be correct to refer to such expenses which needed to be spent by the appellant on the children as “voluntary”. The question of the appropriate quantum to be allowed for this would be a separate issue and where the quantum was in dispute, it would have to be scrutinised and determined. However, even if one could dispute that the appellant needed to spend $617 on four weekends with the children, one could not dispute that spending a few hundred dollars would be inevitable.",
        "Quantum of reduction": "23     The $1,000 reduction I made on the maintenance payable to the respondent for herself and the children was on account of the misrepresentation she had made to the appellant prior to the entering of the Consent Order (see [11]–[15] above). The respondent converted her full-time employment to part-time employment with her employer with effect from January 2006, drawing a take-home salary of $1,831. The question which I had to decide was: What would be a reasonable reduction of the maintenance payable by the appellant on account of the respondent having this net income of $1,831 which the appellant was not aware of? This exercise was really one of judgment and not of science. What was clear to me was that it would not be fair to reduce the monthly maintenance by this entire amount. The sums set out in the consent order were compromised amounts, not the amounts which the respondent was asking for. Moreover, there would be no incentive for the respondent to continue to work even part-time. Both parties should benefit from this income. Viewing the situation in its totality and also bearing in mind the fact that the appellant needed to spend on the children during access periods, I decided to give the appellant a little more of the benefit of the respondent’s income, instead of equally. Thus, I apportioned the sum of $1,831 into $1,000 and $831 respectively, in the appellant’s favour. The net result was that the monthly maintenance would be reduced by $1,000 per month.",
        "Conclusion": "24     Accordingly, I ordered that all the sums in the Consent Order (see [3] above) were to be reduced by $1,000 and that this order was to be backdated to take effect from 1 January 2007 since MSS 7419/2006 was filed on 29 December 2006. All other orders of the DJ were undisturbed. I also ordered the respondent to pay costs fixed at $4,000 with the usual consequential orders. _________________ [note: 1]See the complaint documented in the record of appeal at p 9. [note: 2]See record of appeal at p 12"
    }
}