{
    "case_title": "Swiss Singapore Overseas Enterprises Pte Ltd v Exim Rajathi India Pvt Ltd",
    "ncitation": "[2009] SGHC 231",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       The plaintiff filed this originating summons in December 2008 and prayed for,inter alia, the following orders: (a)     that it be declared that the Award dated 12 September 2008 (the “Award”) issued by Mr Vangat Ramayah (the “Arbitrator”) in SIAC Arbitration No. 002/2007 was procured by fraud and/or procured in a manner contrary to the public policy of the Republic of Singapore; and (b)     that the court set aside the Award pursuant to section 24(a) of the International Arbitration Act (Cap 143A 2002 Rev Ed) (the “Act”) and article 34(2)(b)(ii) of the United Nations Commission on International Trade Law Model Law on International Commercial Arbitration (the “Model Law”). 2       The grounds of the application are that the defendant had falsified testimony at the arbitration relating to the amount of cargo it had sold to a third party in mitigation of damages and had suppressed documents in order to perpetuate the falsehood. The effect of the false statement was that the defendant had deceived the Arbitrator into thinking that the defendant had the required cargo to fulfil its obligations under a contract of sale to the plaintiff and that it had properly mitigated its loss. The Arbitrator found against the plaintiff on the basis of the false testimony and held that the plaintiff was liable to the defendant for US$1,201,609.20 and therefore this deception and fraud had caused prejudice to the plaintiff. The Arbitrator’s holding on the amount of damages to be paid by the plaintiff flowed from the defendant’s deception and fraud.",
        "The arbitration and the Award": "3       The plaintiff is a company incorporated in Singapore. In March 2005, the plaintiff entered into a contract with the defendant, a company incorporated in India, whereunder the plaintiff agreed to purchase from the defendant 40,000mt of iron ore fines (“the cargo”) FOB Karwar Port in South India. Shipment of the cargo was to be in April 2005. The contract provided that the parties would submit any dispute arising under it to arbitration in Singapore under the rules of the Singapore International Arbitration Centre (“SIAC”) if they could not settle the same amicably. 4       The contract was not successfully accomplished. It was the defendant’s position that this was due to breach on the part of the plaintiff. The parties were not able to resolve this dispute amicably so, on 11 January 2007, the defendant issued a Notice of Arbitration. This led to SIAC Arbitration No 002/2007 in which Mr Vangat Ramayah was appointed the sole arbitrator by the SIAC. 5       Pursuant to the SIAC Rules, the defendant prepared a statement of case together with documents. In response, the plaintiff prepared its defence together with documents. The Arbitrator also directed discovery of documents. Parties dispensed with the need to file any list of documents or to file a verifying affidavit. The hearing of the arbitration took place in January 2008. On behalf of the defendant, oral evidence was given by its managing director, Mr Rajasekar, and an affidavit of one Mr Mahadevan was tendered. The plaintiff’s only witness was its vice president, one Mr L K Bangar. 6       The defendant’s position at the arbitration was that the plaintiff had refused to take delivery of the cargo because there had been a sudden drop in the price of iron ore in the world market. Its case was that the plaintiff had breached the contract because it had not taken delivery of the cargo and had also failed to nominate a vessel on which the cargo could be shipped and accepted. The defendant claimed that it had mitigated its damages by selling the cargo to two buyers in India: 12,500mt to Terapanth Foods Limited (“Terapanth”) and 27,500mt to Susmi Impex (“Susmi”) at prices that were substantially lower than the contract price payable by the plaintiff. The defendant therefore claimed the difference in the prices which it calculated as amounting to US$1,201,609.20. 7       The plaintiff’s position at the arbitration was that it was not liable to the defendant because it was the defendant who was in repudiatory breach of contract. The specific propositions it put forward were: (a)     the defendant did not have the cargo ready for loading by the contractually stipulated date and this entitled the plaintiff to terminate the contract on the ground of an anticipatory breach; and (b)     it was the defendant who had rejected the nomination of the plaintiff’s vessel without any basis and this amounted to a repudiation of the contract. 8       The plaintiff sought to prove the following: (a)     no laycan period was agreed upon and therefore all the cargo had to be ready for loading by the contractually stipulated date of 10 April 2005; (b)     there was no congestion at Karwar port at the material time and therefore the defendant had no basis to reject the plaintiff’s initial nomination of the vessel,MV Nava Eliza; and (c)     that the defendant did not properly mitigate its loss because it had sold the cargo at approximately a 50% undervalue and not based on market value prices in China (the destination of the cargo) and therefore was not entitled to its claim. 9       In para 29 of the Award, the Arbitrator identified the following issues as arising in the arbitration namely: (a)     whether a laycan period of 5-10 April was agreed upon; (b)     whether there was congestion at Karwar port at the material time; (c)     whether the defendant’s response and conduct upon receiving the nomination of theMV Nava Elizaevinced a repudiatory breach of the contract; (d)     whether the defendant was in anticipatory breach of the contract with regards to cargo readiness; (e)     whether the plaintiff failed to take delivery, and if so, whether the defendant was entitled to the amount claimed. 10     The Arbitrator rendered the Award on 12 September 2008. He made the following findings: (a)     he found that a laycan period of 5-10 April 2005 was agreed upon. This meant that the latest shipping date according to the contract had been extended to 15 April 2005; (b)     there was congestion at Karwar port at the material time. This meant that the defendant was justified in refusing the plaintiff’s initial nomination because the vesselMV Nava Elizawas too big for the port; (c)     the defendant was not in an anticipatory breach of contract because: (i)       the cargo was ready for loading (the defendant had at least 24,000mt by 28 March 2005 and was in a position to commence loading if the vessel arrived); (ii)       the cargo could all be loaded within the time required under the contractieby 15 April 2005; and (d)     the defendant’s response and conduct upon receiving the nomination of theMV Nava Elizadid not evince a repudiatory breach of the contract. 11     In relation to damages, the Arbitrator accepted (at para 99), that theprima facierule for the assessment of damages in a sale of goods contract was that where there was an “available market” the seller would only be entitled to the difference between the contract price and the market price. He noted the plaintiff’s contention that the “available market” should be in China, the intended destination of the cargo, but citedBenjamin’s Sale of Goods, 6thEd at para 20-129 for the proposition that in relation to an FOB contract, where the cargo has not been shipped, the available market is the place of shipment. In para 101 of the Award, the Arbitrator went on to find that because the iron ore market in China was in turmoil at the material time, it was most unlikely that there was an “available market” there at that time. The fall in demand from China had led to a fall in the international market and that had had an adverse impact on the market in India, occasioning a rapid decline in price. The Arbitrator went on in para 101 to make the following findings: In these circumstances, it is unlikely that there was a market that could have readily absorbed the cargo. Further, Karwar was only a minor export outlet (that would have closed shortly) and Mr Rajasekar testified that they looked for purchasers in thecountry. All this do point to there being no ‘available market’ at Karwar. It cannot be said that there was unreasonable delay in selling the cargo given the time that would naturally be needed to find buyers in a depressed and uncertain market, and to negotiate the sales. As at 9thJune 2005 they were concluding the sale to Terapanth Foods Limited (but only succeeded in selling part of the cargo with a discount of about 42%) and concluded the sale with Susmi Impex on 23rdJune 2005 (with a discount of about 57%). It cannot be said, on the evidence, that they delayed selling in order to speculate on a possible rise in the market. Neither can I infer that they declined offers from likely purchasers at prices higher than those actually achieved. Accordingly, I find and hold that the [defendant] are entitled to damages in the sum of US$ 1,201,609.20. 12     The Arbitrator also awarded the defendant interest from 10 January 2007 until the date of the Award and costs.",
        "The application": "13     The application herein was filed on 24 December 2008. It was supported by an affidavit filed by one Manish Kumar Tibrewal, a vice president of the plaintiff. Mr Tibrewal asserted that following the publication of the Award, facts had emerged which indicated that the defendant and its key witness Mr Rajasekar had given false testimony before the Arbitrator and suppressed “key document and information in the arbitration in order to perpetuate the false testimony”. The facts that were referred to indicated that the cargo was not actually sold to Terapanth in the quantity and at the total price that Mr Rajasekar had testified under oath to. 14     To summarise, the allegations in the affidavit were as follows. The plaintiff noted that Mr Rajasekar had testified that 12,500mt of the cargo had been sold at rupees 1,600 per dry metric tonne ex-plot to Terapanth. This worked out to about US$35 per tonne which was far less than the US$60.50 contracted with the defendant. The total sale price was rupees 20m. However, it turned out that the defendant did not actually sell 12,500mt of the cargo to Terapanth and that it was unable to complete the sale. Mr Tibrewal referred to a recently obtained declaration from one Mr Panjai B. Singhvi, a director of Terapanth, to the effect that the defendant had only sold it 7,615.017mt of the cargo for a price of rupees 12.5m and that the difference of rupees 7.5m was subsequently refunded to Terapanth. A copy of Mr Singhvi’s declaration was attached to Mr Tibrewal’s affidavit. It should be noted that in the various affidavits the amount of cargo delivered is sometimes stated to be 8,084.74mt and sometimes 7,615.017mt. Apparently, the first figure represents the weight of the cargo when moist and the second its weight after the moisture content has been deducted. 15     In Mr Singhvi’s declaration he stated that in June 2005, Terapanth had ordered 12,500mt of iron ore from the defendant and paid 20m rupees in advance for the same. On 10 June 2005, Terapanth took delivery of 7,615.017mt of iron ore. He then went on to say: 6.    Although Terapanth originally ordered 12,500 metric tonnes of iron ore, [the defendant] could supply only 7615.017 MT. I confirm that Terapanth did not purchase further iron ore from [the defendant]. Subsequently, Terapanth was refunded Rs 75,00,000/- (Rupees seventy-five lakhs only) by [the defendant] in three tranches between 16 November and 1 December 2005 with respect to the unfulfilled order for the remaining iron ore. 16     Mr Tibrewal stated that it bore noting that neither the invoice dated 10 June 2005 from the defendant to Terapanth for the sale of 7,615.017mt of iron ore nor any bank documents evidencing the refund of moneys from the defendant to Terapanth were ever disclosed by the defendant during the discovery process at the arbitration. Mr Tibrewal contended: 55.    Without a doubt, the new evidence introduced by Mr. Singhvi shows that [the defendant] was deliberately falsifying testimony and suppressing documents during the arbitration. It is clear from the above that [the defendant] had deliberately deceived [the plaintiff] and the Tribunal into thinking that the full 12,500 metric tonnes of iron ore fines was sold to Terapanth for rps 20,000,000. It is also clear that all references to the refund (either in [the defendant’s] banking documents, [the defendant’s] internal ledgers and management accounts or the documents evidencing the mode of payment of the refund) were all suppressed by [the defendant] to give the impression that the transaction as affirmed by Rajesekar and pleaded by [the defendant] did take place.56.    Perhaps more damaging is the fact that when [the plaintiff’s] solicitors at the arbitration, Haridass Ho & Partners, enquired whether [the defendant] had further documents to disclose, [the defendant] solicitors, Straits Law Corporation, did not reply and simply said that it had attached all its documents to the Statement of Case. 17     The plaintiff asserted that the defendant had engaged in a thorough and calculated deception of the plaintiff, the arbitration proceedings and the Arbitrator in order to elicit an award favourable to it. The fraud must have been planned in advance of the arbitration hearing and the documents were deliberately withheld from disclosure in order to perpetuate the fraud. The plaintiff also contended that the declaration from Mr Singhvi and the new documents disclosed in his declaration (the invoice and the Terapanth ledger entries showing the refunds made) also cast serious doubts on whether the sale of 27,500mt of iron ore fines to Susmi had taken place or whether it had received similar refunds. It argued that the fact that the defendant had not delivered the balance due to Terapanth showed that the latter had only had 8,084.74mt of cargo on 10 June 2005 and probably did not have any more cargo thereafter. It was likely that it never had the 40,000mt of iron ore that it was obliged to deliver to the plaintiff. 18     The defendant initially filed two affidavits in response to the application. One came from one Mr Ramadass Kayarohanam, who stated that he was the owner of Susmi. Mr Ramadass confirmed that in June 2005, Susmi purchased 27,500mt of iron ore fines from the defendant at a price of 1,200 rupees per metric tonne. He also exhibited certain correspondence that he had had with the plaintiff. He said that staff from the plaintiff had asked him in January 2008 about his contracts with the defendant and that subsequently, one Mr Manish Kumar asked him to supply an affidavit for the plaintiff. However, he did not agree with the contents of the draft affidavit which was sent to him at the end of December 2008 and again in early January 2009 and therefore did not affirm the draft affidavit for the plaintiff. A copy of the draft affidavit was exhibited and I note that it was drafted to assert that Susmi had never contracted with the defendant for the purchase of iron ore. 19     The more substantive affidavit came from Mr Rajasekar. He stated that he did not falsify evidence during the arbitration and the defendant did not suppress vital evidence. The allegation of insufficient iron ore fines which Mr Tibrewal had made was not new as the same issue was canvassed during the arbitration and when parties presented their submissions. The plaintiff was now seeking to reopen this issue and set aside the Arbitrator’s finding of fact. In relation to the allegations regarding the sale of iron ore fines to Terapanth, Mr Rajasekar said: 33.    The Defendant did enter into a contract with M/s Terapanth Foods Limited to sell Iron Ore fines in June of 2005. Though initially, M/s Terapanth was willing to purchase 22,000 Metric Tonnes, it later confirmed the purchase of 18,000 Metric Tonnes on the 9thof June 2005. M/s Terapanth kept reducing the confirmation for the purchase of Iron Ore fines further. This sum was finally reduced to 14,227 Metric Tonnes on the request of M/s Terapanth.34.    I wish to state that it was M/s Terapanth which confirmed a lower amount while the Defendants were all the way willing to sell M/s Terapanth 22,000 Metric Tonnes of Iron Ore fines. A copy of the contract with M/s Terapanth is exhibited herewith and marked as “MR-3”.35.    A copy [of] a letter dated 9thJune 2005 from M/s Terapanth to the Defendant confirming and amending the contract is enclosed herewith and marked as “MR-4”. These two documents were discovered during the arbitration hearing. 20     Mr Rajasekar went on to say that pursuant to the terms of the contract (as confirmed on 9 June 2005), Terapanth was entitled to purchase 12,800mt as the sale was of 14,277mt plus or minus 10% at buyer’s option. Terapanth had paid 20m rupees on 18 June 2005 and this amount covered the cost of 12,500mt of iron ore so that the defendant was then obliged to deliver that quantity to Terapanth. Under the contract, Terapanth had the duty to take delivery of the cargo within a week of confirming the purchase. Terapanth did not take all the cargo, however, and on 1 July 2005, the defendant wrote to Terapanth insisting that it take delivery of the balance 4,415.260mt. A copy of this letter was attached to Mr Rajasekar’s affidavit marked “MR-5” and he averred that it had been disclosed in the arbitration and in fact exhibited in the defendant’s statement of case. The contract also stated that if Terapanth failed to take delivery within a week following confirmation of purchase, the price of the iron ore fines may be revised. 21     Dealing with the refund, Mr Rajasekar said that the defendant did not deny that it had returned rupees 7.5m to Terapanth in November 2005. What had happened was that although the defendant had asked Terapanth several times to take delivery of the remaining cargo, it had not done so. In October 2005, however, it had suddenly insisted on taking delivery of the difference between 18,000mt and 8,804mt. The defendant was advised at that stage that its contract with Terapanth for the sale of 14,277mt plus or minus 10% was a concluded contract and that the failure on the part of Terapanth to take delivery of the remaining cargo within the prescribed time period meant that Terapanth had breached the contract. The defendant was further advised that it was allowed under the contract to insist that Terapanth pay it the then current price of iron ore fines (iethe price prevailing in November 2005) or alternatively resolve the matter amicably. 22     Terapanth’s letter of 4 October 2005 was sent after three months of non-response to the defendant’s demands that Terapanth take delivery of the balance cargo and pay the remaining purchase price. Mr Rajasekar also stated that this about turn was easy to explain. Prices of iron ore fines were picking up and it was obvious to the defendant that Terapanth was trying to take advantage of its earlier default by seeking delivery, even though the earlier price had only been valid for one week. Further, Terapanth demanded the difference between 16,200mt and 8,084.74mt when it had agreed in June 2005 to purchase 14,277mt. The defendant was willing to deliver the extra cargo to Terapanth but wanted the new price for the same. There was impasse as Terapanth kept insisting that the defendant should supply 8,484mt at the original price. 23     On behalf of the defendant, Mr Rajasekar spoke with one Mr Jayantilal who was the middleman between the defendant and Terapanth. The matter was resolved amicably when the defendant agreed to return rupees 7.5m of the earlier payment after making a deduction of nearly rupees 400,000. The defendant was also advised that it could not claim the further losses caused by Terapanth to the plaintiff as its contract with Terapanth was a concluded contract. Hence, the defendant had genuinely believed that the subsequent conduct of Terapanth was not relevant to the claim against the plaintiff and especially so when it did not have the right in law to claim from the plaintiff the losses it had suffered on account of Terapanth’s breach. The defendant believed that the subsequent settlement with Terapanth was irrelevant in determining the loss of profits which the defendant suffered on account of the plaintiff’s breach.",
        "The law": "24     The basis of the application is two-fold. First there is the provision in s 24(a) of the Act that the High Court may set aside an arbitration award if the making of the award was induced or affected by fraud or corruption. Second, reliance is also placed on article 34(1)(b)(ii) of the Model Law which states that an arbitral award may be set aside if the court finds that it is in conflict with the public policy of the state. In this instance it would appear that the allegation that the Award is in conflict with the public policy of Singapore is made on the same basis as the allegation that the Award has been procured by fraud. I note that the plaintiff relies in this regard on the observation of the Court of Appeal inPT Asuransi Jasa Indonesia (Persero) v Dexia Bank SA[2007] 1 SLR 597at [59] where Chan Sek Keong CJ stated: 59    Although the concept of public policy of the State is not defined in the Act or the Model Law, the general consensus of judicial and expert opinion is that public policy under the Act encompasses a narrow scope. In our view, it should only operate in instances where the upholding of an arbitral award would “shock the conscience” (seeDowner Connect([58]supra) at [136], or is “clearly injurious to the public good or … wholly offensive to the ordinary reasonable and fully informed member of the public” (seeDeutsche Schachbau v Shell International Petroleum Co Ltd[1987] 2 Lloyds’ Rep 246 at 254,perSir John Donaldson MR), or where it violates the forum’s most basic notion of morality and justice: seeParsons & Whittemore Overseas Co Inc v Societe Generale de L’Industrie du Papier (RAKTA)508 F 2d, 969 (2nd Cir, 1974) at 974. This would be consistent with the concept of public policy that can be ascertained from the preparatory materials to the Model Law. As was highlighted in the Commission Report (A/40/17), at para 297 (referred to inA Guide to the UNCITRAL Model Law on International Commercial Arbitration: Legislative History and Commentaryby Howard M Holtzmann and Joseph E Neuhaus (Kluwer, 1989) at 914):In discussing the term ‘public policy’, it was understood that it was not equivalent to the political stance or international policies of a State but comprised thefundamental notions and principles of justice… It was understood that the term ‘public policy’, which was used in the 1958 New York Convention and many other treaties, covered fundamental principles of law and justice in substantive as well as procedural respects. Thus, instances such ascorruption, bribery or fraudand similar serious cases would constitute a ground for setting aside. [Emphasis added] It would be noted from the above extract that the Court of Appeal approved the observation that public policy includes fraud. In the present case, no contravention of public policy or fraud is relied on apart from the allegations of perjury and suppression of relevant documents. 25     The English courts have held that suppression of documents can amount to obtaining an arbitration award by fraud. InElektrim SA v Vivendi Universal SA[2007] 1 Lloyd’s Rep 693 (“Elektrim”), Aikens J discussed this issue at [79] to [82]: 79    I next consider the question: what actions or inactions are within the ambit of the phrase “obtained by fraud” in the context of the facts in this case? Neither side drew my attention to any cases where the English courts have considered the ambit of the phrase “ … the award being obtained by fraud” in section 68(2)(g). … I note that section 68(2)(g) does not refer to the fraud of a party to the arbitration. On the face of the wording it would seem that the “fraud” referred to in the paragraph can be committed by anyone who is connected with the arbitration process. If this were right, then (for example) if it were proved that a witness for one side or another has committed perjury when giving evidence before the tribunal, that would be a “fraud” within para (g). If so then, if it were also proved that the perjured evidence resulted in the award being in favour of that party then, logically, the award would have been “obtained by fraud”.80    But I have concluded that this is not the correct construction of the words “obtained by fraud”. It is a party to an arbitration that obtains an award in its favour or has one made against it.The words “obtained by fraud” must refer to an award being obtained by the fraud of a party to the arbitration or by the fraud of another to which a party to the arbitration was privy. …81    In my view the strict approach to the construction of the words “obtained by fraud” that I have adopted must also be applied in relation to the disclosure of documents in an arbitration. If a party to the arbitration is ordered to produce a document (or a class of documents) that is relevant to the arbitration and the party, through its directors, its employees or its lawyers, in the knowledge that the document exists, decides deliberately to conceal it, with the intention of inducing the tribunal and the other side into the belief that the document does not exist, then that must be a “fraud” for the purposes of section 68(2)(g). However, because an allegation of fraud is being asserted, the accuser will have to demonstrate its case to a high standard of proof.82    But an award will only be “obtained by fraud” if the party which has deliberately concealed the document has, as a consequence of that concealment, obtained an award in its favour. The party relying on section 68(2)(g) must therefore also prove a causative link between the deliberate concealment of the document and the decision in the award in favour of the other, successful, party. 26     The commentary above was in respect of s 68(2)(g) of the English Arbitration Act. Section 68 deals with challenges to an arbitration award on the grounds of “serious irregularity” with the award and ss (2)(g) thereof states that one of the situations in which a serious irregularity would have occurred would be when “the award [was] obtained by fraud or the award or the way in which it was secured [was] contrary to public policy”. Although the English legislation is not identical to ours, since the English courts also have to consider what the meaning of the phrase “obtained by fraud” is in relation to an arbitral award, their reasoning is applicable in similar situations in Singapore. 27     The following observations of Cooke J in the case ofThyssen Canada Limited v Marianan Maritime SA[2005] 1 Lloyds Rep 640 at 644 are also apposite: Whichever limb of s 68(2)(g) of the Act is relied on by the claimants, they must establish that the defendants acted in such a way as to obtain the award by fraud or to procure it in a way which was reprehensible or involved unconscionable conduct. … It is for the parties to prepare for hearings, whether in Court or arbitration and to adduce the evidence which they wish to establish the truth. If a decision is to be challenged on the basis of false evidence, this can only be done by an applicant where the defendant can fairly be blamed for adducing of that evidence and the deception of the tribunal. In the present case, it can make no difference whether the application is made on the basis that the award was obtained by fraud or procured in a manner that is contrary to public policy. In each case the claimant must establish that the defendant was responsible for the fabrication of perjured evidence, which has brought about a result which has caused them substantial injustice. 28Elektrimand the other English authority ofProfilati Italia SrL v. PaineWebber Inc[2001] 1 Lloyd’s Report 715 (“Profilati”), were discussed with approval by Chan Seng Onn J inDongwoo Mann+Hummel v. Mann+Hummel Gmbh[2008] 3 SLR 871. He observed that in theProfilaticase, Moore-Bick J had said: 19.    Where an important document which ought to have been disclosed is deliberately withheld and as a result the party withholding it has obtained an award in his favour the Court may well consider that he was [sic] procured that award in a manner contrary to public policy. After all, suchconduct is not far removed from fraud. [Emphasis added] Chan J did not entirely agree with the above statement and he said: 133.  In my view, what was stated in [19] (quoted above) inProfilati([132]supra) should not be read in the absolute sense without any qualifications. If there is a good reason for the intentional non-disclosure of an important document (which of course must not be a fictitious reason), then it cannot be said that the resulting deliberate non-disclosure is akin to fraudulent conduct. Thus, intentional non-disclosure in itself is insufficient. To set aside an award there must not be a good reason for such non-disclosure. 29     It is clear from the authorities that perjury is regarded as fraud and that a deliberate attempt to withhold documents may also be considered fraudulent or akin to fraud. However, proving fraud or unconscionable conduct is insufficient. In order to obtain relief, the complainant must show that the reprehensible conduct or fraud had caused it substantial injustice in that the same procured or substantially impacted the making of the award. In relation to fraud in the nature of perjury, the defendant also cited the case ofDDT Trucks of North America Ltd v DDT Holdings Ltd[2007] 2 Lloyd’s Law Reports 213 where Cooke J had cited the judgment of Waller LJ inWestacre v Jugoimport2000 QB 288 to the effect that in order to set aside a judgment on the ground that it was obtained by fraud, a applicant would have to produce evidence newly discovered since the trial which could not have been produced at the trial with reasonable diligence and which was so material that its production at the trial would probably have affected the result and was so strong that it could reasonably be expected to be decisive at a re-hearing. 30     On the authorities, I conclude: (a)     if the fraud alleged is the shape of perjury, the applicant must prove that its new evidence could not have been discovered or produced, despite reasonable diligence, during the arbitration proceedings; (b)     the newly discovered evidence must be decisive in that it would have prompted the arbitrator to have ruled in favour of the applicant instead of the other party; (c)     if the fraud was in the shape of non-disclosure of a material document, the document must be so material that earlier discovery would have prompted the arbitrator to rule in favour of the applicant; and (d)     negligence or error in judgment in failing to discover a crucial document would not be sufficient to justify a setting aside of the award and for that purpose, the non-disclosure must have been deliberate and aimed at deceiving the arbitrator.",
        "The plaintiff’s contentions": "31     The plaintiff made its submissions under the following heads: (a)     Mr Rajasekar had given false and misleading testimony; (b)     the defendant was motivated by bad faith when it failed to provide proper disclosure of documents; (c)     the conduct of the defendant and its witness had caused substantial injustice to the plaintiff; and (d)     the entire Award needed to be set aside. 32     The plaintiff submitted that Mr Rajasekar had made a false statement under oath with the deliberate intention of misleading both the Arbitrator and the plaintiff into thinking that the defendant had sold 12,500mt of the cargo to Terapanth. He and the defendant had failed to disclose that the sale was never completed and that a subsequent refund of 7.5m rupees was made by the defendant to Terapanth. 33     The plaintiff noted that the defendant had given the following explanations for its evidence: (a)     The defendant never took the position that the full 12,500mt of the cargo was sold to Terapanth and this was supported by the documents disclosed at the arbitration; (b)     The defendant and Mr Rajasekar did not inform the Arbitrator of the refund and the incomplete sale because the plaintiff did not cross-examine Mr Rajasekar on this point as its sole focus was on the issue of liability and not damages; (c)     The defendant and Mr Rajasekar genuinely believed that the incomplete sale and the subsequent refund made by it to Terapanth was irrelevant for the purpose of the arbitration. (d)     In any event, the defendant always had the cargo available and it was Terapanth who had refused to take delivery of the remaining cargo despite the defendant’s ability to supply the same. To support this assertion, the defendant annexed additional documents never before disclosed. 34     The plaintiff did not accept those explanations. It argued that the documents disclosed at the arbitration showed or were deliberately calculated to give the false impression that Terapanth did take delivery of 12,500mt. These documents consisted of the draft contract for the sale to Terapanth; a bank statement evidencing the payment of 20m rupees for 12,500mt; and a letter of demand from the defendant’s Indian solicitors to the plaintiff dated 15 July 2005 which stated that 12,500mt of iron ore had been sold to Terapanth for 20m rupees. Mr Rajasekar had said that the plaintiff should have known at the arbitration that Terapanth had only taken delivery of 8,084.74mt and had not taken delivery of the remaining cargo. The plaintiff disputed this since it said that the defendant had never taken this position at the arbitration and its own letter of 1 July 2005 to Terapanth did not show that only 8,084.740mt were ever delivered to Terapanth. 35     Secondly, the plaintiff had clearly addressed the issue of damages in its closing submission to the Arbitrator. It did not cross-examine the defendant on the subsequent refund to Terapanth because it could not reasonably have known that the sale was incomplete or that the payment had been partially refunded since the documents evidencing these facts were in the defendant’s hands. 36     The plaintiff also contended strenuously that the defendant’s assertion that the subsequent refund was irrelevant to the issues in the arbitration could not be justified. It cited the recent House of Lords’ decision inGolden Strait Corporation v. Nippon Yusen Kubishka Kaisa[2007] 2 WLR 691 (“Golden Strait”) for the proposition that damages should be assessed with reference to subsequent events so as to prevent an innocent party from over claiming his entitlement to damages. The plaintiff asserted that the court should look at all the facts subsequent to a breach of contract to determine and assess an innocent party’s right to damages. 37     The defendant’s case on the damages issue was that it was entitled to claim the actual loss it suffered and the Arbitrator had made this ruling on quantum on this basis. In this regard, the defendant had taken the position that it had obtained 20m rupees from Terapanth for selling 12,500mt of cargo. The amount collected for the sale of the cargo was the main consideration for the damages issue and the reason that the incomplete sale and subsequent refund were omitted from the facts presented to the Arbitrator was to mislead the Arbitrator into believing that the full 12,500mt of cargo was sold for 20m rupees. 38     The plaintiff also argued that the new documents disclosed by the defendant did not support its position that it was Terapanth who failed to take delivery. The defendant was trying to stretch the reasonable interpretation of the documents in order to shape them to support its case. The plaintiff considered it significant that the defendant had not proffered answers to the following key questions that could affect the award of damages: what had happened to the undelivered balance of the cargo, at what price that balance had actually been sold for, and whether there was any double counting in the calculation of damages by the Arbitrator. The plaintiff submitted that it was reasonable to infer that the answers to those questions were not forthcoming because the defendant never had the balance of the cargo in the first place. 39     As for the defendant’s explanation that it had not disclosed the documents because they were irrelevant, the plaintiff considered that this was contrived as an afterthought for the defendant to camouflage its bad faith. It considered that the facts relating to the incomplete sale and the refund to Terapanth were clearly relevant to the damages issue. The defendant’s failure to produce the documents relating to these facts was intentional and done in order to perpetuate Mr Rajasekar’s false testimony. 40     The plaintiff also argued that the new documents and facts discovered by the plaintiff and the facts stated in the affidavit of Mr Singhvi raised clear and serious doubts as to whether the defendant had had sufficient cargo in the first place to fulfil the contract with the plaintiff. No contemporaneous evidence had been proffered by the defendant that showed that 40,000mt of iron ore fines were available for shipment. The Arbitrator had accepted that the defendant had 24,000mt available at its plots at Ankola before the nomination of the vessel. 41     The plaintiff considered that the Arbitrator had assumed on insufficient evidence that the defendant would have the extra 16,000mt available by the loading date. It argued that the fact that the defendant had not fulfilled its obligations to Terapanth cast serious doubt on the availability of the full 40,000mt of the cargo to be loaded. It also argued that there was insufficient evidence to support Susmi’s alleged purchase of 27,500mt of cargo because neither the defendant nor Susmi’s purported owner had disclosed the common commercial documents evidencing the delivery of the 27,500mt of cargo or payment for the same. 42     In summary therefore, the plaintiff argued that the documents and testimony in question were relevant in relation to two issues: the ability of the defendant to fulfil the contract (which it referred to as the anticipatory breach issue) and secondly, the quantum of damages payable to the defendant.",
        "Analysis and decision": "",
        "The old and new evidence": "43     I must first consider the evidence that was given at the arbitration and the documents that were disclosed there and then see what the “new” evidence and documents contained. 44     The “false” testimony of Mr Rajasekar that the plaintiff complained about was contained in paragraph 58 of his affidavit for the arbitration proceedings. This paragraph read as far as material as follows: Following this incident, [the defendant] contacted other iron ore purchasers in the country and negotiated the sale of the 40,000 tonnes of iron ore to [Terapanth] and [Susmi].…We managed to sell 12,500 metric tonnes of the said iron ore at Indian Rupees 1,600 per dry metric tonne Ex-plot to [Terapanth]. This works out to about US$35 per tonne which is far less than the US$60.50 contracted with [the plaintiff]. The total sale price was Indian Rupees 20,000,000.…The difference in prices sold to [Terapanth] as well as [Susmi] compared with the contract price of US$60.50 resulted in [the defendant] losing a sum of US$1,202,609.20. In support of his affirmation, Mr Rajasekar exhibited to his affidavit the following documents: (a)     the draft contract between the defendant and Terapanth (“Draft Contract”); (b)     a letter dated 9 June 2006 from Terapanth to the defendant amending the terms of the Draft Contract; (c)     a bank statement showing the payment of rupees 20m by Terapanth; and (d)     a letter dated 15 July 2005 from the defendant’s Indian solicitors to the plaintiff. 45     The Draft Contract is undated and unsigned. It provided for the sale by the defendant to Terapanth of a quantity of 22,000mt (plus or minus ten percent at seller’s option) iron ore fines. The price was stated to be “Rs 1600 per MT + V.A.T. 4% (Ex-Plot Balleguli)”. Under “Payment Terms” it was provided that Terapanth would make an advance payment for 5,000mt initially and then as and when the cargo was purchased, Terapanth would pay on the basis of actual weight. The advance would be adjusted against payment for the final purchases. The delivery term is important. That read: DELIVERY IN LOTS The Cargo should be taken delivery within a week from the date of confirmation. Otherwise difference in new sales Price will be adjusted from the advance amount paid already. 46     Terapanth’s subsequent letter dated 9 June 2005 to the defendant confirmed the sale of 18,000mt (plus or minus ten percent) at the same price and proposed some amendments to the Draft Contract. These amendments dealt with the specifications of the product and the quantity. There were no amendments to the payment terms. The letter promised that a payment of rupees 5m would be deposited in the defendant’s bank account the following day. It appeared therefore that subject to the amendments it had proposed, Terapanth had agreed to the terms of sale in the Draft Contract. 47     The next document, the bank statement, showed that indeed rupees 5m had been deposited in the defendant’s bank account on 10 June 2005. It also showed further deposits of rupees 10m on 15 June 2005 and rupees 5m on 17 June 2005. By 18 June 2005 therefore, Terapanth had paid the defendant a total of rupees 20m. 48     The letter dated 15 July 2005 from the defendant’s Indian lawyers to the plaintiff set out the facts of the case as seen by the defendant and made the allegation that the plaintiff had failed to take delivery of the cargo as per the terms of the contract and that this had caused loss and hardship to the defendant. It further stated that due to the plaintiff’s non-performance of its contractual obligations, the defendant’s only option had been to resort to a distress sale of the cargo and, with great difficulty, it had managed to sell 12,500mt to Terapanth at the rate of rupees 1,600 per metric tonneiefor a total sum of rupees 20m. The letter went on to demand payment of the difference between the prices obtained from Susmi and Terapanth and that payable under the contract with the plaintiff. 49     It can be seen from the above that the testimony and the documents produced supported the existence of a sub-sale to Terapanth of 12,500mt for rupees 20m. It would also have implied that the sub-sale went through and that the full quantity sold to Terapanth was delivered to it. 50     It should be noted, however, that another document exhibited in the defendant’s statement of case in the arbitration was a letter dated 1 July 2005 from the defendant to Terapanth. That letter read as follows: Regarding Iron OreYour confirmation of 14,227 MTs confirmed at Rs. 1600/- PMT. You have taken delivery of 8084.740 MTs (Details given below) out of 12,500 MTs for which you have paid already.…The balance tones(sic)to be lifted is 4415.260 MTs.Also, kindly arrange to pay Rs. 27,63,200/- for the balance material 1727 Mts out of the total confirmation of 14,227 Mts and clear the entire cargo as soon as possible.… I observe that this letter indicated only that by 1 July 2005, Terapanth had not taken delivery of the full amount of the cargo it had contracted to buy. The letter did not, and naturally could not, show that Terapanth never thereafter took delivery of the rest of the cargo. 51     The new evidence and documents that were revealed as a result of this application were as follows. First, there was the evidence procured by the plaintiff. This has been described in[14]to[16]above and comprised: (i) Mr Singhvi’s declaration that the defendant had only been able to supply 7,615.017mt of iron ore to Terapanth and consequently had to refund Terapanth the balance of the price for the cargo that was not delivered and (ii) copies of Terapanth’s ledger entries showing the refund. 52     Second, there was the evidence that was produced by the defendant in response to the application. This consisted of Mr Rajasekar’s explanation for his testimony and the documents disclosed in the arbitration as well as some further documents. These documents comprised: (a)     a letter dated 15 June 2005 from the defendant to Terapanth (and a copy of the fax transmission slip) stating that although Terapanth had accepted the defendant’s sale confirmation of 18,000mt of iron ore fines, it had just informed the defendant that it could only lift 15,000mt and the balance would be cleared subsequently. The defendant asked Terapanth to pay the entire quantity of 18,000mt immediately and take delivery of as much as it required at present and thereafter take the balance within ten days; (b)     a letter dated 18 June 2005 from the defendant’s head office in Chennai to its office in Ankola authorising the latter to release up to 12,500mt of iron ore to Terapanth; (c)     an e-mail dated 18 June 2005 from the defendant’s Ankola office to its head office confirming that it would be supplying 12,500mt to Terapanth; (d)     a letter dated 4 October 2005 from Terapanth to the defendant in which it stated that under the contract for 18,000mt (plus or minus ten percent) at the price of rupees 1,600 per metric tonne it had already taken delivery of 8,084.740mt and to fulfil the contract, it wanted to buy in total 16,200mt at the same price and was ready to pay the balance amount against delivery of balance quantity. Terapanth requested the defendant to deliver the remaining quantityie8,584.983mt; and (e)     a letter dated 9 November 2005 from the defendant to Terapanth stating that with reference to its discussion with one Mr Jayanthilal on 9 November 2005 it was “arranging to pay the balance amount of Rs. 75,00,000/- (Rupees Seventy Five Lakhs only) as full and final settlement” and that this amount would be paid in three weekly equal instalments of rupees 2.5m each. 53     The explanation given by Mr Rajasekar in his affidavits filed in these proceedings has been recounted above. To summarise, it was that Terapanth was in breach of contract because it did not take delivery within the specified one week period of all the cargo it had contracted to buy and therefore it was not entitled subsequently to ask for delivery of the balance amount or for any extra amount at the original price. By October 2005, the price of iron ore fines was rising and the defendant did not want to supply the remaining quantity at the same price. In the end, the dispute was amicably settled by the refund to Terapanth of most of the payment which it had made in respect of the cargo that was not delivered.",
        "Analysis of the evidence": "54     Looking at the evidence and documents given in the arbitration, it appears to me that both the evidence and the documents truly reflected the factual position as it stood on 1 July 2005. At that date, there was a contract between the defendant and Terapanth for the latter to purchase (at the least) 14,227mt of cargo (plus or minus 10%) at rupees 1,600 per metric tonne and Terapanth had paid for 12,500mt. At that date, Terapanth had taken partial delivery and the defendant was asking it to take delivery of the balance. The position changed later and to me what is really in issue is whether it was fraudulent or unconscionable on the part of the defendant not to disclose the subsequent change in position. To determine that issue, one must consider whether the additional evidence which has now been put before me would have had any impact on the course of the arbitration, to the knowledge of the defendant, such that it was wrong for the evidence not to have been adduced. 55     I should explain that having examined the additional evidence, I accept the defendant’s explanation as to what had occurred. I do not accept as true Mr Singhvi’s account of events and in particular his assertion that although Terapanth had originally ordered 12,500mt, the defendant could only supply 7,615mt. This assertion was incorrect in two aspects: first that the order made by Terapanth was for 12,500mt alone and second that the defendant could only supply 7,615mt. Terapanth’s own letter of 9 June 2005 thanked the defendant for confirming a sale of 18,000mt (plus or minus 10%) of the cargo. Then, to reiterate what I have stated above (at[53]), the defendant’s letter of 1 July 2005 showed that as of that date Terapanth had confirmed 14,227mt and had paid for 12,500mt of cargo but had only taken delivery of 8,084mt. The letter not only requested Terapanth to take delivery of the remaining cargo for which it had already paid, but also asked for Terapanth to pay a further sum of rupees 2,763,200 and take a further 1,727mt (14,227mt minus 12,500mt) of cargo. This contemporaneous letter (which was in fact disclosed at the arbitration) showed that Mr Singhvi’s statement that Terapanth ordered 12,500mt but the defendant could only supply 7,615mt was untrue. The defendant would not have written a letter on 1 July 2005 asking Terapanth to take immediate delivery of the balance of the 12,500mt plus a further 1,727mt if it did not then have the total quantity available to be taken by Terapanth. 56     In his statement, Mr Singhvi did not make any reference to the letter of 1 July 2005. The plaintiff did not explain why he omitted such reference. There is no doubt that Terapanth received the 1 July 2005 letter since it referred to the same in its own letter to the defendant dated 4 October 2005. Mr Singhvi’s statement was contradicted by the contents of the 1 July 2005 letter and there are only two possible explanations for this. The first is that Mr Singhvi had forgotten the true state of affairs as he did not have the assistance of contemporaneous documents to jot his memory and the second is that he was intentionally stating an untruth. I am inclined to the latter view. 57     The veracity of Mr Singhvi’s declaration is also put in doubt by the contents of the defendant’s letter of 15 June 2005 to Terapanth. That letter noted that Terapanth only wanted to take 15,000mt out of the contractual quantity of 18,000mt. The defendant, however, requested Terapanth to pay for the entire quantity of 18,000mt, to take what it needed immediately and to take the balance within ten days. That letter shows that the defendant had available for immediate delivery a quantity of cargo that exceeded the 12,500mt that Terapanth had paid for. Mr Singhvi did not make reference to that letter either. The fax transmission slip produced showed that the letter had apparently been received by Terapanth. 58     The documents that the defendant produced supported its position that all along it had sufficient cargo to supply the 12,500mt that Terapanth had paid for and that the only reason that the full quantity had not been delivered to Terapanth was that Terapanth had not, in the defendant’s and Terapanth’s terminology, “lifted” the same. The internal memoranda disclosed by the defendant showed that it had given its Ankola office instructions to release up to 12,500mt to Terapanth and that the Ankola office had confirmed that it would do so. It was pursuant to that permission that Terapanth was able to lift the 8,084mt of cargo that it actually took. 59     Mr Singhvi also made reference to an invoice dated 10 June 2005 to establish that the defendant had in fact only sold 7,615mt to Terapanth. Mr Singhvi attempted to give the impression that this invoice was prepared contemporaneously with the contract and therefore was inconsistent with the defendant’s contention that it had sold 12,500mt of cargo to Terapanth. However, a close examination of the documentation would show that the invoice dated 10 June 2005 could not have been prepared on that date. In the letter of 1 July 2005, the defendant confirmed that the quantity supplied was 8,084.74mt. As far as the defendant was concerned, that was the quantity taken. It was only when the defendant received Terapanth’s letter of 4 October 2005 that it learnt that although Terapanth had taken 8,084.74mt it considered the quantity delivered to be 7,615.017mt because the surveyor (SGS) had found that the cargo had a moisture content of 5.81% equivalent to 469.723mt by weight. The figure of 7,615.017mt was therefore communicated to the defendant for the first time on 4 October 2005. The defendant submitted that these facts showed that, as Mr Rajasekar had stated in his affidavit, the invoice was prepared at the time of the settlement in November 2005 in order to evidence the amount taken by Terapanth. It therefore was not evidence of the amount sold in June 2005. I accept that submission. 60     It is notable that the plaintiff did not provide any evidence on how and when it contacted Mr Singhvi to obtain his testimony. It did not set out the particulars of inquiry, the correspondence with Terapanth and all the documents obtained. The plaintiff did not explain why after the arbitration it thought there had been fraud and did not provide any evidence on who contacted Mr Singhvi and what instructions were provided to him when his statement was procured. The statement indicates that Mr Singhvi was not told about the nature of the proceedings between the defendant and the plaintiff. He made no averment relating to any information that he had on the contract between the plaintiff and the defendant or the subsequent arbitration or why he had come forward to make the statement. There is also no reason given by the plaintiff as to why it could not have obtained the information from Mr Singhvi before the hearing of the arbitration since in its case the defendant had already revealed how it had disposed of the cargo after the plaintiff’s default. All these omissions cast substantial doubt on thebona fidesof Mr Singhvi’s evidence and the ability of the plaintiff to establish the circumstances necessary for the court’s consideration of the new evidence. 61     Having considered the documents and the testimony, I accept the defendant’s account of what happened after 1 July 2005. The documents indicate that it was Terapanth that was in breach of contract in failing to take timely delivery of not only the 12,500mt that it had paid for but also of the balance of 1,727mt which had not been paid for in June 2005. When Terapanth went back to it in October 2005 asking for the cargo at the original price, the defendant was not willing to supply the same since prices had risen. I accept Mr Rajasekar’s evidence on the dispute that then arose and the way that it was settled by the return of Terapanth’s excess payment (rupees 7.5m after the deduction by the defendant of rupees 400,000 for expenses). The fact that Terapanth accepted less than a full refund is some indication that it was in breach. I also note that on this account it would appear that in the end the defendant probably was able to sell the remaining quantity originally purchased by Terapanth at a price higher than rupees 1,600 per metric tonne. There is however no evidence at all on the price at which this quantity was sold and when it was sold.",
        "Effect of the new evidence on the Arbitrator’s findings": "62     The plaintiff made this application on the basis that the evidence and documents which it said had been fraudulently suppressed would have affected the Award in two ways: first that the same raised serious doubts as to whether the defendant had had sufficient cargo to fulfil the contract with the plaintiff and second, in relation to the quantification of damages. 63     I deal first with the question of whether the defendant’s failure to disclose Terapanth’s breach of contract and the consequences of the same could have affected the Arbitrator’s finding of fact that the cargo was ready for loading in April 2005. My answer to this question must be in the negative. First, as the defendant pointed out, the fact that the defendant did not deliver further cargo to Terapanth in October 2005, even assuming that this was due to unavailability, has absolutely no probative value on the question of what quantity was available for delivery to the plaintiff in April 2005. Second, the plaintiff’s contention was that the defendant was unable to supply even 12,500mt. This contention ignored the Arbitrator’s finding of fact based on contemporaneous correspondence that 24,000mt of cargo was available by the end of March. Third, I do not believe Mr Singhvi’s declaration and therefore I do not agree that Mr Rajasekar was committing perjury when he testified that the defendant had managed to sell 12,500mt of cargo to Terapanth. There was such a sale, part of a larger amount agreed to but not paid for. The non delivery of the full quantity was not due to unavailability of cargo in June and July 2005 but to Terapanth’s failure to take the same. Had all the evidence before me in relation to the sale to Terapanth been before the Arbitrator as well it would not have affected his decision on the availability of cargo in April 2005. 64     The plaintiff argued that the additional evidence indicated that the sale to Susmi was also in doubt. I must reject that contention. There was nothing in the new evidence which supported such an allegation. It is not logical to argue that because the defendant was not able to supply some 4,000mt of cargo to Terapanth (if that had in fact been the case) that fact also proves that it could not have supplied 27,500mt to Susmi. The Arbitrator was the master of the facts and he was satisfied on the evidence before him that the defendant was fully able to meet its contractual obligation to the plaintiff. He also found that a sale to Susmi had been concluded. Those findings are final. Even if the Arbitrator made mistakes of fact in reaching those conclusions, that is not a matter which can be brought before the court for remedy. The court’s jurisdiction is limited and that is why the plaintiff has based its attack on fraud. Fraud, however, is a serious accusation and has to be properly proved. Case law makes it clear that when an allegation of fraud is made, the claimant has to produce evidence that is cogent and strong enough to establish the fraud. Fraud will not be inferred and certainly the court will not draw a conclusion of fraud in relation to readiness to load in April 2005 simply because it is shown that about 10% of the amount to be loaded was not available in October 2005. 65     The second basis of attack relates to quantification. The Arbitrator awarded the defendant damages calculated in part on the difference between the price at which the cargo was sold to Terapanth and that at which it was sold to the plaintiff. It now turns out that the sale of about one-third of the cargo originally sold to Terapanth was cancelled and that amount was, most probably, sold to another purchaser at a higher price. This would mean that in the end the defendant actually received more for that portion of the cargo than it acknowledged in the arbitration since its claim in the arbitration for the damages relating to that portion was based on the price agreed with Terapanth. The question is whether, had these facts been before the Arbitrator, he would still have awarded the defendant the damages he did. If that question is answered in the negative then the plaintiff would have a strong argument to assert that the award was procured by the suppression of documents and facts. It would be recalled that the defendant’s position was that it was advised that the subsequent events were not relevant to its claim and therefore it had not disclosed the facts and the documents. This stand goes towards establishing that the defendant’s motive in not making the disclosure was not fraudulent or unconscionable in any way. 66     The determination of this question depends on the legal position in relation to the correct basis on which an award of damages should be quantified in the case of the breach of a contract for the sale and purchase of goods. It is common ground that in a sale of goods situation, there are two methods of assessing damages due to be paid to the seller as a result of the buyer’s breach: (a)     Where there is an available market, s 50(3) of the Sale of Goods Act (Cap. 393 Rev Ed 1999) (“SOGA”) provides: Where there is an available market for the goods in question, the measure of damages is prima facie to be ascertained by the difference between the contract price and the market or current price of the goods at the time or times when they ought to have been accepted or (if no time was fixed for acceptance) at the time of the refusal to accept. (b)     Where there is no available market, s 50(2) of SOGA provides: The measure of damages is the estimated loss directly and naturally resulting, in the ordinary course of events, from the buyer’s breach of contract. In the present case, as I noted above, the Arbitrator found on the facts that there was no available market at the time of the plaintiff’s breach of contract. Accordingly, the defendant’s damages had to be assessed in accordance with the provisions of s 50(2) of SOGA. In this respect,Benjamin’s Sale of Goods(7thEd, London, Sweet & Maxwell 2006) states at para 16-077: If section 50(3) does not apply, because there is no available market, the court is thrown back on the general principle enunciated in section 50(2) … The main rule should be that the seller’s loss is the difference between the contract price and the value of the goods to the seller at the time and place of the breach, and any relevant evidence may be admissible to prove this value. If, despite the absence of an available market, the seller has in fact been able eventually to find a substitute buyer, the resale price may be evidence to fix the seller’s loss, if the terms of the resale are substantially similar to those in the original sale. 67     The above extract is particularly useful because it emphasises that when ascertaining what s 50(2) refers to as “the estimated loss directly and naturally resulting… from the buyer’s breach” one has to have regard to thevalue of the goods to the seller at the time and place of the breachand therefore the exercise that the court undertakes in fixing the damages is to consider all the evidence available which will establish such value. Such evidence may include the resale price if the seller is able to find a substitute buyer. It is also important to note that the relevant time at which the value has to be ascertained is the time of the breach. It is this particular principle which gave rise to the dispute in this case because it was the plaintiff’s submission that on the facts here what happened subsequently had to be taken into account and the damages could not be assessed simply by the value that the cargo had to the defendant at the time of the breachieduring the period April to about June 2005 when the sale price to Terapanth was fixed. 68     The plaintiff argued that when damages were assessed under s 50(2) there could be two possible variations. The first variation which the plaintiff termed the “Determinable Value Scenario” was where the seller claimed the difference between the contract price and the value to him at the time and place of the breach. The second variation which the plaintiff termed the “Actual Loss Scenario” was where the seller had managed to find a substitute buyer and the resale price was used to fix the seller’s loss because it would compensate the seller for the actual loss that he had suffered. The plaintiff further contended that damages are crystallised at the date of the breach if they are based on an available market or the Determinable Value Scenario. In such situations, accordingly, contracts entered into by the seller with third parties and the manner in which the seller deals with the goods subsequent to the breach are irrelevant for the purpose of assessing damages. 69     However, argued the plaintiff, the position would be different in the Actual Loss Scenario where the seller’s claim is for his actual loss. This loss is calculated by taking the difference between the price of the contract that the seller had made with the buyer and the price of the sale to the substitute buyer. In this way damages would be quantified not by the hypothetical depreciation of the goods but by the actual loss suffered by the seller. This is the reason why in a situation where the seller sells the goods at a higher price to a substituted buyer he is not entitled to claim for any damages as he has suffered no loss. In support of this proposition, the plaintiff citedLazenby Garages Ltd v Wright[1976] 1 WLR 459 (“Lazenby Garages”). When in the Actual Loss Scenario a seller makes a claim for damages based on his actual loss, the court must know all subsequent events and conduct of the seller to determine the quantum of his actual loss. This is because in those circumstances the court is concerned not to award damages in excess of the actual loss suffered by the plaintiff. In theGolden Straitcase, the House of Lords had refused to ignore subsequent events because of the overriding concern that a plaintiff may be able to claim damages in excess of the actual loss it had suffered. 70     Moving on to the present case, the plaintiff argued that the defendant’s claim had always been for compensation for its actual loss. The defendant’s position was that there was no available market and there was no need to determine the market price or the value of the goods at the time of breach as this was irrelevant. The defendant had predicated its entire claim for damages on the fact that the sum of US$1,201,609.20 was its actual loss. The plaintiff argued that the defendant had not pursued a claim under the Determinable Value Scenario because of the difference in the terms of the contract with the plaintiff and the resale contracts with Terapanth and Susmiiethe sale contract to the plaintiff had been on an FOB basis whilst the resale contracts were both on an “Ex-plot” basis. 71     From the above summary, it can be seen that the plaintiff accepts that where damages are based on the available market rule, the assessment of damages takes place at or about the time of the breach and what happens subsequent to the breach is irrelevant. In this respect, it is worth citing para 26-117 ofChitty on ContractsVol 1 (30thEd, Sweet & Maxwell) which indicates that a benefit obtained by the innocent party after the date of the breach is usually ignored in the assessment of damages: Benefits independent of mitigation. Where a seller of goods chooses not to resell upon the date of the buyer’s breach (which is the normal date when his duty to mitigate must be tested) but retains the goods for some time and resells at a gain when the market price later rises, the benefit to the claimant does not arise from any act of mitigation and is irrelevant in assessing damages. The seller could not have made the buyer liable for additional loss had the market price fallen after the date of the breach, so he is entitled to the gain when the market price happens to rise after that date. The decision to retain the goods was an independent speculation by the seller. … Even where a benefit to the claimant arises in the course of his mitigating action, there may not be a sufficient causal connection between the defendant’s breach and that benefit to justify taking it into account in assessing the claimant’s damages. 72     The plaintiff also accepts that subsequent benefits are irrelevant in what it has termed the “Determinable Value Scenario” arising under s 50(2) but distinguishes this situation from what it has termed the “Actual Loss Scenario”. In the latter case, the plaintiff contends that subsequent benefits have to be accounted for in the assessment of damages. The plaintiff seems to be arguing that there are two ways of claiming damages under s 50(2). I do not accept this. There is only one measure of damages under s 50(2) and that is the “estimated loss directly and naturally arising” from the breach. According to case authority, this means the difference between the contract price of the goods and the value of the goods to the claimant at the date of the breach. See for exampleHarlow & Jones Ltd v Panex (International) Ltd[1967] 2 LLR 509(“Harlow & Jones”), a case relied on by the plaintiff as well. What the value of the goods are to the claimant is a matter of evidence and this may be established by the price of the goods when they are ultimately resold even if the resale does not take place immediately after the breach or on exactly the same terms as the contract that was breached. InHarlow & Jonesitself, as at the date of the breach (30 September), the goods were found to be for all practical purposes unsaleable at any realistic price. A portion of the goods was eventually resold in January of the following year and the balance was taken back at cost by the supplier. In respect of the portion that was resold, Roskill J awarded the seller the difference between the contract price and the resale price as representing the value of the goods at the date of breach and, in respect of the portion that was taken back by the supplier, he awarded the seller its loss of profit being the difference between the supplier’s cost price and the price under the contract. 73     That the value of the goods to the seller at the date of the breach may be established by the resale price even though that price is fixed some time thereafter is also shown in the case ofAlton House Garages v Marleywood Marine[1983] QB (5 July 1983). The defendant in that case had entered into a contract to sell a specially fitted boat to the plaintiff. The plaintiff defaulted at the end of July. The defendant mitigated his loss and sold the boat to another purchaser at a lower price in September of the same year. Webster J held that there was no available market for specially fitted boats and in addressing the issue of damages stated: I am satisfied that there was in July 1980 no available market for the boat within the meaning of that expression in that subsection, nor any relevant market or current price for it. Each of these boats is individually built … this boat was, therefore, in a sense, a unique article and certainly not one for which there could be said to be a market or current price at the time when the Plaintiffs ought to have accepted the goods, namely, in about July 1980. In these circumstances, the measure of damages is represented by the difference between the contract price and the value of the boat in the Defendants’ hands (see Harlow v. Jones, Ltd. v. Panex (International), Ltd., [1967] 2 Lloyds’ Rep 509, at page 530, per Mr Justice Roskill, as he then was). Prima facie, the value of the boat in the Defendants’ hands is the price at which they sold it, provided that, in doing so, they acted reasonably so as to obtain the best possible price. 74     It can be seen from the two authorities cited that under s 50(2), the relevant date for the assessment of damages is the date of the breach although in assessing what the value of the goods are at that date the court may have recourse to the resale price of the goods even though the resale took place some time after the breach. The cases did not distinguish in any way between a claim based on “Determinable Value Scenario” and one based on an “Actual Loss Scenario” and it is also notable that in both cases what the claimant ended up receiving could as well have been described as his actual loss as it could have been described as the determinable value of the goods concerned. I therefore consider that the plaintiff sought to draw an incorrect distinction between two types of cases which are actually one and the same. 75     I do not think that theLazenby GaragesandGolden Straitcases are of much assistance to the plaintiff. InLazenby Garages, the plaintiffs were dealers in new and second-hand cars. On 19 February, the defendant agreed to buy a second-hand car from them but the next day, he indicated that he did not wish to proceed with the purchase. Some six weeks later, the plaintiffs sold the same car to someone else for £100 more than the price they had agreed with the defendant. Despite that, they claimed damages from the defendant for “loss of profit” being the difference between the cost of the car to them and the price agreed with the defendant. The Court of Appeal held that there was no available market for the second-hand car and therefore damages had to be assessed by virtue of s 50(2) of the English Sale of Goods Act 1893 (which is the same as s 50(2) of SOGA) and since the plaintiffs had sold the very same car at a higher price, they had suffered no loss and could not recover any damages. Denning  LJ explained the decision as follows at p 462: The cases show that if there are a number of new cars, all exactly of the same kind, available for sale, and the dealers can prove that they sold one car less than they otherwise would have done, they would be entitled to damages amounting to their loss of profit on the one car …But it is entirely different in the case of a secondhand car. Each secondhand car is different from the next, even though it is the same make. …In the circumstances the cases about new cars do not apply. We have simply to apply to section 50 of the Sale of Goods Act 1893. There is no “available market” for secondhand cars. So it is not subsection (3) but subsection (2). The measure of damages is the estimated loss resulting directly and naturally in the ordinary course of events from the buyer’s breach of contract. That throws us back to the test of what could reasonably be expected to be in the contemplation of the parties as a natural consequence of the breach. The buyer in this case could not have contemplated that the dealer would sell one car less. At most he would contemplate that, if they resold this very car at a lower price, they would suffer by reason of that lower price and should recover the difference. But if they resold this very car at a higher price, they would suffer no loss. In other words, what the judge was saying in effect was that the evidence showed that at the date of the breach, the value to the plaintiffs of the second-hand car that the defendant had contracted to buy was at least the same as the contractual sale price. As shown by the subsequent sale, the price was not adversely affected by the breach or any other circumstances existing at the date of the breach and since this was a unique item which the plaintiffs subsequently managed to sell at the same or a higher value, they suffered no loss. Of course if the subsequent sale had taken place much later, the plaintiffs may have had a claim for loss of interest or storage cost or some other expenses incurred because of the delay in realising a profit on this particular second-hand car. The circumstances inLazenby Garagesdid not relate to a subsequent benefit obtained by the plaintiffs. 76     The factual situation that led to theGolden Straitcase was considerably more complicated. It arose out of a charterparty dispute. In July 1998, the shipowners chartered their vessel to the charterers for seven years. Clause 33 of the charterparty provided that both parties should have the right to cancel the charter if war broke out. On 14 December 2001, the charterers repudiated the charter and on 17 December, the owners accepted the repudiation. They claimed damages and the matter was referred to arbitration. On 20 March 2003, war falling within cl 33 broke out. The arbitrator found that at 17 December 2001 a reasonably well-informed person would have considered war or large-scale hostilities within the meaning of clause 33 to be not inevitable or even probable but merely a possibility. On the question whether the owners were entitled to recover damages for the whole period from 17 December 2001 to 6 December 2005, which he found to be the earliest date for contractual redelivery of the vessel, or whether the damages recoverable were limited to the period to 20 March 2003, he decided in favour of the charterers that they were so limited. His decision was upheld by the House of Lords by a majority. 77     The question before the House was whether the damages should be assessed as at the date of the breach (in this case the date of repudiation of the charterparty) or whether the court should have regard to what had actually happened subsequent to the breach. The majority held that the principle that damages should be assessed as at the date of the breach was not inflexible and the desirability of achieving certainty in commercial contracts was subject to the overriding compensatory principle that the damages awarded should represent no more than the value of the contractual benefits of which the claimant had been deprived and therefore where at the date of assessment an event had already happened which would have terminated the contract had it still been afoot, the court should have regard to what actually occurred. In this case, since the event entitling the charterers to terminate the charterparty under cl 33 had happened before the damages had been assessed and the owners’ right to receive the hire rate and profit share provided for by the charterparty would thereby had been brought to an end, the owners were not entitled to damages in respect of the period thereafter. It should be noted that there was a strong dissent by Lord Bingham who considered that the general rule of English law that damages for breach of contract that are assessed as at the date of the breach should be followed in this case and that the subsequent outbreak of war should have been ignored in the assessment of damages. 78     In my judgment, the principles accepted by the majority in theGolden Straitcase do not apply in the present instance. The facts of that case were very different. The contract in that case had provided for obligations to be performed over a period of time. It was not, as here, a question of a one-off sale and delivery. Secondly, the contract contained a specific provision providing for early termination on the occurrence of certain events. There was no such equivalent provision in this case. At the time of their premature termination of the charter party inGolden Strait, the charterers still had four years of contractual obligations to perform. In assessing damages therefore, the question that arose was what would have been lost over such a lengthy period bearing in mind the event that had happened, an event which had been contemplated in the contract. Lord Carswell, one of the judges in the majority, observed at[60]of his judgment that the cases cited by Lord Bingham: are in complete accord with the principle of measuring the loss at a date as near as practicable to the acceptance of the repudiation. In none of these cases was there any suspensive condition which might come into operation, and they each reaffirm the standard rule of crystallisation, which is undoubtedly correct. Thus, it was critical to the decision inGolden Straitthat a “suspensive condition” existed in the charterparty and it was that condition that influenced the judges not to apply in this case the standard rule of crystallisation of damages at the date of the breach. 79     It should also be noted that as far as the sale of the goods on a one-off basis was concerned, the judges in the majority recognised that the position was very different in relation to the strength of the rule that damages should be assessed as at the date of the breach. Lord Scott of Foscote (a member of the majority) observed at[34]of his judgment: 34The assessment at the date of breach rule is particularly apt to cater for cases where a contract for the sale of goods in respect of which there is a market has been repudiated. The loss caused by the breach to the seller or the buyer, as the case may be, can be measured by the difference between the contract price and the market price at the time of the breach. The seller can re-sell his goods in the market. The buyer can buy substitute goods in the market. Thereby the loss caused by the breach can be fixed. But even here some period must usually be allowed to enable the necessary arrangements for the substitute sale or purchase to be made: see, egKaines (UK) Ltd v Osterreichsche Warrenhandelsgesellschaft[1993] 2 Lloyd’s Rep I. The relevant market price for the purpose of assessing the quantum of the recoverable loss will be the market price at the expiration of that period.35    In cases, however, where the contract for sale of goods is not simply a contract for a one-off sale, but is a contract for the supply of goods over some specific period, the application of the general rule may not be in the least apt. … [Emphasis added.] 80     Thus, in my judgment, when a court or an arbitral tribunal is called upon to assess damages under s 50(2) of SOGA in the case of a one-off contract for sale of goods, it has to have regard to the value of the goods to the seller as at the date of the breach and in determining that value at the date of the breach, it can have regard to re-sales which take place within a reasonable period thereafter. Once the value has been established, the damages are crystallised and what happens thereafter will not, save in the most exceptional circumstances, affect the measure of damages. In using the term “exceptional circumstances”, I am referring to the rare situation illustrated by the case ofR. Pagnan & Fratelli v Corbisa Industrial Agropacuaria Limitada[1970] WLR 1306 where the conduct of the plaintiff buyer after the defendant seller had breached the contract of sale by tendering damaged goods was reprehensible. There, the buyer rejected the goods in the confident expectation that as a result of the rejection and a sequestration order it had obtained against the goods, it would be able to negotiate a new agreement under which it would acquire the goods at a price favourable to itself. This it did and made a profit that exceeded the difference between the original contract price and the prevailing market price. The buyer then sought to recover damages for the seller’s breach and this claim was rejected on the basis that if the situation was looked at as a whole, the buyers, notwithstanding the seller’s breach, had made a profit and no loss. The crucial point in the case was the fact that the subsequent transaction that gave rise to the buyers’ profit was part of a continuous chain and not independent of or disconnected with the original breach. Thus, there was a need to take the subsequent gain into account in assessing the damages. 81     The discussion above establishes that legally, in a case like the present, damages would be fixed as at the date of the breach and further loss or gain sustained by the innocent party subsequently would be irrelevant to the calculation of the damages. In this case, it was purely fortuitous that Terapanth’s breach of contract enabled the defendant to probably get a higher price for the 4,000 plus metric tonnes of cargo that Terapanth refused to lift in July 2005. When Terapanth breached its contract, the price could very well have fallen even further but the defendant would not have been able to claim that additional loss from the plaintiff as the Terapanth transaction was entirely independent of the contract between the plaintiff and the defendant and therefore the loss arising from Terapanth’s breach could not be laid at the plaintiff’s door. The same goes for the gain that Terapanth’s breach enabled the defendant to make. 82     Since Terapanth’s breach of contract was legally immaterial to the damages suffered by the plaintiff as a result of the defendant’s breach, it was not fraudulent or wrongful in any way for the defendant to end the evidence that it placed in the arbitration at the point that it did. It was not necessary for the assessment that the defendant reveal that Terapanth had eventually not picked up the balance of the cargo and it had refunded most of the overpayment to Terapanth. In my judgment, the quantum awarded was not procured by fraud or unconscionable conduct. 83     The plaintiff had contended that the Arbitrator had made his finding on quantum on the basis of actual loss suffered. However, the Award need not be interpreted in that manner, notwithstanding that the defendant had indeed pitched its argument that way. 84     The Arbitrator had found on the evidence before him that in April 2005 there was no available market either in China or in India for the cargo. The consequence of this finding was that the assessment of damages in the arbitration fell to be decided in accordance with the provisions of s 50(2) and the relevant date for this determination was the date of the breach. In considering the value of the cargo to the defendant at that date, the Arbitrator was entitled to look at all available evidence including the evidence of the re-sales made by the defendant to Terapanth and Susmi in June 2005. The Arbitrator was, it is clear from the Award, fully aware of the provisions of s 50 of SOGA. He did not refer in so many words to s 50(2) itself which required him to assess damages on the basis of the damage to the defendant that naturally and directly resulted from the plaintiff’s breach. That does not mean, however, that in awarding the defendant US$1,201,609.20 he did not consider that this sum was the damage to the defendant that naturally and directly resulted from the plaintiff’s breach of contract. It is worth remembering that the only evidence on the value of the cargo to the defendant that was before the Arbitrator related to these re-sale prices. The plaintiff did not offer any evidence of its own on what value this cargo had in the absence of an available market. It did not put a single question to Mr Rajasekar on the issue of damages. It concentrated on arguing that there was an available market at Karwar port in April 2005 and that the correct price to be used was the export price for goods shipped from that port. Once that argument failed, the only evidence that the Arbitrator could use to establish the damage was that of the re-sales. InHarlow & Jones, Roskill J noted that the sellers there had “hawked” the goods for four months around the world before achieving a resale of part of them, but he still used the resale price as evidence of the value of the (resold) goods to the seller as at the date of the breach as part of his exercise in assessing damages under s 50(2). Similarly, what the Arbitrator did here, however he expressed it, could be regarded as an assessment of damages in accordance with s 50(2). Even if the Arbitrator had been wrong in the way that he assessed the damages, that would be an error of law that would not be subject to the review of this court. What is important is that the defendant did not mislead the Arbitrator in relation to the assessment exercise. The facts and documents that the defendant did not disclose had no relevance to that exercise.",
        "Conclusion": "85     In the event, the application must be dismissed with costs to the defendant."
    }
}