{
    "case_title": "Jeffery bin Abdullah v Public Prosecutor",
    "ncitation": "[2009] SGHC 68",
    "coram": "Chan Sek Keong CJ",
    "sections": {
        "Introduction": "1       This was an appeal by the appellant, Jeffery bin Abdullah, against the sentences imposed on him by the district judge (“the DJ”) for two offences under the Misuse of Drugs Act (Cap 185, 2001 Rev Ed) (“MDA”), namely: (a)     joint possession of 0.43g of diamorphine for the purpose of trafficking under s 5(1)(a) read with s 5(2) of the MDA and s 34 of the Penal Code (Cap 224, 1985 Rev Ed), which is punishable under s 33 of the MDA; and (b)     possession of 0.41g of diamorphine under s 8(a) of the MDA, which is also punishable under s 33 of the MDA. The appellant pleaded guilty and was sentenced to seven years’ imprisonment and seven strokes of the cane for the first offence and 12 months’ imprisonment for the second offence, the sentences to run concurrently (seePP v Jeffery Bin Abdullah[2008] SGDC 139(“the GD”)). One other charge was taken into consideration for sentencing purposes,viz, one charge of possession of a Class A controlled drug under s 8(a) of the MDA, an offence punishable under s 33 of the MDA. 2       The main thrust of the appellant’s appeal was that the sentence for the first offence was manifestly excessive as his accomplice, one Sophian bin Abu Talib (“Sophian”), had received a lower sentence of five years and nine months’ imprisonment and six strokes of the cane for the same offence. 3       After hearing the arguments of both parties, I was of the view that the sentence imposed on the appellant in relation to the first offence was not manifestly excessive, even though it was higher than the sentence meted out to Sophian for the same offence. In any case, I was of the view that since the total sentence imposed on Sophian for all the offences which he had committed (arising out of or in relation to the same incident) was six years and ten months of imprisonment and nine strokes of the cane, there was no basis for the appellant to complain that his total sentence of seven years’ imprisonment and seven strokes of the cane was manifestly excessive. Accordingly, I dismissed the appeal. I now give the reasons for my decision.",
        "The facts": "4       On 28 July 2007 at around 2.25am, a party of Central Narcotics Bureau (“CNB”) officers, with the assistance of the Traffic Police, arrested the appellant and Sophian, a cargo delivery driver. Prior to the arrest, the officers had embarked on a four-hour-long vehicle pursuit of the appellant and Sophian, who were in a motor lorry driven by Sophian. The chase began after the appellant had purchased packets of heroin at East Coast Road. During the chase at around 1.10am, while the lorry was travelling along Ayer Rajah Expressway, the appellant tore open two plastic packets and threw the contents out of the lorry before throwing the empty packets out as well. Both empty packets were recovered by CNB officers and seized as exhibits. 5       When the motor lorry ran low on fuel, the appellant and Sophian abandoned it and fled in different directions. Both men put up a violent struggle before necessary force was used to arrest them. CNB officers searched the appellant and recovered a packet containing a granular substance in the sling bag he was carrying. At about 3.20am, a search of the lorry was conducted in the presence of the appellant and Sophian. Another packet of granular substance (to which the appellant admitted ownership) was also recovered behind the passenger seat of the motor lorry. Both packets were seized as exhibits. 6       The exhibits were sent to the Health Sciences Authority (“HSA”) which issued certificates confirming that the two packets seized from the appellant’s sling bag and the passenger seat of the motor lorry contained 0.41g and 0.43g of diamorphine respectively. The HSA also certified that the two empty packets were stained with diamorphine. The appellant admitted that he had only intended to keep one of the packets of diamorphine (the one found in his sling bag) which he had purchased from the suppliers for his own use while the remaining packets were meant to be sold at around $310 or $320 per packet. Therefore, the diamorphine in the packet found in the motor lorry and the two emptied packets were for the purpose of trafficking.",
        "This court’s decision": "",
        "Examination of the appellant’s sentence in isolation": "7       Before considering whether the DJ took into account the principle of parity in sentencing the appellant and Sophian, I shall first consider whether the seven years’ custodial sentence imposed on the appellant was manifestly excessive. The sentencing factors that are generally relevant in relation to the offence of trafficking are (seeSentencing Practice in the Subordinate Courts(LexisNexis, 2nd Ed, 2003) at pp 638–639):  (a)     the quantity of the drug in the possession of the offender;   (b)     the type of drug;   (c)     the duration and sophistication in planning and carrying out the offence; and   (d)     the relative levels of participation in relation to the accomplices.  8       The following sentencing precedents for drug trafficking in diamorphine were also relevant:  CaseSentenceBrief factsOng Kee Kwok vPPMagistrate’sAppeal No 498of 1992(“Ong Kee Kwok”)7 years’imprisonment and5 strokes of the canePossession for purpose of trafficking0.81gofdiamorphine. Possession charge taken intoconsideration. Pleaded guilty.Had drug antecedents.RangasamyBalasubramaniam vPP[2000] SGDC 56(“Rangasamy”)7 years’imprisonment and6 strokes of the canePossession for purpose of trafficking0.29gofdiamorphine. Two charges for failing to reportfor urine tests taken into consideration.Pleaded guilty. Had drug antecedents.Sim Kim Yea v PP[1995] SGDC 28 years’imprisonmentPossession for purpose of trafficking3.36gofdiamorphine. Pleaded guilty. Had been admittedto drug rehabilitation centre on five occasions.No caning because offender was female.Lur Choo Lai v PP[1992] SGDC 16 years’imprisonment and9 strokes of the canePossession for purpose of trafficking2.45gofdiamorphine. Possession charge taken intoconsideration. Pleaded guilty. First offender.Rozie bin Ahmad v PP[2001] SGDC 2867 years’imprisonment and8 strokes of the caneTrafficking by giving2.88gof diamorphine.Claimed trial. Had drug antecedents. 9       The precedents outlined above, while not uniform, set a range of sentences of between six and eight years of imprisonment and between five and eight strokes of the cane. Comparing the present sentence of seven years’ imprisonment and seven strokes of the cane with these precedents, it could not be said that the appellant’s sentence was manifestly excessive. While some offenders, like the accused inOng Kee Kwok, might have been sentenced to seven years’ imprisonment for trafficking in higher quantities of diamorphine (0.81g compared to 0.43g), there were also cases likeRangasamywhere the accused was sentenced to seven years’ imprisonment for trafficking in a lower quantity of diamorphine (0.29g). I also took into account the fact that the first offence involved not just the 0.43g of diamorphine seized but also included the two empty packets stained with diamorphine which the appellant had thrown out of the motor lorry. There certainly was diamorphine in these two packets before they were emptied out. If each packet contained the same amount of diamorphine as those recovered by the CNB, the appellant would have been in possession of more diamorphine than the accused inOng Kee Kwok(1.29g compared to 0.81g). 10     The appellant pointed out that the offenders inOng Kee KwokandRangasamyhad drug antecedents which warranted the higher sentences imposed in those cases, while he was a first-time offender. However, I noted that there were aggravating factors in his case which were not present inOng Kee KwokorRangasamy. One clear example was that the appellant and Sophian had led the CNB and Traffic Police officers on a four-hour-long vehicle chase, and had put up a violent struggle thereafter to resist arrest. The appellant was also more culpable than Sophian in one respect in that he had thrown out the contents of the two packets during the vehicle chase to avoid being found to be in unlawful possession of a higher quantity of diamorphine. Therefore, the fact that his prison sentence was 15 months longer than Sophian’s prison sentence of five years and nine months was justifiable by his greater culpability in relation to the joint trafficking offence. This is not a case of inconsistency in sentencing. Ultimately, the principle that similar sentences must be imposed for similar offences and offenders is subject to the principle that each case must depend on its own facts (seeTeo Kian Leong v PP[2002] 1 SLR 147at [45]).",
        "The appellant’s sentence in the light of his accomplice’s sentence": "11     The next question is whether the principle of parity in sentencing was breached in this case and, if so, whether it was justified. InPP v Ramlee[1998] 3 SLR 539, Yong Pung How CJ held that the parity principle should be applied even though the sentences by themselves were not manifestly excessive. Yong CJ stated at[7]that: Where two or more offenders are to be sentenced for participation in the same offence, the sentences passed on them should be the same, unless there is a relevant difference in their responsibility for the offence or their personal circumstances: seeArchbold(1998), para 5-153. An offender who has received a sentence that is significantly more severe than has been imposed on his accomplice, and there being no reason for the differentiation, is a ground of appeal if the disparity is serious. This is even where the sentences viewed in isolation are not considered manifestly excessive: seeR v Walsh(1980) 2 Cr App R (S) 224. InR v Fawcett(1983) 5 Cr App R (S) 158, Lawton LJ held that the test was whether ‘right-thinking members of the public, with full knowledge of the relevant facts and circumstances, learning of this sentence [would] consider that something had gone wrong with the administration of justice?’ 12     I agree with this statement of principle. However, where the offenders did not play the same roles in the commission of the crimes and have different degrees of culpability, the parity principle is not applicable (seeOng Tiong Poh v PP[1998] 2 SLR 853at [29]–[30]). 13     In the present case, it is clear that the DJ did direct his mind to the principle of parity of sentences and decided to impose a higher custodial sentence on the appellant because he had played a “much greater and important role” in the commission of the offence than his accomplice (at[10]of the GD). The DJ’s finding of fact was fully supported by paras 5 and 14 of the agreed statement of facts, which state as follows: 5    During the chase, … as the said lorry was being chased along the Ayer Rajah Expressway (AYE),theaccused had torn and disposedof the contents of two plastic packets out of the lorry window, before the emptied plastic packets were flung out of the lorry’s window. The said two packets were subsequently recovered by SSgt Michael Seet of CNB … … 14    In the course of investigations,theaccused admittedthat he only intended to keep one of thepackets of heroin he purchasedfrom the suppliers for his own consumption, and he identified the packet found in the sling bag (“JA-1”) to be for this purpose. He disclosed that theremaining packets which he purchased, were meant to be soldat around $310 or $320 per packet. [emphasis added in italics and bold italics] 14     This was a case where the DJ had taken into consideration all the relevant facts and circumstances in sentencing the appellant, who deserved a higher custodial sentence. For this reason, this court had no basis to interfere with the sentence imposed by the DJ.",
        "The one-transaction rule and the totality principle": "15     At this juncture, it is desirable that I articulate a sentencing principle which, in my view, should apply to a case like the present, where an offender is charged with a series of offences arising from the same incident, but which are not regarded as falling within the one-transaction rule. In cases where an offender is convicted of more than one offence at the same trial, two sentencing principles may be involved, namely, the one-transaction rule and the totality principle. The one-transaction rule may be stated shortly: Where two or more offences are committed in the course of a single transaction, all sentences in respect of these offences should be concurrent rather than consecutive (seeKanagasuntharam v PP[1992] 1 SLR 81(“Kanagasuntharam”) at 83,[5]). As for the totality principle, the Court of Appeal inKanagasuntharamadopted (at 84–85,[13]) the explanation of the principle as stated in D A Thomas,Principles of Sentencing(Heinemann, 2nd Ed, 1979) at pp 57–58 as follows: [T]he principle has two limbs. A cumulative sentence may offend the totality principle if the aggregate sentence is substantially above the normal level of sentences for the most serious of the individual offences involved, or if its effect is to impose on the offender ‘a crushing sentence’ not in keeping with his record and prospects. 16     In my view, in cases where an offender is sentenced for several offences arising out of one incident and he appeals against his sentence, the appeal court may apply a third principle of punishment. This principle gives effect to the commonsensical position that, where an offender is convicted of various offences arising from what is essentiallyone incident, his overall sentence should reflect his role and culpability in the incident as awhole. This principle draws from both the one-transaction rule and the totality principle, as all three principles share the same underlying rationale,viz, proportionality in sentencing. InPP v Law Aik Meng[2007] 2 SLR 814, V K Rajah J alluded to this principle at [60]: It is axiomatic that the totality principle, not dissimilarly from its one-transaction counterpart, functions not as an inflexible rule, but rather as a helpful guideline toremind the court that the correlation of the sentence to the gravity of the offender’s conduct and offences is of critical importance. In short, sentences must berestrained by the principle of proportionality. [emphasis added] The proportionality principle requires that the overall sentence imposed on an offender should be based on his total culpability in the various offences committed, when viewed as a whole. 17     In the present case, the total imprisonment term received by the appellant was seven years. In relation to the same incident, Sophian received a total imprisonment term of six years and ten months. This was merely two months shy of the total imprisonment term imposed on the appellant. However, it should be noted that Sophian received a total of nine strokes of the cane, two more than the appellant. This would make Sophian’s punishment actually more severe, if the corporal punishment is accounted for in his total punishment. 18     In relation to his driving of the lorry, Sophian was charged and convicted under the Road Traffic Act (Cap 276, 2004 Rev Ed), the MDA, and s 336 of the Penal Code. The appellant did not have to face such a charge, but he had attempted to get rid of incriminating evidence, which is an offence under s 201 of the Penal Code, and, in fact, took steps to cover up the true amount of diamorphine that he was actually in illegal possession of. In my view, it was entirely proper for the DJ to take this factor into account and to sentence the appellant to a longer term of imprisonment than Sophian for the joint trafficking charge.",
        "Conclusion": "19     The appeal was therefore dismissed for the above reasons."
    }
}