{
    "case_title": "Yip Holdings Pte Ltd v Asia Link Marine Industries Pte Ltd",
    "ncitation": "[2009] SGHC 136",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "2       The plaintiff is a Singapore company incorporated in October 1990 and is in the shipping business. It owns a number of vessels including tugboats and barges as well as heavy equipment such as winches and cranes. The company’s managing-director and major shareholder is Yip Fook Chong who is also known as Ronald Yip (“Yip”). 3       The defendant was incorporated in 1995 and its business is in shipbuilding and repairs. One of its two directors and shareholders is Lim Seong Ong (“Lim”) who is also known as Kenny Lim. The defendant’s shipyard is located at No. 17 Tuas Crescent, Singapore (“the yard”). 4       Yip had business dealings with a company called John Holland Construction (Philippines) Inc. (“JH”) for many years. In 1997, JH purchased two pieces of equipmentviz MakeSerial numberModelNew American hoist9280GS 11952New American hoist9280GS 12666 (the crane) (collectively “the cranes”) for which it entered into leasing arrangements with a leasing company in Singapore called Caterpillar Financial Services Corporation (“Caterpillar”). The cranes were subsequently loaded onto the plaintiff’s barges and towed to Mauban City, Quezon Province, Philippines, for use by JH in its project there. 5       After JH had completed its project, its equipment was loaded onto the plaintiff’s barges and brought back to Singapore. In August 2000, JH ceased business and closed its office without settling the debt owed to the plaintiff for the towage job (in[4]above) which it had agreed to pay by instalments. 6       The plaintiff sued JH in the Philippines for the sum it was owed of S$1.4m. It obtained judgment from the Philippines court in November 2000 and levied execution on its judgment. As part satisfaction of the judgment debt, the plaintiff secured all the equipment that was kept in the storage yard of JH in Tiaong City in the Philippines including the cranes. 7       However, the plaintiff discovered that JH had not paid Caterpillar for the full purchase price of the two cranes. The plaintiff agreed to and did buy over the cranes from Caterpillar. The sale and purchase transaction was completed in September 2005. 8       From 1999 onwards, the plaintiff and the defendant had an existing arrangement whereby the defendant would allow the plaintiff to store equipment at the yard in return for payment of a monthly rent. It was agreed between the parties that the defendant could move the plaintiff’s equipment to other locations within the yard so that the defendant could utilise its space more efficiently. The shifting of the plaintiff’s equipment was done by the defendant using big forklifts. One piece of equipment stored at the yard which belonged to the plaintiff was a 150 ton Manitowoc crawler crane model 40055 (“the Manitowoc”). Occasionally, when the defendant wanted to move the Manitowoc to another location in the yard, it would use its subcontractor Soon Marine Services (“SMS”) to drive the Manitowoc. 9       In June 2002, the plaintiff sent its tugboat and barge to Tiaong City to load and bring back to Singapore the crane as well as 6-7 pieces of other equipment. The equipment came back to Singapore and was unloaded by SMS at the yard. From June 2002 onwards, the plaintiff paid an increased rental of $3,000 a month to the defendant. 10     Between June 2002 and November 2003, the plaintiff sold some of its equipment in the yard and the rental was reduced to $2,500 per month. In August 2004, after it had sold more equipment, the defendant reduced the rental further to $1,890 per month as only the crane and the Manitowoc remained in the yard. Occasionally, the defendant would hire the plaintiff’s barges and/or tugboats for the defendant’s work in Vietnam. In that event, the rental due from the plaintiff would be offset against hire charges due from the defendant. As at end December 2005, the plaintiff owed the defendant $49,350 under the setoff arrangement. 11     In June 2005, one George Lim (‘George”) the managing-director of a company called Lien Hoe Leong & Brothers Pte Ltd expressed an interest in buying the Manitowoc from the plaintiff. After negotiations, the price of the Manitowoc was agreed at $250,000. However, no deposit was paid by George and Yip treated the sale as aborted. 12     Yip subsequently learnt that Lim attempted to sell the Manitowoc to potential buyers from Batam, Indonesia, representing the defendant as the owner. When confronted by Yip, Lim admitted his mistake. In October or November 2005, Lim offered to buy the Manitowoc from the plaintiff at US$175,000. Lim said he needed the Manitowoc for a salvage operation. Yip countered that he had received an offer from Lien Hoe Leong & Brothers Pte Ltd of $250,000. Lim responded that the plaintiff still owed the defendant about $50,000 for outstanding rental. Yip counter-proposed that the defendant pay $200,000 for the Manitowoc after deducting all outstanding rental owed by the plaintiff. 13     A few days later, Yip agreed to give a discount to the defendant on the price of the Manitowoc; he asked for $188,000 net of all deductions of outstanding rental. Yip told Lim he required a deposit of 50% of the sale price in the form of a cash cheque. As Yip was leaving for the Philippines in the first week of December 2005, he requested that the cash cheque be handed over to a mutual friend Steven Chua (“Chua”) of SMS (in[8]above). Only then would the defendant be allowed to remove the Manitowoc for its salvage job. 14     Lim requested an invoice for the transaction. As Yip was leaving for the Philippines in the first week of December 2005, he prepared an invoice (at 1AB23) together with a covering letter both dated 5 December 2005 and handed the documents to a member of the defendant’s staff on 6 December 2005. Yip left for Manila on the morning of 6 December 2005. 15     The defendant handed a cash cheque for $90,000 to Steven Chua on 15 December 2005 which cheque was cleared when presented for payment. After his return from the Philippines, Yip received another cheque for $20,000 from the defendant in January-February 2006 but the cheque was dishonoured when presented for payment for the reason “account closed”. 16     When Yip approached Lim in March 2006 for the then outstanding payment of $98,000 (“the outstanding sum”) on the Manitowoc, Lim admitted the defendant’s bank account had been closed due to cash flow problems. However, he assured Yip that the defendant’s salvage project was still on-going and he said he would try to find funds to pay the plaintiff personally. 17     After the Manitowoc was sold, the rental payable by the plaintiff to the defendant from January 2006 onwards was reduced to $945 per month as evidenced in the defendant’s invoices (at 1AB24-30) and statement of account to the plaintiff (at 1AB32). 18     In the third quarter of 2005, Lim informed Yip that the transmission and main engine of the crane had been damaged. Yip inspected the crane and discovered that the transmission was missing while the main engine could not be started. Yip consulted the defendant’s recommended mechanic from Haruki Machinery Pte Ltd (“Haruki”) who gave him a quotation of US$29,000 for a rebuilt transmission from the United States (“the States”). Yip was told that the torque converter was damaged and it could not be repaired in Singapore. As he was going to the States for his daughter’s graduation, Yip decided he would buy a torque converter from a States supplier which he did. The same cost him US$9,000 and he brought it back to Singapore when he returned from the States. He then handed the item to Lim for repair of the crane; Lim told Yip to pass it to Haruki which Yip did. 19     Between March 2006 and January 2007, Yip made a point of calling Lim periodically to ask for the outstanding sum. Although Lim assured Yip that it was “no problem” and that he would deposit the payment directly into the plaintiff’s bank account, Yip found no such payment when he checked the plaintiff’s bank account. 20     Subsequently, Yip learnt from George that it was the partner of George in their Batam shipyard who had bought the Manitowoc from the defendant and that the Batam shipyard had already paid the defendant in full for the Manitowoc. Yip wanted to confront Lim on the issue but the latter refused to meet or discuss with him. Thereafter, the relationship between Yip and Lim deteriorated. 21     Yip realised that Lim had purchased the Manitowoc on the defendant’s behalf for resale to a third party using the excuse that he (Lim) needed it for a salvage operation. Lim had also used the salvage operation as an excuse for the defendant’s cash flow problem and failure to pay the plaintiff the outstanding sum. Yip suspected that Lim had diverted the defendant’s funds to fund the defendant’s contracts from Keppel Corporation for steel fabrication works which the defendant obtained in early January 2006. 22     On 26 December 2006, Lim telephoned Yip to say that the defendant needed the space occupied by the crane for the defendant’s own works. He requested the plaintiff to move the crane out of the yard by 2 January 2007. Yip said that he could not move the crane as it was not yet repaired by Haruki. Moreover, at such short notice, it would be impossible to find a company that was willing to work during the New Year holiday period. As it turned out, Yip could not find anyone who could move the crane for the period 27 December 2006 to 2 January 2007. Lim reminded him on 13 February 2007 to remove the crane. 23     On 13 February 2007, the defendant’s other director Roland Lim (“Roland”) requested a meeting (“the meeting”) with Yip to resolve the dispute on the outstanding sum. Roland was accompanied by Chua from SMS (at[13]above). At the meeting, Roland submitted to Yip a handwritten record of payments (“the statement”) that the defendant had purportedly made to the plaintiff for the Manitowoc. The statement (see 1AB33) stated: Record of payment Asia Link Marine Paid to Yip Holdings Cheq noDateAmountOCBC 43379115/12/05$90,000.00BOC 91112131/12/05$ 5,000.00BOC 91112431/12/05$15,000.00BOC 45955028/02/06$20,000.00Total paid:$130,000.00 24     Yip informed Roland that apart from the first OCBC cheque no. 433791 he had not received the three other payments. Roland requested Yip to check his personal bank account in case the cheques were issued to Yip personally. Yip did and ascertained that the fourth cheque BOC 459550 for $20,000 was deposited into his personal account with United Overseas Bank (“UOB”) but not the two BOC cheques nos. 911121 and 911124. 25     Yip drew to Roland’s attention that the defendant’s statement of account (see 1AB32) dated 19 January 2007 (“the January statement”) showing that the plaintiff owed the defendant $61,635 as rental charges for the period 23 April 2004 to 1 January 2007 was incorrect. He pointed out that the defendant paid the plaintiff $90,000 on 15 December 2005 at which time the outstanding rental was $49,350 which sum should be fully deducted as part-payment for the Manitowoc. There should therefore have been a zero balance as of 31 December 2005 for rental charges and, commencing from January 2006, the monthly rental charges should have been $945. Therefore, for 13 months from 1 January 2006 to 31 July 2007 the total rental should be $12,285 ($945 x 13). In the statement, the defendant had charged the plaintiff $1,890 rent for the months of October 2006 and January 2007. 26     At the bottom of the statement, the following handwritten note was scribbled: Crane $175,000-$130,000 (paid) = balance $45,000 (outstanding) Yip Holdings Pte Ltd paid Asia $16,635. Yip pointed out that the plaintiff did not actually pay the defendant $16,635. The sum was set-off against outstanding rental due from the plaintiff to the defendant. He further disagreed with the defendant’s calculations as the agreed price of the Manitowoc was not $175,000 but $188,000. Further, the defendant had only paid $110,000 ($90,000 deposit + $20,000 paid into his UOB account) not $135,000 while the balance was $78,000 not $45,000. Consequently, the defendant still owed the plaintiff $78,000 on the price of $188,000. Less outstanding rental from 1 January 2006 to 31 July 2007 of $12,285, the net amount due and payable by the defendant should be $65,715 ($78,000 - $12,285). 27     The meeting concluded with an understanding that both Yip and Roland would check and confirm which disputed items in the January statement were correct. However, there was no follow-up to the meeting. 28     On 15 and 16 February 2007, Yip managed to get a company called Triple Gem International Pte Ltd (“Triple Gem”) to conduct a joint inspection of the crane. According to Triple Gem, they would need about 14 days to: (a) remove the crane’s components; (b) transport the crane’s components to its premises at No. 23 Shipyard Road and (c) reassemble the crane. 29     On 16 February 2007, Yip and Triple Gem’s representative (Chan Yeng Sum also known as Mikel Chan) met Lim at the yard’s car park. To their surprise, Lim confronted them, made nasty remarks and instructed the defendant’s guards at the guard house not to grant access to Triple Gem to remove the crane. Lim added that he would penalise the plaintiff $30,000 per day for late removal. 30     On the following day, Yip wrote a letter to the defendant marked for the attention of Lim and Roland. He informed them he had engaged Triple Gem to dismantle, remove and transport the crane out of the yard. He requested the defendant’s full cooperation to gain access to the yard noting that the defendant wanted to impose a daily penalty of $30,000 on the plaintiff. The defendant did not respond to the plaintiff’s letter until much later. 31     Between 17 February 2007 and 30 March 2007, Yip alleged that the defendant refused to allow the plaintiff to remove the crane from the yard. 32     Sometime in April 2007, Yip learnt that Lim had instructed Haruki to dismantle and remove the crane from the yard and transport it to Haruki’s premises at No. 48 Tuas Avenue 9 (“Haruki’s yard”). Haruki was tasked with repairing and reconditioning the crane to put it into working condition complete with a new re-spray of the entire crane. 33     On 3 May 2007, the plaintiff’s solicitors wrote to Haruki and to the defendant to demand that the crane be handed over to the plaintiff. Copies of both letters were extended to the Jurong Police station. 34     It was only then that Lim wrote to the plaintiff on 7 May 2007 to say that the crane had been moved by the defendant to Haruki’s yard on 18 April 2007 because of the plaintiff’s failure to do so despite two requests from the defendant. 35     The plaintiff’s solicitors wrote to the defendant on 28 May 2007 to say the latter had breached its obligations to safeguard the crane. Despite the plaintiff’s various efforts to recover the crane, the defendant refused to respond to the plaintiff’s requests to repair and reassemble the crane into working condition. 36     At the same time as the plaintiff/its solicitors were corresponding with the defendant, the plaintiff requested Haruki to give a list of replacements to put the crane into fully operational condition. The plaintiff was anxious to rebuild the crane as soon as possible so that it could rent it out or sell it off as at that time, the construction industry was booming in both Asia and the Middle East with a corresponding high demand for big heavy cranes. 37     Haruki did give the plaintiff an estimate but it failed to take any steps to rebuild the crane, leaving the crane’s components exposed to the elements. Notwithstanding Haruki’s inaction, Yip let the market know that the plaintiff had a 150 ton lifting capacity crane which was available for rent or sale. 38     Between 7 May 2007 and 7 December 2007, the plaintiff received inquiries from three interested parties either to buy or to rent the crane. One offer was from an Indian party (at US400,000), another from Malaysia (also at US$400,000) and the third offer was from Haruki itself whose offer was $300,000 on an “as is where is” basis. The first two interested parties required the crane to be repaired and rebuilt to its fully operational condition. Unfortunately, the plaintiff was unable to accept either the first or second offers (Yip rejected Haruki’s offer) because of Haruki’s inaction on the repair works. 39     Subsequently, Haruki renewed its offer to the plaintiff after the Malaysian buyer withdrew its offer. On 7 December 2008, the plaintiff’s solicitors received an offer from Haruki’s solicitors of $300,000 for the crane. The offer required the plaintiff as well as Yip to give an indemnity. Yip rejected the offer. 40     On 15 March 2008, Yip hired a private investigator to check the state of the crane at Haruki’s yard. The private investigator Darshan Singh (“DS”) from Goldeneye Investigation & Security Services Pte Ltd made a video recording of what he saw and was a witness for the plaintiff. DS reported that the crane was still in its dismantled state. 41     In a letter dated 10 April 2008 (at 1AB94-95) to the defendant’ solicitors, the plaintiff’s solicitors demanded compensation for the loss and damage caused by the defendant which included $300,000 for the cost of repair to the crane and loss of income at $36,000 per month. They proposed that the dispute be settled through mediation or arbitration. The defendant’s solicitors did not respond to the letter notwithstanding a reminder from the plaintiff’s solicitors dated 22 April 2008, indicating the plaintiff’s preference for arbitration of the dispute by the Singapore International Arbitration Centre. A further reminder from the plaintiff’s solicitors dated 11 June 2008 also went unheeded.",
        "The pleadings": "42     Consequently, the plaintiff filed its writ of summons on 11 June 2008. In the statement of claim, the plaintiff alleged that by its action in[31]to[35]above, the defendant had breached the rental contract and claimed its loss of $869,635 from the defendant comprising of: (a) cost of repair to the crane; (b) loss of rental income; (c) costs of recovery and reassembly and (d) miscellaneous costs of $9,000 for the torque converter and $6,635 for the balance price of the Manitowoc. 43     In the defence, the defendant admitted to the oral agreement for use of the yard by the plaintiff and did not dispute the terms alleged by the plaintiff as set out in[8]above. However, the defendant denied that its right to relocate the plaintiff’s equipment within the yard was on the basis that it would not cause damage to the equipment. It also denied that sometimes the defendant sought the plaintiff’s assistance to relocate the cranes and that the plaintiff obliged without charging the defendant. 44     The defendant also admitted that it had a setoff arrangement with the plaintiff whereby rental charges payable by the plaintiff would be setoff against charges due from the defendant for its hire of the plaintiff’s tugboats or the crane(s). 45     The defendant admitted that it purchased the Manitowoc but denied that the purchase price was $188,000, contending that it was $175,000 on which it had paid $110,000. 46     The defendant admitted that on 17 February 2007, the plaintiff had requested for access to the yard to facilitate the removal of the crane but denied it had refused access to Triple Gems to remove the crane without reason. The defendant further denied the plaintiff had been unable to recover the crane since February 2007 but admitted it had moved the crane to Haruki’s yard. The defendant did not admit the plaintiff’s alleged loss and damage or the quantum. It then counterclaimed for damages but did not particularise or specify what those damages were. 47     In its reply and defence to the counterclaim, the plaintiff alleged that the defendant had put up a sham defence in order to delay the claim for damages rightfully due to the plaintiff.",
        "The evidence": "48     Besides Yip and DS, the plaintiff had two other witnessesviza heavy plant and equipment consultant from England as well as the managing-director of a company called WH Chan Engineering Associates Pte Ltd (“WH Chan”). The defendant on its part had Lim as its witness as well as a marine engineer. (i)   the plaintiff’s case 49     Yip was the plaintiff’s first witness. His evidence adduced from his affidavit of evidence-in-chief (“AEIC”) has already been set out above in[4]to[41]above and it is his testimony in cross-examination that I turn my attention to. 50     Yip is a qualified mechanical engineer and is a veteran in the field of heavy machinery with 17 years’ experience in the off-shore oil industry before he started the plaintiff company in April1993. Consequently, he was very familiar with equipment like the two cranes and the Manitowoc and their market values at the material time. 51     Yip said he did not know Lim prior to renting storage space from the latter. As Lim operated vessels and had experience in the offshore industry, he fully expected Lim to know how to move the crane without causing damage. In other words, Lim should procure professionals who are familiar with the operations to move the crane. If the defendant was unable to get the right people to do the work, Yip would have been happy to assist if Lim had asked him. Further, the defendant had SMS as its subcontractor in whom Yip reposed full confidence as Chua knew how to operate cranes. It was Chua who invited Yip to store his equipment at the yard. The yard was completely empty at the material time and the defendant needed the plaintiff’s business due to the financial crisis of 1997 which continued into 1999. 52     Yip explained that the thinking then was that the parties could help one another as the plaintiff could hire out its tugs and barges to the defendant for jobs which hire charges could be offset against rental due to the defendant. Yip said it was a fair deal and the arrangement worked very well until the dispute between the parties arose. 53     Yip revealed that he closed the plaintiff’s office in Singapore in July 2004 prior to moving to the Philippines, where he kept all his equipment. Thereafter the plaintiff became a dormant company. 54     Instead of the defendant’s January statement which he disputed, Yip referred to his own statement of account dated 31 March 2004 (at 1AB18) which reflected the three invoices of the plaintiff (totalling $61,000) for hire of barges/tugboats by the defendant and payments he had received from the defendant. In his statement, Yip had stated that the defendant owed the plaintiff $55,500 against $45,208.00 owed by the plaintiff to leave a balance of $10,292 in the plaintiff’s favour after setoff. Yip explained his statement was prepared in a hurry as on the following morning he left for the Philippines. Questioned why he did not sign the statement, Yip explained it was not his practice to sign his statement of accounts. 55     Questioned whether the crane had been maintained after it was stored in the yard, Yip said there was no need for regular or periodic maintenance as the crane had been overhauled (and all its parts greased) when it was initially parked in the yard; that was all that was required. However, after being laid-up for a long time, the crane needed an experienced person to start the engine as otherwise the engine would be damaged. This was what happened when the defendant moved the crane from the yard without Yip’s prior knowledge or consent. Until he was shown the letter of Haruki’s lawyers to the defendant dated 30 November 2007 (at 2AB12) in cross-examination, Yip was unaware that the defendant had instructed Haruki to demobilize and dismantle the crane in order to effect repairs at Haruki’s yard. As the letter from Haruki’s solicitors had a bearing on my findings, I set out herewith the relevant extracts: We are instructed by our clients that you had instructed our clients to repair an American Hoist 9280 Crawler Crane. Pursuant to your instructions, our clients demobilised and dismantled the crane and brought the same back to their workshop to effect the repairs. We are instructed by our clients that they have received a demand from Yip Holdings Pte Ltd, made through their solicitors M/s Lau & Gur to deliver the crane to them. Yip Holdings Pte Ltd claim that they are the legal and beneficial owners of the said crane… Our instructions are that you have since admitted that Yip Holdings Pte Ltd is the owner of the said Crane…. 56     Yip further explained that the crane was never intended for use in Singapore but was meant for the offshore industry which was the plaintiff’s clientele. Hence, he disputed the defendant’s contention that the regulations of the Ministry of Manpower (“MOM”) pertaining to moving and dismantling of cranes by qualified persons applied to the removal of the crane from the yard. In any case, Yip pointed out, Haruki was on MOM’s approved list of qualified crane contractors for dismantling and installing of Japanese andnotAmerican cranes. Further, nobody told Yip that Haruki was a qualified contractor. Neither did the defendant inquire of the plaintiff/Yip whether Triple Gem was a qualified crane contractor listed with MOM. 57     Although he agreed with counsel for the defendant that the contracts from Keppel (see[76]below) probably prompted Lim’s request to him to remove the crane from the yard, Yip wondered why Lim would ask him to move suddenly. 58     In re-examination, Yip explained why (although he was conscious of the defendant’s threat of liquidated damages) he was unable to accede to the defendant’s demand to remove the crane from the yard by 2 January 2007 – the engine and the torque converter were not there, the crane had to be dismantled into its major components using an 85 ton crawler while the removal process itself would have required six 40 foot trailers and taken ten days. It was not a simple operation. (The court was told subsequently by the plaintiff’s expert that the crane was 30-40 metres in height while its size was half that of Courtroom 6A). 59     Yip had taken photographs at the joint inspection he conducted with Triple Gem on 15 and 16 February 2007, showing the condition and position of the crane at the yard. Apparently, the crane was in a different position than where it was in November 2005. In November 2005, the crane was very close to the waterfront whereas in February 2007, the crane had been moved to the left corner of the yard. 60     The plaintiff’s expert witness was Kenneth Harold Spencer (“Spencer”) whose experience including working for JH in the Quezon power project (“the Quezon project”) in the Philippines as a senior mechanical superintendent. Spencer (PW2) was very familiar with the crane as he had taken delivery of the crane on behalf of JH from its Singapore agent in 1977 in the course of working for JH. The crane was also used by JH for the Quezon project for two years. 61     Spencer testified he had visited Haruki’s yard to inspect the crane over the weekend before he took the stand. He then compared what he saw at site with the photographs Yip took in August 2008 and which were sent to him. Spencer opined that the crane had been neglected and abused. He surmised that the parts had been taken off by hacking and that they were not professionally removed by experienced engineers. Many of the major parts had been dismantled and dumped on the ground with some parts beyond repair while others had rusted and would need to be replaced. There was little evidence of maintenance work and the condition of the crane was such that it was near to scrap value. 62     Spencer estimated that the total cost of repair and replacement would be about US$500,000 excluding the other costs of lifting equipment such as a forklift, a small crane and one 85 ton crawler crane for the rebuilding and reassembly of the crane. 63     During cross-examination, Spencer corroborated Yip’s testimony on the minimal maintenance required when the crane was laid up for an indefinite period. Essentially it called for the existing oil to be drained out, its system flushed out, the parts greased and lubricated, the engine refilled with oil and the engine ran until it reached its normal running temperature. Once the crane was laid up and all its panels and doors properly closed, the elements of the weather would not be able to get inside so there would not be any corrosive effect. Because of its bulk and size, Spencer said the crane could take a lot of punishment. He opined that periodic maintenance would serve no purpose as the crane needed to be reconditioned when it was to be used. However, expertise was required to move and operate the crane as the operator must know how to check that everything was in good working order when the crane was started. 64     Counsel for the defendant took issue with Spencer on his expertise as well as on Spencer’s report in cross-examination. He even suggested to Spencer (who disagreed) that Spencer had previous extensive working relationship with the plaintiff/Yip. It was also put to Spencer (who again disagreed) that his report was slanted because of his dual role as a consultant and businessman. Spencer disagreed that he needed to inspect the crane because he was unsure of the physical condition of the crane when he made his report. 65     Nothing turns on the evidence of DS[40]the private investigator hired by Yip. I turn therefore to the testimony of the plaintiff’s last witness Chan Yeng Sum (“Chan”) who is a director of Triple Gem as well as the managing-director of WH Chan. Chan’s written testimony corroborated that of Yip as to what transpired at the inspection of the crane at the yard on 15 and 16 February 2007. 66     Chan revealed he was the person who introduced to Yip potential buyers of both the Manitowoc (before it was sold to the defendant) and the crane. In his AEIC, Chan deposed he was introduced to Lim by Chua sometime in 2004. He told Yip about a tentative offer of $350,000 for the Manitowoc which was subsequently aborted. During cross-examination, Chan revealed he made that offer to Yip. 67     Chan testified Yip had sought his assistance to remove the crane from the yard. When he brought his supervisor to the yard to inspect the crane on 15 February 2007, Chan noticed that the engine and torque converter were missing while the crane itself was dirty, rusty and in a deplorable condition. On the following morning, Chan inspected the crane again to evaluate how best to move it. He overheard Lim telling Yip that the defendant would charge the plaintiff $30,000 a day for storage if the crane was not removed from the yard immediately. Lim then instructed his security guard not to allow Yip and Chan into the yard without Lim’s permission. 68     Chan had prepared a quotation (unsigned) dated 16 February 2007 (at 1AB34-35) on behalf of Triple Gem for the removal of the crane which he hand-delivered to Yip, quoting $7,000 to disassemble the crane at the yard, move it out and reassemble it at Triple Gem’s premises at No. 23 Shipyard Road for another $7,500. The entire operation (carried out during the Chinese New Year holiday period) was estimated to take 9-11 days. 69     On Yip’s behalf, Chan handed to the yard’s guard post the plaintiff’s letter dated 17 February 2007 (at 1AB45) in[30]requesting access for Triple Gem so that the crane could be removed. Triple Gem’s quotation in[68]was enclosed with the letter. However, Lim did not respond to the plaintiff’s letter nor was Triple Gem instructed by Yip to remove the crane from the yard. From time to time, Chan would telephone Yip to find out the status quo but he was told there was no progress. 70     In April 2007, Chan learnt from Yip that the crane had been moved to Haruki’s yard. Since he was still interested in the crane, he visited Haruki’s yard and saw that the shoe tracks of the crane had been removed. He went back to Haruki’s yard on 3 May 2007 and saw two Malaysian registered trailers parked along the roadside. Chan suspected that the crane was going to be moved out so he informed Yip. Yip arrived at Haruki’s yard and called the police to complain that the crane which was his was about to be taken away from Haruki’s yard. The police subsequently arrived. Although the police officers warned Haruki not to move the crane, they told Yip that the matter was a business transaction and the police would not interfere. That was the last time Chan saw the crane. 71     Cross-examined, Chan said he was unaware of any approved list of crane contractors by MOM and whether Triple Gem was/was not on the list but he knew a police permit was required before he could move out the crane from the yard. Chan denied that he had a vested interest in selling the crane and that the evidence he gave was slanted in the plaintiff’s favour. (ii)   The defendant’s case 72     Lim was the defendant’s sole witness apart from the marine engineer Abdul Razak (“Razak”) whose testimony did nothing to advance the defendant’s case for reasons explained below in[99]. Notwithstanding the pivotal role played by Haruki in the removal of the crane from the yard, the defendant chose not to call Haruki’s director/shareholder Lim Choon Bock (“LCB”) to testify. LCB was the representative of Haruki who dealt with Lim. 73     Lim’s AEIC in fact corroborated Yip’s version as well as the terms, of how the plaintiff came to store its equipment at the yard. Neither did he dispute Yip’s testimony that the parties had a setoff arrangementvis a visstorage charges due from the plaintiff against hire charges due to the plaintiff for the defendant’s hire of the plaintiff’s tugboats or cranes. There was also no dispute that the storage charges payable by the plaintiff were reduced over time. 74     Where Lim’s version of events differed from Yip’s was on the moving of the Manitowoc to another location within the yard, the sale price of the Manitowoc and the issue of the crane being moved from the yard to Haruki’s yard. 75     Lim asserted that the agreed price of the Manitowoc was $175,000 and not $188,000 net of storage charges and that the plaintiff had paid $130,000 of the $175,000. He also claimed that Yip had authorised Haruki to repair the Manitowoc when its engine could not be started but the plaintiff had failed to pay Haruki for the repair charges. Lim exhibited to his AEIC copies of Haruki’s invoices no. 1273 and 1274 dated 7 November 2005 in the sums of $5,215.35 and $2,270.10 addressed to the defendant. He further contended that the storage charges due from the plaintiff as of 1 January 2007 were $61,635 and not $49,350 as Yip claimed. After setoff, the plaintiff still owed the defendant $16,635. 76     Lim deposed in his AEIC that the defendant had secured certain contracts from Keppel. Copies of the Keppel main contract, supplementary contract and supplemental contract dated 27 January 2007, 30 January 2007 and 17 November 2007 respectively were exhibited in Lim’s AEIC (collectively “the Keppel contracts”). Lim had informed Yip sometime in November 2006 that the plaintiff’s equipment had to be moved out from the yard because space was needed for the Keppel contracts and Yip agreed. 77     Lim claimed that Yip attended at the yard in December 2006 with a freelance contractor to move out the crane from the yard but Lim discovered that the latter did not have a licence/certification from MOM to operate the crane. Consequently, he informed Yip that he would not allow the crane to be removed from the yard by an unqualified contractor as there would be serious implications should a mishap occur in the moving process. 78     When nothing happened after that, Lim said he telephoned Yip on 26 December 2006 and demanded that the crane be removed by 2 January 2007 as the defendant needed the space that it occupied for work on the Keppel contracts. 79     Although Yip indicated he would remove the crane, the plaintiff failed to do so by 2 January 2007. On 27 January 2007, Lim deposed he telephoned Yip and demanded that Yip immediately remove the crane as by then, the defendant had signed the Keppel contracts in[78]. 80     Lim deposed that on or about 8 April 2007, the defendant engaged Haruki’s services to relocate the crane at Haruki’s yard for which services Haruki rendered a bill for $26,250 to the defendant. He then wrote to the plaintiff on 7 May 2007 (at 1AB66) to put on record what had happened. 81     Lim complained that the plaintiff was unreasonable in refusing to remove the crane and in imposing a condition that the defendant must repair the crane before it was returned to the plaintiff or that the defendant must bear the cost of rectification. Lim alleged that the current sate of the crane was due to the plaintiff’s failure to maintain it when it was stored in the open and exposed to the elements. 82     He deposed that the defendant’s (former) solicitors had written to the plaintiff’s solicitors on 2 July 2007 (at 1AB79-80) in response to the demands made by the plaintiff’s solicitors giving notice of the defendant’s claim for arrears of rent, loss, cost and expense of moving and maintaining the crane in sums totalling $260,370. 83     Lim further complained that because of the plaintiff’s failure to move the crane out of the yard, the defendant was forced to instruct its employees to build a panel for the Keppel contracts at another location in the yard. This resulted in a delay in completion of the work and additional labour costs for which the defendant claimed against the plaintiff. He added that the plaintiff remained liable to Haruki for storage charges for the crane at Haruki’s yard. 84     It was noteworthy that Lim’s AEIC made no mention of events that took place on 15, 16 and 17 February 2007 and in April 2007 as narrated by Yip and Chan. Neither did he refer to the various letters written to the defendant by the plaintiff’s solicitors in May 2007 demanding the return of the crane. 85     Not surprisingly, Lim was subjected to vigorous cross-examination by counsel for the plaintiff and it is to his additional evidence adduced thereunder that I now turn my attention to. 86     Although his stand was that only a qualified contractor could move the crane out of the yard, Lim was uncertain whether Chua (his own subcontractor) had such a licence when the latter moved the crane from the tugboat into the yard next to Lim’s workshop. Lim was unaware that Yip had instructed Chua to carry out the necessary maintenance for the laid-up crane. Neither did Lim know the nature of the maintenance required for the crane. 87     Lim revealed that the crane was relocated once (in 2002) when it was at the yard -- it was moved from its location near his workshop to the waterfront. The move was carried out by Chua on Yip’s instructions. 88     Lim claimed he was given the go-ahead by Yip (who was busy) by telephone in November 2005 to repair the crane when Haruki informed him (Lim) that it could not start the engine. Haruki then rendered invoices for $5,215.35 and $2,270 to the defendant for the repairs it had carried out. He admitted that he had already instructed Haruki to work on the crane when Haruki told him the engine of the crane could not start. He claimed he did not know that Yip was given a quotation of $29,000 for a torque converter in late 2005 by Haruki and denied that Yip subsequently wanted to hand him a torque converter that Yip had bought from the States[17]for repair of the crane. Lim said he could not remember telling Yip to hand the torque converter to Haruki. 89     Lim did not deny that he had instructed his guard at the guard post on 16 February 2007 not to allow Yip and Chan entry into the yard[29]. His excuse was that on the previous day when Chan was at the yard to inspect the crane, Chan was accompanied by Triple Gem’s supervisor Sani whom the defendant’s manager Melvin Lim said was not qualified to dismantle the crane. Consequently Lim said he refused to entertain Yip’s request to remove the crane. 90     Lim initially denied receiving the plaintiff’s letter dated 17 February 2007 in[69]until counsel for the plaintiff (as well as the court) drew to his attention that he had admitted receiving the letter in his defence (para 18). Lim then changed tack and claimed he had only glanced at Triple Gem’s quotation (N/E 186) which he chose to ignore because Triple Gem was not qualified to move the crane. However, Lim did not inquire of Chan whether Triple Gem was qualified to remove the crane. Lim relied on what his manager told him as his manager was experienced and knew who was/was not on MOM’s list of crane operators. (As Melvin Lim did not testify, I disregarded Lim’s hearsay evidence.) 91     Lim complained that despite his repeated demands to Yip to remove the crane because the defendant needed the space for work on the Keppel contracts, the plaintiff ignored him. Hence, he had no choice but to arrange for Haruki to dismantle the crane on 8 April 2007 and move it to Haruki’s yard. 92     In this regard, Lim’s attention was drawn to Haruki’s note to the defendant dated 7 April 2007 (at 1AB 49) which stated as follows: As instructed by Mr Kenny Lim of Asia Link Marine Industries Pte Ltd we are to demobilized (sic) and dismantle the whole crane, boom, undercarriage and counterweight to my workshop for complete repair incl. of boom, engine, torque converter, mechanical system to working condition and spray painting. Transportation, heavy lifts and police escorts would be charged accordingly. On dismantling completely, then spare parts and repair cost could be estimated. Questioned on the reason behind his above instructions to Haruki, Lim claimed it was to put the crane into working condition. He denied counsel’s suggestion that it was with a view to selling the crane. 93     Although he had initially prevaricated when first questioned by counsel for the plaintiff, Lim eventually agreed when pressed by the court (at N/E172) that if the crane was damaged while it was being moved within the yard, he was liable. 94     In relation to moving the crane to Haruki’s yard without the plaintiff’s consent, Lim further admitted that as a result of his instructions, Haruki practically took out all the parts of the crane which were then left in the open at Haruki’s yard. He accepted that he was responsible for the present state of disrepair of the crane. 95     Counsel then drew to Lim’s attention MOM’s list of approved crane contractors (at 1AB152-155). Although Haruki was indeed on the list, the company (as Yip had testified) was only qualified to be crane erectors for Japanese cranes. Haruki wasnotan approved contractor for American Hoist Crawler 9280 which was the brand of the crane. The approved contractor on MOM’s list for this make and other American hoist cranes was American Equipment Services Pte Ltd. In the face of such evidence and in answer to the court’s question, Lim conceded that Haruki was not qualified to dismantle, disassemble and reassemble the crane. Despite the concession he made, Lim still disagreed that he had employed an unqualified contractor to dismantle and remove the crane. 96     Lim had alleged in his AEIC that the plaintiff failed to pay Haruki’s storage charges of $3,000 per month. I note however that the invoices (as with Haruki’s repair bills in[80]) were addressed to the defendant, not to the plaintiff. Since it was Lim who gave instructions to Haruki on repairs to and the moving of the crane, it should be the defendant and not the plaintiff who should bear Haruki’s charges. 97     In relation to the net storage charges owed by the plaintiff after setting off what was owed by the defendant, it was also clear from Lim’s cross-examination that the defendant’s statements of accounts were unreliable (see N/E 209 to 213) and that after setoff, it was the defendant who still owed the plaintiff $65,715. 98     Although it was Lim’s contention that the defendant had paid the plaintiff $130,000, the defendant had admitted (in para 11 of the defence) the plaintiff’s plea (in para 11 of the statement of claim) that it had paid the plaintiff $110,000 and not $130,000. Consequently, I ignored Lim’s evidence that contradicted his company’s pleaded case. In any case (as I pointed out to the counsel for the defendant), there was not one iota of documentary evidence (by way of cheques) to corroborate the defendant’s defence that it had paid the plaintiff or Yip personally, an additional $20,000 over and above the sum of $110,000. 99     Earlier at[72], I had commented that the evidence of the marine engineer was unhelpful. That was because Razak (DW2) had relied on documents and information furnished by Lim and LCB of Haruki when he carried out his survey of the crane on 17 January 2009 at Haruki’s yard. In the course of Lim’s cross-examination, it was apparent that he had given incorrect information to Razak who is from Orion Offshore Engineeringvizthat the crane had been stored at the yard since 1999 when it had only been there since 2002. Lim had also misinformed Razak that Yip had instructed Haruki to repair the crane when it was actually Lim who did so. Finally, Lim had untruthfully informed Razak that Yip had instructed Haruki to overhaul the crane. It was common ground in any case that the crane was and still is, in a deplorable state and it served no purpose for the defendant to engage a surveyor to confirm the obvious.",
        "The findings": "100    In the light of the evidence adduced from the parties’ witnesses, it was not surprising that I found in favour of the plaintiff on its claim and dismissed the defendant’s counterclaim. 101    Yip was a forthright witness whose evidence was consistent and unwavering. In contrast, Lim came across as unreliable and he often contradicted himself, the facts and/or his own pleaded case.",
        "The crane": "102    I found Lim’s explanation as to why he refused Yip permission for Triple Gem to move the crane out from the yard utterly incredible. As it was the plaintiff and not the defendant which owned the crane, it was of no concern to the defendant whether the removal from the yard was done by a qualified or unqualified crane contractor. It would be the plaintiff and not the defendant who would bear the consequences should it be found that the moving needed to be done by an approved contractor on MOM’s list. 103    On the one hand, Lim complained that the plaintiff failed to remove the crane within his deadline of 2 January 2007 which was short notice, as his demand was made on 26 December 2006. On the other hand, he flatly refused to allow Yip and Triple Gem access to remove the crane when they made arrangements to do so during the Chinese New Year period. Yet he complained the plaintiff acted unreasonably (see[81]above). I could not understand Lim’s ambivalence on the matter. 104    As the plaintiff rightly pointed out in its closing submissions [at para 11(b)], Yip responded as expeditiously as possible when Lim demanded that the crane be removed by 2 January 2007. On 17 February 2007, the plaintiff was ready to move the crane to the premises of Triple Gem but was denied access to the yard by Lim. Lim failed to respond to Yip’s letter dated 17 February 2007 in[30]. After his unilateral move of the crane on 18 April 2007, Lim still did not inform Yip/the plaintiff of the move until 7 May 2007. It is my view that the only reason Lim was prompted to respond was due to his receipt of the letter dated 3 May 2007 from the plaintiff’s solicitors in[33]which was carbon-copied to Jurong Police station, after Yip had lodged a police report on Lim’s attempt to move the crane out of Haruki’s yard. 105    What made the defendant’s/Lim’s conduct even more reprehensible was the fact that Lim had engaged Haruki who was not a qualified contractor for the make of the crane, to dismantle and disassemble crane. Judging by subsequent events, Haruki not only damaged the crane in the process but seemed incapable of assembling and/or restoring the crane to its original state. 106    Lim acted to all intents and purposes as if he was the owner of the crane to the extent that he denied Yip access to the crane while it was in the yard. Lim had no scruples in misrepresenting himself/the defendant as the owner of the Manitowoc (see[12]above) even before the plaintiff sold it to him. Neither did Lim have any scruples in misinforming Haruki that the plaintiff had authorised him to move the crane to Haruki’s yard. The fact that the defendant’s brochure exhibited to Lim’s AEIC contained untruthful information is also a reflection of Lim’s character. Lim was evasive when he was cross-examined on whether he had intended to sell the crane. Despite his denials, I have little doubt he would have disposed of the crane had the police not stopped him, judging by his usurping of the plaintiff’s rights, as evidenced in Haruki’s solicitors’ letter set out in[55]above. 107    It was common ground that the terms of the oral agreement made in 1999 between the parties were as follows:  (a)  the defendant would rent space to allow the plaintiff to store its equipment at the yard;   (b)  the plaintiff would pay a monthly fee for the space it rented; and   (c)  the defendant would have a right to relocate the plaintiff’s equipment to another part of the yard if it needed to use the space at which the plaintiff’s equipment was stored.  108    The defendant had submitted that the plaintiff breached the oral agreement when it failed to pay for the storage charges after January 2006. In the alternative, it was argued that the defendant had given sufficient notice to terminate the agreement (no particulars were furnished) and the plaintiff accepted the termination by its conduct in appointing Triple Gem to move the crane to another location. 109    I rejected the defendant’s unmeritorious arguments. I accepted the plaintiff’s submission that the defendant breached the oral agreement when it unilaterally moved the crane out of the yard without the prior knowledge or consent of the plaintiff and against the plaintiff’s express request to have the move carried out by its appointed contractor Triple Gem. 110    It would not even be necessary to consider the plaintiff’s submissions on the necessary terms to be implied into the oral agreement as Lim himself had admitted (at N/E 169-170) that he needed to inform the owner should any equipment stored in the yard be relocated to another area and, when questioned by the court, he agreed that he would be liable should any damage result from such a move (see[93]above). 111    Consequently, the crane having been damaged when it was moved and/or after it was moved, from the yard to Haruki’s yard on the instructions of Lim, the defendant was liable for the damage caused thereby. 112    The defendant had also argued that the present condition of the crane was due to the plaintiff’s failure to maintain the crane when it was stored at the yard as there was no evidence to support the plaintiff’ claim that the crane was laid up. This novel argument was not part of the defendant’s pleaded case nor was it put to Yip or Spencer when they testified. Moreover, it went against the evidence of both Yip and Spencer which I accepted. There was no reason not to accept Spencer’s testimony which corroborated what Yip said, on the lay-up procedure and preventive maintenance procedures undertaken when the crane was initially stored at the yard. 113    There can be little doubt that the present deplorable condition of the crane was entirely attributable to Haruki’s dismantling and disassembling of the crane. In the words of Spencer (at N/E 98) the condition of the [crawler] crane was near scrap value. Spencer’s view was confirmed by none other than the defendant’s own witness Razak (at para 8.03 of his report) when he said: The crane had deteriorated to such a state it might not be economical to repair to bring it back to original working condition.",
        "The storage charges": "114    The plaintiff had never disputed its liability to pay storage charges after 31 December 2005 (all previous accounts between the parties up to December 2005 having been setoff against the sale price of the Manitowoc). However, the plaintiff disputed the accuracy of the defendant’s January statement (which was not unfounded given that Lim’s cross-examination proved that the defendant’s computation of storage charges was incorrect). Yip was also waiting for Lim’s brother Roland to revert to him after they met on 13 February 2007[23]to verify the accuracy of the defendant’s statement of account. It therefore did not lie in the defendant’s mouth to complain that the plaintiff owed storage charges and to use the plaintiff’s non-payment of the same after December 2005 as an excuse to purportedly terminate the agreement. That excuse was clearly an afterthought. 115    Based on the far more reliable statement of account of the plaintiff, I accepted that it did not owe any sums to the defendant by way of storage charges. Rather, a sum was still due from the defendant to the plaintiff for the sale of the Manitowoc in[112].",
        "The Manitowoc": "116    In the light of Lim’s unreliable testimony, I did not believe his claim that the Manitowoc was sold to the defendant for $175,000. I accepted Yip’s contention that the agreed price (net of setoffs) was $188,000.",
        "The Counterclaim": "117    Needless to say, the defendant’s counterclaim for damages based on the plaintiff’s breach of contract (for which no particulars were pleaded) was baseless. In his AEIC, Lim quantified the damages as $40,365 representing the defendant’s loss of use for the storage space occupied by the crane for five months and which allegedly caused the defendant to suffer production loss. As this claim was not pleaded, it was rejected.",
        "Conclusion": "118    I found that the plaintiff had more than proved its claim on a balance of probabilities. I noted that the plaintiff’s liquidated claim included the sum of $9,000 Yip paid for the torque converter from the States. While I did not doubt that he incurred the charge, no invoice for the sum was produced. Moreover, because of the difficulties in and the uncertainties surrounding, the repair of the crane as well as the estimated costs involved, I decided that it was best to award the plaintiff interlocutory judgment on its claim and have its damages assessed by the Registrar at a later date after the crane was repaired. 119    Accordingly, I granted interlocutory judgment to the plaintiff with costs on its claim and directed that damages be assessed by the Registrar with the costs of such assessment reserved to the Registrar. I further dismissed the defendant’s counterclaim which I found to be completely unmeritorious."
    }
}