{
    "case_title": "Public Prosecutor v Barokah",
    "ncitation": "[2009] SGHC 46",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction to the second hearing": "1       The precursor to this judgment isPP v Barokah[2008] SGHC 22(“my previous judgment”) which contains the grounds of my decision for sentencing Ms Barokah to life imprisonment on 26 November 2007 upon her plea of guilt to a charge under s 304(a) of the Penal Code (Cap 224, 1985 Rev Ed) (“the first hearing before me”). 2       Ms Barokah appealed to the Court of Appeal against my previous judgment. At the first hearing before the Court of Appeal on 22 April 2008, her counsel (the same counsel at the first hearing before me and at the present hearing) applied to the Court of Appeal to admit a further psychiatric report dated 6 March 2008 from Dr Nagulendran, the defence psychiatrist. After hearing arguments, the Court of Appeal rejected the application. 3       The Court of Appeal then proceeded to hear the appeal on its merits. In the course of his submissions, defence counsel argued that Ms Barokah’s actions were the impulsive reaction of a newly pregnant woman at the time of the offence on 19 October 2005. Some issue apparently arose as to whether the defence psychiatrist was aware of Ms Barokah’s pregnancy. Defence counsel, after checking with Dr Nagulendran over the telephone, informed the court that the defence psychiatrist did not know that Ms Barokah was pregnant at the time of the offence when he put up his first two reports. (It can be seen from Dr Nagulendran’s report of 11 July 2007 (Appellant’s Bundle of Statements and Documents at page 24), that he had in fact noted that Ms Barokah “gave birth to a girl in May 2006”, some seven months after the offence. The date of birth of the girl is erroneous as it should be 3 July 2006. That report had been tendered at the first hearing before me.) 4       Defence counsel then applied to the Court of Appeal for leave to adduce a further report in order that the defence psychiatrist could comment on the impact of pregnancy on Ms Barokah’s mental state at the time of the offence. The Court of Appeal decided to adjourn the hearing so that the psychiatrists for the prosecution and for the defence could consider whether the issue of pregnancy would affect their findings contained in their earlier reports submitted at the first hearing before me. 5       At the second hearing before the Court of Appeal on 20 August 2008, two further reports dated 12 June 2008 and 24 July 2008 (supplemented by an addendum dated 25 July 2008) by Dr Nagulendran and a further report dated 9 July 2008 by the prosecution’s psychiatrist, Dr Tommy Tan, were produced before the Court of Appeal. After hearing submissions, the Court of Appeal made the following orders (as indicated in the Certificate of Result of Appeal): (1)    The sentence of the court below is set aside, and the case is remitted to the trial judge in order to re-evaluate the psychiatric evidence,inter alia, through the oral examination of: (a)    the psychiatrists; and (b)    any other person (or persons) who might have had knowledge of the appellant’s mental health at the material time (or times). (2)    The appellant be kept in remand pending further order. 6       This is how this case is now before me a second time. After a number of pre-hearing conferences with counsel for both parties, the lists of witnesses to be called by both parties were settled. At the final pre-hearing conference on 5 February 2009, I indicated to counsel for both parties that my understanding of the Court of Appeal’s directions set out in [5] above was that the Court of Appeal neither directed nor allowed Ms Barokah to testify at the second hearing before me and that if they thought otherwise, they should seek the Court of Appeal’s clarification immediately. Counsel for both parties agreed that this was the correct reading of the Court of Appeal’s directions. 7       As the conviction of Ms Barokah was not set aside, the facts set out in my previous judgment relating to her conviction still stand and are relevant for the purpose of this second hearing. Further, as my previous judgment dealt with the earlier psychiatric reports and expressed my views on why life imprisonment should be imposed (which I will be referring to in this judgment), I think it is appropriate to attach my previous judgment as an annexure[Annexure included*]for easy reference. This judgment should therefore be read in conjunction with my previous judgment which I adopt unless otherwise stated.",
        "[*LawNet Admin Note: Annexure ([2008] SGHC 22) is viewable only byLawNetsubscribers.]": "",
        "The evidence at the second hearing": "8       At the second hearing before me held between 16 and 19 February 2009 (with submissions by the parties on 23 February 2009), the prosecution called the following seven witnesses: (1)    SGT Nor Hida binte Nasib (“SGT Nor Hida”); (2)    SSGT Mohamad Kamil bin Hassan (“SSGT Mohamad Kamil”); (3)    Mr Richard Chew Jhing Liang (“Richard Chew”); (4)    Mr Lee Seng Lim; (5)    Mdm Lim Yock Hoon; (6)    Dr Tan Heng Hao; and (7)    Dr Tommy Tan. The defence called the following three witnesses: (1)    Mr Isnaini Mislani (“Mr Isnaini”); (2)    Dr Helen Chen; and (3)    Dr Nagulendran. It was agreed that the psychiatrists (i.e. Dr Tommy Tan and Dr Nagulendran) would sit in during the testimony of all other witnesses and that they would take the witness stand last.",
        "The prosecution’s witnesses": "9       SGT Nor Hida and SSGT Mohamad Kamil were the first police officers to arrive at the scene of death at Block 19 Chai Chee Road (“Block 19”) on 19 October 2005. While both of them were on mobile patrol that morning, they were instructed to proceed to Block 19 to look into information from a resident that a body was lying motionless on the ground there. They arrived at about 7.21 am. At about 7.28 am, other police officers arrived at the scene to help cordon off the area. An ambulance arrived and the paramedic pronounced the body lying there, i.e. Wee Keng Wah (“Wee”), the deceased mentioned in the charge, to be dead. A short while later, Lee Seng Lim (Wee’s son) approached the police officers and requested to look at the body as he suspected that it was his mother. After confirming that it was his mother, Lee Seng Lim brought SGT Nor Hida and SSGT Mohamad Kamil up to Wee’s flat (i.e. #09-328) on the 9thlevel of Block 19. 10     The two police officers checked all the windows of the flat. They noticed that the aluminium window grilles in Wee’s bedroom were closed and the left casement window was opened. SSGT Mohamad Kamil then interviewed Ms Barokah in simple English and Malay with SGT Nor Hida standing nearby. Ms Barokah understood his questions and told him that she had been working there for about one month, that she slept in the bedroom of Wee’s husband and that Wee slept in the other bedroom. Ms Barokah also said that at about 4.30 am that day, she woke up to accompany Wee’s husband to the toilet. Just before going into the toilet, she went into Wee’s bedroom to inform her. When she entered Wee’s bedroom, she saw Wee lying on the floor next to her bed, facing upwards. Suspecting that Wee could have fallen from her bed, she tried to wake her up but Wee merely groaned. She then moved Wee to a sitting position with her back leaning against the wall. She told the police officer that Wee was not bleeding and that she had gone immediately to seek help from Wee’s husband. 11     Ms Barokah also informed the police officers that she wanted to call the police but did not know what number to dial. She approached Wee’s husband who showed her first three fingers followed by nine fingers but she did not understand what this meant. Wee’s husband then returned to his bedroom, held an alarm device and activated it. Wee’s husband also asked Ms Barokah to call his son and his daughter. She tried calling them but there was no response. She then decided to seek help from the neighbours but did not know where Wee kept the keys. 12     Ms Barokah went on to inform the police officers that at about 5.10 am, Wee’s husband and Ms Barokah entered Wee’s bedroom to search for the flat’s keys. At that point in time, Wee was still in the same position, sitting down and leaning against the wall. Wee was breathing heavily then. They found the keys and left the flat to seek help from a neighbour two doors away. 13     The police officers then proceeded to interview Richard Chew, the neighbour. Richard Chew told them that the alarm device held by Wee’s husband was still sounding when the elderly man reached Richard Chew’s flat alone. Richard Chew managed to turn it off only when both of them returned to Wee’s flat. However, Richard Chew could not find Wee in the flat. Ms Barokah was then in the living room. He then decided to call Wee’s son, Lee Seng Lim. SGT Nor Hida’s evidence on this point was that Richard Chew told them Ms Barokah requested him to call Lee Seng Lim and he did so. 14     Having heard this account from Richard Chew, the police officers questioned Ms Barokah further. She informed them that half way to Richard Chew’s flat, she left Wee’s husband and returned to the flat in order to call Lee Seng Lim. However, no one responded. Ms Barokah added that when she was helping Wee into a sitting position, she opened the left casement window and the window grilles. Subsequently, she closed the window grilles but did not lock them. At the request of the police officers, she demonstrated to them the sequence of her opening and then closing the casement window and the window grilles. When the police officers asked Ms Barokah about the damaged red plastic rack, she replied that when she discovered Wee lying on the floor, the said rack was already broken and its items were strewn on the floor of the bedroom. 15     Throughout their conversation with Ms Barokah, she appeared normal and calm to the police officers. She did not appear to them to be anxious, distressed, frightened, angry or aggressive. She looked neat. She understood the questions and responded spontaneously. The police officers had no difficulty understanding her. They left the scene after other police officers arrived. 16     Under cross-examination, they agreed that their impression of Ms Barokah’s behaviour was based on memory as there was nothing in their log sheets (recorded after the incident) concerning her demeanour. However, if they had noticed anything abnormal about her, they would have recorded it. SGT Nor Hida agreed that when they informed Ms Barokah that Wee was dead, she appeared shocked and sad. She could not recall whether she cried too. She disagreed that Ms Barokah went to the kitchen and took some time to compose herself. Ms Barokah did not ask them how Wee died. 17     Richard Chew, a hair stylist, lived two doors away from Wee and her husband. He has known Lee Seng Lim for more than 30 years as Lee Seng Lim used to live with his parents in Wee’s flat before his marriage. At about 5.30 am on 19 October 2005, Richard Chew was sleeping in his bedroom when he heard a loud alarm sounding outside his flat and someone calling his name. He went out and found Wee’s husband (whom he addressed as “Uncle”) holding the alarm in his hand. He asked Wee’s husband what happened, where his wife was and why she had not switched off the alarm for him but he did not respond. Instead Wee’s husband started walking gingerly back to his flat. Richard Chew followed, intending to help him turn off the alarm. 18     When the two men reached Wee’s flat, Richard Chew shouted for “Auntie” (i.e. Wee) asking her why she had not turned off the alarm for her husband. There was no answer. He then asked Wee’s husband where Wee was and was told that she was lying in the bedroom. Richard Chew went to the doorway of Wee’s bedroom and turned on the room lights. No one was inside. The bedroom was in a mess. He asked Wee’s husband again where his wife was and was told again that she was lying on the floor. Richard Chew managed to turn off the alarm for Wee’s husband. 19     Seeing Ms Barokah in the living room, Richard Chew asked her in Malay, “Mana Por Por” (“Where is Por Por?”). She said she did not know. He then asked her whether she had called “Young Sir” (i.e. Lee Seng Lim) and she said yes. Sensing something was amiss about Wee’s bedroom, he asked her for Lee Seng Lim’s contact number. She handed him a piece of paper with some numbers written on it. She appeared normal, steady and neat. She did not appear frightened, distressed or disturbed. She was spontaneous in her replies. He then called Lee Seng Lim, who was living a few blocks away from his parents, and asked him to go over to Wee’s flat. He then left the flat with Wee’s husband and they stood in the corridor to wait for Lee Seng Lim to arrive. Ms Barokah remained in the flat. Richard Chew did not pay attention to what she was doing inside. 20     When Lee Seng Lim arrived with one of his sons, Richard Chew narrated the events to him. Lee Seng Lim then went into the flat to look around and emerged a while later to tell his father that Wee could have left for her regular morning exercise. After that, Richard Chew went back home to sleep. 21     Sometime later, he was awakened by some noise from the ground floor. As he went out of his flat, he saw a lot of police officers outside Wee’s flat. He approached Lee Seng Lim and was told that someone had found a body at the foot of Block 19. They went down to check. Lee Seng Lim’s elder brother was also at the ground floor. One of the brothers went to look at the body and said it was Wee. Richard Chew was shocked. He then returned home. Later that morning, he discussed with Lee Seng Lim the funeral arrangements for Wee. 22     Richard Chew agreed that he was a good family friend of Lee Seng Lim and was upset by the news of Wee’s demise. However, he disagreed that his evidence about Ms Barokah was coloured by this relationship. He also disagreed that it was Ms Barokah’s idea to call Lee Seng Lim that morning, that she dialled the number and passed the telephone to him or that she said she wanted to speak to Lee Seng Lim during the call and then said something to Lee Seng Lim in a confused state before passing the telephone back to Richard Chew. He did not remember being interviewed by the police officers. He had no interaction with Ms Barokah before 19 October 2005 although he knew that she was the new domestic helper. He disagreed that he spoke to her about Wee’s husband’s alarm that morning or that she helped him find the gadget to turn it off. He also denied that she asked him to go with her to Lee Seng Lim’s flat as she did not know its number. Defence counsel also put to Richard Chew that he asked Ms Barokah why Lee Seng Lim was taking so long to arrive at Wee’s flat, commenting to her that if he had taken the car, it should not take more than 10 minutes and that she said, “Maybe Sir is walking”. Richard Chew denied that he had this conversation with her while he was waiting in the corridor with Wee’s husband. He also disagreed that she asked Wee’s husband to go inside the flat but he refused to do so. 23     Lee Seng Lim and his family (wife and two sons) were preparing for a trip to Malaysia at about 5.30 am on 19 October 2005 when he received a telephone call from Richard Chew and was told that his mother was missing from the flat and that his father had requested Richard Chew to call the police. Lee Seng Lim, who lives in Block 27 Chai Chee Road, several blocks away from his parents’ flat in Block 19, then walked over to Block 19 with his elder son. When they met Richard Chew and Wee’s husband in the corridor outside Wee’s flat, the two men told him about the events of the morning. After reassuring his father that perhaps Wee had gone for her morning exercise which she normally did around that time, Lee Seng Lim went into Wee’s flat. 24     He saw Ms Barokah and asked her in English, “Where is Mum?”. She said she did not know. He looked around the flat and noted that Wee’s bedroom was uncharacteristically untidy. He then turned to Ms Barokah who was following him around and asked her the same question again. She gave the same reply that she did not know. When asked why the bedroom was so messy, she replied that Wee had fallen down. He then asked, “Mum fall down, then where is Mum now?”. Again she said she did not know. He walked around Wee’s bedroom, opened the window grilles towards the right and looked outside but saw nothing. He then shut the window grilles, asked her again where Wee was and got the same reply. He then walked to the kitchen and went out of the flat to tell his father not to worry as Wee could have gone for her usual morning exercise. Lee Seng Lim asked Ms Barokah again, “Where is Mum?”. This time she said she did not know and maybe Wee had gone for her exercise. He then asked her why she said earlier that Wee had fallen down and was now saying that she could have gone for exercise. She said she did not know. 25     After that, Lee Seng Lim asked his son to go look for Wee at Block 60, the location Wee used to go to for her morning exercise. He also called Changi General Hospital to check whether Wee had been sent there since Ms Barokah said Wee had a fall. He then called to inform his elder sister and his elder brother and requested them to go to Wee’s flat as it was about time for him and his family to leave for their trip. His elder brother was ill. His elder sister told him her husband would be going over to Lee Seng Lim’s flat to pick up his wife and his younger son and then meet him at Wee’s flat later. They had made prior arrangements for the brother-in-law to drive the family to Golden Mile Complex to board a coach for Malaysia. 26     The elder son returned to say that he could not locate Wee at Block 60. Lee Seng Lim and his family then left in the brother-in-law’s car for Golden Mile Complex. On the way there, Lee Seng Lim felt uneasy and told his family that they should cancel the trip. They then returned to Chai Chee Road and searched the vicinity for Wee before returning to Block 19 at sometime past 7 am. By that time, the police was already there. He walked to the rear of the block and saw a white cloth covering a body on the floor. He requested to look at the body as he believed that it could be his mother. He was allowed to do so. He did not see Wee’s face but managed to identify her from the clothing, her build and the fact that she was lying directly below her bedroom window. 27     He then went up to Wee’s flat and saw more police officers standing outside. He went into the flat and asked Ms Barokah again what had happened. Again she said she did not know. Lee Seng Lim then told her, “Mum is die downstairs already, you better tell me what happened”. He got the same reply from her. The police then led him aside and did not allow him to talk further with her. He went to be with his father. 28     According to Lee Seng Lim, the relationship between his parents and Ms Barokah was fine. There was no complaint from Wee’s husband. However, Wee had complained about one week after Ms Barokah started working for his parents about an incident one night at around 11 pm when Ms Barokah told her that she had dropped a towel from the kitchen window and then left the flat to look for it. As she failed to return home soon thereafter, Wee went to the ground floor to look for her and found her talking to a man there. Wee shouted at her and she approached Wee. They then searched for the towel but could not locate it. At around midnight, Wee heard some noise coming from her husband’s bedroom which had a window looking into the corridor. She went to check and saw a shadow moving past along the corridor. Ms Barokah, who was then standing at the window, denied talking to anyone. 29     The next day following Wee’s complaint, Lee Seng Lim spoke to Ms Barokah about the incident. She claimed that she did not know the man at the ground floor who approached her and asked her if she was living there. She denied talking to anyone standing outside the window of Wee’s husband’s bedroom. He also told the maid agency about the incident and asked for advice. He was informed that he could terminate her employment but would have to wait sometime before a replacement domestic helper could be found. He then decided to give Ms Barokah another chance. 30     Lee Seng Lim visited his parents about five days every week. He would have his dinner at his parents’ home. Ms Barokah, who would eat with them at the dining table, did not tell him that she was unhappy. She was always smiling and exhibited no unusual behaviour. She was the first domestic helper employed by his family for the purpose of looking after his sickly father. 31     Lee Seng Lim denied that he had noticed during his visits to Wee’s flat that Ms Barokah hardly ate and asked her for the reasons. (This was what Ms Barokah told Dr Helen Chen, one of the defence expert witnesses called at this second hearing – see [48] below). He also denied that Ms Barokah always appeared tired. He did not think Wee, a good tempered person, could have lost her cool and scolded Ms Barokah, as suggested by defence counsel. He denied that Ms Barokah spoke to him over the telephone in the morning of 19 October 2005. It was Richard Chew who called him. 32     Lee Seng Lim’s wife, Lim Yock Hoon, went over to Wee’s flat at about 6.15 am on 19 October 2005. She asked Ms Barokah in the flat where Wee was and she replied that she did not know. When Lim Yock Hoon saw the untidy bedroom and asked why the plastic rack was left toppled on the floor, Ms Barokah said that Wee had fallen down. Asked whether it was serious, she replied that Wee was groaning. She was then asked again where Wee was and she said Wee had gone for her exercise. Throughout the conversation, Ms Barokah appeared normal and calm. Since Wee managed to go for her regular exercise, Lim Yock Hoon thought she could not have been seriously injured. The rest of her evidence was largely the same as her husband’s. She confirmed that the relationship between Wee and Ms Barokah was quite good. She visited Wee’s flat at least five times a week with her husband and had never heard Ms Barokah, who dined at the same table as Wee, complaining about unhappiness. 33     Dr Tan Heng Hao, an associate consultant attached to the Department of Reproductive Medicine, KK Women’s and Children’s Hospital, testified that he examined Ms Barokah on 11 April 2006. She had given birth twice before. She was unsure of her dates of menstruation and her periods were irregular. At that time, her baby was found to be about 28 weeks gestation. A subsequent screening scan done two weeks later confirmed this. In view of the above facts, it was difficult to say when she would know that she was pregnant. The possible date of conception could be in early October 2006, plus or minus two to three weeks. At the time of the offence on 19 October 2005, she may or may not be aware of her pregnancy. She was also seen at the same hospital on six other occasions (by other doctors) between 25 April 2006 and 29 June 2006 and was admitted for delivery on 3 July 2006 when she gave birth to a full-term baby girl. She was discharged the next day. 34     Based on her medical records, there was nothing to show that Ms Barokah was suffering from depression during her pregnancy. If she had any such symptoms, she would have been referred to a psychiatrist. During the first six weeks of pregnancy, the symptoms may be of the pre-menstrual type. After six weeks, nausea and vomiting could occur together with non-specific symptoms like bloatedness, fatigue and dizziness. 35     The final witness for the prosecution was Dr Tommy Tan. He was at the material time a consultant psychiatrist in the Institute of Mental Health but now has his own private practice. As agreed, he took the stand only after all the other witnesses for the prosecution and the defence (except Dr Nagulendran) had testified. In my previous judgment, I dealt with Dr Tommy Tan’s reports of 30 November 2005 and 5 April 2007. In his latest report of 9 July 2008, in which he responded to Dr Nagulendran’s report of 12 June 2008, Dr Tommy Tan again disagreed with Dr Nagulendran’s assessment that Ms Barokah had a severe depressive episode. He cited the diagnostic criteria in the World Health Organization’s International Classification of Mental and Behavioural Disorders, 10thedition (“ICD-10”) and the American Psychiatric Association’s Diagnostic and Statistical Manual of Mental Disorders, 4thedition (“DSM-4”) to refute Dr Nagulendran’s assessment as Ms Barokah did not exhibit signs of considerable distress, agitation or mental or physical retardation. When the depressive episode is severe, the symptoms thereof are easily observable by any person. He maintained his opinion that Ms Barokah had a moderate depressive episode, which he explained is also quite bad. I do not need to dwell on this further as defence counsel conceded, after cross-examination of Dr Tommy Tan and when Dr Nagulendran took the witness stand, that Dr Tommy Tan’s assessment that the depressive episode was moderate was correct. 36     On the issue of pregnancy, Dr Tommy Tan opined that since it was probable that Ms Barokah did not know that she was pregnant, that could not have been a stressor causing her depression. During his four interviews with her in November 2005, each lasting for more than an hour, there was nothing said by Ms Barokah that would lead him to believe that she was pregnant then. None of the experienced nurses in Changi Women’s Prison noted any signs of pregnancy. As Ms Barokah carried her baby girl to full term and delivered on 3 July 2006, conception would have taken place sometime in end September or early October 2005. The offence was committed on 19 October 2005. The medical literature on this issue does not mention ante-natal hormonal changes that are linked to depression. 37     Dr Tommy Tan explained that his diagnosis of a moderate depressive episode was made wholly on the entries in Ms Barokah’s diary as she had not been forthcoming in the sessions with her. He could not ignore the entries which expressed abandonment by her husband and her wish to have her husband guide her so that she would not go wrong in things that mattered. He was not convinced that the stress of work, mistreatment by her employer or her pregnancy were causes of her depressive disorder. Ms Barokah had worked in Singapore before and therefore separation from her family might not be a substantive cause too. 38     Dr Tommy Tan emphasized that his earlier report stated that Ms Barokah “may” have a dependent personality disorder (“DPD”), not that he had diagnosed her to have such a disorder. Making such a diagnosis was extremely difficult as it required examination of the patient over a longer period of time and in different situations and it also needed collaboration with family members and others. He opined that she could satisfy some of the criteria for borderline personality disorder, such as wanting her husband to guide her in her decisions, fear of abandonment and getting into relationships with other men. Under cross-examination, he added the fact that she went to excessive lengths to meet her boyfriend, as indicated by Wee’s complaint to her son and daughter-in-law (see [28] and [29] above), also pointed towards possible DPD. While he could not make a positive diagnosis of DPD, to say that Ms Barokah did not have DPD would do her a disservice because DPD would figure very much in her treatment. While the diary entries could reflect depressive thoughts, getting into relationships with other men when her husband was not around was not a sign of depression. He agreed that she could have been merely lonely too. If the statements made by Ms Barokah’s family members tendered during the mitigation plea at the first hearing before me are accurate, they would point away from DPD. In the absence of other apparent stressors, he had to explore the possibility of DPD which might predispose her to developing a depressive episode. He maintained that she may have DPD. 39     Committing homicide was not within the realm of usual experience and therefore Ms Barokah would be remorseful over what had happened. She will need long term psychiatric follow-up, i.e. for life. He disagreed with Dr Nagulendran’s assessment that she could be treated within two years. No one could say with any certainty that she will not get involved with other men in the future and then experience the same guilt feelings. After all, there was already a recent history of two men within two years. Psychotherapy for a person who has committed homicide may require many years to help that person overcome the trauma of killing another and treatment for a person with a personality disorder will be even more challenging. Dr Tommy Tan, quoting the defence expert, Dr Helen Chen, whom he lauded as the best in her field of specialty, said that “Nothing is certain in psychiatry”. 40     Dr Tommy Tan agreed that fatigue from sleep deprivation - the defence said Ms Barokah had to wake up 5 to 8 times a night because of Wee’s husband’s incontinence - could keep a person with moderate depressive episode depressed or worsen the depression. He disagreed with Dr Nagulendran’s view that it is unlikely that there will be a recurrence of depressive episode as the causes of her mental disorder were transient and not of recurrent or lasting nature. While the particular set of circumstances at the material time was unique, there will be other events in the future which could cause Ms Barokah to be depressed again. Citing DSM-4, he noted that a person with a major depressive episode has a 60% risk of relapse. If the depressive episode was severe, the risk would be even more. Given the history of homicide in this case, Dr Tommy Tan would be very worried whether homicide will recur or whether there will be self-harm in future. 41     Dr Tommy Tan agreed that there are also favourable prognostic factors such as the fact that females are generally less prone to violence, that there was no prior history of violence and that good family support may lower the risk of recidivism. He also agreed that the fact that Ms Barokah was seen taking good care of her newborn baby in prison is a factor in her favour. As for her good behaviour in custody, he noted that prison is an artificial environment. As for remorse, he noted that there was no sign of that in Ms Barokah in the immediate aftermath of the offence and that, in his view, is a very negative factor. Another unfavourable factor is the fact that she tried to hide the truth from Wee’s family and the police. He agreed that she could be very frightened then too. He would assess her risk of re-offending as somewhere between low and moderate.",
        "The defence’s witnesses": "42     Mr Isnaini, 31 years of age, is Ms Barokah’s husband. At the first hearing before me, his handwritten note setting out his love for her and his desire for her prompt return was tendered in mitigation. His hometown is in Central Java, Indonesia. He has been working as a factory worker in a furniture factory in Muar, Malaysia, for the past seven years. He married his wife in 1998. As the couple worked in different countries, they communicated with each other over the telephone. 43     When Ms Barokah was working in Singapore, she would call him using her mobile phone. After she started working for Wee and her husband, she informed him in one of her calls that her mobile phone had been confiscated by the maid agency. Although surprised that she was able to contact him nonetheless, he did not question her about it. 44     On or about 17 October 2005, two days before the offence, they spoke over the telephone. He asked her how she had obtained a mobile phone to call him. She told him that she was using another mobile phone and, after repeated questioning by him about the source of that mobile phone, reluctantly replied that it was given to her by her boyfriend in Singapore. He was shattered upon hearing this and scolded her. She began to cry. He questioned her angrily and persistently about her relationship with the boyfriend and she denied having had sex with him. He then ended the call by warning her angrily that if she had had sex with the boyfriend, something bad would befall her. That was the last phone call they had before the offence on 19 October 2005. 45     On 21 October 2005, Mr Isnaini was informed by the Indonesian Embassy that his wife was in custody. He was shocked and concerned and has been following the court proceedings since then. He also attended the hearing when his wife was sentenced. In spite of all that has happened, he still loves her and wants her as his wife. When she is released from prison, he intends to end his contract in Malaysia (which ends in March 2009) and return home to Indonesia with her. He is sure he will be able to find a job there as a chauffeur or driver. He did not work as such for the last seven years because the pay for such jobs was very low. Nevertheless, he will try his best to manage and earn a living for his family. He has also accepted the baby girl born on 3 July 2006 as his own child and is happy to have a daughter. He brought the baby girl to Ms Barokah’s grandparents in Indonesia. He has forgiven his wife for her past mistakes. 46     Under cross-examination, Mr Isnaini denied that he had a girlfriend or that he had had sex with her. He agreed that he first visited Ms Barokah on 10 May 2006, more than six months after the date of the offence. That was because he was not permitted to come to Singapore earlier as the investigations were not completed then. He made various visits subsequently. Although there was a 10-month interval between the visits in November 2006 and in September 2007, that was due to his work in Malaysia. He needed his employer’s permission to come to Singapore. He is no longer angry with his wife. He did not accept the son that his wife had as a result of her affair in Indonesia but accepts the baby girl because of her gender and because his wife had already spoken to their neighbour to take care of the son. 47     Dr Helen Chen is a senior consultant psychiatrist at the KK Women’s and Children’s Hospital. She is the head of the Mental Wellness Service there. Her expertise is as a psychiatrist with special interest in women’s mental health and perinatal psychiatry. She prepared a report dated 21 August 2008 at the request of the police but was not called as an expert witness. At the request of defence counsel, she prepared another report dated 15 January 2009 after having interviewed Ms Barokah in prison on 16 December 2008 and on 8 January 2009. 48     Her first report was a general one relating to the state of a woman in her early weeks of pregnancy and for whom the pregnancy was most likely unplanned. Her second report contains a cautionary note about the accuracy of information from Ms Barokah as her contact with Ms Barokah was made after more than three years after the offence. Further, as Ms Barokah had had extensive interviews with Dr Tommy Tan and Dr Nagulendran and with the police, these could influence her memory, understanding and account of the events. Dr Helen Chen also emphasized that her expertise is not as an obstetric specialist. In this second report, she recorded that Ms Barokah claimed to have had low mood after she started her last employment, troubled as she was by thoughts about her relationships and missing her home and children. She was exhausted as she had to rise up to five times a night to help Wee’s husband go to the toilet but did not experience nausea or vomiting. However, she could not eat. That was noticed by Wee’s son (Lee Seng Lim) who asked her why she hardly ate but she did not say much to him (see also [31] above). She had no idea that she was pregnant until two months after her arrest when she missed her menses. However, she was worried about being pregnant in the weeks before 19 October 2005 after having sex with her boyfriend four or five days after starting work in Wee’s flat on (20 September 2005). 49     On 19 October 2005, Ms Barokah went to meet her boyfriend to initiate a break-up as she felt remorseful about her wrongdoing towards her husband. She was also troubled that her husband was having an affair as well. She was not able to clarify if the worries about being pregnant had been troubling her in the hours leading to her confrontation with Wee. Dr Helen Chen said that the commonly experienced symptoms of early pregnancy include fatigue, nausea, vomiting, poor appetite and emotional lability. She was of the view that her pregnancy possibly contributed to Ms Barokah’s fatigue in the two to three weeks prior to and at the time of the offence. However, her fatigue could also be a symptom of her depression or due to lack of sleep from her night-time activities and duties. She could not ascertain the influence of each factor on her mental state or quantify the severity of the fatigue. There is no available literature on fatigue in early pregnancy. Given her troubled mental state and her account that she returned to Wee’s flat at 2 am on 19 October 2005 and was awake with Wee and her husband until the time of the offence, she could have been extremely exhausted as the sense of fatigue experienced in early pregnancy could be intensive for some women. For women with unplanned and unwanted pregnancy, the likelihood of antenatal depression is even higher. 50     Dr Helen Chen emphasized that she is not a forensic trained psychiatrist and Ms Barokah being the first woman she was seeing who was alleged to have committed homicide, she refrained from giving any opinion on the likelihood of Ms Barokah re-offending. She noted, however, that Ms Barokah cared for and nursed her baby girl for about 20 months in prison. She concluded by stating: In summary, I am of the opinion that Ms Barokah was in the early weeks of pregnancy at the time of the alleged offence. Taking in view the limitations of my assessment after a time lapse of 3 years, amongst other limitations, I am of the opinion that her state of mind at the time leading up to the offence was likely affected by her depression, as well as fatigue, and her worries of possibly being pregnant and personal problems then. 51     Dr Helen Chen explained, under cross-examination, that 9 out of 10 pregnant women do not suffer depression. Asked to comment on paragraph 29 of the Statement of Facts tendered at the first hearing before me (describing how Ms Barokah returned to Wee’s flat and carried Wee onto the bed before pushing her out of the window), she commented that the acts there did not seem to be those of an extremely exhausted woman. Ms Barokah had told her that she had to struggle to move Wee. Shown photographs of Ms Barokah taken on 19 October 2005, Dr Helen Chen agreed that they did not show a malnourished woman. Ms Barokah bonded well with her baby girl and has not hurt her unlike others who have their freedom who may abandon their children. 52     In his oral testimony, Dr Nagulendran conceded that Ms Barokah’s major depressive episode could be classified as moderate (as against his own assessment that it was severe). His assessment of her mental state was “at the time of the alleged offence”, not the weeks or months preceding that. If the offence had not taken place, a continuation of her severe reactive depression would eventually lead to her disability to continue with social, work or domestic activities. After reading Dr Tommy Tan’s second report of 5 April 2007 where possible DPD was diagnosed, Dr Nagulendran conducted another three interviews with Ms Barokah. He did not ask her any questions relating to DPD as he had no doubts in his mind that she did not have DPD. In his report of 6 March 2008 (which the Court of Appeal initially rejected at the application to admit further evidence but which I now consider as part of the evidence I have to take into account in view of the developments highlighted in [1] to [5] above), Dr Nagulendran opined, in disagreeing with the last six lines of [61] of my previous judgment, that Ms Barokah did not have DPD as she did not satisfy the diagnostic criteria for this set out in DSM-4. He also stated that she did not have a violent temperament as there was no past evidence of violent behaviour and that she did not have a history of violence in her previous employments. There was no evidence of her instability. There is no reason for Dr Nagulendran to believe that she will re-offend as “the incident was specific to a particular set of circumstances which were reactive in nature and not due to genetic, organic or personality defects”. The causes of her mental disorder were transient and not of recurrent or lasting nature. She also has strong family support as evidenced by the testimonials tendered during the mitigation plea. 53     In his report of 12 June 2008, Dr Nagulendran provided the reasons for his assessment of severe depressive episode (which is now irrelevant in the light of his concession at [52] above). On pregnancy, he cited from literature and opined that the fact that Ms Barokah was one month pregnant and already suffering from depression with the associated hormonal changes would have contributed to the severity of her illness. On the issue of DPD, he stood by his earlier assessment and explained that DPD is a life long condition and is not due to a single episode of a transient nature. Treatment for DPD is in the form of psychotherapy for a reasonable period depending on the patient’s ability to understand her condition and her motivation to improve. Even if Ms Barokah has DPD, she is unlikely to re-offend for the reasons listed in his report of 6 March 2008. Although there are some differences between the agreed Statement of Facts and the information provided through Ms Barokah, he stands by his conclusions and opinions. He was also of the opinion that the fact that he did not interview Ms Barokah in the immediate aftermath of the offence would not result in his assessment carrying less weight. He did not think it necessary to interview Wee’s family members and/or other relevant persons because the information would not differ from that given to the prosecution. 54     In his report of 24 July 2008, Dr Nagulendran opined that as Ms Barokah was already experiencing symptoms of depression, the hormonal changes that occur during pregnancy would have contributed to the worsening of her depression. The symptoms of morning sickness, anxiety and depression are generally suffered regardless of the woman’s awareness or knowledge of her pregnancy. He reiterated his opinion that Ms Barokah was not suffering from DPD or a borderline personality disorder (referred to by Dr Tommy Tan) as there were no features to indicate the presence of these conditions. He quoted the following conclusions from his earlier report of 11 July 2007: (a)    The causes of her illness were a series of reactive factors that occurred from the onset of the illness in 2004 and continued till the time of the incident on 19 October 2005. (b)    Due to change of circumstances and passage of time these reactive factors have lessened in significance. This is reflected in her current state of mind which shows significant improvement. (c)    Barokah has now to deal with a new set of factors such as her sadness to the death of the deceased, her return to acceptance of her family and society and her rehabilitation to her responsibility as a wife to her husband and mother to her children. (d)    She would require psychotherapy, counseling (sic) and supervision. (e)    The duration of the treatment would be for two years. (f)     The incident was specific to a particular set of circumstances which were reactive in nature and not due to genetic, organic or personality defects. (g)    It is unlikely that there will be a recurrence of such abnormality of mind as the causes of her mental disorder were transient and not of recurrent or lasting nature. 55     Because of the positive prognostic factors in Ms Barokah’s favour, Dr Nagulendran was of the view that she would fall within the 40% of people who would not suffer a second major depressive episode rather than the 60% who would. He felt that she was not hiding facts from the police as she told the police the same day that there was pushing by both parties and she did not intend to push Wee out of the window. However, he agreed that her version about the death fall was not consistent with the Statement of Facts which she has admitted to in court. He also agreed that there was some value judgment involved in psychiatric assessment.",
        "The decision of the court": "56     Since the first hearing before me in November 2007, s 304(a) of the Penal Code (Cap 224, 1985 Ed) has been amended. With effect from 1 February 2008, the punishments are imprisonment for life or for a term of up to 20 years, with a liability to fine or to caning (see Cap 224, 2008 Rev Ed). The applicable law is that before 1 February 2008 as the offence was committed on 19 October 2005 and that law provides for imprisonment for life or for a term of up to 10 years with the same liability to fine or to caning. 57     Even though the psychiatrists opined that Ms Barokah qualified under exception 7 in s 300 of the Penal Code, “intention of causing death” is still a necessary ingredient of the charge here under s 304(a). This section is not all about accused persons who are suffering from depression or other mental problems. There are six other exceptions in s 300 which, if applicable, would render culpable homicide not to be murder. 58     In so far as the psychiatric evidence is concerned in this case, it is now common ground that the major depressive episode suffered by Ms Barokah can be categorized as mild instead of severe, although I note that Dr Nagulendran qualified his concession by saying that his assessment of her mental state was “at the time of the alleged offence”, not the weeks or months preceding that (see [52] above). Where DPD is concerned, while there is no firm diagnosis of this for the reasons stated by Dr Tommy Tan, he still has strong suspicions that DPD may be present. Where the effects of pregnancy are concerned, it cannot be seriously disputed that conception probably occurred no earlier than end September 2005. The medical evidence establishes that and it is fortified by Ms Barokah’s statement to Dr Helen Chen that she had sex with her boyfriend some 4 to 5 days after starting work in Wee’s flat on 20 September 2005. Further, the full-term baby girl was born on 3 July 2006 and that would be more than nine months after September 2005. Ms Barokah did not even know about her pregnancy until around mid-December 2005. She had been pregnant twice before and should be aware of the symptoms if they did surface. The prison’s nursing staff certainly saw no sign of any pregnancy-related problems in November 2005 or they would have highlighted them to Dr Tommy Tan who was interviewing Ms Barokah then. As Dr Tommy Tan said, pregnancy therefore could not have been a stressor for her. I note, however, that she could have been worried about being impregnated by another man who was not her husband and the worries might have added to her problems. At the same time, such worries about pregnancy are not entirely new to her. 59     On the facts, it seems that the guilt of her two instances of infidelity coupled with her suspicions about her husband’s fidelity were the predominant stressors. The pregnancy did not cause the depression and neither did the worries about pregnancy exacerbate it significantly. Given that she had interrupted sleep at night for one month because of Wee’s husband, there was nothing to suggest that she could not rest at all during the day. As taking care of Wee’s husband was likened by her to taking care of a baby, it should not be a very daunting task for a mother of two. Within a week of starting work at Wee’s flat, she managed to have a paramour and to have sex with him. Where the sexual liaison took place and at what time of the day are not in evidence but this shows she certainly had free time and energy. 60     Dr Tommy Tan assessed the risks of re-offending at somewhere between low and moderate. This is subject to Ms Barokah having long-term (i.e. life long) psychiatric follow-up. Although he agreed there were prognostic factors favourable to her, these must be weighed against the negative factors. In my view and with utmost respect to the psychiatrists, this is an exercise in value judgment and commonsense. It involves making a considered judgment concerning the unknown future based on present known facts. 61     The risks of re-offending will in turn depend on whether Ms Barokah can effectively resolve her inner turmoil causing her depression. Her history so far has not shown encouraging signs. Within 18 months after the break-up of her first affair in Indonesia, she got herself into another one in Singapore and that within days of commencing work with new employers. While we do not judge her freedom of choice as to how she wants to live her life, if such choice leads her to depression (which it has) which then leads her to commit a serious offence (such as killing an unconscious elderly woman), then we must seriously consider whether she ought to have that freedom. It is natural for prisoners, especially inmates in their initial few years of incarceration, to behave very well in custody. We should also not place undue weight on her nursing and care for her baby girl in the 20 months or so after birth while in prison. She was a relatively new inmate in a prison in a foreign land. Her baby girl in these circumstances would be her only relative and solace. As Dr Helen Chen noted, she fared better on this score than others with liberty who may abandon their offspring. Therein lies the key difference – we are not comparing one free person with another. Of course, I do not suggest by this comment that Ms Barokah will abandon her baby girl once she is released from custody but am only cautioning against giving undue weight to an event that happened in the controlled setting of a prison. 62     I have no doubt about the sincerity and seriousness of the Indonesian Embassy’s assurance given through defence counsel in his closing submissions that it will do all it can to assist Ms Barokah to receive the necessary medical or psychiatric treatment and follow-up in Indonesia upon her release from prison. This is of course dependent on whether Ms Barokah is willing to receive and comply with such treatment over the long term and whether she will again decide to work overseas. 63     As for her husband, I also have no doubt that his feelings for her are sincere and remain strong and I commend him for his forgiving attitude towards his wife. His infrequent visits to the prison may be explained by the fact that he is working outside Singapore and is obviously not holding a high position such that he could travel anytime and however often he wishes. However, I doubt very much that he will be able to manage his family’s finances, especially with a growing boy and now the baby girl as well, by returning home to look for whatever work is available. He could not get by for the last seven years or so and had to work overseas. He had even prohibited his wife from working as a domestic helper but she nevertheless insisted on working as one in order to help with the family’s finances. I said in my previous judgment (at [61] thereof) that “there is no evidence that her family’s finances have got any better”. The position has not changed after hearing all the evidence at the second hearing. There is every likelihood that Mr Isnaini and/or Ms Barokah will again feel the need to work abroad, bearing in mind the increasing needs of two growing children. They are therefore unlikely to be able to be together frequently. 64     The point is that the circumstances building up to Ms Barokah’s depression and criminal conduct will still be at play and perhaps even more so in the near future. It is hard to say with any confidence that a tragic event akin to that of 19 October 2005 will not happen again. Dr Nagulendran opined that “the incident was specific to a particular set of circumstances which were reactive in nature and not due to genetic, organic or personality defects” and “it is unlikely that there will be a recurrence of such abnormality of mind as the causes of her mental disorder were transient and not of recurrent or lasting nature” in giving a very favourable prognosis for Ms Barokah. With respect, I do not agree with his optimistic assessment. As explained above, a repeat of the situation leading to depression is likely given the propensity of Ms Barokah to become close to other men. Cut to the core, there is really nothing unique about the events that happened in the early hours of 19 October 2005. It was in essence a case of an employer reprimanding an employee who, without good reason, was not at her place of duty. The employee was clearly in the wrong and could offer no excuse. A quarrel ensued and a scuffle followed. The employee fears she will be dismissed as a result. This is hardly a most unusual situation never to be re-enacted in some form. Further, as Dr Tommy Tan said (at [40] above), there will be other events in the future which could cause Ms Barokah to be depressed again, especially when there is a 60% chance of relapse. 65     Dr Nagulendran also thought that having no prior history of violent behaviour was favourable for Ms Barokah. I ask here rhetorically who is more dangerous – a person who pushes and punches others over several periods of time or a seemingly harmless person who kills only once? Similarly, which is more violent - to throw things at a sleeping person on different occasions or to throw the sleeping person down nine floors on only one occasion? The severity of the single act of violence should surely outweigh the many comparatively minor manifestations of violence. Ms Barokah emerged from the scuffle relatively unscathed. In contrast, Wee’s blood was shed and there was evidence of strangulation. Defence counsel submitted that Ms Barokah was of smaller build than Wee. Even if that is true, Ms Barokah still managed to drag Wee onto the bed and lift her out of the window. As stated in [57] of my previous judgment, there was a time lapse between the scuffle and the killing. The act of pushing Wee to her death was not a continuum of the struggle between the two women. Having no prior history of violence in a case like the present therefore does not help Ms Barokah. 66     It is my view that Ms Barokah, with or without DPD, has a brittle, volatile and violent temperament infused with largely self-induced turmoil (i.e. having sexual relationships with different men and then feeling guilty and depressed). She requires life-long follow-up and has a 60% chance of relapse of her major depressive episode. She has shown what she is capable of when depressed, even when she knows she is clearly in the wrong. 67     Defence counsel reminded me that the burden is on the prosecution to establish that an accused person is likely to remain a future and real danger to the public without medication and permanent incarceration (PP v Constance Chee[2006] 2 SLR 707at [16]). He also submitted that considerations of general and specific deterrence have penumbral significance when dealing with accused persons with mental disorders, especially when a causal link is established between the mental disorder and the offence (Ng So Kuen Connie v PP[2003] 3 SLR 178). 68     Reference was made to Chan Seng Onn J’s analysis of s 304(a) of the Penal Code inPP v Aniza bte Essa[2008] 3 SLR 832(“Aniza”) (at [41] to [49]) where the accused was sentenced to 9 years’ imprisonment. We should note at this juncture that there is an editorial note to this case stating: The Prosecution’s appeal against this decision in CCA 2 of 2008 was heard by the Court of Appeal (Chan Sek Keong CJ, Andrew Phang Boon Leong and V K Rajah JJA) on 28 July 2008. Judgment was reserved. I am informed that the Court of Appeal has not given its decision inAnizayet. With that cautionary note thatAnizais under appeal, I now refer to Chan Seng Onn J’s analysis there. The judge opined (at [44]) that the normally high degree of culpability inherent in a s 304(a) offence cannot of itself be a sufficient criterion for imposing life imprisonment. Further, because of the huge gulf between 10 years and life imprisonment, there must be some other special reason or circumstance before the maximum is imposed (at [45]). The judge went on to say at [47]: Another special circumstance in the context of s 304(a) is that the manner in which the defendant commits the offence is so cruel and inhumane that the defendant does not deserve any leniency whatsoever and that the only just sentence is the maximum of life imprisonment and any other sentence is simply too lenient (eg, the deceased was tortured to death or was subjected to a very slow and painful death at the hands of the defendant who burnt the victim to death by fire or by acid). Here the overriding concern is not so much the protection of the public from a likely repetition by the offender if released, but the need to mete out the maximum punishment to register society’s sheer abhorrence of what the offender has done, to deter others accordingly, and to ensure that the offender’s punishment is therefore proportionate to the utterly sadistic and cruel acts he did. In my view, the maximum punishment in the situation envisaged above would serve the purpose of retribution, one of the 4 tenets of sentencing, rather than general deterrence. 69     Let us consider the circumstances of the killing in the current case. If the version of events put by defence counsel to Richard Chew at [22] above is correct, it would seem that Ms Barokah was very clear-thinking in the morning of 19 October 2005. It then begs the question whether she had really been so depressed and disturbed minutes earlier when she pushed Wee out of the window while Wee’s husband was seeking Richard Chew’s help. The evidence from Lee Seng Lim, his wife and the first two police officers buttressed what I said at [59] of my previous judgment that Ms Barokah was actually quite collected in her thought process that morning despite her depression and reinforced my assessment of her (at [57]) as a cold-blooded and dangerous killer. 70     Impairment of the mind is a matter of degree and judgment and depends to some extent onex post factohypothesis and the truth and accuracy of the input from the subject and others. Some mentally disturbed persons are much more impaired than others. “Nothing is certain in psychiatry” (see [39]). In Ms Barokah’s case, her actions and words showed that she was actively and consciously trying to dissociate herself from the horrendous crime against the unconscious, elderly woman. Her depressive episode was largely self-induced (by her choice to have intimate relationships) and the situation was created by her leaving Wee’s flat that fateful night when she ought not to have done so. The cruel and inhumane killing was totally unjustified in the circumstances here. There should therefore be a strong measure of retribution here in addition to all the other considerations mentioned earlier. 71     Justice is not only about accused persons. As V K Rajah J (as he then was) said inPP v Aguilar Guen Garlejo[2006] 3 SLR 247at [57]: While sympathy may be added, justice cannot be subtracted from the sentencing equation. Justice is also about the victims and their families and the good of society at large. While we are concerned about the future of accused persons and their families, we must never forget the victims and their families. The victim in this case has no voice but the court’s and has no future to even think about as a result of the crime. 72     Having heard all the witnesses in this second hearing, my views expressed in my previous judgment (in particular [57] to [62]) have not changed. Even if Ms Barokah does not have DPD and the references to DPD in my previous judgment are removed, her recent history still shows that she has the propensity to get into relationships with men and then feel guilty and depressed and we have seen one devastating consequence of her depression. I am still of the view that life imprisonment is the correct sentence for her and I now sentence Ms Barokah to life imprisonment with effect from the date of her arrest on 19 October 2005."
    }
}