{
    "case_title": "Louis Vuitton Malletier v City Chain Stores (S) Pte Ltd and Another Matter",
    "ncitation": "[2009] SGHC 24",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Background": "",
        "The parties": "4       The plaintiff is a company incorporated in France. It was founded in 1854 and commenced business as a trunk maker. Today, it is a leading global brand of luxury goods and was positioned at 17thin Interbrand’s rankings of Best Global Brands in 2007, with an estimated brand value of some US$20.3 billion. 5       The plaintiff is part of the LVMH Group which was formed in 1987 following a merger between the plaintiff and Moét Hennessy, the wine and spirits conglomerate. The plaintiff’s brand, Louis Vuitton (or LV), is considered the “crown jewel” among all the brands in the LVMH Group. The plaintiff’s product line includes fashion and travel items, luggage, handbags, leather goods, ready-to-wear fashion (prêt-a-porter), footwear, jewellery, writing instruments and sunglasses. Since 2002, the plaintiff has also been manufacturing and selling watches. 6       In Singapore, the plaintiff’s products are available exclusively through its wholly owned subsidiary LVMH Fashion Singapore Pte Ltd (“LVMH Fashion (S)”) which had a turnover of about $376 million in 2007 (not based on annual returns). Presently, the plaintiff operates three stores in Singapore, including its flagship store at Ngee Ann City. 7       The defendant, a Singapore-incorporated company, is a wholly-owned, indirect subsidiary of Stelux Holdings International Limited (“Stelux”). Stelux was founded in 1963 and has been listed on the Hong Kong Stock Exchange since 1972. It operates two major retail chains: its watch retail business, “City Chain”, and its optical retail business, “Optical 88”. More than 360 City Chain stores and counters are operating in Hong Kong, Macau, China, Thailand, Malaysia and Singapore. 8       The defendant is part of the City Chain retail chain that was first established in Hong Kong in 1985. Its primary business is the operation of chain stores in various parts of Singapore which sell watches and clocks. The defendant also operates “concept shops” in Singapore, including “moments”, “C2of City Chain” and “CITHARA”. The “City Chain” name is a registered trade mark in Singapore. 9       Stelux had business dealings with the LVMH Group prior to this dispute. The defendant’s second witness, Mr Chu Kai Wah (“Chu KW”), who is the Executive Director of Stelux, said during cross-examination that Stelux was endeavouring to raise the profit margin of its watch retail business by entering niche markets. For example, the ‘moments’ store in Hong Kong carried Tag Heuer, Christian Dior and Fendi watches. These three brands are part of the LVMH Group. Stelux was also negotiating for dealership rights in Singapore for Tag Heuer. Chu KW asserted that these business relationships did not afford it much insight into the plaintiff’s watch business because its contacts with the LVMH Group were limited to the relevant personnel and product knowledge concerning the Tag Heuer, Christian Dior and Fendi watches that Stelux carried in its stores.",
        "The alleged trade mark infringements": "10     From 1896 until recently, the plaintiff applied the Monogram Canvas design (“the Monogram”) to all of its goods; today, the Monogram is still applied to a majority of the plaintiff’s products. The plaintiff’s primary witness, Mr Daniel Roland Plane (“Plane”), averred that “the [plaintiff’s] enormous goodwill and reputation in its name, its products and its brand resides largely in ... the [Monogram]”. 11     The Monogram was first registered as a trade mark in France in 1905; since then it has been registered in many countries”. In Singapore, the Monogram is registered as a trade mark in a number of classes. 12     The Monogram consists of four constituent elements set in a repeating pattern. Two of the constituent elements are particularly relevant in this action: (i)     the “Flower Quatrefoil”, which is registered in Singapore under Trade Mark No T0514535D; and (ii)    the “Flower Quatrefoil Diamond”, which is registered in Singapore under Trade Mark No T0512683Z. The Singapore registrations of the Flower Quatrefoil and the Flower Quatrefoil Diamond (“the Trade Marks”) were valid and subsisting at all material times. 13     The other two constituent elements of the Monogram are (i) a monogram of the letters “L” and “V”, being the initials of the founder, Louis Vuitton; and (ii) a graphical motif known as the “Circular Flower”. The four constituent elements of the Monogram are themselves registered in numerous countries, including Singapore. 14     The plaintiff has applied the Trade Marks to its watches since 2002, and since 2004, has been selling watches that bear the Trade Marks in Singapore. The Trade Marks are used on the faces and the straps of the plaintiff’s watches. The plaintiff estimated that its annual sales in Singapore of watches bearing the Trade Marks were:  YearS$20051.9 million20061.7 million2007 (June)800,000 15     In November 2006, the defendant launched a range of watches bearing the “Solvil” trade mark and a flower device (the “Solvil watch(es)”) in Singapore. The plaintiff claimed that the flower device on the Solvil watches (“the Solvil flower device”) is identical or similar to the Trade Marks. 16     Plane is a solicitor based in Hong Kong. He was employed as a senior anti-counterfeiting manager in the Hong Kong offices of Louis Vuitton Pacific Ltd from 4 January 2006 to 31 August 2007 and was requested by the plaintiff to testify on its behalf in these proceedings. At the material time, Plane had responsibility for the design and management of the intellectual property enforcement programmes for the LVMH Fashion Group in the Asia Pacific region. 17     When Plane discovered in 2007 that the alleged infringing watches were being offered at City Chain outlets in China, he instructed his company’s lawyers and investigators to visit City Chain outlets in Hong Kong and a number of cities in China, including Shanghai, Beijing, Shenzhen and Guangzhou. Similar action was taken in Kuala Lumpur and Singapore. Trap purchases were made. Plane then instructed that coordinated enforcement raids be conducted against the City Chain outlets in China, Malaysia and Singapore that had been found to be selling the Solvil watches. 18     Infinitus Law Corporation (“Infinitus) is the plaintiff’s legal counsel in Singapore on trade mark enforcement matters. Acting on Infinitus’ instructions, a private investigator, Mr Ng Chui Guan (“Ng”), from the firm HS Intellectual Property Services (“HS”) visited the defendant’s outlets at The Central, Marina Square, Suntec City Mall and Plaza Singapura between 4 and 9 May 2007 and bought one Solvil watch from each outlet. Ng also deposed that between 9 May 2007 and 13 May 2007, he and other HS investigators visited 22 City Chain outlets (other than the four abovementioned outlets) and observed that the Solvil watches were available or on display at these outlets.",
        "Commencement of criminal proceedings": "19     The plaintiff proceeded to file four complaints against the defendant on 15 May 200 (“the Complaints”), alleging that there were goods in the defendant’s stores that were the subject of an offence under s 49 of the Trade Marks Act (Cap 332, 2005 Rev Ed) (“the Act”). The Complaints sought the seizure of all goods that falsely applied the Trade Marks or bore marks “so identical or calculated to look like”, or “so nearly resembling” the Trade Marks. The Complaints were signed by Ms Teh Ee-Von (“Ms Teh”), a solicitor in the employ of Infinitus. Annexed to the complaints was Ng’s statutory declaration (“SD”) concerning the trap purchases that he made on behalf on the plaintiff and an examination report on the Solvil watches by Ms Nalini Menon (“Ms Menon”), a senior legal executive with Infinitus. 20     The Magistrate issued four search warrants (Nos 64/2007 to 67/2007) against the defendants and the searches were executed at the four above-mentioned outlets on 16 May 2007 by officers from the Intellectual Property Rights Branch of the Criminal Investigation Department. A total of 24 Solvil watches were seized at these raids. 21     On 16 November 2007, four charges in Private Summons Nos 2246-2007 to 2249-2007 (“the Charges”) were issued against the defendant for breaching s 49(c) of the Act. The defendant was charged with falsely applying the “Flower Quatrefoil” trade mark. Unlike the Complaints, none of the Charges referred to the “Flower Quatrefoil Diamond” trade mark. The CR 22     The defendant applied by way of the CR for the search warrants issued by the Magistrate to be quashed (for convenience, the applicant in the CR is referred to as the defendant, which is its position in the Suit). The grounds for the CR were: (a)    when Ms Teh applied for the search warrants, “she did not provide any or any sufficient information” to the Magistrate that there was reasonable cause for suspecting that the four City Chain outlets stored goods that were the subject of an offence under s 49 of the Act; and (b)    the Charges did not disclose the commission of any offence under s 49(c) of the Act in respect of the Flower Quatrefoil. 23     In respect of ground (a), the defendant pointed out that each of the complaints exhibited Ng’s SD and Ms Menon’s examination report but not the Solvil watches. The defendant further questioned whether the Magistrate had inspected the Solvil watches prior to issuing the search warrants. 24     On ground (b), the defendant took issue with the contents of Ng’s SD and Ms Menon’s examination report which, it alleged, did not deal with nor establish the elements of the offence to the requisite, or any, standard of proof. Ng’s SD stated that the Solvil watches were “imprinted with parts of Louis Vuitton trade marks/devices only”, which, according to the defendant, fell short of establishing that the defendant had improperly used the plaintiff’s registered trade marks such that they could be mistaken for the real trade marks. As for Ms Menon’s examination report, the defendant submitted that she had cited irrelevant considerations that did not give rise to “reasonable cause” under s 49 of the Act for suspecting that the seized Solvil watches were the subject of a criminal offence. The “irrelevant considerations”, according to the defendant, were that: (a)    genuine Louis Vuitton articles were only sold at Louis Vuitton boutique shops; (b)    the metal/materials used on the Solvil watches were of inferior quality and such metal/materials were not used by Louis Vuitton; (c)    the workmanship used on the defendant’s watches was inconsistent with genuine Louis Vuitton articles; and (d)    Louis Vuitton articles were never sold at $130 each. 25     In its submissions, the defendant also took issue with the mistaken name under which the complaints had been taken out,vizLouis Vuitton Malletier A Paris. This entity was no longer in existence. 26     Ms Teh deposed in her affidavit filed on 22 February 2008 in respect of the CR that she did show the Solvil watches that were obtained through Ng’s trap purchases to the Magistrate when she appeared before the latter to swear the complaints. In her experience, the magistrate usually issued the search warrant only after seeing the trap purchase. Ms Teh added that she also showed the plaintiff’s watch catalogues (depicting its watches bearing the Flower Quatrefoil) to the Magistrate.",
        "Commencement of the Suit": "27     Shortly after the Charges were filed against the defendant, the plaintiff filed the writ of summons in the present action on 13 December 2007. In summary, the plaintiff sought the following relief in the Suit: (i)     an injunction to restrain the defendant from doing any acts that would infringe the Trade Marks, pass off the defendant’s watches as the plaintiff’s (as a result of the use of flower devices identical with, similar to or colourably imitative of the plaintiff’s flower devices in the Trade Marks), or cause confusion or indicate a connection between the defendant’s goods and the plaintiff’s; (ii)    a declaration that the plaintiff’s Trade Marks were well-known marks within the definition of s 2(1) of the Trade Marks Act; (iii)  an inquiry into damages suffered by the plaintiff or, at its option, an account of profits by the defendant, or, in the alternative and at the election of the plaintiff, statutory damages under s 31(5) of the Act; (iv)   delivery up within seven days of the judgment in the Suit of all watches and other articles within the control of the defendant that used flower devices identical with, similar to or colourably imitative of the plaintiff’s flower devices in the Trade Marks; (v)    full discovery of all the defendant’s acts of trade mark infringement and passing off; (vi)   costs; and (vii)  interest. 28     The thrust of the defence was: (a)    each of the Solvil flower devices was not used as a trade mark on the Solvil watches, but as a “mere decorative embellishment or element”; (b)    the use of the Solvil flower device was not a misrepresentation that was likely to deceive the public as there was no likelihood of confusion on the part of the “relevant public in Singapore” as a result of such use and it did not cause and was not likely to cause damage to the plaintiff; (c)    the Trade Marks were not well-known to the “relevant sector of the public or the public at large”; and (d)    the Solvil watches did not infringe s 55 of the Act.",
        "The plaintiff’s allegations": "",
        "Trade mark infringement": "29     Pursuant to s 27 of the Act, a trade mark is infringed if, without the consent of the trade mark proprietor, (a)    a person uses a sign in the course of trade that is “identical with the trade mark in relation to goods or services which are identical with those for which it is registered (s 27(1)); or (b)    a person uses a sign in the course of trade that: (i)     is identical with the trade mark and is used in relation to goods or services similar to those for which the trade mark is registered; or (ii)   is similar to the trade mark and is used in relation to goods or services identical with or similar to those for which the trade mark is registered, such that “there exists a likelihood of confusion on the part of the public” (s 27(2)). 30     The plaintiff submitted that, conceptually and visually, the Solvil flower device was identical to the Flower Quatrefoil. The defendant had therefore used signs that were identical with or similar to the Trade Marks on identical goods, namely watches. Although the Solvil flower devices on the watch faces of the Solvil watches were incomplete, they had four pointed petal signs that were equal in length and which converged at the centre. The interior of the outline star or flower contained little diamantes, with a larger diamante set in the middle. This larger diamante in the centre, the plaintiff asserted, had an equivalent function as the circle in the centre of the Flower Quatrefoil. Even if the stark difference in workmanship would be discernible when a Louis Vuitton watch and a Solvil watch were placed side by side, the plaintiff insisted that the Solvil flower device was a copy or a counterfeit of the Flower Quatrefoil. Should the court find that the Solvil flower devices were not identical with the Trade Marks, the plaintiff contended that “the differences ... are minor and the defendant’s signs are therefore similar to the Trade Marks and are likely to cause confusion on the part of the public”. 31     The plaintiff further sought to demonstrate to the court that by employing the Solvil flower device on the watch faces and bracelets, the defendant employed its flower device in an identical or similar manner as the plaintiff. This would “cause unwary members of the public to believe that the Infringing Watches originate from the Plaintiff because [the Solvil flower device] is utilised in entirely the same way that the Plaintiff uses the Trade Marks on its genuine watches”. A person looking at the Solvil watch from afar would only see the quatrefoil flowers which appeared to be the Trade Marks and not the word “Solvil” printed in small font on the watch face. 32     To support its assertion, the plaintiff exhibited its Tambour Lovely White model which comprised a number of Flower Quatrefoils on its watch face, a Flower Quatrefoil Diamond on its strap above the dial and a “LV” logo on its strap below the dial. The plaintiff pointed out that one of the Solvil watches that Chu KW exhibited in his AEIC, with model number 48-0067-003, was also designed with quatrefoil flowers on its face and on the top and bottom of the strap. 33     In his AEIC, Plane elaborated on the plaintiff’s claims about the possibility of confusion: 39     ... the Plaintiff employs the three floral motifs of the Monogram (including the Trade Marks) on the watches in such a way that the motifs function as trade marks and provide aesthetic appeal on the watch faces and bracelets... 40     Therefore, whilst the words “LOUIS VUITTON” are found on the watch face in smaller letters, it is the larger floral marks including where used, the Trade Marks, that are most prominent and visible visual elements from afar and which readily and clearly identify and set apart the watches as originating from the plaintiff. 41     ... the use of the Trade Marks on the Plaintiff’s watches will enable and cause anyone looking at the Plaintiff’s watches to immediately identify the same as originating from the Plaintiff, without the need to see the words “LOUIS VUITTON” on the watch face from up close. 34     Plane further deposed that it was an accepted practice in the watch trade that “secondary trade marks” could be used under licensing, authorisation or sponsorship arrangements. This could confuse the public into thinking that the Solvil watches had been authorised by, or were somehow associated with, the plaintiff, even if they examined the watches up close and noticed the “Solvil” brand name. He stated in his AEIC (at [112]): These customers [who see the Trade Marks on the watch faces and bracelets of the Solvil watches] may be tempted to buy them in the belief that there may be some association or that they are “second line” products... the customers may have cause to wonder whether they are in fact getting a product that had been authorized [by] the plaintiff. The moment the consumers have to wonder – there is a likelihood of confusion or deception. 35     The defendant, however, asserted that the Solvil watches were not identical with or similar to the plaintiff’s watches because, compared with the Flower Quatrefoil, the Solvil flower device: (a)    did not comprise any empty circle shape (at the centre); (b)    was different in shape from the Trade Marks; (c)    was decorated with inter-locking diamantes; and (d)    was an incomplete design formed by irregular stitching. In contrast with the Flower Quatrefoil Diamond, the Solvil flower device did not have any diamond shape. 36     The defendant contended that the quatrefoil flower has been used “as an ornament, embellishment or a decorative device for various objects for several centuries”, and it does not “inherently or automatically [act] as a trade mark indicating the trade origin of goods.” In his AEIC, Chu KW exhibited photographs of jewellery pieces using the quatrefoil flower design which had been purchased from Perlini’s Silver, Mintmark & Co and Citigems in Singapore, and the Alhambra collection by Van Cleef & Arpels. The defendant also showed the use of the quatrefoil flower design in several architectural works, namely the Doge’s Palace in Venice, Italy, the Milan Cathedral in Milan, Italy and the spire of the Houses of Parliament, London, United Kingdom, as well as in artistic works such as the Santa Maria Polyptych painting. In the same way, the Solvil flower device was used on the Solvil watches for ornamental and decorative purposes only. 37     When Plane was shown the photographs of the above-mentioned jewellery pieces purchased from Perlini’s Silver, Mintmark & Co and Citigems during cross-examination, he said that if he were still in charge of the plaintiff’s anti-counterfeiting enforcement programme in Asia Pacific, he would have pursued enforcement action against these proprietors because the quatrefoil flower patterns were being used as trade marks. He also intimated that the plaintiff had been in discussion with Van Cleef & Arpels for some time about the (alleged) similarity between Van Cleef & Arpels’ design for its Alhambra collection and the plaintiff’s Circular Flower. 38     The plaintiff alleged that Stelux did not refrain from using the Trade Marks on the Solvil watches because it regarded itself as being entitled to do so; this followed from the defendant’s argument that the quatrefoil flower was a common sign in the trade. The plaintiff submitted that the proper course of action would have been for the defendant to apply for the Trade Marks to be expunged and not to use the Trade Marks illegally. 39     Chu KW stated categorically that the trade mark on the Solvil watches was “Solvil” and he reiterated that the Solvil watches used quatrefoil flower patterns for decoration and embellishment in order to achieve a look that fitted the image that Stelux was cultivating for the “Solvil” brand. Chu KW testified that Stelux took a firm stance against counterfeiting and trade mark infringement. Its strategy for growing its brands was through advertising, celebrity endorsements, well-decorated stores and well-trained staff, as well as heavy investments in its own brands, Solvil et Titus being a good example. It would be detrimental to City Chain’s excellent reputation as a leading multi-brand watch retailer in Asia if it rode on the goodwill of other watch manufacturers, be they high-end or mass-market brands. The Solvil watches were designed by a third party and manufactured in China. If Stelux had thought that the design of the Solvil watches infringed any trade marks, it would not have approved the design. 40     The defendant’s third witness, Ms Chu Suk Yee (“Ms Chu”) (unrelated to Chu KW), a Brand Manager at City Chain Company Ltd in Hong Kong, deposed that the defendant’s Operations Team was responsible for approving watch designs. To ensure that the designs were not identical or similar to watches that were already in the market, the Operations Team would visit other watch stores. Similar to the evidence given by Chu KW, Ms Chu averred that the Operations Team did not visit “Louis Vuitton” boutiques to learn more about the plaintiff’s watches. Nevertheless, Ms Chu maintained that the Solvil watches were distinct from the plaintiff’s watches. She added that since the Solvil watches were launched in Hong Kong and Singapore in November 2006, she had not received any feedback or comment about any identity or similarity between both parties’ watches. 41     The defendant asserted that the Flower Quatrefoil was not in fact used as a trade mark on the plaintiff’s watches. Mere registration did not render the Flower Quatrefoil distinctive as a trade mark:The Polo/Lauren Co, LP v Shop in Department Store[2006] 2 SLR 690at [26]. CitingR v Johnstone, the defendant argued that the average consumer would consider a flower or floral design on a piece of jewellery, such as a watch, as a “decorative element”. It could not be said that the public had been sufficiently educated about the plaintiff’s trade marks, by substantial sales or advertisements, to associate watches bearing flower quatrefoils with the plaintiff. Since the famous “LV” logo was imprinted on the plaintiff’s watches, the average consumer would consider the “LV” logo to be the trade mark and the Flower Quatrefoils to be ornaments or decorations. 42     The defendant disagreed that the Flower Quatrefoil was used as a trade mark since it had been used in various ways and forms that differed from the form shown in its trade mark registration. If the individual constituents of the Monogram were not used in a consistent manner, the average consumer would not consider them as trade marks. During cross-examination, Plane did not concede that the scant evidence before the court of use of a single Flower Quatrefoil on the plaintiff’s products meant that the plaintiff did not manufacture more of such items. He insisted that as the trade mark proprietor, the plaintiff was at liberty to use it in any combination and in any way it wished. The defendant submitted that given the disparity in prices between the parties’ watches, the plaintiffs’ practice of not permitting other retailers to sell Louis Vuitton goods except on rare occasions and never marking down its prices, and the manner in which the defendant sold its Solvil watches, there was no likelihood of confusion. In addition, consumers usually examined a watch closely before purchase. This would be more so in the case of the plaintiff’s Tambour Bijou model which had a 18 mm dial. 43     Chu KW deposed in his 2ndaffidavit filed on 30 April 2008 in respect of the CR that the raids in several cities in China did not result in legal action against Stelux. In Shenzhen, the Administration for Industry and Commerce (“AIC”) returned the seized watches to the defendant. Louis Vuitton commenced court action against Stelux and that case is currently pending before the Shenzhen Intermediate People’s Court. The AIC in Beijing Dongcheng District closed the case on 1 June 2007 without finding trade mark infringement on the part of the defendant, to whom the seized watches were returned. The respective AICs in the Liwan and Yuexiu districts of Guangzhou also returned the confiscated watches to the defendant. In Chongqing, the AIC issued a decision of non-infringement of Louis Vuitton’s trade mark rights. Louis Vuitton commenced an action with the Intermediate People’s Court for a review of the decision of the Chongqing AIC but it was unsuccessful. It then filed an appeal with the Chongqing Higher People’s Court, which is pending. The courts in Malaysia had also not taken further action following the raids. 44     Plane said under cross-examination that he had no evidence to dispute Chu KW’s claims about the above-mentioned raids. He claimed that raids were also attempted in Shanghai but they were unsuccessful because the City Chain employees there were notified beforehand by City Chain employees in Hong Kong. When asked by the plaintiff’s counsel, Plane said that the AIC’s decisions were administrative in nature and subject to challenge in the courts.",
        "Passing off": "45     To succeed against the defendant in passing off, the plaintiff would have to satisfy three requirements: goodwill, misrepresentation and damage or likelihood of damage. Goodwill 46     As proof of the substantial goodwill that the plaintiff’s Trade Marks enjoyed, the plaintiff adduced evidence of,inter alia, the appearance of its fashion products in fashion and women’s magazines, including Singapore publications “Cita Bella”, “Icon”, “Style”, “Elle” and “Her World”, coverage of social events organised by the plaintiff in society magazines such as “Singapore Tatler” and “Prestige” and extensive coverage of its products in business magazines such as “Time”, “Newsweek”, “Forbes”, “Fortune” and “BusinessWeek”. 47     The plaintiff citedCaterpillar Inc v Ong Eng Peng (formerly trading as Catplus Internationalfor the proposition that sales, advertisements and promotion expenditure were evidence of goodwill and reputation. Plane deposed that he was informed by LVMH Fashion (S) that it spent the following amounts in advertising and promoting the plaintiff’s watches in Singapore in the years 2003 to 2007:  2003S$703,2512004S$218,7402005S$90,0352006S$131,121 48     The defendant submitted that since, by the plaintiff’s own admission, its goodwill was concentrated in the Monogram, it would be “inherently difficult” for the quatrefoil marks to acquire their own goodwill or reputation where bags and luggage were concerned. No evidence was adduced by the plaintiff that a single quatrefoil mark without an accompanying Louis Vuitton mark or the Monogram had been used in the design of its bags and luggage, the mainstay of its luxury goods business. Specifically with respect to watches, the plaintiff had exhibited only three (full-page newspaper) advertisements of watches that employed a single Flower Quatrefoil on their faces which were published in Singapore prior to November 2006 and it had not adduced evidence of sales of any watch bearing one or more quatrefoil marks before November 2006. 49     It could not be denied, however, that these watches were currently available at the plaintiff’s stores in Singapore. At the defendant’s request during the trial, the plaintiff exhibited two of its watches bearing the Flower Quatrefoil that were obtained from its store in Singapore. Misrepresentation 50     The plaintiff alleged that the defendant had deliberately copied the plaintiff’s designs,i.e.there was intentional misrepresentation. The plaintiff postulated that in a bid to improve its performance in China where its business was making a loss, the defendant deliberately designed a range of watches that were “look-alikes” with the plaintiff’s watches in order to attract middle-class young Chinese consumers who were brand-conscious and aspired to own the plaintiff’s products but might not be able to afford them yet. The defendant refrained from selling these watches in Hong Kong because of the presence of the plaintiff’s Asia Pacific headquarters there. Notwithstanding Chu KW’s assertion on the witness stand that the trade mark on the Solvil watches was “Solvil”, the plaintiff noted that the defendant only registered the trade mark for Solvil in Singapore on 26 December 2007, after these proceedings had commenced. This was some three to four years after the defendant spun off “Solvil” as a separate brand from “Solvil et Titus”. 51     The defendant insisted that customers of “Solvil” watches would not be misled regarding the brand or origin of those watches, on account of the defendant’s policy and processes in relation to the display, sale and handing over of watches to customers. Chu KW averred that: (a)    “Solvil” watches in the defendant’s stores were displayed in individual compartments that prominently featured the “Solvil” mark; (b)    the watch’s brand code was stated on its price tag and the invoice that was issued to a customer; (c)    a City Chain warranty card, stating the brand name and model number of the watch, or the brand’s own warranty card would be issued to the customer; and (d)    the watch would be packaged in a City Chain box or a box bearing a brand name of the watch and packed into a City Chain bag. 52     Furthermore, it could not be disputed that the defendant’s watches were targeted at a different market segment. Chu KW deposed that “[t]he City Chain Group sells affordable and trendy lifestyle watches for a broad middle-class base of consumers, generally between the ages of 18 and 45”. As for watches under the “Solvil” brand, Ms Chu stated that these watches were “directed at the young and trendy, particularly those in the 15 to 25 age group”, and the image that City Chain sought to project of this line of watches was “fashionable, feminine and trendy”. Chu KW also said during cross-examination that he did not seek to find out more about the plaintiff’s range of watches after he became aware that such products were available and he did not instruct Stelux’s Operation Team or its marketing director to undertake market research concerning the same, because City Chain and the plaintiff were clearly not competitors with each other. Damage or likelihood of damage 53     The plaintiff submitted that it only manufactured and sold a relatively small number of watches. Its brand of luxury lifestyle meant that its products had to be very exclusive and this image of exclusivity, which its customers valued highly, would be diminished by the availability of look-alikes. 54     The defendant countered that if the sales figures of the plaintiff’s watches in Singapore, as adduced in Plane’s AEIC (see [ ] above), were assumed to be true and correct, it appeared that the launch and sales of the Solvil watches had no impact on the plaintiff’s watch sales. The defendant referred toNation Fittings (M) Sdn Bhd v Oystertec plc[2006] 1 SLR 712(at [176]), where Andrew Phang J citedBulmer Bhd and Showerings Ltd v J Bollinger SA and Champagne Lanson[1978] RPC 79at 95 for the principle that proof of damage must be established as a matter of probability, not mere possibility.",
        "Dilution": "55     The plaintiff claimed that the Trade Marks were well-known marks under s 2 of the Act and that they were protected against dilution by s 55 of the Act, specifically, s 55(3)(b) and s 55(4)(b). 56     To bolster its argument that the plaintiff and its Trade Marks were well-known, the plaintiff cited decisions of the Administration Panel of the WIPO Arbitration & Mediation Centre, as well as courts in the United States and Australia. InLouis Vuitton & anor v Lee doing business as K-Econo Merchandise875 F.2d 584 (“LV v Lee”), the court held (at [8]): Vuitton and Gucci are international status symbols known to everyone, whether or not proficient in the English language, who sells handbags and luggage, and to most people who buy them. It is inconceivable that Ms Lee had never heard of these firms, nor did she testify that she had never heard of them. 57     InLouis Vuitton Malletier SA v D and L Design Pty Ltd[2003] FCA 475(“LVMH v D and L Design”), the Federal Court of Australia stated (at [29]): The evidence of the applicants disclosed an extensive, long-standing and well-established reputation in their names and their products and I do not consider it credible that persons engaged in the wholesale importation and sale of fashion garments, albeit at the cheaper end of the fashion garment trade, would not be aware of the names of the applicants, the nature of their trade marks and the nature of the style, get-up and display of their products. 58     To protect its extensive intellectual property rights, the plaintiff employed a full-time team of about 50 persons to engage in anti-counterfeiting and brand protection, and a network of 250 agents, investigators and external counsel. In Singapore, the plaintiff took the following enforcement actions between 2005 and 2008, in co-operation with the police:  YearNo of raids by plaintiffNo of raids by policeon own initiative200510416200684272007121162008 (at 30 June)3812 Of these raids, several related specifically to the Trade Marks:  YearNo of raids20044200519200682008 (at 30 June)2 59     The defendant’s rebuttal was that the enforcement decisions that Plane cited in his AEIC did not relate to the Trade Marks at all. InLV v Lee, for example, the trade marks in question were “Vuitton” and “Louis Vuitton” whileLVMH v D and L Designconcerned the “Damier” trade mark. The evidence of the plaintiff’s enforcement efforts in Singapore also did not assist its argument that the Trade Marks had become well-known in Singapore. The trade marks in question inLouis Vuitton Malletier A Paris v Tan Tong Khai(Suit 686 of 2003) were the “Louis Vuitton” and the “LV” marks, while the dispute inPP v Jong Li Li Deborah[2006] SGDC 299related to the “Louis Vuitton Stars Flowers” trade mark. 60     While it was undisputed that the Monogram was a well-known mark for the purposes of the Suit, the defendant did not accept that the individual elements of the Monogram were likewise well-known. It claimed that no evidence was adduced on the value of the Trade Marks in Singapore. Instead the plaintiff had submitted the figure for the turnover of its Singapore subsidiary which “conceivably [was] due to the alleged allure of the Plaintiff’s handbags, luggage and leather goods bearing the Monogram mark”. Tarnishment and blurring 61     Just as it pleaded the tort of passing off, the plaintiff alleged that the availability in the mass market of the Solvil watches using the Solvil flower device as a trade mark would tarnish the plaintiff’s image and give rise to a likelihood of confusion. Therefore, the elements of dilution had been made out,vizthe availability of the Solvil watches would lessen the capacity of the Flower Quatrefoil to identify and distinguish the plaintiff’s watches. 62     The defendant’s counter-argument was that “tarnishment” occurred where a conflicting mark was used in relation to goods or services that were “unwholesome, unsavoury, immoral or obscene”, which the Solvil watches were not. There was also no evidence that the defendant took unfair advantage of the alleged distinctive character of the Trade Marks or that the defendant’s customers would purchase the Solvil watches because they thought they were associated with the plaintiff. In any case, the defendant maintained that the Solvil watches were not look-alikes of the plaintiff’s watches. 63     As for “blurring”, the defendant asserted that there was no evidence that the Solvil flower device would cause any member of the purchasing public in Singapore to think that the Solvil watches originated from or were connected to the plaintiff. 64     Finally, the defendant noted that s 55(4) of the Act requires that the infringing product to have used the well-known mark as a “business identifier”. This was not the function of the Solvil flower device which was meant for decorative purposes only.",
        "The decision of the court": "65     On the issue of infringement, there can be no dispute that the goods in question are identical (i.e.watches) and that the plaintiff as the proprietor had not consented (expressly or impliedly) to any use of its Trade Marks by the defendant. 66     Section 2 of the Act defines a “sign” to include “any letter, word, name, signature, numeral, device, brand, heading, label, ticket, shape, colour, aspect of packaging or any combination thereof”. Clearly, the Solvil flower device is a sign within the meaning of s 2 and s 27 of the Act. This is notwithstanding the fact that the sign was used in a manner which did not show the complete flower. It would be obvious to anyone looking at the pattern on the Solvil watch face and strap that the complete sign is a stylised four-pointed flower. To hold otherwise would be to allow a person to use “LV” in a repeat pattern on goods identical or similar to those of the plaintiff so long as the letters “fade off” at the start, the end, the top or the bottom and are never displayed as a complete pair. This cannot be correct as it would make a mockery of trade mark protection. So long as the visual image of the complete letters or device is clear, it matters not that the complete letters or device are not displayed. 67     Similarly, the defendant’s argument that the use of the Solvil flower device is a mere decoration or embellishment on the watches and therefore does not constitute trade mark use may be disposed of quickly. Such a defence is not found in s 28 on “Acts not amounting to infringement”. Further, trade marks may of course look attractive when used in a repeat pattern, especially in different sizes and colours, but how can multiple usage of a trade mark on one product bring the case out of the realm of trade mark use? Insofar as the repeat pattern contains incomplete reproductions of the trade mark, I repeat what is stated in [66] above. What is important is whether the use is “in the course of trade” (see s 27) and such use cannot be denied in the case of the Solvil watches here. 68     The Trade Marks have been in use for a very long period of time. The fact that the flower quatrefoil also appears in architectural and artistic works of equal or greater vintage does not emaciate the Trade Marks and allow their free use in the course of trade. The defendant has not taken action seeking to expunge or cancel the Trade Marks and until it does so successfully, the Trade Marks stand in law. Similarly, the fact that others may also be infringing the Trade Marks does not confer a licence on another person to do the same. The proprietor of a trade mark may not be aware of other infringements and even when he is aware, may not find it feasible to go after every infringer. 69     Is the Solvil flower device identical to the Trade Marks? Kerly’s Law of Trade Marks and Trade Names (14thedition, 2005) at paragraphs 14-051 to 14-053 provides the following guidance: Once the defendant’s sign has been identified it must be compared with the registered mark to determine if it is identical. Again, this is a matter to be considered from the perspective of the average consumer. A sign will be identical with the registered mark where it reproduces, without any modification or addition, all the elements constituting the mark or were (sic), viewed as a whole, it contains differences so insignificant they may go unnoticed by the average consumer. Accordingly, in the case of any accused sign which has some visual significance, one must take that into account in considering the question of identity. The visual impact may be slight, but it will count even if the marks are identical to the ear. There can only be “identity” if there is both aural and visual identity. Similarly, it has been said that the mark and sign must be so close that one could be considered a counterfeit of the other. Any addition which has some trade mark significance cannot be ignored. 70     Here, we are concerned only with visual and conceptual similarities as there is no aural quality involved. The plaintiff’s flower quatrefoil consists of a flower design with four pointed petals of equal length. There is a circle at the centre of this motif. The defendant’s flower device has the same attributes although, as noted above, it appears in a random repeat pattern with the individual device incomplete in some way. The defendant’s device is filled with small diamantes but there is one large one right at the centre of the device, resembling the centre circle in the plaintiff’s design. There are therefore obvious visual and conceptual similarities between the two designs. 71     There may be some differences in the two designs but they are not of any real significance. The proportions of the defendant’s petals and their slightly rounded off tips may be marginally different from the plaintiff’s flower quatrefoil when the parties’ designs are placed one over the other but these are hardly noticeable when one is looking at the two designs holistically. Where the defendant’s device on the outside of the watch face and on the strap does not contain the circle or any round object (such as a diamante) in its centre, this difference is also probably too minute to be appreciated when comparing the two designs. The plaintiff’s flower quatrefoil diamond device is merely a reverse image of the flower quatrefoil with the dark diamond creating a sort of photographic negative effect for the flower quatrefoil in the centre. The focus would still be on the flower quatrefoil. 72     In my opinion, the defendant’s device is identical to the Trade Marks and therefore infringes the same within the scope of s 27(1) of the Act. 73     I proceed to consider the alternative claim that the two competing devices are at least similar for the purposes of s 27(2) of the Act even if they are held not to be identical. Following what has been stated above, it is clear that the defendant’s device bears a remarkable resemblance to the plaintiff’s devices. Confusion takes place when the public could be led to believe that the defendant’s goods emanate from the same undertaking or are somehow linked economically to the plaintiff. 74     While a customer of the defendant who purchases the Solvil watch(es) may have little doubt that he is buying a Solvil watch (from the brand name inscribed on the watch face), he may nevertheless think that the defendant has been licensed by the plaintiff to use the Trade Marks or that there is some collaborative marketing with Solvil being a more affordable class of LV watches. The more imaginative may even see a LV connection in the centre two letters of the word “SOLVIL” but I need not concern myself with this. On the other hand, the defendant’s customer may decide to buy the Solvil watches in question because they resemble LV watches which are indisputably highly desirable fashion items especially among the young and trendy who aspire to own LV products but whose finances may not be in the LV league. The Solvil watches with the flower quatrefoil motifs could be easily mistaken for LV ones at a glance when worn on the wrist as people do not generally scrutinize another person’s watch at close range. Coupled with the distinctive nature and the renown of the plaintiff’s motifs, it is no defence to say that the word “Solvil” has been added to the watch face. To hold otherwise would be tantamount to saying that one can display Nike’s well-known “swoosh” sign on sports goods so long as one adds another brand name near the “swoosh”. 75     In my opinion, there exists a likelihood of confusion between the defendant’s and the Trade Marks on the part of the public if the Solvil flower device is used on its watches. Accordingly, there is also infringement under s 27(2) of the Act. 76     The tort of passing off is established when the plaintiff can show goodwill or reputation, misrepresentation by the defendant and damage or the likelihood thereof (Amanresorts Limited & Anor v Novelty Pte Ltd[2008] 2 SLR 32(“Amanresorts”), citing the Court of Appeal’s decision inCDL Hotels International Ltd v Pontiac Marina Pte Ltd[1998] 2 SLR 550). 77     There can be no doubt that the world-famous plaintiff possesses substantial goodwill and reputation in Singapore. It opened its first outlet here in 1979 and now has three (in Hilton Hotel and in Raffles Hotel and its current flagship store in Ngee Ann City). I note the defendant’s point that the flagship store only opened in 2007, after the launch of the Solvil watches in late 2006. The turnover of its Singapore subsidiary, LVMH Fashion (S) Pte Ltd, for the financial year ending 31 March 2008 crossed $370m. The plaintiff started selling its watches in 2004 and yet managed to achieve annual sales of $1.7m to $1.9m between 2005 and 2007 for its watches. For the first half of 2008, the sales have already hit $1.45m. Queues of customers waiting to have an opportunity to shop in LV stores are commonplace notwithstanding the absence of price mark-down sales. Even the defendant’s witnesses and/or their spouses own LV products (although not its watches and not necessarily having purchased the products here). 78     The plaintiff’s advertising and promotion expenditure and articles in fashion magazines about its products reinforce its goodwill and reputation here. Even though there is no evidence of advertisement or sale of specific models of LV watches, the plaintiff has product catalogues readily available in its LV stores. 79     There can be misrepresentation if the public is led to believe that there is a business connection between the parties caused by the defendant’s use of its device on its Solvil watches (Amanresorts). For the reasons set out in [74] earlier, I am of the view that misrepresentation has been established by the plaintiff. Misrepresentation is not confined to the defendant’s customers. 80     Although misrepresentation need not be intentional, there are facts in this case pointing to the likelihood that the defendant copied the plaintiff’s flower quatrefoil motif for its watches. The defendant’s outlets in China have been making losses. The defendant’s target market is generally the young and trendy who have the desire but not yet the means to own luxury items. The plaintiff submitted that “it is with an eye to attracting these customers that the [defendant] set out deliberately to design a range of ‘look-alike’ watches that copy the plaintiff’s designs, so as to appeal to this very big group of customers in China” and that the defendant refrained from selling the Solvil watches in issue in Hong Kong because it was conscious of the plaintiff’s Asia Pacific headquarters being situated in that territory. The plaintiff also noted the absence of evidence of the identity of the designer of the Solvil watches in question. I need only say that I find the plaintiff’s submissions not devoid of merit. 81     The defendant’s Solvil watches, by virtue of their resemblance to the LV watches insofar as the flower quatrefoil motif is used in both, are likely to damage the plaintiff’s brand name. The exclusivity of the plaintiff’s watches is evidenced by the fact that they are not meant for the mass market. LV watches cost in the range of $4,000 to $60,000 each while Solvil watches are generally priced below $200. People wearing LV watches with the flower quatrefoil motif are not going to be flattered that there are copycat watches out in the mass market retailing for a miniscule fraction of the price of LV watches. I take judicial notice of the fact that people do get put off certain luxury brands simply because there are so many fakes and cheap look-alikes in the market. The likelihood of damage is therefore very real indeed if the defendant carries on using the Solvil flower device on its Solvil watches. 82     Given the above findings, it is strictly not necessary to consider the plaintiff’s claim based on well-known trade marks. “Well-known trade mark” is defined in s 2(1) of the Act. The factors to consider in deciding whether a trade mark is a well-known one are set out in s 2(7), (8) and (9) of the Act. Section 55(1) of the Act provides: (1) A well-known trade mark shall be entitled to protection under this section - (a)    whether or not the trade mark has been registered in Singapore , or an application for the registration of the trade mark has been made to the Registrar; and (b)    whether or not the proprietor of the trade mark carries on business, or has any goodwill, in Singapore. 83     The defendant does not dispute that the LV brand name and the plaintiff’s Monogram are well-known. It doubts, however, whether the same could be said of the individual elements of the Monogram. In my view, the individual elements, namely, the Trade Marks here, are distinctive in their own right. They are conspicuous in design and each element is clearly and repeatedly set out in the whole. I see little room for doubt that they would be as easily recognisable as the Monogram by the public at large here. I find the Trade Marks do qualify as well-known trade marks under the Act. 84     The plaintiff relies on s 55(3)(b)(i) (relating to the defendant’s use of a trade mark) and s 55(4)(b)(i) (relating to the defendant’s use of a “business identifier”, defined in s 2(1) as “any sign capable of being represented graphically which is used to identify any business”). These provisions protect against the use of any trade mark or any business identifier where such use “would cause dilution in an unfair manner of the distinctive character of the proprietor’s trade mark”. 85     Section 2(1) of the Act defines “dilution”, in relation to a trade mark, as: “the lessening of the capacity of the trade mark to identify and distinguish goods or services, regardless of whether there is - (a)    any competition between the proprietor of the trade mark and any other party: or (b)    any likelihood of confusion on the part of the public. The plaintiff submits that there are two separate concepts involved in this – tarnishing and blurring - and argues that both concepts have been satisfied here. In the light of the above findings (see [74] and [81]), I agree with the plaintiff’s submission that it is entitled to injunctive relief, particularly under s 55(3). Cheapening the image of a luxury brand is as much tarnishing as associating that brand with unwholesome connotations. 86     Where the CR is concerned, the defendant relies on two grounds. The first is that when Ms Teh applied for the search warrants, she did not provide any or any sufficient information to the Magistrate that there was reasonable cause for suspecting that there were in any premises or conveyance goods which were the subject of an offence under s 49 of the Act. The second ground is that the charges in the private summonses did not disclose the commission of any offence under s 49(c) of the Act in respect of the registered flower quatrefoil mark. 87     I accept Ms Teh’s evidence concerning the filing of the complaint and her assertion that she had shown the Magistrate the Solvil watches purchased by the private investigator and that there was no misrepresentation or non-disclosure of material facts. Although the search warrants covered three trade marks and the charges following therefrom named only one trade mark, it was only right that the plaintiff reviewed the evidence after the execution of the search warrants when it was framing the appropriate charges. Further, although the proprietor of the trade marks in issue was wrongly described as Louis Vuitton Malletier A Paris (when the correct name then did not have the words “A Paris”), that was a non-material error and there was never any doubt as to the identity of the party pursuing the matter. In any event, “A Paris” means “of Paris” and there was no other Louis Vuitton Malletier to be confused about. 88     The revisionary powers of the High Court are to be exercised sparingly (see the Court of Appeal’s decision inNg Chye Huey and anor v PP[2007] 2 SLR 106at [73]). Most of the matters raised in argument have been disposed of by the findings in the civil action and any other matters not dealt with should properly be within the province of the criminal proceedings. 89     On the totality of the evidence, I therefore made the following orders: (1)    the plaintiff succeeds in its claims on the grounds of infringement of trade mark under s 27(1) and (2) of the Act, in passing off and under s 55 of the Act; (2)    injunctions as claimed are issued accordingly; (3)    there be an inquiry as to damages or an account of profits at the option of the plaintiff; (4)    there be delivery up of infringing articles within 14 days from the date of judgment or, alternatively, the defendant’s solicitors to confirm to the plaintiff’s solicitors by letter that there are no further infringing articles in the possession of the defendant; (5)    the defendant is to pay the plaintiff costs of the civil action; and (6)    the CR is dismissed with no order as to costs. 90     As the plaintiff’s solicitors requested that the plaintiff’s LV watches produced during the trial be returned to the LV stores as they are very expensive items and may be needed for sale, I directed counsel for both parties to arrange for photographs to be taken of the said watches before they are returned to the LV stores."
    }
}