{
    "case_title": "Liquidators of Progen Engineering Pte Ltd v Progen Holdings Ltd",
    "ncitation": "[2009] SGHC 286",
    "coram": "Woo Bih Li J",
    "sections": {
        "Introduction": "1       Progen Holdings Ltd (“the Defendant) is a company listed on the Singapore Stock Exchange and is the sole shareholder and holding company of Progen Engineering Pte Ltd (“the Company”). A winding-up application was filed against the Company on 22 January 2007 by a creditor of the Company, one Chua Aik Kia trading as Uni-Sanitary Electrical Construction (“Uni-Sanitary”). On 16 February 2007, the Company was wound up by an order of court and Chee Yoh Chuang and Lim Lee Meng were appointed liquidators of the Company. 2       On 6 November 2008, the liquidators filed Originating Summons No 1433 of 2008 for the Defendant to repay the Company a certain sum under s 99(2) of the Bankruptcy Act (Cap 20, 2000 Rev Ed) (“Bankruptcy Act”) read with s 329(1) of the Companies Act (Cap 50, 2006 Rev Ed) which the Company had paid to (or for) the Defendant under twelve transactions. Subsequently, the liquidators clarified that the total amount being claimed was from ten of the twelve transactions as I shall elaborate below. 3       The crux of the claim was that the payments had been made to a related party within two years before the date of commencement of winding-up. The date of commencement of winding-up was the date when the winding-up application was filed,ie, 22 January 2007. There was therefore a statutory presumption that the payments constituted an unfair preference to the Defendant but the presumption was rebuttable. 4       After hearing arguments, I dismissed the claim of the liquidators. I set out my reasons below.",
        "The statutory provisions and background facts": "5       The relevant company legislation is the Companies Act (Cap 50, 1994 Rev Ed) as amended in 1995 and 2005 (“the Companies Act”). Section 329 of the Companies Act states: 329. —(1) Subject to this Act and such modifications as may be prescribed, any transfer, mortgage, delivery of goods, payment, execution or other act relating to property made or done by or against a company which, had it been made or done by or against an individual, would in his bankruptcy be void or voidable under section 98, 99 or 103 of the Bankruptcy Act (Cap. 20) (read with sections 100, 101 and 102 thereof) shall in the event of the company being wound up be void or voidable in like manner. (2)    For the purposes of this section, the date which corresponds with the date of making of the application for a bankruptcy order in the case of an individual shall be — (a) in the case of a winding up by the Court — (i) the date of the making of the winding up application; or (ii) … whichever is the earlier; and (b) … (3)    … 6       Sections 99 and 100 of the Bankruptcy Act state: 99. —(1) Subject to this section and sections 100 and 102, where an individual is adjudged bankrupt and he has, at the relevant time (as defined in section 100), given an unfair preference to any person, the Official Assignee may apply to the court for an order under this section. (2) The court shall, on such an application, make such order as it thinks fit for restoring the position to what it would have been if that individual had not given that unfair preference. (3) For the purposes of this section and sections 100 and 102, an individual gives an unfair preference to a person if — (a) that person is one of the individual’s creditors or a surety or guarantor for any of his debts or other liabilities; and (b) the individual does anything or suffers anything to be done which (in either case) has the effect of putting that person into a position which, in the event of the individual’s bankruptcy, will be better than the position he would have been in if that thing had not been done. (4) The court shall not make an order under this section in respect of an unfair preference given to any person unless the individual who gave the preference was influenced in deciding to give it by a desire to produce in relation to that person the effect mentioned in subsection (3)(b). (5) An individual who has given an unfair preference to a person who, at the time the unfair preference was given, was an associate of his (otherwise than by reason only of being his employee) shall be presumed, unless the contrary is shown, to have been influenced in deciding to give it by such a desire as is mentioned in subsection (4). (6) The fact that something has been done in pursuance of the order of a court does not, without more, prevent the doing or suffering of that thing from constituting the giving of an unfair preference. 100. —(1) Subject to this section, the time at which an individual enters into a transaction at an undervalue or gives an unfair preference shall be a relevant time if the transaction is entered into or the preference given — (a) … (b) in the case of an unfair preference which is not a transaction at an undervalue and is given to a person who is an associate of the individual (otherwise than by reason only of being his employee), within the period of 2 years ending with that day; and (c) … (2) Where an individual enters into a transaction at an undervalue or gives an unfair preference at a time mentioned in subsection (1)(a), (b) or (c), that time is not a relevant time for the purposes of sections 98 and 99 unless the individual — (a) is insolvent at that time; or (b) becomes insolvent in consequence of the transaction or preference. (3) … (4) For the purposes of subsection (2), an individual shall be insolvent if — (a) he is unable to pay his debts as they fall due; or (b) the value of his assets is less than the amount of his liabilities, taking into account his contingent and prospective liabilities. 7       Section 101 of the Bankruptcy Act specifies when a person is an associate of another person. 8       Various provisions in the Companies (Application of Bankruptcy Act Provisions) Regulations, 1996 Ed, apply the relevant provisions of the Bankruptcy Act to a company being wound up. They also stipulate that a reference to an associate of an individual who has been adjudged bankrupt shall be read as a reference to a person connected with a company against which a winding-up order has been made. They also stipulate when a company shall be regarded as an associate of another company. 9       The provisions are rather convoluted but it was settled inShow Theatres Pte Ltd (in liquidation) v Shaw Theatres Pte Ltd & another[2002] 4 SLR 145(“Show Theatres”) that where two companies have a common director or common directors, one company will be treated as connected with another. 10     In the present case, the directors of the Company at the relevant time were:  (a)   Mr Lee Ee @ Lee Eng   (b)   Mdm Koh Moi Huang (who is Mr Lee Ee’s wife)   (c)   Dr Tan Eng Liang   (d)   Mr Ch’ng Jit Koon  11     The directors of the Defendant at the relevant time were:  (a)   Mr Lee Ee @ Lee Eng (the Chairman and Managing Director)   (b)   Mr Johnlin Yuwono   (c)   Dr Tan Eng Liang   (d)   Mr Ch’ng Jit Koon  12     It was undisputed that the Defendant was connected with the Company for the purpose of the issue of unfair preference. 13     It was also undisputed that the Company was insolvent in the two years before the date of the winding-up application as its liabilities exceeded its assets by $2,246,584.71. According to Mr Lee Ee, this was because the Company had made provision for contingent liabilities arising from claims by two creditors for the year ending 31 December 2004. 14     One creditor was Uni-Sanitary which had commenced arbitration proceedings against the Company in November 1998. The Company had made a provision of $550,000 for this claim. Subsequently, Uni-Sanitary received an award on 25 May 2005 for $628,791.75. 15     The second creditor was Winter Engineering (S) Pte Ltd (“Winter Engineering”) which commenced arbitration proceedings against the Company in January 1999. Unlike Uni-Sanitary, Winter Engineering had received an arbitration award in its favour for $2,593,956.68 and 80% of its costs on 26 November 2004,ie, before 31 December 2004. The Company was also to bear 50% of the costs of the arbitration. The Company made a provision of $3.6 million for this claim.",
        "The ten transactions": "16     The ten transactions which the liquidators complained about were: List of Transactions DateAmount(S$)Type of Transaction1st Transaction31.01.200592,994.50Salaries, etc2nd Transaction21.02.200550,000.00Purchases of iron ore3rd Transaction28.02.2005(actual payment wason 04.02.2005)10,987,960.85Capital distribution toPHL’s shareholders4th Transaction28.02.200557,837.00Salaries, etc5th Transaction04.03.200555,000.00Purchases of iron ore6th Transaction31.03.200548,956.75Salaries, etc7th Transaction30.04.200548,607.00Salaries, etc8th Transaction31.05.200548,617.62Salaries, etc9th Transaction30.06.200550,131.29Salaries, etc11th Transaction30.06.20057,538,243.15Set-off18,978,348.16 17     The 10th and 12th transactions were no longer in issue and I have therefore omitted them from the above list. 18     It was not in dispute that the transactions in question were executed within two years of the date of the filing of the winding-up application,ie, 22 January 2007. 19     The ten transactions could be grouped as follows: (a)     The largest single payment of $10,987,960.85 was made to The Central Depository (Pte) Ltd (“CDP”) on or about 4 February 2005 by the Company so that CDP could make a capital distribution to the shareholders of the Defendant. I shall elaborate on this below. (b)     Payments totalling $347,144.16 to the Central Provident Fund (“CPF”) in respect of the Defendant’s employees and payments for bonuses for such employees. There were some reimbursements of petty cash expenses incurred by the Defendant’s officers and a few other minor transactions in this sum which I need not elaborate on. (c)     Payment of $105,000 to reimburse the Defendant for payments made to a third party supplier of iron ore which payments had been made by the Defendant for and on behalf of the Company initially. (d)     A set-off of $7,538,243.15 of the indebtedness of the Company to a subsidiary of the Defendant, Progen Pte Ltd (“PPL”), against the indebtedness of the Company to the Defendant.",
        "List of Transactions": "",
        "The arguments and the court’s conclusions": "20     The thrust of the liquidators’ claim was that the transactions had been effected contrary to a clear representation in the audited financial statements of the Company for the year ending 31 December 2004 that a debt of $18,514,287.97 owing by the Company to the Defendant would not be repaid within 12 months. This arose from an item in the balance sheet of the Company as at 31 December 2004 showing this sum as owing to the Defendant. There was a reference to Note 13 for this sum and Note 13 stated, “The amount is non-trade related, unsecured, interest-free and is not expected to be re-paid within the next twelve months”. 21     In addition, there was a statement by the directors of the Company in the directors’ report for the year ending 31 December 2004 as follows: (a)    … (b)    at the date of this statement there are reasonable grounds to believe that the Company will be able to pay its debts as and when they fall due as its holding company has agreed to provide adequate funds for the Company to meet its liabilities as and when they fall due and to subordinate the amount owing to it and its related companies for the prior payment of other liabilities. 22     I will refer to the statement about the alleged subordination as “the Subordination Statement”. The Subordination Statement was signed by Mr Lee Ee and Dr Tan Eng Liang. It was dated 23 February 2005. However, the liquidators pointed out that the first two of the ten disputed transactions had been effected before that date. 23     The explanation by the Defendant was from Mr Lee Ee and from Ms Lee Pui Hoon, the Finance Manager of the Defendant (“the Finance Manager”). The Defendant had also obtained a report from ELTICI Consulting Pte Ltd (“ELTICI”) dated 9 January 2009 which elaborated or corrected some of the information from Mr Lee Ee or the Finance Manager and presented some arguments. Against this, the liquidators made their own observations and arguments 24     The Defendant is the investment holding company of the Progen group. It has ten subsidiaries in Singapore, Malaysia and the People’s Republic of China. The Company is one of the subsidiaries and so is PPL. 25     PPL used to own the leasehold interest of the land and a building at 12 Woodlands Loop. On 2 July 2004, there was a circular stating that the land and the building (collectively referred to as “Progen Building”) were to be sold for $24.8 million. On 29 July 2004, it was announced that the sale was completed. 26     On 3 August 2004, PPL placed $25 million in a fixed deposit (“FD”) account with United Overseas Bank Limited (“UOB”). This deposit was renewed on a monthly basis until 4 December 2004. As each term matured, most or all of the principal and interest would be placed on another one-month FD until 4 December 2004. 27     On 6 August 2004, the Defendant announced that with the sale, the cash and FDs amounted to about $31.1 million as at 31 July 2004. 28     On 26 August 2004, the Defendant announced its proposal to pay a special dividend of about $4 million and a capital distribution of about $11 million. 29     On 24 November 2004, the Defendant obtained shareholders’ approval for the payments of the special dividend and the capital distribution. It will be recalled that the arbitration award in favour of Uni-Sanitary was made on 26 November 2004 although it was received a bit later by the Company. 30     On 4 December 2004, PPL’s FD with UOB matured. The balance then was $23,321,705.58 plus $20,989.54 interest and was initially transferred to PPL’s current account with UOB. 31     According to Mr Lee Ee, he had then been advised by the group’s accounts department that Malayan Banking Berhad (“MBB”) was offering a better interest rate than UOB. A decision was taken to place $19 million in an FD account held by the Company with MBB because it was the Company which had an existing fixed deposit facility with MBB. This FD was for a tenure of two months from 4 December 2004 to 4 February 2005. 32     In the meantime, the Defendant had also divested its stake of 400 million shares in Wee Poh Holdings Ltd for $448,415.81. From this sum, $300,000 was at the same time placed in the same FD account with MBB to earn higher interest making a total of $19.3 million (ie, $19 million + $300,000). 33     The Company received the $19.3 million on 4 December 2004 by way of two cheques: (a)     a cheque no 0448661 drawn by PPL from its UOB account for $19 million; and (b)     a cheque no 0168218 drawn by the Defendant from its UOB account for $300,000 (being part of the divestment of shares in Wee Poh Holdings Ltd). 34     Nevertheless, the Company recorded the receipt of $19.3 million by way of two debit notes as follows: (a)     the Company having received $16,050,000 from the Defendant (see Debit Note PHL/DN/167 from the Defendant to the Company dated 31 December 2004); and (b)     the Company having received $3,250,000 from PPL (see Debit Note PPL/DN/863 from PPL to the Company dated 31 December 2004). 35     I should mention here that Debit Note PPL/DN/863 incorrectly described the $3,250,000 as an advance from the Defendant to the Company when in fact the sum was a repayment by PPL to the Company of sums previously advanced to or for PPL. This was subsequently acknowledged by the Finance Manager. So the correct accounting treatment should be that the sum was from PPL (not the Defendant) as a repayment (not an advance). 36     On 9 December 2004, a sum of $3,970,916.73 was transferred from the remaining balance of the UOB FD to CDP to effect the payment of the special dividend. 37     On 10 January 2005, the court approved the capital distribution. On 11 January 2005, a copy of the court order was lodged with the Accounting and Corporate Regulatory Authority of Singapore. 38     On 4 February 2005, when the MBB FD matured, $10,987,960.85 was transferred to CDP to effect the capital distribution to shareholders of the Defendant. Although the transfer to CDP was done on 4 February 2005, the payment date was incorrectly recorded in the Company’s books as 28 February 2005. The date of 4 February 2005 was still within the two years from the date of commencement of the winding-up,ie, 22 January 2007. The other payments in question were also caught within the same two year period. There was no suggestion that the incorrect date was deliberately inserted. Indeed, it appeared that from time to time, the group did not enter the date when the actual transaction was effected but another date which would perhaps be the date of the end of the month in question. 39     From the balance in the MBB fixed deposit account (after taking into consideration the payment to CDP for the capital distribution), a sum of $8 million was transferred by the Company to PPL and placed by PPL in an FD with UOB as, by then, UOB was said to be providing a higher interest rate for deposits. Mr Lee Ee alleged that this transfer was done even though the Company also had a fixed deposit account with UOB, because PPL had other fixed deposit sums of various tenures and these other sums allowed PPL to obtain a better rate of interest from UOB. 40     The Finance Manager also gave an illustration in 2002 when a sum in a UOB FD account held by PPL was later transferred in the same year to the Company’s MBB fixed deposit account to earn a higher interest rate. 41     Both Mr Lee Ee and the Finance Manager of the Defendant said that the Defendant and its subsidiaries always functioned in totality as a group. Income from various subsidiaries in the group was considered as income earned for the group. However, neither said that the liability of each subsidiary was considered as the liability of the group. 42     Both also said that the Company was usually the payment outlet for the group. So the Company used to make payments for the salaries, bonus payments and contributions to Central Provident Fund for the group’s employees and petty cash reimbursements and allocate the payments to the correct entity within the group. 43     The Finance Manager also suggested that it was common practice for inter-company debts within the group to be set-off against each other to explain the set-off of $7,538,243.15. 44     According to ELTICI’s report, the set-off transaction was not correctly recorded in the Company’s accounting records. ELTICI commented that the transaction could not possibly have occurred in June 2005 because $18,987,960.85 (out of the $19.3 million placed in the Company’s MBB FD) had already been withdrawn and paid out on 4 February 2005 in the circumstances mentioned above,ie, $10,987,960.85 had been paid by the Company to CDP for the Defendant’s capital distribution and $8 million had been paid to PPL. I was of the view that ELTICI’s observation had assumed that the payment of $8 million had been paid to the Defendant and not to PPL which was in fact the case. The Company’s books also recorded the payment of $8 million as having been paid to PPL. Accordingly, I did not accept this comment of ELTICI. 45     ELTICI also appeared to suggest that the entire sum of $19.3 million (that had been transferred to the Company on 4 December 2004 and held in the MBB FD) was held by the Company in trust for the Defendant as the Company was “holding the moneys on behalf of [the Defendant]” and upon maturity, part of the funds were used for the capital distribution for the Defendant. 46     However, the $19.3 million was not entirely recorded as a debt owing by the Company to the Defendant. $16,050,000 was recorded as a debt owing to the Defendant and $3,250,000 was supposed to be recorded as a debt owing to PPL according to the debit notes mentioned above. However, as mentioned above, the description of the nature of the payment of the $3,250,000 was incorrect because it should have been described as a repayment by PPL to the Company and not an advance to the Company. Accordingly, even Mr Lee Ee and the Finance Manager excluded the $3,250,000 and claimed a trust for the Defendant in respect of $16,050,000 only and not the entire $19.3 million. 47     Even then, this claim by the Defendant that the Company held $16,050,000 on trust for it met several obstacles. 48     First, the Defendant had not claimed a trust initially. It was only after the argument about a trust was raised by ELTICI that the Defendant began to assert a trust, although for the lower sum of $16,050,000 as mentioned above. 49     Secondly, if the basis of the trust claim was that the money had been deposited with the Company pending court approval for the capital distribution, the sum to be paid by way of such a distribution was $10,987,960.85 and not $16,050,000. So the latter could not have been held on trust on this basis. 50     Thirdly, although the MBB FD was a separate deposit, the $10,987,960.85 was not set aside but mixed with the rest of the money totalling $19.3 million in the MBB FD. 51     Fourthly, Note 13 which refers to the $18,514,288 owing by the Company to the Defendant as at 31 December 2004 (and this includes the $16,050,000) had described the $18,514,288 as “unsecured, interest-free”. This description was consistent with a loan and not a trust. Even Debit Note PHL/DN/167 (referred to above) described the $300,000 as being transfer of funds and $15,750,000 as an advance from the Defendant to the Company. An advance is inconsistent with a trust. 52     Fifthy, interest on the entire $19.3 million accrued to the Company and not the Defendant. I did not accept the Defendant’s suggestion that this was consistent with a trust for the Defendant because income from each company in the group was treated as income of the group. 53     Mr Lee Ee sought to avoid the consequence of Note 13 as well as of the Subordination Statement by alleging that they were not intended to apply to the $16,050,000 but only to the balance of the moneys owing by the Company to the Defendant as at 31 December 2004,ie, $2,464,288 (see[51]above). However, that was contrary to the audited accounts. As they stood, both Note 13 and the Subordination Statement applied to the $18,514,288 outstanding to the Defendant as at 31 December 2004 and this sum included the $16,050,000. 54     I would add that Progen Building was owned by PPL and not the Defendant. Nevertheless, in an attempt to shore up the belated argument that the $16,050,000 was held on trust for the Defendant, Mr Lee Ee asserted that Progen Building was actually held by PPL on trust for the Defendant and hence, the sale proceeds thereof belonged beneficially to the Defendant as it was the Defendant who financed the construction and fit out of the building. Thus, according to Mr Lee Ee, there were two trusts. First, Progen Building was held by PPL in trust for the Defendant and, secondly, the $16,050,000 was held by the Company in trust for the Defendant. 55     To support the argument that Progen Building was held in trust by PPL for the Defendant, Mr Lee Ee and the Finance Manager relied on an unaudited balance sheet of PPL as at 31 October 2004 which did not include the sale proceeds of Progen Building and an unaudited balance sheet of the Defendant as at 31 October 2004 which was said to include the sale proceeds. 56     On the other hand, the liquidators pointed out that Progen Building was recorded as a fixed asset of PPL, not the Defendant, in PPL’s audited financial statements for the year ending 31 December 2003 and 31 December 2004. 57     Also, the gains from the sale were recorded in PPL’s books, not the Defendant’s. 58     In addition, the liquidators argued that the land was licensed by Jurong Town Corporation to PPL under a building agreement dated 21 August 1996 on terms which prohibited PPL from creating a trust of its interest under that agreement. 59     In view of the audited documents and the terms of the agreement between JTC and PPL, I concluded that Progen Building had not been held on trust by PPL for the Defendant. 60     In any event, even if PPL had held Progen Building on trust for the Defendant, this did not necessarily mean that the Company held the $16,050,000 on trust for the Defendant. 61     True, there were some factors in favour of a trust for $10,987,960.85 (not $16,030,000). This was a sum that was not intended to be used by the Company but to be held pending the court approval for the Defendant’s capital distribution. Also, it was possible that the $19.3 million (which included the $10,987,960.85) was placed in the MBB FD to earn a higher interest and was not meant for the Company to use as it thought fit. 62     Unfortunately for the Defendant, all the accounting documents of the Company and of the Defendant and the treatment of the interest from the MBB FD negatived a trust although they did not negative the contention about earning higher interest from MBB. Also, as mentioned, the Defendant itself did not mention a trust until the point was raised by ELTICI. 63     Therefore, I ruled against the Defendant’s trust argument. 64     Coming back to the contention that the $19.3 million was placed in the Company’s MBB FD account to earn higher interest, the liquidators did not accept this explanation. They took the position that the money was placed with the Company to allow the financial statements of the Company to be prepared on a going concern basis. Indeed, that was asserted by the Defendant’s solicitors Harry Elias Partnership (“HEP”) in a letter dated 5 May 2009 to the liquidators’ solicitors Rajah & Tann LLP where HEP was responding to a query about the Subordination Statement and Note 13. 65     The evidence which the Defendant relied on did not conclusively establish that the money was placed with the Company’s MBB FD account to earn higher interest. Although the rate of interest of MBB then was higher than the rate of interest of the earlier fixed deposits placed with UOB, it must be remembered that those placed with UOB earlier were for periods of one month each and not two months. The latter was the tenure of the MBB FD in question. Moreover, there was no evidence of the specific UOB fixed deposit rate at the time of renewal in December 2004. The lower rates which the Defendant could specifically refer to were the rates for the few months before December 2004. 66     Nevertheless, the burden was on the Defendant to establish this assertion on a balance of probabilities only. After considering all the evidence, including the previous occasion in 2002 when something similar was done, I accepted the Defendant’s explanation. However, it also seemed to me that there was a second reason, that is, the money was transferred to the Company so that its financial statements could be prepared on a going concern basis. True, the Defendant did not need to inject as much as $16,050,000 into the Company but that was what was done and, in my view, that was why Note 13 and the Subordination Statement were made. 67     In any event, I accepted that out of the $16,050,000, $10,987,960.85 was to be used to pay the Defendant’s capital distribution. Therefore, although the latter sum was not held on trust for the Defendant, I was of the view that the payment of the $10,987,960.85 to CDP for the Defendant did not in the circumstances constitute an unfair preference to the Defendant. 68     True, the payment of that sum was contrary to Note 13 and the Subordination Statement but I was of the view that the fact that Note 13 and the Subordination Statement were breached did not necessarily mean that there was an unfair preference. The liquidators had assumed that because this payment (and the other payments in question) was in breach of Note 13 and the Subordination Statement, it must mean that it constituted an unfair preference. 69     The liquidators also relied onShow Theatreswhere the Court of Appeal said at [22] that the presumption (of unfair preference) would be rebutted if the payment was made for proper commercial considerations and there were such considerations in the present case. However, it must be remembered that the issue inShow Theatreswas whether the recipient of the payment was a person connected with the insolvent paying company. The issue was not whether the statutory presumption, if it applied, had been rebutted on the facts. I was of the view that the reference to proper commercial considerations was not meant to be exhaustive or to be the test in deciding whether the presumption is rebutted in each case. All the relevant facts were to be considered in deciding whether the Company had desired to put the Defendant in a better position by the payment if the Company was wound up. It was not enough to say that the intention or the effect of the payment was to put the Company in a better position. 70     InAmrae Benchuan Trading Pte Ltd v Tan Te Teck Gregory[2006] 4 SLR 969, Sundaresh Menon JC said at [45] to [52]: 45 Against that background, I turn to the law. I begin with a passage from the judgment of Kan Ting Chiu J inRe Libra Industries Pte Ltd[2000] 1 SLR 84(“Re Libra”). The facts of the case are not material for present purposes but in considering the application of s 329 of the Act to the avoidance of undue preferences, Kan J followed the decision of Millett J in the English case ofRe MC Bacon Ltd[1990] BCLC 324. Kan J noted as follows at [36] to [37]: Section 99 which was enacted in 1995 is similar to s 239 of the Insolvency Act 1986 of the United Kingdom. The provisions introduced changes to the insolvency law of both territories. The changes were discussed inRe MC Bacon Ltd[1990] BCLC 324by Millett J with admirable clarity. He identified two significant departures from the old law. The first is that ‘(i)t is no longer necessary to establish adominantintention to prefer. It is sufficient that the decision wasinfluencedby the requisite desire.’ The second departure is that ‘it is no longer sufficient to establish anintentionto prefer. There must be adesireto produce the effect.’ 46 Kan J then cited the following passage fromRe MC Bacon Ltd(at 335–336): A man is taken to intend the necessary consequences of his actions, so that an intention to grant a security to a creditor necessarily involves an intention to prefer that creditor in the event of insolvency. The need to establish that such intention was dominant was essential under the old law to prevent perfectly proper transactions from being struck down. With the abolition of that requirement intention could not remain the relevant test. Desire has been substituted. That is a very different matter. Intention is objective, desire is subjective. A man can choose the lesser of two evils without desiring either. It is not, however, sufficient to establish a desire to make the payment or grant the security which it is sought to avoid. There must have been a desire to produce the effect mentioned in the subsection, that is to say, to improve the creditor’s position in the event of an insolvent liquidation.… Under the new regime a transaction will not be set aside as a voidable preference unless the company positively wished to improve the creditor’s position in the event of its own insolvent liquidation. There is, of course, no need for there to be direct evidence of the requisite desire. Its existence may be inferred from the circumstances of the case just as the dominant intention could be inferred under the old law. But the mere presence of the requisite desire will not be sufficient by itself. It must have influenced the decision to enter into the transaction. 47 Both these decisions were followed by Lai J inAmrae Benchuan(see at [81] of her judgment). 48 There is a further aspect to be considered: When dealing with payments to associates, which give rise to a rebuttable presumption that the payment was influenced by the relevant desire, what is the approach to be taken in determining whether that presumption has been rebutted? On this, I have found assistance in two earlier decisions of this court. Firstly, Kan J inRe Libra, which I have already referred to, did touch on this. Kan J followed the decision of Lloyd J inWills v Corfe Joinery Ltd[1998] 2 BCLC 75(“Wills”) and held at [42] to [45] and [50] to [51] of his judgment that: (a) the burden fell on the recipient of the payment to rebut the presumption that the payment was influenced by the relevant desire; and (b) in this regard, the court should look at all the relevant circumstances in order to determine whether there was sufficient evidence to conclude on a balance of probabilities that the payment was influenced by the relevant desire. 49 On the facts before him, Kan J noted as follows at [48] to [50]: In the light of the explanation and the payments, I accept that there was an established practice for Libra Industries to make payments into the account with Libra Holding without reference to specific invoices, and that the payments listed in the table were made in accordance with that practice. The reason for payment absent inWills’case is present here. There is another distinguishing feature from that case. Libra Holdings was not repaid in full while other creditors were neglected. Over the period January 1995 to February 1997, Libra Industries paid $3,970,538 to Libra Holdings and $5,691,874 to 310 other creditors. After those payments were made, $153,421 was owing to Libra Holdings and $2,061,435 was owing to the other creditors. I took all these matters into consideration. Evidently, not every creditor was treated with perfect equality by Libra Industries. A company in its normal course of business may not treat all creditors equally for various reasons, eg the degree of goodwill with the creditor, the size of the debt, the need to continue trading with the creditor. This will hold true even when the company is in financial difficulty. In determining whether a payment is voidable for being preferential, Millett J’s observations on the difference between desire and intention are instructive, and the former must be present. 50 A very similar approach was taken by Choo Han Teck JC (as he then was) inSoh Gim Chuan v Koh Hai Keong[2002] 4 SLR 212… 51 In my judgment, in the light of the authorities, the following propositions may be advanced when considering whether a transaction may be successfully challenged as an undue preference: (a) A person is taken to intend the natural consequences of his action. As every payment or grant of security potentially has the effect of preferring the payee or the grantee in the event of the paying company’s subsequent insolvency, something more has to be shown. Otherwise, the question of preference would be determined in every case simply by undertaking an objective inquiry into whether in effect there had been a preference. (b) The legislation in its previous form provided that what had to be shown was that the achievement of the preference was the predominant intention. That is no longer the case. What needs to be shown under the law as it now stands is that the payment was influenced by the desire to improve the creditor’s position in the event of an insolvent liquidation. (c) The analysis is to be undertaken by reference to the time of the impugned transaction: seeWills([49]supra). (d) Where the challenged transaction involves an associate, there is a rebuttable presumption that the company entered into that transaction under the influence of the relevant desire. In such a case, the court will examine all the facts, and determine whether on a balance of probabilities the presumption had been rebutted. 52 A transaction will therefore not be set aside unless the court is satisfied that at the time of the transaction the company was influenced by the desire to improve the creditor’s position in the event of its own insolvent liquidation. 71     I accepted that as regards the sum to be paid by way of capital distribution, it had been temporarily placed in the Company’s MBB account pending court approval whereupon it would be used to effect the payment of the capital distribution. The fault was not so much in making the payment to CDP for that distribution but in making Note 13 and the Subordination Statement in circumstances which demonstrated that Mr Lee Ee and the Finance Manager, if not the rest of the directors as well, knew or ought to have known that Note 13 and the Subordination Statement were not true in their entirety. 72     As for the $8 million from the Company’s MBB FD which the Company had paid to PPL, the liquidators did not challenge that payment as an unfair preference. 73     This brings me to the next largest sum in question,ie, the set-off of $7,538,243.15. 74     According to the first written submission for the liquidators, at para 14(c), this set-off was effected by applying $7,538,243.15 owing by PPL to the Company against the same amount owing by the Company to the Defendant. 75     If this was the case, it seemed to me that it was then for the Company to make PPL a party and claim that the set-off was ineffective so that PPL still owes the Company $7,538,243.15. However, PPL was not a party in the action before me. 76     In any event, I noted that the Company did in the past apply some inter-company set-offs although the liquidators stressed that from their review of records from January 2003, this was the first time that all the debts and liabilities of the related companies in the group were transferred to one single entity,ie, the Defendant. 77     While it was not normal for a set-off of this extent to be done, the liquidators did not dispute that there were times when some set-offs were done. 78     As for the payments to CPF and for bonuses and reimbursements of petty cash, I was satisfied that these were part of the Company’s practice. Likewise, for the Company’s reimbursement to the Defendant for the Defendant’s earlier payment for the Company’s iron ore purchases. 79     I would add that even after June 2005, the Company was making payment to various third party creditors, and PPL as well. The payments began to be substantially reduced from, say, December 2006 only. The liquidators have not challenged the subsequent payments to PPL between July 2005 to November 2006 as being unfair preferences. 80     As at the date of the winding-up order, the creditors of the Company are as follows: S/NoCreditorAmount (S$)1.Defendant1,000,454.962.PPL86,728.763.Lim Hua Yong & Co7,509.304.Sheng Fatt Air-conditioning & Refrigeration4,492.255.Uni-Sanitary1,264,254.686.Sinsino Fan Pte Ltd93,000.007.Jackly Engineering Pte Ltd415,158.558.Comptroller of Goods and Services Tax7,176.189.Winter Engineering – Contingent2,982,444.23Total:5,861,218.91   81     In the circumstances, I was of the view that the nine transactions in question, other than the payment of the sum of $10,987,960.85, also did not constitute unfair preferences. 82     As can be seen, the Defendant and PPL are still creditors of the Company. This was not a case where they were repaid in full while other creditors were neglected. True, not every other creditor was paid. Some were and some were not. Notably, Uni-Sanitary and Winter Engineering were not paid. However, as was observed inRe Libra, it is not the case that every creditor of a company will be treated equally. Put in another way, the fact that some creditors were not paid did not necessarily mean that the other payments fell foul of the law. 83     In the circumstances, I dismissed the liquidators’ claim. However, I decided that each party should bear their/its costs of the action since it was the breach of the Subordination Statement and Note 13 that caused the liquidators of the Company to commence this action. I had also ruled against the Defendant on the trust argument. 84     In addition, I had inquired whether Mr Lee Ee should indemnify the Defendant for its legal costs as he was largely responsible for the above state of affairs. Also, he and his wife were shareholders holding a direct interest of about 30% in the Defendant. As he agreed to indemnify the Defendant for its costs, I made an order to that effect. 85     There is, however, one other observation I wish to make. It seemed to me that the directors of the Company, or at least Mr Lee Ee, did not bother to ensure that the Subordination Statement and Note 13 were accurate. There seemed to be some negligence or recklessness even if there was no fraud. Furthermore, although Mr Lee Ee said he would take full responsibility for the Subordination Statement, and presumably for Note 13 as well, there seemed to be an absence of genuine remorse. These two statements were not the only “errors” which had occurred. To recapitulate some other examples: (a)     the effective dates of transactions were at times incorrectly entered in accounting documents of the Company; and (b)     the payment of $3,250,000 by PPL to the Company was actually a re-payment of an amount to the Company but not recorded correctly. 86     There was no hint that steps would be taken by the Defendant to put its house in order. The Defendant appeared to treat the present claim as more of a nuisance rather than an overdue alarm. 87     I am concerned about the Defendant’s mindset bearing in mind especially that it is a listed company. 88     I hope the liquidators will bring this unsatisfactory state of affairs to the attention of the auditors of the Company who, I was informed, are also the auditors of the Defendant, if not to the Singapore Stock Exchange as well."
    }
}