{
    "case_title": "Surender Singh s/o Jagdish Singh And Another (administrators of the estate of Narindar Kaur d/o Sarwan Singh) v Li Man Kay and Others",
    "ncitation": "[2009] SGHC 168",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "",
        "The parties in this action": "1       This action arose from the tragic death of one Narindar Kaur d/o Sarwan Singh, aged 33 years (the “Deceased”), on 16 February 2005, mere hours after undergoing a surgical procedure, termed Left Hand Assisted Laparoscopic Donor Nephrectomy (“HALDN”), to remove her left kidney for donation to her husband, Surender Singh s/o Jagdish Singh (the “first plaintiff”), who was suffering from end-stage renal failure. Minda Kour d/o Hendar Singh (the “second plaintiff”) is the Deceased’s mother. Where relevant in this judgment, the first and second plaintiffs will be collectively referred to as “the plaintiffs”. 2       The HALDN procedure was performed at the National University Hospital of Singapore (“NUH”) by Dr Li Man Kay (“Dr Li”) who is the first defendant. Dr Li was assisted by Dr Consigliere David Terence (“Dr Consigliere”) who is the second defendant. Dr Li was the head of the renal transplant team of the Ministry of Health from 2001 to August 2008. He is an urologist and renal transplant surgeon by training and is in private practice. He is also a visiting consultant for urology at NUH and the Singapore General Hospital (“SGH”). 3       Dr Consigliere is presently a senior consultant and the head of the Department of Urology at NUH which is the third defendant in this case. Where necessary, Dr Li and Dr Consigliere will be referred to collectively as “the two doctors” and the two doctors and NUH will be referred to collectively as “the three defendants”.",
        "The nature of this action": "4       The Deceased left behind as dependents, her husband (vizthe first plaintiff) and three young children who are aged 14, 13 and 6 years. The plaintiffs are the co-administrators of the Deceased’s estate and brought this claim on behalf of and for the Deceased’s dependents, on the basis of negligence and/or breach of contract against Dr Li, Dr Consigliere and NUH, pursuant to ss 20 and 21 of the Civil Law Act (Cap 43, 1999 Ed).",
        "Background facts": "5       Before I set out the events surrounding the Deceased’s HALDN procedure on 16 February 2005, it would be necessary to first explain the renal anatomy and the HALDN procedure, for a better understanding of what transpired.",
        "The renal anatomy": "6       Counsel for the two doctors Edwin Tong (“Mr Tong”) had very helpfully provided the court at the commencement of the trial with three diagrams depicting the renal anatomy. These are reproduced inAnnex Aand should be viewed together with the description set out below. 7       The renal system comprises of two kidneys (viztheleftand therightkidney), two ureters (leftandright), a single bladder and a single urethra. The kidneys are highly vascularised organs receiving approximately 20% of the human body’s resting cardiac output. The organs regulate the volume and concentration of fluids in the human body by producing urine which removes,inter alia, waste products from the blood. 8       The HALDN procedure involved the Deceased’s left kidney and the focus will therefore be on the left side of the renal anatomy. The left kidney is connected to three central systems. In the first connection, the bladder is connected to the left kidneyviathe left ureter. In the second connection, the left kidney is connected to the aortaviathe left renal artery. The aorta, the largest artery in the human body, brings oxygenated blood to all parts of the body. The left renal artery supplies the left kidney with blood and oxygen directly from the aorta. In the third connection, the left kidney is connected to the inferior vena cavaviathe left renal vein. The inferior vena cava returns blood to the heart from the lower part of the body. The left renal vein drains the left kidney. Simply put, blood flows from the left kidney through the left renal vein to the heartviathe inferior vena cava, after waste products have been removed. The left renal artery and the left renal vein are major blood vessels connected to the left kidney. Typically the renal artery branches out from the aorta in a single vessel which then divides into two branches (creating a “Y” shape) that pass into the kidney. The left renal vein, which branches out from the inferior vena cava, may have two or three branches, but these may or may not pass into the left kidney. Apart from the renal artery and the renal vein, smaller blood vessels surround the renal bed, the tissues around the renal artery, the renal vein and the kidney itself. 9       Urine, the filtered product containinginter alia, waste materials excreted from the left kidney passes down the left ureter and collects in the bladder. It is passed out from the bladder and the bodyviathe urethra. 10     To remove the left kidney from the donor, all the different tissues attached to the three central systems in[8]must be dissected from the left kidney. Once the dissection of these tissues (which include the left renal artery and the left renal vein) are done, the tissues are secured using a variety of means including clips known as Hem-o-lok clips. Once clipped, the tissues are then transected. The left kidney will then be transplanted into the recipient. As the tissues are usually embedded with other tissues (such as the colon, the spleen and fatty tissues) that have to be first moved, cauterised or removed from the left kidney, the surgeon’s task of identifying and freeing the tissues is challenging. I turn next to the HALDN procedure.",
        "The HALDN procedure": "11     Laparoscopic donor nephrectomy is a type of keyhole surgery performed on a kidney donor to remove one of the donor’s kidneys for transplantation into a recipient. HALDN is one method of keyhole surgery. In HALDN, three abdominal incisions are made by the first surgeon at the start of the surgery. The first incision, of about 7 cm, is made around the patient’s navel for the insertion of the hand port. The hand port allows the first surgeon to insert and use his hand in the patient’s renal bed area during the surgery and also to remove the detached kidney at the end of the surgery. 12     After this first 7cm incision, two smaller abdominal incisions, of about 10mm, are made for two 10mm ports. An endoscopic camera is inserted through one port while laparoscopic surgical instruments are inserted through the other port. The endoscopic camera is operated by the second surgeon. The camera captures images of the renal bed. These images are magnified and displayed on two television monitors on either side of the operating table. The positioning of the television monitors ensures that both the first and the second surgeons are able to see the images which are displayed about 1m from each of them. With such a set up, one advantage of laparoscopic donor nephrectomy (and HALDN) is that unlike standard open surgery (where the surgeons have the best and perhaps only view of the surgical site), everyone in the operating room can see the images on the two television monitors. 13     Where surgery is for the removal of the left kidney, the first surgeon, relying on visualisation from the endoscopic camera, will proceed to dissect and transect the left ureter, the left renal artery, the left renal vein and the surrounding blood vessels. Each of these vessels will first be secured and then dissected. If the donor’s renal artery is cutbeforebranching, there will be a single arterial vessel on the graft side (ie, the side where the kidney is to be removed for implantation) for anastomosis (ie, connection) in the recipient. The portion of the renal artery on the graft side must be of a sufficient length for anastomosis. On the other hand, if the renal artery is cutafterbranching, there will then be two arterial vessels on the graft side for anastomosis in the recipient. Obviously, anastomosis in the recipient would be easier if the arterial vessel is cutbeforebranching, since only one vessel is involved. The challenge however is to identify a sufficient length of the renal artery or renal vein from the proximal end (vizthe portion of the vein or artery that comes out of the inferior vena cava or the aorta) before branching occurs, to secure the vessel before transection. Following transection of the left renal vein and artery, the kidney is then removed through the hand port. 14     The major vessels (which include the renal artery and the renal vein) are secured and transected only after the smaller vessels have themselves been secured and transected. The reason for this order is that once the renal artery is clamped, blood will not flow into the kidney any more. The moment the renal artery is clamped, arterial circulation is interrupted and that starts what is called the warm ischemic time. At this stage, the kidney is live but is deprived of blood. The warm ischemic time ends with the commencement of cold perfusion (which involves the flushing of the extracted kidney with a special iced solution) of the extracted kidney to prepare it for transplantation into the recipient. The warm ischemic time, which is always measured and monitored closely in transplants, should be as short as possible as it affects the quality of the extracted kidney for transplantation. 15     The portion of the renal artery and the renal vein on the graft side of the extracted kidney would then be left free for anastomosis with the recipient’s renal artery and renal vein. Upon anastomosis, the flow of blood through the transplanted kidney starts again. Suction is frequently applied to the renal bed to remove remnant blood which may collect. This ensures visibility of any active bleeding sites. 16     After the kidney is removed, mopping, flushing and suction are performed to clean the renal bed of blood and haemoserous fluid. The renal bed and the abdominal cavity are then checked to ensure that there are no bleeding sites and that haemostasis (vizthe process by which bleeding stops) is first achieved, before the three surgical incisions in[11]and[12]are closed.",
        "Hem-o-Lok clips": "17     As stated earlier at[10], the use of Hem-o-lok clips is but one of the various methods that are used to secure the renal vein, the renal artery and the surrounding blood vessels in HALDN. 18     Hem-o-lok clips come in different sizes and are white in colour. The clips are made of a non-absorbable polymer material with a locking device. For our purpose, it is sufficient to note that there are “ML” sized clips and “MLX” sized clips. “MLX” sized clips (“10mm Hem-o-lok clips”) which have a usable length of 10mm are larger than “ML” sized clips (“5mm Hem-o-lok clips”) which have a usable length of only 5mm. Generally speaking, the 10mm Hem-o-lok clips are used for larger vessels like the renal artery and the renal vein while the 5mm Hem-o-lok clips are usually for smaller vessels, such as the gonadal vein and adrenal vein, which are branches of the renal vein. Both clips, in “open” and “closed” mode, are shown inAnnex B. The jaws of these clips are not smooth but serrated. This intentional design feature serves two functions – first, it allows the clips to bring the vessels close together but not completely. Second, it also serves as a resistance to slippage where the serrations bite into the outer part of the vessel. The tips of these clips are curved. These curved tips constitute a unique clamping mechanism for keeping the vessels in place. 19     The clips (which can only go around a vessel if it completely encircles it) are applied around vessels with a special hand-held clip applicator which is inserted through one of the two 10mm ports. The clip applicator provides tactile and sound feedback on the closing and locking of the clips, hence confirming that the clips have indeed locked. This unique locking mechanism provides additional security in renal vessels. There is a “large” clip applicator (inonecolour) meant only for the 10mm Hem-o-lok clips and a “small” clip applicator (inanothercolour) to be used only for the 5mm Hem-o-lok clips. A “large” clip applicator cannot be used for the 5mm Hem-o-lok clips andvice versa. These unique features of the clip applicators ensure that only one size of clip is applied with the use of each clip applicator. In the event the blood vessels are not properly clipped, there will be observable active bleeding, resulting in either additional clips or alternative securing devices being used. 20     Because the smaller branches of the venous and/or arterial systems (which are secured by the Hem-o-lok clips) usually differ in number and size from person to person, there might be a need for different sized clips and/or different numbers of clips to be used. In other words, the numbers and sizes of Hem-o-lok clips to be used in a HALDN procedure depends on the patient. 21     Between 2002 and February 2005, international medical literature and practice supported the use of Hem-o-lok clipsalonefor securing the renal artery, the renal vein and other blood vessels to achieve haemostasis in laparoscopic donor nephrectomies. In fact, the use of Hem-o-lok clips waspreferredover other devices such as titanium metal clips (which were prone to dislodgment), staplers (which were prone to malfunction and compromised the length of the blood vessel on the graft side) and sutures (which take longer to put in place and hence increased the warm ischemic time). Having established the medical background, I proceed to set out the undisputed facts.",
        "The facts": "22     The facts hereinafter set out were extracted from the respective affidavits of evidence-in-chief (“AEIC”) of the witnesses of fact for all parties. The facts will then be examined against the evidence given by those witnesses. The considerable details in the facts are necessary because of the manner in which the plaintiffs’ claim was pleaded in the statement of claim.",
        "Events before the HALDN on 16 February 2005": "23     The first plaintiff and the Deceased married in 1993. The Deceased worked as a sales and customer care executive from 2000 until her demise. The first plaintiff has been a prison warden with the Singapore Prison Service since 1991. In early 1996, the first plaintiff was diagnosed with kidney problems. Even though he received treatment, his kidneys failed in 1999 whereupon he underwent regular but financially draining, dialysis. Unfortunately, his condition deteriorated further. The Decreased offered to donate one of her kidneys to the first plaintiff in 2004. 24     Although he was initially reluctant, the first plaintiff (who was receiving out-patient treatment at NUH) finally agreed. The first plaintiff and the Deceased then approached NUH for advice on such a donation. This set in motion a series of consultations and meetings withinter alia, Ms Manjit Kaur (“Ms Manjit”), who was the Chief Transplant Coordinator of NUH’s Kidney Transplant Programme. Pre-operative assessments of the Deceased 25     Sometime around 12 November 2004, the Deceased’s willingness to donate her kidney to the first plaintiff came to the attention of Dr Pary Sivaraman (“Dr Pary”), who was then the Director of the Adult Transplant Programme at NUH. Dr Pary was in charge of NUH’s Kidney Transplant Programme. In the light of the Deceased’s willingness to donate one of her kidneys, arrangements were made to assess her suitability as a donor. Dr Pary oversaw the pre-operative assessments of the Deceased’s donation of her kidney to her husband with Ms Manjit’s assistance. 26     The Deceased and the first plaintiff attended a surgical assessment with Dr Li on 28 December 2004. Dr Li took the Deceased’s detailed medical history and also performed a physical examination on her. Apart from an allergy to aspirin and a history of asthma, Dr Li noted that the Deceased’s health condition was “Good”. By then, Dr Li had already seen the radiological report (“CT Report”) and the Computed Tomography (“CT”) abdomen scan performed on the Deceased and the scan itself (“CT Scan”). The CT Scan showed the anatomy of the Deceased’s renal artery and renal vein while the CT Report identified the length of the Deceased’s renal artery to be 11mm. Dr Li assessed the Deceased to be fit for HALDN. 27     According to Dr Li, he explained the surgical procedure to the Deceased “in layman terms” and its advantages over open surgery (HALDN was less invasive while open surgery involved more pain and a longer stay in hospital). Dr Li also advised the Deceased of the usual risks involved in HALDN, including the risks of wound infection and the need for re-operation or conversion to open surgery in the event of complications. He did not discuss the option of robotic laparoscopic nephrectomy with the Deceased as (according to Dr Li) that was not the standard practice for donor nephrectomy. 28     Dr Pary saw the Deceased on 17 January 2005 to assess (which he did) that she was medically and psychologically fit to undergo a kidney donation procedure. Prior thereto, Ms Manjit had arranged for various tests to be carried out on the Deceased in accordance with the kidney transplant programme in NUH. These included blood and urine tests as well as X-rays. The Deceased gave her medical history to Dr Pary (that she suffered from childhood asthma, had rare asthma attacks, had urinary tract infection during one of her pregnancies, had a left side caesarean section and that she had had an ovarian cyst removed). Apart therefrom, Dr Pary noted that “the Deceased had no other known medical problems” that would preclude her from undergoing the HALDN procedure. Dr Pary explained to the Deceased the short and long term risks of undergoing the kidney donation procedure. According to him, nothing was said about robotic laparoscopic nephrectomy. 29     Dr Pary warned the Deceased that there was no 100% certainty of a successful transplant and that if she could not accept this risk, she should not proceed with the HALDN procedure. The Deceased was given an “open date” in the event she wanted to come back to discuss the procedure on a later date or if she changed her mind. She told Dr Pary that she had already decided to go ahead with the procedure because she wanted the first plaintiff to stop dialysis and live a normal life. 30     On 14 January 2005, Dr Khare Balachandra (“Dr Khare”), a consultant psychiatrist with the Department of Psychological Medicine at NUH, conducted a psychiatric assessment of the Deceased, pursuant to Dr Pary’s request. From their discussions, Dr Khare formed the view that the Deceased was “the driving force” behind the decision to donate a kidney to the first plaintiff. Unlike other patients, he noted that the Deceased “exhibited a high level of understanding of the nature of the procedure that she had elected to undergo”. Dr Khare was informed by the Deceased that she was aware of the possibility that the first plaintiff’s body might reject her kidney and that there was a risk of death inherent in such procedures; she fully understood the risks involved. Dr Khare recorded his observations in a Fitness for Consent Assessment Record Form. 31     On 18 January 2005, the first plaintiff’s treating doctor (Dr Evan Lee from the NUH) informed Dr Pary he had no objections to the first plaintiff undergoing a kidney transplant. 32     On 28 January 2005, the NUH transplant ethics committee gave their written authorisation for the transplant to be carried out. On 2 February 2005, a blood test was again done on the Deceased to confirm that there had been no significant changes since her pre-operative assessment tests.",
        "The HALDN procedure on 16 February 2005": "33     Besides Dr Li and Dr Consigliere who were the first and second surgeons respectively, one Dr Chong Kian Tai (“Dr Chong”) was the first assistant surgeon in the HALDN procedure. Dr Chong was then a registrar attached to the Department of Urology of NUH (January to June 2005). 34     Dr Li, who has been performing renal transplant nephrectomies for some 25 years, was the first to perform HALDN in Singapore in March 2002. The HALDN performed on the Deceased was Dr Li’s forty-third such procedure. 35     Dr Consigliere has been performing renal transplant nephrectomies for some 15 years. The HALDN performed on the Deceased was Dr Consigliere’s twenty-eighth operation. 36     Dr Li was informed by Dr Ng Kah Wee (“Dr Kah Wee”) of the Deceased’s admission on 15 February 2005 and that the Deceased had been found fit for surgery. Dr Kah Wee was then a house-person with NUH’s Department of Urology. The HALDN commenced on 16 February 2005 at around 0855 hours. With Dr Li, Dr Consigliere and Dr Chong in the operating theatre was Dr Ng Huey Ping, the principal anaesthetist, and four nurses. 37     According to Dr Li, he made a midline incision of about 7cm in length at the level of the Deceased’s navel, for the hand port. He then put his left hand through this port and inserted the laparoscopic disc. This incision was for the hand port through which Dr Li would remove the Deceased’s left kidney. Next, he made two small abdominal incisions of about 10mm each, for the insertion of two 10mm ports. He then inserted an endoscopic camera through one of these ports whereupon Dr Consigliere took over the handling of the endoscopic camera. The other port was for the insertion of surgical instruments. The endoscopic camera was connected to two 19-inch television monitors, one on each side of the operating table, and which displayed magnified images of the renal bed. While Dr Consigilere handled the endoscopic camera, Dr Chong assisted both Dr Li and Dr Consigilere when required, during the surgery. Dr Chong also observed the entire procedure from the two monitors. 38     Guided by the images on the television monitor, Dr Li proceeded to deflect the colon releasing the left kidney from the surrounding organs. He identified and dissected the left ureter. He clipped and cut the hilar vessels (which are small blood vessels) surrounding the left renal vein and the left renal artery by applying two 5mm Hem-o-lok clips, spaced apart on each said hilar vessel, before cutting each vessel between the two 5mm Hem-o-lok clips. He observed that the left renal artery had no branches to be ligated. By this time, he had completely cleared and isolated both the left renal vein and the left renal artery. He then transected the left ureter at the pelvic brim with one 10mm Hem-o-lok clip. He pinched the left renal artery between his fingers whereupon the warm ischemic time commenced and was monitored on a wall-mounted digital clock. 39     Dr Li then applied two 10mm Hem-o-lok clips, side by side, to the left renal vein, before cutting the left renal vein distal to the second clip. He then applied two 10mm Hem-o-lok clips, side by side, to the left renal artery close to the aorta, leaving a margin after the second 10mm Hem-o-lok clip before cutting the left renal artery distal to this second clip. Dr Li deposed that in each case, the two 10mm Hem-o-lok clips were applied to the renal artery and vein properly and that they secured the full circumference of the left renal artery and renal vein. Dr Consigliere, who had moved the endoscopic camera to visually check that the clips fully covered these renal vessels, confirmed this. Dr Chong also agreed. 40     Dr Li then applied the clips using clip applicators of matching size. Dr Li, Dr Consigliere and Dr Chong all heard the locking sound with Dr Li feeling the tactile feedback from the clip applicators for each clip applied. No clip sprung open after application. Dr Li also visually checked and confirmed, using the magnified images on the television monitor, that the entire circumference of the left renal artery was within the lock and hinge of each clip. He was able to see the lock extending around the renal artery. He also checked and found that there were no adjacent tissues caught within the clips. Dr Consigliere and Dr Chong added that at all times no bleeding was observed to be coming from the renal artery. 41     According to Dr Li, as the securing of the renal vein and the renal artery are the most important steps of the surgery, the surgical team would have paid full attention to the television monitors during the clipping and cutting of the left renal vein and the left renal artery. In his words, “it would have been obvious to everyone in the surgical team if the clips had not locked properly”. In particular, Dr Li noted that if the left renal artery had been cut without the clips having properly secured the left renal artery, blood would have “spurted out like a fountain at the rate of about 300 – 500mls per minute with normal blood pressure.” The blood would have covered the endoscopic camera and obscured the surgical view from the television monitors. In such circumstances, it would have been impossible to continue with the surgery. However, “no such bleeding occurred during the surgery”. 42     Following the transection of the left renal vein and the left renal artery, Dr Li then removed the left kidney through the hand port. The extracted kidney was then taken for cold perfusion at a separate trolley in the operating theatre to prepare it for implantation in the first plaintiff. According to Dr Li, this took some ten minutes. During this time, Dr Chong took over the handling of the endoscopic camera and Dr Consigliere then took over as first surgeon to clean out the operation site by suction and saline wash and to achieve haemostasis. 43     According to Dr Consigliere, he pushed the fat around the stumps of the left renal artery and the left renal vein to check that the clips applied on the left renal artery and the left renal vein were properly secured. He noted that no bleeding was found and Dr Chong, who observed the images on the monitors, agreed. 44     Following the perfusion of the extracted kidney, Dr Li returned to the operating table to check the operation site before the wound was closed. Dr Li looked at the television monitor while Dr Consigliere exposed the renal bed. Together, they visually examined and confirmed that the left renal artery, the left renal vein and all other ligated vessels were completely secured with no bleeding, and that the clips were properly secured around the vessels with the locking mechanism in place. The two doctors also inspected the renal bed and abdominal cavity and found no bleeding site or haematoma (ie, blood clot). They were both satisfied that haemostasis was achieved. Dr Chong, who observed the images on the monitors, agreed. 45     Dr Consigliere then inserted a redivac drain to the left renal bed before proceeding to close the wounds. (This is a fine tube with many holes at the end that is attached to an evacuated glass bottle providing suction and is used to drain blood.) The surgery ended at about 1150 hours.",
        "Post operative care": "(1)Transfer to the recover room 46     The Deceased was transferred from the operating theatre to the recovery room at about 1200 hours for continuous monitoring. According to Dr Consigliere and Dr Chong, up to the time of her transfer from the operating theatre to the recovery room, the Deceased’s condition was stable and she displayed no signs or symptoms of active blood loss. 47     Dr Liu Yun En Bernie (“Dr Bernie”) was the medical officer stationed in the recovery room to look after post-operative cases. Nurse Wong Mei Kin (“Nurse Wong”) was the senior staff nurse working in the recovery room. A clip was put on the Deceased’s finger to monitor her heart rate and oxygen saturation. A blood pressure cuff was also put around her arm and set to measure blood pressure every five minutes. All data were displayed on a monitor. 48     According to Dr Li, he saw the patient in the recovery room at about 1330 hours. He was informed that the order for the Deceased’s discharge from the recovery room had already been signed. Dr Li noted that the Deceased’s observation parameters and oxygen saturation were normal. She was conscious and complained that her wound was painful. She was on intravenous panic controlled analgesia (“PCA”) morphine (a method whereby a person in pain can administer his own pain relief). Dr Li inspected the Deceased’s wound and found that the dressing was dry. There was no indication that the Deceased was experiencing blood loss and there was no abdominal distension (swelling of the abdomen) while the drain bottle had collected only 110mls of blood stained fluid. (2)Transfer to Ward 43 49     According to Dr Consigliere, the Deceased was transferred to the general ward at about 1410 hours. Dr Li had, at the conclusion of the surgery given instructions that the Deceased was to be placed onhourlymonitoring in the general ward. The NUH Department of Urology on-call team and Dr Consigliere were to be on 24-hours call for the Deceased. Dr Kah Wee was then stationed in the general ward. 50     In the general ward, the Deceased was placed in bed 24 of ward 43 (“Ward 43”).",
        "(A)EVENTS IN WARD 43 BETWEEN 1425 AND 1430 HOURS": "51     Based on the AEICs, there appeared to have been twoprimaryparties familiar with the events at Ward 43 between 1425 hours and 1430 hours. They were Dr Kah Wee, and nurse Lourdes Buclig (“Nurse Lourdes”), a Filipino nurse, who was the staff nurse in Ward 43. Their accounts are set out below. (i)Nurse Lourdes’ account 52     On 16 February 2005, Nurse Lourdes was on duty in Ward 43. According to her AEIC, around 1425 hours that day, “[w]ith the assistance of one of the Operating Theatre staff, the Ward porter and some student nurses”, Nurse Lourdes transferred the Deceased from the trolley used to transport her from the recovery room to the Deceased’s bed in Ward 43. After the Deceased was transferred to her bed, the Operating Theatre staff and Nurse Lourdes proceeded to examine the Deceased’s dressing, the drain, the PCA and the Deceased’s medical records which were handed over by the Operating Theatre staff. Thereafter, the student nurses measured the Deceased’s parameters under Nurse Lourdes supervision. She verified the measurements taken were accurate before she recorded them in the Deceased’s patient records which comprised,inter aliaof the following documents: (a)     an observation chart (“the observation chart”). This chart recorded,inter alia, the Deceased’s temperature, blood pressure and pulse. In the row labelled “Temperature”, the words “Hourly parameter” were written in hand. There were two entries on the observation chart for 16 February 2005, one at 1430 hours, and another at 1600 hours. For the latter entry, the words “pulse feeble” were handwritten; (b)     a clinical chart (“the clinical chart”). This chart also recorded,inter alia, the Deceased’s temperature, blood pressure and pulse. It contained entries for 15 and 16 February 2005, at four-hourly intervals. The last entry, to which no specific time was indicated, also contained the words “pulse feeble”; (c)     an intake and output chart (“the intake and output chart”). This chart recorded the oral and intravenous fluid intake of the Deceased and output (in the form of urine) on 15 and 16 February 2005. The last entry for 16 February 2005 was at 1425 hours; (d)     a pain monitoring chart (“the pain monitoring chart”). This chart indicated the pain felt by the Deceased. It contained only entries for 16 February 2005, with the last entry at 1430 hours; and (e)     treatment and progress notes (“the treatment and progress notes”). These notes recorded the Deceased’s treatment and progress on 15 and 16 February 2005. For 16 February 2005, it contained entries at 1425 hours, 1430 hours, 1600 hours and 1619 hours by Nurse Lourdes. The relevant entry for this case was that at 1600 hours; it reads: Parameter taken [Blood Pressure] – 80/60, pulse rate is faint, respiration 17/min. [Deceased] noted slightly breathless and unresponsive to call, and to pain stimulus. [Dr Kah Wee] was informed…Seen by [Dr Kah Wee]…Dr Ong C.H. (registrar) informed…IV plug set by [Dr Kah Wee]… 53     Nurse Lourdes noted that the Deceased’s “vital signs were stable with blood pressure of 108/70 mmHg, heart rate of 70 beats per minute and respirator rate of 16 breaths per minute, and that “whilst the Deceased was slightly drowsy, she was arousable.” She also noted that “[e]verything else was also in order as [the Deceased’s] wound dressing was dry save for a slight blood stain, and the urine catheter in situ was draining clear urine”. She then informed Dr Kah Wee that the Deceased had been transferred to Ward 43 whereupon Dr Kah Wee went to examine the Deceased. After Dr Kah Wee had given her instructions, Nurse Lourdes informed the Deceased that she could not eat or drink. Nurse Lourdes checked the Deceased’s intravenous drip, the intake and the output chart. No time however was stated as to when all this took place. (ii)   Dr Kah Wee’s account 54     Dr Kah Wee deposed that the Deceased reached Ward 43 at about 1430 hours. She was asked to review the Deceased which she did at 1430 hours. During the review, Dr Kah Wee found the Deceased alert and comfortable, not in pain and afebrile (ie, not having a fever). Dr Kah Wee measured the Deceased’s pulse rate and blood pressure, at 70 and 108/70 mm Hg respectively and documented in the case notes that all her vital signs were stable. The Deceased’s heart sounds were observed to be normal, her lungs clear with good air entry bilaterally. Her abdomen was soft, non-tender and bowel sounds were present. Her calves were supple, her dressing clean and drain collection minimal. After reviewing the Deceased, Dr Kah Wee noted down in the Deceased’s Surgery In Patient Case Record the post-operative plans to be carried out by the ward nurses 55     Going by Dr Li’s instructions for “hourly monitoring” at[49], the Deceased’s next review should have been at 1530 hours. (B)EVENTS AT WARD 43 AFTER 1430 HOURS TO THE ACTIVATION OF THE CODE BLUE TEAM AT 1619 HOURS 56     There were differences between the accounts of NUH and that of the plaintiffs on the events that transpired in Ward 43 after Dr Kah Wee’s examination at 1430 hours and when the Code Blue Team was activated to resuscitate the Deceased. It is therefore necessary to examine in some detail these accounts. (I)    NURSE LOURDES’ ACCOUNT 57     Nurse Lourdes claimed that at about 1515 hours, as she was walking by the Deceased’s bed, the Deceased waved to and asked her to bring the Deceased a small pillow. Nurse Lourdes obliged. When she brought the pillow to the Deceased, the Deceased had her eyes closed. Nurse Lourdes tapped the Deceased on the shoulder to wake her, the Deceased opened her eyes and apparently told Nurse Lourdes to help put the pillow on her left near the site of the wound. Nurse Lourdes deposed that at the time the Deceased was alert and responsive, did not complain of pain or of being unwell and did not have any other requests. 58     Nurse Lourdes claimed she went to check on the Deceased at around 1555 hours to take her parameters. However, when she arrived at the Deceased’s bed, a student nurse was already taking the Deceased’s blood pressure. Nurse Lourdes also noted that the relatives of the Deceased were present. She then used a pulse oximeter and connected it to the Deceased’s finger, but was unable to pick up any pulse reading. As she noticed that the Deceased’s fingers were cold, she immediately palpated the Deceased to manually obtain her pulse, which she found to be “faint and feeble”. According to Nurse Lourdes, “[a]s the student nurse experienced difficulty taking the Deceased’s pressure, [she] measured the Deceased’s blood pressure herself” and found it to be a low reading of 80/60 mm Hg and that the Deceased was “slightly breathless” with her respiratory rate at 17 breaths per minute. Nurse Lourdes also claimed that “while [she] did not notice any diaphoresis [ie, sweating], the “Deceased was unresponsive to call and to pain stimulus”. She tapped the Deceased’s shoulders and did a sternum rub on her but the Deceased did not respond. 59     Nurse Lourdes then rushed to the nursing station to inform Dr Kah Wee that the Deceased was unresponsive. On Dr Kah Wee’s instructions, she called the Urology Medical Officer (one Dr Adrian Tan) and informed him of the situation. Dr Adrian Tan told Nurse Lourdes to activate the Code Blue Team and it was activated (at 1619 hours). 60     By the time Nurse Lourdes returned to the Deceased’s bed, the Deceased had been put on 100% oxygenviaa non-breathing mask and electrocardiogram (“ECG”) leads had been connected to the Deceased’s body in preparation for resuscitation to be conducted by the Code Blue Team. Dr Kannan was the first member of the Code Blue Team to arrive at Ward 43. Nurse Lourdes briefed Dr Kannan on the Deceased’s condition. The rest of the Code Blue Team subsequently arrived and active resuscitation commenced. Nurse Lourdes estimated that the Code Blue Team arrived about 4-5 minutes after activation. She did not participate in the resuscitation procedure but was present in case the Code Blue Team needed further nursing support. (II)    DR KAH WEE'S ACCOUNT 61     According to Dr Kah Wee, “sometime between 1600 hours and 1615 hours, when she was at the nursing station (a short distance outside Ward 43), she was informed by Nurse Lourdes that the Deceased was unresponsive. Dr Kah Wee told Nurse Lourdes to inform the medical officer of the Deceased’s collapse and immediately went to assess the Deceased’s condition. 62     When Dr Kah Wee got to the Deceased’s bed, there were visitors with the Deceased and she asked them to leave. According to Dr Kah Wee, “another nurse was with the Deceased trying to measure her blood pressure”. Dr Kah Wee noted that the Deceased was unresponsive to pain stimulus and at that point in time, the Deceased’s “blood pressure and pulse rate readings could not be obtained by the nurse but on quick examination, [she] noted [that the Deceased] was cold and clammy” and that the Deceased’s pulse rate was bradycardiac (ie, slow beating of the heart at a rate below 60 beats per minute), her heart sounds were normal and that air entry to the Deceased’s lungs was good and equal bilaterally. The Code Blue Team was subsequently activated. (III)    ACCOUNTS OF DR LI AND DR CONSIGLIERE 63     According to Dr Consigliere, he had no knowledge of the events that occurred in Ward 43 from the time the Deceased was transferred there. He was only informed at about 1625 hours of the Deceased’s collapse and that the Code Blue Team had been activated. Dr Li said he had no personal knowledge of the events surrounding the Deceased’s collapse and resuscitation efforts in Ward 43. (IV)    ACCOUNT OF MS JASMAIL KAUR – THE DECEASED'S SISTER IN LAW 64     Jasmail Kaur (“Ms Jasmail”) is the first plaintiff’s sister and the Deceased’s sister-in-law. In her AEIC, she deposed that at about 1230 hours on 16 February 2005, she received information from NUH that the Deceased’s surgery had been successful, that the Deceased was presently in the intensive care unit (as opposed to the recovery room) and that she would be brought to the general ward at about 1430 or 1500 hours. Ms Jasmail, her mother, the second plaintiff and the Deceased’s aunt (“the party”) decided to visit the Deceased in the general ward. 65     According to Ms Jasmail, it was at 1600 hours or just past 1600 hours that the party arrived at Ward 43. She walked ahead of the others to the Deceased’s room which hadsixbeds. The Deceased’s bed was the furthest from the nursing station at the end of Ward 43. 66     At the bedside of the Deceased, Ms Jasmail found her “breathing very heavily” and that she “appeared to be in a state of distress”. The Deceased’s “head had dropped to the right side”. Ms Jasmail called the Deceased and tapped the Deceased’s cheeks but the latter did not respond. The Deceased “looked very pale”, “her hands were placed where the wound was” and “her hands were cold to touch”. Ms Jasmail alleged “[t]here were no nurses in the room at that point in time”, no “medical gadgets were attached to her” and that “[the Deceased] did not have any nurses attending to her”. 67     Sensing that the Deceased’s life was in danger, Ms Jasmail immediately summoned for help whereupon a nurse came to the bedside. Ms Jasmail claimed that she subsequently ascertained that the nurse was a “trainee nurse”. The trainee nurse examined the Deceased and “then went out of the room and returned with a machine to clip [the Deceased’s] fingers”. However, this “machine read zero”, whereupon the “trainee nurse then ran to the nurse station and called for a doctor or nurse”. A “female doctor came and examined [the Deceased], and then she too ran to the counter and started making calls”. 68     Ms Jasmail alleged that it was “a good 20 minutes” before a team of doctors arrived at the Deceased’s bedside. The Deceased’s eyes were closed. The doctors attended to the Deceased and “there were a lot of activities”. Ms Jasmail also saw the doctors giving cardiopulmonary resuscitation (“CPR”) to the Deceased. Ms Jasmail left the ward at about 1630 hours to seek assistance from Ms Manjit, whom she knew to be a member of the transplant team of NUH. Ms Manjit came into Ward 43, saw the Deceased and then told Ms Jasmail (and the rest of the party) that the Deceased “was okay”. However, about 1½ hours later, the party was told by the doctors that the Deceased had passed away. 69     I should point out at this juncture that Ms Jasmail made a police statement soon after the Deceased’s passing (“the police statement)”. In some respects, the police statement was different from her AEIC. I will return to the police statement later. (C)     RESUSCIATTION EFFORTS BY THE CODE BLUE TEAM ON 16 FEBRUARY 2005 (I)    DR KANNAN'S ACCOUNT 70     Dr Kannan was at the material time a medical officer with the Department of Medicine at NUH. He was part of its Emergency Resuscitation Team (vizthe Code Blue Team) “which was responsible for performing emergency resuscitation to all patients, staff and other members of the general public experiencing cardiopulmonary arrest in NUH”. Dr Kannan was alerted at 1619 hours on 16 February 2005 and immediately rushed to Ward 43. 71     The Code Blue Team consisted of five other members. Dr Kannan and they were informed by Ward 43’s nurses that the Deceased had just come back from surgery as a renal transplant donor, that she had been “resting well post-operatively” in Ward 43 for about 2 hours but was then found to be unresponsive. The Code Blue Team commenced aggressive resuscitation making multiple attempts through her veins at various parts of the Deceased’s body, by both the medical and anaesthetic teams simultaneously. However they encountered difficulties as the Deceased was hypovolemic (she had lost too much blood). The Code Blue Team eventually resorted to the (larger) left subclavian vein of the Deceased to attempt resuscitation and simultaneously applied CPR. Despite the valiant efforts of the members of the Code Blue Team, they were unable to revive the Deceased even after 50 minutes of trying. (II)    DR CONSIGLIERE'S ACCOUNT 72     According to Dr Consigliere, the resuscitation efforts by the Code Blue Team were ongoing when he arrived at Ward 43 at around 1640 hours. He observed the resuscitation performed by the Code Blue Team as well as the Deceased and considered the possible causes for the Deceased’s collapse. He noted that there was no abdominal distension and that although the Deceased’s dressing was slightly blood-stained, the Deceased’s bed was not soaked with blood. The drain bottle, which had a 500mls capacity also appeared to contain 100ml of blood-stained fluid. All these observations suggested to him that there was no active bleeding and that there was no indication for immediate exploration of the abdomen, even though Dr Li and himself were on standby to perform surgery if required. There was no indication that a vascular surgeon should be called. 73     Dr Consigliere deposed that during the period of resuscitation, the Deceased did not have any pulse or respiration. Further, her heart had no detectable cardiac output. He decided at 1710 hours to stop further resuscitation and the Deceased was pronounced dead at 1717 hours.",
        "The Deceased’s autopsy and the certified cause of death": "74     On 17 February 2005, an autopsy was conducted on the Deceased by Associate Professor Gilbert Lau (“Professor Gilbert”), a senior consultant forensic pathologist with the Applied Sciences Group of the Health Sciences Authority of Singapore. In his autopsy report no. AZ20050456 (“the Autopsy Report”), Professor Gilbert made the following observations: Urinary tractThere was evidence of recent left nephrectomy. The proximal resected end of the left renal vein had been securely closed with five white “Hemolock” clips. However, the corresponding portion of the left renal artery was wide open and was associated with the presence of four identical haemostatic clips which were attached to the soft tissues at its periphery.…SUMMARY OF PRINCIPAL FINDINGS…4.    Significant intra-peritoneal and left perinephric haemorrhage, associated with apparent slippage of the haemostatic clips applied to the proximal resected end of the left renal artery.COMMENTThe deceased died shortly after an elective left nephrectomy as part of a living-related renal transplant operation. Autopsy showed evidence of significant intra-abdominal haemorrhage, attributable to apparent slippage of the haemostatic clips applied to the proximal resected end of the left renal artery. 75     Professor Gilbert noted that the Deceased’s abdominal cavity: …contained 600 ml of fluid blood and blood clots; there was also a left perinephric haematoma [ie, a blood clot in the connective and fatty tissue surrounding the left kidney], measuring 15 cm in diameter and 2-3cm in thickness. 76     The “definitive cause of death” was not stated in the Autopsy Report but the “Final Cause of Death” was stated in a subsequent post-mortem histopathology report (“the Histopathology Report”) by Professor Gilbert to be: ACUTE INTRA-ABDOMINAL HAEMORRHAGEdue toFAILURE OF HAEMOSTASISfollowingLEFT NEPHRECTOMY FOR RENAL DONATION. 77     The Histopathology Report also noted that the Deceased’s heart showed: …focal small coronary artery disease… 78     Dr Chong was told by Dr Consigilere to check with Professor Gilbert on the outcome of the autopsy. However, when he arrived at the mortuary on 17 February 2005, Dr Chong was asked to wait in a waiting room. Hence, he was not present during the autopsy and he did not personally examine the Deceased. Subsequently he was briefed by Professor Gilbert on the post-mortem findings. Professor Gilbert told Dr Chong that he would make a formal report and that photographs of the autopsy findings would be taken.",
        "Contraindication for use of Hem-o-lok clips dated 13 April 2006": "79     More than a year after the death of the Deceased, the manufacturer of Hem-o-lok clipsvizTeleflex Medical issued (on 13 April 2006) for thefirsttime, a “Contraindication For Use of Hem-o-lok Ligating Clips in Laparoscopic Donor Nephrectomy” in living donor patients.",
        "The findings of the State Coroner": "80     The Deceased’s death was the subject of a Coroner’s Inquiry (“the Coroner’s Inquiry”) held on 26 February 2007. Only Dr Li and Dr Consigilere gave evidence at the Inquiry. Associate Professor Chia Sing Joo (“Professor Chia”), who was then the head and senior consultant of the Department of General Surgery at Tan Tock Seng Hospital, prepared an independent medical report for the Coroner’s Inquiry. 81     The State Coroner found that: (a)     in all likelihood that the Hem-o-lok clips must have been properly secured during the surgery and that the slippage occurred well after the completion of the surgery as at the recovery room, the drain had 110 ml of blood stained fluid; (b)     information on the contraindication of the use of Hem-o-lok clips for donor laparoscopic nephrectomy surfaced only in April 2006. Hence, the medical team could not be faulted for using Hem-o-lok clips; (c)     the slippage of the Hem-o-lok clips, used to secure the nearest end of the left renal artery occurred inadvertently; (d)     there was no evidence to suggest that either Dr Li or Dr Consigliere ought to be criminally liable for the use of Hem-o-lok clips ; (d)     the acute haemorrhage of the Deceased took place as a result of the inadvertent slippage of the clips used to secure the Deceased’s left renal artery; (e)     the operation itself was uneventful and that there was no recording of any unexpected event. The collapse of the Deceased took place suddenly and unexpectedly. Professor Chia’s view that the resuscitative procedure was acceptable and quick was accepted and there was nothing to suggest any medical mismanagement on the part of the medical team in the post-operative handling of the Deceased; (f)     there was sufficiently close monitoring of the Deceased and there was no unreasonably long lapse of hours in which the Deceased was left unattended such that the sudden bleeding could have been detected even earlier; and (g)     post-mortem examination of the Deceased’s heart showed evidence of small coronary artery disease which in all probability had been clinically silent prior to the Deceased’s sudden and unexpected demise. Professor Gilbert’s opinion that the condition could have accelerated her death or impaired her ability to survive the post-operative haemorrhage was however debatable. 82     Based on the above findings, the State Coroner returned a verdict of “misadventure”. I turn now to the pleadings.",
        "The pleadings": "",
        "The statement of claim": "83     The plaintiffs allegedinter alia, that: (a)     doctors at NUH had advised the Deceased that her left kidney could be harvested by means of a robotic laparoscopic surgery. However, the Deceased underwent a HALDN instead; (b)     Dr Li and Dr Consigliere failed to properly secure the Deceased’s left renal artery and/or failed to ensure that the left renal artery was properly secured before completing the surgery; (c)     the Deceased’s death was caused and/or substantially contributed to by blood loss due to an unsecured haemostasis of the proximal resected end of the left renal artery; (d)     the two doctors and other staff at NUH who provided medical and nursing care to the Deceased prior to her death, owed the Deceased a duty to provide appropriate, reasonable and sound medical and nursing care, medical treatment and advice; (e)     at all material times, NUH, its employees, servants and/or agents and/or appointees including the doctors and nurses who provided medical and nursing care to the Deceased, during her stay in NUH owed the Deceased a duty of care to provide appropriate, reasonable and sound medical care, nursing care, medical treatment and advice; and (f)     NUH was vicariously liable to the Deceased for Dr Li, Dr Consigliere and other staff at NUH who provided medical and nursing care to the Deceased, in the event of any breach of duty of care on their part. Particulars of alleged negligence against Dr Li and Dr Consigliere 84     The Plaintiffs alleged that Dr Li and Dr Consigliere were negligent and breached their duty of care to the Deceased as follows: (a)     Dr Li failed to explain to the Deceased about the options of an open surgery and that of a laparoscopic surgery and their respective pros and cons; (b)     they failed to take all adequate steps to ensure that the resected left artery of the Deceased was properly and fully ligated; (c)     Dr Li failed to apply the Hem-o-lok clips on the Deceased’s left renal artery properly to ensure that the entire opening of the left renal artery was occluded and sealed properly. Dr Consigliere failed to ensure that this was done; (d)     they failed to take note that the Hem-o-lok clips used were attached to the periphery of the Deceased’s left renal artery rather than covering the entire left renal artery; (e)     they failed to ensure that the Hem-o-lok clips used to occlude the Deceased’s left renal artery were properly secured and would not dislodge; (f)     they failed to visually examine and take steps to confirm that the Deceased’s left renal artery was completely closed and that the Hem-o-lok clips were secured before completing the surgery; (g)     Dr Li failed to carefully examine the interior of the Deceased’s abdomen to confirm that all vessels were completely secured and sealed before completing the surgery; (h)     they failed to ensure that there were no bleeding sites or haematoma at the renal bed before completing the surgery; (i)     they failed to record the number of Hem-o-lok clips used as well as the specific positioning of the clips; (j)     they failed to direct that the Deceased be looked after in the intensive care unit for at least a day before transferring the Deceased to the general ward; (k)     they failed to direct that the Deceased’s vital signs and urine output be monitored continuously until she had completely recovered; (l)     they failed to direct that the Deceased be examined for signs of internal bleeding immediately following the surgery; (m)     they failed to provide for continuous monitoring of the Deceased of her vital signs and urine output in an intensive care unit until the Deceased was completely stable; and (n)     they allowed the Deceased to be transferred to the general ward within 2½ hours after the surgery where continuous monitoring was not carried out. 85     In the plaintiffs’ reply to the defence of the two doctors, it was pleadedinter aliathat: (a)     there was no monitoring of the Deceased after she was sent to the general ward and the Deceased’s relatives found her gasping for breath, cold and unresponsive; (b)     the Deceased’s death was not caused by the small vessel coronary artery disease; and (c)     the two doctors owed a specific duty of care to the Deceased to record the number of Hem-o-lok clips used during the surgery and their specific positioning. Particulars of alleged negligence and/or vicarious liability against NUH 86     The plaintiffs also alleged negligence and/or vicarious liability against NUH in that: (a)     it failed to have a system for keeping proper records of the number and specific position of the Hem-o-lok clips used during such surgeries. (b)     it prematurely transferred the Deceased from the recovery room to the general ward after the surgery; (c)     it failed to ensure that the Deceased’s vital signs and urine output were monitored and measured continuously for a day following the surgery or until such time as the Deceased could be said to be out of danger; (d)     it failed to transfer the Deceased to an intensive care unit after surgery where the Deceased’s vital signs and urine output could have been continuously monitored; (e)     it failed to have in place a protocol to continuously monitor or to monitor at frequent intervals the Deceased’s vital signs until the Deceased was completely stable and out of danger; (f)     it failed to have in place a protocol that carried out sufficiently regular examinations of patients for signs of bleeding from surgical sites following a major surgery; (g)     it failed to notice that the continuous bleeding from the surgical site was an indication that the Deceased was experiencing internal bleeding. NUH also failed to carry out timely investigations to rule out bleeding from the Deceased’s renal artery and renal vein; (h)     it failed to carry out adequate and timely steps to control the Deceased’s bleeding and to resuscitate the Deceased; (i)     it failed to diagnose the reasons for the Deceased’s continuing blood loss and to take prompt action by providing the services of a vascular surgeon; and (j)     it failed to promptly alert the two doctors on the Deceased’s post-surgery complications so that they could ascertain the cause of the Deceased’s condition. 87     It is to be noted that particular (a) of the plaintiffs’ allegations of negligence against the two doctors in[84]related to the pre-operative advice rendered to the Deceased while particulars (b) to (i) related to the conduct of the surgery itself and particulars (j) to (n) related to the post-operative care of the Deceased. 88     In the plaintiffs’ reply to the defence and counterclaim of NUH, it wasinter alia: (a)     denied that Nurse Lourdes had, at around 1600 hours, recorded the Deceased’s blood pressure, rechecked the Deceased’s pulse and had difficulty palpating her pulse; (b)     denied that Nurse Lourdes had alerted Kah Wee who saw the Deceased just after 1615 hours and who had noted the Deceased to be unresponsive with a weak, but present, radial pulse; (c)     contended that the findings in the Coroner’s Inquiry were irrelevant; and (d)     denied that the two doctors did not owe a specific duty of care to the Deceased to record the number of Hem-o-lok clips used during the surgery and their specific positioning. Particulars of breach of contract against NUH 89     In addition to the tortious claim set out above, the plaintiffs also alleged that the Deceased had agreed to provide consideration to NUH in exchange for medical care, treatment and advice, and that pursuant to this agreement (“the agreement”), NUH had indeed provided medical care and treatment to the Deceased. It was further alleged that it was an implied term of the agreement that NUH would provide reasonable, good and professional medical care, treatment and care to the Deceased which implied term NUH had breached. 90     In the plaintiffs’ defence to the counterclaim of NUH, it was pleaded: (a)     that because NUH were negligent in providing medical treatment to the Deceased, they had breached the agreement and were not entitled to medical fees for such treatment; and (b)     there was a total failure of consideration. Reliance on the doctrine of res ipsa loquitur to establish alleged negligence of Dr Li, Dr Consigilere and NUH 91     Apart from the extensive particulars pleaded, the plaintiffs also relied on the principle ofres ipsa loquitur, “where applicable” to establish the alleged negligence of the three defendants.",
        "Defence of Dr Li and Dr Consigilere": "92     In their amended defence, the two doctors: (a)     denied that the Deceased’s death was caused and/or substantially contributed by blood loss due to unsecured haemostasis of the proximal resected end of the left renal artery; (b)     admitted that they owed a duty of care to the Deceased to provide appropriate and reasonable advice, medical treatment and medical care; (c)     denied that they had discussed or advised the Deceased to undergo the option of robotic laparoscopic nephrectomy; (d)     averred that robotic laparoscopic nephrectomy was not the standard practice for donor nephrectomy in any hospital in Singapore whether at the material time or presently; (e)     averred than an ECG was conducted on the Deceased on 15 February 2005 and that it showed normal results; (f)     averred that sending a patient from the operating room straight to the recovery room, where the patient would be put on continuous monitoring was in line with the reasonable and standard practice at the material time in Singapore; (g)     contended that the Deceased asked for and was given a pillow at around 1515 hours; (h)     contended that Nurse Lourdes, at around 1600 hours, recorded the Deceased’s blood pressure, she rechecked the blood pressure and had difficulty palpating the Deceased’s pulse at around 1615 hours whereupon she informed Dr Kah Wee; (i)     contended that Dr Kah Wee saw the Deceased just after 1615 hours and found that the Deceased’s radial pulse was present but weak. Heart sounds were heard and the Deceased’s lungs were clear with equal air entry bilaterally. The Deceased was cold and clammy and unresponsive to pain stimulus. It was further contended that there was 110 mls of fluid in the redivac drain bottle; (j)     contended that Code Blue was activated at 1619 hours and that the Code Blue Team arrived soon after 1619 hours; (k)     denied that the Deceased’s injuries, blood loss and death were caused and/or contributed to by the negligence of either or both of them; (l)     asserted that at the post-mortem only a haematoma of approximately 15cm in diameter and around 2-3cm in thickness in the left peritoneal cavity (which would be calculated to account for about 550ml of blood), 600ml of blood-stained fluid in the peritoneal cavity and 450ml of blood stained fluid in the drain were found. This finding together with the fact that some 3,250ml of fluid had been infused into the Deceased during the surgery while some further 3,500ml of fluid had been infused into the Deceased during the resuscitation efforts, was inconsistent with prolonged and/or active bleeding from the left renal artery; (m)     averred that the Histopathology Report had noted a “small vessel coronary artery disease”; (n)     denied the particulars of negligence alleged against them; (o)     contended that: (i)       Dr Li had properly applied the Hem-o-lok clips on the Deceased’s left renal artery, and had properly and fully ligated the renal artery; (ii)       Dr Li had ensured that the opening of the renal artery was sealed and that an inspection of the renal bed and abdominal cavity before the closure of the Deceased’s wounds confirmed that the Deceased’s left renal artery had been properly and fully ligated and sealed by the Hem-o-lok clips that were applied; (iii)       Dr Li did not apply the Hem-o-lok clips to the periphery of the left renal artery, nor were the clips attached to the periphery of the left renal artery before the closure of the Deceased’s wound; (iv)       Dr Li had applied the Hem-o-lok clips to the Deceased’s left renal artery in a way that covered and secured the entire left renal artery, and hence properly securing the clips on the left renal artery; (v)       the two doctors had visually examined and confirmed that the left renal artery and all other vessels were completely closed and that the Hem-o-lok clips were secured before closing the Deceased’s wounds; (vi)       the two doctors had inspected the renal bed and abdominal cavity before the closure of the wounds and found no active bleeding areas and/or haematoma; (vii)       the two doctors were acting in accordance with the reasonable and standard practice in Singapore at the material time, when they permitted the transfer of the Deceased from the recovery room to the general ward following a review after the surgery that showed that the Deceased was recovering normally; (viii)       the Deceased was put on hourly monitoring parameters in accordance with the standard and reasonable practice in Singapore at the material time; (ix)       there were no signs that the Deceased was suffering from internal bleeding immediately following the surgery. The two doctors had ascertained prior to completing the surgery that the Deceased was not experiencing internal bleeding in the abdominal cavity. Further, full instructions were given to the general ward to monitor the Deceased. Dr Kah Wee’s observation in the general ward at around 1430 hours was that the Deceased’s blood pressure was 100/70 mmHg, which was within the normal range and consistent with there being no internal bleeding at the time or immediately following the surgery; and (x)       denied that the two doctors owed a specific duty of care to the Deceased to record the number of Hem-o-lok clips used during the surgery or their specific positioning. 93     Both doctors denied that the principle ofres ipsa loquiturwas applicable to this case.",
        "Defence and counterclaim of NUH": "94     The position of NUH mirrored that of the two doctors. NUHinter alia: (a)     did not admit that at all material times, it, the two doctors, its employees, servants and/or agents and/or appointees, including the doctors and nurses who provided medical and nursing care to the Deceased prior to her death during her stay in NUH, owed the Deceased a duty of care to provide appropriate, reasonable and sound medical and nursing care, and medical treatment and advice; (b)     denied that the two doctors, the doctors and nurses who provided medical and nursing care to the Deceased prior to her death during her stay in NUH, had, by their contract of engagement and/or employment with NUH, made NUH vicariously liable to the Deceased prior to her death in the event of any breach of duty of care on the part of the two doctors and that it was vicariously liable to the Deceased for such breach of duty of care; (c)     averred that no medical abnormalities were shown during the pre-operative investigations and/or procedures that were carried out on the Deceased; (d)     averred that Dr Pary had, during the Deceased’s pre-operative assessment explained to the Deceased the risks of HALDN, including the fact that statistically there is a 1 in 2,500 to 3,000 chance of death, but the risk of an individual donor dying from HALDN was uncertain; (e)     averred that when Nurse Lourdes passed the Deceased a pillow at 1515 hours, the Deceased’s family members and relatives were with her; (f)     denied that the Deceased’s injuries, blood loss and death was caused and/or contributed by the negligence of its servants, employees or agents; (g)     denied the particulars of negligence alleged by the plaintiffs; (h)     averred that: (i)       following the Deceased’s death, the Coroner’s Inquiry had found that the Hem-o-lok clips were securely applied before and after the harvesting of the Deceased’s left kidney and also inspected thoroughly before the surgical wounds were closed; (ii)       the State Coroner was satisfied that the slippage of the Hem-o-lok clips used to secure the near end of the Deceased’s left renal artery occurred inadvertently; (iii)       the State Coroner was also satisfied that NUH had sufficiently closely monitored the Deceased and there was no unreasonably long lapse of hours in which the Deceased was left unattended such that the sudden bleeding could have been detected even earlier; (iv)       there was no finding by the State Coroner of medical mismanagement or negligence on the part of NUH, its servants, agents or employees, in respect of the surgery and the post-operative care of the Deceased; (v)       it was the post-operative practice of Singapore hospitals including NUH, at the material time, to place donor nephrectomy patients, including the Deceased, in the general ward after the Deceased’s condition had stabilised in the recovery room; (vi)       it was also the practice of Singapore hospitals including NUH, to post-operatively conduct hourly monitoring of parameters (ie, oxygenation, blood pressure and heart rate) for donor nephrectomy patients, including the Deceased, in the general ward and (vii)       NUH did not owe the Deceased a specific duty of care to record the number of Hem-o-lok clips using during the surgery or their specific positioning; (i)     contended that the plaintiffs had not settled the outstanding hospitalisation and medical charges (amounting to S$1,964.33) due and owing from the Deceased’s estate for the surgery; (j)     did not admit that it was an implied term of the agreement between the Deceased and NUH for it to provide reasonable, good and professional medical care, treatment and advice to the Deceased; and (k)     denied the particulars of breach of contract alleged by the plaintiffs . 95     NUH also denied the doctrine ofres ipsa loquiturwas applicable. Counterclaim 96     NUH counterclaimed against the plaintiffs for $1,964.33 for medical services provided to the Deceased.",
        "The evidence": "97     The trial before this court was only to determine the issue of liability. In the event that the court ruled in the plaintiffs’ favour, their claim for damages will go for assessment before the Registrar at a later date.",
        "Witnesses called by the Plaintiffs": "98     Besides the first plaintiff, the plaintiffs also called as witnesses of fact, Ms Jasmail and Professor Gilbert. 99     I should emphasise that Professor Gilbert was not an “expert witness” as Mr Palaniappan, the plaintiffs’ counsel, repeatedly said. Although Professor Gilbert performed the autopsy, he was a witness of fact, albeit a very experienced forensic pathologist. Even Professor Gilbert himself readily admitted that he was not expressing any expert opinion on HALDN, on how the Hem-o-lok clips in question had slipped and on matters relating to the post operative care of the Deceased, preferring to “leave it to the relevant clinical experts”. 100    The plaintiffs had an expert witness in Professor Michael L Nicholson (“Professor Nicholson”). Professor Nicholson is the Professor of Transplant Surgery at the University of Leicester, United Kingdom (“UK”). He is also the Director of Transplantation at the Leicester General Hospital. Professor Nicholson had introduced laparoscopic live donor nephrectomy into clinical practice in the UK in 1998 and since then, he has performed some 230 such operations and has extensive experience in minimal access surgery like HALDN.",
        "Witnesses called by the Defendants": "101    The two doctors called as an expert witness Associate Professor Christopher Cheng Wai Sam (“Professor Cheng”). Professor Cheng is the Head of the Department of Urology at SGH. He is also the Deputy Head of the Renal Transplant Team of the Ministry of Health and the Director of the SGH Renal Transplant Centre. 102    Amongst NUH’s witnesses of fact were: (a)    Dr Pary; (b)    Dr Khare; (c)    Dr Chong; (d)    Dr Kah Wee; (e)    Dr Bernie; and (f)    Dr Kannan. 103    The expert witness of NUH was Associate Professor Lim Boon Leng (“Professor Lim”) who is the Head and Senior Consultant of the Department of Anaesthesia and Surgical Intensive Care at SGH. 104    The three defendants also had a common expert witness in Dr Howard Man Ho Lau (“Dr Howard”). He is an urologist at Westmead Private Hospital and the Hills Private Hospital as well as an Honorary Transplant Surgeon at The New Children’s Hospital in Sydney, Australia. Dr Howard had performed, since September 1998, over 1000 laparoscopic renal surgeries, of which 250 were laparoscopic living donor nephrectomies. 105    Although NUH intended to call her, Nurse Lourdes never took the stand. On day 3 of the trial (13 February 2009), Ms Chew (counsel for NUH) informed the court she was still trying to locate Nurse Lourdes who had returned to the Philippines where she had sworn and notarised her AEIC. On 16 February 2009, the court was informed by Ms Chew that she was still attempting to procure Nurse Lourdes’ attendance at the trial. Finally, on 23 February 2009 (day 7 of the trial), when the court inquired of her again, Ms Chew said she would not be calling Nurse Lourdes to testify. It was indicated to Ms Chew that Nurse Lourdes’ AEIC would have to be withdrawn in that event. Given her absence from court and that Nurse Lourdes could not be cross-examined on her AEIC, her written testimony hadnoprobative value at all save for the documents I had referred to earlier at[52].",
        "The undisputed facts": "106    Before going further, it would be appropriate to first set out the undisputed facts: (a)     before 16 February 2005, the Deceased had undergone extensive pre-operative tests which confirmed she had no abnormalities and she was medically and psychologically fit to undergo a kidney donation procedure; (b)     on 15 February 2005, an ECG was conducted on the Deceased which results were normal. According toBlack’s Medical Dictionary(39thed 1999 at pp 170), the main applications of the ECG are to diagnose myocardial infarction and cardiac arrhythmias; (c)     on 16 February 2005, at about 0855 hours, the Deceased underwent HALDN at NUH. The HALDN was performed by the two doctors assisted by Dr Chong; (d)     during the HALDN, Hem-o-lok clips were applied to secure the Deceased’s left renal vein and left renal artery, before these vessels were cut and the Deceased’s left kidney removed to be implanted into the first plaintiff who suffered from end-stage renal failure; (e)     the HALDN on the Deceased ended at around 1150 hours on 16 February 2005; (f)     at the conclusion of the surgery at 1150 hours, Dr Li gave instructions that the Deceased was to be placed on hourly monitoring in the general ward. In cross examination, Professor Nicholson agreed that hourly monitoring in the general ward was the “minimum standard”; (g)     after the HALDN, the Deceased was transferred to the recovery room. Throughout her stay in the recovery room, the Deceased’s vital signs were continuously monitored. By the time of the Deceased’s discharge from the recovery room, her pain from the HALDN was controlled to “good effect” and she was stable. According to Professor Nicholson, “the care in the recovery room was satisfactory”. Accordingly, there is no issuevis-à-visthe standard of post-operative care rendered to the Deceased in the recovery room; (h)     from the recovery room, the Deceased was transferred to the general ward. She arrived at Ward 43 at about 1430 hours where she was reviewed by Dr Kah Wee. Dr Kah Wee noted that the Deceased’s vital sighs were stable, her dressing was clean and that drain collection was minimal; (i)     Dr Kah Wee saw the Deceased “just after 1615 hours”. She found that the Deceased’s radial pulse was present but weak. Heart sounds were heard. The Deceased’s lungs were clear with equal air entry bilaterally. The Deceased was cold and clammy and unresponsive to pain stimulus; (j)     the NUH Code Blue Team was activated at around 1619 hours; (k)     after the Code Blue Team had commenced aggressive resuscitation, the difficulty which they encountered with accessing the Deceased’s vein led the Code Blue Team to conclude that the Deceased was hypovolemic and that her peripheral venous circulation had collapsed; (l)     the Code Blue Team’s attempts to resuscitate the Deceased were unsuccessful and the resuscitation efforts were called off at 1710 hours The Deceased was pronounced dead at around 1717 hours on 16 February 2005; (m)     the Autopsy Report found that the Deceased’s left renal artery was wide open and associated with the presence of four identical Hem-o-lok clips which were attached to the soft tissues at its periphery; (n)     the final cause of death as stated in the Histopathology Report was that the Deceased had died from acute intra-abdominal haemorrhage due to failure of haemostasis following left nephrectomy for renal donation; (o)     more than a year after the death of the Deceased, Teleflex Medical, the manufacturer of Hem-o-lok clips, issued on 13 April 2006 a “Contraindication For Use of Hem-o-lok Ligating Clips in Laparoscopic Donor Nephrectomy”; and (p)     Professor Nicholson agreed that before February 2005, there were no published reports or literature on the slippage of Hem-o-lok clips in the post-operative period.",
        "The Plaintiffs’ case and the issues": "107    I had earlier set out the case pleaded by the plaintiffs as well as the defendants. However, the case conducted by the plaintiffs at the trial departed somewhat from their statement of claim. In fact, the plaintiffs’ case before me mirrored the allegations of negligence propounded by Professor Nicholson in his expert opinion to which I now turn my attention to. 108    While the plaintiffs’ new allegations were not specifically pleaded, they were set out in Professor Nicholson’s AEIC which was extended to the defendants before the trial dates. In fact, on the first day of trial, Mr Tong, after going through the salient portions of Professor Nicholson’s AEIC, aptly summarised,inter alia, the two main issues applicable to his clients (Dr Li and Dr Consigilere). Ms Chew too did not raise any objections during the trial but did so belatedly, after the conclusion of the trial, in the closing submissions of NUH. As the defendants’ witnesses were given ample opportunity to address these new allegations during the trial itself and did so indeed, I am of the view that the defendants have not been unfairly prejudiced by the “new” allegations of negligence raised in Professor Nicholson’s AEIC.",
        "The plaintiffs’ case": "109    Professor Nicholson’s opinion was based primarily on: (a)     two post mortem photographs of the Deceased’s interior taken during her autopsy on 17 February 2005 (“the Autopsy photos”); (b)     the clinical summary of NUH dated 16 February 2005 prepared by Dr Kah Wee; (c)     the Deceased’s operations report (“the Deceased’s operations report”), prepared by Dr Li, dated 16 February 2005; (d)     the Deceased’s treatment and progress notes; (e)     the Deceased’s clinical chart; (f)     the Deceased’s observation chart; (g)     the Deceased’s pain monitoring chart; (h)     the Deceased’s intake and output chart; (i)     the Deceased’s in-patient medication record; (j)     specialist medical report of the Deceased dated 17 April 2007, prepared by Dr Li and countersigned by Dr Consigilere; (k)     the Autopsy Report; (l)     the Histopathology Report; (m)     Professor Gilbert’s entire AEIC; and (o)     Ms Jasmail’s police statement. 110    In Professor Nicholson’s opinion: (a)     the Deceased died as a result of catastrophic haemorrhage from the left renal artery stump due to dislodgment of the Hem-o-lok clips used to secure the left renal artery. The haemorrhage led to a fatal hypovolemic shock; (b)     the decision by Dr Li to use Hem-o-lok clips to secure the left renal artery and left renal vein of the Deceased was within acceptable medical standards; (c)     Hem-o-lok clips are safe if properly applied. However, one cannot say that properly applied Hem-o-lok clips will never become dislodged as there have been some isolated reports of clip dislodgment; (d)     the fact that Professor Gilbert found four locked Hem-o-lok clips just beyond the open end of the left renal artery stump suggests that all four locked clips had been used to clamp the left renal artery and that these clips had slipped off the left renal artery stump; (e)     the application of four Hem-o-lok clips to the Deceased’s left renal artery was inappropriate and contrary to acceptable surgical practice and recommendations by the manufacturer of the clips. Such an application would increase the chance of clip dislodgement or slippage; (f)     the Deceased’s vital signs were only recorded at 1425 hours in the period between the last observation at 1330 hours and the Deceased’s deterioration at approximately 1600 hours. In fact, it was Ms Jasmail who found the Deceased in a critical state when she visited the Deceased at approximately 1600 hours. A more intensive monitoring system should have been in place; it was a completely unacceptable level of post-operative monitoring after a major surgical procedure like live donor nephrectomy, where life threatening haemorrhage was a known and arguably the most feared surgical complication. As a guide, the Deceased’s vital signs should have been recorded at least every 15 minutes for the first two hours after her return to Ward 43 and then half-hourly for the next two hours. Had this had been done after 1425 hours, the Deceased’s deterioration would probably have been detected more quickly and corrective steps taken. The post surgical care rendered to the Deceased in the general ward fell below acceptable medical standards in relation to care that was reasonable and necessary for patients who underwent live donor nephrectomies; (g)     there appeared to have been a significant delay in activating the Code Blue Team when the Deceased was found unresponsive at 1600 hours. This apparent delay was likely to have contributed to her demise; (h)     the only chance of saving the Deceased would have been to re-operate immediately. Ideally, the Code Blue Team should have returned the Deceased to the operating theatre but given the Deceased’s circumstances, consideration should have been given to opening the Deceased’s abdomen in Ward 43; and (i)     it was most unlikely for Hem-o-lok clips to be dislodged solely as a result of resuscitation efforts. 111    I should point out that no evidence was adduced by the plaintiffs to support the particulars of negligence set out earlier at [83(a)], [84(a) to (h), (j) to (n)] and [86(a) to (f)].",
        "The issues": "112    There are several issues of varying complexity to be determined in this case. Broadly, they straddle the following four areas: (a)     pre-operative advice rendered to the Deceased; (b)     the conduct of the HALDN on 16 February 2005; (c)     the post-operative care of the Deceased in Ward 43; and (d)     resuscitation efforts on the Deceased. Pre-operative advice rendered to the Deceased 113    In this area, the following issues arose for consideration:- (a)     whether Dr Li had advised the Deceased of the respective pros and cons of the different types of surgeries (“Issue 1”); and (b)     whether the Deceased had been advised that she would undergo robotic laparoscopic surgery instead of HALDN (“Issue 2”). 114    Issues 1 and 2 were not pursued at the trial, presumably because Professor Nicholson found no fault in the management of the Deceased in that regard. Conduct of the HALDN on 16 February 2005 115    In this area, the following issues were raised:- (a)     whether Dr Li and/or Dr Consigilere had applied two or four Hem-o-lok clips to the Deceased’s left renal artery to secure it during the HALDN (“Issue 3”); (b)     in the event that four clips had in fact been applied to secure the Deceased’s left renal artery, whether this would have caused all four clips to slip off from the left renal artery, hence leaving it unsecured (“Issue 4”); and (c)     whether Dr Li and/or Dr Consigilere and/or NUH were under a duty to record the number and specific positioning of the Hem-o-lok clips used during the HALDN (“Issue 5”). 116    As pointed out earlier, issues 3 and 4 were not pleaded by the plaintiffs. Post-operative care of the Deceased in Ward 43 117    In this area, the following issues arose for consideration:- (a)     what is the standard practicevis-à-vispost-operative monitoring of a patient in the general ward (“Issue 6”); and (b)     whether the standard of post-operative monitoring of the Deceased in the general ward was complied with in practice (“Issue 7”). Resuscitation efforts on the Deceased 118    In this area, the following issues were raised:- (a)     whether the Deceased’s death could have been prevented if the Code Blue Team had been activated earlier (“Issue 8”); (b)     in the event that the Deceased’s death could have been prevented if the Code Blue Team had been activated earlier, whether the activation of the Code Blue Team by NUH’s staff was within acceptable standards (“Issue 9”); and (c)     whether the actions taken by the Code Blue Team to resuscitate the Deceased were acceptable (“Issue 10”).",
        "Preliminary issues": "119    Three preliminary issues must first be dealt with before I consider the issues enumerated earlier; these are: (a)     whether the Deceased’s death was caused by blood loss; (b)     whether medical records prepared by Nurse Lourdes and other medical personnel of NUH who did not testify are inadmissible; and (c)     whether an adverse inference should be drawn against NUH for failing to call as witness Nurse Lourdes and or other persons in charge of Ward 43 during the relevant time.",
        "Was the Deceased’s death caused by blood loss?": "120    The plaintiffs contended that the Deceased’s death was caused and/or substantially contributed to by blood loss from the unsecured proximal resected end of the Deceased’s left renal artery andnotthe small vessel coronary artery disease noted in the Histopathology Report. The defendants on the other hand, adopted the contrary position. Clearly this was a question of fact to be determined on the evidence before the court. 121    In evaluating the evidence on the Deceased’s cause of death, it should be borne in mind that it would not matter whether the plaintiffs’ or the defendants’ explanation was the more probable. The test isnotwhether the plaintiffs’ case is more probable than the defendants’ but whether it is more true than not on abalance of probabilities. This principle fromThe Popi M[1985] 2 All ER 712 has been adopted by our courts (seeClarke Beryl Claire (as personal representative of the estate of Eugene Francis Clarke) and Others v SilkAir (Singapore) Pte Ltd[2002] SLR 1at [58]). I should also emphasise that the court deliberates on probabilities and not on possibilities. 122    Professor Gilbert had stated in the Histopathology Report that the Deceased died from “acute intra-abdominal haemorrhage”. This was similarly stated as being the Deceased’s certified cause of death in the Deceased’s death certificate. During cross-examination by Mr Tong, Professor Gilbert estimated that the Deceased had lost approximately1,600ml of blood in her abdomen, and also acknowledged that this was “not an overwhelming amount” in the range of 2,000-4,000mls which might have been sufficient to have caused the Deceased’s death in the ordinary cause of nature. According to Professor Gilbert, it was precisely because he was aware that a dispute might later arise over whether the loss of 1,600ml of blood post-operatively might have been sufficient to have caused the Deceased’s death in the ordinary course of nature, that he therefore decided to examine all the Deceased’s major organs microscopically, the results of which were described in the Histopathology Report. 123    Upon this post-mortem microscopic examination of the Deceased’s heart by Professor Gilbert, the existence of small coronary artery disease in the small branches that enter the heart muscle (as opposed to the major coronary arteries found on the surface of the heart) was observed. However, Professor Gilbert then explained, it was onlyafterhaving weighed the significance of the small coronary artery disease against the finding of 1,600ml of intra-abdominal blood loss that he concluded that the Deceased had died from “acute intra-abdominal haemorrhage”. The small coronary artery disease according to him, “would …in all probability, have been clinically silent” and one would only attribute death to it, “by exclusion”,ie, if there was really no other more serious disease or injury that could cause the Deceased’s death. For these reasons, the small coronary artery disease was not in any way referred to by Professor Gilbert in his cause of death assessment because it was “too tenuous in this case”. 124    I should also mention at this juncture, that NUH in its Defence averred that before 16 February 2005,nomedical abnormalities were shown during the pre-operative investigations and/or procedures carried out on the Deceased. In fact in their Defence, the two doctors had pleaded that just one day before the Deceased’s operation, the ECG conducted on the Deceased showed “normal” results. 125    In his expert report, Dr Howard noted that “the total amount of blood loss [i.e. 1,600ml] is unusually low for it to be fatal in an otherwise healthy 33-year old person from the observation post-operatively”. Dr Howard sought to reinforce this statement by the following testimony: If we are looking purely on the amount of blood loss, then I think it would be unusual. I must say in my experience of doing major surgery, particularly major cancer surgery, having had experience treating, say, people who had trauma in major traffic accident, I have seen a much higher volume of blood loss even in the region of 3 or 4 litres, even 5 or 6 litres, the patient has survived. The foregoing excerpt must however be readsubjectto Dr Howard’s expert report where he noted: The exact aetiology of death for [small coronary artery] disease is uncertain as it cannot be simply explained by the relatively small amount of total blood loss.However, in the absence of any other pathology from the post mortem examination, the bleeding from the open renal artery would have to be the main contributing factor to the [Deceased’s] death. Whether the mild coronary artery disease noted in the post-mortem report plays a part is again uncertain.[emphasis added] Further, as was noted by the State Coroner (in [81(g)]), it wasdebatablewhether the Deceased’s small coronary artery disease would have accelerated her death or impaired her ability to survive the surgery post-operatively. In the light of Dr Howard’s testimony, the contention of NUH in its submissions, that the Deceased’s small coronary artery disease “should be the cause of or the dominant contributing cause of the Deceased’s death” cannot stand. 126    Professor Cheng had similarly noted that a 1,600ml blood loss being the only cause of immediate and irreversible shock was “somewhat unlikely”. In his report, Professor Cheng stated: From the information given, it is difficult to postulate with any confidence the likely cause of the collapse, There were a number of incongruent findings. The amount of blood loss found at post mortem amounted to about [1,600ml], which under normal circumstances would barely require a blood transfusion let alone lead to a irreversible shock. [The Deceased] was resuscitated with the correct measures almost immediately but there were no apparent response to fluid, intropes and CPR.The exhaustive post mortem toxicology and cardiac evaluation were essentially negative but could not totally rule out all possibilities because of the limitations of such tests.[emphasis added in bold] 127    In this regard, I would emphasise again that the burden was on the plaintiffs to show that the Deceased died of bleeding, on abalance of probabilities, a standard which didnothowever entail the plaintiffs having to rule outallpossibilities and prove beyond doubt that the Deceased’s death was caused by blood loss (see[123]above. 128    The three defendants argued that the evidence of Dr Howard and Professor Cheng were “amply supported by medical literature”. In particular, the defendants referred to a document titled “Advanced Trauma Life Support for Doctors” published by the American College of Surgeons Committee on Trauma (7thEdition) (“the ATLS”). The ATLS had outlined four classes of haemorrhage based on percentage of acute blood volume loss: Classes of haemorrhagic shockCLASS ICLASS IICLASS IIICLASS IVBlood loss (ml)Up to 750750 – 15001500 – 2000>2000Blood loss (% blood volume)Up to 15%15% – 30%30% – 40%>40%Pulse rate<100>100>120>140Blood pressureNormalNormalDecreasedDecreased I should note that the above values are only estimates based on a 70kgman. 129    Under the ATLS categorization, the Deceased’s maximum blood loss of 1,600ml would have fallen within Class II and Class III haemorrhagic shock and this was agreed to by Professor Gilbert. Class II shock was defined as being “uncomplicated haemorrhage, but crystalloid fluid resuscitation is required”. Class III shock on the other hand was “a complicated haemorrhagic state in which at least crystalloid infusion and perhaps blood replacement are required”. Of the four classes of haemorrhagic shock, “[t]he degree of exsanguination was immediately life threatening” for Class IV shock. According to the ATLS, Class IV haemorrhage should be considered a pre-terminal event, and unless very aggressive measures were taken, a patient would die within minutes. In this case the three defendants argued, because a blood loss of 1,600ml did not fall within a Class IV shock (where the blood loss exceeds 2000ml), it would have been unlikely to be fatal. 130    To my mind, the defendants’ reliance on the ATLS’s classification was misconceived for several reasons. First, as Professor Gilbert correctly noted, these classifications were not intended to provide guidance in ascertaining thecause of deathbut rather were used to indicate the risk faced by a patient from blood loss. As the ATLS itself acknowledged, the classification system was useful not for ascertaining the cause of death but: [t]his classification system is useful in emphasi[s]ing the early signs and pathophysiology of the shock state. 131    Secondly, as Professor Gilbert pointed out in cross-examination, mere failure to adhere to Class IV shock definition did not mean that one cannot die for Class III shock or even Class II shock: Now, although Class IV is defined as pre-terminal, this does not mean that someone in Class II or Class III cannot possibly have died from having lost, say, approximately 1.5 litres of blood.  132    Thirdly, even the ATLS cautioned against the sole reliance on the classes of haemorrhagic shock in understanding the signs and pathophysiology of the shock state: The distinction between classes of hemorrhagic shock may not be apparent in an individual patient, and volume replacement should be directed by the response to initial therapy rather than by relying solely on the initial classification. 133    The ATLS also warned that because: [s]everal confounding factors profoundly alter the classis hemodynamic response to an acute loss of circulating blood volume, and these must be promptly recogni[s]ed by all individuals involved in the initial assessment and resuscitation of the injured patient who has the potential for hemorrhagic shock…[i]t is dangerous to wait until the trauma patient fits a precise physiologic classification of shock before initiating aggressive volume restoration. 134    In this vein, while the following undisputed signs,vizthat: (a)     the Deceased’s abdomen was not distended; (b)     the Deceased’s drain bottle, which had a 500mls capacity, was only 110ml full; (c)     the Deceased’s wound dressings were only slightly blood stained; (d)     the Deceased was not “extremely pale as a sheet”; and (e)     the Deceased did not respond to fluid resuscitation. suggestedthat the Deceased could have been experiencing shock from anonhaemorrhagic cause such as a cardiogenic shock, septic shock or pulmonary embolism, this must be seen in the light of the position taken by NUH that before the surgery, the Deceased suffered fromnomedical abnormalities and that her ECG results on 15 February 2005 were normal. In other words, before and on 16 February 2005 itself, there wasnoreason to suggest or suspect that the Deceased could be, or had the propensity to suffer shock from the above mentionednonhaemorrhagic causes. The suggestions of non haemorrhagic causes of shock by NUH are therefore pure speculation and I dismiss them accordingly. 135    In this regard, I refer to the following extract from Professor Nicholson’s cross-examination by Mr Tong: Q:Yes, but, Professor Nicholson, you are referring to facts that had only been uncovered at the postmortem. I am talking about the very instance at 1600 hours when the team of doctors were attending to this patient. You would have to agree with me that, given the clinical assessment of the doctors, the fact that the drain was minimal, the fact that the abdomen was not distended, the fact that she was not pale as a sheet, these present themselves to the surgeons, who then considered that it was clearly possible that she could be suffering a collapse from a non-haemorraghic origin -- you would have to agree with me on that?A:Well, I don't particularly agree. I think-- I will agree that that clinical presentation could have been due to another cause of shock, but if you ask about the clinical presentation of a previously fit 33 year-old lady who has undergone a major abdominal procedure and then is found to be shocked a few hours after the operation, then I would expect the vast majority of doctors to say that the number 1 cause of that; hypovolemia due to bleeding. That must be the first thing that crosses your mind.[emphasis added] 136    On a balance of probabilities, I am of the view that the Deceased’s death was likely caused or substantially caused by blood loss.",
        "Admissibility of medical records prepared by Nurse Lourdes": "137    The parties’ dispute on this issue essentially originated from the closing submissions of NUH, wherein it was contended that statements contained in the medical and nursing records compiled by Nurse Lourdes were admissible pursuant to s 32(b) of the Evidence Act (Cap 97, 1997 Rev Ed) (“Evidence Act”); the section reads as follows: Cases in which statement of relevant fact by person who is dead or cannot be found, etc., is relevant32. Statements, written or verbal, of relevant facts made by a person… who cannot be found…or whose attendance cannot be procured without an amount of delay or expense which under the circumstances of the case appears to the court unreasonable, are themselves relevant facts in the following cases:…or is made in course of business;(b) when the statement was made by such person in the ordinary course of business, and in particular when it consists of any entry or memorandum made by him in books kept in the ordinary course of business or in the discharge of professional duty… 138    I should add that the disputed documents included many referred to by Professor Nicholson himself in preparing his opinion. 139    NUH argued that the requirements of s 32 of the Evidence Act were “clearly satisfied” on the facts of the case. Counsel for NUH Ms Chew contended that Nurse Lourdes’ attendance could not be procured without an amount of delay or expense because Nurse Lourdes could not be compelled to attend at the trial as she was in the Philippines and hence out of the Court’s jurisdiction. Ms Chew had informed the court during the trial that numerous attempts had been made to contact Nurse Lourdes via telephone and email but to no avail. Indeed, she took the unorthodox step of attaching an affidavit of her colleague (“the solicitor’s affidavit”), in her client’s closing submissions, as she put it “for good order”, exhibiting the correspondence showing her firm’s (unsuccessful) efforts to contact Nurse Lourdes. 140    However, no prior application was made by NUH before or during the course of the trial to file the solicitor’s affidavit. The court was informed in the morning of 23 February 2009 that NUH would not be calling Nurse Lourdes. As trial only concluded on 25 February 2009, it was incumbent on NUH to apply to this court to file the solicitor’s affidavit during those two days. The solicitor’s affidavit exhibited correspondence from NUH to Nurse Lourdes dated 19 January 2009 – 22 January 2009, 29 January 2009, 3 February 2009 and 9 February 2009. These could and should have been made available to the courtbeforetrial concluded, particularly after Ms Chew confirmed that NUH would not be calling Nurse Lourdes on 23 February 2009. The solicitor’s affidavit had exhibited an email from Nurse Lourdes (which was her only response) dated 24 February 2009 which said: Dear [Ms Chew],I am very sorry for not replying and for the troubles that this caused you. Due to personal reasons and unfavourable circumstances cause me not to confirm in the soonest possible my absence on the ongoing case trial.I really hope and pray that my sworn affidavit will be acknowledged in the court of Singapore…. Copies of the correspondence between NUH and Nurse Lourdes should/could have been extended to Mr Palaniappan. As counsel for the plaintiffs did not have an opportunity to cross-examine the deponent of the solicitor’s affidavit or Nurse Lourdes if her AEIC was admitted, I rejected the solicitor’s affidavit. 141    My decision to reject the solicitor’s affidavit does not in itself rule out the applicability of s 32 of the Evidence Act. It bears noting that the burden of establishing the circumstances that would bring a statement within any of the exceptions in s 32 of the Evidence Act (which provides for the admissibility of hearsay evidence) lies on the party wishing to avail itself of the provision (seeSarkar’s Law of Evidence(Wadhwa & Company, 16thed, 2007, vol 1 at pp 713) andSir John Woodroffe & Syed Amir Ali’s Law of Evidence(LexisNexis Butterworths, 17thed, 2002 vol 2 at pp 1733)). 142    In my view s 32 of the Evidence Act should be construed strictly. I needed to be convinced that Nurse Lourdes “could not be found” or “her attendance could not be procured without an amount of delay or expense which under the circumstances of the case appeared to the court unreasonable” (see alsoMohamed Ghouse v The King[1909] SSLR 2). The court was told by Ms Chew that: (a)     as of 13 February 2009 she was still trying to locate Nurse Lourdes in the Philippines; (b)     as of 16 February 2009 attempts to contact Nurse Lourdes via calls and emails were unsuccessful; and (c)     finally on 23 February 2009 that NUH would not be calling Nurse Lourdes. There was no evidence (apart from the solicitor’s affidavit which I rejected) to satisfy the conditions in s 32 of the Evidence Act and to warrant the court’s admission of Nurse Lourdes’ AEIC (seeSim & Associates v Tan Alfred[1994] 3 SLR 169andCentral Bank of India v Hemant Govindprasad Bansal[2002] 3 SLR 190). 143    I should point out however that not all the documents the plaintiffs sought to impugn were prepared exclusively by Nurse Lourdes. For example, the treatment and progress notes were also prepared by a Nurse “Grace Kutty” and Nurse “Jennifer” both of whom NUH never intended to call as witnesses. Neither did the plaintiffs call for their attendance. Secondly, the plaintiffs’ own expert Professor Nicholson had referred to and relied on the statements contained in the medical and nursing records in giving his opinion. Rejecting these documents would remove the facts underpinning Professor Nicholson’s own expert opinion. 144    The plaintiffs’ case before me focussed on the allegations of negligence propounded by Professor Nicholson. Excluding the documents would undermine the plaintiffs’ case. Further, when cross examining the defendants’ witnesses, Mr Palaniappan consistently referred to the statements in those medical and nursing records. During Professor Nicholson’s cross-examination on 24 February 2009,afterMr Palaniappan was made aware that Nurse Lourdes would not be called as a witness by NUH, he did not object when Mr Tong and Ms Chew both referred to Professor Nicholson’s AEIC and to those documents. Neither did Mr Palaniappan object on 25 February 2009, during Dr Howard’s re-examination by Mr Tong, when Mr Tong referred to some of those medical and nursing records. 145    It would appear therefore that Mr Palaniappan was accepting the truth of some of the statements contained in those records. Finally, Mr Palaniappan did not object or raise any issue when Ms Chew informed the court that Nurse Lourdes would not be called as a witness. For the above reasons, the nursing and medical records should not be rejected outright as inadmissible evidence.",
        "Whether an adverse inference should be drawn against NUH?": "146    In the plaintiffs’ closing submissions, it was submitted that NUH’s failure to call crucial witnesses to adduce evidence on the Deceased’s condition when the Deceased was in Ward 43 from 1430 hours to 1615 hours, should give rise to an adverse inference against NUH that the Deceased was in a very poor state but her condition was not treated by NUH. 147    The plaintiffs were relying on s 116(g) of the Evidence Act, which gives the court adiscretionto presume that “evidence which could be and is not produced would if produced be unfavourable to the person who withholds it”. InCheong Ghim Fah v Murugian s/o Rangasamy[2004] 1 SLR 628(“Cheong Ghim Fah”), V K Rajah JC noted, at [39], that: …Section 116(g) encapsulates a common sense rule.In the scheme of our adversarial litigation procedures, it is perfectly permissible for a party not to call witnesses or adduce evidence on any material point in issue. Section 116(g) mirrors the common law approach that a party cannot take issue with the raising of inferences about matters that the party has chosen to consciously conceal or hold back. The inference must, it has to be emphasised, be reasonably drawn from the matrix of established facts. Satisfying the court as to the availability and materiality of the evidence is a necessary prerequisite to any application of s 116(g). For example, it has often been said if there is a reasonable explanation why a witness, who is out of the jurisdiction, cannot give evidence, the inference may not be raised. Having said that, in today’s advanced technological context, replete with video-conferencing facilities and the like, older authorities on this point may need reconsideration.[emphasis added] 148    However, Rajah JC also emphasised, at [43] that care should be taken by parties intending to raise such an adverse inference, to “put” across the reasons for a witness’s absence in the course of cross-examination to give the opposing party an opportunity to explain the absence of that witness. 149    Earlier, I had set out in considerable detail at[49]to[62]the factual witnesses’ accounts of the post-operative care rendered to the Deceased in Ward 43 from 1430 hours to the activation of the Code Blue Team at 1619 hours. These included for the defendants, primarily the accounts of Nurse Lourdes (which related to events in Ward 43 after 1430 hours to the Deceased’s resuscitation after 1619 hours) and Dr Kah Wee (which related to events in Ward 43 sometime after 1600 hours). Given Nurse Lourdes’ absence at the trial and the rejection of her AEIC, there was a lacuna in the defendants’ evidence as to what transpired in Ward 43 from 1430 hours to the period between 1600 hours and 1615 hours. It was tothisinterval that Mr Palaniappan referred to. 150    In my view, it would not be appropriate to draw an adverse inference against NUH for the absence of Nurse Lourdes under s 116(g) of the Evidence Act. It must be appreciated that NUH had all along intended to call Nurse Lourdes as a witness of fact. Nurse Lourdes had also sworn an AEIC in the Philippines. This was not a case where NUH had deliberately omitted to call Nurse Lourdes or consciously concealed or held back evidence from the court. Rather, this was a case where, Nurse Lourdes, for reasons best known to her, did not want to attend the trial. In any event, Mr Palaniappan also failed to put to any of the defendants’ witnesses in the course of cross-examination, that the reason for Nurse Lourdes’ absence was her potentially unfavourable testimony. Against this background, I am of the view that it would not be fair to draw an adverse inference against NUH.",
        "The law": "151    Before I examine the main issues, it would be appropriate at this juncture to set out the legal framework for liability in medical negligence cases in Singapore as pronounced by our Court of Appeal inDr Khoo James & Anor v Gunapathy d/o Muniandy[2002] 2 SLR 414(“Gunapathy’scase”) after considering the English cases ofBolam v Friern Hospital Management Committee[1957] 2 All ER 118 (“Bolam”) andBolitho v City and Hackney Health Authority[1997] 4 ALL ER 771. 152    In recent times however, theBolamapproach has come under fire in several jurisdictions, most notably in Australia and Canada. InRogers v Whitaker(1992) 109 ALR 625 (“Rogers”), the High Court of Australia explicitly rejectedBolam(at least in relation to the duty of disclosure and advice) in favour of the approach of the Supreme Court of Canada inReibl v Hughes(1980) 114 DLR (3d) 1. Recent Malaysian decisions have also followed the Australian approach and inFoo Fio Na v Dr Soo Fook Mun[2007] 1 MLJ 593, the Federal Court finally rejectedBolam, preferringRogersas the applicable test for assessing all forms of medical negligence. 153    However, the law as it stands in Singapore and that which will be applied in this judgment, isGunapathy’scase, the salient portions of which read as follows: 3    …In determining whether a doctor has breached the duty of care owed to his patient, a judge will not find him negligent as long as there is a respectable body of medical opinion, logically held, that supports his actions. Beyond this time-honoured test of liability, neither this court nor any other should have any business vindicating or vilifying the acts of medical practitioners. It would be pure humbug for a judge, in the rarified atmosphere of the courtroom and with the benefit of hindsight, to substitute his opinion for that of the doctor in the consultation room or operating chamber. We often enough tell doctors not to play god; it seems only fair that, similarly, judges and lawyers should not play at being doctors.…63    …An expert view, in order to qualify as representative of a ‘responsible’ body of medical opinion, had to satisfy the threshold test of logic.64    This begs the question of what the threshold test of logic entails. Lord Browne-Wilkinson described it as an essentially two-stage inquiry and we would respectfully adopt his analysis.The first inquiry, according to the learned Law Lord,is whether the expert directed his mind at all to the comparative risks and benefits relating to the matter. It is accordingly the process and not the result of the expert’s reasoning that is material in the eyes of the court. The court must be satisfied that the expert had considered and weighed all the countervailing factors relevant to the issue. Bare and unsupported assertions in this respect would thus fail the test at this stage.65The second stage of inquiry relates to whether the medical expert had arrived at a ‘defensible conclusion’ as a result of the balancing process…To our minds, a ‘defensible conclusion’ connotes the satisfaction of two concepts.First, the medical opinion must be internally consistent on its face. It must make cogent sense as a whole, such that no part of the opinion contradicts with another. A doctor cannot say, for example, that he supports a certain approach and attest that in that very situation, he would nevertheless have done quite the opposite.Second, the opinion should not fly in the face of proven extrinsic facts relevant to the matter. It should not ignore or controvert known medical facts or advances in medical knowledge.[emphasis added]",
        "Issues relating to the pre-operative advice rendered to the Deceased": "154    The issues in this area were not pursued by the plaintiffs at the trial.",
        "Issue 1: Whether Dr Li had advised the Deceased of the respective pros and cons of the different types of surgeries.": "155    I had already set out in[27]Dr Li’s evidence that he had advised the Deceased of what HALDN entailed, the risks associated with HALDN and the advantages of HALDN over open surgery. Dr Li was not challenged on this aspect of his evidence at all. There was also the evidence of Dr Khare in[30], whose evidence was admittedin totowithout cross-examination, that the Deceased exhibited a high level of understanding of the nature of the procedure that she had elected to undergo and of the risks involved. 156    Theonlyevidence the plaintiffs adduced on the issue of whether as a matter offact, the Deceased had been advised of the risks of HALDN, arose from comments made by Professor Nicholson that he had seen no documentary evidence of the Deceased’s consent: …Dr Li…has stated in the medical report that the surgical procedures and risks, including that of death, and longer term results were explained to the [Deceased] and that [the Deceased] was willing and prepared for surgery. There is, however, no documented pre-operative evidence of this in the notes that I have been given and I could find no record of the operation consent form. 157    However, Professor Nicholson’s opinion is irrelevant in determining what is essentially a question of fact. In any event, Professor Nicholson had failed to consider documents which were annexed to his AEIC, which recorded that the risks of HALDN, including death were explained to the Deceased and that the Deceased had consented to the surgery. It would appear also that other documents, recording this fact were not provided to Professor Nicholson before he prepared his opinion. I am of the view that the answer to Issue 1 must be in the affirmative.",
        "Issue 2: Whether the Deceased had been advised that she could undergo robotic laparoscopic surgery instead of HALDN?": "158    It was Dr Li’s evidence that he did not discuss the option of robotic laparoscopic nephrectomy with the Deceased as it “is not the standard practice for donor nephrectomy”. Again, Dr Li was not challenged on this aspect of his evidence. In addition, it was also the uncontroverted evidence of Professor Cheng and Dr Howard that robotic laparoscopic nephrectomy is not the standard practice for donor nephrectomy. Professor Cheng even added that robotic laparoscopic nephrectomy was not performed or offered in Singapore. Significantly also, Dr Nicholson did not refer to robotic laparoscopic nephrectomy as an option for donor nephrectomy. Instead, he referred to HALDN as a “prominent” surgical technique for donor nephrectomies. I therefore hold that Issue 2 is, as Mr Tong put it, a “non-starter”.",
        "Issues relating to the conduct of the HALDN on 16 February 2005": "159    Although the two issues in this area were not pleaded by the plaintiffs and they first appeared in Professor Nicholson’s opinion, the defendants were not unfairly prejudiced for the reasons I had stated in[108]above. Together with the issue of the post-operative care of the Deceased dealt with below, this was a significant bone of contention between the parties.",
        "Issue 3: Whether Dr Li and/or Dr Consigilere had applied two or four Hem-o-lok clips to the Deceased’s left renal artery to secure it during the HALDN?": "160    Issue 3 is a threshold issue, on which hinged the plaintiffs’ entire case with regard to the conduct of the HALDN. This was accepted by Professor Nicholson in cross examination: Q:You are aware, are you not, that the finding -- or your conclusion, rather, that there were four clips placed on the renal artery is now the only basis for alleging that there's any kind of clinical mismanagement as regards the carrying out of the surgery itself?A:Yes, okay. 161    The plaintiffs’ case essentially was that if four Hem-o-lok clips had been applied to the Deceased’s left renal artery, thismighthave caused the clips to slip off the left renal artery. The position of the two doctors was that only two Hem-o-lok clips were applied to the Deceased’s left renal artery. It should be noted that the plaintiffs had no issue with the performance of the HALDN if only two Hem-o-lok clips were applied to the Deceased’s left renal artery. Accordingly, if this court finds that the plaintiffs had not, on a balance of probabilities, shown that four Hem-o-lok clips were applied to the Deceased’s left renal artery, I need not go on to consider Issue 4. With this in mind, I now proceed to examine the evidence adduced by the parties. Professor Nicholson’s hypothesis 162    The plaintiffs’ case for their proposition that four Hem-o-lok clips were applied to the Deceased’s left renal artery was derived solely from Professor Nicholson’s opinion, which, in turn was basedentirelyon two pieces of evidence. First, the findings in Professor Gilbert’s Autopsy Report that: Urinary tractThere was evidence of recent left nephrectomy.The proximal resected end of the left renal vein had been securely closed with five white “Hemolock” clips. However, the corresponding portion of the left renal artery was wide open and was associated with the presence of four identical haemostatic clips which were attached to the soft tissues at its periphery.[emphasis added] and second, on the two Autopsy photos of the Deceased’s interior taken during her autopsy on 17 February 2005. 163    It is also relevant to note that Professor Nicholson had pitched his opinion that four Hem-o-lok clips were applied to the Deceased’s left renal artery as being no higher than a hypothesis. The following excerpts from Professor Nicholson’s cross-examination made that clear:  Q:So if I told you, Professor Nicholson, that only two clips were placed on the renal artery, you wouldn't have a serious objection to that conclusion?A:No, I wouldn't.Q:Notwithstanding what you found or inferred from the pathologist's autopsy report; agree?A:Yes, I think it's the form of words which you are trying to put very carefully, but yes, I'm basically agreeing with what you are saying.…Q:You see, Professor Nicholson, let me tell you where I'm coming from. The paragraphs [87, 92, 94 and 97] that I referred you to from your expert opinion were obviously intended to convey your view that looking at the pathologist's report, that four clips had been applied onto the renal artery at surgery; right?A:I'm saying that's a possibility, from the evidence provided to me, yes.Q:No more than a possibility? Is that what you are saying now?A:Yes, I think that's the only fair thing we can say. 164    There are however two major problems with Professor Nicholson’s hypothesis,viz: (a)     it was based on unreliable and inconclusive evidence (viz, the findings in the Autopsy Report and the two Autopsy photos) and unwarranted extrapolations from the said evidence; and (b)     he failed to take into account evidence which showed that only two Hem-o-lok clips were applied to the Deceased’s left renal artery. I will elaborate on my observations further. (1)    Extrapolations from inconclusive and unreliable evidence 165    In essence, four factors, arising from the inconclusiveness of the evidence and the extrapolations from such inconclusive evidence, go against Professor Nicholson’s hypothesis that four Hem-o-lok clips were applied to the Deceased’s left renal artery. First, the findings in the Autopsy Report and the two Autopsy photos were inconclusive as to the location of the Hem-o-lok clipsduringthe surgery and fromwherethe Hem-o-lok clips had slipped. In other words, Professor Gilbert’s finding that the Deceased’s “left renal artery…was associated with the presence of four identical [Hem-o-lok] clips which were attached to the soft tissues at its periphery” did not equate a finding that four Hem-o-lok clips were actually applied to the Deceased’s left renal artery, as Professor Gilbert himself readily admitted in the course of cross examination, the salient portions of which are set out below: Q:Yes, thank you. Going back to your post-mortem report and in your affidavit of evidence-in-chief, you are not saying here that four clips were applied to the renal artery, correct?A:Yes, that is correct.Q:Would you have any basis for suggesting that four clips were applied on to the renal artery? On the basis of the findings that you have made at the post-mortem and on the basis of the report that you have put forward, is there any reasonable basis for concluding that four clips were placed on the renal artery?A:No, not as far as my assessment and evaluation bears it out, no.Q:Thank you. I take it that you would agree that there's absolutely no basis for concluding that four clips were based [sic] on the renal artery from the photographs?A:No, I cannot say that.…Q:Those very same report and photographs would not be a reasonable basis for concluding where those clips were applied on a patient at the time of the surgery.A:As far as the photographs were concerned, no, they would not be of much use in this respect, but with respect to the autopsy report, yes, they would indicate the location of these clips.Q:My question was at the time of surgery.A:I'm sorry, at the time of surgery, no, they would not indicate the precise location of the clips that were or ought to have been attached to the renal artery.Q:Thank you. You are not saying in your report that four clips were applied on to the renal artery; agreed?A:No.……….Q:Thank you. There is also no reasonable basis for one to conclude, based solely on your report and the photographs, that four clips were applied on the renal artery during surgery?A:That is correct. 166    Crucially, Professor Nicholson himself also conceded during cross examination that Professor Gilbert’s findings in the Autopsy Report and the two Autopsy photos could not be used to pinpoint the location of the Hem-o-lok clips during the surgery. 167    Secondly, Professor Cheng, Dr Howard and even Professor Gilbert, agreed that the two Autopsy photos were so unclear that even the Deceased’s left renal artery could not be seen clearly therein. The photographs are attached in this judgment asAnnex C. In Professor Gilbert’s words, the two photographs were “really of very little evidential value, if at all”. Even Professor Nicholson conceded that they did not show the renal artery stump and that accordingly it was not possible to be entirely sure about Professor Gilbert’s conclusions. 168    Thirdly, it was questionable how much weight could be placed on Professor Gilbert’s findings in the Autopsy Report. In cross-examination, Professor Gilbert had contended that the Hem-o-lok clips he saw during the Deceased’s autopsy wereall10mm Hem-o-lok clips. However, this contention must be seen in the light of his admissions that, prior to the Deceased’s autopsy on 17 February 2005, he: (a)     had never seen Hem-o-lok clips; (b)     was unaware of the HALDN procedure; (c)     was unaware of the type and number of renal vessels that would have to be ligated during the HALDN procedure; (d)     was unaware that Hem-o-lok clips came in different sizes; and (e)     was unaware that the size of the Hem-o-lok clips to be applied to the main vessels (ie, the left renal artery and left renal vein) would be different from that to be applied to the minor vessels, the adrenal vein and the gonadal vein. 169    During cross examination, Professor Gilbert also conceded that he did not, during the Deceased’s autopsy, go out of his way to identify and locate the various tributaries of the left renal vein, and hence, by extension, any Hem-o-lok clips that might have been used on those tributaries. 170    Professor Nicholson also conceded that Professor Gilbert, as a forensic pathologist would not have been particularly attuned to the same factors that a renal transplant surgeon would be in determining the number of Hem-o-lok clips or the location of the Hem-o-lok clips applied to the Deceased during the surgery. 171    Fourthly, it bears noting that Professor Gilbert’s findings in the Autopsy Report were not made based on anin situexamination of the Deceased’s renal bed and renal structures. While he did attempt to examine the surgical site, it “quickly became evident that because of the deep location of these [renal] structures…and the haemorrhage…it was best…not to continue attempting to examine these structures in situ from the front”. He could not even locate the Deceased’s renal artery until he had eviscerated the Deceased’s organs and while he did see the presence of some clips, before evisceration, they were not sufficiently clear for him to be able to evaluate the pathology. Professor Cheng agreed with Professor Gilbert’s great difficultly in examining the surgical sitein situ, adding that at post mortem: …[w]ith rigor mortis and no relaxation and no carbon dioxide creating the space, all the bowel and abdominal content and the minimally dissected organs around the renal hilum would have crowded the very small space that was carried out surgically. which in turn would have made it …extremely difficult to see the relevant [renal] features. 172    According to Professor Cheng, even during the HALDN, after the ligation of the renal vessels and the removal of the kidney, the arterial stump would have retracted into the soft tissue. 173    For these reasons, Professor Gilbert had to remove the organs from the body shell, which he did so, in one “block” from the tongue all the way to the abdominal organs, but excluding the bladder. This entire “block” of organs, which would have come out in anatomical continuity, would then be “flipped” so as to expose their rear, and then placed on an adjacent dissecting block, with the relative anatomical structure maintained. 174    To my mind, this evisceration process must necessarily have disturbed the renal structures and the location of the Hem-o-lok clips. Professor Gilbert testified that the aorta, to which the renal artery is connected is a “very posterior organ” behind which the spinal column is located and that during the evisceration process, he would have cut and: [r]eflect[ed] the aorta, the inferior vena cava and all of the structures, the back of the body, very, very close to the spinal column. 175    Professor Cheng, with express reference to the Deceased’s CT angiogram scan images, also noted how the Deceased’s renal vessels dived into the bony area of the lumbar spine, constituting the lumbar vein. He explained that: …in the act of evisceration, in order to remove the aorta together with the rest of the organ, it is necessary to divide all vessels that link the aorta and its accessory vein to the lumbar spine and that in this process: …in the act of evisceration, in order to remove the aorta together with the rest of the organ, it is necessary to divide all vessels that link the aorta and its accessory vein to the lumbar spine 176    Even Professor Nicholson accepted that the evisceration process could have disturbed the renal bed and the location of the Hem-o-lok clips relative to the renal structures and each other. 177    Consequently, it would be inappropriate to place too much weight on Professor Gilbert’s finding in the Autopsy Report that the Deceased’s left renal artery was associated with the presence of four identical 10mm Hem-o-lok clips attached to the soft tissues at its periphery.A fortiori, I am unable to agree with Professor Nicholson’s tenuous extrapolation from this Autopsy finding, that four identical 10mm Hem-o-lok clips had been applied to the Deceased’s left renal artery. (2)Evidence that only two 10mm Hem-o-lok clips were applied to the Deceased’s left renal artery. 178    On a balance of probabilities, I find that only two 10mm Hem-o-lok clips had been applied on the Deceased’s left renal artery. 179    First, all three surgeons involved in the surgeryvizDr Li, Dr Consigilere and Dr Chong gave consistent and corroborative evidence that only two 10mm Hem-o-lok clips were applied on the Deceased’s left renal artery. In this regard, Mr Palaniappan did not challenge their credibility or powers of recollection. He merely put it to Dr Li that the fact that four Hem-o-lok clips were found just beyond the Deceased’s left renal artery in the autopsy would suggest that those four clips were actually applied to the left renal artery, to which Dr Li disagreed. Besides noting that “it’s difficult in retrospect sometimes to remember how many clips have been used”, Professor Nicholson stated repeatedly that he had no reasonable basis to disbelieve the accounts of Dr Li, Dr Consigilere and Dr Chong. 180    Professor Cheng explained that, in his experience, it was highly unusual to apply more than two 10mm Hem-o-lok clips on each of the left renal artery and the left renal vein, and that if four 10mm Hem-o-lok clips had been applied to the Deceased’s left renal artery and five 10mm Hem-o-lok clips had been applied to the Deceased’s left renal vein, “all those participating in the surgery would remember…quite vividly”. 181    Dr Howard further elaborated that the application of Hem-o-lok clips on the renal artery is a critical step in the HALDN procedure and that surgeons experience a “heightened sense of alertness” during this period such that the “whole [operating] room” will remember if there is any deviation from the routine practice and more than two Hem-o-lok clips were applied to the renal artery. 182    Secondly, the nine Hem-o-lok clips found at post-mortem and the location of the clips relative to each other, were entirely consistent with the number of clips used in the surgery with only two 10mm Hem-o-lok clips having been applied to the Deceased’s left renal artery. To support this proposition, Mr Tong produced during the trial the Deceased’s CT angiogram scan, attached to this judgment asAnnex D, on which he marked,hypothetically, the location where the 5mm Hem-o-lok clips and 10mm Hem-o-lok clips (in green and purple, respectively) would have been placed. On this CT angiogram scan: (a)     two 10mm Hem-o-lok clips were drawn on the Deceased’s left renal vein, which when cut distal to the two clips, would leave thosetwoclips on the donor’s (ie, the Deceased’s) side of the left renal vein; (b)     two 10mm Hem-o-lok clips were drawn on the Deceased’s left renal artery, which when cut distal to the two clips, would leave thosetwoclips on the donor’s side of the left renal artery; (c)     two 5mm Hem-o-lok clips were drawn on the Deceased’s adrenal vein, which when cut between the two clips, would leave onlyoneof those clips on the donor’s side of the adrenal vein; (d)     three 5mm Hem-o-lok clips were drawn on the Deceased’s accessory left renal vein, which when cut between the clips, would leavetwoof these clips on the donor’s side of the accessory left renal vein; and (e)     two 5mm Hem-o-lok clips were drawn on the Deceased’s gonadal vein, which when cut between the two clips, would leave onlyoneof those clips on the donor’s side of the gonadal vein. In addition, as Mr Tong stated, 5mm Hem-o-lok clips would be applied on the other hilar vessels. 183    Going by Mr Tong’s hypothesis, this would mean that more than eight Hem-o-lok clips would have been left in the Deceased’s body in the renal bed area. This hypothesis was consistent with Professor Gilbert’s finding that nine Hem-o-lok clips were found. Both Professor Gilbert and Professor Nicholson conceded in cross-examination that this finding of nine Hem-o-lok clips was entirely reconcilable with only two 10mm Hem-o-lok clips having been applied on the Deceased’s left renal artery, another two 10mm Hem-o-lok clips having been applied on the Deceased’s left renal vein and 5mm Hem-o-lok clips having been applied to the minor blood vessels and tributaries. 184    Professor Cheng had also confirmed that: …I think finding nine clips or more is entirely consistent with placing two large clips on the renal artery, and two large clips on the renal vein as per normal practice, because in my practice, smaller-sized clips, either Hem-o-lock clips or metal clips, would have been deployed for all the accessory veins, the lumbar veins, the gonadal veins, the adrenal veins, before applying the final two large clips on the renal artery, so I think upward of nine clips would often be deployed. 185    When Professor Nicholson was first shown a copy of the Deceased’s CT angiogram,withoutthe markings of the Hem-o-lok clips, he agreed with Mr Tong that it would be quite useful for identifying the relative location of the clips. He was then shown a copy of the Deceased’s CT angiogram (Annex D)withthe Hem-o-lok clips marked out and asked if it was possible that the four Hem-o-lok clips found by Professor Gilbert to be “associated” with the renal artery at post mortem could have been (i) the two 10mm Hem-o-lok clips applied to the left renal artery and (ii) the two 5mm Hem-o-lok clips applied to the accessory left renal vein. At this stage, Professor Nicholson recanted his earlier agreement and contended that the CT angiogram was not useful as there was “no relationship between the position at which the clips are applied and where they end up”. However, Professor Nicholson then went on to make the observation that if one found four identical Hem-o-lok clips “parallel to each other” at post-mortem (which was his interpretation of the two Autopsy photographs inAnnex C), it would not be unreasonable to suggest that these four clips had been applied to the same structure. 186    Given the foregoing evidence, I accept Mr Tong’s submission that the four Hem-o-lok clips found “associated” with the Deceased’s left renal artery were most likely the two 10mm Hem-o-lok clips applied to the Deceased’s left renal artery and the two 5mm Hem-o-lok clips applied to the Deceased’s accessory left renal vein. 187    Thirdly, it would have been physically impossible (given the length of the Deceased’s left renal artery and the fact of a single arterial trunk anastomosis in the recipient first plaintiff) for four 10mm Hem-o-lok clips to have been applied on the Deceased’s left renal artery. As Professor Cheng and Dr Howard explained, from the ostium to the point of bifurcation, the length of the single trunk of the Deceased’s left renal artery was 11mm. Based on the first plaintiff’s own CT Report dated 16 September 2008, the first plaintiff’s renal artery anastomosed with a transplanted single trunk renal artery from the Deceased. Of the 11mm length of the Deceased’s left renal artery, 2-3mm was required for adequate anastomosis. Under such circumstances, an 8-9mm left renal artery stump would be left in the Deceased after the ligation of her left renal artery. 188    As each 10mm Hem-o-lok clip has a width of 2mm and that the clip applicator itself is wider than 2mm, the 10mm Hem-o-lok clips could not have been applied right next to one other. There would usually be a gap of 1mm between adjacent 10mm Hem-o-lok clips. Accordingly, if four 10mm Hem-o-lok clips were applied to the Deceased’s left renal artery, the clips would occupy an arterial length of 12mm (ie, 4 x [2mm + 1mm]) at the very least, exceeding the 8-9mm length of the Deceased’s left renal artery stump. 189    Fourthly, it would have been highly unlikely, given the warm ischemic time of 1.5 minutes recorded in the Operations Report (atAnnex E), for four 10mm Hem-o-lok clips to have been applied to the Deceased’s left renal artery. Dr Li’s evidence was that the amount of time he required to load and apply two 10mm Hem-o-lok clips to the left renal artery (or the left renal vein) and then cut the vessel was approximately 45 seconds. Accordingly, the process of applying two 10mm Hem-o-lok clips to the left renal artery and cutting the same and applying another two 10mm Hem-o-lok clips to the left renal vein and cutting the same, would have taken about 1.5 minutes, a timing consistent with the warm ischemic time recorded in the Operation Report. Dr Li’s testimony on this aspect was not challenged. Professor Cheng and Dr Howard both agreed that it would have been very improbable for four 10mm Hem-o-lok clips to have been applied to the Deceased’s left renal artery within a warm ischemic time of 1.5 minutes. 190    Professor Cheng had added: Furthermore, if we take that view that four clips were applied on the artery based on the post-mortem finding, then we would have to consider the post-mortem finding of five clips on the vein being true, giving a total of nine clips. I would submit thatapplying nine clips, loading and unloading in the space of one and a half minutes, is physically impossible.[emphasis added] 191    When Professor Nicholson was first cross-examined on the time he took to clip a vessel, he replied that the total amount of time he took (to apply two Hem-o-lok clips and one metal clip on the renal artery, and then apply two Hem-o-lok clips on the renal vein and then remove the kidney for transplantation) was “usually in the region of three or four minutes”. However, when referred to the warm ischemic time of 1.5 minutes recorded in the Operation Report, Professor Nicholson sought to revise his earlier answer and contended that his own warm ischemic time ranged from 1 to 7 minutes and that he had been able to achieve a warm ischemic time of 1 minute applying 5 Hem-o-lok clips. Professor Nicholson also asserted that his definition of “warm ischemic time”, which he claimed was an “imprecisely defined parameter” included the time when blood was being flushed out of the excised kidney and ended only when the kidney was completely perfused, presumably to explain why his warm ischemic time of 3-4 minutes was longer that the 1.5 minutes in the present case. 192    However, far from being an “imprecisely defined parameter”, it would appear that “warm ischemic time”, insofar as it relates to living renal donors, has a universally established definition,viz, that it ends at the commencement and not at the conclusion of cold perfusion of the excised kidney, as asserted by Professor Nicholson. Professor Nicholson himself conceded that medical literature did not support his definition of “warm ischemic time”. 193    To my mind, Professor Nicholson’s evidence did not comport with the requirements of expert evidence laid down in [65] ofGunapathy’scase (at[153]above). Consequently, I am unable to attach much weight to his testimony. Whether two or four Hem-o-lok clips were applied to the Deceased’s left renal artery 194    For the foregoing reasons, I find there was no reasonable basis for Professor Nicholson’s conjecture that the four Hem-o-lok clips that Professor Gilbert had apparently found at the periphery of the Deceased’s left renal artery were all used to secure the Deceased’s left renal artery. The evidence strongly suggests that only two 10mm Hem-o-lok clips had been applied to the Deceased’s left renal artery. 195    According to Professor Nicholson:- (a)     the Deceased’s renal anatomy was “normal” and appropriate for the HALDN procedure; (b)     the use of Hem-o-lok clips to secure the Deceased’s left renal artery was acceptable and in accordance with the requisite standard of care; and (c)     if Hem-o-lok clips are used, the usual practice would be to use two clips to clamp the renal artery a short distance away from the ostium and a short distance away from the point where the renal artery branches into two branches as this would allow for safe division of the renal artery. 196    In cross-examination, Professor Nicholson also stated categorically that the use of two Hem-o-lok clips to secure the Deceased’s left renal artery was an “entirely reasonable and proper surgical technique” which cannot be criticised. He had agreed that if two 10mm Hem-o-lok clips were applied to the Deceased’s left renal artery during the HALDN procedure, he would have no reason to question the application of the clips or the conduct of the surgery by Dr Li and Dr Consigilere. 197    Given my earlier finding that only two 10mm Hem-o-lok clips were applied to the Deceased’s left renal artery, I accept that such application was well within the standard of care owed by Dr Li and Dr Consigilere to the Deceased. There was accordingly no breach of duty of care on their part in the performance of the HALDN on 16 February 2005. In the light of this finding on Issue 3, there is no need to proceed to examine Issue 4 which was premised on four 10mm Hem-o-lok clips having been applied to the Deceased’s left renal artery. I will disregard (as they were not pursued) the particulars of negligence raised by the plaintiffs alleging that the Deceased’s left renal artery was not secured before the completion of the surgery and that bleeding sites in the Deceased’s renal bed were not eliminated or controlled before the completion of the surgery. 198    I would add that even if the doctrine ofres ipsa loquiturapplied to raise any inference of negligence against the defendants, such inference had been robustly rebutted. With Issue 3 disposed of and Issue 4 being academic, I now turn to Issue 5.",
        "Issue 5: Whether Dr Li and/or Dr Consigilere and/or NUH were under a duty to record the number and specific positioning of the Hem-o-lok clips used during the HALDN?": "199    In cross-examination, Dr Li had explained why there was no requirement that the number and specific positioning of the Hem-o-lok clips should be recorded. He said the only items of medical equipment (such as needles and swabs) which cannot and which are not intended to be left behind in a patient’s body upon closure of wounds after the operation, must be recorded to account for all items used, to ensure that these items had not been inadvertently left behind in the patient’s body. On the other hand, securing devices like Hem-o-lok clips, which were meant to be left inside the patient’s body were not recorded. The lack of any requirement to record the number of Hem-o-lok clips used was reflected in the NUH “SPONGES / SHARPS/ SUTURES COUNT SHEET” (attached in this Judgment asAnnex F), which specified the items used in the Deceased’s surgery that had to be counted and which didnotmake any reference to Hem-o-lok clips. 200    Both Professor Cheng and Dr Howard testified that it was not their practice or even the standard practice (particularly in 2005) to record the number of Hem-o-lok clips used in an operation. 201    Professor Nicholson on the other hand asserted that when he performed the operation, he would always record the exact number of clips left behind. It must be borne in mind however, that Professor Nicholson’sindividualpractice may not equate with thestandardpractice. Significantly, Professor Nicholson’s evidence did not go so far as to say that recording was a standard practice which should have been carried out by Dr Li and/or Dr Consigilere. I am satisfied that, as of 16 February 2005, Dr Li and/or Dr Consigilere and/or NUH werenotunder a duty to record the number and specific positioning of the Hem-o-lok clips used during the HALDN.",
        "Issue 6: What is the standard practice vis-à-vis post operative monitoring of a patient in the general ward?": "202    It is undisputed that instructions were given for the Deceased to be monitored hourly upon her transfer from the recovery room to the general ward. Dr Li’s position (with which Dr Consigilere agreed) was that instructions were given at the conclusion of the surgery that the Deceased was to be placed on hourly monitoring in the general ward. According to Dr Li, while these instructions were not recorded by Dr Chong in the Operations Report, it had been a “standing instruction” in Ward 43 that all post-operation patients should be monitored hourly. Also, the common evidence of Dr Consigilere, Dr Chong and Dr Kah Wee was that it was the standard practice at NUH for patients to be monitored hourly once they had been transferred to the general ward. Professor Cheng also testified that hourly monitoring in the general ward is a standard instruction which hospital staff would be aware of even if the Operations Report was silent on the requirement. 203    Further, while instructions for hourly monitoring in the general ward were not expressly recorded by Dr Chong in the Operations Report, there were at least two other pieces of documentary evidence indicating that the Deceased was put on hourly monitoring. First, Dr Kah Wee recorded in the NUH Inpatient Discharge Summary (seeAnnex G) dated 16 February 2005, that the Deceased was “put on hourly parameters”. Second, there was also an indication of “Hourly parameter” in the Deceased’s observation chart (seeAnnex H) and a stamp in the Deceased’s treatment and progress notes stated that the standard orders included the hourly monitoring of the Deceased’s vital signs. The totality of the evidence indicates that there were indeed instructions for hourly monitoring of the Deceased in the general ward. 204    The next question to ask is whether it was reasonable for the Deceased to have been placed on hourly monitoring parameters in Ward 43? 205    In my view, hourly monitoring of the Deceased in Ward 43 was a reasonable and acceptable practice for a number of reasons. First, that was the position in SGH according to Professor Cheng. He pointed to the SGH protocol which provided that on the day of the surgery, post-operative review of the patient’s vital signs in the general ward was to be conducted on an hourly basis. Second, this also appeared to be the position in Australia according to Dr Howard; he made express reference to the clinical pathway for laparoscopic nephrectomy of Westmead Private Hospital in Australia which provided that post-operative observation of the patient’s total pulse rate, blood pressure and oxygen saturation was to be conducted “1/24”,ie, on an hourly basis. Dr Howard also produced the clinical pathway for live donor laparoscopic nephrectomy used by Newcastle Hospital in Australia, which provided that the immediate post-operative management on the day of surgery was for the patient’s urine output and wound drainage to be checked hourly and for blood pressure, heart rate, respiration, oxygen saturation and temperature to be checked on a 2 hourly basis. 206    In his AEIC, Professor Nicholson contended that NUH should have conducted monitoring of the Deceased at 15-minute intervals for the first 2 hours in the general ward and thereafter every 30 minutes. In cross-examination however, Professor Nicholson conceded that his prescribed level of post-operative monitoring was based on his “personal opinion” and he did not hold it out as being the standard practice in the United Kingdom. In fact, he agreed that hourly monitoring in the general ward was the “minimum standard” the Deceased should have been given. 207    It should be further noted that the Deceased was stable when she left the recovery room for Ward 43 at about 1405 hours, as recorded in the Recovery Room Record. As the Deceased’s renal artery had been ligated at about 1100 hours with no resultant haemorrhage, this meant that the Deceased had been stable for more than 3 hours after the operation. In the circumstance, it was entirely reasonable to expect that the Deceased would continue to be stable when transferred to Ward 43 and would be adequately monitored at hourly intervals. The more pertinent issue to be determined is, did NUH actually monitor the Deceased at hourly intervals in Ward 43? 208    In its closing submissions, NUH argued that there would be no need to address this further question, the reason being it was never the plaintiffs’ pleaded case or the position taken in Professor Nicholson’s AEIC, that NUH had failed to carry out hourly monitoring of the Deceased in Ward 43. Indeed it was contended, the plaintiffs’ “position all along was that NUH should have carried out monitoring in very frequent intervals (i.e. 15-minute monitoring) but failed to do so. On this basis, citing the Court of Appeal’s decision (at [52]) inRDC Concrete Pte Ltd v Sato Kogyo (S) Pte Ltd and another appeal[2007] 4 SLR 413(“RDC Concrete”), NUH argued that this court should not make a decision on an issue that was not raised. The Court of Appeal had there added: However, we should add that although the courts do not generally countenance the raising of arid and technical procedural objections that would hinder the attainment of justice in the case at hand, they would, equally, reject arguments (such as that now proffered) where there has been such a breach of procedural justice that countenancing it would result in substantive prejudice and injustice to the innocent party (which would be the case in the present appeal in so far as the Plaintiff was concerned)… 209    The above passage fromRDC Concreterecognised that just because an issue had not been raised by a party in its pleading did not mean that a court was automatically precluded from making a decision on the issue. In Tan Kia Poh v Hong Leong Finance Ltd[1994] 1 SLR 270, the Court of Appeal explained that allowing submissions to be made on matters not previously pleaded might result in material prejudice to the other party. There was however no such danger of material prejudice to NUH in this case for two reasons: first, it must be appreciated that because Ward 43 (and its staff) was under the control and/or management of NUH, the hospital was the party best placed to prove whether hourly post-operative monitoring of the Deceased was in fact carried out. Secondly, itsowncase was that the standard of post-operative monitoring of the Deceased in Ward 43 was to be at hourly intervals. Any plausible contention by NUH that it would suffer material prejudice to prove facts supporting itsowncase would be disingenuous. Accordingly, it would be necessary to examine the further question of whether NUH had in fact carried out hourly monitoring.",
        "Issue 7: Was the standard of post-operative monitoring of the Deceased in the general ward complied with?": "210    Due to the absence of Nurse Lourdes as a witness and the rejection of her AEIC, there was a pronounced gap in the evidence of NUH as to what transpired in Ward 43 between 1430 hours and 1600-1615 hours. 211    To recapitulate, Dr Kah Wee had in Ward 43, reviewed the Deceased at about 1430 hours. In accordance with the standard of hourly monitoring in the general ward, the Deceased should have been monitored, again an hour later at 1530 hours. On the evidence however, this was clearlynotdone. 212    NUH had submitted that the plaintiffs’ claim that the Deceased’s parameters should have been taken exactly 1 hour after 1430 hours “does not accord with established medical practice”. NUH relied on the evidence of Professor Cheng and Dr Howard in this regard. Dr Howard had opined that hourly observation was only a guide and did not mean that a review must be conducted every hour on the dot. It was his view that a buffer of 30 minutes (within an hour) was “entirely acceptable” where a patient has a seemingly routine and uncomplicated operation, had been observed in the recovery room for 2 hours and was deemed stable to be sent to the general ward. Professor Cheng supported Dr Howard’s views on the 30 minute buffer -- he explained that a nurse could well take around 30 minutes just to check the parameters of 6 patients in a single cubicle. 213    While I agree that it would be practically impossible to monitor a patient hourly on the dot, it must be realised that the 30 minute buffer proposed by Professor Cheng and Dr Howard was premised on there actually having been 6 patients in the room occupied by the Deceased on 16 February 2005. In cross examination, Dr Howard said he had asked specifically and he believed that the room/Ward 43 was full. There was however no evidence of this fact before the court. NUH could have produced records of the number of patients in Ward 43 on 16 February 2005 but did not. Further, regardless of whether or not Ward 43 was full, it was also wrong to assume thatallthe patients in Ward 43 would necessarily have had to be monitored hourly, on the dot at 1530 hours. It was more likely than not that they would havedifferentmonitoring schedules. 214    Professor Cheng had testified that apart from scheduled monitoring that was carried out by nurses, there were “actually a lot of unscheduled visits to each and every patient” and “unscheduled attention given to the patients” which are not recorded. Dr Howard testified in a similar vein that such an “informal regime of monitoring” is “part of normal every day practice…which would not be recorded on paper”. The two experts did not answer the question of whether there was in thepresentcase,in factmonitoring of the Deceased between 1430 hours and 1600-1615 hours. Dr Howard admitted as much in the following extract from his cross-examination:  Q:Dr [Howard], I am going to put my case to you, you can agree or you can disagree.There was absolutely no monitoring between 2.30 and 4 pm.A:I do not know that.[emphasis added] 215    It should be noted that NUH’s primary evidence of the post-operative care rendered to the Deceased in Ward 43 from 1430 hours to the activation of the Code Blue Team at 1619 hours came from the accounts of Nurse Lourdes and Dr Kah Wee. Nurse Lourdes’ account is inadmissible resulting in a lacuna in NUH’s evidence as to what transpired in Ward 43 from 1430 hours to between 1600-1615 hours. The only evidence available as to the post operative monitoring of the Deceased in this time period came from Ms Jasmail (see[67]above). In the plaintiffs’ closing submissions, s 108 of the Evidence Act was raised; the section reads Burden of proving fact especially within knowledge108.  When any fact is especially within the knowledge of any person, the burden of proving that fact is upon him.…  216    The plaintiffs submitted that the burden should fall on NUH to prove that the Deceased was adequately and appropriately monitored in Ward 43 since, apart from the evidence of Ms Jasmail, the plaintiffs were not in a position to provide further details on how the Deceased was cared for when she was there. It was argued that what happened in Ward 43 from 1430 hours to the time Dr Kah Wee examined the Deceased (1600-1615 hours) was a matter “within the knowledge” of NUH; section 108 of the Evidence Act should be invoked to put the burden on NUH to prove that the Deceased was adequately and appropriately monitored. Section 108 of the Evidence Act 217    Section 108 of the Evidence Act states that when any fact (whether affirmative or negative) is especially within the knowledge of any person, the burden of proving that fact is upon him. This is an exception to the general rule contained in s 103 of the Evidence Act, that the burden is on the party who asserts a fact. Section 108 of the Evidence Act applies only to those matters which are supposed to be within the knowledge of a defendant. It cannot apply when the fact or facts are such that they are capable of being known also by a person other than the defendant (seeSarkar’s Law of Evidence, vol 2 at pp 1672). 218    Section 108 of the Evidence Act has its origins in the case ofR v Turner(1816) 5 M. & S. 206 (“Turner”). InTurner, the accused was convicted of possession of game without authority and fined. To escape liability, he had to fall under any of the ten qualifications stated in the relevant statute. The Court of King’s Bench held that the burden of proof rested on the accused to prove that he did fall under any of the ten qualifications. Lord Ellenborough CJ, with whom Bayley J and Holroyd J agreed, was of the view that to place the burden on the prosecution would give rise to the “moral impossibility of ever convicting upon such an information”. His judgment also established therationaleof the rule: If the informer should establish the negative of any part of these different qualifications, that would be insufficient, because it would be said,non liquet, but that the defendant may be qualified under the other. And does not, then, common sense shew, that the burden of proof ought to be cast on the person, who by establishing any one of these qualifications, will be well defended? 219    In a similar vein,Ratanlal & Dhirajlal’s Law of Evidence” (at pp 1133 – 1134) andWoodroffe&Ali’s Law of Evidence” (vol 3 at pp 4223) notes that s 108 of the Evidence Act is: …designed to meet certain exceptional cases in which it would be impossible, or at any rate disproportionately difficult, for the [plaintiff] to establish facts which are ‘especially’ within the knowledge of the [defendant] and which [the defendant] could prove without difficulty or inconvenience. When any fact is within special knowledge of any person, the burden of proving that fact is upon him. The word ‘especially’ stresses that. It means facts that are pre-eminently or exceptionally within his knowledge. and also that the section: …must be considered in a commonsense way; and the balance of convenience and the disproportion of the labour, that would be involved in finding out and proving certain facts, balanced against the triviality of the issue at stake, and the case with which the [defendant] could prove them, must be taken into consideration. 220    I accept the plaintiffs’ submission that pursuant to s 108 of the Evidence Act, the burden was on NUH to prove that the Deceased was adequately and appropriately monitored in Ward 43 during the crucial period after 1430 hours. As Ms Jasmail only arrived in Ward 43 after 1600 hours, the plaintiffs were not privy to any of the events that took place before her arrival. It would be disproportionately difficult for the plaintiffs to prove a negative – that the staff of NUH had failed to monitor the Deceased in Ward 43. It was for NUH to show that the Deceased was monitored during the period in question. 221    However, a mere allegation by the plaintiffs that the Deceased was not monitored while in Ward 43 is insufficient to invoke s 108 of the Evidence Act. The plaintiffs must first establish aprima faciecase against NUH that the Deceased was not monitored. As stated inWoodroffe&Ali’s Law of Evidence(supra[219]at pp 4225): It is not the law that the plaintiff…has to eliminate all possible evidence or circumstances which may exonerate the defendant…If the facts are within the knowledge of the defendant…then he has to prove them.Of course, the plaintiff…has to establish a prima facie case in the first instance, that is, to establish facts which give rise to a suspicion. If this is done, the by reason of [s 108 of the Evidence Act], the burden is thrown on the defendant…[emphasis added] 222    The plaintiffs’ only evidence on the post-operative monitoring of the Deceased in Ward 43 came from Ms Jasmail and it is to her evidence that I now turn to determine whether aprima faciecase is established against NUH that the Deceased was not monitored. Ms Jasmail’s evidence 223    Ms Jasmail’s AEIC has been set out earlier at[66]to[68]and need not be repeated. What was clear therefrom was that until she alerted them to the Deceased’s condition, the staff of NUH had not attended to or monitored the condition of the Deceased. 224    NUH submitted that there was no merit to this contention. Reference was made to the following extract from Ms Jasmail’s cross examination to suggest that because Ms Jasmail had arrived at Ward 43 atapproximately1610 hours, she could not possibly comment on whether NUH’s staff hadin factmeasured the Deceased’s vital signs at 1600 hours: Q:So from the time from the entrance into NUH, which you say was around 4 o'clock, to the time you arrived at the ward, could I say it took about five to seven minutes? Or longer?A:Most probably about seven minutes, I don't know. Maybe.Q:Seven minutes? When you reached the entrance of Ward 43, you would say it was around seven minutes past 4,4.10, thereabouts?A:Yes.…Q:You came only at 4.10, correct?A:Yes, I said that.Q:So it's possible that someone had actually informed the doctor about [the Deceased’s] condition before 4.10. Possible?A:But there was nobody.Q:No, possible?A:I have no idea.Q:So you disagree with me that it was possible that someone else could have told the doctor about [the Deceased’s] condition before you arrived?A:I have no idea. If it would, there would be nurses there, they would have done something, you see. 225    It bears noting however that this case dealt withapproximationsof time. Even Dr Kah Wee could not remember with certainty the time that she had been informed that the Deceased was unresponsive. Indeed, all the times stated in this case, from the start of the HALDN procedure on 16 February 2005 to the death of the Deceased, were approximations. Consequently, nothing useful would be achieved by splitting hairs over such imprecise estimations. 226    NUH also submitted that little or no weight should be placed on Ms Jasmail’s evidence as it was “fraught with inconsistencies and embellishments”. In particular, Ms Jasmail’s testimony was criticised as follows: (a)     in her police statement, made sometime after the Deceased’s death, Ms Jasmail had said that she had approached a nurse, who she believed was a trainee nurse,enteringWard 43 to inform her of the Deceased’s condition; (b)     however, in Ms Jasmail’s AEIC, she claimed that she hadsummoned for helpwhen she found the Deceased having breathing difficulties after she had entered Ward 43; (c)     when cross-examined about the apparent inconsistency between her police statement and her AEIC, Ms Jasmail then claimed that she had alerted a nurse who wasexitingWard 43 after attending to another patient there. 227    The foregoing discrepant evidence did not amount tomaterialinconsistencies as to cast doubts on Ms Jasmail’s credibility. Thecommondenominator in all three accounts above was that the Deceased was attended to by NUH’s staff,onlyafter Ms Jasmail had alerted them to the Deceased’s condition. 228    Ms Jasmail had alleged that no “medical gadgets were attached to [the Deceased]”. Counsel Mr Poon (for NUH) latched onto this statement and attempted to undermine Ms Jasmail’s evidence by pointing out that the notes indicated that there were in fact several gadgets attached to the Deceased throughout her stay in Ward 43,viz, an intravenous drip, morphinein situ, a urine catheter, the redivac drain and a nasal prong. In reply, Ms Jasmailreadily admittedthat she saw the nasal prong and explained that by her reference to “gadget”, she meant a pulse oximeter. 229    In its closing submissions, NUH submitted that this was another indication that Ms Jasmail was “quite prepared to inaccurately present the facts to put NUH in a bad light”; I disagree. Ms Jasmail was giving evidence almost four years after the Deceased’s death. With the passage of time, there would be bound to be certain aspects of the case that any witness would have difficulty recalling with precision. I found Ms Jasmail to be a credible witness and I have no reason to reject her evidence that the staff of NUH only attended to the Deceased after she had alerted them. 230    NUH also made reference to the entries at 1600 hours on the Deceased’s observation chart and the treatment and progress notes and argued that those documents showed that the Deceased’s parameters were taken at 1600 hours. In my view those entries do not however indicate thecircumstances leading to their recording. 231    I am therefore satisfied based on Ms Jasmail’s evidence, that aprima faciecase is established against NUH that the Deceased was not monitored before and at around 1600 hours. Accordingly, pursuant to s 108 of the Evidence Act, the burden shifts to NUH to prove that the Deceased was in fact monitored. NUH’s legal burden to show that the Deceased was monitored in Ward 43 232    It is noteworthy that NUH didnotdispute that the Deceased’s vital parameters were not recorded from 1430 hours to 1600 hours. Its case was that it was “entirely acceptable” and in accordance with “established medical practice” that the Deceased’s vital parameters were not monitored at 1530 hours on the dot but only at 1600 hours. 233    NUH didnotadduceanyevidence of whether any form of monitoring of the Deceased in Ward 43 was carried outbetween1430 hours and 1600 hours. All that Dr Kah Wee deposed to in her AEIC was that “another nurse was with the Deceased trying to measure her blood pressure” when she arrived at the Deceased‘s bed sometime after 1600 hours and 1615 hours. That nurse was neither identified nor called to testify. Neither were student nurses mentioned in Nurse Lourdes’ notes. The same observation applies to the ‘ward nurses” referred to in Dr Kannan’s testimony. Similarly, no nursing staff from Ward 43 came forward to confirm Professor Cheng’s evidence (with whom Dr Howard agreed) of unrecorded and “….unscheduled visits to each and every patient” and “unscheduled attention given to the patients”. 234    In short, NUH producednoevidence that the Deceased was in fact monitored. Accordingly, NUH failed to discharge its burden under s 108 of the Evidence Act. I find that NUH was negligent and had breached its duty in failing to monitor the Deceased during the period between 1430 hours and 1600 hours. 235    This however is not the end of the matter. The plaintiffs must still prove on a balance of probabilities, that negligence and/or breach of duty of NUH in failing to monitor the Deceased caused or materially contributed to the Deceased’s death (seeYeo Peng Hock Henry v Pai Lily[2001] 4 SLR 571at [52]) from or substantially from blood loss. Causation 236    It has often been said that questions of causation are best answered by practical common sense and judgment. As the Court of Appeal noted inSunny Metal & Engineering Pte Ltd v Ng Khim Ming Eric[2007] 3 SLR 782at [50]: We start with the basic proposition that, not only must there be damage, but the damage must have beencausedby the defendant’s act or omission which amounted to a breach of his duty: see, for example,Yeo Yoke Mui v Ng Liang Poh[1999] 3 SLR 529at [25] andF v Chan Tanny[2003] 4 SLR 231at [97]. This is the question of causation. InMcGhee v National Coal Board[1973] 1 WLR 1, Lord Reid said (at 5): [I]t has often been said that the legal concept of causation is not based on logic or philosophy. It is based on the practical way in which the ordinary man’s mind works in the everyday affairs of life. Similarly, Goh Joo Seng J inIkumene Singapore Pte Ltd v Leong Chee Leng[1992] 2 SLR 890at 899, [31] citedAlexander v Cambridge Credit Corp Ltd(1987) 9 NSWLR 310 at 359 where McHugh JA referred to the“common sense notion of causation which the common law champions”. [emphasis added] 237    NUH had submitted that it did nothing to cause or contribute to the Deceased’s death, relying on the evidence of Dr Howard and that of Professors Lim and Cheng; they had opined that because any bleeding from the Deceased’s left renal artery would have been “fast and furious” at a “ferocious” rate of 300 – 600 mls per minute if the Hem-o-lok clips had slipped from the Deceased’s left renal artery in one go, this “sudden and massive nature” of the intra-abdominal haemorrhage from the Deceased’s left renal artery would have been impossible to prevent even if more frequent post-operative monitoring of the Deceased’s vital signs had been carried out by NUH in Ward 43. Their position was premised on the belief that all the Hem-o-lok clips on the Deceased’s left renal artery had suddenly and completely slipped off. In Professor Lim’s opinion, there was no possibility that the Hem-o-lok clips could have initially slipped off the Deceased’s left renal artery partially so that bleeding occurred gradually over a period of time (as suggested by Professor Nicholson) on a vessel as big as the renal artery, where the pressure is high. In Professor Lim’s opinion, the pressure of the blood flow in the renal artery meant that the clips would be “either on or completely off”. 238    It must be noted thatallthe experts in this case neither had personal knowledge of nor experience with the slippage of Hem-o-lok clips applied to the renal artery. Further, none of the experts could point to any studies, research or published papers on how Hem-o-lok clips would slip off the renal artery suddenly and in one go or otherwise. Instead, they had merely proffered their own respective theories and speculations. As Ms Chew herself stated in NUH’s Closing Submissions Even with the benefit of hindsight, nobody, not even [Professor] Nicholson, is able to tell with certainty when the Hem-o-lok clips slipped from the [Deceased’s left] renal artery and the [D]eceased’s intra-abdominal bleeding began. 239    The following exchange took place between the court and Dr Howard on 25 February 2009:  COURT:We were talking about the monitoring and I understand you said you don't expect the nurses in the general ward to wait on the dot, on the hour, but you would certainly expect them to do it, would you not, Dr [Howard[?A:I would expect that on average, they would have done hourly monitoring.COURT:Give or take a few minutes?A:I think it will take --COURT:Within an hour, you would expect at some point in time --A:I would expect.COURT:-- a nurse to monitor the vital parameters?A:And nurses are generally very smart people. They are well trained. And what happens is if they feel the patient is a bit unstable, they would do it more frequently. If they view the patient as being very stable, they may not be as tight.And I think unfortunately this situation, the -- I think that the deterioration occurred so quickly, in my view, on all the evidence I have been given, of course I am speculating, it was so quick, that they would not have picked it up any earlier. If they had done observation, for example -- this is my speculation -- at, say, 3.55, 12:19 they probably would not have picked up anything. It can be seen that Dr Howard readily admitted that his view that the Deceased bled suddenly from her left renal artery so that her condition deteriorated quickly, wasonlyspeculation. 240    With the uncertainty surrounding how the Deceased bled to death, I do not think it would appropriate for me to accept the version of either the plaintiffs or NUH on this issue. Even so, it would be sufficient on the authority ofMcGhee v National Coal Board[1973] 1 WLR 1 (“McGhee”), for it to be shown that NUH’s failure to monitor the Deceased in Ward 43 after 1430 hours made the risk of death to the Deceased more probable. 241    InMcGhee, the plaintiff, who worked at the defendant’s brick kilns, contracted dermatitis as a result of exposure to brick dust. The breach of duty relied on was the defendant’s failure to take reasonable care to provide adequate washing facilities, and it was pleaded that had such washing facilities been provided, the plaintiff would not have contracted dermatitis. The defendants admitted the breach of duty but contended that it was not proved that such breach had caused the contraction of the disease. According to the state of medical knowledge then, the dermatitis was caused by repeated minute abrasions of the outer horny layer of the skin followed by some injury to the underlying cells, the precise nature of which was not yet scientifically known. If a man sweated profusely for a considerable time, the outer layer of his skin was softened and easily injured. If he was then working in a cloud of abrasive brick dust considerable quantities would adhere to his skin and exertion would cause the brick dust to injure the horny layer exposing the tender cells below to injury or infection. Then, in some way not yet understood, dermatitis would result. The defendant’s failure to provide adequate facilities for washing (the only practicable way of removing the danger), increased the period of time during which the plaintiff was exposed to contact with the brick dust while he cycled home. 242    The Lord Ordinary, while finding that the defendants were at fault in not providing showers, dismissed the plaintiff’s claim because he was not satisfied that the plaintiff had shown, on the balance of probabilities, that the breach of duty caused or materially contributed to his injury. In reversing the lower court’s decision, the House of Lords held that although the medical evidence for the plaintiff could not establish that had the plaintiff been able to wash immediately in showers provided by the defendants he would not have contracted dermatitis, in the absence of complete medical knowledge of all the material factors relating to dermatitis, there was no substantial difference between materially increasing the risk of injury and making a material contribution to the injury. Accordingly, it was held that it was sufficient for the plaintiff to show that the defendant’s breach of duty made the risk of injury more probable even though it was uncertain whether it was the actual cause. 243    Here, it was not disputed that a major concern in the early post-operative period after HALDN was intraperitoneal haemorrhage, which caused or substantially caused the Deceased’s death. It was also not disputed that the haemorrhage arose from the slippage of the Hem-o-lok clips from the Deceased’s left renal artery. What was unknown was the precise nature of the slippage of those clips. 244    Although the Deceased’s condition was stable after she left the recovery room, the monitoring process for patients in the general ward to ensure that no complications from the surgery arose was not carried out at or after 1430 hours. The failure to do so exposed the Deceased to the risks of complications arising from the surgery which in this case came about some 3-4 hours later and culminated in her untimely death. 245    In the light of my conclusion, it would not be necessary to examine the issues relating to the resuscitation efforts of the Deceased by the Code Blue Team. It would be an artificial exercise to determine whether those efforts were proper when the circumstances leading to the Deceased’s condition were due to the failure of NUH to monitor her at all prior to the activation of the Code Blue Team.",
        "The counterclaim of NUH": "246    Finally, I turn to NUH’s counterclaim of S$1,964.33 against the plaintiffs for medical services provided to the Deceased from and after 12 November 2004. The plaintiffs’ only contention was that NUH was not entitled to payment on account of the negligent medical treatment rendered to the Deceased. However, this position ignored the fact that it was the Deceased who approached NUH of her own volition to undergo a kidney donation procedure. As such, all costs and expenses arising from the procedure should be paid to NUH.",
        "Conclusion": "247    In summary, (a)     the Deceased’s death was caused or substantially caused by blood loss; (b)     the AEIC of Nurse Lourdes was not admissible evidence but no adverse inference should be drawn against NUH for her absence from court; (c)     Dr Li had advised the Deceased of the respective pro and cons of the different types of surgeries; (d)     the Deceased had not been advised that she would undergo robotic laparoscopic surgery instead of HALDN; (e)     Dr Li and/or Dr Consigilere had applied two Hem-o-lok clips to the Deceased’s left renal artery to secure it during the HALDN; (f)     Dr Li and/or Dr Consigilere and/or NUH were not under a duty to record the number and specific positioning of the Hem-o-lok clips used during the HALDN; (g)     the standard practice vis-à-vis post-operative monitoring of a patient such as the Deceased in the general ward is hourly monitoring; and (h)     NUH’s failure to properly monitor the Deceased in Ward 43 from after 1430 hours materially increased the risk of injury to the Deceased. 248    I therefore dismiss the plaintiffs’ claims against Dr Li and Dr Consigliere with costs. The plaintiffs are awarded interlocutory judgment with costs on their claim against NUH in view of the hospital’s failure to monitor/properly monitor the Deceased when she was in Ward 43. I allow the counterclaim of NUH in the sum of $1,964.33 with costs fixed at $500 (no evidence was led on the counterclaim) which sum shall be set-off against the damages to be awarded to the plaintiffs and which are to be assessed at a later date by the Registrar. The costs of such assessment are reserved to the Registrar.",
        "Costs": "249    Under Order 59 Rule 2(2) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed, costs are in the discretion of the court. I am mindful that costs should generally follow the event. In this case however, it was not unreasonable of the plaintiffs to have sued Dr Li and Dr Consigliere the two doctors who carried out the HALDN procedure as first and second surgeon respectively. Equally, it was also not unreasonable of the plaintiffs to have joined NUH as the third defendant to the suit as NUH was the hospital where the HALDN procedure was carried out. The plaintiffs must necessarily sue all three parties as they would not know which of the three defendants were responsible or partly responsible for the Deceased’s untimely demise on 16 February 2005. I am of the view therefore that the costs incurred by the plaintiffs against the first and second defendants were reasonably and properly incurred as between themselves and NUH. 250    Accordingly, I hold that aSandersonorder for costs (seeSanderson v Blyth Theatre Co[1903] 2 KB 533 andMohd bin Sapri v Soil-Build (Pte) Ltd and another appeal[1996] 2 SLR 505) would be appropriate in this case and I so order. NUH shall pay the costs of Dr Li and Dr Consigliere awarded to them against the Plaintiffs.",
        "[LawNet Admin Note: Annexes are viewable only byLawNetsubscribers via the PDF in the Case View Tools.]": ""
    }
}