{
    "case_title": "Phua Kong Yang v Public Prosecutor",
    "ncitation": "[2009] SGHC 278",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       The accused and five of the eight co-accused persons (named in the charge below) pleaded guilty and were convicted on the following charge: That you, on the 16thday of September 2007, at or about 8pm, at the coffee-shop of Block 605 Yishun St 61, Singapore, together with Phua Yih Liang, Male: 22 yrs old, Lau Wei Sheng, Male: 22 yrs old, Teo Kah Wei, Male: 19 yrs old, Teo Yao Wei, Male: 19 yrs old Lim Jia Yi, Male: 18 yrs old, Tang Yong Cheng, Male: 18 yrs old, Sim Dong Qi, Male: 17 yrs old and See Kok Pin, Male: 16 yrs old, were members of an unlawful assembly, whose common object was to voluntarity cause hurt to Liau Soon Chye, Male: 19 yrs old and you have thereby committed an offence punishable under section 143 of the Penal Code, Chapter 224. This offence took place before the 2007 amendments to the Penal Code came into operation on 1 February 2008. The said s 143 then provided for imprisonment for a term of up to 6 months or fine or both. By virtue of the amendments, the maximum imprisonment term has been enhanced to 2 years.",
        "The statement of facts": "2       At about 8pm on 16 September 2007, Liau Soon Chye (“the victim”), his father and his sister went to the coffee-shop mentioned in the charge to have their dinner. The said coffee-shop is located in a Housing and Development Board block in the Yishun public housing estate. The accused and around 20 members of the Kun Yang Lion Dance troupe (which was headed by the accused) were also in the same coffee-shop. The victim was a former member of this troupe. 3       When the victim’s father went to order dinner at one of the food stalls, the accused approached him and asked him to go with him to the back of the coffee-shop for a talk. The conversation concerned allegations about the victim spreading rumours about the troupe. The victim joined his father and the accused. 4       During the discussions, a dispute broke out and the accused and the co-accused persons (who were all members of the troupe) threw punches at the victim’s body. The victim lost consciousness. All the accused persons then left the scene. 5       The victim was conveyed by ambulance to Tan Tock Seng Hospital. The medical report on the victim stated that he was attended to in the Emergency Department of the hospital at 10.39pm. The victim informed the attending doctor that he had been assaulted and complained of pain in the neck. He was alert with stable vital signs. There was tenderness over the paravertebral cervical region. X-rays of the cervical spine showed no fractures. The victim was given analgesia and his pain resolved during observation. He was able to move about independently and was discharged with analgesia. He was given outpatient medical leave from 17 to 20 September 2007.",
        "The accused’s antecedents": "6       In May 1981, the accused was convicted on five offences relating to driving of a motor vehicle. He was fined and given a period of disqualification from driving. In 1984, he was convicted of inconsiderate driving and had to pay a fine. His most recent offence was for affray under s 160 of the Penal Code. For this, he was convicted on 22 April 2002 and sentenced to undergo one week’s imprisonment.",
        "The decision of the District Judge (“DJ”)": "7       The DJ sentenced the accused to 3 months’ imprisonment. Four of the five co-accused persons (including the appellant’s son, Phua Yih Liang) were placed on probation and one was sentenced to undergo reformative training as he was found to be unsuitable for probation. 8       The DJ felt it was necessary to impose a custodial sentence. Apart from the fact that the benchmark sentence for such an offence involving an adult offender was imprisonment, the DJ took into account the following five factors which she considered were aggravating facts:  (a)    the accused initiated the hostilities;   (b)    the victim was subjected to group violence;   (c)    the accused failed to exercise self-restraint;   (d)    the accused initiated the negative herd behaviour;   (e)    the accused had a similar antecedent (the affray offence);  In addition, the DJ did not think the matters raised in mitigation were exceptional. These included the submissions that the accused was remorseful, that the attack was an unplanned incident, that he and his troupe had received many accolades and had done a lot of community work for old and young people. The DJ counter-balanced these points with the age of the victim (19 years old), the fact that the assault occurred in a public place over a trivial matter and in the presence of the victim’s father. 9       The accused appealed against the imprisonment sentence imposed on him and was granted bail pending appeal.",
        "The accused’s submissions on appeal": "10     When the appellant saw the victim’s father, he went up to him alone to find out why the victim had stopped going for training with the troupe and why he had instigated a female member to leave the troupe. While they were talking, the victim approached them and that was when the dispute started. The co-accused persons were standing nearby watching. During the dispute, the victim overturned a table against the appellant and a brawl ensued. 11     Two of the co-accused persons slapped or punched the victim. The appellant was so appalled by the victim’s behaviour that he went up to the victim and slapped him. The victim then ran blindly into some furniture and fell. That was apparently why he fell unconscious. The proprietor of the coffee-shop requested the appellant and the co-accused persons to leave the premises and they complied. The appellant was also injured in the scuffle and had to seek medical attention. 12     It was submitted that the injuries detailed in the medical report (see[5]above) were minor. The appellant did not ambush the victim’s father nor did he initiate the hostilities. Instead, it was the victim who did so by overturning the table and injuring the appellant in the process. The appellant had wanted to discuss matters in private with the victim’s father at the back of the coffee-shop. No alarm was intended nor was any caused to the victim or his father. 13     There was no “group violence”. Only two members of the troupe slapped or punched the victim. As the appellant and his troupe members were trained in martial art, the victim would not be injured only to the extent shown in the medical report if they had really acted violently against him. The evidence did not lead to the conclusion that the victim fell unconscious because of the assault. Nothing suggesting this was recorded in the medical report. 14     The appellant had in fact exercised self-restraint by slapping the victim only once. As the victim was once the appellant’s pupil in the troupe, the slap was more akin to a father or an uncle chiding a son/nephew and was hardly a violent assault. The appellant did not initiate “herd behaviour” on the part of the troupe members. The incident happened on the spur of the moment and was totally unplanned and unexpected. 15     The previous conviction for affray was caused by an attack by the appellant’s student on the appellant. There was no impediment in law against imposing a fine on a person who had been imprisoned before for a similar offence. The appellant is a good employee and suffers from several chronic ailments. He has contributed much to the community through the troupe’s social and sports activities. Even if a fine was not appropriate here, a shorter term of one month’s imprisonment would suffice.",
        "The prosecution’s submissions": "16     The prosecution contended that the victim was grossly outnumbered by eight to one and would therefore be in great fear for his own safety. Members of the troupe, although at the coffee-shop for refreshments, moved in and attacked the victim as a result of seeing their leader engaged in a dispute with him. This, the prosecution submitted, was “the type of herd mentality which frequently morphs and escalates into violence in public and this should be visited upon by the law in its substantial, if not full force”. The assault took place around dinner time in a housing estate and would have caused anxiety among the diners in the coffee-shop. 17     The prosecution disputed the appellant’s argument that the victim “knocked himself out” because he had run blindly into some furniture, pointing out that, before the DJ, no nexus was drawn by the appellant between the victim’s blind run and the loss of consciousness. In any event, but for the incident, there would have been no loss of consciousness. 18     The appellant was much older than all the troupe members who were in their teens or early twenties at that time. He was their leader and should have behaved with dignity instead of confronting the victim’s father in public at dinner time with some trivialities. The genesis of the assault was directly traced to the appellant and it was something that he could have averted. Further, the appellant’s previous conviction for affray reflected his violent streak and his propensity to re-offend, fortified perhaps by his belief in his martial art abilities. 19     No genuine remorse was shown in the mitigation plea. All that the appellant was doing was to pin blame on the victim and the co-accused persons for the attack.",
        "The decision of the court": "20     As the leader and “elder” of the troupe, the appellant ought to have shown much more restraint in public and in the presence of the troupe’s much younger members. The group was at the coffee-shop for a peaceful purpose and not to confront the victim or his father. It was more a chance meeting rather than a planned ambush or confrontation. Unfortunately, the meeting descended into angry words and sparked off a senseless brawl in a public area in a housing estate. It must have caused alarm to people in the vicinity and disruption to the coffee-shop’s business. 21     Bearing in mind the appellant’s previous conviction for affray in 2002, his age, the group violence in a public place in a housing estate and the ferocity of the assault (as the victim fell unconscious within a short space of time), I agree that a fine was not appropriate in this case. However, considering the fact that the appellant and his troupe members were not at the coffee-shop to create trouble of any sort and that there was no allegation that the appellant instigated the other co-accused persons to attack the victim, I think a sentence of 1 month’s imprisonment would be sufficient punishment. 22     The appeal against sentence is therefore allowed to the extent that the 3-month imprisonment term is reduced to 1 month. 23     The appellant chose to commence serving his sentence immediately."
    }
}