{
    "case_title": "Viking Airtech Pte Ltd v Foo Teow Keng and Another",
    "ncitation": "[2009] SGHC 169",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       These registrar’s appeals concern the correct measure of damages payable by the defendants arising out of the first defendant’s breach of fiduciary duty to the plaintiff. 2       The plaintiff is a company in the business of manufacturing and supplying heating, ventilation and air-conditioning systems for vessels. Until November 2003, the first defendant (“Mr Foo”) was a director and general manager of the plaintiff. The second defendant is a company which competes with the plaintiff and which is owned by Mr Foo and his wife. The second defendant was established by Mr Foo while he was still employed by the plaintiff. 3       In this action, the plaintiff claimed damages from the defendants on the basis that Mr Foo acted in breach of his fiduciary and other duties to the plaintiff and diverted business from the plaintiff to the second defendant. The trial of liability took place before me and, in October 2007, I found in favour of the plaintiff. I made,inter alia, the following findings: (a)     that in breach of duty, Mr Foo had diverted from the plaintiff to the second defendant two contracts (the “diverted contracts”) in respect of the sale, delivery and installation of air-conditioning systems in oil tankers being constructed in Indonesiaviz: (i)       a contract worth US$149,000 with PT Dok Dan Perkapalan Surabaya (Persero) (“PT Dok”); and (ii)       a contract worth US$198,000 with PT Pal Indonesia (Persero) (“PT Pal”); (b)     that in breach of duty, Mr Foo had caused the plaintiff to fail to make delivery of equipment fabricated pursuant to a contract in respect of the vessel “Pelindo II” between the plaintiff and PT Pal and, in further breach, Mr Foo had caused the second defendant to supply the equipment to PT Pal instead; and (c)     that the defendants had converted to their own use the plaintiff’s assets located in the plaintiff’s office in Shanghai. I ordered that damages be assessed in respect of the various breaches.",
        "The assessment": "4       The assessment of damages took place before Assistant Registrar Teo Guan Siew (“the AR”) in August 2008. All parties accepted that it was for the plaintiff to prove the causal connection between the established breach of fiduciary duty and the loss which the plaintiff asserted had been suffered because of that breach (applying the case ofOhm Pacific Sdn Bhd v Ng Hwee Cheng Doreen[1994] 2 SLR 576). 5       In respect of the diverted contracts from PT Pal and PT Dok, the plaintiff asserted that the damages payable by the defendants were the net amounts that the plaintiff would have received if the two contracts had not been divertedie, the net loss of income. The plaintiff did not make a claim for loss of profitsper se. Therefore, it had quantified the amount payable on the basis of the contract prices (respectively US$198,000 and US$149,000) less the cost of parts that had to be purchased and other direct expenses which the plaintiff would have had to incur to perform the contracts. To obtain the cost of parts and other expenses, the plaintiff used the figures supplied by the second defendant who had actually fabricated the systems supplied to PT Pal and PT Dok. This was done on the basis that the second defendant obtained the materials from the same suppliers that the plaintiff would have used and, therefore, if the plaintiff had done the work, the plaintiff would have incurred the same expenses. Further, the plaintiff contended that these direct costs were the only ones that had to be considered since it already had an existing facility and staff which could have been utilised for the purposes of these two contracts. 6       Taking the contract figure for the PT Pal contract as being $336,600 (on the basis that US$1=S$1.70), the plaintiff deducted $146,023.67 as the costs of fabrication and the sum of $12,349.46 as further expenses and arrived at a loss of $178,226.87. The plaintiff’s calculations are set out in Annex 1. 7       Taking the contract figure for the PT Dok contract as being $253,300 (using the same exchange rate), the plaintiff deducted $91,992.37 as the costs of fabrication and the sum of $9,003.06 as further expenses and arrived at a loss of $153,304.57. The plaintiff’s calculations are set out in Annex 2. 8       The AR accepted the basis of calculation put forward by the plaintiff. He then considered the defendants’ objections to this calculation and noted that their dispute was essentially in respect of three cost items which the defendants alleged had been wrongly left out of the calculation. These were overheads, the cost of sub-contracting work and sums payable for Indonesian commissions and other expenses. Having considered the arguments, the AR found no substance in these objections. In particular, he did not accept the contention that the plaintiff’s overheads had to be factored into the calculation. Having held this, however, the AR noted that if the cost of overheads and sub-contracting work were omitted entirely, that would effectively mean that the profit margins for the PT Pal and PT Dok contracts were 53% and 60% respectively. Those figures were way above the estimated profit margin initially provided by the plaintiff in its claim (the initial margin claimed being 30%) and also above the 38% profit margin actually attained in respect of the “Pelindo II” contract. 9       The AR then came to the following conclusion: I therefore find on a balance of probabilities that while the bulk of the overheads would be fixed costs that had to be incurred in any event, there are bound to be some additional labour fees, engineering or other subcontracting costs that would have had to be incurred (over and above just the costs of materials). Adopting a broad-brush approach, I take 15% of the contract value as the amount of such additional labour and subcontracting costs which would have been necessary to perform the contract. This works out to $50,490 (15% of $336,600) for the PT Pal contract and $37,995 (15% of $253,300) for the PT Dok contract. He therefore awarded the plaintiff $127,736.87 as damages for the PT Pal contract and $114,309.57 as damages for the PT Dok contract. 10     In respect of the “Pelindo II”, the plaintiff claimed the sum of $32,468 as damages. This was calculated on the basis that the plaintiff had fabricated the system for the “Pelindo II” and would have been paid $50,830 (equivalent to the contract price of US$29,900 at the same exchange rate as mentioned above) had it delivered the same to PT Pal. As no delivery was made due to Mr Foo’s breach of duty, the plaintiff received no payment from PT Pal and had to scrap the entire system. It recovered only a salvage value of $18,361.90 from the scrapping operation and the deduction of this sum from the contract sum meant that its loss was $32,468. The AR accepted this calculation and awarded this amount to the plaintiff. 11     In respect of the plaintiff’s conversion claim, the AR assessed the damages as being the net book value of the equipment converted as the said values appeared in the plaintiff’s accounts as at 2003. He awarded the plaintiff $6,194.22 under this head. 12     The plaintiff claimed that it should be awarded interest on the damages to run from the respective dates of loss. The AR rejected this contention. He accepted the defendants’ submission that the plaintiff had delayed in instituting the action and had not given an explanation for the lapse of almost three years before it commenced proceedings. He therefore decided that interest at 5.33% per annum should be awarded as from the date the judgment in the suit was issuedie, 12 October 2007.",
        "The appeals": "13     Both parties were not entirely satisfied with the outcome of the assessment although, naturally, the defendants’ dissatisfaction was greater. Each appealed. 14     The defendants appealed against the assessment of damages for the two diverted contract claims and the “Pelindo II” claim and asked for the awards to be reduced. The plaintiff’s appeal was limited to two items: (a) it wanted the deduction of 15% of the contract value from the PT Pal and PT Dok contracts to be removed and for it to be awarded the full amount of those two claims; and (b) in respect of interest, it asked for interest to be awarded either from the dates of the respective breaches or from the date of filing of the writ of summons.",
        "The awards for the diverted contracts": "",
        "The defendants’ appeal": "15     The defendants contended that the plaintiff did not suffer loss in respect of the diverted contracts because it was not viable or profitable for it to have executed these contracts. They pointed out that the plaintiff had made losses in 2003 and 2004 and argued that this showed that if the diverted contracts had been undertaken by the plaintiff, they would not have made any significant difference to the loss sustained by the plaintiff in those years. They said the AR was wrong in holding that the overall financial position of the plaintiff had no bearing in the assessment of the damages. Further, he had missed the point when observing that “the Plaintiff had indeed incurred much overheads as fixed costs notwithstanding that it had been deprived of the two diverted contracts” when the issue was not in relation to deprivation but was as to whether the plaintiff would have profited in the process if it had executed the diverted contracts. Before I deal with the other points, I should say here that I cannot accept this criticism of the AR’s findings. In a case where the defendant has committed a breach of contract or a breach of fiduciary duty, the basis of the assessment of damages is to compensate the plaintiff and put him in the position in which he would have been had that breach not occurred. In this case, had the contracts not been diverted, the plaintiff would have received income from both of them. It may not have made a net profit overall for the year but definitely its income would have been greater. It is not correct for the defendants to argue that the plaintiff was only entitled to claim profit and if it could not show that it would have earned a profit overall from the diverted contracts, it had no basis to claim damages. Thus, it was correct that the question before the AR and before me on appeal was exactly how much the plaintiff would have received in income from the diverted contracts, bearing in mind that it had had to incur some expenses to fulfil those contracts. 16     The defendants argued that the profit margins of the plaintiff were nominal and could not be anywhere close to the original claim of 30% of each contract value. The evidence showed that the gross profit of the plaintiff for the years 2002, 2003 and 2004 was 17%, 20% and 27% respectively but that its net profit for the same years went right down to 4%, minus 6.5% and minus 1.5%. The plaintiff had initially estimated its loss of profits for the two diverted contracts as being 30% of the value thereof and this was in line with its gross earnings in 2004. The plaintiff’s own cost of sales was very high, being 82.5% in 2002, 78.8% in 2003 and 72.7% in 2004. This explained why in the discovery process, the plaintiff had switched to the use of the second defendant’s documents relating to the cost of sales for the two diverted contracts. The plaintiff, however, had been selective about this and had dropped or failed to include some of the defendants’ costingie, the Indonesian commissions and other expenses and the additional labour costs and sub-contracting costs. The defendants contended that these costs had to be taken into account in the calculation of the plaintiff’s loss. The second defendant’s total cost of sales in relation to the PT Pal contract was $266,000, not $158,000 as alleged by the plaintiff. The AR had erred when he said that the defendants had not shown documents to support the figure of $266,000 or explain how it was derived and by taking this view, he had, wrongly, shifted the burden of proving the losses onto the defendants. 17     Basically therefore, the defendants were reiterating before me the arguments that they had made before the AR. I have therefore to consider whether the three items which were not included in the plaintiff’s costingie, overheads, expenses of sub-contracted works (which amounted to $30,196) and Indonesian expenses (including commission) should have been added. I have also to consider whether the AR was right to reject the defendants’ contention that the second defendant’s cost of sales for the PT Pal contract was actually $266,000. 18     Dealing first with the question of overheads, the AR held that this was in the nature of fixed costs which the plaintiff would have incurred whether or not the two contracts had been diverted and noted that Mr Foo himself had conceded this point during cross-examination. To elaborate on the evidence of Mr Foo, he admitted during cross-examination that: (a)     the plaintiff could have fabricated the equipment utilising its existing factory space or facilities and the staff; (b)     the plaintiff’s labour costs were fixed regardless of the number of contracts the plaintiff was performing; and (c)     he did not have personal knowledge of the allegation in his affidavit of evidence-in-chief that at the material time there was a shortage of workers who would be able to carry out the contracts. 19     I agree with the finding of the AR. It was clear from the evidence that the plaintiff’s overheads were fixed and the quantum of the same would not have been affected had the plaintiff performed the diverted contracts. Mr Foo had recognised this fact during the assessment hearing. Whilst he had alleged that the plaintiff did not have sufficient facilities to perform the diverted contracts as well as other contracts which he had been in the process of obtaining for the plaintiff in 2003, no proof of this was produced. The plaintiff produced sufficient proof to establish on aprima faciebasis that its overheads were fixed and would have been incurred any way. After it met this burden, the defendants had the burden of showing that what appeared to be the position on aprima faciebasis was not in fact so. They did not discharge that latter burden. 20     Next, I consider the defendants’ argument in respect of the PT Pal contract that the second defendant’s total cost of sales amounting to $266,000 should have been adopted by the plaintiff instead of the sum of $158,373.13 (being the total of $146,023.67 and $12,349.46 shown in Annex 1). The problem here is that, as the AR noted, the defendants did not show how this figure of $266,000 was computed. First, the total figure of $266,000 was only mentioned in court and of this figure, $77,430.87 was not supported by any documents. The figure of $77,430.87 was arrived at by deducting from $266,000 the sum of $158,373.13 which the plaintiff accepted would have been the costs of fulfilling the PT Pal contract and the further sum of $30,196 which the defendants incurred in respect of sub-contracting expenses but which the plaintiff argued the plaintiff would not have had to incur since it had its own facilities. 21     During cross-examination, Mr Foo admitted that the sum of $77,430.87 had not been mentioned in his costing. When asked to confirm that he did not have a list of the costs and expenses supported by documents, Mr Foo said that he had the total figure and that the list was given during discovery. It was then suggested that no list was provided during discovery. He then responded that all the documents were provided. However, when he was asked whether he could show any document which supported any part of the sum of $77,430.87, he responded that he could not. He said at one point that the figures that the defendants had did not tally with the documents produced in court so some payment vouchers and invoices must have been omitted. He also conceded that he did not know what items had been taken out. This was very unsatisfactory evidence and incapable of supporting the defendants’ contention that an additional $77,430.87 had been incurred by the second defendant in fulfilling the PT Pal contract. In their submissions, the defendants did not maintain the position that the list of expenses had been provided either during discovery or during the assessment hearing. Thus, there was no basis on which the AR could have found that the defendants actually incurred $266,000 in performing the PT Pal contract and he correctly rejected the defendants’ arguments relating to that sum. I must do the same. 22     The AR did not deal in detail with the sum of $30,196 which had been paid by the second defendant to its sub-contractors. This sum comprised the following items: (a)Payment to Yeow Hwee Engineering being:$12,720(i)fabrication of air-con and condensing units$11,000(ii)modification of carrier’s packaged unit$ 1,000(iii)supply of plenum box$ 720(b)Payment to Paramount Airtech (for design and engineering fee)$16,626(c)Mr Tumanan’s re-work and change of condenser$ 850_______Total$30,196 23     The plaintiff contended before the AR that it would not have incurred the above expenses had it executed the PT Pal contract. Mr Ong Choo Guan, the executive director of the plaintiff who testified on the plaintiff’s behalf, asserted that the above items should not be included as costs and expenses that the plaintiff would have incurred to perform the PT Pak contract. This was because the plaintiff had the employees, equipment and facilities to carry out the first two items in-house and did not need to sub-contract these items to anyone else, unlike the second defendant which had to employ third parties to fabricate the system. With regard to the last item, that appeared to be the cost of rectification works necessitated by a mistake on the part of the second defendant. The AR’s comment was that the plaintiff had given a credible explanation as to why these expenses would not have been incurred. He also noted that the plaintiff had tendered evidence to show that its existing employees and manpower would have been able to carry out the fabrication works. 24     The evidence before the AR was also before me. The plaintiff had been able to show on aprima faciebasis that all the work described in items (a) and (b) listed in[22]above could have been carried out at its premises by its employees and manpower and that the costs of such employees and manpower were part of its general overheads. The defendants had not been able to show that the plaintiff would have been forced to sub-contract the fabrication in the same way that the second defendant had had to do. The admissions of Mr Foo in court worked against the later submission that such sub-contracting costs would also have been incurred by the plaintiff. The plaintiff’s contention that the last item, the payment to Mr Tumanan, the Indonesian agent for work in Indonesia, represented the rectification of work wrongly done by the second defendant was also a reasonable one. Accordingly, I agree with the view taken by the AR that the sum of $30,196 should not be counted as part of the plaintiff’s costs of fulfilling the PT Pal contract. 25     The third dispute was in relation to commission and other expenses paid in Indonesia. The plaintiff took into account as part of the expenses the sum of US$5,940 ($10,098) being the 3% commission that the second defendant had paid to its agent Mr Tumanan. Mr Tumanan himself testified and claimed that the commission payable for contracts like the PT Pal contract ranged between 5% and 10% of the price of the project. During cross-examination, however, he admitted that in the case of the PT Pal contract, the contractual commission was 3%. 26     The defendants produced three documents relating to payments made to Mr Tumanan. They were identified respectively as PBA268, PBA270 and PBA271. PBA268 is a payment voucher addressed to Mr Tumanan and contains details of three amounts paid to him. One of these amounts is stated to be the sum of US$5,940 as “Representative fee for tanker 30,000 DWT (3%)” and the reference for this payment is given as “P/O: VHA/003/10166”. The second document, PBA270, is the commercial invoice from Mr Tumanan’s company, CV Tiberias Jaya, addressed to the second defendant whereby he claimed,inter alia, US$5,940 as the 3% representative fee for “Tanker 30,000 DWT”. The third document, PBA271, is the second defendant’s Purchase/Work Order No. VHA/003/10166 and this shows the second defendant’s agreement to pay CV Tiberias Jaya US$5,940 as Mr Tumanan’s 3% commission for the same project. All these documents therefore substantiated only the payment of US$5,940 which the plaintiff had already taken into account in its calculation of $158,373.13. 27     The defendants, however, argued that in addition they had paid Mr Tumanan a further 2% of the contract price as expenses. This sum was not mentioned in the affidavit of evidence-in-chief filed by Mr Foo and it was not supported by any payment voucher or commercial invoice. Mr Tumanan claimed during cross-examination that there was a document to support the additional 2% but Mr Foo contradicted this evidence when he himself testified. Whilst Mr Foo asserted that when doing business in Indonesia one has to pay some extra commission and buy some extra equipment from the locals as a way of showing appreciation, he was unable to substantiate that assertion with any evidence as to any amount expended for such a purpose in relation to the specific contract under consideration. In any case, even if the second defendant might have had to undertake such expenditure, that does not mean that the plaintiff would have had to do it as well. That being the case, there was no evidence before the AR on which he could justify increasing the expenses accepted by the plaintiff by an amount reflecting that additional 2% or any other figure. No other evidence was pointed to on the appeal that would undermine the decision of the AR. Thus, the defendants’ argument has to be rejected. 28     Turning to the PT Dok contract, the disputes raised were of the same nature as those raised in respect of the PT Pal contract. The plaintiff took account of the commission paid for this project in the amount of US$3,950 ($6,715) on the basis of the supporting documents in PBA558 and PBA560 quoting the second defendant’s purchase order no. VHA/004,030/11537. Mr Tumanan claimed that additional commission was paid and that there were documents to support it but no documents were produced in court. Mr Foo confirmed in court that all purchase orders starting with the digits “004” were issued in relation to the PT Dok contract. Since the defendants were not able to support their assertion that more than US$3,950 was paid in commission and Indonesian expenses for the PT Dok contract, the AR was totally justified in ignoring this amount. As for the other disputes in relation to the cost of overheads and the cost of sub-contracting work out, these were rejected on the same basis on which those disputes were rejected in relation to the PT Pal contract. 29     For the reasons given above, I see no merit in the defendants’ appeal in relation to the assessment of damages for the diverted contracts.",
        "The plaintiff’s appeal": "30     As stated in[9]above, the AR took off a further 15% from the value of each of the diverted contracts. The plaintiff argued on appeal that this deduction of 15%, representing the estimated cost of additional labour fees, engineering and other sub-contracting costs, was not supported by any evidence adduced by the plaintiff or the defendants. It was clear from the evidence that the plaintiff would not have had to hire any additional staff to perform the diverted contracts and Mr Ong had testified that the employment of sub-contractors would not have been needed. There was therefore no justification for the deduction being made simply because the AR considered that the plaintiff’s profit margin was too big. 31     The defendants’ response was to contend that the deduction of 15% was too small. When the AR was unable to accept that the profit margin for the PT Pal and PT Dok contracts could be 53% and 60% respectively, he noted that the profit margin for the “Pelindo II” claim was only 38%. Yet he did not use that latter figure as the basis of his calculation. Rather than take the broad brush approach, the defendants submitted that the AR should have instead relied on the plaintiff’s financial documents indicating its cost of sales and huge overheads and used the net profit margins shown in those documents as the basis for his deduction. 32     Having considered the arguments, I agree with the plaintiff that the AR did not have any basis on which to deduct a further 15% from the contract prices in respect of either of the diverted contracts. There was no evidence of what additional costs the plaintiff would have incurred had it performed those contracts. It was up to the defendants to show that the plaintiff would have had to employ sub-contractors to do part of the work. It did not do so. The defendants’ case was not that the plaintiff had to incur additional labour expenses but that it should have taken into account the labour costs shown in its accounts for the financial year 2003/2004. Mr Foo made some allegations about lack of manpower but finally had to concede that he had no personal knowledge to substantiate the allegation that the plaintiff did not have competent workers who could perform and execute works independently without the need for additional supervision. He therefore could not undermine Mr Ong’s assertion that the plaintiff had the available expertise and manpower to do the jobs and would not have needed to hire any additional employee, engage any other third party or obtain any other equipment or facility. 33     As for the defendants’ criticisms of the AR’s holding, I agree that he should not have used the broad brush approach since this was an issue of special contractual damages which was susceptible to proof and not an issue of general damages which had to be assessed (using “assessed” in the sense of “estimated”). I do not agree, however, that in the absence of evidence he should have held that the plaintiff was not capable of performing the diverted contracts at the costs claimed. There was no evidence to undermine the plaintiff’s assertion that it did not need to go to any external source for labour or fabrication facilities and as the AR himself pointed out, the high overheads (which included the cost of manpower) disclosed by the plaintiff’s accounts were one indication that the plaintiff had the necessary facilities and manpower. 34     In my judgment therefore the plaintiff’s appeal on this issue must be allowed.",
        "The “Pelindo II” award": "35     Only the defendants appealed in respect of this award. They argued that instead of using the plaintiff’s figure of a 38% profit margin in respect of the contract for the “Pelindo II” as the basis of his assessment of the damages, the AR had, wrongly, based his assessment on a deduction of the value of the items that the plaintiff had managed to salvage from the value of the contract. The amount deducted was $18,361.90 and the difference between that figure and the contract sum of $50,830 was $32,468 an amount which is 63.88% of the contract sum. The defendants submitted it was wrong to award the plaintiff a sum equivalent to 63.88% of the contract value when the plaintiff would only have earned a profit of 38% had it delivered the system to PT Pal and received the contract value. Additionally, the AR’s assessment of the “Pelindo II” claim excluded deductions in respect of Indonesian expenses and the plaintiff’s huge overheads. It was also wrong for the AR to take the plaintiff’s salvage costing into consideration since this was not set out in Mr Ong’s affidavit of evidence-in-chief but was only tendered at the re-examination stage. The salvage costing itself was not reliable in that it had been handwritten and was not supported by documents or on any other basis. 36     The plaintiff responded that its margin of profit was irrelevant. It had fabricated the equipment and the quantum of damages had to be assessed on the basis of the contract value less the cost of items salvaged. The Indonesian consultancy fee payable upon securing the contract had been taken into account and was not a relevant expense for this quantification. In the circumstances, the method of assessment adopted was correct. 37     In my judgment, the plaintiffs were, in theory, entitled to quantify their loss on the basis of the contract value for the “Perlindo II” contract since they had fabricated the system contracted for and would have delivered it to PT Pal and received full payment for it had Mr Foo not diverted the letter of credit intended to pay for it and failed to ensure, at the time he left the plaintiff’s employ, that his successor fulfilled the contract with PT Pal. The plaintiff had, however, to give credit for any moneys received when it salvaged the parts and equipment used in the fabrication. This is where I have difficulty with the plaintiff’s case. While admitting that it did receive some money by way of salvage which it quantified at $18,361.90, the evidence supporting this figure was introduced at a very late stage (during re-examination of Mr Ong) and consisted only of a document called “VAT 576 Packing List”. This document contained a description of the parts of the fabricated system that were ready to be shipped to PT Pal and next to certain items some handwritten figures totalling $18,361.19 appeared. The defendants rightly criticised this document as being inadequate evidence that that sum was the only sum received as salvage. It should also be noted that Mr Ong in his affidavit did not refer to the salvage costs at all, let alone explain how these were derived and what exactly happened to the fabricated system. 38     I therefore consider that the plaintiff’s evidence of the quantum of its salvage costs did not establish those costs on a balance of probabilities. That being the case, the only way that the plaintiff’s loss in respect of the “Perlindo II” can be quantified is in the same manner as for the diverted contracts. That means the net loss of incomeie, the difference between the contract price and the cost of fabrication should be used, since the plaintiff has lost, at the very least, the income it would have received if it had delivered the system. The plaintiff’s costs and expenses incurred in meeting the contract amounted to $31,488.53 and therefore had it been paid the contract sum of $50,830 (US$29,900), its net income would have been $19,341.47. In this calculation, as in the others, only the direct expenses have been included and the costs of the overheads have been omitted. To this extent the defendant’s appeal succeeds and the award below in respect of the “Perlindo II” must be set aside and replaced with an award for $19,341.47. 39     The defendants also endeavoured to raise an argument to the effect that they should not be made liable for any loss in respect of this contract on the basis that the plaintiff itself had been negligent in not making the delivery and therefore caused its own loss. The AR rejected this argument and I do too on the basis that the defendants’ liability had been determined at the trial and they were not entitled to raise arguments on liability at the assessment stage. If the defendants were dissatisfied with the judgment, their recourse was to appeal.",
        "Interest": "40     The AR awarded the plaintiff interest on all sums awarded at the rate of 5.33% p.a. from 12 October 2007, the date when judgment on liability was delivered. He chose that date as the starting point for the interest calculation because he accepted the defendants’ submission that there had been delay by the plaintiff in commencing the action. The plaintiff appealed against the commencement date of the interest calculation. 41     On appeal, the plaintiff submitted that it should be entitled to interest in respect of its damages for the diverted contracts from the respective dates on which the second defendant received payment from PT Pal (10 May 2004) and PT Dok (1 July 2004) for these contracts. As for the “Pelindo II” contract, the plaintiff submitted that interest should be payable from 31 March 2004 as Mr Foo had said that the second defendant had received payment for this system by February or March 2004. The plaintiff also made a submission on interest in relation to the conversion of its assets in Shanghai. In respect of this claim, it asked for interest from the date when the goods were convertedie, 10 November 2003. Alternatively, the plaintiff asked that interest be awarded on all the claims from the date on which it filed its writ. 42     The defendants responded that as far as interest was concerned, the AR had exercised his discretion correctly and the plaintiff was not entitled to interest from the earlier dates claimed due to its delay in commencing proceedings. I agree that there was delay in commencing proceedings. It was clear from the evidence that the plaintiff knew about its various heads of claim on varying dates between November 2003 and the end of that year. That being the case, it was not,prima facie, reasonable for the plaintiff to have delayed commencing proceedings until March 2006. It would have been reasonable for the plaintiff, after undertaking some investigation, to have started its actions by mid 2004. The plaintiff did not give any explanation for the delay. Accordingly, I agree with the AR to the extent that the plaintiff was not entitled to recover interest for the period before it started the action. However, I do not agree that the plaintiff should only recover interest from the date of judgment. Once the proceedings were commenced, time started to run once again in respect of interest. There is no allegation that once started, the actual prosecution of the claim was dilatory. Proceedings seem to have moved along in the normal course. Thus, I can see no reason for the award of interest to be only from the date of judgment and I will therefore adjust the date of award accordingly.",
        "Conclusion": "43     In the result, the plaintiff’s appeal has succeeded in full and the defendants’ appeal has failed, except on one issue. The awards made below must be adjusted as follows: (a)     in respect of the claim for the PT Pal diverted contract, the amount awarded to the plaintiff is increased to $178,226.87; (b)     in respect of the claim for the PT Dok diverted contract, the amount awarded to the plaintiff is increased to $152,304.57; and (c)     in respect of the claim for the “Pelindo II”, the amount awarded to the plaintiff is decreased to $19,341.47. (d)     the plaintiff shall be entitled to interest on all of the above amounts and on the amount awarded in respect of the conversion of the Shanghai assets at the rate of 5.33% per annum from 1 March 2006 until the date of payment. 44     As for the costs of the appeal, whilst the plaintiff has succeeded on all its points, the defendants have only been successful on one point. Having regard to the time spent in argument on the various issues, I think the result of the appeals would be fairly reflected by an order that the defendants pay the plaintiff 90% of the plaintiff’s costs as taxed.",
        "[LawNet Admin Note: Annex A is viewable only byLawNetsubscribers via the PDF in the Case View Tools.]": ""
    }
}