{
    "case_title": "AAR and another v AAS (liquidator and trustee of B and others) and others",
    "ncitation": "[2009] SGHC 139",
    "coram": "Andrew Ang J",
    "sections": {
        "The facts": "2       The first respondent is the liquidator and trustee of [B], a company incorporated in the Philippines that was declared bankrupt in 2000. [B]’s steel plant located in the [XXX], Philippines, was closed as a result. In December 2002, pursuant to a liquidation plan, the first respondent was appointed as liquidator and trustee for [B]. The third to twenty-fifth respondents are [B]’s secured creditors (“the Secured Creditors”). The twenty-sixth to twenty-eighth respondents are [B]’s shareholders. The second respondent was appointed to act as Collateral Trustee and/or Facility Agent on behalf of the Secured Creditors. Together with the first respondent, the Secured Creditors issued a global invitation to tender for [B]’s assets. [C], the applicants’ holding company, submitted a successful bid for various [B] assets. [C] incorporated the applicants as special purpose vehicles for the purpose of purchasing and holding those assets. 3       The purchase of [B]’s assets was effected under an Asset Purchase Agreement (“the APA”) which provided for a purchase price of PHP 13.25bn (“the Purchase Price”). The payment terms of the APA were as follows: (a)Down payment:PHP 1bn;(b)Tranche A Note:PHP 2bn over the next five years; and(c)Tranche B Note:PHP 10.25bn over the next eight years. 4       The timeline for payment of the instalments were as follows:  Due DatePayment Amount15 October 2004PHP 1bn15 October 2006PHP 250m15 October 2007PHP 250m15 October 2008PHP 500m15 October 2009PHP 1.75bn15 October 2010PHP 1.75bn15 October 2011PHP 1.75bn15 October 2012PHP 6bn            5       Additionally, the Tranche A and Tranche B Notes were governed by an Omnibus Agreement dated 15 October 2004 (“the Omnibus Agreement”). As security for all of the applicants’ obligations to the Secured Creditors, the applicants agreed to provide Standby Letters of Credit (“SBLCs”) under various terms in the APA and the Omnibus Agreement. The SBLCs were essentially security for the instalment payments to be made by the applicants towards the Purchase Price. Each of the SBLCs was to have a validity of one year and ten business days from the date of its issuance. The timeline for the applicants to provide the SBLCs under the APA and the Omnibus Agreement were as follows:  Due DateSBLC Amount15 October 2004PHP 250m15 October 2005PHP 500m15 October 2006PHP 750m15 October 2007PHP 750m15 October 2008PHP 1bn15 October 2009PHP 1bn15 October 2010PHP 1bn15 October 2011PHP 1bn            6       Accordingly, by 15 October 2008, the applicants were to: (a)     make payment for the October 2008 instalment of PHP 500m; and (b)     furnish a fresh SBLC for PHP 1bn to secure the next instalment due on 15 October 2009. However, a dispute between the parties arose in relation to the transaction. The applicants alleged that the respondents were in breach of their obligation under the APA to deliver the [B] assets to the applicants free and clear of all liens of any kind or nature whatsoever. The applicants claimed that the respondents’ failure to pay the accrued taxes in relation to the APA had resulted in some of the [B] assets being subject to a lien by the [XXX]. Arbitration proceedings were commenced to resolve this dispute. In light of these developments, the applicants filed an urgent application on 9 October 2008 in the Philippines courts seeking injunctive relief against the first and second respondents to prevent the latter from calling upon the applicants to carry out their obligations under the APA and the Omnibus Agreement. The Philippines court denied this application. On 13 October 2008, the applicants filed anex-parteoriginating summons in the Singapore courts seeking largely the same injunctive relief and this was granted on 14 October 2008 (“the Injunction”). The pertinent terms of the Injunction are as follows: 1.[It is ordered that the Respondents,] jointly and severally, be restrained and/or enjoined by way of an injunction ... from:…(4)exercising all other legal rights and remedies which may now or hereafter be available to them under the Applicable Law, as defined in Article 1.1 of the APA,for and/or in relation to the following:(5)the non-payment of the 2008 Instalment by the due date, i.e. 15 October 2008;(6)the failure to provide a standby letter of credit for the sum of 1 billion Philippine pesos ... as security for payment of the next instalment falling due on 15 October 2009 (“the 2009 Instalment”); and/or(7)the failure to increase the value of the Existing [SBLC] to secure payment of the 2009 Instalment,until such time as the dispute between the parties relating to or in connection with their respective rights and obligations under the APA ... is finally settled by the arbitral tribunal, or such other time as may be decided by the tribunal.2.The Applicants’ obligations to pay any further instalments due under the APA, the Tranche A Note, the Tranche B Note and the [Omnibus Agreement], and to provide any further standby letter of credit or any standby letter of credit of increased value, be suspended, deferred and/or postponed until such reasonable time after the Respondents pay or cause to be paid all accrued pre-closing taxes together with all interests and penalties in relation thereto on the [B] Plant Land Assets (as defined in the APA) and cause the same to be delivered to the Applicants “free from and clear of all Liens of any kind or nature whatsoever”, or such other time as may be decided by the tribunal.[emphasis in original] The effect of the Injunction was that, until the dispute between the parties was resolved in the arbitration proceedings, the applicants did not need to make payment of the instalments or furnish any further SBLCs and this included the instalment payment of PHP 500m and the SBLC for PHP 1bn which was due on 15 October 2008. 7       On 23 October 2008, the second respondent filed an urgent application to vary the Injunction on the basis that the existing SBLC for PHP 750m (“the Existing SBLC”) issued by ANZ Philippines in favour of the second respondent would expire on 29 October and that the second respondent would suffer grave prejudice if this SBLC was not renewed. According to the second respondent, it would be relegated to the position of an unsecured creditor in respect of the amount of PHP 750m if the SBLC was not renewed. This application was granted by Tay J on 24 October 2008 who made the following orders (“the Variation Order”): (1)    If ANZ Philippines does not renew the [Existing] SBLC by 12 noon, 28 October 2008 (Philippines time), the Applicants are to give irrevocable instructions immediately to ANZ Philippines to remit 750million pesos to Second Respondent’s account in Philippines by close of banking hours on Tuesday 28 October 2008 (deemed to be 4 pm Philippines time) failing which the said Order of Court [the Injunction] shall stand discharged without need for further hearing or order.(2)    Second Respondent shall comply with the existing injunction and give [an] irrevocable undertaking to the Court and ANZ Philippines not to call on the [Existing] SBLC [ie, the SBLC for PHP 750m due to expire on 29 October 2008] once ANZ Philippines has complied with the Applicant’s irrevocable instructions as stated in (1).(3)    Second Respondent also irrevocably undertakes that the 750million pesos, once transferred to their account, shall not be subject to any set-off by Second Respondent or any other Respondents pending the final decision of the arbitral tribunal.(4)    The Second Respondent shall designate an account number for the transfer of the said sum [of PHP 750m] from ANZ Philippines to Second Respondent, by 5pm today [24 October 2008].(5)    [The costs of the application shall be costs] in the cause. 8       It will be noted that the court made no order in regard to the fresh SBLC for PHP 1bn due to be issued on 15 October 2008. Subsequently, ANZ Philippines did not renew the Existing SBLC and the applicants also failed to remit the PHP 750m by 4pm, 28 October 2008 (Philippines time). The second respondent sent the applicants a written notice dated 28 October 2008 at 4.05pm (“the Written Notice”) and declared the applicants to be in default of the Omnibus Agreement. It turned out that ANZ Philippines had remitted the PHP 750m at 4.09pm (Philippines time) and that the second respondent received the same in their account at 4.13pm (Philippines time) on the same day. On 10 November 2008, the applicants filed an application by way of Summons No 4925 of 2008 for,inter alia: (a)     an extension of time for the remittance of PHP 750m under the Variation Order; (b)     a declaration that the Injunction still stands and remains binding on the respondents; and (c)     a declaration that the Written Notice is deemed withdrawn and/or rendered null and void. At the hearing before Woo Bih Li J on 20 November 2008, the second respondent informed the court that they were prepared to give an undertaking not to take any steps in reliance on the Written Notice until further order or decision by the arbitral tribunal unless parties agree otherwise in writing, whichever was earlier. The applicants accepted the second respondent’s undertaking and thus Woo J made no order with regard to the application. 9       Subsequently, the second respondent filed an application to further vary the Injunction to require the applicants to remit PHP 1bn to the second respondent’s designated account, failing which the Injunction would stand discharged. The second respondent confirmed that it was prepared to irrevocably undertake that this sum once transferred shall not be subject to any set-off by the second respondent or any other respondent, pending the final decision of the arbitral tribunal. 10     Having considered the parties’ arguments, I refused to grant the second respondent’s application. I now set out the reasons for my decision.",
        "My decision": "11     The parties appeared before me and the applicants, in opposing the second respondent’s application, argued strenuously on the respondents’ alleged breach of its obligation under the APA to deliver the [B] assets free of any liens. Bearing in mind that this issue is the subject of the arbitration proceedings, I will not address this point in detail. It would also not be appropriate for me to do so without the benefit of full arguments by the parties. 12     Therefore, I deal with the second respondent’s application on a narrower point. The issue, in my view, was whether a further variation of the Injunction would preserve thestatus quoand whether such a variation was just and equitable. The second respondent argued that a further variation of the Injunction was required because it would be gravely prejudiced for it would otherwise be deprived of its entitlement to security by way of the SBLCs which the applicants were supposed to furnish under the APA and the Omnibus Agreement. By the second respondent’s reasoning, the preservation of thestatus quomeant that the applicants had to continue carrying out these obligations. Since the applicants were not furnishing SBLCs pursuant to the APA, the second respondent sought for payment in cash of the value of the SBLC which would have been furnished had there been no dispute between the parties. 13     The second respondent’s position was, in my view, untenable. It was clear from the terms of the Injunction (quoted above at[6]) that the second respondent was restrained from calling upon the applicants to carry out their obligations under the APA to pay the instalments as and when they fell due and to furnish the SBLCs as security for subsequent instalments. If the variation sought was granted, the Injunction would be seriously undermined. The applicants would be required to furnish security for an instalment payment which, by the terms of the Injunction, it was not required to make until the dispute was resolved (and even then only if it was resolved in favour of the Secured Creditors). Further, the sort of security sought by the second respondent placed on the applicants a more onerous burden than that required of it by the terms of the APA. Instead of furnishing an SBLC, the second respondent wanted the applicants to make payment in cash of the value of the SBLC. Even though the second respondent undertook not to exercise any right of set-off in respect of these moneys, this still appeared to me to be unreasonable. Allowing the variation sought would mean that the applicants would have to make payment in cash of the value of the SBLC. This would have severely undermined the Injunction, the purpose of which was to restrain the second respondent from calling upon the applicants to make payment of any sort until the resolution of the dispute as evinced from the broad wording of the Injunction. 14     Further, the second respondent had, previously, in Summons No 4676 of 2008 sought the same variation of the Injunction. Although the second respondent’s arguments at the hearing of this application before Tay J centred on the consequences of the non-renewal of the Existing SBLC for PHP 750m (see[7]above), it was clear that the applicants had also sought a variation of the Injunction to require the applicants to furnish the PHP 1bn SBLC which was overdue as well as the subsequent SBLCs as and when they fell due. In the affidavit filed by Rogel L Zenarosa in support of Summons No 4676 of 2008 on 23 October 2008, it was stated (at [73]–[74]) that: 73… the correct status quo position should be for the Applicants to provide the Outstanding SBLC [for PHP 1bn] and the Subsequent SBLCs as and when they fall due. The current terms of the [Injunction] effectively relieve the Applicants from their obligation to provide the Outstanding SBLC and the Subsequent SBLCs.74.This is unfair to the 2ndRespondents because the terms of the APA expressly provide that the Applicants shall provide security for Tranche A and B Notes by way of the Outstanding SBLC and the Subsequent SBLCs. The injunction as it currently stands would deprive the 2ndRespondents of their entitlement to such security. The 2ndRespondents would be relegated to the position of an unsecured creditor. 15     In response to the second respondent’s application, the applicants made several suggestions. One of these suggestions was for the PHP 750m deposited with ANZ Philippines for purposes of issuance of the Existing SBLC, due to expire on 29 October 2008, to be uplifted and deposited into the second respondent’s designated account as security. Tay J accepted this proposal and made no order in respect of the second respondent’s application for an order for the applicants to furnish the PHP 1bn SBLC and the subsequent SBLCs as and when they fell due. It was thus clear that Tay J intended only to preserve the state of affairs as it was at the time prior to the filing of the application for the Injunction. The learned judge did not intend for the applicants to continue carrying out its obligations to furnish security under the APA. The second respondent did not appeal against Tay J’s decision. Yet before me, it sought essentially the same variation to the Injunction that it had unsuccessfully applied for previously. 16     A variation of an injunction may be granted if there has been a material change of circumstances since the injunction was first granted or if the injunction was founded on an erroneous view of the law which was found out later on (see Lord Diplock’s observations inHadmor Productions Ltd v Hamilton[1983] 1 AC 191 at 220 cited by the Court of Appeal with approval inFederal Computer Services Sdn Bhd v Ang Jee Hai Eric[1991] SLR 259). The second respondent has not been able to point to any error of law or material change of circumstances to justify granting the variation sought. Indeed, the second respondent is essentially raising the very same arguments it had raised in the hearing before Tay J, namely, that it would be gravely prejudiced if it was restrained from calling upon the applicants to furnish the SBLC for PHP 1bn as well as subsequent SBLCs because it would be relegated to the position of an unsecured creditor in respect of the unpaid Purchase Price. Bearing in mind that Tay J refused to grant the variation sought and that the second respondent did not appeal, it would have been highly inappropriate for me to grant the very same variation in the absence of any material change in circumstances or revelation of any error of law made in that decision. In this connection, I would agree with the observations of the learned Simon Brown J inLondon Underground Ltd v National Union of Railwaymen (No 2)[1989] IRLR 343at 344 that: … there is no rule of law, no jurisdictional bar to the court entertaining, where justice requires it, an application to discharge an injunction, even following upon a fullinter parteshearing. Indeed, rather than beingfunctus, the court has an inherent jurisdiction to do so. But – and to my mind it is the determinative ‘but’ in the instant case – the court will not do so where it appears that justice between the parties can as readily be achieved by pursuing the right of appeal. I am of the view that Brown J’s observations apply equally to an application for variation of an injunction. It was not appropriate for me to grant the very same variation sought and refused by Tay J when the second respondent did not appeal against that decision and when there had been no material change in circumstances since that decision or revelation of any error of law to justify my granting the variation. 17     In any event, I did not think that the variation sought would have been a true preservation of thestatus quoprior to the application of the Injunction. In essence, the second respondent was seeking an order for the applicants to continue to perform their obligation under the APA and Omnibus Agreement to provide security for the instalments as if no dispute had arisen. While I make no finding as to whether the respondents had breached its obligations under the APA, I could not ignore the fact that there was a dispute between the parties and that there were ongoing arbitration proceedings to resolve this dispute. Until this dispute was resolved, it would not be appropriate for me to require one party to carry out its obligations as if there was no such dispute. This did not appear to me to be a preservation of thestatus quo. Such an order, in my view, would have led to an inequitable result in that the applicants had to carry out their obligation to furnish security under the APA and Omnibus Agreement notwithstanding their contention that the Secured Creditors were in breach of these agreements in the first place. In my view, Tay J’s order achieved a true preservation of thestatus quoas at the time prior to the filing of the application for the Injunction and ought not to be disturbed. 18     For the foregoing reasons, I did not think it appropriate to grant the second respondent a further variation of the Injunction. In the result, I dismissed the second respondent’s application with costs fixed at $4,500 plus disbursements."
    }
}