{
    "case_title": "Public Prosecutor v Lim Hwang Ngin Lawrence",
    "ncitation": "[2009] SGHC 27",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The mitigation plea": "5       The plea in mitigation recounted that: 19.    After that shaking incident, the relationship between the accused and Tri went downhill. He was less patient and he scolded her more. He never managed to forgive Tri for what she had done to Hazel and the shaking incident played on his mind subsequently. He had unwittingly allowed his deep anger and frustration with Tri over that shaking incident to get the better of him, and that eventually led to him losing control of himself and assaulting Tri. and went on to highlight that no instruments or objects were used during the assaults and the injuries inflicted were not serious or life-threatening. 6       The accused had been a police officer since 1993 and has been promoted over the years and attained the rank of staff sergeant in 2002, and has received several awards and commendations. He had no antecedent of any criminal conduct. 7       Counsel urged me to consider imposing a fine for the less serious offences and short custodial sentences of one to four weeks’ imprisonment for the other offences and that only two sentences are to run consecutively.",
        "The prosecution’s submissions": "8       The prosecution took a very different view on the sentences to be imposed. It pressed for sentences at a minimum of twelve months’ imprisonment on each charge, with the sentences to run consecutively.[note: 1] 9       In its submissions, the prosecution asserted that the accused had inflicted severe injuries particularly on vulnerable areas of the body such as the abdomen and the head. 10     The prosecution also pointed to the recurrence of the offences, the accused’s lack of remorse, and that the accused had abused his position as a police officer. 11     I directed parties to make further submissions with references to sentences that have been imposed for similar offences, and the further submissions received were of assistance to me.",
        "The law and the guidelines": "12     At the time of the offences, an offence under s 323 of the Penal Code was punishable with imprisonment of up to one year, a fine of up to $1,000 or both. Under s 73(2), for an offence against domestic maids, the imprisonment is increased by one-and-a-half times. The maximum sentence for the offences which the accused was convicted was one and a half years’ imprisonment or a fine of up to $1,500, or both. The maximum sentences have been increased at the present time, but the revisions do not apply retrospectively to the accused’s offences 13     The guidelines for sentencing in maid-abuse cases are well established. InPP v Chong Siew Chin[2002] 1 SLR 117, Yong Pung How CJ stated that deterrent sentences should be imposed for offences of abuse to domestic maids as they require additional protection because (i) they are mostly recruited from neighbouring countries and are separated from the support of family and friends and are dependent on their employers for food and lodging; and (ii) maid abuse usually takes place in the privacy of the home where offences are hard to detect. InChua Siew Lin v PP[2004] 4 SLR 497, Yong CJ went on to state that custodial sentences should be imposed in such cases. 14     I had a reason to ask for further submissions from counsel. After I have read the prosecution’s submissions that minimum sentences of five years imprisonment should be imposed to run consecutively, I wanted to know if the proposed sentences were in keeping with the sentences passed on other offenders. 15     I will refer to the principal cases. InOng Ting Ting[2004] 4 SLR 53, Yong Pung How CJ stated (at [48]) that the sentencing norm for cases involving maid abuse where no serious physical injury was caused is one to six weeks imprisonment. In that case, the appellant punched and kicked a maid and caused injuries to her head, elbow, jaw and thighs. The appellant was convicted of four charges under s 323 and two charges of using criminal force under s 352, and one charge of criminal intimidation under s 506. She was sentenced to one week’s imprisonment for each s 323 offence, with two of the sentences to run concurrently, and the sentence was upheld on appeal. 16     InPP v Chong Siew Chinreferred to in [13], the accused slapped her domestic maid on three separate occasions on the same day. At her trial, she was ordered to pay a fine of $1,500 for each offence. On the prosecution’s appeal, Yong CJ increased the sentence to six weeks’ imprisonment for each offence with two sentences to run consecutively. 17     InChua Siew Lin v PPalso referred to in [13], the appellant was convicted for causing hurt to her maid by slapping her and pushing her head against a wall and was sentenced to two weeks’ imprisonment. Yong CJ dismissed the accused’s appeal against the sentence. 18     In other cases longer custodial sentences were imposed. InFarida Begam d/o Mohd Artham v PP[2001] 4 SLR 610, the accused hit her domestic maid on the head and upper body with a wooden pole and hit her on the face with a slipper. She was convicted after a trial of an offence under s 323 Penal Code and was sentenced to three months imprisonment. On appeal before Yong CJ, he found that there were no real mitigating factors, but there were aggravating factors in that the maid sustained rather serious injuries on the head and face. The accused had used a wooden pole and a slipper in the assault, the accused was in a position of authority over the maid, the maid was a vulnerable victim, the attack was unprovoked, and the accused had shown no remorse. On that basis Yong CJ enhanced the sentence to nine months imprisonment. It should be noted that Yong CJ laid the guidelines in [13] against the background of his decision in this case. 19     InPP v Heng Kwee Huang[2002] SGDC 122, the accused was found to have assaulted her domestic maid, and was convicted of three charges under s 323 and one charge under s 324. She had punched the maid’s eye (the first offence under s 323), pulled the maid’s hair and banged her head against a table (the second offence under s 323), poured hot water to the maid’s thigh (the third offence under s 324 for causing grievous hurt) and slapped the maid’s fact (the fourth offence under s 323). In mitigation, it was pleaded that the accused, a teacher with young triplets, was unable to cope with her job and the responsibility of looking after the triplets. She suffered from severe depression and had attempted suicide on several occasions. The accused was sentenced to seven months’ imprisonment for the first charge, 10 months’ imprisonment for the third charge, and a fine of $1,500 for the second and fifth charges. The two custodial sentences were ordered to run concurrently. 20     In my grounds of decision on the convictions, I highlighted that:  (i)Tri had been working for the accused and his wife since December 2004;(ii)Tri’s duties were to look after the accused’s infant daughter Hazel and to perform household duties;(iii)Tri is a submissive and timid person;(iv)the accused is a police officer holding the rank of staff sergeant;(v)the accused had developed an active dislike for the maid after he chanced upon her shouting at and shaking Hazel violently;(vi)Tri was afraid of the accused who she said had threatened to send her to Batam to a life of prostitution, or to send her to prison, if she disobeyed him; the accused admitted to making the threats of imprisonment but not threats of prostitution;(vii)the accused assaulted Tri over minor offences; and(viii)the matters came to light through the intervention of two neighbours who were concerned over Tri’s plight. 21     When I sentenced the accused on 10 November 2008, I mentioned that:  (i)the circumstances leading to each assault were the minor innocuous mistakes of a domestic maid, made without any defiance, disrespect or dishonesty;(ii)the accused had harboured a deep-seated resentment against Tri. He had wanted to dismiss her, but was dissuaded by his wife. He then decided to make Tri’s life uncomfortable;(iii)the accused abused his position as a police officer and preyed on Tri’s fear and respect of authority; and(iv)the accused had continued his assaults on Tri without let-up or concern for her. 22     I will say a little more on those matters. Firstly, each assault was brought on by an act of forgetfulness or carelessness of the maid, like forgetting to pack the child’s clothings on an outing, or not holding onto the child during a bath, and using a wrong teat on a milk bottle. 23     The accused’s hostility towards the maid was revealed by his admission that “… I want to make her life miserable ... I’m just having psychological warfare to her only”[note: 2], which his counsel expanded on in the plea in mitigation: 19.    After that shaking incident, the relationship between the accused and Tri went downhill. He was less patient and he scolded her more. He never managed to forgive Tri for what she had done to Hazel and the shaking incident played on his mind subsequently. He had unwittingly allowed his deep anger and frustration with Tri over that shaking incident to get the better of him, and that eventually led to him losing control of himself and assaulting Tri. In the light of the admission, the assaults were not spontaneous lapses of self-control. They were the vengeful reaction to the maid’s continued presence in his house. I do not see how it can be said that he had “unwittingly” allowed this anger and frustration to get the better of him. The clear evidence is that he deliberately assaulted the maid, not once, but on repeated occasions. He allowed himself to vent his dislike of her by violence, and made no effort to check himself. 24     InAnnis bin Abdullah v PP[2004] 2 SLR 93andPP v Loqmanul Hakim bin Buang[2007] 4 SLR 753, Yong CJ and VK Rajah JA explained the circumstances and rationale for a police officer to be punished more severely for committing an offence. The accused had impressed on Tri that he was a police officer. When he threatened to have her imprisoned, he must have known that she would take that seriously because he was a police officer. By so doing, he had abused his position and tarnished the good name and standing of police officers. This has to be taken into consideration for his sentencing. 25     The assaults took place on 29 January 2006, 21 April 2006, 29 April 2006, 4 May 2006 and 5 May 2006. Matters came to an end on 5 May 2006 when the police intervened, and the maid was taken away from the accused’s apartment. Throughout that period, the accused had not once apologised to Tri for his conduct, made any promise to stop the abuse or show any concern over the injuries inflicted on her. The only concern he experienced was for himself and his wife in the event the assaults became known. 26     The pain and injuries suffered by Tri should also be taken into consideration. Although there were no permanent or disabling injuries, the assaults caused her real pain and left marks which could be seen in the photographs taken after she was taken from the accused’s apartment.[note: 3] 27     In deciding on the sentences to be imposed, I did not agree with the defence counsel’s submission that fines and short sentences were appropriate, and I did not find the prosecution’s proposal that the accused be sentenced to 12 months’ imprisonment for each offence, with the sentence to run consecutively to be well-considered. 28     I imposed the sentences set out in [3] which I regard to be warranted on the facts of the case which I have referred to. I also considered the effective jail term of 12 months for the five offences to be appropriate. 29     A comment on submissions on sentencing is apposite in closing. When counsel addresses a court on sentence, a degree of responsibility goes with it. The submission should take into account the applicable sentencing principles, guidelines, and the normal tariffs as well as the relevant facts of the particular case. When counsel asks the court to impose a sentence which departs from the norm, whether by being unusually light or severe, counsel should bring that to the attention of the court and give the reasons for the exceptional proposal. When that is not done, the submission would at best not assist the court, and at worst, it may mislead it. _________________ [note: 1]Prosecution’s Submissions on Sentence para 6 [note: 2]Notes of Evidence page 1944 [note: 3]P13-P20"
    }
}