{
    "case_title": "Maxz Universal Development Group Pte Ltd v Shen Yixuan and Another Suit",
    "ncitation": "[2009] SGHC 164",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Background": "5       In 2005, Maxz was negotiating the purchase of the assets of Sijori Resort (Sentosa) Pte Ltd (“Sijori”). The principal asset of Sijori was a piece of land and building (“Sijori Hotel”) at 23 Beach View on Sentosa island that was leased from Sentosa Development Corporation (“SDC”). Maxz had planned to redevelop this along with adjacent land that it would purchase from SDC (“the Project”). Maxz incorporated TR as a special purpose vehicle to carry out the Project. On 29 May 2006, SDC approved TR’s proposal to purchase Sijori Hotel and additional adjacent land for redevelopment. Maxz then needed to raise $6m for the following: (a) to pay rental arrears owed by Sijori to SDC; and (b) to pay for the purchase of Sijori’s assets, part of which was to go towards discharging a loan of more then $3m from the Bank of China. As for the additional land adjacent to Sijori Hotel, Maxz was negotiating with Malayan Banking Berhad (“Maybank”) for a $2.5m facility, out of which $2m would be utilised to make payment for it. To secure this facility, Maxz had arranged for SHC to issue a $2.5m Insurance Guarantee Bond (“IGB”). SHC required from Maxz a security deposit of $500,000 to issue the IGB in favour of Maybank. The signing of the deed of novation (“DN”) and supplemental agreement (“SA”) with SDC to effect the purchase of Sijori Hotel and additional land was scheduled for 14 November 2006, at which time a payment of $2m out of the $2.5m Maybank facility would have to be made. In order for SHC to issue the IGB in time for the 14 November 2006 completion date, SHC required the $500,000 security deposit to be placed by 8 November 2006. 6       Therefore on 8 November 2006, Seeto was facing a critical deadline. Maxz needed $500,000 in cash to be deposited with SHC for the issue of the $2.5m IGB required to unlock the $2.5m Maybank facility, out of which $2m payment had to be made for the signing of the DN and SA with SDC. It was not in evidence whether the completion was in jeopardy without the $2.5m on 14 November 2006, but it was clear from the evidence that Seeto was making great efforts in the days leading to 8 November 2006 to procure this investment. Shen was not the only option that Seeto was juggling with. There was at least one other potential investor that Seeto was negotiating with right to the last minute. This was Johnny Tan (“Tan”), a director and shareholder of Azzura Resorts Pte Ltd (“Azzura”). At that time Azzura was also planning a development in Sentosa. In late October 2006 Seeto was introduced to Tan by a banker from Moscow Narodny Bank Limited to discuss a possible linkup. Seeto briefed Tan on his project and explained that he needed $500,000 for the IGB from SHC. Over the next two weeks leading up to 7 November 2006, they were in negotiation to the point that Tan instructed his solicitors to draft three documents: (a) a $500,000 loan agreement; (b) a personal guarantee from Seeto for the loan; and (c) a share swap agreement. On 7 November 2006, these documents were forwarded to Seeto for execution the following day. But Seeto did not follow through with this. Instead he proceeded with execution of the Loan Agreement with Shen on 8 November 2006. With that, SHC issued the IGB, Maybank made available the $2.5m facility, payment was made to SDC on the completion date of 14 November 2006 and the Project got underway.",
        "Seeto’s situation on 8 November 2006": "7       There is a dispute as to how desperate Seeto was to secure the $500,000 cash deposit for the IGB from SHC and I turn to consider the evidence. 8       The following is Shen’s version of the events leading to the execution of the Loan Agreement on 8 November 2006. On 6 November 2006, Seeto met him at his hotel room at Siloso Beach Resort, Sentosa. Seeto told him that Maxz urgently required a short-term loan of $500,000 for the purpose of obtaining an IGB from SHC for the sum of $2.5m. This was required to secure credit facilities for that amount from Maybank which would be utilised for the Project. Seeto told him that he had considerable difficulty raising this sum of money and if Maxz failed to make payment to SHC on time, the Project would be jeopardised. Shen told Seeto that he was agreeable in principle, as he saw great potential in the project and did not want to see it fail. Shen asked what Maxz was prepared to offer in consideration for the loan, but Seeto responded by asking Shen to state his terms. Shen said that he declined and insisted on hearing from Seeto first. It was then that Seeto suggested that Maxz would transfer 6% of the total share capital of TR, amounting to 289,200 shares, for the sum of $1 in return for the loan. Shen said he agreed to this, but asked for an additional term, that in the event Maxz failed to repay the loan, Shen would be entitled to require Maxz to transfer a further 14% of the total shares in TR (amounting to 674,800 shares) in lieu of repayment. On 7 November 2006, Shen and Seeto went to the office of GS Associates Pte Ltd (“GSA”), the company secretarial services provider used by Shen, to obtain assistance on the documentation for the Loan Agreement. They met with Susan Chan (“Susan”) and Sharon See (“Sharon”) of GSA. Seeto explained to them the agreement they had reached and Susan recorded the points of agreement on a term sheet. She told them that they should instruct a solicitor to draft the agreement and they agreed. Susan then contacted East Asia Law Corporation (“East Asia”), a firm on the same floor as GSA. The following day, 8 November 2006, a solicitor from East Asia, Aaron Goh (“Goh”), met with Shen and Seeto to take instructions on the Loan Agreement. Seeto requested that the documentation be completed by 3pm that day but Goh said he could only do so by 5pm. Shen then went to the bank to procure the cashier’s order for the sum of $500,000. At around 5pm Shen and Seeto returned to the GSA office where they signed the Loan Agreement and other documents, including the share transfer documents. 9       According to Seeto, Shen had, on a number of occasions, told him that if Maxz faced any difficulty, he should feel free to approach Shen for help. In Seeto’s version of the events leading to the signing of the Loan Agreement, they met at Shen’s hotel room only on the afternoon of 7 November 2006. Seeto explained to Shen that Maxz required a 12-day bridging loan of $500,000 to be disbursed by around 5pm on 8 November 2006. This would enable Maxz to procure the IGB which would in turn activate the $2.5m Maybank facility out of which the $2m would be available for the completion of the DN and SA with SDC. The balance $500,000 could then be used to repay Shen. Seeto said that Shen agreed to assist and asked about the collateral, to which Seeto replied that he could put up 5% of Maxz’s shares in TR. They eventually compromised on 6%, amounting to 289,200 shares in TR. Seeto said that there was no mention of the value of the TR shares nor was there any hint that this was not collateral but consideration for the loan. Shen told Seeto that he would require legal documentation for the loan and they agreed to meet the following day, 8 November 2006, at the office of GSA for this. They then left the hotel together and Seeto dropped Shen off at Textile Centre. Seeto said that the meeting was a short one, lasting no more than half an hour. Seeto denied Shen’s claim that they had discussed the loan on 6 November 2006. Seeto also denied that he had gone with Shen to the office of GSA on the afternoon of 7 November 2006. He said that he had returned to his office after dropping Shen off and at around 6pm that evening he had met up with various people for dinner at Club Street, one of whom was Tan. Seeto claimed that he had Tan as an alternative source of finance and the terms set out in the Loan Agreement were so onerous that he could not have agreed to them. 10     Tan was a witness in the trial. I found him to be a neutral witness and, more importantly, a truthful witness who made a real effort to recall events that took place some two years ago. An important point in Maxz’s case was that Seeto could not have arrived at Club Street at 6pm if he had been at the GSA office to sign the documents as Shen had claimed. In cross-examination, Tan was asked what time it was that he met Seeto at Club Street. He said that it was about 8pm or 9pm. Counsel then suggested to him that it was earlier than that, around 6pm or 6.30pm, to which Tan replied that he could not remember. In re-examination, it was pointed out to Tan that this was an important point, and Tan reiterated that Seeto arrived around 8pm to 9pm. I also accepted Tan’s evidence on how Seeto led him up the garden path in relation to the $500,000 loan to the extent that Tan instructed solicitors to draft the agreements on Seeto’s undertaking to pay the legal fees. Tan had given evidence that he had managed to procure the $500,000 loan to Maxz from Pan Global Bhd (“PGB”), a listed Malaysian company. As consideration for this loan, there would be a share swap agreement involving Tan’s shares in Azzura and Seeto’s shares in Maxz. After Seeto failed to proceed with the agreements, Tan was stuck with the fees which he had to pay. Seeto’s position on this was that Tan had agreed to procure PGB to lend Maxz $500,000 interest free, secured only by Seeto’s personal guarantee and not tied to the share swap. I found that to be an incredible assertion, that PGB would make the interest-free loan in the circumstances on no consideration other than Seeto’s personal guarantee. It was all the more incredible in the face of the documents prepared by Tan’s solicitors. Indeed if Tan’s loan was not tied to the share swap agreement, it would be such a good deal that there would have been no reason for Seeto to abandon this at the eleventh hour in favour of the more onerous Loan Agreement from Shen. It should be noted that the share swap agreement with Tan involved 20% of Maxz’s shares whereas in Shen’s Loan Agreement, Seeto only gave up 6% of Maxz’s shares and he was confident of his ability to repay the loan within the 12 days. 11     The incredulity of Seeto’s position was not assuaged by his performance in the witness box. I found Seeto to be a witness who had no qualms about giving glib and inconsistent answers to support his position. Another of Maxz’s witnesses was Sebastian Wong Cheen Pong, and I found that he was almost as bad as Seeto in his demeanour. 12     In relation to the series of events that led to the signing of the Loan Agreement on 8 November 2006, I found Shen’s position to be supported by the documents as well as the evidence of Susan and Sharon in the light of the contemporary written records. I therefore found Shen’s version to be the correct version and disbelieved Seeto’s version. This puts paid to Seeto’s assertion that he could not have agreed to the terms as stated in the Loan Agreement. I found that Seeto readily agreed to the terms of the Loan Agreement because he considered that to give up 6% of his shares in Maxz was the lesser of two evils in the desperate straits he was in on 8 November 2006 and he was confident of securing repayment of the $500,000 in time.",
        "Construction of the Loan Agreement": "13     Maxz’s position is that the Loan Agreement is ambiguous. Although I would not consider it to be a paragon of good drafting (it was certainly drafted in a hurry), in my view it is clear enough on its main points. The recital stated that it was a “loan agreement” between Maxz, described as the borrower, and Shen who was referred to as the lender. The preamble stated that Maxz needed funds for the acquisition of additional land in Sentosa and that Shen had agreed to grant a “credit facility” in the amount stipulated in Art 2 (ie$500,000) upon the terms of the agreement. Article 2 sets out the following: (a)     Shen agrees to lend $500,000 to Maxz. (b)     Under the heading “Consideration”, Maxz agrees to transfer 289,000 shares in TR for a consideration of $1. (c)     The $500,000 is to be paid by way of a cashier’s order for that sum in favour of SHC. (d)     Maxz shall use the proceeds of the loan solely for the acquisition of additional land at Sentosa. 14     Article 4.1 provides that“All payments to be made hereunder by the Borrower shall be made … not later than … 20 November 2006”. There is indeed an ambiguity here because nowhere in the Loan Agreement is there an express provision for an obligation to repay the $500,000 except under an ED as defined in Art 9. However taking into account the factors set out hereafter, it is clear that Art 4.1 provides for Maxz to repay the $500,000 loan within 12 days, by 20 November 2006, and I so hold. The factors are as follows: (a)     If “all payments” to be made by “the Borrower” does not refer to the $500,000 loan, there is no other payment under the Loan Agreement that it can refer to. (b)     The nature of the agreement: it is called a loan agreement and the preamble states that the lender had agreed to grant the borrower a “credit facility”. (c)     Article 2.1 provides for the making of an “Advance … by way of a loan”. (d)     Article 3 provides that no interest is payable on the loan unless Maxz commits a breach of the Loan Agreement. This favours the interpretation that there is a time limit to the loan. 15     The next part of the Loan Agreement pertains to the consequences of failure to repay by the due date, 20 November 2006. Article 3 provides that interest is not payable on the loan unless“the Borrower commits a breach of this Agreement”. It was not disputed that Maxz did not make repayment of the loan by 20 November 2006 and an ED had occurred. It was also not disputed that Shen had made subsequent verbal demands for payment and that, until 28 June 2007, Maxz had failed to tender any payment upon those demands. By Maxz’s failure to repay on 20 November 2006, a breach had occurred and so interest became payable after that date. However there is no provision in the Loan Agreement for the quantum of interest and I would hold that the parties intended that Maxz is to pay a reasonable rate of interest. 16     Article 9.1(a) provides that failure by Maxz to pay “when demanded or when otherwise due and payable the amount which the Borrower [is] obligated to pay hereunder” is an ED. As the $500,000 loan was due and payable by 20 November 2006 and it was not paid on that date, an ED had occurred at the end of that day. 17     Article 9.2 provides in the following manner the two consequences of an ED: (a)    If any Event of Default shall occur … the Lender may … declare the outstanding principal amount … together with accrued interest … to be immediately due and payable … (b)    Alternatively but at the sole discretion of the Lender, the Borrower shall be deemed to have fully performed all of its obligations hereunder by the transfer of 674,800 of all the shares that it holds in the Company to the Lender … 18     It can be seen that Art 9.2(a) provides that an ED shall entitle the lender to declare the outstanding principal amount plus interest immediately due and payable. This means that upon such a declaration, whatever outstanding principal amount that is not due and payable would become due and payable on the date of the declaration. No ED occurred before the $500,000 loan became due and payable on the date fixed for repayment, 20 November 2006. After that date, the loan became due and payable and so Art 9.2(a) was not relevant. 19     Article 9.2(b) is the more interesting provision. Shen contended that this gave him, upon the occurrence of an ED, the option to require Maxz to transfer 674,800 shares in lieu of repayment of the $500,000 and accrued interest. Therefore in this action he claimed for an order of specific performance. However I am unable to construe such an option from the words of Art 9.2(b). What this provision does is to“deem”the borrower“to have fully performed all of its obligations hereunder by the transfer of the … shares”, with the proviso that the lender must agree to it. But nothing in this or any other provision stated that Shen had the right to demand the 674,800 shares in lieu of the $500,000. Nor was there anything in the Loan Agreement that obliged Maxz to transfer the 674,800 shares at the instance of Shen. The position submitted by Shen can be a very draconian one and cannot be inferred from the provisions in the Loan Agreement. If there were an intention to give Shen such an option, it would not have been difficult to state so explicitly. Shen’s contentions has its root in the opening words of the provision:“Alternatively but at the sole discretion of the Lender, …”. However instead of going on to state that Shen may require the transfer of the 674,800 shares, it merely stated that Maxz would be “deemed to have fully performed all of its obligations” by the transfer of the 674,800 shares. In my view the proper construction of this provision is that with Shen’s agreement, Maxz may transfer 674,800 shares in discharge of its obligations under the Loan Agreement to repay the $500,000 plus any interest that may have accrued and I so hold. 20     Maxz’s position was that the 289,200 shares was provided as security for the $500,000 loan, which Shen would be obliged to return if the loan were repaid. It was not consideration for the $500,000 loan. It was a position that was not only not supported on any possible construction of the Loan Agreement, but did not accord with the situation that Seeto was facing at the time. Maxz’s alternative position was that the consideration of 289,200 shares for a 12-day $500,000 loan was void or unenforceable on grounds of unenforceability. This was also a position not supported by the evidence. I have set out above the facts relating to the situation confronting Seeto at the time. He was in desperate need for the $500,000 without which the Project could be in jeopardy. He was mulling over an offer from PGB which would require him to relinquish 20% of the shares of TR albeit with a share swap, or a mere 6% if he accepted Shen’s offer. There was nothing in the circumstances that made the transaction unconscionable and, in taking this position, Seeto was clutching at straws. Maxz argued that the value of the 289,200 shares far exceeded the $500,000. However if he did not procure the IGB in time, the value of the entire project may well be zero. Seeto was in a position where he was quite prepared to trade the proverbial kingdom for a horse.",
        "Rectification": "21     Shen’s case was that even if this were the proper construction of Art 9.2, it was not the true intention of the parties and they had intended that Shen had the option to elect to receive 674,800 shares in lieu of cash payment. Shen amended his statement of claim to pray for a rectification of the Loan Agreement. 22     Where a contract has, by reason of a mistake common to the contracting parties, been drawn up so as to militate against the terms intended by both as revealed in their previous oral understanding, the court, exercising its equitable jurisdiction, will rectify the contract so as to carry out such intentions so long as there is an issue between the parties as to their legal rightsinter se: seeChitty on Contracts, vol 1 (Sweet & Maxwell, 29th ed, 2004) at para 5-092. The following are the general principles regarding rectification: (a)     There must be an “outward expression of accord” in relation to the particular provision. It is not necessary to show that there was a binding agreement prior to the execution of the written document, but it must be shown that parties had a continuing intention with regard to that provision down to the execution of the written contract – seeJoscelyne v Nissen[1970] 2 QB 86. (b)     The burden of proof is on the party seeking rectification and there must be very clear distinct evidence that there was a different intention from the contract document at the time the contract was entered into – seeTucker v Bennett(1887) 38 Ch D 1,Joscelyne v Nissen[1970] 2 QB 86. (c)     The denial of one of the parties that the deed as it stands is contrary to his intention will have considerable weight, and unless the other party can convince the court that the document does not represent both parties’ intentions at the time of execution, rectification will only be ordered exceptionally. It is not sufficient to show that the written contract does not represent the true intention of the parties, it must be shown that the written contract was actually contrary to the intention of the parties – seeLloyd v Stanbury[1971] 1 WLR 535. (d)     There must be a literal disparity between the terms of the prior agreement and those of the document which it is sought to rectify. InFrederick E Rose (London) Ltd v William H Pim Junior & Co Ltd[1953] 2 QB 450, the parties entered into an oral agreement for the purchase of horsebeans, in the belief that they were “feveroles”, and a subsequent written agreement embodied the same terms. The Court of Appeal refused rectification as both the oral and written agreements were for horse-beans; there was no literal disparity between them. Denning LJ said at 461: Rectification is concerned with contracts and documents, not with intentions. In order to get rectification it is necessary to show that the parties were in complete agreement on the terms of their contract, but by an error wrote them down wrongly; and in this regard, in order to ascertain the terms of their contract, you do not look into the inner minds of the parties – into their intentions – any more than you do in the formation of any other contract. 23     Shen submitted that he was entitled to rectification of Art 9.2(b) on the grounds that: (a)     There was a prior concluded (oral) agreement or alternatively continuing common intention between the parties up to the moment they executed the Loan Agreement that Shen would have the right at his sole discretion to require Seeto to transfer the 674,800 shares to him upon Seeto’s default in repaying the loan. (b)     The Loan Agreement does not conform with or reflect correctly that prior concluded agreement or common intention. 24     However although the evidence showed that Seeto had agreed to part with a further 14% of shares in TR under certain circumstances, it should be noted that: (a)     Seeto did not agree that Shen was given the sole right to elect to take the 674,800 shares in lieu of repayment. (b)     On Shen’s own case, the Loan Agreement was drafted by a solicitor jointly instructed by Shen and Seeto. It is not known what the discussion was with the solicitor as to the intention of the parties in respect of the 674,800 shares. That is crucial because whatever Shen and Seeto may have agreed to prior to meeting up with the solicitor to instruct him, their positions may have changed at the moment the instructions were given. In the event, the solicitor was not called to give evidence of this and we are left with a written document with the words as found in Art 9.2(b). In the circumstances, I find that Shen has not discharged the burden of proof on him and dismiss his claim for rectification.",
        "Costs": "25     On the question of costs, I took into consideration the fact that Shen’s principal claim is for the 674,800 shares in TR which he failed to make out. The greater part of the evidence pertained to this aspect of the claim. His claim for the debt of $500,000 was only a minor part of the consolidated action. Counsel for Maxz disclosed that it had in fact paid into court the sum of $500,000 on 10 July 2007. Although the amount paid into court would be insufficient to cover the entire judgment sum as my judgment includes an order for interest on the debt, nevertheless it is a relevant factor in any consideration of costs. In the circumstances, I considered that an order for costs in Shen’s favour reduced to 75% would be the appropriate order to make."
    }
}