{
    "case_title": "Calwealth Properties Pte Ltd v Management Corporation Strata Title Plan No 562",
    "ncitation": "[2009] SGHC 108",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Originating Summons 688 of 2007": "4       In OS 688, Calwealth sought to invalidate the following resolutions of the MCST: (a)     Resolutions 3.1, 3.2 and 4.1 passed at the EGM on 4 January 2007 pertaining to the appointment of professional consultants for the upgrading and approval of an upgrading budget of S$3,500,000. (b)     Resolutions 4.1, 5.1 and 6 passed at the EGM on 5 February 2007 authorising MCST Council Members to negotiate prices and award tenders for the upgrading, approval of transfer of approximately $400,000 of the management funds to the sinking fund, and approving the use of such funds for the upgrading works so that the subsidiary proprietors would only be required to contribute S$3,100,000 out of the approved upgrading budget of S$3,500,000. (c)     Resolutions 7.1, 7.2 and 7.3 passed at the EGM on 5 February 2007 levying of contributions on subsidiary proprietors in proportion to the respective share values of their strata units. 5       In the same OS, Calwealth sought the following orders: (a)     that the MCST be restrained from carrying out any further upgrading works; (b)     a declaration that Calwealth is not required to make any further payments in pursuance of the above resolutions; (c)     that the MCST refund all monies paid by Calwealth to the MCST pursuant to the said resolutions with interest; (d)     that the MCST do, within 7 days, furnish all documents relating to the upgrading works; and (e)     that the costs and expenses of the upgrading works be borne personally, jointly and severally, by the natural persons who had signed the contracts relating to the upgrading works. 6       On 4 July 2007, Judith Prakash J (“Prakash J”) heard the parties, dismissed Calwealth’s application and ordered that Calwealth pay the MCST’s legal costs of S$10,000 and reasonable disbursements. Calwealth did not appeal against this decision and duly paid its contributions as levied under the above resolutions.",
        "STB 49 of 2008": "7       Some 11 months later, on 6 June 2008, Calwealth filed the Application to the STB, which prayed for the following: 1       An order that the upgrading works done by the Respondents were not duly authorised by subsidiary proprietors in accordance with the Building Maintenance And Strata Management Act 2004. 2       That the resolutions passed at the following meetings are invalid or be invalidated under section 103 of the Building Maintenance And Strata Management Act 2004 (i)     Extraordinary General Meeting held on 4th January 2007 (ii)       Extraordinary General Meeting held on 5th February 2007. 3       An order that the works undertaken or to be undertaken by the Respondents are not reasonable and/or necessary under section 39(2) of the Building Maintenance And Strata Management Act 2004. 4       The Respondents to bear all costs incurred on the rectification works. 5       Further or in the alternative the Respondents be only allowed to undertake upgrading works which are reasonable and/or necessary and which are to the benefit of all subsidiary proprietors. 6       An order that the Respondents do bear the cost of the unauthorised works or works which were not reasonable and/or unnecessary. 7       In the alternative, the Board vary the contributions levied pursuant to the Extraordinary General Meeting dated the 5th February 2007 on the Applicant and the remaining subsidiary proprietors in a manner according to the benefit derived by the subsidiary proprietors or in such manner as the Board shall think fit under section 108 of the Building Maintenance And Strata Management Act 2004. 8       An order under section 113 of the Building Maintenance And Strata Management Act 2004 that the Respondents do provide information and make available all documents and records relating to the works undertaken by the Respondents to the Applicant. 9       The Respondents pay the Applicants costs of the proceedings before the Board. 10     The Respondents pay the Applicants all legal and consultants’ fees and expenses. 11     Such further or other order as the Board may deem fit. 8       It is to be noted that the grounds for the Application to the STB were substantially similar to the grounds in OS 688,iethat the resolutions passed at the EGM of 4 January 2007 and the EGM of 5 February 2007 were invalid. And the reliefs sought by Calwealth were also identical to those sought in OS 688.",
        "My decision": "9       Before the STB, the MCST argued that the STB should dismiss Calwealth’s Application on the ground ofres judicata. On 17 September 2008, the STB ruled that, unless a Court determined that the STB should assume jurisdiction, Calwealth’s Application would be stayedsine die. Calwealth submitted that this decision by the STB is wrong in that the STB ought to have made a decision one way or another in order that a party dissatisfied on any question of law may bring an appeal to the High Court pursuant to s 98 of the Building Maintenance and Strata Management Act (Cap 30C, 2008 Rev Ed) (“the Act”). Calwealth urged this Court to direct the STB to hear the application or, alternatively, to decide whether Calwealth is precluded from filing the Application on the ground ofres judicataand/or abuse of process. 10     To the extent that the STB ought to have dealt with the Application one way or another, I agree with Calwealth. The STB ought to have made its decision on the matter in order that a dissatisfied party may proceed with its next course of action. 11     However in the present case, I was satisfied that Calwealth’s actions amounted to an abuse of the process of court. In the Application, Calwealth had sought to re-litigate, with the exception of prayer 8, the same issues that had been decided by Prakash J in OS 688 despite there being a binding decision against it. Calwealth is clearly precluded by the doctrine ofres judicatafrom filing the Application. There would be no point, in view of my decision on the issue ofres judicata, to remit the matter to the STB for a decision. Accordingly I was satisfied that, save for one exception, this application ought to be dismissed. The exception pertained to prayer 8 of the Application, asking for an order under s 113 of the Act for the MCST to make available documents and records relating to the works undertaken. This matter was not the subject of OS 688 and therefore the STB had jurisdiction to hear and determine it, and I ordered accordingly. 12     As Calwealth had substantially failed in this OS, I ordered costs against them fixed at $5,000 plus reasonable disbursements."
    }
}