{
    "case_title": "Tan Rui Leen Russell v Public Prosecutor",
    "ncitation": "[2009] SGHC 102",
    "coram": "Chan Sek Keong CJ",
    "sections": {
        "Introduction": "1       This is an appeal against the sentence of four years’ imprisonment and eight strokes of the cane imposed on the appellant, Russell Tan Rui Leen (“the Appellant”), by the district judge (“the DJ”) inPP v Russell Tan Rui Leen[2008] SGDC 379(“the GD”). The Appellant had pleaded guilty to one charge of voluntarily causing grievous hurt by dangerous weapons or means, which is punishable under s 326 of the Penal Code (Cap 224, 1985 Rev Ed) (“PC 1985”) as follows: Voluntarily causing grievous hurt by dangerous weapons or means. 326.  Whoever, except in the case provided for by section 335 [vis-à-viscausing grievous hurt on provocation], voluntarily causes grievous hurt by means of any instrument for shooting, stabbing or cutting, or any instrument which, used as a weapon of offence, is likely to cause death, or by means of fire or any heated substance, or by means of any poison or any corrosive substance, or by means of any explosive substance, or by means of any substance which it is deleterious to the human body to inhale, to swallow, or to receive into the blood, or by means of any animal, shall be punished with imprisonment for life, or with imprisonment for a term which may extend to 10 years, and shall also be liable to fine or to caning.",
        "The facts of the case": "2       The Appellant is a 40-year-old Chinese male. At the time of his arrest and prosecution, he had been married to the victim, Goh Hwee Suan (“Goh”), for six years, and the couple (“the Couple”) had two sons aged five and two (referred to hereafter as, respectively, “the elder son” and “the younger son”, and collectively as “the Children”). The Appellant was then working as an investment analyst and, until this conviction, had no antecedents. At around 6.30pm on 30 September 2007, the Appellant stabbed and slashed Goh during a quarrel at their matrimonial home (“the Flat”); the attack (“the Incident”) eventually left Goh with over 80 scars. The Appellant’s neighbour (“the complainant”) tried to intervene and called the police when the Appellant did not stop attacking Goh. The Appellant was subsequently arrested and charged as follows: [Y]ou, on the 30thday of September 2007, at or about 6.30 pm, at Blk 409 Pasir Ris Drive 6, #07-409, Singapore, did voluntarily cause grievous hurt to one Goh Hwee Suan, by means of a knife with an 18 cm long blade, an instrument which, used as a weapon of offence, is likely to cause death, to wit, by using the said knife to stab and slash the body of Goh Hwee Suan, and you have thereby committed an offence punishable under Section 326 of the Penal Code, Chapter 224 [ie, PC 1985]. 3       The Appellant pleaded guilty to the offence charged and admitted unreservedly to the statement of facts tendered by the Prosecution (“the Statement of Facts”). The relevant paragraphs of the Statement of Facts read as follows: 4.    On 30 September 2007 at about 6.34pm, the complainant called for police assistance [stating] that ‘There is a lady who is dying here. She has been stabbed a few times with a knife. Send the police here.’ The incident location given was the [Flat]. 5.    Investigations revealed that on the same day at about 6pm, while [Goh] was watching television in the living room with [the Couple’s] children, the [Appellant] confronted [Goh] over some family issue and a dispute subsequently broke out between them. 6.    [Goh] wanted to leave the [Flat] and picked up her house keys to open the pad lock [sic] to the gate. However, the [Appellant] stood in front of her and questioned her as to where she was going. As [Goh] was unable to get past the [Appellant], she then walked into the kitchen to prepare dinner. Whilst doing so, [Goh] made a call to the police [stating] that the [Appellant had] refused to let her leave the [Flat]. 7.    Upon hearing this, the [Appellant] got angry and pulled [Goh’s] hair from the back. The [Appellant] then grabbed a knife from the kitchen counter and started stabbing [Goh] over her chest and shoulder. The [Appellant] also slashed [Goh] over her arms and legs. When the [Appellant] realised that the knife was bent, he threw it aside and picked up a larger knife. The [Appellant] then continued stabbing and slashing [Goh]. [Goh] pleaded with the [Appellant] to stop but her pleas were ignored. 8.    At about 6.30pm, the complainant heard [a] loud commotion from the [Flat] and decided to go over to check. He saw a set of keys hung in the keyhole of the pad lock [sic] to the gate of the [Flat]. The complainant then opened the gate and entered the [Flat]. Therein, he saw [Goh] squatting on the kitchen floor in a pool of blood and the [Appellant’s] back facing him. 9.    As the complainant walked towards the kitchen, the [Appellant] turned and faced him. The complainant saw that the [Appellant was] holding a knife in his knife [sic]. At this time, [Goh] then uttered some words which the complainant could not make out. The [Appellant] suddenly turned towards [Goh] and stabbed [her] back three times. The complainant tried to talk to the [Appellant] to ask him to stop but the [Appellant] walked towards the complainant holding the knife in his right hand at face level. The complainant then fled towards his [home] and called for police assistance. 9.    [sic] Whilst the [Appellant] was distracted by the complainant, [Goh] took this opportunity and escaped into the kitchen toilet. However, the [Appellant went] into the toilet and continued stabbing and slashing [Goh]. At one point, the [Appellant] attempted to saw [Goh’s] neck with the knife but [Goh] managed to push [him] away. The [Appellant] then used his leg to step on [Goh’s] neck but [Goh] put up a struggle and kicked [him] in the groin. The [Appellant] then stopped his attack and left. 10.    Shortly after, the [Appellant] returned to the toilet. [He] then said [Goh] was still alive and he continued stabbing and slashing [her]. At this juncture, the … elder son came and told the [Appellant] to stop but the [Appellant] replied … ‘No, she must die, she must not live, I must kill her.’ The [Appellant] then continued to stab and slash [Goh]. [emphasis in original] 4       The Appellant’s counsel made the following points in the mitigation plea before the DJ (summarised at [5] of the GD): (i)    The [Appellant] had pleaded guilty, thus saving time and costs for all [the] parties concerned[;] in particular, he wanted to avoid any more distress to [the] [C]hildren and [Goh] … by not having them re-live the [I]ncident as witnesses [at] the hearing. (ii)  The [I]ncident arose out of a history of deep marital discord during which the [Appellant] had to endure spousal abuse. (iii)  There was provocation by [Goh] especially [vis-à-vis] the day’s events leading to the incident in question. In particular, on the day prior to the [I]ncident, [Goh] had called the [Appellant] a liar and [had] told [the elder] son … lies about the Appellant, which caused the [Appellant] to be extremely upset and worried about the effect of the statements on [the elder son]. The quarrel continued to escalate with [Goh] daring the [Appellant] to kill her. The [Appellant] managed to walk away from the taunt. The next day, [Goh] refused to retract statements that she [had] made of the [Appellant] and instead said that they were true and added two more lies about the [Appellant], in particular, that he [had] threatened to kill himself, which caused the [Appellant] to be extremely stressed and agitated as he was worried about [the elder son] who had previously expressed suicidal thoughts. The history of abusiveness by [Goh] aggravated and intensified the provocation on the day in question. (iv)  The [I]ncident was not pre-meditated as it arose out of a sudden and intense argument between the [Appellant] and [Goh]. The [Appellant] was still at the scene and in a daze when the police arrived. (v)    The [Appellant] fully co-operated with the police and was forthcoming during investigations. (vi)  The [Appellant] is not a threat to society. He would benefit from supportive counselling as recommended by the [Institute of Mental Health] psychiatrist, Dr Jerome Goh. Furthermore, Dr Douglas Kong [of The Psychiatric & Behavioural Medicine Clinic (Ang & Kong) at Mount Elizabeth Medical Centre] is of the view that the [Appellant] needs help to cope with stress and to handle relationships, for which the [Appellant] was already seeking help from the Marine Parade Family Service Centre at the time the plea of guilt was taken. (vii) The [Appellant] is deeply remorseful. 5       A total of four medical reports (“the Medical Reports”) were tendered in evidence as part of the Prosecution’s and the Appellant’s respective cases. Collectively, the Medical Reports stated that Goh’s provocative actions on the day of the Incident had a severe impact on the Appellant’s mental state. Dr Jerome Goh Hern Yee (“Dr Jerome Goh”) from the Institute of Mental Health, in his medical report dated 22 October 2007, considered the Couple’s marital history, which he described as “marked by frequent quarrels, which [had] escalated in frequency and severity”.[note: 1]He noted that on both the day prior to the Incident and the day of the Incident itself, “[Goh had] accused [the Appellant] of touching their former maid, and [had] told the [C]hildren [that] he [had] small genitalia and that he fantasized about boys”.[note: 2]From his interview with the Appellant, Dr Jerome Goh recognised that:[note: 3] [The Appellant] felt [that Goh] was destroying the [C]hildren and [that] he had to protect the [C]hildren. He said [that, during the Incident,] he didn’t know if he intended to kill [Goh], saying that “nothing was going through [his] mind”. Dr Jerome Goh concluded that the Appellant’s actions on the day of the Incident were the result of “an acute stress reaction, which occurred in a background of chronic marital discord”.[note: 4] 6       In his second medical report dated 17 July 2008, Dr Jerome Goh commented that:[note: 5] [The Appellant] has no past history of violence apart from this offence. He grew up in a nuclear family with no significant maladjustments in his early years. History from his family during his remand did not suggest [that] he is someone who is prone to impulsivity or physical violence. … … … [T]he [Incident] … occurred in the context of a highly conflictual marital relationship during a period of stress, and [the Appellant] is likely to experience stresses in several areas of his life in future. Dr Jerome Goh thus recommended “regular counse[ll]ing to help [the Appellant] manage his stress and cope with the major changes in his life”.[note: 6] 7       Dr Douglas Kong Sim Guan (“Dr Douglas Kong”) from The Psychiatric & Behavioural Medicine Clinic (Ang & Kong), in his medical report dated 26 December 2007, likewise set out the Couple’s tumultuous marital history as well as the Appellant’s account of the events leading up to the Incident (which will be considered in further detail below at[11]–[24]). Dr Douglas Kong reported that:[note: 7] An evaluation of [the Appellant’s] mental state at the time of the … [I]ncident indicated that [the Appellant was in] a dream-like [state] which he variously described as feeling blank, trance-like and [being on] “autopilot”. In the context of the disputes on the night of the [Incident] and in the context of his marital difficulties, it is likely that [the Appellant] was in a state of intense stress and pressure. His autonomic nervous system was highly aroused and this led to a hysterical state in which his nervous system attempted to block off the excessive stimulation. This led … neurologically [to] the frontal cortex [being] bypassed, and as emotional states predominated, [the Appellant] had delusions of paranoia when he felt that [Goh] would be harmful and a threat to [the] [C]hildren. … … The emotional brain acted as if in reflex action to protect, and in [the Appellant’s] case, paranoid beliefs about [Goh] being a threat to [the] [C]hildren supervene[d] and he stabbed [Goh] several times. It was [obvious] … that [the Appellant’s] cognitive capacity was not in control and [the Appellant] was just reacting to the stress as a reflex action of the emotional brain to a perceived threat. … … … The emotional brain took over with the increasing amounts of stress [which the Appellant] experienced, and a Paranoid Reaction took over with [the Appellant having] a hysterical quality of being not in control and [being] in a dream-like autopilot state. Thus, his actions [in] stabbing [Goh] can be understood as an emotional reflex to [his] beliefs about [Goh] being harmful to him and [a] threat to [the] [C]hildren. 8       Dr Lim Yun Chin (“Dr Lim”) from Raffles Hospital, in his medical report dated 6 February 2008, opined that:[note: 8] … [Goh] knew with accurate precision how to bring out the worse [sic] in [the Appellant] (who reacted like a “loose cannon”) and she constantly “succeeded.” … [The Appellant] was completely taken aback by the sudden provocation [on the day of the Incident]. It was a very serious provocation because [Goh] deliberately intended that [the elder] son would have a very negative (untrue) image of his father and that [the Appellant] would lose his authority over [the elder] son. … … I am of the opinion that there was sudden and grave provocation at the time of the offence. It was sudden because [the Appellant] mistakenly believed that [he and Goh had] reconciled [after the previous day’s quarrel] and never expected that [Goh] would deliberately repeat her lies for the [elder son] to hear again. The nature of the provocation was grave because [the Appellant] believe[d] that [Goh’s false remarks] would have an adverse effect on the [elder son’s] mental development if [they were] not rectified. The provocation deprived [the Appellant] of his self-control and [that loss of self-control] emerged in the context of a physical fight. There was no premeditation.",
        "The DJ’s decision": "9       The DJ was of the view that the court had to take a harsh stand against violent spouses by imposing a deterrent sentence on the Appellant. She cited (at [33]–[35] of the GD) three cases in support of her stance,viz,PP v N[1999] 4 SLR 619,Wong Leong Chin v PP[2001] 1 SLR 146andPP v Luan Yuanxin[2002] 2 SLR 98. The DJ focused on the severity of the injuries suffered by Goh and the Appellant’s persistence in attacking her notwithstanding the complainant’s intervention. With regard to the Appellant’s submission on provocation by Goh, the DJ expressed the view (at [41] of the GD) that she “did not think that the [Appellant’s] cruel and violent actions were justified when [the Appellant] persistently attacked [Goh] to vent his pent-up frustrations on her”. She emphasised (at [42] of the GD) that “[Goh] did not physically assault or abuse the [Appellant] prior to or on the day in question”. The DJ also largely disregarded the Appellant’s mental state for the purposes of sentencing. She stated (at [43] of the GD) that she “did not think that the [Appellant’s] inability to handle stress … was in any way … a mitigating factor, especially in the context of the serious offence that [the Appellant] had committed”. 10     The DJ sentenced the Appellant to four years’ imprisonment and eight strokes of the cane, without a fine. The Appellant appealed against the sentence on the ground that it was manifestly excessive, given the circumstances in which he committed the offence.",
        "The appeal": "",
        "The Appellant’s version of the material events": "11     On appeal, the Appellant appeared in person and made a long oral submission (much of which was recorded in a 68-page written submission tendered to the court) setting out in minute detail the numerous occasions during the Couple’s married life on which Goh had physically and verbally abused him in front of the Children; the Appellant also stated how Goh had abused the various maids in their employment. The incidents recounted by the Appellant are too numerous to list. Of particular relevance to the present appeal and deserving of this court’s attention, however, is the four-day period starting from 14 August 2006 (“the PPO period”), the day on which the Appellant obtained a personal protection order (“PPO”) against Goh (“the August 2006 PPO”). 12     On 14 August 2006, Goh, incensed by news of the August 2006 PPO, stormed out of the Flat with the elder son. She returned the next day (ie, on 15 August 2006) to try to take the younger son away. At the time, the Couple’s maid (“the maid”) was carrying the younger son and, seeing that Goh was so upset, refused to let go of the child. Goh scratched the maid on the neck, leaving an 8cm scratch mark. She continued on her rampage and went on to smash the crockery in the Flat. After Goh left, the Appellant took the maid to make a police report against Goh, as well as to Changi General Hospital for treatment. 13     Goh returned to the Flat again over the next two days (ie, on 16 and 17 August 2006) to create more trouble. On 17 August 2006, when Goh arrived at the Flat, she found her mother-in-law there. The Appellant’s mother was visiting because she had heard about the Couple’s marital situation. Goh smashed more crockery and then ran away after snatching her mother-in-law’s mobile telephone. The Appellant reported this to the police. Goh returned a few hours later and got into yet another tussle with her mother-in-law while trying to take the younger son away. The Appellant tried to help his mother and, in the process, was attacked by Goh. He received scratches to his body and injuries to his genitals. The Appellant’s injuries are documented in a medical report from Changi General Hospital dated 17 August 2006. 14     The Appellant claimed that Goh, apart from inflicting such physical, verbal and emotional abuse on him, had in the 14 months leading up to the Incident made numerous false police reports against him, accusing him of molesting, raping and exposing his genitals to the maid. According to him, Goh had filed almost 20 false police reports against him from 31 July 2006 to 30 September 2007. No action, however, was taken against him by the police. 15     These episodes of marital discord took a toll on the mental health of the elder son, who started to exhibit suicidal tendencies in mid-August 2007. Among other things, he would take a pair of scissors and point it to his temple, saying, “I’m going to cut my head right off!”;[note: 9]he would also threaten to jump off a building. The elder son was taken to see a child psychiatrist. From that time onwards, the Appellant was particularly concerned about the effect of his quarrels with Goh on the elder son. 16     It was against this backdrop of alleged persistent spousal abuse that the Appellant finally lost his self-control on 30 September 2007 after nearly losing his self-control the day before (ie, on 29 September 2007). His version of the events which took place on 29 September 2007 was as follows. At around 1.00pm on that day, the Couple were quarrelling about the Appellant’s attempt to persuade the elder son to attend chess class. In the midst of all this, the elder son was crying. Goh suddenly turned to the elder son and said, “Your father has a small penis!”[note: 10]The Appellant retorted by saying that Goh was a “stinking liar”.[note: 11]Goh then went on to tell the elder son, “Your father fondled the maid’s breasts”[note: 12]and gesticulated to dramatise this. By this time, the elder son had gone from crying to giggling, causing the Appellant to become very worried about the elder son’s mental health. 17     Goh then told the elder son, “Your father called his mother mad”[note: 13]and “Your father fantasizes about boys and if you become gay, you know who to blame!”[note: 14]Upon hearing this statement, the Appellant picked up two piles of cutlery, including knives, and held the knives with their blades pointing to the floor. Goh rushed up to him and slammed her chest against his, screaming into his face, “You want to kill me? Go ahead! Try it! Let’s see if you have the balls!”[note: 15]The Appellant put away the cutlery and apologised to Goh. They made up and, later that night, even went out for dinner. It was then that Goh agreed with the Appellant that the statements which they had uttered in front of the Children could be very damaging for their mental development. 18     The next day (ie, on 30 September 2007), at around 6.30pm, the Appellant approached Goh to ask her to tell the Children that the statements which she had made the previous day were untrue. To his surprise, she replied, “But it’s true! Youdohave a small penis!”[note: 16][underlining in original]. She turned to the elder son and started repeating (inter alia) that particular statement. The Appellant asked her to stop, but she refused. The Couple started quarrelling and Goh then said to the elder son, “Your father threatened to kill himself!”[note: 17]The Appellant was speechless with anger and was extremely worried for the elder son, who had only recently exhibited suicidal tendencies (see[15]above). He shouted at Goh and said, “You’re mad, that’s what you are!”[note: 18] 19     Goh made as if to leave the Flat and told the Appellant to get out of the way. The Appellant pleaded with her to stop escalating their quarrel, but the latter responded by making a call on her mobile telephone, saying, “Hello police?”[note: 19]Startled upon hearing this, the Appellant kicked the mobile telephone out of Goh’s hand. According to him, Goh “gleefully claimed that [he] had hit her hand and that she was going to wait for it to bruise [and] show [it] to the police”.[note: 20]She then picked up her mobile telephone and went into the kitchen to prepare dinner for the Children. The Couple continued quarrelling in the kitchen, with the Appellant insisting that Goh tell the Children that what she had said the previous day was untrue. Goh screamed at the Appellant and then picked up the telephone to call the police again. She told the police that the Appellant had rushed at her with a knife the previous day (ie, on 29 September 2007) and that she wanted to “report him and divorce him and get a PPO”.[note: 21] 20     Upon hearing the word “PPO”, the Appellant was “gripped by panic and [his] mind went blank”.[note: 22]He started slashing and stabbing Goh “uncontrollably”[note: 23]with a knife which he picked up from the kitchen counter. When that knife became bent from the slashing and stabbing, he dropped it, picked up another knife and continued his attack on Goh.",
        "My evaluation of the Appellant’s case": "The veracity of the Appellant’s version of the material events 21     The version of the material events given by the Appellant is important in helping the court to understand his state of mind at the material time, as well as how and why he attacked Goh in a frenzy (as baldly recounted in the Statement of Facts (see the passage quoted at[3]above)). The Appellant’s detailed account of the history of family quarrels and spousal abuse was not denied by the Prosecution, which sought instead to emphasise the severity of the injuries suffered by Goh. When asked by this court whether what the Appellant claimed Goh had said about his physical endowment was true, the deputy public prosecutor replied that Goh had taunted him. 22     To support his account of Goh’s actions, the Appellant produced a “Notice Concerning Non-Seizable Case Report” as proof of the police report filed on 15 August 2006 by the maid against Goh (see[12]above). The Appellant also produced records of 11 telephone calls which the Couple had made to the police hotline between 31 July 2006 and 26 August 2007. The records of three of the calls made on 17 August 2006 (ie, during the PPO period) showed that the Appellant had reported that Goh was causing trouble by breaking things in the Flat and had taken his mother’s mobile telephone. As for Goh’s calls to the police hotline, the records showed that, in a call made on 31 July 2006, Goh had alleged that the Appellant had exposed himself to and molested the maid. No action was taken against the Appellant pursuant to this report. 23     The Appellant also requested the Prosecution to produce the other 20 or so police reports made by Goh in the 14 months leading up to the Incident (see[14]above) as well as the police report made by Goh on her mobile telephone just before she was attacked by the Appellant (“Goh’s last police report”) (see[19]above). This request appeared to have been ignored (in any case, the Prosecution did not tell the court why those police reports were not produced). Be that as it may, in my view, the records which were produced to the court supported to a considerable extent the Appellant’s account of the history of Goh’s verbal abuse in the form of,inter alia, accusations against the Appellant which, from his perspective, were false and unwarranted. 24     In the circumstances, it is reasonable to conclude that the Appellant did not make up a story of provocation in order to minimise the gravity of the Incident, which left Goh with serious injuries. In any case, the Medical Reports support his version of the circumstances that caused him to attack Goh in the manner which he did on 30 September 2007. 25     I turn now to consider the weight to be given to the Appellant’s mitigation plea for sentencing purposes. The provocation which led to the Incident ought not to have been disregarded 26     The Statement of Facts in the present case contains no facts which can be relied on as mitigating circumstances. It gives the court a clinical account of the Appellant’s frenzied attack on Goh, but does not explain why it happened; it says nothing about the background events that led to the Incident. It may be that the function of an agreed statement of facts is merely to set out the bare facts essential to show that the offence charged has been committed, with any other assertion above and beyond that purpose to be left for mitigation. However, in the present case, the Prosecution had been made aware of many of the Appellant’s allegations relating to spousal abuse by Goh and the matrimonial friction between the Couple. The Appellant had on two separate occasions made representations to the Attorney-General’s Chambers to reduce the charge against him (viz, the charge that he had committed the offence under s 326 of PC 1985 of voluntarily causing grievous hurt by dangerous weapons or means (“the s 326 offence”)) to one of having committed the less serious offence of either voluntarily causing hurt on provocation under s 334 of PC 1985 or causing grievous hurt on provocation under s 335 of PC 1985 (“the s 335 offence”). What the Appellant had disclosed (or alleged) to the Prosecution in his representations was essentially what he had told the DJ and this court. 27     In the court below, the DJ did not consider it necessary to direct the Prosecution to produce the 20 or so police reports that Goh had made against the Appellant in the 14 months leading up to the Incident (see[14]above), including Goh’s last police report (see[19]above), which reports collectively lent some support to the account given by the Appellant of what had caused him to go berserk on 30 September 2007. As mentioned earlier (at[9]above), the DJ also largely discounted the Appellant’s mental state for sentencing purposes and concluded that the Appellant should not have lost his self-control at the time of the Incident, especially since Goh had neitherphysicallyabused nor assaulted him on that occasion. In my view, the DJ erred in this respect. Physical abuse is not the only way, nor is it even the easiest way, of provoking a person (“the targeted party”). It is common experience thatverbalabuse can sometimes be more enraging and explosive as a form of provocation than physical abuse, depending on the nature and the intensity of the verbal abuse in question as well as the occasion on which it is inflicted on the targeted party. Some kinds of verbal abuse, compared to physical abuse, can also cause greater distress and humiliation to the targeted party; in addition, they may provoke the targeted party to react against such abuse, sometimes violently. That is why some kinds of insults are criminalised by the law (see, for example, the offence under s 504 of the Penal Code (Cap 224, 2008 Rev Ed) of intentional insult with intent to provoke a breach of the peace and the offence under s 13A of the Miscellaneous Offences (Public Order and Nuisance) Act (Cap 184, 1997 Rev Ed) of intentional harassment, alarm or distress). 28     In the present case, given the events leading up to the Incident and the mental background which they created in the Appellant’s mind, there are, in my view, three factors which made Goh’s verbal abuse of the Appellant on 30 September 2007 extremely provocative. First, Goh’s derogatory statements about the Appellant (in particular, the assertion that he had threatened to commit suicide (see[18]above)) were made in front of the elder son, who had started exhibiting suicidal symptoms only a few weeks earlier (see[15]above). The Appellant was extremely worried for the elder son and this amplified the provocative effect of Goh’s statements. Second, Goh’s last police report, when added on to the many police reports which Goh had earlier made against the Appellant (all of which he believed were false and unwarranted), was the straw that broke the camel’s back and caused the Appellant to spontaneously react violently in response to Goh’s conduct. Last, the word “PPO” uttered by Goh just before the Appellant started attacking her reminded the Appellant of his terrifying experiences during the PPO period. These three factors converged at that particular moment immediately before the Appellant’s attack on Goh and snapped the Appellant’s self-control, causing the Appellant to pick up a knife to attack Goh and to continue attacking her until he was stopped. This was totally uncharacteristic of the Appellant for that attack on Goh was the first time that he had physically abused her: this was not contradicted by the Prosecution. 29     Provocation is a relevant mitigating factor even if the strict requirements which must be satisfied to establish grave and sudden provocation are not met (seeYeo Kwan Wee Kenneth v PP[2004] 2 SLR 45at [44]). In the present case, the provocation which sparked off the Appellant’s attack on Goh is a relevant mitigating factor and ought not to have been disregarded in the court below. The DJ ought also to have given greater weight to the damage caused to the Appellant’s self-esteem as a result of Goh’s humiliating remarks on the Appellant’s physical endowment in front of the elder son as well as the long history of spousal abuse by Goh. 30     I recognise that the claim by the Appellant that he had lost his self-control utterly throughout theentire durationof the Incident may not be completely consistent with the fact that, according to the Statement of Facts, he had in the course of the Incident (while the Couple were in the toilet of the Flat) stopped attacking Goh for a short while and had subsequently “returnedto the toilet … and …continuedstabbing and slashing [her]” [emphasis added] (see para 10 of the Statement of Facts (reproduced at[3]above)). However, the Medical Reports, especially the reports by Dr Douglas Kong and Dr Lim, are consistent in expressing the view that Goh’s provocation had a severe impact on the Appellant’s mental state at the material time. According to Dr Douglas Kong, the Appellant was in a hysterical state and on “autopilot”[note: 24]at that time. Dr Lim similarly expressed the view that Goh’s provocation had “deprived[the Appellant] of his self-control”[note: 25][emphasis added]. Consequently, in my view, the recurrence of the Appellant’s attack on Goh after a brief hiatus is not sufficient evidence that the Appellant was not provoked by Goh when he started stabbing her on 30 September 2007. 31     In the present case, the Appellant did not defend the charge brought against him (ie, the charge under s 326 of PC 1985); instead, he pleaded guilty to it. In fact, as can be seen from the mitigation plea dated 22 May 2008 which the Appellant tendered to the DJ,[note: 26]the Appellant instructed his counsel in the court belownotto rely on Dr Lim’s opinion that “there wassudden and graveprovocation at the time of the offence”[note: 27][emphasis added] (although defence counsel did rely on provocationsimpliciterby Goh). Apparently, the Appellant took this course of action because he did not wish to testify about and relive the traumatic events that had occurred (it should also be noted that, if the Appellant had given evidence on the events leading to the Incident, Goh might have been required to do the same). It may be that the Appellant was telling the truth as to why he neither defended the charge against him nor raised the issue of grave and sudden provocation in the court below, or it may be that he was afraid that his testimony on the material events might not be believed – the court will never be able to determine this point. Be that as it may, in view of the Medical Reports and the account given by the Appellant of the material events in his submissions before this court (which account, I should emphasise, was considerably more detailed than the bald version set out in the Statement of Facts), it would be wrong to discount entirely his assertions in this regard. 32     I note that the Appellant’s version of the material events, considered in its entirety, suggests that there wasgrave and suddenprovocation by Goh at the time of the Incident so as to bring the Appellant’s actions within the ambit of the s 335 offence (viz, causing grievous hurt on provocation). The two distinct elements of the test for determining whether an accused acted under grave and sudden provocation at the material time are, first, the subjective requirement that the accused was at that time deprived of his self-control by provocation and, second, the objective requirement that the provocation was grave and sudden (seeMohammed Ali bin Johari v PP[2008] 4 SLR 1058at [90]–[102] andPP v Kwan Cin Cheng[1998] 2 SLR 345at [44]). If indeed the Appellant’s version of the material events were accepted by the court, the Appellant would have satisfied both the subjective and the objective limbs of this test; it would then be open to this court to exercise its powers of revision under s 268 of the Criminal Procedure Code (Cap 68, 1985 Rev Ed) (“the CPC”) and, in view of s 175(2) of the CPC, substitute the Appellant’s conviction for the s 326 offence (viz, voluntarily causing grievous hurt by dangerous weapons or means) with a conviction for a lesser offence, specifically, the s 335 offence (viz, causing grievous hurt on provocation). However, it is neither proper nor possible for me to do that in the present case as not only was the Appellant’s version of the material events not tested by cross-examination in the court below, the Appellant also instructed his then counsel not to rely on grave and sudden provocation as a partial defence to the s 326 offence. 33     Having said that, there is nevertheless no reason why Goh’s provocative conduct that triggered the Appellant’s “acute stress reaction”[note: 28]at the time of the Incident (which provocation cannot be seriously contested on the evidence of the Medical Reports) should not be taken into account for the purposes of sentencing the Appellant for the s 326 offence. In my view, the DJ erred in giving no weight whatsoever to Goh’s provocation merely because she was of the view that Goh’s actions should not have caused the Appellant to attack Goh so violently on 30 September 2007 (see the GD at [41]–[42]). It may be that the Appellant’s attack was disproportionate to the provocation, and that, if Goh had died and the Appellant charged with her murder, the Appellant might not have been able to rely on the alleged provocation to reduce the charge of murder to one of culpable homicide not amounting to murder (see Exception 1 to s 300 of PC 1985). However, for the purposes of sentencing an offender for the s 326 offence, there is no reason why provocation should not be accepted as a mitigating factor. In discounting this factor and sentencing the Appellant to four years’ imprisonment as well as eight strokes of the cane, the DJ effectively regarded the principle of deterrence as the dominant sentencing consideration. In my view, this approach was not correct for the reasons given below. Retribution is the applicable sentencing consideration in this case 34     Where an offence is committed as a result of a loss of self-control brought about by provocation, the culpability of the offender is reduced because, given that he committed the offence concernedwhile deprived of his self-control, he might not (vis-à-visan offence which results in injury to the victim) have intended to cause the extent of the injuries which he in fact caused to the victim. Loss of self-control may be regarded as a form of temporary and transient impairment of the offender’s cognitive judgment. Where provocation has substantially or fully deprived the offender of his self-control, a deterrent sentence, whether in the form of a long term of imprisonment or caning, is pointless. The objective of a deterrent sentence will only be met if the sentence imposed can temper the offender’s propensity to lose his self-control. But, human beings are not angels. Parliament has recognised this by stipulating that grave and sudden provocation is sufficient to reduce the offence of murder to that of culpable homicide not amounting to murder (see Exception 1 to s 300 of PC 1985). For the same reason, the s 335 offence (viz, causing grievous hurton provocation) is only punishable with imprisonment of up to four years and/or a fine of up to $2,000, as opposed to the s 326 offence (the punishment for which is imprisonment for life or for a term which may extend to ten years and, if the court deems it appropriate, either a fine or caning). 35     In the present case, the Appellant committed the offence charged (ie, the s 326 offence) against a domestic backdrop of (inter alia) prolonged marital conflict and verbal abuse which the Appellant believed was harmful to the welfare of the Children, the various maids whom the Couple had employed and himself. Prior to the Incident, the Appellant had neither physically abused nor assaulted Goh, but had instead been on the receiving end of, among other things, derogatory remarks about him in the Children’s presence as well as numerous false and unwarranted (as he perceived it) police reports against him. This led to the build-up of severe mental stress in the Appellant and, in turn, to his loss of self-control on the day of the Incident in the face of yet further derogatory remarks by Goh about him in the presence of the elder son, coupled with Goh’s last police report. Given these factors, retribution is, in my view, the applicable sentencing consideration in this case.",
        "Conclusion": "36     In the circumstances, and for the reasons given above (at[21]–[35]), I find that there is sufficient justification to reduce the sentence imposed on the Appellant, notwithstanding the serious injuries which he inflicted on Goh (in this regard, it is very fortunate that Goh has since recovered to a considerable extent from her injuries). Because of the circumstances and the environment which prevailed at the point when the Appellant lost his self-control and attacked Goh, I do not consider caning an appropriate punishment. Accordingly, the sentence of eight strokes of the cane imposed by the DJ is set aside. As for the custodial sentence of four years’ imprisonment, given that the Appellant is a first offender and given that he committed the offence charged under rather unusual extenuating circumstances, I would reduce it to three years’ imprisonment, which, in my view, is sufficient to reflect the gravity of the injuries suffered by Goh. The sentence imposed by the court below is thus varied accordingly to three years’ imprisonment without caning. _________________ [note: 1]See Dr Jerome Goh’s medical report dated 22 October 2007 (“Dr Jerome Goh’s first medical report”) at p 1. [note: 2]Idat p 2. [note: 3]Ibid. [note: 4]See Dr Jerome Goh’s first medical report at p 4. [note: 5]See Dr Jerome Goh’s medical report dated 17 July 2008 at pp 1–2. [note: 6]Idat p 2. [note: 7]See Dr Douglas Kong’s medical report dated 26 December 2007 (“Dr Douglas Kong’s medical report”) at pp 5–8. [note: 8]See Dr Lim’s medical report dated 6 February 2008 (“Dr Lim’s medical report”) at pp 3–4. [note: 9]See the skeletal submissions which the Appellant filed for the appeal (“the Appellant’s Skeletal Submissions”) at para 165. [note: 10]Idat para 190. [note: 11]Idat para 191. [note: 12]Ibid. [note: 13]See the Appellant’s Skeletal Submissions at para 192. [note: 14]Ibid. [note: 15]See the Appellant’s Skeletal Submissions at para 194. [note: 16]Idat para 209. [note: 17]Idat para 214. [note: 18]Idat para 215. [note: 19]Idat para 217. [note: 20]Ibid. [note: 21]See the Appellant’s Skeletal Submissions at para 220. [note: 22]Idat para 221. [note: 23]Ibid. [note: 24]See Dr Douglas Kong’s medical report at,inter alia, p 5. [note: 25]See Dr Lim’s medical report at p 4. [note: 26]See the Appellant’s mitigation plea dated 22 May 2008 at para 63(iv). [note: 27]See Dr Lim’s medical report at p 4. [note: 28]See Dr Jerome Goh’s first medical report at p 4."
    }
}