{
    "case_title": "Public Prosecutor v Huang Shiyou",
    "ncitation": "[2009] SGHC 118",
    "coram": "Chan Seng Onn J",
    "sections": {
        "The charges taken into consideration": "2       The accused also consented to the following 9 charges being taken into consideration for the purpose of sentencing:- (a)     four charges of aggravated outrage of modesty, under section 354A of the Penal Code; (b)     two charges of criminal intimidation under section 506 of the Penal Code; (c)     two charges of using criminal force under section 352 of the Penal Code; and (d)     one charge of insulting the modesty of a woman under section 509 of the Penal Code.",
        "Facts relating to the 1stcharge": "3       Investigations revealed that on 8th June 2008 at about 6.30 pm, V1 left her aunt's place located at Blk [AAA], for home. While she was at a bus stop near to her aunt’s place, the accused spotted her and followed her when she boarded a SBS no. 18. About three bus stops away, V1 alighted at her bus stop located in front of Blk [BBB] at about 6.45 pm. The accused alighted too. When V1 reached Blk [CCC], she waited for the lift and that was when the accused first appeared before V1. As V1 did not suspect anything to be amiss, she continued to wait for the lift with the accused. 4       When the lift arrived, V1 entered first followed by the accused. V1 pressed the lift button for the 8th floor and noticed that the accused did not press any lift button but stood behind her instead. While the lift was ascending to the 8th floor, the accused suddenly whipped out a penknife and pointed the sharp end at V1’s neck from behind her. His action took V1 by surprise. In English, the accused told V1 not to shout and asked her to squat down as he feared someone might see her through the lift glass panel. V1 complied. 5       When the lift stopped at the 8th floor, they remained in the lift. The accused then pressed the 5th floor lift button. Upon reaching the 5th floor lift lobby, the accused asked V1 to walk out and he followed her from behind. By then, the accused had removed the pen knife from V1’s neck but he was following closely behind her. The accused then directed V1 to walk down the stairs and she complied. Both of them stopped between the 4th and 5th floor staircase landing. 6       At this juncture, the accused told V1 to sit on the staircase and she did. The accused then sat down next to V1. He warned V1 not to shout and then kept the penknife in his pocket. The accused started to touch V1’s breasts with both his hands from outside her t-shirt. After a while, the accused slipped his hands under V1’s t-shirt and pushed her bra up to her chest level. He then touched and sucked her breasts. The accused proceeded to touch her vagina. As V1 was afraid that the accused would harm her, she did not stop him.",
        "Facts relating to the 3rdcharge": "7       A short while later, the accused heard footsteps. He quickly stopped the act and stood up. The accused directed V1 to sit near the wall to hide. After that, the accused told V1 that she was 'very dry' and directed her to perform fellatio on him. V1 refused to do so but relented when the accused insisted as she was afraid that the accused would harm her.",
        "Facts relating to the 4thcharge": "8       After V1 had performed fellatio on the accused for a while, the accused carried V1 back to the original position on the staircase landing. Again, the accused told V1 to lie down and close her eyes. V1 complied as she was afraid the accused would harm her. After she did so, the accused attempted to insert his penis into V1’s vagina but was unsuccessful. V1 could feel something poking her vagina about 10 times. Not long after, the accused stopped and told V1 that 'it was okay'. When V1 opened her eyes, she saw the accused’s penis when the accused was just about to zip up his jeans. After the accused had zipped up his jeans, he left V1 alone and took the lift down. 9       V1 immediately pulled up her panties and skirt and ran down the flight of stairs back to her flat. At that juncture, she started to cry. Upon reaching her flat, at about 7.30 pm, she pressed the door bell. V1’s brother opened the door and she told him that she was raped. V1’s brother promptly contacted V1’s mother, who was at work, and V1’s mother immediately called the police.",
        "Facts relating to the 6thcharge": "10     Investigations further revealed that on 14th March 2008 at about 11.45 am, V2 left her school after a dental appointment. From her school, she walked home alone. As V2 was walking towards her block, she noticed the accused coming out from behind the rubbish bin at Block [DDD]. The accused walked alongside V2 for a short while. V2 continued walking towards the lift lobby of her block at Block [EEE]. 11     When the lift arrived, V2 entered the lift and pressed the 11th floor button. At this juncture, the accused entered the lift but did not press any button. Just as the lift was ascending, the accused turned to face V2 and pointed a penknife at her, telling her in English that she must follow him. When the lift reached the 11th floor, the accused pressed the close door button and then pressed the 5th floor button. When the lift reached the 5th floor, the accused told V2 to follow him to the staircase landing. The accused brought V2 to the staircase landing between the 4th and 5th floor. 12     Subsequently, from the 4th and 5th floor staircase landing, the accused brought V2 into the lift and this time he led her to the 8th floor. At the 8th floor, the accused asked V2 to follow him and they went to the staircase landing between the 8th and 7th floor. There, the accused asked V2 to squat and then he pulled down his pants and underwear. He then asked V2 to perform fellatio on him. V2 refused but the accused insisted. As V2 was afraid that the accused would harm her, she did as told and performed fellatio on the accused for a short while before she started to cry.",
        "Facts relating to the 7thcharge": "13     Even though V2 was crying, the accused ignored it and asked V2 to lie on the floor. V2 followed his instructions as she was afraid that the accused would harm her. When she was lying on the floor, the accused lifted her skirt and touched her vulva from outside her panties. V2 felt uncomfortable and she immediately stood up. This time the accused stopped and brought her to the lift. He pressed for the 1st floor button and when they reached the ground floor, the accused left V2 inside the lift. V2 immediately took the lift back up to her unit. Once she reached home, she informed her father about the incident and he brought her to lodge a police report.",
        "Medical Report on V1": "14     On 9 June 2008, V1 was medically examined at the KK Women’s and Children’s Hospital by Dr. Suzana Sulaiman, who noted there was a 3mm laceration at the perineum (the area between the vulva and the anus) although V1’s hymen appeared to be intact.",
        "HSA Reports": "15     The HSA laboratory tests revealed that the DNA profile of the accused matched the DNA profile obtained from the vaginal and urethral swabs taken from V1. The DNA profile of the accused was also found to match the DNA profile obtained from the seminal fluids found on the panties and skirt of V1.",
        "Medical Report on V2": "16     On 19 March 2008 at 12.15 pm, V2 was examined by Dr. Law Wei Seng at the KK Women’s and Children’s Hospital. V2 informed Dr. Law that on 14 March 2008, a stranger threatened her with a pen knife and forced her to perform oral sex on him and also touched her private part.",
        "IMH Report": "17     The accused was interviewed by Dr. Lee Kae Meng (‘Dr. Lee’), an Associate Consultant of the Institute of Mental Health and Woodridge (‘IMH’). 18     In his report dated 21 August 2008, Dr. Lee stated that the accused informed him that he randomly picked the alleged victims who were alone. The accused informed him that he would first trail his victims into the elevators. He then intimidated them using a penknife with the intention of performing sexual acts on them or to order them to perform sexual acts on him. The accused further informed Dr. Lee that most of his victims were from the primary school next to the bus stop that he alighted at when he returned from camp and he recognised them by their school attire. 19     The accused told Dr. Lee that “a thing” had whispered to him in his head to perform these alleged acts. However, Dr. Lee opined that this “thing” was the accused person’s own voice and was not hallucinatory in nature. The EEG performed on the accused did not reveal any brain seizure activity. Dr. Lee stated that, in his opinion, the accused suffered from Chronic Adjustment Order with depressed mood as a result of the stress he experienced in his military camp since April 2007. Dr. Lee stated that the accused was not of unsound mind at the time of the alleged offences. The accused he knew what he was doing and would have known what he had done was wrong. The accused was fit to plead.",
        "Mitigation plea": "20     In the plea of mitigation on behalf of the accused, defence counsel set out in some detail the background of the accused and the unfortunate life-circumstances that eventually culminated in his committing these offences.",
        "Profile of the accused": "21     The accused (DOB 7 June 1986) was 20 years old at the time he first committed these offences in April 2007. He attended Tampines Primary School, Pasir Ris Secondary School and Temasek Polytechnic. The accused was always an outstanding student, having won several scholarships and bursaries besides consistently emerging as the top student in his class in many of his subjects. 22     Since Secondary 1, his teachers and all others who knew the accused had only positive things to say of him. They had described him as: -       \"soft spoken\" -       \"quiet\" -       \"unassuming\" -       \"very polite\" -       \"disciplined\" -       \"trustworthy\" -       \"highly responsible\" -       \"reliable\" -       \"a model student\" -       \"a good person\" -       \"good character\" and -       \"a fine example of a well-brought up boy\". 23     Testimonials from various persons who had known the accused were attached to the plea of mitigation. Defence counsel submitted that the accused was basically a good person and that it was baffling that he would commit these offences.",
        "Circumstances leading to the commission of the offences": "24     When the accused was 17 years old and in his first year in Temasek Polytechnic, he fell in love with his first girlfriend. As his girlfriend finished work usually between 9.00 p.m. to 10.00 p.m., he would end up keeping late nights almost every day to be with her. As a result, not only was his academic performance affected, his relationship with his family members also deteriorated. 25     His parents were concerned and tried to stop the accused from continuing with the relationship. As this relationship was his first steady relationship with a girl, the accused resisted. In time, his parents who used to dote on their good natured and well-behaved boy thought that he had gone astray. Sadly, they stopped talking to the accused and generally ignored him so that whenever he was home, he was confined to his room. The warmth, joy and love that the accused was accustomed to at home no longer existed. 26     When the accused discovered that his girlfriend was seeing another man, the high price that the accused paid to continue the relationship with her turned out to be for naught. 27     Eventually, his girlfriend left him. The accused was not able to cope with the emotional blow by himself. He had, by then, no one else to turn to for help. His family members had long since stopped talking to him. 28     The accused became very depressed and had even attempted suicide several times. He slashed his wrist and on the last attempt, had it not been for his classmate who managed to stop the accused, he would have jumped off the building. The accused never recovered from this failed first relationship despite two more short subsequent relationships. 29     In the meantime, his relationship at home did not improve. He continued to be ignored and gradually, the accused withdrew into a cold and lonely world of his own. It was very difficult for the young boy who hitherto had always experienced the love and warmth of all who knew him. 30     Later, the accused was enlisted into the army. He did well and was ear-marked for Command School upon completion of his Basic Military Training. He aspired to be an officer and earned himself the recommendation of his superiors and peers in their appraisals. Unfortunately, he contracted chicken pox and could not participate in a few crucial tests necessary for eligibility to join Officer Command School. The accused was instead posted to the Field Defence Squadron, Changi Air Base in January 2007 as a Regimental Policeman. He was soon promoted to Corporal First Class and made the Second-In-Command of the Dog Section, an appointment his Commanding Officer, in his own words, \"is given to the deserving few in the unit who had demonstrated fine leadership qualities, exemplary disciplinary conduct and commendable work ethics.\" 31     The accused's appointment as a second-in-command came with very heavy responsibilities and work demands, and his work hours were long. Defence counsel contended that the accused did his best and performed well but no one suspected that anything was amiss. The accused suffered from depression alone, without the support and help of those he loved, especially his parents. He could not cope. 32     The psychiatrist, to whom the prosecution had sent the accused for examination, found that he was suffering from chronic depression and adjustment disorders. 33     Defence counsel submitted that this young accused person was a fundamentally good person who could be rehabilitated and could still contribute to society upon his release from prison. He asked for mercy on behalf of the accused and pleaded for a sentence that would be of a sufficient penalty but would still give the accused a second chance in life upon his release. 34     For the purpose of determining the appropriate sentence, I had carefully considered the background of the accused, his testimonials and the mitigating circumstances highlighted to me by defence counsel in the mitigation plea including the fact that the accused, who had no previous convictions or antecedents, had pleaded guilty thereby saving the young victims the trauma of testifying in court and reliving their experience again.",
        "Submissions on sentence by the DPP": "35     The prosecution however strongly urged the court to take cognisance of the several aggravating factors present in this case and to impose a deterrent sentence on the accused, which would adequately reflect the severity of the offences he had committed. 36     The prosecution highlighted the following multiple aggravating factors in this case. I agreed with the prosecution that these aggravating factors necessitated a deterrent sentence even after taking into account the mitigating factors and circumstances as set out in the mitigation plea.",
        "Multiple victims and the young age of the victims": "37     The accused deliberately and systematically targeted several young victims that were alone in lifts on their way home, as they would be easily frightened into complying with his sexual demands. The ages of the victims ranged from just 9 to 14. The accused had no regard for the fear, trauma and distress that he had caused to his young victims. The 14 charges against the accused revealed that he had terrorised all his nine victims in a similar manner. 38     The sexual offences committed against the young victims were particularly reprehensible as these victims were in no position to put up any defence against such an attack. The young must be protected against such predatory sexual offenders. The young ages of the accused’s victims and the fact that he preyed on multiple victims justified the imposition of a higher sentence on the accused.",
        "Premeditated offences": "39     The accused committed the sexual and other offences against the nine young victims over a period of 16 months, from April 2007 to July 2008. It was clear that the accused had engaged in this prolonged, persistent and uncontrollable criminal behaviour to satisfy his perverse sexual desires for young girls. 40     From the modus operandi of the accused, it was obvious that he had carefully planned his sexual attacks. He would follow or wait for potential victims at the lift lobby, enter the lift with the young victims and then stand behind them. The accused would also keep a penknife with him and would use it to frighten the young victims into submission. Once he had the young victims in his hands, the accused would then bring the victims to an isolated staircase lift landing and proceed to sexually attack them and force them to comply with his sexual demands. I agreed with the prosecution that these offences committed by the accused clearly did not arise from a moment of weakness but were the calculated actions of a man who was determined to satisfy his perverse sexual desires at the expense of his young victims, whatever the consequences.",
        "Use of a weapon in the commission of the offences": "41     The accused had used a penknife to threaten and frighten the victims V1, V2, V3, V5, and V7 into submission. The accused would have caused great fear and trauma to his young victims when he pointed a penknife at them or at their throats. I accepted the prosecution’s submission that the fact that the accused had used a deadly weapon to commit his offences was another significant aggravating factor to be taken into account.",
        "The outstanding offences": "42     The accused consented to 9 charges being taken into consideration for the purpose of sentencing (‘TIC offences’). InPP v UI, the Court of Appeal stated [at 38] that: “…if there are TIC offences to be taken into account, the effect, in general, would be that the sentence which the court would otherwise have imposed for the offences proceeded with would be increased…This is commonsensical as the offender, by agreeing to have the TIC offences in question taken into consideration for sentencing purposes, has in substance admitted that he committed those offences. This would a fortiori be the case where the TIC offences and the offences proceeded with are similar in nature (eg, if both sets of offences consist of sexual offences against the same victim).” 43     Hence, the large number of TIC offences, of a similar sexual nature committed against multiple victims, should also be taken into account in considering the sentence to be imposed on the accused.",
        "Public interest considerations": "44     The accused had repeatedly terrorised young victims taking lifts on their way home for a period of 16 months. According to the DPP, the police had to expend considerable resources to track down the accused and bring him to justice. 45     I agreed with the prosecution that public interest considerations required that a sentence of general deterrence be imposed on the accused to deter like-minded individuals from committing such sexual offences against children and young persons. 46     I further regarded the accused as a danger to society, especially to young girls, which were his target for his sexual offences. A very long sentence would be called for to put him out of circulation within and for the protection of the community.",
        "Sentences imposed": "47     After considering all the circumstances of the case and having regard to all the mitigating and aggravating factors highlighted to me by defence counsel and the DPP respectively, I imposed the following sentences on the accused: (a)     1stcharge: 5 years and 8 strokes; (b)     3rdcharge: 10 years and 14 strokes; (c)     4thcharge: 10 years and 15 strokes; (d)     6thcharge: 12 years and 16 strokes; and (e)     7thcharge: 6 years and 8 strokes. 48     The imprisonment terms for the 3rd, 4thand 6thcharges were to run consecutively. The sentences for the 1stand 7thcharges were to run concurrently with those for the 3rd, 4thand 6thcharges. The overall sentence, totalling 32 years, was to be backdated to the date of his remand on 5 July 2008 and he would be subjected only to the maximum of 24 strokes of the cane."
    }
}