{
    "case_title": "RecordTV Pte Ltd v MediaCorp TV Singapore Pte Ltd and Others",
    "ncitation": "[2009] SGHC 287",
    "coram": "Andrew Ang J",
    "sections": {
        "Introduction": "1       The plaintiff is the owner, operator and designer of an Internet based service at http://www.recordtv.com (“the Offending Website”), which allows members of the public to request that free-to-air broadcasts be recorded for viewing. Upon receipt of such a request, a copy of that broadcast is made by the plaintiff’s service and the member of the public is able to view the same at his convenience. 2       The defendants are the copyright owners of various broadcasts and films, particularised as follows:  BroadcasterChannelsFirst defendantChannel 5, Channel 8 and Channel USecond defendantCentral and SuriaThird defendantChannel NewsAsiaCollectively, the “MediaCorp Broadcasts”  NoCopyright owner(s) of filmFilm1.First and fourth defendantsMy Sassy Neighbour III2.First and fourth defendantsLive the Dream3.First and fourth defendantsDear, Dear Son-in-Law4.First and fourth defendantsSay It If You Dare III5.Third defendantAmazing Asia6.Third defendantCorrespondent’s DiaryCollectively, the “MediaCorp Films”   3       On 24 July 2007 and 21 September 2007, the defendants issued cease and desist letters to the plaintiff for copyright infringement. In response, the plaintiff commenced an action for groundless threats of copyright infringement and conspiracy against the defendants. The plaintiff’s latter claim of conspiracy was subsequently dismissed. 4       In their Defence and Counterclaim, the defendants alleged that there had indeed been copyright infringement with respect to both the MediaCorp Broadcasts and the MediaCorp Films.",
        "Operation of the RecordTV system": "5       The Offending Website provides members of the public with the equivalent functionality of a brick-and-mortar Digital Video Recorder (“DVR”). The term DVR generically refers to an entertainment appliance that provides record and playback capabilities similar to an analog-style video cassette recorder (“VCR”), but utilising recent digital and computer-related technologies. With an Internet DVR (“iDVR”) like the one found on the Offending Website, the actual recording and storage hardware and software are located at the operator’s facility. In the case of the plaintiff, this is their company office premises. 6       A member of the public desiring to use the services provided by the plaintiff must first sign up, for free, at the Offending Website. Any member of the public with access to a computer and the Internet may use the plaintiff’s services. The only limitation is that he be located in Singapore. Once signed up and logged in, the member of the public can request that a programme from Channel 5, Channel 8 or Channel NewsAsia be recorded. When the programme is broadcast, the plaintiff’s system is designed to capture and record the programme. Once the recording is made, the party requesting can log on to the Offending Website and view the recording, so long as the plaintiff’s system is in operation at the time. It is important to note at this juncture that broadcasts and films from the Central and Suria channels were only recordable under or by the RecordTV system on or around 24 July 2007. However, at the time the defendants’ counterclaim was brought, these channels were no longer recordable. 7       The plaintiff obtains television scheduling information from the public websites of Channel 5, Channel 8 and Channel NewsAsia. The plaintiff then processes the scheduling information with its own proprietary program and stores this information in its internal database. This database is used to show members of the public what is available to be recorded at the Offending Website. Once a request has been put through by an end-user that a programme be recorded, the internal database is updated with that end-user’s request. On the plaintiff’s recording computers, located remotely from the end-user’s computer, a control program continuously reads the internal database to check if anyone has made a request. 8       The defendants’ broadcast television signals are captured by the plaintiff’s roof-mounted antenna and routed to the plaintiff’s recording computers. If the system detects that a member of the public has made a request to record a programme about to be aired, the control software program will instruct the system to record the said programme. Once a recording is made, the plaintiff makes it available for viewing to the member of the public who requested the recording on the “My Playlist” portion of the Offending Website for a period of 15 days. The recorded films and broadcasts are stored on the plaintiff’s servers and deleted by the plaintiff 15 days after the date of recording. 9       Since its inception, the RecordTV system has undergone three different phases of operation. When RecordTV launched in July 2007, onlyonerecording was made despite multiple end-users’ requests for a programme to be recorded (the “First Phase”). This functionality was termed the Single Instance Storage Mode (“SIS Mode”) and it eliminated the duplication of copies by allowing multiple end-users to share from one copy of a recording. Sometime around August 2007 to January 2008 (the “Second Phase”), the RecordTV system operated in a hybrid mode whereby multiple copies of recordings would be created based on the number of end-users requesting for that recording. However, if system resources were insufficient, only one copy of a recording would be made (this was termed the “Mixed Mode”). Finally, sometime around August and September 2008 (the “Third Phase”), the RecordTV system was reconfigured to make individual copies foreach and everyrequesting end-user (“Multiple Copy Mode”). 10     It is important to note that the Third Phase, being the present iteration of the RecordTV system, is not the system that was in place at the time of the defendants’ cease and desist letters or even at the time the action was commenced by the plaintiff. 11     It is not seriously disputed that in going from the First Phase to the Third Phase, the RecordTV system has embraced increasingly inefficient technology. Under the SIS Mode in the First Phase, onlyonerecording had to be stored on the recording computers of the plaintiff. This placed very little strain on the overall storage capacity of the system. Additionally, the processing load on the recording computers was small, given that onlyonefile was being encoded per programme requested. 12     Under the Multiple Copy Mode in the Third Phase, however, greater strains are placed on the storage capacity of the RecordTV system. This is because multiple copies of the same recording have to be stored, each unique to the specific party requesting. Additionally, there is a much higher processing load on the recording computers, given that multiple files all have to be encoded at the same time during the airing of the requested programme. 13     Mr Carlos Nicholas Fernandes (“Mr Fernandes”), the plaintiff’s director, attempted to explain in cross-examination that: … if you have two files on two hard disks, the speed at which the user accesses the information is faster. So in terms of user access, it is more efficient if you have it -- if you may have multiple copies. (Transcript dated 30 June 2009 at p 75) There are two concepts of efficiency at play here: efficiency for theservice provider(ie, the plaintiff) and, separately, efficiency for theend-user(ie, the requesting member of the public). While the Multiple Copy Mode allows for faster access from the end-user’s point of view, it involves duplication and redundancy from the plaintiff’s perspective of resource utilisation. On balance, I am of the view that the SIS Mode is more efficient than the Multiple Copy Mode. Under the Multiple Copy Mode, it is onlypossiblethat multiple end-users might want to access a recording at the same time, whereas it isdefinitethat multiple encodings have to be performed when the requested programme is airing. Little turns on this, however, since in any case Mr Fernandes himself saw the SIS Mode as a way of “increas[ing] the efficiency of the system” (affidavit of evidence-in-chief of Mr Fernandes at para 191), in contrast to the Multiple Copy Mode. 14     The motivation for the apparent regression from the First Phase to the Third Phase was a desire on the part of the plaintiff to stay legally compliant (transcript dated 30 June 2009 at pp 101–102): QWhen you started off, when you launched your service in July 2007, you would have been satisfied that the single copy system was copyright compliant; right? “Yes” or “no”? AReasonably satisfied. I did not know for certainty, but I -- QThanks. So you were reasonably satisfied. You were reasonably satisfied in the face of the fact that four months earlier in the District Court decision in Cablevision had come out, in March 2007, where multiple copies were used; correct? AYes. QJust look at the timelines. February, you set up your company; March, Cablevision says multiple copies is illegal; July, you go for single copies. Then you have a meeting with a professor, you read briefs filed by others -- ASorry -- QPlease. You then ask Mr Post: what is the chance of winning? He says: 70 per cent. You then deliberately move from what you believed reasonably to be a legal system to what has been held to be an illegal and less efficient system on the word of a professor. That summarises everything, does it? AYes. Can I explain? QNo. I just wanted you to confirm that my summary was accurate. [emphasis added] 15     For the purposes of this suit, only the system in place during the First and Second Phases is relevant. As noted above, the Third Phase was only implemented after the commencement of proceedings.",
        "Issues": "16     The plaintiff’s claim is for groundless threats of copyright infringement pursuant to s 200(1) of the Copyright Act (Cap 63, 2006 Rev Ed) (“the Copyright Act”). The defendants had by way of their letters of 24 July 2007 and 21 September 2007 threatened the plaintiff with copyright infringement proceedings. 17     The defendants, on the other hand, are counterclaiming that therehadindeed been copyright infringement by the plaintiff, under various alternative heads. As such, both the main claim and the counterclaim may largely be resolved with the disposal of one and the same issue: whether, at the time the cease and desist letters were issued, there had been any copyright infringement by the plaintiff. This main issue may be broadly crystallised into three sub-issues as follows:  (a)     Is the plaintiff liable for infringement of the defendants’ rights in making copies of the MediaCorp Broadcasts and Films?   (b)     Is the plaintiff liable for communicating the MediaCorp Broadcasts and Films to the public?   (c)     Can the plaintiff rely on any safe harbour or fair dealing provisions to escape liability?  18     There is, however, an additional issue of infringement involving unauthorised backup copies, made by the plaintiff “from a date unknown” (see Defence and Counterclaim (Amendment No 3) at para 25(7). This new cause of action was only pleaded by the defendantsafterthe trial had started, via an amendment to its Defence and Counterclaim. For the purposes of structural clarity, however, I shall consider this new cause of action under the discussion pertaining to (a) above. 19     I should also note at the outset that I did not make much of the defendants’ argument that the plaintiff was a joint tortfeasor in offering the Offending Website for use. This contention presupposed that end-users were liable to the defendants in tort, a claim that was neither pressed nor proven by the defendants.",
        "Is the plaintiff liable for infringement of the defendants’ rights in making copies of the MediaCorp Broadcasts and Films?": "20     Copyright infringement is governed by s 103(1) of the Copyright Act which provides: Infringement by doing acts comprised in copyright 103. — (1) Subject to the provisions of this Act, a copyright subsisting by virtue of this Part is infringed by a person who, not being the owner of the copyright, and without the licence of the owner of the copyright, does in Singapore, or authorises the doing in Singapore of, any act comprised in the copyright. In respect of the MediaCorp Films, the acts “comprised in the copyright” are set out in s 83: Nature of copyright in cinematograph films 83.    For the purposes of this Act, unless the contrary intention appears, copyright, in relation to a cinematograph film, is the exclusive right to do all or any of the following acts: (a)    to make a copy of the film; … (c)    to communicate the film to the public. In respect of the MediaCorp Broadcasts, the acts “comprised in the copyright” are set out in s 84. The relevant portions state: Nature of copyright in television broadcasts and sound broadcasts 84. — (1) For the purposes of this Act, unless the contrary intention appears, copyright, in relation to a television broadcast or sound broadcast, is the exclusive right — (a)    in the case of a television broadcast insofar as it consists of visual images — to make a cinematograph film of the broadcast, or a copy of such a film; … (d)    in the case of a television broadcast or a sound broadcast — to re-broadcast it or to otherwise communicate it to the public. 21     The issue here, as acknowledged by counsel on both sides, is one of identity: exactlywhois the maker of the copies of the MediaCorp Broadcasts and Films? The plaintiff relies on the American case ofCartoon Network LP v CSC Holdings Inc536 F 3d 121 (2nd Cir 2008) (“Cartoon Network”) to contend that it is theend-userof the Offending Website who is the maker, and that accordingly the plaintiff should bear no liability for any allegedly infringing copies made. Primary infringement: a question of identity 22     InCartoon Network, a three-judge panel of the US Court of Appeals for the Second Circuit held that Cablevision’s proposed remote-storage digital video recording service (“RS-DVR”; this being the category under which the plaintiff’s iDVR is classified, as opposed to set-top storage (“STS-DVR”)) did not directly infringe the reproduction rights of those holding copyrights in the recorded materials. In overturning the decision of the district judge below, the Court of Appeals for the Second Circuit held that (at pp 131–132): … There are only two instances of volitional conduct in this case: Cablevision’s conduct in designing, housing, and maintaining a system that exists only to produce a copy, and a customer’s conduct in ordering that system to produce a copy of a specific program. In the case of a VCR, it seems clear—and we know of no case holding otherwise—that the operator of the VCR, the person who actually presses the button to make the recording, supplies the necessary element of volition, not the person who manufactures, maintains, or, if distinct from the operator, owns the machine.We do not believe that an RS-DVR customer is sufficiently distinguishable from a VCR user to impose liability as a direct infringer on a different party for copies that are made automatically upon that customer’s command. … … In determining who actually ‘makes’ a copy, a significant difference exists between making a request to a human employee, who then volitionally operates the copying system to make the copy, and issuing a command directly to a system, which automatically obeys commands and engages in no volitional conduct. … Here, by selling access to a system that automatically produces copies on command, Cablevision more closely resembles a store proprietor who charges customers to use a photocopier on his premises, and it seems incorrect to say, without more, that such a proprietor ‘makes’ any copies when his machines are actually operated by his customers. … we do not think it sufficiently proximate to the copying to displace the customer as the person who ‘makes’ the copies when determining liability under the Copyright Act. Cablevision, we note, also has subscribers who use home VCRs or DVRs (like TiVo), and has significant control over the content recorded by these customers. But this control is limited to the channels of programming available to a customer and not to the programs themselves.Cablevision has no control over what programs are made available on individual channels or when those programs will air, if at all. In this respect, Cablevision possesses far less control over recordable content than it does in the VOD context, where it actively selects and makes available beforehand the individual programs available for viewing. For these reasons, we are not inclined to say that Cablevision, rather than the user, ‘does’ the copying produced by the RS-DVR system. As a result,we find that the district court erred in concluding that Cablevision, rather than its RS-DVR customers, makes the copies carried out by the RS-DVR system. [emphasis added] 23     In short, the court inCartoon Network([21]supra) found that: (a)     by analogy to the end-user of the ancient VCR, the end-user of an RS-DVR is the main volitional agent in requesting for certain programmes to be recorded; (b)     in relation to the end-user of an RS-DVR, who is able to choose specific programmes to record, Cablevision is only able to choose thechannelsof programming to be made available to a customer; and (c)     in determining who actually “makes” a copy, a significant difference exists between making a request to a human employee, who then volitionally operates the copying system to make the copy, and issuing a command directly to a system, which automatically obeys commands and engages in no volitional conduct. From the point of view of the Second Circuit, the above three reasons indicated that the bulk of the volitional conduct, “an important element of direct liability” (Cartoon Networkat p 131), lay with the end-user. Accordingly, the court ruled that the copies were “made” by Cablevision’s customers, and not Cablevision itself. 24     In the same way that Cablevision has “no control over what programs are made available on individual channels or when those programs will air, if at all”, the RecordTV system also has arguably no control over the programmes that are aired (and therefore recordable) on the defendants’ respective channels. The defendants attempt to distinguish (b) above by stating that unlike the case for the Offending Website, which permits free registration and use, the customers of Cablevision paid a subscription fee to use Cablevision’s RS-DVR service. Cablevision’s customers were therefore entitled, as a matter of right, to contractually demand or require that the recording of their choosing be made. This showed that while the end-users inCartoon Network([21]supra) did indeed have volitional control over the “making” of copies, the end-users of the RecordTV system had no more than “a wish” for any show to be recorded. Logically, the defendants conclude, the element of volitional control still resides with the plaintiff. 25     I do not see how a contractual right to demand the making of a copy actually grantscontrolto the end-user to make that copy; however, it is easily appreciated that the existence of such a contractual right indicates a significantly greater degree of volition (viz, the old economic adage, “demand is a want backed by purchasing power”) on the part of the end-user. 26     Despite its erstwhile attempts to distinguish the present facts from (b) above, with respect to (c), the defendants separately submit (in the alternative) thatCartoon Networkshould simply not be followed at all. The defendants cite the arguments ofamicus curiaefor theCopyright Alliancein support of the petition for a Writ of Certiorari to the Second Circuit in its brief on 5 November 2008:[note: 1] The Second Circuit’s error was that it focused too much on what it believed to be a ‘significant difference … between making a request to a human employee, who then voluntarily operates the copying system to make a copy, and issuing a command directly to a system, which automatically obeys commands and engages in no volitional conduct.’ In fact the difference is much less significant than the court thought, and certainly ought not to be dispositive … …Eliminating the human employee from the copying process is an economic imperative, for the same reason that we no longer have elevator operators or gas station attendants. It does not follow that a provider of services that include copying of works should reap not only the savings in personnel costs, but also the windfall of no longer having to obtain a license in order to achieve exactly the same result: a copy requested by a customer. Even less should businesses be given further incentive to design elaborate technological systems for unauthorised copying, from which they can evade copyright liability simply by requiring the customer to ‘push the button’. [emphasis added] 27     IfCartoon Network([21]supra) stands for the proposition that the only conduct sufficient to trigger direct liability is “volitional conduct” by a “human employee”, it can be anticipated that absurd results will ensue. Commercial services involved in the business of content reproduction will be able to circumvent direct liability by replacing human employees with computers or robots. This cannot be correct. 28     InSony Music Entertainment (UK) Ltd v EasyInternetCafe Ltd[2003] FSR 48(“Sony”), the defendant offered a CD burning service at its Internet cafés. Customers could download files during their sessions surfing the Internet via one of its café’s computers. In return for a payment of a £5 fee, staff at the café would save those files on a CD-R for the customer to take away. The evidence was that the defendant’s staff was not aware of the contents of the files downloaded because they were prohibited from looking at the contents of the files without the customer’s agreement. 29     Peter Smith J found that, given the strict liability nature of copyright infringement, it was no defence that the defendant’s staff did not know that they were infringing copyright in burning the CD-Rs. In particular, it was significant that the defendant could have easily chosen to make it its business to knowexactlywhat was being copied by its staff, but chose not to do so. 30     Applying the purported logic ofCartoon Networkto the facts ofSony, it appears that the defendant inSonycould have avoided liability by the simple expedient of automating his processes or using robots and sacking his employees. Again, this does not appear to be correct. Automation ought not to and does not change anything where, at bottom, theprocess of copyingis initiated via voluntary human agency. Peter Smith J makes this distinction clear inSonyat [33]–[35]: First, the liability for infringement … is strict. It is no defence for a person copying an item to assert that he did not know he was infringing a copyright. The reasons for that are self-evident. Obviously, when strict liability is pushed to its boundaries absurd results can arise. It would be absurd if the recipient of a fax over which he has no control could be said to be infringing it merely because his machine is the one that prints the transmission.Generally, the owner of a fax machine cannot stop material being sent. He is an involuntary copier. The same occurs in relation to the Internet Service Provider. In the present case, the only material which is available for this defence is the fact thatthe defendant chooses to keep the files of an individual customer confidential allegedly by directing that the employees cannot see them unless the customer consents. This is not involuntary; it is voluntary. … Further, the defendant is doing this for a profit. I do not see it is any different to a high street printer that is asked to copy material. If the high street printer copies material, which contains infringing copyright material (for example a pirated PhD thesis) the printer will be liable. He will not know that the material is infringing for obvious reasons. Nevertheless, he is liable. I do not see how it can be said to be different because he chooses not to know. This to my mind is to introduce amens readefence when none is available. [emphasis added in bold italics] 31     ApplyingSony([28]supra) to the present facts, so far as (c) is concerned, it becomes clear that it will be difficult for the plaintiff to escape direct liability for permitting its automaton “employees” – its recording computers and other equipment,etc. – to make unauthorised copies of the MediaCorp Broadcasts and Films. 32     Holding (1) of theCartoon Networkdecision, however, is difficult to refute. To the extent that the defendants would have this court believe that there should be no distinction between an automated process and a human agent (for the purposes of determining ultimate volition under (c)), it is all the more contrived to distinguish between the VCR and the RS-DVR technologies which, in effect,achieve the same end result of time-shifting. If it does not matter for purposes of direct liability whether it is ahumanorcomputercarrying out a process, why should it matter that the process is carried outremotelyanddigitally, as opposed tolocallyviaanalogmeans? 33     To put it another way: the end product we are concerned with here is a time-shifted recording. If the end-user is the maker of this time-shifted recording for the purposes of the VCR, itmustremain that the end-user is the maker of the recording in the context of the DVR, remote or local. In this regard I am comforted by the words of Justice John M Walker inCartoon Network([21]supra) at p 132: Our refusal to find Cablevision directly liable on these facts is buttressed by the existence and contours of the Supreme Court’s doctrine of contributory liability in the copyright context. After all, the purpose of any causation-based liability doctrine is to identify the actor (or actors) whose ‘conduct has been so significant and important a cause that [he or she] should be legally responsible.’ W. Page Keeton et al.,Prosser and Keeton on Torts§ 42, at 273 (5th ed. 1984). But here, to the extent that we may construe the boundaries of direct liability more narrowly,the doctrine of contributory liability stands ready to provide adequate protection to copyrighted works. [emphasis added in bold italics] While the UK and Singapore do not countenance the doctrine of contributory infringement as a distinct concept, in practical terms claims of authorising infringement might well fall under this umbrella. Indeed, as David Bainbridge notes inIntellectual Property(Longman, 7th Ed, 2009) at p 159, liability for the authorisation of infringement in the UK might even have a larger scope than liability for contributory infringement in America. In the UK, authorisation can be inferred even where a person is indifferent as to whether infringing material is involved, whereas contributory infringement in America requires actual knowledge.[note: 2] 34     Accordingly, I do not find the plaintiff liable for direct infringement of the copyrights subsisting in the MediaCorp Broadcasts and Films. I turn now to consider the issue of contributory infringement and, in particular, whether the plaintiff had authorised the making of copies of the MediaCorp Broadcasts and Films. Contributory infringement and authorisation of infringement 35     The defendants argue that the finding inCartoon Network([21]supra) appears to ignore the reality that human agents are actively engaged in the “volitional conduct” of designing, setting up and operating services that existonly to produce unauthorised copies of broadcasts and films(as is the case with the plaintiff here). However, this point should not be overstated.Cartoon Networkwas a case specifically not concerned with issues of contributory infringement. In his judgment at pp 132–133, Justice Walker set out the following: Most of the facts found dispositive by the district court—e.g., Cablevision’s ‘continuing relationship’ with its RS-DVR customers, its control over recordable content, and the “instrumental[ity]” of copying to the RS DVR system … —seem to us more relevant to the question of contributory liability. InSony Corp. of America v. Universal City Studios, Inc., the lack of an ‘ongoing relationship’ between Sony and its VCR customers supported the Court’s conclusion that it should not imposecontributoryliability on Sony for any infringing copying done by Sony VCR owners. … TheSonyCourt did deem it ‘just’ to impose liability on a party in a ‘position to control’ the infringing uses of another, but as a contributory, not direct, infringer. … And asking whether copying copyrighted material is only ‘incidental’ to a given technology is akin to asking whether that technology has ‘commercially significant noninfringing uses,’ another inquiry theSonyCourt found relevant to whether imposingcontributoryliability was just. … The Supreme Court’s desire to maintain a meaningful distinction between direct and contributory copyright infringement is consistent with congressional intent. The Patent Act, unlike the Copyright Act, expressly provides that someone who ‘actively induces infringement of a patent’ is ‘liable as an infringer,’ 35 U.S.C. § 271(b), just like someone who commits the underlying infringing act by ‘us[ing]’ a patented invention without authorization,id. § 271(a). In contrast, someone who merely ‘sells … a material or apparatus for use in practicing a patented process’ faces only liability as a ‘contributory infringer.’Id. § 271(c). If Congress had meant to assign direct liability to both the person who actually commits a copyright-infringing act and any person who actively induces that infringement, the Patent Act tells us that it knew how to draft a statute that would have this effect. Because Congress did not do so, theSonyCourtconcluded that ‘[t]he Copyright Act does not expressly render anyone liable for infringement committed by another.’ …Furthermore, in cases likeSony, the Supreme Court has strongly signaled its intent to use the doctrine of contributory infringement, not direct infringement, to ‘identify [ ] the circumstances in which it is just to hold one individual accountable for the actions of another.’… Thus, althoughSonywarns us that ‘the lines between direct infringement, contributory infringement, and vicarious liability are not clearly drawn,’ … that decision does not absolve us of our duty to discern where that line falls in cases, like this one, that require us to decide the question. [emphasis added in bold italics] And further at pp 139–140: This holding, we must emphasize, does not generally permit content delivery networks to avoid all copyright liability by making copies of each item of content and associating one unique copy with each subscriber to the network, or by giving their subscribers the capacity to make their own individual copies.We do not address whether such a network operator would be able to escape any other form of copyright liability, such as liability for unauthorised reproductions or liability for contributory infringement. [emphasis added] 36     DespiteCartoon Network’s asceticism with respect to issues of contributory infringement, I am emboldened here by Justice Walker’s confidence that “the doctrine of contributory liability stands ready to provide adequate protection to copyrighted works”. 37     The defendants are here alleging that the plaintiff authorised the infringement of the defendants’ copyrights in the MediaCorp Broadcasts and Films. What, exactly, amounts to the “authorisation” of an infringement? The meaning of this term was considered inOng Seow Pheng v Lotus Development Corp[1997] 3 SLR 137(“Ong Seow Pheng”). The defendant’s business was in making pirated copies of software manuals and selling them to retailers, one of which was Lur, a software pirate. It was found that the appellants had dealt with 6,720 infringing copies of software manuals,inter alia. There was also evidence that the defendant had handed one pirated copy of software to Lur, telling him to make as many copies as he would require. The plaintiff, the copyright owner of the software, sought damages from the defendant for both 6,720 pirated copies of manuals and 6,720 copies of pirated software which it argued Lur must have madepursuantto the defendant’s instructions. 38     The Court of Appeal held that the defendant hadnotauthorised Lur’s reproductions of the 6,720 pirated copies of the software. The defendant had indeed supplied one pirated copy to Lur, and suggested to Lur to make as many copies as Lur required. In so doing, the defendant might well have “facilitated” and even “incited” Lur’s infringements. However, facilitation and incitement were not the same things as “authorisation”. The defendant had no control over what Lur would do. In coming to this conclusion, the court observed that Lur was a software pirate himself who clearly knew that the defendant was in no position to grant the right to make infringing copies. 39     InCBS Songs Ltd v Amstrad Consumer Electronics Plc[1988] 1 AC 1013 (“Amstrad”), the following formulation for “authorisation” was put forward at 1054: In the present case, Amstrad did not sanction, approve or countenance an infringing use of their model …an authorisation means a grant or purported grant, which may be express or implied, of the right to do the act complained of. Amstrad conferred on the purchaser the power to copy but did not grant or purport to grant the right to copy. …Amstrad have no control over the use of their models once they are sold. [emphasis added] The formulation inAmstradwas echoed inOng Seow Pheng([37]supra) at [33]–[34]: We accept that Ong supplied Lur with a copy of the programme together with the manuals. In doing so, he might well have suggested to Lur that copies of the programmes could be made. However, that is [sic] was a far cry from saying that the appellants thereby authorised Lur to make copies of the programme. He might have facilitated, and even incited, Lur’s infringements, but as was held inCBSSongs andAmstrad, that is not the same thing as authorisation. As the learned judge held, and we agree with her, once the appellants had sold and delivered the infringing copies of the manuals or programmes to Lur,these copies were out of their hands and they had no control over what Lur would do with reference to them. [emphasis added] 40     There is, however, a caveat. According to Ng-Loy Wee Loon inLaw of Intellectual Property of Singapore(Sweet & Maxwell Asia, 2009) (“Ng-Loy”) at paras 10.2.7 and 10.2.8: [t]heOng Seow Phengcase suggests that the concept of authorising copyright infringement in Singapore is in some way dependent upon the state of mind of the person committing the infringing act itself. The argument here appears to be this.If X knows or believes that Y has no right to grant to him (X) the right to do an act – that is, Y is not even cloaked with ‘apparent authority’ – and X nevertheless proceeds to do this act, X alone bears sole responsibility for this act, and this act should not be imputed to Y. This appears to be the approach taken by the English courts, too. English cases have held that ‘an authorisation can only come from someone having or purporting to have authority to grant’ the right to do the act complained of. There was no such grant or purported grant when the party committing the infringing act could not reasonably deduce that the defendant possessed or purported to possess any such authority. In Canada, the term ‘authorise’ has also been interpreted narrowly for purposes of copyright infringement. [emphasis added in bold italics] She continues at para 10.2.11: TheOng Seow Phengcase, by focusing the question of ‘authorisation’ on the perception or belief of the primary infringer, may pose problems to copyright owners who are looking to use the concept of ‘authorising’ copyright infringement to control providers of P2P file sharing technology in Singapore. Such providers will use this case to argue thatInternet users who use their file-sharing technology to, say, share and download music files, must surely realise that they (the providers) are in no position to grant the users the right to download the music, especially with the publicity that is available in the media on the illegality of music downloading and the enforcement efforts of the music industry to clamp down on this activity. [emphasis added] 41     In other words, the author is giving due credit to the sophistication of today’s end-user community. Thus, in the present case, if these end-users knew for a fact that the plaintiff had no authority, apparent or otherwise, to grant them the right to make copies of the MediaCorp Broadcasts and Films, there can be no contributory liability and/or authorisation of infringement attributable to the plaintiff. 42     On the facts of the present case, however, there is a key distinguishing factor. In the “Frequently Asked Questions” section of the Offending Website, it is stated openly that: RecordTV has consulted with the Infocomm Development Authority (IDA) and Media Development Authority of Singapore (MDA) and accordingly obtained all necessary regulatory licenses from the Government of Singapore. By proclaiming to have such approval, the plaintiff effectively represented that it had theactualauthority to provide its service to end-users. To that end, it had purported to authorise the copies of the MediaCorp Broadcasts and Films that were subsequently made at the behest of its customers. Incidentally, I would think that the “Frequently Asked Questions” section of a website as popular as the plaintiff’s would certainly have been, for want of a better word, frequented. As such, I do not doubt that the statement above would have been viewed by many prospective and eventual end-users. 43     I respectfully agree with Justice Walker when he states (see[35]above) that: … [m]ost of the facts found dispositive by the district court [inCartoon Network] — e.g., Cablevision’s ‘continuing relationship’ with its RS-DVR customers, its control over recordable content, and the ‘instrumental[ity]’ of copying to the RS DVR system, … — seem to us more relevant to the question of contributory liability. Indeed, these precise factors are at play here with respect to the RecordTV system, and go a long way towards establishing the plaintiff’s liability for authorising the making of copies by its end-users. 44     To begin with, the Offending Website requires registration and login details, thereby establishing a “continuing relationship” with its end-users. As Mr Fernandes himself conceded, “if [the plaintiff] were not in the picture, the user would not be able to use the system” (transcript dated 1 July 2009 at p 14). Next, while the plaintiff could not control the exact programmes being shown on the various channels it could record, itdidchoose to provide recording functionality to channels that wereallsubsumed under the defendants’ various copyrights. Finally, and most importantly, the “instrumentality” of the plaintiff’s iDVR consistssolelyof recording the defendants’ copyrighted films and broadcasts. By this token, the plaintiff’s device appears to fail, quite dismally, the inquiry for “commercially significant non-infringing uses”,viz, the test applied by the court inSony([28]supra) to decide whether imposing contributory liability is just. 45     In any event, however, the concept of authorising infringement is premised on there being an existing act of primary infringement. While we have already accepted that theend-useris the maker of the copies in question, this does not necessarily mean that the end-user is guilty of infringement. Section 114 of the Copyright Act provides in this regard: Filming or recording broadcasts or programmes for private and domestic use 114. — (1)The copyright in a television broadcast or a cable programme, or in a literary, artistic, dramatic or musical work or a cinematograph film included in the broadcast or programme, insofar as it consists of visual images,is not infringed by the making of acinematograph filmof the broadcast or the cable programme for the private and domestic use of the person by whom the cinematograph film is made. (2)    The copyright in a sound broadcast, a television broadcast or a cable programme, or in a literary, dramatic or musical work, a sound recording or a cinematograph film included in the broadcast or programme, insofar as it consists of sounds, is not infringed by the making of a sound recording of the broadcast or the cable programme for the private and domestic use of the person by whom the sound recording is made. (3)    For the purposes of this section,a cinematograph film or a sound recording shall be deemed to be made otherwise than for the private and domestic use of the person by whom it is made if it is made for the purpose of — (a)    the sale or letting for hire of the film or the sound recording, as the case may be; (b)broadcasting the film or recording orincluding it in a cable programme;or (c)    causing the film or recording to be seen or heard in public. [emphasis added] It is pertinent to note that there was no evidence led by the plaintiff to show that the end-users, without exception, were all entitled to rely upon s 114. 46     Section 7 of the Copyright Act defines “broadcast” to mean broadcasting by wireless telegraphy. This necessarily excludes the Offending Website as a possible node of re-broadcasting under s 114(3)(b), since the Offending Website exists on the Internet, a network ultimately grounded by cables and wires even if at the extreme end-user side wireless standards may be used to facilitate mobile local area networking. More troublesome for our present purposes, however, is the concept of a “cable programme” as espoused by s 114(3)(b). The Copyright Act defines this to mean any programme included in a “cable programme service”. A “cable programme service”, in turn, is defined under s 7 as: … a service which consists wholly or mainly in the sending by any person, by means of a telecommunication system (whether run by him or by any other person), of sounds or visual images or both either — (a)    for reception, otherwise than by wireless telegraphy, at 2 or more places in Singapore, whether they are so sent for simultaneous reception or at different times in response to requests made by different users of the service; or (b)    for reception, by whatever means, at a place in Singapore for the purpose of their being presented there either to members of the public or to any group of persons; 47     The teething issue that emerges is one that has vexed academics and judges alike. Does a website on the Internet, or more broadly even the Internet itself, qualify as a “cable programme service”? In the Scottish decision ofShetland Times Limited v Dr Jonathan Wills[1997] FSR 604(“Shetland Times”), it was held that a website on which the operator posted news items was a “cable programme service” as defined by the UK Copyright, Designs and Patents Act 1988 (“the UK Act”). The definitions in the UK Act were at the material time substantially similar to the definitions in our local Copyright Act: … ‘cable programme service’ means a service which consists wholly or mainly in sending visual images, sounds or other information by means of a telecommunications system, otherwise than by wireless telegraphy, for reception — (a)    at two or more places (whether for simultaneous reception or at different times in response to requests by different users), or (b)    for presentation to members of the public, … 48     TheShetland Timescase, however, has received a mixed reception from academic circles. In his bookThe Laws of the Internet(Butterworths, 2nd Ed, 2003), Clive Gringras (“Gringras”) points out that a cable programme service is defined as “sending visual images, sounds or other information by means of a telecommunication system otherwise than by wireless telegraphy”, but few websites are “sending” information to visitors. It is more technically correct, he submits, to speak of information being retrieved from the website by the visitor. 49     Daniel Seng (“Seng”), in his articleCopyright Norms and the Internet: The Problem of Works Convergence[note: 3], also expressed dissatisfaction withShetland Times. He stated: Although one can take issue with the conclusion of the court that there was aprima faciecase of copyright infringement, it is submitted that the court had made a fundamental mistake.In the absence of detailed technical information put before the court, it had ruledas a matter of law and factthat the provision of Internet web pages constituted a cable programme service. … … The cable programme services envisaged by the English legislature in the UK Copyright, Designs and Patents Act 1988 appears to be very different from most Internet web services. Cable programme services, like broadcasts, are not designed to be dynamic or interactive. They involve the simultaneous broadcast of information over multiple channels, and the obligation is on the user to select the right channel for the requisite information. Internet web services are, by contrast, dynamic and interactive: users send instructions from their computers and instruct the Web servers to serve up different pieces of Web information … Aside from the interactive element, the other main difference between Internet web services and ‘broadcasts and cablecasts’ is that the latter involve the simultaneous, multipoint transmission of information. Most Internet transmissions are sequential and point-to-point, and cannot technically be described as broadcasts or cablecasts… [emphasis added in bold italics] 50     However, in contrast to the technical objections from Gringras and Seng, other commentators, notably the authors ofThe Modern Law of Copyright and Designs, who include the leading intellectual property Judge, Sir Hugh Laddie (“Laddie”), have supported theShetland Timesdecision.[note: 4]This support is at least partly based on the pragmatic consideration that if the Internet does not fall within the definition of “cable programme service”, there will be a gaping hole in the coverage of copyright law. 51     InSony([28]supra), Peter Smith J concluded that the decision in theShetland Timescase ([47]supra) was correct, stating that he was “comforted by the fact that it is supported byLaddie, Prescott & Vitoriawhich I prefer to the criticisms ofGringras”. He further went on to state at [47]: I agree withLaddie, Prescott & Vitoria’s observations in para.8.18 that a restricted meaning would be likely to lead to arbitrary results in relation to new technology in which the sending and receiving of information is increasingly blurred. 52     On balance, it appears to me that the approach inSony, endorsingShetland Times, is the correct one. While I do not take issue with the technical clarifications raised by Gringras and Seng, it is difficult to see how their objections might help frame a coherent picture of copyright law in the age of the Internet. Indeed, in a separate article, Seng himself states that “the Internet as a platform does serve as a means of ‘broadcasting’”.[note: 5] 53     On the other hand, Peter Smith J’s remarks inSonyabout avoiding arbitrary results “in relation to new technology” are not entirely without problems. In our present case, construing the Copyright Act in accordance withShetland Times([47]supra) might arguably mean that the end-users of the RecordTV system falloutsidethe protection for private and domestic use afforded under s 114(1). This is by reason of the end-users (whom we have already identified as the makers of the copies in question) being credited with “including [the defendants’ television programmes] in a cable programme” (viz, the Offending Website on the Internet) and thereby falling within the exception in s 114(3)(b). In other words, the exception to the private and domestic use defence for copying might be said to have been triggered. This would be an unfortunate result, relegating end-users to seeking safe harbour under the broader fair dealing provisions countenanced by s 109. 54     Can the above result really be said to be just? Deeper analysis of s 114 muddies waters further. For one, may it really be said that the end-user has, in viewing apersonalcopy of one of the defendants’ programmes, “included” the copy in a “cable programme”,ie, the Offending Website? Such a notion flies in the face of common sense and stretches the already elastic interpretation of s 114 pursuant toShetland Times. First, “cable programme” is taken to mean “the Internet” to plug a loophole; and now, “including … in a cable programme” is to embrace “viewing a personal copy on a website”. In my view, the statute surely could not have been intended for the punishment of an end-user demographic that copyright owners themselves would have had no business or inclination pursuing. 55     Indeed, if we examine the language of s 114(3) more closely, we see that ss 114(3)(a), (b) and (c) all are prohibitions against the communication of copyrighted material tosomeone. “The sale or letting for hire of the film”, “broadcasting” and “causing the film or recording to be seen or heard in public” – these all indicate, expressly or impliedly, communication to arecipient. I am of the view that the second leg of (b) – the provision we are considering now, that of “including [the copyrighted material] in a cable programme” – must be of the same tenor. In other words, s 114(3)(b) prohibits the making of a copy of a “cinematograph film … for the purpose of … including it in a cable programme”only where the cable programme is transmitted to viewers other than the end-user himself. 56     With this interpretation, it becomes arguable that in “making” the relevant copy for his own consumption, the end-user hasnotactually “included” that same copy “in a cable programme”. All he has done has been to use that “cable programme” (the Internet or, alternatively, the Offending Website) as ameansof accessing his personal copy of the copyrighted material. 57     In sum, therefore, while the general approach espoused inSony([28]supra) is an admirable one – both in terms of thecertaintyoccasioned for interested parties, as well as thenon-technical and commonsensicalgrounds upon which it is based – we would do well to be aware that not every piece of copyrighted material on the Internet falls to be classified as having been “included in a cable programme”. Each unique fact situation should be considered afresh and the courts should not take for granted any presence of infringement, particularly given the convoluted mental gymnastics that are required to subsume the Internet under s 114(3)(b). 58     Separately, it should be noted that websites, as collections of web pages, images, videos and other digital assets which are generally publicly accessible to end-users and visitors seem to be uncontroversially classified by the Singapore Broadcasting Authority and the Media Development Authority as “broadcasts”.[note: 6]As has already been noted, however, this appears to fly in the face of the definition espoused by s 7 of the Copyright Act (see[46]above). During the Second Reading for the Copyright (Amendment) Bill on 16 November 2004,[note: 7]the Deputy Prime Minister and Minister for Law, Professor S Jayakumar (“Prof Jayakumar”), stated the following in relation to the introduction of the new right of communication for copyrighted works: First, new right of communication for works. Sir, the Internet is becoming an increasingly important platform through whichcopyrightowners promote and disseminate theircopyrightedworks. Such digital dissemination of works has become the basis for businesses such as home-grown music distributor Soundbuzz. Clause 8 of the Bill introduces a new right to enable thecopyrightowner to control the communication of his work to the public.This new communication right encompasses both the existing broadcasting and cable programme rights, and also the right to control the dissemination of works on the Internet. This new right will enablecopyrightowners or other entrepreneurs to fully leverage on the Internet platform as a means to disseminatecopyrightedmaterial. [emphasis added] It is clear from the extract above that the new communication right – now enshrined in ss 83(c) and 84(1)(d) of the Copyright Act – was meant to correspond to the transmission of works over the Internet in the same way that the “broadcasting” right was meant to cover free-to-air television broadcasts and the “cable programme” right, cable television transmissions. There is a clear trichotomy and it certainly cannot be gainsaid that for now “broadcasts” for the purposes of the Copyright Act should not be taken to include anything other than broadcasts by “wireless telegraphy”, as defined in s 7. However, to my mind it is clear that Parliamentwasandisaware that the law is playing catch-up with technology. While this trichotomy is sensible and should not have its individual components needlessly conflated, themotivationsbehind the existence of this trichotomy in the Copyright Act resonate with the reasoning inSony([28]supra) andShetland Times([47]supra). Yesterday, we had a dichotomy; and today, a trichotomy; as for tomorrow, who can say? Whichever way technology diverges and evolves, itmustbe that the overarching goal of Parliament – as evidenced by its regular amendments to the Copyright Act – is to ensure that loopholes in the copyright law are timeously plugged. In this connection, therefore, the conflict between the positions of Gringras ([48]supra) and Laddie ([50]supra) appears to be an illusory one – while one champions the minutiae and the other the spirit, both are equally relevant in shaping the ends of copyright policy in this modern era. The backup copies 59     By a letter dated 6 March 2008, the defendants requested for further discovery of certain documents from the plaintiff. These documents included: 9.    Copies (including archived records) of the television programmes … recorded by the Plaintiff in the course of the operating of the Offending Website”. [the “Operational Copies”] as well as: 10.    Copies (including archived records) of the television programmes … currently residing in the Plaintiff’s storage system. [the “Current Copies”] 60     The plaintiff refused to give discovery. After some interlocutory to-ing and fro-ing, the Honourable Justice Tay Yong Kwang granted a court order dated 26 May 2008 permitting the defendants access to,inter alia, the Operational and Current Copies. On 25 July 2008, the plaintiff filed a list of documents that listed copies of recordings from 15 May 2008 to 26 May 2008. The plaintiff stated that these recordings were disclosed pursuant to the court order in respect ofonlythe Current Copies. 61     With respect to the Operational Copies, the plaintiff explained, by a letter to the defendants dated 8 September 2008, that it had not itself created any copies of the television programmes in the defendants’ channels and films. As no copies had been recorded by theplaintiff, its argument went, no Operational Copies were disclosed. 62     The plaintiff contended that the separate backup copies (the “Additional Copies”) made for the purposes of discovery, via certain software called “watchDirectory”, did not fall within the defendants’ request for Operational Copies. It argued that the Additional Copies were notrecordedby the plaintiff, in the sense that they were not recorded using the plaintiff’s iDVR. It also argued that the Additional Copies were not recordedin the course of the operating of the Offending Website– the making of the Additional Copies was entirely separate from the operation of the plaintiff’s iDVR facility. 63     Since the watchDirectory software did not form part of the iDVR facility offered to the plaintiff’s customers, and since it was not an essential component necessary for the operation of the RecordTV system, the plaintiff did not disclose either the watchDirectory software or the Additional Copies made by the watchDirectory software as “Operational Copies” pursuant to the 26 May 2008 court order. Also, the plaintiff considered the watchDirectory storage disks to be on a “separate computer” and “not part of [the RecordTV] system”. As such, the Additional Copies did not fall to be classified under “Current Copies” as well. 64     The defendants argue that the fact that “the Plaintiff has adopted such a strained interpretation of the Order of Court of 26 May 2008 only shows that it had something to hide”. The defendants were of the opinion that the plaintiff had been amassing a library of infringing content for the eventual purpose of monetising its business. 65     At bottom, it appears that there has been a definitional clash, rather than any calculated agenda on either side to mislead the court. From the point of view of the defendants, the Additional Copies had been the “archived records” referred to in the court order dated 26 May 2008; from the perspective of the plaintiff, the Additional Copies had never resided on the “Plaintiff’s storage system” and had never been utilised for the purposes of operating the Offending Website. 66     The point, however, is arguably moot. Based on the documentary evidence before me, the Additional Copies had only begun to be made on 30 May 2008 and 1 November 2008,afterthe Order of Court dated 26 May 2008. There is no evidence to suggest, as the defendants allege, that the plaintiff’s backup system had been in place from the time the RecordTV system was set up in July 2007. There is also no evidence to show that the Additional Copies had been made for the purpose of being part of a library of recordings for the plaintiff’s prospective and evolving business. Instead, there are thousands of watchDirectory e-mail reports between August 2008 and June 2009 which show that the Additional Copies were made for the purposes of these judicial proceedings. 67     The defendants have invited me to draw adverse inferences with respect to the plaintiff’s recalcitrance in this matter. I do not, however, see any basis for this course. Proper consideration of the Additional Copies shows that many additional copies of thesame recordingwere preserved by the plaintiff, presumably for the assessment of damages. Further, a portion of the Additional Copies comprises recordings of out-of-date news programmes on Channel NewsAsia. Both of these examples, glaring in their inefficiency and lack of marketability, negate any theory that the plaintiff had been building up a library of recordings. 68     In view of all of the above, I find the plaintiff not liable to the defendants for making infringing copies of the MediaCorp Broadcasts and Films. However, subject to my later consideration of available defences, I find the plaintiff liable forauthorisingthe making of copies by its customers. 69     Separately, based on all the documentary evidence before me, I do not find the plaintiff to be liable to the defendants for making backup copies of the MediaCorp Broadcasts and Films.",
        "Is the plaintiff liable for communicating the MediaCorp Broadcasts and Films to the public?": "70     In respect of the MediaCorp Films, the defendants’ right to communicate the work to the public is found in s 83(c) as follows: Nature of copyright in cinematograph films 83.    For the purposes of this Act, unless the contrary intention appears, copyright, in relation to a cinematograph film, is the exclusive right to do all or any of the following acts: … (c)    to communicate the film to the public. In respect of the MediaCorp Broadcasts, the defendants’ right to communicate the work to the public is found in s 84(1)(d): Nature of copyright in television broadcasts and sound broadcasts 84. — (1) For the purposes of this Act, unless the contrary intention appears, copyright, in relation to a television broadcast or sound broadcast, is the exclusive right — … (d)    in the case of a television broadcast or a sound broadcast — to re-broadcast it or to otherwise communicate it to the public. 71     The rationale for the broadly-phrased communication right, as expressed by Prof Jayakumar quoted at[58]above,[note: 8]is to encompass the right to control the dissemination of works on the Internet. The relevant extract bears repetition: First, new right of communication for works. Sir, the Internet is becoming an increasingly important platform through whichcopyrightowners promote and disseminate theircopyrightedworks. Such digital dissemination of works has become the basis for businesses such as home-grown music distributor Soundbuzz. Clause 8 of the Bill introduces a new right to enable thecopyrightowner to control the communication of his work to the public.This new communication right encompasses both the existing broadcasting and cable programme rights, and also the right to control the dissemination of works on the Internet. This new right will enablecopyrightowners or other entrepreneurs to fully leverage on the Internet platform as a means to disseminatecopyrightedmaterial. [emphasis added] It is important to note that the right of communication to the public was introduced to implement an obligation owed by Singapore under the United States–Singapore Free Trade Agreement (see Art 16.4.2(a) therein). American case law in this regard, therefore, might prove instructive. 72     The ambit of the communication right is illustrated neatly in Ng-Loy ([40]supra) at para 9.5.3: If MediaCorp TV broadcasts a movie onChannel 5, or Starhub cablecasts a movie on theHallmarkchannel, or a person uploads a movie onto theYouTubewebsite, such acts involve a communication to the public of the movie and of all other copyright works embodied in the movie … These examples, in particular the first and last, are germane to the case at hand. They show that the defendants possess a public communication right that might have been co-opted by the plaintiff. The question that remains, therefore, is whether the RecordTV system may be properly analogised to the YouTube business model. To this end, three things have to be shown, pursuant to a careful reading of the statute: (a)     that the plaintiff’s acts amount to communication; (b)     that such communication was made “to the public”; and (c)     the plaintiff, and not the end-user, was the one who wasresponsiblefor the communication. “Communication” 73     “Communicate” is defined in s 7 of the Copyright Act as follows: ‘communicate’ meansto transmit by electronic means(whether over a path, or a combination of paths, provided by a material substance or by wireless means or otherwise) a work or other subject-matter, whether or not it is sent in response to a request, and includes — (a)    the broadcasting of a work or other subject-matter; (b)    theinclusion of a work or other subject-matter in a cable programme; and (c)    themaking available of a work or other subject-matter(on a network or otherwise) in such a way that the work or subject-matter may be accessed by any person from a place and at a time chosen by him, and ‘communication’ shall have a corresponding meaning; [emphasis added] 74     With respect to the general definition and (a), it is not seriously disputed that the plaintiff’s RecordTV system transmits, by electronic means, the relevant television programme to the registered end-user who has asked to view it (transcript dated 1 July 2009 at pp 6 and 131). For (b), as has already been discussed earlier at[50]–[53]above, by facilitating the placement of recorded material on its website, the plaintiff had included the subject-matter of the MediaCorp Broadcasts and Films in a “cable programme”. 75     In regard to (c), the plaintiff’s argument, taken out of context from Note 10.10 of the WIPO Basic Proposal on Art 10 of the WIPO Copyright Treaty, runs as follows: The relevant act that ‘making available’ right intended to cover was the making available of the work byproviding access to it. [emphasis added] The actual language of Note 10.10 provides that: … The relevant act is the making available of the work byproviding access to it. [emphasis added] With this assertion, however, the plaintiff is in effect contending that the end-user has, by definition, providedhis ownaccess to the copies recorded. This, if not completely nonsensical, is a painfully convoluted interpretation of matters, and I am ill inclined to follow it. “To the public” 76     Whatisdisputed is whether the communication made by the plaintiff during the operation of the RecordTV system is one “to the public”. InCopinger and Skone James on Copyright(Sweet & Maxwell, 15th Ed, 2005) (“Copinger”) at para 7–118, the learned authors consider the definition of “the public”: Although the Act refers to the work being made available to ‘the public’, in the usual way this does not mean that the restricted act is only committed when the public at large can obtain access to it.Where the work is only available to subscribers to an internet service, the subscribers will qualify as ‘the public’ for this purpose. [emphasis added] 77     I am in agreement with the authors ofCopinger. It should not matter that the plaintiff’s service is available only to registered end-users, whenany member of the publicwith an Internet connection may register for free. By way of analogy, consider an esoteric book in a musty library with tedious membership requirements and strict loan policies. Such a book would, despite everything, still be a book available to “the public”. 78     InCartoon Network([21]supra), the issue of “the public” was dealt with at p 139: In sum, we find that the transmit clause directs us to identify the potential audience of a given transmission, i.e., the persons ‘capable of receiving’ it, to determine whether the transmission is made ‘to the public.’Because each RS-DVR playback transmission is made to a single subscriber using a single unique copy produced by that subscriber, we conclude that such transmissions are not performances ‘to the public’, and therefore do not infringe any exclusive right of public performance. [emphasis added] 79     Accordingly,Cartoon Networkmay be distinguished on the facts. During the First and Second Phases of the RecordTV system, much of the playback to end-users took place in the form of non-unique copies borne of the SIS and Mixed Modes. “By the Plaintiff” 80     Turning now to the issue ofwhomade the communication to the public, I find myself in familiar territory. Is there a strict analogy to the earlier question ofwhomade the infringing copies? The plaintiff appears to think so. It claims that it is not the party that “communicates” the work to the public within the meaning of s 16(6) of the Copyright Act. Section 16(6) states: For the purposes of this Act, a communication other than a broadcast is taken to have been made by the person responsible for determining the content of the communication at the time the communication is made. Accordingly, since it is theend-userwho has control over what programmes to record, it isalsothe end-user who has control over the “content of the communication at the time the communication is made”. 81     According to this line of reasoning, the maker of unauthorised copies willalwaysbe the one to communicate the same to the public (depending of course on permitting facts). I am not convinced by this argument. To my mind, there is an important distinction between the “making” and “transmission” of copyrighted material. This distinction was noted by the US Solicitor General in her Amicus Curiae Brief for theCartoon Networkcase ([21]supra) at p 20: c.    The analogy between the respondents’ RS-DVR service and a set-top DVR is weakest with respect to the public-performance issue because the operation of the former, unlike the latter, would clearly involve a ‘transmission.’ … (To ‘transmit’ a performance or display is to communicate it by any device or process whereby images or sounds are received beyond the place from which they are sent.) …Thus, even if the subscriber would ‘make’ the copies used in the RS-DVR system, respondents might still violate the Copyright Act if they ‘transmitted’ those copies ‘to the public’…[emphasis added] 82     The key question is this: where exactly do the end-user’s volition and control cease to operate? If we can say that the end-user has made the infringing copyandtransmitted the infringing copy, there is little to prevent us from concluding that the end-user is, in fact, an RS-DVR in disguise. For where, in that analysis, would there be room for the implication of any properly culpable technology? If the RecordTV system neither copies nor transmits any material, how can it be said to have infringed any copyright? 83     The line, therefore, has to be drawn somewhere, and I think it sensible that it be drawn once the end-user hasproperly exercised his volitionin making a choice. In other words, while I accept and have accepted that the end-user is the one who has control over what programmes to record, the subsequent transmission of that content would be effected by a process governed entirely by the plaintiff. 84     Accordingly, I would read the words of s 16(6) technically. The section is concerned, after all, with a technical process. At the time the relevant communication is made, the end-user hasalreadycommunicated its preference to the plaintiff (this necessarily has to take place before any recording or transmission). The plaintiff therefore is the one responsible for determining the content of the communication upon playback. One can easily envisage a situation whereby, after the end-user makes his selection, playback is somehow garbled due to a technical fault. It would be a stretch of the imagination to say that the end-user was the one who “determined” the content of the unintelligent static that was recorded. 85     In the light of the above, I find the plaintiff liable for infringing the defendants’ copyright in communicating the MediaCorp Broadcasts and Films to the public.",
        "Can the plaintiff rely on any safe harbour or fair dealing provisions to escape liability?": "",
        "Network service providers": "86     To immunise itself against liability, the plaintiff argues that it is a network service provider within the meaning of s 193A of the Copyright Act and therefore entitled to rely on any or all of the defences available under Part IXA of the Copyright Act. In its opening statement, however, the plaintiff limited its defence to only s 193B. 87     Section 193A provides the following definition for “network service provider”: ‘network service provider’ — (a)    for the purposes of section 193B, means a person who provides services relating to, or provides connections for, the transmission or routing of data; and (b)    for the purposes of this Part (other than section 193B), means a person who provides, or operates facilities for, online services or network access and includes a person referred to in paragraph (a), … 88     In arguing that it is a “network service provider”, as the term is commonly understood, the plaintiff does some violence to the English language. In common parlance, a network service provider is a business or organisation that sells bandwidth or network access by providing direct access to the Internet. In other words, a network service providerprovidestheserviceof enabling a person to connect to anetwork. 89     Couched in the vague language of s 193A, however, the term “network service provider” as defined gives the plaintiff some wriggle room. There is a sizeable gap for the plaintiff to argue that it “provides services relating to … the transmission … of data”, and therefore qualifies as a “network service provider”. 90     The plaintiff’s strained position, however, is untenable when we look to Parliamentary intent. At the Second Reading of the Copyright (Amendment) Bill, Prof Jayakumar stated the following:[note: 9] The amendments in the Bill address the needs of both copyright owners and users in this new environment. These changes in the Bill will also further strengthen Singapore’s position as an attractive location for copyright-based activities. Several of the amendments in the Bill also relate to our obligations under the United States–Singapore Free Trade Agreement. … Mr Speaker, Sir,the provisions on Network Service Provider liability in this Bill are intended to make NSPs more pro-active in assisting copyright owners to protect and enforce their rights. In the current Act, NSPs enjoy blanket immunity for acts of infringement of copyright or copyright infringing material on their networks. In other words, NSPs are completely absolved of responsibility for such acts or infringing material that they host or provide access to.The provisions in this Bill serve to create a better balance between the interests of rights owners and NSPs, by ensuring that the benefit of immunity that NSPs can enjoy are now accompanied by certain responsibilities. [emphasis added] 91     It quickly becomes clear that the words of Prof Jayakumar would make no sense at all if one considers the plaintiff to be a network service provider. Indeed, the very nature of the plaintiff’s system is such that its purpose is diametrically opposed to the intent of the safe harbour provisions countenanced in Part IXA of the Copyright Act. The plaintiff is in the business of operating a website that makes copies of copyrighted material; the safe harbour provisions exist to protectbona fidenetwork service providers from inadvertently being found liable for copying copyrighted material. 92     In any event, s 193B of the Copyright Act offers the plaintiff no protection. The statute sets out the following: Transmission, routing and provision of connections 193B. — (1) The court shall not grant any monetary relief or, except as provided for in section 193DB, make any order against a network service provider for any infringement of copyright in any material that occurs by reason of — (a)    the transmission or routing by the network service provider of, or the provision of connections by the network service provider for, an electronic copy of the material through the network service provider’s primary network; … … if the network service provider satisfies the conditions set out in subsection (2). (2)    The conditions referred to in subsection (1) are that — … (b)the transmission, routing, provision of connections or storage is carried out through an automatic technical process without any selection of the electronic copy of the material by the network service provider; [emphasis added] 93     The operation of the Offending Website can hardly be said to be an “automatic technical process without any selection of the electronic copy of the material [by the plaintiff]”. It is not disputed that the plaintiff pre-selected the MediaCorp channels for the purposes of recording – indeed, the plaintiff was at pains to state that it specifically chose, for the purposes of the RecordTV system, free-to-air channels that would have the least likelihood of running afoul of any copyright laws. If the plaintiff wants to run the argument that it is theend-userwho makes a selection as to “the electronic copy of the material” transmitted, it first has to explain why this selection is not a subsidiary choicewithina pre-selected array long arrived at by the plaintiff. 94     Further, the plaintiff also has to justify how the pre-selection by the plaintiff and the subsequent selection by the end-user are classifiable as being part of an “automatic technical process”. To my mind, the manner in which the relevant recordings were eventually chosen and transmitted in the course of the operation of the Offending Website was anything but “automatic”. Indeed, a great amount of volition must surely have gone into the very human choices of what and which programmes to record.",
        "Fair dealing": "95     Section 109 of the Copyright Act lays out the ambit of the fair dealing defence in Singapore: Fair dealing in relation to other subject-matter 109. — (1) Subject to this section, a fair dealing with an audio-visual item for any purpose other than a purpose referred to in section 110 or 111 shall not constitute an infringement of the copyright in the item or in any work or other audio-visual item included in the item. (2)    The purposes for which a dealing with an audio-visual item may constitute a fair dealing under subsection (1) shall include research and study. (3)    For the purposes of this Act, the matters to which regard shall be had, in determining whether a dealing with an audio-visual item, being a dealing by way of copying the whole or a part of the audio-visual item, constitutes a fair dealing with the audio-visual item for any purpose other than a purpose referred to in section 110 or 111 shall include — (a)    the purpose and character of the dealing, including whether such dealing is of a commercial nature or is for non-profit educational purposes; (b)    the nature of the audio-visual item; (c)    the amount and substantiality of the part copied taken in relation to the whole audio-visual item; (d)    the effect of the dealing upon the potential market for, or value of, the audio-visual item; and (e)    the possibility of obtaining the audio-visual item within a reasonable time at an ordinary commercial price. While there is no specific reference to the recording of broadcasts by an individual for later consumption by that individual (viz, “time-shifting”), several American authorities are persuasive in this regard in permitting time-shifting as fair use: see, for example,Sony Corporation of America v Universal City Studios, Inc464 US 417 (1984 Sup Ct) (“Betamax”). 96     I do not doubt that the plaintiff’s customers probably used the RecordTV service for time-shifting. To see why this is so, a brief sojourn into the underlying technology is necessary. 97     The plaintiff’s system usesstreamingas the technique to disseminate the television programme data from the server. With streaming, data is transferred from the server to the end-user, but upon arrival the data is displayed as soon as possible. Once the data has been shown on the computer display, it is discarded. As a result of this, no local copy of the recorded programme is kept or created at the end-user’s computer and patrons of the Offending Website therefore have little or no ability to store, edit or manipulate the recorded television programmes. A similar end result is obtained in the Starhub Hubstation and the Singtel Mio TV DVRs via the incorporation of proprietary storage formats. These formats render recorded programmes inaccessible to – and therefore unmodifiable by – end-users. 98     The average lay person is, therefore, unable to extract recorded programmes from the Starhub, Singtel and RecordTV DVRs for further downstream transmission. Accordingly, I conclude that time-shifting is the primary use that end-users will get out of these deliberately restrictive technologies. In this respect, it might be useful to contrast thedownloadingof data such as mp3 or other music files by end-users. One academic commentator notes:[note: 11] There is little question that the use of such P2P systems to distribute copyrighted works without authorization constitutes infringement.Even if the downloading of a music file is permissible under a jurisdiction’s fair use or private copying doctrines, the making files available with downloading by others has been found – almost uniformly – to constitute infringement by the uploader of rights of distribution, transmission, communication, or making available to the public. This is true even in the United States where controversy broke out in 2008 as to whether making files available without proof of downloading by anyone else constitutes ‘distribution’ under section 106. [emphasis added] However, the above concerns necessarily do not apply in the case of the plaintiff’s technology, given that no permanent copies are actually “downloaded” to the end-user’s computer and that subsequent distribution of the recorded programmes is beyond the ken of all but the most determined and technically gifted. 99     I also do not accept the defendants’ attempts to distinguishBetamax([95]supra) on the basis that that decision did not involve aservicewhere the service provider makes a copy upon the end-user’s request (but instead concerned aproductwhere the purchaser made the copy of his own accord). To my mind, it should make no difference, without more, whether technology for time-shifting purposes exists as a service or as a product. If time-shifting is fair use, then it is fair use, period. In this regard there is some analogy to the discussion at[27]–[31]above. 100    Indeed, the defendants in this action are not objecting to the plaintiff’s end-users’ use, but only the plaintiff’s use. 101    It is, of course, not permissible for a service provider to rely on its customers’ fair dealing to exculpate its own culpable behaviour. InPrinceton University Press v Michigan Document Services Inc99 F 3d 1381 (6th Cir 1996), the majority of the Sixth Circuit Court of Appeal stated the following at p 6: As to the proposition that it would be fair use for the students or professors to make their own copies, the issue is by no means free from doubt. We need not decide this question, however, forthe fact is that the copying complained of here was performed on a profit-making basis by a commercial enterprise. And ‘[t]he courts have … properly rejected attempts by for-profit users to stand in the shoes of their customers making nonprofit or noncommercial uses.’Patry,Fair Use in Copyright Law, at 420 n. 34. As the House Judiciary Committee stated in its report on the 1976 legislation, ‘[I]t would not be possible for a non-profit institution, by means of contractual arrangements with a commercial copying enterprise, to authorize the enterprise to carry out copying and distribution functions that would be exempt if conducted by the non-profit institution itself.’ … [emphasis added in bold italics] 102    The proposition that a party may not rely on another party’s fair dealing defence is a sound one. Were this not the case, an avaricious entrepreneur could make copies of copyrighted material for its customers with impunity for its own financial profit, as had been the case inSony(see[28]supra). 103    In the American case ofMCA, Inc v Wilson677 F 2d 180 (“MCA”), it was stated at pp 2–4 that: While commercial motivation and fair use can exist side by side, the court may consider whether the alleged infringing use was primarily for public benefit or for private commercial gain. It is certainly true that the plaintiff had still been operating as a non-profit outfit at the time the suit was brought. However, the defendants were able to show at trial that the plaintiff would allegedly “eventually monetise its service by levying subscription fees, implementing advertisements, and licensing the Plaintiff’s technology”. Indeed, Mr Fernandes himself testified that plans had been in the pipeline for the implementation and sale of advertising technologies derived for use on the Offending Website for the generation of “potential revenue streams”. The Offending Website was certainly not run as a charity. It was a preliminary foray into the market for advertisement-driven web-based programme recording. 104    Under s 109(3)(a) of the Copyright Act, the balance between public benefit and private commercial gain constitutes the first of five factors in determining the existence of any fair dealing. In this regard, the “purpose and character” of the plaintiff’s business model, inchoate as it were, appears to come down much more heavily on the side of commercial exploitation than public service. Any person in Singapore with a VCR, a Singtel Mio TV STS-DVR or a Starhub Hubstation STS-DVR (the latter two devices arerequiredfor the viewing of the cable programmes transmitted by Singtel and Starhub respectively) would be able to record the defendants’ programmes; the recourse provided by the Offending Website appears, therefore, to be more of an interestingalternativethan aninstrumentalprimary means of time-shifting the defendants’ programmes. The contrast withBetamax([95]supra) here is clear. 105    The second factor – “the nature of the audio-visual item” – weighs in the plaintiff’s favour. The “audio-visual item” in question is a free-to-air broadcast from our national broadcaster, with VCRs, Singtel Mio TV STS-DVR s and the Starhub Hubstation STS-DVRsalreadyproviding time-shifting capabilities. In the same vein, the fourth factor – “the effect of the dealing upon the potential market for, or value of, the audio-visual item” – also falls in the plaintiff’s favour. There is no realistic market for “recently-screened MediaCorp broadcasts”. MediaCorp Online Broadband Television, or “MOBTV” is, by its own admission, only a video-on-demand service and not a time-shifting service. MOBTV does not screen every single item that is broadcast on the free-to-air channels; it only offers a limited selection of syndicated programmes. 106    InMCA([103]supra), it was held (at p 5) that in relation to the fourth factor: … a balance must sometimes be struck between the benefit the public will derive if the use is permitted and the personal gain the copyright holder will receive if the use is denied. This confirms that the appropriate balance to be struck here is one between thepublicand the copyright holder, instead of theservice provider(the plaintiff here) and the copyright holder. 107    The third factor – “the amount and substantiality of the part copied taken in relation to the whole audio-visual item” – clearly lies against the plaintiff here. Entire programmes, without qualifying alterations, are recordable via the Offending Website. 108    The final factor – “the possibility of obtaining the audio-visual item within a reasonable time at an ordinary commercial price” – involves some curious analysis.Prima facieit must lie in favour of the plaintiff since MOBTV and DVDs of films that have been broadcast are poor substitutes to the plaintiff’s service, offering as it does time-shifting functionality forallprogrammes (including non-commercially available programmes) atalltimings. However, one might also be able toimmediatelyobtain the relevant audio-visual itemvirtually free of chargeby programming one’s VCR, Singtel Mio TV STS-DVR or Starhub Hubstation STS-DVR accordingly. Given this, the concept of “ordinary commercial price” becomes unworkable, and the implied consent for copying enjoyed by the extant time-shifting technologies renders consideration of this fifth and final factor moot. 109    In view of all of the above considerations, I find that the plaintiff fails to qualify for the fair dealing defence under s 109 of the Copyright Act. In arriving at this decision, I was greatly influenced by the fact that Mr Fernandes had unmistakeably conceded that hiswasa commercial project with the eventual goal of monetisation through advertisements and the licensing of advertising technology. While s 109 does countenance a balancing exercise between commercial gain and public benefit, rather than an absolute prohibition against commercial uses, I was of the opinion that the Offending Website was set up primarily for private profiteering. The social benefit wrought by the Offending Website had, to my mind, largely already been provided for by existing time-shifting technologies such as the VCR. This last point is significant, in that it also serves to distinguish the present case from the facts and result inBetamax([95]supra): the balance between private gain and public benefit here simply is of a different order from what was countenanced in that seminal decision. Even then, it bears noting that the Supreme Court only arrived at its 5–4 majority opinion in favour of the Sony Corporation after Justice John Paul Stevens managed to persuade two of his brother judges away from a 6–3 result in favour of the content producer, Universal City Studios, Inc. Clearly, the VCR had onlybarelycrossed an extremely high threshold, even given its obvious utility; I was doubtful that the Offending Website had been equal to that task here. 110    The unavailability of the fair dealing defence to the plaintiff means that it is liable for authorising copies of the MediaCorp Broadcasts and Films to be made and for communicating the same to the public, as earlier found.",
        "Concluding observations": "111    It has long been noted that, with respect to the intersection between law and technology, a fascination with the technical is counter-productive. InTriad Systems Corporation v Southeastern Express Co31 USPQ 2d 1239, 1243 (BNA) (ND Cal), the issue under consideration was howlonga copy had to exist before it could be considered more than a “transitory” copy and, therefore, properly “fixed” in a medium such as computer storage. The district court reasoned as follows (at p 5): [T]he copyright law is not so much concerned with the temporal ‘duration’ of a copy as it is with what that copy does, and what it is capable of doing, while it exists. ‘Transitory duration’ is a relative term that must be interpreted and applied in context.This concept is particularly important in cases involving computer technology where the speed and complexity of machines and software is rapidly advancing, and where the diversity of computer architecture and software design is expanding at an ever-increasing rate. … [emphasis added] The reasoning above marked a significant departure from the prevailing attitudes at the time, fostered in large part by the seminal case ofMAI Systems Corporation v Peak Computer, Inc991 F 2d 511 (9th Cir 1993), where it was held that copies of electronic material loaded into the RAM (random access memory) of a computer constitutedbona fidecopies under the US Copyright Act. 112    Online commentators have also noted the tendency of the courts to focus on the wrong end of matters in the digital age:[note: 11] Judge Denny Chin of the SDNY has handed down his opinion in Twentieth Century Fox Film Corp. v. Cablevisions Systems Corp., 2007 WL 867093, involving Cablevision’s planned Remote Storage DVR (RS-DVR). He granted plaintiff’s motion for a declaratory judgment and injunction and denied defendant’s counterclaim declaration for non-infringement. Judge Chin delved deeply into the technical aspects of RS-DVRs with a zeal and level of detail whose value is not self-evident. Indeed, at the end, when one gets to the legal analysis, there is a letdown in the court’s explanation of the central legal issues in the case. It is as if the relentless march through the technology in all its glory somehow answered the legal questions. … The court, based I think on its fascination with the back-end of these straightforward questions, bought into plaintiffs’ analogy to VOD, rejecting defendant’s analogy to TIVOs and other STS-DVRs (set-top storage). In one important respect, RS-DVRs are less of a threat than STS-DVRs, namely with RS-DVRs, there is no ability to download the show to an external hard-drive. Neither of these analogies though have a bearing on the basic legal questions. I find it far less impressive than the court did that the copying issue should turn on the back-end of how the copy is stored. With both STS-DVRs (whose legality was not at issue nor conceded by plaintiffs), it is the consumer who pushes a remote control button that initiates the process. [emphasis added] While the excerpt above critiqued theCartoon Networkcase ([21]supra) (at the district court level, its observations are nonetheless enlightening. As an aside, it should be noted that litigation with respect to STS-DVRs in America was eventually settled without a judicial decision addressing whether they, like their VCR predecessors, are non-infringing time-shifting technologies.[note: 12]Parenthetically, it should also be noted that inCartoon Network, Cablevision specifically agreed not to plead the fair use defence. 113    The realities of copyright enforcement with respect to technological advance have long been noted. As Bainbridge observes in his textbook (see[33]above) at pp 214–215: A large number of video recorders are used domestically to record television programmes for viewing at a later time: for example, where the persons concerned are away from home or doing something else at the time the programme is broadcast. This is known as ‘time-shifting’ of broadcasts, and is permitted by s 70 [of the UK Act] if carried out on domestic premises and done for private and domestic use where the purpose is solely to enable it to be viewed or listened to at a more convenient time. Nor is copyright in any work included in the broadcast infringed.There is no time limit, although one of 28 days was proposed at one stage during the passage of the Bill through Parliament, but this was finally dropped because it was totally unenforceable. [emphasis added] If a norm neither regulates nor is enforceable, it will surely only be a matter of time before it ceases to be a norm. 114    It cannot be that copyright law would have thieves of us all. A construction of the copyright law in a manner that leads to widespread unenforceability would only serve to undermine the very regime upon which copyright relies. Given that there has already been open acknowledgment of enforceability issues with respect to the technological age, a precursor being the VCR, it seems sensible to me to construe the provisions of the Copyright Act in a manner that balances sanction with sense, and enforceability with efficacy. 115    At this juncture, it might be useful to consider a hypothetical (or, given the current pace of technological advance, even nascent) product. Suppose there existssoftwarethat enables one’s home computer to, in effect, behave like a VCR. This “virtual VCR” software isentirelylocal. It performs all of the functions of a VCR, infringing or non-infringing, and has to be purchased at a price. Would there be any sense in distinguishing this software from the VCR? More importantly, would there be any sense in distinguishing this software from a profit-free, non-commercial RecordTV system, which would essentially be a networked equivalent andwould not even have to be purchased at a price? 116    If, as was suggested in the course of the trial, it is a question of TV licence money, I do not think it would be too difficult for the programmers of a commercially neutered version of the plaintiff’s system to require potential end-users to enter the requisite TV licence numbers before they are permitted to log on to the Offending Website. (The analogy here is with cable television subscription fees.) This is a minor threshold objection, in any case, and in my view little should turn on it in the event of such a test case ever arising. 117    I do not think that manipulating outpaced legislation is the correct way forward for copyright lawyers, the courts and the copyright law. In general, fixation on the technical aspect of things seems to me a sure recipe for disaster. Technology changes, but simple legal principles do not. It is permissible to time-shift. It is not permissible to copy for profit. It is permissible to copy extracts for educational purposes. It is not permissible to authorise another to copy when one does not possess that authority. These are straightforward, immutable maxims that deal with practical results. To my mind, favouring traditional legal maxims in the digital agewillgive interested parties a good idea on how to conduct themselves. There is no needwhatsoeverto distinguish between the minutiae of whether a DVR operates locally or remotely, whether DVR technology is being implemented as a product or a service, or whether recording is done digitally or via analog means (although I am sure that the advent of “lossless” content reproduction is what has made content producers even more chary of theBetamaxdecision ([95]supra)). 118    To be sure, the proper reformation of copyright law to reflect the wide array of societal interests in the digital revolution will prove a formidable challenge to legislators, content industries and the public for some time to come. Eventually, copyright laws might well evolve to become completely unrecognisable. With a considered approach that eschews needless deference to copyright paradigms of the past, I am confident that a just and efficient outcome may be secured for future generations. 119    For the avoidance of doubt, I should state that this holding is a modest one. It finds only that any DVR or VCR product or service, operating for purposes of commercial gain, would be liable to content producers and providers for authorising end-user copying and unauthorised communication of the recorded programmes to the public. I leave open the possibility that such a DVR or VCR product or service, operating remotely or locally, digitally or via analog means, could amount to fair dealing under our Copyright Act when employedonlyfor the non-commercial facilitation of end-users’ time-shifting. As we have seen earlier at[115]above, it is inconsistent that the VCR is permitted to be sold at a price (in stores) but the RS-DVR (through advertising revenue)is not, but until the occasion requires, I shall not make any pronouncements on this anomaly. As has already been explicitly noted at[113]above, practicalities inform the copyright law as much as legal principles do. 120    In the result, I find that there is no defence of fair dealing available to the plaintiff, and that therefore the defendants succeed in their counterclaim for copyright infringement against the plaintiff for authorising the making of copies by end-users and communicating the MediaCorp Broadcasts and Films to the public. I therefore grant interlocutory judgment to the defendants with damages to be assessed by the registrar. I also grant the injunctions sought. 121    It follows that the plaintiff’s claim against the defendants for groundless threats of copyright infringement must fail. 122    Costs of the claim and counterclaim (except those occasioned by or in connection with the defendants’ claim of copyright infringement in respect of the backup copies) shall be paid by the plaintiff to the defendants, such costs to be taxed. _________________ [note: 1]DBAC, Tab 7 at [130]. The Supreme Court denied the film industry’s petition for certiorari on 29 June 2009. [note: 2]See generallyReligious Technology Center v Netcom On-Line Communication Serivces Inc907 F Supp 1361 (ND Cal, 1995). [note: 3]Singapore Journal of International & Comparative Law 1998 at pp 105–106. [note: 4]H Laddie, Prescott and Vitoria,The Modern Law of Copyright and Designsvol 1 (Butterworths, 3rd Ed, 2000), 418–419. [note: 5]Daniel Seng,Regulation of the Interactive Digital Media Industry in Singapore(2008) at 70, included as Chapter 5 of the monograph “Copyright Law, Digital Content and the Internet in the Asia-Pacific” (Fitzgerald, Gao, O’Brien and Shi eds), Sydney University Press 2008. [note: 6]Ibid. [note: 7]Singapore Parliamentary Debates, Official Reports (16 November 2004), vol 78 at col 1043. [note: 8]Singapore Parliamentary Debates, Official Reports (16 November 2004), vol 78 at col 1043. [note: 9]Singapore Parliamentary Debates, Official Reports (16 November 2004), vol 78 at cols 1042 and 1050. [note: 11]Justin Hughes, “Copyright Enforcement on the Internet – in Three Acts”, Working Paper for Fordham Conference at Cambridge 2009 at pp 21–22. Available online athttp://www.fordhamipinstitute.com/ip_conference/documents/JustinHughes_Copyright_Enforcement_on_the_Internet_in_Three_Acts.pdf (last accessed 30 September 2009, estimated to be published 2009–2010). [note: 11]William Patry, “The Cablevision Decision” (26 March 2007), available online athttp://williampatry.blogspot.com/2007/03/cablevision-decision.html, (last accessed 28 September 2009). [note: 12]Final Judgment,Paramount Pictures Corporation v ReplayTV, Inc Case Number: CV 01-09358 FMC (Ex) (SDNY 25 Aug 2006) at para 1 (granting dismissal by stipulation of the parties)."
    }
}