{
    "case_title": "AAE v AAF",
    "ncitation": "[2009] SGHC 104",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Matrimonial assets": "",
        "(i) The [XXX] and [YYY] properties": "4       The [XXX] property was the matrimonial home. It was purchased in 1994, shortly after the marriage. According to the Husband, it was the parties’ first and only matrimonial home. That assertion was not disputed by the Wife in any of her three affidavits. Nevertheless, at the hearing, the Wife tried without evidence to take a contrary position through her counsel, Mr Gregory Fong. The [YYY] property was acquired by the Husband in 2000. It was not disputed by the Wife that both properties were paid for in full by the Husband. The matrimonial home was bought with the Husband’s CPF moneys, cash savings and a housing loan. The [YYY] property was bought for $1.3m and was wholly paid for by the Husband with his share of the sale proceeds of a property at [ZZZ] (“the [ZZZ] property”). 5       Counsel for the Husband, Ms Loh Wai Mooi, argued that both the [XXX] property and the [YYY] property were not matrimonial assets as they were largely paid for with proceeds from the sale of pre-marriage assets. Specifically, the pre-marriage assets comprised the [ZZZ] property, which was acquired by the Husband and his brother in 1988, and his share of [AAA] (“the [AAA] property”). Additionally, Ms Loh argued that there had been no substantial improvement of either property during the marriage by either the Wife or by both parties. 6       The Husband’s father died in 1990 and he and five others inherited the [AAA] property. The Husband and his brother then took a loan from Citibank to buy over the other beneficiaries’ shares in the [AAA] property. That was in 1990. In 1994, the Husband and his brother sold the [AAA] property for $3.7m. The sale proceeds enabled the two brothers to fully discharge the loans taken by them for the purchase of both the [AAA] property and the [ZZZ] property. In the case of the Husband, this was done prior to his marriage to the Wife. 7       The brothers sold the [ZZZ] property in a collective sale in 1999. The next year, with his share of the sale proceeds of some $3m, the Husband went ahead to redeem the mortgage on the [XXX] property. He also bought the [YYY] property outright. I must mention that both properties were held in the names of the Husband and the Wife as joint tenants. 8       Ms Loh’s argument centred on the authority ofChen Siew Hwee v Low Kee Guan (Wong Yong Yee, co-respondent)[2006] 4 SLR 605(“Chen Siew Hwee”), where Andrew Phang J (as he then was) enunciated the law on the tracing of gifts acquired during the course of a marriage (at [57] – [58]): According to Judith Prakash J in the Singapore High Court decision ofAng Teng Siong v Lee Su Min[2000] 3 SLR 55… at [11], where a spouse receives an asset by way of gift or inheritance during the course of the marriage, “the owner of the gifted asset would have to show that itoriginated from the generosity of a third partyin order to prevent it from being divided upon divorce” …[W]here funds derived from a gift are used to acquire a new asset,this new assetwill qualify as an “asset … acquired … by gift” within the qualifying wordsunlessit can be shown that thedonee(here, the husband) has demonstrated anintentionthat the new assetshouldbe considered part of the pool of matrimonial assets. Put in another way, the new asset will be “acquired … by gift” if the donee intends the new asset to assume thesamenature of theoriginalasset,ie, that of being a gift. [Emphasis in original] 9       Ms Loh drew an analogy betweengiftsreceived by a spouse during marriage andassets purchasedutilising proceeds from the sale of pre-marriage assets. It was accordingly submitted that “the pre-marriage character of the [old] asset was retained in the new asset”. For that reason, Ms Loh contended, the [XXX] property and the [YYY] property were to be excluded from the pool of divisible assets. 10     The [XXX] property was the matrimonial home, and as such it is irrefutably a matrimonial asset. As for the [YYY] property, the reasoning advanced by Ms Loh is difficult to appreciate. Gifts from third parties and assets purchased with money obtained from the sale of pre-marriage assets (not gifted) are two completely different matters. Even taking, for the sake of argument, a gift analysis, the relation of the original gifted asset here – the [AAA] property – to the eventual two properties sought to be excluded from the matrimonial asset pool is, at best, remote. In the first place, only one-sixth of the [AAA] property was gifted to the Husband. At best only this one-sixth share, for the sake of argument, is possibly in issue but even then it is too negligible to be counted. In addition, the [XXX] property was not entirely paid for with proceeds from the sale of the [ZZZ] property and the [AAA] property (see[4]above). The [YYY] property was purchased with proceeds from the sale of the [ZZZ] property, which was in turn purchased from the proceeds from the sale of the [AAA] property (see[6]&[7]above). The entire connection is arguably convoluted. The most important fact was that the Husband registered the Wife as a joint tenant. The Husband’s conduct – permitting the Wife’s name to be included as a joint tenant - was strong evidence of the Husband’s intentionnotto have the two properties remain as non-matrimonial assets. His intention was to “integrate” his pre-marriage assets (including inheritance) into the pool of matrimonial assets. In this regard it is worth reiterating the rest of Phang J’s observations at [57] inChen Siew Hwee: In the context of the precise factual matrix in the present proceedings, it is clear, in my view, that the assets derived from the shares, albeit assuming different forms from the original gift, ie, the shares, nevertheless retained the essential quality of being gifts. It would be quite a different situation if the husband had utilised proceeds from the shares to purchasegifts for the wife or to otherwise utilise such proceeds for and on behalf of the family. [Emphasis in the original]",
        "(ii) Other assets in the Husband’s name": "11     Ms Loh argued that assets in the sole name of the Husband were not matrimonial assets. On the other hand, the Wife claimed a share of those assets. The main issue was whether the assets in question were “matrimonial asset[s]” within the meaning of s 112(10) of the Women’s Charter. 12     The Husband is a partner of the family business called [LY] Trading (“[LY] Trading”) which was started by the Husband’s father in 1983. The Husband’s partner is his brother and each owned an equal share in the business. It is not disputed by the Wife that the Husband works for the business and she had played no part at all in the business. The business premises of [LY] Trading were bought by the Husband’s father but it was later given in 1983 to the Husband and his brother for the business. The Wife accepted that the Husband’s share in the property was a gift from his late father and it was made before the marriage. I accepted Ms Loh’s submissions that the business and its physical premises were not matrimonial assets within the meaning of s 112(10). 13     At one time, the Husband and his brother owned as joint tenants three units in [GW] Building. They were purchased in 1985. One unit was sold before the marriage and the sale proceeds were utilised to repay the loans for the purchase of the units. A second unit (#[xx-xx]) was sold in 2007 leaving the third and last unit (#[yy-yy]) still in the joint ownership of the brothers. The Wife accepted that the three units were pre-marriage assets and they were never improved substantially during the marriage as required by s 112(10). I accepted Ms Loh’s submissions that the units were not matrimonial assets. The basis of the Wife’s claim was premised on a complete misconception that as long as the property was sold during the marriage, she was entitled to a share of the proceeds or the transformed asset, if any, on divorce. 14     The Husband had other assets worth $197,490 made up of shares and cash in banks and in his CPF account. He acknowledged that they had to be included in the pool of matrimonial assets for division on divorce.",
        "(iii) Wife’s assets and her failure to make full and frank disclosure": "15     In the Wife’s first Affidavit of Assets and Means, she declared two assets to her name: the [XXX] property and the [YYY] property. She made no voluntary disclosure of other assets and means, despite being given several opportunities to do so throughout the course of the ancillary proceedings. Eventually, through a protracted process of discovery sought by the Husband, the Wife’s total assets were estimated to be in the region of $965,040. This figure was gathered from the Wife’s own documents disclosed in discovery and, more importantly, was not seriously refuted by the Wife. In my view, the Wife has herself to blame for not producing other documentary evidence and counterpoints to challenge the figure computed by the Husband. The stance taken had been that there was no need to account for the moneys given by the Husband as they were not “assets acquired during the marriage”. The fallacy is in the argument. The moneys given by the Husband were in the nature of gifts to the Wife. They were of substantial amounts and seeing that there was no explanation as to what she did with the moneys, the total sum of $629,000 must be taken into account in the division (seeYeo Gim Tong Michael v Tianzon[1996] 2 SLR 1at 5). 16     I agreed with Ms Loh that the Wife had repeatedly failed to comply with her duty to make full and frank disclosure to the court concerning the particulars of her assets. In particular, the Wife had not accounted for (a) the moneys the Husband had given her over the years in the total sum of $629,000 of which $500,000 was given to the Wife in 1999; and (b) the sum of $124,000 being her share of the sale proceeds of the property at [MG] (“the [MG] property”) which she purchased with her sister. Of the sale proceeds, the Wife withdrew $123,317 from her UOB bank account. In addition, the Wife appeared to be involved in several companies but details of the nature of the businesses, her participation and income from the various enterprises were sketchy and incomplete. It is trite law that full and frank disclosure is important and in its absence the court is entitled to draw inferences adverse to the party who failed to make the disclosure: seeWee Ah Lian v Teo Siak Weng[1992] 1 SLR 688at 698-699. I noted inAu Kin Chung v Ho Kit Joo[2007] SGHC 150at [32]: The court’s power to divide matrimonial assets embodied in s 112 of the Women’s Charter is premised on the parties’ duty to provide full and frank disclosure of the assets acquired throughout the course of the marriage. Without proper disclosure of all matters relevant to the assessment of the financial position of the parties, the court will have difficulty arriving at a just and equitable division of the matrimonial assets. 17     The adverse inference to be drawn against the Wife was that she had more assets and more income than disclosed. In the absence of countervailing evidence and direct challenge from the Wife, it was from the figures of $965,040 (known assets in the Wife’s name) and $197,490 (the Husband’s other assets) that I worked out the appropriate division of matrimonial assets between the parties.",
        "Division of matrimonial assets": "18     Initially, the Wife sought an equal division of the matrimonial home and the other matrimonial assets but that changed at the hearing to 100% for the matrimonial home and 65-70% for the others. On the evidence before me, there was clearly no justification for the Wife’s claims. In relation to the matrimonial home at [XXX], the division was in the ratio of 25% to the Wife and 75% to the Husband based on the Wife’s indirect contributions of a non-financial nature. Theirs was a 13-year marriage, and I was prepared to treat the matrimonial home differently from other kinds of divisible assets like in some of the case law. To illustrate, inYeo Gim Tong Michael v Tianzon, the Court of Appeal affirmed the special status of the matrimonial home as an asset, agreeing with the trial judge in principle that a premium could be awarded to the former wife for being out of occupation (the former husband retained possession of the matrimonial home). This premium could take the form of a percentage of the total value of divisible assets. However, in the present case there was no basis for the Wife to seek a higher percentage seeing that before divorce proceedings were initiated, the Wife’s indirect contribution to the family and home had waned. She was oftentimes away in Malaysia leaving the Husband to look after the Child by himself in Singapore. The Husband had to housekeep and maintained the matrimonial home on his own. As divorce proceedings were underway, the Wife continued to spend time in Malaysia with her boyfriend. (For convenience, I shall hereinafter refer to the Wife’s boyfriend as “[HS]”.) 19     In respect of the remaining assets, including the [YYY] property, I was however inclined to be less generous. I took into consideration the Wife’s failure to make full and frank disclosure of her other assets throughout the proceedings, and for that reason, I awarded the Husband a larger percentage share of the remaining assets. Notably, details of the Wife’s assets and means were vague as the Wife was less than forthcoming with the relevant information. It was not disputed by the Wife that the Husband had given her $629,000 (aside from the usual monthly allowance). She did not account for the money despite being asked to do so several times in the Husband’s affidavits. What was equally clear was that the Wife was certainly more than a simple housewife with no prospects of re-employment. Her CPF Transaction History Statement showed that monthly contributions had been made to her CPF account from July 2006 to January 2007. She also admitted during cross-examination that she was working and had an income, although she did not disclose her exact income. The Wife further admitted to being the sole proprietor of “[YH] Enterprise”, a small business started in February 2005. She was also a partner of [HY] Trading. 20     An ACRA search disclosed that the Wife was, in fact, also involved in two other companies: as a shareholder of [CCC] Pte Ltd, and as an “existing owner” of [DDD] between July 1993 and April 1998. This last point was significant. It showed that the Wife had from an early stage been at least conversant with the ways of business. She was arguably not the “weak and docile” housewife that she had made herself out to be throughout the course of proceedings. 21     On the facts, taking all of the above matters into consideration, I awarded 15% of the remaining assets to the Wife and 85% to the Husband. Arising from each party’s share of the matrimonial assets as awarded in this paragraph and[18]above, the Wife is to pay the Husband the sum of $402,760.50 (based on Ms Loh’s unchallenged calculations).",
        "Maintenance": "22     By way of background facts, on 27 February 2007, Maintenance Order No. MO [XXX/XXXX] was granted on the Wife’s application. The Husband was ordered to pay $800 monthly maintenance to the Wife. On 10 April 2008, District Judge Jocelyn Ong (“District Judge Ong”) on the Husband’s application varied the Wife’s maintenance to $1 per month with effect from 1 January 2008. The Wife did not appeal against the variation Order. It is relevant that the Wife conceded during cross-examination that she had earlier, at the hearing of Maintenance Order No. [XXX/XXXX], misled District Judge Ong into believing that she was a housewife with no income. Her deception was the reason for the reduction of maintenance to $1 per month. 23     The Wife sought a monthly maintenance of $4,500. In the alternative, she asked for a lump sum maintenance payment of $150,000. However, the figure of $150,000 was later attenuated to “such reasonable sums as the Honourable Court may decide”. 24     In view of the earlier discussion concerning the Wife’s assets and means, as well as her less than frank disclosure of the same which gave rise to the inference that the Wife had the means to support herself, I was satisfied that no maintenance should be payable by the Husband to the Wife. It must be remembered that she deliberately misled District Judge Ong in her application for interim maintenance (see[22]above) and that incident tarnished her credibility. In fact, the evidence indicated that she was financially independent, and in business with [HS]. Even as divorce proceedings were underway, the Wife had continued her relationship with [HS]. The Wife had also not refuted the Husband’s assertion that [HS] is the Child’s biological father. In this judgment, the Wife was given custody, care and control of the Child. I now turn to the question of custody and maintenance of the Child.",
        "Custody and maintenance of the Child": "25     The Child was born on 25 July 1994. The Health Sciences Authority DNA Report (dated 5 December 2006) confirmed and excluded the Husband as the Child’s biological father. Crucially, in cross-examination, the Wife accepted the DNA report and its conclusion that the Husband is not the Child’s biological father. She also had not refuted the Husband’s assertion in his affidavit that [HS] is the Child’s biological father (see[31]below). There was no need to consider s 114 of the Evidence Act (Cap 97 Rev Ed 1997) since the paternity of the Child was not disputed. As an aside, I should mention the recent case ofWX v WW[2009] SGHC 70. In that case, Lee Seiu Kin J reasoned that the presumption of legitimacy in s 114 is confined to the status of the child alone; paternity of itself - whether the child is an issue of the husband -.is a different matter and falls outside the provision. The distinction was made to get around the evidential restriction in s 114. 26     The Husband sought no orders with respect to the Child. As the Wife is the biological mother custody, care and control of the Child was awarded to the Wife. 27     I now turn to the Wife’s application for maintenance of the Child. Of relevance is s 127(2) read with s 70(1) of the Women’s Charter. Section 70 imposes a duty to maintain a child accepted as a member of the family in the following circumstances: 70. – (1) Where a person has accepted a child who is not his child as a member of his family, it shall be his duty to maintain that child while he remains a child, so far as the father or the mother of the child fails to do so, and the court may make such orders as may be necessary to ensure the welfare of the child. (2) The duty imposed by subsection (1) shall cease if the child is taken away by his father or mother. 28     The Husband argued that he was under no duty to maintain the Child under s 68 of the Women’s Charter since he was not the biological father, and the Wife had accepted the scientific evidence. Furthermore, he was under no duty to maintain the Child under s 70(1) as he did not accept the Child as a member of his family. In other words, he could not have accepted the Child as a member of his family prior to the DNA test results as he had never applied his mind to the matter of his paternity. There was no question of him “simply changing his mind”, as there was previously no conscious decision in accepting the responsibility of bringing up another man’s child (as was the case inEB v EC[2006] 2 SLR 137) in the first place. The Husband was misled by the Wife throughout the 13 years of marriage into believing that he was the biological father of the Child. 29     InEB v EC[2006] 2 SLR 137, Woo Bih Li J endorsed the following argument from Leong Wai Kum,Principles of Family Law in Singapore(Butterworths Asia, 1997) at 861: The basis of a parent’s duty lies, if one likes, in the decision to be a parent in the first place. The basis under section 70(1) [for a non-parent’s duty to maintain a child accepted as a member of the family], though, is the person voluntarily assuming this responsibilitywhen he or she had a real choice whether to do so. By accepting the child as a member of his or her family, he or she has represented to the child that he or she accepts the duty of maintenance of the child. If the child’s [biological] parents fail in it, the courts may enforce the responsibility which the adult had assumed. [Emphasis added] Woo J stated at [21] that “once a person has accepted a child as a member of his family and hence has accepted the responsibility under s 70(1), he cannot abandon the responsibility simply by changing his mind”. 30     Ms Loh’s submitted that after the Husband became aware of the Child’s paternity, he declined responsibility to maintain the Child. I did not agree with Ms Loh’s characterisation of the issue. Notably, it was only after the DNA test results that a fact arose to enable the Husband to exclude the operation of s 68 of the Women’s Charter and to confine the issue to 70(1). As Woo J stated inEB v ECat [15], the definition of “child of the marriage” in s 92 applies to Part X and not Part VIII of the Women’s Charter. The question then was whether the Husband had treated the Child as a member of his family after he found out that he was not the biological father. Section 70(1) has none of the time stipulations found in s 92. I found, on the evidence, that after the DNA tests results, the Husband still openly accepted the Child as a member of his family. From the Husband’s affidavits filed in 2007, even as divorce proceedings were under way, the Wife spent most of her time in Malaysia, leaving the Husband at home to look after the Child. To his credit, the Husband continued to nurture and care for the Child as before. The Wife did not dispute the Husband’s devotion to the Child before and after the release of the DNA test results. 31     Mr Fong tried to distinguish the case ofEB v ECon the ground that the biological father in that case was known. At the hearing, Mr Fong asserted that the Child biological father is unknown. Mr Fong’s submission onEB v ECis without merit as that was not theratio decidendiof Woo J’s decision. Furthermore, Mr Fong’s contention that the Child’s biological father was not known is not supported by the evidence. Besides, it is difficult for the Wife to run that point now having chosen not to answer the Husband’s allegation that [HS] is the Child’s biological father despite obtaining leave of court on no less than two occasions to do so. 32     I agreed with Ms Loh that the claim for maintenance in respect of the Child appeared to be an afterthought in that the Wife had not sought maintenance for the Child in her very first application for maintenance in MSS [XXXX/XXXX]. In addition, she had not sought maintenance for the Child in her three affidavits. Her claim for an order to maintain the Child was raised in her counsel’s submissions. 33     InEB v EC, the wife (the petitioner) was drawing a salary of $1,703 a month and had to look after three children, A and B from a previous marriage and C, who was the husband’s own child. Despite this, Woo J stated at [26]-[28]: However, the duty to maintain does not always lead to an order to maintain. The power to order maintenance under s 127(1) also includes the power not to order maintenance. … In the circumstances, it does not seem right to me that the burden should then be permanently imposed on the respondent by making an order of maintenance against him until A and B are 21. In the event, maintenance for A and B was ordered to cease less than 2 years after divorce proceedings began. 34     I agreed with Woo J that past a certain point, it is good sense that a mother should seek maintenance for her child from the biological father. Woo J inEB v EChas this to say on the matter at [28]: … I note from a perusal of the petitioner’s affidavits that she said that since July 2003, she was no longer deriving rental of $900 per month from an HDB flat which she owns as she was cautioned by HDB about unauthorised subletting. Perhaps this was the reason why she had thought in March 1999 that she could cope financially without seeking an order for substantial maintenance from the biological father. However, even if that were so,and even if the circumstances have changed, should she not be seeking maintenance from the biological father instead of the respondent?[Emphasis added] 35     Section 70(1) provides that maintenance should be first sought from the biological parents. In the present case the biological father is still in a relationship with the Wife. There was also no evidence that the Wife would not be able financially to maintain the Child. As regards the Husband, no order to maintain the Child was the proper order to make in the circumstances of the present case.",
        "Conclusion": "36     In view of the various considerations above, I made the orders set out in[2]above."
    }
}