{
    "case_title": "Gelatissimo Ventures (S) Pte Ltd and Others v Singapore Flyer Pte Ltd",
    "ncitation": "[2009] SGHC 235",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "The facts": "2       The defendant is the operator of the Singapore Flyer (“the Flyer’), which is the world’s largest giant observation wheel. It is also the landlord of the retail terminal at 30 Raffles Avenue that surrounds the Flyer. 3       The plaintiffs are the tenants at the retail terminal. The plaintiffs entered into tenancy agreements with the defendant in the period between September 2007 and February 2008. 4       On 23December 2008, the Flyer stopped revolving due to a technical malfunction. Operations at the Flyer were suspended for one month and the Flyer reopened on 26 January 2009. The plaintiffs subsequently filed in Originating Summons No 291 of 2009, Summons No 1936 of 2009 (“the application”) against the defendant for pre-action discovery pursuant to Order 24 Rule 6(1) of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (“the Rules”). 5       The defendant resisted the application by countering,inter alia, that the plaintiffs already had sufficient information to commence proceedings. Further, the defendant claimed that the plaintiffs had a collateral purpose in seeking discovery because their true motive was to feed any discovered documents to the press. The defendant relied on the affidavit filed by Yeo who is the Centre Manager of the Flyer, to support its argument. In particular, it relied on certain paragraphs in Yeo’s affidavit which made reference to an email thread between the plaintiffs and their solicitor Navinder Singh (“NS”). 6In his affidavit, Yeo asserted that the plaintiffs were seeking to abuse the court process by the application. He then set out the text of an email from NS to the plaintiffs on 27 February 2009 to support his assertion. 7Upon receipt of Yeo’s affidavit, NS filed an affidavit on 24 April 2009. Essentially, NS claimed that the email in question which was part of an email thread contained privileged communications and he sought to expunge the portions of Yeo’s affidavit that made reference to it.",
        "The circumstances under which the defendant obtained the email thread": "8       The defendant received the email thread from Mr Jawahar Ali (“Jawahar”) of Shalimar Palace which is a tenant of the defendant. Jawahar was also originally one of the plaintiffs until 4 March 2009 when he informed them of his intention to withdraw from the legal action against the defendant. Following his withdrawal, Jawahar sent an email to the defendant to confirm that he would not be taking further action against them. The defendant came into possession of the email thread because the email it received from Jawahar contained the entire email chain between the plaintiffs and NS.",
        "Counsel’s submissions": "9       The plaintiffs claimed that the email thread was privileged and that the defendant should not be allowed to admit it as evidence of the communications between NS and the plaintiffs. 10     The defendant did not contest the privileged nature of the email thread. However, it claimed that the privilege had been waived when Jawahar forwarded the email to the defendant without reservations. In the alternative, the defendant relied on the case ofCalcraft v Guest[1898] 1 QB 759 to contend that the privilege in a document is lost once it has been disclosed. Finally, the defendant argued that even if the privilege in the email had not been waived or lost, the court should not enforce the privilege because it fell within the fraud exception.",
        "Issues raised": "11     The defendant’s appeal raised the following issues: (a)What was the status of the email thread?(b)Had the privilege in the email thread been waived?(c)What was the effect of inadvertent disclosure of a privileged document to an adversarial party?(d)Did the email thread fall within the ambit of the fraud exception under s 128(2) of the Evidence Act (Cap 97, 1997 Rev Ed) (“the EA”)?  The status of the email thread 12     Legal professional privilege can be divided into legal advice privilege and litigation privilege. Legal advice privilege is contained in s 128 of the EA. It covers all communications between a party and his lawyer. Litigation privilege exists in s 131 of the EA by virtue of the common law. It covers all communications between a party and his lawyer as well as with other third parties that were made for the predominant purpose of litigation (seeSkandinaviska Enskilda Banken AB (Publ), Singapore Branch v Asia Pacific Breweries (Singapore) Pte Ltd and Other Appeals[2007] 2 SLR 367(“Skandinaviska”)). 13     In this case, the email thread was part of the communication between the plaintiffs and their solicitor. Hence, there was little doubt it fell within the ambit of legal advice privilege under s 128 of the EA. At the same time, the communication in the email was made for the predominant purpose of preparing for litigation against the defendant. Consequently, it was also protected by litigation privilege under s 131 of the EA 14     Among the emails included in the email thread, there was one sent by NS to the plaintiffs (including Jawahar) on 19 February 2009 at 20:41, that said: …I have to emphasise we are ALL bound by strict confidentiality and any disclosure to the management of what we discuss will not only prejudice our case but incur personal individual liability for the common law tort of breach of confidence. I can easily persuade a judge to compel disclosure of sources of confidential information the Flyer was not supposed to have.  15     Looking at the above email, I was of the view that whatever information that was exchanged between NS and the plaintiffs was done in circumstances that imposed on all parties a duty of confidentiality. That must have been clear to the defendant when it saw the email thread. Privilege aside, the email thread constituted confidential information and was prima facie eligible for protection against unauthorised disclosure or use. 16     It should be noted that privilege and confidentiality are two separate legal doctrines that entail different legal consequences. Since the email thread constituted both privileged and confidential information, the defendant could not use it unless it was able to show why both the privilege and confidential nature of the documents had been lost. Had the privilege in the email thread been waived? 17     It was not disputed that NS was jointly retained by the plaintiffs (including Jawahar) for the purpose of commencing legal action against the defendant. Accordingly, the privilege that attached to the email thread was owned jointly by the plaintiffs and could only be waived if all of them agreed to do so. (seeRe Konigsberg (A Bankrupt)[1989] 1 WLR 1257; The Sagheera[1997] 1 Lloyd’s Rep. 160). 18     In this case, it was not clear whether Jawahar intended to waive the privilege in the email thread when he sent it to the defendant. What was clear, however, was that the remaining plaintiffs had done nothing to show that they would be willing to waive the privilege in respect of the email thread. Indeed, I would be surprised if they had done so. 19     Accordingly, I find that the plaintiffs did not waive their privilege in relation to the email thread. Did the inadvertent disclosure of the email thread affect its privileged status? 20     Counsel for the defendant had relied on the case ofCalcraft v Guest(supra10) as well asWebster v James Chapman & Co (a firm)[1989] 3 All ER 939 to support his argument that even if the information contained in the email thread was privileged, secondary evidence of that communication (ie, the email thread) could be produced in evidence. 21     I did not think that the principles cited in those two cases represented the status of the law of privilege in Singapore. First, the applicability ofCalcrafthad been doubted by the Singapore High Court inTentat Singapore Pte Ltd v Multiple Granite Pte Ltd and Others[2009] 1 SLR 42“Tentat”]. In that case, Kan Ting Chiu J, having reviewed various authorities on the effect of inadvertent disclosure of privileged documents, stated at p 53 para [38] that AlthoughCalcraftis established law, uncertainties remain over its rationale and application.Ashburton, on the other hand, is clear in allowing a party to object to the use of privileged documents or copies of such documents.Ashburtonis uncomplicated on its own; it is its relationship withCalcraftthat is challenging”. 22     Secondly, the learned judge pointed out that the Australian High Court inBaker v Campbell49 ALR 385 had refused to applyCalcraft, while the New Zealand Court of Appeal inR v Uljee[1982] 1 NZLR 561had stated clearly that it did not regardCalcraftas standing for the proposition that secondary evidence of privileged documents was admissible. 23     Thirdly, looking at the actual decision inTentat, it seemed clear that Kan J had actually rejected the principles stated inCalcraftin favour of a more protective attitude towards privileged documents. InTentatthe plaintiff had applied for summary judgment against the defendant. One of the defendant’s witnesses included within his affidavit an email communication from the plaintiff’s solicitors to the plaintiff. The plaintiff applied for a declaration that the e-mail was privileged communication and that the defendant be restrained from further use of the e-mail. It also applied for all references by the defendant to the e-mail to be struck out and copies of the e-mail to be delivered up or destroyed. 24     Kan J (adopting the principles laid down inGoddard And Another v Nationwide Building Society[1987] QB 670), held that the defendant could be restrained from using secondary evidence of the privileged documents. In his view, since the documents had not yet become a part of the record in any court proceedings or had otherwise been released into the public domain, it was not too late to preserve the privilege in them. 25     I was of the opinion that the decision inTentataccurately represented the law relating to the inadvertent disclosure of privileged documents in Singapore. 26     Similarly, in this case, the defendant had sought to adduce evidence of privileged communications between the plaintiffs and their solicitor. The communication had not yet been used in any court proceedings and neither had it been released into the public domain. There was no reason why the court should not preserve its privileged status by preventing the defendant from using the same. Accordingly, I held that the defendant should not be allowed to refer to the e-mail at[6]. Did the email thread fall within the ambit of the fraud exception under s 128(2) of the Evidence Act? 27The final argument raised by the defendant was that the privilege in the email thread should be stripped because it evidenced iniquitous behaviour and/or an abuse of process. According to the defendant, the email sent by NS to the plaintiffs at [6] showedinter aliathat (a)Contrary to the affidavit filed by Yip Gim Hock (“Yip”) on behalf of the plaintiffs on 11 March 2009, the plaintiffs had already been advised they had a valid claim against the defendant; and (b)The plaintiffs intended to release to the press information that they obtained from the defendant. 28     At this junction I need to make one observation. The EA should have been the logical starting point when one is faced with a legal issue relating legal privilege and the circumstances in which it will be stripped. Common law authorities serve as a useful guide in interpreting the provisions of the EA only if they are not inconsistent with any of the provisions in the EA (see s 2(2) of the EA). However, counsel for the defendant cited numerous cases from common law countries but made no reference to the EA.",
        "The application of the fraud exception to s 128 and s 131 of the EA": "29     There is no doubt that legal advice privilege is subject to certain exceptions. The relevant provisions of the EA read as follows: Professional communications128. —(1) No advocate or solicitor shall at any time be permitted, unless with his client’s express consent, to disclose any communication made to him in the course and for the purpose of his employment as such advocate or solicitor by or on behalf of his client, or to state the contents or condition of any document with which he has become acquainted in the course and for the purpose of his professional employment, or to disclose any advice given by him to his client in the course and for the purpose of such employment.(2) Nothing in this section shall protect from disclosure —(a) any such communication made in furtherance of any illegal purpose;(b) any fact observed by any advocate or solicitor in the course of his employment as such showing that any crime or fraud has been committed since the commencement of his employment.Confidential communications with legal advisers131. No one shall be compelled to disclose to the court any confidential communication which has taken place between him and his legal professional adviser unless he offers himself as a witness, in which case he may be compelled to disclose any such communications as may appear to the court necessary to be known in order to explain any evidence which he has given, but no others.  30     Section 128(2) of the EA expressly provides that legal advice privilege will not apply to “any communication made in furtherance of any illegal purpose” and “any fact observed by any advocate or solicitor in the course of his employment as such showing that any crime or fraud has been committed since the commencement of his employment.” Hence, it is clear that legal advice privilege is subject to the “fraud and crime” exception. 31     The position with regard to litigation privilege is less clear. Section 131 of the EA (which has been interpreted by the Court of Appeal inSkandinaviskaas incorporating litigation privilege) is drafted differently from s 128 in that it does not contain any exceptions. A literal interpretation of s 131 would seem to suggest that litigation privilege is an absolute privilege that cannot be overridden in any circumstances. 32     However, a literal interpretation of s 131 would lead to an absurd result. As the Court of Appeal inSkandinaviskapointed out, the policy considerations behind litigation privilege and legal advice privilege are that people should be able to obtain professional legal advice on their rights and liabilities, as well as for proper conduct of court proceedings. It would not make sense for litigation privilege to be an absolute privilege while legal advice privilege is subject to the fraud and crime exceptions. 33     Further, as the Court of Appeal stated inSkandinaviska, litigation privilege exists in s 131 by virtue of the common law. Hence, it must be subject to its common law exceptions. Accordingly, we must look at the common law in order to determine the scope of the exceptions that are applicable to litigation privilege. 34     For some time now, there was confusion as to whether the fraud exception was applicable to both legal advice privilege and litigation privilege. The reason for this was that the fraud exception applied only to cases of prospective fraud, and cases where the fraud continued even after the commencement of litigation tended to be comparatively rare. However, inKuwait Airways Corporation v. Iraqi Airways Company[2005] 1 WLR 2734 [“Kuwait Airways”], the English Court of Appeal confirmed that the common law of litigation privilege had always been subject to the fraud exception. The Court of Appeal held at p 2746: Does the fraud exception apply to litigation privilege as well as legal advice pivilege?The answer has to be that it does. One can take two separate examples. First the case of an inquiry made to a solicitor in furtherance of a criminal purpose before any proceedings are contemplated eg a conspiracy to deprive a widow of her savings or a company of its assets. No privilege attaches to that inquiry at the time that legal advice is sought. It may be correct to say that the fraudsters do not contemplate litigation but litigation does unsurprisingly take place. In the course of the litigation, the conspiracy has to continue and may well, indeed, be \"improved\" by the concealment of evidence that does exist or the invention of evidence that does not exist. That is all in furtherance of the conspiracy that constitutes the antecedent transaction. It would be little short of absurd to say that the fraud exception applies until litigation is contemplated but thereafter it does not apply. Furthering the same criminal purpose after litigation begins (or is contemplated) cannot attract privilege any more than the original criminal purpose did. This is shown by civil fraud cases such asDubai Bank Ltd v Galadari (No 6), The Times, 14 October 1992; Court of Appeal (Civil Division) Transcript No 892 of 1992 where there was an undoubted antecedent fraud but the fraud exception continued to apply to prevent privilege being used to \"stifle\" that antecedent fraud, see p 23 of the transcript with which we have been provided.Secondly, take a criminal purpose which only came into existence after litigation has begun. On the authority of theSnaresbrookcase [1988] QB 532 and theFranciscase [1989] AC 346 merely giving to a solicitor an untrue statement about issues in the proceedings will not forfeit privilege. But a criminal conspiracy, particularly if it is separate from the actual issues in the proceedings albeit (inevitably) related to them, will be a self-standing criminal purpose outside the issues in the proceedings and privilege will not attach; that is shown by theHallinancase [2005] 1 WLR 766.” 35     The strength of the above position was reinforced by the fact that the Australian and the Canadian courts have always treated litigation privilege and legal advice privilege as part of the general category of legal professional privilege that is subject to the fraud exception. [seeIn the Matter of ACN 005 408 462 Pty Ltd (formerly TEAC Australia Pty Ltd)[2008] FCA 964; Blank v. Canada (Minister of Justice)[2006] 2 S.C.R. 319]. In fact, I am not aware of any common law jurisdiction which does not recognize some form of fraud and crime exception to the application of litigation privilege. 36     Accordingly, I am of the view that both legal advice privilege and litigation privilege under s 128 and s 131 of the EA are subject to the fraud exception.",
        "The ambit of the fraud exception": "37     The next issue that had to be resolved was the ambit of the fraud exception. More precisely, was the fraud exception wide enough to cover activities other than criminal and civil fraud? 38     There have been no local cases dealing with the fraud exception in s 128 of the EA. Consequently, I will have to refer to UK decisions in order to determine the scope of s 128(2) as well as the current state of the law. As it is not desirable to transplant English decisions into s 128(2) without considering the context in which they arose, I shall also refer to Australian and Canadian decisions to see how other common law jurisdictions have dealt with the problem. English cases 39     There is no doubt that the fraud exception is applicable to criminal fraud (See R v Cox and Railton(1884) 14 QB 153 at 165). The same principle also applies to cases of civil fraud (Williams v Quebrada Railway, Land and Copper Company(1895) 2 Ch 751; O’Rourke v Darbishire[1920] AC 581). However, due to the fact that the ingredients of fraud have never been clearly laid down by the courts, there is some doubt as to how far the fraud exception can be extended to cover cases falling outside the tort of deceit. 40     InCrescent Farm (Sidcup) Sports Ltd v Sterling Offices Ltd[1972] Ch 553, Goff J held at p 565 that the exception covered all forms of dishonesty such as fraudulent breach of trust, fraudulent conspiracy, trickery and sham contrivances. However, it did not apply to the tort of inducing a breach of contract or common conspiracy. Similarly, inGamlen Chemical Co. (U.K.) Ltd. v. Rochem Ltd And Others[1983] RPC 1Goulding J emphasized the exceptional nature of the exception and held at p 7 that Great stress is laid–particularly by Mr Hamilton–on the importance (as Goff J pointed out) of not extending the exception to the privilege of professional communications, which is essential to the fair working of our system of justice and the proper protection of individual interests. That is very true, but it is equally important, in my judgment, not to whittle down the existing protection given to victims of fraud; otherwise in many cases there would be no hope of an injured plaintiff ever obtaining the necessary material for defining and proving the wrong that he has suffered by secret and dishonest combinations. 41     Amidst these cautionary statements, the case ofBarclays Bank plc and Others v Eustice and Others[1995] 1 WLR 1238 [“Barclays”] stands out in so far as it suggested that the fraud exception was capable of covering iniquitous conduct falling short of dishonesty. InBarclays, the plaintiff bank (“the bank”) sought declarations to set aside certain transactions entered into by the defendant as transactions at an undervalue that were voidable under s 423 of the UK Insolvency Act 1986. The bank alleged that the defendant had entered into these transactions at a time when insolvency proceedings were imminent and his purpose was to remove assets from the reach of the bank. The bank then sought disclosure of communications between the defendant and his solicitors in relation to the transactions in order to prove that the defendant’s purpose in entering into the transactions was to put the assets out of the reach of creditors. 42     The defendant claimed that the fraud exception did not apply because there was no dishonesty involved in his seeking advice from his lawyer as how to structure a transaction. This was rejected by Schiemann LJ who opined at 1250–1252: …Mr. Morgan…went on to submit that the case law had in effect confined the possibility of lifting the privilege to cases where there was dishonesty.I reject this submission. Scott J. was not concerned with whether legal professional privilege should be lifted. His use of the word \"dishonest\" was not in that context. In any event he was merely indicating that he was prepared to accept something which he did not need to decide and which had been submitted by the losing party. Moreover, as I have indicated, various words other than \"dishonest\" have been used in the course of the cases in which privilege has been in issue. However to me the most important consideration is that we are here engaged not in some semantic exercise to see what adjective most appropriately covers the debtor's course of conduct but in deciding whetherpublic policyrequires that the documents in question are left uninspected……we start here from a position in which, on a prima facie view, the client was seeking to enter into transactions at an undervalue the purpose of which was to prejudice the bank. I regard this purpose asbeing sufficiently iniquitous for public policyto require that communications between him and his solicitor in relation to the setting up of these transactions be discoverable.[emphasis added] 43     The nature of the public policy principle enunciated by Schiemann LJ did not seem to bear any connection to the fraud exception. In particular, it changed the focus of the analysis from the dishonesty of the party claiming the privilege to the importance of upholding the policy considerations behind the insolvency law. Personally, I do not think that this case falls within the ambit of the word “fraud” as it is commonly understood. It may be more appropriate to term it the “public policy” exception. The case of Re Derby 44     Ironically, barely a year afterBarclayswas decided, there was a marked retreat from the policy approach to the more absolute view of legal privilege, taken by none other than the House of Lords itself. InR v Derby Magistrates’ Court, Ex p B[1996] 1 AC 487 (“Re Derby”), the accused was charged with the murder of a girl that had occurred almost 15 years ago in 1978. In 1978, his step-son had been charged for the murder of the same girl but had been acquitted after he turned prosecution witness against the accused. The accused sought discovery of the communications between his step-son and the step-son’s lawyer in order to challenge the credibility of the statements that the step-son had given to the prosecution after he turned prosecution witness. There was no doubt that these communications, if they turned out to be inconsistent with the statements given to the Prosecution, would strengthen the accused’s defence materially. Hence, the law lords were faced with the question of whether the legal privilege that protected those communications could be lifted in order to facilitate the accused’s defence. 45     The law lords did not consider the application of the fraud exception because there was clearly nothing that could be analogized to fraud or dishonesty. Neither was the fraud exception raised by counsel for the accused. Instead, counsel argued that the question of whether legal privilege could be lifted in any particular case was to be determined by weighing the importance of the privilege against some other consideration of even greater importance. 46     The law lords rejected the balancing approach in an unanimous decision. Taylor CJ, using some of the most absolute language ever spoken in the House of Lords said at p 508: …the drawback to that approach [the balancing approach] is that once any exception to the general rule is allowed, the client's confidence is necessarily lost. The solicitor, instead of being able to tell his client that anything which the client might say would never in any circumstances be revealed without his consent, would have to qualify his assurance. He would have to tell the client that his confidence might be broken if in some future case the court were to hold that he no longer had \"any recognisable interest\" in asserting his privilege. One can see at once that the purpose of the privilege would thereby be undermined…it by no means follows that because a balancing exercise is called for in one class of case, it may also be allowed in another. Legal professional privilege and public interest immunity are as different in their origin as they are in their scope.Putting it another way, if a balancing exercise was ever required in the case of legal professional privilege, it was performed once and for all in the 16th century, and since then has applied across the board in every case, irrespective of the client's individual merits.[emphasis added] 47     The rejection of the balancing approach was further emphasized by Lord Lloyd who opined at pp 509–510: …the courts have for very many years regarded legal professional privilege as the predominant public interest. A balancing exercise is not required in individual cases, because the balance must always come down in favour of upholding the privilege, unless, of course, the privilege is waived.…There may be cases where the principle will work hardship on a third party seeking to assert his innocence. But in the overall interests of the administration of justice it is better that the principle should be preserved intact. 48     At this point, the question may be asked: SinceRe Derbyreiterate the absolute nature of legal privilege in such strong terms, did it not overrule theBarclayscase which advocated a policy reasoning approach to the question of legal privilege? The simple, albeit unsatisfactory, answer to this question is that theBarclayscase arose too late for their lordships to consider it inRe Derby(as stated by Lord Lloyd at p 510 in[47]above). 49     Even if their lordships had considered theBarclayscase, they may not necessarily have deemed it to be inconsistent with their judgment inRe Derby. Although Schiemann LJ’s judgment inBarclayshad the practical effect of advocating a policy analysis to the question of legal privilege, that was in the context of the fraud exception. In other words,Barclayscan be regarded as advocating a policy balancing exercise in defining the outer limits of what constitutes fraud for the purpose of lifting legal privilege. Since the House of Lords inRe Derbydid not challenge the validity of the fraud exception,Re Derbyis technically not inconsistent with theBarclayscase. 50     I use the word ‘technically” to emphasize what I regard is an unsatisfactory state of affairs. Given the overriding importance which the law lords inRe Derbygave to the status of legal privilege, one would have thought that the fraud exception itself would have come under some form of attack. After all, the existence of the fraud exception is itself based upon the policy consideration that it is not in the interests of justice to protect communications made in furtherance of a fraudulent or criminal purpose. Unfortunately, their lordships sidestepped this question with a technical answer. Taylor CJ, referring to the case ofBalabel v Air India[1988] Ch 317, suggested at p 507 that the fraud exception did not require the courts to balance legal privilege against some other interest. Rather, advice given to further a fraudulent or criminal purpose did not become privileged at all because it does not fall within the ordinary scope of professional employment. 51     I am of the view that it is neither necessary nor desirable to couch the fraud exception as something that is based on the “ordinary scope of professional employment.” As Professor Colin Tapper pointed out in his criticism ofRe Derbyin his article, ‘Prosecution and Privilege’ 1 Int’l J Evid & Proof 5 (1996–1997) at p 20 …far from being absolute legal professional privilege is also subordinated to some other quite different policies, such as the propriety of legal proceedings, the interests of children and the reputation of a legal advisor. It is not obvious why all of these interests should be regarded as so much stronger than that of the accused in securing access to material to help prove him to be innocent of a, perhaps serious, crime.Nor is it very obvious how these exceptions cohere with the justifications advanced for the rule. The longest established is that which exempts communications with a lawyer with a view to the commission of a relevant wrong. This seems to have little connection with discouragement of communication with a lawyer, and more with quite extrinsic policies.[emphasis added] 52     In an age where lawyers are increasingly tasked to undertake a myriad of tasks that may not be directly relevant to the practice of law, it is not realistic to define the fraud exception according to age old notions of what lawyers do. More importantly, doing so obscures the true nature of the debate, which essentially boils down to a question of how much importance society should place on the value of legal privilege, especially when doing so comes at the expense of other important social values. Australian cases 53     By and large, the Australian courts have consistently adopted a policy oriented approach towards legal privilege and the circumstances in which it will be lifted. InAttorney-General (N.T.) v Kearney, (1985) 158 CLR 500 [“Kearney”], it was alleged that a governmental authority had drafted a regulation in order to evade the provisions of a statutory compensation scheme. The Australian High Court was faced with the question of whether the legal advice sought by the governmental authority that was prima facie covered by privilege could be discovered under the fraud exception. Counsel for the governmental authority argued that the fraud exception was not applicable because even if a public body has actedultra viresor with bad faith, this cannot in anyway amount to dishonesty or fraud. 54     Gibbs CJ, who wrote the majority judgment, rejected the government’s argument. First, the learned judge held that the exceptions to legal privilege were not merely confined to crime or fraud, and could be extended to other situations where there was an attempt to frustrate the processes of the law. Second, he opined that even if the exception was limited to fraud, it was possible to widen the ambit of the exception by takinga broad definition of the word “fraud” to include anything that may be described as a fraud on justice. Third, he suggested that the proper approach to take in determining whether privilege should be lifted in a particular case should be to weigh the policy considerations justifying the existence of legal privilege and those in favour of disclosure. 55     Subsequent Australian cases have built on the principles laid out inKearneyto widen the scope of the possible exceptions to legal privilege. For example, the idea of expanding the definition of fraud to include anything that amounts to a “fraud on justice” has been adopted by cases such asIn the Matter of ACN 005 408 462 Pty Ltd (formerly TEAC Australia Pty Ltd)[2008] FCA 964; Gartner v Carter[2004] FCA 258 andAWB Ltd v Cole (No 5)[2006] FCA 1234 [“AWB Ltd”]. 56     Most significantly, there has been a greater willingness to regard legal privilege not as an immutable doctrinal principle but as a rule based on policy considerations that can be lifted if there are more important policy aims. InAWB Ltd, the Federal Court of Australia held at [215] that It is important to bear in mind that the fraud exception is based on public policy grounds. The principle is sufficiently flexible to capture a range of situations where the protection of confidential communications between lawyer and client would be contrary to the public interest… 57     It is clear that the Australian courts have rejected the absolute nature of legal privilege as laid down inRe Derby. Instead, they have adopted an approach that requires the policy behind legal privilege to be weighed against other important public interests. Canadian cases 58     The Supreme Court of Canada has suggested that the question of legal privilege and its exceptions should be determined by weighing the competing public policy considerations in individual cases. InSmith v. Jones169 D.L.R. (4th) 385, the accused was charged with aggravated sexual assault of a prostitute. His lawyer referred him to a psychiatrist for an assessment, for purpose of preparing submissions on sentencing. The psychiatrist was of the opinion that the accused was a dangerous person as the accused described in considerable detail his plan for killing prostitutes in a specific district. The lawyer decided that the psychiatrist’s findings should not be tendered to the court in the sentencing motion because it was likely to have an adverse effect. The court was faced with the question of whether the professional privilege protecting the confidentiality of the psychiatrist’s findings should be lifted so that the findings could be disclosed to the police. 59     Cory J, writing for the majority held at [51]-[53] at pp 401–402 that Just as no right is absolute so too the privilege, even that between solicitor and client, is subject to clearly defined exceptions. The decision to exclude evidence that would be both relevant and of substantial probative value because it is protected by the solicitor-client privilege represents a policy decision. It is based upon the importance to our legal system in general of the solicitor-client privilege. In certain circumstances, however, other societal values must prevail…The House of Lords recently considered this issue inR. v. Derby Magistrates' Court, [1995] 4 All E.R. 526 (U.K. H.L.). It held that solicitor-client privilege was absolute and permanent. It could not be set aside even when to do so would allow an accused to present a full answer and defence to a criminal charge. With great respect, I prefer the reasoning of Martin J.A. Despite the strength and importance of the privilege, it remains subject to certain well-defined and limited exceptions.These exceptions are not foreclosed and may be expanded in the future, for example, to protect national security. However the question of further exceptions need not be considered in these reasons… [emphasis added] 60     More recently, inBlank v. Canada (Minister of Justice)(supra[35]above), the Supreme Court of Canada denied the absolute nature of litigation privilege. It held that the purpose of the privilege was to protect the integrity of the adversarial process by facilitating the investigation and preparation of a case for trial. Accordingly, lifting the privilege upon the ending of the litigation would not affect the public policy considerations behind it. Furthermore, there was a strong policy interest in ordering the disclosure of the relevant documents and communications when they could possibly be evidence of abuse of process or other blameworthy conduct. The position under the EA 61     Having reviewed the authorities in the leading common law jurisdictions, I am of the opinion that the balancing approach that has found favour in Canada and Australia is best suited for resolving the question of the extent to which legal privilege should give way to other countervailing public policy considerations. The Court of Appeal inSkandinaviskahad taken the view that legal privilege exists in order to protect the public policy of ensuring the effective administration of justice according to law. However, this aim cannot exist in a vacuum, and must necessarily co-exist with other important principles. I am therefore inclined to incorporate some form of balancing exercise into the relevant provisions of the EA, in so far as this is compatible with its structure and words. 62     Section 128(2) of the EA, as it is currently drafted, allows legal advice privilege to be overridden only under the crime and fraud exception. There is no provision that allows the courts to conduct a balancing exercise for other public policy considerations that do not relate to the prevention of fraud or crime. Hence, the only way to incorporate a balancing exercise into s 128(2) is to do so through the definition of the word “fraud” itself. 63     There is no judicial consensus as to the exact ingredients of fraud. Yet, it is precisely this illusive nature that has allowed the courts to widen the ambit of the fraud exception in response to the needs of society in cases such asBarclays. At its core, there is no doubt that fraud includes all forms of criminal and civil fraud, and no privilege can arise in respect of documents and communications made in furtherance of such nefarious purposes. No balancing exercise need to be conducted in such circumstances. To paraphrase the words of Taylor CJ inRe Derby, if a balancing exercise was ever required to determine whether the policy considerations behind the prevention of criminal and civil fraud was sufficient to override legal privilege, it has been performed once and for all when the EA was drafted, and since then has applied across the board in every case. 64     A different story emerges as we move from the core of the word “fraud” (herein defined as cases involving civil and criminal fraud) to its penumbra. Here, reasonable disagreement can exist as to whether a particular purpose amounts sufficiently to fraud such that privilege ought not to be attached to communications made in furtherance of it. While the court inBarclaysthought that an attempt to evade the rule against transactions at an undervalue was sufficiently iniquitous to attract the application of the fraud exception, some academics have opined that this pushes too hard at the limits of the exception. (See C Passmore, ‘The future of Legal Professional Privilege’ (1999) 3(2) Int’l J Evidence & Proof 71, 81–82). 65     AfterBarclays, insolvency practitioners may well wonder whether advice to facilitate a client’s attempt to pay a big supplier may be subject to the fraud exception if there are allegations that the payment amounts to a preferential payment subject to clawback under the Bankruptcy Act. If the answer is in the affirmative, what about attempts to register a charge out of time (under s 137 of the Companies Act) or to effect an insolvency set-off through the assignment of a debt owed by the insolvent company? Would all these actions be regarded as dishonest in the traditional sense in which the word has been used? Surely, dishonesty is not the only touchstone for defining “fraud” under s 128(2) of the EA if we want the fraud exception to apply to more than just the core cases of criminal and civil fraud. An approach that considers, among other factors, the public policy considerations that militate against the purpose for which legal advice was given, and whether that purpose is sufficiently iniquitous for it to be classified as fraud under s 128(2), would be more appropriate. 66     I pause here to emphasize that the inclusion of a balancing test as part of the process of defining what is fraud under s 128(2) of the EA does not mean that legal advice privilege can be waived as long as there is a competing public interest of sufficient weight. Language may be inherently flexible, but there is a limit to how much any particular word can be stretched beyond its natural meaning to take on meanings which it cannot reasonably encompass. For example, I cannot see how an argument for privilege to be lifted in order to facilitate national security aims can possibly be construed as falling within the ambit of the fraud exception. Similarly, I doubt whether the fraud exception can be stretched far enough to accommodate a case with facts similar to those inRe Derby, where there was indeed a compelling interest in favour of lifting the privilege, but no suggestion of any wrongdoing or iniquity attaching to the communication. It may well be that one day we will adopt the “fraud on justice” definition of fraud that was propounded by the Australian High Court inKearney. 67     As mentioned previously at[12], litigation privilege exists in s 131 of the EA by virtue of the common law and is subject to all its common law exceptions. Hence, considering that legal advice privilege and litigation privilege stem from the same public policy of facilitating access to justice for non legally trained persons, it would be anomalous if the exceptions to one were much broader than the other. Accordingly, I would hold that litigation privilege in s 131 is subject to the same fraud exception that exists in s 128. Does the making of a false statement in an affidavit supporting an application for pre-action discovery amount to fraud under s 128(2) of the Evidence Act? 68     An application for pre-action discovery under Order 24 Rule 2 of the Rules will only be allowed if it is necessary either for disposing fairly of the cause or matter or for saving costs. Where the applicant already has sufficient information to commence proceedings, and his purpose in seeking pre-action discovery is to achieve some ulterior and improper purpose, the courts may reject his application on the basis that it amounts to abuse of process (seeStansfieldBusiness International Pte Ltd and Another v VCS Vardan[1998] 1 SLR 641(“Stansfield”)). InStansfield, the respondent had sought pre-action discovery against the appellant in order to determine if he had a cause of action in defamation. It transpired that the respondent was already in possession of certain documents that he had obtained from the appellant in discovery in a previous process. Owing to the rule inRiddick v Thames Board Mills Ltd[1977] 3 AER 677(“Riddick”) that prevented any documents obtained during discovery from being used other than in the trial itself, the respondent was unable to use those documents against the appellant. Essentially, the respondent hoped to circumvent the rule inRiddickby re-obtaining those documents through a pre-action discovery application. 69     The Court of Appeal disallowed the respondent’s application for pre-action discovery. It held that the main purpose of pre-action discovery was to allow applicants to obtain information so that they can determine whether they have a cause of action. It should not be used to achieve the collateral purpose of evading the rule inRiddick. Accordingly, the respondent’s action amounted to an abuse of process and would not be allowed. 70Stanfieldhas been consistently followed by the Singapore Court of Appeal in other cases such asHong Lam Marine Pte Ltd and Another v Koh Chye Heng[1998] 3 SLR 833. Hence, it is settled law that an application for pre-action discovery that is made for other collateral and improper purposes amounts to an abuse of process. 71     The question here is, assuming the defendant was right, and the plaintiffs’ purpose in seeking pre-action discovery was to obtain documents in order to release them to the press, would this amount to fraud under s 128(2) and s 131 of the EA such that the privilege in the email thread should be stripped? 72     Following the analysis in[62]to[67], dishonesty is no longer the only factor that is relevant in determining whether the fraud exception applies. Nonetheless, the culpability of the party who seeks to rely on privilege remains an important factor, and the dishonest making of a false statement is likely to weigh against him. Dishonesty aside, in cases not involving criminal or civil fraud, the incorporation of a balancing approach in determining what constitutes fraud under s 128(2) of the EA requires the court to evaluate the importance of preventing the achievement of the purpose for which legal advice/communications was given. This is a difficult exercise because it involves an element of subjectivity as to what public policy considerations should be given more weight. In this respect, certain questions such as “What will be the practical consequences if the allegedly iniquitous purpose for which the legal advice was given succeeds?” and “Will the victim suffer some loss that is akin to the loss which victims of criminal or civil fraud suffer?” may be helpful. 73     On the facts ofBarclays, it can be argued that a plan to structure an undervalue transaction has all the elements of fraud because the consequences are that some people will be deprived (the creditors) of money which they would otherwise be legally entitled to. Hence, legal privilege ought to be stripped if privileged communications are useful for determining if the party claiming privilege had the intention to move the assets beyond the reach of the creditors. On the other hand, an inaccurate statement in an affidavit supporting an application for pre-action discovery is less likely to amount to fraud because the potential harm caused to the counter party (granting of pre-action discovery) is not as severe. I am not saying that making false statements in an affidavit is not a serious matter. On the contrary, the Court will always frown upon such conduct. However, whether it is sufficiently serious to justify the lifting of legal privilege is a totally different question altogether, and has to be considered within the context of the public policy reasons why we have legal privilege in the first place. 74     Apart from looking at the specific purpose for which the legal advice was given, the court should also look at the importance of preserving the legal privilege in that particular case. Prima facie, the policy of upholding privilege is likely to be stronger when the privilege sought to be protected consists of both litigation and legal advice privilege, than when only a single type of privilege is involved. The reason for this is simple. As the Court of Appeal pointed out inSkandinaviskaat [23], legal advice privilege and litigation privilege are two conceptually distinct doctrines although there may be substantial overlap in practice. The former serves the purpose of encouraging candid communications between a party and his solicitors, while the latter is aimed at ensuring the efficacy of the adversarial process by allowing the parties, whether represented or not, to prepare their contending positions in private. Accordingly, where a document that is protected by both legal advice and legal privilege is ordered to be disclosed, the harm that is done to the public policies that justify legal privilege is likely to be greater. 75     Another principle which ought to be taken into account is that the policy of upholding privilege is stronger when the allegedly fraudulent conduct of the party seeking privilege is itself an issue in the proceedings. This is commonly known as the distinction between “fraud that is free standing and independent” and fraud that is not. The distinction was first propounded in the case ofRegina v Snaresbrook Crown Court, Ex parte Director of Public Prosecutions[1988] QB 532. In that case, the plaintiff had made a claim against the police for assault. One of the claims made by the plaintiff was that a police officer had broken his nose during the assault. The plaintiff subsequently told his legal aid officer in an application form for legal aid that his nose had in fact been broken two days before the alleged assault took place. It was not contested that the application form constituted communications between the plaintiff and his legal advisor and was protected by legal privilege. The police authorities sought discovery of the application form on the grounds that it was evidence that the plaintiff had made a fraudulent claim, and that the privilege should be stripped on the basis of the fraud exception. 76     The Court rejected the police authorities’ request. It held that statements made by parties in a trial should rarely be regarded as part of a fraudulent purpose that justified the stripping of legal privilege. According to the court at pp 537–538: Obviously, not infrequently persons allege that accidents have happened in ways other than the ways in which they in fact happened, or that they were on the correct side of the road when driving when actually they were on the wrong side of the road, and matters of that sort. Again, litigants in civil litigation may not be believed when their cases come to trial, but that is not to say that the statements they had made to their solicitors pending the trial, much less the applications which they made if they applied for legal aid, are not subject to legal privilege. The principle to be derived fromReg. v. Cox and Railton, applies in my view to circumstances which do not cover the ordinary run of case such as this is.  77     This distinction was again emphasized in the case ofKuwait Airways(supra[34]). In that case, the plaintiffs alleged that the defendants had committed perjury in a previous trial. It sought discovery of certain communications between the defendants and their solicitors that were protected by legal advice privilege and litigation privilege. The issue was whether the privilege could be stripped under the fraud exception. The English Court of Appeal allowed the privilege to be stripped. However, it stated at p 2746 …the exception may not apply if what is in issue is merely an issue in the proceedings eg a denial of having committed a crime or (as discussed in theHallinancase) an assertion of an alibi or telling a lie to a solicitor about the side of the road on which one is driving. The fraud exception is more likely to apply if the evidence of criminality is \"free-standing and independent. 78     The English cases do not clearly state the reason for this distinction. I believe the view that this is largely based on practical considerations. Theoretically, it is indeed possible to extend the definition of fraud to include all false statements of fact made by a party in a trial. However, we must remember that the whole purpose of a trial is for the judge to come to a conclusion on disputed facts. In many cases, disputed facts arise because parties have different accounts of how the dispute had arisen in the first place. If the fraud exception applied to every case where a party doubted the veracity of a statement made by his counter party (whether in his affidavit or at the trial), the very idea of legal privilege will be reduced to a dead letter, since the rule would have been swallowed by the exception itself. To prevent this result, the courts must exercise caution in applying the fraud exception to privileged communications that may reveal the veracity of statements made within the affidavits or during trial. 79     Finally, the court must consider the extent to which the party seeking to lift privilege is able to show that the privileged communications were made as part of an ongoing fraud. There is no clear standard of proof that is cast in stone in this regard. Clearly, a mere allegation is not sufficient and there has to be at least some prima facie evidence. On the other hand, it is probably too much to expect the party trying to lift privilege to produce evidence that can satisfy the court on a balance of probabilities that the allegation of fraud will succeed. In dealing with the standard of proof that is required, it may be useful to consider the principles that are applicable to an application for interlocutory injunctions. A party that seeks to lift legal privilege on the basis of the fraud exception is, in effect, depriving his counterparty of a right which the latter is prima facie entitled to, on the basis of incomplete evidence. In such a situation, the court has to balance the risk that the allegation is unfounded, in which case the lifting of the privilege prejudices the party to whom the privilege belongs, against the risk that there has indeed been some fraud, and the failure to lift the privilege furthers the fraud. InDerby & Co Ltd v Weldon (No.7)[1990] 1 WLR 1156, Vinelot J, after conducting an exhaustive survey of the authorities, stated at p 1173: In all the cases I have cited what is stressed is that every case must be judged on its own facts. In any given case, the court must weigh, on the one hand, the important considerations of public policy on which legal professional privilege is founded - the necessity that the citizen should be able to make a clean breast of it to his legal adviser (seeAnderson v. Bank of British Columbia(1876) 2 Ch.D. 644, 649 per Sir George Jessel M.R.) - and, on the other, the gravity of the charge of fraud or dishonesty that is made. There are many contexts in which the court similarly has to strike a balance between the need to do justice to the plaintiff, on the one hand, and, on the other, the extent to which interlocutory relief may result in an unjustified interference with the defendant's property and his right to privacy. The point at which the balance is struck must depend on the extent to which the relief sought may unjustifiably invade the defendant's rights. So if a plaintiff can show that he has a fairly arguable case and if the defendant can be fully protected by a cross-undertaking in damages, the court in granting or refusing a purely negative injunction will be primarily concerned with a balance of convenience. 80     The above language is practically indistinguishable from that used by the courts in applications seeking interlocutory injunctions. The factors that are relevant in determining the standard of proof which the party seeking to lift privilege must reach are based on the principles laid out in[72]to[77]. Hence, in Kuwait Airways (supra[34]), the English Court of Appeal, having made the distinction between fraud that is one of the issues in the action and fraud that is “independent and free-standing”, suggested that a strong prima facie case had to be established in the former situation while it may be sufficient simply to establish a prima facie case of fraud in the latter. In accordance with the general principles relating to applications for interlocutory relief, I would add that a lower standard of proof would be required in cases where the alleged fraud is closest in nature to the traditional fraud cases (criminal and civil fraud cases), and where the potential harm to the party seeking the lifting of the privilege is greater. 81     Since the issue of proof is a practical matter, it may be affected by circumstances which are totally irrelevant to the merits of the parties’ case or the severity of the fraud. For example, where the party seeking to lift privilege is relying solely on circumstantial evidence and his own affidavits, it would difficult for him to show a prima facie case of fraud. On the other hand, if the party is already in possession of the privileged communication and is merely trying to have it admitted as evidence, then his possession of those communication (assuming it is indicative of fraud) is likely to greatly bolster his case. Undoubtedly and unfortunately, there is an element of fortuity involved in such an exercise. Should the fraud exception apply in this case? 82     I did not think that the fraud exception should be applied in the present case. First, the email thread was protected by both legal advice and litigation privilege. Second, although the making of a false statement in an affidavit in support of a pre-discovery application constituted serious misconduct, the practical consequences of such an act are not as severe as those arising from traditional notions of fraud and is unlikely to cause severe harm to the defendant. Even if the defendant failed in the application, it would still be paid its costs for complying with the pre-action discovery order, and the order would not prejudice its chances of succeeding at trial. Third, the question of whether Yip had made a false statement in his affidavit when he said he required pre-action discovery in order to determine whether he had a cause of action against the defendant is precisely the issue that had to be determined at the interlocutory hearing. If the court granted the defendant’s application to lift the privilege on the ground that Yip’s statement was false, this would be tantamount to judging the pre-action discovery application itself. 83     More importantly, I did not think that the email thread showed that either NS or the plaintiffs were being dishonest when Yip stated in his affidavit that he required pre-action discovery in order to determine whether he had a cause of action against the defendant. 84I was of the view that NS was merely advising the plaintiffs in the email of 27 February 2009 on the requirements for getting pre-action discovery.There was nothing to indicate that NS knew that he already had a good cause of action or that Yip had lied when he said he needed pre-action discovery to determine whether the plaintiffs had a cause of action. Of course, the email thread did show that there was a likelihood that NS and the plaintiffs would release the contents of any discovered documents to the press. However, this by itself did not amount to an abuse of process. If the defendant was truly concerned about this potential leakage of information, it could/should have obtained an undertaking from the plaintiffs to keep any discovered documents confidential. The request should have been made to the court hearing the application, and I have no doubt that it would have been granted if sound reasons had been given for the undertaking required. 85     In the final analysis, I found that the defendant had failed to make out aprima faciecase of fraud. Accordingly I declined to lift the privilege that protected the email thread on the basis of the fraud exception under s 128(2) of the EA. 86     For the reasons set out above, I affirmed the decision of the court below and dismissed the defendant’s appeal with costs to the plaintiffs."
    }
}