{
    "case_title": "Public Prosecutor v Ramalingam Ravinthran",
    "ncitation": "[2009] SGHC 265",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The accused’s statements": "6       After his arrest, several statements which were recorded from the accused by different officers were admitted into evidence without objection. 7       The first statement was recorded by Senior Staff Sgt David Ng (“SSSgt Ng”) at about 6.20 pm on the day of the arrest, after the accused, the car and the bag were taken from the scene of arrest to a trailer park along Jurong Road. This statement was recorded with another officer, Sgt Chelliah Vijay, acting as Tamil interpreter. 8       The accused did not dispute the admissibility of this statement[note: 2]which consisted of eight questions and answers: Q1:The sport bag that found inside the car belong to who?A1:My friend ‘Rajoo’.Q2:What is inside the bag?A2:Something inside.Q3:What ‘something’ are you referring?A3:I’m not very sure.Q4:Why ‘Rajoo’ leave his bag inside your car when he alighted?A4:‘Rajoo’ said later, he will take his bag.Q5:After opened the bag in front of you, do you know what is inside there?A5:Yes. I know.Q6:What is inside the bag?A6:The ‘Grass’.Q7:How do you know is the ‘Grass’ whereby I did not tear opened the aluminium wrapper?A7:I knew it because the officers said so.Q8:What exact words did the officers said?A8:‘Grass’. and the accused signed on every page of the pocket book in which the statement was recorded and also against the corrections to the statement and also at the concluding portion that stated that the statement was interpreted to him and that he confirmed it to be true. 9       The second statement recorded from the accused was his cautioned statement[note: 3]recorded on 18 July 2006 by the investigating officer of the case, DSP Sng Chern Hong with the assistance of a Tamil interpreter. In this statement where he responded to a charge of trafficking the vegetable material in the bag, he stated: Rajoo rang me at around two something to three and told me to come to Sivan Temple at Sungei Kadut Road to meet him at 3.30pm. At about 3.30 pm, I went to the temple and no one was around. The gate was closed. He called me again and told me to go to a food centre nearby and asked me to wait there. I parked my car near the food centre and went inside the food centre. I viewed the food stalls and then went to the toilet. I was in the toilet for about 7 minutes and then I came out. Ah Bang, who was a truck driver I knew previously, came into the toilet and confronted me. Ah Bang asked me whether the book had arrived. I did not know what is the book he referred but whenever Rajoo brought in something, they would refer to as book. I told Ah Bang the book had not arrived. He then gave me $4000 and asked me to pass to Rajoo. I called Rajoo later and I went to a coffeeshop later at Choa Chu Kang. Rajoo rang me up on my phone and asked me to meet at the temple. At 5 something, I arrived at the temple. The gate was opened and I parked my car inside. Rajoo arrived then. He was carrying a bag. Rajoo asked me to open up the boot but I had other things in the boot, so he opened up the rear passenger door to put the bag on the seat. Rajoo came and sat in the car. He told me to drive off. While driving along Bukit Timah Road towards city, suddenly Rajoo asked me to stop the car. He dropped off and told me either Ah Bang or himself would call me later. I then drove off. Police arrested me later in the car. They asked me what was in the bag and I told them I don’t know. I did not commit the offence. I helped them because I am obligated to them. They used me because I am a soft man. I will fully cooperate and tell all the truth. (The person referred to as ‘Rajoo’ is Sundar, as Sundar was known to the accused by that name, and the person referred to as “Ah Bang” is also referred to in other statements as “Abang”.) 10     An investigation statement was recorded from him by the investigating officer, again with Tamil interpretation on 19 July 2006.[note: 4]In this statement, the accused mentioned two persons by the names Anand and Kumar, whom he had met in Malaysia, who had supplied workers for his projects in Malaysia. He became friendly with them and had them in drinking sessions in Johor starting in April/May 2006. 11     In paras 19 and 20 of the statement, he recounted that: 19    On one of the meetings, which was about one week after the drinking session, only ‘Anand’, ‘Kumar’ and myself were present. ‘Kumar’ spoke to me then and asked me to help him out. ‘Kumar’ told me that on three to four occasions, somebody had shitted on them (Recorder’s note: Accused meant that somebody had promised to perform a task for ‘Kumar’ but did not deliver as promised). He did not tell me specifically what I was needed to do, just that I was to transport something for him. He further told me that it would not involve any heavy drugs or explosives. My understanding then of heavy drugs was cocaine or heroin.20    I agreed to help ‘Kumar’ then. In return, I did not expect any reward from him. ‘Kumar’ and ‘Anand’ did treat me to girls and drinks before, and because of that, I felt obligated to help them. I also made it clear to them that I would help only if I could as I was busy with my own work. The meeting ended then. ‘Kumar’ did not tell me exactly when he needed my help. 12     He then went on to narrate two occasions on which he had helped Kumar. In para 21 of the statement, he recalled that: 21    In around June 2006, I started helping ‘Kumar’ and ‘Anand’ to do the transportation. ‘Kumar’ had instructed me to park my car at the carpark of a Sivan temple at Sungei Kadut (Recorder’s note: Accused was referring to Sri Arasakesari Temple located at 25 Sungei Kadut Avenue). I was not to lock my car. Someone would come and drop something in my car. Later, I was to transport the thing to a canteen along Sungei Kadut, which was about 7 minutes drive from the temple. I could not remember the exact address of the place. I would then park my car along the main road of the canteen and go for coffee in the canteen. I was to wait until the thing was collected before I could drive off. ‘Kumar’ also told me not to worry and everything would be alright. and when the recording of the statement resumed on the afternoon of 20 July 2006, he stated in the continuing statement[note: 5]that: 23    Although ‘Kumar’ gave me the instructions for the job, he did not tell me when exactly to do it for him. Altogether, I helped ‘Kumar’ twice. The second time being the one whereby I was arrested.24    I could not remember exactly when was the first time I helped ‘Kumar’. It should be sometime in June, July 2006. ‘Kumar’ called me on my Singapore handphone. ‘Kumar’s’ handphone number did not appear in my handphone then and the display on my phone showed “unknown”. ‘Kumar’ instructed me to go to the temple and I immediately knew then that he wanted me to help him transport something. ‘Kumar’ probably told me what time to go down but I could not remember. I told him that I would go down only if I was free. I also told ‘Kumar’ that I was doing this as a favour for him.25    At around evening time, I drove down to the temple (Recorder’s note: Accused was referring to Sri Arasakesari Temple located at 25 Sungei Kadut Avenue) and parked my car inside the carpark of the temple. I alighted from my car, washed my feet, and went into the temple to pray. I did not lock my car then. During this period, I did not receive anymore calls from ‘Kumar’ or ‘Anand’. I prayed in the temple for about 20 minutes and came out to find a blue or green haversack left on the left rear passenger’s seat. I did not touch the haversack or open it up. I also could not remember if the haversack was locked, but I did not consider checking the content of the haversack as I did not want to know or have anything to do with it. I did not know what was in the haversack, but I thought they may be testing me by asking me to deliver it. I did not suspect then that it might contain drugs then.26    I wished to add that the arrangement with ‘Kumar’ was that he would tell the other parties my car number and they would then put the thing or take the thing from my car accordingly. I was not to lock my car in order to facilitate these events.27    I then drove down to a canteen along Sungei Kadut and parked my car along the main road. I went inside the canteen and had noodles and coffee. I was seated in a position where I was blocked by the MRT track pillars and could not see my car. I was in the canteen for about 15 to 20 minutes and during this time, I did not see anybody going to my car. When I left the canteen and went to my car, I found that the haversack was gone. I then drove off. About half an hour later, while I was driving, I received a call from ‘Kumar’ and he told me that everything was okay. I knew then that he meant the haversack had been collected.28    For this occasion, I did not see anybody who left or collect the haversack from my car. After this incident, sometime later, ‘Kumar’ called me and asked me to come down to Johor Bahru, but I told him that I was not free and I did not meet up with him. 13     He then went on to describe the second occasion on which Kumar sought his assistance: 29    On 13/07/06, in the afternoon, at about 2pm, ‘Kumar’ rang me up and told me to be at the temple at 3.30pm. I again knew that he wanted me to help him transport something. I was at a scrap yard in Sungei Kadut when ‘Kumar’ called, as I had wanted to buy a filter cover for a compressor. I searched around for the filter cover at 2 to 3 scrap yards until around 3.30pm, when I drove to the temple. Upon reaching the temple, I found that the gate was closed. Just about then, I received another call from an unknown person who told me to go to the canteen to have a drink and wait for a while. He said he would arrive in about 15 to 20 minutes. I did not know the caller but he did not sound like ‘Kumar’. The display on my handphone showed “unknown” for this call.30    I arrived at the canteen at about 3.45pm. I parked my car at the same spot near the MRT track pillar, along the main road in front of the canteen. I viewed the food stalls in the canteen and then went to the toilet. I went into the cubicle for about 5 to 7 minutes and then came out to wash my hand. While I was washing my hand, a male Indian approached me in the toilet. I wish to say that I could not recognize him. He addressed me ‘Abang’ (Recorder’s note: ‘Abang’ is a term for elder brother) and asked me if the “books” had not arrived. As a common greeting, I also called him ‘Abang’, even though I did not recognize him, and told him “no”, implying that the “books” had not arrived.31    I wished to add that this was the first time I heard of the term “books” and I believed that it was a code but I did not know what it referred to. I believed that ‘Abang’ might have been waiting around and saw me arriving in my car. He had probably gone to my car then and saw that there was nothing inside. So he came to me and asked me about the “books”.32    ‘Abang’ then gave me a stack of folded money. He did not tell me how much it was but he told me that it was workman’s money and I was to give it to whoever that comes. By that, I understood that I was to give the money to the person who would be giving me the “books”. After this, ‘Abang’ left. I went back to the cubicle again and counted the money. I counted a total of about S$4000. I then kept the money in my right pants’ pocket and left the toilet. I counted the money because I was afraid that they might accuse me of taking the money.33    ‘Abang’ is a male Indian about 39 years old. He is about 5 feet 5 inches tall. He is slim with a dark normal length hair which was not properly combed. He has a straight face. I did not notice any tattoos or if he wears glasses. He was in a white and blue t-shirt. 14     His narration carried on with the continuation of the statement in the evening[note: 6]where he added: 35    I came out of the canteen, with a can of green tea drink and smoked a cigarette while I waited for another 10 to 15 minutes. I was waiting for the call to go down to the temple. As I did not receive any call, I boarded my car and drove off, with the intention to go back to my workplace. While I was driving, I received a call from an unknown person. I did not know who the caller was. It could have been the same unknown caller who called me earlier or the ‘Abang’ whom I met in the toilet of the canteen. This unknown caller told me to wait for another 15 minutes, as he was on the way. I did not want to go to the temple then and I would have just gone back to my workplace if not for the money which ‘Abang’ had given me.36    I am now shown my handphone and a phone record for “Answered” phone call. I wished to say that when I received the phone call, I saved the number under ‘Tabi’ (Recorder’s note: Accused was shown his handphone, and the record made on 13/07/06 at 5.22pm belonging to one ‘Tabi’. The phone number of ‘Tabi’ is 93972437). I saved the number randomly under the name ‘Tabi’ with the intention to call him later. In the event that I arrived at the temple and ‘Tabi’ was not present, I would then call him and tell him that I would not be waiting anymore and would be going back to work. I did not know who ‘Tabi’ was then.37    As I was already in the vicinity of Choa Chu Kang when I received the call, I decided to have a coffee at a coffeeshop. After about 10 minutes, I left the coffeeshop and drove towards the temple. I arrived at the temple between 5pm and 6pm. The gate was opened and I drove into the temple compound and parked my car in the carpark. I alighted from the car and as I was about to go into the temple, I saw a male Indian approaching my car. I roughly have an idea of who he was. I remembered his name as ‘Rajoo’, or ‘Abang’.38    I believed I had seen ‘Rajoo’ before in Malaysia with ‘Kumar’ and ‘Anand’. However, I could not remember when or in what situation I met him. I could remember his name as ‘Rajoo’ because during one of the drinking sessions with ‘Kumar’, he told me that somebody would come and bring something which he did not specify then. But he mentioned that this somebody could be ‘Rajoo’, ‘Anand’ or someone else. This is why I remembered the name ‘Rajoo’.39    While ‘Rajoo’ was approaching my car, I saw him carrying a bag across his shoulder. From the way he carried the bag, I could see that it was heavy. I am now shown a photo of a bag and I recognized it to be the bag that ‘Rajoo’ was carrying (Recorder’s note: Accused was shown the photo with exhibit marked “A”. He confirmed that this was the said bag by appending his signature on the photo). ‘Rajoo’ came nearer to my car, approaching the passenger side. I also went to the driver side of the car. He asked me whether he should leave the bag in the boot, but I told him to leave it in the backseat instead. As the car was not locked, he opened the rear left passenger’s door and placed the bag on the left passenger’s seat.40    While ‘Rajoo’ was putting the bag down, I boarded my car as well. I then told ‘Rajoo’ to come into the front passenger seat so that I could pass him the S$4000. As I did not want to stay in the temple compound, I started the car and drove off. I was going in the direction towards my workplace in Jurong. While driving, I took out the money from my right pants pocket and gave to ‘Rajoo’. I could not remember if he counted the money then, but I told him that it was workman’s money. ‘Rajoo’ then asked me where I was going and I told him that I was going to my workplace. Suddenly, he told me to stop the car, which was just before the bus stop, along Bukit Timah Road, in the direction towards the city. ‘Rajoo’ then alighted from the car.41    I drove off and headed for Jurong with the intention to go to my workplace then. Afterwhich I would wait for ‘Abang’ to call me and arrange for a meeting place to pick up the bag. During this entire time, I did not touch the bag at all. I did not notice whether the bag was locked but I had no intention to see the content inside. I did not want to check the bag as I thought it was better not for me to see. I suspected that something was not right, and the bag might contain something illegal. I had this suspicion because if the content was legal, they would not need to be so discreet. Only then I realized that they were using me.42    While travelling, I could not remember the exact time then, I came to a stop at a traffic light along Pioneer Road, at the Esso Refinery and Petrol Kiosk. 3 cars then came by. 1 car stopping in front of my car, 1 behind my car and 1 at the passenger’s side. I saw several men in plain clothes coming out of the car. They smashed my windscreen and the side windows. They brought me out of the car and made me sit on the road. Afterwhich, they then handcuffed me. I did not struggle during the arrest. 15     In this statement, the accused also referred to the first statement recorded from him on the day of arrest at the trailer park. He said: 44    The statement given by me at the carpark on 13/07/06 at 6.20pm was read over to me in Tamil. I confirmed that it was mine, true and correct. In the statement, I told the officers that ‘Rajoo’ would take the bag later. I wished to clarify that the bag was actually meant for ‘Abang’. I had mentioned ‘Rajoo’ instead because I was in a confused state then, from all the earlier commotion. and then he went on to explain the presence of the word ‘grass’ in the statement: 45    When I was asked what was in the bag, I had replied that it was ‘grass’ because I had overheard officers mentioning the term ‘glass’ or ‘grass’ earlier. I did not know the context in which the term was used because I did not hear the entire conversation. I only heard the word ‘glass’ or ‘grass’. I had answered the officers that it was ‘grass’ in the bag because I overhead the term earlier and I just replied as such. and then he amended that in his further statement of 7 August 2006[note: 7]and said: 58    I also wished to clarify that in paragraph 45, when the officers asked me about the content in the bag, I replied in English ‘glass’ and not ‘grass’. At the time of my arrest and during the recording of the statement on 13/07/2006, the officer did read over the statement to me. However, the word ‘glass’ was read over in English and not translated to me in Tamil. So I thought that the officer said ‘glass’ and I did not correct them. On 20/07/2006 when the same statement was read over to me, I did mention to the Tamil interpreter that I said ‘glass’ instead of ‘grass’ but he did not clarify with the recorder. The recorder also asked me several times on this, but as I was under medication, I was not in my best state and did not make further clarification.",
        "The evidence of Sundar": "16     The prosecutor wanted to rely on Sundar’s evidence to show that the accused knew what was in the bag. Sundar was a friend of the accused whom he called Ravi, and the accused knew him as Rajoo. 17     Sundar was arrested by CNB officers after he parted company with the accused. After his arrest, he was charged with two charges of trafficking in cannabis and cannabis mixture in the bag (both quantified at just below the threshold levels at which the death penalty applies). He pleaded guilty to both charges and had been sentenced to concurrent sentences of twenty years imprisonment by the time he became a witness in the accused’s trial. 18     Statements were taken from him before and after his conviction. His evidence covered many areas, including common friend he had with the accused by the name “Sasi”, an occasion prior to 13 July 2006 when he had handed a bag to the accused. However, it was his evidence on the accused’s knowledge of the contents of the bag he brought to the car on 13 July 2006 that was most important to the trial of the accused. 19     The prosecutor questioned Sundar on the exchange he had with the accused in the latter’s car after they left the temple and before he got off the car. The use of the termkanja payal(spelt with some variations in the trial transcripts), which means “miser” in Tamil came up for reasons that will be discussed later. Sundar’s evidence was that the accused had called him akanja payal. According to Sundar this happened when the accused offered to buy Sundar a meal, and when he did not accept the offer, the accused asked Sundar to buy him a meal instead, but Sundar said that he did not have the money for that. 20     During cross-examination Sundar agreed with the prosecutor that: Q[Y]ou told Mr Ravi that you don’t have money, to which he calls you akanja payal, a miser in an amusing way. And he laughed when he called you that. How did you react, Mr Sundar, when he calls you akanja payal?AI too laughed.QYes, you found it amusing?AYes.[note: 8] and it also transpired that that was not the first occasion the term was used, as the continued examination went on to show: QAnd that remark “kanja payal”, which Mr Ravi made to you on the 13thof July 2006 is a very usual remark he makes whenever you declined to buy him a meal?AYes, he usually says this to me.…QThere was no --- was there anything different about Mr Ravi calling you akanja payalthat day 13thJuly 2006 that you found it exceptional?AIt was inside the car, the windows were down and it was very noisy because of the traffic. Apart from that, I don’t know.QNo, you don’t ---nothing exceptional about Mr Ravi making thekanja payalremark, is it?ANothing different on that day.[note: 9] 21     The prosecutor then reminded Sundar that he had made statements between 13 and 20 July 2006. Sundar confirmed that he was truthful when he made four statements.[note: 10]He was asked if the statements would help him recall the conversation he had with the accused in the car on 13 July 2006. When Sundar replied that the statements would help him remember,[note: 11]Sundar was referred to two of his statements of 17 July 2006 and 20 July 2006, particularly to paras 37 and 52 of the respective statements in accordance to s 161 of the Evidence Act (Cap 97 Rev Ed 1997) (“Evidence Act”). However, after he was referred to the statements, Sundar’s evidence was that he and the accused did not have any conversation about the contents of the bag.[note: 12] 22     The prosecutor then took steps to prove that Sundar had given inconsistent accounts of the conversation in his statements. He began by applying for leave under s 156 of the Evidence Act to cross-examine Sundar and when leave was granted, he proceeded to impeach Sundar’s credit on four statements Sundar made on 16, 17, 18 and 20 July 2006 and the statement of facts he admitted to when he pleaded guilty to the two charges against him. 23     The prosecutor’s intention was to show that there was a conversation between the accused and Sundar in the car about the contents of the bag. However, of the four statements and the statement of facts, only the statements of 17 July 2006 and 20 July 2006[note: 13]referred to a conversation about the contents of the bag relating to the accused’s knowledge of the contents of the bag. The other statements showed inconsistencies and contradictions in Sundar’s evidence, but not on the accused’s knowledge of the contents of the bag. For this reason, I will refer to the two relevant statements and not the others. 24     Sundar confirmed by his signature that the statements were given voluntarily and had been read back to him. In respect to the statement of 17 July 2006[note: 14], Sundar’s attention was drawn to para 37 therein where he had stated: We turned out from the carpark into the main road. I was in a happy mood then, thinking that I would be getting my work permit. But after travelling for about 5 to 6 minutes, ‘Ravi’ suddenly asked if I knew what was inside the bag and I replied negatively. He then told me that it was ganja. I did not know whether he was telling the truth but I immediately told him that I want to get out of the car. ‘Ravi’ did not utter another word, he just stopped the car and let me alight. I wish to add that while I was in the car, I did not see ‘Ravi’ opening up the bag. 25     When the prosecutor asked Sundar if he said this when he made that statement, he replied: I did not say this. I only said using the word “kanja payal”. The --- that’s what --- that’s what Ravi said[note: 15]  although he also confirmed that the statement was given by him voluntarily and was read back to him after it was recorded.[note: 16] 26     Sundar was then referred to his statement of 20 July 2006[note: 17]where he had stated in para 52: The statement given by me on 13/07/2006 at 8.10pm in a police station was read back to me in Tamil and I confirmed it to be mine. I wished to add that I had told the police officers then that the bag contained ganja because I was informed by ‘Ravi’, while I was in his car, that the bag contained ganja. I thought that the police officers couldn’t have arrested me without any reason and so I just repeated to them that there was ganja in the bag. 27     Sundar confirmed that in this statement he answered truthfully the questions he was asked[note: 18]and that it was read back to him,exceptthe part referring to theganja, and he maintained that he hadnotmentionedganja.[note: 19] 28     In the face of Sundar’s assertion that he had not mentionedganjain the statements of 17 and 20 July 2006, the prosecutor referred to another statement which Sundar made on 17 July 2007[note: 20], after his own conviction, in preparation for the present case against the accused. 29     Sundar confirmed that he made the statement of 17 July 2007 voluntarily.[note: 21]In that statement, he referred to the conversation he had in the car with the accused on 13 July 2006: 11.    I mistaken “kanjappaya” as “ganja” because back at CNB, the officers told me the bag contained “ganja”, I got the impression that Ravi has told me about the ganja. I am now saying its “kanjappaya” when Ravi told me this word in the car and not “ganja”. I was confused when I was arrested. Hence, when the officers told me the bag contained “ganja”, I thought Ravi said this word to me. But I now remember he said “kanjappaya” and not “ganja”.[note: 22] 30     When it was pointed out to him that by his statement he had acknowledged that he had mentionedganja, albeit by mistake because he misheardkanja payalforganja, he conceded: I do not know whether he saidkanja payalor ganja. Since the officers said there were a lot of ganja in it, I could have told them this.[note: 23] and: In the state of anxiety when he saidkanja payal, I thought he said ganja.[note: 24] 31     Counsel for the accused then cross-examined Sundar, with the intention of getting his admission that he was not mistaken in his statement about the accused telling him that the bag containedganja, but was telling a deliberate lie. 32     The exchange started quite promisingly – Q… Now, Mr Sundar, the bottom line and I’m putting it to you is --- is that your statements establishing Mr Ravi having allegedly told you about the contents of the bag being ganja is a lie. I’m putting that to you.AI agree.…QI’m also putting it to you, Mr Sundar, that this was one way of saving yourself from facing the full effect of a capital charge by stating that it was Ravi who had established knowledge of the contents of the bag and that prior to that, you had known nothing of the contents of the bag. So I’m putting it to you that you did this as an act of survival against a capital charge.AI’m not sure if it was Ravi who told me the contents of the bag.[note: 25]…QYes. Now on the 13thand 14thof July, in your statements P157 and 158, you had established the fact in those statements that you had knowledge of what you were carrying, that you were carrying ganja, correct?ACNB officers said and then I agreed that it was ganja --- that I agreed that what I carried was ganja.[note: 26] 33     But when counsel pressed on, Sundar began to disagree with him, as shown in the following questions and answers: QMr Sundar, it’s my client’s instructions that no conversation took place on the 13thof July 2006 in the car where my client has allegedly referred to you as akanja payal. These are my instructions. You either agree or disagree.AIt is true that he called mekanja payal.QSo you are disagreeing?AThat’s correct.[note: 27]…QYour “kanja payal” concoction, and I’m saying that whole thing was a fabrication, right, is an attempt to redeem yourself for the lies you had said in your statements that “Ravi informed you that the bag contained ganja”.AIt is true that he called me “kanja payal”.[note: 28]",
        "The accused’s defence": "34     He had only primary school education, but by his efforts he became engaged in business in marine construction and piling in Malaysia and also managed a pub in Singapore. In the course of his work, he dealt with labour suppliers in Malaysia, including two named Anand and Kumar. When he got to know Anand and Kumar better, they visited night clubs together where they had drinks and the company of ladies. 35     In May or June 2006, Kumar asked him to help in transporting a bag from the Sri Arasakesari Sivan Temple to a canteen in Sungei Kadut. Kumar assured him that there would be no drugs or explosives in the bag. 36     He followed the instructions and drove his car to the temple and went for prayers. When he returned to his car, there was a bag there, and he drove his car and parked it outside a canteen in Sungei Kadut, and went in for his meal. When he returned from his meal, the bag was removed from his car. Kumar telephoned him to assure him that the bag was collected, and told him that there were safety boots in the bag. 37     Then the accused referred to the events of 13 July 2006. That morning Kumar’s foreman, Tamby telephoned him and informed him that Kumar or Rajoo (ie, Sundar, whom the accused knew as Rajoo) would be calling him. Subsequently, Kumar called him and instructed him to be at the temple at 3.30pm. Ten minutes later, Sundar also called and confirmed that he would be at the temple at 3.30 pm. 38     The accused went to the temple and found the gate closed, and Sundar was not there. He telephoned Sundar, who told him to wait for him. After speaking to Sundar, the accused received a call from a person he was unable to identify at that time. (During cross-examination, the accused identified Abang to be the person who telephoned him.[note: 29]) That person told him that he was to go to a canteen at Sungei Kadut. He went to the canteen (which was established at the trial to be the Hawkerway Food Court situated along Sungei Kadut Way). In the toilet of the food court, he met a person he referred to as Abang. Abang asked him if the books had arrived, and he replied in the negative. Abang then handed to him a stack of money[note: 30]and told him that it was workers’ money and that he was to give it to the person who would be bringing the book. 39     After he received the money from Abang, he received a call from Sundar that he would be at the temple after 5 o’clock. At about 5.00 pm. the accused returned to the temple. At this time, the gates were open and he drove his car into the temple compound. He parked his car and saw Sundar approaching, carrying a bag. Sundar went into the front passenger seat and placed the bag in the back seat. 40     The accused did not know what was in the bag and thought that it may be some industrial articles or a book. He also thought that Sundar was going with him to deliver the bag. He gave the money he received from Abang to Sundar, and told him that it was money for workers, and then they drove out of the temple compound. When they were at Bukit Timah Road, Sundar suddenly asked him to stop at a bus stop. When he stopped there, Sundar got off, leaving the bag in the car. He asked Sundar about it, and Sundar told him that he or Abang will be calling him.[note: 31] 41     At that time, the accused realised that there was a car in front and another car at the rear of his car, and he was suspicious about these cars. He drove off and kept observation on them. He drove for about 20 minutes with the cars trailing him. When he stopped at a traffic light junction along Pioneer Road, the other cars blocked his car and persons (the CNB officers) went to his car and arrested him. 42     After he was arrested, he was taken to a trailer park nearby, and was made to sit on the side of the road. He said that at the trailer park, he heard some CNB officers mention “grass” and “glass” in relation to the contents of the bag[note: 32]and he knew that “grass” referred toganja.[note: 33] 43     The prosecutor cross-examined the accused at some length. The accused confirmed that he had asked Sundar to buy him a meal, and had called Sundar akanjanorkanjappaya(a miser) when Sundar declined. He had said that as a joke, and they would both laugh over it.[note: 34] 44     The prosecutor also questioned him on the statement he made at the trailer park. The accused clarified that he heard the officers talking, “they were talking among themselves, and I overheard the word ‘grass’”,[note: 35]and when his statement was recorded, he was asked in Tamil what the content of the bag was and he replied that it was “grass”.[note: 36]",
        "Evaluation of the evidence": "45     At the conclusion of the trial, the evidence was : (i)the accused knew that Sundar brought and left a bag in his car, and(ii)when Sundar alighted from the car, the accused asked Sundar about the bag, and was told to wait for a call from Sundar or Abang.  46     The critical issue of the case was whether the accused knew that the bag contained cannabis and cannabis mixture. 47     The direct evidence that the accused knew that the bag containedganjawas that: (i)at the trailer park after his arrest when he was questioned about the contents of the bag and he replied it was “grass”, and(ii)when Sundar was in his car, he told Sundar that there wasganjain the bag.  The evidence relating to both statements should be examined with care to determine the weight to be placed on this evidence.",
        "The accused’s statement that “grass” was inside the bag": "48     The heart of the accused’s evidence in court was that he did not know the contents of the eight wrapped blocks in the bag, and he said “grass” only because he heard CNB officers say that. 49     However, he also acknowledged that in his investigation statements, he had alleged that he heard more than “grass”, and this has been quoted in para 15 of this judgment. In short, he had stated in para 45 of his statement of 20 July 2006[note: 37]that “… I had overheard the officers mentioning the term “glass” or “grass” earlier … I only heard the word “glass” or “grass”. In his subsequent statement of 7 August 2006[note: 38]he went on to state at para 58 that “… when the officers asked me about the content of the bag, I replied in English ‘glass’ and not ‘grass’.” 50     Both the accused’s statements of 13 July and 20 July 2006 were recorded in English with Tamil interpretations. The earlier statement was recorded by SSSgt David Ng with Sgt Chelliah Vijay acting as English/Tamil interpreter. Their evidence was that when SSSgt Ng posed the questions to the accused in English, the questions were interpreted into Tamil by Sgt Chelliah. When the accused gave an answer, Sgt Chelliah translated the answer into English. It was also their evidence that when the statement was completed it was read back to the accused in Tamil by Sgt Chelliah and he was given the opportunity to correct it before he signed it.[note: 39] 51     It is to be noted that the accused’s evidence on the word he used was inconsistent. While he stated in para 58 of his statement of 7 August 2006 that he had said “glass” in English, he said during cross-examination that he actually said “grass” –: A… he asked me in Tamil, I was asked in Tamil.QYes. And your reply was “The grass”.AI said “Grass”.[note: 40] 52     SSSgt David Ng’s evidence was that during the recording of the statement, the accused spoke to the interpreter in Tamil, with only one exception. That was when the accused was asked “What is inside the bag?” he answered “The grass” in English. 53     SSSgt Ng went on to say: AI then asked Sgt Vijay to confirm with accused Ramalingam whether is it G-R-A-S-S or G-L-A-S-S.QHow did you go about telling Sgt Vijay whether it’s G-R-A-S-S or G-L-A-S-S?AWhen Sgt Vijay answer me the grass, I want Sgt Vijay to confirm with Ramalingam whether is it G-R-A-S-S or G-L-A-S-S.QYou are spelling it?AYes, your Honour.QSo on that day you also spelt it?AYes, your Honour.QAnd what did Sgt Vijay do?AI heard Sgt Vijay spell G-R-A-S-S or G-L-A-S-S to Ramalingam.QDid you recall Mr Ramalingam’s response to that clarification sought by you?AYes, your Honour.QWhat was Mr Ramalingam’s response?AHe respond by spelling G-R-A-S-S, your Honour.[note: 41] 54     After listening to SSSgt Ng’s evidence, counsel for the accused obtained a half hour adjournment to take the accused’s instructions on the recording of the statement. When the hearing resumed, counsel stated: … I have indeed taken instructions and we are not going to dispute the version of the events given by Officer Ng in respect of the recording of the statement but I have just got one question or a couple of questions on clarification.[note: 42] 55     Counsel went on to ask SSSgt Ng: Q… Is there any reason why you have not recorded in your statement, in your pocket book entry and in your --- and your statement the whole clarification exercise which included the spelling exercise that you indulged in with the accused person to ensure that the accused person meant “grass” as opposed to “glass”? Is there an explanation as to why it’s not here?AYour Honour, there is no explanation for me.[note: 43] but it was not put to the witness that what he had described did not take place. 56     The interpreter Sgt Chelliah Vijay is a CNB officer and is not a certified interpreter. He has attained Tamil qualification up to the AO level, and had obtained a B3 grade. He confirmed that Tamil is his mother tongue, and he uses it at home. He had no problems communicating with the accused during the recording of the statement, and the accused had no trouble understanding him. He confirmed that when the accused was asked about the contents of the bag, he replied in English that it was grass[note: 44], and that SSSgt Ng had asked him to spell “glass” and “grass” to the accused for his verification and the accused confirmed it was “grass”, by spelling it.[note: 45] 57     Defence counsel expressed some scepticism over this part of his evidence, as shown in this exchange in cross-examination: QThis is the first time this question was posed to you and you remember all these things happened that you had to spell the word “grass”, spell the word “glass”, explained to the accused person and so on and so forth?AYes, your Honour.[note: 46] As in the case of SSSgt Ng, it was not put it to him that his evidence was untruthful. 58     When I review the evidence, I see no reason for rejecting the evidence of SSSgt Ng and Sgt Chelliah. On the other hand, the accused’s evidence was less satisfactory because: (i)he was inconsistent over his reply on the contents in the bag. In para 58 of his statement of 7 August 2006[note: 47]that “I replied in English ‘glass’ and not ‘grass’.” In court, however, he contradicted that and confirmed that he had said “grass”.[note: 48](ii)the recording officers’ evidence that before the accused’s answer was recorded, “glass” and “grass” were spelt out was not challenged and was not contradicted by the accused when he gave evidence,(iii)the evidence of the two officers that the statement was read back to the accused was not disputed. At that time, there could have been no room for confusion. If the word “grass” was read back in English, the distinction between ‘glass’ and ‘grass’ was already made clear to him. If the word “grass” was read back in Tamil, it was not the accused’s case that he was confused because “glass” and “grass” sound similar in Tamil,(iv)the accused’s allegation in para 58 of his statement of 7 August 2006[note: 49]that “glass” was read back to him on 20 July 2006 was not repeated by the accused in his evidence in court and was not put to the recording officer DSP Sng Chern Hong or the interpreter Ramayah Palaya aka S R Bala, and(v)the accused’s other allegation in para 58 of that statement that when his further statement was recorded on 20 July 2006, he had informed the Tamil interpreter that he had said “glass” on 13 July 2006 was not repeated in his evidence in court and was not put to the interpreter.  59     The accused was trying hard to deny that he gave the answer recorded. However, his account of the circumstances of the recording of the answer was undermined by the inconsistencies, contradictions and the lack of following up that I have referred to in sub-paras (iv) and (v) above. I find as a fact that the accused had answered “grass” in English (which he knew to refer toganja) and that he had not said “glass”.",
        "Whether the accused told Sundar that there wasganjain the bag": "60     The evidence came out through a circuitous route. It started with the prosecutor asking Sundar about the conversation between him and the accused when they were in the car. After a stage, the prosecutor applied for and obtained leave to cross-examine Sundar on the basis that he was a hostile witness, and followed up by applying to impeach his credit. After the impeachment exercise, Sundar continued to give evidence on his conversation. All this has been recounted under “The evidence of Sundar”, and I shall not repeat that. 61     I rejected Sundar’s evidence that the accused had saidkanja payalto him rather thanganja, and I impeached his credit because: (i)by his own evidence, the accused had been calling him akanja payalor miser even before that day, and it was meant and taken as a joke, and they laughed over it. It is incredible that Sundar mistook those words to refer to the contents of the bag, especially in view of his evidence that they were not talking about the bag at all, and(ii)his explanation that he had misheardkanja payalforganjais unacceptable because he maintained that he did not mentionganjaat all when he gave the statement.[note: 50]  62     Sundar’s evidence was clearly inconsistent with and contradictory to his statement of 17 July 2006,[note: 51]and consequently, the statement came within the operation of s 147(3) of the Evidence Act that: Where in any proceedings a previous inconsistent or contradictory statement made by a person called as a witness in those proceedings is proved by virtue of this section, that statement shall by virtue of this subsection be admissible as evidence of any fact stated therein of which direct oral evidence by him would be admissible. and the statement was admissible evidence that the accused told him that there wasganjain the bag in the way that direct oral evidence by Sundar would be admissible. 63     While s 147(3) renders the statement admissible in evidence, the weight to be accorded to the statement has to be determined. When para 17 of the statement of 17 July 2006 becomes admissible as though it was the direct oral evidence of Sundar, it does not mean that para 17 must be regarded as truthful. Admissibility of any evidence and the weight to be accorded to the evidence are separate issues. In a situation where s 147(3) operates, a court must take into account the fact that the witness’ statement is inconsistent with or contradicted by his oral evidence. In such a situation, it is open to the court to find: (i)that the oral evidence is to be accepted in preference over the previous statement,(ii)that the inconsistencies/contradictions cast doubts over the veracity of the oral evidence as well as the previous statement, or(iii)that the previous statement is to be preferred over the oral evidence.  64     I find that Sundar had said that the accused had told him that the bag containedganja, and that he was not mistaken or deliberately lying when he made the statement. Consequently, I find that Sundar’s statement that the accused told him the bag containedganjais admissible, and is truthful.",
        "Conclusion": "65     The accused was in possession of the bag containing the cannabis and the cannabis mixture. The prosecution had proved that after his arrest, he acknowledged that the bag containedganja, and that he had also told Sundar that the bag containedganja, a term which covers cannabis and cannabis mixture. 66     The prosecutor argued that independently of the accused’s admission and Sundar’s evidence, the accused must be taken to have knowledge of the contents of the bag because he had deliberately kept a blind eye to that, and that was the effect of actual knowledge, as explained inTan Kiam Peng v PP[2008] 1 SLR 1. 67     The prosecutor referred to para 41 of the accused’s statement of 20 July 2006[note: 52]where he stated: I drove off and headed for Jurong with the intention to go to my workplace then. Afterwhich I would wait for ‘Abang’ to call me and arrange for a meeting place to pick up the bag. During this entire time, I did not touch the bag at all. I did not notice whether the bag was locked but I had no intention to see the content inside. I did not want to check the bag as I thought it was better not for me to see. I suspected that something was not right, and the bag might contain something illegal. I had this suspicion because if the content was legal, they would not need to be so discreet. Only then I realized that they were using me. 68     Although the accused said in court that he had no opportunity to inspect the bag as he was trying to flee from the suspected gangsters and thugs in the cars which trailed him. I reject this explanation because he had not mentioned in that statement. In addition to that, a further statement was recorded from him on 7 August 2006[note: 53]after the statement of 20 July 2006 was read back and explained to him. In this later statement, he made two clarifications to the statement of 20 July 2006, but he again did not mention that he could not examine the bag because he was fleeing from those persons. 69     I therefore find that even if the accused did not have actual knowledge of the contents of the bag, his wilful blindness has the same legal effect as actual knowledge. 70     In view of the quantities of cannabis and cannabis mixture in the bag (which were not disputed), a presumption arose under s 17 of the Act that the accused had those drugs for the purpose of trafficking, as “traffic” being defined in s 2 to be: (a) to sell, give, administer, transport, send, deliver or distribute; or (b) to offer to do anything mentioned in paragraph (a), and the accused has not rebutted the presumption that the drugs were in his possession for the purpose of trafficking as his case is that he was keeping the bag for Sundar or Abang, ie, that he intended to send or deliver the bag to either of them. With those elements established, the accused had trafficked in the drugs under s 5(2) of the Act: a person commits the offence of trafficking in a controlled drug if he has in his possession that drug for the purpose of trafficking. 71     Consequently, I find the accused guilty and convict him on the two charges that he faces, and I impose the death sentence on him for each charge. _________________ [note: 1]See pocket books entries P143 of Sgt Chan Jee Yeng, P148 of SI M Subramaniam, P149 of SSgt Fatimahtus Zahra bt Osman and P150 of SSI Tan Yian Chye [note: 2]P90 [note: 3]P96T [note: 4]P97A [note: 5]P97B [note: 6]P97C [note: 7]P97D [note: 8]Notes of Evidence page 926 [note: 9]Notes of Evidence page 927 [note: 10]Notes of Evidence page 898 line 23 – page 899 line 14 [note: 11]Notes of Evidence page 970 line 24 [note: 12]Notes of Evidence page 976 lines 5 – 12 [note: 13]P153 and P154 respectively [note: 14]P153 [note: 15]Notes of Evidence page 986 lines 28 – 29 [note: 16]Notes of Evidence page 988 lines 20 – 30 [note: 17]P154 para 52 [note: 18]Notes of Evidence page 997 lines 19 – 23 [note: 19]Notes of Evidence page 998 lines 23 – 25 [note: 20]P156 [note: 21]Notes of Evidence page 1013 [note: 22]P156 para 11 [note: 23]Notes of Evidence page 1019 lines 19 – 20 [note: 24]Notes of Evidence page 1020 lines 29 – 30 [note: 25]Notes of Evidence page 1062 lines 18 – 21, 25 – 30 [note: 26]Notes of Evidence page 1068 lines 10 – 15 [note: 27]Notes of Evidence page 1087 lines 7 – 12 [note: 28]Notes of Evidence page 1088 lines 28 – 31 [note: 29]Notes of Evidence page 2054 lines 12–18 [note: 30]Wrongly transcribed as a ‘sack of money” in the Notes of Evidence page 1805 line 17 [note: 31]Notes of Evidence page 1809 lines 14–17 [note: 32]Notes of Evidence page 1823 lines 27 – page 1824 line 1 [note: 33]Notes of Evidence page 1828 lines 20–21 [note: 34]Notes of Evidence page 1919 lines 9–14 [note: 35]Notes of Evidence page 2153 lines 22–23 [note: 36]Notes of Evidence page 2153 lines 19–29 [note: 37]P97C [note: 38]P97D [note: 39]Notes of Evidence page 641 lines 9–12 [note: 40]Notes of Evidence page 2153 lines 27–29 [note: 41]Notes of Evidence page 642 lines 7–22 [note: 42]Notes of Evidence page 649 line 32 – page 650 line 4 [note: 43]Notes of Evidence page 654 lines 11–16 [note: 44]Notes of Evidence page 660 lines 23–24 [note: 45]Notes of Evidence page 660 line 29 – page 661 line 5 [note: 46]Notes of Evidence page 665 lines 24–27 [note: 47]P97D [note: 48]Notes of Evidence page 2153 lines 27–28 [note: 49]P97D [note: 50]Notes of Evidence pages 986 lines 28–29 and page 998 lines 23–25 [note: 51]P153 [note: 52]P97C [note: 53]P97D"
    }
}