{
    "case_title": "Goh Pin Yi Cindy v Mahmod Fadzuli bin Mahnor and Another",
    "ncitation": "[2009] SGHC 94",
    "coram": "Judith Prakash J",
    "sections": {
        "The facts": "2       Sungei Tengah Road is a four lane road which carries traffic moving in both directions. The road is divided by a continuous centre white line and there are two traffic lanes on each side of the road. The road is about 15.24m in width and therefore each lane is about 3.81m wide. The road is lined by trees and lit by a number of lamp posts. There is an unnamed narrow road (“the lane”) which runs downhill and is perpendicular to Sungei Tengah Road. The lane is, apparently, quite steep. It joins Sungei Tengah Road at a junction which is in the vicinity of lamp post no 117 but opposite it. There is an unbroken white line across the lane at its junction with Sungei Tengah Road and traffic approaching Sungei Tengah Road along the lane is supposed to stop before this white line prior to turning into Sungei Tengah Road. Vehicles turning right from the lane into Sungei Tengah Road have to cross two lanes of on-coming traffic before entering the lane proceeding in the direction in which they wish to travel. Vehicles that wish to turn from Sungei Tengah Road into the lane may do so by way of a slip road which is situated to the right of the main junction between Sungei Tengah Road and the lane. 3       According to Rule 22(a) of the Road Traffic Rules (Rule 91 of the Highway Code), no person is allowed to park a vehicle on any road between the edge of the roadway and any portion of an unbroken white line laid down on such road. Rule 22(d) prevents parking on the grass verge of a road. Despite this prohibition, the evidence was that prior to the accident, vehicles were often parked overnight in the outermost lane of Sungei Tengah Road opposite the junction with the lane and along the edge of the road. 4       The lorry involved in this case bears the registration no GZ2395C. It is silver in colour, has a width of 169cm and the mirror on the driver’s side extends 27cm out from the frame of the lorry. If the width of the body of the lorry were to include the mirror then the total width would be 196cm or just under 2m. 5       Mr Mahmod’s evidence was that it was his usual custom to park Tri-Mas’ lorry along Sungei Tengah Road in the evenings before he went home. Mr Mahmod lives in Chua Chu Kang Avenue 3 and it was a short walk from Sungei Tengah Road to his home. He did not park the lorry in a car park in his estate as he could not afford to do so and Tri-Mas did not pay the lorry’s overnight parking fees. Mr Mahmod testified that he was not the only person to use Sungei Tengah Road for overnight parking. There were usually several lorries parked along the road every night. 6       On 13 October 2006 at about 7pm, Mr Mahmod drove the lorry to Sungei Tengah Road and he then parked the vehicle at the side of the road. In his affidavit, Mr Mahmod alleged that the lorry was parked under a lamp post opposite the premises at 51 Sungei Tengah Road known as the Chengtai Nursery. In court, however, he agreed that the lorry was not parked opposite the Chengtai Nursery but further away and closer to the junction between the lane and Sungei Tengah Road. It was, he said, slightly forward of the junction. Mr Mahmod did not park the lorry on the grass verge but very slightly away from it. He said there was a gap of about an inch between the lorry and the verge. He maintained that at the time he parked the lorry, there were other lorries already parked there both in front of and behind the lorry. Mr Mahmod was aware that it was not lawful for him to have parked the lorry where he did but this fact did not bother him at the time since he had been parking along Sungei Tengah Road for about four to five years prior to the accident and during that period, he had not received any summons or been charged with illegal parking. He was also reassured by the habitual parking of other lorries at the same location. 7       The 13 October 2006 was the last day of the end of year examinations for the plaintiff and her friends. They decided to go cycling that evening to celebrate. A group of teenagers met at a basketball court in Choa Chu Kang and thereafter they proceeded to cycle uphill from Choa Chu Kang Farmart. Their ultimate destination was a shopping centre called Sunshine Plaza. Around 10.30 that evening, the cyclists approached the lane. Their intention was to cycle down the lane and turn right into Sungei Tengah Road. 8       Evidence as to what happened that evening was given by three persons: the plaintiff herself and her friends Miss Lian Miaoyu and Miss Lee Wan Ting. Miss Lee was the only person who saw what happened as Miss Lian had preceded the plaintiff down the lane and was not aware of the accident until later. 9       The plaintiff’s evidence in her affidavit of evidence-in-chief was that she had cycled down the lane and then made a right turn into Sungei Tengah Road. Whilst she was negotiating the bend, she collided into a lorry that was parked there. She lost consciousness and when she awoke she was in the National University Hospital. The plaintiff also stated that Sungei Tengah Road has many trees, is quiet and is not heavily utilised. Even though there were lamp posts lighting the path, the road was still rather dim. As she was negotiating the turn, she did not observe the presence of the lorry on the road. There were, however, several vehicles parked along the road. 10     Under cross-examination, the plaintiff said that she could not remember very much about the accident. In particular, she did not remember whether there was a white stop line at the junction of the lane and Sungei Tengah Road or what the traffic condition along that road had been. The last thing she remembered before the accident was cycling down the lane. She also remembered that the area was quite dimly lit although the lamp posts were functioning that day. The plaintiff agreed that she had cycled frequently around the area and whilst she disagreed with counsel’s suggestion that there were always a lot of lorries parked along one side of Sungei Tengah Road, she stated that sometimes lorries had been parked there. 11     Ms Lee Wan Ting stated in her affidavit that at the time of the accident, she and the plaintiff were classmates in Fajar Secondary School. On the 13 October 2006, she was part of the group of friends that was celebrating the end of the examinations by cycling in the Choa Chu Kang area. Some time that evening, they decided to go to Sunshine Plaza for supper. To get there, the group had to cycle down the lane and then turn right into Sungei Tengah Road. Ms Lee said that the usual route that the friends took to get into Sungei Tengah Road was to enter the slip road. They did this, even though it was against the flow of traffic, because this was a convenient way of negotiating the junction. On the night of the accident, however, as they approached the junction on their respective bicycles, Ms Lee saw a car using the slip road. Thus, it was not available and the friends had to make their turn at the junction proper. 12     The first bicycle to approach the junction was ridden by a boy named Richard and he was carrying Ms Lian on the bicycle’s main bar. He proceeded down the lane and made the turn into Sungei Tengah Road without incident. Thereafter, Ms Lee proceeded down the slope. After negotiating the turn, she stopped and turned back to look at the remaining riders. The plaintiff was one of the last few riders to proceed down the slope. Ms Lee saw her move down the lane and negotiating the turn and then colliding into the lorry. The accident happened fast. Ms Lee then turned her bicycle round to cycle to the lorry to check on the plaintiff. Her initial conclusion was that the plaintiff had fallen off her bicycle onto the road. As she approached, however, she saw that the plaintiff was hanging from another lorry that was parked in front of the lorry into which she had collided. The plaintiff’s bicycle was on the ground and there was blood all over the place. Subsequently someone called the ambulance and the plaintiff was conveyed to the hospital. 13     Ms Lee deposed that she and the plaintiff had often cycled over the weekends and had often used the same stretch of Sungei Tengah Road. Even though there were lamp posts with orange lights, it was quite dark and the road was dim. Further there were several trailer lorries parked along Sungei Tengah Road. 14     During cross-examination, Ms Lee reaffirmed that she and the plaintiff had frequently cycled along the stretch of Sungei Tengah Road in question and that they were familiar with the road and the usual traffic conditions. She also confirmed that they were both competent cyclists. She agreed that lorries and trailers frequently parked along the left lane of the road. She agreed that on the 13 October 2006, when she approached the junction of the lane and Sungei Tengah Road, the lorry was parked along the opposite side of the road together with other trailer lorries. She agreed that she had seen the lorry before she had made the turn into Sungei Tengah Road itself. She also agreed that when she made the right turn at the junction she had done so without colliding into the lorry. 15     Ms Lee was asked a series of questions relating to visibility on the night in question. She agreed that when cycling down the lane towards the junction, there was nothing obstructing her view. She did not agree that the lorry was clearly visible to her as she cycled down the lane but she did agree that it was visible to her as she approached the junction. She agreed that if the plaintiff had kept a look out when she was approaching the junction she would also have seen the lorry. Ms Lee confirmed that there was a stop line at the end of the lane. She also agreed that the plaintiff did not stop at the stop line before she made the right turn into the junction. 16     Ms Lee was then asked questions relating to the space available at the junction for her turn. This series of questions and answers went as follows:  Q… I’m now suggesting to you that you came down the slope, you were able to make a right turn without colliding into the 2nddefendant’s parked lorry on the opposite side of the road because the road is wide enough for you to turn and still keep a safe distance from the 2nddefendant’s lorry. Do you agree?ANo, quite squeezy.QOkay. Do you agree with me that Sungei Tengah Road is a wide road and there are two lanes on each side of the road?AYes.QYou agree with me that at the material time, the 2nddefendant’s lorry was parked on the left side of Sungei Tengah Road?AYes.QDo you agree with me that the 2nddefendant’s lorry did not take up the whole of one lane?AYes.…QSo would you agree with me that when you made the right turn, you had an allowance of at least one lane from the 2nddefendant’s parked lorry?AYes.QThank you. You will agree with me that at no time when you were making the right turn at the junction were you in any danger of colliding into the 2nddefendant’s lorry?ANo.…QYou were not in any danger, right? Is that what you are saying?ANo, as in won’t bang onto it, but ---…CourtPlease don’t rush it. What --- what did you say? Can you repeat that, please?WitnessErm, not --- wouldn’t bang onto it lah, but a bit --- somehow a bit can’t turn.CourtA bit?WitnessCan’t turn, as in ---CourtYou had to make a hard turn ---WitnessYes.Court--- in order not to hit the lorry, is that what you’re saying?WitnessYes. It’s a bit squeezy, the road.CourtIt was a bit squeezed?WitnessYes.CourtYes. So was there enough room for you to manoeuvre easily?WitnessNot easily ah, but can make it. 17     Ms Lee confirmed, under further questioning, that she had been travelling at quite a fast speed when she was cycling down the lane, though she did not agree that it was a high speed. She agreed that if she had slowed down and stopped at the stop line and then proceeded to make the right turn, she would not have been anywhere near the parked lorry. She also agreed that if the plaintiff had slowed down or stopped at the stop line, she would not have collided into the lorry and that the collision took place because the plaintiff may have lost control of her bicycle when she made the right turn. She agreed that the impact of the collision between the plaintiff and the lorry must have been quite great and that this must have been because the plaintiff was riding down the lane at a fast speed prior to that. She did not agree, however, that the lorry was clearly visible to anyone travelling down the lane. It would only be visible as you came closer to the junction and there would only be a few seconds between the time you saw the lorry and the time you made the turn. 18     Under re-examination, Ms Lee said that she did not know the exact speed at which she had been travelling when she approached the junction. It was, however, a speed at which she could make a right turn. She also clarified, by reference to the dimension of the court room, that she was about 30ft away from the lorry when she was first able to see it. She said too that when she used the word “squeezy” she had meant that after the turn her position had been “almost near the lorry” and she further clarified this to mean about a metre away from the lorry. Ms Lee stated that the lorry was parked in front of the junction and the light was a bit dim. She also said that she considered her own speed as normal and not fast or too fast. She confirmed that she did not really know what speed the plaintiff had been travelling at although she had said earlier in court that the plaintiff had been travelling at the same speed as she herself had. 19     Ms Lian’s evidence was less helpful as she did not see the accident occur, having negotiated the turn ahead of the plaintiff. She had travelled on Richard’s bicycle and had been rather scared as they approached the junction because of the speed of the bicycle and because they were travelling down the slope. She had therefore closed her eyes. Thus she did not see the lorry parked along the side of Sungei Tengah Road. She did recall that Richard did not stop at the stop line at the bottom of the lane before he proceeded to turn right at the junction. Under re-examination, Ms Lian confirmed that the environment was dim. She said that she had had her eyes closed all the way down the slope and she only opened them after they had made the turn. She then clarified that she had seen the lorries parked along Sungei Tengah Road before they had started down the slope though she had not identified them as lorries but had just seen them as objects. 20     Mr Mahmod testified that he had been driving the lorry in question for about a year before the accident. Tri-Mas allowed him to drive the lorry home at the end of his working day because of his difficulty in obtaining alternative transport to and from work every day. Tri-Mas, however, would not pay the season parking rates for the lorry to be parked in the car park near Mr Mahmod’s home and that was why he had regularly parked it along Sungei Tengah Road at night. In cross-examination, he was asked to show where the lorry had been parked on the 13 October 2006. He pointed to a lamp post and further questioning elucidated that the rear end of the lorry was about one metre away from the lamp post. The distance from the lorry to the Chengtai Nursery was about 30m away. He agreed that he had not parked the lorry immediately opposite the Chengtai Nursery but some distance away and near the lamp post. 21     Mr Mahmod confirmed that he had been charged under r 22(a) of the Road Traffic Rules for the offence of illegal parking and that he had compounded this offence by paying a fine of $70. He also admitted that parking along the stretch of Sungei Tengah Road where his lorry had been placed was illegal. He explained that on the day in question he had not put on his hazard lights because there were other lorries parked to the front and to the rear of his vehicle. He did not agree that this created a danger because there were street lights along the road and also there were other lorries parked there. 22     Mr Mahmod was asked whether he had obstructed the flow of traffic along Sungei Tengah Road by the manner in which he had parked the lorry. He did not answer the question directly but admitted it was an offence to park the lorry where he had. He reiterated that he had parked along the road for four or five years before the incident and up till that time had not been summoned or charged for illegal parking. Mr Mahmod was then asked whether parking near the junction of the road with the lane would create more of a danger. His response was that there was a stop line at the junction so that every vehicle approaching the junction had to stop before turning into Sungei Tengah Road. He disagreed that he had created a danger for other road users by parking near the junction. He also disagreed that by parking at the junction he had restricted the space needed by vehicles that were turning into Sungei Tengah Road from the lane. In his view, there was still sufficient space for the turn to be made. On being pressed, however, he agreed that his action had “restricted the space” available for turning vehicles. As far as visibility was concerned, Mr Mahmod maintained that visibility in the vicinity was good as there was a lamp post near his vehicle. Subsequently, after further questioning, Mr Mahmod agreed that by parking where he had, he had posed a danger for other road users. He also confirmed that the position of the lorry was slightly to the front of the place where the lane met Sungei Tengah Road. Under re-examination, having been referred to the photographs of the area where the accident took place, Mr Mahmod stated that there were no trees or other objects that would block the view of persons using the lane and prevent them from seeing traffic on Sungei Tengah Road. He also said that in his view, vehicles going down the lane would have been able to see his lorry parked along the left side of Sungei Tengah Road.",
        "Submissions and analysis": "23     Counsel for the plaintiff submitted that in view of their youth, the plaintiff’s witnesses were incapable of grasping the essence of the questions posed by either counsel. He also said that it could be gleaned from the evidence of Ms Lee and Ms Lian that the road was dim despite the lamp posts being in working order. As for the defence, Mr Mahmod had conceded that he had parked the lorry along Sungei Tengah Road for his own convenience and that that parking had been illegal. He had also agreed that he had not put on the hazard lights and that the lorry was parked on the road itself rather than on the grass verge. He further acknowledged that his manner of parking created a hazard for other road users. In view of this evidence, counsel submitted that Mr Mahmod was acutely aware that he had parked the lorry illegally and that he was culpable. 24     Turning to the law, counsel noted that it was well established that road users owe a duty to take reasonable care for each other’s safety and not to injure other road users. The defendants had breached this duty of care by their action of parking the lorry along Sungei Tengah Road near the junction with the lane. Counsel relied on the cases ofHill-Venning v Beszant[1950] 2 All ER 1151 (“Hill-Venning”) andParish v Judd[1960] 1 WLR 867 (“Parish”). InHill-Venning, the defendant motorcyclist stopped his motorcycle on the road after its light bulb went off. He did not push the motorcycle to the grass verge at the side of the road but instead attempted to repair the motorcycle while it was on the road. While he was doing the repairs, the plaintiff’s motor vehicle collided into the motorcycle. The majority of the Court of Appeal held that by failing to remove his motorcycle off the highway, the defendant had not taken all reasonable precautions to prevent danger to other traffic. He was therefore negligent and blame for the accident had to be apportioned as to two-thirds to the plaintiff and one-third to the defendant. The plaintiff in the present case laid emphasis on Denning L.J’s observation at p 1153 of the report ofHill-Venning. The presence of an unlighted vehicle in a road isprima facieevidence of negligence on the part of the driver, and it is for him to explain how it came to be unlighted and why he could not move it out of the way or give warning to oncoming traffic … 25     The above decision had to be contrasted with theParishcase where due to a breakdown of its lighting mechanism one night, the defendant’s car was towed by a lorry to the side of the road some six or seven yards from a street lamp. While both vehicles were stationary, the defendant’s car being completely unlit, the lorry carrying rear and side lights, a car in which the plaintiff was a passenger collided with the rear of the defendant’s car. The plaintiff claimed that the defendant had wrongfully obstructed the highway. It was held that the presence of a wholly unlit vehicle upon a dark road at night where there was no street lighting wasprima facieevidence of negligence on the part of the person responsible for the vehicle, but as the breakdown of the lighting mechanism could not be attributed to any negligent, omission or act of commission on the part of the defendant, the presumption of negligence had been displaced and the plaintiff’s action failed. The judge observed (at p 870) that the standard imposed by common sense demanded that if a person left a vehicle parked in a dark place at night, the vehicle should have lights upon it. 26     The plaintiff submitted that the negligence of Mr Mahmod in this case may be imputed from the following:  (a)   Mr Mahmod had knowingly parked his lorry on the road in contravention of r 91 of the Highway Code;   (b)   Mr Mahmod had parked the lorry on the road instead of on the grass verge;   (c)   the lorry was parked on a dimly lit road with poor visibility; and   (d)   the lorry was parked on the road for the sake of Mr Mahmod’s convenience and its presence there did not arise out of necessity.  27     The defendants submitted that the evidence showed that the accident was caused by the plaintiff’s own negligence because it established the following:  (a)   the plaintiff was a competent cyclist and regularly cycled in the Sungei Tengah area;   (b)   the plaintiff had a clear, unobstructed view of Sungei Tengah Road when she was cycling down the lane to make the right turn at the junction;   (c)   the plaintiff was riding too fast in the circumstances and failed to stop at the white stop line at the bottom of the lane; and   (d)   the plaintiff sustained severe injuries during the accident because she was riding too fast and therefore there was a great impact when she collided with the lorry.  28     Counsel further submitted that whilst Mr Mahmod had paid a composition fine for the traffic offence of parking opposite a continuous white line, the said traffic offence was irrelevant in establishing his liability for the accident. The charge was one that was established once it was shown that Mr Mahmod had parked opposite a continuous white line and it was not a necessary ingredient of the charge that the parking of the lorry in the position Mr Mahmod left it should have posed a danger to other road users. This requirement would have been relevant if Mr Mahmod had been charged under s 122 of the Road Traffic Road (Cap 276) which makes it an offence to leave a vehicle on a public road in such a position as to be likely to cause danger, obstruction or undue inconvenience to other users of the road. In this case, the evidence showed that the lorry in its parked position did not pose a danger to road users coming down the lane. 29     Counsel for the defendants relied on the English Court of Appeal decision ofDymond v Pearce[1972] 1 QB 496 (“Dymond”) to support his contention that Mr Mahmod was not liable for the plaintiff’s accident. 30     In that case, a lorry driver had parked his lorry on the highway overnight. The road was divided into two carriageways, each 24 feet wide; it had street lighting and was subject to a 30 m.p.h. speed limit. The lorry, 7½ feet wide, was parked with its lights on beneath a street lamp and was visible for some 200 yards when at 9.45pm, a motorcyclist with the plaintiff riding as pillion, collided into the back of the lorry, causing the plaintiff to be injured. The plaintiff brought an action in both negligence and nuisance against the lorry owners and driver on the basisinter aliathat the parked lorry was a hazard to road users. The trial judge found that the sole cause of the accident was the negligence of the motorcyclist in the circumstances presented and that the lorry owners and driver had not been negligent. The plaintiff appealed but his appeal was dismissed. 31     Sachs L.J. said at p 500: So far as negligence is concerned, it is sufficient to say that the finding of the judge in favour of the defendants was right. To park a lorry, even of the size of the one under consideration, under a good street lamp on a one-way carriage track 24 feet wide with its tail lights on at the appropriate time cannot be said to be negligent, at any rate when there was no evidence of difficulties likely to be caused to traffic (the traffic was said to be light at the relevant times), or as to the risk of heavy mist or fog supervening. Moreover, the lorry was parked in that position on a bend which is the more likely to be clear of other vehicles pursuing a normal course. 32     Edmund Davies L.J., another member of the bench inDymondin dealing with the claim in nuisance, said at p 504: Where a vehicle has been left parked on a highway for such a length of time or in such other circumstances as constitute it an obstruction amounting to a public nuisance, I remain of the view I expressed inParish v Judd[1960] 1 W.L.R. 867 that, in order that a plaintiff in such proceedings as the present may recover compensation for personal injuries caused by a collision with that obstruction, he must establish that the obstruction constituted a danger. 33     Counsel for the defendant submitted that the facts ofDymondare very similar to the present case. The salient facts common to both cases are as follows:  (a)   the accident happened around the same time at night;   (b)   the respective roads in both cases were wide and the parked lorries occupied less than half of the width of the respective lanes;   (c)   the street lamps in both cases were lit along the respective roads and in working condition;   (d)   inDymond, the lorry was parked immediately beneath a street lamp whilst in the present case, it is the defendants’ evidence that Mr Mahmod parked the motor lorry under or near a street lamp;   (e)   the weather condition was fine and visibility was good at the material time of the accident; and   (f)   in both cases, there was nothing to obstruct road users’ view of the parked lorries.  34     Counsel acknowledged that there was a difference betweenDymondand the present case in that inDymond, the driver had left the taillights of the parked lorry switched on while Mr Mahmod had admitted during cross-examination that he did not switch on the hazard lights when he parked his lorry along the opposite left lane of Sungei Tengah Road. He submitted, however, that this difference was not material because both Ms Lee and Ms Lian had testified during the trial that they were able to see the parked vehicles along the opposite left lane of Sungei Tengah Road before they reached the bottom of the lane and made the right turn at the junction. Hence, visibility was good in the present case even without Mr Mahmod switching on the hazard lights of his lorry. 35     Based on the principles enunciated inDymond, counsel submitted that the plaintiff here had to establish the nexus between the parked lorry here being an obstruction and the accident in that the plaintiff had to establish that this obstruction caused the accident as the parked lorry constituted a danger to road users. 36     The defendants submitted that throughout the course of the trial, the plaintiff had not established, either through the evidence of her own witnesses or the evidence of the defendants, that the act of Mr Mahmod parking his lorry along the opposite left lane of Sungei Tengah Road had caused an obstruction such that it constituted a danger to road users. She had also not established that the injuries that she had suffered as a result of the accident were a foreseeable consequence of Mr Mahmod’s act of parking the lorry where he had. On the contrary, the evidence of the plaintiff’s witnesses showed that that particular stretch of Sungei Tengah Road was sufficiently lit and parked vehicles along the said road were clearly visible to all road users, including the plaintiff which necessitated the conclusion that the accident, though unfortunate, was not foreseeable. The defendants submitted that if the plaintiff had slowed down and/or stopped at the white stop line at the bottom of the slope and/or kept a proper lookout, the accident could have been avoided. 37     In starting my own analysis, I must first of all emphasise something that is probably obvious to readers of the authorities cited by counsel for both sides in this case and that is how closely each case depends on its own facts. In the two authorities cited by the plaintiff, the motorist who parked on the road was found to bear at least some responsibility for the accident which ensued whilst in theDymondcase, the parking motorist was completely exonerated. Thus the act of parking on a road cannot be viewed in isolation. The degree of responsibility depends on the surrounding circumstances. InChan Loo Khee v Lai Siew San[1971] 2 MLJ 253, Ong CJ made the following statement of general principle (at p 254): If parking a car, however recklessly, so as to cause needless obstruction to other road users, were to be held blameless, merely because other motorists could still have room to pass,provided they kept a proper look-out, then it would appear that the deliberate parking of a car anywhere, even in the middle of the highway, should be considered equally excusable, if not justifiable, regardless of the fact that, by reason of such obstruction, other motorists had come to grief by reason of their not being fully alert. In such cases there should, in my opinion, be proper apportionment of blame, depending on the circumstances. But to exonerate the obstructionist completely – when it is undeniable that, but for the presence of the obstruction, there could not possibly have been an accident – is to ignore the principle of placing the blame fairly on those to be blamed for their acts or omissions. In this age of fast motor transport I think it is the duty of the courts to eschew excessive legalism and to require that every motorist should observe the golden rule of showing due consideration for other road-users, or suffer the consequences of his failure to do so. That statement was specifically approved by the Privy Council in the case ofChop Seng Heng v Thevannasan & Ors.[1975] 2 MLJ 3where the Privy Council upheld the trial judge’s apportionment of liability in a case where a lorry owned by the appellants and driven by their employees crashed into the rear of a stationary lorry owned by the second respondents which was in charge of their employee. The employee had parked it along a winding road in the middle of the night but it was a fairly wide road and the trial judge had found that there was ample room for an overtaking vehicle to have passed it in safety. Notwithstanding this, he held the respondents to be 75% liable for the accident because he found it more probable than not that the accident occurred because the lorry had been parked 30ft from the exit of a blind left-hand bend. 38     My most important task, therefore, is to find the facts. In my judgment, the evidence supports the following findings:  (a)   that the lamp posts along Sungei Tengah Road were in working order on the night of 13 October 2006 and provided sufficient light for any road user approaching the junction of the lane and Sungei Tengah Road to see the parked lorries along the road;   (b)   notwithstanding the lamp posts, the lighting was somewhat dim because of the presence of many trees along Sungei Tengah Road in the vicinity of the junction and therefore from further up the lane, it may not have been possible to make out individual lorries although parked objects would have been visible;   (c)   the lane had a fairly steep gradient downwards and there was a stop line at the end of the lane at which road users turning from the lane into Sungei Tengah Road were supposed to stop before proceeding with the turn;   (d)   the plaintiff did not stop at the stop line. She must have been travelling fairly fast and she lost control of her bicycle as she made the turn;   (e)   the plaintiff was familiar with the area where the accident occurred;   (f)   it was not unusual at the time of the accident for lorries and other vehicles to be parked along Sungei Tengah Road although such parking was against the road traffic rules;   (g)   contrary to the second defendant’s assertion in his affidavit, the lorry was not parked closer to the Chengtai Nursery, instead, it was parked in the vicinity of lamp post 117 which was situated fairly close to the junction of the lane and Sungei Tengah Road;   (h)   the second defendant did not put on any hazard lights as he thought this was not necessary since he was parked in between other vehicles;   (i)   although Sungei Tengah Road had two lanes of traffic on either side of the continuous white line and the lorry occupied slightly less than half of one lane, the result of the positioning of the lorry near the junction with the lane was that it restricted the space available for persons who were turning right into Sungei Tengah Road from the lane; and   (j)   the presence of the lorry therefore posed a danger to persons who, travelling down the lane, approached the junction at night.  39     In my judgment, both the plaintiff and the first defendant were to blame for the accident. The first defendant did not pay enough attention to the positioning of the lorry in relation to the junction and was careless in the way that he parked it. He realised this subsequently and that was why he admitted in court that the way that he had parked it had posed a danger to other road users. The difference between the present case andDymond’s case was not only the absence of the hazard lights but also the fact that inDymond’s case, the court found that there was no evidence that there were difficulties likely to be caused to traffic by the manner in which the lorry was parked. That was not the case here in relation to traffic turning right into Sungei Tengah Road. 40     I should say that I accept the evidence of the plaintiff’s friends and find that they understood the questions and responded honestly to them. I do not accept the submission that because of their youth, they did not understand what they were being asked. I was satisfied that when they did not understand questions, they indicated as such and the questions were then explained to them. Ms Lee in particular impressed me. She admitted without equivocation to matters that were not in favour of the plaintiff but at the same time she was also able to give a clear picture of the situation on the road caused by the presence of the lorry. 41     I find that the plaintiff must shoulder a greater degree of blame for the accident in that she did not pay enough attention to the presence of the lorries and did not slow down or stop prior to making the turn into Sungei Tengah Road. That caused her to lose control of her bicycle and to hit the lorry. She must have seen the lorry, despite the dim lighting, as she approached the junction but she did not pay sufficient heed to its presence. She too was negligent and bearing in mind that despite the obstruction of the lorry, her friends were able to negotiate the turn safely albeit with some difficulty, I consider her to bear the larger share of the blame for the accident. 42     In the circumstances, I apportion the liability of the parties as follows: two-thirds to the plaintiff and one-third to the defendants. I therefore enter interlocutory judgment for the plaintiff for damages to be assessed on the basis that she will be entitled to recover one-third of the damages so assessed. The question of costs is also to be determined at the assessment."
    }
}