{
    "case_title": "Jurong Port Pte Ltd v Huationg Inland Transport Service Pte Ltd",
    "ncitation": "[2009] SGHC 145",
    "coram": "Woo Bih Li J",
    "sections": {
        "The “inherently improbable” principle": "7       InMarina Centre Holdingsat [37], LP Thean JA explained in relation to the third step of Lord Morton’s test: We now turn to Lord Morton’s third test. The only question here is whether there are heads of damage founded on liability other than that for negligence which are covered by cl 36.1(b). This is subject to the caveat that the nonnegligent liability must not be so fanciful or remote that the appellants could not have desired protection against it. The underlying reason for this approach is that the court starts with a presumption that parties to a contract do not normally agree to accept the consequences of each other’s negligence, ie by way of an exemption clause, much less to shoulder responsibility for them, ie by way of an indemnity clause, and will not be taken to have intended to do anything so improbable, unless the contract does not admit of any other reasonable construction (per Oliver LJ in E Scott (Plant Hire) Ltd v British Waterways Board (supra) at p 10). 8       InCST Cleaning & Trading Pte Ltd v National Parks Board[2009] 1 SLR 55(“CST”), Chan Sek Keong CJ observed at [22]-[23] that the “inherently improbable” principle was equally applicable to indemnity clauses: 22    The principles of construction relating to exemption clauses are well established – having been stated by Lord Morton of Henryton inCanada Steamship Lines Ld v The King[1952] AC 192 (“Canada Steamship Lines”) and accepted by all courts in the common law world. These principles are equally applicable to indemnity clauses (see Viscount Dilhorne and Lord Fraser of Tullybelton inSmith v South Wales Switchgear Co Ltd[1978] 1 WLR 165 (“South Wales Switchgear”) at 167 and 172, respectively). InE E Caledonia Ltd v Orbit Valve Co Europe[1994] 1 WLR 221 (“Caledonia”), Hobhouse J gave a useful summary of these principles and their relationship to thecontra proferentemrule of construction. He said (at 227): The question remains one of the construction of the contract, applying the established principles of construction. These include the principle that the parties to a contract are not to be taken to have agreed that a party shall be relieved of the consequences of its negligence without the use of clear words showing that that was the intention of the contract. InWalters v.Whessoe Ltd. (1960) 6 B.L.R. 23, 35, Devlin L.J. said: “The law therefore presumes that a man will not readily be granted an indemnity against a loss caused by his own negligence.” InSmith v. South Wales Switchgear Co.Ltd. [1978] 1 W.L.R. 165, 168, Viscount Dilhorne said: “While an indemnity clause may be regarded as the obverse of an exempting clause, when considering the meaning of such a clause one must, I think, regard it as even more inherently improbable that one party should agree to discharge the liability of the other for acts for which he is responsible.” This principle overlaps with but is not the same as the “contra proferentem” rule – that contractual provisions should prima facie be construed against the party who was responsible for the preparation of the contract and/or who is to benefit from the provision. … The relevant principle is simply one which involves construing exemption and indemnity provisions as applying to a party’s own negligence, only if that intent is made clear in the contract; this principle is equally capable of application whether the clause is mutual or unilateral. 23    This principle as applied to the construction of indemnity clauses (which I shall refer to as “the ‘inherently improbable’ principle of construction”) was accepted by our Court of Appeal inMarina Centre Holdings Pte Ltd v Pars Carpet Gallery Pte Ltd[1997] 3 SLR 625, a case concerning an exemption clause. L P Thean JA said at [37]: The underlying reason for this approach [the “inherently improbable” principle of construction] is that the court starts with a presumption that parties to a contract do not normally agree to accept the consequences of each other’s negligence, ie by way of an exemption clause,much less to shoulder responsibility for them, ie by way of an indemnity clause, and will not be taken to have intended to do anything so improbable, unless the contract does not admit of any other reasonable construction. … [emphasis added] 9       In the present case, the plaintiff sought an indemnity from the defendant for the admitted negligence of the plaintiff’s own employee which resulted in the death of the defendant’s employee. It seemed to me inherently improbable that the defendant had agreed to indemnify the plaintiff in such circumstances. In any event, the language of Condition 13(1) was that of indemnity without specifying for whose conduct the defendant should indemnify the plaintiff. Thus, it was one thing to say that Condition 13(1) required the defendant to indemnify the plaintiff in respect of “any liability… whatsoever arising” but those words did not necessarily mean indemnifying the plaintiff for liability arising from the negligence of the plaintiff’s own employee. The most obvious liability intended to be covered would be that arising from the conduct of the defendant’s employees and perhaps also for that arising from the conduct of those for whom the plaintiff was not responsible. 10     The plaintiff also referred to Condition 13(2) which imposed a liability on the defendant to indemnify the plaintiff for damage to property. Condition 13(2) had a proviso that the damage must be caused by the defendant or its sub-contractor or something within the defendant’s control. The plaintiff’s argument was that since Condition 13(2) had this proviso whereas Condition 13(1) did not, this meant that under Condition 13(1), the defendant was liable to indemnify the plaintiff for the negligent conduct of the plaintiff’s own employee. I did not agree that such an omission was sufficient to do the job for the plaintiff under Condition 13(1). 11     Besides, there was yet another provision which the plaintiff had conveniently ignored. Condition 45 stated: The Contractor and his servants or agents and property belonging to them enter or are on the Employer’s premises at their own risks. The Employer shall under no circumstances whatsoever be liable to the Contractor, his servants or agents for injuries suffered by them not arising directly or indirectly from the acts, omissions, defaults, negligence of the Employer, their servants or agents and the Contractor shall indemnify defend and save the Employer harmless from and against all demands claims actions, proceedings in this respect. 12     Under Condition 45, the plaintiff was not liable to the defendant or its employees for injury which did not arise from the conduct of the plaintiff or its employees. This in turn implied that the plaintiff would be liable for injury to the defendant’s employees if the injury arose from the conduct of the plaintiff’s own employees. 13     Specification 23b also did not impose on the defendant the liability desired by the plaintiff for similar reasons. Specification 23e was further off the mark as it seemed to apply to a situation covering an employer’s liability to employees and provisions where certain persons may be deemed to be the employer of a workman for the purpose of specific legislation. In any event, Specification 23e also did not impose on the defendant the liability desired by the plaintiff. 14     The other provisions which the plaintiff raised to bolster its construction of Condition 13(1), Specifications 23b and 23e did not help the plaintiff.",
        "Thecontra proferentemprinciple": "15     The defendant also submitted that thecontra proferentemprinciple of construing the clause against the party who had drafted and/or sought to benefit from it (this contract being a standard-form contract supplied by the plaintiff to its contractors) also applied. In this case, I agreed that the clauses relied on by the plaintiff were ambiguous since the plaintiff’s negligence was not clearly included as one of the situations giving rise to indemnity liability on the defendant’s part. That, together with the inherently improbable principle, would have been sufficient to dispose of the plaintiff’s appeal. It was therefore not necessary to consider the third step of Lord Morton’s test. Nevertheless, I will also address the third step as applied by the district judge for completeness.",
        "The third step of Lord Morton’s three-step test": "16     As mentioned, the district judge found, at para 22 of his grounds of decision, that the third step of the test was not satisfied because Condition 13(1) as well as Specifications 23b and 23e were capable of covering more than negligence, such as loss arising from the wilful conduct of the plaintiff or its employees and such a liability was neither fanciful nor remote. It seemed incongruous to me that the defendant could be liable to indemnify the plaintiff forwilfulconduct of the plaintiff’s employees but not to indemnify the plaintiff for the negligent conduct of the plaintiff’s employees. Nevertheless, while I agreed with the plaintiff that the analysis of the district judge at the third step of the test was flawed, I still did not agree with the plaintiff that Condition 13(1) or any other provision it had relied on, would apply to cover the negligence of the plaintiff’s own employees for the reasons stated above.",
        "Public policy": "17     It seemed to me unreasonable for the plaintiff to seek an indemnity for a liability arising from the conduct of its own employee although, in fairness, I should mention that I was informed that its claim was driven by its insurer. 18     At present, the common law allows a party to include a contractual term to exempt itself from liability for its own negligence. It even allows a party to go one step further, that is, to claim an indemnity from the other contracting party for the claiming party’s own negligence provided that the contractual term is clear in imposing such an indemnity. 19     With the qualification that I have not had the benefit of full arguments on the point and if I were not constrained by authority, I would be inclined to the view that such a provision for an indemnity should not be upheld even if the contractual term is clear in imposing such a liability unless (a) there is clear evidence that such a liability was drawn specifically to the attention of the other contracting party, instead of being hidden in a host of provisions, and accepted or, (b) it satisfies the requirement of reasonableness (like the one stipulated in s 4 of the Unfair Contracts Term Act (Cap 396, 1994 Rev Ed) which applies to consumer contracts). Furthermore, bearing in mind that many of those who do not qualify to be categorised as consumers are actually in weak bargaining positions, the common law should perhaps go one step further and make requirement (b) above mandatory, whether in addition to requirement (a) above or not."
    }
}