{
    "case_title": "Luong Thi Trang Hoang Kathleen v Public Prosecutor",
    "ncitation": "[2009] SGHC 250",
    "coram": "Chan Sek Keong CJ",
    "sections": {
        "Introduction": "1       This was an appeal against the sentences imposed by the district judge below (“the District Judge”) in District Arrest Cases Nos 16861 and 16900 of 2009 (seePublic Prosecutor v Luong Kathleen Thi Trang Hoang[2009] SGDC 210(“the GD”)). In the court below, the appellant, Luong Thi Trang Hoang Kathleen (“the Appellant”), pleaded guilty to two charges of misusing a foreign travel document under s 47(3) of the Passports Act (Cap 220, 2008 Rev Ed) (“the current Passports Act”), with one charge being read together with s 109 of the Penal Code (Cap 224, 2008 Rev Ed)vis-à-visthe abetment of such misuse. The Appellant was sentenced to 12 months’ imprisonment for each of these offences (collectively referred to hereafter as “the Offences”), with the sentences to be served concurrently. 2       Section 47(3) of the current Passports Act provides as follows: (3)    If — (a)    a person uses in Singapore a foreign travel document in connection with travel or identification; (b)    the foreign travel document was not issued to that person; and (c)    the person knows or ought reasonably to have known that the foreign travel document was not issued to him, the person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 10 years or to both. 3       After hearing the submissions of the Appellant’s counsel and the Prosecution, I reduced the sentence for each of the Offences from 12 months’ imprisonment to eight months’ imprisonment. I also ordered the sentences to be served concurrently and to be backdated to 17 March 2009, which was the date on which the Appellant was remanded. I now give the reasons for my decision.",
        "The facts of the case": "4       The Appellant is a US national who was born in Vietnam. On 17 March 2009, the Appellant and an eight-year-old Vietnamese boy (“the Child”) arrived in Singapore at Changi Airport on a flight from Kuala Lumpur. The Appellant presented to the immigration officer a US passport in the name of “Nguyen Chau Mai” (“the NCM passport”) for herself and a US passport in the name of “Phan Andrew” (“the Child’s US passport”) for the Child. The Appellant told the immigration officer that the Child was her son. When asked about the discrepancies between her facial features and the facial features depicted in the photograph in the NCM passport, the Appellant said that she had previously undergone cosmetic surgery. Unconvinced, the immigration officer referred the Appellant and the Child to the duty officer to be further interviewed. 5       Upon further questioning, the Appellant admitted that the NCM passport which she was using belonged to her cousin. She claimed that she had used that passport only because she had lost her own passport and could not get a replacement in time as she needed to travel urgently. Subsequently, the Child’s Vietnamese passport was found in a rubbish bin at Changi Airport. The Appellant was shown that passport, and it was then that she admitted that the Child was not her son. She also asserted that she only wanted to “bring the [C]hild out of Vietnam to the USA for a better life”.[note: 1] 6       The events which form the backdrop to the Offences date back to about one and a half years ago when the Appellant started to volunteer in developing countries such as Honduras and Vietnam. The Appellant engaged in voluntary work in orphanages in those countries. While she was in Vietnam, she stayed with one Nhi Dang, a Vietnamese farmer, and her two sons, the younger of whom was the Child. The Appellant, who had herself left Vietnam as a young child to escape oppression and poverty and who had later been brought to the US under a humanitarian programme, agreed to find a way to help Nhi Dang and her family move to the US. 7       The Appellant’s application to bring Nhi Dang’s family to the US was turned down. The Appellant then tried to adopt the Child, but this did not work out either. In late 2008, the Appellant remitted US$1,300 to Nhi Dang to assist her financially. Sometime in February 2009, the Appellant lost her passport. As she thought about applying for a replacement, it occurred to her that, since her son did not have a passport yet, she could apply for a passport in his name but using the Child’s photograph; the Child could then enter the US using that passport. 8       The Appellant claimed that her original plan was to travel with the Child from Vietnam to London, with a stop in transit in Kuala Lumpur en route. From London, the Appellant and the Child would then take a flight to Mexico before entering the US via the land border between Mexico and the US. However, while en route to Kuala Lumpur, the Appellant realised that the Child’s US passport was packed in the check-in luggage and that the Child would therefore have to pass through Malaysian immigration using his Vietnamese passport. According to the Appellant, if the Child did so (ie, if he used his Vietnamese passport to pass through Malaysian immigration):[note: 2] … [The Child] would not be able to leave Malaysia with the U.S. passport [ie, the Child’s US passport] as it did not have an immigrationentrystamp. [The Appellant]panicked at the airport at Kuala Lumpur as she did not have much money left and their tickets to London had to be forgone.She spent some time checking the Internet before deciding to fly on Air Asia to Singapore,transitin Singapore and then fly to the U.S. on a China Airlines flight (via Beijing) as that was the cheapest option.When [the Appellant] arrived at Changi Airport, she learned to her dismay that her check-in baggage could not be simply transferred from the Air Asia flight [ie, the flight which the Appellant and the Child took from Vietnam to Singapore] to the China Airlines flight – i.e. she would have to pass through Singapore immigration, take her luggage and [check in] for the China Airlines flight.[The Appellant] thus went reluctantly to the immigration counter at Changi Airport. At the immigration counter, [the Appellant] thought about which of the 2 passports to use for [the Child] – his actual Vietnamese passport or the US passport in her son’s name [ie, the Child’s US passport]. She decided on the US passport as she thought then that she might need to show the US immigration [authorities] that [the Child] had travelled from Singapore.[underlining in original]  9       Before I explain why I allowed the appeal and varied the sentences handed down in the court below, it is necessary to first understand the District Judge’s reasons for imposing those sentences.",
        "The decision below": "10     In her mitigation plea to the District Judge, the Appellant submitted that she had committed the Offences out of altruism and by force of circumstances in that her original intention was not to use Singapore as a transit point. She also highlighted that she had committed the Offences on her own and not as part of a criminal syndicate. As mentioned earlier (at[1]above), the District Judge sentenced the Appellant to 12 months’ imprisonment for each of the Offences, relying on a benchmark sentence of 12 months’ imprisonment for the offence under s 47(3) of the current Passports Act (see the GD at[10]). The Judge relied essentially on the following aggravating factors: (a)     there had been planning and premeditation on the Appellant’s part (see the GD at[5]–[6]); (b)     the Appellant had taken steps to avoid detection (see the GD at[7]–[8]); and (c)     the Appellant had used Singapore as a transit point to fly to the US using another person’s passport (ie, the NCM passport) and had abetted the Child in doing the samevis-à-visthe Child’s US passport (see the GD at[9]). As the Judge only summarised the mitigating factors relied on by the Appellant and did not discuss them further (see the GD at[3]), it is reasonable to assume that he must have rejected them.",
        "The appeal": "",
        "Overview": "11     Before this court, counsel for the Appellant argued that the District Judge erred in: (a)     failing to give consideration to sentencing precedents for the offences under s 419 and s 471 of the Penal Code (which are, respectively, the offence of cheating by impersonation and the offence of using as genuine a forged document or forged electronic record); and (b)     failing to consider mitigating factors in favour of the Appellant. While I did not think that sentencing precedents relating to s 419 and s 471 of the Penal Code were useful in determining the appropriate sentence for the offence under s 47(3) of the current Passports Act, I agreed with the Appellant’s counsel that the District Judge failed to apply his mind sufficiently to the mitigating factors present in this case. I should also mention, apropos the case authorities cited by the Prosecution, that those authorities were distinguishable from the present case on their facts.",
        "Sentencing precedents relating to section 419 and section 471 of the Penal Code": "12     As mentioned in the preceding paragraph, s 419 of the Penal Code deals with the offence of cheating by impersonation, while s 471 thereof deals with the offence of using as genuine a forged document or forged electronic record. The punishment for the former offence is imprisonment of up to five years or a fine or both (see s 419 of the Penal Code), while the punishment for the latter offence is imprisonment of up to four years or a fine or both (see s 471 read with s 465 of the Penal Code). Counsel for the Appellant essentially relied on cases involving these two offences to suggest that a more lenient sentence should have been imposed on the Appellant for each of the Offences. In addressing this argument, it is useful to first understand the genesis of the Passports Act 2007 (Act 33 of 2007) (“the 2007 Passports Act”), which is the immediate predecessor of the current Passports Act, and the policy behind the former statute’s enactment in 2007. 13     Prior to the enactment of the 2007 Passports Act, the relevant statute relating to passports was the Passports Act (Cap 220, 1985 Rev Ed) (“the 1985 Passports Act”), whose predecessor was, in turn, the Passports Act 1970 (Act 51 of 1970) (“the 1970 Passports Act”). The 1985 Passports Act, which was substantially the same as the 1970 Passports Act, did not adequately address the misuse of Singapore passports as well as foreign travel documents. In 2007, the Passports Bill 2007 (Bill 21 of 2007), which later became the 2007 Passports Act, was introduced in Parliament. As can be seen from the parliamentary debates on this Bill, the Legislature’s intention was to enact a consolidated statute to,inter alia, arrest the increased misuse of both Singapore passports and foreign travel documents by criminal and terrorist elements to facilitate their movement between countries. In particular, four main types of passport offences were introduced (including the misuse of foreign travel documents), all of which would “carry heavy penalties to send a clear message to potential perpetrators” (seeSingapore Parliamentary Debates, Official Report(16 July 2007) vol 83 at col 1094perMr Wong Kan Seng (“Mr Wong”), the Deputy Prime Minister and Minister for Home Affairs). Notably, Mr Wong emphasised that offences relating to the misuse of foreign travel documents were to be viewed seriously and with the same severity as if they related to the misuse of Singapore passports (idat cols 1096–1097): … [B]esides the Singapore passport and travel documents, foreign travel documents are also susceptible to tampering, forgery and misuse.We view any form of passport abuse seriously. Clause 47 of the Bill[which is now s 47 of the current Passports Act], therefore, seeks to punish such acts, if they are carried out in Singapore, with penalties equivalent to that imposed [for] the tampering, forgery and misuse of Singapore passports and travel documents. [emphasis added] 14     Given the genesis and the objective of the 2007 Passports Act (and, likewise, the current Passports Act), I did not think that sentencing precedents for the offence under s 419 of the Penal Code were persuasive, considering that that section was not enacted for the same purpose as s 47(3) of the current Passports Act (s 419 of the Penal Code essentially sets out a less severe offence which is punishable with,inter alia, a maximum imprisonment term of only five years). Similarly, the offence under s 471 of the Penal Code is deemed to be less severe than the offence under s 47(3) of the current Passports Act as the former is punishable under s 465 of the Penal Code with,inter alia, an imprisonment term of only four years at most. In assessing the value of sentencing precedents based on an offencedifferentfrom that for which the court is to pass sentence, care must be taken to ensure that the two offences (ie, the offence which is the subject matter of the sentencing precedents and the offence for which the court is to pass sentence), although different, are still analogous in terms of both policy and punishment. Now that offences relating to the misuse of foreign travel documents have been consolidated and exhaustively set out in s 47 of the current Passports Act, sentencing precedents for other unrelated offences would be of limited guidance in prosecutions for the offence under s 47(3) of that Act. For the above reasons, I did not think that the sentencing precedents cited by the Appellantvis-à-viss 419 and s 471 of the Penal Code were applicable.",
        "The District Judge’s failure to consider the mitigating factors present in this case": "15     Turning to the factors which the District Judge considered in coming to his decision on sentencing, I was of the view that, while the District Judge took into account the aggravating factors present in this case, he was wrong in not giving any weight or in failing to give sufficient weight to the following mitigating factors. 16     First, there was no evidence that the Appellant committed the Offences for any purpose other than the altruistic one of bringing the Child to the US so that he could have a better life. My main concern in this case was whether the Appellant’s actions were in the nature of child-trafficking and whether Singapore was being used as a transit point for carrying out such activity. If that had been the case, it would have thrown a different light on the Appellant’s flight to Singapore. However, the evidence showed that the Appellant had indeed done a considerable amount of voluntary work among the poor in several developing countries. This included volunteering in five different orphanages in Honduras as well as Vietnam, where she met the Child and his family (see[6]above). There was no gainsaying these activities of the Appellant as they have been documented; supporting photographs were also submitted to the District Judge. For instance, the Appellant gave money to help Nhi Dang, the mother of the Child (see[7]above). On the evidence, there was no reason why I should not believe the assertion by the Appellant that she had committed the Offences in a “misguided [attempt] … to help [the Child] get a better life through wrongful means”.[note: 3]There was no evidence that the Appellant did what she did for financial gain. On the contrary, she spent a significant amount of effort and money in purchasing the necessary air tickets to bring the Child to the US. This was a strong mitigating factor in her favour (seeSeaward v PP[1994] 3 SLR 369at 378, [31], andcf PP v Ong Ker Seng[2001] 4 SLR 180at [30], where there was no evidence to support the accused’s alleged altruistic motive for committing the offences concerned). 17     The second mitigating factor in this case was the relatively low level of culpability on the part of the Appellant, leaving aside the fact that she was (as she saw it) on a mission of mercy. In this respect, the court should not be concerned with the Appellant’s humanitarian instincts in trying to give the Child and his family the opportunity of having a better life (specifically, it would seem that the Appellant’s hope was that, in future, the Child, by having a better life in the US, might in turn be able to help his family). What the court should be concerned with instead is the Appellant’s culpability. It is true that there was premeditation and planning by the Appellant, but, given the nature of her act (ie, using a passport that was not hers to enter the US and abetting the Child in doing likewisevis-à-visthe Child’s US passport, as well as trying to secure the best air routes for travelling to the US from Vietnam), planning was obviously necessary. Further, although the planning carried out by the Appellant was for the purposes of a misguided and reprehensible mission (in so far as the mission entailed breaking the law), such planning could hardly be viewed as an aggravating factor as the Appellant’s conduct was not aimed at securing any personal advantage or benefit for the Appellant herself. The District Judge also found that the Appellant “had taken steps to avoid detection” (see the GD at[7]), but it is not clear what conduct of the Appellant this finding of fact referred to. It would seem to refer to her throwing the Child’s Vietnamese passport into a rubbish bin at Changi Airport (see[5]above). But, that act was merely part and parcel of her overall plan to bring the Child to the US. 18     The evidence showed, and the Prosecution did not contend to the contrary, that the Appellant never intended to pass through Singapore in transit. Indeed, she never intended to enter Singapore even temporarily because her original transit point was Kuala Lumpur (as mentioned at[8]above, the Appellant’s original plan was to fly from Vietnam to London via Kuala Lumpur and then from London to Mexico, before proceeding from Mexico to the US by land). However, because the Appellant inadvertently packed the Child’s US passport in her check-in luggage, the Child was unable to use that passport to pass through Malaysian immigration. The Appellant thus decided to stop in transit in Singapore instead and fly from Singapore to the US via Beijing. At Changi Airport, the Appellant found out that her check-in baggage could not be simply transferred from the flight which she and the Child had taken from Vietnam to the flight which they were to take to the US; instead, they had to pass through Singapore immigration, collect the luggage and check in afresh for the latter flight. These circumstances reduced the Appellant’s culpability for the Offences. The present case must be distinguished from one where the accusedintendsto enter Singapore using a false foreign travel document in order to find work or procure some other personal benefit here. 19     Third, the Appellant was not part of a criminal syndicate that dealt in false travel documents. This was another factor which made a deterrent sentence unwarranted in this case, unlike cases involving organised crime. We must also bear in mind that the current Passports Act was enacted partly to arrest the increased misuse of Singapore passports and foreign travel documents by criminal and terrorist elements to facilitate their movement between countries (see[13]above) – such conduct is far removed from the Appellant’s conduct in the present case.",
        "The distinction between the present case and the unreported decisions cited by the Prosecution": "20     The mitigating factors mentioned at[16]–[19]above suffice to distinguish the present case from what I shall hereafter refer to as “the Prosecution’s s 47(3) case authorities”,ie, the cases cited by the Prosecutionvis-à-visthe offence under s 47(3) of the current Passports Act (or its equivalent under the 2007 Passports Act). Notwithstanding that, however, it is, in my view, worthwhile examining the Prosecution’s s 47(3) case authorities briefly, and to this, I now turn my attention. 21     The Prosecution’s s 47(3) case authorities were all unreported cases in which no written grounds of decision were given to explain the sentences imposed. Further, it appears that the sentences meted out in those cases were all based on a benchmark sentence or starting point of 12 months’ imprisonment. In this connection, I would first caution against relying onunreporteddecisions indiscriminately in determining the appropriate sentence for the particular case before the court. The dangers of doing so are clear. InTay Kim Kuan v PP[2001] 3 SLR 567, this court cautioned at[6]that unreported cases were only guidelines since “the detailed facts and circumstances of these cases [were] hardly disclosed or documented with sufficient clarity to enable any intelligent comparison to be made”. Comparisons based on unreported decisions are difficult and are “likely to be misleadingbecause a proper appraisal of the particular facts and circumstances is simply lacking” [emphasis added] (seePP v Siew Boon Loong[2005] 1 SLR 611at [26], where the court also emphasised that, although case summaries were, in the absence of written grounds of decision, “helpful in providing … a broad sense of the sentences imposed for different permutations of variables” (ibid), they were pitched at “simply … too high a level of abstraction or generalisation for any meaningful comparison to be drawn” (ibid)). 22     In this case, the District Judge, in my view, placed undue reliance on unreported cases (viz, the Prosecution’s s 47(3) case authorities) without considering whether the facts in those cases were analogous or similar to the facts in the present case. Although the sentences imposed in the Prosecution’s s 47(3) case authorities were consistently pegged at imprisonment of 12 months, we must remember that “benchmarks …should not… be viewed as binding or fossilised judicial rules” [emphasis added] (seeDinesh Singh Bhatia s/o Amarjeet Singh v PP[2005] 3 SLR 1at [24]) because “[t]he circumstances of each case are of paramount importance in determining the appropriate sentence” (ibid). 23     From the statements of facts in the Prosecution’s s 47(3) case authorities, it can be seen that those unreported decisions were not analogous or similar to the present appeal because, in each of those cases, there was either a discernible element of personal benefit for the accused or the exchange of money to facilitate the misuse of travel documents. InPP v Jeevanantham MangaleenaDistrict Arrest Case No 17856 of 2008 (24 July 2008; unreported), for instance, the accused, a Sri Lankan national, committed the offence under s 47(3) of the 2007 Passports Act by entering Singapore using a Canadian passport which did not belong to her so that she could subsequently leave Singapore to find work in Canada, while inPP v Nithiyanantham SuthaniDistrict Arrest Case No 53300 of 2008 (16 December 2008; unreported), the accused, also a Sri Lankan national, paid 500,000 Sri Lankan rupees to an agent to facilitate the misuse of a foreign passport in Singapore. The exchange of money to facilitate the misuse of travel documents is an aggravating factor because, when money is involved, the actions of the accused would contribute to the illegal sale and purchase of travel documents (in this regard, it is pertinent to note that the punishment for the offence under s 42(2) of the current Passports Act of engaging in thebusiness or tradeof selling Singapore passports or Singapore travel documents is much more severe than the punishment for the offence under s 47(3) of the same Act).",
        "Conclusion": "24     For all of the above reasons, the District Judge should have taken into account the mitigating factors which made this case different from the Prosecution’s s 47(3) case authorities. In the circumstances, I agreed with counsel for the Appellant that a sentence of 12 months’ imprisonment for each of the Offences was manifestly excessive. I therefore reduced the sentence to eight months’ imprisonment for each offence, with the sentences to be backdated to the date of the Appellant’s remand (ie, 17 March 2009) and to be served concurrently.",
        "A postscript on deterrence and proportionality in sentencing": "25     While a firm view should be taken of the offence under s 47(3) of the current Passports Act (and, indeed, the offences under s 47 of that Act in general), much will turn on the nature of the offence involved (in terms of,inter alia, the specific criminal conduct of the accused) and the culpability of the accused. The court should refrain from imposing a punishment that is disproportionate to the actual or potential harm or damage done to society. There is an established role for deterrent sentencingvis-à-viscertain types of offences (for instance, where it is sought to stem the incidence of a particular type of offence). But, even where this objective applies, there will arise from time to time cases in which it may not necessarily be appropriate to impose a deterrent sentence. The culpability of the accused should cross a certain threshold before a deterrent punishment is imposed on him or her. What that threshold is depends very much on the nature of the offence which has been designated or identified as warranting the imposition of a deterrent sentence. In the present case, on the evidence before the court, I did not consider that the Appellant had crossed the requisite threshold. Judges should not blindly apply any sentencing principle without considering all the circumstances of the case at hand, especially the culpability of the accused inthat particular case. It cannot be overemphasised that the courtmustapply its mind to the facts ofeach case before itand determine the appropriate sentence accordingly. _________________ [note: 1]See para 12 of the Statement of Facts dated 12 May 2009. [note: 2]See paras 26–29 of the Appellant’s mitigation plea. [note: 3]Idat para 34."
    }
}