{
    "case_title": "Tan Chan Tee v Chen Tsui Yu and Another Suit",
    "ncitation": "[2009] SGHC 36",
    "coram": "Judith Prakash J",
    "sections": {
        "Introduction": "1       These consolidated proceedings concern the true ownership of two houses in Singapore. The parties involved in the disputes are related to each other either by blood or by marriage. The disputes were originally the subject matter of two separate sets of proceedingsvizSuit 265/2005 (“S265”) and Suit 457/2006 (“S457”). Although the plaintiffs and defendants in each set of proceedings are distinct, the actions were consolidated because of the parties’ connections with each other and some overlapping facts. 2       The houses involved in the disputes are, respectively, the land and premises known as 7 Margate Road (“the Margate property”) and 7 Seraya Lane (“the Seraya property”). The legal owner of the Margate property until September 2006 was Loo Chay Loo, deceased. The administrators of the estate of Loo Chay Loo deceased (“the Estate”) are his widow, Madam Chen Tsui Yu (“Mdm Chen”), and his son Chen John-son. Mdm Chen is also the legal owner of the Seraya property. 3       The competing claims to the Margate and Seraya properties come from other members of Loo Chay Loo’s family. His elder brother, Loo Chay Sit, is the plaintiff in S265 which was started against Loo Chay Loo on the basis that Loo Chay Loo held the Margate property in trust for Loo Chay Sit and that therefore Loo Chay Sit was then the true beneficial owner of the Margate property. The plaintiff in the other action, S457, is Madam Tan Chan Tee (“Mdm Tan”) who is the mother of Loo Chay Loo and Loo Chay Sit and thus, the mother-in-law of Mdm Chen. Mdm Tan’s claim is that Mdm Chen holds the Seraya property on trust for Mdm Tan, the true beneficial owner thereof. 4       The claims of Loo Chay Sit and Mdm Tan (whom I will sometimes collectively refer to as “the claimants”) to be the true owners of the properties concerned are not based on any express trust created by the registered owners of the properties. Instead, the claimants assert that they provided the purchase monies for the respective properties and that, accordingly, the same became subject to resulting trusts in their favour. 5       The defendants in the respective actions are the Estate and Mdm Chen. Their stand is that Loo Chay Loo was, at all material times, and Mdm Chen is, on the Register of Land Titles the registered owner of the respective properties. As such, they are entitled to the protection of the provisions of s 46 of the Land Titles Act (Cap 157, Revised Edition 2004) (“the Act”), and the onus lies on the claimants to establish grounds that would deprive them of such protection. Further, they deny that the purchase monies for the properties were provided by Loo Chay Sit and Mdm Tan. Thus the main issue that arises is whether the evidence adduced establishes on the balance of probabilities that the claimants paid for the properties. The other issues to be decided really depend on the result of my finding on this issue and therefore I will not enumerate them yet. 6       There is one complication here which I should mention right away. In S265, Loo Chay Sit’s initial claim was for a declaration that he was the true owner of the Margate property and that Loo Chay Loo held it on trust for him. Subsequently Loo Chay Sit, having obtained a judgment to this effect in default of appearance, sold the Margate property. This judgment was set aside thereafter and the Estate filed a counter claim against Loo Chay Sit for the proceeds of sale. Loo Chay Sit’s claim for a declaration having been dismissed on 25 January 2008 for failure to comply with an “unless order”, only the counter claim in S265 remains alive.",
        "Background to the acquisition of the properties": "7       The relevant members of the Loo family are as follows: (a)    Loo Siong Toh @ Lir Siong Toh; (b)    Mdm Tan Chan Tee, wife of Loo Siong Toh; (c)    Loo Chay Sit, elder son of Loo Siong Toh; (c)    Loo Chay Loo, younger son of Loo Siong Toh; (d)    Loo Siong Soo, younger brother of Loo Siong Toh; (e)    Mdm Teo Swee Lian, wife of Loo Siong Soo; and (f)     Mdm Chen Tsui Yu, widow of Loo Chay Loo. 8       Apart from the Seraya and Margate properties, another piece of property plays an important part in this saga. This is the land and premises (a bungalow) known as 11 Margate Road (“11 Margate”). In or about 1968 Loo Siong Toh and his family moved into these premises. I do not know when 11 Margate was purchased but at all material times up to April 1987, this property was owned in equal shares by Mdm Tan and Mdm Madam Teo. 9       In 1971, Loo Chay Sit went into business in partnership with his uncle Loo Siong Loo under the firm name, Lian Cheong (Loo Kee) (“the firm”). The firm was in the business of the import and export of goods. In 1974, a third partner was admitted to the firm. In January 1975, Loo Chay Loo who had just completed his national service joined the firm as its fourth partner. 10     In May 1975, Madam Tan and her sister in law, Madam Teo, entered into an agreement to purchase the Seraya property. On the completion of the purchase, they became joint owners, in equal shares, of the Seraya property. The Seraya property was occupied thereafter by Madam Teo and her husband Loo Siong Soo whilst Madam Tan continued to live at 11 Margate with her family. 11     In 1978, Madam Tan learnt that the then owners of the Margate property wanted to sell it. Subsequently, in early 1979, it was conveyed to Loo Chay Loo for a consideration of $195,000. Initially, Loo Chay Sit moved into the Margate property whilst Loo Chay Loo continued to reside at 11 Margate. After Loo Chay Loo’s marriage to Mdm Chen in June 1980, however, the newlyweds moved into the Margate property and Loo Chay Sit moved back to live with his parents. Loo Chay Loo and his wife continued to occupy the Margate property thereafter until they immigrated to the United States with their young son in 1993. 12     In the meantime, Loo Chay Sit had been having matrimonial difficulties. He had married his first wife at the end of 1974 but she left him in early 1976 and thereafter started divorce proceedings against him. Loo Chay Sit officially relinquished his partnership in the firm on 1 June 1977. According to him, however, this was on paper only and his shares were thereafter held in trust for him by his uncle and sister. He was re-admitted to the firm as a partner in November 1980 as his divorce proceedings had been settled by then. 13     On 18 November 1981 a company called Lian Cheong Travel Services Pte Ltd (“LC Travel”) was incorporated to carry on business as a travel agent. Shortly after its incorporation, LC Travel had a paid up capital of $175,000 divided into 175,000 shares of $1 each. The biggest shareholder was Loo Chay Loo (62,999 shares) whilst Loo Chay Sit (34,999 shares) and four other family members held the rest of the shares. The directors of the company were the two brothers, and their aunt Loo Bee Choo. In October 1986, Mdm Chen became a director and a shareholder as well (28,000 shares). Thereafter, together Loo Chay Loo and Mdm Chen held more than 50% of the issued share capital. In 1983, the Margate property was mortgaged to the United Overseas Bank Ltd (“UOB”) to secure a facility granted by UOB to LC Travel. 14     The next development was that towards the end of 1986, Loo Siong Soo indicated that he wanted to retire as a partner of the firm. At that time, the firm and the partners were in financial difficulties. In order to retire, Loo Siong Soo had to pay a sum of $328,817 to the firm to cover his shares of the losses that the firm had incurred. Mdm Teo agreed to sell her interest in 11 Margate and in the Seraya property in order to raise the necessary funds and to have some extra money to acquire a new home. As a result, various transactions took place. The end result of these transactions was that Mdm Tan became the sole owner of 11 Margate and Mdm Chen the sole owner of the Seraya property. 15     The parties have given widely differing accounts of what was agreed and what took place and it may be helpful for me to set out their separate accounts here. According to Mdm Tan, the agreement was Mdm Teo would sell her half share in each of the Seraya property and 11 Margate to Mdm Tan for a total sum of $788,000. Mdm Tan further agreed that she would pay $550,000 from this amount to Loo Siong Soo and Mdm Teo, and would undertake to bear Loo Siong Soo’s debt to the firm to the extent of $238,000. Mdm Chen on the other hand asserted that when Mdm Teo and Mdm Tan had originally tried to sell the Seraya property on the open market, they had been unsuccessful in that a potential buyer who had originally offered $788,000 for the property later backed out of the deal and they were unable to find another buyer. Mdm Chen said that it was at this stage that she and Loo Chay Loo stepped in to help them and to purchase the Seraya property. They paid $238,000 to help cover part of Loo Siong Soo’s share of the firm’s losses and she herself then purchased the Seraya property for $550,000 from Mdm Teo and Mdm Tan. 16 On 8 April 1987, Mdm Teo conveyed her half share in 11 Margate to Mdm Tan. According to the conveyance, the consideration for the purchase was $250,772. At the same time 11 Margate was mortgaged by Mdm Tan to the Kwangtung Provincial Bank Ltd (“KT Bank”) to secure an overdraft facility of $442,000 granted by KT Bank to LC Travel. Mdm Tan stated that a portion of the funds raised through the overdraft facility were used to pay Mdm Teo for her half share in 11 Margate. 17     By a transfer instrument dated 21 April 1987, Mdm Tan and Mdm Teo, in consideration of the sum of $550,000, transferred the Seraya property to Mdm Chen. At about the same time the property was mortgaged to UOB by Mdm Chen to secure an overdraft facility of $550,000 granted by UOB to LC Travel. In June 1990, this mortgage was paid off and the Seraya property was immediately remortgaged to the Asia Commercial Bank. The second mortgage over the Seraya property was discharged on 22 February 1995.",
        "More recent events": "18     As I have stated above, Loo Chay Loo and his family left Singapore in late 1993 and lived thereafter in the United States of America. In September 2004, a shocking event took place: Loo Chay Loo killed his adopted son. He then attempted suicide but was arrested and charged for murder. Whilst in prison awaiting trial, Loo Chay Loo made a second suicide attempt. He injured himself so badly that he lapsed into a coma on 26 February 2005. Loo Chay Loo died in hospital in the United States on 16 May 2005. 19     Meanwhile, on 21 April 2005, Loo Chay Sit had started S265. Loo Chay Sit was aware that his brother was in a coma and the writ named Loo Chay Loo himself as the defendant and gave his hospital bed as one of the addresses of the defendant. The writ was not served at that time. After Loo Chay Loo’s death, Loo Chay Sit applied for the writ to be amended so that the named defendant became the Estate. By the same summons Loo Chay Sit also applied to serve Mdm Chen as personal representative of the Estate although she had not yet been appointed as its administratrix. 20     On 29 March 2006, Loo Chay Sit obtained a judgement in default of appearance against the Estate. Loo Chay Sit then procured the transfer of the Margate property to himself and sold it to a third party purchaser for the sum of $4.8 million under a contract dated 1 September 2006. On 27 July 2007, pursuant to an application made by the Estate, the default judgment was set aside and Loo Chay Sit was ordered to pay costs to the Estate. An appeal against this decision to the judge in chambers was dismissed with costs on 13 August 2007. 21     On 23 August 2007, the Estate obtained a court order ordering Loo Chay Sit to disclose to it, within two days, the amount of the net proceeds of the sale of the Margate property, and to pay the said amount into Court within seven days. Loo Chay Sit was also ordered to file an affidavit giving details of all his assets. Loo Chay Sit complied with the order only partially and the Estate subsequently obtained an “unless order” in respect of his failure to make payment into court and disclose details of his assets. Attempts by Loo Chay Sit to set aside the unless order were unsuccessful and, as he failed to comply with the same, his claim was eventually dismissed. 22     As for S457, this was commenced by Mdm Tan on 17 July 2006. She obtained a judgment in default of appearance on 25 January 2007. Mdm Tan then tried to effect a transfer of the Seraya property to her own name but was not able to do so because Mdm Chen had previously applied for a replacement of the certificate of title in respect of the Seraya property. Mdm Chen then successfully applied to have the default judgment set aside. 23     The outstanding claims before me are as follows: (a)    in respect of the Margate property, the claim of the Estate for a declaration that Loo Chay Sit holds the sale proceeds of that property on a constructive trust for the Estate because he obtained title to the Margate property unconscionably and/or fraudulently; and (b)    in respect of the Seraya property, the claim of Mdm Tan for a declaration that Mdm Chen holds that property on trust for Mdm Tan.",
        "The Margate property": "24     As I have stated, at all material times up to the date on which Loo Chay Sit obtained judgment in default of appearance in S265, Loo Chay Loo (or the Estate) was the legal owner of the Margate property. Loo Chay Sit was only able to procure the transfer of this legal ownership to himself because of the default judgment which declared that the property was being held on trust for him. Without the judgment he would not have been able to transfer the Margate property to his name or to sell the same to a third party. Once the default judgment was set aside, therefore, Loo Chay Sit’s entitlement to the property or its value was revoked and he no longer had the legal right to keep the proceeds of sale of the Margate property for himself. The Estate, by establishing the legal ownership of the property prior to the default judgment, has been able to establish a prima facie claim to the proceeds. The onus therefore has shifted to Loo Chay Sit to establish that, at all material times prior to the default judgment, Loo Chay Loo was holding the Margate property in trust for him. If he cannot establish that fact, he will not be able to resist the Estate’s claim that he holds the proceeds of sale on a constructive trust for the Estate.",
        "The pleading point": "25     Before I go into the evidence on payment, it should be noted that the Estate quite apart from criticising the quality of the evidence produced by Loo Chay Sit, also adduced evidence tending to show that Loo Chay Loo had paid for the Margate property. Loo Chay Sit objected to this evidence and the submissions arising from it on the basis that the Estate did not expressly plead that Loo Chay Loo had paid for the Margate property. CitingMulti-Park Singapore Pte Ltd v Intraco Ltd[1992] SGHC 188, he relied on the well-known principle that a party to an action must set out in his pleadings all material facts on which he relies for his claim or defence and that failure to comply with this rule would preclude such party from presenting a case on the point omitted. He also submitted that if the defence was simply that the plaintiff had the onus of proving his case, it would not be permissible for the defendant to put forward an affirmative case. In its pleading here, the Estate had not averred in express terms that Loo Chay Loo had paid for the property and therefore it could not be allowed to put forward an affirmative case to that effect. 26     The Estate disputed that it was a material fact in the action whether Loo Chay Loo had paid for the Margate property. Loo Chay Loo was the registered owner of the property and even if he had not paid for it and it was a gift to him from someone else, he would still be the registered owner of the property and entitled to be treated by the world at large as such. It was Loo Chay Sit who had to plead and show that he had paid for the purchase of the property. In any case however, the point had been covered by the pleadings. Loo Chay Sit had pleaded in his statement of claim that Loo Chay Loo did not pay and did not provide any consideration for the transfer of the Margate property to his name. The Estate denied this allegation in its defence and this denial was not a bare denial but a pregnant negative. This is because a denial of non-payment necessarily implies payment being made. It is a double negative which contains within itself an affirmative assertion. If A denies an assertion that he did not pay for an item, A is in fact asserting that he did pay for the item. In this respect, the Estate relied on my decision inNagase Singapore Pte Ltd v Ching Kai Huat[2007] 3 SLR 265. 27     I accept the Estate’s submission. Its denial of the allegation that Loo Chay Loo had not paid for the Margate property was not a bare denial but instead implied an affirmative case. The function of pleadings is to ensure that parties know the case that they have to meet and are not surprised by it. Loo Chay Sit cannot have been surprised by the allegations of payment made on behalf of Loo Chay Loo. He must have realised that the denial was in itself an assertion of claim because he adduced evidence through others as to the unlikelihood of Loo Chay Loo’s having had the ability to pay at the material time and also asserted his own belief to this effect. It was clear from the statements made by many of the plaintiff’s witnesses in their affidavits of evidence in chief that Loo Chay Sit was prepared to meet, and tried to defeat, a case that Loo Chay Loo had made the relevant payments. I therefore hold that the Estate was entitled to adduce evidence of payment made by Loo Chay Loo and to make an affirmative case to this effect.",
        "The payment": "28     No loan was taken out in connection with the purchase of the Margate property. The price was paid entirely in cash. The only documents indicating where this cash (or part of it) came from were three receipts relating to the purchase. All three receipts were issued by M/s Tang & Tan, the solicitors acting for the purchaser in the conveyance. The first receipt was dated 9 November 1978 and was for the sum of $19,500 “being payment of 10% purchase price RE No 7 Margate Road, Singapore 15”. The second receipt was dated 3 January 1979 and was in respect of the sum of $85,510.65 which was described as “Completion money”. The third receipt was also dated 3 January 1979 and was for the sum $7,150.50 being payment of the solicitor’s fees and disbursements. Each of these receipts stated: “Received from Lian Cheong (Loo Kee) A/c Mr Loo Chay Loo”.",
        "Loo Chay Sit’s case": "29     It is Loo Chay Sit’s case that an analysis of the firm’s accounts from 1975 to 1979 shows that the money used to purchase the Margate property came from his current account with the firm. 30     The firm was started in 1971. It was profitable from the first year. As of 31 December 1976, his balance in the current account of the firm stood at $248,925.77. Loo Chay Sit testified that in June 1976 he also received profits of $120,000 from his Indonesian investments. Therefore, Loo Chay Sit argued, he had sufficient funds to purchase the Margate property. 31     Loo Chay Sit had no contemporaneous documentary evidence in support of his allegation that he had provided the payment for the Margate property. During cross-examination he admitted that the whole foundation of his case and the entire evidence that he made the payment was contained in para 24 of his affidavit of evidence in chief. This stated: The fact that the money was paid by me and came from my account is clearly evident from the 1978 LCLK profit and loss account. As stated earlier, in 1976, I had $248,925.77 in my LCLK account. In 1978, as can be seen from the balance sheet as at 31 December 1978, this sum had fallen by about $193,000 to $55,522.83 (reflected as an interest free loan because I was not named as a partner in 1978) after I had paid for 7 Margate Road.",
        "The Estate’s position on payment": "32     It can be seen from [28] above that the only documentary evidence relating to payment of the purchase price of the Margate property did not reflect Loo Chay Sit’s name. Rather the three receipts issued by Tang & Tan showed that the money, in their records at least, had come from Loo Chay Loo. The argument made by the Estate was that Loo Chay Sit could not rely on the 1976 and 1978 accounts of the firm to show that actually he was the one who had paid for the property because, at best, those accounts could only show or reflect Loo Chay Sit’smeans to payfor the Margate property. Even then, they were not satisfactory proof of his means because: (a)    Loo Chay Sit did not produce the firm’s 1977 accounts and therefore no documentary evidence existed to show that he still had the sum of $248,925.77 in his account with the firm in 1978 and early 1979; (b)    in 1976 and 1977 Loo Chay Sit had matrimonial problems and a court order made on 15 July 1977 showed that he had to pay his then wife maintenance of $400 a month from January 1976 to July 1977 and thereafter the maintenance payable was increased to $420 a month; and (c)    in July 1977 Loo Chay Sit paid his solicitors $2533.33 as arrears of maintenance and a further $1,000 as their costs and there was evidence to suggest this money could have originated from the firm or Loo Chay Sit’s account in the firm. Therefore, there was no assurance at all that the sum of $248,925.77 that Loo Chay Sit had in his account at the end of 1976 remained unchanged at the end of 1977 and 1978. In fact that sum probably decreased in 1977 in the light of his matrimonial problems. 33     There was also the question of what income Loo Chay Sit earned in 1977. He retired from the partnership on 1 June 1977 and according to the firm’s accounts filed with the income tax authorities, Loo Chay Sit was not entitled to share in any of its profits for that year up to the date of retirement. There was no evidence of any returns on investment (unlike in 1976) or any other income earned by Loo Chay Sit in 1977. Whilst Loo Chay Sit claimed in his affidavit to have earned $39,088 that year, the document he produced to support this claim was a letter from the tax authorities dated 13 June 1977 giving him permission to pay his outstanding tax liability of $39,088 by four instalments between April and July 1977. Although, on the stand Loo Chay Sit changed his evidence and said he had earned $30,000 in 1977, all of this amount would have been consumed by his tax liability and there would still have been a balance owing to the authorities. Therefore, the Estate submitted, it was unlikely that Loo Chay Sit’s balance of $248,925.77 would have grown or even remained at the same level after the beginning of 1977. Given his matrimonial problems, his retirement and the lack of evidence of any substantial income earned in 1977 or 1978, it is more likely that Loo Chay Sit would have had to draw on that balance to meet his expenses. Loo Chay Sit was unable to produce a copy of the 1977 accounts and in court he explained that he had lost them. Those accounts, it was submitted, would have shown how much moneys he still had in his current account at the end of that year which would have been available to pay for the Margate property and the court should draw an adverse inference against him for failing to produce them. 34     It was also submitted that other parts of Loo Chay Sit’s evidence were inconsistent with his contention that he had paid the full purchase price of $195,000 from the balance that he had with the firm at the end of 1976. First, he had admitted that not all of this money was used to pay for the Margate property since the amount of $55,522.83 was still owing to him by the firm as at 31 December 1978. Hence, at the most, the sum that he could have used to pay for the Margate property from his account with the firm was $193,402.94. Then during cross-examination, Loo Chay Sit admitted that out of the money he had in the firm in 1976, at least $113,663.20 was returned to him in 1980. He subsequently confirmed that the sum of $64,374.83 (reflected as a balance of an interest free loan in the 1980 accounts of the firm) was also part of the money he had left in his account in 1976. 35     In summary therefore, it was submitted, out of the $248,925.77 that Loo Chay Sit left behind in 1976, the sum of $178,038.03 (derived from adding $113,663.20 to $64,374.83) was unused and eventually returned to him in1980. That left only $70,887.74 for his use in the purchase of the Margate property. Thus even if Loo Chay Sit had made some payment towards the purchase of the Margate property, he could not have paid the whole purchase price and accordingly his claim of entitlement to all the sale proceeds of the Margate property must fail. I must say here that I cannot fully accept this form of calculation by the Estate. It is not correct to use the figure of $64,374.83 as this was the sum outstanding at the end of 1979 which was almost 12 months after the property was bought. The correct figure would be $55,552.83 which was the sum Loo Chay Sit had in the firm at the end of 1978. Secondly, I do not think there is sufficient basis to add the two figures of $55,552.83 and $113,663.20 together and deduct the total from $248,925.77. There is no evidence that the two figures were entirely distinct and that the $113,663.20 returned to Loo Chay Sit in 1980 did not in itself encompass the outstanding loan at the end of 1976. However, even if only $113,663.20 were to be deducted from the 1976 balance that would leave $129,262.75 which would be insufficient to pay for the Margate Property and to that extent Loo Chay Sit’s claim that he only used money from the firm to pay the price would be undermined. 36     The Estate also emphasized a discrepancy in the time of payment. Loo Chay Sit stated in Court that he had paid the entire purchase price in 1978. This evidence tied in with his assertion in para 24 of his affidavit that the money had come from his current account with the firm as shown by the fact that the balance sheet as at 31 December 1978 indicated that his current account had fallen by about $193,400 to $55,000. It was pointed out to him in Court that according to the sale and purchase agreement dated 13 December 1978, the completion of the purchase of the Margate property was fixed for 3 January 1979. Tang & Tan’s receipt showed that they received a sum of $85,510.65 being the completion money on 3 January 1979. Additionally, the Indenture evidencing that the full purchase price had been paid to the vendors was executed by the vendors on 3 January 1979 and dated 6 January 1979 which indicated that completion probably took place only on 6 January 1979. When confronted with this evidence and asked whether it was true that the balance of the purchase money was only paid in 1979 (not 1978) Loo Chay Sit’s response was “The cheques were issued in December but I brought the cheques to ---to the law firm --- the law firm on 3 January”. 37     The Estate submitted that Loo Chay Sit’s tacit admission that the balance of the purchase monies were actually paid in 1979 was fatal to his case because: a) He had confirmed that the whole foundation of his case was in para 24 of his affidavit and that para depended on showing that the amount owing by the firm to him in 1976 had fallen by 31 December 1978 because, and after, he paid $193,400 for the Margate property; b) Payment of about $85,000 was made in 1979 and therefore the decrease in Loo Chay Sit’s account with the firm by the end 1978 did not show that he was the one who paid for the Margate property or substantially the whole of it; and c) Loo Chay Sit did not rely or adduce any evidence of payments made by him in 1979 and in fact the firm’s account showed an increase in the amount owing to him (from $55,522.83 in 1978 to $64,374.83 in 1979) which would not have occurred if he had taken out money in 1979 to pay for the Margate property. 38     The Estate also put forward the evidence that it relied on to substantiate its position that Loo Chay Loo was the one who paid for the Margate property. This was as follows: a) The down payment of 10% of the purchase price for Margate property ($19,500.00) was paid to the lawyers in November 1978 and the receipt for the down payment indicated that it had been received from Loo Chay Loo’s account with the firm; b) The 1978 accounts of the firm showed that in that year Loo Chay Loo drew an advance of $29,577.90 from his current account with the firm and this drawing would have been more than sufficient to cover the 10% down payment; c) Similarly, in January 1979 the receipt for ‘Completion money’ showed that the payment of $85,510.65 was received from Loo Chay Loo’s account with the firm. Correspondingly, the 1979 accounts indicated that Loo Chay Loo had drawn a sum of $125,047.45 from his balance with the firm in that year. This drawing would have been more than sufficient to cover the sum of $85,510.65. d) Although Loo Chay Loo’s total drawings from the firm in 1978 and 1979 amounted $154,625.35, which was insufficient to pay the full purchase price, Loo Chay Loo also had income from a firm called Guan Seng that carried on the business of a provision shop as he had been a partner in that business since 4 January 1975. e) The deficit in Loo Chay Loo’s current account after the purchase of Margate property was settled by 1981 from the monies which the firm paid to Loo Chay Loo. He had therefore repaid all monies borrowed for the purchase of the Margate property.",
        "Other evidence relating to ownership": "39     Apart from relying on the evidence that they had each adduced regarding payment, the parties also made arguments based on how the relevant persons had conducted themselves after the acquisition of the Margate property. They each put forward various reasons why this conduct was consistent with their own positions. 40     Loo Chay Loo relied, first, on the fact that the Margate property was his matrimonial home from the time of his marriage to Mdm Chen in 1980 up to 1993. Additionally, even after leaving Singapore, Loo Chay Loo continued to pay the property tax and other outgoings of the Margate property. It should be noted that Loo Chay Sit himself admitted that the outgoings had been paid by his brother from June 1987 onwards. His explanation was that Loo Chay Loo wanted to make up for the fact that he had not been paying rent for his occupation of his brother’s property. 41     It was also pointed out that the Margate property was mortgaged on two occasions to secure banking facilities for Loo Chay Loo himself. The first mortgage was made in September 1983 and according to the mortgage document it was to secure facilities granted by UOB to Loo Chay Loo either solely or jointly up to the limit of $700,000. The second mortgage was made in May 1990 in favour of Asia Commercial Bank and it was an ‘all monies’ mortgage to secure facilities granted to Loo Chay Loo. This second mortgage was eventually discharged using monies remitted by Loo Chay Loo and Mdm Chen from the United States. Loo Chay Sit admitted in court that they had settled the outstanding indebtedness secured by the mortgage. 42     Thirdly, in 1997 when Loo Chay Loo wanted to sell the Margate property he granted Mdm Chen (who was making a trip to Singapore) a power of attorney to deal with and sell the Margate property. Mdm Chen testified that it was Loo Chay Loo’s decision whether or not to sell the property and that Loo Chay Sit had no say in the matter at all. Mdm Chen’s evidence in this point was not challenged in cross-examination. In all ways, the Estate submitted, Loo Chay Loo’s conduct was consistent with his ownership of the Margate property. 43     On the other hand, Loo Chay Sit, it argued had behaved like a stranger in relation to the Margate property. First, although his explanation for having put the Margate property in his brother’s name instead of his own was that he did not want his then wife to claim a share in it, Loo Chay Sit did not bother to have the property transferred into his name once his divorce proceedings were settled. Loo Chay Sit reached a settlement with his ex-wife in April 1980. Although there was no reason thereafter to leave the title in Loo Chay Loo’s name, Loo Chay Sit did nothing to regain his ownership for almost 25 years. This lack of action was in stark contrast to his haste to rejoin the firm (November 1980) and thereby regain the monies that he had left behind 1977 and the profits held by other persons during the period he was not a partner. 44     Secondly, Loo Chay Sit did not use the Margate property as his matrimonial home even though he needed it. In early 1981, Loo Chay Sit lived in 11 Margate with his parents and grandfather and, additionally, one Lim Gek Hong, his then girlfriend. Not long after that Loo Chay Sit’s second wife Mdm Chia also moved in to 11 Margate. She brought with her their three year old son. At the same point of time the Margate property was occupied only by Mdm Chen and Loo Chay Loo. By 1985, Mdm Chia had a total of 4 children with Loo Chay Sit. The whole family lived at 11 Margate with the parents and grandfather. There were thus 9 persons living in 11 Margate whilst the Margate property was still occupied by only 2 persons. 45     Thirdly, throughout the years when Loo Chay Sit was in financial difficulties, he did not use, mortgage or sell the Margate property to alleviate his financial woes. He admitted that in 1986 and 1999 he needed money but he claimed he did not want to sell the Margate property because, it being his first big purchase, he could not bear to sell it. He was also reluctant because if it had been sold he would have raised a much larger sum of money than he actually required. Instead he dealt with his difficulties by borrowing money from other members of his family including Loo Chay Loo. Eventually he returned a sum of $400,000 to Loo Chay Loo and Mdm Chen even though they were holding on to his property. 46     The matters that Loo Chay Sit relied on to evidence his ownership were as follows. First, he had moved in to the property on completion of the purchase in early 1979 and had only moved out in October 1980 after his brother married Mdm Chen. Secondly, the title deeds of the Margate property were kept by Mdm Tan when the property was not under mortgage and both Loo Chay Sit and Mdm Tan herself confirmed that he had given her the title deeds for safe keeping. Thirdly, Loo Chay Sit had thrown a dinner for his close friends and relatives in order to celebrate his purchase of the Margate property. The relatives of both brothers had testified that the Margate property belonged to Loo Chay Sit. The common understanding of the family members was that Loo Chay Sit had bought the property and it was being held on trust for him. 47     Loo Chay Sit also pointed out that his evidence that he had conducted the negotiations for the purchase of the Margate property in 1978 with its then owners had not been challenged. Loo Chay Loo had not been involved in this negotiation at all. Additionally from the time that the Margate property was acquired, it had been used to store the business merchandise of the firm. Even after Loo Chay Sit moved out in 1980, the Margate property continued to be used for this purpose. 48     After 1993, Loo Chay Loo was a stranger to the Margate property. Some years later, however, Loo Chay Sit and his parents moved into it and remained there until the property was sold in 2006. Whilst they lived there, there was no question of rental being sought by Loo Chay Loo or Mdm Chen and no attempt was made by Loo Chay Loo to sell the property during this time. Further in June 1999, Loo Chay Sit in a letter to Loo Chay Loo and Mdm Chen had stated “if you want to talk about No 7 Margate Road, I want to say that I came up with most of the money for the purchase of the property”. When Mdm Chen replied to this letter, Loo Chay Sit asserted, she did not deny that claim by him to have paid for the property. Instead she said: “As for the property at 7 Margate Road, grandfather told us personally when he was still alive that no 7 was for Chay Loo and no 11 was for Chay Sit, but you said [illegible] money”. If Loo Chay Loo was the true owner of the Margate property, the most natural reaction on the part of Mdm Chen and her husband would have been to express shock and deny any payment by Loo Chay Sit. Her deliberate sidetracking of the issue and alternative suggestion that the grandfather had decreed that the Margate property was for Loo Chay Loo was an indication that the latter had not paid for it. 49     Loo Chay Sit also put forward various arguments in an attempt to establish that Loo Chay Loo had not been able to afford the Margate property at the material time. Loo Chay Loo had only started work in the firm in 1975 and by 1978 he was barely 24 years old. He had very much less money than Loo Chay Sit. The accounts of the firm showed that by 31 December 1978, Loo Chay Loo’s gross earnings totalled less than $195,000. In fact as early as 1976, according to the accounts, he owed the firm money. Secondly although he had withdrawn money from the firm in 1979, this money had been used (so Loo Chay Sit averred) to establish LC Travel and to repay moneys due to Loo Chay Sit himself. As for the assertions made by the Estate that Loo Chay Loo had borrowed money from the firm to pay for the Margate property, these were an afterthought. The evidence given by Png Teng Ho and other members of the firm was that no loans had been extended to Loo Chay Loo to assist in the purchase of the Margate property and this evidence should be accepted. Mr Png had further testified that even if Loo Chay Loo had applied to the firm for such a loan he would not have been successful as in 1978 he was in debt to the firm. In any case Loo Chay Loo never asked the firm for permission to borrow any sum to buy a house. Loo Chay Sit also relied on his own testimony that as founding partner, his approval for the loan was required and he would not have given it since Loo Chay Loo already owed the partnership money at that time. 50     Loo Chay Sit also pointed out that between 1999 and 2004 Loo Chay Loo and Mdm Chen had faced some financial difficulties and the most obvious way of raising money would have been for them to sell the Margate and Seraya properties. They did not do so. Instead, according to Mdm Chen’s testimony, she had sold her property in Taipei and had also obtained financial help from her siblings. Loo Chay Sit considered it strange that Mdm Chen would have chosen this complicated way of raising funds if, as she asserted, her husband really owned the Margate property. He cast doubt on the credibility of her explanation that she and Loo Chay Loo had not wanted to ask his parents who were then living there to move out of the Margate property. After all, it would have been easy for them to shift back to Mdm Tan’s own property at 11 Margate.",
        "My decision": "51     I start from the premise that from the time of the legal transfer of the Margate property on 6 January 1979 until shortly after the default judgment was obtained in 2006, the registered owner of the property was Loo Chay Loo. The Margate property was, at all material times, registered land subject to the provisions of the Act. Accordingly, unless Loo Chay Sit is able to establish that Loo Chay Loo was a trustee for him (in accordance with ss 46(2)(c) of the Act) Loo Chay Loo’s title is indefeasible under s 46 (1) of the Act which states inter alia that “any person who becomes the proprietor of registered land … [holds] that land free from all encumbrances, liens, estates and interests except such as maybe registered or notified in the land- register”. 52     Loo Chay Sit could not point to any express written trust in his favour. He relied on the doctrine of resulting trust. Under this doctrine where one party (A) provides the purchase money to buy a property which is conveyed into the name of another party (B), B is presumed to hold the property on a resulting trust for A unless there is evidence that A intended to make a gift of the property to B or the parties stand in such relationship to each other that the presumption of advancement applies and there is no evidence to rebut that presumption. Therefore, in order to obtain the assistance of the resulting trust presumption, Loo Chay Sit must show that he provided the purchase money. 53     In view of the dearth of documents supporting Loo Chay Sit’s case, his credibility is important. I have to be able to rely on the truth of his assertions that all the money for the purchase price came from his account with the firm. It would be noted that even in relation to the assertion that the firm paid the full purchase price, there is inadequate documentary evidence because the receipts issued by Tang & Tan show only that a total of $105,010.65 was paid by the firm towards the purchase price of $195,000 (the third receipt being for moneys paid for the legal fees and stamp duty). There is no indication at all where the balance $89,989.35 due in respect of the purchase price came from. Loo Chay Sit would have me believe that the total sum came from his account with the firm but he was not able to prove this directly from the documents adduced. He wishes me to draw inferences from the 1978 accounts of the firm but he has not been able to produce the 1977 accounts of the firm which would have given a clearer picture of how much money he had in the firm when he resigned as a partner in 1977. I agree with the Estate’s submission that I should draw an adverse inference against Loo Chay Sit in this regard. 54     Loo Chay Sit was a partner of the firm from its inception up to 1977. He then, ostensibly, left the partnership but rejoined it in November 1980. Although he no longer appeared as a partner on the records, his version was that his shares were held in trust for him and he was never out of the picture entirely. He played an active part in the affairs of the firm for decades and said that he was its boss. Loo Chay Sit therefore had the onus of explaining why he was not able to produce the accounts for 1977. His explanation that they were ‘lost’ was a feeble one especially in view of the fact that he was able to produce the accounts for 1971 to 1976 and for 1978 and following years. Only that one vital year’s records had disappeared. To shift the spotlight, Loo Chay Sit alleged that Mdm Chen should have produced the accounts because a whole set of accounts had been forwarded to Loo Chay Loo at his request in the mid 1990s. Mdm Chen was not, however, the recipient of these accounts and should not be responsible for the non-production of the 1977 records. They were not as important to the Estate’s case as they were to Loo Chay Sit’s case since they would have supported his assertion that he had the financial means to pay for the Margate property. 55     Turning back to the issue of credibility, there were some obvious inconsistencies in the picture that Loo Chay Sit sought to portray. First of all, he asserted that the Margate property was his ‘biggest purchase’ at that point of time and that he felt proud to have been able to acquire it. It was for that reason that he purportedly threw a large party for his relatives to show them the house and celebrate its acquisition. Whilst the property was allegedly put in Loo Chay Loo’s name so that Loo Chay Sit’s first wife would not be able to make a claim on it in the divorce proceedings, Loo Chay Sit was unable to give a good reason why he did not transfer this ‘biggest purchase’ into his name after his divorce was settled in 1980. In fact, his answers and reasons kept changing. 56     When he was first asked, he explained that it was because in 1981, he had bought another property at Lorong Nangka and also he trusted his brother. Yet, this was not an answer because in November 1980, he had already thought it safe to rejoin the firm and therefore, logically, it would have been equally safe to have the Margate property transferred to his name at that time. He had no difficulty (vis-à-vis his first wife) in putting the house in Lorong Nangka in his name and this should have applied to the Margate property as well. The second reason which was that he trusted Loo Chay Loo, was also not a complete answer. The evidence showed that there was some limit to his trust. When he first left the firm, Loo Chay Loo was given one of Loo Chay Sit’s shares to hold for him. In 1979, however, that share was transferred from Loo Chay Loo to the latter’s girlfriend, Lim Gek Hong, to hold on his behalf. 57     When pressed on the point as to why he had not procured the transfer of the Margate property back to himself in 1980, Loo Chay Sit changed his evidence and said that it was because he intended to purchase other properties. When asked to explain what the intended purchase of other properties had to do with him not transferring the Margate property to his name, Loo Chay Sit was unable to answer coherently. He could only repeat that he intended to buy other properties. He also gave other reasons like having to incur costs to transfer the property back to himself and that he was afraid that if he was the owner of two properties, he would have to pay higher tax and also that the firm was intending to purchase a warehouse. He repeated that he trusted his brother. None of these reasons made very much sense. For example, whilst he might have had to pay higher property tax if the Margate property was in his name and he was not living there as the owner, he could have rented out the property or asked Loo Chay Loo to pay the property tax since Loo Chay Loo was occupying the property. In fact, Loo Chay Loo, even on Loo Chay Sit’s own case, took over payment of the property tax from July 1987 onwards. He could hardly have resisted a request to pay the property tax from the beginning in return for being able to stay at the premises rent-free. In any case, it hardly speaks for Loo Chay Sit’s honesty that he would want to present a false picture of the ownership of the property for property tax purposes. 58     Loo Chay Sit later emphasised that the main reason for not putting the Margate property into his name was that he did not want incur the extra expense of the transfer. This was rather weak in view of the fact that Loo Chay Sit was so proud of his ‘biggest purchase’ and also his strongly held belief, or so he told the court, that ‘black and white’ (iea written record) is everything in Singapore. 59     Loo Chay Sit had difficulty in backing up his assertion that he paid property tax, utility charges and repair bills for the Margate property from purchase until around June 1987. He was able to produce only two property tax receipts, one for the half year ending 31 December 1979 and the other for the half year ending 30 June 1986. 60     It would also be recalled that in his affidavit of evidence-in-chief, Loo Chay Sit asserted that he had paid for the Margate property entirely out of his funds with the firm. He repeated several times in court that the purchase price came from the balance he had with the firm in 1976. In his submissions, however, he also emphasised that he had other income and businesses and therefore was able to pay for the Margate property. This was an inconsistency. 61     It is also interesting that although Loo Chay Sit pointed to the letter that he wrote to his brother in 1999 as evidence that he had asserted his claim to be the owner of the Margate property prior to starting this action in 2005, nowhere in that letter did he state that the property belonged to him and was held on trust for him. What he said was that he had provided most of the purchase price of the Margate property. This statement was inconsistent with his case that he had paid entirely for the property. The response from Mdm Chen was that the grandfather of the Loo family had said that the Margate property was for her husband whereas 11 Margate was for Loo Chay Sit. Loo Chay Sit never replied to that response. He said that he did not see it until these proceedings started although it was in his files. Apparently it had been put there by one of his employees and he did not see it until he looked into the files when the proceedings were started. He alleged that as far as he was aware, his brother had never responded to his claim to have paid for the Margate property. When he was asked whether he had followed up with Loo Chay Loo on the matter, his response was that he had told his mother, Mdm Tan, that when she visited Loo Chay Loo in the United States, she should tell him to transfer the Margate property back to him. I found this evidence difficult to believe. 62     On the whole, Loo Chay Sit was not a very satisfactory witness. He was frequently evasive. A number of his answers were non-responsive to the questions asked. He gave completely unconvincing answers when questioned on why he had not been able to contact Loo Chay Loo in the 1990s in order to ask for the Margate property to be transferred back to him since the latter had left the country permanently. He sometimes made assertions that he could not back up and it took a long time and much questioning before he would admit that such assertions were not substantiated. It was clear also from his conduct that he was quite prepared to present a false picture of his assets and income so as to avoid liability whether to his ex-wife or to the tax authorities. All in all, he did not impress me as honest. 63     His conduct in relation to this suit also left much to be desired. He never made a claim to the Margate property before Loo Chay Loo was hospitalised. After Loo Chay Loo’s death, he amended the writ to make the defendant to the action the Estate and then applied for permission to serve Mdm Chen as the personal representative of the Estate. He could have waited until Mdm Chen had been appointed administratrix of the Estate but he did not. It was odd that he was in such a hurry since he had been content to leave the property in Loo Chay Loo’s name for close to 25 years. He served the writ by substituted service (by advertisement in one issue of an English language newspaper in San Francisco) when he was aware of Mdm Chen’s address because there had been a great deal of contact between Mdm Chen and her in-laws in 2005. After some questioning, he admitted that he had Mdm Chen’s address but did not give it to his lawyer for the purpose of service. He rather weakly asserted that it did not occur to him to tell the lawyer that Mdm Chen could be reached at that address. After obtaining judgment in default of appearance, he transferred the Margate property to himself and then promptly sold it. I agree with the submission made on behalf of the Estate that the whole proceedings smacked of opportunism. 64     Having considered all the evidence, I am not satisfied that on the balance of probabilities, Loo Chay Sit paid for the Margate property. It is not necessary for me to find that Loo Chay Loo provided all or even a part of the purchase price. There was evidence indicating that he had more means than Loo Chay Sit gave him credit for and there was also evidence that the firm could have loaned him money to assist him in the purchase. I do not have to come to a conclusion on that evidence since, as I have repeated, the burden remained at all times on Loo Chay Sit to substantiate his claim to be the beneficial owner by reason of his having providedallthe purchase money. Loo Chay Sit’s evidence failed to meet this burden for a number of reasons. Some of these are set out below. 65     First, although Loo Chay Sit was able to show that in 1976 he had enough money in his account with the firm to pay the purchase price, he was not able to show that he still had sufficient funds in his account at the end of 1978. The lack of the 1977 accounts told against him in this respect. It was also clear from the evidence that he had many expenses to meet in 1977 and 1978 and that these would have taken a toll on his reserves. Further, the evidence as to his income in those two years was inadequate as pointed out above. Second, apart from the fact that for a short period after completion of the purchase, Loo Chay Sit lived in the Margate property his conduct was not that of an owner of the property. He did not even rush to occupy the property in 1993 when it was vacated by his brother; he only moved in in 1999. I need not repeat all the evidence set out in the earlier paragraphs; in this respect, I accept the submissions made on behalf of the Estate. The storage of merchandise belonging to the firm at the Margate property is a neutral fact. It does not indicate that Loo Chay Sit owned the property because the firm was a family firm and at all material times Loo Chay Loo was also a partner of the firm. 66     Third, Loo Chay Loo acted as the owner of the property. He mortgaged it for his own account and he subsequently repaid the loans. The outgoings of the property were mostly met by Loo Chay Loo even after he vacated the property. After Loo Chay Loo’s marriage, Loo Chay Sit never asserted a right to live in the Margate property not even when his family grew. Loo Chay Sit asserted that he had indicated his ownership of the Margate property by giving the title deeds to Mdm Tan to keep. This fact was not, however, proved on the balance of probabilities. In the first place, it was clear from Loo Chay Sit’s own evidence that in the early 1980s, all title deeds to properties in which members of the family had an interest were kept by Mdm Tan because she was regarded as a careful person. It could very well have been Loo Chay Loo who asked Mdm Tan to look after the title deeds for him. Certainly, the fact that she may have safeguarded them did not prevent him from mortgaging the property twice to secure his own indebtedness and there is no evidence that Loo Chay Sit ever objected to these mortgages. Secondly, there is considerable dispute over how Mdm Tan acquired the title deeds subsequent to the discharge of the second mortgage over the property in 1997. Mdm Chen had returned from the United States with a power of attorney from Loo Chay Loo to assist in this process and was given the title deeds by the solicitors. According to her, the title deeds were then placed in a safe deposit box held in the joint names of herself and her mother-in-law and Mdm Tan removed the documents later without her permission. Mdm Tan, while admitting that there was such a joint deposit box and that the title deeds had been given by the lawyer to Mdm Chen, asserted that Mdm Chen had then handed them over to her because the property belonged to Loo Chay Sit. To me that story appears improbable. 67     Fourth, Loo Chay Sit’s failure to take any action to recover the Margate property or to assert his right thereto before 2005 tells against him. This conduct was completely inconsistent with his claims to ownership of the Margate property. Having heard his testimony, as stated above, I have serious doubts about his reliability as a witness. That being the case, it is difficult for me to accept as truth those of his assertions that were not backed-up by documentary evidence.",
        "Other issues": "68     The Estate contended that in any event Loo Chay Sit’s claim to the net sale proceeds of the Margate property should fail on the basis of illegality. Loo Chay Sit had confirmed that the main reason he put the Margate property in the name of Loo Chay Loo was so that his assets would be hidden from his ex-wife and she would not be able to make a claim to a share in that property. The Estate submitted that by hiding his beneficial interest in the Margate property from his ex-wife, Loo Chay Sit was also hiding it from the court and was therefore practising a deception on the court and deliberately thwarting the administration of justice. Thus, it would be illegal and contrary to public policy to find that there was a resulting trust in favour of Loo Chay Sit. 69     Whilst I do not need to decide on this issue in view of my finding in relation to the payment of the purchase price, in my view, the doctrine of illegality does not assist the Estate. The facts of this case are very similar to those of the well known decision ofTinsley v Milligan[1994] 1 AC 340 where the House of Lords held that a claimant to an interest in property was entitled to recover if he was not forced to plead or rely on an illegality even though it transpired that the title on which he relied was acquired in the course of carrying through an illegal transaction. The defendant in that case had, by showing that she had contributed to the purchase price of the property in question and that there was a common understanding between the parties that they owned the property equally, established a resulting trust and that was sufficient for her to make her claim. She had no necessity to prove the reason for the conveyance into the sole name of the plaintiff. In this case, had Loo Chay Sit been able to prove that he had provided the whole of the purchase price for the Margate property, that would have been sufficient to establish a resulting trust in his favour and there would have been no need for him to go on and prove that the reason for the property being put in Loo Chay Loo’s name was a legal one or not contrary to public policy. 70     The other issue has to do withlocus standi. In his closing submissions, Loo Chay Sit submitted that as he had pleaded it was not admitted that Mdm Chen was the administratrix of the Estate at the time the action was commenced, the Estate had to prove itslocus standiat the time of the commencement of the counterclaim. I agree with the Estate that this argument has been put forward too late. Loo Chay Sit did not at any time take out an application to strike out the counterclaim on the basis that there was nolocus standito bring it. Further, Mdm Chen and her son, Chen John-son, applied for and were granted an order of court on 28 April 2008 which permitted them to carry on the proceedings against the Estate and by the Estate as if they had been substituted for the Estate. Thirdly, during the trial, questions regarding Mdm Chen’slocus standiwere objected to and these objections were upheld because Loo Chay Sit had never pleaded that there was nolocus standito commence and pursue the counterclaim.",
        "The Seraya property": "71     Here again the main issue is that of payment. As the claimant asserting that the registered owner of the Seraya property holds it on trust for her because she provided the purchase money, Mdm Tan has the onus of establishing that fact. I should clarify here that Mdm Tan does not have to prove that she provided the funds for the original purchase of the Seraya property when she and Mdm Teo acquired a half share each. At that time, Mdm Chen had no interest in the property and no basis to challenge Mdm Tan’s ownership or to ask her to prove that she provided the funds for the original purchase. What Mdm Chen can ask Mdm Tan to show is that in 1987, she provided the funds necessary to buy out Mdm Teo’s half share in both that property and in 11 Margate because the two purchases were part and parcel of the same transaction. At the same time, Mdm Chen has denied that Mdm Tan had paid any part of the consideration for the Seraya property. Since her case is that both half shares in the Seraya property were transferred for valuable consideration and she denies that Mdm Tan’s half share was transferred to her on trust, she has to show that Mdm Tan’s half share was paid for. 72     I have set out a brief account of the circumstances in which the Seraya property was transferred from the joint names of Mdm Tan and Mdm Teo to the ownership of Mdm Chen in [14] to [17] above. In the sections below, I will expand on the facts as necessary. One of the relevant facts is that immediately upon the changes of ownership of the Seraya property and 11 Margate, both properties were mortgaged and part of the moneys raised by those mortgages were used in connection with the transfers. It is also important to note that there were no documents that showed any direct payment by Mdm Tan for the property. Such documents as were produced that expressly related to the transfer of ownership of the Seraya property from Mdm Tan and Mdm Teo to Mdm Chen reflected Mdm Chen as the purchaser. 73     The documents I am referring to emanated from the two firms of solicitors involved in the two transactions. The first firm, M/s Hee & Tan, were acting in relation to the transfer of the Seraya property to Mdm Chen. The second firm, M/s Kong Chai & Partners, were acting in relation to the transfer of Mdm Teo’s share in 11 Margate to Mdm Tan. 74     The documents in regard to the Seraya property are: (a)    a letter from Hee & Tan dated 16 February 1987 addressed to Mdm Chen and referenced “Purchase of No. 163-A Haig Road, Singapore [the former address of the Seraya property]” by which Hee & Tan forwarded to Mdm Chen their receipt for “the sum of $10,000.00 being payment of the deposit for your retention”; (b)    a letter from Hee & Tan dated 16 February 1987 addressed to Mdm Tan and referenced “Sale of No. 163-A Haig Road, Singapore” and reading “We are pleased to forward you our cheque for the sum of $5,000.00 drawn in your favour being the deposit for the purchase of the above property paid by the Purchaser”; (c)    a letter from Hee & Tan dated 16 February 1987 addressed to Mdm Teo, the contents of which were identical to those of the letter to Mdm Tan and which also contained a cheque for $5,000 in favour of Mdm Teo; (d)    a receipt dated 16 April 1987 issued by Hee & Tan acknowledging receipt from LC Travel of the sum of $10,000 being “balance of purchase price”; (e)    a directors’ resolution of LC Travel dated 8 April 1987 whereby it was resolved that the company be authorised to accept an overdraft facility of $550,000 from UOB and that this facility was to be secured by a legal mortgage of the Seraya property; (f)     a transfer document under s 54 of the Act dated 21 April 1987 whereby Mdm Tan and Mdm Teo acknowledged receipt of the sum of $550,000 and transferred the registered estate in the Seraya property to Mdm Chen; (g)    a mortgage under s 59 of the Act dated 21 April 1987 executed by Mdm Chen as mortgagor and LC Travel as borrower in favour of UOB to secure all moneys up to the sum of $550,000 advanced or to be advanced to LC Travel; and (h)    a letter dated 21 April 1987 from UOB to M/s Hee & Tan enclosing cashier’s order no. 316048 for $265,000 in favour of Mdm Tan and cashier’s order no. 316049 for $265,000 in favour of Mdm Teo upon M/s Hee & Tan’s undertaking to complete the mortgage in favour of UOB. 75     The documents relating to the transfer of 11 Margate are: (a)    a directors’ resolution of LC Travel passed on 8 April 1987 authorising the company to accept an overdraft facility for $442,000 from KT Bank on the security of a legal mortgage of 11 Margate; (b)    a sale and purchase agreement dated 11 February 1987 between Mdm Teo as vendor and Mdm Tan as purchaser for the sale of one undivided half share of and in 11 Margate at a price of $250,722 with a deposit of $5,000 to be held by the vendor’s solicitors as stakeholders; (c)    an indenture dated 8 April 1987 between Mdm Teo and Mdm Tan whereby in consideration of the sum of $250,722 paid by Mdm Tan, Mdm Teo conveyed to Mdm Tan all her one equal undivided half share in 11 Margate; and (d)    a letter dated 21 April 1987 from Kong Chai & Partners to Mdm Teo reading:   Re: No. 11 Margate Road, SingaporeWe append herewith our completion account in respect of your sale of half share to Madam Tan Chan Tee as follows:-Sale of half share… $250,722.00LESSDeposit paid to us as Stakeholders…$    5,000.00Balance Due$245,722.00We confirm having handed to you a Cashier’s Order in your favour for $245,722.00 today.We now enclose our cheque in your favour for $5,000.00 being the deposit paid by the Purchaser. Please acknowledge receipt by signing and returning the duplicate copy of this letter. 76     In respect of the Seraya property, the documents appear to show that Mdm Chen bought the property from both Mdm Teo and Mdm Tan for $550,000; that she paid a deposit of $10,000; that of the balance a total of $530,000 was raised from the mortgage of the property to UOB to secure the facilities granted to LC Travel and the remaining $10,000 was paid by LC Travel itself. The documents also evidence the payment to each of Mdm Tan and Mdm Teo of at least $270,000 in respect of the sale of their respective half shares in the property. I would assume that they would each also have received the remaining $5,000 due in that M/s Hee & Tan would have duly used the sum of $10,000 sent to them by LC Travel in this way, but there is no record of that before me. Another way of looking at this would be to say that LC Travel lent Mdm Chen $540,000 on the security of the Seraya property in order to enable her to buy over the property from Mdm Tan and Mdm Teo. 77     In respect of 11 Margate, the documents appear to show that Mdm Teo entered into an agreement to sell her half share of the property to Mdm Tan for the sum of $250,722 and that this was paid for by Mdm Tan by a cash deposit of $5,000 and a cashier’s order of $245,722 raised from the subsequent mortgage of 11 Margate to KT Bank to secure the banking facility of $442,000 granted to LC Travel. Again, another view of the transaction is that LC Travel lent Mdm Tan $245,722 on the security of 11 Margate in order to enable her to buy over Mdm Teo’s interest.",
        "Mdm Tan’s case": "78     It would be recalled that Mdm Tan’s case is that she bought Mdm Teo’s shares in the Seraya property and 11 Margate for $788,000. Of this amount, she asserts she paid Mdm Teo $550,000 which sum was raised from the mortgages of the two properties. The balance due, $238,000, was settled by Mdm Tan assuming responsibility for the equivalent amount of Loo Siong Soo’s indebtedness to the firm. In her evidence, Mdm Tan stated that she was under the impression that of the $550,000 paid to Mdm Teo, $442,000 was taken from the KT Bank loan and the balance $108,000 was taken from the UOB loan. Mdm Tan did not produce any documents which substantiated this assertion and, indeed, her lawyers’ letter indicated a cashier’s order for $265,000 from KT Bank was sent to Mdm Teo. She asserted that the rent received subsequently by Mdm Chen and Loo Chay Loo was to go towards repaying these loans. Mdm Tan also stated that she had discharged her undertaking to settle Loo Siong Loo’s losses by using the money that Loo Chay Sit had in his account with the firm. 79     Mdm Tan relied on circumstantial evidence to bolster her account of events. The first piece of evidence related to the state of affairs of the firm in 1986. It was not disputed that the partners of the firm had to bear losses and that Loo Siong Soo wanted to leave the partnership. Further, at some stage, it was decided that to raise money, Mdm Teo would have to sell her half share in the Seraya property and also her half share in 11 Margate. The purpose of the sales would be to raise funds to pay off Loo Siong Soo’s indebtedness to the firm and still have sufficient money to acquire a new home as he and Mdm Teo would, naturally, have to move out of the Seraya property. 80     The second piece of evidence was the document prepared by Loo Siong Soo containing some calculations relating to his departure from the firm. Mdm Tan said that this was the only document that explained the complicated transactions that took place in 1987 and showed how the transaction involving the Seraya property took place. The document (which I shall refer to as the ‘LSS Account’) was written in Chinese. The English translation of the LSS Account reads as follows: Deposit from Lawyers Hee & Tan$  10,000Cheque for$265,000Deposit from Lawyer Kong Chai$    5,000Cheque for$245,722Total amount received$525,722======= 30-4 OUB cheque for $76,817 – Lian Cheong OUB cheque for $14,000 – Lian Cheong OUB cheque for $30,000 – father 4-5 OUB cheque for $14,000 – owner 8-6 $115,000 – Housing Development Board 1-7 OUB cheque for $20,000 – Uncle Shuangyu Total expenditure: $295,817  Property price: $788,000/= Less $328,817 for Lian Cheong’s account Less $238,000/= $90,817  Balance after offset: $ 229,905 81     It was submitted that the LSS account showed that Loo Siong Soo gave the firm two OUB cheques for a total sum of $90,817. This amount must have been the balance payable by him after he had set off whatever other funds he had raised to be paid to the firm. There were no other entries stating any other payment to the firm. 82     Mdm Tan’s evidence was that in January 1987, a meeting was held at the office premises of the firm to discuss Loo Siong Soo’s intention to retire from the firm. Mdm Chen was not present at this meeting. Apart from agreeing that Loo Siong Soo could retire and fixing the amount which he had to pay the firm, it was also decided at the meeting that Mdm Teo, Loo Siong Soo’s wife (who was not present at the meeting either), would sell her interest in the Seraya property and in 11 Margate to Mdm Tan for a total price of $788,000. Mdm Tan testified that it was at this meeting that she decided to purchase Mdm Teo’s interests. Other witnesses like Mdm Loo Gek Kuan (a family member), confirmed that she was present at the meeting and the meeting was to discuss the losses in the partnership. Mdm Loo also recalled that Loo Siong Soo wanted to sell his share of the two properties for $788,000 and had rejected an offer for $760,000. 83     As to how the price of $788,000 was obtained, Mdm Tan’s evidence was that there had been a previous offer of $768,000 for the Seraya property and this sum was rounded up to $788,000. As both properties were about the same size, Mdm Teo was happy to accept that sum for her half share in each property. 84     Mdm Tan gave an explanation as to why the Seraya property was transferred to Mdm Chen’s name instead of being put in her sole name. She stated that Loo Chay Loo had suggested that this be done. The reason he gave her was that Mdm Tan would have to bear income tax if the Seraya property was rented out and, given that she was already the registered owner of 11 Margate, the addition of the Seraya property would mean that she would have to bear heavier income tax as well as property tax. On this basis, Mdm Tan agreed to Mdm Chen holding the Seraya property as trustee for her. 85     Mdm Tan argued that the documents prepared by M/s Hee & Tan were hearsay and inadmissible. Further, Mdm Chen had tried to place undue weight on the documents which were signed by Mdm Tan to assert that she (Mdm Chen) had provided consideration. Mdm Tan had explained in court that she could not read or write English and that the contents of the documents were not explained to her. She said that she had relied on both Loo Chay Loo and Mdm Chen to ensure that the documentation was correct. As far as she was concerned, she was signing documents to effect the transfer of Mdm Tan’s half share in the Seraya property to her. She knew the total figure involved in the transaction but did not know all the details because she was not the one who dealt with the lawyers and it was Loo Chay Loo and his wife who had dealt with them. Mdm Tan argued that the cheques and cashier’s orders produced by Mdm Chen were not admitted by her and should not be considered as evidence since the makers of the documents were not called. She also testified that she had never received any cashier’s order or cheque for payment to her by Mdm Chen for the sale of the property. It was submitted that there was no evidence that the cashier’s order for $265,000 and the other cheques were ever deposited. The question as to what happened to the cashier’s order was unresolved but, it was submitted, that order could easily have been cancelled after it was issued. The fact of the matter was, Mdm Tan said, that she never received it and this must have been so because otherwise the undisputed evidence could not be resolved especially the contemporaneous and detailed accounts of the two transactions by Loo Siong Loo.",
        "Analysis of Mdm Tan’s case": "86     Mdm Tan’s case depended mainly on my drawing inferences from the circumstances that existed in 1987 and on my accepting her evidence and that of certain relatives that she had agreed to buy over Mdm Teo’s shares in the two properties concerned. Whilst she might have indicated a desire to purchase these interests, the direct documentary evidence did not indicate that any money moved directly from her, not even the initial deposits of $5,000 paid to each vendor. Instead, the money came from bank loans and funds provided by Mdm Chen and LC Travel. It should be remembered that at the material time, Mdm Tan was not a shareholder in LC Travel whilst Mdm Chen was both a shareholder and director and her husband, Loo Chay Loo, was the biggest shareholder in that company. As far as the loans were concerned, Mdm Tan did not produce any evidence to show that she had repaid either loan and, in particular, the loan for the Seraya property. Her stand was that the loan was repaid from the rental of the property. As for the undertaking to pay Loo Siong Soo’s losses, Mdm Tan was quite clear that she did not put up any money for this purpose. Instead, these losses had been settled by using Loo Chay Sit’s moneys in the firm’s account. 87     Mdm Tan had submitted that her version should be believed because it was consistent with the LSS Account. Mdm Tan did not seem to appreciate the inconsistency of relying on a document prepared by someone who could not be called to authenticate and explain it whilst at the same time criticising Mdm Chen for adducing documents derived from the lawyers who were acting for all material parties in the transaction. In any case, the LSS Account did not expressly support what Mdm Tan had said. First, it did not state that Mdm Tan made payment of $788,000 and/or that Mdm Tan purchased Mdm Teo’s half share in the Seraya property. Second, Mdm Tan had asserted that Loo Siong Soo and Mdm Teo were to be paid $550,000 in cash. However, in the LSS Account, the sum recorded as received by them amounted to only $525,722. Mdm Tan was asked in court why there had been a shortfall. She was not able to explain why it appeared that the full sum of $550,000 had not been paid to Mdm Teo. It appeared rather odd that Mdm Teo and her husband who were badly in need of money would have foregone the balance of $24,278. 88     The LSS Account was in fact more consistent with Mdm Chen’s account of what had happened. Mdm Chen had stated that she and Loo Chay Loo had paid $238,000 to help cover part Loo Siong Soo’s share of the firm’s losses and that she had purchased the Seraya property from both Mdm Teo and Mdm Tan for $550,000. On this basis, the amount that Mdm Teo would have received from the sale of her half share to Mdm Chen would have been only $275,000. Given that Mdm Teo sold her half share in 11 Margate to Mdm Tan for $250,722 (as per Mdm Tan’s own evidence) the total amount receivable by Mdm Teo for selling her half share in both properties would have been $525,722 ($250,722 + $275,000) and this is the exact amount that the LSS Account indicated that she and Loo Siong Soo had received. It is also significant that in the LSS Account the sum of $229,905 described as “balance after offset” represents the difference between $525,722, the “Total amount received”, and $295,817, the “Total expenditure”. The calculations involving what is described as “Property Price: $788,000” are separate and do not appear connected with the $525,722 received. When Mdm Tan was unable to explain the inconsistency between her version and the LSS Account, she blamed Loo Chay Loo by saying that she believed he may have taken the difference between the $550,000 and the $525,722 reflected in the LSS Account. That was a completely unsubstantiated and scurrilous allegation. 89     There were other difficulties with Mdm Tan’s account. It is difficult for me to believe that in 1987 Loo Chay Sit would have been able to pay off $238,000 worth of Loo Siong Soo’s debts to the firm. At that time, Loo Chay Sit himself was in financial difficulty. In October 1986, he had had to sell his property at Lorong Nangka to his sister, Loo Bee Choo, to raise funds to pay his own share of the firm’s losses. The firm had then lost close to $2m and in court Loo Chay Sit stated that his share of these losses amounted to about $600,000. He also agreed that at that time, he had funds of $450,000 with the firm and that this amount was insufficient to repay his share of the firm’s losses. Therefore, he had sold Lorong Nangka for $250,000 to make up the deficiency. To me, this showed that after he settled his share of the firm’s losses with his moneys in the firm and the proceeds of sale of Lorong Nangka, at the most, Loo Chay Sit would have had $100,000 left and this was insufficient for him to pay Loo Siong Soo’s remaining indebtedness of $238,000. 90     It was also clear from the evidence that Mdm Tan did not have her own source of funds to pay this $238,000. Mdm Tan, although according to her own testimony illiterate in both Chinese and English and not able even to read numbers, claimed to have been working in the firm and to have run the provision shop business of Guan Seng. The business searches on the firm showed that she was never a partner there and that after September 1974, she was not a partner of Guan Seng either. In court, when Mdm Tan was queried as to her source of income in 1986 and 1987, she admitted that she had no earnings or income from work. She did claim that her children would give her money but this assertion was not supported by documents. During the trial, Mdm Tan gave belated discovery of all her bank books and statements of account and none of these showed that her children gave her money in 1987 or that she had any substantial savings that year. The years 1986 and 1987 were also years when her children could probably not afford to give her substantial amounts of money in view of their own difficulties. 91     Further, in her affidavit of evidence-in-chief, Mdm Tan did not assert that she had repaid the mortgages that had been taken out (as she claimed) to finance her purchase of Mdm Teo’s half shares in the two properties. In court, however, she insisted that she had repaid the mortgage of 11 Margate. When details of repayment were asked for, she gave an account which is difficult for me to accept. Mdm Tan stated that she handed over $320,000 to Loo Chay Loo towards payment of this mortgage. This sum was made up of: (a)    $120,000 from Guan Seng; (b)    $50,000 from the sale of Loo Siong Soo’s shares; and (c)    $150,000 from one Mr Lim Loo Kuan who had paid this money to the firm. This evidence was not credible. There was no reason for Loo Siong Soo to give Mdm Tan $50,000 when according to her she was the one who was buying shares from Loo Siong Soo. Thus, she should have paid him money rather than the other way round. As for the sum of $150,000, this was a payment to the firm by a third party and therefore even if it was used towards repayment of the mortgage, it could not be considered a payment by Mdm Tan. As for the $120,000 that was from Guan Seng, this firm had ceased operation in 1984 and it was difficult to understand how she could receive such a profit from it after 1987 in order to repay the mortgage. Further, in the bank statements that Mdm Tan disclosed, there was no indication that during the period between 1987 and 1992 she had any amount close to $120,000. In cross-examination, Mdm Tan was unable to explain how she could have earned $120,000 from Guan Seng. She agreed that she had not paid income tax on her earnings from Guan Seng and explained that this was because she had only earned $5,000 to $6,000 a year from that firm. She also stated that she had worked there for ten years. If that was the case, the most she could have received as salary would have been $60,000. She had also received compensation of $30,000 when Guan Seng ceased operation. So in total Mdm Tan’s earnings could not have been more than $90,000 over a period of ten years and it is difficult to believe that she would have kept all that money intact in order to repay the mortgage over 11 Margate in the late 1980s or early 1990s. Although Mdm Tan insisted that she had the accounts of Guan Seng to prove that she had earned $120,000 from that business, those accounts were not produced in court. Mdm Tan has not been able to convince me, on the balance of probabilities, that she had repaid $320,000 out of the $442,000 obtained from the mortgage of 11 Margate. 92     As for the mortgage of the Seraya property, Mdm Tan asserted in court that Loo Chay Loo had told her not to worry about it and that he would take care of it using the rental obtained from that property, the profit from LC Travel and the profit from his remittance business, Lian Cheong Foreign Exchange (“LC FX”). As I have stated, Mdm Tan was never a shareholder of LC Travel. LC FX was a sole proprietorship owned by Loo Chay Loo. Mdm Tan herself did not have an interest in it. Therefore, any repayment of the mortgage over the Seraya property by LC Travel or LC FX cannot be treated as repayment by Mdm Tan. Mdm Tan was unable to give any details of how much money either of these two businesses had paid towards the mortgage. She appeared to me to be making thoroughly unsubstantiated claims. 93     As regards the rental derived from the Seraya property, this of course would belong to the owner of the property and if used in repayment of the mortgage, would be considered to be a repayment by the owner. The Seraya property was only rented out from 1992 onwards. The first tenancy commenced on 15 January 1992 and was for a period of 35 months at a rental of $3,800 a month. The gross rental received during this period was therefore $133,000. Assuming Mdm Tan’s story to be true, having borrowed a total of $550,000 from two banks to finance her purchases, at most, she would have contributed about 24% of the repayment towards the principal and nothing towards payment of the interest that must have accrued on these two loans over the years. It should also be noted that it was Mdm Chen’s position that whilst originally the rental from the Seraya property was paid into the joint bank account which she had with her mother-in-law, from some time in 1994, she stopped the rental being deposited into this account and instead routed it to another account held in the names of herself and her husband. It is important to remember that the mortgage in favour of UOB was discharged on 10 May 1990 which was long before the Seraya property was first rented out. The property was then re-mortgaged to the Asia Commercial Bank and it would appear that the moneys to discharge the UOB mortgage came from the Asia Commercial Bank. This second mortgage was repaid by Mdm Chen. Mdm Tan did not challenge Mdm Chen’s evidence (supported by the relevant documentation) that the second mortgage was discharged in June 1995 using moneys transferred to Singapore from Mdm Chen’s bank account in the United States. 94     There were also documents that were inconsistent with Mdm Tan’s story. She signed an acknowledgement and receipt of a cheque for $5,000 and a cashier’s order for $265,000 both drawn in her favour being the balance of the purchase price of the Seraya property payable to her. The receipt was dated 21 April 1987 and Mdm Tan confirmed during the trial that the signature was her own. She did of course claim that she could not read or write but she surely must have asked for an explanation of what she was signing and there was no reason given why anyone would have lied to her and given her an incorrect explanation. Mdm Tan stated that she did not know the contents of the documents she signed including the transfer instrument in which she acknowledged receipt of the purchase money for the Seraya property. Her claim was that her lawyers at M/s Hee & Tan did not explain to her that she was acknowledging receipt of the purchase price. Mdm Tan did not, however, call her then solicitor (who is still in practice) to give evidence on her behalf. Her solicitor would have been able to tell the court whether he indeed handed over the deposit and the cashier’s orders to both Mdm Tan and Mdm Teo. His evidence would have assisted the court in sorting out this complex transaction and yet Mdm Tan preferred not to call him and instead argued that some of the documents produced by Mdm Chen were inadmissible because the maker had not been called. This argument was not compelling in this case since, as I have mentioned, the impugned documents were produced by or forwarded to the solicitors who were acting as agents for all parties including Mdm Tan herself. I agree with the submission made on Mdm Chen’s behalf that an adverse inference has to be drawn against Mdm Tan for not having called the solicitor to support her version. 95     There is another point to be made regarding the rental of the Seraya property. The tenancy agreements were between Mdm Chen as the owner and the various tenants. All the tenancy agreements were signed by Mdm Chen herself. Whilst Mdm Tan did deal with the tenants from time to time, there was also direct correspondence between the tenants and Mdm Chen. Mdm Chen and Loo Chay Loo also declared the rent from the Seraya property as their income for income tax purposes. From the time that the property was purchased, the correspondence with the property tax department was handled by Mdm Chen and all property tax was paid by her. One of the tenants of the Seraya property, one Ms Ng Gim Choon (whose company tenanted the property for more than ten years), also testified that although Mdm Tan was the person she contacted in relation to tenancy matters, Mdm Tan had informed her that the Seraya property belonged to Mdm Chen and that all the tenant’s requests regarding the property had to be referred to Mdm Chen for her to decide. 96     Mdm Tan was not able to give a cogent reason for placing the Seraya property in Mdm Chen’s name if she herself was the actual purchaser of the same. It would have saved on stamp duty and legal fees if Mdm Teo’s half share had been conveyed to Mdm Tan. Instead, the parties had to pay stamp duty and legal fees based on the $550,000 price for the whole of the property. Mdm Tan’s reasons for putting the property in Mdm Chen’s name changed in the course of the proceedings. At first, her reason was that Loo Chay Loo wanted to use the Seraya property to raise funds for LC Travel and it was therefore put in Mdm Chen’s name for convenience and as Mdm Tan was getting old. When it was made clear to her in court that the moneys from the mortgage of the Seraya property were chiefly used to finance that property’s purchase and were not used for the purpose of the business of LC Travel, Mdm Tan said that she was persuaded by Loo Chay Loo to do it and that she did not want to bear heavier property tax and income tax. 97     Mdm Tan’s reasons were not convincing. In relation to the “funds for LC Travel” reason, it is difficult to see why it would be more convenient for Mdm Chen to be the mortgagor when it was LC Travel that required the banking facilities and LC Travel was to be the borrower as well. Secondly, Mdm Tan was only about 58 years old in 1987 so her age should not have prevented her from being the owner of the Seraya property. There was no objection to her being the sole owner of 11 Margate on grounds of age. As for the property tax, as the beneficial owner of the property, Mdm Tan could not have expected the trustee to pay the property tax so it would have made no difference to have the property in her name. In any case, Mdm Tan stated in court that it did not matter to her whether the property taxes were heavy or not since Loo Chay Sit would have paid them for her in any event. This testimony demolished payment of higher property tax as a reason for the Seraya property being put in Mdm Chen’s name.",
        "Conclusion on the Seraya property": "98     For the reasons given above, I have come to the conclusion that Mdm Tan has not been able to discharge her burden in relation to proof of payment for the Seraya property. On the other hand, there was sufficient evidence that she received payment for her half share in that property. The evidence was included in Mdm Chen’s affidavit of evidence-in-chief and this evidence was not objected to by Mdm Tan when it was filed. Many of the documents in the case were produced or dealt with by Mdm Tan’s solicitors and she had the opportunity to call those solicitors to explain why the inferences which Mdm Chen wanted drawn from the documents were incorrect. She failed (or perhaps refused) to take that opportunity. 99     I do not need to go into Mdm Chen’s story in any great detail to come to the conclusion that I have reached. Some of Mdm Chen’s evidence in relation to her attendance at meetings in 1987 was not credible but that does not affect the credibility of the important parts of her evidence in relation to the acquisition of the Seraya property. I accept she had some money of her own and that she could have, at the least, funded the $10,000 deposit for the Seraya property. There was also evidence that could not be undermined in relation to her dealings with the property after its acquisition. There can also be no doubt that she was the one who eventually paid off the mortgage over the Seraya property. Considering that the purchase of the Seraya property was, in the main, financed from the bank loan, that action on Mdm Chen’s part (two years after she had left Singapore) was significant. Mdm Chen was also from 1987 a guarantor to UOB for the facilities extended to LC Travel. Mdm Tan incurred no liability at all in this connection.",
        "Conclusion": "100  In respect of Suit 265 of 2005, I give judgment to the defendant on the counterclaim and accordingly: (a)    there shall be a declaration that Loo Chay Sit holds the sale proceeds of 7 Margate Road on trust for the Estate of Loo Chay Loo, deceased as represented by Chen Tsui Yu and Chen John-son; (b)    the defendant shall be entitled to the costs of the counterclaim; and (c)    parties shall attend before me on a date to be fixed by the Registrar for determination of what further orders should be made in order to give effect to the right of the Estate in relation to the sale proceeds of the Margate property. 101  In respect of Suit 457 of 2006, the plaintiff’s claim is dismissed with costs. I shall hear the parties on whether the costs ordered should be taxed on the indemnity basis."
    }
}