{
    "case_title": "Zhu Yong Zhen\n      v\n      American International Assurance Co, Ltd and another",
    "ncitation": "[2010] SGHC 238",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Background": "4       AIA’s life policies include policies that\n                    enable the assured to participate in the company’s surpluses in the form\n                    of dividends. Two such policies are the “Financial Guardian”\n                    policies and the “Whole Life Participating With Dividends”\n                    policies. Some of these policies that had been sold between 1 May 1986 and\n                    20 April 1994 included a feature known as the “critical\n                    year”, which refers to the year in which the life policy would have\n                    accumulated sufficient dividends to enable the policyholder to continue to enjoy\n                    life assurance coverage without having to pay any more premiums. AIA issued\n                    documents explaining the critical year feature but it maintained that while a\n                    critical year may be projected, there was no guarantee that it would not shift\n                    because much depended on the amount of dividends declared annually and on the\n                    interest rate earned by the accumulated dividends. In fact, the document\n                    illustrating the critical year feature made it clear that dividends and interest\n                    rate were not guaranteed. 5       In 1993, Mdm Zhu effected a\n                    “Financial Guardian” life policy (“the policy”) with\n                    a critical year feature with AIA. The assured sum under her policy No L518324553\n                    was $200,000 and the policy enabled her to participate in the company’s\n                    surpluses in the form of dividends. Her annual premium was\n                $3,883.00. 6       Before the policy was effected, Mdm Zhu had\n                    discussions with AIA’s representative, Mr Oscar Huang\n                    (“Oscar”), who gave her a document that illustrated the critical\n                    year feature for an assured sum of $100,000, and not $200,000, which was the\n                    assured sum in her case. Mdm Zhu referred to this document as an\n                    “Original Policy Quotation” or “OPQ” while AIA\n                    called it a “Policy Benefit Illustration”. As these titles did not\n                    appear on this document, it will hereinafter be referred to as “the CY\n                    document”. 7       It is crucial to note that while the\n                    calculations in the CY document showed that the critical year was the\n                        16thyear after the policy had been effected, the\n                    CY document expressly provided that the calculations were based on the current\n                    rate of dividends and an interest rate of 7%, both of which were not guaranteed.\n                    These disclaimers were as follows: (1)THE DIVIDENDS\n                            ARE BASED ON CURRENT SCALE.FUTURE DIVIDENDS ARE NOT\n                                GUARANTEED. … (3)THE INTEREST RATE USED … FOR ACCUMULATION\n                            IS 7%.THIS RATE IS NOT GUARANTEEDAND IS\n                            USED FORILLUSTRATION PURPOSES\n                            ONLY. [emphasis added] 8       After her discussions with Oscar, Mdm Zhu\n                    applied for the policy on 14 May 1993. The application form submitted by\n                    her to AIA contained the following important declaration by her: No statement, informationor agreement made\n                        or given by or to the person soliciting or taking this application by or to\n                        any other personsshall be bindingon the\n                        Company,unless reduced to writing, and then, if\n                            presented to and approved by an officer specified in the\n                            policy. [emphasis added] 9       Furthermore, the application form contained the\n                    following clause as to when the policy would take effect: Any insurance herein applied for shall not take effect unless and until\n                        the relevant policy is/are issued and delivered to me on this application\n                        and the first premium thereon actually paid in full during my lifetime and\n                        good health provided, however that if any payment of premium is made in cash\n                        at the time of signing this application and a conditional binding deposit no\n                        ….. dated …. issued therefore, the terms of the receipt shall\n                        apply hereto and are agreed to. 10     It was not disputed that when Mdm Zhu\n                    signed the application, she did not pay the premium in cash. 11     The policy that was issued to Mdm Zhu\n                    contained an “entire agreement clause”, which provided that\n                    “the policy and the application for it, a copy of which is attached to\n                    and made a part of the policy, constitute the entire contract”. The CY\n                    document was not attached to or made a part of the policy. 12     Notwithstanding the express terms of the CY\n                    document, which clearly stated that the interest of 7% was not guaranteed, her\n                    declarations in the application form and the entire agreement clause in the\n                    policy, Ms Zhu claimed that she understood the CY document to be a\n                    contractual promise by AIA that the policy would reach the critical year in\n                    2008. However, AIA contended that the CY document shown to Mdm Zhu by Oscar\n                    before she applied for the policy had merely illustrated the position for a\n                    $100,000 policy on the basis that dividends were based on the then current scale\n                    and interest rate on accumulated dividends did not dip below 7%. It also pointed\n                    out that Mdm Zhu had not asked for a document that illustrated the critical\n                    year for a $200,000 policy such as the one that she effected. 13     There were other policyholders who were\n                    affected by problems relating to the critical year feature in their policies.\n                    AIA announced a number of packages for affected policyholders and in 2003, it\n                    appointed an independent Adjudicator to resolve individual cases of\n                    policyholders who accepted the adjudication process. AIA agreed to abide by the\n                    decision of the Adjudicator. The Adjudicator at the material time was\n                    Mr Amarjeet Singh SC, a former judicial commissioner of the Supreme\n                    Court. 14     In early 2008, AIA wrote to Mdm Zhu to\n                    inform her about a range of alternatives in relation to the future of her\n                    policy. AIA also stated that if she did not respond to the letter, it would be\n                    assumed that she would continue to pay her premium, in which case, the cover\n                    afforded by the policy would be unaffected. 15     On 9 April 2008, Mdm Zhu wrote to\n                    AIA to explain that she did not have to pay any premiums after 2008. She\n                    enclosed a copy of the CY document to support her case. AIA replied that her\n                    policy was for $200,000 and the projected critical year in her case was 15 years\n                    and not 16 years, as shown in the CY document, which related to a policy for\n                    $100,000 and not $200,000. Thereafter, Mdm Zhu and AIA had a lengthy\n                    exchange of letters. In March 2009, Mdm Zhu instructed AIA to pay the\n                    premium for 2009 from her dividends. AIA forwarded her a form to authorise the\n                    use of her dividends to pay for the premium and asked her to sign it.\n                    Mdm Zhu defaced parts of the authorisation form that were not to her\n                    liking. AIA informed her that as she had defaced the authorisation form, her\n                    request to use her accumulated dividends to pay for her premium for 2009 could\n                    not be processed.",
        "Mdm Zhu asks AIA to invest $1.5m in her business": "16     On 20 August 2008, Mdm Zhu wrote to\n                    AIA to propose what she thought was a “win-win” manner of\n                    resolving their dispute over the critical year. At that time, she required $1.5m\n                    to set up a business to manufacture and sell health supplements in the form of\n                    “Silver Bullets”. She asked AIA to invest $1.5m in her business to\n                    end their dispute. In her e-mail on 20 August 2008, she stated as\n                    follows: [I] do not like to see AIA get into big troubles although I am angry at\n                        what AIA did in the process to revolve the dispute with me. Hence, I propose\n                        a win-win solution….Here it is. I have a business plan. I am going to look for strategic investors to\n                        invest on my intended business…. …. I like to have your decision.Could you please let me\n                            know within one week?After that, my proposal will lapse and\n                        I will look for other investors.In the meanwhile, I may\n                            take the dispute to the courts and get best lawyers to sue\n                            AIA. It shall be a meaningful lawsuit. …Therefore, the key to resolve the dispute is in your\n                            hands. [emphasis added] 17     Mdm Zhu forwarded to AIA an“Executive Summary on Manufacturing, Marketing and\n                        Distributing MySilver – A High Quality Nano Product and A Special\n                        Health Supplement”. She also sent AIA a rather detailed\n                    confidential non-disclosure agreement in relation to the proposed business\n                    collaboration between her and AIA for the latter’s\n                signature. 18     After AIA declined to invest $1.5m in her\n                    company, Mdm Zhu asked AIA on 10 October 2008 to compensate her for\n                    surrendering her policy. In an e-mail dated 13 October 2008, she clarified\n                    that the compensation she wanted from AIA for surrendering her policy was the\n                    “investment amount” (ie$1.5 m)\n                    stated in her business plan that had been forwarded to AIA on 20 August\n                    2008. In short, she now sought $1.5m from AIA without requiring the latter to\n                    invest anything in her business. AIA did not accept her latest offer to settle\n                    its dispute with her.",
        "Mdm Zhu’s blog": "19     Mdm Zhu decided to set up a blog to\n                    inform the public about her “findings” on her dispute with AIA. In\n                    the blog, she accused AIA of lying to policyholders and of illegally modifying\n                    the critical year with bad intentions. She also asked whether AIA was trying to\n                    mislead and cheat its policyholders and added that she did not know how AIA\n                    could have been ISO 9002 certified. What she wrote in her blog was the subject\n                    matter of AIA’s counterclaim for defamation against her. 20     Before Mdm Zhu put her blog online, she\n                    wrote to AIA on 13 October 2008 as follows: The new version of my blog is ready. You can … read it before I\n                        open it to the public… By the way,I still have not received your confirmation\n                            whether you will accept my suggested compensation value or not. Please\n                            remember to let me know by tomorrow if you want to resolve the\n                            dispute. [emphasis added] 21     On the following day, Mdm Zhu e-mailed\n                    AIA as follows: Since you do not intend to resolve the dispute, I suggest you to go to my\n                        Blog to make a final check before I open it to the public at\n                        midnight. Let me know if you have anything to clarify with regard to the content of\n                        my Blog. On the same day, she also e-mailed AIA as follows: I understand AIA is going to be sold. But, how to get a good price if the\n                        scandal of AIA is getting popular and hot tomorrow. 22     AIA viewed Mdm Zhu’s blog as an\n                    attempt by her to extort money from it. On 4 November 2008, its solicitors,\n                    M/s Rajah & Tann LLP, wrote to Mdm Zhu to demand that the blog be\n                    deactivated. On 10 November 2008, she deactivated the blog.",
        "The independent Adjudicator": "23     The dispute between Mdm Zhu and AIA\n                    dragged on. Between November and December 2009, Mdm Zhu contacted the\n                    independent Adjudicator, Mr Amarjeet Singh SC, for assistance to resolve\n                    her dispute with AIA. However, she refused to complete and sign the\n                    “Request for Adjudication” form (“the form”). On\n                    25 December 2008, she wrote to the Adjudicator’s Office as\n                    follows: I like to clarify that I do wish to submit my case to the Adjudication\n                        Process. But, I do not wish to sign the “Request for Adjudication\n                        Form” since there is no reason for me to make any\n                        declarations. I … deeply regret that the Adjudication Process makes such kind of\n                        requests. 24     The adjudication process was then aborted\n                    because of Mdm Zhu’s refusal to complete and sign the form.\n                    Mdm Zhu claimed that the Adjudicator was not independent and in\n                    para 20 of her Reply and Defence to the Counterclaim, she accused the\n                    Adjudicator and his assistant, Ms Jocelyn Lin, of helping AIA to frustrate\n                    her “through lies, confusing messages and delays”.",
        "Mdm Zhu appoints ETP to act for her": "25     In February 2009, Mdm Zhu instructed ETP\n                    to act for her in relation to her dispute with AIA. Apparently, from\n                    Mdm Zhu’s lengthy narration of events in her Statement of Claim, ETP\n                    did not think that she had a strong case if it was based solely on the CY\n                    document because it had stated that neither the dividends nor interest rate on\n                    accumulated dividends were guaranteed. Mdm Zhu said that ETP had suggested\n                    that her case would be strengthened if she alleged that Oscar or AIA had\n                    misrepresented the position on the critical year to her. She said that she\n                    rejected this suggestion and she pleaded in her Statement of Claim that there\n                    had been no such misrepresentation by Oscar. She continued to believe that the\n                    CY document contained all that she needed to prove her case against AIA for\n                    breach of contract. 26     By May 2009 at the latest, ETP had ceased to\n                    act for Mdm Zhu, who accused ETP’s Ms Gill, who had handled her\n                    case, of colluding with AIA against her. Mdm Zhu alleged in her Statement\n                    of Claim at para 225 that Ms Gill had had an “ulterior\n                    motive” and in her written submissions for the appeal, she complained\n                    that Ms Gill had sent her “plenty of misleading messages to\n                    confuse” her. She even claimed at para 33 of her submissions that\n                    Ms Gill had helped AIA to “steal” her documents, including\n                    her policy file.",
        "Mdm Zhu appoints Mr Chia Ti Lik to act for her": "27     As Mdm Zhu was dissatisfied with\n                    ETP’s advice, she instructed Mr Chia to act for her against AIA. She\n                    sent Mr Chia a document prepared by her entitled “Introduction of my\n                    insurance dispute with AIA” (the “introduction document”).\n                    She was very displeased when he did not include what she perceived to be\n                    important parts of the introduction document in his draft Statement of Claim.\n                    Mr Chia had explained to her that much of what she had written in the\n                    introduction document should appear in her affidavit of evidence-in-chief\n                    (“AEIC”) and not in the Statement of Claim. On 8 June 2009,\n                    Mdm Zhu wrote to Mr Chia as follows: The way you wrote did not benefit my case, but otherwise. As such, I will\n                        get someone else to do it and take my case. Let me know if you have any\n                        explanation on the matter. 28     On the following day, Mr Chia replied\n                    that it was Mdm Zhu’s prerogative to find someone else to handle her\n                    matter and requested her to pay $1,800 as his costs for drafting the writ of\n                    summons. Mdm Zhu refused to pay the amount claimed by\n                Mr Chia.",
        "Mdm Zhu acts in person": "29     Mdm Zhu decided to act in person. On\n                    16 June 2009, she filed her writ of summons, in which she accused AIA of\n                    breach of contract and Mr Chia of colluding with AIA. Unlike\n                    Mr Chia’s draft Statement of Claim, which contained 11 paragraphs,\n                    Mdm Zhu’s Statement of Claim contained 381 paragraphs. Undoubtedly, a\n                    very large part of her Statement of Claim should, as had been advised by\n                    Mr Chia, have been put into her AEIC instead. 30     Although her policy was for $200,000,\n                    Mdm Zhu sought from AIA liquidated damages of $1,146,885.00 and\n                    unliquidated damages of $800,000.00 for breach of contract and “serious\n                    inappropriate doings and misconduct”. Having failed to persuade AIA to\n                    invest $1.5m in her business or to compensate her $1.5m for surrendering her\n                    policy, Mdm Zhu now claimed almost $2m from AIA. As for Mr Chia, to\n                    whom she had paid nothing for his legal services, she claimed unliquidated\n                    damages of $50,000 from him. 31     AIA filed its defence and counterclaimed\n                    against Mdm Zhu for damages for defamation. It also applied for an\n                    injunction to restrain Mdm Zhu from publishing the blog. As for\n                    Mr Chia, he filed a defence denying that he had colluded with\n                AIA.",
        "Mdm Zhu accuses the Registry of the Supreme Court of siding with\n                AIA": "32     Mdm Zhu obviously did not understand the\n                    role of the courts in the litigation process. She complained that the Registry\n                    of the Supreme Court had made it difficult for her to proceed with her case and\n                    that Senior Assistant Registrar Yeong Zee Kin (“SAR Yeong”) and AR\n                    Chan had sabotaged her case. 33     Mdm Zhu said that SAR Yeong arranged a\n                    Pre-Trial Conference (“PTC”) on 13 January 2010 to give her\n                    trouble through “unwarranted” directions and another PTC on\n                    26 January 2010 to allow Mr Chia to get information from her. She also\n                    alleged that SAR Yeong arranged a PTC on 9 March 2010 so that AIA could\n                    “represent” her. What occurred on 9 March 2010 was that\n                    AIA’s solicitor had called Mdm Zhu to remind her of a PTC scheduled\n                    for that morning. She claimed that she had had no notice of the PTC and that she\n                    e-mailed AIA’s solicitor as follows: I think that you just should proceed with the PTC. If possible, could you\n                        pleasedo me a favour and let me know the directions of\n                            [SAR Yeong] after the PTC. [emphasis added] 34     AIA’s solicitor then messaged\n                    Mdm Zhu as follows: “As agreed, we will mention on your behalf at\n                    the PTC today”. Mdm Zhu saw something very sinister in what was her\n                    own arrangement with AIA’s solicitor and she accused SAR Yeong for\n                    allowing AIA’s solicitor to “represent” her at the PTC. This\n                    was an absolutely baseless accusation. 35     As for AR Chan, who struck out the claims\n                    against AIA and Mr Chia, Mdm Zhu wrote to the Registry on\n                    21 April 2010 to object to any publication of his judgment in the media. In\n                    her written submissions at the hearing of her appeal, she accused AR Chan of\n                    being biased. She also alleged that AR Chan had not informed her of a vacated\n                    hearing on 15 December 2009 so that the defendants could “harass and\n                    threaten her” without explaining how this could have been the case. She\n                    also accused AR Chan of arranging an “unwarranted” hearing on\n                    23 December 2009 in order to waste her time, and a “dummy”\n                    hearing on 1 March 2010 to undermine her case.",
        "The Applications before AR Chan": "36     The applications before AR Chan were as follows: (i)SUM 4895/2009 This was AIA’s application for: (a)summary determination under O 14 r 12 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed) (the “ROC”) as to whether the policy benefit illustration dated 29 April 1993 had contractual effect and/or was enforceable against AIA;(b)summary determination under O 14 r 12 of the ROC as to the interpretation of the CY document; and(c)striking out Mdm Zhu’s claim against AIA pursuant to O 14 r 12(2) and O 18 r 19(1) of the ROC .(ii)SUM 4926/2009This was Mr Chia’s application for Mdm Zhu’s claim against him to be struck out pursuant to O 18 r 19(1) of the ROC.(iii)SUM 4952/2009This was AIA’s application for:(a)summary determination under O 14 r 12 of the ROC for the natural and ordinary meaning of the alleged defamatory statements pleaded in the defence and counterclaim; and(b)judgment in its favour under O 14 of the ROC in relation to the alleged defamatory statement and an Order restraining Mdm Zhu from publishing further defamatory statements.(iv)SUM 5561/2009This was Mdm Zhu’s application for the striking out of AIA’s defence and counterclaim and the striking out of Mr Chia’s defence.37     AR Chan summarised his rulings in his judgment\n                    as follows at [91] – [93]:91In summary, I struck out [Mdm Zhu’s\n                            claims against AIA and Mr Chia]. I have found that [the CY\n                            document] does not have contractual effect and is not enforceable\n                            against [AIA]. I have also found that [the CY document] terms are not\n                            guaranteed.92I have determined the natural and ordinary meaning\n                            of the pleaded statements taken from [Mdm Zhu’s] Blog and\n                            have found such statements to be defamatory.93I have dismissed [Md Zhu’s] application to\n                            strike out both [AIA and Mr Chia’s] defences, and to strike\n                            out [AIA’s] counterclaim.The Appeal(1)   Whether the CY document is part of the Contract38     O 14 r 12 of the ROC, which concerns\n                    the determination of questions of law or construction of documents, provides in\n                    part as follows:(1)The Court may,\n                            upon the application of a party or of its own motion, determine any\n                            question of law or construction of any document arising in any cause or\n                            matter where it appears to the Court that —(a)such question is suitable for determination\n                                without a full trial of the action; and(b)such determination will fully determine\n                                (subject only to any possible appeal) the entire cause or matter or\n                                any claim or issue therein.39     Whether or not the CY document was part of the\n                    contract between AIA and Mdm Zhu was a question which could be suitably\n                    determined under O 14 r 12 of the ROC without a full trial. After all,\n                    Mdm Zhu’s case was that the CY document proved her case against AIA\n                    and she pleaded in her Statement of Claim at para 17:The dispute between the Plaintiff and [AIA] is on the first page of [the\n                        CY document].The dispute is about whether the policy,\n                            dividends, policy values and the premium-paying period that the first\n                            page of [the CY document] are guaranteed or just for illustration\n                            purposes only.[emphasis added]40     The CY document was not a part of the contract\n                    between AIA and Mdm Zhu. It was furnished to her by Oscarbeforeher application for the policy, which was her\n                    offer to AIA to enter into the contract of assurance. In her application form,\n                    Mdm Zhu had categorically declared that no statement, information or\n                    agreement given by anyone soliciting or taking her application “shall be\n                    binding on the company” unless it was presented to and approved by an\n                    officer specified in the policy. She did not assert that the requisite approval\n                    had been obtained for the CY document to be binding on AIA.41     In any case, even if the CY document had been\n                    a part of the contract, it did not guarantee that the projected critical year\n                    was fixed. Mdm Zhu accepted that it was stated in the CY document that the\n                    dividends payable and the interest rate on accumulated dividends were not\n                    guaranteed. However, she advanced the preposterous argument that as only the\n                    dividends and interest rate on accumulated dividends were not guaranteed,\n                    everything else,including the critical year, was\n                    guaranteed. This argument could not be countenanced for, if the dividends and\n                    interest rate were less than that illustrated in the CY document, the critical\n                    year would shift. In fact, Mdm Zhu revealed in her Statement of Claim that\n                    this was the position taken by her former solicitor, ETP as she pleaded at\n                    para 222 as follows:On [3 February 2009] …, [ETP’s\n                        Ms Gill] wrote to the plaintiff … that:-The [document] and its surrender values at the various years is based\n                            on the interest element of 7%, which is specifically stated as non\n                            guaranteed. So if the interest rate changes, the surrender values will\n                            change.This is pure logic.[emphasis added]42     I now turn to the “entire\n                    agreement” clause in the policy. InLee Chee Wei v Tan\n                        Hor Peow Victor and others and another appeal[2007]\n                    3 SLR(R) 537 (“Lee Chee\n                    Wei”), the Court of Appeal approved of the following statement\n                    by Lightman J on the intent of such a clause inInntrepreneur Pub Co v East Crown Ltd[2000]\n                    2 Lloyd’s Rep 611, (at [7]):The purpose of an entire agreement clause is to preclude a party to a\n                        written agreement from threshing though the undergrowth, and finding in the\n                        course of negotiations some (chance) remark or statement (often long\n                        forgotten or difficult to recall or explain) on which to found a claim such\n                        as the present to the existence of a collateral warranty. The entire\n                        agreement clause obviates the occasion for any such search and the peril to\n                        the contracting parties posed by the need which may arise in its absence to\n                        conduct such a search. For such a clause constitutes a binding agreement\n                        between the parties that the full contractual terms are to be found in the\n                        document containing the clause and not elsewhere, and that accordingly any\n                        promises or assurances made in the course of the negotiations (which in the\n                        absence of such a clause might have effect as a collateral warranty) shall\n                        have no contractual force, save insofar as they are reflected and given\n                        effect in that document.43     InPT Panasonic Gobel\n                        Indonesia v Stratech Systems Ltd[2009] 1 SLR(R) 470,\n                    Judith Prakash J stated (at [46]) that an entire agreement clause\n                    “makes it clear to both parties that their obligations are contained\n                    entirely within the bounds of the written agreement and that they should put\n                    everything that they want to have contractual force into the agreement and not\n                    rely on anything that was said before the contract was concluded as being\n                    binding”. Similarly, inIBM Singapore Pte Ltd v UNIG\n                        Pte Ltd[2003] SGHC 71, Tay Yong Kwang J, while\n                    construing an entire agreement clause, held (at [39]) that the contractual\n                    relationship between the parties was circumscribed by the signed agreements and\n                    by those alone.44     Admittedly, much will also depend on the\n                    wording of the clause in question: seeLee Chee\n                        Wei. In the present case, the entire agreement clause clearly\n                    provided that “the policy and the application for it, a copy of which is\n                    attached to and made a part of the policy, constitute the entire\n                    contract”. As the CY document was not attached to or made a part of the\n                    policy, the entire agreement clause was another reason why the CY document could\n                    not be relied on by Mdm Zhu in her claim against AIA for breach of\n                    contract.45     I thus affirmed AR Chan’s decision that\n                    the CY document was not a part of the contract of assurance and that its\n                    contents could not be interpreted as guaranteeing Mdm Zhu that the critical\n                    year in the policy would be reached in 2008.(2)   Whether the action against AIA should be struck\n                out.46     In the light of my finding that the CY\n                    document was not a part of the contract of assurance between AIA and\n                    Mdm Zhu and that it did not guarantee that the critical year in the policy\n                    was 2008, a question arose as to whether the court should exercise its power\n                    under O 14 r 12(2) of the ROC, which provides as follows:Upon such determination, the Court may dismiss the cause or matter or make\n                        such order or judgment as it thinks just.47     As Mdm Zhu’s case rested entirely\n                    on her erroneous assumption that the CY document was a part of the contract and\n                    that it guaranteed that the critical year would be reached in 2008, her action,\n                    as pleaded, had no leg to stand on and especially so since she made it clear in\n                    her Statement of Claim that Oscar had not misrepresented to her that the\n                    interest rate in the CY document was guaranteed. While complaining that her\n                    former solicitor, Ms Gill from ETP had told her that her case was not\n                    strong unless she pleaded misrepresentation, Mdm Zhu stated at paras\n                    224-226 of her Statement of Claim as follows:224Ms Gill was\n                            convincing the Plaintiff of her misleading logic and theory and\n                            convincing the Plaintiff to involve Oscar Huang in the\n                        case.….225Ms Gill revealed herulterior motiveto involve Oscar Huang through her email\n                            ….226The Plaintiff was surprised that Ms Gill\n                            intended to let Oscar Huang state that the interest rate is a finite\n                            while the [CY document] stated that the interest rate is not guaranteed.\n                            She dared to lie to the Plaintiff openly.It is\n                                impossible that either Oscar Huang or the Plaintiff had stated that\n                                the interest rate is a definite.[emphasis added]48     As the foundation on which Mdm Zhu\n                    asserted her claim disappeared, it followed that her claim against AIA had to be\n                    dismissed. After all, she had pleaded in her Statement of Claim at para 222\n                    as follows:[AIA] did not repudiate the Plaintiff’s policy, did not force the\n                        Plaintiff to surrender her policy, did not attempt to terminate her policy,\n                        and did not unilaterally change the terms and conditions of the\n                        policy.49     For the reasons stated, I affirmed AR\n                    Chan’s decision to dismiss her claim against AIA.(3)   Whether Mdm Zhu’s claim against Mr Chia\n                should be struck out.50     In SUM 4926 of 2009, Mr Chia applied for\n                    Mdm Zhu’s claim of collusion against him to be struck out under\n                    O 18 r 19 (1)(a) of the ROC on the ground that it disclosed no\n                    reasonable grounds of action. His application was allowed by AR\n                Chan.51     That an action should not be too readily\n                    struck out has been emphasized by the courts on numerous occasions. InGabriel Peter & Partners (suing as a firm) v Wee Chong Jin and\n                        others[1997] 3 SLR(R) 649 (“Gabriel Peter”), the Court of Appeal explained at [18] as\n                    follows:In general, it is only in plain and obvious cases that the power of\n                        striking out should be invoked. … It should not be exercised by a\n                        minute and protracted examination of the documents and facts of the case in\n                        order to see if the plaintiff really has a cause of action. The practice of\n                        the courts has been that, where an application for striking out involves a\n                        lengthy and serious argument, the court should decline to proceed with the\n                        argument unless, not only does it have doubts as to the soundness of the\n                        pleading but, in addition, it is satisfied that striking out will obviate\n                        the necessity for a trial or reduce the burden of preparing for a\n                        trial.52     While the courts are slow to utilise their\n                    draconian power to strike out an action, a case which is hopelessly doomed to\n                    fail will be struck out. InBandung Shipping Pte Ltd v Keppel\n                        TatLee Bank Ltd[2003] 1 SLR(R) 295 , Chao Hick\n                    Tin JA explained at [34] that allowing a hopeless claim to proceed to trial\n                    would be to compel the defendant to expend time and money in defending a case\n                    with no merit whatsoever.53     In the present case, as Mr Chia asserted\n                    that Mdm Zhu’s Statement of Claim disclosed no reasonable cause of\n                    action against him, reference may be made toGabriel\n                        Peter, where the Court of Appeal explained as follows at\n                    [21]:The guiding principle in determining what a \"reasonable cause of action\"\n                        is under O 18 r 19(1)(a) was succinctly pronounced by Lord Pearson\n                        in Drummond-Jackson v British Medical Association [1970] 1 All ER 1094. A\n                        reasonable cause of action, according to his lordship, connotes a cause of\n                        action which has some chance of success when only the allegations in the\n                        pleading are considered. As long as the statement of claim discloses some\n                        cause of action, or raises some question fit to be decided at the trial, the\n                        mere fact that the case is weak and is not likely to succeed is no ground\n                        for striking it out. Where a statement of claim is defective only in not\n                        containing particulars to which the defendant is entitled, the application\n                        should be made for particulars under O 18 r 12 and not for an\n                        order to strike out the statement54     Mr Chia asserted that while\n                    Mdm Zhu’s claim against him appeared to be based on the tort of\n                    conspiracy, there was no proper pleading that he had committed such a tort. In\n                    her written submissions, Mdm Zhu stated her case confusingly in Part 3\n                    para 4 as follows:In [this] action I sue [Mr Chia] for hisserious\n                            breach of trust. I verily believe that he colluded with [AIA]\n                        to sabotage and jeopardise my case and my claim when he acted for me against\n                        [AIA] in May and June 2009. I believe that he committed serious wrongdoings\n                        and misconduct.[emphasis added]55     Mdm Zhu’s allegation that\n                    Mr Chia colluded with AIA, as pleaded in her Statement of Claim, rested\n                    entirely on her dissatisfaction with the draft Statement of Claim prepared by\n                    Mr Chia. Her references to Mr Chia in her Statement of Claim were\n                    found under the heading “The 1stand\n                        2ndDefendant weresuspectedto have colluded on the Plaintiff’s case; aproblematic draft of the Writ of\n                    Summons” (emphasis added). In para 76 of her reply,\n                    Mdm Zhu made her position clearer by stating that she averred that there\n                    was collusion between AIA and Mr Chia. However, nothing in the Statement of\n                    Claim suggested that Mr Chia had colluded with AIA. All that had been\n                    pleaded was a litany of complaints against Mr Chia’s handling of the\n                    case. At para 350 of her Statement of Claim, Mdm Zhu pleaded as\n                    follows:The draft was full of mistakes and errors. It was ambiguous and hideous\n                            (sic) messy. It was difficult to\n                        understand. There was no single paragraph clear, correct or beneficial to\n                        the Plaintiff’s case. There was nothing correct except who the\n                        Defendant is.56     Mdm Zhu’s written submissions were\n                    also focussed on complaints about the Statement of Claim drafted by\n                    Mr Chia. She was unhappy that the draft Statement of Claim was delivered\n                    late, that it was “extremely short”, that it did not contain\n                    “any correct paragraph”, that it was “full of\n                    mistakes” and that it “did not plead any correct\n                    facts”.57     Mdm Zhu was also suspicious as to why\n                    Mr Chia wrote to AIA’s solicitors, Rajah & Tann LLP, and her\n                    former solicitors, ETP, before the writ was issued. With regard to this,\n                    Mr Chia had explained to her as follows:My purpose in writing to Rajah & Tann is that as a matter of\n                        professional conduct, I have come to be aware that Rajah & Tann are\n                        acting for AIA and also that you were previously represented by Engelin Teh\n                        & Partners. In order for proper housekeeping and order, it is imperative\n                        that before we issue the writ, I inform Engelin Teh that I am taking over\n                        the conduct of the matter and that before we serve the writ we ask that\n                        Rajah & Tann confirm its instructions to accept service of the writ on\n                        behalf of AIA. This is part of the professional conduct which I am supposed\n                        to adhere to as a lawyer.58     Despite Mr Chia’s clarification,\n                    Mdm Zhu stated in her Statement of Claim that she did not understand the\n                    former’s logic in writing to ETP as she had informed him that ETP was no\n                    longer acting for her.59     Instead of dealing with events or documents\n                    that suggested that Mr Chia had colluded with AIA, Mdm Zhu had merely\n                    posed a number of questions to him in her Statement of Claim at para 373\n                    and added that if he had not colluded with AIA, he should have been able to\n                    answer them easily. The questions are as follows:a.Why did he not ask the Plaintiff to sign any\n                            document or provide any deposit?b.Why did he not inform the Plaintiff his service\n                            charges during the two meetings? Instead, he wanted to prepare a draft\n                            first. If the Plaintiff satisfied with his draft, he would quote his\n                            price for writing the writ. He is an experienced lawyer. He should be\n                            very clear how he charges clients.c.Why did he not ask the Plaintiff for all the\n                            relevant documents on the case while he definitely needed them if he\n                            would draft the writ? He only made a copy of [the CY document], the\n                            Plaintiff’s demand letter dated 4 February 2009 and Rajah &\n                            Tann’s legal letter dated 13 February 2009.d.Who prepared the draft? If it was [Mr Chia],\n                            where did he deduce the terms of agreement, repudiation and repayment\n                            from? Where did he deduce the content of the draft from?e.Why did his draft not contain any relevant facts?\n                            He had asked the Plaintiff to introduce the dispute two times and he\n                            even taped down their second discussion. It could be sure that he had\n                            obtained a good view on the dispute by the two discussions and the\n                            Document that the Plaintiff passed to him.f.Why did he request the Plaintiff to send the soft\n                            copy of the Document while his draft did not contain any relevant\n                            content?g.Why did he keep the Plaintiff wait for three weeks\n                            while his draft should not spent him too much time to\n                        prepare?h.Why did he never send his partial completed draft\n                            to the Plaintiff while she asked him for it many times? He had agreed to\n                            provide it during their second meeting.i.Why did his draft not contain a single paragraph\n                            which is clear or correct?j.Why did his draft emphasise that the policy was\n                            sold/purchased by basing on an agreement?k.Where was the content of his draft\n                        from?60     When asked why she had pleaded that\n                    Mr Chia had colluded with AIA when the facts relied on by her did not\n                    support such an assertion, Mdm Zhu strayed completely from the issue at\n                    hand and suggested that Mr Chia was guilty of breach of\n                trust.61     As there was nothing in the pleadings to\n                    suggest that Mr Chia had colluded with AIA, it was plain and obvious that\n                    Mdm Zhu’s case against him for conspiracy could not succeed. As such,\n                    I affirmed AR Chan’s decision to strike out Mdm Zhu’s claim\n                    against Mr Chia.(4)   Mdm Zhu’s application to strike out AIA’s\n                defence and counterclaim and Mr Chia’s defence62     As I had dismissed Mdm Zhu’s claim\n                    against AIA, her application to strike out AIA’s defence became an\n                    academic question. Even so, it may be noted that Mdm Zhu’s approach\n                    was that AIA had no defence because the latter had denied her claim with a pack\n                    of lies. She could not understand that the veracity of AIA’s defence\n                    should have been tested during the trial and not at this stage of the\n                    proceedings.63     As for Mdm Zhu’s application to\n                    strike out the counterclaim, she argued that AIA had no case because the latter\n                    had not said that her words were untrue and had primarily been concerned with\n                    the determination of the meaning of her allegedly defamatory words. This\n                    argument was flawed as AIA had pleaded that the contents of Mdm Zhu’s\n                    blog were “false and defamatory” and that she had acted with\n                    malicious intent and ill-will.64     As Mdm Zhu did not have any convincing\n                    argument as to why AIA’s defence and counterclaim should be struck out\n                    under O 18 r 19 of the ROC, her appeal against AR Chan’s\n                    dismissal of her striking out application was dismissed.65     As for Mdm Zhu’s appeal with\n                    respect to her application to strike out Mr Chia’s defence to her\n                    claim, and for judgment to be entered against the latter for colluding with AIA,\n                    this also became an academic issue after her claim against Mr Chia was\n                    struck out. All the same, it ought to be noted that the application to strike\n                    out Mr Chia’s defence had no merit. In his Defence, Mr Chia\n                    pleaded that his draft Statement of Claim had correctly set out\n                    Mdm Zhu’s claim in contract, that he had not conducted himself\n                    inappropriately in relation to the matter and that pending discovery and/or\n                    interrogatories, he was not obliged to answer the many questions posed to him in\n                    para 373 of Mdm Zhu’s Statement of Claim. All that Mdm Zhu\n                    could say about Mr Chia’s defence was that it contained lies. This\n                    was not a reason to strike out Mr Chia’s defence at this stage of the\n                    proceedings.(5)   Meaning of the allegedly defamatory words in\n                Mdm Zhu’s blog66     For the sake of completeness, it ought to be\n                    mentioned that I disagreed that the meaning of the allegedly defamatory words\n                    should have been determined at this stage. As such, I overruled AR Chan’s\n                    decision to construe the meaning of the said words and reversed his order on\n                    costs. However, as AIA has not lodged any appeal on this matter, it need not be\n                    further considered in this judgement.(6)   Whether the costs awarded in the court below should be\n                reduced67     Mdm Zhu complained that the costs awarded\n                    by AR Chan were too high and should be reduced.68     AIA was awarded costs of $12,500 in the court\n                    below. The hearing before AR Chan spanned 3 days. AIA’s counsel,\n                    Mr Adrian Wong, who argued that the costs below should not be disturbed,\n                    agreed not to ask for costs of the appeal even though he had succeeded in\n                    persuading me to dismiss Mdm Zhu’s appeal in relation to whether the\n                    CY document was a part of the contract and on the interpretation of the CY\n                    document. AIA had also succeeded in the appeals relating to its striking out\n                    application as well as that of Mdm Zhu. On the other hand, I had disagreed\n                    with the court below on the question of whether the allegedly defamatory words\n                    in the counterclaim should have been determined at this stage of the proceedings\n                    and ordered that the determination should have been left to the trial judge. I\n                    thus made no order on the costs of the appeal and did not disturb the costs\n                    awarded below in relation to the determination under O 14 of the ROC and\n                    the striking out applications of both parties.69     As for Mdm Zhu’s appeal against the\n                    costs of $8,500 awarded to Mr Chia by AR Chan at the hearing below, I also\n                    did not vary the order. Apart from the fact that the parties had appeared before\n                    AR Chan for three days, Mr Chia had agreed not to ask for the costs of the\n                    hearing of the appeal even though Mdm Zhu’s appeal against the\n                    striking out of the claim against him had been dismissed.",
        "The Appeal": "",
        "(1)   Whether the CY document is part of the Contract": "38     O 14 r 12 of the ROC, which concerns\n                    the determination of questions of law or construction of documents, provides in\n                    part as follows: (1)The Court may,\n                            upon the application of a party or of its own motion, determine any\n                            question of law or construction of any document arising in any cause or\n                            matter where it appears to the Court that — (a)such question is suitable for determination\n                                without a full trial of the action; and (b)such determination will fully determine\n                                (subject only to any possible appeal) the entire cause or matter or\n                                any claim or issue therein. 39     Whether or not the CY document was part of the\n                    contract between AIA and Mdm Zhu was a question which could be suitably\n                    determined under O 14 r 12 of the ROC without a full trial. After all,\n                    Mdm Zhu’s case was that the CY document proved her case against AIA\n                    and she pleaded in her Statement of Claim at para 17: The dispute between the Plaintiff and [AIA] is on the first page of [the\n                        CY document].The dispute is about whether the policy,\n                            dividends, policy values and the premium-paying period that the first\n                            page of [the CY document] are guaranteed or just for illustration\n                            purposes only. [emphasis added] 40     The CY document was not a part of the contract\n                    between AIA and Mdm Zhu. It was furnished to her by Oscarbeforeher application for the policy, which was her\n                    offer to AIA to enter into the contract of assurance. In her application form,\n                    Mdm Zhu had categorically declared that no statement, information or\n                    agreement given by anyone soliciting or taking her application “shall be\n                    binding on the company” unless it was presented to and approved by an\n                    officer specified in the policy. She did not assert that the requisite approval\n                    had been obtained for the CY document to be binding on AIA. 41     In any case, even if the CY document had been\n                    a part of the contract, it did not guarantee that the projected critical year\n                    was fixed. Mdm Zhu accepted that it was stated in the CY document that the\n                    dividends payable and the interest rate on accumulated dividends were not\n                    guaranteed. However, she advanced the preposterous argument that as only the\n                    dividends and interest rate on accumulated dividends were not guaranteed,\n                    everything else,including the critical year, was\n                    guaranteed. This argument could not be countenanced for, if the dividends and\n                    interest rate were less than that illustrated in the CY document, the critical\n                    year would shift. In fact, Mdm Zhu revealed in her Statement of Claim that\n                    this was the position taken by her former solicitor, ETP as she pleaded at\n                    para 222 as follows: On [3 February 2009] …, [ETP’s\n                        Ms Gill] wrote to the plaintiff … that:- The [document] and its surrender values at the various years is based\n                            on the interest element of 7%, which is specifically stated as non\n                            guaranteed. So if the interest rate changes, the surrender values will\n                            change.This is pure logic. [emphasis added] 42     I now turn to the “entire\n                    agreement” clause in the policy. InLee Chee Wei v Tan\n                        Hor Peow Victor and others and another appeal[2007]\n                    3 SLR(R) 537 (“Lee Chee\n                    Wei”), the Court of Appeal approved of the following statement\n                    by Lightman J on the intent of such a clause inInntrepreneur Pub Co v East Crown Ltd[2000]\n                    2 Lloyd’s Rep 611, (at [7]): The purpose of an entire agreement clause is to preclude a party to a\n                        written agreement from threshing though the undergrowth, and finding in the\n                        course of negotiations some (chance) remark or statement (often long\n                        forgotten or difficult to recall or explain) on which to found a claim such\n                        as the present to the existence of a collateral warranty. The entire\n                        agreement clause obviates the occasion for any such search and the peril to\n                        the contracting parties posed by the need which may arise in its absence to\n                        conduct such a search. For such a clause constitutes a binding agreement\n                        between the parties that the full contractual terms are to be found in the\n                        document containing the clause and not elsewhere, and that accordingly any\n                        promises or assurances made in the course of the negotiations (which in the\n                        absence of such a clause might have effect as a collateral warranty) shall\n                        have no contractual force, save insofar as they are reflected and given\n                        effect in that document. 43     InPT Panasonic Gobel\n                        Indonesia v Stratech Systems Ltd[2009] 1 SLR(R) 470,\n                    Judith Prakash J stated (at [46]) that an entire agreement clause\n                    “makes it clear to both parties that their obligations are contained\n                    entirely within the bounds of the written agreement and that they should put\n                    everything that they want to have contractual force into the agreement and not\n                    rely on anything that was said before the contract was concluded as being\n                    binding”. Similarly, inIBM Singapore Pte Ltd v UNIG\n                        Pte Ltd[2003] SGHC 71, Tay Yong Kwang J, while\n                    construing an entire agreement clause, held (at [39]) that the contractual\n                    relationship between the parties was circumscribed by the signed agreements and\n                    by those alone. 44     Admittedly, much will also depend on the\n                    wording of the clause in question: seeLee Chee\n                        Wei. In the present case, the entire agreement clause clearly\n                    provided that “the policy and the application for it, a copy of which is\n                    attached to and made a part of the policy, constitute the entire\n                    contract”. As the CY document was not attached to or made a part of the\n                    policy, the entire agreement clause was another reason why the CY document could\n                    not be relied on by Mdm Zhu in her claim against AIA for breach of\n                    contract. 45     I thus affirmed AR Chan’s decision that\n                    the CY document was not a part of the contract of assurance and that its\n                    contents could not be interpreted as guaranteeing Mdm Zhu that the critical\n                    year in the policy would be reached in 2008.",
        "(2)   Whether the action against AIA should be struck\n                out.": "46     In the light of my finding that the CY\n                    document was not a part of the contract of assurance between AIA and\n                    Mdm Zhu and that it did not guarantee that the critical year in the policy\n                    was 2008, a question arose as to whether the court should exercise its power\n                    under O 14 r 12(2) of the ROC, which provides as follows: Upon such determination, the Court may dismiss the cause or matter or make\n                        such order or judgment as it thinks just. 47     As Mdm Zhu’s case rested entirely\n                    on her erroneous assumption that the CY document was a part of the contract and\n                    that it guaranteed that the critical year would be reached in 2008, her action,\n                    as pleaded, had no leg to stand on and especially so since she made it clear in\n                    her Statement of Claim that Oscar had not misrepresented to her that the\n                    interest rate in the CY document was guaranteed. While complaining that her\n                    former solicitor, Ms Gill from ETP had told her that her case was not\n                    strong unless she pleaded misrepresentation, Mdm Zhu stated at paras\n                    224-226 of her Statement of Claim as follows: 224Ms Gill was\n                            convincing the Plaintiff of her misleading logic and theory and\n                            convincing the Plaintiff to involve Oscar Huang in the\n                        case. …. 225Ms Gill revealed herulterior motiveto involve Oscar Huang through her email\n                            …. 226The Plaintiff was surprised that Ms Gill\n                            intended to let Oscar Huang state that the interest rate is a finite\n                            while the [CY document] stated that the interest rate is not guaranteed.\n                            She dared to lie to the Plaintiff openly.It is\n                                impossible that either Oscar Huang or the Plaintiff had stated that\n                                the interest rate is a definite. [emphasis added] 48     As the foundation on which Mdm Zhu\n                    asserted her claim disappeared, it followed that her claim against AIA had to be\n                    dismissed. After all, she had pleaded in her Statement of Claim at para 222\n                    as follows: [AIA] did not repudiate the Plaintiff’s policy, did not force the\n                        Plaintiff to surrender her policy, did not attempt to terminate her policy,\n                        and did not unilaterally change the terms and conditions of the\n                        policy. 49     For the reasons stated, I affirmed AR\n                    Chan’s decision to dismiss her claim against AIA.",
        "(3)   Whether Mdm Zhu’s claim against Mr Chia\n                should be struck out.": "50     In SUM 4926 of 2009, Mr Chia applied for\n                    Mdm Zhu’s claim of collusion against him to be struck out under\n                    O 18 r 19 (1)(a) of the ROC on the ground that it disclosed no\n                    reasonable grounds of action. His application was allowed by AR\n                Chan. 51     That an action should not be too readily\n                    struck out has been emphasized by the courts on numerous occasions. InGabriel Peter & Partners (suing as a firm) v Wee Chong Jin and\n                        others[1997] 3 SLR(R) 649 (“Gabriel Peter”), the Court of Appeal explained at [18] as\n                    follows: In general, it is only in plain and obvious cases that the power of\n                        striking out should be invoked. … It should not be exercised by a\n                        minute and protracted examination of the documents and facts of the case in\n                        order to see if the plaintiff really has a cause of action. The practice of\n                        the courts has been that, where an application for striking out involves a\n                        lengthy and serious argument, the court should decline to proceed with the\n                        argument unless, not only does it have doubts as to the soundness of the\n                        pleading but, in addition, it is satisfied that striking out will obviate\n                        the necessity for a trial or reduce the burden of preparing for a\n                        trial. 52     While the courts are slow to utilise their\n                    draconian power to strike out an action, a case which is hopelessly doomed to\n                    fail will be struck out. InBandung Shipping Pte Ltd v Keppel\n                        TatLee Bank Ltd[2003] 1 SLR(R) 295 , Chao Hick\n                    Tin JA explained at [34] that allowing a hopeless claim to proceed to trial\n                    would be to compel the defendant to expend time and money in defending a case\n                    with no merit whatsoever. 53     In the present case, as Mr Chia asserted\n                    that Mdm Zhu’s Statement of Claim disclosed no reasonable cause of\n                    action against him, reference may be made toGabriel\n                        Peter, where the Court of Appeal explained as follows at\n                    [21]: The guiding principle in determining what a \"reasonable cause of action\"\n                        is under O 18 r 19(1)(a) was succinctly pronounced by Lord Pearson\n                        in Drummond-Jackson v British Medical Association [1970] 1 All ER 1094. A\n                        reasonable cause of action, according to his lordship, connotes a cause of\n                        action which has some chance of success when only the allegations in the\n                        pleading are considered. As long as the statement of claim discloses some\n                        cause of action, or raises some question fit to be decided at the trial, the\n                        mere fact that the case is weak and is not likely to succeed is no ground\n                        for striking it out. Where a statement of claim is defective only in not\n                        containing particulars to which the defendant is entitled, the application\n                        should be made for particulars under O 18 r 12 and not for an\n                        order to strike out the statement 54     Mr Chia asserted that while\n                    Mdm Zhu’s claim against him appeared to be based on the tort of\n                    conspiracy, there was no proper pleading that he had committed such a tort. In\n                    her written submissions, Mdm Zhu stated her case confusingly in Part 3\n                    para 4 as follows: In [this] action I sue [Mr Chia] for hisserious\n                            breach of trust. I verily believe that he colluded with [AIA]\n                        to sabotage and jeopardise my case and my claim when he acted for me against\n                        [AIA] in May and June 2009. I believe that he committed serious wrongdoings\n                        and misconduct. [emphasis added] 55     Mdm Zhu’s allegation that\n                    Mr Chia colluded with AIA, as pleaded in her Statement of Claim, rested\n                    entirely on her dissatisfaction with the draft Statement of Claim prepared by\n                    Mr Chia. Her references to Mr Chia in her Statement of Claim were\n                    found under the heading “The 1stand\n                        2ndDefendant weresuspectedto have colluded on the Plaintiff’s case; aproblematic draft of the Writ of\n                    Summons” (emphasis added). In para 76 of her reply,\n                    Mdm Zhu made her position clearer by stating that she averred that there\n                    was collusion between AIA and Mr Chia. However, nothing in the Statement of\n                    Claim suggested that Mr Chia had colluded with AIA. All that had been\n                    pleaded was a litany of complaints against Mr Chia’s handling of the\n                    case. At para 350 of her Statement of Claim, Mdm Zhu pleaded as\n                    follows: The draft was full of mistakes and errors. It was ambiguous and hideous\n                            (sic) messy. It was difficult to\n                        understand. There was no single paragraph clear, correct or beneficial to\n                        the Plaintiff’s case. There was nothing correct except who the\n                        Defendant is. 56     Mdm Zhu’s written submissions were\n                    also focussed on complaints about the Statement of Claim drafted by\n                    Mr Chia. She was unhappy that the draft Statement of Claim was delivered\n                    late, that it was “extremely short”, that it did not contain\n                    “any correct paragraph”, that it was “full of\n                    mistakes” and that it “did not plead any correct\n                    facts”. 57     Mdm Zhu was also suspicious as to why\n                    Mr Chia wrote to AIA’s solicitors, Rajah & Tann LLP, and her\n                    former solicitors, ETP, before the writ was issued. With regard to this,\n                    Mr Chia had explained to her as follows: My purpose in writing to Rajah & Tann is that as a matter of\n                        professional conduct, I have come to be aware that Rajah & Tann are\n                        acting for AIA and also that you were previously represented by Engelin Teh\n                        & Partners. In order for proper housekeeping and order, it is imperative\n                        that before we issue the writ, I inform Engelin Teh that I am taking over\n                        the conduct of the matter and that before we serve the writ we ask that\n                        Rajah & Tann confirm its instructions to accept service of the writ on\n                        behalf of AIA. This is part of the professional conduct which I am supposed\n                        to adhere to as a lawyer. 58     Despite Mr Chia’s clarification,\n                    Mdm Zhu stated in her Statement of Claim that she did not understand the\n                    former’s logic in writing to ETP as she had informed him that ETP was no\n                    longer acting for her. 59     Instead of dealing with events or documents\n                    that suggested that Mr Chia had colluded with AIA, Mdm Zhu had merely\n                    posed a number of questions to him in her Statement of Claim at para 373\n                    and added that if he had not colluded with AIA, he should have been able to\n                    answer them easily. The questions are as follows: a.Why did he not ask the Plaintiff to sign any\n                            document or provide any deposit? b.Why did he not inform the Plaintiff his service\n                            charges during the two meetings? Instead, he wanted to prepare a draft\n                            first. If the Plaintiff satisfied with his draft, he would quote his\n                            price for writing the writ. He is an experienced lawyer. He should be\n                            very clear how he charges clients. c.Why did he not ask the Plaintiff for all the\n                            relevant documents on the case while he definitely needed them if he\n                            would draft the writ? He only made a copy of [the CY document], the\n                            Plaintiff’s demand letter dated 4 February 2009 and Rajah &\n                            Tann’s legal letter dated 13 February 2009. d.Who prepared the draft? If it was [Mr Chia],\n                            where did he deduce the terms of agreement, repudiation and repayment\n                            from? Where did he deduce the content of the draft from? e.Why did his draft not contain any relevant facts?\n                            He had asked the Plaintiff to introduce the dispute two times and he\n                            even taped down their second discussion. It could be sure that he had\n                            obtained a good view on the dispute by the two discussions and the\n                            Document that the Plaintiff passed to him. f.Why did he request the Plaintiff to send the soft\n                            copy of the Document while his draft did not contain any relevant\n                            content? g.Why did he keep the Plaintiff wait for three weeks\n                            while his draft should not spent him too much time to\n                        prepare? h.Why did he never send his partial completed draft\n                            to the Plaintiff while she asked him for it many times? He had agreed to\n                            provide it during their second meeting. i.Why did his draft not contain a single paragraph\n                            which is clear or correct? j.Why did his draft emphasise that the policy was\n                            sold/purchased by basing on an agreement? k.Where was the content of his draft\n                        from? 60     When asked why she had pleaded that\n                    Mr Chia had colluded with AIA when the facts relied on by her did not\n                    support such an assertion, Mdm Zhu strayed completely from the issue at\n                    hand and suggested that Mr Chia was guilty of breach of\n                trust. 61     As there was nothing in the pleadings to\n                    suggest that Mr Chia had colluded with AIA, it was plain and obvious that\n                    Mdm Zhu’s case against him for conspiracy could not succeed. As such,\n                    I affirmed AR Chan’s decision to strike out Mdm Zhu’s claim\n                    against Mr Chia.",
        "(4)   Mdm Zhu’s application to strike out AIA’s\n                defence and counterclaim and Mr Chia’s defence": "62     As I had dismissed Mdm Zhu’s claim\n                    against AIA, her application to strike out AIA’s defence became an\n                    academic question. Even so, it may be noted that Mdm Zhu’s approach\n                    was that AIA had no defence because the latter had denied her claim with a pack\n                    of lies. She could not understand that the veracity of AIA’s defence\n                    should have been tested during the trial and not at this stage of the\n                    proceedings. 63     As for Mdm Zhu’s application to\n                    strike out the counterclaim, she argued that AIA had no case because the latter\n                    had not said that her words were untrue and had primarily been concerned with\n                    the determination of the meaning of her allegedly defamatory words. This\n                    argument was flawed as AIA had pleaded that the contents of Mdm Zhu’s\n                    blog were “false and defamatory” and that she had acted with\n                    malicious intent and ill-will. 64     As Mdm Zhu did not have any convincing\n                    argument as to why AIA’s defence and counterclaim should be struck out\n                    under O 18 r 19 of the ROC, her appeal against AR Chan’s\n                    dismissal of her striking out application was dismissed. 65     As for Mdm Zhu’s appeal with\n                    respect to her application to strike out Mr Chia’s defence to her\n                    claim, and for judgment to be entered against the latter for colluding with AIA,\n                    this also became an academic issue after her claim against Mr Chia was\n                    struck out. All the same, it ought to be noted that the application to strike\n                    out Mr Chia’s defence had no merit. In his Defence, Mr Chia\n                    pleaded that his draft Statement of Claim had correctly set out\n                    Mdm Zhu’s claim in contract, that he had not conducted himself\n                    inappropriately in relation to the matter and that pending discovery and/or\n                    interrogatories, he was not obliged to answer the many questions posed to him in\n                    para 373 of Mdm Zhu’s Statement of Claim. All that Mdm Zhu\n                    could say about Mr Chia’s defence was that it contained lies. This\n                    was not a reason to strike out Mr Chia’s defence at this stage of the\n                    proceedings.",
        "(5)   Meaning of the allegedly defamatory words in\n                Mdm Zhu’s blog": "66     For the sake of completeness, it ought to be\n                    mentioned that I disagreed that the meaning of the allegedly defamatory words\n                    should have been determined at this stage. As such, I overruled AR Chan’s\n                    decision to construe the meaning of the said words and reversed his order on\n                    costs. However, as AIA has not lodged any appeal on this matter, it need not be\n                    further considered in this judgement.",
        "(6)   Whether the costs awarded in the court below should be\n                reduced": "67     Mdm Zhu complained that the costs awarded\n                    by AR Chan were too high and should be reduced. 68     AIA was awarded costs of $12,500 in the court\n                    below. The hearing before AR Chan spanned 3 days. AIA’s counsel,\n                    Mr Adrian Wong, who argued that the costs below should not be disturbed,\n                    agreed not to ask for costs of the appeal even though he had succeeded in\n                    persuading me to dismiss Mdm Zhu’s appeal in relation to whether the\n                    CY document was a part of the contract and on the interpretation of the CY\n                    document. AIA had also succeeded in the appeals relating to its striking out\n                    application as well as that of Mdm Zhu. On the other hand, I had disagreed\n                    with the court below on the question of whether the allegedly defamatory words\n                    in the counterclaim should have been determined at this stage of the proceedings\n                    and ordered that the determination should have been left to the trial judge. I\n                    thus made no order on the costs of the appeal and did not disturb the costs\n                    awarded below in relation to the determination under O 14 of the ROC and\n                    the striking out applications of both parties. 69     As for Mdm Zhu’s appeal against the\n                    costs of $8,500 awarded to Mr Chia by AR Chan at the hearing below, I also\n                    did not vary the order. Apart from the fact that the parties had appeared before\n                    AR Chan for three days, Mr Chia had agreed not to ask for the costs of the\n                    hearing of the appeal even though Mdm Zhu’s appeal against the\n                    striking out of the claim against him had been dismissed."
    }
}