{
    "case_title": "Tang Chay Seng\n      v\n      Tung Yang Wee Arthur",
    "ncitation": "[2010] SGHC 228",
    "coram": "Tan Lee Meng J",
    "sections": {
        "Introduction": "1       The plaintiff, Mr Tang Chay Seng\n                    (“TCS”), is the sole proprietor of a pork noodles stall at Apt Blk\n                    465 Crawford Lane #01-12, Singapore 190465. He is also the registered proprietor\n                    of two composite trade marks (“the marks”) in relation to his\n                    business, namely TO418607C in Class 29 and TO418608A in Class 30. The\n                    defendant is TCS’s nephew, Mr Tung Yang Wee, Arthur\n                    (“Arthur”), who operates a pork noodles stall at VivoCity Food\n                    Court. TCS sued Arthur for infringing the marks and passing off. Arthur denied\n                    that he had infringed the marks or had passed off his pork noodles business as\n                    that of TCS.",
        "Background": "2       More than 70 years ago, TCS’s father and\n                    Arthur’s grandfather, Mr Tang Joo Teo (“TJT”), started a\n                    pork noodles stall in a coffeeshop known as “Tai Hwa Tea House” in\n                    Hill Street. 3       At Tai Hwa Tea House, TJT cooked the noodles\n                    while his three children, Mr Tung Chye Hong (“TCH”), Mr Tang\n                    Chai Chye (“TCC”) and TCS, served customers who patronised the\n                    stall. In 1964, ill health prevented TJT from cooking at his noodles stall. TCS\n                    claimed that his father handed over the pork noodles business to him in 1964 and\n                    that his brothers had been his assistants. However, according to his brothers,\n                    TCH and TCC, their father took charge of the business again after he got better\n                    and all the takings from the business were handed over to him. Whatever may have\n                    been the case, TJT eventually withdrew from the family business due to old\n                    age. 4       At present, TCS has only one pork noodles stall.\n                    In contrast, TCC and his son operate four pork noodles stalls. The pork noodles\n                    stalls run by TCS and TCC were regularly featured together in advertisements in\n                    Singapore and both brothers won numerous local awards and certificates\n                    (“the culinary awards”) for their pork noodles. These included the\n                    Singapore Food & Entertainment Guide Award for culinary excellence in\n                    1992/93, the Makansutra Food Oscars 2003 and the Green Book Best Food Awards\n                    2005/06 and 2009/10. 5       In 1995, TCS changed the name of his business\n                    from “Tai Hwa Pork Kwei Teow Mee Keow” to “Hill Street Tai\n                    Hwa Pork Noodle”. On 27 October 2004, he became the registered\n                    proprietor of the marks in Class 29 and Class 30. 6       In 2006, TCS, his son, Mr Tang Yiang Kang\n                    (“Kang”) and Arthur pooled their resources to set up a pork\n                    noodles stall at the VivoCity food court under the name “Hill Street Tai\n                    Hwa (VivoCity) Pork Noodle” (“VivoCity 1”). For the purpose\n                    of publicising this new stall, TCS handed over his culinary awards to Arthur,\n                    who had the said awards digitally scanned. Thus, when Arthur returned the\n                    original awards to TCS, he had copies of the awards in his\n                possession. 7       VivoCity 1 turned out to be a dismal failure. It\n                    closed down under rather acrimonious circumstances within two weeks after it\n                    started business on 14 October 2006. TCS blamed Arthur for the failure of\n                    the business. However, Arthur said that there had been problems from the very\n                    start because Kang and TCS could not get along. Kang had preferred a\n                    “production line system” of cooking while TCS had insisted on\n                    having each bowl of pork noodles cooked slowly to ensure quality control.\n                    Furthermore, VivoCity 1’s defective kitchen equipment produced inferior\n                    pork noodles soup that smelt of burnt flesh. The closure of VivoCity 1 led to a\n                    deterioration of Arthur’s relationship with TCS. 8       Arthur claimed that in 2008, the operators of\n                    the food court at VivoCity invited him to take over the space occupied by the\n                    stall that had replaced VivoCity 1. On 31 July 2008, Arthur and his father\n                    visited TCS to inform him of this development. According to them, at this\n                    meeting, TCS gave his blessing to the opening of VivoCity 2 and to the use of\n                    the name “???”, pronounced in dialect as\n                    “Lau Dai Hua”, for this new pork noodles stall, which opened for\n                    business on 4 October 2008. However, TCS contended that he had not given\n                    his consent to the use of this name. All the same, it is noteworthy that when\n                    VivoCity 2 was opened, TCS sent Arthur a pot of flowers accompanied by a\n                    congratulatory message. In his message, TCS referred to\n                        “???” and went so far as to say “May\n                    your business flourish”. 9       Around a month later, on 5 November 2008,\n                    Arthur placed an advertisement for VivoCity 2 in theLianhe\n                        Zaobao, a Chinese newspaper. The translation for the said\n                    advertisement is as follows: Famous Hill Street Tai Hwa Pork Kway-teow and Noodle. Originally located at Tai Hwa Coffeeshop, next to High Street (Hill\n                        Street) Old Police Station, it had now moved to Vivo City #03-01 Food\n                        Republic, Stall 10 (next to the Sentosa Express Ticketing\n                        Office). The long-established name of Tai Hwa had been once awarded ***** for\n                        Hawker Delicacies Daily Review in the “Guide to Food (Zhi Dian Mi\n                        Jin)”, in addition to other many more good review awards and\n                        certificates. 10     Arthur displayed TCS’s culinary awards\n                    in the said advertisement. TCS was not pleased with the manner in which Arthur\n                    depicted the history of VivoCity 2 and with the use of his culinary awards in\n                    Arthur’s advertisement on 5 November 2008. He did not want to be\n                    linked in any way to VivoCity 2. On 18 November 2008, TCS’s\n                    solicitors, M/s Yong Koh & Partners, wrote to Arthur to allege that the\n                    latter had infringed the trade marks and had passed off his pork noodles\n                    business as that of TCS. TCS’s solicitors demanded,inter alia, that Arthur furnish an account of all income and\n                    profits earned since 4 October 2008, provide a suitably drafted apology to\n                    TCS in theLianhe ZaobaoandLianhe Wanbaoand pay damages as well as legal costs to\n                    TCS. 11     Knowing that his uncle was displeased, Arthur\n                    sought to distance VivoCity 2 from TCS’s pork noodles stall by placing\n                    another advertisement for VivoCity 2 in theLianhe\n                        Zaobaoon 6 December 2008. In this advertisement, he stated\n                    “We are one and only. We have no branch.” 12     TCS, who had placed an advertisement in theLianhe Zaobaoon 26 November 2008 to\n                    inform the public that he had only one pork noodles stall, instituted legal\n                    proceedings against Arthur for infringement of his trade marks and for passing\n                    off on 17 December 2008.",
        "Whether TCS consented to the use of\n                    “???”": "13     It is evident from s 27 of the Trade\n                    Marks Act (Cap 332, 2005, Rev Ed) (“the Act”), which deals\n                    with the infringement of a trade mark, that an infringement arises only in\n                    relation to an act done without the consent of the proprietor of the\n                    mark. 14     Arthur claimed that as he had planned to\n                    return to the place where VivoCity 1 had failed in 2006, he was advised to\n                    discuss his plan with his uncle, TCS, to avoid any misunderstanding. He stated\n                    in his affidavit of evidence-in-chief (“AEIC”) at para 124\n                    that he had told TCS that his new pork noodles stall at the VivoCity food court\n                    (“VivoCity 2”) would be named\n                        “???” to make the “connection with\n                    my grandfather”. He added that TCS had consented and had told him that\n                    since he knew how to prepare his grandfather’s pork noodles dish, he\n                    should go ahead with his new business venture. 15     TCH corroborated his son’s claim that\n                    they had both met TCS on 31 July 2008. When cross-examined, he testified\n                    that TCS had consented to the use by Arthur of the name\n                        “???” for VivoCity 2 even though this fact\n                    had not been stated in his AEIC. 16     Although TCS denied that he had given his\n                    consent to the use by Arthur of “???”, it is\n                    rather telling that when VivoCity 2 began its operations in October 2008, TCS\n                    had wished Arthur well by sending him a pot of flowers, together with a\n                    congratulatory message in Chinese, which referred to Arthur’s sign\n                        “???”. The English translation of the\n                    congratulatory message is as follows: CONGRATULATIONS ON THE OPENING OFLAU DAI HUA MINCED PORK\n                            NOODLEMAY YOUR BUSINESS\n                        FLOURISHFROM MR AND MRS TANG CHAY SENG[emphasis added]17     As TCS specifically mentioned\n                        “???” or “Lau Dai Hua” in his\n                    congratulatory message and had wished that this business would flourish, it may\n                    be assumed, and especially so in the context of the family ties between him and\n                    Arthur, that he had consented to the use of the Chinese characters\n                        “???” by Arthur for VivoCity\n                2.18     TCS’s counsel, Mr Deepak Natverlal\n                    (“Mr Natverlal”) argued that his client’s congratulatory\n                    message on the occasion of the opening of Arthur’s pork noodles stall must\n                    be viewed together with an earlier affidavit dated 7 August 2009 that his\n                    client had filed in relation to Arthur’s application to dismiss the\n                    present action. However, in that affidavit, TCS had merely stated at [9]:[A]t the time the congratulatory message was sent to the Defendant, I had\n                        not expected the Defendant to use my Certificates and Awards to mislead the\n                        general public in his first advertisement on 5th November 2008 passing off\n                        these certificates as his own.I had sent the\n                            congratulatory message to the Defendant with a sincere and good\n                            intentionbut the Defendant is so conniving and shrewd that\n                        he has used this to advance his own cause. The Defendant is therefore\n                        attempting to mislead the Court.[emphasis added]19     Nothing in the above paragraph suggests that\n                    TCS objected to the use of “???” or “Lau\n                    Dai Hua” by Arthur. In fact, TCS had reiterated that he had sent the\n                    congratulatory message with a “sincere and good intention”. As\n                    such, nothing in the said earlier affidavit undermines the effect of TCS’s\n                    congratulatory message.20     I thus find that it is more likely than not\n                    that TCS had consented to the use of “???” or\n                    “Lau Dai Hua” as the name for VivoCity 2. As such, his claim\n                    against Arthur for infringement of his trade marks may be dismissed on the\n                    ground of his consent.Whether Arthur had infringed the marks if there had been no\n                consent21     Although I have ruled that TCS had consented\n                    to the use by Arthur of “???”, I will, for the\n                    sake of completeness consider the position as to whether Arthur had infringed\n                    the marks if TCS had not given his consent.22     What must be proven to establish that a trade\n                    mark has been infringed depends to some extent on whether the registered mark\n                    and the defendant’s mark or sign are identical or similar. In the present\n                    case, TCS did not assert that Arthur’s sign is identical to his own marks.\n                    Instead, he claimed that Arthur’s sign is similar to his marks and sought\n                    to rely on s 27(2)(b) and s 27(3) of the\n                    Act.Claim under s 27(2)(b) of the\n                Act23     Section 27(2)(b) of the Act provides as follows:27(2) A person infringes a registered trade mark if,\n                            without the consent of the proprietor of the trade mark, he uses in the\n                            course of trade a sign where because —….(b)    the sign is similar to the trade mark and is used\n                            in relation to goods or services identical with or similar to those for\n                            which the trade mark is registered,there exists a likelihood of confusion on the part of the public.24     In his Statement of Claim, TCS pleaded in\n                    para 3:Subsequent to the date of registration, the Defendant has infringed the\n                        Registered Trade Marks by the use in the course of trade of a sign where,\n                        because the sign is similar to the Registered Trade Marks and is used in\n                        relation to goods similar to those for which the Registered Trade Marks are\n                        registered, there exists a likelihood of confusion.25     Arthur pleaded at para 2 of his Defence\n                    that para 3 of the Statement of Claim was denied and that TCS was put to\n                    strict proof of the contents therein.26     InThe Polo/Lauren Co LP v\n                        Shop in Department Store Pte Ltd[2006] 2 SLR(R) 690\n                        (“Polo/Lauren”), the Court of\n                    Appeal adopted the test outlined inBritish Sugar plc v James\n                        Robertson & Sons Ltd[1996] RPC 281 (\"theBritish Sugartest\") for determining whether or not\n                    there has been an infringement under s 27(2)(b) of the Act. Applying theBritish\n                        Sugartest, section 27(2)(b)\n                    will be infringed in the present case if:(i)Arthur’s sign is similar to the\n                            marks;(ii)Arthur’s sign and the marks are used in\n                            relation to identical or similar goods or services; and(iii)on account of the presence of the first two\n                            conditions, there exists a likelihood of confusion on the part of the\n                            public.27     The tests for similarity of marks are trite.\n                    The registered mark and the allegedly infringing mark or sign are compared for\n                    visual, aural and conceptual similarities. Whether or not there is similarity is\n                    essentially a question of fact.28     TCS’s two registered marks arecompositemarks with Chinese characters, English words\n                    and graphic depictions. TCS’s marks are as follows:29     The components of TCS’s composite marks\n                    are the following:(i)10 Chinese characters,\n                                “???” and\n                                “???????”. These two Chinese\n                            phrases refer to “Suspension Bridge Head” and “Tai\n                            Hwa Pork Noodle” respectively;(ii)the English words “Hill Street Tai Hwa\n                            Pork Noodle”;(iii)a graphic depiction of a suspension bridge;\n                            and(iv)a graphic depiction of a bowl of noodles with a\n                            pair of chopsticks.30     Arthur’s signboard, which contains\n                    graphic depictions as well as Chinese, Japanese and Korean characters but no\n                    English words, is as follows:31     The components of Arthur’s signboard are\n                    as follows:(i)3 Chinese characters, namely\n                                “???”; which are pronounced as\n                            “Lau Dai Hua”;(ii)Japanese and Korean characters not found in the\n                            marks; and(iii)a graphic depiction of a mythical creature\n                            called “pi xiu”, which resembles a winged lion, on both\n                            sides of the Chinese characters.32     For the purpose of determining whether a mark\n                    and an allegedly infringing mark or sign are similar, one must take into account\n                    the imperfect recollection of a mark by a consumer: see Nautical Concept Pte Ltd\n                    v Jeffery Mark Richard [2007] 1 SLR(R) 1071 at [30]. The average consumer\n                    usually has no opportunity to make a direct comparison between the marks in\n                    question and he must rely on the “imperfect picture of them that he has\n                    kept in his mind”: seeLloyd Schuhfabrik Meyer v\n                        Klijsen Handel BV, Case C-342/97 [1999] 2 CMLR 1343, 1358-9\n                        (“Lloyd Schuhfabrik”).\n                    Furthermore, the European Court of Justice has stressed that for the purpose of\n                    determining whether marks that are being compared are similar, it is theoverall impressioncreated by them in the\n                    light of their distinctive and dominant components that matters: seeSabel BV v Puma AG, Rudolf Dassler Sport, Case C-251/95\n                    [1997] ECR 1-6191 (“Sabel”) andLloyd Schuhfabrik. This approach was recently\n                    adopted by Tay Yong Kwang J inFestina Lotus SA v Romanson Co\n                        LtdSGHC [2010] 200. In the case of complex marks, it is also\n                    noteworthy that inMatratzen Concord GmbH v Office for\n                        Harmonisation in the Internal Market (OHIM) (Trademarks and\n                        Designs)(“Matratzen”) Case T-6/01 [2002] ECR II- 4335, the Court\n                    of First Instance, while adopting the approach inSabelandLloyd Schuhfabrik, added\n                    at [33] to [34] as follows:33.Consequently, it must be held thata complex trade mark cannot be regarded as being similar to\n                                another trade mark which is identical or similar to one of the\n                                components of the complex mark, unless that component forms the\n                                dominant element within the overall impression created by the\n                                complex mark. That is the case where that component is\n                            likely to dominate, by itself, the image of that mark which the relevant\n                            public keeps in mind, with the result that all the other components of\n                            the mark are negligible within the overall impression created by\n                            it.34.It should be made clear thatthat approach does not amount to taking into consideration only one\n                                component of a complex trade mark and comparing it with another\n                                mark. On the contrary, such a comparison must be made by examining\n                                the marks in question, each considered as a whole.\n                            However, that does not mean that the overall impression created in the\n                            mind of the relevant public by a complex trade mark may not, in certain\n                            circumstances, be dominated by one or more of its\n                        components.[emphasis added]33     The approach adopted inMatratzenin relation to the comparison of a composite mark with\n                    another mark or sign was reiterated inMedion AG v Thomson\n                        Multimedia Sales Germany & Austria GmbHCase C-120/04 [2003]\n                    ECR I-8551. It follows that one cannot, without more, compare a single\n                    component of the marks with one part of Arthur’s sign. If TCS’s\n                    composite marks are viewed as a whole and on the basis of their overall\n                    impression in the light of their distinctive and dominant components, the\n                    differences between them and Arthur’s sign are so obvious that they cannot\n                    be considered visually similar by a consumer with an imperfect recollection of\n                    the marks. After all, TCS’s marks have Chinese characters and English\n                    words whereas Arthur’s sign, which has no English words, has Chinese,\n                    Japanese and Korean characters. Furthermore, any overall impression of\n                    TCS’s marks must take into account the prominently placed graphic\n                    depictions of a suspension bridge and bowl of noodles with chopsticks, which are\n                    absent from Arthur’s sign, which has a graphic depiction of the mythical\n                    pi xiu. I thus find that there is no visual similarity between the marks and\n                    Arthur’s sign.34     As for the question of aural similarity,\n                    TCS’s complaint was summed up in his AEIC at para 11(iii) as\n                    follows:Further, the mark “Lau Tai Hua” … has considerably\n                        oral and visual similarity to “Hill Street Tai Hwa Pork\n                        Noodle” which I say, is all obvious to the Defendant.35     Apart from the fact that TCS did not prove\n                    that the words “Hill Street Tai Hwa Pork Noodle” or its\n                    translation in Chinese are the dominant component of his composite marks,\n                    “Lau Dai Hua” is not aurally similar to “Hill Street Tai\n                    Hwa Pork Noodle”. It has often been said that when comparing marks for\n                    aural similarity, “tribunals have tended to carry out a quantitative\n                    assessment: do the two signs have more syllables in common than not?”:\n                    see Bently & Sherman, Intellectual Property Law (Oxford University Press,\n                        3rded, 2009) at 865. In the present case,\n                    “Lau Dai Hua” has only 3 syllables while “Hill Street Tai\n                    Hwa Pork Noodles” has 6 syllables and the first two syllables in the\n                    marks “Hill Street” do not sound like “Lau” in\n                    Arthur’s sign. Furthermore, the two similar sounding words “Tai\n                    Hwa” in the marks and “Dai Hua” in Arthur’s sign,\n                    which are written in Chinese as “??”, are\n                    commonly used in the food industry and other businesses. For instance,\n                        “??” is extensively used in the food\n                    industry by Tai Hua Food Industries Pte Ltd (“Tai Hua Food”), a\n                    well known manufacturer of several types of sauces sold in Singapore in\n                    supermarkets and provision shops. Tai Hua Food is the registered proprietor of a\n                    large number of trade marks with the Chinese characters\n                        “??” and the English words “Tai\n                    Hua” in classes 29 and 30. In fact, in regard to TM No T8604338G, which\n                    had been registered by Tai Hua Food in 1986, long before the marks were\n                    registered in 2004, the only characters and words appearing in the mark are\n                        “??” and “Tai\n                Hua”.36     The Chinese characters\n                        “??” are also used by other types of\n                    businesses. For instance, in the banking industry, the Chinese translation of\n                    “United Overseas Bank”, a major local bank, includes the\n                    characters “??”. I thus find that there is no\n                    aural similarity between the marks and Arthur’s sign merely because they\n                    both have two commonly used Chinese characters.37     As for conceptual similarity, no attempt was\n                    made to prove that the marks and Arthur’s sign are conceptually similar\n                    and in my view, they are not.38     InPolo/Lauren,\n                    the Court of Appeal made it clear (at [8]) that if a registered mark and the\n                    allegedly infringing sign are not similar, there is no “need to go into\n                    the third question of determining whether there exists a likelihood of\n                    confusion”. In any case, TCS did not submit any credible evidence of the\n                    likelihood of confusion and if it had been necessary to determine the issue, I\n                    would, after considering the marks and Arthur’s sign, have found that\n                    there was no likelihood of confusion. I thus dismiss TCS’s claim against\n                    Arthur under s 27(2) of the Act for infringement of his\n                marks.Section 27(3) of the Act39     As has been mentioned, TCS also relied on\n                    s 27(3) of the Act, which provides as follows:A person infringes a registered trade mark which is well known in\n                        Singapore if —(a)without the consent of the proprietor of the trade\n                            mark, he uses in the course of trade a sign which is identical with or\n                            similar to the trade mark in relation to goods or services which are not\n                            similar to those for which the trade mark is registered;(b)the use of the trade mark in relation to those\n                            goods or services would indicate a connection between those goods or\n                            services and the proprietor;(c)there exists a likelihood of confusion on the part\n                            of the public because of such use; and(d)the interests of the proprietor are likely to be\n                            damaged by such use.40     As I have found that TCS’s marks and\n                    Arthur’s sign are not similar, TCS cannot rely on s 27(3) of the Act\n                    to assert his claim against Arthur with respect to the signboard for VivoCity 2.\n                    As has been mentioned, there was, in any case, no evidence of a likelihood of\n                    confusion because of the usage of Arthur’s sign other than TCS’s\n                    uncorroborated and self-serving assertion to that effect.Passing Off41     Depending on the circumstances, a plaintiff\n                    who fails to prove an infringement of his registered trade mark may yet succeed\n                    in an action for passing off. The authors ofKerly’s\n                        Law of Trade Marks and Trade Names, Sweet & Maxwell,\n                        14thed, 2005, stated at\n                    para 15-033:A claimant may fail to make out a case of infringement of a trade mark for\n                        various reasons and may yet show that by imitating the mark claimed as a\n                        trade mark or otherwise, the defendant has done what is calculated to pass\n                        off his goods as those of the claimant. A claim in “passing\n                        off” has generally been added as a second string to actions for\n                        infringement, and has on occasion succeeded where the claim for infringement\n                        has failed.42     InReckitt & Colman\n                        Products Ltd v Borden Inc and others[1990] 1WLR 491 at 499\n                        (“Reckitt”), Lord Oliver of\n                    Aylmerton explained the meaning of “passing off” as\n                    follows:The law of passing off can be summarised in one short general proposition\n                        – no man may pass off his goods as those of another. More\n                        specifically, it may be expressed in terms of the elements which the\n                        plaintiff in such an action has to prove in order to succeed. These are\n                        three in number. First, he must establish a goodwill or reputation attached\n                        to the goods or services which he supplies in the mind of the purchasing\n                        public by association with the identifying “get-up”….\n                        Secondly, he must demonstrate a misrepresentation by the defendant to the\n                        public (whether or not intentional) leading or likely to lead the public to\n                        believe that goods or services offered by him are the goods or services of\n                        the plaintiff…. Thirdly, he must demonstrate that he suffers or, in aquia timetaction, that he is likely to\n                        suffer damage by reason of the erroneous belief engendered by the\n                        defendant’s misrepresentation that the source of the defendant’s\n                        goods or services is the same as the source of those offered by the\n                        plaintiff.43     TCS alleged that Arthur had been passing off\n                    his pork noodles as those sold by “Hill Street Tai Hwa Pork\n                    Noodle”. As proof of this, he pointed to the use of the Chinese\n                    characters “???” in Arthur’s sign and two\n                    advertisements by Arthur in theLianhe ZaobaoandLianhe Wanbaoin November 2008.44     For TCS’s passing off action to succeed,\n                    the following must be established:(i)goodwill or reputation was attached to his pork\n                            noodles business at Crawford Lane;(ii)Arthur had misrepresented that VivoCity 2 is\n                            connected with TCS’s business; and(iii)TCS had suffered or is likely to suffer damage\n                            by reason of the erroneous belief engendered by Arthur’s\n                            misrepresentation that the latter’s pork noodles is the same as\n                            his pork noodles.45     In regard to goodwill, what is relevant in a\n                    passing off action is the goodwill between a trader and his customers. InInland Revenue Commissioners v Muller & Co’s\n                        Margarine Ltd[1901] AC 217, Lord Macnaghten explained at\n                    223-224:What is goodwill? It is a thing very easy to describe, very difficult to\n                        define. It is the benefit and advantage of the good name, reputation, and\n                        connection of a business. It is the attractive force which brings in custom.\n                        It is the one thing that distinguishes an old-established business from a\n                        new business at its first start. The goodwill of a business must emanate\n                        from a particular centre or source. However widely extended or diffused its\n                        influence may be, goodwill is worth nothing unless it has power of\n                        attraction sufficient to bring customers home to the source from which it\n                        emanates.46     In his Defence and Counterclaim, Arthur\n                    admitted at [13] that TCS’s pork noodles business is “well\n                    known”. While reputation does not necessary mean that there is goodwill,\n                    I accept that there is some goodwill attached to TCS’s pork noodles\n                    business, and especially so since he has won quite a number of culinary\n                    awards.47     As for the requirement of misrepresentation,\n                    inReckitt, Lord Oliver explained at\n                    p 499 that the plaintiff “must demonstrate a misrepresentation by\n                    the defendant to the public (whether or not intentional) leading or likely to\n                    lead the public to believe that goods or services offered by him are the goods\n                    or service of the plaintiff”. This statement was endorsed inCDL Hotels International Ltd v Pontiac Marina Pte Ltd[1998] 1 SLR(R) 975 at [44] by the Court of Appeal. InNovelty Pte Ltd v Amanresort Ltd and another[2009]\n                    3 SLR(R) 216, the Court of Appeal reiterated (at [69]) that the elements of\n                    misrepresentation and damage are very closely linked and must relate to the\n                    plaintiff’s goodwill. The Court also reiterated (at [77]) that a\n                    misrepresentation is actionable under the law of passing off only if it gives\n                    rise to confusion and added that it is open to the court to infer a likelihood\n                    of confusion from the surrounding facts since evidence of actual confusion is\n                    not a requirement for an action for passing off to succeed.48     In so far as the allegation of passing off\n                    relates only to the use of “???” or “Lau\n                    Dai Hua” by Arthur, it has no leg to stand on as I have found that TCS\n                    had consented to the use of this name by Arthur for the latter’s pork\n                    noodles business. In any case, for reasons stated earlier, “Hill Street\n                    Tai Hwa Pork Noodle” is not similar to “Lau Dai\n                    Hua”.49     TCS had another string in his bow with respect\n                    to passing off. He complained that on 5 November 2008 and 12 November\n                    2008, Arthur placed advertisements in two Chinese newspapers,Lianhe ZaobaoandLianhe Wanbaorespectively, in which he related the history of VivoCity in a manner that\n                    suggested a link between his business and VivoCity 2. Furthermore, in the\n                    5 November 2008 advertisement (“theLianhe\n                        Zaobaoadvertisement”), Arthur reproduced the culinary\n                    awards garnered by TCS.50     Arthur claimed that his historical account of\n                    his business in both the said advertisements was intended to link his stall to\n                    his grandfather’s pork noodles business at Hill Street and not to\n                    TCS’s business. Regardless of whether this is true, TCS’s culinary\n                    awards were included in theLianhe Zaobaoadvertisement. Read as a whole, that advertisement linked VivoCity 2 to\n                    TCS’s business.51     Arthur had obviously made a mistake in using\n                    the wrong uncle’s culinary awards in the said advertisement. While his\n                    other uncle, TCC, who has also won many culinary awards, testified that he would\n                    have allowed Arthur to make use of his awards to advertise the latter’s\n                    pork noodles business, TCS objected to the use by Arthur of his culinary awards.\n                    Arthur claimed that he had TCS’s “general consent” to use\n                    the latter’s culinary awards to advertise his business at VivoCity 2\n                    because the latter’s children had no interest in the pork noodles\n                    business. It may be recalled that the culinary awards had been handed over to\n                    Arthur for the purpose of promoting the failed VivoCity 1 business in 2006 and\n                    that Arthur had scanned the said awards for use in relation to that failed\n                    business. Arthur stated in his AEIC at paras 69, 71, 73, 74 and 81 as\n                    follows:69At the same time\n                            when passing me the original certificates, my uncle did not see the\n                            point about keeping them as he said that“die already also cannot bring along”71He was of the opinion that his sons (being\n                            disinterested in his noodle business) could not care less about the\n                            certificates. He wanted me to have them because he knew I treasured\n                            them.73…. He told me to put them to good\n                            use.74He said that if they were used, at least these\n                            certificates and awards could keep him alive in the memory of the\n                            general public.81I understood from this discussion with my uncle\n                            that I may use the certificates to develop the family’s pork\n                            noodle business so that it does not die out after him.[emphasis added]52     I do not accept that TCS had agreed to allow\n                    Arthur to make use his culinary awards to promote VivoCity 2. As such, I find\n                    that Arthur had passed off his pork noodles as TCS’s pork noodles by\n                    including the latter’s culinary awards in theLianhe\n                        Zaobaoadvertisement and that there is a likelihood of confusion\n                    as a result of this.53     TCS asserted that there had been a dilution of\n                    his goodwill as a result of the advertisement and he made a bald assertion that\n                    some customers who had tasted Arthur’s pork noodles found that it was\n                    inferior to his pork noodles. While I accept that there is a likelihood of some\n                    damage to TCS’s goodwill as a result of the misrepresentation in theLianhe Zaobaoadvertisement, quantification of\n                    his loss is not easy as he has only one pork noodles stall with a limited\n                    seating capacity and he had conceded that his profits had not been affected by\n                    the opening of VivoCity 2. While damage to goodwill is a different matter, TCS\n                    did not furnish any credible evidence on the damage to his goodwill. In fact, he\n                    conceded that he did not know how to calculate his loss in goodwill and that he\n                    left this to the court. There being no evidence of the loss suffered or likely\n                    to be suffered, I award TCS nominal damages of $1,000 for loss of goodwill\n                    arising from theLianhe Zaobaoadvertisement.54     TCS is also entitled to an order restraining\n                    Arthur from using his culinary awards without his authority and from attempting\n                    to connect his business with TCS’s business. Furthermore, Arthur is\n                    required to return to TCS all copies, including digital copies, of the\n                    latter’s culinary awards that are still in his possession.The Counterclaim55     As for Arthur’s counterclaim, he pleaded\n                    in his Defence and Counterclaim as follows at [20]:The Defendant …. counterclaims for:(a)An order that the Plaintiff has made a groundless\n                            threat of infringement proceedings;(b)The appropriate relief as provided for under\n                            section 35(2) of the Trade Marks Act …;56     Section 35(2) of the Act provides as\n                    follows:The relief which may be applied for is any of the following:(a)a declaration that the threats are\n                            unjustifiable;(b)an injunction against the continuance of the\n                            threats;(c)damages in respect of any loss he has sustained by\n                            the threats.57     Arthur made it quite clear during the trial\n                    that he did not plead in his counterclaim that he had suffered any loss. When he\n                    cross-examined TCS’s son, Kang, he put his case to the latter as\n                    follows:QI put to you thatI did not\n                                … claim that I made any loss in my\n                            counterclaim.AYes.[emphasis added]58     Arthur altered his position in his closing\n                    submissions by asserting that he was entitled to compensation for preparing for\n                    the trial and learning the law on trade marks and passing off. He also claimed\n                    that as he was listed as a defendant in the present action in bank records, he\n                    could not get a bank loan to buy a new house after he sold his HDB flat last\n                    year. He added that had he obtained a bank loan to buy a property last year, he\n                    would have made a gain in the property market of around $461,538.46 by the end\n                    of 2009. He also sought compensation for his failure to obtain bank loans to\n                    expand his business because he was a defendant in the present\n                action.59     Evidently, Arthur cannot expect the court to\n                    award him damages for the time spent in defending himself in the present action.\n                    In any case, TCS succeeded in establishing that Arthur had tried to pass off his\n                    pork noodles in theLianhe Zaobaoadvertisement on\n                    5 November 2008.60     As for Arthur’s claim in relation to his\n                    failure to make a gain in the property market or for his failure to obtain bank\n                    loans to expand his business, Arthur furnished no evidence of his alleged\n                    losses. More importantly, as these are really fanciful, they need not be\n                    considered any further.61     Arthur’s counterclaim is thus\n                    dismissed.Costs62     I will hear the parties on\n                costs.",
        "Whether Arthur had infringed the marks if there had been no\n                consent": "21     Although I have ruled that TCS had consented\n                    to the use by Arthur of “???”, I will, for the\n                    sake of completeness consider the position as to whether Arthur had infringed\n                    the marks if TCS had not given his consent. 22     What must be proven to establish that a trade\n                    mark has been infringed depends to some extent on whether the registered mark\n                    and the defendant’s mark or sign are identical or similar. In the present\n                    case, TCS did not assert that Arthur’s sign is identical to his own marks.\n                    Instead, he claimed that Arthur’s sign is similar to his marks and sought\n                    to rely on s 27(2)(b) and s 27(3) of the\n                    Act.",
        "Claim under s 27(2)(b) of the\n                Act": "23     Section 27(2)(b) of the Act provides as follows: 27(2) A person infringes a registered trade mark if,\n                            without the consent of the proprietor of the trade mark, he uses in the\n                            course of trade a sign where because — …. (b)    the sign is similar to the trade mark and is used\n                            in relation to goods or services identical with or similar to those for\n                            which the trade mark is registered, there exists a likelihood of confusion on the part of the public. 24     In his Statement of Claim, TCS pleaded in\n                    para 3: Subsequent to the date of registration, the Defendant has infringed the\n                        Registered Trade Marks by the use in the course of trade of a sign where,\n                        because the sign is similar to the Registered Trade Marks and is used in\n                        relation to goods similar to those for which the Registered Trade Marks are\n                        registered, there exists a likelihood of confusion. 25     Arthur pleaded at para 2 of his Defence\n                    that para 3 of the Statement of Claim was denied and that TCS was put to\n                    strict proof of the contents therein. 26     InThe Polo/Lauren Co LP v\n                        Shop in Department Store Pte Ltd[2006] 2 SLR(R) 690\n                        (“Polo/Lauren”), the Court of\n                    Appeal adopted the test outlined inBritish Sugar plc v James\n                        Robertson & Sons Ltd[1996] RPC 281 (\"theBritish Sugartest\") for determining whether or not\n                    there has been an infringement under s 27(2)(b) of the Act. Applying theBritish\n                        Sugartest, section 27(2)(b)\n                    will be infringed in the present case if: (i)Arthur’s sign is similar to the\n                            marks; (ii)Arthur’s sign and the marks are used in\n                            relation to identical or similar goods or services; and (iii)on account of the presence of the first two\n                            conditions, there exists a likelihood of confusion on the part of the\n                            public. 27     The tests for similarity of marks are trite.\n                    The registered mark and the allegedly infringing mark or sign are compared for\n                    visual, aural and conceptual similarities. Whether or not there is similarity is\n                    essentially a question of fact. 28     TCS’s two registered marks arecompositemarks with Chinese characters, English words\n                    and graphic depictions. TCS’s marks are as follows:  29     The components of TCS’s composite marks\n                    are the following: (i)10 Chinese characters,\n                                “???” and\n                                “???????”. These two Chinese\n                            phrases refer to “Suspension Bridge Head” and “Tai\n                            Hwa Pork Noodle” respectively;(ii)the English words “Hill Street Tai Hwa\n                            Pork Noodle”;(iii)a graphic depiction of a suspension bridge;\n                            and(iv)a graphic depiction of a bowl of noodles with a\n                            pair of chopsticks.30     Arthur’s signboard, which contains\n                    graphic depictions as well as Chinese, Japanese and Korean characters but no\n                    English words, is as follows:31     The components of Arthur’s signboard are\n                    as follows:(i)3 Chinese characters, namely\n                                “???”; which are pronounced as\n                            “Lau Dai Hua”;(ii)Japanese and Korean characters not found in the\n                            marks; and(iii)a graphic depiction of a mythical creature\n                            called “pi xiu”, which resembles a winged lion, on both\n                            sides of the Chinese characters.32     For the purpose of determining whether a mark\n                    and an allegedly infringing mark or sign are similar, one must take into account\n                    the imperfect recollection of a mark by a consumer: see Nautical Concept Pte Ltd\n                    v Jeffery Mark Richard [2007] 1 SLR(R) 1071 at [30]. The average consumer\n                    usually has no opportunity to make a direct comparison between the marks in\n                    question and he must rely on the “imperfect picture of them that he has\n                    kept in his mind”: seeLloyd Schuhfabrik Meyer v\n                        Klijsen Handel BV, Case C-342/97 [1999] 2 CMLR 1343, 1358-9\n                        (“Lloyd Schuhfabrik”).\n                    Furthermore, the European Court of Justice has stressed that for the purpose of\n                    determining whether marks that are being compared are similar, it is theoverall impressioncreated by them in the\n                    light of their distinctive and dominant components that matters: seeSabel BV v Puma AG, Rudolf Dassler Sport, Case C-251/95\n                    [1997] ECR 1-6191 (“Sabel”) andLloyd Schuhfabrik. This approach was recently\n                    adopted by Tay Yong Kwang J inFestina Lotus SA v Romanson Co\n                        LtdSGHC [2010] 200. In the case of complex marks, it is also\n                    noteworthy that inMatratzen Concord GmbH v Office for\n                        Harmonisation in the Internal Market (OHIM) (Trademarks and\n                        Designs)(“Matratzen”) Case T-6/01 [2002] ECR II- 4335, the Court\n                    of First Instance, while adopting the approach inSabelandLloyd Schuhfabrik, added\n                    at [33] to [34] as follows:33.Consequently, it must be held thata complex trade mark cannot be regarded as being similar to\n                                another trade mark which is identical or similar to one of the\n                                components of the complex mark, unless that component forms the\n                                dominant element within the overall impression created by the\n                                complex mark. That is the case where that component is\n                            likely to dominate, by itself, the image of that mark which the relevant\n                            public keeps in mind, with the result that all the other components of\n                            the mark are negligible within the overall impression created by\n                            it.34.It should be made clear thatthat approach does not amount to taking into consideration only one\n                                component of a complex trade mark and comparing it with another\n                                mark. On the contrary, such a comparison must be made by examining\n                                the marks in question, each considered as a whole.\n                            However, that does not mean that the overall impression created in the\n                            mind of the relevant public by a complex trade mark may not, in certain\n                            circumstances, be dominated by one or more of its\n                        components.[emphasis added]33     The approach adopted inMatratzenin relation to the comparison of a composite mark with\n                    another mark or sign was reiterated inMedion AG v Thomson\n                        Multimedia Sales Germany & Austria GmbHCase C-120/04 [2003]\n                    ECR I-8551. It follows that one cannot, without more, compare a single\n                    component of the marks with one part of Arthur’s sign. If TCS’s\n                    composite marks are viewed as a whole and on the basis of their overall\n                    impression in the light of their distinctive and dominant components, the\n                    differences between them and Arthur’s sign are so obvious that they cannot\n                    be considered visually similar by a consumer with an imperfect recollection of\n                    the marks. After all, TCS’s marks have Chinese characters and English\n                    words whereas Arthur’s sign, which has no English words, has Chinese,\n                    Japanese and Korean characters. Furthermore, any overall impression of\n                    TCS’s marks must take into account the prominently placed graphic\n                    depictions of a suspension bridge and bowl of noodles with chopsticks, which are\n                    absent from Arthur’s sign, which has a graphic depiction of the mythical\n                    pi xiu. I thus find that there is no visual similarity between the marks and\n                    Arthur’s sign.34     As for the question of aural similarity,\n                    TCS’s complaint was summed up in his AEIC at para 11(iii) as\n                    follows:Further, the mark “Lau Tai Hua” … has considerably\n                        oral and visual similarity to “Hill Street Tai Hwa Pork\n                        Noodle” which I say, is all obvious to the Defendant.35     Apart from the fact that TCS did not prove\n                    that the words “Hill Street Tai Hwa Pork Noodle” or its\n                    translation in Chinese are the dominant component of his composite marks,\n                    “Lau Dai Hua” is not aurally similar to “Hill Street Tai\n                    Hwa Pork Noodle”. It has often been said that when comparing marks for\n                    aural similarity, “tribunals have tended to carry out a quantitative\n                    assessment: do the two signs have more syllables in common than not?”:\n                    see Bently & Sherman, Intellectual Property Law (Oxford University Press,\n                        3rded, 2009) at 865. In the present case,\n                    “Lau Dai Hua” has only 3 syllables while “Hill Street Tai\n                    Hwa Pork Noodles” has 6 syllables and the first two syllables in the\n                    marks “Hill Street” do not sound like “Lau” in\n                    Arthur’s sign. Furthermore, the two similar sounding words “Tai\n                    Hwa” in the marks and “Dai Hua” in Arthur’s sign,\n                    which are written in Chinese as “??”, are\n                    commonly used in the food industry and other businesses. For instance,\n                        “??” is extensively used in the food\n                    industry by Tai Hua Food Industries Pte Ltd (“Tai Hua Food”), a\n                    well known manufacturer of several types of sauces sold in Singapore in\n                    supermarkets and provision shops. Tai Hua Food is the registered proprietor of a\n                    large number of trade marks with the Chinese characters\n                        “??” and the English words “Tai\n                    Hua” in classes 29 and 30. In fact, in regard to TM No T8604338G, which\n                    had been registered by Tai Hua Food in 1986, long before the marks were\n                    registered in 2004, the only characters and words appearing in the mark are\n                        “??” and “Tai\n                Hua”.36     The Chinese characters\n                        “??” are also used by other types of\n                    businesses. For instance, in the banking industry, the Chinese translation of\n                    “United Overseas Bank”, a major local bank, includes the\n                    characters “??”. I thus find that there is no\n                    aural similarity between the marks and Arthur’s sign merely because they\n                    both have two commonly used Chinese characters.37     As for conceptual similarity, no attempt was\n                    made to prove that the marks and Arthur’s sign are conceptually similar\n                    and in my view, they are not.38     InPolo/Lauren,\n                    the Court of Appeal made it clear (at [8]) that if a registered mark and the\n                    allegedly infringing sign are not similar, there is no “need to go into\n                    the third question of determining whether there exists a likelihood of\n                    confusion”. In any case, TCS did not submit any credible evidence of the\n                    likelihood of confusion and if it had been necessary to determine the issue, I\n                    would, after considering the marks and Arthur’s sign, have found that\n                    there was no likelihood of confusion. I thus dismiss TCS’s claim against\n                    Arthur under s 27(2) of the Act for infringement of his\n                marks.Section 27(3) of the Act39     As has been mentioned, TCS also relied on\n                    s 27(3) of the Act, which provides as follows:A person infringes a registered trade mark which is well known in\n                        Singapore if —(a)without the consent of the proprietor of the trade\n                            mark, he uses in the course of trade a sign which is identical with or\n                            similar to the trade mark in relation to goods or services which are not\n                            similar to those for which the trade mark is registered;(b)the use of the trade mark in relation to those\n                            goods or services would indicate a connection between those goods or\n                            services and the proprietor;(c)there exists a likelihood of confusion on the part\n                            of the public because of such use; and(d)the interests of the proprietor are likely to be\n                            damaged by such use.40     As I have found that TCS’s marks and\n                    Arthur’s sign are not similar, TCS cannot rely on s 27(3) of the Act\n                    to assert his claim against Arthur with respect to the signboard for VivoCity 2.\n                    As has been mentioned, there was, in any case, no evidence of a likelihood of\n                    confusion because of the usage of Arthur’s sign other than TCS’s\n                    uncorroborated and self-serving assertion to that effect.Passing Off41     Depending on the circumstances, a plaintiff\n                    who fails to prove an infringement of his registered trade mark may yet succeed\n                    in an action for passing off. The authors ofKerly’s\n                        Law of Trade Marks and Trade Names, Sweet & Maxwell,\n                        14thed, 2005, stated at\n                    para 15-033:A claimant may fail to make out a case of infringement of a trade mark for\n                        various reasons and may yet show that by imitating the mark claimed as a\n                        trade mark or otherwise, the defendant has done what is calculated to pass\n                        off his goods as those of the claimant. A claim in “passing\n                        off” has generally been added as a second string to actions for\n                        infringement, and has on occasion succeeded where the claim for infringement\n                        has failed.42     InReckitt & Colman\n                        Products Ltd v Borden Inc and others[1990] 1WLR 491 at 499\n                        (“Reckitt”), Lord Oliver of\n                    Aylmerton explained the meaning of “passing off” as\n                    follows:The law of passing off can be summarised in one short general proposition\n                        – no man may pass off his goods as those of another. More\n                        specifically, it may be expressed in terms of the elements which the\n                        plaintiff in such an action has to prove in order to succeed. These are\n                        three in number. First, he must establish a goodwill or reputation attached\n                        to the goods or services which he supplies in the mind of the purchasing\n                        public by association with the identifying “get-up”….\n                        Secondly, he must demonstrate a misrepresentation by the defendant to the\n                        public (whether or not intentional) leading or likely to lead the public to\n                        believe that goods or services offered by him are the goods or services of\n                        the plaintiff…. Thirdly, he must demonstrate that he suffers or, in aquia timetaction, that he is likely to\n                        suffer damage by reason of the erroneous belief engendered by the\n                        defendant’s misrepresentation that the source of the defendant’s\n                        goods or services is the same as the source of those offered by the\n                        plaintiff.43     TCS alleged that Arthur had been passing off\n                    his pork noodles as those sold by “Hill Street Tai Hwa Pork\n                    Noodle”. As proof of this, he pointed to the use of the Chinese\n                    characters “???” in Arthur’s sign and two\n                    advertisements by Arthur in theLianhe ZaobaoandLianhe Wanbaoin November 2008.44     For TCS’s passing off action to succeed,\n                    the following must be established:(i)goodwill or reputation was attached to his pork\n                            noodles business at Crawford Lane;(ii)Arthur had misrepresented that VivoCity 2 is\n                            connected with TCS’s business; and(iii)TCS had suffered or is likely to suffer damage\n                            by reason of the erroneous belief engendered by Arthur’s\n                            misrepresentation that the latter’s pork noodles is the same as\n                            his pork noodles.45     In regard to goodwill, what is relevant in a\n                    passing off action is the goodwill between a trader and his customers. InInland Revenue Commissioners v Muller & Co’s\n                        Margarine Ltd[1901] AC 217, Lord Macnaghten explained at\n                    223-224:What is goodwill? It is a thing very easy to describe, very difficult to\n                        define. It is the benefit and advantage of the good name, reputation, and\n                        connection of a business. It is the attractive force which brings in custom.\n                        It is the one thing that distinguishes an old-established business from a\n                        new business at its first start. The goodwill of a business must emanate\n                        from a particular centre or source. However widely extended or diffused its\n                        influence may be, goodwill is worth nothing unless it has power of\n                        attraction sufficient to bring customers home to the source from which it\n                        emanates.46     In his Defence and Counterclaim, Arthur\n                    admitted at [13] that TCS’s pork noodles business is “well\n                    known”. While reputation does not necessary mean that there is goodwill,\n                    I accept that there is some goodwill attached to TCS’s pork noodles\n                    business, and especially so since he has won quite a number of culinary\n                    awards.47     As for the requirement of misrepresentation,\n                    inReckitt, Lord Oliver explained at\n                    p 499 that the plaintiff “must demonstrate a misrepresentation by\n                    the defendant to the public (whether or not intentional) leading or likely to\n                    lead the public to believe that goods or services offered by him are the goods\n                    or service of the plaintiff”. This statement was endorsed inCDL Hotels International Ltd v Pontiac Marina Pte Ltd[1998] 1 SLR(R) 975 at [44] by the Court of Appeal. InNovelty Pte Ltd v Amanresort Ltd and another[2009]\n                    3 SLR(R) 216, the Court of Appeal reiterated (at [69]) that the elements of\n                    misrepresentation and damage are very closely linked and must relate to the\n                    plaintiff’s goodwill. The Court also reiterated (at [77]) that a\n                    misrepresentation is actionable under the law of passing off only if it gives\n                    rise to confusion and added that it is open to the court to infer a likelihood\n                    of confusion from the surrounding facts since evidence of actual confusion is\n                    not a requirement for an action for passing off to succeed.48     In so far as the allegation of passing off\n                    relates only to the use of “???” or “Lau\n                    Dai Hua” by Arthur, it has no leg to stand on as I have found that TCS\n                    had consented to the use of this name by Arthur for the latter’s pork\n                    noodles business. In any case, for reasons stated earlier, “Hill Street\n                    Tai Hwa Pork Noodle” is not similar to “Lau Dai\n                    Hua”.49     TCS had another string in his bow with respect\n                    to passing off. He complained that on 5 November 2008 and 12 November\n                    2008, Arthur placed advertisements in two Chinese newspapers,Lianhe ZaobaoandLianhe Wanbaorespectively, in which he related the history of VivoCity in a manner that\n                    suggested a link between his business and VivoCity 2. Furthermore, in the\n                    5 November 2008 advertisement (“theLianhe\n                        Zaobaoadvertisement”), Arthur reproduced the culinary\n                    awards garnered by TCS.50     Arthur claimed that his historical account of\n                    his business in both the said advertisements was intended to link his stall to\n                    his grandfather’s pork noodles business at Hill Street and not to\n                    TCS’s business. Regardless of whether this is true, TCS’s culinary\n                    awards were included in theLianhe Zaobaoadvertisement. Read as a whole, that advertisement linked VivoCity 2 to\n                    TCS’s business.51     Arthur had obviously made a mistake in using\n                    the wrong uncle’s culinary awards in the said advertisement. While his\n                    other uncle, TCC, who has also won many culinary awards, testified that he would\n                    have allowed Arthur to make use of his awards to advertise the latter’s\n                    pork noodles business, TCS objected to the use by Arthur of his culinary awards.\n                    Arthur claimed that he had TCS’s “general consent” to use\n                    the latter’s culinary awards to advertise his business at VivoCity 2\n                    because the latter’s children had no interest in the pork noodles\n                    business. It may be recalled that the culinary awards had been handed over to\n                    Arthur for the purpose of promoting the failed VivoCity 1 business in 2006 and\n                    that Arthur had scanned the said awards for use in relation to that failed\n                    business. Arthur stated in his AEIC at paras 69, 71, 73, 74 and 81 as\n                    follows:69At the same time\n                            when passing me the original certificates, my uncle did not see the\n                            point about keeping them as he said that“die already also cannot bring along”71He was of the opinion that his sons (being\n                            disinterested in his noodle business) could not care less about the\n                            certificates. He wanted me to have them because he knew I treasured\n                            them.73…. He told me to put them to good\n                            use.74He said that if they were used, at least these\n                            certificates and awards could keep him alive in the memory of the\n                            general public.81I understood from this discussion with my uncle\n                            that I may use the certificates to develop the family’s pork\n                            noodle business so that it does not die out after him.[emphasis added]52     I do not accept that TCS had agreed to allow\n                    Arthur to make use his culinary awards to promote VivoCity 2. As such, I find\n                    that Arthur had passed off his pork noodles as TCS’s pork noodles by\n                    including the latter’s culinary awards in theLianhe\n                        Zaobaoadvertisement and that there is a likelihood of confusion\n                    as a result of this.53     TCS asserted that there had been a dilution of\n                    his goodwill as a result of the advertisement and he made a bald assertion that\n                    some customers who had tasted Arthur’s pork noodles found that it was\n                    inferior to his pork noodles. While I accept that there is a likelihood of some\n                    damage to TCS’s goodwill as a result of the misrepresentation in theLianhe Zaobaoadvertisement, quantification of\n                    his loss is not easy as he has only one pork noodles stall with a limited\n                    seating capacity and he had conceded that his profits had not been affected by\n                    the opening of VivoCity 2. While damage to goodwill is a different matter, TCS\n                    did not furnish any credible evidence on the damage to his goodwill. In fact, he\n                    conceded that he did not know how to calculate his loss in goodwill and that he\n                    left this to the court. There being no evidence of the loss suffered or likely\n                    to be suffered, I award TCS nominal damages of $1,000 for loss of goodwill\n                    arising from theLianhe Zaobaoadvertisement.54     TCS is also entitled to an order restraining\n                    Arthur from using his culinary awards without his authority and from attempting\n                    to connect his business with TCS’s business. Furthermore, Arthur is\n                    required to return to TCS all copies, including digital copies, of the\n                    latter’s culinary awards that are still in his possession.The Counterclaim55     As for Arthur’s counterclaim, he pleaded\n                    in his Defence and Counterclaim as follows at [20]:The Defendant …. counterclaims for:(a)An order that the Plaintiff has made a groundless\n                            threat of infringement proceedings;(b)The appropriate relief as provided for under\n                            section 35(2) of the Trade Marks Act …;56     Section 35(2) of the Act provides as\n                    follows:The relief which may be applied for is any of the following:(a)a declaration that the threats are\n                            unjustifiable;(b)an injunction against the continuance of the\n                            threats;(c)damages in respect of any loss he has sustained by\n                            the threats.57     Arthur made it quite clear during the trial\n                    that he did not plead in his counterclaim that he had suffered any loss. When he\n                    cross-examined TCS’s son, Kang, he put his case to the latter as\n                    follows:QI put to you thatI did not\n                                … claim that I made any loss in my\n                            counterclaim.AYes.[emphasis added]58     Arthur altered his position in his closing\n                    submissions by asserting that he was entitled to compensation for preparing for\n                    the trial and learning the law on trade marks and passing off. He also claimed\n                    that as he was listed as a defendant in the present action in bank records, he\n                    could not get a bank loan to buy a new house after he sold his HDB flat last\n                    year. He added that had he obtained a bank loan to buy a property last year, he\n                    would have made a gain in the property market of around $461,538.46 by the end\n                    of 2009. He also sought compensation for his failure to obtain bank loans to\n                    expand his business because he was a defendant in the present\n                action.59     Evidently, Arthur cannot expect the court to\n                    award him damages for the time spent in defending himself in the present action.\n                    In any case, TCS succeeded in establishing that Arthur had tried to pass off his\n                    pork noodles in theLianhe Zaobaoadvertisement on\n                    5 November 2008.60     As for Arthur’s claim in relation to his\n                    failure to make a gain in the property market or for his failure to obtain bank\n                    loans to expand his business, Arthur furnished no evidence of his alleged\n                    losses. More importantly, as these are really fanciful, they need not be\n                    considered any further.61     Arthur’s counterclaim is thus\n                    dismissed.Costs62     I will hear the parties on\n                costs.",
        "Section 27(3) of the Act": "39     As has been mentioned, TCS also relied on\n                    s 27(3) of the Act, which provides as follows: A person infringes a registered trade mark which is well known in\n                        Singapore if — (a)without the consent of the proprietor of the trade\n                            mark, he uses in the course of trade a sign which is identical with or\n                            similar to the trade mark in relation to goods or services which are not\n                            similar to those for which the trade mark is registered; (b)the use of the trade mark in relation to those\n                            goods or services would indicate a connection between those goods or\n                            services and the proprietor; (c)there exists a likelihood of confusion on the part\n                            of the public because of such use; and (d)the interests of the proprietor are likely to be\n                            damaged by such use. 40     As I have found that TCS’s marks and\n                    Arthur’s sign are not similar, TCS cannot rely on s 27(3) of the Act\n                    to assert his claim against Arthur with respect to the signboard for VivoCity 2.\n                    As has been mentioned, there was, in any case, no evidence of a likelihood of\n                    confusion because of the usage of Arthur’s sign other than TCS’s\n                    uncorroborated and self-serving assertion to that effect.",
        "Passing Off": "41     Depending on the circumstances, a plaintiff\n                    who fails to prove an infringement of his registered trade mark may yet succeed\n                    in an action for passing off. The authors ofKerly’s\n                        Law of Trade Marks and Trade Names, Sweet & Maxwell,\n                        14thed, 2005, stated at\n                    para 15-033: A claimant may fail to make out a case of infringement of a trade mark for\n                        various reasons and may yet show that by imitating the mark claimed as a\n                        trade mark or otherwise, the defendant has done what is calculated to pass\n                        off his goods as those of the claimant. A claim in “passing\n                        off” has generally been added as a second string to actions for\n                        infringement, and has on occasion succeeded where the claim for infringement\n                        has failed. 42     InReckitt & Colman\n                        Products Ltd v Borden Inc and others[1990] 1WLR 491 at 499\n                        (“Reckitt”), Lord Oliver of\n                    Aylmerton explained the meaning of “passing off” as\n                    follows: The law of passing off can be summarised in one short general proposition\n                        – no man may pass off his goods as those of another. More\n                        specifically, it may be expressed in terms of the elements which the\n                        plaintiff in such an action has to prove in order to succeed. These are\n                        three in number. First, he must establish a goodwill or reputation attached\n                        to the goods or services which he supplies in the mind of the purchasing\n                        public by association with the identifying “get-up”….\n                        Secondly, he must demonstrate a misrepresentation by the defendant to the\n                        public (whether or not intentional) leading or likely to lead the public to\n                        believe that goods or services offered by him are the goods or services of\n                        the plaintiff…. Thirdly, he must demonstrate that he suffers or, in aquia timetaction, that he is likely to\n                        suffer damage by reason of the erroneous belief engendered by the\n                        defendant’s misrepresentation that the source of the defendant’s\n                        goods or services is the same as the source of those offered by the\n                        plaintiff. 43     TCS alleged that Arthur had been passing off\n                    his pork noodles as those sold by “Hill Street Tai Hwa Pork\n                    Noodle”. As proof of this, he pointed to the use of the Chinese\n                    characters “???” in Arthur’s sign and two\n                    advertisements by Arthur in theLianhe ZaobaoandLianhe Wanbaoin November 2008. 44     For TCS’s passing off action to succeed,\n                    the following must be established: (i)goodwill or reputation was attached to his pork\n                            noodles business at Crawford Lane;(ii)Arthur had misrepresented that VivoCity 2 is\n                            connected with TCS’s business; and(iii)TCS had suffered or is likely to suffer damage\n                            by reason of the erroneous belief engendered by Arthur’s\n                            misrepresentation that the latter’s pork noodles is the same as\n                            his pork noodles.45     In regard to goodwill, what is relevant in a\n                    passing off action is the goodwill between a trader and his customers. InInland Revenue Commissioners v Muller & Co’s\n                        Margarine Ltd[1901] AC 217, Lord Macnaghten explained at\n                    223-224:What is goodwill? It is a thing very easy to describe, very difficult to\n                        define. It is the benefit and advantage of the good name, reputation, and\n                        connection of a business. It is the attractive force which brings in custom.\n                        It is the one thing that distinguishes an old-established business from a\n                        new business at its first start. The goodwill of a business must emanate\n                        from a particular centre or source. However widely extended or diffused its\n                        influence may be, goodwill is worth nothing unless it has power of\n                        attraction sufficient to bring customers home to the source from which it\n                        emanates.46     In his Defence and Counterclaim, Arthur\n                    admitted at [13] that TCS’s pork noodles business is “well\n                    known”. While reputation does not necessary mean that there is goodwill,\n                    I accept that there is some goodwill attached to TCS’s pork noodles\n                    business, and especially so since he has won quite a number of culinary\n                    awards.47     As for the requirement of misrepresentation,\n                    inReckitt, Lord Oliver explained at\n                    p 499 that the plaintiff “must demonstrate a misrepresentation by\n                    the defendant to the public (whether or not intentional) leading or likely to\n                    lead the public to believe that goods or services offered by him are the goods\n                    or service of the plaintiff”. This statement was endorsed inCDL Hotels International Ltd v Pontiac Marina Pte Ltd[1998] 1 SLR(R) 975 at [44] by the Court of Appeal. InNovelty Pte Ltd v Amanresort Ltd and another[2009]\n                    3 SLR(R) 216, the Court of Appeal reiterated (at [69]) that the elements of\n                    misrepresentation and damage are very closely linked and must relate to the\n                    plaintiff’s goodwill. The Court also reiterated (at [77]) that a\n                    misrepresentation is actionable under the law of passing off only if it gives\n                    rise to confusion and added that it is open to the court to infer a likelihood\n                    of confusion from the surrounding facts since evidence of actual confusion is\n                    not a requirement for an action for passing off to succeed.48     In so far as the allegation of passing off\n                    relates only to the use of “???” or “Lau\n                    Dai Hua” by Arthur, it has no leg to stand on as I have found that TCS\n                    had consented to the use of this name by Arthur for the latter’s pork\n                    noodles business. In any case, for reasons stated earlier, “Hill Street\n                    Tai Hwa Pork Noodle” is not similar to “Lau Dai\n                    Hua”.49     TCS had another string in his bow with respect\n                    to passing off. He complained that on 5 November 2008 and 12 November\n                    2008, Arthur placed advertisements in two Chinese newspapers,Lianhe ZaobaoandLianhe Wanbaorespectively, in which he related the history of VivoCity in a manner that\n                    suggested a link between his business and VivoCity 2. Furthermore, in the\n                    5 November 2008 advertisement (“theLianhe\n                        Zaobaoadvertisement”), Arthur reproduced the culinary\n                    awards garnered by TCS.50     Arthur claimed that his historical account of\n                    his business in both the said advertisements was intended to link his stall to\n                    his grandfather’s pork noodles business at Hill Street and not to\n                    TCS’s business. Regardless of whether this is true, TCS’s culinary\n                    awards were included in theLianhe Zaobaoadvertisement. Read as a whole, that advertisement linked VivoCity 2 to\n                    TCS’s business.51     Arthur had obviously made a mistake in using\n                    the wrong uncle’s culinary awards in the said advertisement. While his\n                    other uncle, TCC, who has also won many culinary awards, testified that he would\n                    have allowed Arthur to make use of his awards to advertise the latter’s\n                    pork noodles business, TCS objected to the use by Arthur of his culinary awards.\n                    Arthur claimed that he had TCS’s “general consent” to use\n                    the latter’s culinary awards to advertise his business at VivoCity 2\n                    because the latter’s children had no interest in the pork noodles\n                    business. It may be recalled that the culinary awards had been handed over to\n                    Arthur for the purpose of promoting the failed VivoCity 1 business in 2006 and\n                    that Arthur had scanned the said awards for use in relation to that failed\n                    business. Arthur stated in his AEIC at paras 69, 71, 73, 74 and 81 as\n                    follows:69At the same time\n                            when passing me the original certificates, my uncle did not see the\n                            point about keeping them as he said that“die already also cannot bring along”71He was of the opinion that his sons (being\n                            disinterested in his noodle business) could not care less about the\n                            certificates. He wanted me to have them because he knew I treasured\n                            them.73…. He told me to put them to good\n                            use.74He said that if they were used, at least these\n                            certificates and awards could keep him alive in the memory of the\n                            general public.81I understood from this discussion with my uncle\n                            that I may use the certificates to develop the family’s pork\n                            noodle business so that it does not die out after him.[emphasis added]52     I do not accept that TCS had agreed to allow\n                    Arthur to make use his culinary awards to promote VivoCity 2. As such, I find\n                    that Arthur had passed off his pork noodles as TCS’s pork noodles by\n                    including the latter’s culinary awards in theLianhe\n                        Zaobaoadvertisement and that there is a likelihood of confusion\n                    as a result of this.53     TCS asserted that there had been a dilution of\n                    his goodwill as a result of the advertisement and he made a bald assertion that\n                    some customers who had tasted Arthur’s pork noodles found that it was\n                    inferior to his pork noodles. While I accept that there is a likelihood of some\n                    damage to TCS’s goodwill as a result of the misrepresentation in theLianhe Zaobaoadvertisement, quantification of\n                    his loss is not easy as he has only one pork noodles stall with a limited\n                    seating capacity and he had conceded that his profits had not been affected by\n                    the opening of VivoCity 2. While damage to goodwill is a different matter, TCS\n                    did not furnish any credible evidence on the damage to his goodwill. In fact, he\n                    conceded that he did not know how to calculate his loss in goodwill and that he\n                    left this to the court. There being no evidence of the loss suffered or likely\n                    to be suffered, I award TCS nominal damages of $1,000 for loss of goodwill\n                    arising from theLianhe Zaobaoadvertisement.54     TCS is also entitled to an order restraining\n                    Arthur from using his culinary awards without his authority and from attempting\n                    to connect his business with TCS’s business. Furthermore, Arthur is\n                    required to return to TCS all copies, including digital copies, of the\n                    latter’s culinary awards that are still in his possession.The Counterclaim55     As for Arthur’s counterclaim, he pleaded\n                    in his Defence and Counterclaim as follows at [20]:The Defendant …. counterclaims for:(a)An order that the Plaintiff has made a groundless\n                            threat of infringement proceedings;(b)The appropriate relief as provided for under\n                            section 35(2) of the Trade Marks Act …;56     Section 35(2) of the Act provides as\n                    follows:The relief which may be applied for is any of the following:(a)a declaration that the threats are\n                            unjustifiable;(b)an injunction against the continuance of the\n                            threats;(c)damages in respect of any loss he has sustained by\n                            the threats.57     Arthur made it quite clear during the trial\n                    that he did not plead in his counterclaim that he had suffered any loss. When he\n                    cross-examined TCS’s son, Kang, he put his case to the latter as\n                    follows:QI put to you thatI did not\n                                … claim that I made any loss in my\n                            counterclaim.AYes.[emphasis added]58     Arthur altered his position in his closing\n                    submissions by asserting that he was entitled to compensation for preparing for\n                    the trial and learning the law on trade marks and passing off. He also claimed\n                    that as he was listed as a defendant in the present action in bank records, he\n                    could not get a bank loan to buy a new house after he sold his HDB flat last\n                    year. He added that had he obtained a bank loan to buy a property last year, he\n                    would have made a gain in the property market of around $461,538.46 by the end\n                    of 2009. He also sought compensation for his failure to obtain bank loans to\n                    expand his business because he was a defendant in the present\n                action.59     Evidently, Arthur cannot expect the court to\n                    award him damages for the time spent in defending himself in the present action.\n                    In any case, TCS succeeded in establishing that Arthur had tried to pass off his\n                    pork noodles in theLianhe Zaobaoadvertisement on\n                    5 November 2008.60     As for Arthur’s claim in relation to his\n                    failure to make a gain in the property market or for his failure to obtain bank\n                    loans to expand his business, Arthur furnished no evidence of his alleged\n                    losses. More importantly, as these are really fanciful, they need not be\n                    considered any further.61     Arthur’s counterclaim is thus\n                    dismissed.Costs62     I will hear the parties on\n                costs.",
        "The Counterclaim": "55     As for Arthur’s counterclaim, he pleaded\n                    in his Defence and Counterclaim as follows at [20]: The Defendant …. counterclaims for: (a)An order that the Plaintiff has made a groundless\n                            threat of infringement proceedings; (b)The appropriate relief as provided for under\n                            section 35(2) of the Trade Marks Act …; 56     Section 35(2) of the Act provides as\n                    follows: The relief which may be applied for is any of the following: (a)a declaration that the threats are\n                            unjustifiable; (b)an injunction against the continuance of the\n                            threats; (c)damages in respect of any loss he has sustained by\n                            the threats. 57     Arthur made it quite clear during the trial\n                    that he did not plead in his counterclaim that he had suffered any loss. When he\n                    cross-examined TCS’s son, Kang, he put his case to the latter as\n                    follows: QI put to you thatI did not\n                                … claim that I made any loss in my\n                            counterclaim. AYes. [emphasis added] 58     Arthur altered his position in his closing\n                    submissions by asserting that he was entitled to compensation for preparing for\n                    the trial and learning the law on trade marks and passing off. He also claimed\n                    that as he was listed as a defendant in the present action in bank records, he\n                    could not get a bank loan to buy a new house after he sold his HDB flat last\n                    year. He added that had he obtained a bank loan to buy a property last year, he\n                    would have made a gain in the property market of around $461,538.46 by the end\n                    of 2009. He also sought compensation for his failure to obtain bank loans to\n                    expand his business because he was a defendant in the present\n                action. 59     Evidently, Arthur cannot expect the court to\n                    award him damages for the time spent in defending himself in the present action.\n                    In any case, TCS succeeded in establishing that Arthur had tried to pass off his\n                    pork noodles in theLianhe Zaobaoadvertisement on\n                    5 November 2008. 60     As for Arthur’s claim in relation to his\n                    failure to make a gain in the property market or for his failure to obtain bank\n                    loans to expand his business, Arthur furnished no evidence of his alleged\n                    losses. More importantly, as these are really fanciful, they need not be\n                    considered any further. 61     Arthur’s counterclaim is thus\n                    dismissed.",
        "Costs": "62     I will hear the parties on\n                costs."
    }
}