{
    "case_title": "Pacrim Investments Pte Ltd\n      v\n      Tan Mui Keow Claire and another",
    "ncitation": "[2010] SGHC 134",
    "coram": "Peh Aik Hin AR",
    "sections": {
        "Introduction": "1       The plaintiff, Pacrim Investments Pte Ltd\n                    (“Pacrim”), sought damages against the second defendant,\n                    Mediastream Limited (“MSL”), in respect of the latter’s\n                    failure to register the transfers of certain MSL shares submitted by Pacrim for\n                    registration in September 2003. The present application concerned a preliminary\n                    issue which would determine Pacrim’s entitlement to such\n                damages. 2       On 14 April 2010, I determined the\n                    preliminary issue in favour of MSL. Save for some editorial changes, these\n                    grounds set out essentially the same reasons given in my judgment on\n                    14 April 2010.",
        "Brief background": "3       The facts are undisputed, and a brief summary of\n                    the material facts leading up to the present application would suffice for\n                    present purposes. 4       On 29 September 2002, Pacrim received the\n                    share certificates for 70m MSL shares from one Desmond Poh\n                    (“Poh”), together with blank transfers duly signed by him, as a\n                    pledge for a brokerage fee payable by Poh to Pacrim. The brokerage fee was in\n                    respect of an acquisition transaction brokered and arranged by the latter. Poh\n                    and Pacrim agreed that the payment of the fee would be deferred by one year but\n                    no later than 22 September 2003, failing which Pacrim would be entitled to\n                    transfer the 70m shares to itself or its nominees and to sell those shares to\n                    recover its brokerage fee. Pacrim subsequently released 20m shares to Poh for\n                    him to raise funds to pay part of the brokerage fee, leaving itself with only\n                    50m shares. After the one-year restriction had expired, Pacrim submitted two\n                    transfers of 20m and 30m shares on 23 and 24 September 2003 respectively to\n                    MSL for registration. For various reasons (which are not material to the present\n                    application), MSL refused the registration. 5       MSL’s refusal led to the present\n                    proceedings commenced by Pacrim on 10 February 2004 (ie, Originating Summons No 165 of 2004\n                    (“OS”)) against the first defendant, MSL’s company\n                    secretary, and MSL (the second defendant) for the orders that MSL register the\n                    transfers of the 50m shares and for damages to be assessed. The OS was heard and\n                    dismissed by the High Court at first instance on 3 August 2004 (seePacrim Investments Pte Ltd v Tan Mui Keow Claire and\n                        another[2005] 1 SLR(R) 141). On 18 April 2004,\n                    Pacrim filed a notice of appeal against the High Court’s\n                decision. 6       While the appeal was pending, MSL was placed\n                    under judicial management on 22 April 2005. Subsequently, in 2007, a scheme\n                    of arrangement (“the Scheme”) was proposed for MSL. The purpose of\n                    the Scheme as set out in cl 2 of the Scheme was as follows:[note: 1] 2.      Purpose 2.1    The purpose of this Scheme is toresolve and satisfy Scheme Claims that Scheme Creditors may\n                                have while at same time trying to ensure the continued validity of\n                                the Company as a going concern. 2.2    The Company proposes and agrees, subject to the\n                            acceptance by the requisite majority of Scheme Creditors at the Court\n                            Meeting (or adjournment thereof), and the approval by the Court of this\n                            Scheme pursuant to Section 210 read with Section 277X of the Act, to\n                            implement this Scheme. [emphasis added] 7       Clause 1.1 of the Scheme in turn defined a\n                    “Scheme Creditor” as “any Creditor of the Company having a\n                    Scheme Claim, other than an Excluded Creditor [defined as Ferrier\n                        Hodgson]”[note: 2]and a “Scheme\n                    Claim” as:[note: 3] … the total amount of any claim for which the Company is or may be\n                        liable or indebted (whetheractual, contingently or\n                            otherwise, whether such claim arises in contract, tort,\n                        restitution or otherwise, and whether liquidated or unliquidated, or\n                        sounding or resulting in damages or equitable compensation or otherwise) to\n                        that Scheme Creditorin respect of or arising from any\n                            and all acts, omissions, agreements, transactions, dealings, matters and\n                            events whatsoever effected, occurring or otherwise taking place on or\n                            prior to the making of the Judicial Management Order on 22 April\n                            2005, which have not been paid, satisfied, extinguished,\n                        abated or otherwise diminished. [emphasis added] 8       In other words, the Scheme sought to compromise\n                    and satisfy all Scheme Claims which arose from any act or omission or any event\n                    whatsoever that occurred on or prior to the making of the judicial management\n                    order on 22 April 2005 so as to save the company from insolvency and to\n                    ensure its survival. This compromise was to be achieved by way of a combination\n                    of cash payments and debt-to-equity swaps[note: 4]. On 10 July 2007, the Scheme\n                    was approved by all the Scheme Creditors who attended and voted at the meeting\n                    convened. The Scheme was subsequently approved by the High Court on\n                    21 August 2007 pursuant to s 210 of the Companies Act (Cap 50,\n                    2006 Rev Ed) (“the Act”) and took effect on 23 August 2007\n                    when a copy of the court’s order was lodged with the Accounting and\n                    Corporate Regulatory Authority. After the successful implementation of the\n                    Scheme, MSL survived the crisis and managed to emerge from judicial management\n                    on 2 October 2007. 9       During the entire period that MSL was under\n                    judicial management (including the implementation of the Scheme), Pacrim’s\n                    appeal to the Court of Appeal was kept pending as parties sought several\n                    adjournments of the hearing. In any case, there was a stay of all proceedings\n                    following the making of the judicial management order. At one stage, leave was\n                    sought by Pacrim to continue with the appeal but this application was eventually\n                    withdrawn and Pacrim was happy to keep the appeal pending while MSL was under\n                    judicial management. As noted by Mr Low Ee Chin, Pacrim’s Chief\n                    Executive Officer, in his affidavit dated 22 February 2010, “it did\n                    not make sense to incur additional costs and expenses [in pursuing the appeal]\n                    in the event that there is no value in the shares.”[note: 5] 10     After MSL emerged from judicial management,\n                    the appeal was finally heard on 22 February 2008 and the Court of Appeal\n                    allowed Pacrim’s appeal (seePacrim Investments Pte Ltd\n                        v Tan Mui Keow Claire and another[2008] 2 SLR(R) 898\n                        (“Pacrim Investments Pte Ltd”)).\n                    Accordingly, the requisite number of MSL shares (being 5m shares, following\n                    restructuring and amalgamation of 10 shares to one as a result of the\n                        Scheme[note: 6]) was transferred to Pacrim.\n                    Pacrim sold these shares between May and December 2008 and received a net sale\n                    proceeds of approximately $214,285. According to Pacrim, if the transfer of the\n                    initial 50m shares had been registered in 2003 when they were first submitted\n                    for registration and sold, the sale proceeds would have been around the region\n                    of $1,750,000, given the then higher stock price of MSL on the Singapore Stock\n                        Exchange[note: 7]. Pacrim thus sought to\n                    recover damages from MSL for its loss suffered in the sale of the\n                shares. 11     A dispute arose between parties as to whether\n                    Pacrim was entitled to damages, given that the Court of Appeal inPacrim Investments Pte Ltdhad made no order as to\n                    damages (see [28]) and that MSL, while the appeal was pending, had undergone the\n                    Scheme. It was subsequently clarified by the Court of Appeal that Pacrim was\n                    entitled to have damages assessed. However, the Court of Appeal also pointed out\n                    that the question of whether Pacrim had the right to proceed with assessment\n                    because of the Scheme was an issue not before the court and was to be decided by\n                    the court hearing the application to assess damages. This gave rise to the\n                    present application. At the start of the hearing of this application on\n                    12 March 2010, Pacrim confirmed that it was only seeking damages from MSL\n                    and not the first defendant.",
        "The preliminary issue": "12     The preliminary issue before me was thus\n                    simply whether the Scheme had extinguished Pacrim’s claim for damages. As\n                    will be seen, the resolution of this issue turned ultimately on a question of\n                    statutory construction given the arguments raised by the parties. It will be\n                    helpful to first set out, in gist, the parties’ positions on this\n                    issue. 13     Pacrim’s case in essence was that it was\n                    not a “creditor” of MSL for purposes of the Scheme since its claim\n                    had been dismissed by the High Court and it had yet to succeed in its appeal\n                    before MSL was placed under judicial management (see[8]above). Thus, it could not in anyway be bound by the Scheme\n                    which was binding only on Scheme Creditors. Pacrim submitted that the question\n                    of whether it was a creditor is “a legal issue and is not dependent on\n                    how “Creditor”, “Scheme Claim” or “Scheme\n                    Creditor” are defined in the Scheme, but rather, on the legal definition\n                    of “creditor” within the meaning of Section 210 of the\n                    Companies Act (Cap 50)”[note: 8].\n                    Counsel for Pacrim, Ms Lisa Chong, accepted that if Pacrim were a creditor\n                    under s 210, Pacrim would naturally fall within the broad definition of\n                    “Scheme Creditor” under the Scheme and would be bound by it. She\n                    also accepted that the effect of the Scheme would be to extinguish\n                    Pacrim’s claim for damages. However, given that Pacrim’s claim\n                    against MSL had already been dismissed by the High Court at the material time,\n                    she submitted (with reference to authorities that I will deal with below) that\n                    Pacrim could not in any way be a creditor under s 210. 14     MSL’s position in turn was that Pacrim\n                    was for all intents and purposes a Scheme Creditor as Pacrim had a claim that\n                    was pending appeal when MSL entered into judicial management and/or when the\n                    Scheme was introduced, and such a claim was in respect of MSL’s failure to\n                    register the share transfers in 2003 (which was prior to the making of the\n                    judicial management order (see[8]above)).\n                    Counsel for MSL, Mr Andre Maniam SC, suggested that since the Court of\n                    Appeal in the recent case ofThe Oriental Insurance Co Ltd v\n                        Reliance National Asia Re Pte Ltd[2008] 3 SLR(R) 121\n                        (“Oriental”) had endorsed the\n                    Australian approach that a scheme becomes an order of court once approved by the\n                    court, the “focus” should properly be on the terms of the Scheme\n                    and the issue properly framed should be whether Pacrim was a “Scheme\n                    Creditor” as defined in the Scheme[note: 9]. However, he submitted (with reference\n                    to authorities that I will deal with below), disagreeing with Ms Chong,\n                    that, in any event, Pacrim was a creditor within s 210 of the\n                Act. 15     Notwithstanding the slight dispute on how the\n                    issue should be properly framed, it would be clear from the positions taken by\n                    the parties (and both counsel have accepted this as well at the hearing) that\n                    the resolution of the preliminary issue would invariably turn on the definition\n                    of “creditor” in s 210 of the Act, and whether Pacrim fell\n                    within this definition. As mentioned, Pacrim accepted that if it were a\n                    “creditor” for purposes of s 210 of the Act, it would be a\n                    Scheme Creditor under the Scheme and would be bound by it, with the consequence\n                    that its claim would be extinguished. 16     Any difficulty only arises if I find that\n                    Pacrim wasnota “creditor” under\n                    s 210. Mr Maniam suggested (without pressing the point too far) that\n                    Pacrim could still nevertheless fall within the broad definition of\n                    “Scheme Creditor” under the Scheme and be bound by the Scheme\n                    given the Court of Appeal’s decision inOriental. More will be said about this later. 17     I turn now to the meaning of\n                    “creditor” in s 210 of the Act.",
        "Meaning of “creditor” in s 210 of the\n                Act": "18     Section 210 of the Act, which governs\n                    compromises and schemes of arrangement in Singapore, provides as follows (and I\n                    set out the material sub-sections): Power to compromise with creditors and\n                            members 210. —(1)    Where a compromise or arrangement is\n                            proposed between a company and itscreditorsor any class of them or between the company\n                            and its members or any class of them, the Court may, on the application\n                            in a summary way of the company or of any creditor or member of the\n                            company, or, in the case of a company being wound up, of the liquidator,\n                            order a meeting of thecreditorsor class\n                            ofcreditorsor of the members of the\n                            company or class of members to be summoned in such manner as the Court\n                            directs. (2)    A meeting held pursuant to an order of the Court\n                            made under subsection (1) may be adjourned from time to time if the\n                            resolution for adjournment is approved by a majority in number\n                            representing three-fourths in value of thecreditorsor class ofcreditorsor members or class of members present and\n                            voting either in person or by proxy at the meeting. (3)    If a majority in number representing three-fourths\n                            in value of thecreditorsor class ofcreditorsor members or class of\n                            members present and voting either in person or by proxy at the meeting\n                            or the adjourned meeting agrees to any compromise or arrangement, the\n                            compromise or arrangement shall, if approved by order of the Court, be\n                            binding on all thecreditorsor class ofcreditorsor on the members or class\n                            of members, as the case may be, and also on the company or, in the case\n                            of a company in the course of being wound up, on the liquidator and\n                            contributories of the company. … (4)    Subject to subsection (4A), the Court may grant\n                            its approval to a compromise or arrangement subject to such alterations\n                            or conditions as it thinks just. … [emphasis added] 19     The section (and in fact the Act) is, however,\n                    silent on the meaning of “creditor”. Counsel for both parties have\n                    informed me that “creditor” in s 210 has yet to be\n                    interpreted by the local courts. 20     It is beyond trite in Singapore that a\n                    purposive approach should be taken for statutory construction (see s 9A of\n                    the Interpretation Act (Cap 1, 2002 Rev Ed); see also, for instance,\n                    the Court of Appeal decision ofChief Assessor and another v\n                        First DCS Pte Ltd[2008] 2 SLR(R) 724 at [10]) and, in\n                    the present case, due consideration should be given to the legislative history\n                    and purpose of s 210 in construing the meaning of “creditor”\n                    (seeOrientalat [30]).",
        "Legislative history and purpose of s 210": "21     V K Rajah JA, delivering the\n                    judgment of the Court of Appeal inOriental, has\n                    dealt at length with the legislative history and purpose of s 210 (at\n                    [31]–[41]). He explained that s 210, which first appeared as\n                    s 176 of the Companies Act 1967 (Act 42 of 1967), has its origins in both\n                    s 206 of the Companies Act 1948 (c 38) (UK) (the present s 895 of the\n                    Companies Act 2006 (c 46) (UK), previously s 425 of the Companies Act 1985\n                    (c 6) (UK) (“the 1985 UK Act”)) and s 181 of the Companies\n                    Act 1961 of Victoria, Australia (the precursor to the present s 411 of the\n                    Corporations Act 2001 (Cth) (“the Australian Act”)). He thus\n                    described s 210 as “ahybridof both\n                    the UK and the Australian provisions” (at [34]; however, he also noted\n                    that there were some material differences in wording between the\n                    Singapore/Australian provision and the UK provision (see [36])). 22     As for the purpose of s 210,\n                    Rajah JA noted that the explanatory statement in the Companies Bill 1966 as\n                    well as the relevant parliamentary debates did not shed much light on the\n                    purpose behind the enactment of s 176 (the present s 210).\n                    Nonetheless, he pointed out that the purpose behind legislative provisions on\n                    schemes of arrangement has been extensively considered by the English and\n                    Australian courts (seeOrientalat [38]). He cited\n                    approvingly (at [38]) the following passage fromRe Norfolk\n                        Island And Byron Bay Whaling Co Ltd(1969) 90 WN (Pt 1)\n                    (NSW) 351 where Street J summarised the purpose behind the then equivalent\n                    of the Australian s 411 (at 354): The section is intended to provide machinery (i) for\n                            overcoming the impossibility or impracticability of obtaining the\n                            individual consent of every member of the class intended to be bound\n                            thereby [ie, by the scheme of arrangement], and (ii) for preventing, in\n                            appropriate circumstances, a minority of class members frustrating a\n                            beneficial scheme. As Younger J. said in 1917 [inIn re Guardian Assurance Company[1917]\n                        1 Ch 431 at 441] of the corresponding English section [viz, s 120 of the Companies (Consolidation) Act\n                        1908 (c 69) (UK)], in terms later quoted by Astbury J. inIn re Anglo-Continental Supply Co. Ltd. [[1922]\n                        2 Ch 723]: “Its purpose is strictly limited; it does not\n                        confer powers; its only effect at any time is to supply, by recourse to the\n                        procedure thereby prescribed, the absence of that individual agreement by\n                        every member of the class to be bound by the scheme which would otherwise be\n                        necessary to give it validity.” [emphasis added] Reference may also be made toWalter Woon on\n                        Company Law(Tan Cheng Han gen ed) (Sweet & Maxwell Asia, Rev\n                    3rd Ed, 2009) at para 16.2 where it is commented that s 210\n                        “obviatesthe need for a messy and\n                    complicated series of negotiations with a view to obtaining theunanimousapproval of the members or creditors to a\n                    novation or assignment or othervariation of their\n                        rights” [emphasis added] (endorsed inOrientalat [40]). 23     It has also been recognised that one of the\n                    purposes of legislative provisions providing for schemes of arrangements is to\n                    encourage compromises and arrangements between a company and its creditors, so\n                    as to avoid putting the company into liquidation and to facilitate the financial\n                    rehabilitation of the company. InSea Assets Limited v\n                        Perusahaan Perseroan (Persero) PT Perusahaan Penerbangan Garuda\n                        Indonesia[2001] EWCA Civ 1696, Peter Gibson LJ,\n                    delivering the judgment of the English Court of Appeal, held the following (at\n                    [2]): It has been the legislative policy for well over a\n                            century to encourage compromises and arrangements between a company and\n                            its creditors or members. That has been achieved by the\n                        enactment of a statutory mechanism to enable the absence of consent of\n                        minority creditors or members to be overcome, provided that\n                        a sufficient number of the relevant creditors or members agree with the\n                        proposed compromise or arrangement and the court gives its approval. If that\n                        occurs, then the dissentient minority will be bound by that compromise or\n                        arrangement. That of course in the case of a creditor is an encroachment on\n                        his right to be paid what he is owed in accordance with the contractual\n                        terms.But the utility of the statutory mechanism is\n                            particularly obvious in a case where a company is in financial\n                            difficulties but can persuade most, but not all, of the relevant\n                            creditors that the company's debts should be restructured rather than\n                            that those creditors should exercise their rights, including the right\n                            to put the company into liquidation. [emphasis added] (See alsoIn re T & N Ltd and others[2006] 1 WLR 1728 (“In re T &\n                        N”) at [40] (quoted below at[27]) andAustralian Corporation Law:\n                        Principles and Practice(Butterworth, Looseleaf Ed, 1991)\n                        (“Australian Corporation Law”),\n                    vol 2 at para 5.1.0010).",
        "A wide construction": "24     Returning back to the meaning of\n                    “creditor” in s 210, MSL submitted that the word should be\n                    given as wide a meaning as possible. Indeed, the position taken in the UK and\n                    Australia is that “creditor” for purposes of scheme provisions\n                    should be given a broad meaning. The learned authors ofPalmer’s Company Law(Geoffrey Morse ed) (Sweet &\n                    Maxwell, Looseleaf Ed, 1992–2009) (“Palmer”) explain in vol 2 at para 12.047 as\n                    follows: In general, any person having a pecuniary claim against\n                            the company capable of estimate is a creditor. Future tort\n                        claimants in respect of asbestosis damage claims were held to be creditors\n                        on proof of exposure to asbestos. So too were actual or potential claimants\n                        under the Civil Liability (Contribution) Act 1978. Where it is impossible to ascertain for certain all the creditors it is\n                        proper to require claims to be submitted within a time limit. The claims may\n                        have to be supported by documentary evidence. Disputed claim may be referred\n                        to an independent adjudicator, whose decision is to be final “so far\n                        as the law allows”. [emphasis added] (See alsoBuckley on the Companies Acts(Dame Mary Arden, Dan Prentice & Sir Thomas Stockdale gen eds) (LexisNexis\n                    UK, Looseleaf Ed, 2007), vol 2 at para 425.19 where a creditor in the\n                    equivalent UK provision is described as “[e]very person who has a\n                    pecuniary claim against the company, whether actual or contingent”, H\n                    A J Ford, R P Austin & I M Ramsay,Ford’s\n                        Principles of Corporations Law(Butterworths, Looseleaf Ed,\n                    1995), vol 2 at para 24.020 which states that “[t]he word\n                    “creditor” in s 411 is to be given a wide meaning” andAustralian Corporation Law, vol 2 at\n                    para 5.1.0035 which states that “[t]he court takes a wide view of\n                    the meaning to be given to the term [ie,\n                    “creditor”] [and] [i]t includes all persons having any pecuniary\n                    claims against the company, whether their claims be actual or\n                    contingent.”) 25     In the English Court of Appeal case ofRe Midland Coal, Coke, and Iron Company[1895]\n                    1 Ch 267 (“Re Midland\n                    Coal”), a case referred to by both counsel, Lindley LJ\n                    held at 277: … we agree with Mr. Justice Wright in thinking that the word\n                        \"creditor\" is used in the Act of 1870 in thewidest\n                            sense, and thatit includes all persons\n                            having any pecuniary claims against the company. Any other construction\n                            would render the Act practically useless. [emphasis\n                        added] 26Re Midland Coalwas followed in Australia inRe Glendale Land Development Ltd\n                        (No 2)(1982) ACLC 562 (“Re\n                        Glendale Land Development”) (a case relied on by\n                    Ms Chong) where McLelland J held (at 564) that\n                    “creditors” in the statutory provision relating to schemes should\n                    be understood as “embracingall persons\n                    with claims which would be entitled to beadmitted to proof\n                        if the company were wound up” [emphasis added]. At first\n                    blush, it would appear that McLelland J, despite followingRe\n                        Midland Coal, had somewhat restricted the meaning of\n                    “creditor” to those with a provable claim in winding up. However,\n                    in the later case ofRe R L Child & Co Pty Ltd(1986) 10 ACLR 673 (“Re R L\n                    Child”), he clarified (at 674) that his formulation inRe Glendale Land Development“wasnotintended to limit the scope of the\n                    expression, but rather to indicate that persons with unliquidated, prospective\n                    or contingent claims were not excluded, notwithstanding difficulties of\n                    assessment of value in such cases” [emphasis added]. Indeed, the word\n                    “embracing” used in his formulation inRe\n                        Glendale Land Developmentwould suggest that the meaning of\n                    “creditor” in the context of schemes of arrangement is not\n                    confined to persons with provable claims in winding up. Referring to bothRe Glendale Land DevelopmentandRe R L Child, Anderson J in the subsequent case ofBond Corporation Holdings Ltd v Western\n                        Australia(1992) 7 ACSR 472 (“Bond Corporation”) held at 477 that: … there is ample and persuasive authority for the proposition that\n                        the term “creditors” in s 411(4) is to be given awide meaningandincludes persons having any pecuniary claim against the company,\n                            including unliquidated, prospective or contingent claims… [emphasis added] 27     There is no doubt that the meaning of\n                    “creditor” in the context of schemes of arrangement is much\n                    broader than that in the context of winding up. As held by David Richards J\n                    in the recent case ofIn re T & Nat\n                    [40]: In my judgment, \"creditors\" in section 425 of the\n                            Companies Act 1985 is not limited to those persons who would have a\n                            provable claim in the winding up of the company, although it clearly\n                            includes all those who would have such a claim. … one of the\n                            recognised purposes of section 425 is to encourage arrangements with\n                            creditors which avoid liquidation and facilitate the financial\n                            rehabilitation of the company: see, for example, Sea Assets Ltd v PT\n                            Garuda Indonesia[2001] EWCA Civ 1696 at [2].This suggests that as wide a meaning as possible\n                            should be given to \"creditors\" in the section. Having said\n                        that, it is important to bear in mind that section 425 is designed as a\n                        mechanism whereby an arrangement may be imposed on dissenting or\n                        non-participating members of the class and such a power is not to be\n                        construed as extending so as to bind persons who cannot properly be\n                        described as \"creditors\". [emphasis added] Likewise, the learned authors ofAustralian\n                        Corporation Lawhas pointed out (in vol 2 at\n                    para 5.1.0035) that “creditors” in s 411 of the\n                    Australian Act “may extend beyond such provable claims and embrace all\n                    claims over and above those provable in winding up.” 28     Ms Chong accepted that the prevailing\n                    judicial opinion is that a broad meaning should be ascribed to the word\n                    “creditor” for purposes of schemes of arrangement. However, she\n                    submitted, with reference to extracts inPalmer,Australian Corporation Lawand the Australian\n                    case ofJohnston v McGrath and Another[2008] NSWSC 639 (“Johnston”) that “[w]hether one is looking for a\n                    “provable claim” or “pecuniary claim”, it is trite\n                    law that the “claim or liability in respect of which proof is lodged must\n                    be one which islegally due, in the sense of beingenforceableby legal process if\n                        necessary”[note: 10][emphasis added]. A\n                    perusal of the authorities referred to would show that they all relate clearly\n                    to provable claims in the context of winding up. For instance, the passage she\n                    cited fromPalmer(at paras 15.402 and 15.405)\n                    states: Provable debts … the fundamental principles which underlie the concept of theprovable debtare common to both\n                        bankruptcy and winding-up.Thus, the claim or liability\n                            in respect of which proof is lodged must be one which is legally due, in\n                            the sense of being enforceable by legal process if necessary,\n                        and it must be demonstrable that the company itself is the party which, in\n                        law, is liable to satisfy the claim. … The time factor The vital principal is that, to beprovable,\n                        a liability mustexistat the date on which\n                        the company went into liquidation. … [emphasis added] 29     As shown by the cases discussed above,\n                    “creditor” in the context of schemes of arrangement has a much\n                    broader meaning than that in the winding up context. Thus, I did not think that\n                    such a requirement as pointed out by Ms Chong was a necessary element of\n                    the definition of “creditor” in the context of schemes of\n                    arrangement. 30     In my view, bearing in mind the legislative\n                    purpose behind s 210 and having regard to the position taken in both the UK\n                    and Australia, a wide meaning should be given to the word\n                    “creditor” in s 210. As seen, the aim of s 210 (in\n                    relation to creditors) is essentially to provide amechanismto overcome the near impossibility or impracticability\n                    of obtaining theunanimousconsent of all\n                    creditors to a proposed scheme (which is devised, more often than not, to solve\n                    the company’s intractable financial problems and/or to save the company\n                    from insolvency) and to bindallcreditors\n                    includingdissentingones to the scheme. A\n                    restrictive meaning of “creditor” such as that found in the\n                    context of winding up (that leaves out creditors without a provable claim or one\n                    that is not immediately payable) would thwart the purpose of having such a\n                    scheme to compromise and satisfy the liabilities of the company so as give the\n                    company, so as to speak, a new lease of life after the scheme is implemented.\n                    Nonetheless, one should also pay heed to the caveat given by Richards J inIn re T & Nthat “creditor”\n                    in relation to schemes of arrangement cannot be construed so broadly as to\n                    extend a scheme to bind persons who cannot properly be described as creditors\n                    (see[27]above). 31     The English and Australian authorities\n                    referred to above have, in my view, established a working definition of\n                    “creditor” in relation to schemes of arrangement that has been\n                    consistently applied by the English and Australian courts. Given that our\n                    s 210 has its roots in both the UK and Australian provisions and all three\n                    provisions share a common legislative purpose (see[22]–[23]above),\n                    “creditor” in s 210 should likewise be construed broadly toincludeany person with anypecuniary claimagainst the company, notwithstanding whether\n                    such claim is unliquidated, prospective or contingent. In the words of the\n                    learned authors ofPalmer, the pecuniary claim\n                    should be one “capable of estimate” (see[24]above).",
        "Whether Pacrim fell within the definition of “creditor”\n                in s 210": "32     Having decided on the meaning of\n                    “creditor” in s 210, it remained to be considered if Pacrim\n                    would fall under this definition. Could Pacrim be said to have a pecuniary claim\n                    capable of estimate given that what it had at the time when MSL entered into\n                    judicial management and/or when the Scheme was introduced was essentially a\n                    statutory right of appeal that had been exercised? Extensive submissions have\n                    been made by both parties on this question. It would be necessary to set out the\n                    main arguments (as well as the cases referred to) in some detail to fully\n                    appreciate them.",
        "The parties’ arguments and cases": "33     Pacrim’s primary position (as mentioned)\n                    was that it was simply not a creditor in law. Ms Chong submitted that at\n                    the time the judicial management order was made, Pacrim’s claim had been\n                    adjudicated and dismissed by the High Court. Although Pacrim had filed an appeal\n                    and the appeal was pending, the High Court’s judgment remained good and\n                    enforceable so long as it was not set aside[note: 11]. Reliance was placed onJohnstonwhere the court (in that case) had noted that\n                    prior judicial determination which dismissed a plaintiff’s appeal against\n                    a liquidator’s rejection of his proof of debt amounted to a judicial\n                    decision that the alleged debt or claim was not admissible as a debt payable by\n                    or a claim against the company. She further pointed out that neither MSL nor the\n                    Scheme Manager treated Pacrim as a creditor as they did not send the Scheme\n                    documents to Pacrim. Although Pacrim was kept posted by MSL on the Scheme, she\n                    contended that even if Pacrim had filed a proof of debt, the Scheme Manager\n                    would in all likelihood have rejected it. 34     Mr Maniam, on the other hand, argued that\n                    there was an obvious and material difference between a case where proceedings\n                    are pending and one where there is a final, non-appealable judgment; a\n                    distinction that he submitted was recognised by the Singapore High Court inRe Baring Futures (Singapore) Pte Ltd (in compulsory\n                        liquidation) and another action[2002] 1 SLR(R) 191\n                        (“Re Baring Futures”) andBank of India v Rai Bahadur Singh and another[1993] 2 SLR(R) 1 (“Bank of\n                        India”)[note: 12].\n                    He thus argued that although Pacrim’s claim had been dismissed at first\n                    instance, the High Court’s judgment was not a final non-appealable\n                    judgment since Pacrim had exercised its statutory right of appeal and that\n                    appeal was kept alive and pending. Mr Maniam further referred, in the main,\n                    to two cases to argue that Pacrim should be rightly recognised as a creditor (in\n                    particular, acontingentcreditor) at the material\n                    time: (a)     The first case wasIn re T & Nwhere future asbestos claimants were\n                        held to be creditors falling within the definition of creditors under\n                        s 425 of the 1985 UK Act. Notwithstanding that at the time of the\n                        scheme no liability on the part of the company had arisen in respect of\n                        these claimants who had not developed any of the asbestos-related diseases,\n                        the court held that they had a contingent claim against the company and was\n                        thus a creditor for purposes of s 425 and the scheme in question (seeIn re T & Nat [60] and\n                    [66]). (b)     The second\n                        case was the US case ofJaurdon v Cricket\n                            Communications412 F 3d 1156 (“Jaurdon”), which Mr Maniam submitted was\n                        on all fours with the present case[note: 13]. In that case, the US Court of\n                        Appeals, Tenth Circuit, rejected a company’s contention that a\n                        plaintiff with a pending appeal against dismissal of its claim against the\n                        company did not have a “claim” within ch 11 of the\n                        Bankruptcy Code (US). The court held that the definition of\n                        “claim” in ch 11 was broad enough to include the\n                        plaintiff’s claim, “be it disputed by [the company] orcontingentupon [the] court’s\n                        decision on appeal” [emphasis added] (at 1159). Referring to an\n                        article entitled “Schemes of Arrangement as a Corporate Rescue\n                        Mechanism: The Singapore Experience” by Tracey Evans Chan in (2009)\n                        18 Int Insolv Rev 37 (at p 39), Mr Maniam pointed out that the\n                        mechanism under s 210 was substantially similar to the bargaining\n                        framework envisaged in the ch 11 plan approval process[note: 14]. 35     Mr Maniam also argued that Pacrim should\n                    not be allowed to “flip-flop” being a creditor; it cannot be a\n                    case where Pacrim was a creditor when the action commenced, and then it ceased\n                    becoming one between 3 August 2004 (when the OS was dismissed) and 21 February\n                    2008 (a day prior to the appeal) notwithstanding it maintained a pending appeal,\n                    and then it became a creditor again on 22 February 2008 having won the\n                        appeal[note: 15]. He pointed\n                    out at the hearing that if Pacrim had won at first instance or had proceeded\n                    with the appeal immediately and won, it would certainly be a creditor and would\n                    have been bound by the Scheme. There cannot be, in his words, one “sweet\n                    spot” (ie, the instant situation where\n                    Pacrim (fortuitously) lost at first instance but won subsequently on appeal\n                    after the Scheme had been implemented) that would allow Pacrim to escape from\n                    the effect of the Scheme while all other creditors with claims, similarly\n                    arising from events before the date of the judicial management order, were\n                    bound. 36     Since Pacrim was notified by MSL about the\n                    Scheme (although the Scheme documents were not forwarded to Pacrim),\n                    Mr Maniam contended that it was unfair for Pacrim to have sat back and\n                    adopted a wait and see approach while the whole Scheme was taking place and then\n                    to assert its claim of some $2m now, after having reaped the benefit of the\n                    Scheme (given that the company survived because of the Scheme and Pacrim thus\n                    managed to recover shares that were not entirely worthless). To hold that Pacrim\n                    was not a creditor would be unfair to all other creditors who had voted in\n                    favour of the Scheme thinking that the Scheme would “scrub the company\n                    clean of its liabilities” as well as the present (new) shareholders of\n                    MSL who had taken over the company (MSL was subjected to a reverse takeover\n                    after the Scheme) thinking it was free of all previous liabilities. He pointed\n                    out that the Scheme had a limit of $9m for all claims and if Pacrim had put in a\n                    proof of $2m, this limit would have been exceeded and the Scheme would have to\n                    be reconsidered by all creditors[note: 16]. In\n                    all, he argued that to allow Pacrim’s contention would defeat the very\n                    purpose of s 210. 37     Mr Maniam submitted that the right thing\n                    that Pacrim should have done was to put in a proof of debt for the Scheme or\n                    alternatively to press on with the appeal and then to file a proof of debt based\n                    on the successful outcome thereof[note: 17]. For the former case, although in all\n                    likelihood the proof of debt would have been disputed and/or rejected by the\n                    Scheme Manager, the Scheme provided a mechanism to resolve such dispute\n                    including recourse to the courts, and if the matter were to proceed to court, it\n                    was likely that the court would have directed Pacrim to complete its appeal to\n                    determine if it had a valid claim just like what Lai Kew Chai J ordered inRe Baring Futures(in respect of a challenge\n                    to the rejection of a proof of debt filed for winding up). 38     Ms Chong responded to\n                    Mr Maniam’s arguments by pointing out that the cases relied on by MSL\n                    were all distinguishable given that they did not concern schemes of arrangement\n                    and/or the instant question faced by this court. AlthoughIn\n                        re T & Nwas decided in the context of schemes, she argued\n                    that in that case, the company in question had already negligently exposed the\n                    potential claimants to asbestos (and this was not disputed by the company)\n                    whereas in the present case, it was not established until appeal that\n                    MSL’s refusal to register the transfers of the shares was wrongful. In\n                    respect ofJaurdonwhich Mr Maniam claimed\n                    was on all fours with the present case, she pointed out that the US Bankruptcy\n                    Code provided a very broad definition of “claims” which\n                    specifically included “disputed” and “contingent”\n                    claims. Indeed, the relevant section (ie,\n                    s 101(5)(A)) defined a claim as a: … right to payment, whether or not such right is reduced to\n                        judgment, liquidated, unliquidated, fixed, contingent, matured, unmatured,\n                        disputed, undisputed, legal, equitable, secured or unsecured. 39     Ms Chong further argued that a contingent\n                    creditor would denote “a person towards whom under anexistingobligation, the company may or will become subject to a\n                    present liability on the happening of some future event or at some future\n                    date” [emphasis added] (perPennycuick J’s judgment inIn re William Hockley\n                        Ltd[1962] 1 WLR 555 at 558, cited with approval by the\n                    Singapore High Court inRe People’s Parkway Development\n                        Pte Ltd[1991] 2 SLR(R) 567 at [10])[note: 18]. Quite clearly, MSL was not\n                    under any existing liability at the time of the Scheme to Pacrim. It followed\n                    that Pacrim could not have been a contingent creditor. 40     Although she accepted that Pacrim had notice\n                    of the Scheme all along, Ms Chong submitted that it would have been futile\n                    for Pacrim to have done anything given that the Scheme Manager would have\n                    rejected any proof put in by Pacrim as its claim had already been dismissed by\n                    the High Court. She postulated that a challenge of the Scheme Manager’s\n                    determination in court would likewise fail since the High Court judgment, until\n                    set aside, was binding and valid[note: 19]. In any case, she submitted that\n                    the onus was also on the Scheme Manager and/or MSL to ask Pacrim to put in a\n                    proof of debt if they had regarded Pacrim to be a creditor but this was not\n                    done.",
        "My decision": "41     Apart from the submissions on the law, it\n                    would be clear from the arguments that much has also been proffered by both\n                    sides as to the conduct of the parties (including what either party should or\n                    could have done at the relevant time) as well as what could have happened if\n                    Pacrim had submitted a proof of debt. However, I did not think that much weight,\n                    or any weight for that matter, could be placed on these matters. There was no\n                    doubt that Pacrim was kept abreast throughout with the developments of the\n                    Scheme though it was not served with the Scheme documents. Ms Chong has\n                    confirmed at the hearing that she is not in any way trying to impugn the\n                    validity of the Scheme. Therefore, nothing should really turn on the conduct of\n                    the parties especially since the question before the court was primarily one of\n                    construction (see[12]and[15]above). As for what could have happened if\n                    Pacrim had submitted a proof of debt, it would suffice for me to say that\n                    whatever postulations put forward by the parties would merely be speculation\n                    now. No one, including this court, can say for sure what could have happened.\n                    Likewise, these postulations were irrelevant. 42     Turning then to the cases cited by the\n                    parties, I agreed generally with Ms Chong that these cases (includingJohnstonwhich was cited by Ms Chong\n                    herself) did not strictly concern schemes of arrangement and/or the question at\n                    hand. A somewhat similar question (viz, whether a\n                    plaintiff with a pending appeal (having lost at first instance) could be said to\n                    have a “claim” within ch 11 of the Bankruptcy Code (seeJaurdonat 1158)) was raised inJaurdon. The question was answered in the affirmative by\n                    the court and the plaintiff’s claim against the company was accordingly\n                    held discharged pursuant to a plan of reorganisation approved by the Bankruptcy\n                    Court (seeJaurdonat 1159). I was, however,\n                    mindful that the US Bankruptcy Code provided a very broad definition for\n                    “claims” (see[37]above),\n                    which has no equivalent in our s 210. Notwithstanding the similarities\n                    between the US ch 11 protection and our s 210, the latter has it\n                    roots, as demonstrated, in the relevant scheme provisions in the UK and\n                    Australian legislation and not the US Bankruptcy Code (see[21]above). The case ofIn re\n                        T & Nwould appear to be the closest in terms of context\n                    since it also concerned the interpretation of the word “creditor”\n                    in s 425 of the 1985 UK Act (and, more specifically, whether future\n                    asbestos claimants without an accrued cause of action at the time of a Scheme\n                    could be a creditor for purposes of the scheme), but, admittedly, the case did\n                    not involve a situation where a plaintiff’s claim had been judicially\n                    adjudicated to be without merit at first instance. 43     This was not to say that these cases were\n                    entirely unhelpful. All it meant was that the question posed in the present case\n                    cannot be resolved by a straightforward application of any of the cases cited\n                    above. As admitted by both counsel, the question posed was a novel one which has\n                    yet to be answered so far. This was one question that would ultimately have to\n                    be resolved with regard to the definition of “creditor” in\n                    s 210 (as I have found above) as well as the purpose of\n                s 210. 44     The present situation was such that at the\n                    time the judicial management order was made and/or when the Scheme was\n                    introduced, Pacrim had a claim that had already been dismissed by the High Court\n                    but which was still subject to an appeal. Although bothRe\n                        Baring FuturesandBank of Indiawere not concerned with the same context here, there can be no doubt that there\n                    exists a distinction between a judgment which could still be set aside on appeal\n                    and, to quote Lai Kew Chai J inRe Baring\n                        Futures(at [12]), a “final non-appealable\n                    judgment” as recognised in those cases. As a matter of logic, the\n                    plaintiff’s rights (or for that matter, the defendant’s rights) in\n                    the latter case would have beenconclusivelydetermined by the court. If the court finds against him, the plaintiff’s\n                    claim is extinguished forever (the case ofJohnston, raised by Ms Chong (see[33]above), was precisely concerned with an earlier final and\n                    non-appealable decision). The same, however, cannot be said of the former case.\n                    Even if the court at first instance dismisses his claim, the plaintiff still has\n                    a right of appeal (and in this case, astatutoryright of appeal requiringno leave of courtat the\n                    time the notice of appeal was filed (which wasbeforeMSL entered into judicial management)), and the final\n                    appeal may well vindicate his claim. 45     Does this then make Pacrim a contingent\n                    creditor (and/or someone with a contingent claim or to whom the company owes a\n                    contingent liability) as Mr Maniam had submitted? The cases ofIn re William Hockley LtdandRe\n                        People’s Parkway Development Pte Ltdcited by Ms Chong\n                    would suggest that a contingent creditor must be someone to whom an existing\n                    obligation to pay is owed (see[39]above).\n                    However, these two cases were construing contingent creditors in the context of\n                    winding up and were concerned with the question of who had the standing to\n                    present a winding-up petition (seeIn re William Hockley\n                        Ltdat 558 andRe People’s Parkway\n                        Development Pte Ltdat [6] and [10]). We have also seen that\n                    “creditors” take on a different (in fact, a narrower) meaning in\n                    the context of winding up. 46     However, the definition of a\n                    “contingent creditor” (or a person with a contingent claim or to\n                    whom the company owes a contingent liability) appears to be much broader in\n                    other contexts. In the House of Lords decision ofWinter and\n                        Others (Executors of Sir Arthur Munro Sutherland Bart, decd) v Inland\n                        Revenue Commissioners [Appeal in In re Sutherland, decd][1961] AC 235 (“In re\n                    Sutherland”), the majority in construing the word\n                    “contingent liability” in s 50(1) of the Finance Act 1940 (c\n                    29) (UK) held that an existing legal liability was not a requirement of a\n                    contingent liability. In considering the general meaning of the phrase\n                    \"contingent liability\" in law (andnotrestricted\n                    to the statutory provision at hand), Lord Reid said at 248–249: It would seem that the phrase \"contingent liability\" may have no settled\n                        meaning in English law …I would … find it impossible to hold that …\n                            a contingent liability is merely a species of existing liability. It is\n                            a liability which, by reason of something done by the person bound, will\n                            necessarily arise or come into being if one or more of certain events\n                            occur or do not occur. [emphasis added] 47     Likewise, Lord Birkett held that an existing\n                    legal liability was not necessary (at 253): It was argued that an existing legal liability was essential to the\n                        creation of a contingent liability, and that no such legal liability existed\n                        in this case at the date of Sir Arthur's death.In my\n                            view this is to take too narrow a view of the true meaning of contingent\n                            liability. [emphasis added] 48     Notably, Lord Guest suggested that a key\n                    feature of contingent liability would be that the occurrence of the contingency\n                    or (so as to speak, the triggering) event wouldautomaticallyby theoperation of\n                        lawresult in the liability to pay (at 263–264): …if a liability must be an existing legal liability to\n                            comply with section 50 (1), that would appear to give no content to the\n                            adjective \"contingent.\"The liability is not a legal\n                        liability until the contingency has arrived and the section cannot therefore\n                        be restricted to \"existing legal liabilities.\" … The claim for\n                        initial allowances for what has been described as depreciation is the\n                        voluntary choice of the taxpayer, but, once he has obtained such allowances,he is automatically involved by the operation of law\n                            in the payment of balancing charges, if the assets are parted\n                        with at a price greater than the written down value in the circumstances\n                        defined in section 292 of the Income Tax Act, 1952. In the present case as\n                        at the date of the deceased's death the ships in question had a value on the\n                        open market considerably in excess of that written down value. The liability\n                        for such a balancing charge was, in my view, a \"contingent liability\" within\n                        the meaning of section 50 (1) of the Act of 1940, the liability being\n                        contingent upon the ships being sold at a price in excess of their written\n                        down value. [emphasis added] 49In re Sutherlandwas applied subsequently by Richards J in the context of schemes of\n                    arrangement inIn re T & Nwhere he held that\n                    potential asbestos claimants who have been exposed to asbestos by the company\n                    but presently suffered no disease and therefore have no claim in tort against\n                    the company were nevertheless creditors (within s 425 of the 1985 UK Act)\n                    to whom the company owed contingent liabilities (at [60] and [66]): 60    If the principles established byIn re Sutherland, decd[1963] AC 235 …\n                               are applied to this case, it is right in my judgment to\n                            conclude that T & N is subject to contingent liabilities to pay\n                            damages to those who have already been carelessly exposed to asbestos by\n                            the actions of T & N and who later suffer compensatable loss,\n                            resulting in claims for damages in negligence against T & N. The\n                            creditors in respect of those contingent liabilities are the persons who\n                            have been carelessly exposed to asbestos and who will have claims in\n                            negligence if they suffer loss as a result. Reverting to Lord Reid's\n                            speech, the contingent liability to pay damages is a liability which, by\n                            reason of something done by the person (i e the use or distribution by T\n                            & N of asbestos or asbestos products) will necessarily arise or come\n                            into being if one or more certain events occur (i e the onset of\n                            asbestos-related conditions in persons previously exposed to asbestos by\n                            T & N).Lord Guest referred specifically to the\n                                contingent debtor being \"automatically involved by the operation of\n                                law in the payment\" of the debt once the contingency\n                                occurred. That precisely describes the situation here.\n                            The careless exposure of persons to asbestos by T & N will\n                            automatically by the operation of the law of negligence lead to the\n                            liability to pay damages, assuming the existence of the other necessary\n                            elements of a claim in negligence. … 66I conclude therefore that T\n                                & N is subject to contingent liabilities in respect of future\n                                asbestos claims, as defined in the administrators'\n                            application and thatthe future asbestos\n                                claimants, being those persons who have been exposed to\n                            asbestos and who will have claims in negligence against T & N if\n                            they develop asbestos-related diseases,are\n                                \"creditors\" of T & N for the purposes of section 425 of the\n                                Companies Act 1985and Part I of the Insolvency Act 1986\n                            dealing with CVAs. [emphasis added] 50     The definition of contingent liability or\n                    contingent creditor, however, cannot be stretched too far. Richards J\n                    himself was well aware of this danger when he said inIn re T\n                        & Nat [67]: In reaching this conclusion, I emphasise that I do so on the basis of the\n                        facts relevant to asbestos claims, principally thatthe\n                            relevant acts or omissions of T & N are complete, the\n                        potential claimants have been exposed to asbestos and the existence of a\n                        claim in tort depends solely on whether a relevant asbestos condition\n                        develops.I have not considered circumstances where all\n                            the relevant events excluding damage have not occurred, as, for example,\n                            where a company has negligently made a product but the putative claimant\n                            has not acquired it or used it. By way of extreme example, if\n                        aero-engines are negligently manufactured and are in use but have not (yet)\n                        caused an air crash, it could hardly be supposed that there exists a\n                        contingent liability to the victims of a possible future crash: for facts of\n                        this sort, seeIn re R-R Realisations Ltd[1980] 1 WLR 805 . [emphasis added] 51     Based on the definition put forward by Lord\n                    Reid inIn re Sutherland, Pacrim would appear to\n                    be a contingent creditor or a person to whom MSL owed a contingent liability. To\n                    use the language of Lord Reid, “something done” here would be\n                    MSL’s refusal to register the transfers of the shares in question and the\n                    contingency or “event” would be Pacrim succeeding in its claim on\n                    appeal. The facts of the instant case were certainly far removed from those in\n                    the extreme example given by Richards J (quoted in the preceding\n                    paragraph), and the “relevant acts or omissions” forming the\n                    necessary ingredients for a contingent claim were certainly present and\n                    complete. It would be different if, for instance, MSL merely had theintentionto refuse the registration of any transfer put\n                    forward by Pacrim but the latter has yet to submit any such transfer; Pacrim\n                    could hardly claim then to have a contingent claim for possible (future)\n                    wrongful refusal. 52     It should be mentioned that Ms Chong has\n                    raised the argument which suggested that the “something done” must\n                    be established to be wrongful at the outset (see[38]above). She pointed out that inIn re T\n                        & N, Richards J had clearly taken into account the\n                    company’s admission that it had negligently exposed the potential\n                    claimants to asbestos. On the other hand, MSL had never admitted that its\n                    refusal to register the transfers of the shares was wrongful and it was only\n                    established on appeal that it was. Ms Chong’s argument would, in my\n                    opinion, be splitting hairs. Regardless whether a company concedes at the start\n                    of proceedings or is found by the court subsequently that what it did was\n                    wrongful, it does not detract from the fact that the “something\n                    done” formed the basis for a claim. In any event, I did not think that\n                    such a requirement could be gleaned anywhere from Lord Reid’s definition\n                    (which is clear). One may ask if the “something done” must\n                    necessarily be “wrongful” to begin with (consider the case of a\n                    share option holder who has been recognised to be a contingent creditor of the\n                    company (seeIn re Compania de Electricidad de La Provincia\n                        de Buenos Aires Ltd[1980] 1 Ch 146,Re Gwalia Consolidated Ltd(1998) 27 ACSR 674 andRe Challenger Group Holdings Ltd(2003)\n                    48 ACSR 498)). The key as pointed out by Lord Guest inIn re Sutherland(see[48]above) (and followed by Richards J inIn re T & Nat (see[49]above)) is that the liability should arise automatically by\n                    operation of the law once the contingency or event occurs. This can certainly be\n                    said for the case at hand – MSL’s liability arose by operation of\n                    law once the High Court’s decision was reversed on appeal. Miss\n                    Chong’s argument would also suggest that the case inIn\n                        re T & Nwould be a stronger one than the present. I would,\n                    however, disagree. InIn re T & N, the\n                    potential asbestos claimants with contingent asbestos claims were held to be\n                    creditors, notwithstanding that they had yet to suffer any asbestos-related\n                    disease (and no one knew when this would ever occur); in other words, there was\n                    (at present) no damage or loss. However, in the present case, Pacrim had been\n                    deprived of its shares that were pledged to it as security. 53     For the reasons above, Pacrim was, in my view,\n                    a contingent creditor falling within the broad definition of\n                    “creditor” under s 210 at the material time. However,\n                    notwithstanding whether Pacrim was or not a contingent creditor at the material\n                    time, I was of the further opinion that Pacrim would, in any case, still fall\n                    within the definition of “creditor” in s 210. As seen, the\n                    definition in s 210 is wide and inclusive. Pacrim, having a statutory right\n                    of appeal whichhas been exercisedand which could\n                    potentially lead to a judgment against MSL, must necessarily be a person with a\n                    pecuniary claim capable of some estimate. Such a claim, as we have established,\n                    need not be legally due or immediately enforceable like a provable claim in\n                    winding up (see[28]–[29]above). 54     The purpose of s 210 as demonstrated is\n                    to provide a mechanism to obviate the need for a company to conduct messy and\n                    complicated series of negotiations with its creditors to win their (unanimous)\n                    approval to a variation or compromise of their rights (see[22]above). We have also seen that the aim of\n                    having schemes involving creditors in the first place is to avoid the fate of\n                    liquidation and to facilitate the financial rehabilitation of the company (see[23]above). Much uncertainty would be\n                    generated if a person who is maintaining a claim against the company in court\n                    (at whatever stage of proceedings including appeal) can be deemed to be a\n                    creditor at one moment and not at the other. For instance, consider the\n                    situation where a plaintiff’s claim against a company has been struck out\n                    by the court (say for breach of an unless order to comply with certain\n                    timelines) and an application has since been made by the plaintiff to set aside\n                    the judgment entered in default. Is the plaintiff a creditor for purposes of\n                    s 210? Does the plaintiff cease being a creditor as a result of a valid and\n                    binding judgment entered against him? There are simply many other possible\n                    permutations that one can think of, given the different stages of litigation and\n                    the many different applications it can entail. To hold a person to be a creditor\n                    at one stage of proceedings and not at the other would only generate uncertainty\n                    and would not serve the objectives of s 210. InOriental, Rajah JA stressed the importance of giving\n                    “due consideration to the overarching need for clarity, certainty and\n                    finality” in this area of the law (at [66]). It seems to me that to\n                    ensure certainty and to promote the aims of s 210, a person who has a claim\n                    in court that has not been finally disposed of should be treated as a\n                    “creditor” under s 210 of the Act. 55     Mr Maniam has forcefully (and\n                    persuasively) argued that to hold that Pacrim was not a creditor at the material\n                    time and was thus not bound by the Scheme would be highly unfair and prejudicial\n                    to the other creditors who had approved the Scheme as well as the present\n                    shareholders of the company. However, it should also not be forgotten that\n                    Pacrim was the “victim” in this whole episode and MSL’s\n                    refusal to register the transfer of the shares has been found to be wrongful on\n                    appeal. It was thus not without some sympathy for Pacrim that I found in favour\n                    of MSL on the preliminary issue. That said, Pacrimdidrecover the shares it was entitled to, albeit their numbers\n                    and value had fallen as a result of rather unfortunate (financial) circumstances\n                    (that could be said to be beyond anyone’s control). In so far as the\n                    preliminary issue turned on the construction of “creditor” in\n                    s 210 (as accepted by both parties), I was of the view that the outcome\n                    must be that Pacrim was for all intents and purposes a “creditor”\n                    under s 210 and was therefore bound by the Scheme. 56     My conclusion made it unnecessary for me to\n                    consider Mr Maniam’s suggestion that a person, though not a creditor\n                    within the definition of “creditor” in s 210, may\n                    nevertheless fall within the definition of a scheme creditor under a scheme and\n                    be consequently bound by the scheme (see[16]above). I will, however, express in brief some observations\n                    here on this question since it was raised and submissions were\n                made. 57     As I have mentioned, Mr Maniam submitted\n                    that since an approved scheme takes effect as an order of court, the terms of\n                    the scheme should be all that matters. Reliance was placed onBond Corporation. The following passage fromBond Corporation(at 476) would appear to support\n                    Mr Maniam’s contention: At first instance, at least, I think it must now be accepted that,\n                        whatever might be the true ambit of the term “creditors” in\n                        s 411(4) of the Corporations Law,once a scheme has\n                            been approved by order of the court it is the definition in the scheme\n                            that is the relevant definition, and persons who are creditors within\n                            the scheme definition are creditors for the purposes of the scheme and\n                            are bound by the scheme. This is because the scheme is, or\n                        has the effect of, an order of the court. Being an order of a superior court\n                        of unlimited jurisdiction, it is binding until set aside by some appropriate\n                        procedure … [emphasis added] 58     The Court of Appeal inOrientalendorsed the Australian approach that a scheme of\n                    arrangement derives its efficacy from the order of court approving the scheme\n                    and in fact operates as an order of court (see generally [58]–[69]).\n                    However, I do not think that it flows from this that the definition of scheme\n                    creditors in the scheme can supersede or override the definition of creditors in\n                    s 210. It is a trite principle that third parties to a scheme (such as\n                    non-creditors) are not bound by an approved scheme. The following passage fromAustralian Corporation Law(in vol 2 at\n                    para 5.1.0075) is instructive: Section 411 deals with a proposal between the company and its creditors or\n                        any class of them or its members or any class of them.It\n                            does not deal with arrangements purporting to bind third\n                            parties. Nevertheless it is clear that an arrangement between\n                        the company and its creditors or members is not outside the scope of the\n                        section merely because it is part of a wider scheme involving outsiders or\n                        an outsider is a necessary party to its implementation.The applicant will have to provide and independent contractual basis to\n                            bind an outsider to the scheme and not rely on the order of the court\n                            under s 411(4). [emphasis added] Ms Chong has also helpfully referred to a number of authorities\n                    that show that the court has no power to render a scheme binding upon a person\n                    who is not a creditor under the legislative provisions[note: 20]. I do not think that the\n                    court can sanction a scheme under s 210, which is theenablingprovision for schemes, where the scheme proposes to\n                    bind persons that are not creditors falling within s 210 in the first\n                    place. To do so would clearly exceed what s 210 permits. 59     Mr Maniam must have been aware of this\n                    hurdle and thus he did not (and rightly so) press the point too\n                far.",
        "Conclusion": "60     For all the reasons above, I found that Pacrim\n                    was a creditor under s 210 of the Act at the relevant time and was\n                    accordingly bound by the Scheme, with the consequence that its claim for damages\n                    is now extinguished. I therefore determined the preliminary issue in MSL’s\n                    favour. Parties agreed that the scale of costs for summary judgment applications\n                    would be a good gauge for costs in the present application. They also agreed\n                    that costs should be fixed at the higher end of the scale in view of the fact\n                    that substantial submissions on the law have been made. I therefore fixed the\n                    costs to MSL at $12,000.  [note: 1]Affidavit of Timothy James Reid, the Judicial Manager of MSL,\n                                    dated 22 February 2010 (“Timothy’s Affidavit”)\n                                at p 36. [note: 2]Timothy’s Affidavit at\n                                p 35. [note: 3]Timothy’s Affidavit at\n                                p 35. [note: 4]See\n                                Timothy’s Affidavit at para 56 and pp\n                            38–42. [note: 5]Affidavit of Low Ee Chin, Pacrim’s Chief Executive\n                                Officer, dated 22 February 2010 (“Low’s\n                                Affidavit”) at\n                para 26. [note: 6]Pacrim’s written submissions at\n                                para 1.4. [note: 7]Pacrim’s written submissions at\n                                para 1.5. [note: 8]Pacrim’s\n                                written submissions at para 3.3. [note: 9]See\n                                MSL’s written submissions at para 10 and MSL’s\n                                supplemental written submissions at\n                        para 3. [note: 10]Pacrim’s written submissions at\n                                para 1.1(d). [note: 11]Pacrim’s written submissions at\n                        para 3.25. [note: 12]MSL’s\n                                written submissions at paras 37–38. [note: 13]MSL’s written submissions at\n                            para 69. [note: 14]MSL’s further written submissions at\n                                    para 17. [note: 15]See also MSL’s written\n                                submissions at paras 24 and 42. [note: 16]MSL’s\n                                written submissions at para 112. [note: 17]MSL’s\n                                supplemental written submissions at\n                        para 34. [note: 18]Pacrim’s written submissions at\n                            para 3.44. [note: 19]Pacrim’s written submissions at\n                        para 3.35. [note: 20]See Pacrim’s further written submissions at paras\n                                2.11–2.23."
    }
}