{
    "case_title": "Norwest Holdings Pte Ltd (in liquidation)\n      v\n       Newport Mining Ltd",
    "ncitation": "[2010] SGHC 144",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1       This case concerned the sale by the liquidator\n                    of the plaintiff company, Norwest Holdings Pte Ltd (in\n                    liquidation)(“Norwest”) of the entire share capital of its\n                    wholly-owned subsidiary, Norwest Chemicals Pte Ltd (“Norwest\n                    Chemicals”), to the defendant, Newport Mining Limited\n                    (“Newport”). That sale was aborted as a consequence of the\n                    earthquake in Sichuan on 12 May 2008 and the events which followed.\n                    Norwest’s action was brought to recover the sum of $5.6475m as damages\n                    arising from Newport’s failure to complete the purchase of the entire\n                    share capital of Norwest Chemicals. Newport denied that there was a valid and\n                    binding contract of sale between itself and Norwest and counterclaimed for the\n                    return of the $102,500 deposit it placed with Norwest. On 4 November 2009,\n                    I delivered oral judgment dismissing Norwest’s claim and allowing\n                    Newport’s counterclaim. Norwest has since appealed against my decision. I\n                    now set out and elaborate upon the brief grounds I gave in my oral\n                    judgment. 2       I begin with a brief overview of the facts and the parties’ legal\n                    arguments. As stated, Norwest is in liquidation. Its principal asset is its\n                    shares (“the NC Shares”) in a wholly owned subsidiary, Norwest\n                    Chemicals who, in turn, is the sole shareholder of a Chinese company, Sichuan\n                    Mianzhu Norwest Phosphate Chemical Company Limited (“Norwest\n                    China”). Norwest China owns the mining rights to two phosphate rock mines\n                    (“the Mines”) for a period up to 2015. It also owns production\n                    facilities described in Norwest’s statement of claim as including,inter alia, a 30,000 metric tonnes per annum\n                    (“mtpa”) sodium and potassium phosphate production facility and a\n                    6,000 mtpa facility for acid production (“the Production\n                    Facilities”). The Production Facilities and the Mines are located in the\n                    Sichuan province of the People’s Republic of China (“PRC”).\n                    Specifically the Production Facilities are located in Hangwang, Mianzhu while\n                    the mines are located north of Mianzhu, approximately 45kim away from the\n                    Production Facilities. 3       Essentially, Newport had made a “Firm\n                    Letter of Offer” to buy the NC Shares for a price of $10.25m. Norwest\n                    argued that this was an offer in the legal sense capable of becoming a contract\n                    upon acceptance. Newport rejected the stance taken. It argued that the offer was\n                    made subject to the conclusion of a formal contract. In any event, it was common\n                    ground that, after Newport made the Firm Letter of Offer, a massive earthquake\n                    (“the Sichuan earthquake”) measuring 7.9 on the Richter scale\n                    struck the Sichuan province at 2.28 pm Singapore time on 12 May 2008. Two\n                    hours later, Norwest’s liquidator, Mr Lai Seng Kwoon, purported to\n                    accept the Firm Letter of Offer. Newport argued that even if the Firm Letter of\n                    Offer was an offer in the legal sense, it would have lapsed as a result of the\n                    damage wrought to Norwest China’s business, which was the underlying basis\n                    of the offer, by the Sichuan earthquake. Norwest argued that, as the sale was\n                    conducted on an “as is, where is” basis, and in any case was in\n                    relation to the NC Shares and not Norwest China’s business, Newport\n                    remained bound to complete. The deadline for completion, fixed for 1 June\n                    2008, came and went without the sale being completed. 4       After the sale of the NC shares fell through,\n                    Norwest’s liquidator sold the NC Shares to Norwest’s holding\n                    company, Hwa Hong Edible Oil Industries (“Hwa Hong”), for $4.5m.\n                    That sale to Hwa Hong was said to be in mitigation of Newport’s breach in\n                    failing to complete. I pause here to highlight that Hwa Hong was a creditor of\n                    about 90% (approximately $4.1m) of Norwest’s debts and a shareholder of\n                    49.5% of its shares. This meant that Hwa Hong did not need to pay much in cash\n                    for its purchase of the NC Shares and stood to gain as a contributory, a\n                    substantial portion of the sum of $5.6475m claimed as damages by Norwest in this\n                    action. Hwa Hong seems well aware of this – it is indemnifying\n                    Norwest’s liquidator for his prosecution of this action to the tune of\n                    $800,000. It is also worth noting that in May 2008 Norwest’s liquidator\n                    was already in contact with Mr Simon Ong, the Chief Financial Officer of\n                    Hwa Hong, on the status of the sale of the NC Shares to Newport.[note: 1]While this background is\n                    strictly irrelevant to the issues before me, I must say that Norwest’s\n                    sale of the NC Shares to Hwa Hong struck me as highly opportunistic and\n                    tactical.",
        "The liquidator’s sale of, and Newport’s “Firm\n                Letter of Offer” for the NC Shares on an “as is, where is”\n                basis": "5       I turn now to a more detailed examination of the\n                    facts surrounding the liquidator’s sale the NC Shares. As part\n                    Norwest’s liquidation, its liquidator produced an Information Memorandum\n                    providing details about Norwest Chemicals and Norwest China, as well as the\n                    basis and format of the proposed sale of the entire share capital of Norwest\n                    Chemicals. The Executive Summary in the Information Memorandum described Norwest\n                    Chemicals and Norwest China’s operations as follows:[note: 2] [Norwest Chemicals] was founded in 1996 with a stated mission “to\n                        become a vertically integrated manufacturer and supplier of phosphorous,\n                        phosphate chemicals and phosphorous derivatives under ISO9002 and ISO14001\n                        standards, delivering these products to the world through a seamless supply\n                        chain system”. [Norwest Chemicals] has a phosphorous production base in Sichuan, China,\n                        through its participation as a majority partner in a 60% – 40% joint\n                        venture with an existing phosphorous manufacturer. This allowed them to\n                        secure a supply of Yellow Phosphorous, the essential raw material to\n                        manufacture phosphate chemicals and phosphorous derivatives. In March 1997, [Norwest China] constructed a 30,000 MTPA Sodium and\n                        Potassium Phosphate production facility, based on technology acquired from\n                        Monsanto of the United States of America. Construction was completed in\n                        September 1998 and provided [Norwest China] with the ability to produce many\n                        different food and industrial grade sodium and potassium phosphate\n                        chemicals... To meet the increased demand for phosphoric acid to produce the\n                        downstream chemicals, [Norwest China] also built a 6,000 MTPA facility for\n                        acid production. ... In 2000, [Norwest China] became the first chemicals manufacturer in\n                        Mianzhu to be certified with both ISO 9001 and ISO 14001 Quality and\n                        Environmental Standards. In 2002, they acquire the mining rights to a 50,000\n                        MTPA phosphate rock mine for a period up to 2015. [Norwest China] was re-incorporated as a wholly-owned Foreign Enterprise\n                        on 26 September 2002, after [Norwest Chemicals] acquired all of the\n                        other partners’ equity. As can be seen from the description, Norwest China operated a\n                    vertically-integrated phosphate mining, processing and production business\n                    – a fact which was accepted by both sides. The business also included the\n                    sale of phosphorous, phosphate chemicals and phosphorous derivatives. For\n                    convenience, I will refer to the entire business of Norwest China as the\n                    “Chinese Business”. 6       The basis of the proposed sale of the NC Shares\n                    was described as follows:[note: 3] It is the intention of the liquidator to sell NC [ie, Norwest Chemicals] together with NC China [ieNorwest China] in its present state and condition\n                        on an “as is, where is” basis\n                        and subject to a Sale and Purchase Agreement. … Whilst all reasonable steps have been taken to ensure the accuracy of the\n                        information contained in this document, no warranty of its accuracy is given\n                        and the liquidator accept[s] no responsibility for any inaccuracy or\n                        omission. Interested and shortlisted parties will be given the opportunity\n                        to conduct their own independent investigations and due diligence at their\n                        own expense. [emphasis in original] 7       The proposed sale was advertised in a similar\n                    fashion in The Australian and the Business Times. The advertisements in both\n                    newspapers were identical and the material part read as follows:[note: 4] Strategic Acquisition Opportunity PRC based manufacturer of phosphorous phosphate chemicals and phosphorous\n                        derivatives. For sale on an “as is, where is” basis. The Liquidator is seeking buyers for a Singapore company who owns a\n                        phosphorous production base in Sichuan, China PRC. The plant has mining\n                        rights to a MTPA phosphate rock mine up to 2015. It is involved in the\n                        exploitation, production, process and sale of phosphorous ores, phosphorous,\n                        phosphate chemicals and other chemicals. The plant, built based on\n                        technology acquired from the USA, has production facilities with potential\n                        of 30,000 MTPA Sodium and Potassium Phosphate and 6,000 MTPA acid. 8       The structure of the sale process, together with\n                    timelines, was set out in a table in the Information Memorandum as\n                        follows:[note: 5] ItemProposed\n                                        DeadlineiInterested parties to revert\n                                            with an Expression of Interest on [Norwest Chemicals] in\n                                            the format as annexed hereto (see Appendix\n                                        A)6 April\n                                        2008iiLiquidator to inform\n                                            shortlisted parties of his intention to proceed with\n                                            them to the due diligence stage and to request them to\n                                            confirm their participation by submitting a refundable\n                                            Cashier’s Order equivalent to 1% of their proposed\n                                            offer or S$25,000, whichever is\n                                    higher.15 April\n                                        2008iiiShortlisted parties to reply\n                                            to the Liquidator’s invitation to proceed to due\n                                            diligence stage by the remittance of a refundable\n                                            cashier’s order amounting to 1% of their proposed\n                                            preliminary offer or S$25,000, whichever is higher.\n                                            Shortlisted parties are also required to submit a list\n                                            of documents that they would like to inspect at the due\n                                            diligence process.22 April\n                                        2008ivDue diligence in Singapore\n                                            and China.28 April 2008 –\n                                            11 May 2008vInterested parties to\n                                            deliver to the Liquidator a firm letter of offer in the\n                                            format as annexed hereto (see Appendix\n                                        B).16 May\n                                        2008viLiquidator responds with\n                                            acceptance subject to agreement on terms and conditions.\n                                            Negotiation and conclusion of Sale and Purchase\n                                            Agreement with successful bidder.23 May 2008 –\n                                            3 June 2008viiTransfer of title in\n                                            [Norwest Chemicals] and close of\n                                    sale.13 June\n                                        2008   9       The template “Firm Letter of\n                    Offer” in Appendix B, referred to in item (v) of the sale format, and the\n                    material part read as follows:[note: 6] We have conducted our independent assessment and we hereby offer to\n                        purchase the shares held by you in Norwest Chemicals Pte Ltd at Singapore\n                        Dollars ___________, subject to the terms and conditions in the Sale and\n                        Purchase Agreement. In the event our offer is accepted, we agree to the aforesaid purchase\n                        price and will pay the balance of the purchase price, less the\n                        Cashier’s Order of Singapore Dollars ___________ that has been\n                        submitted to you, in accordance to the terms and conditions set out in the\n                        Sale and Purchase Agreement. This offer is irrevocable and is valid for a period of 45 days from the\n                        closing date of the offer on 16 May 2008. 10     Newport is a mining and resource exploration\n                    company listed on the Australian Securities Exchange. On 27 February 2008,\n                    Newport first expressed an interest in acquiring the entire share capital of\n                    Norwest Chemicals, through Michael Cawley of Taylor Collison Limited, an\n                    Australian financial services firm.[note: 7]Simon Taylor, a director of\n                    Newport who is a geologist by training, also became involved in the negotiations\n                    process. In the bid process, Messrs Taylor and Cawley worked with David Argyle,\n                    a shareholder and director of Norwest who has considerable experience in the\n                    mining and resource industry. Messrs Taylor, Cawley and Argyle all gave evidence\n                    on behalf of Newport at trial. For convenience and ease of understanding, I will\n                    refer to the negotiations as occurring between Norwest’s liquidator and\n                    Newport and identify individuals only when necessary. 11     On 4 April 2008, Newport submitted its\n                    Expression of Interest in the form of Appendix A of the Information Memorandum,\n                    formally indicating its interest in purchasing the NC Shares for $5.5m. This was\n                    the first time Newport indicated a price. The material part of the Expression of\n                    Interest read as follows:[note: 8] Based on the information currently made available to us, we hereby submit\n                        to you an Expression of Interest in the shares held by Norwest Holdings Pte\n                        Ltd (in liquidation) in Norwest Chemicals Pte Ltd on an “as is, where\n                        is” basis for an amount of Singapore Dollars S$5,500,000. This Expression of Interest is made on the condition that in acquiring the\n                        shares of Norwest Chemicals Pte Ltd, we will gain 100% control of Sichuan\n                        Mianzhu Norwest Phosphate Chemicals Co Ltd, a 100% subsidiary owned by\n                        Norwest Chemicals Pte Ltd. … In the event we should make a firm offer for Norwest Chemicals Pte Ltd and\n                        this offer is in turn accepted by you, we agree to pay the balance of the\n                        purchase price (less [the 1% deposit already paid]) in accordance to the\n                        terms and conditions set out in the Sale and Purchase Agreement. 12     Around 16 April 2008, Norwest’s\n                    liquidator began to make arrangements for Newport to carry out due diligence on\n                    Norwest China and the Chinese Business.[note: 9]In particular, site visits were\n                    arranged; however, Newport’s attempts to visit the Mines were twice\n                    aborted because of landslides which temporarily prevented vehicular access to\n                    the Mines. Most of the accounts of Norwest Chemicals and Norwest China were also\n                    made available for Newport’s inspection. On 2 May 2008, Newport\n                    submitted its Firm Letter of Offer in the template in Appendix B of the\n                    Information Memorandum (with some amendments which I shall come to in a moment),\n                    offering to purchase the NC Shares for $10m.[note: 10]In the cover letter for the Firm Letter\n                    of Offer, Newport indicated that it was willing to consider revising its offer\n                    upwards if (a) Norwest China resolved its ongoing litigation and secured the\n                    release of its “frozen” bank accounts, and (b) that Newport be\n                    allowed to review the accounts for Norwest Chemicals and Norwest China for the\n                    past 3 years.[note: 11]Norwest’s liquidator acted to accommodate those requests and on 9 May\n                    2008 Newport submitted a second Firm Letter of Offer for $10.25mviaemail which material part read as follows: Dear SK Please find attached Newport Mining’sREVISEDfirm offer of S$10.25 million for the Norwest\n                        Chemicals Shares. We look forward to receiving your formal response to our letter. [emphasis original] A cover letter dated 9 May 2008 was attached to the same email\n                    and it read as follows:[note: 12] Dear Sir, The Directors of [Newport] are pleased to provide our revised Firm Letter\n                        of Offer for the Norwest Chemicals Pte Ltd shares in the format set out in\n                        Appendix B of the Information Memorandum you have provided. Our initial offer was Singapore Dollars Ten Million and Newport is now\n                        submitting its revised Firm Letter of Offer of Singapore Dollars Ten Million\n                        Two Hundred Fifty Thousand Dollars (S$10,250,000). Newport has submitted this revised Firm Letter of Offer in good faith and\n                        confirms that we have sufficient funding to complete this transaction in\n                        line with our initial letter dated 2 May 2008. We look forward to receiving your formal response to our offer. 13     Newport’s second Firm Letter of Offer\n                    contained some changes from the original template provided in the Information\n                    Memorandum and it read as follows (with the changes emphasised):[note: 13] We have conducted our independent assessment of the available information\n                        and we hereby offer to purchase the shares held by you in Norwest Chemicals\n                        Pte Ltd at Singapore Dollars 10,250,000 (ten million two hundred and fifty\n                        thousand) subject to the terms and conditions in the Sale and Purchase\n                        Agreementto be negotiated. In the event our offer is accepted, we agree to the aforesaid purchase\n                        price and will pay the balance of the purchase price, less the\n                        Cashier’s Order of Singapore Dollars 55,000 (fifty five thousand) that\n                        has been submitted to you, in accordance to the terms and conditions set out\n                        in the Sale and Purchase Agreementto be\n                            negotiated. This offer is irrevocable and is valid for a period of 45 days from the\n                        closing date of the offer on2 May\n                        2008. [emphasis added] 14     The same changes were also made in the first\n                    Firm Letter of Offer submitted by Newport. For convenience, I will refer to the\n                    second Firm Letter of Offer of 9 May 2008 – which is the document in\n                    issue – as the “9 May Offer”. As can be seen from the\n                    quotation above, the 9 May Offer was stated to be irrevocable and valid for\n                    a period of 45 days. 15     The basis of Newport’s interest in the\n                    NC Shares was explained by Mr Taylor in his evidence-in-chief as\n                        follows:[note: 14] … the acquisition of [Norwest Chemicals] … presented the\n                        opportunity of acquiring a phosphate mining and processing business that was\n                        already in operation and creating revenue. In my opinion, it was important\n                        for [Newport] to acquire a cash generating business to enable [Newport] to\n                        differentiate itself from the other exploration companies listed on the ASX.\n                        This was one of the main attractions of the [Norwest Chemicals] acquisition\n                        to [Newport]. In the case of [Norwest Chemicals], the [Mines] had already proven the\n                        capable of producing phosphate rock… As the Information Memorandum itself notes, the Mines still had the\n                        potential to yield even more phosphate rock, as it had not reached its\n                        maximum stated production capacity of 100,000 mtpa. The mining rights lasted\n                        until December 2015… … As for the [Production Facilities], it was capable of refining the\n                        phosphate rock into a variety of phosphate products, including yellow\n                        phosphorous, phosphoric acid, sodium hexametaphosphate and sodium\n                        tripolyphosphate. Like the Mines, the [Production Facilities] were producing\n                        these downstream phosphate products at healthy figures, but not at 100%\n                        capacity… Based on [the figures provided in the Information Memorandum], it appeared\n                        that NCPL was a potentially good investment opportunity for the\n                        Defendant. 16     On 12 May 2008 (ie, three days after the 9 May Offer was sent), at\n                    2.28 pm Singapore time, the Sichuan earthquake, which as said measured 7.9\n                    on the Richter scale, struck. Judicial notice may be taken of the severity of\n                    the Sichuan earthquake from the following description of the general effect of\n                    the earthquake on the United States Geological Survey webpage:[note: 15] At least 69,195 people killed, 374,177 injured and 18,392 missing and\n                        presumed dead in the Chengdu-Lixian-Guangyuan area. More than 45.5 million\n                        people in 10 provinces and regions were affected. At least 15 million people\n                        were evacuated from their homes and more than 5 million were left homeless.\n                        An estimated 5.36 million buildings collapsed and more than 21 million\n                        buildings were damaged in Sichuan and in parts of Chongqing, Gansu, Hubei,\n                        Shaanxi and Yunnan. The total economic loss was estimated at 86 billion US\n                        dollars. Beichuan, Dujiangyan, Wuolong and Yingxiu were almost completely\n                        destroyed. Landslides and rockfalls damaged or destroyed several mountain\n                        roads and railways and buried buildings in the Beichuan-Wenchuan area,\n                        cutting off access to the region for several days. At least 700 people were\n                        buried by a landslide at Qingchuan. Landslides also dammed several rivers,\n                        creating 34 barrier lakes which threatened about 700,000 people downstream.\n                        A train was buried by a landslide near Longnan, Gansu. At least 2,473 dams\n                        sustained some damage and more than 53,000 km of roads and 48,000 km of tap\n                        water pipelines were damaged. About 1.5 km of surface faulting was observed\n                        near Qingchuan, surface cracks and fractures occurred on three mountains in\n                        the area, and subsidence and street cracks were observed in the city itself.\n                        Maximum intensity XI was assigned in the Wenchuan area. Felt (VIII) at\n                        Deyang and Mianyang; (VII) at Chengdu; (VI) at Luzhou and Xi'an; (V) at\n                        Chongqing, Guozhen, Lanzhou, Leshan, Wu'an, Xichang and Ya'an. Felt in much\n                        of central, eastern and southern China, including Beijing, Guangzhou, Hefei,\n                        Nanjing, Shanghai, Tianjin, Wuhan and Hong Kong. Also felt in parts of\n                        Bangladesh, Taiwan, Thailand and Vietnam. Seiches were observed at\n                        Kotalipara, Bangladesh. Specifically, the epicentre of the earthquake was 94 km from the\n                    Production Facilities, which were located at Hanwang Town – a district of\n                    Mianzhu City. As mentioned, it was not disputed that the assets of the Chinese\n                    Business were damaged as a result of the Sichuan earthquake. However, as the\n                    significance of the damage to the Chinese Business was disputed by the parties,\n                    I will refer to the details later on. 17     Roughly two hours after the Sichuan earthquake\n                    (4.20 pm Singapore time) the secretary to Norwest’s liquidator sent an\n                    email attaching the liquidator’s letter addressed to Newport purporting to\n                    accept the 9 May Offer.[note: 16]In the same letter, Norwest’s\n                    liquidator reminded Newport that the timeline for the completion of the sale had\n                    earlier (on 10 April 2008) been moved forward to 1 June 2008 from\n                    13 June 2008.[note: 17]The liquidator said in his affidavit\n                    of evidence-in-chief that he did not know about the Sichuan earthquake when he\n                    purported to accept the 9 May Offer.[note: 18]He was\n                    not challenged on this aspect of his evidence, even though the timing of his\n                    purported acceptance could have raised a brow or two. 18     One day later, on 13 May 2008, Newport\n                    emailed Norwest’s liquidator, the material part of the email read as\n                        follows:[note: 19] Thank you for your letter of acceptance. We will work towards the deadline\n                        of 1 June 2008 as per the original schedule. I will give you details of our lawyers shortly. 19     In the same email, Newport also asked the\n                    liquidator to advise on the condition of the Mines and Production Facilities. On\n                    the next day, 14 May 2009, Newport paid $47,500, being the outstanding\n                    portion of the required 1% deposit of $102,500, to Norwest.[note: 20]It was not disputed, and I\n                    think it cannot be disputed, that at the time of payment, which was only two\n                    days after the Sichuan earthquake, Newport was not aware of the actual extent of\n                    damage to the Mines and Production Facilities. On 15 May 2008, Newport\n                    again asked the liquidator for information on the casualties and damage suffered\n                    by the Chinese Business. Mr Taylor testified that the information: was necessary to assess the impact of the earthquake on production\n                        capacities of the [Production Facilities] and [the Mines], environmental\n                        issues, [Norwest China’s] ability to produce cash flow and service its\n                        debt requirements, the impact of the earthquake damage on the mining\n                        licences, as well as [Norwest China’s] ability to remain a going\n                        concern. ... [A]ccording to the Information Memorandum, the licences may be\n                        contingent upon continued operation of the [Production\n                            Facilities].[note: 21] 20     Norwest’s liquidator had on 13 May\n                    2008 said in an email to Newport, that he “ha[d] not been able to\n                    establish any contact with the people there [ie,\n                    in the PRC] as the phone lines are apparently down” but that he would\n                    keep Newport informed.[note: 22]However, no information was subsequently supplied. In the absence of any\n                    information from the liquidator, Mr Argyle, together with Lee Gray, a\n                    Chengdu accountant who was part of Newport’s due diligence team, visited\n                    the site to assess the damage.[note: 23]Subsequently, Newport assessed that, because of the damage wrought by the\n                    Sichuan earthquake, the Chinese Business was no longer in the same state and\n                    condition as at the time of the 9 May Offer. Mr Taylor said in his\n                    evidence-in-chief that:[note: 24] On the evidence that [Newport] had available, it became increasingly clear\n                        that the basis upon which [Newport’s] offer was made – the\n                        [Production Facilities] and [the Mines’] production capacities –\n                        had been severely affected, if not completely disrupted, by the devastating\n                        effect of the earthquake. [Newport] thus decided not to go ahead with the\n                        transaction. … Furthermore, in this case, the [Mines] and [Production Facilities] were\n                        not operational. This obviously had a significant impact on the cash flow of\n                        Norwest China, as well as the ability of Norwest China to service the debt\n                        of RMB 27 million. If the [Mines] and [Production Facilities] could generate\n                        no cash flow, there was obviously no basis for [Newport] to acquire [Norwest\n                        Chemicals] just to be saddled with a large debt. 21     On 3 June 2008, Newport’s\n                    solicitors informed Norwest’s then-solicitors that Newport would not be\n                    going ahead with the purchase of the NC Shares. According to Newport’s\n                    solicitors, there was no binding and enforceable contract between the parties in\n                    the first place. Further, the 9 May Offer was “premised on the basis\n                    that the aforesaid mines, factory and/or their surrounding infrastructure would\n                    remain in the same condition at the time of acceptance and/or contract as at the\n                    time of the offer.”[note: 25]This basis was undermined\n                    by the Sichuan earthquake, and as a result the 9 May Offer was no longer\n                    capable of acceptance after 2.28 pm on 12 May 2008 – the time in\n                    Singapore at which the Sichuan earthquake occurred. 22     As mentioned, Norwest then purported to\n                    mitigate its loss of bargain by selling the NC Shares to its (Norwest’s)\n                    parent company, Hwa Hong, for $4.5m. Hwa Hong’s Firm Letter of Offer was\n                    dated 25 July 2008 and was accepted by Norwest’s liquidator on\n                    29 July 2008.[note: 26]The sale was completed on 1 August 2008\n                    when Norwest transferred the NC Shares to Hwa Hong’s nominee.[note: 27]Norwest then\n                    brought suit against Newport for $5.6475m – that sum being the difference\n                    between Newport’s price ($10.25m), the sum of the mitigation price ($4.5m)\n                    and the 1% deposit already paid by Newport ($102,500).",
        "Newport’s application to amend its defence": "23     In this suit, Newport was represented by\n                    Mr Ang Cheng Hock SC. After the trial, Mr Ang applied by way of\n                    Summons No 4559 of 2009 to amend para 26 of Newport’s defence as\n                    follows (with the amendments underlined): Further and alternatively, the Defendant avers that, even if the\n                        9 May 2008 Letter constituted a valid legal offer capable of acceptance\n                        (which is denied),the offer was subject to an implied\n                            condition that the Mining Facilities would remain in substantially the\n                            same condition as when the offer was made. The extensive\n                        damage caused to the Mining Facilities by the Earthquake, and the severe\n                        difficulties involved in attempting to resume normal operations at the\n                        damaged Mining Facilities after the Earthquake,resulted\n                            in the implied condition to the offer being fulfilled, and/ordestroyed the underlying basis upon which the offer was made and/or rendered\n                        the underlying basis essentially or radically different, such that the offer\n                        was no longer capable of being accepted by the Plaintiff. 24     I heard the application in chambers on\n                    15 October 2009 just before parties made their closing submissions in open\n                    court. Counsel for Norwest, Mr David Chan, did not oppose Newport’s\n                    application to amend, but commented that para 26 appeared to raise an issue\n                    of common mistake, which he had prepared to meet. Mr Ang clarified and\n                    confirmed that Newport was not pleading common mistake, and in particular the\n                    averment in para 26 that the Sichuan earthquake “destroyed the\n                    underlying basis upon which the offer was made and/or rendered the underlying\n                    basis essentially or radically different” was not to be read and\n                    understood as raising common mistake. Mr Ang further clarified that\n                    Newport’s case was founded on an implied condition as pleaded in the\n                    amended para 26. I allowed the application with costs to Norwest, which I\n                    fixed at $2,000.",
        "The first issue: whether a binding contract was formed immediately\n                upon Norwest’s acceptance of Newport’s 9 May Offer – the\n                “subject to contract” defence": "25     I turn now to the substantive issues raised by\n                    the parties. The first issue, which I broadly referred to as the “subject\n                    to contract” defence in my oral judgment, concerns whether the 9 May\n                    Offer was an offer in the legal sense and thereby capable of forming a binding\n                    contract upon Norwest’s acceptance of the May Offer. The issue arises from\n                    the express wording in the 9 May Offer – in particular, the\n                    Newport’s Australian solicitors' amendment to the template Firm Letter of\n                    Offer to provide that it was “subject to the terms and conditions in the\n                    Sale and Purchase Agreementto be\n                    negotiated” instead of simply “subject to the term and\n                    conditions in the Sale and Purchase Agreement”. Mr Ang on behalf of\n                    Newport submitted that, as a result of this addition, the 9 May Offer was\n                    not an offer in the legal sense, but a non-binding offer made subject to\n                    contract. Mr Ang also referred to item (vi) of the table in the Information\n                    Memorandum (set out at[8]above), which\n                    stated that the liquidator’s acceptance was “subject to agreement\n                    on terms and conditions” – with the negotiation and conclusion of\n                    the Sale and Purchase Agreement being the next step. 26     In response, Mr Chan submitted that the\n                    deliberate addition of the phrase “to be negotiated” did not in\n                    this case have the effect of deferring the formation of a binding contract as\n                    there were no significant matters requiring further agreement between the\n                    parties. Mr Ang disagreed, arguing that there were conditions precedent of\n                    importance to Newport that remained to be negotiated and agreed, referring in\n                    this regard to Mr Taylor’s evidence on the various terms required by\n                        Newport,[note: 28]and also to\n                    Mr Cawley’s testimony to similar effect.[note: 29] 27     Essentially, the parties’ arguments\n                    raised two questions, which they appear to have conflated: (1) whether, after\n                    Norwest’s purported acceptance of Newport’s 9 May Offer, there\n                    remained essential issues on which the parties had yet to agree upon, such that\n                    no contract could arise; and (2) whether Newport in the 9 May Offer evinced\n                    an intention to enter into legal relations immediately upon Norwest’s\n                    acceptance instead of deferring the creation of legal relations until a formal\n                    and complete contract was drawn up. The two questions are based on distinct\n                    requirements for the formation of a contract. Question (1) concerns the\n                    requirement for substantial agreement between the parties. Question (2) concerns\n                    the separate requirement that the parties must intend to create legal relations.\n                    The two requirements are related in the limited sense that, in the commercial\n                    context, a substantially complete agreement may give rise to aprima facieinference, which may be confirmed or\n                    displaced by other facts, that legal relations are intended. More generally,\n                    however, the requirements are, nonetheless, distinct and the fulfilment of one\n                    does not necessarily entail the fulfilment of the other: parties may reach\n                    complete agreement but defer the creation of legal relations between them until\n                    the occurrence of some formality or other event; or they may ostensibly agree\n                    with all formalities but omit to address essential matters thereby creating\n                    uncertainties or incompleteness. With that clarification, I turn to address\n                    questions (1) and (2) in turn.",
        "Question 1: whether substantial agreement was reached": "28     Cases such asMay and\n                        Butcher, Limited v The King[1934] 2 KB 17 illustrate\n                    that an agreement will not be regarded as a binding contract if essential\n                    matters, without which the contract is too uncertain or incomplete to be\n                    workable, remain to be agreed upon. Conversely put, the parties must reach\n                    substantial or essential agreement before a contract can be regarded as\n                    concluded. At the same time, it should be emphasised that what is required is\n                    substantial or essential agreement and not complete agreement. A contract may be\n                    regarded as having been formed even though it has not been worked out in\n                    meticulous detail. Similarly if a contract calls for further agreement between\n                    the parties, the absence of further agreement between the parties will vitiate\n                    the contract only if it makes it unworkable or void for uncertainty. Here it is\n                    helpful to refer to the pertinent part of Lloyd LJ’s summary of the\n                    applicable principles inPagnan S.p.A v Feed Products\n                        Ltd[1987] 2 Lloyd’s Rep 601 (at 619): (4) … the parties may intend to be bound forthwith even though\n                        there are further terms still to be agreed or some further formality to be\n                        fulfilled (seeLove and Stewart v Instone[(1917) 33 TLR 475] per Lord Loreburn at p 476). (5) If the parties fail to reach agreement on such further terms, the\n                        existing contract is not invalidated unless the failure to reach agreement\n                        on such further terms renders the contract as a whole unworkable or void for\n                        uncertainty. (6) … It is for the parties to decide whether they wish to be bound\n                        and, if so, by what terms, whether important or unimportant. It is the\n                        parties who are, in the memorable phrase coined by the Judge, “the\n                        masters of their contractual fate.” Of course, the more important the\n                        term is the less likely it is that the parties will have left it for future\n                        decision. But there is no legal obstacle which stands in the way of the\n                        parties agreeing to be bound now while deferring important matters to be\n                        agreed later. It happens every day when parties enter into so-called\n                        “heads of agreement”. See alsoChitty on Contracts, Vol 1\n                    (Sweet & Maxwell, 30thed, 2008) at\n                    paras 2-113 and 2-128 (“Chitty”). Whether substantial or essential agreement has been\n                    reached is a question of fact to be decided with regard to all the circumstances\n                    of the parties’ dealings with each other, including in particular the\n                    nature of the transaction envisaged by the parties. It is worthwhile to bear in\n                    mind Lloyd LJ’s reminder inPagnanthat, in deciding whether a matter is essential, it is the intention of the\n                    parties, and not the opinion of the court, which is decisive. 29     On the facts in evidence, the parties had\n                    agreed on several points. They agreed to transfer all the NC Shares to Newport.\n                    They agreed on the price,ie, $10.25m. They agreed\n                    on the allocation of risk – the 9 May Offer stated that the\n                    transaction was based on Newport’s independent assessment of the available\n                    information, and the Information Memorandum and Expression of Interest similarly\n                    stated that the transaction was on an “as is, where is” basis (a\n                    point to which I will return later on). In other words, the parties had agreed\n                    on the price, subject-matter, and risk, when Norwest accepted Newport’s\n                    9 May Offer. These factors are obviously the most essential matters in a\n                    sale and purchase transaction – anda\n                        fortioriin the case of a liquidation sale on an “as is,\n                    where is” basis. As Andrew Stilton writes inSale of\n                        Shares and Businesses: Law, practice and agreements,\n                        2nded (London: Sweet & Maxwell, 2006) at\n                    p 445, buyers in a liquidation sale have to accept that in such transaction they will be buying “as\n                        seen” and will have no come-back if for example any of the assets of\n                        the business are subject to an encumbrance in favour of a third party or are\n                        in a poor state of repair and condition or even if there are assets which\n                        the buyer thinks that he is buying but which he never actually manages to\n                        get his hands on – for example there may be plant which appears in a\n                        plant register but which has in fact been scrapped. 30     In short, there is no place for the extensive\n                    representations, warranties and guarantees which might be found in normal sale\n                    and purchase agreements. In this regard, I accepted the liquidator’s\n                    evidence that he was selling the NC Shares on an “as is, where is”\n                    basis and was in no position to give any warranty or representation. There was\n                    no contemporaneous evidence to show that the list of matters which\n                    Mr Taylor said remained to be negotiated between the parties were raised\n                    with Norwest’s liquidator or in the actual contemplation of Newport at the\n                    relevant time. The list seemed to be createdex post\n                        factofor the purposes of this litigation. I was also unconvinced\n                    by Mr Cawley’s evidence that Newport would possibly not have\n                    contracted to buy the NC Shares if it was not made a condition precedent that\n                    the shares were free from encumbrances.[note: 30]The truth\n                    of the matter was that Norwest’s liquidator had made it known from the\n                    outset in drafting the Information Memorandum and again in his letter dated\n                    10 April 2008,[note: 31]that\n                    he could not commit Norwest to any warranties or undertakings. Mr Taylor,\n                    on his part, confirmed in cross-examination that he had seen that letter and\n                    that the 9 May Offer was made on the understanding that the liquidator was\n                    not in a position to give any warranties.[note: 32] 31     In the circumstances, I found that the parties\n                    did reach substantial agreement when Norwest accepted Newport’s 9 May\n                    Offer on 12 May 2008. It would have been only incomplete as to the\n                    mechanics of the sale, and that would not prevent any contract from coming into\n                    existence as the mechanics could easily be supplied by the court having regard\n                    to what is usual and reasonable in the circumstances (seeChitty, at paras 2-113 to 2-114 and 2-128).",
        "Question 2: whether legal relations were intended": "32     I turn to question (2),ie, whether Newport intended to enter into legal relations with\n                    Norwest immediately upon the latter’s acceptance of the 9 May Offer.\n                    As stated, Mr Ang argued that there was no offer in a legal sense because\n                    Newport’s 9 May Offer was made “subject to the terms and\n                    conditions in the Sale and Purchase Agreement to be negotiated” (see[13]above). 33     Before addressing this argument, it is\n                    necessary to deal with some of the evidence Mr Ang relied on: specifically,\n                    the minutes of a meeting of Newport’s board of directors purporting to\n                    record the understanding that Newport’s 9 May Offer was ‘still\n                    subject to the signing of a “Sale and Purchase\n                        Agreement”’[note: 33]and certain emails between\n                    Norwest’s liquidator and Mr Ong of Hwa Hong, whose contents\n                    Mr Ang read to mean that Norwest’s liquidator doubted that an offer\n                    in the legal sense had been made to Norwest. It is convenient to reproduce the\n                    email thread here.[note: 34]The email thread began with the\n                    liquidator forwarding Newport’s email of 13 May 2008 (reproduced at[18]above) thanking the liquidator for\n                    his “letter of acceptance” to Mr Ong, with the following\n                    message added: :-) Please update. Tks. Mr Ong replied: Please see attached revised draft [of the Sale and Purchase Agreement]\n                        with our lawyers comment. Our lawyers have also asked for an undertaking to\n                        be executed, a soft of the draft is attached for your attention. Please see if you can get them [ie, Newport]\n                        to put in a non refundable deposit of $2 million. We have been advised that\n                        it is vital to get their commitment as there will be no time to react to\n                        developments to preserve the value of Norwest if they walk away on\n                        1 June 2008. Norwest’s liquidator replied: Simon, I will push. I think we should also be mindful that we don’t really\n                        have any alternative at this stage. SK Mr Ong replied: Thank you. Please keep me informed as our Board has taken an interest in this and I\n                        have to take further instructions if there are any problems in terms of\n                        receiving the deposit on Thursday and also the completion of the transaction\n                        on 1 June 2008. We have to take steps to preserve the value of the business. 34     It must be stated that, in finding an\n                    intention to enter into legal relations, and more generally, an intention to\n                    make or accept an offer, the law is predominantly concerned with the objective\n                    intentions of a party, and not his subjective or actual intentions (seeeg Projection Pte Ltd v The Tai Ping Insurance Co\n                        Ltd[2001] 1 SLR(R) 798 at [15]). Specifically, the\n                    objective approach determines a party’s intentions by looking at all of\n                    his words and conduct directed towards his counterparty from the perspective of\n                    a reasonable man versed in business. The obvious rationale for the objective\n                    approach is to enable parties to deal in reliance on each others’ manifest\n                    intentions. It follows from this rationale that there is an exception to the\n                    objective approach where a party’s actual intention differs from his\n                    apparent intention,andthis isactuallyknown to his counterparty. 35     On the facts, I rejected as irrelevant the\n                    minutes of the Newport board mentioned at[33]above to finding Newport’s intention, if any, to\n                    enter into legal relations. The minutes of Newport’s board were an\n                    internal document of Newport which was not known to Norwest, which to all\n                    appearances dealt with Newport at arm’s length. They would not therefore,\n                    be relevant to deciding whether or not Newport evinced an intention to enter\n                    into legal relations. In any case not much weight could be given to the minutes,\n                    since they were only signed by Mr Taylor on 29 August 2008, when the\n                    relationship between the parties had already turned adversarial. 36     As for the emails between Norwest’s\n                    liquidator and Mr Ong, they did not, in the first place, evinced any kind\n                    of belief on the liquidator’s part that Newport did not mean to make an\n                    offer. Rather, Mr Ong and the liquidator seemed to be concerned that\n                    Newport might walk away from the bargain it made, and that the mechanics of the\n                    transaction, which remained to be agreed, should be structured to guard against\n                    this possibility. This was a practical concern which had nothing to do with\n                    whether Mr Ong and Norwest’s liquidator believed that Newport\n                    intended to enter into legal relations. I have earlier held that the absence of\n                    mechanics did not prevent an agreement from arising. In any case, the subjective\n                    beliefs of the liquidator, whatever they might be, were irrelevant since they\n                    were not shown to arise from any knowledge of Newport’s actual\n                    intention. 37     Returning to the question whether Newport\n                    intended to enter into legal relations with Norwest immediately upon the\n                    latter’s acceptance of the 9 May Offer, I took into account the\n                    following facts: (a)     First, the structure of the bidding\n                        process, as set out in the table in the Information Memorandum (reproduced\n                        at[8]above), appears to contemplate the\n                        9 May Offer as the stage where legal relations are created.\n                        Specifically, the stage represented by the 9 May Offer stands in\n                        contrast to the Expression of Interest stage, not only in the label attached\n                        to each stage, but also in the fact that “acceptance” by the\n                        liquidator may occur at the Firm Letter of Offer stage. (b)     Second, the language that Newport used\n                        in the correspondence accompanying the 9 May Offer was compatible with\n                        an intention to create legal relations immediately upon Norwest’s\n                        acceptance. A cover letter with a distinctly formal format and tone was\n                        attached in contrast to the relatively informal tone that characterised the\n                        prior discussions between the parties. In the email (see[12]above), Newport referred to the\n                        attachment in its own words as a “firm offer”. Also, both the\n                        email and the cover letter stated that Newport looked forward to receiving\n                        Norwest’s “formal response”. All this would not be\n                        necessary, and would indeed be rather incongruous, if the 9 May Offer\n                        was only an intermediate step in the process with no legal significance of\n                        its own. (c)     Thirdly, a holistic view of the 9 May Offer points towards an\n                        intention to create legal relations. Here it should be emphasised that\n                        Newport did not plainly and distinctly invoke the formula “subject to\n                        contract”; its amendment to the template Firm Letter of Offer was\n                        rather ambiguous. If the formula “subject to contract” had\n                        been invoked in a separate and distinct part of the document to make the\n                        9 May Offer plainly subject to contract, the court would require very\n                        strong and exceptional circumstances to displace the settled business\n                        meaning of the phrase, which was to delay the creation of legal relations\n                        until a formal contract was signed (seeChillingworth v\n                            Esche[1924] 1 Ch 97; andAlpenstow Ltd v Regalian Properties plc[1985]\n                        1 WLR 721). But it was not; the 9 May Offer was made to\n                        purchase the NC Shares “subject to the terms and conditions in the\n                        Sale and Purchase Agreement to be negotiated”, with the phrase\n                        “to be negotiated” added by Newport (see[13]above). In my view, the phrase,\n                        objectively read, meant that the purchasewould take\n                            placein accordance with the terms and conditions in the\n                        eventual Sale and Purchase Agreement, which were, as Newport stipulated,\n                        “to be negotiated.” This reading is fortified and confirmed by\n                        the second paragraph of the 9 May Offer, which stated that “In\n                        the event [Newport’s] offer is accepted, [Newport] agree[s] to the\n                        aforesaid purchase price andwill pay the\n                            balance, less the [deposit] that has been submitted to you,in accordance to the terms and conditions set out in\n                            the Sale and Purchase Agreement to be negotiated”\n                        (emphasis added). The wording of the second paragraph makes clear that,\n                        while the precise mechanics were to be negotiated, there would be a binding\n                        obligation on Newport to pay the balance of the price once Norwest accepted\n                        the offer – Newport “willpay the\n                        balance” (emphasis added). It would be inconsistent, therefore, to\n                        read the first paragraph as delaying the creation of legal relations until a\n                        formal contract was signed, and since there was a viable alternative\n                        (mentioned above) I declined to do so. In my view, Newport’s unwieldy\n                        amendment to the template Firm Letter of Offer served only to highlight the\n                        need to negotiate and formalise the mechanics of the sale and purchase of\n                        the NC Shares; it failed to make any agreement between the parties\n                        “subject to contract” in the technical sense of the term, if\n                        indeed that was Newport’s intention. (d)     Fourthly, some weight could be given to the\n                        fact, which I have found at[31]above,\n                        that the parties had in fact reached agreement on the essential aspects of\n                        the transaction – the sale and purchase of the NC Shares on an\n                        “as is, where is” basis at a price of $10.25m. (I will later\n                        on deal with the implications of the fact that the transaction was on an\n                        “as is, where is” basis). (e)     Fifthly, there is the fact that, on 13 May\n                        2008 (ie, the day after the Sichuan earthquake\n                        and Norwest’s acceptance), Newport thanked Norwest for its\n                        “acceptance”, and stated that it “will work towards the\n                        deadline of 1 June 2008 as per the original schedule.” Mr Ang\n                        argued that this only evidenced the existence of an agreement to negotiate,\n                        but the evidence plainly refuted this. As I have found, the parties had\n                        reached agreement on the essential aspects of the transaction. In addition,\n                        it is significant that Newport reaffirmed its commitment to the deadline of\n                        1 June 2008, which was the deadline for the completion of the sale\n                        fixed by Norwest’s liquidator on 10 April 2008 and reiterated on\n                        12 May 2008 in the letter accepting Newport’s 9 May\n                        Offer. 38     I therefore found that Newport did evince an\n                    intention to enter into legal relations immediately upon Norwest’s\n                    acceptance of the 9 May Offer. Given my earlier finding that the parties\n                    had reached substantial agreement, I further found that, putting aside any\n                    effect of the Sichuan earthquake and the consequent damage to the Chinese\n                    Business which is discussed below, the parties had entered into a valid and\n                    binding agreement immediately upon Norwest’s acceptance of the 9 May\n                    Offer.",
        "The second issue: the subject-matter of the contract and the effect\n                of the Sichuan earthquake – the construction point": "39     The next issue that arose for consideration\n                    was what I referred to in my oral judgment as the construction point. Under this\n                    heading, I will consider the effect of the Sichuan earthquake, if any, on the\n                    subject-matter of the contract between the parties.",
        "The subject-matter of the contract": "40     Mr Chan strenuously argued that the\n                    subject-matter of the contract was the NC Shares and the NC Shares alone, and\n                    these remained fully capable of transfer even after the Sichuan earthquake. The\n                    contract was therefore unaffected in any way by the damage to the Chinese\n                    Business. Furthermore, although the Information Memorandum referred to the\n                    Chinese Business at length, it was the NC Shares which would be transferred by\n                    the sale – there was no direct purchase of the business and/or assets of\n                    Norwest China. To reinforce Newport’s argument, Mr Chan stressed that\n                    Norwest’s liquidator never held out to Newport or any interested purchaser\n                    that the subject-matter of the sale was the business and/or assets of Norwest\n                    China. 41     However, it seems clear to me that the\n                    fundamental commercial purpose of the sale and purchase of the NC Shares is to\n                    gain access to and take over the Chinese Business. If evidence is needed this\n                    can be found in many aspects of the transaction. The Information Memorandum\n                    referred extensively to the Chinese Business (see[5]above), and stated that the intention of Norwest’s\n                    liquidator was to sell Norwest Chemicals together with Norwest China “in\n                    its present state and condition on an ‘as is, where is’\n                    basis” – a qualification which would make no sense at all if the\n                    subject-matter of the sale was the NC Shares by themselves. The advertisements\n                    placed by the liquidator similarly describes the subject-matter as a “PRC\n                    based manufacturer or phosphorous phosphate chemicals and phosphorous\n                    derivatives” or alternatively, as “a Singapore company who owns a\n                    phosphorous production base in Sichuan, China” (see[7]above). An Information Sheet issued by the\n                    liquidator in February 2008 describes the sale as an opportunity to: -    Gain access to a phosphorous production base &\n                            its existing customers; and -    Gain access to the supply of Yellow Phosphorous in\n                                China.[note: 35] The template Expression of Interest in the Information Memorandum\n                    stated that the “Expression of Interest is made on the condition that in\n                    acquiring the shares of [Norwest Chemicals], we [ie, the buyer] will gain 100% control of [Norwest China], a 100%\n                    subsidiary owned by [Norwest Chemicals].” This was not altered when\n                    Mr Cawley submitted the actual Expression of Interest on behalf of Newport\n                    (see[11]above). The liquidator had himself\n                    facilitated Newport’s due diligence process on Norwest China and the\n                    Chinese Business, including site visits, for the purposes of determining its\n                    offer price. It was clear to both parties that the $10.25m price tag eventually\n                    offered by Newport was not arbitrary, a figure plucked from thin air – it\n                    was determined based on Newport’s assessment of the value of the Chinese\n                    Business as seen in the course of due diligence. Besides, the second Information\n                    Memorandum issued by the liquidator on 29 June 2008 after the sale to\n                    Newport was aborted stated that:[note: 36] In May 2008, due to an earthquake in the PRC, much of the [Production\n                        Facilities have] has been damaged and operations at the [Production\n                        Facilities] have ceased. As at the date of this memorandum, it is not clear\n                        as to the extent of the damage caused by the earthquake and there is no\n                        clear timeline for the resumption of operations at the [Production\n                        Facilities]. Landslides caused by the earthquake have also blocked access to\n                        the mine. Mining operations have also ceased since the occurrence of the\n                        earthquake. In the same vein, the reconstruction needed after the damage wrought\n                    by the Sichuan earthquake was listed in the second Information Memorandum as one\n                    of the issues and challenges facing a buyer of the NC Shares.[note: 37]A second Information Sheet\n                    issued in July 2008 similarly stated that “[t]he recent earthquake in PRC\n                    has a significant impact on the quality of the assets in PRC and operations at\n                    the plant may not resume until physical access to the mines are re-established\n                    and the plants are rebuilt.”[note: 38]All these aspects of the transaction\n                    would be rather surreal and nonsensical if the Chinese Business was somehow not\n                    essential to the transaction. It is clear, in my judgment, that the Chinese\n                    Business was the true subject-matter and essence of the transaction; the NC\n                    Shares had a value of $10.25m so long as they gave Newport access to and control\n                    of the Chinese Business in the same state and condition as it was in at the time\n                    of the 9 May Offer. In my view, Mr Chan’s contention that the\n                    sale concerned the NC Sharesin vacuo, was –\n                    from a commercial and business standpoint – untenable and\n                    disingenuous. 42     Plainly, Newport’s 9 May Offer was\n                    objectively aimed at gaining access to and control over the Chinese Businessin the state and condition it was actually in at the time\n                        of the offer – ie, a vertically-integrated and fully operational\n                        phosphate mining, processing and production business. It must not\n                    be forgotten that the 9 May Offer was expressly made on the basis of\n                    Newport’s “independent assessment” of the Chinese Business. Further, the Information Memorandum, which defined the whole\n                    negotiation process, expressly contemplated a sale on an “as is, where\n                    is” basis. Mr Taylor in cross-examination confirmed that he had seen\n                    the liquidator’s letter dated 10 April 2008 and was aware that the\n                    liquidator had written to say that the final offer for the NC Shares should be\n                    submitted on an “as is, where is” basis.[note: 39]Those facts were also repeatedly affirmed by\n                    Norwest in evidence and in its submissions. Norwest’s liquidator\n                    maintained during cross-examination that, since the negotiations and sale\n                    proceeded on an “as is, where is” basis, he was not giving any\n                    warranty as to the condition of the Chinese Business. This is correct, but\n                    merely one side of the coin. In an “as is, where is” sale, the\n                    buyer agrees to take the subject-matter “as it is” or “as\n                    seen”, without warranty or guarantee as to quality, character, condition,\n                    size, weight or kind (see Anandan Krishnan,Words, Phrases\n                        & Maxims Legally and Judicially Defined(Singapore:\n                    LexisNexis, 2008), vol. 2 at p A1887; andMensa\n                        Mercantile (Far East) Pte Ltd v Eikobina (M) Sdn Bhd[1989]\n                    2 MLJ 170 at 175–176). The buyer cannot ask for the\n                    subject-matter to be better than it actually is, but, at the same time, and\n                    crucially for this case, the buyer had not agreed to accept anything less. Put\n                    in another way, it is against all commercial sense to say that an interested\n                    buyer who offers to take in existing condition thereby offers to take inanycondition henceforth – an agreement\n                    to take “as is” does not operate as an entire assumption of risk.\n                    Absent any contrary intention, the condition which the offeror-buyer offers to\n                    take is, quite naturally, the condition at the time the offer was made and not\n                    the time of acceptance, which is by definition a complete and unconditional\n                    agreement to the terms of the offer. Of course, it can well be argued that the\n                    buyer would take subject to any change which might occur in the ordinary course\n                    of events such as wear and tear, but it can hardly be doubted that the massive\n                    Sichuan earthquake and the damage it caused were not events of that\n                    nature. 43     Accordingly, it was entirely possible for the\n                    contract between Norwest and Newport to be affected by the damage caused by the\n                    Sichuan earthquake to the Chinese Business. To reiterate, the commercial essence\n                    of the transaction shares was not the NC Sharesin\n                        vacuo. It was not even aboutcontrol per\n                        seover Norwest Chemicals and Norwest China. It was about the\n                    object of such control:ie, thevertically- integrated and fully operational phosphate mining, processing\n                        and production businessthat constituted the Chinese Business at\n                    the time of the 9 May Offer. While Norwest’s liquidator may not have\n                    held out anything, it is undeniable that this was what Norwest was selling, and\n                    what Newport intended to buy. This is amply illustrated by the sale to Hwa Hong\n                    for $4.5m, which demonstrated how much the Sichuan earthquake affected the value\n                    of the transaction. It was, I would repeat, entirely disingenuous to argue that\n                    the transaction was unaffected because the NC Shares were themselves unaffected\n                    – the entire commercial value of the NC Shares (assessed by Newport at\n                    $10.25m) laid in the opportunity to take over the on-going vertically-integrated\n                    Chinese Business which was the true subject-matter of acquisition. After the\n                    earthquake, the NC Shares did not present the same value as offered on\n                    9 May 2008; the value had changed and the liquidator was not able to\n                    deliver the value that was bargained for (see Mr Taylor’s evidence at[20]above) when Newport made the offer\n                    on 9 May 2008.",
        "The damage wrought by the Sichuan earthquake to the Chinese\n                Business": "44     I turn now to examine the damage caused by the\n                    Sichuan earthquake to the Chinese Business. As said, it was not disputed that at\n                    2.28 pm (Singapore time) on 12 May 2008 an earthquake measuring 7.9 on the\n                    Richter scale struck the Sichuan province. I have already referred to the\n                    catastrophic effect of the Sichuan earthquake in general. With regard to the\n                    Chinese Business, Norwest’s witness Wang Xue Bo, the general manager of\n                    Hwa Hong’s Chinese operations and since 2002 the executive director of\n                    Norwest China, said in his evidence-in-chief that “[t]he Production\n                    Facilities and the Mines were close to the heart of the Sichuan\n                        earthquake.”[note: 40] 45     Evidence of the damage wrought by the\n                    earthquake to the Production Facilities and the Mines were led by several\n                    witnesses: Kevin Holley, Newport’s expert witness who is a geotechnical\n                    engineer by profession and whose evidence was largely unchallenged;\n                    Mr Argyle who visited the Production Facilities in May 2008 after the\n                    Sichuan earthquake; Mr Wang, who testified on behalf on Norwest; and from\n                    information contained in the first and second Information Memoranda and\n                    announcements made by Norwest’s liquidator. Evidence concerning the damage\n                    is as follows: (a)     The entrances to four out of five\n                        mine shafts were sealed by rubble,[note: 41]and (at the time of\n                        trial) the extraction of phosphate rock had not resumed.[note: 42]After the Mines had ceased operation\n                        and existing stocks were depleted, phosphate production in Mianzhu had to\n                        depend on external sources of phosphate rocks.[note: 43]There was some argument over\n                        whether the validity of the mining licences would be extended in the\n                        ordinary course of events or cut short because of the Sichuan earthquake,\n                        but in the absence of conclusive proof either way, I considered that the\n                        licences would be good until 2015, as they were before the\n                        earthquake. (b)     The\n                        road to the Mines, which was essentially a dirt track, became inaccessible.\n                        Mr Wang’s workers were only able to access the Mines by foot in\n                        March 2009,[note: 44]a year after the Sichuan\n                        earthquake, and as of the date of trial road access to the Mines had yet to\n                        be restored.[note: 45] (c)     All four furnaces at the phosphate\n                        production facility in Mianzhu were damaged.[note: 46]Two were damaged beyond repair – they had either collapsed or were\n                            destroyed.[note: 47]The other two required\n                        structural strengthening.[note: 48]Other buildings – such as the raw material warehouse, the sodium\n                        tripolyphosphate processing area and warehouse, the sodium hexametaphosphate\n                        workshop, the phosphoric acid plant, the slag, cooling water and waste water\n                        ponds, the main office building, the dormitories and other living\n                        facilities, and the laboratory – were also severely\n                            damaged.[note: 49] (d)     As a result of the damage, the\n                        Production Facilities ceased operations for a period after the Sichuan\n                        earthquake. In July 2008, the cessation of operations was announced by the\n                        liquidator in an Information Sheet: “The recent earthquake in PRC\n                        ha[d] a significant impact on the quality of the assets in PRC and\n                        operations at the plant may not [re]sume until physical access to the Mines\n                        are re-established and the plants are rebuilt.”[note: 50] (e)     According to Mr Holley, between\n                        US$3.04m to US$5.36m would be needed to repair the blocked access road and\n                        the damage to the Production Facilities including reconstruction where\n                        repair was not possible.[note: 51]This estimate did not include the\n                        cost of repairing the Mines, which remained out of operation at the time of\n                        trial. It appears that some repairs had been carried out after the\n                        earthquake but Mr Holley’s cost estimate was not\n                        challenged. (f)     The\n                        less severely damaged parts of the Production Facilities were eventually\n                        able to resume operations, but as the table (drawn from figures in the\n                        Information Memorandum[note: 52]and Mr Wang’s affidavit of\n                            evidence-in-chief[note: 53])\n                        shows, production figures for 2008 were significantly down from 2007 levels.\n                        Norwest did not provide any evidence of 2009’s production figures,\n                        despite the fact that affidavits of evidence-in-chief were exchanged only in\n                        July 2009 and Norwest was obviously in contact with Hwa Hong, the present\n                        owner of the NC Shares, in the meantime. 20072008ProductCapacityOutputUtilisationOutput\n                                        (Post-quake)Utilisation% Decline from\n                                        2007Sodium\n                                            Tripoly-phosphate30,0006,70922%3,984\n                                    (2,048)13%41%Sodium\n                                            Hexameta-phosphate6,0004,74079%656\n                                    (315)11%86%Phosphoric\n                                    Acid12,0009,75881%5,320\n                                    (2,644)44%45%Yellow\n                                        Phosphorous8,0004,41155%2,430\n                                    (578)30%45%Rock100,00089,48489%   In particular, a comparison of the post-quake production figures for\n                    2008 with the net production figures for the same year showed that production\n                    levels of sodium tripolyphosphate, sodium hexametaphosphate and phosphoric acid\n                    in the first four months (ie, before the Sichuan\n                    earthquake) were roughly the same as that for the next eight months (ie, after the Sichuan earthquake) – indicating\n                    that production levels approximately halved. The decrease was even worse for\n                    yellow phosphorous: the pre-earthquake months were between seven to eight times\n                    more productive than the post-earthquake months. No figures were given for the\n                    production of phosphate rock in the pre-quake months of 2008, but as stated the\n                    production of phosphate rock ceased completely after the Sichuan earthquake\n                    caused the collapse of the mine entrances and had yet to resume at the time of\n                    trial. (g)     In addition, an unspecified number\n                        of Norwest China’s employees were killed.[note: 54]I note once again that Norwest\n                        did not provide much primary evidence of its own of the extent of the\n                        earthquake damage, but instead focussed on contesting the evidence led by\n                        Newport. This was despite the fact that Norwest’s liquidator was\n                        clearly in contact with Hwa Hong, the present owner of the NC Shares and\n                        Mr Ong for the present litigation. 46     It is clear that, with the supply of phosphate\n                    rock from the Mines disrupted, the Chinese Business was no longer a\n                    vertically-integrated operation. The Information Memorandum indicated that\n                    vertical integration was seen by Norwest’s liquidator as an important\n                    selling point (see[5]above). This was also\n                    why the business was attractive to Newport. In this regard, I accepted\n                    Mr Argyle’s evidence that:[note: 55] … the key operation of the [Chinese Business] thatit’s an integrated businessthat can produce\n                        rock and then sell it or go downstream, produce phosphorous, sell it or go\n                        downstream and if they go downstream with the phosphorous, produce acid,\n                        sell it or go downstream, then if they produce acid, if they keep it, it\n                        would be turned in[to] sodium phosphate.It’s an\n                            integrated business. [emphasis added] I also accepted Mr Taylor’s evidence (set out at[15]above) that:[note: 56] … the acquisition of [Norwest Chemicals] … presented the\n                        opportunity of acquiring a phosphate mining and processing business thatwas already in operation and creating\n                            revenue. [emphasis added] It also goes without saying that the operational nature of the Chinese\n                    Business must have been at the forefront of the parties’\n                minds. 47     Mr Chan attempted to make light of the\n                    US$3.04m to US$5.36m cost ($4.13m to $7.29m at the exchange rate then\n                    prevailing) of repairing the damage done to the Production Facilities and by\n                    extension downplay the damage itself. He compared the estimated repair cost to\n                    the US$30m to US$43.8m profit which Newport estimated it could make from the\n                    venture over the life of the mining licences. This is not a valid comparison at\n                    all – the profitability of the Chinese Business would not be the same\n                    after the Sichuan earthquake. In my judgment, the proper perspective is this:\n                    before the Sichuan earthquake, Newport agreed to pay $10.25m for a fully\n                    operational and integrated phosphate mining and production business. After the\n                    earthquake, Newport would have had to expend an additional $4.13m to $7.29m to\n                    reinstate the Production Facilities, a further unknown amount to repair the\n                    Mines, and suffer the consequences of the reduced production and further\n                    disruption to cash flow while the repairs were carried out. In addition,\n                    Mr Argyle pointed out in cross-examination the importance in the phosphate\n                    industry of having flexibility in product lines, which was affected by the loss\n                    of the two furnaces. I also took note of the fact that the disrupted cash flow\n                    would in all likelihood affect Norwest China’s ability to service the\n                    RMB27m debt it owed to the Agricultural Bank of China. I further noted that\n                    there was no evidence given at the trial (which took place more than a year\n                    after the Sichuan earthquake) to show that the Production Facilities had resumed\n                    pre-earthquake production levels – Mr Wang’s evidence that the\n                    Production Facilities and Mines could be up and running in 2010 was an opinion\n                    which he was not competent to express, and in any case was not substantiated by\n                    evidence, and I accordingly did not accept it. 48     In these circumstances, I found that as a\n                    result of the Sichuan earthquake, the Chinese Business was substantially not in\n                    the same state and condition it was in at the time of the 9 May Offer\n                    –ie, a vertically-integrated and fully operational\n                    phosphate mining, processing and production business.",
        "Effect of the damage on the parties’ contractual\n                relations": "49     The effect of the fact that the Chinese\n                    Business was substantially not in the same state and condition it was in at the\n                    time of the 9 May Offer would, of course, depend on the terms of the\n                    parties’ agreement. It should be remembered that the parties reached\n                    substantial but not complete agreement – there was, in other words, an\n                    agreement on the essentials of the transaction but not the mechanics. The court\n                    would therefore have to supply the mechanics of the transaction in accordance\n                    with the standard of reasonableness. On the facts, the most obvious and\n                    reasonable way to structure the mechanics of the transaction would be for the\n                    transfer of the NC Shares and the payment of the $10.25m price to be mutually\n                    dependent conditions to be performed at the same time, such that a failure to\n                    perform one would be justification for not performing the other. 50     From the details of the damage examined at[44]to[48]above, it was clear that at no point between 12 May\n                    2008 (the date of acceptance) to 1 August 2008 (the date the sale to Hwa Hong\n                    was completed) was Norwest anywhere near being able to deliver the Chinese\n                    Businessin the state and condition it was actually in at the\n                        time of the offer. And since Newport would not be receiving what\n                    it offered to buy, it was not bound to accept the NC Shares or make\n                    payment. 51     On 1 August 2008, Norwest completed the\n                    transfer of the NC Shares to Hwa Hong’s nominee, ostensibly pursuant to\n                    the mitigation sale with Hwa Hong which was entered into in the mistaken belief\n                    that Newport had breached its contract. But, as stated, Newport was fully\n                    justified in refusing to make payment. Accordingly, by its sale to Hwa Hong,\n                    Norwest had in fact – by its own deliberate act – made it impossible\n                    for it to perform its end of the bargain and thereby to claim the\n                price. 52     In other words, there was no point at which\n                    Norwest became entitled to the $10.25m price. This is sufficient to dispose of\n                    Norwest’s claim. Ironically, it was Norwest who wrongfully and totally\n                    disabled itself from performing the contract by selling the NC Shares to Hwa\n                    Hong. However, since Newport is not making any claim against Norwest in this\n                    regard, it is not necessary for me to go beyond this observation. 53     To reiterate, my analysis above is based on\n                    the interpretation of the term “as is, where is” in the\n                    Information Memorandum – from which the 9 May Offer was taken. It is\n                    also based on interpreting the fact that the 9 May Offer was made on the\n                    basis of Newport’s “independent assessment of the available\n                    information.” That said, I noted in my oral judgment that it would be\n                    preferable to deal with the present facts using an analysis based on common\n                    mistake, as opposed to Newport’s argument based on an implied condition in\n                    the offer. I now go on to explain.",
        "Other issues: the lapse of an offer through failure of an implied condition or by operation of law": "54     Since I have already disposed of the claim in\n                    Newport’s favour for the reasons given, there was strictly no need for me\n                    to address Newport’s remaining arguments,vizthat its 9 May Offer lapsed as a result of the failure\n                    of animplied conditionthat the Chinese Business\n                    was to remain in substantially the same state and condition it was in at the\n                    time the offer was made, following the English Court of Appeal decision inFinancings Ltd v Stimson[1962]\n                    1 WLR 1184 (“Financings”);\n                    and, alternatively, that the 9 May Offer lapsed by theoperation of a rule of lawthat an offer lapses upon a\n                    fundamental change in the circumstances which formed the basis on which the\n                    offer was made, following the recent New Zealand Supreme Court decision inDysart Timbers Limited v Roderick William\n                        Nielsen[2009] NZSC 43 (“Dysart Timbers”). I commented on these arguments in my\n                    oral judgment because they were raised by Newport’s pleadings, and because\n                    the parties made detailed submissions on them. Now that Norwest has appealed\n                    against my decision, it is just as well that I had earlier expressed some views\n                    on the matter. 55     I start with the facts and holdings inFinancingsandDysart\n                        Timbers. InFinancings, S signed a\n                    hire-purchase agreement to purchase a car from F (a finance company) for\n                    £414. The hire-purchase agreement was stated to be binding on F only upon\n                    it being signed on F’s behalf. Clause 1(c) of the hire-purchase agreement\n                    contained an acknowledgement by S that “he ha[d] examined the goods and\n                    satisfied himself that they were in good order and condition.” Clause 2\n                    provided that S’s “acceptance of the goods shall be conclusive that\n                    he has examined the goods and satisfied himself that they were in good order and\n                    condition.” On the night of March 24/25, the car was stolen and damaged.\n                    On March 25, F signed the hire-purchase agreement. The car was subsequently\n                    recovered and sold for £224, and F brought an action to recover the\n                    difference between the price of the car less £224. There was an issue of\n                    ostensible authority but it is not germane to the present case. It is not clear\n                    from the judgments or the report whether F knew about the damage sustained by\n                    the car when it signed the agreement. The relevant part of the judgment\n                    concerned the effect of the damage to the car on S’s offer. In this\n                    regard, Lord Denning MR held (at 1189): Can a man accept an offer when the condition of the goods has deteriorated\n                        in a material respect since the date of the offer? It seems to me that, on the facts of this case, the offer made by the\n                        hirer was a conditional offer. It was conditional on the car remaining in\n                        substantially the same condition until the moment of acceptance. Take the\n                        case put by my brother Donovan in the course of the argument: suppose an\n                        offer is made to buy a Rolls Royce car at a high price on one day and before\n                        it is accepted, it suffers the next day severe damage. Can it be accepted\n                        and the offeror bound? My answer to that is: no, because the offer is\n                        conditional on the goods at the moment of acceptance remaining in\n                        substantially the same condition as at the time of the offer. Mr Rawley [Counsel for F] argued before us that there was an express\n                        clause here saying that the goods were to be \"at the risk of the hirer from\n                        the time of purchase by the owner.\" The time of purchase by the owner, he\n                        said, was March 18, when the finance company told the dealer orally that\n                        they accepted the transaction. Thenceforward, he said, the goods were at the\n                        risk of the hirer. This shows, says Mr Rawley, that the condition which\n                        I have suggested is inconsistent with the express terms, or, at all events,\n                        is not to be implied. In my judgment, however, this clause on which Mr.\n                        Rawley relies only comes into operation when a contract is concluded and\n                        accepted. Meanwhile the offer is made on the understanding that, so long as\n                        it remains an offer, it is conditional on the goods being in substantially\n                        the same condition as at the time when the offer was made. I agree, therefore, with the County Court Judge in thinking that, in view\n                        of the damage which occurred to this car before the acceptance was given,\n                        the finance company were not in a position to accept the offer, because the\n                        condition on which it was made had not been fulfilled. So on that ground\n                        also there was no contract. 56     Donovan LJ held (at 1190–1): But if this view be wrong I would agree that the offer here was on the\n                        basis that the car remained substantially in the same condition until\n                        acceptance, and this did not happen. I do not regard clause 2 of the terms\n                        of the printed hire-purchase agreement as incorporated in the offer. Who\n                        would offer to purchase a car on terms that if it were severely damaged\n                        before the offer was accepted, he, the offeror, would pay the bill? The\n                        suggestion seems to me to be quite unreal. I think that the offer is\n                        conditioned, in a case where the documents are in the form which they take\n                        here, by the clause which the offeror signs to the effect that he has\n                        examined the goods and satisfied himself that they are in good order and\n                        condition. What is the point of this provision if, before acceptance, the\n                        goods are heavily damaged but nevertheless the offeror can still be\n                        compelled to buy them. The county court judge held that there must,\n                        therefore, be implied a term that until acceptance the goods would remain in\n                        substantially the same state as at the date of the offer; and I think this\n                        is both good sense and good law. 57     Pearson LJ held (at 1193–4): … I do agree that the offer was conditional. It is not\n                        necessary for the purpose of this case to lay down any broad general\n                        propositions as to what happens when there is a change in the condition of\n                        the goods between the date of offer and the date of acceptance, because we\n                        have important special features in this case. This was a hire-purchase\n                        transaction and the offer which was signed by the proposed hire purchaser on\n                        March 16 contained this provision: \"In signing this agreement the hirer acknowledges that before he\n                            signed it - (c) he had examined the goods\n                            and satisfied himself that they were in good order and\n                            condition.\" That is something which has to be signed by the offeror. What is the\n                        meaning of it and what must one infer in order to give reasonable business\n                        efficacy to this transaction? The obvious intention is this, that both the\n                        hire purchaser and the finance company will be able to rely on the condition\n                        of the car as it appears to the proposed hire purchaser when he makes his\n                        offer, and it is on the basis of the car being in that condition that\n                        various figures, which one finds on the same page, must have been\n                        assessed. Financingswas interpreted by the\n                    Ontario Court of Justice inClark Agri Service Inc v 705680\n                        Ontario Ltd(1996)\n                        2 CPC (4th) 78 (“Clark Agri Service”) at [23] to “stand for\n                    the very fair and rational proposition that in every offer, absent evidence to\n                    the contrary, there is an implied term that the object of the offer, as of the\n                    date of acceptance, will be in substantially the same condition as it was when\n                    the offer was made.” 58     The facts inDysart\n                        Timberswere rather more unique. DT had obtained judgment against\n                    N for about $300,000 in the New Zealand Court of Appeal. N applied for leave to\n                    appeal to the New Zealand Supreme Court. Three days after both DT and N had\n                    filed their submissions on the leave application, N’s solicitor made an\n                    offer to DT’s solicitor to settle at $250,000. The offer was made at 9.23\n                    am. At 12.30 pm on the same day, the Registrar of the Supreme Court advised both\n                    DT and N that leave to appeal had been granted. At 1.12 pm, DT purported to\n                    accept the offer. N argued that the offer to settle was impliedly conditional\n                    upon the leave application being unresolved and, therefore, the offer lapsed\n                    when leave was granted. The New Zealand Supreme Court was spilt 3-2 on the\n                    proper approach to be taken. Tipping and Wilson JJ (whose joint judgment\n                    was delivered by Tipping J) elaborated on what they considered to be the proper\n                    approach as follows: [25]  An offer is a statement of the terms upon which\n                            the offeror is prepared to be bound if acceptance is communicated while\n                            the offer remains alive. It is a unilateral statement and, in that\n                            respect, is to be distinguished from the bilateral nature of the\n                            contract which comes into existence upon the acceptance of the offer.\n                            The distinction is relevant to the basis upon which terms may be implied\n                            into the offer. When there is a suggestion a term should be implied in\n                            the case of a bilateral transaction, the question is what a reasonable\n                            person would consider both parties must have meant to happen in\n                            circumstances not expressly addressed by the contract. The conventional\n                            concepts (officious bystander and business efficacy) are built on that\n                            underlying premise. In the case of a unilateral transaction, such as an\n                            offer to contract, the focus should be on what the then sole party to\n                            the transaction, the offeror, meant to happen. This approach to offers\n                            is consistent with principle and is supported by leading American\n                            textbooks on the law of contract. [26]  What the offeror meant to happen must be\n                            objectively assessed. Whether it is appropriate to infer that the offer\n                            was meant to lapse in the events which have occurred will depend on the\n                            terms of the offer itself and all the relevant circumstances in which it\n                            was made. If an offer is made on a particular factual basis or\n                            assumption the Court may be justified in finding an implied condition\n                            that the offer will lapse should that basis or assumption cease to\n                            apply. But that finding should be made only if the continued existence\n                            of the factual basis or assumption was fundamental to the making of the\n                            offer or to its terms; otherwise it cannot be said to be inherent in the\n                            terms of the offer. Put more generally, a condition that an offer lapse\n                            upon the occurrence of a particular change of circumstances should be\n                            implied into the offer only if it is objectively apparent that the\n                            willingness of the offeror to be bound by the offer has been\n                            fundamentally undermined by the change of circumstances. [27]  In the result the condition which is implied is\n                            that the offer will lapse upon the occurrence of a fundamental change of\n                            circumstances. Recognising that a change of circumstances of this\n                            fundamental kind is necessary before an offer lapses will ensure that\n                            lapse on this basis will be a relatively rare occurrence. This is an\n                            appropriate way to reconcile the interests of offerors and offerees and\n                            to avoid the considerable uncertainty that would result from the test\n                            being at a lower level. [28]  An offeree cannot reasonably expect to be able to\n                            accept an offer if the basis on which it was made has fundamentally\n                            changed. Conversely an offeror must ordinarily be expected to provide\n                            expressly for the circumstances in which the offer will lapse. The need\n                            for there to be a fundamental change in circumstances before an offer\n                            will lapse gives appropriate weight to the interests of both offerors\n                            and offerees. The reasonable expectations of both parties are thereby\n                            accommodated. [29]  In the present case Dysart was aware of the facts\n                            constituting the change before it purported to accept the offer. We are\n                            not therefore called on to decide whether an offeree’s ignorance\n                            of the change should affect the issue. 59     With regards to the degree of change needed to\n                    trigger the lapse of an offer, Tipping and Wilson JJ drew an analogy to\n                    frustration: [30]  There is some similarity between the approach\n                            just outlined and that taken at common law to the question of\n                            frustration of contracts … [31]  … Provided the unilateral nature of an\n                            offer is recognised, the frustration analogy provides useful guidance\n                            for the kind of basis upon which a condition providing for lapse upon a\n                            change of circumstances may be implied into an offer. [32]  The present significance of an offer being a\n                            unilateral transaction is that whereas concluded contracts generally\n                            allocate risks between the parties, an offer does not do so. Liability\n                            for breach of contract does not usually depend on fault. Performance is\n                            not excused by changes in circumstances. Hence traditionally a very high\n                            threshold was required for frustration, going as it does to discharge\n                            rather than to formation of the contract. Although there is conceptual\n                            similarity between frustration and implied lapse of an offer, the\n                            differences between the two are such that it is not appropriate to apply\n                            the full rigour of frustration principles to the lapsing of offers,\n                            albeit the test must still be at a high level. 60     On the facts, Tipping and Wilson JJ\n                    considered that the grant of leave constituted a fundamental change of\n                    circumstances that caused the offer to settle to lapse. The approach taken by\n                    Tipping and Wilson JJ was not accepted by McGrath J. He rejected what\n                    he called the “rule of law” approach, and preferred instead what\n                    he called the “construction” approach, which, according to\n                    him: [51]  … often looks at whether the Court should\n                            imply into the offer a condition as to the continuing factual position\n                            between offer and acceptance. Such a condition will be a condition\n                            precedent which, if not satisfied, will prevent an act of\n                            “acceptance” from concluding a binding agreement. On the\n                            other hand, if the condition is fulfilled, on acceptance a contract\n                            comes into existence and the parties are bound. … [61]  … A test based on contractual construction\n                            can take a number of forms, as the cases already discussed make plain.\n                            It offers more flexibility than does the rule of law approach in that\n                            respect. That flexibility is also appropriately circumscribed by the\n                            overriding principles of contract interpretation. The fundamental\n                            question on a contractual construction analysis will be whether, having\n                            regard to the terms of the offer, the change of circumstances, and the\n                            subsequent “acceptance”, viewed as a whole and\n                            objectively, there is a concluded agreement. The Court’s ultimate\n                            task under this approach is to ascertain whether a reasonable person in\n                            Dysart’s position, knowing as its solicitors did of the change in\n                            circumstances, would believe the offer was still open for acceptance.\n                            This is a test which ultimately will turn on whether the\n                            “acceptance” produced a common contractual intention that\n                            can readily be determined by applying rules of contractual\n                            construction. [62]  Seen in this light, a contractual construction\n                            approach is conceptually preferable in the present case. That is\n                            conveniently addressed as inStimsonby\n                            considering whether the offer was subject to an implied term. The\n                            question of whether a term should be implied into a contract is an\n                            exercise in contractual construction which commonly arises when a\n                            contractual instrument does not expressly provide for what is to happen\n                            if an event occurs. It should, however, be borne in mind that, as the\n                            Privy Council has recently pointed out, the most usual inference in such\n                            a case is that nothing is to happen, because if the parties had intended\n                            otherwise the instrument would have said so, and the express provisions\n                            are to continue undisturbed. [63]  The legal approach to implication of terms into\n                            contracts is readily applicable to offers to enter into contractual\n                            relations. I accept, however, that there is a need for the court to be\n                            careful in framing the proposed implied term. The formulation could be\n                            in specific and narrow, or general and broad terms. 61     Elias CJ and Blanchard J (whose\n                    joint judgment was delivered by Blanchard J) preferred the approach taken by\n                    Tipping and Wilson JJ: [2]    It is open to someone who makes an offer to\n                            stipulate the circumstances in which it will lapse. If the offeror does\n                            not do so expressly, it may nonetheless be apparent to an objective\n                            observer that the offer was made on the basis of the existence of\n                            certain circumstances. [3]    It is not, of course, every change in\n                            circumstances which will cause the offer to lapse, i.e. make it no\n                            longer open for acceptance. A rule as wide as that would be productive\n                            of great uncertainty for offerees and, indeed, for offerors. Case law,\n                            as Tipping J demonstrates, has always required a change which an\n                            objective observer will see as very considerable in its consequences for\n                            the offeror. [4]    We are of the view that, in the absence of an\n                            express term in the offer, the level of change of circumstance which is\n                            required for it to lapse is that of a fundamental change, which may\n                            occur all at once or by gradual development. An offeree cannot\n                            reasonably expect to accept an offer if the basis on which it was made\n                            has fundamentally changed. Furthermore, because it was possible for the\n                            offeror to specify the events in which the offer would lapse and,\n                            normally, to revoke the offer at any time without having to give a\n                            reason, in determining what must be taken to be, or amount to, a\n                            fundamental change the Court should give less weight to the occurrence\n                            of any event which an offeror must have had in contemplation when making\n                            the offer, and about which the offeror chose to be silent. That silence\n                            when the offer was made, or when it could have been revoked, may\n                            indicate that the offeror did not regard such a matter as fundamental to\n                            the continuance of the offer. [5]    We do not adopt the contractual construction\n                            approach which McGrath J suggests. We consider that the analogy\n                            with a bilateral relationship is likely to distract attention from the\n                            real task of the Court, which is to examine the unilateral action of the\n                            making of the offer against the circumstances in which it was made. It\n                            is the objective intention of the unilateral actor which is the proper\n                            focus. The intention of the offeree in purporting to make an acceptance\n                            is irrelevant. To introduce the notion of a condition precedent to\n                            acceptance would also add an unhelpful complication. Nor do we consider\n                            that the suggested test of whether the “acceptance”\n                            produced a common contractual intention can, as McGrath J believes,\n                            be deduced by applying rules of construction concerning implied\n                            contractual terms. It is surely more straightforward simply to ask\n                            whether, objectively, there has been a fundamental change in the\n                            circumstances pertaining when the offer was put forward and therefore in\n                            the consequences of an acceptance for the offeror. 62     Interestingly, while Elias CJ and\n                    Blanchard J agreed with Tipping and Wilson JJ on the approach to be\n                    taken, they disagreed on its application to the facts. Essentially Elias CJ\n                    and Blanchard J placed reliance on the fact that N, in making the offer to\n                    settle, must have known that the New Zealand Supreme Court might grant or refuse\n                    leave to appeal before the offer was accepted. Yet N did not expressly provide\n                    for this contingency (seeDysart Timbersat [7]).\n                    This indicated to Elias CJ and Blanchard J that the grant (or refusal)\n                    of leave was not fundamental to the offer to settle. A similar view was taken by\n                    McGrath J (seeDysart Timbersat[60]above). In the result, a majority of three\n                    judges comprising Elias CJ and Blanchard and McGrath JJ held that the\n                    offer did not lapse and was validly accepted. 63     In my view, bothFinancingsandDysart Timbersare,\n                    strictly speaking, not applicable here as they are clearly distinguishable on\n                    the facts.Financingswas based on the implication\n                    of a condition into the offer that the subject-matter of the offer must remain\n                    in substantially the same condition it was in at the time of the offer, failing\n                    which the offer lapses. The implication of such a condition governing the lapse\n                    of the offer could be said to be necessary on the facts ofFinancings, where the offeror would be precluded from raising\n                    any objection to the quality of the subject-matter of the offer once the offer\n                    was accepted, by virtue of a term in the proposed contract which would take\n                    effect upon the formation of the contract. By contrast, the parties here had\n                    already made provision for the risk of any damage or change to the Chinese\n                    Business. As stated above, Newport only offered to buy the Chinese Business in\n                    its state and condition as at the date of the offer,ie, 9 May 2008. In the circumstances, it would beredundant, and thereforenot\n                        necessaryfor the business efficacy of the offer, to further\n                    imply a condition that the Chinese Business was to remain until acceptance in\n                    substantially the same condition as it was in at the time the offer was\n                    made. 64Dysart Timbers,\n                    for its part, was based on a situation where both the offeror and offeree were\n                    aware of the change of circumstances: Tipping and Wilson JJ expressly\n                    stated (Dysart Timbersat [29], quoted at[58]above) that they were not called\n                    upon to decide whether the offeree’s ignorance of the change should affect\n                    the issue. This is in contrast to the present facts – as stated, the\n                    liquidator’s evidence was that he did not know of the Sichuan earthquake\n                    at the time he accepted the 9 May Offer. Mr Ang did not cross-examine\n                    him on this point and in the absence of any evidence to the contrary, there was\n                    no basis for a finding that the liquidator knew or ought to have known about the\n                    Sichuan earthquake at the time he accepted Newport’s offer. 65     In the same connection, while I accept the\n                    result in bothFinancingsandDysart Timbersto be fair and commonsensical on their respective\n                    facts, an extension of either approach to the present case is not entirely\n                    consistent with the predominantly objective approach to offer and acceptance. As\n                    I have just mentioned, the offeree in the present case (ie, Norwest’s liquidator) did not know about the change in\n                    circumstances (ie, the Sichuan earthquake and the\n                    consequent damage to the Chinese Business). Nor had the liquidator, on the\n                    evidence, come to know of any facts which suggested the change in circumstances\n                    such that it could be said that he ought to have known of the change in\n                    circumstances. As far as the liquidator was concerned, nothing had changed since\n                    the time the offer was first extended to Norwest, apparently unconditionally,\n                    for acceptance. (The only express condition was the 45 day time limit for\n                    accepting the offer, which is irrelevant here.) To say that in such\n                    circumstances the offer had lapsed, whether through the failure of an implied\n                    condition or the operation of a rule of law, would considerably undermine an\n                    offeree’s ability to rely on the objectively ascertained apparent\n                    intention of the offeror. 66     With regard toFinancingsparticularly, it is doubtful that the implied term\n                    approach taken in that case provides a satisfactory juristic basis on which to\n                    approach the formation problems such as the present for several reasons. First,\n                    an implied term – and specifically an implied condition – is not\n                    something which the parties had in their actual contemplation. Here it must be\n                    pointed out that, while parties may have dealt with reference to a certain state\n                    of affairs, they might not necessarily have considered that that state of\n                    affairs might change, let alone provided for what would happen if the change did\n                    happen. So in this regard an implied term is an artificial solution to\n                    unanticipated changes of circumstances, and, for the same reason, has fallen out\n                    of favour as the juristic basis for both common mistake and frustration (seeGreat Peace Shipping Ltd v Tsavliris Salvage\n                        (International) Ltd[2003] 1 QB 679 (“Great Peace”) at [73]; andNational Carriers Ltd v Panalpina (Northern) Ltd[1981]\n                    1 AC 675 (“National Carriers v\n                        Panalpina”) at 687–688perLord Hailsham of St Marylebone LC, at 700perLord Simon of Glaisdale, and at 717perLord Roskill). Second, the implied term approach is\n                    necessarily focused on the offeror’s intention at the time of the offer,\n                    and on the parties’ intentions at the time of contract. Subsequent actions\n                    are only relevant to the extent that they reflect or evince the relevant\n                    original intention. Such an approach is appropriate in the case of a contract,\n                    where the parties’ obligations are fully formed at the time of the\n                    contract and cannot be unilaterally changed thereafter. It would not be\n                    appropriate in the case of an offer, which can be unilaterally changed or\n                    withdrawn at any time before it is accepted. What the offeror knows and does in\n                    the meantime would therefore be relevant in its own right, and not merely as\n                    evidence of his intention at the time of the offer. Third – and this ties\n                    in with the first reason – the formulation of the precise term to be\n                    implied is also likely to be fraught with artificiality and indeed\n                    arbitrariness. There can be no rational way to choose between a variety of ways\n                    which the risk of a change of circumstances could be provided for. For example,\n                    on the present facts, an implied term concerning the condition of the Chinese\n                    Business could have taken the form of an implied condition to the offer, as\n                    Mr Ang urged; or, it could have taken the form of a term of the contract\n                    itself (such as a condition precedent to completion). A failure of the implied\n                    term will prevent a contract from arising in the first situation but not in the\n                    second, and there seems to be no rational way to choose between the two. Fourth,\n                    as evident from the first three points, I do not think that the law on implied\n                    terms was designed to be applied to formation problems. 67     In my judgment, the usual objective approach\n                    to offer and acceptance, or the doctrine of common mistake, is more than\n                    adequate to provide a principled approach to changes in circumstances occurring\n                    after an offer was made and before the offer is purported to be accepted. If the\n                    change of circumstances is known to the parties, it becomes part of the context\n                    in which they deal with each other, and the question then is whether the\n                    offeror’s original intention to make an offer had, on an objective view,\n                    changed in light of the change of circumstances. If, as here, the change is\n                    unknown to the parties, then the doctrine of common mistake should apply,\n                    subject to its other requirements being met. In my view, the doctrine strikes an\n                    appropriate balance between the interests of the offeror and offeree: it applies\n                    only to acommonmistake as to something which was\n                    thecommonbasis of the parties’ agreement.\n                    The doctrine, which results in avoid contract, is\n                    also conceptually sound. It recognises, on the one hand, that there may be a\n                    factual meeting of minds when parties dealt with each other while under a common\n                    mistake, including a common ignorance about a change of circumstances which\n                    falsified the parties’ initial beliefs. On the other hand, it holds that,\n                    when the common mistake is such that it fundamentally alters the basis on which\n                    the parties dealt, and when no party had expressly or impliedly assumed the risk\n                    of the mistake, the parties ought to be relieved by operation of law from the\n                    contract which would otherwise result. For the avoidance of doubt, I should\n                    state here that, while Newport disavowed the common mistake point, it was\n                    possible, on the facts, for me to decide the case on an alternative basis,ie, that even if the contract between the\n                    parties was not void for common mistake, Newport was nevertheless justified innotcompleting the purchase of the NC Shares\n                    because Norwest was unable to deliver its end of the bargain (see[50]–[52]above). Needless to say, this will not be a point that can\n                    be taken in every case. 68     The result inFinancingsandDysart Timberscould have been reached on the basis of the respective rationale adopted. InFinancings, both parties were ignorant of the\n                    damage to the car and could be said to have dealt with each other in the common\n                    mistake that the car was in good condition. This rationalisation was advanced by\n                    Professor PS Atiyah (“Judicial Techniques and Contract Law” inEssays on Contract(Oxford: Clarendon Press,\n                    1986) at pp 250 – 251), though he also took the view – which is not\n                    open to me to take – that there should be no doctrine of common mistake.\n                    InDysart Timbers, N must have made the offer to\n                    settle in the knowledge that leave to appeal may be granted at any time, a fact\n                    which must also have been apparent to DT. In failing to make express provision\n                    for the possibility that leave might be granted, N would objectively appear to\n                    be indifferent to the grant of leave or, in other words, to have assumed the\n                    risk of leave being granted. Therefore, when leave was in fact granted, N was\n                    precluded both from raising common mistake (which would have been precluded also\n                    because DT was not in fact mistaken when it accepted the offer), and also from\n                    arguing that objectively he did not intend for the offer to settle to be capable\n                    of acceptance if leave was granted. 69     It was therefore not necessary, in my\n                    respectful view, for the learned judges inFinancingsandDysart Timbersto\n                    resort to the implied term and rule of law approaches respectively. In\n                    particular, I would observe that the approach advocated by theDysart Timbersmajority, focussing as it did on the\n                    objective willingness of the offeror to stand by the offer in the changed\n                    circumstances (seeperTipping and Wilson JJ\n                    at [26], andperElias CJ and\n                    Blanchard J at [4]), is not that much different from the usual approach to\n                    offer and acceptance. The analogy with frustration is especially unhelpful.\n                    There is a vital distinction between frustration and offer situations – in\n                    a frustration situation, the parties are in a binding contractual relationship\n                    from which they cannot unilaterally withdraw; in an offer situation, the offeror\n                    is always free to withdraw or modify his offer. InDysart\n                        Timbers, Wilson and Tipping JJ seemed to have acknowledged\n                    this distinction (at [30] – [31]), but thought that it only went to the\n                    magnitude of the change required for an offer to lapse, which they set at a\n                    lower level than that required for frustration. However, I think that the\n                    distinction results in a more important practical difference. Whether a contract\n                    is frustrated is entirely a question of law and as Lord Roskill said inNational Carriers v Panalpina([71] above at\n                    712), its operation does not depend on the action or inaction of the parties\n                    after the frustrating event. On the other hand, whether an offer has objectively\n                    lapsed or become mistaken is something which is and ought to be sensitive to\n                    whether the offeror actually or ostensibly knew about the change of\n                    circumstances, and what he did if he knew – in particular, whether he took\n                    steps to withdraw or suspend the offer. 70     Finally, I was referred by Mr Chan to the\n                    Court of Appeal’s counsel of caution with regard to the implication of\n                    terms in law inNg Giap Hon v Westcomb Securities[2009] 3 SLR(R) 518 at [56], and noted in this regard that the width\n                    of the approaches enunciated inFinancings(as\n                    interpreted inClark Agri Service, quoted at[57]above) andDysart Timbersare comparable to the implication of a term in\n                    law. It also seemed to me, for the reasons given above, that adopting an overly\n                    expansive approach to the lapse of offers would have the effect of undermining\n                    the objective approach to offer and acceptance, as well as the doctrine of\n                    common mistake. For these reasons, I would have declined to follow bothFinancingsandDysart\n                        Timbers, had it been necessary for me to decide the point. For\n                    the same reasons, I would have approached the issues in this case from the\n                    alternative perspective of common mistake, had Mr Ang not disavowed the\n                    point. Here, I would make the comment that Mr Ang’s opinion that\n                    common mistake is inapplicable after the offer is made does not seem to be\n                    supported by the authorities, which seem only to require that the relevant\n                    contract beformedin common mistake,ie, that it is sufficient that the parties become\n                    mistaken by the time of acceptance. It also results in a most curious situation\n                    in the interval between offer and acceptance, where common mistake has ceased\n                    (in Mr Ang’s view) to apply, and where frustration has not yet begun\n                    to apply. However, since I have in any case decided in favour of Newport, it is\n                    not necessary for me to go into further detail.",
        "Newport’s counterclaim for the deposit": "71     Since Norwest did not perform its end of the\n                    bargain at all, Newport would be able to recover the $102,500 deposit it placed\n                    with Norwest for total failure of consideration.",
        "Conclusion": "72     For these reasons, I dismissed Norwest’s claim and granted judgment for $102,500 on Newport’s counterclaim. I also ordered that Newport would be entitled to its costs both in the main action and the counterclaim – these to be agreed or taxed.  [note: 1]2 AB 738 [note: 2]1 AB 3 [note: 3]1 AB\n                    3–4 [note: 4]2 AB 564, 569 [note: 5]1 AB 5 [note: 6]1 AB\n                            18 [note: 7]2 AB\n                                562–563 [note: 8]2 AB 579 [note: 9]2 AB\n                                592 [note: 10]2 AB\n                                694 [note: 11]2 AB 693 [note: 12]2 AB\n                    713 [note: 13]2 AB 714 [note: 14]Simon Taylor’s AEIC,\n                                para 21–26 [note: 15]http://earthquake.usgs.gov/earthquakes/eqinthenews/2008/us2008ryan/#news [note: 16]2 AB\n                                719 [note: 17]2 AB\n                        586–588 [note: 18]Lai Seng\n                                Kwoon’s AEIC, para 3.10.3 [note: 19]2 AB\n                    735 [note: 20]2 AB 740 [note: 21]Simon Taylor’s AEIC,\n                                    para 93 [note: 22]3 AB 1160 [note: 23]David\n                                Argyle’s AEIC, para 72 [note: 24]Simon Taylor’s AEIC,\n                                paras 108, 112 [note: 25]2 AB\n                                1036–1037 [note: 26]2 AB 1095,\n                        1098 [note: 27]2 AB 1110–1111 [note: 28]Simon Taylor’s AEIC,\n                                para 110 [note: 29]Transcripts of Evidence, 6 August 2009, p\n                        40 [note: 30]Transcripts\n                                of Evidence, 6 August 2009, p 40 [note: 31]2 AB 586 [note: 32]Transcripts\n                                of Evidence, 7 August 2009, pp\n                    2–4 [note: 33]2 AB\n                                712 [note: 34]4 AB\n                        1224–1225 [note: 35]2 AB\n                                561 [note: 36]2 AB\n                                798 [note: 37]2 AB 809 [note: 38]2 AB\n                                1074 [note: 39]Transcripts of Evidence, 7 August 2008, pp 2 -\n                            4 [note: 40]Wang Xue Bo’s AEIC,\n                                para 4.1.1 [note: 41]Wang\n                                    Xue Bo’s AEIC, para 4.3.4; Transcripts of Evidence, 5\n                                    August at p 105 [note: 42]Transcripts of Evidence, 5 August 2009, p\n                                105 [note: 43]Transcripts of Evidence, 5 August 2009, pp 115 –\n                                    116 [note: 44]Wang Xue Bo’s AEIC,\n                                    para 4.3.1; Transcripts of Evidence, 5 August 2009, p\n                                    105 [note: 45]Wang Xue Bo’s AEIC,\n                                    para 5.1.2; Kevin Holley’s AEIC,\n                                    para 7.2.4 [note: 46]Wang\n                                    Xue Bo’s AEIC, para 4.2.1 [note: 47]Wang Xue Bo’s AEIC,\n                                    para 4.2.1; Kevin Holley’s AEIC,\n                                    para 7.1.5 [note: 48]Kevin\n                                    Holley’s AEIC, para 9.1.1 [note: 49]Wang Xue Bo’s AEIC,\n                                    paras 4.2.1–4.2.8 [note: 50]2 AB 1074 [note: 51]Kevin\n                                    Holley’s AEIC, Tables 9–2 and\n                                9–3 [note: 52]1 AB\n                                    9 [note: 53]Wang\n                                    Xue Bo’s AEIC,para 5.2.6 [note: 54]Wang Xue Bo’s AEIC,\n                            para 4.1.1 [note: 55]Transcripts\n                                of Evidence, 7 August 2009, p 21 [note: 56]Simon\n                                Taylor’s AEIC, para 21"
    }
}