{
    "case_title": "D’Oz International Pte Ltd\n      v\n      PSB Corp Pte Ltd and another appeal",
    "ncitation": "[2010] SGHC 88",
    "coram": "Chan Sek Keong CJ",
    "sections": {
        "Background facts": "2       D’Oz is a company registered in Singapore.\n                    It is in the business of providing management and marketing consultancy services\n                    in the international market. PSB is also a company registered in Singapore. It\n                    operates and manages educational training centres through its business unit, PSB\n                    Academy, in Singapore. 3       PSB had developed a system for operating and\n                    running education and training centres known as “PSB Intellis”\n                    (“the System”), which it wanted to extend internationally on a\n                    franchise basis. An appointed franchisee would have to establish training\n                    centre(s), and thereafter operate the training centre(s) in accordance with the\n                    System. On 21 September 2002, PSB gave a public presentation on the System.\n                    D’Oz attended the presentation, and later submitted an application to PSB\n                    for a franchise in the People’s Republic of China (“China”).\n                    D’Oz subsequently submitted an executive summary of the proposed\n                    franchise, which was to be a joint venture with Beijing Mingzhu University, to\n                    PSB. On 19 December 2002, the parties signed a term sheet (“the Term\n                    Sheet”) and a preliminary agreement (“the Preliminary\n                    Agreement”), and, on 26 December 2002, D’Oz paid a sum of\n                    $120,000 to PSB as part payment for the Franchise Fee. Both the Term Sheet and\n                    the Preliminary Agreement provided that a franchise agreement was to be executed\n                    by the parties, and, on 12 March 2003, the parties signed a franchise\n                    agreement (“the Franchise Agreement’). Prior to that, between\n                    13 February 2003 and 28 February 2003, training was provided by PSB to\n                    D’Oz’s personnel in China and Singapore. For convenience, the\n                    franchise that was contemplated between the two parties will hereafter be\n                    referred to as “the Franchise”. 4       During the negotiations between D’Oz and\n                    PSB for the Franchise, D’Oz obtained legal advice from a Singapore law\n                    firm, but did not seek legal advice on whether the Franchise could be\n                    implemented under Chinese law. Unbeknown to both parties, prior to the signing\n                    of the Franchise Agreement, the State Council of China had promulgated, on\n                    1 March 2003, the “Regulation for Establishing Chinese-[F]oreign\n                    Cooperative Schools” (“the 2003 Regulation”),[note: 1]which\n                    required, in any joint venture educational institution set up in China between\n                    Chinese and foreign parties, both the Chinese party and the foreign party to be\n                    educational institutions. The 2003 Regulation was scheduled to come into force\n                    on 1 September 2003. D’Oz, however, was not an educational\n                    institution. 5       In March 2003, D’Oz submitted an\n                    application for an education licence (“the Licence”) to the\n                    Ministry of Education (“the Ministry”) in Beijing, China. Later,\n                    in May 2003, it learnt that its application for the Licence was unsuccessful.\n                    Subsequently, PSB submitted a fresh application to the Ministry on behalf of\n                    D’Oz, which was again unsuccessful. 6       On 21 July 2004, D’Oz informed PSB in\n                    writing that it was suspending “all developmental activities in\n                    connection to PSB franchise investment [sic] in\n                    China”, pending the clarification of certain information.[note: 2]On 31 August 2004, D’Oz\n                    notified PSB that it had “decided to cease the PSB franchise venture in\n                    China with immediate effect”, and stated that it wanted to discuss the\n                    refund of the $120,000 that had been paid as part payment for the Franchise\n                        Fee.[note: 3]On\n                    1 November 2004, PSB gave notice of its immediate termination of the\n                    Franchise Agreement, and also stated that payment of the balance of the\n                    Franchise Fee was overdue.[note: 4]These developments resulted in cross-actions by the parties against each other\n                    that have culminated in these appeals.",
        "Proceedings in the District Court": "7       D’Oz, in its statement of claim, contended\n                    that PSB had misrepresented the value of the System and its potential\n                    profitability in the Chinese market. This was denied by PSB, and at the\n                    commencement of the trial, D’Oz indicated that it would not be relying on\n                    misrepresentation. The trial proceeded on D’Oz’s allegations\n                    that: (a)     performance of the Franchise\n                        Agreement was frustrated (under Singapore law); (b)     the Franchise Agreement was void by reason of the\n                        doctrine of common mistake (under Singapore law); and (c)     an event offorce\n                            majeurehad occurred allowing for the rescinding of the\n                        Franchise Agreement, the refund of all payments that had been made, and the\n                        release of D’Oz from all other obligations (under Chinese\n                    law). 8       In its defence, PSB denied the allegations of\n                    frustration, common mistake andforce majeure. In\n                    its closing submissions, it argued that the doctrines of frustration andforce majeuredid not operate\n                        because:[note: 5] (a)     the alleged event of frustration orforce majeure, which was the promulgation\n                        of the 2003 Regulation, took place before the Franchise Agreement was\n                        entered into; (b)     the alleged event of frustration orforce\n                            majeurewas foreseeable; (c)     the alleged event of frustration orforce majeurewas self-induced;\n                    and (d)     the alleged\n                        event of frustration orforce majeureno\n                        longer existed at the time of termination, as the 2003 Regulation was\n                        amended in July 2004, by the “Implementation Measures of the\n                        Regulation for Establishing Chinese-[F]oreign Cooperative\n                            Schools”,[note: 6]to allow a foreign party\n                        which is not an educational institution to enter into a joint venture\n                        educational institution with a Chinese educational\n                    institution. PSB further argued that the Franchise could have\n                    been implemented by D’Oz by way of a sub-franchise to a Chinese university\n                    or a Chinese commercial entity (such as a “wholly foreign owned\n                    enterprise” or a Chinese company) and providing consultancy services\n                    to it.[note: 7]The additional\n                    contention in defence, in other words, was that D’Oz had failed to adopt\n                    all feasible steps to follow through with the Franchise Agreement. 9       On the issue of the governing law, the DJ ruled\n                    that the Franchise Agreement was governed by Chinese law, and, therefore, there\n                    was no need to deal with the issues of frustration and common mistake (see GD at\n                    [18]–[20]). As for the issue offorce\n                        majeure, she held, in respect of D’Oz’s claim, that\n                    (see GD at [39]): (a)     there was a supervening event under\n                        Chinese law, and this event was the promulgation of the 2003 Regulation on\n                        1 March 2003, and not its coming into force on 1 September\n                        2003; (b)     the\n                        Franchise Agreement formed the entire agreement between the parties, and,\n                        therefore, the Term Sheet and the Preliminary Agreement could be\n                        disregarded; and (c)     the promulgation of the 2003 Regulation was a discoverable fact and\n                        D’Oz had failed to exercise due diligence to discover it before the\n                        Franchise Agreement was signed on 12 March 2003. The\n                    DJ concluded that since the promulgation of the 2003 Regulation occurred before\n                    the Franchise Agreement was signed, the promulgation of the 2003 Regulation\n                    could not constitute an event offorce majeure(GD\n                    at [40]). 10     The DJ then rejected the contention that the\n                    Franchise could have been implemented by way of sub-franchising, as the\n                    Franchise Agreement did not provide for sub-franchising (see GD at [41]). The DJ\n                    also held that PSB had adduced no evidence, apart from its expert’s\n                    opinion, to show that any of its suggested alternatives could have been carried\n                    out, and that it had adduced no evidence that it had any right to enforce the\n                    Franchise Agreement against D’Oz under Chinese law in the circumstances\n                    (see GD at [41]). 11     Based on her findings, the DJ dismissed both\n                    D’Oz’s claim and PSB’s counterclaim (see GD at\n                [42]).",
        "Issues raised in these appeals": "12     The two main issues in these appeals\n                    are: (a)     whether there was noforce majeure; and (b)     whether the counterclaim had been established\n                        under Chinese law.",
        "Decision of this court": "",
        "The presence offorce majeureunder\n                Chinese law": "13     The DJ found that the Franchise Agreement was\n                    governed by Chinese law. Both parties were prepared for such a finding, and\n                    called expert witnesses to testify on the effect of Chinese law on the operation\n                    of the Franchise Agreement at the trial. The relevant provisions in the Contract\n                    Law of China for present purposes are Articles 94, 97, and 117. These provisions\n                    read as follows:[note: 8] Article 94 The parties to a contract may terminate the contract under any of the\n                        following circumstances: (1) it is rendered impossible to achieve the\n                        purpose of contract [sic] due to an event offorce majeure; …. … Article 97 After the termination of a contract, performance shall cease if the\n                        contract has not been performed; if the contract has been performed, a party\n                        may, in accordance with the circumstances of performance or the nature of\n                        the contract, demand the other party to restore such party to its original\n                        state or adopt other remedial measures, and such party shall have the right\n                        to demand compensation for damages. … Article 117 A party who is unable to perform a contract due toforce majeureis exempted from liability in part or in whole\n                        in light of the impact of the event offorce\n                            majeure, except otherwise [sic]\n                        provided by law. Where an event offorce\n                            majeureoccurs after the party’s delay in performance,\n                        it is not exempted from such liability. For the purpose of this Law,force majeuremeans any objective circumstances which are unforeseeable, unavoidable and\n                        insurmountable. [appropriate formatting added] D’Oz relies on these provisions to claim a refund of its payment\n                    of $120,000. 14     It is clear that the basis of the dismissal of\n                    the claim by the DJ was that the promulgation of the 2003 Regulation occurred\n                    before the Franchise Agreement was entered into (see GD at [39]–[40]). It\n                    was argued that legal relationsvis-à-visthe\n                    Franchise had commenced with the signing of the Term Sheet and the Preliminary\n                    Agreement; but this argument was rejected by the DJ due to cl 22 of the\n                    Franchise Agreement (see GD at [39]). 15     In my view, the DJ has misconstrued the effect\n                    of cl 22, which reads: This Agreement, the documents referred to herein, and the Schedules and\n                        Appendices hereto constitute the entire, full and complete Agreement between\n                        the Franchisor and the Franchisee concerning the subject matter hereof, and\n                        shall supersede all prior agreements, no other representations having\n                        induced the Franchisee to execute this Agreement. The DJ held that since cl 22 provides that the Franchise\n                    Agreement is the “entire agreement”, the court should disregard\n                    the Term Sheet and the Preliminary Agreement (see GD at [39]). However, in my\n                    view, this conclusion is contrary to the expert evidence on Chinese law.\n                    D’Oz’s expert on Chinese law, Ms Chen Xiaoqin\n                    (“Ms Chen”), testified that “the [F]ranchise had\n                    already commenced from the moment the [T]erm [S]heet was signed on\n                        19/12/2002”.[note: 9]She also testified that\n                    cl 22 did not render void the previously signed Term Sheet and Preliminary\n                    Agreement. Her evidence, when re-examined on this issue, was as\n                        follows:[note: 10] Q:    You were referred to clause 22 of the\n                            [F]ranchise [A]greement … and asked if you agree that this clause\n                            discharged all agreements, etc. and you disagreed. Can you explain why\n                            from the Chinese law point of view? A:    This sentence states that this is only a\n                            supplemental agreement. All the other agreements were not discharged so\n                            long as they are consistent. … All the documents are to be\n                            executed. The [T]erm [S]heet is the master agreement. All the others are\n                            just supplementary. They are to complete and are supplemental to the\n                            master agreement. In China,if the new agreement was\n                                to supersede the previous agreement, it will state that all the\n                                previous agreements will be void and terminated. As such\n                            this clause does not discharge the earlier agreements. [emphasis added] 16     In response to Ms Chen’s opinion,\n                    Mr Sun Wen Jie (“Mr Sun”), the Chinese law expert called\n                    by PSB, gave the view that cl 22 replaced all agreements not referred to\n                    expressly in the Franchise Agreement. He said:[note: 11] If I remember correctly, Ms Chen interpreted clause 22 that the\n                        [F]ranchise [A]greement and the earlier [T]erm [S]heet and the [P]reliminary\n                        [A]greement [sic]. She referred to the [T]erm\n                        [S]heet as the master agreement and the [F]ranchise [A]greement was\n                        supplementary. I feel that it is incorrect for her to put it in that manner.\n                        In accordance to interpretation by Chinese Law, if parties to an agreement\n                        have signed a series of agreements, the final agreement signed should be\n                        taken as a guide. The last agreement signed should be the final agreement.\n                        It is stated very clearly in clause 22 that this agreement shall\n                        supersede all prior agreements. The key word here should be\n                        [“]supersede[”]. When translated to Chinese, it should mean\n                        [“]replace[”].Unless reference is made in\n                            the [F]ranchise [A]greement in respect of some other documents, then I\n                            will take it as a whole agreement. But the [F]ranchise [A]greement\n                            itself did not make any reference to the [T]erm [S]heet and\n                            [P]reliminary [A]greement. [emphasis added] 17     In my view, the two opinions of the two\n                    experts do not support the DJ’s understanding of cl 22. Ms Chen\n                    took the position that the “entire, full and complete” agreement\n                        (percl 22) between the parties included\n                    the Term Sheet and the Preliminary Agreement. Mr Sun, who gave a contrary\n                    conclusion, opined that if the Franchise Agreement referred to the Term Sheet\n                    and the Preliminary Agreement, then those agreements would form part of the\n                    entire agreement pursuant to cl 22. The reason why Mr Sun gave the\n                    view that the Term Sheet and the Preliminary Agreement did not form part of the\n                    entire agreement was that they were not referred to in the Franchise Agreement.\n                    But the Franchise Agreementdidrefer specifically\n                    to the Term Sheet and the Preliminary Agreement – in cl 4.1.\n                    Therefore, even on Mr Sun’s interpretation of cl 22, the Term\n                    Sheet and the Preliminary Agreement would form part of the entire agreement\n                    between the parties. 18     On the basis of the expert evidence on Chinese\n                    law, the DJ was wrong to disregard the significance of the Term Sheet and the\n                    Preliminary Agreement in the whole scheme of things. The evidence on how\n                    cl 22 should be construed under Chinese law was that there was a binding\n                    agreement between the parties for the Franchise, and this agreement was embodied\n                    by the Franchise Agreement, as well as the Term Sheet and the Preliminary\n                    Agreement. It could be added that there is no reason to doubt the legal effect\n                    of the Term Sheet and the Preliminary Agreement. D’Oz, for one, would not\n                    have paid PSB 60% of the Franchise Fee upfront, unless the Term Sheet and/or the\n                    Preliminary Agreement, when signed, had legal effect. PSB also would not have\n                    provided training to D’Oz’s personnel in China and Singapore, unless\n                    the Term Sheet and/or the Preliminary Agreement, when signed, had legal\n                    effect. 19     As the Term Sheet and the Preliminary\n                    Agreement formed part of the entire agreement between the parties, and both\n                    documents clearly had legal effect from the time they were signed, there is no\n                    reason why a finding that the promulgation of the 2003 Regulation constituted an\n                    event offorce majeureshould be precluded purely\n                    on the basis that it had occurred before the signing of the Franchise Agreement.\n                    In my view, there was sufficient evidence to establish that the 2003 Regulation\n                    in some way – either by its promulgation or its coming into force –\n                    constituted an event offorce majeure. In this\n                    connection, there is no need for me to delve into whether the supervening event\n                    was the promulgation of the 2003 Regulation or its coming into force. It could\n                    be added that PSB did not challenge the DJ’s finding (see GD at [41]) that\n                    it had failed to establish that the Franchise could be implemented in\n                    alternative ways after the 2003 Regulation came into force. 20     Accordingly, D’Oz is entitled to a\n                    refund of the $120,000 that it had paid as part payment of the Franchise Fee.\n                    Having regard to all relevant circumstances, including the period of time that\n                    has passed since the commencement of the cross-actions that have led to the\n                    present appeals, I see no reason to deny D’Oz its claim for interest, but\n                    at the rate of 5.33% per annum from the date of the writ to the date of\n                    judgment.",
        "PSB’s counterclaim": "21     The appeal against the decision on the\n                    counterclaim was premised on the assumption that the decision of the DJ to\n                    dismiss D’Oz’s claim would be upheld by this court. Although, for\n                    the reasons provided above, that decision has been reversed, I have some brief\n                    comments to make. 22     In its appeal, PSB accepted that it did not\n                    adduce any evidence at the trial on Chinese law as to the consequences of a\n                    breach of contract. However, it argued that since the DJ had upheld the validity\n                    of the Franchise Agreement under Chinese law, it must follow that D’Oz was\n                    contractually liable to pay the balance of $80,000 for the Franchise Fee. PSB\n                    argued, further, that the court should in any event apply Rule 18 inDicey, Morris and Collins on The Conflict of\n                        Lawsvol 1 (Sir Lawrence Collins gen ed) (Sweet &\n                    Maxwell, 14th Ed, 2006), which reads (at para 9-001): Rule 18—(1) In any case to which foreign law applies, that law must\n                        be pleaded and proved as a fact to the satisfaction of the judge by expert\n                        evidence or sometimes by certain other means. (2) In the absence of satisfactory evidence of foreign law, the court will\n                        apply English law to such a case. Reference was made to a number of local decisions where our courts\n                    have presumed Singapore law to be the same as foreign law (see,eg,K-Rex Finance Ltd v Cheng Chih\n                        Cheng[1992] 3 SLR(R) 296,Goh Chok\n                        Tong v Tang Liang Hong[1997] 1 SLR(R) 811,Parno v SC Marine Pte Ltd[1999] 3 SLR(R) 377\n                    andOng Jane Rebecca v Lim Lie Hoa[2003] SGHC 126). Accordingly, PSB argued that Rule 18 applies,\n                    and that it is entitled to judgment on the counterclaim. 23     PSB’s line of argument raises two\n                    different issues. The first issue is whetheron the\n                        evidence, PSB is entitled to judgment for the unpaid balance of\n                    $80,000. I agree with PSB’s submission on this issue. My view is that\n                    since the DJ held that the Franchise Agreement was not affected byforce majeureand therefore remained valid and binding\n                    on D’Oz under Chinese law, D’Oz must also remain liable to pay the\n                    balance of $80,000 in accordance with the Franchise Agreement’s terms. No\n                    further evidence on Chinese law would be necessary to prove liability because it\n                    follows that D’Oz, having acquired the Franchise, must pay the unpaid\n                    balance of the Franchise Fee. In this connection, it may be noted that the DJ\n                    seemed to have held that the balance was not payable because PSB failed to\n                    establish that the Franchise could be performed in the alternative ways it had\n                    suggested. This, in my view, would be inconsistent with her earlier holding that\n                    the Franchise Agreement was not affected byforce\n                        majeure. 24     Furthermore, PSB’s arguments on the\n                    feasibility of alternative methods of implementation of the Franchise related to\n                    D’Oz’s contention that the 2003 Regulation would have prevented\n                    D’Oz from setting up a joint venture educational institution in China.\n                    D’Oz’s argument became irrelevant in the light of the DJ’s\n                    finding that there was noforce majeure. If there\n                    was noforce majeure, it followed that D’Oz\n                    must pay for what it had purchased from PSB. If D’Oz could not make use of\n                    the Franchise, due to its own fault (as found by the DJ) and not the fault of\n                    PSB (see GD at [39]), then D’Oz must pay for the Franchise. That was what\n                    the whole case was all about,viz, whether\n                    D’Oz was bound by the terms of the Franchise Agreement, and the DJ found\n                    that D’Oz was so bound. Logically, the DJ should then have found\n                    D’Oz liable on the counterclaim. If the DJ’s decision on\n                    D’Oz’s claim is upheld, PSB’s appeal should be allowed.\n                    However, this is academic as the DJ’s decision has been\n                reversed. 25     Turning to the second issue which pertains to\n                    the presumption of similarity of laws, it is only necessary to observe that the\n                    presumption is a rule of convenience which the courts may resort to unless it is\n                    unjust and inconvenient to do so. It is a rule that is not free from exceptions.\n                    Whether a common law court will presume foreign law to be the same as thelex foriin any case where foreign law is not\n                    pleaded or not proved (if pleaded) depends on the circumstances of each case.\n                    The question that is ordinarily asked when the presumption is invoked is\n                    whether, in the circumstances of the case, it would be unjust to apply it\n                    against a party so as to make him liable on a claim subject to foreign law when\n                    the claimant has failed to prove what the foreign law is and how liability is\n                    established under that foreign law (see Richard Fentiman,Foreign Law in English Courts(Oxford University Press,\n                    1998) at pp 60–64 and 143–153, cited inTamil Nadu Electricity Board v ST-CMS Electric Company Private\n                        Ltd[2008] 1 Lloyd’s Rep 93 at 113). In the New South\n                    Wales Court of Appeal case ofDamberg v Damberg and\n                        Others(2001) 52 NSWLR 492, Heydon JA examined\n                    extensively,inter alia, case law from Australia,\n                    England, Canada and South Africa, and academic writings on the subject, and\n                    concluded that “[t]o state exhaustively when a court would not assume\n                    that the unproved provisions of foreign law are identical with those of the lex\n                    fori would be a difficult task” (at 522). In the present case, it is just\n                    as well that it is not necessary for me to undertake this arduous\n                task.",
        "Conclusion": "26     For the reasons given above, D’Oz is\n                    entitled to the refund of $120,000 with interest at the rate of 5.33% per annum\n                    from the date of the writ to the date of judgment. The appeal in DCA 11 is\n                    allowed and the appeal in DCA 12 is dismissed, both with costs to\n                    D’Oz here and below.  [note: 1]Plaintiff’s Bundle of Documents (“PBD”)\n                                vol 2 at pp 357–370. [note: 2]Agreed Bundle of Documents (“ABD”) at p\n                                152. [note: 3]ABD at p 160. [note: 4]ABD at p 166. [note: 5]Joint Record of Appeal vol 3A at pp 18–27\n                                and 32. [note: 6]PBD vol 2 at pp\n                                    382–393. [note: 7]See D’Oz’s Appellant’s Case for DCA\n                                11 at para 12. [note: 8]PBD vol 2 at pp\n                                485–487. [note: 9]Notes of Evidence (“NE”)\n                                at p 101. [note: 10]NE at p\n                    110. [note: 11]NE at pp\n                                149–150."
    }
}