{
    "case_title": "Sinwa SS (HK) Co Ltd\n      v\n      Morten Innhaug",
    "ncitation": "[2010] SGHC 157",
    "coram": "Andrew Ang J",
    "sections": {
        "Introduction": "1       By way of this originating summons, the\n                    plaintiff sought leave to bring a derivative action on behalf of a company, of\n                    which the plaintiff was a minority shareholder, against the defendant. After\n                    hearing submissions from both parties, I dismissed the plaintiff’s\n                    application. I now set out my reasons for doing so.",
        "Background": "2       While there were only two parties to this\n                    action, the factual matrix really involved seven companies and one individual.\n                    It would be convenient to identify them at this early stage, as follows: (a)     Nordic International Limited, a\n                        company incorporated in the British Virgin Islands\n                        (“NIL”); (b)     Sinwa Limited, a Singapore-incorporated company\n                        (“Sinwa”); (c)     Sinwa SS (HK) Co Ltd, a company incorporated in Hong Kong\n                        (“the plaintiff”); (d)     Morten Innhaug, the only natural person directly involved\n                        in the litigation (“the defendant”); (e)     Nordic Maritime Pte Ltd\n                        (“NMPL”); (f)     BGP Geoexplorer Pte Ltd (“BGP”), the\n                        Singapore subsidiary of a Chinese state-owned enterprise; (g)     TGS-NOPEC Geophysical Company ASA\n                        (“TGS”); and (h)     Nordic Geo Services Limited\n                    (“NGS”). 3       This litigation primarily revolved around NIL, a\n                    company incorporated on 16 January 2007 with the defendant as the sole\n                    director and shareholder. NIL was set up essentially as a ship-owning company\n                    whose main business was to purchase and own the fishing trawler “BGP\n                    ATLAS” (“the vessel”). The defendant intended to convert\n                    the vessel from an ordinary fishing trawler into a specialised seismic survey\n                    ship and equip it accordingly. The vessel was bought by NIL on 12 January\n                    2007 and refitted as a seismic survey vessel in Poland. 4       However, even before the vessel was purchased,\n                    the defendant had already put in place the various pieces required to make the\n                    business model a success. On 1 January 2007, a ship management agreement\n                    was signed between NIL and NMPL pursuant to which NMPL was to operate the vessel\n                    for a consideration of US$800 a day. The defendant was also a director and\n                    shareholder of NMPL. NIL, represented by the defendant, was also in negotiations\n                    with BGP for BGP to charter the vessel from NIL. Those negotiations took place\n                    around November 2006 and culminated in a time charter agreement (“the\n                    Time Charter”) signed on 8 June 2007, pursuant to which BGP was to\n                    charter the vessel from NIL for a period of three years beginning from\n                    15 June 2007. By a contract signed between BGP and TGS on 22 or\n                    23 December 2006, BGP agreed to provide seismic survey services to TGS. In\n                    short, the arrangement was as follows: the defendant was to be the owner of the\n                    vessel, NMPL the manager and operator, BGP the charterer and TGS the\n                    client. 5       Sinwa stepped into the picture in or about\n                    February 2007. After the purchase of the vessel, it became necessary for NIL to\n                    obtain more funds to finance the retrofitting of the vessel from a fishing\n                    trawler to a seismic survey ship. It was to Sinwa that NIL, and the defendant,\n                    turned for an injection of capital. Apparently, Sinwa had access to credit\n                    facilities which could be used to buy seismic survey equipment. While Sinwa was\n                    not new to the maritime industry, it certainly was not as familiar with the\n                    seismic survey industry as the defendant was. Nevertheless, on 4 July 2007,\n                    Sinwa entered into a shareholders’ agreement (“the\n                    Shareholders’ Agreement”) with the defendant whereby the defendant\n                    was to sell 50% of his shares in NIL to Sinwa. As a result, Sinwa and the\n                    defendant were equal shareholders of NIL. Furthermore, the Shareholders’\n                    Agreement also contained the following clauses regarding the making of\n                    decisions: 6.DIRECTORS AND BOARD OF\n                                DIRECTORS 6.1    Forthwith\n                            or as soon as practicable after executing this Agreement, both SINWA and\n                            MORTEN INNHAUG shall each nominate and appoint two (2) directors as\n                            follows, and the following shall comprise the Board:- 6.1.1Sim Yong Teng (nominated by\n                            SINWA); 6.1.2Tan Lay Ling (nominated by\n                            SINWA); 6.1.3Morten Innhaug (nominated by MORTEN\n                                INNHAUG); and 6.1.4Kjell Gauksheim (nominated by MORTEN\n                                INNHAUG). … 6.7    Any decision of the\n                            Board shall be made by a majority vote of the directors present at a\n                            duly constituted meeting provided that the following matters shall\n                            require the unanimous consent of all the directors of the\n                        Board:- 6.7.1entering into any contract (other than in\n                                the ordinary course of the Joint Venture Project), arrangement,\n                                commitment, or transaction of any nature whatsoever that is of an\n                                aggregate value in excess of USD 1,000,000.00. 6.7.2appointment of the company secretary and\n                                auditor of the company or changing such appointment; 6.7.3appointment of the bankers of\n                            NIL; 6.7.4raising or borrowing of funds for NIL of an\n                                aggregate value in a financial year that is in excess of USD\n                                1,000,000.00. 6.7.5making any loan or advance or giving credit\n                                (other than normal trade credit) to any person; 6.7.6taking or agreeing to take any lease or\n                                licence of real property; 6.7.7the approval of the business plan including\n                                the annual budget of NIL and all revisions thereto. … 8.MANAGEMENT AND\n                            OPERATIONS 8.1    Parties\n                            agree that:- 8.1.1all technical and economical (sic) matters\n                                relating to the operations and management of the Vessel, and/or\n                                matters related to the time charter party and/or matters related to\n                                the client BGP and end user [TGS], shall be solely decided by the\n                                directors appointed by MORTEN INNHAUG (whose decision shall be\n                                final); 8.1.2all matters relating to the accounting\n                                and/or management and/or auditing of the accounts and books and\n                                financing of the Vessel and/or matters relating to Credit Facilities\n                                shall be solely decided by the directors appointed by SINWA (whose\n                                decision shall be final); and 8.1.3save as aforesaid, all other decisions in\n                                respect of any other matters shall carry the unanimous agreement of\n                                both parties. Sinwa’s rights and obligations under the\n                    Shareholders’ Agreement were novated to the plaintiff on or about 28\n                    August 2007, thus explaining the plaintiff’s involvement in this\n                    application. As might have been anticipated, the division of decision-making\n                    power in the form and language adopted became a source for unhappiness and\n                    conflict. 6       As it turned out, the plaintiff had many\n                    complaints regarding the conduct of the defendant in their joint venture. The\n                    main grouse, however, appeared to be regarding an assignment of the Time Charter\n                    agreed between NIL and BGP. By this assignment, NGS, a company the\n                    defendant incorporated specifically for the purpose, took over BGP’s\n                    rights under the Time Charter. It was the plaintiff’s case that NGS, being\n                    a wholly-owned subsidiary of NMPL, was controlled by the defendant. According to\n                    the plaintiff, this assignment was effected by two agreements. First, on 22\n                    September 2008, a notice of assignment was signed between BGP and NGS whereby\n                    BGP “notified” NGS that BGP was assigning all its rights under the\n                    Time Charter to NGS (“the Notice of Assignment”). Second, by an\n                    acknowledgment and undertaking of the Notice of Assignment, also signed on 22\n                    September 2008, BGP consented to the assignment (“the Acknowledgment of\n                    Assignment”). (Even though the documents were entitled “Notice of\n                    Assignment” and “Acknowledgment and Undertaking”, the\n                    effect of the documents was, in fact, an assignment of the Time Charter. It is\n                    further to be noted that in its closing submission the plaintiff had taken the\n                    erroneous position that a third agreement (“the Memorandum of\n                    Agreement”), entered into between NMPL, BGP and TGS, was part of the\n                    agreements putting the assignment of the Time Charter into effect. The\n                    Memorandum of Agreement, dated 23 August 2008, related to a different assignment\n                    altogether and had to do with the assignment of BGP’s agreement with TGS\n                    to provide seismic survey services to the latter.) 7       The plaintiff was informed of the assignment of\n                    the Time Charter on 11 September 2008 via an e-mail from a representative\n                    of the defendant. Earlier, on 9 September 2008, Kjell Gauksheim\n                    (“Gauksheim”) (a director appointed by the defendant) informed the\n                    plaintiff that NMPL had taken over the “seismic operation of [the\n                    vessel]”. Of course, Gauksheim was not being entirely forthright at that\n                    point in time as it was NGS which had taken over BGP’s rights under the\n                    Time Charter. The plaintiff then enquired if the change had any financial\n                    implications for NIL. It was then that Gauksheim came clean. To this question,\n                    the plaintiff received the following reply over e-mail on 11 September 2008\n                    (“the 11 September e-mail”): All terms and conditions for NIL remain the same. [BGP] has assigned the charter contract to NGS. NGS (Nordic Geo Services) is a 100% owned subsidiary of NMPL. Despite the above assurance, the plaintiff was still concerned about\n                    the financial implications of the assignment and did not recognise the\n                    assignment. To the plaintiff, the defendant procured the assignment to profit\n                    from a clause (cl 40) in the Time Charter which allowed the charterer an option\n                    to purchase the vessel together with all its equipment at the price of\n                    US$5,000,000 on completion of the three-year charter period. The defendant, it\n                    was alleged, was seeking to buy the vessel on the cheap via this clause. On 23\n                    October 2008, the plaintiff formally issued a letter to the defendant stating\n                    its objections. By this letter, the plaintiff made known its dissatisfaction\n                    with: (a)     the assignment; (b)     an attempt by the defendant to change\n                        the name of the vessel without the plaintiff’s\n                    consent; (c)     the\n                        appointment of NMPL as managers of the vessel, given that it was also the\n                        holding company of NGS to whom the vessel was chartered – (even though\n                        the plaintiff used the word “appointment”, it was clear that\n                        it, in fact, meant “continuation”); and (d)     a purported disregard of the interests\n                        of NIL. Accordingly, the plaintiff called for the removal\n                    of NMPL as managers of the vessel, termination of the assignment and\n                    reinstatement of BGP as charterers of the vessel. The defendant did not accede\n                    to this request. 8       Another area of disagreement between the parties\n                    was in regard to the payment for the charter of the vessel. Despite the\n                    assignment, the plaintiff, purportedly on behalf of NIL, insisted that BGP\n                    remain liable for payment of charter hire under the Time Charter. However, for\n                    four months from September to December 2008, NGS had tendered payment of the\n                    charter hire which NIL accepted without any objections on the part of the\n                    plaintiff. The plaintiff pointed to cl 17(a) of the Time Charter which\n                    provided that while BGP might assign the charter of the vessel to another party,\n                    BGP remained primarily liable for the due performance of the obligations under\n                    the Time Charter. BGP disagreed. BGP’s position was that it had been\n                    “relieved and released of all obligations” under the Time Charter\n                    because of the assignment and it was not liable to NIL at all. Because of the\n                    impasse, the plaintiff sought to commence legal proceedings against BGP for the\n                    outstanding charter hire. However, the defendant disagreed with the plaintiff\n                    and its attempts to recover the charter hire from BGP. The defendant argued that\n                    the plaintiff, on its own, did not have authority to commence legal proceedings.\n                    Thus, the defendant, through his solicitors, required that the plaintiff cease\n                    from representing that it acted for NIL in relation to the legal\n                    proceedings. 9       The plaintiff also alleged that the defendant\n                    had misappropriated funds properly belonging to NIL for his own purposes.\n                    According to the plaintiff, it came to know in early June 2008 that a sum of\n                    US$400,000 had been loaned to an entity known as Haydock International Ltd\n                    (“Haydock”) on or about 28 May 2008 without the plaintiff’s\n                    approval. This sum had initially been transferred from NIL to NMPL and was\n                    intended to cover the monthly expenses for the vessel. However, NMPL later\n                    further transferred the money to Haydock. It was not disputed that Haydock was a\n                    company controlled by the defendant. Upon the plaintiff’s query, the\n                    defendant essentially explained that it was normal for shipowners to use the\n                    operating funds belonging to one vessel to cover the operating costs of another.\n                    Hence, in the present case, NMPL had loaned the US$400,000 to another entity\n                    which the defendant had an interest in. 10     The plaintiff further complained of purported\n                    discrepancies discovered when the plaintiff audited NMPL’s management of\n                    the vessel. They included: (a)     the payment by NIL of administrative\n                        charges, amounting to US$115,750, to NMPL which the plaintiff asserted was\n                        never agreed upon; (b)     the increase of monthly salaries paid to the crew during a period\n                        when the vessel was supposed to be laid-up; (c)     the payment of crew salaries to an entity known\n                        as “Eagle Clarc Shipping Phils, Inc” (“Eagle\n                        Clarc”), a payment which NMPL did not, or could not,\n                        explain; (d)     a\n                        failure by NMPL to inform NIL of fuel costs that NIL had\n                    overpaid; (e)     the\n                        acquisition of provisions and stores at prices that the plaintiff deemed\n                        excessive; and (f)     the over-payment of insurance premiums. The plaintiff\n                    alleged that as director in charge of all matters concerning the management of\n                    the vessel, the defendant bore full responsibility for the mismanagement of the\n                    vessel as revealed by the audits. 11     In sum therefore, the plaintiff alleged that\n                    the defendant had breached his duty as a director of NIL by doing the\n                    following: (a)     procuring an assignment of the Time\n                        Charter by BGP to NGS, a company controlled by the\n                    defendant; (b)     withholding payment or causing the withholding of charter hire to NIL by\n                        reason of the assignment of the charter hire to NGS; (c)     profiting or intending to profit from\n                        the sale of the vessel after the completion of the three-year charter\n                        period; (d)     charging NIL for an administrative fee without\n                    authority; (e)     failing\n                        to inform NIL of overpaid fuel costs; (f)     paying crew salaries erroneously or\n                    excessively; (g)     overpaying insurance premiums; (h)     making excessive payments for provisions and\n                        stores; (i)     misappropriation of funds owned by NIL; (j)     failing to explain why payment was made to Eagle\n                        Clarc; (k)     failing\n                        to procure provisions and stores at a cheaper prices; and (l)     failing to provide any or adequate\n                        information when so queried. The plaintiff averred that\n                    the defendant had failed to address the plaintiff’s unhappiness with the\n                    way the joint venture had been conducted. Accordingly, on 21 July 2009, the\n                    plaintiff issued a “Notice of Intention to Apply for Leave of\n                    Court” to the directors of NIL, requesting that legal action be taken\n                    against the defendant for his breaches of duty as a director of NIL and seeking\n                    authority for the plaintiff to do so on behalf of NIL. While the directors\n                    appointed by the plaintiff supported this request, directors appointed by the\n                    defendant did not. In the absence of an approval from the board of directors of\n                    NIL to take legal action against the defendant, the plaintiff started this\n                    application for leave to commence a derivative action.",
        "Parties’ submissions": "12     The plaintiff relied upon the “fraud on\n                    the minority” exception to theFoss v\n                        Harbottlerule in its application. Citing the case ofPrudential Assurance Co Ltd v Newman Industries Ltd (No\n                        2)[1982] Ch 204 (“Prudential Assurance\n                        (CA)”), the plaintiff argued that a minority shareholder\n                    would be allowed to bring an action on behalf of a company against the majority\n                    shareholder, even without the approval of the board of directors, when the\n                    majority shareholder had committed a fraud against the company and the majority\n                    shareholder was in control of the company. In the present case, the plaintiff\n                    submitted that by the various breaches of the defendant’s duty as a\n                    director of NIL, as outlined in[11]above,\n                    the defendant had committed fraud against NIL. Furthermore, even though the\n                    plaintiff was not a minority shareholder as it owned 50% of the shares in NIL,\n                    the plaintiff nevertheless argued that it could avail itself of the\n                    “fraud on a minority” exception since the defendant was able to\n                    prevent legal action from being brought against himself. 13     The defendant objected to the\n                    plaintiff’s application on various grounds. First, he contended that the\n                    plaintiff’s application was procedurally wrong. He argued that the\n                    plaintiff should have taken out a writ of summons instead of an originating\n                    summons against the defendant and that NIL should have been added as a\n                    co-defendant. The plaintiff’s right to proceed on behalf of the company\n                    should then be determined as a preliminary issue at trial. Relying on Tan Cheng\n                    Han,Walter Woon on Company Law(Sweet &\n                    Maxwell, Rev 3rd Ed, 2009) (“Walter Woon on\n                        Company Law”) the defendant submitted that in order to\n                    establish the “fraud on the minority” exception, the plaintiff had\n                    to demonstrate that the defendant had obtained some benefit and that some\n                    detriment was caused to NIL. The plaintiff had failed to do either. Finally, the\n                    defendant argued that a minority shareholder ought not to be allowed to bring a\n                    derivative action on behalf of a company if other remedies were available to the\n                    company. In the present case, the defendant submitted that arbitration was\n                    available to the company.",
        "The decision of the court": "14     As previously mentioned, I dismissed the\n                    plaintiff’s application for leave to commence a derivative action on\n                    behalf of NIL. It is pertinent to note at the outset that because NIL was a\n                    company incorporated in the British Virgin Islands, the plaintiff was unable to\n                    avail itself of the remedy provided in s 216A of the Companies Act (Cap 50,\n                    2006 Rev Ed) (“the Act”): seeTing Sing\n                        Ning v Ting Chek Swee[2008] 1 SLR(R) 197\n                        (“Ting Sing Ning”). Thus, this\n                    judgment deals only with the common law derivative action.",
        "Preliminary point: procedure": "15     The learned authors ofWalter Woon on Company Lawstate the proper procedure to start a\n                    derivative action in Singapore (at paras 9.60–9.62) as follows: 9.60As there is no procedure prescribed for a\n                            derivative action, it will take the form of a representative action.\n                            ‘It is not permissible for the plaintiff to sue in his own name,\n                            without indicating that he is bringing the action in a representative\n                            capacity and for the benefit of the company of which he is a\n                            shareholder’: per Gopal Sri Ram JCA inAbdul\n                                Rahim bin Aki v Krubong Industrial Park (Melaka) Sdn Bhd.\n                            The proper procedure would be for the plaintiff to bring the action on\n                            behalf of all the shareholders except the defendants; the company should\n                            be joined as a defendant in order that it be bound by the result of the\n                            action. 9.61The question oflocus\n                                standito bring a derivative action should be decided as\n                            a preliminary point. InHuang Ee Hoe v Tiong Thai\n                                King, Chong Siew Fai J did not agree to the\n                            plaintiffs’ suggestion that the preliminary issues be dealt with\n                            at the commencement of the trial of the action. According to the learned\n                            judge: Leaving the issues for disposal at the commencement of trial of the\n                            main action necessarily means that all are set for the trial including\n                            the subpoena and presence or attendances of witnesses of both sides in\n                            participation [sic] of the trial to\n                            proceed. On the other hand, if the preliminary issues are disposed of in\n                            advance, preparatory works for the trial as aforesaid may or may not be\n                            necessary, depending upon the result of the present application. An\n                            early disposal of the present application would undoubtedly place\n                            parties in a clearer position as to whether anything needs be done in\n                            the conduct of the case, and is, in my opinion, to be preferred. 9.62The application\n                            should normally be made under theRules of Court\n                                1996Order 33 r 2 for trial as a preliminary issue.\n                            However, inSmith v Croft (No 2)Knox J decided that raising the issue oflocus standiin an application under the United Kingdom\n                            equivalent of the Rules of Court 1996 Order 18 r 9 was ‘not\n                            inherently defective’. 16     The above position reflects that taken by the\n                    Malaysian Court of Appeal inAbdul Rahim bin Aki v Krubong\n                        Industrial Park (Melaka) Sdn Bhd[1995] 3 MLJ 417\n                        (“Abdul Rahim bin Aki”). In that\n                    case, the appellant, a minority shareholder in a company known as Tunas Murni\n                    Sdn Bhd, took out an action against the first respondent and other shareholders\n                    for breaches of duty. He first did this by using the company’s name but\n                    this action was struck out as the board of directors had not approved the\n                    action. He then brought a second action by originating summons in his own name,\n                    claiming that it was a derivative action. The Malaysian High Court dismissed the\n                    second action on the basis that common law fraud had not been established on the\n                    facts. The Court of Appeal dismissed the appeal on the basis,inter alia, that there were procedural improprieties.\n                    Gopal Sri Ram JCA held as follows: We now turn to consider the one exception with which this case is\n                        concerned. It is the derivative action; an ingenious procedural device\n                        created by courts of equity; by which the rule of judicial non-interference\n                        is overcome. It is based upon the premise that the company which has been\n                        wronged is unable to sue because the wrongdoers are themselves in control of\n                        its decision-making organs and will not, for that reason, permit an action\n                        to be brought in its name.In these circumstances, a\n                            minority shareholder may bring an action on behalf of himself and all\n                            the other shareholders of the company, other than the defendants. The\n                            wrongdoers must be cited as defendants. So too must the company. The\n                            title to the action must reflect that the suit is being brought in a\n                            representative capacity. The statement of claim or other pleading filed\n                            in support of the originating process must disclose that it is a\n                            derivative action and recite the facts that make it so. Further, there\n                            must be an express statement in the pleading that the action is being\n                            brought for the benefit of the company named as a defendant. An action\n                            that does not meet these requirements is liable to be struck out as\n                            being frivolous and vexatious. [emphasis added] 17     In the present case, the plaintiff’s\n                    counsel admitted that he had erroneously adopted the procedure applicable to a\n                    statutory derivative action and had started the action by way of an originating\n                    summons instead of a writ of summons. Besides, the plaintiff failed to join NIL\n                    as a defendant and the title of the action did not reflect that the action was\n                    being brought in a representative capacity. However, the plaintiff’s\n                    counsel argued that such defects were not necessarily fatal to its application.\n                    In the present case, the plaintiff had consistently maintained, in the\n                    originating summons and in its affidavits, that it was bringing a derivative\n                    action. Thus, the defendant was never misled that the present proceedings was\n                    anything but a derivative action brought by the plaintiff on behalf of NIL. The\n                    defendant himself did not argue that he had suffered any prejudice as a result\n                    of the plaintiff’s procedural mistake. 18     In this regard, O 2, r 1, of the Rules of\n                    Court (Cap 322, R5, 2006 Rev Ed) (“the Rules”) is\n                    instructive. The relevant rule reads as follows: Non-compliance with Rules (O. 2, r.\n                        1) 1. —(1)    Where, in\n                            beginning or purporting to begin any proceedings or at any stage in the\n                            course of or in connection with any proceedings, there has, by reason of\n                            anything done or left undone, been a failure to comply with the\n                            requirements of these Rules, whether in respect of time, place, manner,\n                            form or content or in any other respect, the failure shall be treated as\n                            an irregularity and shall not nullify the proceedings, any step taken in\n                            the proceedings, or any document, judgment or order\n                        therein. (2)    Subject to paragraph (3), the Court may, on the\n                            ground that there has been such a failure as is mentioned in paragraph\n                            (1), and on such terms as to costs or otherwise as it thinks just, set\n                            aside either wholly or in part the proceedings in which the failure\n                            occurred, any step taken in those proceedings or any document, judgment\n                            or order therein or exercise its powers under these Rules to allow such\n                            amendments (if any) to be made and to make such order (if any) dealing\n                            with the proceedings generally as it thinks fit. (3)    The Court shall not wholly set aside any\n                            proceedings or the originating process by which they were begun on the\n                            ground that the proceedings were required by any of these Rules to be\n                            begun by an originating process other than the one\n                        employed. In Jeffrey Pinsler,Singapore Court Practice\n                        2009(LexisNexis, 2009), the author wrote (at paras 2/1/1 and\n                    2/1/2) in relation to the above rule, as follows: 2/1/1. Nature and consequences of procedural\n                            error. The observance of the rules of procedure is\n                        fundamental to the course of litigation for they provide the necessary\n                        framework for the achievement of justice between the parties. While\n                        sanctions are necessary to ensure that the parties do not disregard the\n                        rules with impunity, the court’s reaction to non-compliance must be\n                        tempered by the equally important principle that the rules of procedure\n                        serve the substantive law, and that a party should not be automatically\n                        deprived of his substantive rights by procedural error … 2/1/2. Principles. … ... The position is that no irregularity or defect, whatever its nature,\n                        automatically renders the proceeding a nullity. The court is entitled to\n                        consider each case according to the circumstances and make whatever decision\n                        it deems just. … … Nevertheless, despite this broad discretion to cure any\n                        irregularity, the courts have refused to grant the remedy in various\n                        circumstances. These may be classified under the following\n                        categories: (1)where a curative approach would result in\n                            prejudice; (2)where the nature of the error is so serious or\n                            fundamental that it cannot, in principle, be validated; (3)where the rule is sufficiently comprehensive to\n                            govern non-compliance (so that resort to O 2 is inappropriate);\n                            and (5)where, although the error is\n                                not fundamental, the court will not exercise its discretion to cure\n                                it because the substantive application would\n                        fail. [emphasis added in italics] 19     I was persuaded that the procedural error\n                    committed by the plaintiff was abona fidemistake\n                    and not born of a blatant disregard for the rules of procedure. Furthermore, as\n                    far as I could tell, no prejudice was suffered by the defendant because of the\n                    plaintiff’s mistake. Hence, the failure of the plaintiff to comply with\n                    the correct procedure was one which might be cured by the court ordering a\n                    conversion of the originating summons into a writ together with other\n                    appropriate amendments. Nevertheless, I was disinclined to exercise my\n                    discretion to cure the procedural irregularity as I was of the view that the\n                    plaintiff’s application for leave to take out a derivative action would\n                    fail in any case: see[60]–[71]below.",
        "Prerequisites to a derivative action": "20     InPrudential Assurance\n                        (CA)([12]supra), the English Court of Appeal held (at\n                    [221]–[222]) that: … In our view, whatever may be the properly defined boundaries of\n                        the exception to the rule [inFoss v\n                        Harbottle], the plaintiff ought at least to be required before\n                        proceeding with his action to establish aprima\n                            faciecase (i) that the company is entitled to the relief\n                        claimed. and (ii) that the action falls within the proper boundaries of the\n                        exception to the rule inFoss v\n                        Harbottle. Thus, two requirements need to be satisfied before the court will\n                    consider granting leave to a minority shareholder to start a derivative action\n                    on behalf of a company against a majority shareholder. The first is that the\n                    company has a reasonable case against the defendant; the second concerns thelocus standiof the plaintiff to bring the\n                    action. Even if these requirements are met, the court still has discretion to\n                    decide whether or not to grant leave to commence a derivative action: see[66]below. I will now examine each\n                    requirement in turn.",
        "Entitlement to relief": "21     Before leave is granted to a plaintiff to\n                    commence an action against the defendant in the name of a company, it must first\n                    be demonstrated that the company is entitled,prima\n                        facie, to the relief claimed. This means that the plaintiff must\n                    show that the company has a reasonable, or legitimate, case against the\n                    defendant for which the company may recover damages or otherwise obtain\n                    relief. 22     The necessity for this requirement lies in the\n                    fact that the company, in fact, did not choose to take out legal\n                    proceedings against the defendant. It is a third party, the plaintiff, who, at\n                    little or no risk to himself, seeks to bring an action on behalf of the company.\n                    Improperly used, the device of a derivative action may cause the company\n                    prejudice. In the worst case scenario, a disgruntled minority shareholder may\n                    take out an action against the majority shareholder for purely extraneous\n                    reasons rather than out of abona fidedesire to\n                    seek redress on behalf of the company. Such abuse must clearly be nipped in the\n                    bud. Even if a minority shareholder did bring a derivative action in good faith,\n                    believing (albeit erroneously) that the company had a reasonable case against\n                    the defendant, it would not be fair to the company for the action to be allowed\n                    to proceed further because the company would then have to bear unnecessary costs\n                    through no fault of its own. In either case, it is right that the court, at an\n                    early stage, examine whether the company has a reasonable case, on aprima faciebasis, against the defendant before allowing\n                    the action to proceed further. 23     This, of course, does not mean that the court\n                    at this stage should make an extensive inquiry into the merits of the claim.\n                    Indeed, it must be remembered that at this stage the court is merely\n                    ascertaining whether to grant leave for an action to be brought and not trying\n                    the action itself. Rather, the court must, having regard to the affidavits filed\n                    by both parties in support of their claims and the evidence presented before the\n                    court, ascertain whether the case brought in the company’s name has a\n                    semblance of merit. There is no need to demonstrate that the case will or is\n                    likely to succeed. In this regard, we may take a leaf out of case law relating\n                    to the statutory derivative action. InAgus Irawan v Toh Teck\n                        Chye[2002] 1 SLR(R) 471 (“Agus Irawan”), the plaintiff applied for leave to\n                    commence a derivative action in the name of a company pursuant to s 216A of the\n                    Act. Choo Han Teck JC dismissed the application. In so doing, Choo JC held (at\n                    [6]–[8]) as follows: 6    … At this\n                            stage the court need not and ought not be drawn into an adjudication on\n                            the disputed facts. That is what aprima\n                                facielegitimate or arguable case is all about. Leave to\n                            cross-examine in such situations ought to be sparingly granted.\n                            I need only consider the grounds and points of challenge raised by\n                            the defendants to see if they are sufficient in themselves to destroy\n                            the credibility of the plaintiff's propounded case without a full scale\n                            hearing to determine who was truthful and who was\n                            not. 7    … Mr Bull referred\n                            to the decision inTeo Gek Luang v Ng Ai\n                                Tiong[1998] 2 SLR(R) 426 for his argument that\n                            the phrase ‘prima faciein the\n                            interests of the company’ means that the applicant must show a\n                            good arguable case. I set out below the passage relied upon by counsel\n                            at [14], for ease and convenience: Although it was and is a piece of remedial legislation enacted to put\n                            in place a procedure to protect the interests of minority shareholders,\n                            the interpretation of the provisions should be purposive and I\n                            entertained some reservation that a ‘liberal interpretation in\n                            favour of the complainant’ should be given as stated by the\n                            Ontario Court of Appeal inRichardson Greenshields of\n                                Canada Ltd v Kalmacoff(1995) 123 DLR (4th)\n                            628, at 636. Management decisions should generally be left to the board\n                            of directors. Members generally cannot sue in the name of his company. A\n                            minority shareholder could attempt to abuse the new procedure, which\n                            would be as undesirable as the tyranny of the majority directors who\n                            unreasonably refuse to act. The Canadian appellate court, however, at\n                            the same page went on to say that ‘[b]efore\n                                granting leave, the court should be satisfied that there is a\n                                reasonable basis for the complaint and that the action sought to be\n                                instituted is a legitimate or arguable one’. I\n                            agreed with this latter formulation and adopted that approach. [emphasis\n                            added] 8    I, in turn, agree entirely with what was said in the\n                            above case. The terms ‘legitimate’ and\n                            ‘arguable’ must be given no other meaning other than what is\n                            the common and natural one, that is, that the claim must have a\n                            reasonable semblance of merit; not that it is bound to succeed or likely\n                            to succeed, but that if proved the company will stand to gain\n                            substantially in money or money’s worth. But it is axiomatic that\n                            ordinarily, legal action is best left to the decision of the board of\n                            directors. It will not be in the interests of a company if all\n                            shareholders are at liberty to take it to court on Quixotic\n                            crusades. The above approach was approved by the Court of Appeal inPang Yong Hock v PKS Contracts Services Pte\n                        Ltd[2004] 3 SLR(R) 1 (“Pang\n                        Yong Hock”). 24     To put the test another way, it may be said\n                    that the application ought to be denied “if it appears that the intended\n                    action is frivolous or vexatious or is bound to be unsuccessful”: seeRe Marc-Jay Investments Inc and Levy(1975)\n                    5 OR (2d) 235 (at [237]) (“Marc-Jay”) andTeo Gek Luang v Ng Ai\n                        Tiong[1998] 2 SLR(R) 426 (“Teo Gek Luang”) (at [14]). 25     Although the above cited cases (ie,Agus Irawan,Marc-JayandTeo Gek\n                    Luang) all involved the interpretation of a statutory provision, the\n                    principles stated therein apply equally to the common law derivative action.\n                    Whether under statute or common law, the objective behind the derivative action\n                    is to provide an alternate voice for the corporate entity in situations where a\n                    wrong has been done to it and the wrongdoers are the very persons who are the\n                    usual spokespersons. However, at the same time, the court must be wary of\n                    “backseat drivers” who attempt to control the corporate vehicle by\n                    use of a derivative action. As was stated inTeo Gek\n                        Luang(at [14]), “[a] minority shareholder could attempt\n                    to abuse the new procedure, [and this] would be as undesirable as the tyranny of\n                    the majority directors who unreasonably refuse to act”. Thus, whether a\n                    derivative claim is brought under statute or common law, the court must, from\n                    the outset, assess whether the company has a reasonable case against the\n                    defendant for which the company may recover damages or other\n                relief. 26     In the present case, the plaintiff spent a\n                    large part of its submissions explaining why NIL was entitled to the relief\n                    claimed. Save with respect to one allegation, I found myself unable to\n                    agree with the plaintiff’s contentions. For completeness, I shall examine\n                    each of the plaintiff’s allegations in turn.",
        "Assignment of Time Charter": "27     The plaintiff alleged that the defendant had\n                    breached his duties to NIL by “procuring a purported assignment of a\n                    lucrative time-charter party entered into between [NIL] and BGP to a company\n                    owned and controlled by the Defendant, namely NGS …”: see\n                    para (i) of the Schedule to the originating summons. The plaintiff,\n                    however, did not make clear what exactly it was about the assignment that it was\n                    objecting to. At different points in its submissions and affidavits, the\n                    plaintiff seemed to make three distinct allegations. First, the plaintiff seemed\n                    to take objection to the fact that the defendant, as director of NIL, had\n                    somehow caused BGP to assign its rights and liabilities under the Time Charter\n                    to NGS. Second, the plaintiff also suggested that “the Plaintiffs and/or\n                    the Board of NIL” had not been given notice of the assignment: see\n                    para 12 of the plaintiff’s submissions. Third, the plaintiff, as\n                    director of NIL, approving the assignment without disclosing his interest in NGS\n                    to the plaintiff. I will deal with the objections in the same\n                order. 28     The first objection is without merit. The Time\n                    Charter unequivocally states that BGP has the right to assign the charter of the\n                    vessel to another party. Clause 17 of the Time Charter reads as follows: 17.Sublet and\n                                Assignment (a)Charterers.\n                                – The Charterers shall have the option of subletting,\n                                assigning or loaning the Vessel to any person or company not\n                                competing with the Owners, subject to the Owners’ prior\n                                approval which shall not be unreasonably withheld, upon giving\n                                notice in writing to the Owners, but the original Charterers shall\n                                always remain responsible to the Owners for due performance of the\n                                Charter Party and contractors of the person or company taking such\n                                subletting, assigning or loan shall be deemed contractors of the\n                                Charterers for all the purposes of this Charter Party. The Owners\n                                make it a Condition of such consent that additional Hire shall be\n                                paid as agreed between the Charterers and the Owners having regard\n                                to the nature and period of any intended service of the\n                                Vessel. (b)    If the Vessel is sublet, assigned or loaned to\n                                undertake rig anchor handling and/or towing operations connected\n                                with equipment, other than that used by the Charterers, then a daily\n                                increment to the Hire in the amount as stated in Box 29 or pro rata\n                                shall be paid for the period between departure for such operations\n                                and return to her normal duties for the Charterers. (c)Owners.\n                                – The Owners may not assign or transfer any part of this\n                                Charter Party without the written approval of the Charterers, which\n                                approval shall not be unreasonably withheld. Approval by the Charterers of such subletting or assignment shall not\n                            relieve the Owners of their responsibility for due performance of the\n                            part of the services which is sublet or assigned. Clearly, cl 17(a) of the Time Charter provides\n                    that the option of assigning the vessel belongs to BGP. NIL’s role, should\n                    BGP decide to assign the vessel, is merely to give approval, which approval\n                    cannot be unreasonably withheld. If the defendant did indeed\n                    “procure” the assignment, he did not do soquadirector of NIL but as controller of NGS. At the highest,\n                    the defendant,quadirector of NIL, merely gave\n                    approval for the assignment. It is not the plaintiff’s case that NIL was\n                    entitled to additional hire pursuant to cl 17(a) of the Time Charter.\n                    Hence, if the plaintiff was suggesting that the defendant had breached his\n                    duties as a director of NIL by giving approval for the assignment, such an\n                    assertion was not substantiated by any evidence as to why approval, in the\n                    circumstances, ought to have been withheld. 29     Similarly, the second objection is completely\n                    untenable. The allegation was that the plaintiff and/or the board of NIL had not\n                    been given notice of the assignment as required under cl 17(a) of the Time\n                    Charter. However, this obligation to provide notice lay with BGP. Hence, even if\n                    such notice was not provided, it was a breach of BGP’s obligations to NIL,\n                    not the defendant’s obligationsquadirector\n                    of NIL. In any case, it appeared to me that such notice had been given as the\n                    defendant was at all times fully aware of the assignment. 30     I was also not persuaded by the\n                    plaintiff’s third objection. Taking the plaintiff’s case at its\n                    highest, it was alleged that the defendant was the controlling mind of NGS. As\n                    such, the argument was presumably that the defendant had breached his fiduciary\n                    duties to NIL, to avoid profiting from his position as director of NIL (the\n                    “no profit” rule) and to avoid conflicts of interest (the\n                    “no conflict” rule). 31     In so far as the “no profit”\n                    rule is concerned, the pithy statement of law adopted inWalter Woon on Company Law([13]supra) (at para 8.38) is apposite: unless he\n                    has provided full disclosure and obtained the informed consent of the company, a\n                    director who acquires a benefit in connection with this office is accountable to\n                    the company for that benefit. InFurs Limited v\n                        Tomkies(1935) 35 CLR 583, the Australian High Court\n                    explained the rationale behind the “no profit” rule (at 592)\n                    as follows: … no director shall obtain for himself a profit by means ofa transaction in which he is concerned on behalf\n                            of the companyunless all the material facts are disclosed to\n                        the shareholders and by resolution a general meeting approves of his doing\n                        so, or all the shareholders acquiesce. An undisclosed profit which a\n                        director so derivesfrom the execution of his fiduciary\n                            dutiesbelongs in equity to the company. It is no answer to\n                        the application of the rule that the profit is of a kind which the company\n                        could not itself have obtained, or that no loss is caused to the company by\n                        the gain of the director. It is a principle resting upon the impossibility\n                        of allowing the conflict of duty and interest which is involved in the\n                        pursuit of private advantagein the course of\n                            dealing in a fiduciary capacitywith the affairs of the\n                        company. If, when it is his duty to safeguard and further the interests of\n                        the company, heuses the occasionas a means\n                        of profit to himself, he raises an opposition between the duty he has\n                        undertaken and his own self interest, beyond which it is neither wise nor\n                        practicable for the law to look for a criterion of liability. The\n                        consequences of such a conflict are not discoverable. Both justice and\n                        policy are against their investigation. [emphasis added] Significantly, as was emphasised repeatedly in the above passage, the\n                    “no profit” rule only applies when the director has obtained a\n                    benefit in the course of execution of his duties,ie,quadirector of the company\n                    and not in any other capacity. 32     Turning now to the “no conflict”\n                    rule, it is a principle of company law that a director is under an obligation\n                    not to place himself in a position where the interests of the company whom he is\n                    bound to protect comes into conflict with either his personal interest or the\n                    interest of a third party for whom he acts: seeWalter Woon\n                        on Company Law(at para 8.40). The scope of the “no\n                    conflict” rule is wide – it applies not only to situations where\n                    there are actual conflicts of interest but also to situations where there maypotentiallybe conflicts of interests. As\n                    described by Lord Cranworth inAberdeen Rail Co v Blaikie\n                        Brothers[1843–60] All ER 249 (at 252): … it is a rule of universal application that no one having such\n                        duties to discharge shall be allowed to enter into engagements in which he\n                        has orcan havea personal interest\n                        conflicting or whichpossibly may conflictwith the interests of those whom he is bound to protect. [emphasis\n                        added] After all, the “no conflict” rule is a prophylactic\n                    principle aimed at avoiding the risk that the director might prefer his personal\n                    or a third party’s interests over those of the company. Thus, it matters\n                    little that the director did not in fact subordinate the company’s\n                    interests as long as there is a potential that he may do so. 33     However, the “no profit” and the\n                    “no conflict” rules, while strict, are not absolute. A director\n                    may obtain a release of his obligations under both rules by making a full\n                    disclosure of the relevant facts to the company. As is explained inWalter Woon on Company Law(at para 8.45): … directors are not required to be insensible to their own\n                        interests. They do not have to live in ‘an unreal region of detached\n                        altrusim’ in which their own interests are forgotten. Being in a\n                        position of conflict is notper sea breach of\n                        fiduciary duty; it is the failure to disclose the material facts to the\n                        members and obtain their release that constitutes the breach. 34     In the present case, the plaintiff averred\n                    that the defendant engineered the assignment of the Time Charter to further his\n                    personal interests. In particular, the plaintiff alleged that the defendant was\n                    trying to profit from an option embedded in the Time Charter for the charterer\n                    to purchase the vessel after the charter period of three years. Clause 40 of the\n                    Time Charter reads as follows: Purchase option The charterers have the option to Purchase the vessel with equipment for a\n                        price of USD 5,000,000, after completion of the three years charter\n                        period. The plaintiff’s case was that the assignment would allow the\n                    defendant, via NGS and NMPL, to take advantage of the purchase option to buy the\n                    vessel on the cheap, thus breaching the “no profit” rule. Further,\n                    the defendant was in a position of conflict in giving consent to the assignment\n                    since he might potentially profit from cl 40. The defendant, while not\n                    addressing those allegations directly, averred that the reason for the\n                    assignment was that BGP was dissatisfied with the physical condition of the\n                    vessel and was looking for a way out of the Time Charter. The defendant merely\n                    facilitated this by having NGS take over BGP’s rights and obligations\n                    under the Time Charter. 35     There is no merit to the plaintiff’s\n                    arguments. With regard to the “no profit” rule, the opportunity to\n                    purchase the vessel was provided to the charterer of the vessel and not to the\n                    director(s) of NIL or to the defendant. Therefore, even if the defendant, on the\n                    expiry of the charter period, does profit by causing NGS to take advantage of\n                    cl 40 of the Time Charter, he does so notquadirector of NIL but as controller of NGS. The “no profit” rule\n                    therefore would not be breached. 36     Addressing now the “no conflict”\n                    rule, I must first state that the defendant’s explanation was insufficient\n                    to excuse him from having to disclose his interest in NGS to NIL. The rationale\n                    for the “no conflict” rule lies in thepotentialfor a conflict of interests. It does not matter that\n                    the director has no intention of benefiting from the transaction as long as the\n                    directormayprofit. Hence, if the defendant may\n                    profit from the assignment by causing NGS to take advantage of the purchase\n                    option, it behoves him to disclose his interest in NGS to the board of directors\n                    of NIL, especially the directors nominated by the plaintiff, before the\n                    assignment is completed. However, it appeared to me that this interest had\n                    indeed been disclosed, albeit informally and indirectly. From the evidence made\n                    available, it appeared that the assignment was completed via the two documents\n                    signed on 22 September 2008 – the Notice of Assignment and the\n                    Acknowledgment of Assignment. Prior thereto, the plaintiff’s director, Ms\n                    Tan Lay Ling, had been informed of the assignment of the Time Charter via the\n                    11 September e-mail. In the same e-mail, it was also mentioned that NGS was\n                    a wholly-owned subsidiary of NMPL. At all material times, the plaintiff was well\n                    aware that the defendant was a director and shareholder of NMPL. Under those\n                    circumstances, it seemed to me that the defendant’s interest in NGS,\n                    through NMPL, had been disclosed to the plaintiff before the assignment of the\n                    Time Charter was completed. The plaintiff made no objection at that point of\n                    time. The plaintiff only raised its opposition to the assignment on 23\n                    October 2008. In other words, for more than a month, the plaintiff kept silent\n                    and did not respond to the defendant’s disclosure. In the circumstances,\n                    it did not appear to me open to the plaintiff belatedly to allege that the\n                    defendant had breached his duty to disclose his interest in NGS before the\n                    completion of the assignment.",
        "Withholding charter hire": "37     The plaintiff next alleged that the defendant\n                    withheld payment or caused the withholding of payment of charter hire to NIL by\n                    reason of the assignment to NGS. The payment withheld was said to amount to\n                    US$6,697,000, being charter hire under the Time Charter for the periods January\n                    to June 2009. As with the allegation of procurement of the assignment of the\n                    Time Charter, this allegation was badly framed. Upon careful reading of the\n                    plaintiff’s submissions, it appeared to me that the plaintiff was not\n                    asserting that the defendant had withheld payment of the charter hireper se. Rather, the gravamen of the plaintiff’s\n                    allegation was that the defendant blocked the commencement of legal proceedings\n                    against BGP to recover the said charter hire. According to the plaintiff, it\n                    had, on behalf of NIL appointed solicitors, H A & Chung Partnership\n                    (“H A & Chung”), to take legal action against BGP for\n                    failure to pay the charter hire for the period January to June 2009. Needless to\n                    say, this was without the defendant’s concurrence. Upon learning of this,\n                    the defendant instructed his lawyers to write to H A & Chung to\n                    cease and desist from taking further action against BGP and from representing\n                    that they acted for NIL. 38     Generally, where it is contended that there\n                    was a breach of duty on the part of a director in refusing to collect a debt\n                    owing to the company, the court ought to examine the reason (if any) for the\n                    director’s refusal. However, in so doing the court should not substitute\n                    its judgment for the business decision of the director. The issue isnotwhether the decision not to collect the debt was the\n                    best or most appropriate business decision in the circumstances. Rather, the\n                    question is whether the decision was madebona\n                        fidein the best interests of the company. It is not the role of\n                    the courts to act as arbiters of management decisions by the directors unless\n                    there is evidence of their voting power being exercised for an improper purpose\n                    or in bad faith (Re Tri-Circle Investment Pte Ltd[1993] 1 SLR(R) 441 at [4]). 39     In the present case, the defendant explained\n                    his decision for not collecting the charter hire for the months January to June\n                    2009 thus: After the assignment of the Time Charter from BGP to NGS (which the\n                    plaintiff did not recognise), NGS continued to pay the charter hire for the\n                    months of September to December 2008. However, in December 2008, TGS decided to\n                    terminate the seismic acquisition agreement with NGS owing to some unhappiness\n                    with the condition of the equipment on the vessel. As a result, the vessel was\n                    laid up at anchorage from 19 December 2008 without any employment at all.\n                    The defendant averred that, in the light of the financial crisis at that\n                    point in time, it was almost impossible to find alternative employment for the\n                    vessel. On 29 January 2009, more than a month after the vessel had been laid up,\n                    the defendant, in his capacity as a representative of NGS, wrote to the\n                    plaintiff as follows: Please be informed that M.V. Nordic Venturer [the vessel] is being laid up\n                        in Singapore anchorage, since 19 December 2008 till date. The reason for the\n                        lay-up is that TGS (seismic charterer) have cancelled the seismic Contract\n                        with NGS. Therefore, NGS, as the assigned charterer, would like to propose the\n                        following solution to NIL: NGS recognizes their responsibilities and have agreed to pay the charter\n                        hire to NIL according to the C/P signed between NIL and BGP. However, as there is currently no income from the Vessel, we would like to\n                        propose that the day rate is reduced to cover the payment of the bank loan\n                        and the Opex expenses incurred during lay-up in Singapore. In other words, NGS would cover all and whatsoever expenses to NIL during\n                        the time of Vessel lay-up, but without any profit element of any kind; but\n                        at the same time ensuring that the loan to the bank, OCBC, can and will\n                        continue to be paid in a timely manner. Kindly revert with your confirmation and we await your positive response\n                        to the above. According to the defendant, NGS was entitled to a reduction of the\n                    charter hire by virtue of cl 5(d) of the Time Charter which reads as\n                    follows: Laying-up of Vessel– The Charterers\n                        shall have the option of laying up the Vessel at an agreed safe part\n                            [sic] or place for all or any portion\n                        of the Charter Period in which case the Hire hereunder shall continue to be\n                        paid but, if the period of Such lay-up exceeds 30 consecutive days there\n                        shall be credited against such Hire the amount which the Owners shall\n                        reasonably have saved by way of reduction in expenses and overheads as a\n                        result of the lay-up of the Vessel. However, the plaintiff, in line with their stand not to recognise the\n                    assignment, refused to discuss a reduction of the charter hire rate. In those\n                    circumstances, NGS stopped paying charter hire from January 2009 pending\n                    clarification on the issue of the assignment of the Time Charter and the payable\n                    charter hire rate. Presumably, the defendant, as director of NIL, did not\n                    support the plaintiff’s attempt to collect the full charter hire as he too\n                    felt NGS was contractually entitled to a reduced rate. 40     It was in respect of this argument thatprima faciethe plaintiff’s claim might\n                    have some merit. I agreed with the defendant that cl 5(d) of the Time\n                    Charter afforded NGS a right to seek a reduction in the payable charter hire.\n                    This was so if the vessel was laid-up for 30 consecutive days, which was clearly\n                    the case by late January 2009. Even if the assignment did not take place, BGP\n                    would be entitled to the same discount. Thus, there was no basis for NIL to\n                    demand the full sum of US$6,697,000 from BGP. However, that did not mean that\n                    BGP or NGS could stop paying charter hire altogether. Indeed, NGS, in its letter\n                    of 29 January 2009 to NIL, accepted its responsibility to pay charter hire.\n                    However, the quantum of charter hire payable had yet to be agreed. In the\n                    circumstances, BGP or NGS should have, at least, tendered the charter hire which\n                    it thought was reasonable. BGP or NGS could not avoid paying any charter hire\n                    for six whole months while still having the vessel at its disposal. While NIL\n                    might not be able to recover the full sum of US$6,697,000, it would, in any\n                    case, be awarded some damages as a result of BGP or NGS’s failure to pay\n                    any charter hire. Accordingly, the defendant’s refusal to approve of the\n                    legal proceedings against BGP was unlikely to have been in NIL’s best\n                    interests. Such reticence, to my mind, could perhaps be explained by the\n                    distinct possibility that BGP would seek to be indemnified by NGS for any\n                    damages and costs awarded against itself. 41     Therefore,prima\n                        facie, NIL has a reasonable cause of action against the defendant\n                    for his refusal to support legal proceedings against BGP. However, to be clear,\n                    I am not in any way pre-judging the merits of NIL’s case against the\n                    defendant in this respect. My decision is merely limited to the view that, on aprima facieassessment of the evidence adduced\n                    before me, NIL has a cause of action which has some chance of\n                success.",
        "Profiting from the sale of the vessel": "42     A baseless allegation launched against the\n                    defendant was that he had breached his duties as a director of NIL by\n                    “profiting or intending to profit from the sale of the vessel after the\n                    completion of the 3 year charter period at the discounted amount of\n                    USD5,000,000.00 ...”: see para (iii) of the Schedule to the\n                    originating summons. This argument overlaps with part of the objection regarding\n                    the assignment of the Time Charter and has been addressed at[30]–[36]above.",
        "Auditing discrepancies": "43     The plaintiff also alleged that an audit\n                    conducted by the plaintiff of NMPL’s management of the vessel revealed\n                    several discrepancies. In sum, these accusations were regarding overpayment of\n                    various charges and expenses. As before, these allegations had nothing to\n                    do with the defendant in his capacity as a director of NIL. Even if the\n                    allegations were well-founded, they merely provide NIL a cause of action against\n                    NMPL, and not the defendant.",
        "Misappropriation of funds": "44     As previously mentioned (at[9]above), another source of unhappiness lay in an\n                    alleged misappropriation of US$400,000 that the defendant had loaned to another\n                    entity without the plaintiff’s approval. However, what is significant is\n                    that the US$400,000 had earlier been properly transferred to NMPL to meet\n                    operating expenses for the vessel. Hence, even if the defendant had caused the\n                    US$400,000 to be transferred out of NMPL without authorisation, he did so as\n                    director of NMPL, not as director of NIL. As such, any claim NIL might have in\n                    this regard would be against NMPL.",
        "Failure to provide information": "45     The last allegation laid at the door of the\n                    defendant was the assertion that he had failed to provide information to the\n                    plaintiff regarding various matters when queried, including information\n                    regarding a payment to an entity known as Eagle Clarc. This, as before, was not\n                    a failure for which NIL could claim against the defendant for breach of dutiesquadirector. If anything, this would, at the\n                    most, found a claim by the plaintiff against the defendant to enforce the\n                    plaintiff’s rights as a member of NIL. It is patent that NIL would not be\n                    the party seeking information regarding itself.",
        "Summary on entitlement to relief": "46     In sum therefore, on aprima facieassessment of the evidence, none, save one, of\n                    the plaintiff’s allegations against the defendant was made out. In respect\n                    of the sole exception,viz, the allegation that\n                    the defendant had breached his duty as a director of NIL by refusing to support\n                    legal proceedings taken out against BGP, NIL may have a reasonable case against\n                    the defendant.",
        "Locus standi": "47     Given the foregoing conclusion that NIL may be\n                    entitled to some relief in respect of the defendant’s refusal to allow\n                    legal proceedings to be taken out against BGP, it is now necessary to ascertain\n                    if the plaintiff has thelocus standito commence\n                    a derivative action in the name of NIL. In 1982, the English Court of Appeal, inPrudential Assurance (CA)([12]supra), summed up the rule inFoss v Harbottle(as well as its exceptions) (at 210–211)\n                    thus: (1) The proper plaintiff in an action in respect of a wrong alleged to be\n                        done to a corporation is, prima facie, the corporation. (2) Where the\n                        alleged wrong is a transaction which might be made binding on the\n                        corporation and on all its members by a simple majority of the members, no\n                        individual member of the corporation is allowed to maintain an action in\n                        respect of that matter, because if the majority confirms the transaction,cadit quaestio[the question is at an\n                        end]; or, if the majority challenges the transaction, there is no valid\n                        reason why the company should not sue. (3) There is no room for the\n                        operation of the rule if the alleged wrong is ultra vires the corporation,\n                        because the majority of members cannot confirm the transaction. (4) There is\n                        also no room for the operation of the rule if the transaction complained of\n                        could be validly done or sanctioned only by a special resolution or the\n                        like, because a simple majority cannot confirm a transaction which requires\n                        the concurrence of a greater majority. (5) There is an exception to the rule\n                        where what has been done amounts to fraud and the wrongdoers are themselves\n                        in control of the company. The above passage represents the orthodox understanding of the rule inFoss v Harbottleand has been accepted locally\n                    inTing Sing Ning([14]supra) (at [12]).",
        "Fraud on the minority exception": "48     Of the three “exceptions” cited\n                    by the Court of Appeal inPrudential Assurance\n                        (CA)to the rule inFoss v\n                        Harbottle(see points (3)–(5) in[47]above), only point (5) is a true\n                    exception. This exception is also known as the “fraud on the\n                    minority” exception. The others (ie, points\n                    (3) and (4)) are not true exceptions as they involve situations where the rule\n                    inFoss v Harbottledoes not even apply. Where the\n                    “fraud on the minority” exception is concerned (seePrudential Assurance (CA)at 211): … the rule is relaxed in favour of the aggrieved minority, who are\n                        allowed to bring a minority shareholders’ action on behalf of\n                        themselves and all others. The reason for this is that, if they were denied\n                        that right, their grievance could never reach the court because the\n                        wrongdoers themselves, being in control, would not allow the company to\n                        sue. There are, then, two constituent elements to this exception: fraud and\n                    control. Fraud 49     What is meant by “fraud” for the\n                    purposes of establishing the “fraud on the minority” exception has\n                    been the subject of some controversy and much academic debate. Given that the\n                    resolution of the present application did not turn on this issue, I shall not\n                    attempt to set out at length the substance of the debate. The following summary\n                    will suffice. 50     The orthodox school of thought defines\n                    “fraud” by distinguishing between two different types of wrongs\n                    perpetrated against the company – ratifiable wrongs and unratifiable\n                    wrongs. In so far as ratifiable wrongs are concerned, no question of a\n                    derivative action arises as such wrongs may be ratified by a resolution passed\n                    by the shareholders of the company. In contrast, the nature of unratifiable\n                    wrongs is so egregious that no ratification is possible. Such unratifiable\n                    wrongs, therefore, constitute a “fraud on the minority” by virtue\n                    of their very nature; the “fraud” is one that inheres in the act\n                    giving rise to a breach of duty by the directors. The difficulty, of course, is\n                    determining where the demarcation lies between ratifiable wrongs and\n                    unratifiable wrongs. It is clear from case law that a case of dishonesty or\n                    cheating by a director would qualify as an unratifiable wrong: seeBurland v Earle[1902] AC 83 (at 93). The ambit of\n                    unratifiable wrongs also extends beyond dishonesty and cheating: seeEstmanco (Kilner House) Ltd v Greater London Council[1982] 1 WLR 2 (at 12). However, it is unclear how far beyond actual dishonesty\n                    it would extend. 51     Given these difficulties, a different way of\n                    understanding the term “fraud” was propounded by Vinelott J\n                    inPrudential Assurance Co Ltd v Newman Industries Ltd (No\n                        2)[1981] Ch 257 (“Prudential Assurance\n                        (HC)”). That case involved two senior directors, Bartlett\n                    and Laughton, of two companies, Thomas Poole & Gladstone China Ltd\n                    (“TPG”) and Newman Industries Ltd (“Newman”).\n                    Bartlett and Laughton were also shareholders of Newman but they, on their own,\n                    did not have voting control at the shareholder level. However, they also had\n                    control of TPG which held 25.6% of the shares of Newman. If this 25.6% was added\n                    to shares held in their own name, Bartlett and Laughton would have voting\n                    control of Newman. TPG was in financial difficulties and, in order to alleviate\n                    those difficulties, Bartlett and Laughton arranged for Newman to purchase the\n                    main assets of TPG at a gross over-valuation. In accordance with Stock Exchange\n                    requirements, the consent of the shareholders of Newman was required before such\n                    a transaction could be completed. This was obtained by a “tricky and\n                    misleading circular” (Prudential Assurance\n                        (HC)at 263) disseminated to the shareholders. The Prudential\n                    Assurance, a corporate minority shareholder in Newman, claimed damages against\n                    Bartlett, Laughton and TPG. In deciding the case for the Prudential Assurance,\n                    Vinelott J eschewed the orthodox ratifiable wrong/unratifiable wrong\n                    dichotomy. Instead, for Vinelott J, the term “fraud”,\n                    as understood in the context of the rule inFoss v\n                        Harbottle, refers to a composite of the breach of\n                    director’s duties and the attempt to stifle action by the company in\n                    respect of the breach by “means of manipulation” within the\n                    company: seePrudential Assurance (HC)(at 325).\n                    Indeed,“[t]he ‘fraud’ lies in [the errant\n                    directors’/shareholders’] use of their voting power, not in the\n                    character of the act or transaction giving rise to the cause of action”:\n                    seePrudential Assurance (HC)(at 307). Thus, any\n                    wrong committed by a director, if accompanied by an improper attempt to stifle\n                    an attempt by the company to obtain redress in respect of that wrong, may amount\n                    to “fraud”. 52     This approach by Vinelott J was certainly\n                    novel and prompted strong responses, both for and against. The Court of Appeal\n                    inPrudential Assurance (CA)refrained from\n                    commenting on the above approach but overturned Vinelott J’s decision on\n                    other grounds. In Singapore, the Court of Appeal inTing Sing\n                        Ningrestated the orthodox understanding of “fraud”\n                    without considering Vinelott J’s approach. This is understandable since\n                    the main issue inTing Sing Ningwas whether the\n                    majority shareholders had the requisite control rather than whether there was\n                    fraud andPrudential Assurance (HC)was not cited\n                    to the Court of Appeal. As such, it seems to me that the meaning of\n                    “fraud” as an exception to the rule inFoss v\n                        Harbottleis still amenable to further\n                consideration. 53     However, as indicated earlier, further\n                    cogitation on the meaning of fraud was unnecessary in the present case given\n                    that it was inappropriate for the court to grant leave to commence a derivative\n                    action in the circumstances: see[60]–[71]below.\n                    Suffice it to say that for present purposes, I would take the view that\n                    “fraud” is made out on the facts of this case as the defendant\n                    had,prima facie, prevented legal action from\n                    being taken out against BGP for the recovery of charter hire in order to protect\n                    his own interests in NGS. 54     At this point, I pause briefly to address a\n                    contention raised on behalf of the defendant. Counsel for the defendant argued,\n                    relying onWalter Woon on Company Law([13]supra),\n                    that it was necessary for the plaintiff to show that a benefit to the defendant\n                    was obtained at the expense of NIL or that NIL suffered some loss or detriment\n                    before an exception to the rule inFoss v\n                        Harbottlemay be established. InWalter Woon\n                        on Company Law, it was argued as follows: 9.47Although no judge\n                            has yet pronounced on this matter authoritatively, there are dicta in\n                            cases from which a general rule regarding fraud on the minority might be\n                            drawn. It is suggested that in order to establish an exception to the\n                            rule inFoss v Harbottleon the ground of\n                            fraud on the minority, the following must be shown: (1)    that the majority obtained some sort of\n                            benefit; (2)that the benefit was obtained\n                                at the expense of the company or that some loss or detriment was\n                                caused to the company; and (3)    that the majority used their controlling power to\n                            prevent an action being brought against them by the\n                        company. [emphasis added] Elaborating upon criterion (2), the learned authors ofWalter Woon on Company Law, at para 9.54, later\n                    argued: 9.54… if the\n                            company has suffered no loss, it is hard to see why the majority should\n                            not be allowed to forgive a breach of duty. Thus, if a director breaches\n                            his duty to the company and is called to account, on principle it should\n                            be open to the members to ratify that breach. In the present case, it was contended that NIL did not suffer any\n                    loss as NGS was more than willing to fulfil the charterer’s obligations\n                    under the Time Charter on behalf of BGP, including payment of the charter hire.\n                    Furthermore, any benefit acquired by the defendant by virtue of cl 40,\n                    which allowed the charterer the option to purchase the vessel at the end of the\n                    charter period, was not obtained at the expense of NIL since it was NIL itself\n                    which agreed to confer this right on the charterer. For this reason, the\n                    defendant submitted that the plaintiff’s application could not\n                    succeed. 55     Whether the proposition contended for –\n                    that it was necessary for a minority shareholder to show that a benefit to the\n                    majority shareholder was obtained at the expense of the company or that the\n                    company suffered some loss or detriment before an exception to the rule inFoss v Harbottlemay be established – is\n                    accurate depends on what the meaning of “fraud” for the purposes\n                    of the “fraud on the minority” exception is. As I have explained,\n                    the latter issue is not settled. If the orthodox ratifiable wrong/unratifiable\n                    wrong dichotomy is adopted, counsel for the defendant may well be right as it\n                    would be hard to imagine a wrongdoing by a director which results in neither\n                    loss to the company nor benefit to the director as being unratifiable. However,\n                    if Vinelott J’s understanding of fraud is adopted, then the proposition\n                    would be inaccurate as the “fraud on the minority” exception may\n                    still be made outregardless of the type of wrongdoing\n                        committed. Since I was disinclined to exercise my discretion in\n                    favour of the application (see[61]–[71]below), it\n                    is not necessary for me to deal with the defendant’s argument. Besides, it\n                    is arguable that NIL had indeed suffered some loss when the defendant blocked\n                    litigation proceedings from being instituted against BGP. This was the loss of\n                    charter hire withheld by BGP and/or NGS after December 2008. Control 56     The issue of control is not nearly as\n                    controversial as that of fraud. However, a few brief remarks are still\n                    pertinent. InPrudential Assurance (HC)([51]supra), the question whether Bartlett and Laughton\n                    had the requisite control over Newman arose for consideration since Bartlett and\n                    Laughton, not having in aggregate more than 50% Newman shares between them, did\n                    not have voting control. Vinelott J decided (at 274) to take a\n                    “substance over form” approach and decided that control\n                    existed: … where it can be shown that it would be fraudulent for those in\n                        control to prevent an action being brought against themselves. It is\n                        necessary to show that it would be futile to ask the company in general\n                        meeting to decide, because one knows in advance what the answer would\n                        be. Hence, Vinelott J departed from a purely numerical yardstick for\n                    assessing control of a company. In fact, Vinelott J extended “the\n                    notion of control to matters other than voting, such as monopoly of information\n                    and the use of managerial vetoes over litigation …”: see\n                    G R Sullivan, “Restating the Scope of the Derivative\n                    Action” [1985] CLJ 236 at 246. This approach has been lauded as a\n                    “recognition of corporate realities” and “[f]or that\n                    breakthrough, Vinelott J must be respectfully congratulated”: see\n                    K W Wedderburn, “Derivative Actions andFoss\n                        v Harbottle” (1981) 44 MLR 202. 57     Although the English Court of Appeal inPrudential Assurance (CA)([12]supra), did not adopt Vinelott J’s notion of\n                    “control”, it did expand the concept of “control”\n                    somewhat when it held (at 219) that it: … embraces a broad spectrum extending from an overall absolute\n                        majority of votes at one end, to a majority of votes at the other end made\n                        up of those likely to be cast by the delinquent himselfplus those voting with him as a result of influence or\n                            apathy. [emphasis added] The same approach was adopted by the Singapore Court of Appeal inTing Sing Ning([14]supra). In that case, the issue was whether the\n                    respondents had an absolute majority of the votes. This would be so only if the\n                    shares belonging to the first respondent’s sister (some 10%) was added to\n                    their total. Reversing the trial judge, the Court of Appeal held that the\n                    sister’s shares had to be added to the respondent’s shares in\n                    ascertaining “control” since the sister’s shares had been\n                    given to her by the first respondent and the sister had an indirect interest in\n                    preventing litigation. Both the English Court of Appeal and the Singapore Court\n                    of Appeal resolved their cases without addressing the issue whether one may have\n                    “control” of a company without having a majority of the votes\n                    howsoever the majority may be determined. This may be explained by the fact\n                    that, in both cases, it was not directly in issue whether an ability to suppress\n                    litigation without resort to voting power would suffice as\n                    “control”. 58     In the present case, in reliance upon bothPrudential Assurance (CA)andTing Sing Ning, the defendant argued that “the\n                    main determining factor whether an alleged wrongdoer had control over the\n                    company is … his ability to garner votes amounting to more than 50% of\n                    the shareholding in the company”. As the defendant had only 50% of the\n                    shareholding in NIL, it was argued that the defendant did not possess the\n                    requisite control. 59     In my view, while shareholding (including\n                    shares that the errant director/shareholder may be able to garner outside of his\n                    own shares) would be an obvious way of determining control, it should not be the\n                    sole determinant. In reality, controllers of companies often exercise\n                    control without resort to voting power. The crucial question, to my mind, is not\n                    whether the defendant had the requisite shareholding but whether the defendant\n                    was able to prevent an action from being brought against him. As such, I would\n                    incline towards the “substance over form” approach adopted by\n                    Vinelott J. After all, the crux of the matter is whether the errant\n                    director was able to suppress an action against himselfquadirector. This was also the approach adopted by the English\n                    Court of Appeal inBarrett v Duckett[1995] BCC 243 (“Barrett”). In that case, like the present, both the\n                    plaintiff and the first defendant held 50% shares in the company. Although the\n                    plaintiff’s attempt to bring a derivative action was eventually struck\n                    out, Peter Gibson LJ held, on the issue of control, as follows (at\n                    250): Although Mrs Barrett [the plaintiff] is not a minority shareholder but a\n                        person holding the same number of shares as the other shareholder,\n                        Christopher [the first defendant], in the circumstances of this case she can\n                        be treated as being under the same disability as a minority shareholder in\n                        that as a practical matter it would not have been possible for her to set\n                        the company in motion to bring the action. The above statement was approved by our Court of Appeal inPang Yong Hock([23]supra) (at[36]), albeit in the context of a statutory derivative action.\n                    In the instant case, the issue whether the defendant had requisite control could\n                    not be resolved given that, in the first place, the question was as yet\n                    unanswered who in NIL had the authority to decide whether the company should\n                    take out a civil action against the defendant. As I will explain (at[61]–[68]below), the plaintiff’s application was premature and\n                    it may be that the agreement of directors appointed by the defendant is not\n                    needed for NIL to take out an action against the defendant. If so, no question\n                    of control arises.",
        "Exercise of discretion": "60     I now turn to the issues which were\n                    determinative of this application. Counsel for the defendant argued that even if\n                    the fraud on the minority exception was made out, the plaintiff’s\n                    application should not be allowed for two further reasons. First, it was argued\n                    that if there were alternative remedies available to the plaintiff to seek\n                    redress instead of commencing a derivative action, the plaintiff had first to\n                    resort to those alternative remedies. Second, counsel for the defendant also\n                    submitted that a minority shareholder ought not be allowed to bring a derivative\n                    action if, in so doing, he was not actingbona\n                        fidein the best interests of the company but rather to further\n                    an ulterior motive. Those arguments find support inShareholders’ Rights(Sweet & Maxwell, 5th Ed, 2007)\n                    where the learned author states (at para 6-27) as follows: Since a derivative action is a remedy fashioned by equity to ensure that a\n                        claim to remedy a wrong done to the company is not stifled improperly, the\n                        court has a wide discretion in deciding whether and on what terms to permit\n                        the derivative action to proceed. The claimant must come to court with\n                        ‘clean hands’, and the court will have regard to all the\n                        circumstances, particularly the availability of other remedies and the\n                        claimant’s motives. Similarly, in the case ofBarrett, Peter\n                    Gibson LJ stated (at [250]) as follows: The shareholder will be allowed to sue on behalf of the company if he is\n                        bringing the action bona fide for the benefit of the company for wrongs to\n                        the company for which no other remedy is available. Conversely, if the\n                        action is brought for an ulterior purpose or if another adequate remedy is\n                        available, the court will not allow the derivative action to proceed. InPortfolios of Distinction Ltd v Laird[2005] BCC 216, the English High Court determined that the two\n                    conditions stated above by Peter Gibson LJ had to be read conjunctively. In\n                    other words, if an applicant failed to satisfy either condition, the court\n                    should generally not exercise its discretion to grant leave to start a\n                    derivative action, even if the fraud on the minority exception was made\n                    out.",
        "Alternative remedies": "61     The whole foundation of the “fraud on\n                    the minority” exception rests on the premise that without such a\n                    procedural device justice would not be done. Thus, the necessity of a derivative\n                    action must be established before such an action should be allowed to be brought\n                    before the courts. If there is an adequate remedy available to the minority\n                    shareholder, he should generally not be allowed to resort to a derivative\n                    action. This is because a derivative action derogates from the general company\n                    law principle that company decisions should be decided by the majority. Hence,\n                    before any derogation is allowed, it must first be shown that such derogation is\n                    necessary to further the cause of justice. Lord Blanesburgh, delivering the\n                    judgment of the Privy Council, explained this principle inFerguson v Wallbridge[1935] 3 DLR 66 (at 83) as\n                    follows: The permissibility of the form of proceeding thus assumed\n                        [a derivative action], where the company is a going concern, is an\n                        excellent illustration of the golden principle that procedure with its rules\n                        is the handmaid and not the mistress of justice. The form of action so\n                        authorised is necessitated by the fact that in the case of such a claim as\n                        was successfully made by the plaintiff inCookvDeeks— and there is at least a family\n                        likeness between that case and this – justice would be denied to him\n                        if the mere possession of the company’s seal in the hands of his\n                        opponents were to prevent the assertion at his instance of the corporate\n                        rights of the company as against them. But even in the case of a going\n                        companya minority shareholder is not entitled to\n                            proceed in a representative action if he is unable to show when\n                            challenged that he has exhausted every effort to secure the joinder of\n                            the company as plaintiff and has failed. But cessante ratione legis,\n                            cessat lex ipsa [when the reason for the law ceases, the law itself\n                            ceases]. [emphasis added in bold italics] 62     However, the Court of Appeal inTing Sing Ning([14]supra) appeared to add a gloss to the above\n                    principle. In that case, the second respondent argued that the appellant should\n                    not be allowed to bring a common law derivative action because the company in\n                    question, Havilland, had two alternative courses of action. The first was that\n                    Havilland could be wound up as the shareholders had expressed their agreement to\n                    such a course of action. The other was that the appellant was free to pursue an\n                    oppression action available under s 168A of the Hong Kong Companies\n                    Ordinance (Cap 32) given that Havilland was a company incorporated in Hong\n                    Kong. The Court of Appeal dismissed both arguments. In so far as the first was\n                    concerned, the Court of Appeal opined that it was unclear that the\n                    “authority” which the respondents relied upon,Pang Yang Hock([23]supra), established the principle that when the\n                    remedy of a winding up is available, the court should not entertain any\n                    application to pursue a s 216A action, however meritorious it might be. I\n                    respectfully agree. Indeed, the proposition advanced by the second respondent\n                    was far too broad-brushed. While a winding up might sometimes be the solution to\n                    contention between the disputants, it is not difficult to imagine cases where\n                    winding up would be to the detriment of the minority, especially if the majority\n                    could re-group thereafter and set up a new company to undertake very much the\n                    same business as before. 63     In regard to the second alternative, the Court\n                    of Appeal held as follows (at [30]): As regards the second alternative of an action for oppression under the\n                        Hong Kong equivalent of s 216, the respondents have not shown us why it\n                        affords the best solution to the dispute or that it is a better remedy for\n                        the appellant. To begin with, the appellant is not alleging that he has been\n                        oppressed, but that the respondents have used Havilland’s funds in\n                        breach of their duty as directors. Furthermore, an oppression action will\n                        require the appellant to start all over again, not in Singapore but in Hong\n                        Kong under the Hong Kong companies’ legislation, resulting in even\n                        more delay to the resolution of the present dispute. Delay is one of the\n                        grounds on which the respondents have argued that this court should not give\n                        leave to the appellant to commence the derivative action. The Court of Appeal inTing Sing Ningaccordingly allowed the appeal, thereby granting the appellant liberty to bring\n                    a derivative action on behalf of Havilland. 64     At first blush, the passage quoted in[63]above does not appear to sit well\n                    with the established position that a derivative action must benecessarybefore leave is granted for such action to be\n                    brought. (This is the apparent gloss I referred to in[62]above.) However, it seems to me that the Court of Appeal inTing Sing Ningwas merely emphasising that the\n                    alternative has to be viable. References to “the best solution”\n                    and “a better remedy” were, in my estimation, purely rhetorical.\n                    The alternative remedy of an oppression action suggested by the second\n                    respondent inTing Sing Ning, apart from being\n                    neither “the best solution” nor “a better remedy”,\n                    was clearly not viable as the appellant did not allege that he had been\n                    oppressed. Moreover, it would have entailed considerable delay and expense. It\n                    is in such context that the decision must be understood. The Court of\n                    Appeal was not, to my mind, stipulating that the alternative remedy be better\n                    than a derivative action, nor even more convenient, before it would preclude the\n                    plaintiff from pursuing a derivative action; the alternative remedy need only be\n                    a real option for the plaintiff. If the Court of Appeal had intended to depart\n                    from the traditional position, it would have taken pains to make its intention\n                    clear. 65     In the present case, it was argued on behalf\n                    of the defendant that the Shareholders’ Agreement provided for arbitration\n                    as a forum for dispute resolution between the plaintiff and the defendant. This\n                    was an alternative remedy which was available to the plaintiff. Clause 16.2\n                    of the Shareholders’ Agreement read as follows: All and any dispute arising out of or in connection with this agreement\n                        including any question regarding its existence, validity or termination,\n                        shall be referred to and finally resolved by arbitration at the Singapore\n                        International Arbitration Centre (“SIAC”) in accordance with\n                        the Arbitration Rules of the Singapore International Arbitration Centre\n                        (‘SIAC Rules’) for the time being in force at the commencement\n                        of the arbitration, which rules are deemed to be incorporated by reference\n                        to this clause. 66     In fact, an interpretation of the\n                    Shareholders’ Agreement was not as straightforward as the defendant made\n                    it out to be. As was reproduced in[5]above, the distribution of management decisions was\n                    convoluted and not easily understood. On the one hand, cl 6.7 of the\n                    Shareholders’ Agreement states that decisions are, generally, to be made\n                    by majority vote, save for certain matters which require unanimous consent. On\n                    the other, cl 8 stipulates that all technical matters, in general, are\n                    within the sole purview of the directors “appointed” by the\n                    defendant while all financial matters, in general, are to be decided by the\n                    directors “appointed” by the plaintiff. It is not easy to\n                    reconcile these clauses which seem to cover overlapping subject matter. To\n                    further complicate matters, cl 11 of the Shareholders’ Agreement\n                    provides for the breaking of a deadlock only in respect of certain matters.\n                    These are, in summary, matters which require the unanimous approval of the board\n                    of directors or shareholders. In relation to these matters, the representative\n                    of each party should use his reasonable endeavours to resolve the dispute,\n                    failing which the defendant may require the plaintiff to sell its shares in NIL\n                    to the defendant at a fair price. All this is in addition to the dispute\n                    resolution provision referred to by the defendant. 67     In the present case, the defendant argued that\n                    “the allegations brought by the Plaintiffs against the Defendant could\n                    and should be resolved via the Shareholders’ Agreement which provides for\n                    arbitration as a dispute resolution forum”. This is not true in respect\n                    of the only allegation relevant in the present case – that the defendant\n                    had breached his fiduciary duties in not supporting the plaintiff’s\n                    attempt to take out legal proceedings against BGP for failure to pay charter\n                    hire. The cause of action arising from such allegation belongs to NIL, not the\n                    plaintiff. As such, the Shareholders’ Agreement which sets out the rights\n                    and liabilities between shareholders of NIL, does not govern that\n                    dispute. 68     However, in the present case, the arbitration\n                    clause may be useful in another way. The issue before the board of directors was\n                    whether to bring an action against the defendant for breach of fiduciary duties.\n                    Given the uncertainty in the Shareholders’ Agreement, it is difficult to\n                    determine whether such a decision fell within the exclusive purview of the\n                    directors “appointed” by plaintiff or required the majority or\n                    unanimous approval of the board. Any disagreement as to how this issue was to be\n                    decided should first be determined by arbitration in accordance with\n                    cl 16.2 of the Shareholders’ Agreement. It may well be that the\n                    arbitrator(s) decide that this matter is one within the exclusive purview of the\n                    directors appointed by the plaintiff, in which case no derivative action would\n                    be necessary. Moreover, if the arbitrator finds that the matter is one which\n                    requires the unanimous approval of the all directors, the defendant may elect to\n                    invoke the deadlock-breaking provision of cl 11 and force a buyout of the\n                    plaintiff’s shares, thus rendering a derivative action redundant again. It\n                    is only in respect of the following situations that the possibility of a\n                    derivative action would arise: (a)     the arbitrator finds that the matter\n                        is one within the exclusive purview of the directors appointed by the\n                        defendant and these directors, without good reason, refuse to bring an\n                        action against the defendant; (b)     the arbitrator finds that the matter is one that has to\n                        be decided by a majority vote and the directors appointed by the defendant\n                        refuse, without good reason, to support the commencement of an action\n                        against the defendant; and (c)     (although the arbitrator finds that the matter is one\n                        requiring unanimity) the directors appointed by the defendant refuse,\n                        without good reason, to support the bringing of legal proceedings and the\n                        defendant refuses to activate the buyout clause. Until\n                    one of these situations has arisen, the plaintiff’s application is\n                    premature.",
        "Bona fides": "69     Finally, it must be remembered that the\n                    derivative action is an equitable device, used to alleviate the harshness which\n                    on occasion may result from a strict application of the rule inFoss v Harbottle. Accordingly, the maxim “he who\n                    comes to equity must come with clean hands” applies. It follows that he\n                    who seeks to use a derivative action must do so in the best interests of the\n                    company and not for some ulterior purpose. In this regard, the words of\n                    Lawton LJ inNurcombe v Nurcombe(1984)\n                    1 BCC 99,269 (at 99,273) are apposite: It is pertinent to remember, however, that a minority shareholder’s\n                        action in form is nothing more than a procedural device for enabling the\n                        court to do justice to a company controlled by miscreant directors or\n                        shareholders. Since the procedural device has evolved so that justice can be\n                        done for the benefit of the company, whoever comes forward to start the\n                        proceedings must be doing so for the benefit of the company and not for some\n                        other purpose. It follows that the court has to satisfy itself that the\n                        person coming forward is a proper person to do so. This statement was cited with approval inBarrett([59]supra) (at [250)]. In the present case, the\n                    defendant alleged that the plaintiff was seeking to bring a derivative action in\n                    the name of the company for purely self-serving reasons. In para 63 of his\n                    affidavit filed on 20 November 2009, the defendant wrote: In view of the fact that the Vessel was laid up for such a long period of\n                        time, which affected the profitability of the Vessel, I verily believe\n                        that this present application by the Plaintiff is an attempt to use\n                        NIL’s funds in order to oppress me in a protracted legal proceedings.\n                        I believe that the Plaintiffs’ ultimate purpose is not to benefit NIL\n                        but rather to take control of NIL, or for some other ulterior motive. As I mentioned earlier, cl 11 of the Shareholders’\n                    Agreement is a deadlock-breaking provision. It is impractical to reproduce the\n                    entire clause (which runs to almost three pages). The gist of the clause,\n                    however, is as follows. In the event of a “deadlock”, defined\n                    as a situation where the board of directors of NIL fail to decide on a matter\n                    requiring the unanimous approval of the board, both the plaintiff and the\n                    defendant are to use their reasonable endeavours to resolve the dispute. If a\n                    resolution is not arrived at within 30 days, then (at cl 11.3): … MORTEN INNHAUG may serve a written notice on SINWA … to\n                        sell its shares together with all its or their rights under any\n                        shareholders’ loan to MORTEN INNHAUG at a price to be determined and\n                        certified by the auditors as being the fair value of the shares at the date\n                        of service of such notice based on the net asset value of NIL on such\n                        date. The defendant alleged that the plaintiff, being dissatisfied with the\n                    possibility of being bought out at fair value, was seeking to force the\n                    defendant, on pain of litigation, to purchase its shares in NIL at a higher\n                    price. 70     On the basis of the evidence before me, it\n                    appeared that the plaintiff had not laid all its cards on the table. To my mind,\n                    the plaintiff might not have disclosed its real motive for bringing a derivative\n                    action in the name of NIL. Its main grouse against the defendant appeared to be\n                    in relation to the defendant’s role in the assignment of the Time Charter\n                    from BGP to NGS. However, the plaintiff’s unhappiness with the assignment\n                    could not be easily understood. While it is true that BGP remained primarily\n                    liable to NIL for the payment of charter hire even with the assignment, it is\n                    difficult to imagine why NIL should object to being paid by NGS instead of BGP,\n                    as long as the charter hire was paid. Indeed, for four months, from September to\n                    December 2008, NGS faithfully paid the charter hire on behalf of BGP, and\n                    neither NIL nor the plaintiff saw the need to return the charter hire to NGS.\n                    Thus, that the plaintiff would subsequently cite the assignment as its main\n                    basis for bringing a derivative action against the defendant seemed to me to be\n                    contrived. In so far as the outstanding charter hire from January to June 2009\n                    was concerned, the plaintiff’s behaviour did not appear reasonable either.\n                    While NIL had accepted charter hire from NGS from September to December 2008\n                    without demurrer, when NGS later tried to negotiate for a lower charter hire\n                    rate, which it was entitled to under the Time Charter, the plaintiff flatly\n                    refused to enter into any discussion whatsoever. That stand did not appear to be\n                    one which a director acting in the best interests of the company could take.\n                    Again, the plaintiff’s motives may be called into question with regard to\n                    cl 40 of the Time Charter. At all material times, the plaintiff had known\n                    that the Time Charter gave the charterer an option, at the end of the charter\n                    period, to purchase the vessel. In fact, according to the defendant, this had\n                    been taken into account in calculating the charter hire payable. It was\n                    therefore strange that the plaintiff took objection to NGS becoming entitled, by\n                    reason of the assignment, to purchase the vessel at the end of the charter\n                    period. With respect to these and other allegations, the plaintiff appeared to\n                    me to be throwing everything but the kitchen sink at the\n                defendant. 71     Hence, I was of the view that in bringing the\n                    application for leave to commence a derivative action, more likely than not, the\n                    plaintiff was not actingbona fidein the best\n                    interests of NIL. It was not for me to go beyond that to speculate on the real\n                    motive behind the plaintiff’s actions. For the purposes of the application\n                    before me, it sufficed that I was of the view that the application was notbonafide in the interests of\n                NIL.",
        "Summary": "72     In sum therefore, the plaintiff’s\n                    application for leave to commence a derivative action against the defendant was\n                    dismissed as the plaintiff had failed: (a)     to follow the proper procedure in\n                        taking out a derivative action; (b)     to exhaust alternative remedies available to it;\n                        and (c)     to bring\n                        the action in good faith. Costs of S$6,500 were awarded\n                    to the defendant."
    }
}