{
    "case_title": "Ang Kim Sai and another \n      v\n      Ang Kok Beng",
    "ncitation": "[2010] SGHC 374",
    "coram": "Tan Lee Meng J",
    "sections": {
        "The appeal": "8       The striking out of pleadings is provided for\n                    under O 18 r 19(1) of the Rules of Court (Cap 322, R 5,\n                    2006 Rev Ed), which states: The Court may at any stage of the proceedings order to be\n                        struck out or amended any pleading or the endorsement of any writ in the\n                        action, or anything in any pleading or in the endorsement, on the ground\n                        that — (a)    it discloses no\n                                reasonable cause of action or defence, as the case may\n                            be; (b)    it is\n                                scandalous, frivolous or vexatious; (c)    it may\n                                prejudice, embarrass or delay the fair trial of the action;\n                                or (d)    it is otherwise\n                                an abuse of the process of the Court, and may order the action to be stayed or dismissed or judgment to be\n                        entered accordingly, as the case may be. 9       InThe Osprey[1999] 3 SLR(R) 1099, LP Thean JA stated at [8] that the words\n                    “frivolous and vexatious” relate to actions which are\n                    “obviously unsustainable” or “wrong” and added that\n                    this expression also connotes “a lack of purpose or seriousness in the\n                    party’s conduct of the proceedings”. In regard to what is an\n                    “abuse of process”, inGabriel Peter &\n                        Partners (suing as a firm) v Wee Chong Jin and others[1997]\n                    3 SLR (R) 649, the Court of Appeal explained at [22] that “this\n                    term signifies that the process of the court must be usedbona fideand properly and must not be abused”. The court\n                    added that “it will prevent the judicial process from being used as a\n                    means of vexation and oppression in the process of\n                litigation”. 10     In the present case, the controversial\n                    paragraphs in the Defence that the plaintiffs sought to strike out concerned\n                    their character, the father’s “second wife”, Mdm Woo Hong\n                    Moi (“Mdm Woo”), and the alleged machinations of Mdm Ang Meng Hwee\n                    (“Mdm Ang”), the daughter of the father and Mdm Woo.",
        "Paragraphs concerning the plaintiffs’ character": "11     In his Defence, AKB pleaded at paras 6-8\n                    as follows: 6As a Chinese Physician, my father travelled\n                            extensively to Malaysia for his business and my mother was left entirely\n                            to look after the family. 7As a character, my father is very authoritative and\n                            could be abusive towards my mother if his demands are not met and my\n                            mother would always relent in order to keep harmony in the\n                            family. 8My mother is an extremely thrifty person but has\n                            good acumen in trading stocks listed among others in the Singapore and\n                            Malaysia Stock Exchange and had amassed substantial sums of\n                            monies. 12     There was no indication in the Defence as to\n                    how the authoritativeness of the father or the thriftiness of the mother had\n                    anything to do with the issue of beneficial ownership of the property. The AR\n                    struck out all three paragraphs. I upheld the AR’s decision to strike out\n                    these paragraphs.",
        "Paragraphs concerning the father’s private life and other\n                family": "13     In para 10 of his Defence, AKB pleaded as\n                    follows: After Woo Hong Moi passed away in 1979, my father brought ANG MENG HWEE to\n                        stay with the family. My mother was extremely unhappy with my father’s\n                        second marriage and notwithstanding ANG MENG HWEE was well-treated, she had\n                        always harboured the thought that she was not regarded as a member of the\n                        family. 14     The plaintiffs asserted that para 10 of the\n                    Defence was intended to embarrass them. As there is nothing in the Defence that\n                    shows how the father’s second family had any connection with the legal\n                    issues concerning the plaintiffs’ claim to the beneficial interest of the\n                    property, I agreed with the AR that para 10 of the Defence should be struck\n                    out.",
        "Paragraphs concerning the allegations against Mdm Ang": "15     In his Defence, AKB also pleaded in\n                    paras 21-23 that Mdm Ang had instigated his parents to institute the\n                    present proceedings against him. He alleged as follows: 21The Defendant avers and will establish at the trial\n                            that the present proceedings herein were commenced at the instance of\n                            ANG MENG HWEE. Particulars (i)Beginning\n                            in the early part of 2009, ANG MENG HWEE had been pestering my parents\n                            that as a step-child, she is entitled to a share of the family assets\n                            and had been forcing the 1stPlaintiff to\n                            request the Defendant to sell the [p]roperty so that she could have a\n                            share in the sale proceeds even though she is well aware that the\n                            [p]roperty had been given to the Defendant as a gift by the\n                                2ndPlaintiff; (ii)In furtherance of\n                            her desire to have a hold in the family monies:- (a)ANG MENG HWEE together with her husband went\n                                to Xiamen, China and collected the compensation sums of more than\n                                $800,000.00 which was payable for acquisition of 2 properties of\n                                which the 2ndPlaintiff had\n                                interests; (b)ANG MENG HWEE together with her husband\n                                brought the 2ndPlaintiff to Johor Bahru\n                                to transfer the 2ndPlaintiff’s\n                                trading Accounts in public listed stocks to herself;\n                            and (c)kept all the 2ndPlaintiff’s cash and jewelleries. 22    The Defendant further avers that ANG MENG HWEE in\n                            further pursuit of her above desire, had even on 14.2.2010 asked my\n                            parents to sign a note requesting the Defendant to sell the [p]roperty\n                            so that she could have a share in the sale proceeds. 23    The said note was purportedly signed by both the\n                            Plaintiffs who by then were suffering from extreme dementia in late\n                            2009. 16     AKB’s counsel argued before the AR that\n                    paras 21-23 of the Defence showed the ferocity of Mdm Ang and that she\n                    masterminded the present action against his client. Whether anyone instigated\n                    the plaintiffs to institute the present action had nothing to do with who is\n                    entitled to the beneficial ownership of the property. Furthermore, whether or\n                    not the note allegedly given by Mdm Ang to the plaintiffs to sign on\n                    14 February 2010 may be set aside on the ground of the plaintiffs’\n                    dementia, is not an issue in the present action. The AR understandably struck\n                    out paras 21(2) and 23. In relation to para 22, he merely deleted the words\n                    “in further pursuit of her above desire”. AKB had no ground to\n                    complain about the AR’s decision.",
        "Paragraphs concerning the plaintiffs’ alleged\n                dementia": "17     Apart from referring to the plaintiffs’\n                    alleged dementia in para 23, AKB pleaded in para 26 of his Defence as\n                    follows: 26    The Defendant avers and will establish at the trial\n                            that as late as 2009, both the Plaintiffs were suffering from dementia\n                            and that they could not comprehend the nature and consequences of the\n                            proceedings and the alleged claims herein. 18     The plaintiffs’ counsel insisted that\n                    the plaintiffs understood the nature of their claim and will testify at the\n                    trial that AKB holds the property on trust for them. It is for the plaintiffs to\n                    prove their case and whether or not they understand the nature and consequences\n                    of the alleged claims and can give cogent evidence in support of their claim\n                    will be known at the trial. I thus affirmed the AR’s decision to strike\n                    out para 26 of the Defence."
    }
}