{
    "case_title": "Public Prosecutor\n      v\n      Pathip Selvan s/o Sugumaran",
    "ncitation": "[2010] SGHC 335",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The accused’s account": "4       Eight written statements of the accused were\n                    admitted at the trial on his initiative.[note: 2]These statements ran chronologically\n                    from a statement recorded by SI Ang Ghim Sing on the day of arrest,ie8 July 2008 at 8.25 pm,[note: 3]to a cautioned statement for the murder of\n                    the deceased, recorded on 9 July 2008 by ASP David Ang,[note: 4]to a series of six investigation\n                    statements recorded by the investigation officer SI Noorma’at Sawab on 11,\n                    12, 14 and 16 July 2008,[note: 5]with three statements being recorded on\n                    the last day. 5       In the investigation statements to the\n                    investigating officer the accused recounted that he came to know the deceased\n                    sometime in November or December 2007. They became friends and were lovers by\n                    April 2008 and had the intention to marry. In May 2008, they had a disagreement\n                    over something which the accused could not now recall. That went on for several\n                    days, and on 28 May 2008, the accused met the deceased and brought her to\n                    his uncle’s house. They had a talk in the house, and reconciled. Then,\n                    they engaged in sex, and he ejaculated into her over her objections. The\n                    deceased was worried that she may become pregnant, and she made a police report\n                    that he raped her. In spite of that, the accused and the deceased continued to\n                    see each other. 6       The accused then described the events which led\n                    to the deceased’s death. On the evening of 6 July 2008, the accused\n                    spoke to the deceased over the telephone and learned that she was suffering from\n                    a flu and cold. The next morning, he decided to send her for medical treatment.\n                    He took time off work and went to the deceased’s flat which was on the\n                    second floor of Block 157, Ang Mo Kio Avenue 5. He arrived at the flat at about\n                    9.00 am, but instead of knocking on the door, he took a chair from a\n                    neighbouring house, climbed onto it and looked into the deceased’s bedroom\n                    through a window. 7       He saw the deceased lying on her bed with a male\n                    person wearing a red shirt. The man was lying on top of the deceased and they\n                    were kissing. The accused was shocked and felt very angry. He went to the door\n                    of the flat, and demanded that the deceased open the door. She came to the door,\n                    but refused to let him into the flat. He asked her if she was hiding something\n                    from him, but she denied that and she also told him that she was scheduled to go\n                    with her mother for a medical check-up at Kandang Kerbau Hospital. 8       The accused went downstairs to the void deck and\n                    waited in the hope that he would meet the deceased when she went for the medical\n                    appointment. However, he fell asleep whilst waiting and did not see the\n                    deceased. He decided to wait for the deceased to return from her medical\n                    appointment. Subsequently he found out from a friend of the deceased that she\n                    and her mother would be returning to Ang Mo Kio in about an hour and that the\n                    deceased wanted him to wait for her at Block 155. 9       To occupy the time, he made an appointment with\n                    a friend, Bala, to meet him at Block 181 to keep him company while he waited for\n                    the deceased. The accused made another decision at that time. In his words:[note: 6] I then decided to buy a knife. I wanted to use the knife to threaten Jeev.\n                        I knew that she would not tell me the truth if I did not threaten her with a\n                        knife. She is a better talker than me and she always has the final\n                        say. and after buying a knife from a shop:[note: 7] I took out the knife from the new casing and threw the casing into a drain\n                        together with the plastic bag. I then tucked the knife at the back of my\n                        waist and covered it with my t-shirt. When I arrived at the void deck of Blk\n                        181 Ang Mo Kio, I saw a lot of purple coloured flyers on the floor near to\n                        the letter boxes. I picked up two or three flyers. I then went up the\n                        staircase and took out the knife that I just bought. I rolled the flyers\n                        over the knife and folded one end of the flyers over the sharp end of the\n                        knife. I then tucked the knife with the flyer at my back and covered it with\n                        my shirt. I did this because while I was walking with the knife tucked at my\n                        back, I could feel the sharp part of the knife against my back. 10     Having done that, he met up with some friends\n                    at a coffeeshop, and they sat together. At about 8 pm, he received a call from\n                    the deceased asking him to meet her at the void deck of Block 155. The accused\n                    told his friends that he was going to meet the deceased, and would rejoin them\n                    later with the deceased. 11     He went to Block 155 and met the deceased and\n                    her mother. The deceased’s mother had a talk with him, and then she left\n                    him and the deceased. 12     The events that followed are best set out in\n                    the accused’s own words: 71    I then asked Jeev to go to Ang Mo Kio West Garden.\n                            As I had mentioned before, we used to go to Ang Mo Kio West Garden which\n                            is nearby. However, this time, I intend to ask her about the man who was\n                            with her this morning. To go to Ang Mo Kio West Garden, we have to walk\n                            to Blk 154 Ang Mo Kio, before taking the staircase to the Ang Mo Kio\n                            West Garden. While we were at the void deck of Blk 154 Ang Mo Kio, I saw\n                            the bushes around the power station infront of Blk 154 Ang Mo Kio. I\n                            knew that at that time there will be a lot of people at Ang Mo Kio West\n                            Garden and when I saw the bushes behind the power station, I thought\n                            that it is a better place to ask Jeev about the main. I knew that if I\n                            were to threaten Jeev with the knife that I bought, people at the Ang Mo\n                            Kio West Garden could see me but behind the bushes, no one could see\n                            clearly because the bushes are quite high and thick. 72    Immediately I told her that I wanted to talk to\n                            her. She asked me that we are going up to the garden. I just replied no\n                            and I wanted to talk to her and pulled her to the back of the power\n                            station behind the bushes. 73    While we were behind the power station, she was\n                            standing near to the wall of the power station and I was standing facing\n                            her with the bushes behind me. I asked her in English saying “You\n                            are not hiding anything from me right?”. She replied\n                            “No”. I asked her again in English “You are not\n                            lying to me anything?”. She replied “No”. I just\n                            shouted at her in Tamil “Who the fuck was the man in the red\n                            shirt in bed with you this morning?”. She was stunned. On seeing\n                            her reaction, she knew then that I know what she had done. I cried and\n                            asked her in Tamil “Why, why, what did I not do for you, I really\n                            can’t understand, tell me?”. She replied in Tamil\n                            “he is better than you in bed, that is why I am after\n                            him”. At this juncture, I took out the knife from behind me with\n                            my right hand and stabbed her on her stomach. The moment I stabbed her,\n                            she was holding my hands with both her hands. When I pulled the knife\n                            out from her body, I felt she scratched my right hand. I continued to\n                            use the knife to stab Jeev several times. I could not remember where I\n                            had stabbed her or which part of her body that I stabbed her. All this\n                            while, Jeev was holding on to the lower part of my left hand just above\n                            my wrist with her right hand and kept on shouting in English “I\n                            love you, I love you.”. I stopped stabbing her when she released\n                            her grip on my right hand. When she let go of my left hand, I realised\n                            that Jeev was already lying on the ground. Her legs were nearer to Blk\n                            154 and I was bending down looking at her. 74    I saw that she was bleeding from the left side of\n                            her neck. I squat down and kissed her right cheek and I removed the gold\n                            chain which I had bought for her as a gift. As far as both of us are\n                            concerned, it is a sacred matrimonial chain which I had bought for her\n                            as a symbol that she is my wife. I just threw at the side. I could not\n                            remember where exactly I threw it. 75    I got scared and walked out of the area very\n                            quickly. ... (The bushes referred to in para 71 of the accused’s\n                    statement quoted above are alongside the pavement referred to in the charge, and\n                    are shown in photographs P3, P4, P5 and P6.) 13     He boarded a taxi and headed for Woodlands.\n                    Along the way, he got out of the taxi and threw the knife into a drain. (After\n                    his arrest he led the police to the drain from which the knife was recovered. It\n                    is admitted in evidence at the trial as P270, and is shown in photographs P116\n                    and P117.) 14     He called his mother on the telephone and told\n                    her that he wanted to go to Malaysia, and asked her to bring him a pair of jeans\n                    and a T-shirt. His mother met with him with the clothes, and he put them on.\n                    Then they both went by taxi to the Woodlands Checkpoint where he applied for and\n                    obtained a Document of Identity which enabled him to enter Malaysia. (He needed\n                    the Document of Identity because his passport had expired.) 15     He then went with his mother to Johor Baru.\n                    While they were there he got away from his mother, and she subsequently returned\n                    to Singapore alone. He went to Danga Bay and spent the night there. The next\n                    afternoon, he made a call to his house. He told his mother and other members of\n                    his family that he was going to die. His mother told him to return home because\n                    the police were there, and they would bring her to the police station if he did\n                    not return. On hearing that, he decided to return home. 16     He went to the Woodlands Checkpoint and\n                    surrendered himself to Inspector Mohamad Raffi bin Mohamad of the Immigration\n                    and Checkpoints Authority, and he said to him “Sir, yesterday I wanted to\n                    run away. I killed my girlfriend because of jealousy.”[note: 8]In his\n                    cautioned statement[note: 9]recorded on\n                    9 July 2008, the day after his arrest, in answer to a charge of murder of\n                    the deceased, the accused stated: That day morning, I went to her house in Ang Mo Kio. I did not go to work.\n                        I took a chair from a neighbour and placed it infront of her corridor\n                        window. I got up the chair and looked inside. I saw her kissing someone on\n                        the bed. I got down the chair and kicked her house door. I asked her whether\n                        I could come in. She told me not to. I then told her that it was not the\n                        first time I went to her place. She told me “Not today. I am not in\n                        the mood”. On the same night, I confronted her about the guy in her\n                        house. But she did not want to talk about it. I asked her about the guy in\n                        the red shirt. She was stunned when I asked her about this. I asked her what\n                        she found in him did not find in me. She said that he is better in bed than\n                        me. That’s why I took out a knife and stabbed her in her stomach.\n                        After that, I closed my eyes and blindly stabbed her a lot of times until\n                        she released her hands from mine. Before leaving the place, I kissed her on\n                        the right cheek and then pulled the chain on her neck which I had bought\n                        her. That’s all.",
        "The post mortem findings": "17     Dr George Paul\n                    (“Dr Paul”), Consultant Forensic Pathologist, undertook a\n                    post mortem examination of the deceased and produced an autopsy\n                        report.[note: 10]Dr Paul listed 15 external injuries, and he found that three of those\n                    injuries,iean incised gaping larynx-deep wound\n                    (injury no 1), an oblique incised stab wound on the lower part of the left\n                    shoulder extending inwards and downwards to the upper outer part of the left\n                    side chest (injury no 14), and an oblique incised stab wound in the middle\n                    front and outer aspect of left side of the chest (injury no 15) were\n                    sufficient individually and collectively to have caused death in the ordinary\n                    course of nature. In his evidence in court, Dr Paul stated that the three\n                    fatal wounds were directed wounds, in that they were inflicted with the intent\n                    to wound, and were not accidental injuries.[note: 11]Injury no 1 was inflicted with\n                    “quite a bit of force” and injuries nos 14 and 15 were\n                    “very forceful injuries”.[note: 12]",
        "The defences": "18     The accused had recounted in the written\n                    statements the events leading to the death of the deceased. In his evidence in\n                    court, his counsel Mr Subhas Anandan went through with him the aspects of the\n                    events which were most relevant to the defences. Under examination by Mr Subhas,\n                    the accused gave a detailed account of the exchange between him and the deceased\n                    near the bushes. He recounted that: I asked her in English, “You are not cheating on me, right?”\n                        She replied, “No.” “You are not” --- I then\n                        asked her, “You are not hiding anything from me, right?” Then\n                        she replied, “No.” And then I used an expletive and then asked\n                        her, “Who was the red guy? Who was the red shirt fellow with you in\n                        bed in the morning?”[note: 13] ... I cried. I asked her why and told her that I don’t understand:\n                        “What is it not that I have not done for you that he has\n                            done?[note: 14] ... She used this word that “he climbs better than you, that’s\n                        why I’m going for his body”. Among our --- us youngsters when\n                        we use the word “climb”, we mean to have sex ---[note: 15] 19     Mr Subhas asked the accused for his reaction\n                    when he heard that, and his response was: In my mind, I thought that she would ask me for my forgiveness like how\n                        she had done previously. But at this---at that moment, I did not realise\n                        that she would be using such hurtful words. It---it was shocking to me and\n                        it broke my heart. I’ve never feel this sad.[note: 16] ... I’ve never been this sad before in my life---whole life. I became\n                        very angry and I became very frustrated. I became very, very angry. I\n                        didn’t know what I was doing. I was such---I was in such frustration\n                        that I did not know what I was doing.[note: 17] ... In fact, I closed my eyes and I stabbed her. And in my anger, I did not\n                        know what I was doing. Not only that, what was going through my mind at that\n                        time were images of her in bed with another man and what other things that\n                        she has done to me previously. Those images were going through my mind, I\n                        closed my eyes. She in fact made me a stupid man ...[note: 18][Which was corrected\n                        to “made an idiot of me.”] 20     When he was cross-examined by the Prosecution,\n                    he was asked to elaborate on his statement to the defence psychiatrist\n                    Dr Tommy Tan (“Dr Tan”) that his mind went blank, and he\n                    clarified that:[note: 19] I stabbed her in anger, after that everything went blank ... I can’t\n                        even remember pulling out the knife.” 21     When the Prosecution questioned him further on\n                    this, he said: But I had explained that I do not know what was going on. Doesn’t\n                        that mean my mind went blank? And I told that something took control of me\n                        and the scene came---took con---the scenes took control of me. I did not\n                        know what was happening at that---at that moment. And that is considered to\n                        men that my mind went blank.[note: 20] ... I do not know what exactly happened at that moment. After the first stab\n                        until she was on the ground, I do not know what happened.[note: 21] 22     There is something to be said about this part\n                    of the accused’s evidence. If he did not know what happened when his mind\n                    “went blank”, then it would be natural that he would very alarmed\n                    and concerned when his mind re-activated and saw the girl he wanted to marry\n                    lying on the ground bleeding, and he did not know if she was dead or\n                        alive.[note: 22]One would expect him to\n                    do something to help her,eg, attend to her, or\n                    call for an ambulance, but he did neither and just left her there. His conduct\n                    was simply not consistent with his explanation.",
        "The psychiatric evidence": "23     Besides the accused, the principal witnesses\n                    in the case were the two psychiatrists, Dr Tan, a senior psychiatrist in\n                    private practice for the Defence and Dr Joshua Kua\n                    (“Dr Kua”), Consultant Psychiatrist, Institute of Mental\n                    Health, for the Prosecution. 24     Dr Tan presented two written reports on\n                    the accused, the first dated 2 November 2009[note: 23]and the second dated 15 November\n                        2009.[note: 24]The first report was\n                    prepared after he had interviewed the accused on three occasions and his mother,\n                    on one occasion. Dr Tan was told by the accused’s mother that he was\n                    hyperactive as a toddler, and she could not control him, and had to send him to\n                    his maternal grandmother. She also told him that his primary and secondary\n                    school teachers had complained that he was hyperactive, that he could not sit\n                    still for more than five minutes, that he kept disturbing other students, he\n                    fought in class and ran away from school. She also said that the accused was\n                    very hot-tempered and that his siblings were wary of his temper. (The\n                    accused’s mother did not give evidence on his behaviour\n                herself.) 25     Dr Tan learned from the accused that he\n                    was hyperactive, always hot-tempered, and that he could not control his temper\n                    and sometimes he could not remember what he did when he lost his\n                temper. 26     On the basis of information obtained in three\n                    interviews, Dr Tan produced his first report[note: 25]in which he made his findings that: Mental state at the time of the alleged\n                            offence Pathip has attention deficit/hyperactivity disorder. He has rage outbursts\n                        that are easily provoked. He was provoked by Jeevitha at the time of the alleged offence, who\n                        taunted his sexual prowess. He had a rage outburst. He said that his mind went blank and something\n                        controlled him. He only remembered stabbing Jeevitha once. He was still\n                        swinging his knife when he became conscious of what he was doing. He was not of unsound mind at the time of the alleged offence according to\n                        McNaughton Rules. Diminished responsibility Pathip satisfies the criteria for the defence of diminished\n                        responsibility. He had an abnormality of mind. He was in a stage of rage. His mind was\n                        blank. He acted impulsively. The abnormality of mind is caused by attention deficit/hyperactivity\n                        disorder, a mental condition that Pathip had suffered since he was a young\n                        child. It is a mental disorder that is associated with impulsivity and\n                        rage. The abnormality of mind substantially impaired his mental responsibility\n                        for the acts causing the death of Jeevitha. He could not control himself\n                        when he is in a state of rage. Dr Kua disagreed with these findings. 27     At the trial Dr Tan acknowledged that it\n                    would be preferable if he had interviewed more persons who knew the accused and\n                    had more information on the accused before he rendered his opinion.\n                    Consequently, he interviewed the accused’s stepfather, sister and two\n                    friends, and he also went through the accused’s primary and secondary\n                    school records and National Service records. With the benefit of the additional\n                    information, Dr Tan issued his second report[note: 26]where he stated that the accused satisfies\n                    the criteria for hyperactive disorder and attention deficit/hyperactivity\n                    disorder (“ADHD”) in accordance with the Diagnostic and\n                    Statistical Manual of Mental Disorders (American Psychiatric Association,\n                        4thEd, Text Revision) (“DSM”) and\n                    that he satisfied the features of ADHD as a child, an adolescent and an\n                    adult. 28     Dr Tan was of the view that ADHD is an\n                    abnormality of mind which impaired the accused’s mental responsibility for\n                    the act of causing the deceased’s death.[note: 27]He referred to the\n                        DSM[note: 28]in support of his\n                    conclusion. The DSM sets out five diagnostic criteria for ADHD. One criterion,\n                    Criterion D is of particular relevance. It states that: There must be clear evidence of clinically significant impairment in\n                        social, academic, or occupational functioning. and the DSM states that: There must be clear evidence of interference with developmentally\n                        appropriate social, academic, or occupational functioning (Criterion\n                        D). to support a diagnosis of ADHD. This is significant because there was\n                    no clear evidence that the accused had this essential impairment. 29     The Prosecution questioned, with some\n                    justification, the objectivity, consistency and veracity of the information\n                    obtained from the interviews with the accused’s step-father, sister and\n                    friends. However, besides their input, there were documentary records which were\n                    from sources with no interest in the case and thus were free from such\n                    criticism. The report on his conduct issued by his primary school[note: 29]stated that he displayed\n                    “isolated instances of anger management issues but there were no\n                    significant trends to warrant referral”. The report issued by his\n                    secondary school noted that he was playful and restless, easily distracted and\n                    dreamy, and that his attitude towards teachers and school authority was\n                    indifferent. While the records showed that he was not a model student, there was\n                    no evidence of clinically significant impairment of social and academic\n                    functioning during his schooldays. 30     Similarly, in the Certificate of Service on\n                    the accused’s two years full-time national service attachment with the\n                    fire service his reporting officer noted that:[note: 30] He is good at his work and will always be able to [illegible] task that\n                        has been assigned to him. The negative point about him is that at times he\n                        might take things lightly and tries to find the easy way out. Evidently, he did not manifest any significant impairment of social or\n                    occupational functioning during those two years. 31     The Prosecution had asked the accused about\n                    his working life. The accused explained that he was working as a movement\n                    operator and his work involved transferring oil from lorry to tank and tank to\n                    tank. He was asked:[note: 31] In the course of your work, did you have any problems with your\n                        colleague? and he replied:[note: 32] We did not have. Even if we had, we would forget about it there and\n                        then. 32     The evidence showed that the accused never had\n                    any functional impairment. He made unremarkable progress through school and\n                    national service, and at the time of the offence, he had a normal working life,\n                    and he had his friends and a girlfriend. No one had thought that he needed\n                    psychological counselling or treatment. The Defence has therefore not\n                    established that the accused was afflicted with ADHD which substantially\n                    impaired his mental responsibility. 33     The diagnostic criteria aside, the\n                    accused’s state of mind at the time he attacked the deceased has to be\n                    considered, and I will do that after I have dealt with the second line of\n                    defence that the accused had attacked the deceased whilst he was deprived of the\n                    power of self-control by grave and sudden provocation. 34     What was the provocation from the deceased? In\n                    the first statement recorded on the day of arrest on 8 July\n                        2008,[note: 33]the deceased is alleged\n                    to have said “He’s better than you in bed”, the\n                    “he” being the man in the red shirt. In his cautioned statement\n                    recorded on 9 July 2008, it was that “She said that he is better in\n                    bed than me”. In his statement to the investigating officer on\n                    12 July 2008,[note: 34]the\n                    deceased had said in Tamil “[H]e is better than you in bed, that is why I\n                    am after him.” In his evidence in court, it was “he climbs better\n                    than you, that’s why I’m going for his body.” 35     The requirements of Exception 1 are well\n                    established. The Court of Appeal had pointed out inPublic\n                        Prosecutor v Kwan Cin Cheng[1998] 1 SLR(R) 434 at [44]\n                    that: [T]here are two distinct requirements for the provocation defence to\n                        apply: first, a \"subjective\" requirement that the accused was deprived of\n                        his self-control by provocation; and secondly, an \"objective\" requirement\n                        that the provocation should have been \"grave and sudden\". The latter\n                        requirement involves the application of the \"reasonable man\" test ... and the Court of Criminal Appeal explained inVijayan v Public Prosecutor[1974–1976] SLR(R) 373 at [28]: In every case it depends on the effect of the provocative act on the\n                        ordinary man, that is, an ordinary reasonable man belonging to the same\n                        class of society as the accused. That is the test which must be applied to\n                        ascertain whether or not there was provocation within the meaning of\n                        Exception 1 of s 300 of the Penal Code. Whether an act which caused\n                        death was done in the heat of passion caused by grave and sudden provocation\n                        depends in our opinion on whether the provocative act was such as was likely\n                        to cause a reasonable man to lose his self-control and to do the act in\n                        question. The Court of Criminal Appeal also noted inIthinin\n                        bin Kamari v Public Prosecutor[1993] 1 SLR(R) 547 that\n                    the particular characteristics or circumstances of the person in question should\n                    also be taken into account when it agreed with Lord Diplock’s judgment inDirector of Public Prosecutions v Camplin[1978] AC 705 at 717 that: ... the gravity of verbal provocation may well depend upon the particular\n                        characteristics or circumstances of the person to whom a taunt or insult is\n                        addressed. To taunt a person because of his race, his physical infirmities\n                        or some shameful incident in his past may well be considered by the jury to\n                        be more offensive to the person addressed, however equable his temperament,\n                        if the facts on which the taunt is founded are true than it would be if they\n                        were not. 36     Undoubtedly, the deceased’s words as\n                    recounted by the accused had an impact on him. They were lovers, and she was\n                    telling him not only that she was seeing another person, but she considered that\n                    person to be a better lover than him. A reasonable man in his position would be\n                    hurt by that, but not so enraged that he would lose his power of self-control.\n                    It could be different if she had said something personal about him,eg, he was a poor lover or ridiculed him for any sexual\n                    deficiencies that he might have. Yet all that she is alleged to have said was\n                    that the other man was a better lover. On an objective review of that, the\n                    second objective requirement in Exception 1 is not satisfied. 37     That leaves the subjective requirement that\n                    the accused be deprived of his self-control by the provocation. This requires an\n                    examination of the accused’s state of mind at the time he attacked the\n                    deceased, and this is also relevant to the defence of diminished\n                    responsibility. 38     The accused told Dr Tan that his mind\n                    went blank, but he had not said that until he saw Dr Tan. When he\n                    surrendered himself at the Woodlands Checkpoint, he admitted that he had killed\n                    his girlfriend because of jealousy. In the first written statement[note: 35]he said that he stabbed the\n                    deceased, then he closed his eyes and kept swinging the knife at her. There was\n                    no mention of his mind going blank. In the cautioned statement[note: 36]he said that he stabbed her, and\n                    then he closed his eyes and “blindly stabbed her a lot of times”,\n                    with no mention of his mind going blank. In his investigation\n                        statement[note: 37]he\n                    gave an account of the stabbing without saying that he had closed his eyes or\n                    that his mind went blank. In Dr Kua’s notes on his interview on\n                    24 July 2008[note: 38]he recorded that the accused\n                    “poked” the deceased with the knife, then he closed his eyes and\n                    waved the knife at her, but he did not say that his mind went blank, and\n                    Dr Kua set this out in his report on the accused.[note: 39] 39     It appears that the accused only talked about\n                    his mind going blank when he saw Dr Tan in October 2009,[note: 40]more than a year after the\n                    event. When all his statements are examined, it is clear that his mental\n                    processes did not cease during the attack. While he had closed his eyes, he felt\n                    that the deceased was holding onto his hands, he knew that he continued to wield\n                    the knife and that she scratched his right hand when he pulled the knife out of\n                    his body. He heard her protestations of love for him. He remembered that he\n                    knelt to kiss the deceased, and that he decided to remove her necklace or\n                    “thali”, which was a symbol of their relationship. 40     When the accused saw Dr Tan, he told\n                    Dr Tan about his mind going blank. Dr Tan recorded that:[note: 41] His\n                    “mind went blank, something took control of me, just\n                    blank”. He remembered stabbing her once. “After that, I don’t\n                        remember” “When I come to conscious, I was still swinging the knife”.\n                        “She was already on the ground”. “I kneel down, kissed\n                        her on the cheek”. and from that Dr Tan concluded that: Mental state at the time of the alleged\n                            offence Pathip has attention deficit/hyperactivity disorder. He has rage outbursts\n                        that are easily provoked. He was provoked by Jeevitha at the time of the alleged offence, who\n                        taunted his sexual prowess. He had a rage outburst. He said that his mind went blank and something\n                        controlled him. He only remembered stabbing Jeevitha once. He was still\n                        swinging his knife when he became conscious of what he was doing. He was not of unsound mind at the time of the alleged offence according to\n                        McNaughton Rules. Diminished responsibility Pathip satisfies the criteria for the defence of diminished\n                        responsibility. He had an abnormality of mind. He was in a stage of rage. His mind was\n                        blank. He acted impulsively. The abnormality of mind is caused by attention deficit/hyperactivity\n                        disorder, a mental condition that Pathip had suffered since he was a young\n                        child. It is a mental disorder that is associated with impulsivity and\n                        rage. The abnormality of mind substantially impaired his mental responsibility\n                        for the acts causing the death of Jeevitha. He could not control himself\n                        when he is in a state of rage. 41     Insofar as it is clear that the\n                    accused’s mind did not actually go blank, and the accused had not\n                    disclosed to Dr Tan all that he had disclosed in the statements which have\n                    been referred to, Dr Tan’s conclusions must be taken with\n                    caution. 42     When I take into account all the statements\n                    the accused made to the police and to Dr Kua, I find that when the accused\n                    inflicted the injuries on the deceased, he was not deprived of self-control by\n                    grave and sudden provocation, and that he was not suffering from any abnormality\n                    of mind that substantially impaired his mental responsibility for his acts. The\n                    effect of that is that his defences of provocation and diminished responsibility\n                    are not made out. 43     Consequently, I find the accused guilty of\n                    murder as charged.  [note: 1]Defence\n                                Skeletal Closing Submissions para 2 [note: 2]D2 –\n                                D9 [note: 3]D3 [note: 4]D2 [note: 5]D4 –\n                                D9 [note: 6]D5 para 63 [note: 7]D5 para\n                                66 [note: 8]Agreed Statement of Facts para 65, Notes of Evidence\n                                2/11/2009 page 91 lines 16–29 [note: 9]D2 [note: 10]P185 [note: 11]Notes of\n                                Evidence 4/11/2009 page 39 lines\n                        22–32 [note: 12]Notes of\n                                Evidence 4/11/2009 page 40 lines\n                    1–15 [note: 13]Notes\n                                    of Evidence 6/11/2009 page 26 lines\n                            11–15 [note: 14]Notes of Evidence 6/11/2009 page\n                                    26 lines 19–20 [note: 15]Notes of Evidence 6/11/2009 page 26 lines\n                                    22–24 [note: 16]Notes of Evidence 6/11/2009 page 5 lines\n                                    25–28 [note: 17]Notes\n                                    of Evidence 6/11/2009 page 6 lines\n                            2–6 [note: 18]Notes of Evidence 6/11/2009 page 6\n                                    lines16–19 [note: 19]Notes of Evidence 10/11/2009 page 8\n                                lines 9–14 [note: 20]Notes\n                                    of Evidence 10/11/2009 page 8 lines\n                            19–23 [note: 21]Notes of Evidence 10/11/2009 page 16 lines\n                                    24–25 [note: 22]Notes of Evidence 6/112009 page 28\n                                lines 19–21 [note: 23]D1 [note: 24]D24 [note: 25]D1 [note: 26]D24 [note: 27]See D1\n                                under “Diminished\n                        responsibility” [note: 28]D17 [note: 29]D12 [note: 30]P302 [note: 31]Notes of Evidence 10/11/2009 page 22\n                                line 19 [note: 32]Notes of\n                                Evidence 10/11/2009 page 22 line 20 [note: 33]D3 [note: 34]D5 [note: 35]D3 [note: 36]D2 [note: 37]D5 para 73 [note: 38]P304 typewritten transcript at page\n                                10 [note: 39]P196 [note: 40]D1 page 7 [note: 41]D1 at page 7"
    }
}