{
    "case_title": "Tam Chee Chong and another\n      v\n      DBS Bank Ltd",
    "ncitation": "[2010] SGHC 331",
    "coram": "Andrew Ang J",
    "sections": {
        "Introduction": "1       This case concerns an action by Tam Chee Chong\n                    and Keoy Soo Earn (“the plaintiffs”) to set aside a charge given\n                    by Jurong Hi-Tech Industries Pte Ltd (under judicial management)\n                    (“JHTI”) over certain shares to DBS Bank Ltd (“the\n                    defendant”) on the grounds that the charge constituted an unfair\n                    preference under s 227T of the Companies Act (Cap 50, 2006 Rev\n                    Ed) (“the Companies Act”). 2       JHTI is a wholly-owned subsidiary of Jurong\n                    Technologies Industrial Corporation Ltd (under judicial management)\n                    (“JTIC”), the latter of which is an investment holding company.\n                    JHTI and JTIC (“the Companies”) were placed under judicial\n                    management by orders of court on 20 February 2009. The plaintiffs were\n                    appointed as judicial managers of the Companies and it is in that capacity that\n                    they bring this action.",
        "The background": "3       Sometime in the last quarter of 2006, the\n                    defendant approached JTIC with an offer of banking facilities. Yeo Pek Heng\n                    (“Yeo”), a director of JTIC and JHTI, informed the defendant that\n                    the facilities from the other banks, such as ABN AMRO Bank NV (“ABN\n                    AMRO”), Bank of Tokyo-Mitsubishi UFJ (“BTMU”), Malayan\n                    Banking Berhad (“Maybank”), Oversea-Chinese Banking Corporation\n                    Ltd (“OCBC”), Rabobank International Singapore Branch\n                    (“Rabobank”), RHB Bank Berhad (“RHB”) and United\n                    Overseas Bank Ltd (“UOB”) were all unsecured but that each of the\n                    banks had been given a negative pledge and apari\n                        passuundertaking. The defendant was willing to lend on a similar\n                    basis. 4       By a letter of offer dated 27 December\n                    2006, the defendant granted banking facilities to the Companies, jointly and\n                    severally. The banking facilities were revised and supplemented with additional\n                    banking facilities over the next few years. Each of the defendant’s\n                    letters of offer provided that the facilities granted to the Companies were\n                    unsecured and contained the additional negative pledge andpari passuclauses similar to those on which facilities were\n                    granted to the Companies by the other banks. 5       When Ms Lin Li Fang, then already a\n                    director of both JTIC and JHTI, took over as chairperson of the JTIC group of\n                    companies (“the Group”) in March 2008, she was concerned about the\n                    high debt level of the Group and considered it a priority to\n                    “monetise” the assets of the Group and to pay down the loans\n                    outstanding to the banks. 6       Thereafter, Dr Chung Siang Joon\n                    (“Dr Chung”), executive director of finance of JTIC, and Yeo\n                    gave similar presentations to the defendant and each of the other banks\n                        (ie, ABN AMRO, KBC and KBC Bank NV\n                    (“KBC”), Maybank, Rabobank, RHB, Sumitomo Mitsui Banking\n                    Corporation (“SMBC”), OCBC and UOB) separately, where they stated\n                    that some of the Companies’ assets would be sold to pay down the loans\n                    from the banks. Those assets included the Electronic Manufacturing Services\n                    business, shares in MAP Technology Holdings Ltd (“MAP Shares”) as\n                    well as shares in Min Aik Technology Co Ltd (“Min Aik\n                    Shares”). 7       The defendant’s willingness to provide\n                    funding to the Companies when so requested can be seen from several episodes. In\n                    May 2008, JTIC was interested in acquiring a 100% stake in Priver Electric (BVI)\n                    Co Ltd (“Priver”) – a company incorporated in the British\n                    Virgin Islands. Dr Chung, Yeo and Lin approached the defendant for a short\n                    term loan of S$5m for the acquisition (“the 1st Ad Hoc Short Term\n                    Loan”). The defendant agreed and disbursed the loan pursuant to the\n                    drawdown notice issued by the Companies dated 2 July 2008. 8       Another noteworthy instance to illustrate how\n                    the defendant was more helpful to the Companies than the other banks\n                    occurred in July 2008. ABN AMRO Bank had wanted to reduce the amount of the\n                    standby letter of credit (“SBLC”) facility it had granted to\n                    JHTI’s wholly owned subsidiary in Brazil – JHT Industrial Jaguariuna\n                    Ltda. The Companies approached Rabobank, UOB and the defendant to take over the\n                    SBLC facility but only the defendant agreed to do so. The defendant granted the\n                    Companies an SBLC facility of US$1.5m on 14 July 2008 which was\n                    subsequently increased to US$2m on 15 September 2008. 9       Yet another example of the defendant’s\n                    assisting to the Companies is as follows. At JTIC’s annual general meeting\n                    on 30 April 2008, JTIC announced a dividend payment of $0.01 per share. The\n                    dividend was to be paid by end September 2008, but JTIC did not have the funds\n                    to pay it. Dr Chung, Yeo and Ms Lin approached the defendant for\n                    another short term loan of S$10m. The defendant approved a loan of S$7.5m\n                    (“the 2nd Ad Hoc Short Term Loan” and collectively with the 1st Ad\n                    Hoc Short Term Loan, the “Ad Hoc Short Term Loans”), of which S$6m\n                    was disbursed on 26 September 2008 and a further S$0.5m on\n                    29 September 2008 pursuant to drawdown notices issued by the\n                    Companies. 10     By 14 January 2009, the Companies owed\n                    the defendant, its largest creditor, approximately S$30m and\n                US$44m. 11     In June 2008, ABN AMRO requested that the\n                    Companies provide an undertaking to physically deposit the approximately 18\n                    million shares in MAP Technology Holdings Ltd (“MAP”) that the\n                    Companies owned with ABN AMRO by 1 July 2008 in consideration for ABN AMRO\n                    not recalling the facilities and proposing new repayment terms. The Companies\n                    agreed and a letter of undertaking dated 30 June 2008 was furnished by JTIC\n                    to ABN AMRO. The Companies also physically deposited the non-tradeable\n                    share certificate representing approximately 18 million shares in MAP with ABN\n                    AMRO. Incidentally, the shares in question were subject to a sale moratorium\n                    until 28 July 2008. 12     On 1 July 2008, Dr Chung informed\n                    the defendant that JTIC held 18.8 million shares in MAP which were subject\n                    to the sale moratorium as described above. Dr Chung also stated that the\n                    shares might be sold to repay the 1st Ad Hoc Short Term Loan. This was somewhat\n                    inaccurate as there were in fact 18,661,620 shares, and they were held in the\n                    name of JHTI not JTIC. 13     Upon the expiry of the moratorium period, ABN\n                    AMRO returned the share certificate to JHTI so that the shares could be\n                    converted to scripless shares. JHTI also obtained additional shares in MAP from\n                    the sale by JTIC of two related companies to MAP. 14     In August and September 2008, ABN AMRO\n                    requested that the scripless shares in MAP be transferred to its nominees\n                    account, apparently without change of beneficial ownership, but Dr Chung\n                    refused the request as he was aware of the negative pledge andpari passuclause given by the Companies to the banks.\n                    This was despite ABN AMRO threatening to accelerate repayment by making a formal\n                    demand. 15     On or about 17 September 2008, the\n                    defendant gave JTIC an introduction to DBS Nominees so that JHTI could appoint\n                    DBS Nominees as custodian for the shares in MAP. The custody account was duly\n                    opened. 16     From September to November 2008, JHTI found it\n                    difficult to pay amounts due on the loans it had taken out. The defendant and\n                    other banks that had extended loans to JHTI were pressing the Companies for\n                    payment of overdue amounts. However, JHTI was unable to make payment of the\n                    outstanding amounts in full. JHTI told its bank creditors, including the\n                    defendant, that it would repay the facilities using the proceeds from the sale\n                    of the shares in MAP, the sale of the shares in Min Aik Technology Co Ltd and\n                    the sale (“the GEM Deal”) of the Electronic Manufacturing Services\n                    business to the Global Emerging Markets Group. During this period, trade\n                    creditors were also demanding payment of invoices from JHTI. 17     JHTI did make some payments to the banks,\n                    however. All the banks, including the defendant, had received some payments from\n                    JHTI from September to November 2008. The defendant had received US$300,000 and\n                    US$600,000 on 24 October 2008 and 31 October 2008. However, these\n                    payments were made in the ordinary course of business from trade receivables or\n                    by drawing on credit lines and not from the disposal of assets. 18     The defendant’s requests for payment in\n                    September 2008 were merely in relation to the Companies’ overdue trade\n                    bills. After the 2nd Ad Hoc Short Term Loan was disbursed on 26 September\n                    2008, the defendant requested repayment of the 1st Ad Hoc Short Term\n                    Loan. 19     The 1st Ad Hoc Short Term Loan was originally\n                    due on 1 August 2008. Of this amount, S$2.5m was repaid in August and\n                    September 2008 with the balance rolled over. Despite the 1st Ad Hoc Short Term\n                    Loan not being fully repaid, the 2nd Ad Hoc Short Term Loan was nonetheless\n                    disbursed. When the Companies failed to repay the 2nd Ad Hoc Short Term Loan\n                    upon its maturity on 10 October 2008, this loan too was rolled\n                over. 20     Even though the defendant was requesting the\n                    Companies to make payment of their overdue trade bills and the balance of the Ad\n                    Hoc Short Term Loans during this period, the relationship between the defendant\n                    and the Companies remained cordial. Ms Lin said she did not feel pressured\n                    by the defendant’s requests, especially since the other banks were also\n                    asking the Companies for repayment. Moreover, the defendant did not make any\n                    formal demand for payment until 14 January 2009, as discussed\n                below. 21     On 10 October 2008, the defendant offered\n                    to assist the Companies by providing a US$8.5m account receivables facility to\n                    the Companies. The defendant issued a letter of offer for this facility on 4\n                    November 2008 but the Companies did not accept it. Unbeknown to the defendant,\n                    accounts receivable financing had already been arranged with\n                Rabobank. 22     Ms Khua Soh Teng Pansy\n                    (“Ms Khua”), a vice-president of the defendant’s\n                    Institutional Banking Group, sent an e-mail to the Companies on 17 October\n                    2008 seeking their settlement instructions “immediately” in respect of several overdue trade\n                    bills. 23     Further to instructions given by Ms Tan\n                    Ee Lee (“Ms Tan”), the defendant’s managing director of\n                    the Institutional Banking Group, Ms Khua impressed upon Ms Lin during\n                    a meeting on 17 October 2008 at the defendant’s offices that the\n                    Companies’ failure to meet their repayment obligations constituted an\n                    event of default which entitled the defendant to recall the banking\n                    facilities. 24     Ms Khua followed up with an e-mail to the\n                    Companies dated 20 October 2008 (the Monday after the meeting on Friday\n                    17 October 2008) reiterating that there was anevent of\n                        defaultunder the banking facilities and thatthe defendant reserved all the rights against the Companies. It\n                    will be observed, however, that the defendant stopped short of threatening to\n                    call default. 25     On 29 October 2008, Ms Khua sent an\n                    e-mail which set the date 14 November 2008 for the repayment of the amounts\n                    outstanding under the Ad Hoc Short Term Loans. Ms Khua also noted that\n                    repayment was supposed to be from proceeds of sale of the MAP\n                Shares. 26     By this time,ie, 29 October 2008, S$2.5m was due under the 1st Ad Hoc Short\n                    Term Loan, S$6.5m was due under the 2nd Ad Hoc Short Term loan and,\n                    approximately, US$4.2m and S$700,000 were due under the main banking facilities.\n                    Ms Khua and Terry Law (“Law”), who was then a deputy manager\n                    in the Institutional Banking Group of the defendant, had voiced their\n                    displeasure over the Companies’ conduct and were pressing for repayment of\n                    all outstandings. In view of the outstanding amount due from the Companies,\n                    Ms Tan noted that this was “extremely worrying” and\n                    instructed Ms Khua to “push [the Companies] hard for all overdues\n                    and excesses to be settled”. Internally, Law was also being pressured by\n                    Ms Tan to push the Companies to make repayment. In Law’s\n                    words: I guess the build-up [to taking the Charge on 13 November 2008] of this\n                        case is also crucial that we [ie, Ms Khua\n                        and Law] had to do something to actually get back tomy\n                            boss, who was breathing down my neck all the time, at\n                        that point of time, so ... we were already chasing for payments, ...\n                        [emphasis added] 27     The defendant subsequently extended the\n                    14 November 2008 repayment date by two weeks. According to the defendant,\n                    it had only agreed to extend the repayment of the Ad Hoc Short Term Loans by two\n                    weeks because JHTI had extended the charge in question (discussed below at[31]) to the defendant. However, the\n                    defendant did not inform JHTI of the extension. The defendant also continued to\n                    press JHTI for repayment during the extension period. From 14 November 2008\n                    onwards, Yeo (not knowing that internal approval had been obtained by the\n                    defendant for a two-week extension) made several requests for the defendant to\n                    extend the repayment deadline of the Ad Hoc Short Term Loans; each time, the\n                    deadline was extended by one or a few days. The defendant continued to grant\n                    rollovers of the Ad Hoc Short Term Loans even after the two-week extension\n                    period had expired. The defendant continued to rollover the Ad Hoc Short Term\n                    Loans until it was ready to recall the facilities and issued a letter of demand\n                    on 14 January 2009. As for the Companies’ longer term loans with the\n                    defendant, the deadline for payment had already been extended in the months of\n                    May to August 2008 to much later dates in the months of November to February\n                    2009. 28     Besides the defendant, other banks such as ABN\n                    AMRO, Rabobank and SMBC were also granting rollovers to the Companies\n                    whilst simultaneously demanding repayment. 29     Sometime in November 2008, Richard Lee of\n                    Rabobank asked Ms Lin to place the shares in MAP in an “escrow\n                    account” with Rabobank. Ms Lin told him that this could not be\n                    done. 30     Some banks eventually began to demand payment\n                    of all amounts outstanding. On 7 November 2008, KBC served a letter of\n                    demand on the Companies calling default and declaring that all amounts due under\n                    the banking facilities were immediately due and payable. On 13 November 2008,\n                    Rabobank issued a letter to the Companies which,inter\n                        alia, requested that the Companies make payment of any and all\n                    sums currently due and outstanding. 31     It is against this background that the charge\n                    in question was granted. On 13 November 2008, Ms Lin received a call from\n                    Ms Khua, to go to the defendant’s office. There, she was informed\n                    that the defendant wanted a charge over the MAP shares owned by JHTI,\n                    Ms Lin agreed and signed the Security Memorandum granting the defendant a\n                    charge (“the Charge”) over the MAP Shares and arranged for the\n                    common seal of JHTI to be affixed thereafter in the presence of Dr Chung\n                    and Yeo. Particulars of the charge were lodged for registration with the\n                    Accounting and Corporate Regulatory Authority on 10 December 2008. 32     It bears pointing out that at the time the\n                    Charge was granted no new loans were extended to the Companies. Nor were new\n                    loans extended by the defendant after the grant of the Charge. Regarding the\n                    taking of the Charge, it is interesting to note from an entry in a draft of a\n                    memorandum dated 17 November 2008 prepared within the defendant (between\n                    Ms Khua and Law each of whom pointed to the other as being the author of\n                    the said entry) that the defendant was taking the Charge “for whatever it\n                    [was] worth” and would then seek legal advice on the defendant’s\n                    rights. 33     Subsequently, the Companies received letters\n                    of demand from ABN AMRO, BTMU, Maybank, Rabobank and OCBC. The defendant\n                    too eventually sent a letter of demand on 14 January 2009 to the Companies,\n                    demanding immediate repayment of amounts outstanding. As mentioned above, the\n                    Companies were placed under judicial management on 20 February 2009. I do\n                    not make much of the fact that it was upon the application of the defendant that\n                    the judicial managers were appointed. The writing was already on the wall. If\n                    they had not done so, another of the creditors would have applied either for\n                    JHTI to be wound up or for judicial managers to be appointed. 34     The plaintiffs thereafter commenced this\n                    action, seeking to set aside the Charge on the ground that the Charge\n                    constituted an unfair preference under s 227T of the Companies\n                Act.",
        "The relevant legal principles": "35     The relevant legal principles are as follows.\n                    Section 227T(1) of the Companies Act provides that a charge on property made by\n                    a company shall, in the event of the company being placed under judicial\n                    management, be void against the judicial manager, if the charge is such that had\n                    it been made by a natural person, it would in the event of his becoming bankrupt\n                    be void as against the Official Assignee under ss 98, 99 or 103 of the\n                    Bankruptcy Act (Cap 20, 2000 Rev Ed) (“the BA”) read\n                    with ss 100, 101 and 102 thereof. Section 227T(2) of the Companies Act\n                    provides: For the purposes of subsection (1), the date that corresponds with the\n                        date of the application for a bankruptcy order in the case of a natural\n                        person and the date on which a person is adjudged bankrupt is the date on\n                        which an application for a judicial management order is made. 36     Of the several provisions of the BA made\n                    applicable through s 227T of the Companies Act, the provision that is of\n                    most relevance to the present proceedings is s 99, which deals with unfair\n                    preference. Section 99(1) reads: Subject to this section and sections 100 and 102, where an individual is\n                        adjudged bankrupt and he has, at the relevant time (as defined in section\n                        100), given an unfair preference to any person, the Official Assignee may\n                        apply to the court for an order under this section. Section 99(3) states that an individual gives an unfair preference to\n                    a person when: (a)    that person is one of the individual’s\n                            creditors or a surety or guarantor for any of his debts or other\n                            liabilities; and (b)    the individual does anything or suffers anything\n                            to be done which (in either case) has the effect of putting that person\n                            into a position which, in the event of the individual’s\n                            bankruptcy, will be better than the position he would have been in if\n                            that thing had not been done. A finding that there was an unfair preference shall not be made\n                    unless the individual who gave the preference was influenced in deciding to give\n                    it by a desire to produce in relation to that person the effect mentioned in\n                    s 99(3)(b): s 99(4) of the BA. 37     As for the period of time during which unfair\n                    preferences are caught by ss 99 of the BA, s 100(1) of the BA (read with\n                    s 227T(1) of the Companies Act) provides that the time at which an\n                    individual gives an unfair preference shall be a relevant time if the preference\n                    is given within the period of six months ending on the date of the application\n                    for the judicial management order. Section 100(2) of the BA provides that the\n                    time period referred to above shall not be a relevant time period unless the\n                    individual: (a)    is insolvent at that time; or (b)    becomes insolvent in consequence of the\n                            transaction or preference. 38     The aforementioned provisions can be\n                    summarised as follows. In order for the granting of the Charge to be impugned as\n                    being an unfair preference, it must be shown that: (a)     the defendant was a creditor of\n                        JHTI; (b)     the\n                        granting of the Charge put the defendant in a better position than it would\n                        otherwise have been in in the event of JHTI’s\n                    insolvency; (c)     in\n                        granting the Charge, JHTI was influenced by a desire to prefer the\n                        defendant,ie, to put the defendant in a\n                        better position than it would otherwise been in in the event of JHTI’s\n                        insolvency; (d)     The\n                        Charge was granted to the defendant within a period of six months prior to\n                        the date of the application for the judicial management order;\n                    and (e)     JHTI was either\n                        insolvent at the time the Charge was granted or became insolvent as a result\n                        of the granting of the Charge. The parties did not\n                    dispute that the criteria in (a), (b) and (d) above were satisfied. Therefore,\n                    the key issues at trial concerned (c) and (e). I shall address these in\n                    turn.",
        "Was JHTI influenced by a desire to prefer the defendant?": "39     Section 99 – the provision in the BA\n                    dealing with unfair preferences – was enacted in 1995 and is similar to\n                    s 239 of the Insolvency Act 1986 of the United Kingdom, which introduced\n                    several changes to the law of the United Kingdom: Kan Ting Chiu J inRe Libra Industries Pte Ltd (in compulsory liquidation)[1999] 3 SLR(R) 205 (“Re\n                    Libra”), at [36]. Millett J discussed, in great detail,\n                    the changes brought about by the new law in the English decisionRe MC Bacon Ltd[1990] BCLC 324\n                        (“Re Bacon”), which was cited\n                    with approval inRe Libra, at [36]–[38], andAmrae Benchuan Trading Pte Ltd (in liquidation) v Tan Te\n                        Teck Gregory[2006] 4 SLR(R) 969) at [45]–[51].\n                    The provision we are concerned with here is s 99(4) of the BA, wherein the\n                    requirement for the requisite desire to have influenced the granting of the\n                    charge can be found. In speaking of the English equivalent to s 99(4) of\n                    the BA, Millett J stated, at 335, that: ... It is no longer necessary to establish adominantintention to prefer. It is sufficient that the\n                        decision wasinfluencedby the requisite\n                        desire. That is the first change. The second is that it is no longer\n                        sufficient to establish anintentionto\n                        prefer. There must be adesireto produce the\n                        effect mentioned in the subsection. [emphasis in original] 40     Millett J then continued to elaborate on\n                    the difference between “intention” and “desire” at\n                    335: ... Intention is objective, desire is subjective. A man can choose the\n                        lesser of two evils without desiring either. And at 336: ... Under the new regime a transaction will not be set aside as a voidable\n                        preference unless the company positively wished to improve the\n                        creditor’s position in the event of its own insolvent\n                        liquidation. However, foreseeing the difficulty involved in proving desire,\n                    Millett J insightfully added, at 336, that: There is, of course, no need for there to be direct evidence of the\n                        requisite desire. Its existence may be inferred from the circumstances of\n                        the case just as the dominant intention could be inferred under the old law.\n                        But the mere presence of the requisite desire will not be sufficient by\n                        itself. It must have influenced the decision to enter into the transaction.\n                        ... That does not mean that the requisite desire must have been the factor\n                    that “tipped the scales”; that would, in the considered opinion of\n                    Millett J, be too high a standard. Rather, the requirement is\n                    “satisfied if it was one of the factors which operated on the minds of\n                    those who made the decision”:Re Bacon, at 336. 41Re Baconwas\n                    followed in the English decision ofRe Fairway Magazines\n                        Ltd[1993] BCLC 643. That case concerned the question\n                    whether a debenture granted by a company was a voidable preference.\n                    Mummery J stated, at 649, that: … it does not follow that, because there was a desire to grant the\n                        debenture or to make the payment, there was a desire to prefer the creditor\n                        in the event of insolvency. If the company is influenced by ‘proper\n                        commercial considerations’ and not by a ‘positive wish to\n                        improve the creditor’s position in the event of its insolvent\n                        liquidation’, then the debenture will be valid. If a desire to prefer\n                        is present, however, it is sufficient that it influences the decision. It\n                        does not have to be the sole or decisive influence on the decision. 42     Therefore, if a company is influenced by\n                    “proper commercial considerations” and not a desire to improve the\n                    creditor’s position, the security interest granted will not be regarded as\n                    a voidable preference. However, it is crucial to note that this is only the case\n                    where there is no “positive wish” to improve the creditor’s\n                    position; if such a desire to prefer is present and influences the decision,\n                    even if it did not “tip the scales” or dictate the decision, that\n                    suffices for the purposes of s 99 of the BA. 43     Turning then to the facts at hand, there is\n                    more than ample evidence that in granting the Charge, JHTI desired putting the\n                    defendant in a better position than it would otherwise have been in and that\n                    this desire influenced the granting of the Charge. Ms Lin stated in her\n                    first affidavit, filed on 22 June 2009, that she was willing to sign the\n                    Security Memorandum to grant the Charge as the defendant had helped the\n                    Companies by granting the Companies short term loans when no other bank was\n                    willing to do so, and the defendant had been very supportive of the Companies.\n                    She further stated in her second affidavit, filed on 27 August 2009, that\n                    the “fact that DBS wanted to provide financing to the Companies even in\n                    November 2008 made me feel that DBS was very supportive of the Companies, and\n                    this support contributed to my decision to give the Charge to\n                    DBS”. 44     Ms Lin also testified, on re-examination,\n                    that JHTI had granted the Charge to the defendant as the defendant was\n                    supportive in extending facilities to JHTI when other banks were unwilling\n                    to: Q:My learned friend referred you to the paragraph in\n                            your affidavit, and he put it to you that therefore, when you say in\n                            paragraph 2.6.1 that ‘DBS was supportive of the companies’\n                            and that is why you gave the charge, that is a false\n                        statement. A:I do not agree. Q:He says that. Can you explain to the court what you\n                            meant by supportive? A:Okay. Q:They used the word ‘supportive’ in the\n                            affidavit. A:‘Supportive’ means during the -- July,\n                            there was a 5 million I needed for the M&A to acquire Priver,\n                            so they give it to us, the 5 million drawdown, and then there is another\n                            in September, we supposed to have the dividend paid, it’s 6\n                            million, I think they also have drawn down. And then they also helped us on the SBLC, which was 1.5, later they\n                        upgrade to US$2 million SBLC, where, I think -- which bank\n                        doesn’t want to continue. So DBS help us where other banks\n                        doesn’t want to continue. 45     It was difficult at time to understand\n                    Ms Lin’s testimony owing to her command of the English language. She\n                    also suffered from memory lapses at several junctures. Nevertheless, I was\n                    satisfied that her testimony was credible and reliable with respect to the\n                    underlying reason for the granting of the Charge: namely, that the defendant had\n                    been very supportive of the Companies in the past. 46     Ms Lin’s reason for granting the\n                    Charge was supported by others at the Companies. Dr Chung and Yeo stated in\n                    their affidavits that they supported Ms Lin’s decision to grant the\n                    Charge to the defendant as they felt that the defendant had been very supportive\n                    of the Companies in the past in granting them short term loans when no other\n                    bank was willing to do so. 47     This is supported too by the circumstantial\n                    evidence. JHTI had told its bank creditors that it would be raising funds\n                    through the sale of various assets. However, JHTI eventually chose to grant the\n                    Charge to the defendant only. The other banks exerted as much, if not more,\n                    pressure on the Companies (above at[30]),\n                    yet the Charge was granted to the defendant. Indeed, Ms Khua admitted that\n                    the pressure exerted by KBC was greater than that exerted by the defendant as\n                    KBC had issued a formal letter of demand. Prior to 13 November 2008, there\n                    was no indication that the defendant had approved the recall of facilities to\n                    JHTI. Furthermore, no new facilities were granted or disbursed to the Companies\n                    as a result of the granting of the Charge. Although the defendant alleged that\n                    the Charge was granted by JHTI in exchange for a two-week extension for payment,\n                    this was not conveyed to the Companies. In any event, it is questionable that a\n                    two-week extension would have constituted a proper commercial consideration,\n                    given JHTI’s dire situation (discussed further below at[52]). There were, therefore, no valid commercial\n                    reasons for JHTI to grant the Charge to the defendant. Thus, there was clearly a\n                    desire to prefer the defendant that influenced the granting of the\n                    Charge. 48     The case ofRe Sweetmart\n                        Garment Works Ltd (in liquidation)[2008] 2 HKLRD 92\n                        (“Re Sweetmart”) referred to by\n                    counsel for the plaintiffs, Mr Sarjit Singh Gill SC, is pertinent. A\n                    decision of the Hong Kong Court of First Instance, it concerned an application\n                    by the liquidators of a company to set aside a mortgage granted by the company\n                    over a pleasure craft owned by it to a creditor bank (“the Bank”)\n                    as an unfair preference within the meaning of s 50 of the Bankruptcy\n                    Ordinance. Section 50 of the Bankruptcy Ordinance isin pari\n                        materiawith s 99 of the BA. The Bank had sent various\n                    e-mails chasing the company to settle its outstanding facilities – but\n                    these were in vain. The Bank then threatened that the consequences of failure to\n                    make payment would be “serious”. One of its correspondence\n                    included a threat to issue a letter of demand on the company. This was compared\n                    to the action taken by several other creditor banks, who had all served formal\n                    letters of demand on the company. 49     The court inRe\n                        Sweetmartheld (at [29]) that the steps taken by the other banks\n                    were “more concrete, more serious, and instituted much more\n                    promptly” than those threatened by the Bank. Furthermore, the court held\n                    (at [30]) that given the company’s disastrous financial position, it\n                    could not have thought that it would be able to carry on business for any decent\n                    length of time so as to benefit from maintaining its relationship with the\n                    Bank. 50     Similarly, in the case at hand, the pressure\n                    exerted by the defendant pales in comparison with that exerted by the other\n                    banks that had already sent the Companies formal letters of demand (above at[30]). As for the defendant’s\n                    attempts to justify the grant of the Charge as being based on commercial\n                    reasons, the reasoning inRe Sweetmartis apropos:\n                    given JHTI’s overall indebtedness and the letters of demand that had been\n                    served on JHTI up to that point, JHTI could not possibly have envisaged carrying\n                    on its business for any decent length of time even if it had managed to avoid\n                    having the defendant issue a letter of demand. 51     Counsel for the defendant, Mr Ashok Kumar, made several arguments. First, he argued that the Charge was granted in order to avert the defendant recalling its facilities and allow the Companies to pursue and close the GEM Deal. (Ms Lin had testified that this deal, had it closed, would have possibly brought in US$160m for the Companies.) The GEM Deal would have been scuttled if the defendant had issued a letter of demand; thus, the Company was influenced by proper commercial considerations in granting the Charge. Furthermore, KBC, one of the two creditors that had served a letter of demand prior to the granting of the Charge, had agreed to a standstill arrangement with the Companies and not to do anything until the GEM Deal had carried through. It emerged at trial that the letter of demand from the other creditor, Rabobank, was never received by the Companies. 52     However, this contention was untenable. Realistically, it could not have been a proper commercial consideration to grant the Charge with a view to averting a declaration of default by the defendant when the Companies were heavily indebted to many other banks at the same time. JHTI could not possibly have expected them to wait patiently while the GEM Deal was pursued, and especially not after letters of demand had already been issued – much less after finding out about the Charge. 53     On cross-examination, Ms Khua agreed with\n                    counsel for the plaintiffs that if the other banks had found out about the\n                    Charge, the GEM Deal could not close. It may have been the case that KBC was\n                    willing to hold off until the closing of the GEM Deal; but that did not mean\n                    that the other creditors, Rabobank included, would have been willing to do so as\n                    well. Moreover, once the other creditors discovered that the defendant had been\n                    given the Charge, they would have applied either to wind up the company or to\n                    place it under judicial management so as to preserve their right to impugn the\n                    preference. In fact, it was only after the defendant had lodged the Charge\n                    for registration on 10 December 2008 that the other banks, namely, ABN AMRO,\n                    BTMU, Maybank and OCBC sent the Companies letters of demand. This is not\n                    surprising, as the banks would have found out about the Charge upon its\n                    registration. I therefore did not agree with defendant’s counsel that\n                    there were proper commercial considerations influencing the decision to grant\n                    the Charge. 54     It was also contended that there was pressure\n                    exerted on the Companies and that a clear threat was conveyed to them. Counsel\n                    for the defendant referred the court toLin Securities Pte v\n                        Royal Trust Bank (Asia) Ltd[1994] 3 SLR(R) 899\n                        (“Lin Securities”). There, a\n                    stockbroking firm (“LSP”) had made arrangements with Royal Trust\n                    Bank (Asia) Ltd (“RTB”) and 20 other banks to obtain credit\n                    facilities secured by the hypothecation of shares in its possession. Following a\n                    dramatic decline in the stock market, LSP became insolvent. The banks\n                    started to demand delivery of the shares charged to them but LSP, for the most\n                    part, managed to resist the demands. LSP gave in to pressure from RTB, however,\n                    and entered into an arrangement with RTB whereby the shares charged to RTB were\n                    to be handed to it to be kept in its custody each afternoon when trading closed\n                    and returned the following morning to allow the company to carry on its\n                    business. On one occasion, when LSP tried to re-take delivery of the shares in\n                    RTB’s custody, RTB refused to return the shares to LSP. LSP went into\n                    liquidation. The liquidator challenged the transaction as a fraudulent\n                    preference under s 329 of the 1994 Revised Edition of the Companies Act.\n                    That challenge failed both before the High Court and the Court of Appeal. The\n                    latter held that in entering into the arrangement with RTB, LSP had not acted\n                    with a view to preferring RTB over all other creditors. Instead, LSP was merely\n                    bowing to RTB’s business like, but effective, pressure or\n                threat. 55     Mr Ashok Kumar submitted that the case\n                    above illustrates that pressure can be exerted in more ways than one. In that\n                    case, a “clear message of a threat had been effectively conveyed to [LSP]\n                    in a businesslike manner without uttering any harsh language in the form of a\n                    threat or demand”:Lin Securitiesat\n                    [28]. However, the executive director of RTB had stated that LSP was aware that\n                    if he did not agree to the “request”, RTB would immediately\n                    terminate the facility and call for the payment of the amount owing. This was\n                    far from the situation in the case at hand where, in the face of other banks\n                    having taken more concrete steps to stress the seriousness of their demands,\n                    JHTI nevertheless chose to prefer the defendant over them. The case, therefore,\n                    is of little assistance to the present proceedings. 56     Thus, in conclusion, I was satisfied that JHTI\n                    was influenced by a desire to prefer the defendant.",
        "Was JHTI insolvent at the time the Charge was granted or did JHTI\n                become insolvent as a result of the granting of the Charge?": "57     Section 100(4) of the BA states that a person\n                    shall be “insolvent” for the purposes of s 100(2) if: (a)he is unable to pay his debts as they fall due;\n                            or (b)the value of his assets is less than the amount of\n                            his liabilities, taking into account his contingent and prospective\n                            liabilities. The first test above may be described as the “liquidity\n                    test”, while the second may be described as the “balance sheet\n                    test”:Leun Wah Electric Co (Pte) Ltd (in liquidation)\n                        v Sigma Cable Co (Pte) Ltd[2006] 3 SLR(R) 227\n                        (“Leun Wah”) at [8]. It is\n                    trite law that the two subsections of s 100(4) are to be read\n                    disjunctively:Velstra Pte Ltd (in compulsory winding up) v\n                        Azero Investments SA[2004] SGHC 251 at [89]. I shall\n                    apply each of these tests to the facts at hand in turn.",
        "The liquidity test": "58     InLeun Wah, the\n                    court found (at [8]) that the company was insolvent as it was “pressed\n                    for payments at the material time from many quarters and had not been able to\n                    pay”. There is sufficient evidence here that from as early as February\n                    2008, creditors had been pressing JHTI for payment. Though most of the demands\n                    were in the form of e-mail correspondence rather than letters of demand, I am of\n                    the view that there is no need for such demands to be made only by way of letter\n                    for the purposes of this test. 59     In that respect, I wholeheartedly agree with\n                    the proposition put forth by Professor Ian F Fletcher inThe\n                        Law of Insolvency(Sweet & Maxwell, 3rd Ed, 2002)\n                        (“The Law of Insolvency”) which\n                    was referred to by counsel for the plaintiffs. At para 20-017, Prof\n                    Fletcher states (in the context of discussing s 123(1)(e) of the English\n                    Insolvency Act 1986, which deals with the proof of a company’s inability\n                    to pay its debts as they fall due) that: As proof of the debtor company’s state of illiquidity, it will\n                        suffice to exhibit to the court some evidence- conveniently, often, in the\n                        form of correspondence – showing an unequivocal request for payment\n                        made by the creditor, and an absence of any bona fide dispute as to\n                        indebtedness on the part of the debtor. Here there was much in the way of correspondence from creditors,\n                    unequivocally requesting payment, and an absence of anybona\n                        fidedispute as to indebtedness on the part of\n                JHTI. 60     Furthermore, the cash balance of JHTI with its\n                    banks as at 13 November 2008 was in the negative. No evidence was provided\n                    by the defendant as to what specific assets of JHTI could have readily been sold\n                    in order for the proceeds to be taken into account for the purposes of the\n                    liquidity test; nor was evidence adduced as to the amount of such proceeds that\n                    ought to be taken into account. 61     The situation at hand may be best summarised\n                    thus: JHTI was unable to service its debts as and when they fell due, resulting\n                    in several creditors issuing letters of demand at the time the Charge was\n                    granted. I am therefore firmly of the view that JHTI was insolvent when it\n                    granted the Charge.",
        "The balance sheet test": "62     In view of the fact that the test in\n                    s 100(4) of the BA is disjunctive rather than conjunctive and that JHTI has\n                    failed the liquidity test, it is unnecessary to go into the balance sheet test.\n                    I shall nevertheless do so for the sake of completeness. 63     JHTI’s balance sheets as at\n                    30 September 2008 and 31 December 2008 indicated that JHTI was balance\n                    sheet solvent. However, the plaintiffs had, while investigating the financial\n                    affairs of the Companies, come across dubious accounting entries in the accounts\n                    of the Companies. The evidence of the plaintiffs was that had the errors in\n                    those accounting entries been taken into account at the time the balance sheets\n                    were prepared, it would have been evident that JHTI was balance sheetinsolventat the time the Charge was executed. When\n                    those accounting issues were brought to the attention of JHTI’s accounting\n                    staff, they proceeded to make adjustments to the accounts with the approval of\n                    the directors. The major adjustments were made to the accounts receivable,\n                    related party balances, stock and inventory. 64     InLeun Wah([57]supra), the court accepted the auditor’s\n                    recommendation that adjustments be made to the balance sheet of the company;\n                    this resulted in the company being insolvent on the balance sheet\n                test. 65     Counsel for the defendant contended that the\n                    directors’ view as to the solvency of the company at the time the balance\n                    sheets were prepared should not be displaced by the court on the basis of\n                    subsequent adjustments. This contention is untenable. The balance sheet test,\n                    applying s 100(4) of the BA, is simply whether the value of JHTI’s\n                    assets as at the balance sheet date was less than the amount of its liabilities,\n                    taking into account its contingent and prospective liabilities. The test is an\n                    objective one and not subject to the vagaries of the directors’ subjective\n                    views at that time, much less their erroneous views as demonstrated by their\n                    acceptance of the aforesaid adjustments. 66     Counsel for the defendant also submitted that\n                    whether JHTI was solvent or not had to be seen in the light of all the\n                    circumstances of the case; in particular, the solvency assessment had to\n                    take into account what was known or ought to have been known at the relevant\n                    time without the intrusion of hindsight. Counsel for the defendant relied upon\n                    the Australian case ofLewis (as liquidator of Doran\n                        Constructions Pty Ltd (in liq) v Doran & others[2005] NSWCA 243 (“Doran”)\n                    where Giles JA in the Court of Appeal of the Supreme Court of New South\n                    Wales held at [103]: ... Solvency or insolvency is a state on which directors and others act in\n                        current conduct, for example if the issue is trading while insolvent.\n                        Section 95A speaks of objective ability to pay debts as and when they become\n                        due and payable, but ability must be determined in the circumstances as they\n                        were known or ought to have been known at the relevant time, without\n                        intrusion of hindsight. There must of course be ‘consideration ...\n                        given to the immediate future’ (Bank of Australasia\n                            v Hall[1907] HCA 78; (1907) 4 CLR 1514\n                        at 1528 per Griffith CJ), and how far into the future will depend on the\n                        circumstances including the nature of the company’s business and, if\n                        it is known, of the future liabilities.Unexpectedlater discovery of a liability, or later\n                        quantification of a liability at an unexpected level, may be excluded from\n                        considerationif the liability was properly unknown or\n                            seen in lesser amount at the relevant time. ... [emphasis\n                        added in bold italics] I do not disagree with the statement and would draw attention to the\n                    qualifications built into the statement. In particular, later discovery of a\n                    liability or later quantification of a liability at an unexpected level may be\n                    taken into account if it was not “unexpected” or if it was not “properlyunknown or seen in lesser amount at the relevant\n                    time”. 67     Giles JA’s reference inDoranto an assessment made “without the\n                    intrusion of hindsight” was adopted and elaborated upon by Owen J inThe Bell Group Ltd (in liq) v Westpac Banking\n                        Corporation (No 9)[2008] WASC 239. At [1115]\n                    Owen J held that: ... when determining the company’s ability to pay, it must be done\n                        according to the circumstances or state of affairs which were known or\n                            ‘knowable’ at the time.\n                        [emphasis added] The learned judge went on to say at [1116] that: ...a court can take into account facts available in\n                            hindsight(that is, after the determinative date of solvency)if the facts help determine which version of\n                            conflicting accounts as to the state of affairs is the more\n                            likely. ... [emphasis added] Owen J then concluded at [1117] that: ... the court can apply its knowledge of post-event facts to determine\n                        whether the proffered expectations of the parties (the commercial realities\n                        with regard to cash flow) were or were not realistic. 68     The foregoing statements in the two Australian\n                    cases wereaproposthe liquidity test rather than\n                    the balance sheet test. Nevertheless, the views expressed in regard to the\n                    applicability or otherwise of subsequent facts are, in my opinion, equally\n                    applicable to the balance sheet test of solvency. However, as I stated earlier,\n                    they do not assist the defendant. It is clear from the evidence of the first\n                    plaintiff that the impugned entries in the balance sheets were unrealistically\n                    optimistic. When they were brought to the attention of the directors, they\n                    agreed to the adjustments without any demurrer. In my view, that showed that the\n                    earlier figures were not realistic and the adjustments were not\n                    “unexpected”. This can hardly be described as a case where\n                    hindsight was allowed to intrude. I am therefore of the view that JHTI was also\n                    insolvent on the balance sheet test.",
        "Conclusion": "69     In conclusion, the granting of the Charge by\n                    JHTI to the defendant was an unfair preference within the meaning of s 99\n                    of the BA. 70     Section 99(2) of the BA provides that the\n                    court shall, on an application under s 99, “make such order as it\n                    thinks fit for restoring the position to what it would have been if that\n                    individual had not given that unfair preference”. 71     Subsequent to the granting of the Charge, the\n                    MAP Shares were disposed of in two separate batches: (a)     in the first batch, S$570,439.49 was\n                        received as net sale proceeds; and (b)     in the second batch, approximately S$9.68m was received\n                        as net sale proceeds. Since I have found the grant of the\n                    Charge to be an unfair preference under s 99 of the BA, I hold that the\n                    defendant shall pay JHTI the total net sale proceeds received from the disposal\n                    of the MAP Shares. 72     Costs to the plaintiffs shall be taxed unless\n                    agreed."
    }
}