{
    "case_title": "Syed Ahmad Jamal Alsagoff (administrator of the estate of Noor bte\n                Abdulgader Harharah, (deceased) and others\n      v\n      Harun Bin Syed Hussain Aljunied (alias Harun Aljunied) and others and other\n                suits",
    "ncitation": "[2010] SGHC 347",
    "coram": "Belinda Ang Saw Ean J",
    "sections": {
        "Introduction": "1       The first defendant, Harun bin Syed Hussain\n                    Aljunied @ Harun Aljunied (“D1”), and the second defendant, Syed\n                    Abdulkader bin Syed Ali @ Syed Abdul Kader Alhadad (“D2”) applied\n                    to strike out three actions relating to three properties known as Nos 18, 20 and\n                    22 Upper Dickson Road, Singapore. The striking out applications in all three\n                    actions,viz, Summons No 2248 of 2010 in Suit 263\n                    of 2010, Summons No 2249 of 2010 in Suit 271 of 2010, and Summons No 2250 in\n                    Suit No 264 of 2010, were dismissed on 12 August 2010. The costs orders made on\n                    30 August 2010 required D1 and D2 to pay costs fixed at $20,000 plus reasonable\n                    disbursements for all three striking out applications. D1 and D2 have appealed\n                    against the orders. 2       Suit No 263 of 2010 (“Suit 263”)\n                    concerns the property known as No 20 Upper Dickson Road (“No 20”);\n                    Suit No 264 of 2010 (“Suit 264”) concerns the property know as No\n                    22 Upper Dickson Road (“No 22”), and Suit No 271 of 2010\n                    (“Suit 271”) concerns the property known as No 18 Upper Dickson\n                    Road (“No 18”). I shall refer to these three properties\n                    collectively as “the properties”. For convenience, the plaintiffs\n                    in the three actions are collectively referred to as “the 2010\n                    Plaintiffs”, and the three actions are collectively referred to as\n                    “the 2010 Proceedings”. 3       D1 and D2 are said to be the present trustees of\n                    the estate of Syed Ahmad bin Abdulrahman bin Ahmat Aljunied (“Ahmad\n                    Aljunied”). In 1994, the trustees of the estate of Ahmad Aljunied were\n                    supposedly Syed Salim Alhadad bin Syed Ahmad Alhahad (“Salim”);\n                    Syed Ahmad Alhadad bin Syed Abdulkadir Alhadad (“Ahmad”); Syed\n                    Jafaralsadeg bin Abdulkadir Alhadad (“Jafaralsadeg”); and Syed\n                    Ibrahim bin Adbulkadir Alhadad (“Ibrahim”). I shall refer to these\n                    four individuals collectively as “the former trustees”. D1 and D2\n                    in their Defence (Amendment No 2) pleaded that the former trustees were\n                    appointed trustees of the estate of Ahmad Aljunied by Order of Court dated 27\n                    November 1992 in Originating Summons No 1122 of 1992 (“OS\n                    1122/1992”). By that Order of Court dated 27 November 1992\n                    (hereafter referred to as “the 1992 Order”), the properties in\n                    question, amongst others, were vested in the former trustees subject to the\n                    trusts of the will of Ahmad Aljunied. 4       The third defendant, BMS Hotel Properties Pte\n                    Ltd (“BMS Hotel”) did not appear in the proceedings and was not\n                    represented. 5       In substance, there were two applications in\n                    each action before me: (a) an application for an interim injunction against D1\n                    and D2; and (b) an application to strike out the action. I was only required to\n                    decide on the striking out applications. The other applications for an interim\n                    injunction were amicably resolved between the parties on 12 August\n                    2010.",
        "The claims in the three actions (the 2010 Proceedings)": "6       The 2010 Plaintiffs have filed pleadings and\n                    affidavits setting out the following material facts. 7       By a Deed dated 27 December 1877, Kavena\n                    Koonjan Chitty granted the leasehold interest in the properties for a period of\n                    999 years to Moona Meyna Meyappa Chitty. In 1892, Ahmad Aljunied became the\n                    owner of the properties in fee simple subject to the 999-year leasehold interest\n                    (“the freehold reversion”). Ahmad Aljunied died in 1894. Over the\n                    years, the leasehold interest in the properties was assigned from time to time\n                    to different persons, the last assignment ended with the following individuals\n                    as lessees: (a)No 20: In 1969, the 999-year leasehold interest\n                            was assigned to Shaikh Ali bin Abdulgader Harharah\n                            (“Ali”). In 1973, Ali assigned one-third share in the\n                            leasehold interest of No 20 to his sister, Noor binte Abdulgader\n                            Harharah (“Noor”). Noor died on 12 December 1990. Ali\n                            died on 17 May 1997. Prior to his demise, he was the administrator\n                            of his sister’s estate. The present administrators of Noor’s\n                            estate are the first and second plaintiffs in Suit 263. The first\n                            plaintiff is Syed Ahmad Jamal Alsagoff (“Jamal”). The\n                            second plaintiff is Abdul Majid Omar Harharah. The third to sixth\n                            plaintiffs are the beneficiaries of Ali’s estate. The fifth\n                            plaintiff is Kamal bin Ali Harharah (“Kamal”). The fourth\n                            plaintiff, Kamiliah binte Ali Harharah and one Murtadha Abdulqader have\n                            applied for Letters of Administration in Probate No 71 of 1999. The\n                            application has been granted and estate duty has been paid. However, at\n                            the time Suit 263 was filed, the Grant of Letters of Administration had\n                            not been issued.(b)No 18: In 1969, the 999-year leasehold interest\n                            was assigned to Syed Mohamed bin Hashim bin Mohamad Alhabshi\n                            (“Mohamad”). Mohamad died on 18 August 1973. The\n                            first and second plaintiffs in Suit 271 are the daughters of Mohamad.\n                            The first plaintiff is Fatimah Mohamed Hashim Alhabshee\n                            (“Fatimah”). The second plaintiff is Buhaya Mohamed Hashim\n                            Alhabshee (“Buhaya”). The third to sixth plaintiffs are\n                            the derivative beneficiaries of the estate of Mohamad. Jamal is the\n                            plaintiffs’ attorney in the proceedings. As attorney, he has\n                            applied for Letters of Administration for the estate of Mohamad. He has\n                            been appointed Administrator of the estate, but the Grant of Letters of\n                            Administration had not been issued at the time Suit 271 was\n                            filed.(c)No 22: In 1969, the 999-year leasehold interest\n                            was assigned to Shaikhah Fitom binte Ghalib bin Omar Al-Bakri @ Fetum\n                            binte Galib (“Fitom”). Fitom died on 16 February\n                            1973. The first to fifth plaintiffs in Suit 264 are the derivative\n                            beneficiaries of the estate of Fitom. Jamal is the plaintiffs’\n                            attorney in the proceedings.8       In 1994, the former trustees purported to\n                    transfer the leasehold and freehold reversion in the three properties to BMS\n                    Hotel. The transfer was by an Indenture dated 12 May 1994 (“the\n                    Conveyance”). The consideration for the transfer was stated to be $1.4m,\n                    and the receipt of the consideration was acknowledged by the former trustees as\n                    vendors in the Conveyance. By a Deed of Rectification and Confirmation dated\n                    1 November 1994 (“the Confirmation”), the former trustees\n                    confirmed that they had conveyed to BMS Hotel the leasehold, and allowed the\n                    merger of the leasehold and the freehold reversion.9       The 2010 Plaintiffs’ case is that the\n                    former trustees had no legal basis to claim that they were vested with the\n                    leasehold interest in the properties. As such and to the extent the Conveyance\n                    and the Confirmation purported to assign the leasehold interest, the Conveyance\n                    and the Confirmation were executed fraudulently. Further or in the alternative,\n                    the Conveyance and the Confirmation were executed pursuant to a conspiracy by\n                    the former trustees among themselves and/or with BMS Hotel (by way of lawful\n                    and/or unlawful means) with the primary intention of causing loss to the 2010\n                    Plaintiffs and their predecessors-in-title by depriving them of the leasehold\n                    interest in the properties.10     The 2010 Plaintiffs also pleaded that the\n                    former trustees and BMS Hotel are liable to account to them as constructive\n                    trustees having intermeddled in the leasehold interest and with the trusts in\n                    respect of the estates of Noor and Ali, the estate of Fitom, and the estate of\n                    Mohamad.11     In relation to the claim against D1 and D2,\n                    the 2010 Plaintiffs say that since March 2010, D1 and D2 had interfered with the\n                    possession of the properties by demanding that the tenants and occupiers pay\n                    rental to them. In addition, D1 and D2 had also in their letter dated\n                    9 April 2010 to the solicitors of the 2010 Plaintiffs, M/s Mallal\n                    & Namazie, claimed to have taken possession of the properties. By their acts\n                    and conduct, D1 and D2 had acted fraudulently with the intention of depriving\n                    the 2010 Plaintiffs of their rights and estate in the leasehold interest.\n                    Furthermore, D1 and D2 are liable to account to the 2010 Plaintiffs as\n                    constructive trustees having intermeddled in the leasehold interest and with the\n                    trusts in respect of the estates of Noor and Ali, the estate of Fitom, and the\n                    estate of Mohamad.12     There is also an assertion that following the\n                    Conveyance of the freehold reversion to BMS Hotel, and of the fact that BMS\n                    Hotel had not derived title to the leasehold properties as the former trustees\n                    had no title or interest in the leasehold to pass to BMS Hotel, D1 and D2 as\n                    trustees of the estate of Ahmad Aljunied have no standing to assert any\n                    proprietary interest in the properties, whether of the reversionary interest or\n                    the leasehold interest.13     The 2010 Plaintiffs are seeking,inter alia, a declaration that the transfer of the\n                    leasehold to BMS Hotel by the former trustees was null and void, and that the\n                    third defendant, BMS Hotel, acquired no leasehold interest in the properties.\n                    The 2010 Plaintiffs are seeking an order to rectify the Register of Deeds by\n                    expunging and/or cancelling the entries in the Register in favour of BMS Hotel.\n                    The 2010 Plaintiffs also seek a declaration that D1 and D2 have intermeddled in\n                    the leasehold interest and/or the respective estates.14     The 2010 Proceedings made specific reference\n                    to the orders made at a pre-trial conference (“PTC”) in\n                    Originating Summons No 1234 of 1994 (“OS 1234/1994”) and\n                    Originating Summons No 1052 of 1995 (“OS 1052/1995”) on 28 May\n                    1999 (hereafter collectively referred to as“the May 1999 Orders”). As a consequential relief,\n                    the 2010 Plaintiffs have asked for the May 1999 Orders to be set aside. I shall\n                    explain the May 1999 Orders later.15     Separately, the 2010 Plaintiffs filed\n                    applications for an interim injunction against D1 and D2 to restrain them from\n                    interfering with the tenants and evicting them. The injunction applications were\n                    not heard as D1 and D2 gave their agreement in lieu of a court order that\n                    pending the resolution and/or final outcome of the 2010 Proceedings, they would\n                    not:(a)deal in any way with the unexpired 999-year\n                            leasehold interest in respect of Nos 18, 20 and 22 Upper Dickson Road;\n                            and(b)make any representation to any person or party,\n                            oral, written or by way of conduct or otherwise, that they have any\n                            right and/or estate in the abovementioned leasehold\n                        interest.16     As mentioned earlier, the third defendant, BMS\n                    Hotel, did not enter an appearance and was not represented in the 2010\n                    Proceedings. Mr Miza Namazie acts for the 2010 Plaintiffs. He explained\n                    that from the Instant Information company search obtained from the Accounting\n                    & Corporate Regulatory Authority (“ACRA”) on 15 April\n                    2010, BMS Hotel has no directors. Two of the directors had been disqualified\n                    from acting as directors because of persistent failures to hold Annual General\n                    Meetings and file Annual Returns of the company. The directors, who were also\n                    shareholders of the company, had been adjudicated bankrupts. As for the status\n                    of the company, the ACRA search revealed that the company was gazetted to be\n                    struck off.17     Mr Kirpal Singh represents D1 and D2.\n                    Their Defence was filed on 12 May 2010. It was amended twice, once on\n                    1 June 2010, and again on 16 July 2010. D1 and D2’s pleaded case\n                    is that the leases in respect of the properties were never assigned, and the\n                    parties in occupation are deemed to be in occupation without licence or consent;\n                    alternatively, the leases for a period of 999 years had terminated in that they\n                    were determined sooner for non-performance of the terms and conditions of the\n                    leases. In particular, the lessees were required to pay yearly rent of one\n                    Spanish dollar to the lessor, but in breach of covenant the yearly rent was not\n                    paid. In the circumstances, the leases were determined sooner. As for the\n                    non-payment of one Spanish dollar a year, the 2010 Plaintiffs say non-payment\n                    alone did not entitle the former trustee to forfeit the leases in the\n                    circumstances. See generallyAlwee Alkaff v Syed\n                        Jafaralsadegand others [1997]\n                3 SLR(R) 419.The relief claimed on the applications to strike out18     D1 and D2 filed applications to strike out the\n                    2010 Proceedings on grounds that the proceedings (a) did not disclose any\n                    reasonable cause of action; (b) were scandalous, frivolous or vexatious; and (c)\n                    were an abuse of process in the light of the May 1999 Orders. Mr Singh\n                    confirmed at the hearing that he was relying on abuse of process as his sole\n                    ground to strike out the 2010 Proceedings. Mr Singh emphasised in his\n                    skeletal submissions that the court was not asked to set aside the May 1999\n                    Order.19     The first argument on abuse of process is that\n                    the 2010 Proceedings were an abuse of process as the same issues there were\n                    already raised in OS 1052/1995 and struck out on 28 May 1999; and BMS Hotel\n                    was granted possession of the properties pursuant to a possession order made in\n                    OS 1234/1994 on 28 May 1999. Hence, the 2010 Proceedings amounted to a\n                    collateral attack against the May 1999 Orders. The second argument is that the\n                    matters raised in the 2010 proceedings should and could be resolved within the\n                    first proceedings. As such, it was an abuse of process to institute the 2010\n                    Proceedings. If that course had been taken, there would be no collateral attack\n                    against the May 1999 Orders. The two arguments will be examined in detail later\n                    on.The course of events in the first proceedings20     I propose to start with the background facts\n                    and events which led to May 1999 Orders. I should mention that Mr Namazie\n                    filed a Request dated 31 May 2010 to the Registrar whereby he requested\n                    that the non-electronic court files in respect of OS 1234/1994 and OS 1052/1995\n                    be made available to the Court for the hearing of the striking out applications.\n                    This was necessary in order to look at the history of the previous litigation in\n                    some detail. In doing so, I found it necessary to look at other court files as\n                    well. Besides, the 2010 Plaintiffs had referred to other proceedings involving\n                    the former trustees, and D1 and D2 had referred to the lineage of trustees and\n                    the court orders in question.21     In OS 1234/1994, BMS Hotel applied for\n                    possession of the properties on the ground that the persons in occupation were\n                    in occupation without licence or consent. Ali and those he represented\n                    (hereafter “the Ali Group”) were the first, sixth and seventh\n                    defendants. The Ali Group comprised of (a) Ali who represented himself in\n                    respect of his two-third share in No 20, and as administrator of the estate of\n                    Noor; (b) Ali as the administrator of the estate of Fitom in respect of No 22;\n                    and (c) Fatimah and Buhaya as beneficiaries of the estate of Mohamed in respect\n                    of No 18. Ali was their attorney in the proceedings. The second group of\n                    defendants, namely, the second to fifth defendants, were the former trustees. At\n                    the material time, the Ali Group was represented by Ms LJ Wong of\n                    M/s Toh Tan & Partners. Mr S B Shah represented the former\n                    trustees, and Mr Zaheer Merchant of M/s Martin & Partners\n                    represented BHS Hotel.22     OS 1052/1995 was commenced by the Ali Group to\n                    oppose OS 1234/1994. The defendants in OS 1052/1995 were the four former\n                    trustees and BMS Hotel. In OS 1052/1995, the Ali Group asked for the Conveyance\n                    and the Confirmation to be cancelled, and consequently for an order that the\n                    Registrar of Deeds be directed to cancel entries in the Register of Deeds\n                    relating to the Conveyance and Confirmation. In addition, the Ali Group sought a\n                    declaration that their leasehold interest in the properties had not been\n                    extinguished, and that there be an inquiry as to damages.23     At the material time, the Ali Group in OS\n                    1052/1995 was represented by Ms LJ Wong, and Mr Zaheer Merchant of\n                    M/s Martine & Partners represented BHS Hotel. I noted that Mr S B\n                    Shah represented the former trustees in OS 1234/1994 only. Another firm of\n                    lawyers, M/s L Pereira & Netto represented the former trustees in OS\n                    1052/1995.24     From my perusal of the court files in the\n                    previous proceedings, I noted that M/s Martin & Partners wrote to the\n                    Registrar on 12 March 1996 requesting that the hearing of the first\n                    proceedings listed for 18 and 19 March 1996 be adjourned pending the\n                    outcome of an appeal against the former trustees in another case involving\n                    different properties, namely, Originating Summons No 330 of 1995 (“OS\n                    330/1995”). The reason given in the letter was that the former trustees\n                    in defending OS 1052/1995 were relying on the same arguments raised by the\n                    former trustees in OS 330/1995. The arguments referred to in the letter were:\n                    (a) the head leases were void for non registration; and (b) reliance on an Order\n                    of Court in Petition Suit 304 of 1895 as proof that the leasehold interest in\n                    the properties vested in Ahmad Aljunied. The letter went on to explain that BMS\n                    Hotel’s case in OS 1234/1994 was, in turn, dependent on the former\n                    trustees’ case as BMS Hotel’s claim to title was derived from the\n                    former trustees. Chao Hick Tin J (as he then was) had ruled against the\n                    former trustees on 15 January 1996, and the former trustees had appealed\n                    against the decision in Civil Appeal No 10 of 1996. The March hearing dates were\n                    duly vacated.25     At the hearing of the Civil Appeal No 10 of\n                    1996, the former trustees filed Notice of Motion No 194 of 1996 to raise for the\n                    first time the issue that the respondent was no longer alive, and thus could not\n                    have authorised her representative to commence OS 330/1995. Civil Appeal No 10\n                    of 1996 was adjourned until the Notice of Motion was dealt with. At a pre-trial\n                    conference (“PTC”) held on 24 August 1996, the lawyers\n                    representing the different parties in Os 1234/1994 and OS 1052/1995 agreed to\n                    further adjourn the hearing of the first proceedings until after Civil Appeal No\n                    10 of 1996 has been heard. The Court of Appeal dismissed the appeal and affirmed\n                    Chao J’s decision on 11 November 1998.26     Several PTCs were called since the hearing of\n                    the first proceedings was adjourned in March 1996. At a PTC held on 28 May\n                    1999, the Registrar, Mr Chiam Boon Keng, dismissed OS 1052/1995, and gave\n                    an order in terms of OS 1234/1994 which granted BMS Hotel possession of the\n                    properties. I saw from the Registrar’s Notes of Arguments that at the PTC\n                    held on 28 May 1999, Mr Merchant informed the Registrar of the absence\n                    of Ms Wong of M/s Toh & Partners that morning; she was also absent\n                    at the last PTC even though she was informed of the hearing by Mr Shah.\n                    Mr Merchant asked that OS 1052/1995 be stuck out for want of prosecution\n                    over the last two and a half years. Ms Netto who represented the former\n                    trustees in OS 1052/1995 also wanted the proceedings struck out with costs for\n                    the same reason. As for OS 1234/1994, Mr Merchant also informed the\n                    Registrar of Mr Shah’s absence at the morning’s PTC even though\n                    the latter was aware of the PTC hearing; that OS 1052/1995 and OS 1234/1994 were\n                    to be heard together; and that if OS 1052/1995 failed, BMS Hotel must be given\n                    an order-in-terms of the prayers in OS 1234/1994. He also asked for\n                    costs.27     The Registrar struck out OS 1052/1995 with\n                    costs, and gave an order-in-terms of the prayers in OS 1234/1994. The May 1999\n                    Orders were default orders made in the absence of counsel at the PTC. This is\n                    apparent on the face of the May 1999 Orders. In the case of (a) OS 1234 of 1994,\n                    counsel for the BMS Hotel (Mr Merchant) attended the PTC held on\n                    28 May 1999, and in the absence of counsel for the Ali Group (Ms Wong)andcounsel for the former trustees\n                    (Mr Shah), the Registrar allowed BMS Hotel’s application for\n                    possession of the properties; and (b) OS 1052/1995, counsel for the former\n                    trustees (Ms Netto) and BMS Hotel (Mr Merchant) attended the PTC held\n                    28 May 1999, and in the absence of the counsel for the Ali Group (Ms Wong),\n                    the Registrar struck out the proceedings. It is clear to me that the May 1999\n                    Orders were made under O 34A r (6) (1) of the Rules of Court\n                    (Cap 322, Rev Ed 1997). Order 34A r 6 reads as follows:6.- (1)    If, at the time appointed for the pre-trial\n                            conference, one or more of the parties fails to attend, the Court may\n                            dismiss the action or proceedings or strike out the defence or\n                            counterclaim or enter judgment or make such order as the Court thinks\n                            fit.(2)    An order made by the Court in the absence of a\n                            party concerned or affected by the order may be set aside by the Court,\n                            on the application of that party, on such terms as it thinks\n                            just.(3)    Without prejudice to the preceding paragraphs of\n                            this Rule, where one or more of the parties to the action or proceedings\n                            fails to attend the pre-trial conference, the Court may, if it thinks\n                            fit, adjourn the conference.28     Ali died in May 1997. Ali was the prime mover\n                    of the proceedings in his personal capacity, as administrator and as attorney\n                    for his named principals, and with his passing the proceedings in OS 1052/1995\n                    floundered as there was no one with authority who could give instructions to the\n                    lawyers on record for the Ali Group. In August 1999, Ali’s son, Kamal as a\n                    beneficiary of Ali’s estate, applied to be made a party to OS 1052/1995\n                    and OS 1234/1994, and to set aside the May 1999 Orders. By then Ms Wong had\n                    left M/s Toh Tan & Partners to set up her own firm of M/s LJ Wong\n                    & Yeo. Ms Wong acted for Kamal, and she filed, on his behalf, Summons\n                    No 4805 of 1999 in OS 1234/1994, and Summons No 4961 of 1999 in OS 1052/1995.\n                    Both summonses were heard by Lai Siu Chiu J. It appeared that Ms Wong\n                    had overlooked the PTC fixed for 28 May 1999. Mr Shah was ill and he did\n                    not attend the PTC. Ms Wong explained that had she not overlooked the PTC\n                    date, she would have attended as an officer of the court even though Ali had\n                    died and there was no one with authority who could give her instructions.\n                    Lai J allowed Kamal’s application made in his capacity as a\n                    beneficiary of Ali’s estate to be added as a party to OS 1234/1994 and OS\n                    1052/1995. Lai J also set aside the May 1999 Orders in so far as they\n                    related to Ali’s share of No 20.29     Mr Singh accepted that the May 1999\n                    Orders were only set side in so far as it related to Ali’s share of No 20,\n                    and they remained in force in respect of No 18 and No 22, and the one third\n                    share of No 20 owned by Noor’s estate. Lai J directed that pending\n                    registration of Powers of Attorney in favour of Kamal from the beneficiaries of\n                    Fitom’s estate, the May Orders in respect of No 22 were to stand. The\n                    Power of Attorney was to be registered by 30 September 1999. No Power of\n                    Attorney was registered by 30 November 1999. The other direction was for the\n                    solicitors on record for the former trustees (who were bankrupts) to notify the\n                    Official Assignee of the existence of the first proceedings. Ms Netto and\n                    Mr Shah separately wrote to the Official Assignee. On 1 September\n                    1999, Ms Netto informed the Official Assignee that the former trustees had\n                    been declared bankrupts. As such, she was discharging her firm from further\n                    representation and requested the Official Assignee to take over the conduct of\n                    OS 1052/1995. Mr Shah wrote a similar letter to the Official Assignee on\n                    8 September 1999 in respect of OS 1234/1994.30     No Power of Attorney was registered by 30\n                    September 1999. Kamal did not take any further steps in the first proceedings\n                    after obtaining on 18 August 1999 and 2 September 1999 (a) leave to be added as\n                    a party to OS 1052/1995 and OS 1234/1994, and (b) an order setting aside the May\n                    Orders in respect of Ali’s interest in No 20.Should the 2010 Proceedings be struck out?31     The first proceedings were brought by way of\n                    originating summonses. It is therefore reasonable to assume that the questions\n                    at issue were likely to be one of construction of some deeds or other documents,\n                    or some question of law, or there were unlikely to be any substantial dispute of\n                    fact. The reliefs sought by the Ali Group in OS 1052/1995 related to the issue\n                    of ownership of the leasehold properties: Was the leasehold owned by the Ali\n                    Group or Ahmad Aljunied? If the leases were owned by the Ali Group, was there\n                    early termination of the leases? In the first proceedings, the former trustees\n                    claimed that Ahmad Aljunied owned the leasehold interest for the reasons\n                    explained in the former trustees’ affidavit filed in OS 1052/1995: (a) The\n                    leases (lots 43 and 44) granted by Kavena Koonjan Chitty to Moona Meyna Meyappa\n                    Chitty (“the head leases”) were void for non-registration. (b)\n                    Reliance on an Order of Court in Suit No 304 of 1895 as proof of Ahmad\n                    Aljunied’s acquisition of the leasehold interest in the properties. (c)\n                    The sub-division of the lots 43 and 44 into three lots, and the assignments of\n                    the two leases, one for lot 43 and the other for lot 44, to three persons\n                    – Ali, Mohamad and Fitom – was bad in law (in that no privity\n                    existed between the reversioner and the assignees), and in a breach of the terms\n                    of the head leases; and/or the sub-divisions were without the consent and/or\n                    authority of the lessor. (d) Forfeiture was a ground mentioned by BMS Hotel. The\n                    head leases were forfeited for non- payment of annual rent of “one\n                    Spanish dollar” by Moona Meyna Meyappa Chitty. OS 1234/1994 was an\n                    application for possession of the properties.32     The claims in the 2010 Proceedings are also\n                    related to the issue of ownership of the leasehold interest in the properties,\n                    and early termination of the leases for non-payment of the annual rent of\n                    “one Spanish dollar”. D1 and D2 pleaded as their defence the same\n                    four issues (a) - (b) referred to in[31]above, and asserted that they have rights under the head leases as the rightful\n                    reversioners. The 2010 Proceedings go further to allege fraud in the execution\n                    of the Conveyance and conspiracy amongst the former trustees and/or BMS Hotel to\n                    deprive the 2010 Plaintiffs and/or the Ali Group of the leasehold properties.\n                    Notably, fraud was not raised against the former trustees in the first\n                    proceedings. The former trustees are still bankrupts. The 2010 Plaintiffs have\n                    stated in their pleadings that they would join the former trustees as parties if\n                    and when necessary. They have also reserved the right to supplement the\n                    particulars of fraud and/or conspiracy after discovery and/or\n                    interrogatories.33     BMS Hotel is the third defendant in the 2010\n                    Proceedings. The declaration sought in the first proceedings and in the 2010\n                    Proceedings is that the Ali Group’s leasehold interest in the properties\n                    had not extinguished, and that the Conveyance and Confirmation executed by the\n                    former trustees in favour of BMS Hotel was null and void and of no effect.\n                    Consequently, the entries in favour of BMS Hotel in the Register of Deeds are to\n                    be expunged and/or cancelled.34     In the 2010 Proceedings, the plea against D1\n                    and D2 is for fraud and intermeddling with trust property. D1 and D2 deny the\n                    allegation of fraud and conspiracy maintaining that the sale of the properties\n                    to BMS Hotel by way of the Conveyance and Confirmation was correctly executed.\n                    D1 and D2 also pleaded that the May 1999 Orders gave rise to cause of estoppel\n                    and/or issue estoppel. As explained in their joint affidavit, D1 and D2 are not\n                    disavowing the former trustees’ sale and Conveyance to BMS Hotel. In fact,\n                    they affirmed in their joint affidavit that the Conveyance was correctly\n                    executed, and the court agreed as well because OS 1052/1995 was struck out, and\n                    the possession order was granted to BMS Hotel in OS 1234/1994. The Conveyance\n                    and Confirmation executed by the former trustees in favour of BMS Hotel was for\n                    the estate in fee simple after determination of the leasehold interest and the\n                    extinguishment of the reversion and the merging of the two titles as estate in\n                    fee simple.35     D1 and D2 pleaded that $500,000 of the sale\n                    consideration was and is still owed by BMS Hotel, and the latter had asked D1\n                    and D2 to collect rental to offset the money owing to D1 and D2. In the\n                    circumstances, it was the 2010 Plaintiffs rather than D1 and D2 who had\n                    intermeddled in the affairs of the properties.36     In my view, nores\n                        judicataor issue estoppel applies in relation to the claims to\n                    ownership of the leasehold properties, early termination of the leases, and the\n                    common issues (a) - (d) referred to in[31]above. There was no adjudication upon those issues in the first proceedings. The\n                    real question I have to address here is whether it is an abuse of process to\n                    seek to litigate in the 2010 Proceedings the claims to ownership of the\n                    leasehold properties, early termination of the leases, and the common issues (a)\n                    - (d), which were raised, but not adjudicated upon in OS 1052/1995, and where OS\n                    1052/1995 had itself been struck out under O34A r 6(1). I should point out that\n                    this is a different question from the question whether a party should be allowed\n                    to raise in the subsequent proceedings issues which have been raised in earlier\n                    proceedings but laid to rest as the result of a decision to withdraw the issues.\n                    To this end, the case ofSetiadi Hendrawan v OCBC Securities\n                        Pte Ltd[2001] 3 SLR(R) 296 cited by Mr Singh is\n                    irrelevant and does not assist him.Re-litigation of the issues raised (but no adjudicated upon) in OS\n                1052/1995 which had been struck out37     I now turn to the question whether it is an\n                    abuse of process to seek to litigate in the 2010 Proceedings the claims to\n                    ownership of the leasehold properties, early termination of the leases and the\n                    common issues (a) - (d) raised (but not adjudicated upon) in OS 1052/1995 which\n                    was itself struck out.38     Generally, default judgments are capable of\n                    giving rise to the application of issue estoppel. However, it is necessary to\n                    scrutinise the default judgment carefully in order to see precisely what was\n                    decided. Lord Radcliffe inKok Hoong v Leong Cheong Kweng\n                        Mines Ltd[1964] AC 993 said at p 1012 in relation to\n                    the reinterpretation of an earlier decision by the court inNew Brunswick RailwayCov British &\n                        French Trust Corporation[1939] AC 1:This reinterpretation amounts to saying that default judgments, though\n                        capable of giving rise to estoppels must always be scrutinised with extreme\n                        particularity for the purpose of ascertaining the bare essence of what they\n                        must necessarily have decided and, to use the words of Lord Maugham LC\n                        ([1939] AC 1 at p 21), they can estop only for what must\n                        “necessarily and with complete precision” have thereby\n                        determined.39     In my view, it cannot be said that the May\n                    1999 Orders “necessarily and with complete precision” decided the\n                    claims to ownership of the leasehold properties, early termination of the\n                    leases, and the common issues (a)-(d). They were not adjudicated upon in OS\n                    1052/1995 because those proceedings were struck out under O 34A r 6(1). How OS\n                    1052/1995 came to be struck out is also relevant in the exercise of discretion\n                    whether or not to strike out the 2010 Proceedings. The events that led to the\n                    striking out of OS 1052/1995 are set out at[22]to[27]above. It is\n                    important to keep in mind that (a) an order-in-terms of the prayers in OS\n                    1234/1994 was granted in the absence of Mr Shah (for the former trustees)\n                    and Ms Wong (for the Ali Group) at the PTC held on 28 May 1999; and (b) OS\n                    1052/1995 was struck out because Ms Wong did not attend the same PTC. In\n                    making the default orders, the court did not extinguish the Ali Group’s\n                    claims to ownership of the properties. This point is reinforced by O 34A r 2\n                    which provides that the default orders made under r 1 may be set aside on the\n                    application of the party concerned. Put simply, D1 and D2 cannot set up issue\n                    estoppel in the face of O34A r 6(2). Accordingly, the mere commencement of the\n                    2010 Proceedings, in the circumstances, is not an abuse of\n                process.Duplicitous proceedings40     Mr Singh’s second argument is that\n                    it was not an appropriate course to commence the 2010 Proceedings because\n                    procedurally, the matters in dispute must be resolved within the first\n                    proceedings. In other words, the 2010 Proceedings were unnecessary and\n                    duplicitous since the issues that were raised in the 2010 Proceedings could have\n                    been resolved within the first proceedings. Mr Singh citedHong Hin Kit Edward v PT Nusautama Medicalindo[2010] SGHC 192, a decision of Choo Han Teck J in support of his\n                    contention, and in particular, Choo J’s observations at [14]:I was of the view that this suit was totally unnecessary because all the\n                        claims of the plaintiff were matters that could be and should be determined\n                        in the prior actions. It would be more appropriate to amend the existing\n                        actions to add the necessary parties and the new prayers because the facts\n                        leading to the dispute as well as the facts in this action overlap. The\n                        parties ought to choose a course that is least likely to result in confusion\n                        or conflicting findings of fact.41     Applying the same reasoning, Mr Singh\n                    argued that the 2010 Plaintiffs should have applied to (a) join the 2010\n                    Plaintiffs as parties in the first proceedings in order to establish their\n                    rights to the properties, and (b) set aside the May 1999 Orders in the first\n                    proceedings (ie, OS 1052/1995 and OS 1234/1994).\n                    By commencing the 2010 Proceedings, the 2010 Plaintiffs had ignored the May 1999\n                    Orders. Their failure to follow the proper procedure by commencing the 2010\n                    Proceedings was an abuse of process and should not be allowed.42     It is not controversial that where proceedings\n                    based on a particular cause of action are in existence, it isprima faciean abuse of process to bring a second action based\n                    on the same cause of action, and the latter action between the same parties is\n                    liable to be struck out (seeBuckland v Palmer[1984] 1 WLR 1109;The Silver Athens[1986] 2 Lloyds Rep 580). Put another way, it is abusing the process\n                    of the court to bring a new action without good reason if the matters can be\n                    resolved within an existing action. However, if in the circumstances of the\n                    case, there is good reason to justify the commencement of the new action, the\n                    court has discretionary power to permit the new action to proceed. The burden is\n                    on the party bringing the new action to justify it – the party must show\n                    good grounds that the dispute is best raised in the new proceedings rather than\n                    proceed in the existing action. If the new action is allowed to proceed, to\n                    avoid duplicity of proceedings, the existing and new actions could be\n                    consolidated, or the existing action could be permanently stayed. An election as\n                    to which set of proceedings to maintain is also an option.43     Paragraph 20 of the joint affidavit of Jamal\n                    and Kamal filed on 3 June 2010 in Suit 263 sets out the reasons for\n                    bringing the 2010 Proceedings rather than proceed with the first proceedings.\n                    The same reasons are being advanced in Suit 264 and Suit 271. Paragraph 20\n                    states:It is no longer viable to proceed with OS No 1234/1994 and OS\n                        1052/1995 for the following reasons:(a)The parties are now very different. When OS No\n                                1234/1994 and OS No 1052/1995 were taken out, there were essentially\n                                3 persons who represented the 3 properties at Nos 18, 20 and 22\n                                Upper Dickson Road. The property at No 20 was represented by Ali\n                                (both in his personal capacity and as the administrator of Noor, who\n                                together owned the entire said Property). The property at No 22 was\n                                also represented by Ali (who was the administrator of Fitom’s\n                                estate). As to No 18, the said property was represented by Fatimah\n                                Mohamed Hashim and Buhaya Hashim Allhabshee, two of the\n                                beneficiaries of the estate of Mohamad who together had a\n                                [two-third] share in the said property. Owing to the death of Ali,\n                                and with the inclusion of the beneficiaries and administrators of\n                                the estates which own the 3 properties, the parties are now very\n                                different from those in OS Nos 1234/1994 and OS No\n                            1052/1995.(b)There is uncertainty as to what has happened\n                                in OS Nos 1234/1994 and OS No 1052/1995. This uncertainty has been\n                                highlighted above. Due to this uncertainty, it became difficult to\n                                ascertain exactly what needed to be done in order to proceed with\n                                the matter.(c)Since 1999, the facts pertaining to the 3\n                                properties have developed differently. This difference is partially\n                                due to the obtaining of Grants of Letters of Administration in the\n                                estates which own the 3 properties. It is also partially due to the\n                                difference in the occupation of the 3 properties. In respect of No\n                                20 Upper Dickson Road, control and possession of the said property\n                                has ALWAYS been with Ali, and then to [Kamal] and then to [Jamal].\n                                The Defendants and the Former Trustees have NEVER been in control or\n                                possession of the said premises.44     The reasons above are but one aspect of all\n                    the relevant facts and circumstances to be scrutinised to see if there was any\n                    abuse in not resolving the matters advanced in the 2010 Proceedings within the\n                    first proceedings. I have to also consider the state of affairs in the first\n                    proceedings, the other complexities that related to the status and capacity of\n                    the former trustees in the first proceedings (which I will explain later)\n                    including the allegations against D1 and D2 for interfering with the tenants and\n                    the interests of the 2010 Plaintiffs in the March 2010. In the exercise of\n                    discretion whether to allow the 2010 Proceedings to proceed or not, it is always\n                    necessary to look at the history of the litigation in some detail. The bundles\n                    which the parties prepared for the hearing referred to other proceedings, and it\n                    was necessary for me to read the relevant court files as well.45     The 2010 Proceedings started in April 2010 in\n                    circumstances which were understandable. Significantly, BMS Hotel did not\n                    enforce the possession order of 28 May 1999. D1 and D2 admitted in pleadings\n                    that BMS Hotel did not have possession of the properties. In fact, even after\n                    the May 1999 Orders, the status quo with the tenants and occupiers remained in\n                    limbo and did not change for over 11 years. The properties continued to be\n                    occupied by the same tenants and occupiers who continued to pay rent to those\n                    representing the Ali Group. Before his death, Ali was the rent collector for all\n                    three properties. Ali as agent collected rent for the lessees of No 18 and 22.\n                    Apart from rent, property tax was paid by and for the estates and the\n                    beneficiaries asserting a leasehold interest in the properties. However, in\n                    March 2010, D1 and D2 (and not BMS Hotel) surfaced, and they informed the\n                    tenants and occupiers of the properties to pay them the rental. In addition, D1\n                    and D2 claimed to have taken possession of the properties. The tenants and\n                    occupiers also received a notice of eviction from D1 and D2.46     To stop D1 and 2 from interfering with the\n                    tenants and occupiers, the 2010 Plaintiffs sued in April 2010, and applied for\n                    an interim injunction. Against this backdrop, the commencement of the 2010\n                    Proceedings was, in the circumstances, understandable. But were the 2010\n                    Proceedings also justified in the circumstances of this case?47     I reached the conclusion that the commencement\n                    of the 2010 Proceedings was justified in the circumstances of this case. In my\n                    view, the facts and circumstances of the present case were exceptional so as to\n                    afford good reason for the commencement of the 2010 Proceedings. There were\n                    special features about this case that showed that the matters raised in the 2010\n                    Proceedings could not resolved within the first proceedings as those features\n                    added to the complexity that now exists. The first feature concerned the state\n                    of affairs in the first proceedings. The second feature concerned the\n                    allegations of fraud pleaded in the 2010 Proceedings. Fraud was not raised in\n                    the first proceedings against the former trustees. Third, the 2010 Plaintiffs\n                    sued D1 and D2 for interfering with the tenants and the interests of the 2010\n                    Plaintiffs. Finally, the proof of debt filed by BMS Hotel and the unpaid balance\n                    sale proceeds of $500,000 by BMS Hotel. Having regard to all the facts and\n                    circumstances of the case, I decided to exercise my discretion to allow the 2010\n                    Proceedings to proceed since starting afresh was the more appropriate course for\n                    the just, expeditious and economical disposal of the matters in dispute. By\n                    comparison, the first proceedings as it turned out would be ill-suited to\n                    resolve the intervening events and developments in the case. I will now\n                    elaborate on my decision.48     One should keep in mind the meaning of the\n                    term “abuse of process” in O 18 r 19(1)(d) which was given a wide\n                    interpretation inGabriel Peter & Partners v Wee Chong\n                        Jin[1997] 3 SLR(R) 649 at [22]:The term, “abuse of the process of the Court”, in O 18 r\n                        19(1)(d), has been given a wide interpretation by the courts. It includes\n                        considerations of public policy and the interests of justice. This term\n                        signifies that the process of the court must be usedbona\n                            fideand properly and must not be abused. The court will\n                        prevent the improper use of its machinery. It will prevent the judicial\n                        process from being used as a means of vexation and oppression in the process\n                        of litigation. The categories of conduct rendering a claim frivolous,\n                        vexatious or an abuse of process are not closed and will depend on all the\n                        relevant circumstances of the case.49     As a reminder, Mr Singh’s second\n                    argument is that the first proceedings could be continued by the inclusion of\n                    the 2010 Plaintiffs as parties to the proceedings, and the setting aside of the\n                    May 1999 Orders. The matters in dispute in the 2010 Proceedings were the same as\n                    those put in issue in OS 1052/1995, and hence, could be resolved within the\n                    first proceedings. The 2010 Proceedings were unnecessary, and as matters stood,\n                    there was duplicity of proceedings in relation to the disputes to be resolved. I\n                    disagreed.50First, the\n                    institution of new proceedings is not of and in itself enough to constitute an\n                    abuse as described in the above passage fromGabriel Peter\n                        & Partners v Wee Chong Jinunless the court’s processes\n                    are being misused to achieve something not properly available to the plaintiff.\n                    Put another way, it is abusing the process of the court to bring a new action\n                    without good reason if the matters can be resolved within an existing\n                    action.51     I earlier concluded that the institution of\n                    the 2010 Proceedings was not a collateral attack on the May 1999 Orders since no\n                    cause of action or issue estoppel arose from the May 1999 Orders (see[31]to[39]above). I have already explained that the institution of the 2010 Proceedings\n                    was understandable (see[45]to[46]above). The conduct of the 2010 Plaintiffs in\n                    using the 2010 Proceedings to obtain an interim injunction against D1 and D2 did\n                    not give rise to the inference that the proceedings werenotinstituted as proceedings intended to be genuinely pursued.\n                    Pleadings in the 2010 Proceedings have closed; D1 and D2 amended their defence a\n                    second time on 16 July 2010 before the adjourned hearing of the striking out\n                    applications on 12 August 2010.52     I did not agree with Mr Singh’s\n                    submissions that the 2010 Plaintiffs in commencing the 2010 Proceedings had\n                    ignored the May 1999 Orders. In their Statement of Claim, a consequential relief\n                    was sought for the May 1999 Orders to be set aside. The trial judge would have\n                    to deal with the consequential relief as part and parcel of the resolution of\n                    the substantive dispute pertaining to,inter alia,\n                    ownership of the leasehold interest, the alleged early termination of the\n                    leases, the purported sale to BMS Hotel of the leasehold interest including the\n                    allegation of fraud and/or conspiracy on the part of the former trustee, and the\n                    present trustees’ (D1 and D2) claim to possession of the properties. Put\n                    simply, the substantive dispute is to be resolved first. If the dispute is\n                    resolved in favour of the 2010 Plaintiffs, the trial judge would make\n                    appropriate orders to set aside the May Orders and cancel their registrations in\n                    the Registry of Deed as well as give directions to put to rest the first\n                    proceedings.53Second, contrary\n                    to Mr Singh’s argument, the matters to be adjudicated upon in the\n                    2010 Proceedings could not be easily resolved within the first proceedings by\n                    the 2101 Plaintiffs making a simple application in the first proceedings for an\n                    order under O 28 r 8 that OS 1052/1995 is to continue as if it had been begun by\n                    writ, and to seek directions for the service of pleadings. With Ali’s\n                    death and the bankruptcy of the former trustees coupled with certain\n                    developments in 1998, the state of affairs in the first proceedings became\n                    somewhat complicated, and thus ill-suited for an application under O 28 r 8. By\n                    comparison, the 2010 Proceedings, as a matter of procedure, is the more\n                    appropriate course because of complexity. I will now deal with the various\n                    complications that mired the first proceedings.(a)   Death and bankruptcy of the parties54     Order 15 r 7 deals with (a) the death of a\n                    party; (b) the bankruptcy of a party; and (c) the assignment, transmission and\n                    devolution of the interest or liability of a party. Ali was defending in OS\n                    1234/1994, and suing in OS 1052/1995 in his personal capacity and as\n                    administrator of two estates and as attorney of two principals. In this case,\n                    Ali died and O 15 r 7 applies in so far as the proceedings related to\n                    Ali’s interest and in his capacity as administrator of two estates. Rule\n                    7(1) applies to a case where the cause of action “survives or\n                    continues” in some person on whom the estate has devolved, and that\n                    person has been joined in the proceedings under r 7(2) and is thus properly\n                    before the court. Before that happens (ie,\n                    joinder) the action cannot continue until the proper party is joined and before\n                    the court.55     In so far as Ali’s principals (Fatimah\n                    and Buhaya) were concerned, the position in OS 1052/1995 was different.\n                    Strictly, the death of their attorney did not prevent the proceedings from\n                    continuing after the voluntary stay of proceedings pending the outcome of Civil\n                    Appeal No 10 of 1996. The Court of Appeal affirmed Chao J’s decision on 11\n                    November 1998. However, by 11 November 1998, something else happened. The last\n                    of the remaining former trustees, Ahmad Alhadad was declared a bankrupt on 30\n                    October 1998. Fatimah and Bubaya (who were the second and third plaintiffs in OS\n                    1052 of 1995, and the sixth and seventh defendants in OS 1234 of 1994) could not\n                    have continued with the proceedings because of the bankruptcy of the former\n                    trustees, or their removal as trustees in February 1998.56     After Ali’s death, three of the former\n                    trustees became bankrupts. Jafaralsadeg, Salim and Ahmad were declared bankrupts\n                    on 16 January 1998, 26 June 1998 and 30 October 1998 respectively. Ibrahim was\n                    made a bankrupt on 13 September 1996. As bankrupts, the former trustees were\n                    disqualified from acting as trustees. OS 1052/1995 and OS 1234/1994 could not\n                    have continued against the former trustees in their capacity as trustees after\n                    their bankruptcy without leave of court. This is clear from s 130(1) of the\n                    Bankruptcy Act (Cap 20, 1996 Rev Ed) which provides as follows:In addition to any disqualification under any other written law, a\n                        bankrupt shall be disqualified from being appointed or acting as a trustee\n                        or personal representative in respect of any trust, estate or settlement,\n                        except with leave of court.57     Upon disqualification, the bankrupt trustee\n                    must cease to act as trustee. If he continues to act whilst disqualified, the\n                    bankrupt trustee would be committing an offence which carries a jail term and\n                    fine. Under subsection (3), any person who acts as a trustee or personal\n                    representative while he is disqualified by virtue of subsection (1) shall be\n                    guilty of an offence and shall be liable on conviction to a fine not exceeding\n                    $5,000 or to imprisonment for a term not exceeding 12 months or to\n                both.58     As can be seen, the former trustees could\n                    continue to defend the first proceedings if leave to act as trustees was granted\n                    under s 130(1). Otherwise, new trustees would have to be appointed, and\n                    substitution of parties applied for under O 15 r 7(2). Until such time, the\n                    former trustees were incompetent to act, and had no standing to defend the\n                    proceedings.59     D1 said that he and Sharifah Fatimah were\n                    appointed new trustees of the estate of Ahmad Aljunied by Order of Court dated\n                    10 February 1998 in Originating Summons No 69 of 1998 (“the February\n                    1998 Order”). I pause to mention that the February 1998 Order vested\n                    properties previously held in trust for the estate of Ahmad Aljunied by the\n                    former trustees in favour of the new trustees. Hence, evidence of the transfer\n                    of the legal estate by way of the vesting order must be registered. However, the\n                    February 1998 Order was not registered until 25 November 2009. The\n                    significance of registration is that unless so registered, there is no\n                    admissible evidence of their interest in the properties under s 4 of the\n                    Registration of Deeds Act (Cap 269,1989 Rev Ed). Section 4\n                    states:... all assurances ... and all probates and letters of administration ...\n                        by which any land in Singapore is affected ... may be registered ... and\n                        unless so registered shall not be admissible in any court as evidence of\n                        title to such land.Notably, in s 2, “assurance” is defined as\n                    including,inter alia, “any conveyance,\n                    memorandum of charge or discharge [and] order of court.” Chao J pointed\n                    out inSum Keong Realty Pte Ltd v Syed Jafaralsadeg\n                        Alhadad[1996] 2 SLR(R) 356 (“Sum Keong Realty”)at [18] that registration does not\n                    confer title; it merely affects priority (see section 14 of the Registration of\n                    Deeds Act). Any deed or instrument that proves one’s title to land is\n                    admissible in evidence only if that deed or instrument has been registered (see\n                    s 4 above).60     Sharifah Fatimah later retired as trustee and\n                    D2 was appointed as trustee by way of an Indenture of Appointment dated 19\n                    October 2009. The Indenture of Appointment was registered on 25 November\n                    2009.61     On either scenario (bankruptcy or removal of\n                    the former trustees as trustees), there was no joinder of the new trustees,\n                    Sharifah Fatimah and D1, in the first proceedings under O15 r 7. It would have\n                    been difficult to prove their vested interest without first registering the\n                    February 1998 Order in the Registry of Deeds. The February 1998 Order was only\n                    registered on 25 November, some 11 years later.62     To summarise, the first proceedings could not\n                    continue (because of Ali’s death and on account of the bankruptcy of the\n                    former trustees as well) until the proper parties were joined in substitution\n                    and were before the court. To that extent, it was not inappropriate as it would\n                    save time and costs, be neater and less confusing to allow the disputes to be\n                    resolved in the 2010 Proceedings since the 2010 Plaintiffs and D1 and D2\n                    including BMS Hotel were parties to the 2010 Proceedings.(b)   Other developments63     The most apparent and significant development\n                    in 1998 was the removal of the former trustees by Sharifah Fatimah and D1 in\n                    February 1998. It appeared that the former trustees had purported to sell other\n                    leasehold properties together with the freehold reversion in similar\n                    circumstances as was the case here and there had been litigation over those\n                    transactions. The 2010 Plaintiffs had named five sets of proceedings where the\n                    former trustees were unsuccessful. In the joint affidavit filed by Jamal and\n                    Kamal, the deponents referred to a decision of Warren Khoo J in Suit 1837\n                    of 1994:Syed Salim Alhadad & others v Dickson Holdings\n                        Pte Ltd[1997] 1 SLR(R) 228 (“Syed Salim Alhadad”).64     In their joint affidavit of 19 May 2010, D1\n                    and D2 referred to the lineage of trustees which they had compiled from the\n                    documents available and exhibited in the joint affidavit as Appendix A. The\n                    lineage of trustees prepared by them included the Order of Court dated 27\n                    November 1992 (ie, the 1992 Order) in OS\n                    1122/1992, and it was maintained that pursuant to the 1992 Order, the properties\n                    belonging to the estate of Ahmad Aljunied were vested in the former\n                    trustees.65     Notably, D1 and D2 had omitted to mention how\n                    and why D1 and Sharifah Fatimah came to replace the former trustees as trustees.\n                    It is significant that their application to remove the former trustees was made\n                    on 21 January 1998 after Khoo J’s decision. On 29 January 1997,\n                    Khoo J held that the 1992 Order was irregular. The significance of\n                    Khoo J’s decision was the court’s finding that two of the\n                    former trustees, Salim and Ahmad, were not persons beneficially interested in\n                    the estate of Ahmad Aljunied. As such, they had nolocus\n                        standito apply to court to be appointed trustees of the will of\n                    Ahmad Aljunied under s 60 of the Trustees Act (Cap 337, 1985 Rev\n                    Ed). Neither could they as administrators of one estate (the Alhadad estate)\n                    validly appoint Jafaralsadeg and Ibrahim as trustees of another trust (Ahmad\n                    Aljunied’s will trust). The effect of the decision is that the former\n                    trustees were not vested with the legal estate in the properties belonging to\n                    the estate of Ahmad Aljunied.66     From the affidavits filed in Originating\n                    Summons No 69 of 1998 (“OS 69/1998”), it is clear that the former\n                    trustees consented to Sharifah Fatimah and D1’s application to remove them\n                    as trustees having confirmed in their joint affidavit that their appointment as\n                    trustees by the 1992 Order was found to be irregular by Khoo J inSyed Salim Alhadad(supra[63]). The former trustees also confirmed that they had not\n                    appealed against the decision of Khoo J.67     Khoo J’s judgment related to the\n                    four properties in Suit No 1837 of 1994 (namely, Nos 1, 7, 9 and 17 Dickson\n                    Road), but the judgment is important as the 1992 Order vested all the properties\n                    in the estate of Ahmad Aljunied in the former trustees. Notably, the properties\n                    in the schedule annexed to the 1992 Order included Nos 18, 20 and 22 Upper\n                    Dickson Road. The same point was made by D1 in his joint affidavit with Sharifah\n                    Fatimah affirmed on 16 January 1998 in support of OS 69/1998 where he stated\n                    that the irregularity in the appointment of the former trustees was fundamental,\n                    and could affect the other properties in the estate of Ahmad Aljunied apart from\n                    the four properties referred to in Khoo J’s judgment (ieNos 1, 7, 9 and 17 Dickson Road), and the applicants\n                    went on to refer to other properties of interest to them, namely, Nos 38 and 39\n                    Market Street and No 44 High Street.68     By parity of reasoning, the irregularity as\n                    described would equally call into question the former trustees’ standing\n                    and right to freely deal with the estate’s properties (hereafter referred\n                    to as “the capacity issue”); in particular, the validity of the\n                    sale of Nos 18, 20 and 22 Upper Dickson Road in 1994 to BMS Hotel. I am\n                    mentioning Khoo J’s judgment here because the first proceedings were\n                    brought against the former trustees in their capacity as trustees of the estate\n                    of Ahmad Aljunied by virtue of the 1992 Order. If they were not properly\n                    appointed as trustees following Khoo J’s decision in 1997, their\n                    status and the capacity in which they acted in the Conveyance would have to be\n                    reviewed and reconsidered in the first proceedings. In any case, the first\n                    proceedings against bankrupts in their personal capacity would be stayed under\n                    s 76(1)(c) of the Bankruptcy Act. Section 76(1)(c) provides as\n                    follows:On the making of a bankruptcy order –(c)    unless otherwise\n                            provided by this Act –(i)    no creditor to whom the bankrupt is indebted\n                                in respect of any debt provable in bankruptcy shall have any remedy\n                                against the person or property of the bankrupt in respect of that\n                                debt; and.(ii)   no action or proceedings shall be proceeded\n                                with or commenced against the bankrupt in respect of that\n                                debt,except by leave of the court and in accordance with such terms as the\n                        court may impose.69     Despite the position taken by D1 in OS 69/1998\n                    (see[67]above), D1 and D2 had maintained\n                    in their defence and joint affidavit filed on 20 May 2010 in the 2010\n                    Proceedings that the Conveyance was correctly executed by the former trustees as\n                    trustees of the estate of Ahmad Aljunied. As noted, D1 had omitted to mention\n                    how and why D1 and Sharifah Fatimah came to replace the former trustees as\n                    trustees, and given the concern expressed in the joint affidavit that\n                    irregularity in the appointment of the former trustees was fundamental and could\n                    affect the other properties in the estate of Ahmad Aljunied, D1 and Sharifah\n                    Fatimah, for over a period of 11 years, did not register the February 1998 Order\n                    which vested in them the properties previously held in trust for the estate of\n                    Ahmad Aljunied by the former trustees. As stated, the significance of\n                    registration is that unless so registered, there is no admissible evidence of\n                    their interest in the properties. The delay in registration was not explained;\n                    if not now, it would have to be explained at some later stage. The apparent\n                    discrepancies noted above would have to be resolved at trial.70     The 2010 Plaintiffs’ pleaded case is\n                    that the former trustees’ Conveyance and Confirmation were executed\n                    fraudulently. Admittedly, the capacity issue (see[68]above) was not a point that was directly raised in the\n                    pleadings. However, the particulars provided in the 2010 Proceedings were that\n                    the former trustees deliberately and wilfully conveyed the freehold reversion\n                    and the leasehold interest in the properties to BMS Hotel despite the fact that\n                    they knew or ought to have known that they did not have title or interest in the\n                    leases. In addition, the 2010 Plaintiffs had referred to Khoo J’s\n                    decision in their Statement of Claim. In the Statement of Claim, the 2010\n                    Plaintiffs noted that the former trustees had all been adjudicated bankrupts,\n                    but indicated their reservation in the pleadings to join the former trustees as\n                    defendants in their personal capacity.71     This leads me to a related development that\n                    came up at the hearing of the striking out applications. There was the\n                    revelation that the Conveyance was executed even though the full sale\n                    consideration was not paid contrary to the former trustees’ acknowledgment\n                    of receipt of the consideration in the Conveyance. In their joint affidavit\n                    dated 20 May 2010, D1 and D2 at paragraph 47 disclosed that BMS Hotel\n                    “went into financial problems in its business in China and could not\n                    complete the terms and conditions of the sale”. The pleaded case in the\n                    Defence (Amendment No 2) is that... there are sums due and owing by [BMS Hotel] to [D1 and D2] being the\n                        shortfall in the sale price of the Conveyance. BMS Hotel had consented to\n                        [D1 and D2] demanding for rental from the tenants and occupiers of the\n                        property in question so as to offset against the sums due and owing to [D1\n                        and D2].72     Mr Singh confirmed the shortfall of\n                    $500,000 of the sale proceeds, and despite this shortfall, the properties were,\n                    nonetheless, conveyed and title registered in the name of BMS Hotel. There was\n                    no explanation as to why that happened. Mr Singh submitted that the dispute\n                    on the shortfall between the trustees and BMS “would be settled and\n                    resolved”; it was a matter between the trustees and BMS Hotel and had\n                    nothing to do with the 2010 Plaintiffs. From this line of argument, it would\n                    seem that even after 16 years the shortfall of $500,000 has still not been paid.\n                    Mr Singh also explained that BMS Hotel had asked the trustees to collect\n                    rent from the tenants to set off this $500,000. However, D1 and D2 had not\n                    mentioned who in BMS Hotel gave the trustees permission to collect rental. All\n                    this is rather mysterious given the state of affairs in BMS Hotel.73     That is not all. A different picture emerged\n                    from a recent letter from the Official Assignee. At the hearing on\n                    12 August 2010, Mr Singh produced a letter dated 1 July 2010 from\n                    the Official Assignee to his firm. It was a letter written in the context of the\n                    bankruptcy of Jafaralsadeg. The letter is interesting as it raised more\n                    questions about the purported sale of the properties to BMS Hotel which could\n                    only be resolved after a trial. The relevant paragraphs of the letter\n                    read:3    Please be informed that BMS Hotel Properties Ltd has\n                            filed a proof of debt against the bankruptcy estate in relation to the\n                            consideration price of the properties at 18, 20 and 22 Upper Dickinson\n                            Road (“the Properties”).4    With regard to the High Court Suit Nos 263 of 2010,\n                            264 of 2010 and 271 of 2010, we are not in any position to make any\n                            comment, as neither the Official Assignee nor the other bankrupts are a\n                            party to the suits. As far as we are aware of, no Writs were served on\n                            us, but please let us have the particulars of the plaintiffs’\n                            solicitors so we can follow up.5    Please be informed that we have no objections to\n                            meeting all the relevant parties for the re-conveyance back of the\n                            Properties, to discuss a possible amicable solution.74     Interestingly, BMS Hotel’s proof of debt\n                    was for the purchase price and it was treated as a debt against the estate in\n                    bankruptcy of Jafaralsadeg. The Official Assignee’s letter mentioned\n                    re-conveyance of the properties as an amicable solution, and asked to meet all\n                    interested parties. It seems to me that BMS Hotel’s position is that the\n                    former trustee, Jafaralsadeg, had no title or interest in the properties to\n                    effectively convey good title to BMS Hotel, and the proof of debt was to recover\n                    the proceeds of sale against the estate of Jafaralsadeg. Needless to say, the\n                    existence of the alleged shortfall of $500,000 and its repayment by setting off\n                    rentals must be explained in the light of the proof of debt filed by BMS Hotel\n                    against the estate of the bankrupt, Jafaralsadeg. Both versions are plainly\n                    inconsistent.75     In summary, the developments as described\n                    opened up the prospect of a potential new line of argument, or provide material\n                    that might evidentially enhance the current plea of fraud and/or conspiracy in\n                    relation to the purported sale of the leasehold properties to BMS Hotel not\n                    previously known. That is quite different from the narrower line of argument\n                    taken in the first proceedings. Hence, having regard to all the facts and\n                    circumstances of this case, allowing the 2010 Proceedings to proceed would be\n                    the more appropriate course for the just, expeditious and economical disposal of\n                    the matters in dispute. By comparison, the first proceedings as it turned out\n                    would be ill-suited to resolve the intervening events and developments in the\n                    case.76     For completeness, I should mention OS\n                    330/1995. It must be remembered that BMS Hotel, through its lawyers, on\n                    12 March 1996 had requested an adjournment of the hearing of the first\n                    proceedings pending the outcome of an appeal against the former trustees in\n                    another case involving different properties (ie,\n                    OS 330/1995). The reason given in the letter was that the former trustees in\n                    defending OS 1052/1995 were relying on the same arguments raised by the former\n                    trustees in OS 330/1995. BMS Hotel’s case in OS 1234/1994 was, in turn,\n                    dependent on the former trustees’ case as BMS Hotel’s claim to title\n                    was derived from the former trustees. In other words, the former trustees had\n                    raised common defences in various litigations involving different properties\n                    purportedly sold by the former trustees in circumstances similar to the case\n                    here. As stated earlier, D1 and D2 had pleaded the same common defences in their\n                    Defence (Amendment No 2) filed in the 2010 Proceedings.77     As mentioned, Chao J ruled against the\n                    former trustees on 15 January 1996. He held that the plaintiff’s\n                    leasehold interest in the properties had not been extinguished. Chao J\n                    ruled on the following common defences:(a)     that the order of court in Petition\n                        Suit 304 of 1895 was conclusive proof of former trustees’ entitlement\n                        to the property. (SeeSum Keong Realty Pte Ltdat 358 for the text of the order in Petition Suit 304 of 1895 where the same\n                        order, which was relied upon by the same former trustees to claim that the\n                        leashold interest in the properties at 41 and 43 Dickson Road belonged to\n                        the trust created by the will of Ahmat Aljunied, was rejected.) Chao J\n                        held that the aforesaid order was not made by the court in exercise of\n                        probate, matrimonial, admiralty or bankruptcy jurisdiction, and as such\n                        s 43(2)(d) of the Evidence Act (Cap 97, 1990 Rev Ed) was not\n                        applicable. Whilst, the said order was in respect of the appointment of new\n                        trustees and the vesting of trust properties in them, there was no\n                        examination by the court as to the entitlement of Ahmad Aljunied to lots\n                        81-84. The said order could not vest in the former trustees assets which did\n                        not belong to Ahmad Aljunied.(b)     non registration of the leases in respect of lot 82 -84\n                        from Kavena Koonjan Chitty to Moona Keena Chitty (iethe head leases) under the Indian Act (No XVI of 1839) or\n                        the then newly enacted Registration of Deeds Ordinance, and hence could not\n                        be admitted in court as evidence of legal instruments. Furthermore, the\n                        lease granted by Kavena Koonjan Chitty to Moona Keena Chitty in respect of\n                        lot 81 at a yearly rent of one Spanish dollar was registered on 30 June\n                        1887, some nine years later. Chao J rejected that last point, holding\n                        that the Indian Act still applied in Singapore on 30 June 1887. On the\n                        effect of non-registration of the three leases affecting lots 82-84, Chao J\n                        held that the existence of the three leases, albeit not registered, had been\n                        established through other evidence. Clause 5 of the Indian Act was on the\n                        inadmissibility in evidence of an unregistered instrument and could not be\n                        read so widely as to render all unregistered deed void or\n                    invalid.78     The Court of Appeal in Civil Appeal No 10 of\n                    1996 dismissed the former trustees’ appeal and affirmed Chao J’s\n                    decision on 11 November 1998. It must also be noted that the parties had agreed\n                    to adjourn the hearing of the first proceedings until the Court of\n                    Appeal’s decision in Civil Appeal No 10 of 1996. This was confirmed at a\n                    PTC held on 24 August 1996. So the delay of more than two years from 1996\n                    to 1998 could be accounted for.Delay79     I have also conside red whether the 2010\n                    Proceedings should be struck out, nevertheless, in order to mark the\n                    court’s disapproval of the extraordinary delay of 11 years in bringing the\n                    2010 Proceedings. Mr Singh argued that there has been clear inordinate\n                    delay in pursuing the rights of the 2010 Plaintiffs. Mr Singh submitted\n                    that any delay in applying to set aside is relevant, particularly, if, during\n                    the period of delay, the successful party has acted on the judgment, or if third\n                    parties have acquired rights by reference to it. Furthermore, he argued that\n                    there was no proper explanation for the delay in pursuing the 2010\n                    Plaintiffs’ rights, and in the setting aside of the May 1999\n                    Orders.80     Jamal and Kamal explained the delay in the\n                        2ndjoint affidavit filed on 3 June 2010.\n                    Ali’s estate took some time to settle due to the extent of the estate and\n                    the inability of the beneficiaries to make payment of the estate duty. In\n                    addition, there were several changes of solicitors handling the probate matter.\n                    There were difficulties obtaining consensus from beneficiaries of Ali’s\n                    estate. Ali had two wives. Kamal’s mother, his sister and he resided in\n                    Singapore. The other beneficiaries live in Jeddah, Yemen, Egypt and Europe.\n                    There was distrust amongst the beneficiaries especially his step siblings. For\n                    instance, Kamal himself was replaced as administrator of Ali’s estate by a\n                    relative named Murtadha Hussein Abdulqader. The other administrator is\n                    Kamal’s sister, Alwiyah binte Omar Bamadhaj.81     Ali was the administrator on Noor’s\n                    estate. After Ali died, Jamal was approached by one of Noor’s\n                    beneficiaries in 2006 to act as administrator. After that an application for a\n                    Grant of Letters of Administration De Bonis Non was taken out and the Grant was\n                    issued on 6 August 2007.82     Jamal deposed that Mohamad did not have any\n                    family in Singapore. In 2004, the fifth plaintiff in Suit 271 approached him to\n                    assist in respect of No 18. The fifth plaintiff himself resided in the UAE.\n                    Jamal found that he had to trace Mohamad’s family. He also had to\n                    ascertain the assets and properties of Mohamad to apply for letters of\n                    administration. As some of Mohamad’s assets were beneficial interests in\n                    other estates, more investigations had to be carried out. Jamal also had to\n                    visit various properties and to speak to tenants and occupiers to ensure that\n                    the properties could be traced to Mohamad. The Grant of Letters of\n                    Administration was only issued to Jamal on 28 April 2010,83     Ali was the administrator of Fitom’s\n                    estate. All the direct beneficiaries of Fitom were dead. Jamal had to trace the\n                    derivative beneficiaries who all resided in the Middle East. Five derivative\n                    beneficiaries have given their Power of Attorney to Jamal.84     I accepted that it would have been an arduous\n                    and time consuming task to obtain the necessary authority to act from the\n                    beneficiaries and derivative beneficiaries residing here and overseas. I also\n                    accepted that the delay was exceedingly long. Fortunately for the Ali Group, it\n                    was not just the Ali Group that had to attend to the requirements of O 15\n                    r 7 after Lai J’s orders on 18 August 1999 and 2 September 1999\n                    (see[28]above). The other parties to the\n                    first proceedings, the former trustees and BMS Hotel, also had a mire of\n                    problems so that despite the Ali Group’s exceedingly long delay, nothing\n                    significant happened for over 11 years. For instance, the removal of the former\n                    trustees as trustees and the appointment of D1 and Sharifah Fatimah as new\n                    trustees were not known. The new trustees did not step forward to take over the\n                    first proceedings from the former trustees. Outwardly, the former trustees\n                    continued as if there was no February 1998 Order. Mr Shah and Ms Netto\n                    continued to represent the former trustees until September 1999 (see[29]above). In any case, the former trustees\n                    would have ceased to be trustees by operation of s 310(1) of the Bankruptcy\n                    Act - the last of the four former trustees was declared a\n                    bankrupt in October 1998. As for BMS Hotel, the latter did not enforce the\n                    possession order of 28 May 1999, which order was registered on 21 June\n                    2004. Notably, D1 and D2 admitted that BMS Hotel was never in possession of the\n                    properties. Factually, over the last 11 years, the tenants and occupiers\n                    remained in occupation of the properties. It now appears that the Conveyance was\n                    executed and title to the properties registered in the name of BMS Hotel even\n                    though BMS Hotel had not paid the purchase consideration in full. Title to the\n                    properties is still in the name of BMS Hotel. The state of affairs in BMS Hotel,\n                    the bankruptcy of the former trustees, and the non registration of the February\n                    1998 Order vesting the properties belonging to Ahmad Aljunied in favour of D1\n                    and D2 until November 2009, all coincided and ironically, preserved the status\n                    quo with the tenants continuing to be in occupation, and paying rental as usual.\n                    In these special circumstances, I was minded to conclude that the effect of the\n                    delay on the prospects of a fair trial was not so real as to prevent a fair\n                    trial of the dispute which was whether the leasehold interest had terminated\n                    before the purported transfer of the properties to BMS Hotel in 1994. This part\n                    of the debate would involve tracing the root of title and interpreting the terms\n                    of the head leases and deeds of assignment. The other part is likely to be on\n                    the former trustees’ appointment as trustees which would affect their\n                    capacity to sell the properties and the validity of the Conveyance; questions\n                    relating to the shortfall of $500,000, and BMS Hotel’s proof of debt in\n                    respect of the proceeds of sale. There is also the matter of the recent claims\n                    against D1 and D2 for interfering with the tenants and rights of the 2010\n                    Plaintiffs in March 2010.85     I was satisfied that to strike out the 2010\n                    Proceedings on ground of delay would be a wrong exercise of discretion in the\n                    present case and especially where there is no evidence of prejudice caused by\n                    the extraordinary delay. In my view, it would be wrong and inappropriate to\n                    strike out the 2010 Proceedings as the rights of property are in dispute. All\n                    the more so when the former trustees had lost in other proceedings involving\n                    different properties purportedly sold by the former trustees in circumstances\n                    similar to the case here and where the same common defences were raised (see for\n                    example the decision of Chao J in OS 330/ 1995 at[75]to[77]above). If the\n                    dispute is resolved in favour of the 2010 Plaintiffs, appropriate orders can be\n                    made to set aside the May 1999 Orders and cancellation of their registration in\n                    the Registry of Deeds.Other matters86     I have already commented on the effect of\n                    Order 15 r 7 on the first proceedings. I already said that there must be joinder\n                    of the proper party in substitution before the first proceedings could continue.\n                    It seems to me, and I make no decision on the May 1999 Orders which is for the\n                    forum hearing the application to set aside the May 1999 Orders, that the May\n                    1999 Orders were irregular and ineffectual. They were made at a time when the\n                    first proceedings were either already stayed under the Bankruptcy Act, or could\n                    not continue because there was no proper party in substitution. In the\n                    circumstances, Lai J’s order would also be an irregular order as it\n                    was brought about because of the previous irregular May 1999\n                Orders.Conclusion87     For the reasons stated, I dismissed the\n                    striking out application brought by D1 and D2 with costs fixed at $20,000 plus\n                    reasonable disbursements for all three summonses.",
        "The relief claimed on the applications to strike out": "18     D1 and D2 filed applications to strike out the\n                    2010 Proceedings on grounds that the proceedings (a) did not disclose any\n                    reasonable cause of action; (b) were scandalous, frivolous or vexatious; and (c)\n                    were an abuse of process in the light of the May 1999 Orders. Mr Singh\n                    confirmed at the hearing that he was relying on abuse of process as his sole\n                    ground to strike out the 2010 Proceedings. Mr Singh emphasised in his\n                    skeletal submissions that the court was not asked to set aside the May 1999\n                    Order. 19     The first argument on abuse of process is that\n                    the 2010 Proceedings were an abuse of process as the same issues there were\n                    already raised in OS 1052/1995 and struck out on 28 May 1999; and BMS Hotel\n                    was granted possession of the properties pursuant to a possession order made in\n                    OS 1234/1994 on 28 May 1999. Hence, the 2010 Proceedings amounted to a\n                    collateral attack against the May 1999 Orders. The second argument is that the\n                    matters raised in the 2010 proceedings should and could be resolved within the\n                    first proceedings. As such, it was an abuse of process to institute the 2010\n                    Proceedings. If that course had been taken, there would be no collateral attack\n                    against the May 1999 Orders. The two arguments will be examined in detail later\n                    on.",
        "The course of events in the first proceedings": "20     I propose to start with the background facts\n                    and events which led to May 1999 Orders. I should mention that Mr Namazie\n                    filed a Request dated 31 May 2010 to the Registrar whereby he requested\n                    that the non-electronic court files in respect of OS 1234/1994 and OS 1052/1995\n                    be made available to the Court for the hearing of the striking out applications.\n                    This was necessary in order to look at the history of the previous litigation in\n                    some detail. In doing so, I found it necessary to look at other court files as\n                    well. Besides, the 2010 Plaintiffs had referred to other proceedings involving\n                    the former trustees, and D1 and D2 had referred to the lineage of trustees and\n                    the court orders in question. 21     In OS 1234/1994, BMS Hotel applied for\n                    possession of the properties on the ground that the persons in occupation were\n                    in occupation without licence or consent. Ali and those he represented\n                    (hereafter “the Ali Group”) were the first, sixth and seventh\n                    defendants. The Ali Group comprised of (a) Ali who represented himself in\n                    respect of his two-third share in No 20, and as administrator of the estate of\n                    Noor; (b) Ali as the administrator of the estate of Fitom in respect of No 22;\n                    and (c) Fatimah and Buhaya as beneficiaries of the estate of Mohamed in respect\n                    of No 18. Ali was their attorney in the proceedings. The second group of\n                    defendants, namely, the second to fifth defendants, were the former trustees. At\n                    the material time, the Ali Group was represented by Ms LJ Wong of\n                    M/s Toh Tan & Partners. Mr S B Shah represented the former\n                    trustees, and Mr Zaheer Merchant of M/s Martin & Partners\n                    represented BHS Hotel. 22     OS 1052/1995 was commenced by the Ali Group to\n                    oppose OS 1234/1994. The defendants in OS 1052/1995 were the four former\n                    trustees and BMS Hotel. In OS 1052/1995, the Ali Group asked for the Conveyance\n                    and the Confirmation to be cancelled, and consequently for an order that the\n                    Registrar of Deeds be directed to cancel entries in the Register of Deeds\n                    relating to the Conveyance and Confirmation. In addition, the Ali Group sought a\n                    declaration that their leasehold interest in the properties had not been\n                    extinguished, and that there be an inquiry as to damages. 23     At the material time, the Ali Group in OS\n                    1052/1995 was represented by Ms LJ Wong, and Mr Zaheer Merchant of\n                    M/s Martine & Partners represented BHS Hotel. I noted that Mr S B\n                    Shah represented the former trustees in OS 1234/1994 only. Another firm of\n                    lawyers, M/s L Pereira & Netto represented the former trustees in OS\n                    1052/1995. 24     From my perusal of the court files in the\n                    previous proceedings, I noted that M/s Martin & Partners wrote to the\n                    Registrar on 12 March 1996 requesting that the hearing of the first\n                    proceedings listed for 18 and 19 March 1996 be adjourned pending the\n                    outcome of an appeal against the former trustees in another case involving\n                    different properties, namely, Originating Summons No 330 of 1995 (“OS\n                    330/1995”). The reason given in the letter was that the former trustees\n                    in defending OS 1052/1995 were relying on the same arguments raised by the\n                    former trustees in OS 330/1995. The arguments referred to in the letter were:\n                    (a) the head leases were void for non registration; and (b) reliance on an Order\n                    of Court in Petition Suit 304 of 1895 as proof that the leasehold interest in\n                    the properties vested in Ahmad Aljunied. The letter went on to explain that BMS\n                    Hotel’s case in OS 1234/1994 was, in turn, dependent on the former\n                    trustees’ case as BMS Hotel’s claim to title was derived from the\n                    former trustees. Chao Hick Tin J (as he then was) had ruled against the\n                    former trustees on 15 January 1996, and the former trustees had appealed\n                    against the decision in Civil Appeal No 10 of 1996. The March hearing dates were\n                    duly vacated. 25     At the hearing of the Civil Appeal No 10 of\n                    1996, the former trustees filed Notice of Motion No 194 of 1996 to raise for the\n                    first time the issue that the respondent was no longer alive, and thus could not\n                    have authorised her representative to commence OS 330/1995. Civil Appeal No 10\n                    of 1996 was adjourned until the Notice of Motion was dealt with. At a pre-trial\n                    conference (“PTC”) held on 24 August 1996, the lawyers\n                    representing the different parties in Os 1234/1994 and OS 1052/1995 agreed to\n                    further adjourn the hearing of the first proceedings until after Civil Appeal No\n                    10 of 1996 has been heard. The Court of Appeal dismissed the appeal and affirmed\n                    Chao J’s decision on 11 November 1998. 26     Several PTCs were called since the hearing of\n                    the first proceedings was adjourned in March 1996. At a PTC held on 28 May\n                    1999, the Registrar, Mr Chiam Boon Keng, dismissed OS 1052/1995, and gave\n                    an order in terms of OS 1234/1994 which granted BMS Hotel possession of the\n                    properties. I saw from the Registrar’s Notes of Arguments that at the PTC\n                    held on 28 May 1999, Mr Merchant informed the Registrar of the absence\n                    of Ms Wong of M/s Toh & Partners that morning; she was also absent\n                    at the last PTC even though she was informed of the hearing by Mr Shah.\n                    Mr Merchant asked that OS 1052/1995 be stuck out for want of prosecution\n                    over the last two and a half years. Ms Netto who represented the former\n                    trustees in OS 1052/1995 also wanted the proceedings struck out with costs for\n                    the same reason. As for OS 1234/1994, Mr Merchant also informed the\n                    Registrar of Mr Shah’s absence at the morning’s PTC even though\n                    the latter was aware of the PTC hearing; that OS 1052/1995 and OS 1234/1994 were\n                    to be heard together; and that if OS 1052/1995 failed, BMS Hotel must be given\n                    an order-in-terms of the prayers in OS 1234/1994. He also asked for\n                    costs. 27     The Registrar struck out OS 1052/1995 with\n                    costs, and gave an order-in-terms of the prayers in OS 1234/1994. The May 1999\n                    Orders were default orders made in the absence of counsel at the PTC. This is\n                    apparent on the face of the May 1999 Orders. In the case of (a) OS 1234 of 1994,\n                    counsel for the BMS Hotel (Mr Merchant) attended the PTC held on\n                    28 May 1999, and in the absence of counsel for the Ali Group (Ms Wong)andcounsel for the former trustees\n                    (Mr Shah), the Registrar allowed BMS Hotel’s application for\n                    possession of the properties; and (b) OS 1052/1995, counsel for the former\n                    trustees (Ms Netto) and BMS Hotel (Mr Merchant) attended the PTC held\n                    28 May 1999, and in the absence of the counsel for the Ali Group (Ms Wong),\n                    the Registrar struck out the proceedings. It is clear to me that the May 1999\n                    Orders were made under O 34A r (6) (1) of the Rules of Court\n                    (Cap 322, Rev Ed 1997). Order 34A r 6 reads as follows: 6.- (1)    If, at the time appointed for the pre-trial\n                            conference, one or more of the parties fails to attend, the Court may\n                            dismiss the action or proceedings or strike out the defence or\n                            counterclaim or enter judgment or make such order as the Court thinks\n                            fit. (2)    An order made by the Court in the absence of a\n                            party concerned or affected by the order may be set aside by the Court,\n                            on the application of that party, on such terms as it thinks\n                            just. (3)    Without prejudice to the preceding paragraphs of\n                            this Rule, where one or more of the parties to the action or proceedings\n                            fails to attend the pre-trial conference, the Court may, if it thinks\n                            fit, adjourn the conference. 28     Ali died in May 1997. Ali was the prime mover\n                    of the proceedings in his personal capacity, as administrator and as attorney\n                    for his named principals, and with his passing the proceedings in OS 1052/1995\n                    floundered as there was no one with authority who could give instructions to the\n                    lawyers on record for the Ali Group. In August 1999, Ali’s son, Kamal as a\n                    beneficiary of Ali’s estate, applied to be made a party to OS 1052/1995\n                    and OS 1234/1994, and to set aside the May 1999 Orders. By then Ms Wong had\n                    left M/s Toh Tan & Partners to set up her own firm of M/s LJ Wong\n                    & Yeo. Ms Wong acted for Kamal, and she filed, on his behalf, Summons\n                    No 4805 of 1999 in OS 1234/1994, and Summons No 4961 of 1999 in OS 1052/1995.\n                    Both summonses were heard by Lai Siu Chiu J. It appeared that Ms Wong\n                    had overlooked the PTC fixed for 28 May 1999. Mr Shah was ill and he did\n                    not attend the PTC. Ms Wong explained that had she not overlooked the PTC\n                    date, she would have attended as an officer of the court even though Ali had\n                    died and there was no one with authority who could give her instructions.\n                    Lai J allowed Kamal’s application made in his capacity as a\n                    beneficiary of Ali’s estate to be added as a party to OS 1234/1994 and OS\n                    1052/1995. Lai J also set aside the May 1999 Orders in so far as they\n                    related to Ali’s share of No 20. 29     Mr Singh accepted that the May 1999\n                    Orders were only set side in so far as it related to Ali’s share of No 20,\n                    and they remained in force in respect of No 18 and No 22, and the one third\n                    share of No 20 owned by Noor’s estate. Lai J directed that pending\n                    registration of Powers of Attorney in favour of Kamal from the beneficiaries of\n                    Fitom’s estate, the May Orders in respect of No 22 were to stand. The\n                    Power of Attorney was to be registered by 30 September 1999. No Power of\n                    Attorney was registered by 30 November 1999. The other direction was for the\n                    solicitors on record for the former trustees (who were bankrupts) to notify the\n                    Official Assignee of the existence of the first proceedings. Ms Netto and\n                    Mr Shah separately wrote to the Official Assignee. On 1 September\n                    1999, Ms Netto informed the Official Assignee that the former trustees had\n                    been declared bankrupts. As such, she was discharging her firm from further\n                    representation and requested the Official Assignee to take over the conduct of\n                    OS 1052/1995. Mr Shah wrote a similar letter to the Official Assignee on\n                    8 September 1999 in respect of OS 1234/1994. 30     No Power of Attorney was registered by 30\n                    September 1999. Kamal did not take any further steps in the first proceedings\n                    after obtaining on 18 August 1999 and 2 September 1999 (a) leave to be added as\n                    a party to OS 1052/1995 and OS 1234/1994, and (b) an order setting aside the May\n                    Orders in respect of Ali’s interest in No 20.",
        "Should the 2010 Proceedings be struck out?": "31     The first proceedings were brought by way of\n                    originating summonses. It is therefore reasonable to assume that the questions\n                    at issue were likely to be one of construction of some deeds or other documents,\n                    or some question of law, or there were unlikely to be any substantial dispute of\n                    fact. The reliefs sought by the Ali Group in OS 1052/1995 related to the issue\n                    of ownership of the leasehold properties: Was the leasehold owned by the Ali\n                    Group or Ahmad Aljunied? If the leases were owned by the Ali Group, was there\n                    early termination of the leases? In the first proceedings, the former trustees\n                    claimed that Ahmad Aljunied owned the leasehold interest for the reasons\n                    explained in the former trustees’ affidavit filed in OS 1052/1995: (a) The\n                    leases (lots 43 and 44) granted by Kavena Koonjan Chitty to Moona Meyna Meyappa\n                    Chitty (“the head leases”) were void for non-registration. (b)\n                    Reliance on an Order of Court in Suit No 304 of 1895 as proof of Ahmad\n                    Aljunied’s acquisition of the leasehold interest in the properties. (c)\n                    The sub-division of the lots 43 and 44 into three lots, and the assignments of\n                    the two leases, one for lot 43 and the other for lot 44, to three persons\n                    – Ali, Mohamad and Fitom – was bad in law (in that no privity\n                    existed between the reversioner and the assignees), and in a breach of the terms\n                    of the head leases; and/or the sub-divisions were without the consent and/or\n                    authority of the lessor. (d) Forfeiture was a ground mentioned by BMS Hotel. The\n                    head leases were forfeited for non- payment of annual rent of “one\n                    Spanish dollar” by Moona Meyna Meyappa Chitty. OS 1234/1994 was an\n                    application for possession of the properties. 32     The claims in the 2010 Proceedings are also\n                    related to the issue of ownership of the leasehold interest in the properties,\n                    and early termination of the leases for non-payment of the annual rent of\n                    “one Spanish dollar”. D1 and D2 pleaded as their defence the same\n                    four issues (a) - (b) referred to in[31]above, and asserted that they have rights under the head leases as the rightful\n                    reversioners. The 2010 Proceedings go further to allege fraud in the execution\n                    of the Conveyance and conspiracy amongst the former trustees and/or BMS Hotel to\n                    deprive the 2010 Plaintiffs and/or the Ali Group of the leasehold properties.\n                    Notably, fraud was not raised against the former trustees in the first\n                    proceedings. The former trustees are still bankrupts. The 2010 Plaintiffs have\n                    stated in their pleadings that they would join the former trustees as parties if\n                    and when necessary. They have also reserved the right to supplement the\n                    particulars of fraud and/or conspiracy after discovery and/or\n                    interrogatories. 33     BMS Hotel is the third defendant in the 2010\n                    Proceedings. The declaration sought in the first proceedings and in the 2010\n                    Proceedings is that the Ali Group’s leasehold interest in the properties\n                    had not extinguished, and that the Conveyance and Confirmation executed by the\n                    former trustees in favour of BMS Hotel was null and void and of no effect.\n                    Consequently, the entries in favour of BMS Hotel in the Register of Deeds are to\n                    be expunged and/or cancelled. 34     In the 2010 Proceedings, the plea against D1\n                    and D2 is for fraud and intermeddling with trust property. D1 and D2 deny the\n                    allegation of fraud and conspiracy maintaining that the sale of the properties\n                    to BMS Hotel by way of the Conveyance and Confirmation was correctly executed.\n                    D1 and D2 also pleaded that the May 1999 Orders gave rise to cause of estoppel\n                    and/or issue estoppel. As explained in their joint affidavit, D1 and D2 are not\n                    disavowing the former trustees’ sale and Conveyance to BMS Hotel. In fact,\n                    they affirmed in their joint affidavit that the Conveyance was correctly\n                    executed, and the court agreed as well because OS 1052/1995 was struck out, and\n                    the possession order was granted to BMS Hotel in OS 1234/1994. The Conveyance\n                    and Confirmation executed by the former trustees in favour of BMS Hotel was for\n                    the estate in fee simple after determination of the leasehold interest and the\n                    extinguishment of the reversion and the merging of the two titles as estate in\n                    fee simple. 35     D1 and D2 pleaded that $500,000 of the sale\n                    consideration was and is still owed by BMS Hotel, and the latter had asked D1\n                    and D2 to collect rental to offset the money owing to D1 and D2. In the\n                    circumstances, it was the 2010 Plaintiffs rather than D1 and D2 who had\n                    intermeddled in the affairs of the properties. 36     In my view, nores\n                        judicataor issue estoppel applies in relation to the claims to\n                    ownership of the leasehold properties, early termination of the leases, and the\n                    common issues (a) - (d) referred to in[31]above. There was no adjudication upon those issues in the first proceedings. The\n                    real question I have to address here is whether it is an abuse of process to\n                    seek to litigate in the 2010 Proceedings the claims to ownership of the\n                    leasehold properties, early termination of the leases, and the common issues (a)\n                    - (d), which were raised, but not adjudicated upon in OS 1052/1995, and where OS\n                    1052/1995 had itself been struck out under O34A r 6(1). I should point out that\n                    this is a different question from the question whether a party should be allowed\n                    to raise in the subsequent proceedings issues which have been raised in earlier\n                    proceedings but laid to rest as the result of a decision to withdraw the issues.\n                    To this end, the case ofSetiadi Hendrawan v OCBC Securities\n                        Pte Ltd[2001] 3 SLR(R) 296 cited by Mr Singh is\n                    irrelevant and does not assist him.",
        "Re-litigation of the issues raised (but no adjudicated upon) in OS\n                1052/1995 which had been struck out": "37     I now turn to the question whether it is an\n                    abuse of process to seek to litigate in the 2010 Proceedings the claims to\n                    ownership of the leasehold properties, early termination of the leases and the\n                    common issues (a) - (d) raised (but not adjudicated upon) in OS 1052/1995 which\n                    was itself struck out. 38     Generally, default judgments are capable of\n                    giving rise to the application of issue estoppel. However, it is necessary to\n                    scrutinise the default judgment carefully in order to see precisely what was\n                    decided. Lord Radcliffe inKok Hoong v Leong Cheong Kweng\n                        Mines Ltd[1964] AC 993 said at p 1012 in relation to\n                    the reinterpretation of an earlier decision by the court inNew Brunswick RailwayCov British &\n                        French Trust Corporation[1939] AC 1: This reinterpretation amounts to saying that default judgments, though\n                        capable of giving rise to estoppels must always be scrutinised with extreme\n                        particularity for the purpose of ascertaining the bare essence of what they\n                        must necessarily have decided and, to use the words of Lord Maugham LC\n                        ([1939] AC 1 at p 21), they can estop only for what must\n                        “necessarily and with complete precision” have thereby\n                        determined. 39     In my view, it cannot be said that the May\n                    1999 Orders “necessarily and with complete precision” decided the\n                    claims to ownership of the leasehold properties, early termination of the\n                    leases, and the common issues (a)-(d). They were not adjudicated upon in OS\n                    1052/1995 because those proceedings were struck out under O 34A r 6(1). How OS\n                    1052/1995 came to be struck out is also relevant in the exercise of discretion\n                    whether or not to strike out the 2010 Proceedings. The events that led to the\n                    striking out of OS 1052/1995 are set out at[22]to[27]above. It is\n                    important to keep in mind that (a) an order-in-terms of the prayers in OS\n                    1234/1994 was granted in the absence of Mr Shah (for the former trustees)\n                    and Ms Wong (for the Ali Group) at the PTC held on 28 May 1999; and (b) OS\n                    1052/1995 was struck out because Ms Wong did not attend the same PTC. In\n                    making the default orders, the court did not extinguish the Ali Group’s\n                    claims to ownership of the properties. This point is reinforced by O 34A r 2\n                    which provides that the default orders made under r 1 may be set aside on the\n                    application of the party concerned. Put simply, D1 and D2 cannot set up issue\n                    estoppel in the face of O34A r 6(2). Accordingly, the mere commencement of the\n                    2010 Proceedings, in the circumstances, is not an abuse of\n                process.",
        "Duplicitous proceedings": "40     Mr Singh’s second argument is that\n                    it was not an appropriate course to commence the 2010 Proceedings because\n                    procedurally, the matters in dispute must be resolved within the first\n                    proceedings. In other words, the 2010 Proceedings were unnecessary and\n                    duplicitous since the issues that were raised in the 2010 Proceedings could have\n                    been resolved within the first proceedings. Mr Singh citedHong Hin Kit Edward v PT Nusautama Medicalindo[2010] SGHC 192, a decision of Choo Han Teck J in support of his\n                    contention, and in particular, Choo J’s observations at [14]: I was of the view that this suit was totally unnecessary because all the\n                        claims of the plaintiff were matters that could be and should be determined\n                        in the prior actions. It would be more appropriate to amend the existing\n                        actions to add the necessary parties and the new prayers because the facts\n                        leading to the dispute as well as the facts in this action overlap. The\n                        parties ought to choose a course that is least likely to result in confusion\n                        or conflicting findings of fact. 41     Applying the same reasoning, Mr Singh\n                    argued that the 2010 Plaintiffs should have applied to (a) join the 2010\n                    Plaintiffs as parties in the first proceedings in order to establish their\n                    rights to the properties, and (b) set aside the May 1999 Orders in the first\n                    proceedings (ie, OS 1052/1995 and OS 1234/1994).\n                    By commencing the 2010 Proceedings, the 2010 Plaintiffs had ignored the May 1999\n                    Orders. Their failure to follow the proper procedure by commencing the 2010\n                    Proceedings was an abuse of process and should not be allowed. 42     It is not controversial that where proceedings\n                    based on a particular cause of action are in existence, it isprima faciean abuse of process to bring a second action based\n                    on the same cause of action, and the latter action between the same parties is\n                    liable to be struck out (seeBuckland v Palmer[1984] 1 WLR 1109;The Silver Athens[1986] 2 Lloyds Rep 580). Put another way, it is abusing the process\n                    of the court to bring a new action without good reason if the matters can be\n                    resolved within an existing action. However, if in the circumstances of the\n                    case, there is good reason to justify the commencement of the new action, the\n                    court has discretionary power to permit the new action to proceed. The burden is\n                    on the party bringing the new action to justify it – the party must show\n                    good grounds that the dispute is best raised in the new proceedings rather than\n                    proceed in the existing action. If the new action is allowed to proceed, to\n                    avoid duplicity of proceedings, the existing and new actions could be\n                    consolidated, or the existing action could be permanently stayed. An election as\n                    to which set of proceedings to maintain is also an option. 43     Paragraph 20 of the joint affidavit of Jamal\n                    and Kamal filed on 3 June 2010 in Suit 263 sets out the reasons for\n                    bringing the 2010 Proceedings rather than proceed with the first proceedings.\n                    The same reasons are being advanced in Suit 264 and Suit 271. Paragraph 20\n                    states: It is no longer viable to proceed with OS No 1234/1994 and OS\n                        1052/1995 for the following reasons: (a)The parties are now very different. When OS No\n                                1234/1994 and OS No 1052/1995 were taken out, there were essentially\n                                3 persons who represented the 3 properties at Nos 18, 20 and 22\n                                Upper Dickson Road. The property at No 20 was represented by Ali\n                                (both in his personal capacity and as the administrator of Noor, who\n                                together owned the entire said Property). The property at No 22 was\n                                also represented by Ali (who was the administrator of Fitom’s\n                                estate). As to No 18, the said property was represented by Fatimah\n                                Mohamed Hashim and Buhaya Hashim Allhabshee, two of the\n                                beneficiaries of the estate of Mohamad who together had a\n                                [two-third] share in the said property. Owing to the death of Ali,\n                                and with the inclusion of the beneficiaries and administrators of\n                                the estates which own the 3 properties, the parties are now very\n                                different from those in OS Nos 1234/1994 and OS No\n                            1052/1995. (b)There is uncertainty as to what has happened\n                                in OS Nos 1234/1994 and OS No 1052/1995. This uncertainty has been\n                                highlighted above. Due to this uncertainty, it became difficult to\n                                ascertain exactly what needed to be done in order to proceed with\n                                the matter. (c)Since 1999, the facts pertaining to the 3\n                                properties have developed differently. This difference is partially\n                                due to the obtaining of Grants of Letters of Administration in the\n                                estates which own the 3 properties. It is also partially due to the\n                                difference in the occupation of the 3 properties. In respect of No\n                                20 Upper Dickson Road, control and possession of the said property\n                                has ALWAYS been with Ali, and then to [Kamal] and then to [Jamal].\n                                The Defendants and the Former Trustees have NEVER been in control or\n                                possession of the said premises. 44     The reasons above are but one aspect of all\n                    the relevant facts and circumstances to be scrutinised to see if there was any\n                    abuse in not resolving the matters advanced in the 2010 Proceedings within the\n                    first proceedings. I have to also consider the state of affairs in the first\n                    proceedings, the other complexities that related to the status and capacity of\n                    the former trustees in the first proceedings (which I will explain later)\n                    including the allegations against D1 and D2 for interfering with the tenants and\n                    the interests of the 2010 Plaintiffs in the March 2010. In the exercise of\n                    discretion whether to allow the 2010 Proceedings to proceed or not, it is always\n                    necessary to look at the history of the litigation in some detail. The bundles\n                    which the parties prepared for the hearing referred to other proceedings, and it\n                    was necessary for me to read the relevant court files as well. 45     The 2010 Proceedings started in April 2010 in\n                    circumstances which were understandable. Significantly, BMS Hotel did not\n                    enforce the possession order of 28 May 1999. D1 and D2 admitted in pleadings\n                    that BMS Hotel did not have possession of the properties. In fact, even after\n                    the May 1999 Orders, the status quo with the tenants and occupiers remained in\n                    limbo and did not change for over 11 years. The properties continued to be\n                    occupied by the same tenants and occupiers who continued to pay rent to those\n                    representing the Ali Group. Before his death, Ali was the rent collector for all\n                    three properties. Ali as agent collected rent for the lessees of No 18 and 22.\n                    Apart from rent, property tax was paid by and for the estates and the\n                    beneficiaries asserting a leasehold interest in the properties. However, in\n                    March 2010, D1 and D2 (and not BMS Hotel) surfaced, and they informed the\n                    tenants and occupiers of the properties to pay them the rental. In addition, D1\n                    and D2 claimed to have taken possession of the properties. The tenants and\n                    occupiers also received a notice of eviction from D1 and D2. 46     To stop D1 and 2 from interfering with the\n                    tenants and occupiers, the 2010 Plaintiffs sued in April 2010, and applied for\n                    an interim injunction. Against this backdrop, the commencement of the 2010\n                    Proceedings was, in the circumstances, understandable. But were the 2010\n                    Proceedings also justified in the circumstances of this case? 47     I reached the conclusion that the commencement\n                    of the 2010 Proceedings was justified in the circumstances of this case. In my\n                    view, the facts and circumstances of the present case were exceptional so as to\n                    afford good reason for the commencement of the 2010 Proceedings. There were\n                    special features about this case that showed that the matters raised in the 2010\n                    Proceedings could not resolved within the first proceedings as those features\n                    added to the complexity that now exists. The first feature concerned the state\n                    of affairs in the first proceedings. The second feature concerned the\n                    allegations of fraud pleaded in the 2010 Proceedings. Fraud was not raised in\n                    the first proceedings against the former trustees. Third, the 2010 Plaintiffs\n                    sued D1 and D2 for interfering with the tenants and the interests of the 2010\n                    Plaintiffs. Finally, the proof of debt filed by BMS Hotel and the unpaid balance\n                    sale proceeds of $500,000 by BMS Hotel. Having regard to all the facts and\n                    circumstances of the case, I decided to exercise my discretion to allow the 2010\n                    Proceedings to proceed since starting afresh was the more appropriate course for\n                    the just, expeditious and economical disposal of the matters in dispute. By\n                    comparison, the first proceedings as it turned out would be ill-suited to\n                    resolve the intervening events and developments in the case. I will now\n                    elaborate on my decision. 48     One should keep in mind the meaning of the\n                    term “abuse of process” in O 18 r 19(1)(d) which was given a wide\n                    interpretation inGabriel Peter & Partners v Wee Chong\n                        Jin[1997] 3 SLR(R) 649 at [22]: The term, “abuse of the process of the Court”, in O 18 r\n                        19(1)(d), has been given a wide interpretation by the courts. It includes\n                        considerations of public policy and the interests of justice. This term\n                        signifies that the process of the court must be usedbona\n                            fideand properly and must not be abused. The court will\n                        prevent the improper use of its machinery. It will prevent the judicial\n                        process from being used as a means of vexation and oppression in the process\n                        of litigation. The categories of conduct rendering a claim frivolous,\n                        vexatious or an abuse of process are not closed and will depend on all the\n                        relevant circumstances of the case. 49     As a reminder, Mr Singh’s second\n                    argument is that the first proceedings could be continued by the inclusion of\n                    the 2010 Plaintiffs as parties to the proceedings, and the setting aside of the\n                    May 1999 Orders. The matters in dispute in the 2010 Proceedings were the same as\n                    those put in issue in OS 1052/1995, and hence, could be resolved within the\n                    first proceedings. The 2010 Proceedings were unnecessary, and as matters stood,\n                    there was duplicity of proceedings in relation to the disputes to be resolved. I\n                    disagreed. 50First, the\n                    institution of new proceedings is not of and in itself enough to constitute an\n                    abuse as described in the above passage fromGabriel Peter\n                        & Partners v Wee Chong Jinunless the court’s processes\n                    are being misused to achieve something not properly available to the plaintiff.\n                    Put another way, it is abusing the process of the court to bring a new action\n                    without good reason if the matters can be resolved within an existing\n                    action. 51     I earlier concluded that the institution of\n                    the 2010 Proceedings was not a collateral attack on the May 1999 Orders since no\n                    cause of action or issue estoppel arose from the May 1999 Orders (see[31]to[39]above). I have already explained that the institution of the 2010 Proceedings\n                    was understandable (see[45]to[46]above). The conduct of the 2010 Plaintiffs in\n                    using the 2010 Proceedings to obtain an interim injunction against D1 and D2 did\n                    not give rise to the inference that the proceedings werenotinstituted as proceedings intended to be genuinely pursued.\n                    Pleadings in the 2010 Proceedings have closed; D1 and D2 amended their defence a\n                    second time on 16 July 2010 before the adjourned hearing of the striking out\n                    applications on 12 August 2010. 52     I did not agree with Mr Singh’s\n                    submissions that the 2010 Plaintiffs in commencing the 2010 Proceedings had\n                    ignored the May 1999 Orders. In their Statement of Claim, a consequential relief\n                    was sought for the May 1999 Orders to be set aside. The trial judge would have\n                    to deal with the consequential relief as part and parcel of the resolution of\n                    the substantive dispute pertaining to,inter alia,\n                    ownership of the leasehold interest, the alleged early termination of the\n                    leases, the purported sale to BMS Hotel of the leasehold interest including the\n                    allegation of fraud and/or conspiracy on the part of the former trustee, and the\n                    present trustees’ (D1 and D2) claim to possession of the properties. Put\n                    simply, the substantive dispute is to be resolved first. If the dispute is\n                    resolved in favour of the 2010 Plaintiffs, the trial judge would make\n                    appropriate orders to set aside the May Orders and cancel their registrations in\n                    the Registry of Deed as well as give directions to put to rest the first\n                    proceedings. 53Second, contrary\n                    to Mr Singh’s argument, the matters to be adjudicated upon in the\n                    2010 Proceedings could not be easily resolved within the first proceedings by\n                    the 2101 Plaintiffs making a simple application in the first proceedings for an\n                    order under O 28 r 8 that OS 1052/1995 is to continue as if it had been begun by\n                    writ, and to seek directions for the service of pleadings. With Ali’s\n                    death and the bankruptcy of the former trustees coupled with certain\n                    developments in 1998, the state of affairs in the first proceedings became\n                    somewhat complicated, and thus ill-suited for an application under O 28 r 8. By\n                    comparison, the 2010 Proceedings, as a matter of procedure, is the more\n                    appropriate course because of complexity. I will now deal with the various\n                    complications that mired the first proceedings. (a)   Death and bankruptcy of the parties 54     Order 15 r 7 deals with (a) the death of a\n                    party; (b) the bankruptcy of a party; and (c) the assignment, transmission and\n                    devolution of the interest or liability of a party. Ali was defending in OS\n                    1234/1994, and suing in OS 1052/1995 in his personal capacity and as\n                    administrator of two estates and as attorney of two principals. In this case,\n                    Ali died and O 15 r 7 applies in so far as the proceedings related to\n                    Ali’s interest and in his capacity as administrator of two estates. Rule\n                    7(1) applies to a case where the cause of action “survives or\n                    continues” in some person on whom the estate has devolved, and that\n                    person has been joined in the proceedings under r 7(2) and is thus properly\n                    before the court. Before that happens (ie,\n                    joinder) the action cannot continue until the proper party is joined and before\n                    the court. 55     In so far as Ali’s principals (Fatimah\n                    and Buhaya) were concerned, the position in OS 1052/1995 was different.\n                    Strictly, the death of their attorney did not prevent the proceedings from\n                    continuing after the voluntary stay of proceedings pending the outcome of Civil\n                    Appeal No 10 of 1996. The Court of Appeal affirmed Chao J’s decision on 11\n                    November 1998. However, by 11 November 1998, something else happened. The last\n                    of the remaining former trustees, Ahmad Alhadad was declared a bankrupt on 30\n                    October 1998. Fatimah and Bubaya (who were the second and third plaintiffs in OS\n                    1052 of 1995, and the sixth and seventh defendants in OS 1234 of 1994) could not\n                    have continued with the proceedings because of the bankruptcy of the former\n                    trustees, or their removal as trustees in February 1998. 56     After Ali’s death, three of the former\n                    trustees became bankrupts. Jafaralsadeg, Salim and Ahmad were declared bankrupts\n                    on 16 January 1998, 26 June 1998 and 30 October 1998 respectively. Ibrahim was\n                    made a bankrupt on 13 September 1996. As bankrupts, the former trustees were\n                    disqualified from acting as trustees. OS 1052/1995 and OS 1234/1994 could not\n                    have continued against the former trustees in their capacity as trustees after\n                    their bankruptcy without leave of court. This is clear from s 130(1) of the\n                    Bankruptcy Act (Cap 20, 1996 Rev Ed) which provides as follows: In addition to any disqualification under any other written law, a\n                        bankrupt shall be disqualified from being appointed or acting as a trustee\n                        or personal representative in respect of any trust, estate or settlement,\n                        except with leave of court. 57     Upon disqualification, the bankrupt trustee\n                    must cease to act as trustee. If he continues to act whilst disqualified, the\n                    bankrupt trustee would be committing an offence which carries a jail term and\n                    fine. Under subsection (3), any person who acts as a trustee or personal\n                    representative while he is disqualified by virtue of subsection (1) shall be\n                    guilty of an offence and shall be liable on conviction to a fine not exceeding\n                    $5,000 or to imprisonment for a term not exceeding 12 months or to\n                both. 58     As can be seen, the former trustees could\n                    continue to defend the first proceedings if leave to act as trustees was granted\n                    under s 130(1). Otherwise, new trustees would have to be appointed, and\n                    substitution of parties applied for under O 15 r 7(2). Until such time, the\n                    former trustees were incompetent to act, and had no standing to defend the\n                    proceedings. 59     D1 said that he and Sharifah Fatimah were\n                    appointed new trustees of the estate of Ahmad Aljunied by Order of Court dated\n                    10 February 1998 in Originating Summons No 69 of 1998 (“the February\n                    1998 Order”). I pause to mention that the February 1998 Order vested\n                    properties previously held in trust for the estate of Ahmad Aljunied by the\n                    former trustees in favour of the new trustees. Hence, evidence of the transfer\n                    of the legal estate by way of the vesting order must be registered. However, the\n                    February 1998 Order was not registered until 25 November 2009. The\n                    significance of registration is that unless so registered, there is no\n                    admissible evidence of their interest in the properties under s 4 of the\n                    Registration of Deeds Act (Cap 269,1989 Rev Ed). Section 4\n                    states: ... all assurances ... and all probates and letters of administration ...\n                        by which any land in Singapore is affected ... may be registered ... and\n                        unless so registered shall not be admissible in any court as evidence of\n                        title to such land. Notably, in s 2, “assurance” is defined as\n                    including,inter alia, “any conveyance,\n                    memorandum of charge or discharge [and] order of court.” Chao J pointed\n                    out inSum Keong Realty Pte Ltd v Syed Jafaralsadeg\n                        Alhadad[1996] 2 SLR(R) 356 (“Sum Keong Realty”)at [18] that registration does not\n                    confer title; it merely affects priority (see section 14 of the Registration of\n                    Deeds Act). Any deed or instrument that proves one’s title to land is\n                    admissible in evidence only if that deed or instrument has been registered (see\n                    s 4 above). 60     Sharifah Fatimah later retired as trustee and\n                    D2 was appointed as trustee by way of an Indenture of Appointment dated 19\n                    October 2009. The Indenture of Appointment was registered on 25 November\n                    2009. 61     On either scenario (bankruptcy or removal of\n                    the former trustees as trustees), there was no joinder of the new trustees,\n                    Sharifah Fatimah and D1, in the first proceedings under O15 r 7. It would have\n                    been difficult to prove their vested interest without first registering the\n                    February 1998 Order in the Registry of Deeds. The February 1998 Order was only\n                    registered on 25 November, some 11 years later. 62     To summarise, the first proceedings could not\n                    continue (because of Ali’s death and on account of the bankruptcy of the\n                    former trustees as well) until the proper parties were joined in substitution\n                    and were before the court. To that extent, it was not inappropriate as it would\n                    save time and costs, be neater and less confusing to allow the disputes to be\n                    resolved in the 2010 Proceedings since the 2010 Plaintiffs and D1 and D2\n                    including BMS Hotel were parties to the 2010 Proceedings. (b)   Other developments 63     The most apparent and significant development\n                    in 1998 was the removal of the former trustees by Sharifah Fatimah and D1 in\n                    February 1998. It appeared that the former trustees had purported to sell other\n                    leasehold properties together with the freehold reversion in similar\n                    circumstances as was the case here and there had been litigation over those\n                    transactions. The 2010 Plaintiffs had named five sets of proceedings where the\n                    former trustees were unsuccessful. In the joint affidavit filed by Jamal and\n                    Kamal, the deponents referred to a decision of Warren Khoo J in Suit 1837\n                    of 1994:Syed Salim Alhadad & others v Dickson Holdings\n                        Pte Ltd[1997] 1 SLR(R) 228 (“Syed Salim Alhadad”). 64     In their joint affidavit of 19 May 2010, D1\n                    and D2 referred to the lineage of trustees which they had compiled from the\n                    documents available and exhibited in the joint affidavit as Appendix A. The\n                    lineage of trustees prepared by them included the Order of Court dated 27\n                    November 1992 (ie, the 1992 Order) in OS\n                    1122/1992, and it was maintained that pursuant to the 1992 Order, the properties\n                    belonging to the estate of Ahmad Aljunied were vested in the former\n                    trustees. 65     Notably, D1 and D2 had omitted to mention how\n                    and why D1 and Sharifah Fatimah came to replace the former trustees as trustees.\n                    It is significant that their application to remove the former trustees was made\n                    on 21 January 1998 after Khoo J’s decision. On 29 January 1997,\n                    Khoo J held that the 1992 Order was irregular. The significance of\n                    Khoo J’s decision was the court’s finding that two of the\n                    former trustees, Salim and Ahmad, were not persons beneficially interested in\n                    the estate of Ahmad Aljunied. As such, they had nolocus\n                        standito apply to court to be appointed trustees of the will of\n                    Ahmad Aljunied under s 60 of the Trustees Act (Cap 337, 1985 Rev\n                    Ed). Neither could they as administrators of one estate (the Alhadad estate)\n                    validly appoint Jafaralsadeg and Ibrahim as trustees of another trust (Ahmad\n                    Aljunied’s will trust). The effect of the decision is that the former\n                    trustees were not vested with the legal estate in the properties belonging to\n                    the estate of Ahmad Aljunied. 66     From the affidavits filed in Originating\n                    Summons No 69 of 1998 (“OS 69/1998”), it is clear that the former\n                    trustees consented to Sharifah Fatimah and D1’s application to remove them\n                    as trustees having confirmed in their joint affidavit that their appointment as\n                    trustees by the 1992 Order was found to be irregular by Khoo J inSyed Salim Alhadad(supra[63]). The former trustees also confirmed that they had not\n                    appealed against the decision of Khoo J. 67     Khoo J’s judgment related to the\n                    four properties in Suit No 1837 of 1994 (namely, Nos 1, 7, 9 and 17 Dickson\n                    Road), but the judgment is important as the 1992 Order vested all the properties\n                    in the estate of Ahmad Aljunied in the former trustees. Notably, the properties\n                    in the schedule annexed to the 1992 Order included Nos 18, 20 and 22 Upper\n                    Dickson Road. The same point was made by D1 in his joint affidavit with Sharifah\n                    Fatimah affirmed on 16 January 1998 in support of OS 69/1998 where he stated\n                    that the irregularity in the appointment of the former trustees was fundamental,\n                    and could affect the other properties in the estate of Ahmad Aljunied apart from\n                    the four properties referred to in Khoo J’s judgment (ieNos 1, 7, 9 and 17 Dickson Road), and the applicants\n                    went on to refer to other properties of interest to them, namely, Nos 38 and 39\n                    Market Street and No 44 High Street. 68     By parity of reasoning, the irregularity as\n                    described would equally call into question the former trustees’ standing\n                    and right to freely deal with the estate’s properties (hereafter referred\n                    to as “the capacity issue”); in particular, the validity of the\n                    sale of Nos 18, 20 and 22 Upper Dickson Road in 1994 to BMS Hotel. I am\n                    mentioning Khoo J’s judgment here because the first proceedings were\n                    brought against the former trustees in their capacity as trustees of the estate\n                    of Ahmad Aljunied by virtue of the 1992 Order. If they were not properly\n                    appointed as trustees following Khoo J’s decision in 1997, their\n                    status and the capacity in which they acted in the Conveyance would have to be\n                    reviewed and reconsidered in the first proceedings. In any case, the first\n                    proceedings against bankrupts in their personal capacity would be stayed under\n                    s 76(1)(c) of the Bankruptcy Act. Section 76(1)(c) provides as\n                    follows: On the making of a bankruptcy order – (c)    unless otherwise\n                            provided by this Act – (i)    no creditor to whom the bankrupt is indebted\n                                in respect of any debt provable in bankruptcy shall have any remedy\n                                against the person or property of the bankrupt in respect of that\n                                debt; and. (ii)   no action or proceedings shall be proceeded\n                                with or commenced against the bankrupt in respect of that\n                                debt, except by leave of the court and in accordance with such terms as the\n                        court may impose. 69     Despite the position taken by D1 in OS 69/1998\n                    (see[67]above), D1 and D2 had maintained\n                    in their defence and joint affidavit filed on 20 May 2010 in the 2010\n                    Proceedings that the Conveyance was correctly executed by the former trustees as\n                    trustees of the estate of Ahmad Aljunied. As noted, D1 had omitted to mention\n                    how and why D1 and Sharifah Fatimah came to replace the former trustees as\n                    trustees, and given the concern expressed in the joint affidavit that\n                    irregularity in the appointment of the former trustees was fundamental and could\n                    affect the other properties in the estate of Ahmad Aljunied, D1 and Sharifah\n                    Fatimah, for over a period of 11 years, did not register the February 1998 Order\n                    which vested in them the properties previously held in trust for the estate of\n                    Ahmad Aljunied by the former trustees. As stated, the significance of\n                    registration is that unless so registered, there is no admissible evidence of\n                    their interest in the properties. The delay in registration was not explained;\n                    if not now, it would have to be explained at some later stage. The apparent\n                    discrepancies noted above would have to be resolved at trial. 70     The 2010 Plaintiffs’ pleaded case is\n                    that the former trustees’ Conveyance and Confirmation were executed\n                    fraudulently. Admittedly, the capacity issue (see[68]above) was not a point that was directly raised in the\n                    pleadings. However, the particulars provided in the 2010 Proceedings were that\n                    the former trustees deliberately and wilfully conveyed the freehold reversion\n                    and the leasehold interest in the properties to BMS Hotel despite the fact that\n                    they knew or ought to have known that they did not have title or interest in the\n                    leases. In addition, the 2010 Plaintiffs had referred to Khoo J’s\n                    decision in their Statement of Claim. In the Statement of Claim, the 2010\n                    Plaintiffs noted that the former trustees had all been adjudicated bankrupts,\n                    but indicated their reservation in the pleadings to join the former trustees as\n                    defendants in their personal capacity. 71     This leads me to a related development that\n                    came up at the hearing of the striking out applications. There was the\n                    revelation that the Conveyance was executed even though the full sale\n                    consideration was not paid contrary to the former trustees’ acknowledgment\n                    of receipt of the consideration in the Conveyance. In their joint affidavit\n                    dated 20 May 2010, D1 and D2 at paragraph 47 disclosed that BMS Hotel\n                    “went into financial problems in its business in China and could not\n                    complete the terms and conditions of the sale”. The pleaded case in the\n                    Defence (Amendment No 2) is that ... there are sums due and owing by [BMS Hotel] to [D1 and D2] being the\n                        shortfall in the sale price of the Conveyance. BMS Hotel had consented to\n                        [D1 and D2] demanding for rental from the tenants and occupiers of the\n                        property in question so as to offset against the sums due and owing to [D1\n                        and D2]. 72     Mr Singh confirmed the shortfall of\n                    $500,000 of the sale proceeds, and despite this shortfall, the properties were,\n                    nonetheless, conveyed and title registered in the name of BMS Hotel. There was\n                    no explanation as to why that happened. Mr Singh submitted that the dispute\n                    on the shortfall between the trustees and BMS “would be settled and\n                    resolved”; it was a matter between the trustees and BMS Hotel and had\n                    nothing to do with the 2010 Plaintiffs. From this line of argument, it would\n                    seem that even after 16 years the shortfall of $500,000 has still not been paid.\n                    Mr Singh also explained that BMS Hotel had asked the trustees to collect\n                    rent from the tenants to set off this $500,000. However, D1 and D2 had not\n                    mentioned who in BMS Hotel gave the trustees permission to collect rental. All\n                    this is rather mysterious given the state of affairs in BMS Hotel. 73     That is not all. A different picture emerged\n                    from a recent letter from the Official Assignee. At the hearing on\n                    12 August 2010, Mr Singh produced a letter dated 1 July 2010 from\n                    the Official Assignee to his firm. It was a letter written in the context of the\n                    bankruptcy of Jafaralsadeg. The letter is interesting as it raised more\n                    questions about the purported sale of the properties to BMS Hotel which could\n                    only be resolved after a trial. The relevant paragraphs of the letter\n                    read: 3    Please be informed that BMS Hotel Properties Ltd has\n                            filed a proof of debt against the bankruptcy estate in relation to the\n                            consideration price of the properties at 18, 20 and 22 Upper Dickinson\n                            Road (“the Properties”). 4    With regard to the High Court Suit Nos 263 of 2010,\n                            264 of 2010 and 271 of 2010, we are not in any position to make any\n                            comment, as neither the Official Assignee nor the other bankrupts are a\n                            party to the suits. As far as we are aware of, no Writs were served on\n                            us, but please let us have the particulars of the plaintiffs’\n                            solicitors so we can follow up. 5    Please be informed that we have no objections to\n                            meeting all the relevant parties for the re-conveyance back of the\n                            Properties, to discuss a possible amicable solution. 74     Interestingly, BMS Hotel’s proof of debt\n                    was for the purchase price and it was treated as a debt against the estate in\n                    bankruptcy of Jafaralsadeg. The Official Assignee’s letter mentioned\n                    re-conveyance of the properties as an amicable solution, and asked to meet all\n                    interested parties. It seems to me that BMS Hotel’s position is that the\n                    former trustee, Jafaralsadeg, had no title or interest in the properties to\n                    effectively convey good title to BMS Hotel, and the proof of debt was to recover\n                    the proceeds of sale against the estate of Jafaralsadeg. Needless to say, the\n                    existence of the alleged shortfall of $500,000 and its repayment by setting off\n                    rentals must be explained in the light of the proof of debt filed by BMS Hotel\n                    against the estate of the bankrupt, Jafaralsadeg. Both versions are plainly\n                    inconsistent. 75     In summary, the developments as described\n                    opened up the prospect of a potential new line of argument, or provide material\n                    that might evidentially enhance the current plea of fraud and/or conspiracy in\n                    relation to the purported sale of the leasehold properties to BMS Hotel not\n                    previously known. That is quite different from the narrower line of argument\n                    taken in the first proceedings. Hence, having regard to all the facts and\n                    circumstances of this case, allowing the 2010 Proceedings to proceed would be\n                    the more appropriate course for the just, expeditious and economical disposal of\n                    the matters in dispute. By comparison, the first proceedings as it turned out\n                    would be ill-suited to resolve the intervening events and developments in the\n                    case. 76     For completeness, I should mention OS\n                    330/1995. It must be remembered that BMS Hotel, through its lawyers, on\n                    12 March 1996 had requested an adjournment of the hearing of the first\n                    proceedings pending the outcome of an appeal against the former trustees in\n                    another case involving different properties (ie,\n                    OS 330/1995). The reason given in the letter was that the former trustees in\n                    defending OS 1052/1995 were relying on the same arguments raised by the former\n                    trustees in OS 330/1995. BMS Hotel’s case in OS 1234/1994 was, in turn,\n                    dependent on the former trustees’ case as BMS Hotel’s claim to title\n                    was derived from the former trustees. In other words, the former trustees had\n                    raised common defences in various litigations involving different properties\n                    purportedly sold by the former trustees in circumstances similar to the case\n                    here. As stated earlier, D1 and D2 had pleaded the same common defences in their\n                    Defence (Amendment No 2) filed in the 2010 Proceedings. 77     As mentioned, Chao J ruled against the\n                    former trustees on 15 January 1996. He held that the plaintiff’s\n                    leasehold interest in the properties had not been extinguished. Chao J\n                    ruled on the following common defences: (a)     that the order of court in Petition\n                        Suit 304 of 1895 was conclusive proof of former trustees’ entitlement\n                        to the property. (SeeSum Keong Realty Pte Ltdat 358 for the text of the order in Petition Suit 304 of 1895 where the same\n                        order, which was relied upon by the same former trustees to claim that the\n                        leashold interest in the properties at 41 and 43 Dickson Road belonged to\n                        the trust created by the will of Ahmat Aljunied, was rejected.) Chao J\n                        held that the aforesaid order was not made by the court in exercise of\n                        probate, matrimonial, admiralty or bankruptcy jurisdiction, and as such\n                        s 43(2)(d) of the Evidence Act (Cap 97, 1990 Rev Ed) was not\n                        applicable. Whilst, the said order was in respect of the appointment of new\n                        trustees and the vesting of trust properties in them, there was no\n                        examination by the court as to the entitlement of Ahmad Aljunied to lots\n                        81-84. The said order could not vest in the former trustees assets which did\n                        not belong to Ahmad Aljunied. (b)     non registration of the leases in respect of lot 82 -84\n                        from Kavena Koonjan Chitty to Moona Keena Chitty (iethe head leases) under the Indian Act (No XVI of 1839) or\n                        the then newly enacted Registration of Deeds Ordinance, and hence could not\n                        be admitted in court as evidence of legal instruments. Furthermore, the\n                        lease granted by Kavena Koonjan Chitty to Moona Keena Chitty in respect of\n                        lot 81 at a yearly rent of one Spanish dollar was registered on 30 June\n                        1887, some nine years later. Chao J rejected that last point, holding\n                        that the Indian Act still applied in Singapore on 30 June 1887. On the\n                        effect of non-registration of the three leases affecting lots 82-84, Chao J\n                        held that the existence of the three leases, albeit not registered, had been\n                        established through other evidence. Clause 5 of the Indian Act was on the\n                        inadmissibility in evidence of an unregistered instrument and could not be\n                        read so widely as to render all unregistered deed void or\n                    invalid. 78     The Court of Appeal in Civil Appeal No 10 of\n                    1996 dismissed the former trustees’ appeal and affirmed Chao J’s\n                    decision on 11 November 1998. It must also be noted that the parties had agreed\n                    to adjourn the hearing of the first proceedings until the Court of\n                    Appeal’s decision in Civil Appeal No 10 of 1996. This was confirmed at a\n                    PTC held on 24 August 1996. So the delay of more than two years from 1996\n                    to 1998 could be accounted for. Delay 79     I have also conside red whether the 2010\n                    Proceedings should be struck out, nevertheless, in order to mark the\n                    court’s disapproval of the extraordinary delay of 11 years in bringing the\n                    2010 Proceedings. Mr Singh argued that there has been clear inordinate\n                    delay in pursuing the rights of the 2010 Plaintiffs. Mr Singh submitted\n                    that any delay in applying to set aside is relevant, particularly, if, during\n                    the period of delay, the successful party has acted on the judgment, or if third\n                    parties have acquired rights by reference to it. Furthermore, he argued that\n                    there was no proper explanation for the delay in pursuing the 2010\n                    Plaintiffs’ rights, and in the setting aside of the May 1999\n                    Orders. 80     Jamal and Kamal explained the delay in the\n                        2ndjoint affidavit filed on 3 June 2010.\n                    Ali’s estate took some time to settle due to the extent of the estate and\n                    the inability of the beneficiaries to make payment of the estate duty. In\n                    addition, there were several changes of solicitors handling the probate matter.\n                    There were difficulties obtaining consensus from beneficiaries of Ali’s\n                    estate. Ali had two wives. Kamal’s mother, his sister and he resided in\n                    Singapore. The other beneficiaries live in Jeddah, Yemen, Egypt and Europe.\n                    There was distrust amongst the beneficiaries especially his step siblings. For\n                    instance, Kamal himself was replaced as administrator of Ali’s estate by a\n                    relative named Murtadha Hussein Abdulqader. The other administrator is\n                    Kamal’s sister, Alwiyah binte Omar Bamadhaj. 81     Ali was the administrator on Noor’s\n                    estate. After Ali died, Jamal was approached by one of Noor’s\n                    beneficiaries in 2006 to act as administrator. After that an application for a\n                    Grant of Letters of Administration De Bonis Non was taken out and the Grant was\n                    issued on 6 August 2007. 82     Jamal deposed that Mohamad did not have any\n                    family in Singapore. In 2004, the fifth plaintiff in Suit 271 approached him to\n                    assist in respect of No 18. The fifth plaintiff himself resided in the UAE.\n                    Jamal found that he had to trace Mohamad’s family. He also had to\n                    ascertain the assets and properties of Mohamad to apply for letters of\n                    administration. As some of Mohamad’s assets were beneficial interests in\n                    other estates, more investigations had to be carried out. Jamal also had to\n                    visit various properties and to speak to tenants and occupiers to ensure that\n                    the properties could be traced to Mohamad. The Grant of Letters of\n                    Administration was only issued to Jamal on 28 April 2010, 83     Ali was the administrator of Fitom’s\n                    estate. All the direct beneficiaries of Fitom were dead. Jamal had to trace the\n                    derivative beneficiaries who all resided in the Middle East. Five derivative\n                    beneficiaries have given their Power of Attorney to Jamal. 84     I accepted that it would have been an arduous\n                    and time consuming task to obtain the necessary authority to act from the\n                    beneficiaries and derivative beneficiaries residing here and overseas. I also\n                    accepted that the delay was exceedingly long. Fortunately for the Ali Group, it\n                    was not just the Ali Group that had to attend to the requirements of O 15\n                    r 7 after Lai J’s orders on 18 August 1999 and 2 September 1999\n                    (see[28]above). The other parties to the\n                    first proceedings, the former trustees and BMS Hotel, also had a mire of\n                    problems so that despite the Ali Group’s exceedingly long delay, nothing\n                    significant happened for over 11 years. For instance, the removal of the former\n                    trustees as trustees and the appointment of D1 and Sharifah Fatimah as new\n                    trustees were not known. The new trustees did not step forward to take over the\n                    first proceedings from the former trustees. Outwardly, the former trustees\n                    continued as if there was no February 1998 Order. Mr Shah and Ms Netto\n                    continued to represent the former trustees until September 1999 (see[29]above). In any case, the former trustees\n                    would have ceased to be trustees by operation of s 310(1) of the Bankruptcy\n                    Act - the last of the four former trustees was declared a\n                    bankrupt in October 1998. As for BMS Hotel, the latter did not enforce the\n                    possession order of 28 May 1999, which order was registered on 21 June\n                    2004. Notably, D1 and D2 admitted that BMS Hotel was never in possession of the\n                    properties. Factually, over the last 11 years, the tenants and occupiers\n                    remained in occupation of the properties. It now appears that the Conveyance was\n                    executed and title to the properties registered in the name of BMS Hotel even\n                    though BMS Hotel had not paid the purchase consideration in full. Title to the\n                    properties is still in the name of BMS Hotel. The state of affairs in BMS Hotel,\n                    the bankruptcy of the former trustees, and the non registration of the February\n                    1998 Order vesting the properties belonging to Ahmad Aljunied in favour of D1\n                    and D2 until November 2009, all coincided and ironically, preserved the status\n                    quo with the tenants continuing to be in occupation, and paying rental as usual.\n                    In these special circumstances, I was minded to conclude that the effect of the\n                    delay on the prospects of a fair trial was not so real as to prevent a fair\n                    trial of the dispute which was whether the leasehold interest had terminated\n                    before the purported transfer of the properties to BMS Hotel in 1994. This part\n                    of the debate would involve tracing the root of title and interpreting the terms\n                    of the head leases and deeds of assignment. The other part is likely to be on\n                    the former trustees’ appointment as trustees which would affect their\n                    capacity to sell the properties and the validity of the Conveyance; questions\n                    relating to the shortfall of $500,000, and BMS Hotel’s proof of debt in\n                    respect of the proceeds of sale. There is also the matter of the recent claims\n                    against D1 and D2 for interfering with the tenants and rights of the 2010\n                    Plaintiffs in March 2010. 85     I was satisfied that to strike out the 2010\n                    Proceedings on ground of delay would be a wrong exercise of discretion in the\n                    present case and especially where there is no evidence of prejudice caused by\n                    the extraordinary delay. In my view, it would be wrong and inappropriate to\n                    strike out the 2010 Proceedings as the rights of property are in dispute. All\n                    the more so when the former trustees had lost in other proceedings involving\n                    different properties purportedly sold by the former trustees in circumstances\n                    similar to the case here and where the same common defences were raised (see for\n                    example the decision of Chao J in OS 330/ 1995 at[75]to[77]above). If the\n                    dispute is resolved in favour of the 2010 Plaintiffs, appropriate orders can be\n                    made to set aside the May 1999 Orders and cancellation of their registration in\n                    the Registry of Deeds.",
        "Other matters": "86     I have already commented on the effect of\n                    Order 15 r 7 on the first proceedings. I already said that there must be joinder\n                    of the proper party in substitution before the first proceedings could continue.\n                    It seems to me, and I make no decision on the May 1999 Orders which is for the\n                    forum hearing the application to set aside the May 1999 Orders, that the May\n                    1999 Orders were irregular and ineffectual. They were made at a time when the\n                    first proceedings were either already stayed under the Bankruptcy Act, or could\n                    not continue because there was no proper party in substitution. In the\n                    circumstances, Lai J’s order would also be an irregular order as it\n                    was brought about because of the previous irregular May 1999\n                Orders.",
        "Conclusion": "87     For the reasons stated, I dismissed the\n                    striking out application brought by D1 and D2 with costs fixed at $20,000 plus\n                    reasonable disbursements for all three summonses."
    }
}