{
    "case_title": "Singapore Piling & Civil Engineering Pte Ltd\n      v\n      Kim Teck Corp Pte Ltd and others",
    "ncitation": "[2010] SGHC 84",
    "coram": "Kan Ting Chiu J",
    "sections": {
        "The parties": "2       The plaintiff, Singapore Piling & Civil\n                    Engineering Pte Ltd is a Singapore company, and was the main contractor for a\n                    housing project in Sri Lanka (“the Project”). 3       The first defendant, Kim Teck Corporation Pte\n                    Ltd, is a company incorporated in the British Virgin Islands\n                    (“BVI”). It was appointed by the plaintiff as its sub-contractor\n                    for the aluminium and glazing works for the Project. Although it was included in\n                    the application for pre-discovery inspection, the application papers were not\n                    served on it. 4       The second defendant, Kim Teck Industries Pte\n                    Ltd, is a company incorporated in Singapore. 5       The third defendant, Lee Thian Hock, is a former\n                    director of the first defendant as well as the second defendant. He has been\n                    adjudicated a bankrupt in Singapore. He appeared in person before the AR to\n                    oppose the application, but has not appealed against the AR’s\n                    orders. 6       The fourth defendant, Wong Chai Kim, is a\n                    director of the second defendant and the third defendant’s\n                wife. 7       The fifth defendant, Lee Xiaohong, is also a\n                    director of the second defendant, and is the third and fourth defendants’\n                    daughter. She became a director on 18 August 2007 after the third defendant\n                    resigned on 15 July 2007.",
        "The underlying facts": "8       The plaintiff’s former managing director\n                    Teng Boon Kwee (“Teng”) was a business associate of the third\n                    defendant. Teng informed the latter of the Project and invited the second\n                    defendant to submit a quote for the aluminium and glazing works. 9       In response to the invitation, the second\n                    defendant submitted design drawings and calculations to the plaintiff in\n                    November and December 2004. However, in March 2005, a revised quotation was sent\n                    to the plaintiff in a letter bearing the letterhead of the first defendant with\n                    the address stated as “Balk.133, #03-303 – Jargon East St. 13\n                    Singapore 600133”, which bore some similarity to the second\n                    defendant’s address at Block 133 Jurong East Street 13 #03-303,\n                    Singapore 600133. This was followed by two further revised quotations dated\n                    8 October 2005 and 6 January 2006, bearing the same\n                letterhead. 10     Further discussions took place between Teng\n                    and the third defendant which ultimately led to the plaintiff’s award of a\n                    sub-contract valued in excess of US$2 million on 9 April 2006. This letter\n                    was issued to the first defendant at the address of the second\n                defendant. 11     In the course of the performance of the\n                    sub-contract, the plaintiff received instructions on the payments to be made. By\n                    a memorandum dated 13 February 2007 from the second defendant, the\n                    plaintiff was requested to make progress payments to a bank account in the name\n                    of the first defendant with United Overseas Bank Ltd in Ho Chi Minh City,\n                    Vietnam. The plaintiff complied with the instructions, and made payments into\n                    the account. 12     The sub-contract did not progress to the\n                    plaintiff’s satisfaction. The plaintiff complained of major defects,\n                    including sub-standard and poor quality materials and workmanship. This led to a\n                    breakdown in the relationship between the two parties, and eventually to the\n                    plaintiff’s application for pre-action discovery against the\n                    defendants.",
        "Basis for the application": "13     The plaintiff’s application was\n                    supported by two affidavits deposed by Lee Kim Huat (“Lee”), a\n                    director of the company. He deposed that: (a)     The plaintiff’s intention at\n                        the outset was to contract with the second defendant; (b)     Following the discussions between\n                        Teng, the plaintiff’s managing director at that time and the third\n                        defendant, the plaintiff sent a letter of award of the sub-contract to the\n                        first defendant; (c)     As a result of the third defendant’s representations, the\n                        plaintiff believed that the first defendant was incorporated in\n                        Singapore; (d)     At a\n                        meeting between Lee and one Victor Foo, both representing the plaintiff, and\n                        the third defendant on 28 May 2008, the third defendant informed Lee\n                        and Victor Foo that:[note: 1] [H]e had incorporated the 1st Defendants in the BVI. The 3rd Defendant\n                            also openly admitted that he knew he would make “losses”\n                            on the Project and hence decided to set up an offshore company in the\n                            BVI. He further said that he had “no qualms” should the\n                            Plaintiffs decide to take legal action against the 1st Defendants. These\n                            admissions and revelations by the 3rd Defendant came as a total surprise\n                            and shock to the Plaintiffs. (e)     The plaintiff\n                        made a company search on the first defendant and confirmed that the company\n                        was incorporated in the BVI. (It was not stated when the search was made.\n                        The certified copy of the certificate of incorporation exhibited was dated\n                        9 October 2008); (f)     A bankruptcy search on the third defendant revealed that he was\n                        adjudicated a bankrupt on 5 December 2003 and had remained\n                        undischarged; (g)     The plaintiff would not have awarded the sub-contract to the first\n                        defendant if the defendants had disclosed that the third defendant was a\n                        bankrupt and that the first defendant is a BVI company;\n                    and (h)     He believed\n                        that: … the 3rd Defendant conspired with the 1st, 2nd, 4th and 5th\n                            Defendants and has used the 1st Defendants to enter into the\n                            sub-contract in order to insulate the 2nd, 3rd, 4th and 5th Defendants\n                            from any exposure that they may have in respect of the\n                                Sub-Contract;[note: 2] that: [I]t seems to me that the 2nd, 3rd, 4th and/or 5th Defendant had used\n                            the 1st Defendants and their bank account in Vietnam as\n                            “conduit” to receive payments from the\n                                Plaintiffs;[note: 3] and that: [T]he 2nd, 3rd, 4th and 5th Defendants are likely to be defendants\n                            for, inter alia, misrepresentation, conspiracy and breach of duties in\n                            subsequent intended legal proceedings to be commenced by the\n                                Plaintiffs.[note: 4] 14     In its written submissions made in this\n                    appeal, the plaintiff acknowledged that:[note: 5] It is not in dispute that the 1st and 2nd Defendants are\n                        separate corporate entities. Thus the Plaintiffs will need to justify\n                        piercing the corporate veil of the 1st Defendant, and if so, the potential\n                        liabilities of the 2nd to 5th Defendants. The potential issues will\n                        include: a.    What was the true purpose of incorporating the\n                                1st Defendant by the 3rd Defendant? b.    Was the 1st Defendant used as a\n                                “façade” for the 2nd to 5th Defendants? c.    Whether the 2nd to 5th Defendants used the 1st\n                                Defendants as a “vehicle” to make money and/or in the\n                                event of loss, insulate themselves from liabilities? d.    Whether the 3rd Defendant is in fact analter egoof the 1st and 2nd\n                                Defendants? e.    Whether the 1st and/or 2nd Defendants’\n                                entire operations were controlled and managed by the 3rd\n                                Defendant? f.    Whether the 2nd to 5th Defendants had intended\n                                and/or used the 1st Defendants to evade legal\n                                obligations/liabilities under the Sub-Contract?",
        "The defendants’ response": "15     The defendants (except the first defendant\n                    which was not served) opposed the plaintiff’s application for pre-action\n                    discovery. The third defendant deposed an affidavit dated 30 January 2009\n                    to respond to the plaintiff’s allegations. He deposed that he had\n                    incorporated the first defendant in the BVI on 21 June 2002. He had not\n                    represented to Teng or any of the plaintiff’s representatives that the\n                    first defendant was incorporated in Singapore. Since its incorporation, the\n                    first defendant had undertaken aluminium subcontracting work in Third World\n                    countries, and had secured works in Vietnam in 2003, in Japan and Angola in 2004\n                    and had submitted quotations for other overseas projects. 16     The third defendant added that he and Teng had\n                    known one another for many years and were close business associates, and that\n                    Teng knew that he had been adjudicated a bankrupt and was undertaking jobs\n                    overseas. He also asserted that Teng knew that he was undertaking the work in\n                    the Project in the name of the first defendant from the two quotations the first\n                    defendant issued to the plaintiff, and that Teng knew that the first defendant\n                    and the second defendant were different entities and had intended for the\n                    plaintiff to contract with the first defendant. (The plaintiff did not adduce\n                    any response from Teng). 17     He also explained that the first\n                    defendant’s operations were based in Vietnam and the company also used the\n                    second defendant’s address as its postal address in Singapore. He had\n                    instructed his wife, the fourth defendant, who was in Singapore, to send\n                    documents to the plaintiff on behalf of the first defendant, but she may have\n                    sent some documents in the name of the second defendant to the plaintiff by\n                    mistake. 18     In any event, he denied that the first\n                    defendant had failed to discharge its obligations under the sub-contract with\n                    the plaintiff.",
        "The law on pre-action discovery": "19     An application may be made under O 24 of\n                    the Rules of Court (Cap 322, R5, 2006 Rev Ed) for pre-action\n                    discovery. O 24 r 6(3)(a) prescribes\n                    that any application shall be supported by an affidavit which must: (a) … state the grounds for the application, the material facts\n                        pertaining to the intended proceedings and whether the person against whom\n                        the order is sought is likely to be party to subsequent proceedings in\n                        Court; and r 7 provides that: … [T]he Court may, if satisfied that discovery is not necessary, or\n                        not necessary at that stage of the cause or matter, dismiss or, as the case\n                        may be, adjourn the application and shall in any case refuse to make such an\n                        order if and so far as it is of opinion that discovery is not necessary\n                        either for disposing fairly of the cause or matter or for saving\n                        costs. 20     The principal decision on this subject from\n                    our courts is the Court of Appeal’s decision inKuah\n                        Kok Kim and others v Ernst & Young[1996]\n                    3 SLR(R) 485 (“Kuah Kok\n                    Kim”). The Court held at [31] that a party may apply for\n                    pre-action discovery when it does not know if it has a viable claim against the\n                    defendant, and the pre-action discovery is to assist him in his search for the\n                    answer, and the Court went on to hold (at [59]) that when an application for\n                    pre-action discovery is made: … It was not the court’s function, at this stage of the\n                        application, to dwell into the merits of the case and to determine, based on\n                        what little available evidence, whether there is a good claim or not. The\n                        court’s duty is only to ensure that the application was not frivolous\n                        or speculative or that the applicants were [not] on a fishing\n                        expedition. The Court referred to a decision of the English Court of Appeal inDunning v Board of Governors of the United Liverpool\n                        Hospitals[1973] 2 All ER 454 which also dealt with\n                    pre-action discovery, where James LJ held at 460: … [T]he applicant for relief must disclose the nature of the claim\n                        he intends to make and show not only the intention of making it but also\n                        that there is reasonable basis for making it. Ill-founded, irresponsible and\n                        speculative allegation or allegations based merely on hope would not provide\n                        a reasonable basis for an intended claim in subsequent proceedings. 21     When a court has to rule on an application, it\n                    has to decide whether the applicant has presented material facts pertaining to\n                    the intended proceedings, and whether it has shown that the defendant to the\n                    application is likely to be a party in the intended proceedings. The burden on\n                    the applicant is not onerous. Nevertheless, an application should be made\n                    responsibly. Any application which is frivolous or speculative or in any way an\n                    abuse of the process of court will not be allowed. 22Kuah Kok Kimhas\n                    been applied in subsequent decisions. InBeckkett Pte Ltd v\n                        Deutsche Bank AG Singapore Branch[2003] 1 SLR(R) 321,\n                    the plaintiff took out an application for the defendant bank to give discovery\n                    of valuation reports of the plaintiff’s shares that the bank sold as\n                    pledgee. Discovery was not ordered because the plaintiff’s complaint that\n                    the shares were worth more than they were sold for was founded on insubstantial,\n                    incomplete, irrelevant and out-dated sources, and without obtaining a proper\n                    valuation of its own: at [21]. 23     InBayerische Hypo-und\n                        Vereinsbank AG v Asia Pacific Breweries (Singapore) Pte Ltd and other\n                        applications[2004] 4 SLR(R) 39 (“Asia Pacific Breweries”), several banks which\n                    were deceived by the brewery company’s finance manager into believing that\n                    they were making loans to the company obtained an order for pre-action discovery\n                    against the company. On appeal, Belinda Ang Saw Ean J ruled that the banks\n                    were not entitled to pre-action discovery as they had already come to the\n                    conclusion that they had a case against the company, and they should apply for\n                    discovery after proceedings were commenced. 24     InAsta Rickmers\n                        Schiffahrtsgesellschaft mbH & Cie KG v Hub Marine Pte Ltd[2006] 1 SLR(R) 283, the plaintiff chartered a vessel to Hub Lines Pte\n                    Ltd (“Hub Lines”) for two years. Two months into the charter, Hub\n                    Lines terminated the charter. The plaintiff obtained an arbitral award against\n                    Hub Lines, but the latter company had by then been wound up. The plaintiff then\n                    applied for pre-action discovery against Hub Marine Pte Ltd (“Hub\n                    Marine”). The application was made on the premise that Hub Lines and Hub\n                    Marine shared one common director and Hub Marine was linked to the charter in\n                    that: (a)In the survey report for the on-hire of the\n                            vessel, Hub Marine was named as the charterer;(b)Letters to the master of the vessel, sailing\n                            instructions and a circular were sent on the notepaper of the Hub\n                            Marine; and(c)The majority of the charter hire payments were\n                            made by Hub Marine.25     The plaintiff applied for pre-action discovery\n                    against Hub Marine to ascertain if Hub Marine was liable to pay the arbitral\n                    award. Tay Yong Kwang J allowed the application. He referred toKuah Kok KimandAsia Pacific\n                        Breweriesand concluded that:38    Applying the principles set out in O 24\n                            rr 6 and 7, as expounded by the cases … it seems to me that\n                            necessity must therefore be considered in the light of the purpose for\n                            which pre-action discovery is sought. Here, the plaintiff is trying to\n                            ascertain whether it has a cause of action against the defendant by\n                            lifting the corporate veil to uncover the real charterers of the vessel.\n                            …39    The plaintiff has not launched this application in\n                            order to try its luck by trawling in the open seas of chance to see\n                            whether it can ensnare some bigger fish to look to for the satisfaction\n                            of the arbitral award. It has set out several material facts for its\n                            belief that the defendant may have a much closer connection with Hub\n                            Lines than it has disclosed thus far. The defendant, on the other hand,\n                            seems to want the plaintiff to accept its word that it had no nexus\n                            whatsoever with Hub Lines. In my opinion, the plaintiff is entitled, in\n                            the light of the evidence it has uncovered thus far, to be sceptical\n                            about the disavowal of the defendant and to want to be certain that the\n                            defendant truly had no connection with Hub Lines beyond what it had\n                            acknowledged. The grounds relied on by the plaintiff are not frivolous\n                            or far-fetched in any way.Review of the present application26     The plaintiff knew that it was contracting\n                    with the first defendant. It now asserts that it would not have done so if it\n                    had known that the first defendant was a BVI company, and that the third\n                    defendant was a bankrupt.27     The plaintiff’s allegation of\n                    misrepresentation about the country of incorporation of the third defendant was\n                    that:[note: 6]At that time, based on the representations of the 3rd Defendant during the\n                        discussions relating to the various quotations made for and on behalf of\n                        himself as well as the 1st and 2nd Defendants, the … documents\n                        received from the 2nd Defendants and the various quotations from the 1st and\n                        3rd Defendants, the Plaintiffs were led to believe that the 1st Defendants\n                        were incorporated in Singapore. Thus, acting on and in reliance upon the\n                        1st, 2nd and 3rd Defendants’ representations that Kim Teck\n                        Corporations [sic] Pte Ltd (the 1st\n                        Defendants) was a company incorporated in Singapore, the Plaintiffs awarded\n                        the sub-contract to the 1st Defendants.28     It is to be noted that it fell short of\n                    stating that the third defendant had said that the first defendant was a\n                    Singapore company, but only that the plaintiff was led to believe that from\n                    unspecified representations of the third defendant, and the quotations and\n                    documents sent during the negotiations.29     The plaintiff could have requested for direct\n                    evidence on the incorporation of the first defendant, or it could have conducted\n                    its own search before awarding the sub-contract to the first defendant, but it\n                    did not do that, and it could be argued that it should bear responsibility for\n                    the consequences of its omissions.30     It was noteworthy that when the third\n                    defendant allegedly made the shocking admission on 28 May 2008 that he had\n                    incorporated the first defendant in the BVI because he knew he could make losses\n                    on the sub-contract, and he was not concerned if the plaintiff took action\n                    against the first defendant, the plaintiff did not seek further clarifications,\n                    explanations or assurances from the defendants. There was no record of any\n                    outrage or other response from the plaintiff.31     The plaintiff’s case was that it had\n                    obtained a certified copy of the certificate of incorporation of the first\n                    defendant dated 9 October 2008. That date suggested that the plaintiff did\n                    not take prompt action after 28 May 2008 to get the\n                certificate.32     There were serious doubts whether the third\n                    defendant had indeed made the admissions alleged by the plaintiff. It was not\n                    disputed that the third defendant was incorporated on 21 June 2002, more\n                    than three years before it was awarded the sub-contract by the plaintiff, and\n                    that it had taken on other projects before the sub-contract. The third defendant\n                    could hardly have incorporated the first defendant specifically in anticipation\n                    of losses from the sub-contract. There was no reason for the third defendant to\n                    lie about that and make himself out to be more dishonest.33     The plaintiff has to show that there is a\n                    reasonable basis to the application. The starting point was that the defendants\n                    had led it to believe that the first defendant was a Singapore company. There\n                    were no particulars given with respect to this allegation,eg, the terms of the representation and to whom it was made. It\n                    appears that Lee had assumed that the first defendant was a Singapore company\n                    because the third defendant had not told him that it was not.34     The related point that the plaintiff would not\n                    have awarded the sub-contract to the first defendant if it had known that the\n                    third defendant was an undischarged bankrupt was not based on any representation\n                    by the defendants but on the fact that they had not disclosed it. Beyond that,\n                    the third defendant’s assertion that Teng, the then managing director of\n                    the plaintiff had known of his status was not refuted by Teng or the\n                    plaintiff.35     Against this backdrop the plaintiff’s\n                    complaint that it was misled by the defendants’ misrepresentations did not\n                    form a reasonable basis for the application.36     There was another difficulty with the\n                    application. This was that the plaintiff was not seeking pre-action discovery to\n                    decide whether it has a claim against the defendants. The plaintiff had stated\n                    in no uncertain terms that it was led into awarding the sub-contract with the\n                    first defendant by the misrepresentations of the defendants, and that the third\n                    defendant had admitted to two representatives of the plaintiff that the first\n                    defendant was incorporated in the BVI specifically for that job to reduce or\n                    evade liability.37     That being the case, the plaintiff had enough\n                    in hand to sue the defendants. It should have the courage of its conviction and\n                    start legal proceedings against them, without seeking the court’s\n                    assistance to compel the defendants to give pre-action discovery to obtain more\n                    material for that purpose.Scope of discovery38     Furthermore, the plaintiff’s application\n                    for pre-action discovery was excessive in scope. The scope of the discovery\n                    sought should be relative to the justification for the application. In this\n                    case, the application was based on the alleged representation that the first\n                    defendant was a Singapore company and the third defendant was not a\n                    bankrupt.39     The discovery sought with respect to the first\n                    and second defendants included all statements of account and audited financial\n                    statements of the companies, all credit and debit notes issued by the companies,\n                    all invoices issued by the companies and all bank statements and bank documents\n                    addressed to the companies, from 2005 in the case of the first defendant, and\n                    from 2004 in the case of the second defendant. The discovery sought in relation\n                    to the third defendant included all bank statements and bank documents addressed\n                    to him from 2004. These documents sought by the plaintiff went beyond the\n                    reasons for its application.40     When the classes of discovery sought are\n                    unduly extensive the spectre of fishing arises. As an applicant for pre-action\n                    discovery must show a reasonable basis for its intended claim, the applicant\n                    should also show a reasonable basis for the discovery it seeks.Conclusion41     The defendants’ appeal is allowed. The\n                    AR’s orders for discovery and costs against the appellants are set aside.\n                    The plaintiff is to pay costs and disbursements here and below to the\n                    appellants, to be taxed if these are not agreed on.[note: 1]Lee Kim Huat’s 1st affidavit\n                                    filed on 12 December 2008, at para\n                        24[note: 2]Lee Kim Huat’s 1st\n                                        affidavit filed on 12 December 2008, at para\n                                    31[note: 3]Lee Kim Huat’s 1st\n                                        affidavit filed on 12 December 2008, at para\n                                    32[note: 4]Lee Kim Huat’s 1st\n                                        affidavit filed on 12 December 2008, at para\n                                    36[note: 5]Plaintiff’s written submissions for RA 93 of 2009, at para\n                                27[note: 6]Lee Kim Huat’s 1st affidavit filed on 12\n                                December 2008, at para 16",
        "Review of the present application": "26     The plaintiff knew that it was contracting\n                    with the first defendant. It now asserts that it would not have done so if it\n                    had known that the first defendant was a BVI company, and that the third\n                    defendant was a bankrupt. 27     The plaintiff’s allegation of\n                    misrepresentation about the country of incorporation of the third defendant was\n                    that:[note: 6] At that time, based on the representations of the 3rd Defendant during the\n                        discussions relating to the various quotations made for and on behalf of\n                        himself as well as the 1st and 2nd Defendants, the … documents\n                        received from the 2nd Defendants and the various quotations from the 1st and\n                        3rd Defendants, the Plaintiffs were led to believe that the 1st Defendants\n                        were incorporated in Singapore. Thus, acting on and in reliance upon the\n                        1st, 2nd and 3rd Defendants’ representations that Kim Teck\n                        Corporations [sic] Pte Ltd (the 1st\n                        Defendants) was a company incorporated in Singapore, the Plaintiffs awarded\n                        the sub-contract to the 1st Defendants. 28     It is to be noted that it fell short of\n                    stating that the third defendant had said that the first defendant was a\n                    Singapore company, but only that the plaintiff was led to believe that from\n                    unspecified representations of the third defendant, and the quotations and\n                    documents sent during the negotiations. 29     The plaintiff could have requested for direct\n                    evidence on the incorporation of the first defendant, or it could have conducted\n                    its own search before awarding the sub-contract to the first defendant, but it\n                    did not do that, and it could be argued that it should bear responsibility for\n                    the consequences of its omissions. 30     It was noteworthy that when the third\n                    defendant allegedly made the shocking admission on 28 May 2008 that he had\n                    incorporated the first defendant in the BVI because he knew he could make losses\n                    on the sub-contract, and he was not concerned if the plaintiff took action\n                    against the first defendant, the plaintiff did not seek further clarifications,\n                    explanations or assurances from the defendants. There was no record of any\n                    outrage or other response from the plaintiff. 31     The plaintiff’s case was that it had\n                    obtained a certified copy of the certificate of incorporation of the first\n                    defendant dated 9 October 2008. That date suggested that the plaintiff did\n                    not take prompt action after 28 May 2008 to get the\n                certificate. 32     There were serious doubts whether the third\n                    defendant had indeed made the admissions alleged by the plaintiff. It was not\n                    disputed that the third defendant was incorporated on 21 June 2002, more\n                    than three years before it was awarded the sub-contract by the plaintiff, and\n                    that it had taken on other projects before the sub-contract. The third defendant\n                    could hardly have incorporated the first defendant specifically in anticipation\n                    of losses from the sub-contract. There was no reason for the third defendant to\n                    lie about that and make himself out to be more dishonest. 33     The plaintiff has to show that there is a\n                    reasonable basis to the application. The starting point was that the defendants\n                    had led it to believe that the first defendant was a Singapore company. There\n                    were no particulars given with respect to this allegation,eg, the terms of the representation and to whom it was made. It\n                    appears that Lee had assumed that the first defendant was a Singapore company\n                    because the third defendant had not told him that it was not. 34     The related point that the plaintiff would not\n                    have awarded the sub-contract to the first defendant if it had known that the\n                    third defendant was an undischarged bankrupt was not based on any representation\n                    by the defendants but on the fact that they had not disclosed it. Beyond that,\n                    the third defendant’s assertion that Teng, the then managing director of\n                    the plaintiff had known of his status was not refuted by Teng or the\n                    plaintiff. 35     Against this backdrop the plaintiff’s\n                    complaint that it was misled by the defendants’ misrepresentations did not\n                    form a reasonable basis for the application. 36     There was another difficulty with the\n                    application. This was that the plaintiff was not seeking pre-action discovery to\n                    decide whether it has a claim against the defendants. The plaintiff had stated\n                    in no uncertain terms that it was led into awarding the sub-contract with the\n                    first defendant by the misrepresentations of the defendants, and that the third\n                    defendant had admitted to two representatives of the plaintiff that the first\n                    defendant was incorporated in the BVI specifically for that job to reduce or\n                    evade liability. 37     That being the case, the plaintiff had enough\n                    in hand to sue the defendants. It should have the courage of its conviction and\n                    start legal proceedings against them, without seeking the court’s\n                    assistance to compel the defendants to give pre-action discovery to obtain more\n                    material for that purpose.",
        "Scope of discovery": "38     Furthermore, the plaintiff’s application\n                    for pre-action discovery was excessive in scope. The scope of the discovery\n                    sought should be relative to the justification for the application. In this\n                    case, the application was based on the alleged representation that the first\n                    defendant was a Singapore company and the third defendant was not a\n                    bankrupt. 39     The discovery sought with respect to the first\n                    and second defendants included all statements of account and audited financial\n                    statements of the companies, all credit and debit notes issued by the companies,\n                    all invoices issued by the companies and all bank statements and bank documents\n                    addressed to the companies, from 2005 in the case of the first defendant, and\n                    from 2004 in the case of the second defendant. The discovery sought in relation\n                    to the third defendant included all bank statements and bank documents addressed\n                    to him from 2004. These documents sought by the plaintiff went beyond the\n                    reasons for its application. 40     When the classes of discovery sought are\n                    unduly extensive the spectre of fishing arises. As an applicant for pre-action\n                    discovery must show a reasonable basis for its intended claim, the applicant\n                    should also show a reasonable basis for the discovery it seeks.",
        "Conclusion": "41     The defendants’ appeal is allowed. The\n                    AR’s orders for discovery and costs against the appellants are set aside.\n                    The plaintiff is to pay costs and disbursements here and below to the\n                    appellants, to be taxed if these are not agreed on.  [note: 1]Lee Kim Huat’s 1st affidavit\n                                    filed on 12 December 2008, at para\n                        24 [note: 2]Lee Kim Huat’s 1st\n                                        affidavit filed on 12 December 2008, at para\n                                    31 [note: 3]Lee Kim Huat’s 1st\n                                        affidavit filed on 12 December 2008, at para\n                                    32 [note: 4]Lee Kim Huat’s 1st\n                                        affidavit filed on 12 December 2008, at para\n                                    36 [note: 5]Plaintiff’s written submissions for RA 93 of 2009, at para\n                                27 [note: 6]Lee Kim Huat’s 1st affidavit filed on 12\n                                December 2008, at para 16"
    }
}