{
    "case_title": "Gammon Pte Limited\n      v\n      JBE Properties Pte Ltd (SCDA Architects Pte Ltd, third\n            party)",
    "ncitation": "[2010] SGHC 130",
    "coram": "Chan Seng Onn J",
    "sections": {
        "Introduction": "1       This is an application by the plaintiff, Gammon\n                    Pte Limited, for an injunction to restrain the defendant, JBE Properties Pte\n                    Ltd, from receiving payment from BNP Paribas Singapore on a performance\n                    bond.",
        "Background facts": "2       The defendant is a developer and the owner of a\n                    building at 6 Handy Road (“the Building”). By a letter of award\n                    dated 19 January 2006, the defendant engaged the plaintiff to construct the\n                    Building for a sum of $11,515,000. SCDA Architects Pte Ltd\n                    (“SCDA”) was engaged as the architect and the superintending\n                    officer for the works. The contractual completion date was 17 May 2007.\n                    However, SCDA certified an extension of the completion date to 16 August\n                    2007. 3       During the period between 12 October 2007\n                    and 7 January 2008, defects with the façade cladding of the building were\n                    highlighted to the plaintiff through the issuance of superintendent officer\n                    instructions (“SOIs”). The plaintiff undertook to rectify these\n                    defects in its letter dated 28 January 2008. 4       On 12 February 2008, SCDA issued the\n                    completion certificate certifying completion on 16 January 2008\n                    (“completion certificate”). Enclosed with the completion\n                    certificate was a schedule of 52 outstanding classes of defects. To date, not\n                    all the defects have been rectified by the plaintiff. Owing to the\n                    plaintiff’s failure to remedy the outstanding defects despite several\n                    reminders by the defendant, the defendant called on the performance bond on 6\n                    and 27 February 2009 to fund the completion of the rectification work to be\n                    done by other contractors engaged by the defendant.",
        "The performance bond": "5       The relevant terms of the on-demand performance\n                    bond excerpted in the defendant’s submissions are as follows: Now in consideration of the Employer not insisting on the Management\n                        Contractor paying ten (10) percent of the total value of the Contract as a\n                        security deposit for the said Contract, we (at the request of the Management\n                        Contractor) hereby agree as follows: 1.    In the event of the Management Contractor failing\n                            to fulfil any of the terms and conditions of the said contract, we shall\n                            indemnify the Employer against all losses, damages, costs, expenses or\n                            otherwise sustained by the Employer thereby up to the sum of Singapore\n                            Dollars One Million, One Hundred and Fifty One Thousand and Five Hundred\n                            Only (S$1,151,500.00) (“the Guaranteed Sum”) upon\n                            receiving your written notice of claim for payment made pursuant to\n                            Clause 4 hereof. 2    We shall not be discharged or released from this\n                            guarantee by any arrangement between yourself and the Management\n                            Contractor with or without our consent or by any alteration in the\n                            obligations undertaken by the Management Contractor or by any\n                            forbearance whether as to payment, time, performance or\n                            otherwise. … 4    This guarantee is conditional upon a claim or\n                            direction as specified herein being made by you by way of a notice in\n                            writing addressed to us and the same being received by us at 20 Collyer\n                            Quay #04-01 Tung Centre Singapore 049319 within 180 days from the expiry\n                            of this guarantee… … 5    We shall be obliged to effect the payment required\n                            under such a claim or direction within 30 business days of our receipt\n                            thereof. We shall be under no duty to inquire into the reasons,\n                            circumstances or authenticity of the grounds for such claim or direction\n                            and shall be entitled to rely upon any written notice thereof received\n                            by us (within the period specified in Clause 4 hereof) as final and\n                            conclusive.",
        "Unconscionability": "6       The plaintiff did not dispute that there were\n                    outstanding defects but alleged that it would be unconscionable for the\n                    defendant to call on the performance bond. It is settled law in Singapore that\n                    in addition to fraud, an injunction to restrain a call on a performance bond may\n                    be granted on the ground of unconscionability. Whether unconscionability can be\n                    established largely depends on the factual matrix of each case. 7       The Court of Appeal inDauphin Offshore Engineering & Trading Pte Ltd v The Private Office of\n                        HRH Sheikh Sultan bin Khalifa bin Zayed Al Nahyan[2000]\n                    1 SLR(R) 117 at [38] citedRaymond Construction Pte\n                        Ltd v Low Yang Tong & Anor[1996] SGHC 136 (per Lai\n                    Kew Chai J, at [5]) for the proposition that: …The concept of ‘unconscionability’ to me involves\n                        unfairness, as distinct from dishonesty or fraud, orconduct of a kind so reprehensible or lacking in good faiththat a court of conscience would either restrain the party or refuse to\n                        assist the party.Mere breaches of contract by the party\n                            in question … would not by themselves be\n                            unconscionable. … [emphasis added]",
        "Outstanding sums due to defendant inclusive of the cost of\n                rectification": "8       The outstanding sums due to the defendant to\n                    date inclusive of the cost of rectification of outstanding defects were set out\n                    by the defendant in its written submissions as follows: OUTSTANDING SUMS DUE TO THE\n                                        DEFENDANTS/NoItem of claimAmount (SGD)1Rectification of non-cladding\n                                            defects in SOI 266/08 based on the lowest quotation from\n                                            TLT dated 15 April 2009 (inclusive of\n                                    GST)$455,905.602Rectification of Cladding\n                                            Defects in SOI 266/08 and SOI 271/08 (awarded to Weng\n                                            Thai Construction)$2,200,800.003Technical Support &\n                                            service by Econflo Systems$321.004Replacement of Door panels\n                                            & Base unit side gable by KHL\n                                        Marketing$2,323.805Claim from the tenant of\n                                            #04-02 due to the inhabitable condition of the unit\n                                            during defects rectification$1,052.506Liquidated damages from\n                                            Extended Completion Date to Completion Date(17 August 2007 to\n                                            16 January 2008: 153 days at $2,000 per\n                                        day)$306,000.00SUB-TOTAL$2,966,402.90SUMS CERTIFIED TO THE\n                                        PLAINTIFF7Interim Certificate\n                                            No 22($582,528.31)8Interim Certificate\n                                            No 23($563,676.00)SUB-TOTAL$1,146,204.31NETT\n                                                AMOUNT DUE TO THE DEFENDANT$1,820,198.59   9       The defendant justified the call on the\n                    performance bond on the basis that the outstanding sum due to it was\n                    $1,820,198.59 (which included a sum of $2,200,800 as the cost of rectification\n                    of the cladding defects). 10     In my view, the plaintiff had shown a strong\n                    prima facie case of unconscionability. The glaring item was defendant’s\n                    claim of $2,200,800 for the rectification of cladding defects in SOI 266/08 and\n                    SOI 271/08 which according to the defendant was awarded to Weng Thai\n                    Construction (“WTC”) on 10 February 2009. The plaintiff alleged\n                    that the award to WTC was a sham. The letter of award was a one page document\n                    with no scope of work detailed at all. No time frame to carry out the work\n                    was specified. The method of rectification was not stipulated. The address of\n                    WTC was an HDB flat which appeared to be owned and occupied by one Mr Teoh\n                    Weng Thai. WTC did not appear to have any expertise in design, fabrication and\n                    installation of cladding. WTC operated as a sole proprietor and was owned by\n                    someone not known in the industry. WTC’s incompetence in carrying out the\n                    rectification works was confirmed by its supposed intention to appoint another\n                    entity, CLK Systems Pte Ltd, to carry out the work. The price of $2,200,800 for\n                    the contract awarded to WTC was wholly out of proportion to the value of the\n                    works. By comparison, the sub-contract awarded to Seiko for the design, supply\n                    and installation of the curtain wall and glazing works was for only $1,690,000.\n                    The portion to design, fabricate, supply and install the aluminium panel\n                    cladding for the whole façade of the building was only S$371,664. However, the\n                    price quoted by WTC for merely rectifying the defects to the aluminium panel\n                    cladding was a hefty six times more. 11     I concluded that WTC’s tender price of\n                    S$2.2 million essentially to repair some 83 relatively minor cladding defects\n                    was astronomical and grossly inflated so as to enable the defendant to justify\n                    the call on the full sum of the performance bond. Serious questions had crossed\n                    my mind as to whether there was collusion between the defendant and WTC in this\n                    regard. 12     According to the plaintiff, the defendant\n                    still had not paid the plaintiff the following sums: (a)Interim Certificate\n                                            No 22/09 dated 21 January\n                                    2009$543,000.00(b)Interim Certificate\n                                            No 23/09 dated 16 April 2009$526,800.00(c)Retention\n                                        (2.5%)$287,875.00(d)Admitted prolongation\n                                            costs$347,237.64TOTAL$1,704,912.64   13     On top of this sum due to the plaintiff, the\n                    defendant still sought to call on the performance bond for a further sum of\n                    S$1,151,500. The total amount in excess of $2.9m which the defendant claimed the\n                    plaintiff owed primarily for defective works amounted to more than 25% of the\n                    original contract value of $11,515,000, which the defendant awarded to the\n                    plaintiff to construct theentirebuilding. It\n                    would in my view be most surprising that SCDA would have issued a completion\n                    certificate certifying that the works were in all respects completed (save for\n                    52 minor outstanding works) when some $2.9 m worth of rectification works\n                    remained outstanding if the defendant were to be believed. 14     This indicated to me that there was gross\n                    exaggeration of the costs of rectification of outstanding defects made in\n                    support of the defendant’s call on the bond. A call on the performance\n                    bond in this fashion was clearly unconscionable, abusive and bordered on being\n                    fraudulent. 15     InGHL Pte Ltd v Unitrack\n                        Building Construction Pte Ltd and another[1999]\n                    3 SLR(R) 44, the Court of Appeal addressed an instance where the call\n                    would be unconscionable at [24]: ... We are concerned withabusivecalls on\n                        the bonds. It should not be forgotten that a performance bond can be used as\n                        an oppressive instrument, and in the event that a beneficiary calls on the\n                        bond in circumstances, where there isprima\n                            facieevidence of fraud or unconscionability, the court\n                        should step in to intervene at the interlocutory stage until the whole of\n                        the circumstances of the case has been investigated. ... [emphasis\n                        added] 16     In the course of the hearing, I asked the\n                    plaintiff to obtain quotations so that a comparison could be made with\n                    WTC’s tender price. The quotations obtained by the plaintiff were so much\n                    lower than those obtained by the defendant. Five quotations were obtained and\n                    the highest of those was $560,000 based on a total replacement of the panels.\n                    The next highest quotation was $335,000 based on repairing the panels. These\n                    were nowhere near the amount quoted by WTC. These huge discrepancies confirmed\n                    my belief that WTC’s price of $2,200,800 for the panel repairs had been\n                    grossly inflated. I had grave doubts that WTC’s quotation for the\n                    rectification work obtained by the defendant was not a sham.",
        "Orders made": "17     Accordingly, I made the following\n                    orders: (a)     Call on the bond is to be deferred\n                        until further order, with liberty to apply; (b)     All rectification works to be completed by the\n                        plaintiff within 6 months. Inspection of rectification work to be carried\n                        out in the month of October 2010; (c)     Any dispute on the quality of the rectification works in\n                        accordance with the warranty will be determined by the court. If the court\n                        determines that the rectification works in accordance with the standard set\n                        out in the warranty is not satisfied, the court may direct that, subject to\n                        call on the bond, a joint tender be carried out in order to rectify the\n                        balance of the unrectified defects as determined by the court. The\n                        completion of the balance of rectification works, through the joint tender,\n                        shall be deemed to be in accordance with the standard set out in the\n                        warranty. The specifications for the contractors for the joint tender, shall\n                        be the original specifications for the works; and (d)     Costs are\n                reserved."
    }
}