{
    "case_title": "Littau Robin Duane\n      v\n      Astrata (Asia Pacific) Pte Ltd",
    "ncitation": "[2010] SGHC 361",
    "coram": "Tay Yong Kwang J",
    "sections": {
        "Introduction": "1       The plaintiff was a former group regional\n                    director of the defendant. Between March 2005 and December 2009, he was employed\n                    in various senior executive and managerial positions in the Asia-Pacific region.\n                    During his employment, he signed a Confidentiality, Restrictions &\n                    Intellectual Property Agreement (“the non-compete agreement”) with\n                    the defendant. On 11 September 2009, the plaintiff gave three\n                    months’ notice of his resignation. His last day of employment would\n                    therefore have been 10 December 2009. However, on 9 December 2009, the\n                    defendant purported to dismiss him summarily with immediate\n                effect. 2       The defendant was incorporated in Singapore in\n                    October 2003. It is in the business of designing and developing location-based\n                    information technology services and solutions (telematics). These solutions\n                    enable businesses and government organizations to monitor, trace and control the\n                    movement and status of machinery, vehicles, personnel and other assets. The\n                    defendant’s business dealings are often confidential as they pertain to\n                    matters of security and defence. It is part of the Astrata Group of companies\n                    which comprises Astrata (Singapore) Pte Ltd (“ASP”) and Astrata\n                    Group Inc (“AGI”), a USA company. AGI is the parent company of the\n                    defendant which is in turn the parent company of ASP. 3       The plaintiff commenced an action for the salary\n                    due to him from September to 10 December 2009 and for payment of expenses\n                    and accrued leave. The defendant filed its defence and counterclaim alleging\n                    that the plaintiff had breached his duties by giving information to certain\n                    entities (“the US parties”) resulting in the defendant having to\n                    incur extra costs to defend a Chapter 11 proceeding in the USA. Just before\n                    the defendant applied for an interim injunction and a search order against the\n                    plaintiff, it sought leave to amend its defence and counterclaim to include a\n                    new claim for breach of the non-compete agreement. Its application was allowed\n                    save for the prayer asking for leave to use the evidence obtained in this action\n                    in any other proceedings between the Tridex Companies and the defendant’s\n                    group of companies. 4       On 21 June 2010, the defendant applied for\n                    and obtained an interim injunction and search orders against the plaintiff.\n                    These orders were extracted as order no. 2968 of 2010 (“the\n                    injunction”), order no. 2969 of 2010 and order no. 2986 of 2010\n                    (“the search orders”). Among other things, the defendant alleged\n                    that the plaintiff had approached its customers and business partners (namely\n                    COSEM, the Tridex Companies and TNT). The injunction enjoined the plaintiff from\n                    giving confidential information to third parties and from breaching the\n                    non-compete agreement. The search orders were directed at evidence that the\n                    plaintiff had given information to the US parties as well as his breach of the\n                    non-compete agreement. The search orders were extended by the court on\n                    25 June 2010, extracted as order no. 3082 of 2010, as the physical\n                    imaging of the plaintiff’s gmail account could not be completed in time. A\n                    moratorium of two weeks was ordered against perusal of any materials obtained as\n                    a result of these orders and if the plaintiff should apply within two weeks to\n                    set aside or to vary the orders, the prohibition against perusal would continue\n                    until further notice. 5       There were two applications in issue here. In\n                    summons no. 3229 of 2010, the plaintiff sought to set aside the orders\n                    mentioned above, the return of certain items, the prohibition against usage of\n                    those items in any legal or arbitral proceedings against the plaintiff or other\n                    entities, the non-disclosure of the items’ contents, an inquiry as to\n                    damages and costs. In summons no. 3351 of 2010, the defendant applied for a\n                    copy of an email sent from one James Lau to the plaintiff on 19 April 2010\n                    (“the James Lau email”) to be made available to the defendant or\n                    its solicitors, that the moratorium be lifted in respect of that email and that\n                    the defendant be permitted to use it in this action and for costs. 6       After hearing the parties, I varied order\n                    no. 2969 of 2010 by setting aside that part of paragraph 2 that\n                    allowed the defendant to use the information and documents disclosed or produced\n                    pursuant to the search orders for purposes of any claim against the plaintiff as\n                    well as the Tridex Companies in and outside Singapore (“the arguments on\n                    theRiddickprinciple”). All other orders\n                    granted were ordered to stand. I also lifted the moratorium against perusal and\n                    ordered costs at 90% to be paid by the plaintiff to the defendant, the deduction\n                    of 10% being the costs attributed to the arguments on theRiddickprinciple. No stay was granted in respect of these\n                    orders. I directed the parties’ solicitors to review the disputed\n                    documents obtained and try to come to an agreement whether they fall within the\n                    ambit of the search orders, failing which the plaintiff may apply to court to\n                    resolve the matter. 7       The plaintiff has appealed to the Court of\n                    Appeal against these orders.",
        "Background to the dispute": "8       In the course of the plaintiff’s\n                    employment, he signed, in 2007, the non-compete agreement which contained the\n                    following pertinent terms: RESTRICTIVE COVENANTS 3.2    The Employee will not without the prior consent of\n                            the Company directly or indirectly and whether alone or in conjunction\n                            with or on behalf of any other person and whether as a principal,\n                            shareholder, director, employee, agent, consultant, partner or\n                            otherwise: 3.2.1 within the Restricted Territory for a period of\n                            12 months from the Termination Date be engaged, concerned or interested\n                            in, or provide technical, commercial or professional advice to, any\n                            other business which supplies Products or Services in competition with\n                            the Company or any Relevant Group Company provided that this restriction\n                            does not apply to prevent the Employee from holding shares or other\n                            securities in any company which is quoted, listed or otherwise dealt in\n                            on a recognised investment exchange or other securities market and which\n                            confer not more than three per cent of the votes which could be cast at\n                            a general meeting of such company; or … 3.2.3 within the Restricted Territory for a period of\n                            12 months from the Termination Date be engaged, concerned or interested\n                            in any business which is or was at any time during the Relevant Period a\n                            Relevant Customer if such engagement, concern or interest causes or\n                            would cause the Relevant Customer to cease or materially reduce its\n                            orders or contracts with the Company or any Relevant Group company;\n                            or 3.2.4 for a period of 12 months from the Termination\n                            Date so as to compete with the Company or any Relevant Group Company\n                            canvass, solicit or approach or cause to be canvassed, solicited or\n                            approached any Relevant Customer for the sale or supply of Produces or\n                            Services including any Relevant Products or Services or endeavour to do\n                            so; or 3.2.5 for a period of 12 months from the Termination\n                            Date so as to compete with the Company or any Relevant Group Company\n                            deal or contract with any Relevant Customer in relation to the sale or\n                            supply of Products or Services or any Relevant Products or Services, or\n                            endeavour to do so; … CONFIDENTIALITY 4.1    The Employee acknowledges that in the ordinary\n                            course of his employment he will be exposed to information about the\n                            business of the Company and the Group and that of the Company’s\n                            and the Group’s suppliers and customers which amount to a trade\n                            secret, is confidential or is commercially sensitive and which may not\n                            be readily available to others engaged in a similar business to that of\n                            the Company or any of the Group Companies or to the general public and\n                            which if disclosed will be liable to cause significant harm to the\n                            Company or such Group Companies. The Employee has therefore agreed to\n                            accept the restrictions in this clause 4. 4.2    The Employee will not during the period of his\n                            employment with the Company obtain or seek to obtain any financial\n                            advantage (direct or indirect) from the disclosure of such information\n                            acquired by him in the course of his employment with the\n                        Company. 4.3    The Employee will not either during his employment\n                            (including without limitation any period of absence or of exclusion\n                            pursuant to any period of garden leave duly authorized by his contract\n                            of employment) or after its termination without limit in time for his\n                            own purposes or any other purposes other than those of the Company or\n                            any Group Company (for any reasons and in any manner) use or divulge or\n                            communicate to any person, firm, company or organization, except to\n                            officials of any Group Company who are entitled to know, any secret or\n                            confidential information or information constituting a trade secret\n                            acquired or discovered by him in the course of his employment with the\n                            Company relating to the private affairs or business of the Company or\n                            any Group Company or its/their suppliers, customers, management or\n                            shareholders. 9       The “Termination Date” referred to\n                    would be 9 December 2009 according to the defendant and 10 December\n                    2009 according to the plaintiff. “Products or Services” was\n                    defined as referring to products or services of the same kind or materially\n                    similar kind or competitive with any products or services sold or supplied by\n                    the defendant or any Relevant Group Company. “Relevant Customer”\n                    referred to any person or organization who/which during the Relevant Period is\n                    or was negotiating with the defendant and a Relevant Group Company for the sale\n                    or supply of Relevant Products or Services or a client or customer of the\n                    defendant or any Relevant Group Company for the sale and supply of Relevant\n                    Products or Services or in the habit of dealing with the defendant or any\n                    Relevant Group Company for the sale or supply of Relevant Products or Services\n                    and in each case with whom or which the plaintiff was directly concerned or\n                    connected or of whom or which the defendant had personal knowledge during the\n                    Relevant Period in the course of his employment. In this case, the Relevant\n                    Customers included the Tridex Companies, COSEM and TNT. “Relevant Group\n                    Company” referred to any Group Company for which the plaintiff had\n                    performed services under his agreement or for which he had operational or\n                    management responsibility at any time during the “Relevant\n                    Period”, which in turn referred to the period of 12 months immediately\n                    before the Termination Date. “Relevant Products or Services” were\n                    the sale or supply of products or services with which the plaintiff was directly\n                    concerned or connected with or of which he had personal knowledge during the\n                    Relevant Period in the course of his employment with the defendant. As the\n                    plaintiff was the managing director of the defendant and a director of its\n                    subsidiary, he had personal knowledge of all the products and services provided\n                    by the defendant and its subsidiary. “Restricted Territory” would\n                    be any place in the world where the defendant or any Relevant Group Company had\n                    carried on business during the Relevant Period. 10     The plaintiff admitted that he met James Tan\n                    of COSEM, a Relevant Customer, business partner and potential competitor of the\n                    defendant. He also approached another customer, the Tridex Companies, for\n                    business leads. The plaintiff had been photographed meeting James Tan and James\n                    Lau (a Tridex employee). He acknowledged that he contacted Tony Lugg, the\n                    security manager of TNT, sometime in May 2010. COSEM, the Tridex Companies and\n                    TNT were major customers of the defendant during the plaintiff’s\n                    employment. The nature of the defendant’s business was that at any one\n                    point of time, it would be mainly involved in a few select projects with a few\n                    major customers. It was not a business with multiple customers. 11     COSEM’s website indicated that it dealt\n                    with vehicle tracking and fleet management systems and could design solutions to\n                    enable businesses to efficiently allocate and track the movement and location of\n                    their vehicles anywhere. Its services therefore compete directly with those\n                    provided by the defendant. COSEM also works on projects in collaboration with\n                    the defendant. It still wishes to bid with the defendant for a project for speed\n                    monitoring and control of heavy vehicles in Singapore. It is therefore also a\n                    Relevant Customer or business partner. The plaintiff admitted that James Tan of\n                    COSEM had asked him to look at a draft quotation for supply of an automatic\n                    truck tracking system and give his views. The plaintiff did so and informed\n                    James Tan that he thought the quotation was reasonable. By doing so, the\n                    plaintiff breached clause 3.2.1 of the non-compete agreement although it\n                    was unclear whether the quotation was to or by COSEM. Further, as the defendant\n                    was able to provide the same or a similar tracking system to COSEM, the\n                    plaintiff was also in breach of clause 3.2.3 as he would cause COSEM to\n                    cease or to reduce its order from the defendant. The plaintiff’s conduct\n                    and the surrounding circumstances provided a strongprima\n                        faciecase of breach of his obligations to the defendant which\n                    the plaintiff was not able to rebut by his bare assertions. 12     The plaintiff stated that he was working on\n                    and providing an Asterisk Fingerprint Access Control System to COSEM with Lau\n                    Hui Jen, also a former employee of the defendant. They incorporated a company\n                    called SGT Pte Ltd on 7 June 2010. The plaintiff denied competing with the\n                    defendant. He claimed that the said biometric access system was not in\n                    competition with the defendant and sought to support his claim by producing a\n                    one-page brochure (as an exhibit in Lau Hui Jen’s affidavit). He also\n                    averred that he was entitled to meet the defendant’s\n                customers. 13     The defendant disagreed that its business was\n                    only in vehicle tracking and in geomatics in the oil and gas industry. Its core\n                    technology is sufficiently versatile to be adapted to perform a number of\n                    different functions such as biometric access control if its customers wanted to\n                    have that. Accordingly, the defendant argued, even if the plaintiff and Lau Hui\n                    Jen were not using the defendant’s proprietary technology, they were\n                    engaging in the sale or supply of products and services of the same or\n                    materially similar kind or competitive with the defendant’s products and\n                    services. By dealing with COSEM and/or possibly Tridex on the biometric access\n                    control system, the plaintiff breached clause 3.2.5 of the non-compete\n                    agreement. 14     The plaintiff admitted that he met James Tan\n                    of COSEM for lunch on numerous occasions to discuss various subjects. Lau Hui\n                    Jen has effectively admitted that he and the plaintiff have solicited and\n                    conducted business with COSEM. The plaintiff was therefore in breach of\n                    clause 3.2.4 of the non-compete agreement. Similarly, the plaintiff has\n                    admitted trying to get business or business leads from the Tridex Companies\n                    although he claimed that it was not in any areas that the Astrata Group was\n                    involved in. Tridex was a major customer of ASP during the time of the\n                    plaintiff’s employment. 15     Although the plaintiff asserted that he did\n                    not know whether Lau Ming Chiew (mentioned in the search orders) was James Lau,\n                    he accepted that James Lau, an employee of Tridex Technologies Pte Ltd, had\n                    picked him up from his home before. The plaintiff had also evaded overtures by\n                    the defendant to show him photographs of Lau Ming Chiew to see whether that was\n                    the James Lau that he knew. The James Lau email was found in the\n                    plaintiff’s home. Its heading was “Greetings from\n                    Territory”. As shown by the defendant, “Territory” was the\n                    code name for the supply of the defendant’s products and services to the\n                    Tridex Companies. Pending perusal of that email, the defendant submitted that it\n                    was likely to be an update from James Lau regarding the project between the\n                    defendant and Tridex. The plaintiff has made known to the supervising solicitor\n                    his objection to release the said email to the defendant or its solicitors\n                    unless there is an order of court directing or permitting such release on the\n                    basis that he was not sure whether James Lau was Lau Ming Chiew and therefore\n                    whether the James Lau email fell within the scope of the search\n                orders. 16     The defendant contended that it has\n                    established a strongprima faciecase of breach by\n                    the plaintiff of the non-solicit obligations contained in clause 3.2.4 of\n                    the non-compete agreement in the light of the plaintiff’s admission that\n                    he had met up with Tridex employees on numerous occasions to try to obtain\n                    business from the Tridex Companies and his evasive attitude regarding the James\n                    Lau email. There was also a strong possibility that he had breached\n                    clauses 3.2.1, 3.2.5 and 4.3. 17     Where TNT was concerned, there was no dispute\n                    that it was the defendant’s customer. The plaintiff acknowledged that he\n                    did try to keep in touch with Tony Lugg of TNT, someone he believed to be\n                    well-connected and highly respected in the security industry. The plaintiff\n                    emailed Tony Lugg in March 2010 and sent him messages via SMS in May and in June\n                    2010 requesting a meeting. While the plaintiff denied that he was trying to\n                    solicit TNT for any business relating to the sale or supply of telematics\n                    products and services, he did not explain what business he was keen to do with\n                    TNT which is involved in logistics and transportation of cargo. 18     The plaintiff asserted that he is a consultant\n                    in the employ of Hathaway Marine Pte Ltd from 11 January 2010 but did not\n                    elaborate on the nature of his work besides stating that this company had\n                    nothing to do with telematics. This company is supposedly in the business of\n                    logistics support for transportation of materials, transhipment and\n                    time-chartering services. 19     During his employment with the defendant, the\n                    plaintiff provided confidential information to persons hostile to the defendant.\n                    After his employment ceased, he communicated with the defendant’s\n                    customers and business partners, in particular COSEM which was also interested\n                    in the speed-limiting technology that the defendant was working on with the\n                    Singapore Police Force. Even if the plaintiff was not the lead negotiator for\n                    the contracts in question, he was the main contact point with the clients’\n                    top management and oversaw the daily progress of the defendant’s projects.\n                    The know-how involved in the implementation of the projects was confidential.\n                    There was therefore every possibility that the plaintiff had breached his duty\n                    of confidentiality in his interaction with COSEM. Further, by setting up SGT Pte\n                    Ltd with another ex-employee of the defendant to provide a product which\n                    appeared suspiciously similar to the operating rationale of the\n                    defendant’s core technology, there was a strongprima\n                        faciecase that the plaintiff had made use of the\n                    defendant’s confidential information as spelt out in the\n                    injunction. 20     The plaintiff has admitted that he still\n                    communicated with some of the companies named in the search orders after the\n                    termination of his employment with the defendant and that such email would be in\n                    his gmail account. He has also admitted deleting information from the MacBook\n                    provided by the defendant to him while he was serving out his notice of\n                    resignation after having delayed the return of the same and despite having given\n                    an assurance through his solicitors on 11 November 2009 that he would\n                    return the notebook at the end of the said notice without tampering with it.\n                    This assurance was given after the defendant asked for its return by\n                    3 November 2009 (after he had given his notice of resignation) and\n                    emphasized in a subsequent letter of 11 November 2009 that it was to be\n                    returned by 13 November 2009 without any deletion or alteration of any\n                    programmes, files or email. 21     The information technology experts engaged by\n                    the defendant to look into the said MacBook found that there was erasure of\n                    information between 13 November 2009 and 10 December 2009 (the date it\n                    was finally returned to the defendant). Each successful erasure (there were nine\n                    of them), which involved a process of writing over the free space in the\n                    computer 35 times, took 12 hours or more to complete. 22     The plaintiff claimed that the deleted\n                    information was of a personal nature and that he did not tamper with the\n                    computer. He asserted that the computer had a standard built-in function which\n                    emptied the trash bin and that it was his practice all along to clean up the\n                    trash bin from time to time. He had used the computer for preparing and\n                    reviewing documents relating to his dispute with the defendant and for\n                    communicating with his lawyers. He was afraid that the defendant’s\n                    “very tech-savvy” Anthony Harrison would be able to read the\n                    deleted information. Shortly before he returned the computer to the defendant,\n                    he activated the function one more time. The plaintiff also accused the\n                    defendant of having manipulated the electronic data in the computer and then\n                    concealing such manipulation. Four of the defendant’s employees had\n                    accessed the computer and had run various data recovery programmes on it before\n                    it was handed over to the defendant’s experts. However, while the\n                    plaintiff’s information technology experts opined that manipulation was\n                    possible, they accepted that it was a technically difficult thing to do. No\n                    evidence was adduced that manipulation did occur. 23     It was not disputed that the data-deletion\n                    function had to be activated by the user who must consciously select how many\n                    times he wants to write over the free space. The more times the writing-over\n                    takes place, the longer the time needed for the process to complete.\n                    Accordingly, the “35 pass” erasure method adopted by the plaintiff\n                    would take the longest time to complete. That method also provides the highest\n                    degree of guarantee against forensic recovery of data. The programme also\n                    informs the user that adopting that method would “prevent the recovery of\n                    deleted files”. Back-ups of the data in the computer were in fact done\n                    prior to the deletion of data while it was in the plaintiff’s custody.\n                    However, the plaintiff denied that he had copies of such back-ups. 24     The supply agreement between the defendant\n                    (through ASP) and the Tridex Companies was worth some US$93million. It was\n                    terminated by Tridex on 5 February 2010 and the two parties are now\n                    involved in litigation and arbitration. The plaintiff had acquired information\n                    about the defendant’s business contacts and technology that would be\n                    useful to other competitors in other projects, in particular, the speed-limiting\n                    technology which the defendant spent a lot of time developing. The loss that\n                    would be caused by him divulging such information was potentially a huge\n                    one. 25     The plaintiff alleged that the defendant was\n                    guilty of material non-disclosure when it appliedex\n                        partefor the injunction and the search orders. One of the\n                    defendant’s assertions on affidavit was that the plaintiff could have been\n                    in contact with a competitor of the defendant, a Hong Kong company known as\n                    Sunlink Holdings International (“Sunlink”). The plaintiff has now\n                    shown conclusively from public records that Sunlink was in liquidation since\n                    early 2009. While the defendant has acknowledged its error, it did not explain\n                    why no check was done on Sunlink and why it did not discover the truth when it\n                    accessed the MacBook in February 2010 to search for evidence of the\n                    plaintiff’s contact with Hong Kong companies. Further, the defendant had\n                    alleged that Sunlink was now re-established and might be able to\n                    reverse-engineer the telematics product that the defendant had designed for\n                    Tridex. This suggested that the defendant knew that the Hong Kong company had\n                    been in liquidation and was now back in business. The defendant explained that\n                    it was under the initial impression that Sunlink had gone into liquidation and\n                    was re-established in another form. In any event, it was suspicious that the\n                    plaintiff had in his computer a quotation given to a company which was known to\n                    be a competitor. 26     The defendant was also alleged to have omitted\n                    informing the court that the MacBook had been tampered with. It merely stated\n                    that three (not four, which was the actual number) of its trusted employees\n                    examined the computer and had not deleted anything from it. By omission, the\n                    defendant was suggesting that no activity was performed on it. No mention was\n                    made of the fact that seven external storage devices were introduced to it and\n                    that four files were deleted by the defendant’s employees. Further, the\n                    defendant had alleged that all data had been erased when the MacBook was\n                    returned on 10 December 2009 although the truth was that more than 14,000 email\n                    and more than 8,000 documents still existed therein. The defendant also did not\n                    inform the court that the erasure function was a built-in feature. In any case,\n                    the plaintiff denied that he used the said erasure function that many times as\n                    alleged by the defendant’s experts. The back-up drive that was in the\n                    plaintiff’s office during his employment and which was subsequently\n                    missing was not kept by the plaintiff. It was not true that only the plaintiff\n                    and the human resource manager had the key to the plaintiff’s office. Even\n                    the receptionist had such a key. Further, the plaintiff had found his office\n                    door open on 21 September 2009, a public holiday, when the defendant was in\n                    the midst of moving its office premises. 27     The plaintiff also submitted that the court\n                    was entitled to consider whether the terms of the search orders were complied\n                    with. If they were not and prejudice was caused, the court could discharge the\n                    said orders. The plaintiff complained that the defendant imaged his wife’s\n                    laptop and her AOL email account and that the search extended well beyond 5pm on\n                    the first three days. 28     The defendant explained that the search\n                    concluded at 8.45pm on the first day as the plaintiff had delayed accepting\n                    service until 3.08pm although the supervising solicitor was at his premises at\n                    12.10pm. The search for the remaining days was halted by the supervising\n                    solicitor at around 6 to 7pm with the remaining time taken up in sealing and\n                    handing over of the items obtained and in other administrative matters. On the\n                    second day, the physical search actually concluded at 4.04pm and the rest of the\n                    time was spent imaging the plaintiff’s computers (which was done quietly\n                    by the experts in the plaintiff’s study room) and administrative\n                    discussions between the parties. The plaintiff’s solicitors were present\n                    in the premises at all times and could have raised any objections to the\n                    supervising solicitor.",
        "The decision of the court": "29     The factors to consider when deciding whether\n                    or not to grant an injunction are set out inAmerican\n                        Cyanamid Co v Ethicon[1975] AC 396 at 407 and 408. The\n                    claim must not be frivolous or vexatious,i.e.\n                    there is a serious question to be tried. At this stage, the court does not try\n                    to resolve conflicts of evidence on affidavit as to facts on which the claims of\n                    either party may ultimately depend nor to decide difficult questions of law. The\n                    court should then consider whether damages would be an adequate remedy for\n                    either party and where the balance of convenience lies. 30     Where restraint of trade clauses are\n                    concerned, it is not necessary for the court to assess their reasonableness at\n                    this stage. The photographs taken of the plaintiff with the relevant parties and\n                    his admission of discussions and looking for business or business leads with\n                    those parties indicated that the defendant has real prospects of success in its\n                    claim against the plaintiff. By the plaintiff’s actions in approaching the\n                    defendant’s customers, for business and/or divulging of confidential\n                    information, he could cause great loss in business to the defendant. Such loss\n                    would also be hard to quantify. The plaintiff did not appear to be a person with\n                    the financial means to be able to meet a judgment for a substantial amount. The\n                    defendant, on the other hand, would be able to make good its undertaking as to\n                    damages if its case against the plaintiff fails. In any case, the injunction is\n                    to prevent the plaintiff from doing what he had already agreed not to do and he\n                    has insisted that he was not breaching the non-compete agreement. If that is the\n                    case, then the plaintiff has not suffered anything by the grant of the\n                    injunction. 31     Guidance on the circumstances justifying the\n                    grant of a search order may be found in the Court of Appeal’s decision inAsian Corporate Services (SEA) Pte Ltd v Eastwest\n                        Management Ltd[2006] 1 SLR(R) 907 at [14]. Four tests must\n                    be satisfied: (a)whether the applicant has shown that it has an\n                            extremely strongprima faciecase;(b)whether the damage suffered by the applicant\n                            would have been very serious;(c)whether there is a real possibility that the\n                            subject of the search order would destroy relevant documents;\n                        and(d)the effect of the search order would be out of\n                            proportion to its legitimate object.32     In my view, the evidence adduced by the\n                    defendant at theex parteapplication did show an\n                    extremely strongprima faciecase of breach of the\n                    non-compete agreement by the plaintiff, particularly the non-compete and\n                    non-solicit clauses therein. His explanations that the meetings were innocuous\n                    were lacking in details. He has acknowledged that they were business meetings\n                    and not personal ones. Whether what was discussed was truly not in breach of his\n                    obligations to the defendant can only be verified at trial.33     The plaintiff’s conduct surrounding the\n                    return of the MacBook left me with a great deal of unease as to whether he would\n                    play fair when it comes to discovery of documents. The plaintiff delayed the\n                    return of the computer and the forensic evidence pointed to deliberate deletion\n                    of information on the device. When his solicitors responded to the\n                    defendant’s demands for the return of the MacBook, there was no\n                    qualification to the plaintiff’s undertaking not to tamper with it. Yet,\n                    soon after the correspondence, the computer’s erasure function was\n                    activated many times. The plaintiff’s claim that he deleted only personal\n                    and confidential material therefore sounded highly suspicious. His experts\n                    alluded to the possibility of manipulation of the data but did not suggest that\n                    such did occur. In the circumstances, I was left with the distinct impression\n                    that there was a real possibility that the plaintiff had deleted and would\n                    destroy or hide relevant documents if a search order were not\n                ordered.34     As mentioned earlier, the damages that would\n                    be suffered by the defendant would be very real and substantial and would be\n                    hard to quantify. It also did not appear that the plaintiff would be in a\n                    position to compensate such loss. Although search orders are by their nature\n                    intrusive of privacy, it was imperative that such orders be made in this case.\n                    The plaintiff’s conduct regarding the MacBook was highly questionable and\n                    his actions in evading service of the search orders lent further support to the\n                    impression that he could not be fully trusted to cooperate and play a fair game.\n                    The search was not disruptive to any business activities and there was no\n                    evidence that the search party did anything untoward during the search. The\n                    plaintiff had his solicitors with him and could have insisted on the search\n                    party leaving his home at 5pm. It is not uncommon for subjects of search orders\n                    to prefer that a search proceed beyond the stipulated hours so that it could\n                    hopefully be completed within that day. Where the imaging of the\n                    plaintiff’s wife’s laptop and her email account was concerned, the\n                    directions I have given to the solicitors for both parties (set out in the last\n                    sentence of[6]above) should be able to\n                    resolve the matter quite swiftly if nothing of relevance is noted therein. The\n                    information obtained could then be returned or destroyed.35     I was of the view that the non-disclosures\n                    alleged by the plaintiff would not have materially affected my decision whether\n                    or not to grant the orders sought. The Sunlink issue was a peripheral matter\n                    and, in any case, the wrong information was neither egregious nor deliberate.\n                    Where the MacBook was concerned, it was my understanding that data which was\n                    potentially relevant had been deliberately erased and not that all data had been\n                    deleted by the plaintiff. It would not have mattered to me if the defendant had\n                    disclosed the alleged omissions in[26]above. The fact remained that the forensic examination had uncovered deliberate\n                    erasure of information in the last weeks of the plaintiff’s notice of\n                    resignation while the MacBook was in the plaintiff’s custody and was being\n                    used by him.36     In the circumstances, I made the orders and\n                    directions set out in[6]above."
    }
}