{
    "case_title": "Tang Kheok Hwa Rosemary (trading as R M Martin Supplies and Services)\n      v\n      Jaldhi Overseas Pte Ltd",
    "ncitation": "[2010] SGHC 25",
    "coram": "Lee Seiu Kin J",
    "sections": {
        "Excessive judicial interference": "3       The plaintiff submitted that the AR had interfered excessively in the proceedings by taking over the questioning, and asking leading questions and cross-examining the witnesses, in particular PW1 Moses Tay and PW3 Xin Weihua (“Xin”). The plaintiff’s counsel listed instances in the notes of evidence of the proceedings in which the AR had asked questions of the witnesses. Going over this list, while it is true that the AR had asked questions of the witnesses in those instances, they were mostly by way of clarification. And even if many of the questions could have been better put, I was of the view that looked upon as a whole, it certainly could not be said to be such an egregious case that would justify the conclusion that there was excessive judicial interference. As the Court of Appeal had clearly stated inMohammed Ali bin Johari v Public Prosecutor[2008] 4 SLR(R) 1058 at [164]: … it is important to also reiterate the need (especially in the modern-day context) to bear in mind that the doctrine proscribing judicial interference is one that ought to be invokedonly in the most egregious cases. Indeed, as already mentioned, the doctrine ought not – and cannot – become a stock argument that is invoked by parties as a matter of course and, indeed, would be frowned upon (and perhaps visited by appropriate measures) by the court where there has been a clear abuse of process. [emphasis in original]",
        "Findings not supported by evidence": "4       The second basis of the plaintiff’s appeal was that the following findings of the AR were not supported by the evidence: (a)     Two over-invoiced sums amounting to US$638,978.97 was secret profit earned by the plaintiff. (b)     The plaintiff was not entitled to deduct demurrage/despatch monies amounting to US$191,664.23. 5       The AR had, in a carefully drafted judgment, set out his reasons for the decisions. In relation to the over-invoiced sum of US$638,978.97, he had correctly assessed that the burden lay on the plaintiff to prove that it was entitled to the money. To prove this, the plaintiff relied mainly on the evidence of Xin. However the AR found that he was a difficult and evasive witness. Further, the plaintiff’s case had shifted in the course of the proceedings. The AR was wholly justified in rejecting the evidence of the plaintiff’s witnesses. He had the opportunity of observing their demeanour and behaviour on the stand. In the circumstances I found that the AR was justified in finding that the plaintiff had failed to discharge the burden of proving that it was entitled to retain the US$638,978.97. 6       In respect of the demurrage/despatch monies totalling US$191,664.23, the following are not disputed: (a)     the sum of US$191,664.23 comprises monies due to Shandong Metallurgical Resources Co Ltd (“Shandong”), a Chinese company that was the true charterer of vessels belonging to the defendant; (b)     the sum comprised US$27,199.65 owed by Sarat Chaterjee & Co (VSP) Private Ltd (“Sarat”), US$25,804.16 owed by Bellary Iron Ores Private Ltd (“Bellary”) and US$138,660.42 owed by the defendant; and (c)     the plaintiff had deducted the sum of US$191,664.23 from the payments due to the defendant on the instruction of Shandong and without the consent of the defendant. 7       In respect of the sums owed by Sarat and Bellary, the AR was correct in holding that there was insufficient evidence to pierce the corporate veil that the plaintiff submitted ought to be done to make the defendant liable for this sum. As for the sum of US$138,660.42 owed by the defendant to Shandong, the AR correctly held that the freight payable for cargo carried on a vessel is payable without deduction or set-off even in relation to cross-claims arising in respect of the same fixture. I would add that the plaintiff was the defendant’s agent in respect of the collection of the payment for the invoices; it was not the agent for Shandong vis-à-vis the plaintiff. I also agreed with the defendant’s submissions before me that the evidence showed that of the US$138,660.42, US$38,202.09 represented a despatch claim by Shandong Wanbao Trading, which is a different entity from Shandong. The remaining sum of US$100,458.33 was a claim by Shandong in relation to a different vessel from the one in the invoice from which the deduction was made. 8       In the premises, I dismissed the plaintiff’s appeal with costs fixed at $2,000, which took into account the fact that the defendant had failed in its appeal in Registrar’s Appeal No 334 of 2009 which was heard at the same time."
    }
}