{
    "case_title": "Management Corporation Strata Title Plan No 2911\n      v\n      Tham Keng Mun and others",
    "ncitation": "[2010] SGHC 326",
    "coram": "Woo Bih Li J",
    "sections": {
        "Background": "1       These two appeals arose out of a District\n                    Judge’s decision to strike out a counterclaim on the ground that the\n                    District Court did not have jurisdiction over the counterclaim. The appellants\n                    filed a notice of appeal by way of Registrar’s Appeal No 161 of 2009\n                    (“RAS 161/2009”) (“the First Appeal”) against that\n                    decision. However, the appellants failed to serve the First Appeal on the\n                    respondent within the time required under the Rules of Court (Cap 322,\n                    R 5, 2006 Rev Ed) (the “Rules of Court”). The respondent then\n                    applied for the First Appeal to be struck out while the appellants applied for\n                    an extension of time to serve the First Appeal. The same District Judge\n                    dismissed the appellants’ application for extension of time to serve the\n                    First Appeal and struck out the First Appeal on the ground that it was not\n                    served on time. The appellants then filed a notice of appeal by way of\n                    Registrar’s Appeal No 62 of 2010 (“RAS 62/2010”)\n                    (“the Second Appeal”) against the decision to dismiss the\n                    application for extension of time to serve the First Appeal and to strike out\n                    the First Appeal. 2       Both appeals came before me. I allowed the\n                    appeals. I now give my grounds of decision.",
        "Facts": "3       The respondent is the management corporation for\n                    a building known as LW TECHNOCENTRE (“the Building”), which is\n                    located at 31 Toh Guan Road East, Singapore 608608. 4       Tham Keng Mun and Sum Yuet Leng, respectively\n                    the first and second appellants, are subsidiary proprietors of unit #02-05 at\n                    the Building. The third appellant, Eltron Engineering Pte Ltd, is the tenant of\n                    the Unit. 5       The appellants placed objects on a driveway\n                    outside the Unit (“the Driveway”). The Driveway is part of the\n                    common property of the Building. 6       On 27 July 2006, the respondent commenced\n                    an action against the appellants in the District Court for occupying the\n                    Driveway without obtaining the respondent’s license, authorisation or\n                    approval. The respondent claimed for,inter alia,\n                    an order that the appellants remove all objects from the Driveway, possession of\n                    the Driveway and for damages, includingmesneprofits. 7       On 15 August 2006, the appellants filed a\n                    defence and counterclaim. In their counterclaim (“the\n                    Counterclaim”), the appellants made the following averments: (a)     the respondent breached its\n                        “duty of care in law to the subsidiary proprietors” to ensure\n                        that the common property, including the Driveway, was not obstructed to\n                        partially deprive the subsidiary proprietors of use of the common property;\n                        and (b)     by\n                        commencing action against the appellants, the respondent “arbitrarily\n                        exercised [its] powers in bad faith with the intention to cause loss and\n                        damage” to the appellants. The appellants claimed\n                    an order that the respondent procure and ensure that all objects placed on the\n                    common property be removed and for damages for the loss of use of the common\n                    property. 8       On 4 September 2009, in the course of\n                    hearing interlocutory appeals, Tan May Tee DJ (“the District\n                    Judge”) asked for submissions on whether the District Court had\n                    jurisdiction over the respondent’s claim and the\n                Counterclaim. 9       On 8 December 2009, after hearing\n                    submissions, the District Judge held that the District Court did not have\n                    jurisdiction over the Counterclaim and so she struck out the Counterclaim\n                    (“the First Decision”). The District Judge did not give any\n                    grounds for the First Decision. 10     On 21 December 2009, the appellants filed\n                    the First Appeal. The Subordinate Courts Registry issued it on 30 December\n                    2009. 11     The appellants served the notice of appeal on\n                    the respondent on 20 January 2010 via a fax transmission. The appellants\n                    also served the notice of appeal on the respondent by hand on 22 January\n                    2010. 12     On 22 February 2010, the respondent\n                    applied via Summons No 2843 of 2010 (“SUM 2843/2010”) to\n                    strike out the First Appeal on the ground that it was not served on the\n                    respondent within seven days of it being issued, as provided under O 55C,\n                    r 1(4) Rules of Court. The following day, on 23 February 2010, the\n                    appellants applied via Summons No 2944 of 2010 (“SUM\n                    2944/2010”) for an extension of time for the service of the First Appeal.\n                    The Subordinate Courts Registry fixed both summons before the High Court,\n                    together with another appeal in the same case on discovery and further and\n                    better particulars. 13     On 3 March 2010, Kan Ting Chiu J\n                    directed that both SUM 2843/2010 and SUM 2944/2010 were to be heard together in\n                    the Subordinate Courts. 14     On 7 April 2010, the District Judge\n                    dismissed the application for extension of time and struck out the First Appeal\n                    (“the Second Decision”). The District Judge did not give any\n                    grounds for the Second Decision. 15     On 21 April 2010, the appellants filed\n                    the Second Appeal. The Second Appeal was duly served on the respondent within\n                    the time required under the Rules of Court. 16     Both the First Appeal and the Second Appeal\n                    came before me.",
        "The Second Appeal (RAS 62/2010)": "",
        "The law on extension of time for service of a notice of appeal": "17     The factors that the court considers in\n                    determining whether to extend time for the filing or service of a notice of\n                    appeal are well established and were recently concisely stated by the Court of\n                    Appeal inAnwar Siraj and another v Ting Kang\n                        Chung[2010] 1 SLR 1026 (CA) (“Anwar Siraj”) in the following manner (at\n                    [29]-[30]): Considerations in exercising discretion to extend time 29 The principles which apply to determine whether the court should\n                        exercise its discretion to extend time to file a notice of appeal or to\n                        serve a notice out of time are well established in case law. The modern\n                        approach taken by this court to this question may be found in its decision\n                        inPearson v Chen Chien Wen Edwin[1991]\n                        2 SLR(R) 260 . There are four factors which the court would\n                        consider in determining how the discretion should be exercised. These are:\n                        (a) the length of the delay; (b) the reasons for the delay; (c) the chances\n                        of the appeal succeeding if time for appealing is extended; and (d) the\n                        degree of prejudice to the would-be respondent if the application is\n                        granted. But we would emphasise that this is not a numbers game. The\n                        significance of each factor must depend on its facts and circumstances of\n                        the case. In the final analysis, the applicant for an extension of time must\n                        show grounds sufficient to persuade the court to extend its sympathy to\n                        him. 30 While these are the factors which are relevant to the court in\n                        determining how its discretion should be exercised, there are two other\n                        considerations which should nevertheless not be disregarded. InLinda Lai([25]supra)\n                        at [45], relying on the Privy Council decision inThamboo\n                            Ratnam v Thamboo Cumarasamy and Cumarasamy Ariamany d/o\n                            Kumarasa[1965] 1 WLR 8 at 12, this court held that\n                        when applying these factors, the court should nevertheless bear in mind the\n                        fact that the overriding consideration was that the ROC mustprima faciebe obeyed, with reasonable diligence\n                        being exercised. Second, inThe Melati[2004]\n                        4 SLR(R) 7 at [37], this court underscored the point that the need\n                        for finality was a \"paramount consideration\". 18     I will elaborate on each factor\n                below.",
        "My Decision on the Second Appeal": "The length of the delay 19     The first factor requires the court to\n                    consider the length of the delay in serving the notice of appeal. If the delay\n                    werede minimis, it might be excused without the\n                    court having to consider the reasons for the delay in detail (seeLee Hsien Loong v Singapore Democratic Party and others and another\n                        suit[2008] 1 SLR(R) 757 at [21] (“Lee Hsien Loong”)). However, if the delay were\n                    more substantial, the court should consider the reasons for the delay in detail\n                    (seeLee Hsien Loongat [22]). 20     As provided by O 55C, r 1(4) Rules of\n                    Court, the appellants should have served the notice of appeal on the respondent\n                    within seven days of it being issued. The notice of appeal was issued on\n                    30 December 2009. Under O 3, r 2(5) Rules of Court, if a period\n                    of time fixed for the doing of an act is a period of seven days or less, a day\n                    other than a working day should be excluded in the reckoning of the period of\n                    time. Since 31 December 2009, 1 January 2010, 2 January 2010,\n                    9 January 2010 and 10 January 2010 were not working days, the\n                    appellants should have served the notice of appeal by 11 January\n                    2010. 21     The appellants’ solicitors only served\n                    the notice of appeal on the respondent’s solicitors on 20 January\n                    2010 via a fax transmission. The notice of appeal was also served by hand on\n                    22 January 2010. 22     It was necessary for me to determine whether\n                    service was effected on 20 January 2010 or 22 January 2010.\n                    Order 62, r 6 of the Rules of Court governs the mode of service for\n                    documents for which personal service is not required. The relevant provisions of\n                    that rule are as follows: (1)    Service of any document, not being a document\n                            which by virtue of any provision of these Rules is required to be served\n                            personally, may be effected — (a)    by leaving the document at the proper address of\n                            the person to be served; (b)    by post; (c)    by FAXin accordance with\n                                paragraph (3); (d)    in such other manner as may be agreed between the\n                            party serving and the party to be served; or (e)    in such other manner as the Court may\n                            direct. … (3)    Service by FAX may be effected where\n                            — (a)    the party serving the document acts by a\n                            solicitor; (b)    the party on whom the document is served acts by a\n                            solicitor and service is effected by transmission to the business\n                            address of such a solicitor; (c)    the solicitor acting for the party on whom the\n                            document is servedhas indicated in writing to the\n                                solicitor serving the document that he is willing to accept service\n                                by FAXat a specified FAX number and the document is\n                            transmitted to that number; and for this purposethe\n                                inscription of a FAX number on the writing paper of a solicitor\n                                shall be deemed to indicate that such a solicitor is willing to\n                                accept service by FAX at that number in accordance with this\n                                paragraph unless he states otherwise in writing;\n                            and (d)    within 3 days after the day of service by FAX the\n                            solicitor acting for the party serving the document serves a copy of it\n                            on the solicitor acting for the other party by any of the other methods\n                            of service set out in paragraph (1), and if he fails to do so, the\n                            document shall be deemed never to have been served by FAX. [emphasis added] The respondent’s solicitors’ letter head indicates the\n                    firm’s fax number and does not indicate that the firm does not accept\n                    service of documents via fax. Accordingly, I considered that service of the\n                    notice of appeal was effected by fax on 20 January 2010. 23     Since the appellants served the notice of\n                    appeal on 20 January 2010, the length of the delay in service was nine\n                    days. 24     Although a delay of nine days was relatively\n                    shorter than the delay in some other cases, I was of the view that the delay was\n                    notde minimis. As a comparison, the delay inAD v AE[2004] 2 SLR(R) 505\n                        (“AD v AE”), which, like the\n                    present case, concerned an appeal from the District Judge in chambers, was 49\n                    days (AD v AEat [11]). The delay inDenko-HLB Sdn Bhd v Fagerdala Singapore Pte Ltd[2002]\n                    2 SLR(R) 336 (“Denko”),\n                    which concerned a delay in making an application for further arguments under\n                    s 34(1)(c) of the Supreme Court of Judicature Act (Cap 322, 2007 Rev\n                    Ed) (“SCJA”), was 14 days (Denkoat\n                    [12]). The Court of Appeal inDenkoconsidered\n                    that the 14 days delay was substantial given that the period allowed under SCJA\n                    for applying for further arguments was seven days (Denkoat [12]). In both cases, the Court of Appeal refused to\n                    grant an extension of time after considering all the four factors (AD v AEat [15] andDenkoat [18]). Accordingly, it was necessary for me to consider the reasons for the\n                    appellant’s delay. The reasons for the delay 25     It is not sufficient for a party to simply\n                    allege that the delay was due to an oversight on the part of his solicitor or\n                    his solicitor’s clerk (AD v AEat [11];Denkoat [14]). However, oversight on the part\n                    of a solicitor could be an adequate reason if the reasons for the\n                    solicitor’s oversight are explained (Perdigao\n                        Agroindustrial SA v Barilla GER Fratelli-Societa Per Azioni[2009] SGHC 210 (“Perdigao”) at [43]) or if there are extenuating circumstances\n                        (Nomura Regionalisation Venture Fund Ltd v Ethical\n                        Investments Ltd[2000] 2 SLR(R) 926 at [28]). For\n                    example, the High Court inPerdigaodistinguished\n                    cases such asAD v AEon the basis that the\n                    appellant was able to explain that the solicitor’s oversight was\n                    “contributed to by the relocation of the plaintiff’s\n                    solicitor’s firm” (Perdigaoat [43]).\n                    As for extenuating circumstances, the Court of Appeal inNomuraoffered as an illustration two English cases where\n                    extenuating circumstances were present. In both cases, the solicitor had given\n                    notice to the other side of the appeal within the required time and the\n                    solicitor’s mistake was “understandable and not gross”\n                        (Nomuraat [28]). 26     In the present case, counsel for the\n                    appellants, Mr David Liew (“Mr Liew”), offered the\n                    following reasons for the delay in service: (a)     The appellants withheld serving the\n                        notice of appeal until 5 January 2010 because they were not certain if\n                        leave from the District Court was required to make the First Appeal. The\n                        appellants applied to the District Court via Summons No. 21498 of 2009\n                        (“SUM 21498/2009”) for leave to appeal. SUM 21498/2009 was\n                        fixed for hearing on 5 January 2010 before the District Judge. The\n                        District Judge held that leave was not required. (b)     From 9 January 2010 to\n                        11 January 2010, Mr Liew’s law firm moved its offices. The\n                        law firm’s files, including the appellants’ files in this\n                        matter, were packed and sealed in boxes for the move. Mr Liew did not\n                        explain when the appellants’ files were packed and sealed.\n                        Mr Liew retrieved the appellants’ files on 19 January 2010.\n                        He then gave instructions to his staff to immediately serve the notice of\n                        appeal. (c)     Mr Liew offered three further explanations for his oversight. First,\n                        Mr Liew explained that he was in charge of his law firm’s move to\n                        its new offices. Second, Mr Liew was also in charge of the renovations\n                        to his law firm’s new offices. Renovations commenced on 8 January\n                        2010 and lasted for 3 weeks. Third, Mr Liew explained that he was\n                        attending Court in the midst of the move and\n                renovations. 27     I did not find the reasons for the delay\n                    entirely satisfactory. Mr Liew did not offer any reason why he did not\n                    serve the notice of appeal immediately after the hearing of SUM 21498/2009 on\n                    5 January 2010. The respondent’s counsel attended the hearing.\n                    Mr Liew could have served the notice of appeal on the respondent’s\n                    counsel once the District Judge ruled that leave to appeal was not required.\n                    Also, no reason was offered for the failure to serve the notice of appeal\n                    between 5 January 2010 and 9 January 2010, which was the day when\n                    Mr Liew’s law firm started to move to its new office. 28     I then proceeded to consider the third\n                    factor. The chances of the appeal succeeding 29     The third factor only requires the court to\n                    consider whether the appeal is hopeless (Anwar\n                        Sirajat [37];Lee Hsien Loongat\n                    [19]). 30     My view was that the appeal was not hopeless.\n                    Indeed the prospects of success were quite good. As explained below under my\n                    decision for the First Appeal, the civil jurisdiction of the District Court is\n                    limited to certain categories of cases. The Counterclaim discloses a cause of\n                    action for breach of statutory duty. An action for breach of statutory duty\n                    falls within the jurisdiction of the District Court (see below at\n                    [64]-[67]). The degree of prejudice to the would-be respondent if time were\n                extended 31     The fourth factor is concerned with the\n                    prejudice that the respondent would suffer if the extension of time were\n                    granted. The prejudice must be tangible (Lee Hsien\n                        Loongat [25]). It is not sufficient for the respondent to argue\n                    that its prejudice is that the appeal would be heard if the extension of time\n                    were granted (Aberdeen Asset Management Asia v Fraser &\n                        Neave Ltd[2001] 3 SLR(R) 355 at [14]\n                        (“Aberdeen Asset Management\n                    Asia”);S3 Building Services Pte Ltd v Sky\n                        Technology Pte Ltd[2001] SGHC 87 at [67]). An example\n                    of prejudice that would be relevant is if the respondent changed its position by\n                    relying on the judgment below (Aberdeen Asset Management\n                        Asiaat [44]). 32     The respondent was not able to substantiate\n                    its bare assertion that it was prejudiced by the appellants’ delay.\n                    Mr Seng Jock Lee Alvin, the Senior Property Manager of the\n                    respondent’s managing agent, deposed the following in his affidavit dated\n                    23 March 2010: 4.    Paragraph 16 of the Affidavit of\n                            “LTY” is denied. The Plaintiffs suffered substantial\n                            prejudice herein. 5.    We thought that the Defendants were abandoning the\n                            appeal against the learned District Judge’s decision. We thought\n                            so because we did not receive any news of appeal after my lawyers were\n                            verbally informed that the Defendants had filed an appeal during the\n                            hearing of an application by the Defendants for leave to appeal. This\n                            application for leave was withdrawn by the Defendants when the District\n                            Judge informed the Defendant’s counsel that no leave to appeal was\n                            required. My lawyer then told the Court that the Defendants were out of\n                            time to file the Notice of Appeal. 33     The respondent did not elaborate on the\n                    prejudice that it suffered apart from stating that it “thought that the\n                    [appellants] were abandoning the appeal”. I did not consider that simply\n                    being led to think that an appellant is abandoning its appeal amounts to\n                    prejudice. Conclusion on the Second Appeal 34     The court is required to balance all four\n                    factors in coming to a conclusion as to whether an extension of time should be\n                    granted. 35     I reached the conclusion that I should grant\n                    an extension of time even though the delay of nine days was notde minimisand the appellants’ reasons for the\n                    delay were not entirely satisfactory. This was because of the high likelihood\n                    that the appellants would succeed in the First Appeal and the absence of any\n                    relevant prejudice that the respondent would suffer if time were extended. In\n                    this regard, I found the following comments of Andrew Ang J inPerdigaopersuasive: 46 Here, the defendant acknowledged that the appeal was not hopeless.\n                        Since little more is known about the strength of the plaintiff’s case,\n                        all we can conclude is that the third factor does not operate against the\n                        plaintiff. However, I venture to suggest in passing that,in a case where without the court having to go into a thorough\n                            examination the prospects of the applicant succeeding in the appeal are\n                            patent, the third factor could assume greater importance.In an appropriate case, absent any prejudice to the\n                            would-be respondent, the ties of justice might militate against a denial\n                            of the application even if the length of delay might be substantial or\n                            the reason for the delay might not be entirely cogent. This\n                        harks back to the need to balance the competing demands of procedural and\n                        substantive justice summed up in the insightful remarks of Andrew Phang Boon\n                        Leong JC inUnited Overseas Bank Ltd v Ng Huat\n                            Foundations Pte Ltd([28]supra) and V K Rajah JA inLee Chee\n                            Wei([29]supra). I hasten to\n                        add that this is not to say that the third factor will inevitably trump the\n                        first and second factors. Each case must be decided on its own facts,\n                        balancing all four factors. It is in this light that the remarks of the\n                        learned Chao Hick Tin JA inNomura\n                            Regionalisation([38]supra) at\n                        [28] ought to be understood where he characterisedStansfieldas “a case of oversight simpliciter, with\n                        no other extenuating circumstances, although the merits of the case were\n                        strong”. [emphasis added] 36     Accordingly, I allowed the Second\n                    Appeal.",
        "The First Appeal (RAS 161/2009)": "37     To recapitulate, the First Appeal concerned\n                    the District Judge’s decision to strike out the Counterclaim on the ground\n                    that the District Court did not have jurisdiction over the\n                Counterclaim. 38     This appeal raised two issues: (i)     whether the civil jurisdiction of\n                        the District Court is limited to the causes of action specified in Part IV\n                        Subordinate Courts Act (Cap 321, 2007 Rev Ed)\n                        (“SCA”); and (ii)     if so, whether the Counterclaim raised a cause of action\n                        which fell within Part IV SCA.",
        "The First Issue": "Background 39     Part IV SCA provides for the civil\n                    jurisdiction of the District Court. Section 19 stipulates the general civil\n                    jurisdiction of the District Court. Of relevance is s 19(2) SCA, which\n                    provides as follows: (2)    Subject to subsections (3) and (4), a District\n                            Courtshall have the civil jurisdiction conferred by\n                                the following sections of this Part. [emphasis added] For completeness, I should also set out ss 19(3) and 19(4)\n                    SCA: (3)    A District Court shall have the jurisdiction in\n                            sections 20, 21, 25, 26 and 29 where — (a)    the defendant is served with a writ or other\n                            originating process — (i)    in Singapore in the manner prescribed by Rules of\n                            Court; or (ii)  outside Singapore in the circumstances authorised\n                            by and in the manner prescribed by Rules of Court; or (b)    the defendant submits to the jurisdiction of a\n                            District Court. (4)    A District Court’s jurisdiction conferred by\n                            the following sections of this Part shall not include any jurisdiction\n                            expressly excluded by any other written law. 40     Sections 20-23 and 25-29 SCA (the\n                    “Subject Matter Jurisdiction Provisions”) then specify the civil\n                    jurisdiction of the District Court. For example, s 20(1) SCA provides that\n                    the District Court has jurisdiction “to hear and try any action founded\n                    on contract or tort”. Section 21(1) SCA provides that the District Court\n                    has jurisdiction “to hear and try any action for the recovery of a sum\n                    which is recoverable under any written law” if certain conditions are\n                    satisfied. 41     It was necessary for me to consider whether\n                    the jurisdiction of the District Court is limited to actions falling within the\n                    Subject Matter Jurisdiction Provisions in Part IV SCA. The District\n                    Judge’s decision to strike out the Counterclaim would have no basis if the\n                    District Courts’ jurisdiction was not limited by the Subject Matter\n                    Jurisdiction Provisions. Case Law on the Civil Jurisdiction of the District Courts 42     The first case of relevance isLim Kim Cheong v Lee Johnson[1992]\n                    2 SLR(R) 688 (“Lim Kim\n                    Cheong”). InLim Kim Cheong,\n                    Michael Hwang JC held that the District Court did not have the jurisdiction\n                    to grant a declaration that a transfer of a car was null and void. Hwang JC\n                    considered that the District Court’s power to grant a declaration was\n                    limited to actions falling within the Subject Matter Jurisdiction Provisions in\n                    SCA. 43     Hwang JC compared the provisions on\n                    declaratory relief in SCA’s predecessor, the Courts Ordinance (Cap 3,\n                    1955 Rev Ed) (“Courts Ordinance”), and the equivalent provisions\n                    in SCA. Hwang JC noted that the Courts Ordinance also provided subject\n                    matter jurisdiction restrictions. He then relied on the “presumption that\n                    a statute does not create new jurisdictions or enlarge existing ones”\n                        (Lim Kim Cheongat [45]). Hwang JC\n                    considered that SCA in fact introduced more restrictive subject matter\n                    restrictions, thereby suggesting that the presumption should be\n                stronger. 44     InThe Redwood Tree Pte Ltd\n                        v CPL Trading Pte Ltd[2009] SGDC 204\n                        (“The Redwood Tree”), the\n                    District Court also held that the jurisdiction of the District Court is strictly\n                    limited to the causes of action specified in the Subject Matter Jurisdiction\n                    Provisions.The Redwood Treeconcerned an action\n                    for restitution of a deposit paid to secure a tenancy. The District Court held\n                    that it did not have jurisdiction because an action for restitution did not fall\n                    within the Subject Matter Jurisdiction Provisions (The\n                        Redwood Treeat [31]-[41]). My decision on the First Issue 45     My view was that the District Court’s\n                    civil jurisdiction is indeed restricted to the causes of action specified in the\n                    Subject Matter Jurisdiction Provisions. Any other reading of the SCA would not\n                    adequately account for s 19(2) SCA, which provides that the District Court\n                    has the jurisdiction conferred by the sections in Part IV SCA. 46     I also found support for my view in theexpressio unius est exclusio alteriusmaxim of\n                    construction. That maxim provides that if a series of matters are expressly\n                    stated in a statute, it is presumed that the drafter intended to exclude matters\n                    that are not expressly stated (see F.A.R. Bennion,Bennion on\n                        Statutory Interpretation(LexisNexis,\n                        5thEd, 2008) at p 1250). Applying the\n                    maxim, given that Part IV SCA specifically provides for the causes of action for\n                    which the District Court has civil jurisdiction, it should be presumed that the\n                    drafter of SCA did not intend for the District Court to have jurisdiction over\n                    causes of action not specifically mentioned. 47     I should also mention that a bill to amend SCA\n                    was presented to Parliament for a first reading on 15 September 2010.\n                    Significantly, clause 2 of the Subordinate Courts (Amendment) Bill (Bill 26 of\n                    2010) (“the Bill”) proposes to amend s 19 SCA in the\n                    following manner: Amendment of section 19 2.\n                        Section 19 of the Subordinate Courts Act (referred to in this Act as the\n                        principal Act) is amended by deleting subsections (2), (3) and (4) and\n                        substituting the following subsections: “(2) Subject to subsections (3) and (4), a District Courtshall have all the jurisdiction of the High Court\n                                to hear and try any action in personamwhere\n                            — (a)    the defendant is\n                                served with a writ of summons or any other originating process\n                                — (i)    in Singapore in the manner prescribed by Rules\n                                of Court; or (ii)   outside Singapore in the circumstances\n                                authorised by and in the manner prescribed by Rules of Court;\n                                or (b)    the defendant\n                                submits to the jurisdiction of a District Court. (3)    Subject to section 28A of the Supreme Court of\n                                Judicature Act (Cap. 322) and any order under subsection (1)\n                                thereof, a District Court’s jurisdiction under subsection (2)\n                                shall not include — (a)    any supervisory\n                                jurisdiction or revisionary jurisdiction; (b)    any jurisdiction\n                                relating to the judicial review of any act done or decision made by\n                                any person or authority, including the issue of any of the following\n                                prerogative orders: (i)    a Mandatory Order; (ii)   a Prohibiting Order; (iii)   a Quashing Order; (iv)   an Order for Review of\n                            Detention; (c)    any jurisdiction\n                                vested exclusively in the High Court, in any other subordinate\n                                court, or in any judicial, quasi-judicial or administrative\n                                tribunal, by written law; and (d)    any jurisdiction\n                                expressly excluded by written law. (4)    Subject to sections 22 and 23, a District\n                                Court’s jurisdiction under subsection (2) shall not include\n                                jurisdiction to hear and try any action where — (a)    the amount\n                                claimed in the action exceeds the District Court limit;\n                            or (b)    any remedy or\n                                relief sought in the action is in respect of a subject-matter the\n                                value of which exceeds the District Court\n                            limit.”. [emphasis added] 48     I also noted that the Explanatory Statement\n                    accompanying the Bill states as follows: This Bill seeks toamendthe Subordinate\n                        Courts Act (Cap. 321) for the following main purposes: (a)    toreformthe law\n                            relating to the jurisdiction and powers of the District Court and the\n                            Magistrate’s Court; … Clause 2amendssection 19 to confer on a\n                        District Court all the jurisdiction of the High Court to hear and try any\n                        action in personam where the defendant is served with a writ of summons or\n                        any other originating process in the manner prescribed by the Rules of\n                        Court, or the defendant submits to the jurisdiction of a District Court.\n                        … [emphasis added] The Explanatory Statement shows, therefore, that the amendment\n                    described above is intended toamendSCA and not\n                    to clarify ambiguities. 49     The proposed amendment is significant because\n                    it removes the restriction of the civil jurisdiction of the District Courts to\n                    specified causes of action. If the Bill were passed, the District Court would\n                    have the jurisdiction of the High Court, subject to the District Court’s\n                    monetary limit. Clause 3 of the Bill also repeals ss 20 and 21 SCA, which are\n                    Subject Matter Jurisdiction Provisions, as a consequence of the amendment to\n                    s 19. Other Subject Matter Jurisdiction Provisions are amended to provide\n                    that they are “without prejudice to the generality of section 19”\n                    (see clauses 6-8 of the Bill). 50     I was of the view that the Bill supported my\n                    conclusion that SCAcurrentlylimits the civil\n                    jurisdiction of the District Court to the causes of action specified under the\n                    Subject Matter Jurisdiction Provisions.",
        "Second Issue": "Background 51     Since I held that the District Court’s\n                    jurisdiction is limited by the Subject Matter Jurisdiction Provisions, it was\n                    necessary for me to consider whether the Counterclaim raised causes of action\n                    that fell within one or more of the Subject Matter Jurisdiction\n                    Provisions. The parties’ arguments 52     The appellants argued that the Counterclaim\n                    raised the following causes of action which fall within the Subject Matter\n                    Jurisdiction Provisions: (a)     The appellants argued that the\n                        District Court has the jurisdiction to try the Counterclaim under\n                        s 19(3)(b) SCA because the respondent has submitted to the jurisdiction\n                        of the District Court by filing its Defence to the\n                    Counterclaim. (b)     The\n                        Counterclaim raises a cause of action “founded on contract”\n                        within the meaning of s 20, SCA because, according to the appellants,\n                        the Counterclaim alleges that the respondent breached its obligations under\n                        a statutory contract with the appellants under the Building Management and\n                        Strata Management Act (Cap 30C, Rev Ed 2008) (“BMSMA”).\n                        BMSMA imposes a duty on the respondent to manage and administer the common\n                        property for the benefit of all the subsidiary proprietors, tenants and\n                        licensees. (c)     The\n                        Counterclaim raises two causes of action “founded on tort”\n                        within the meaning of s 20 SCA. The first cause of action was the\n                        respondent’s breaching of its statutory duties in allowing some\n                        subsidiary proprietors to encroach, occupy, obstruct and illegally use the\n                        common property. The second cause of action was the respondent’s\n                        commission of the tort of trespass by allowing the other subsidiary\n                        proprietors to encroach, occupy, obstruct and illegally use the common\n                        property. (d)     The\n                        appellants referred to ss 32(10), 32(11) and 88 BMSMA. The appellants\n                        argued that those sections confer the District Court with jurisdiction to\n                        hear the claims that they raised in the Counterclaim. In this regard, the\n                        appellants rely on s 19(6) SCA, which provides that “the\n                        District Court shall have such jurisdiction as is vested in it by any other\n                        written law”. (e)     The counterclaim raises an action “for the recovery of\n                        immovable property” within the meaning of s 25\n                    SCA. 53     The respondent raised the following\n                    arguments: (a)     Neither a breach of statutory duty\n                        nor a breach of BMSMA comes within any of the Subject Matter Jurisdiction\n                        Provisions. (b)     There could be no trespass by the respondent as the appellants are not in\n                        possession of common property. Indeed, it is the respondent who is in\n                        possession of the same. (c)     The Counterclaim “is doomed to fail”\n                        because the appellants are claiming for both damages and an injunction even\n                        though s 88 BMSMA provides that a subsidiary proprietor claiming for a\n                        breach of any of the provisions Part V BMSMA can only seek either damagesoran order to restrain the breach of the\n                        provision. (d)     Section 124 BMSMA provides that every application to court under BMSMA must\n                        be by originating summons. My decision (1)   The nature of the inquiry at this stage of the\n                proceedings 54     The respondent seemed to have misunderstood\n                    the nature of the inquiry at this stage of the proceedings when it argued that\n                    the Counterclaim was “doomed to fail”. I was not required to\n                    determine whether there were merits to the Counterclaim. My role was limited to\n                    determining whether the District Court hadjurisdictionto hear the claims that the appellants’ have\n                    raised in the Counterclaim. Accordingly, it was not necessary for me to consider\n                    the respondent’s arguments based on ss 88 and 124\n                BMSMA. 55     I observed, however, that the\n                    respondent’s arguments on those provisions were not persuasive. As for the\n                    use of the word “or” in s 88 BMSMA, I would have thought that\n                    it is notnecessarilyimpermissible to seek both\n                    damages and an injunction in a claim. For example, it might be consistent with\n                    s 88 BMSMA for a plaintiff to seek damages for past breachesandan injunction to restrain future breaches. Section\n                    88 BMSMA would not appear to be infringed if such claims were made because the\n                    claims would relate to different time frames. 56     As for the argument on s 124 BMSMA, I\n                    considered that the section did not apply to the action for breach of statutory\n                    duty, which, as will be seen below, was the only action that was adequately\n                    pleaded (see below at [61]). Section 124 BMSMA applies to “[e]veryapplicationto the court underthis Act” (emphasis added). As will be seen below\n                    (see below at [64]-[67]), an action for breach of statutory duty is an action in\n                    tort. The claim is not brought under BMSMA as such. Rather, the action is\n                    brought as a common law claim. A similar approach was taken by the Court of\n                    Appeal inManagement Corporation Strata Title Plan\n                        No 980 v Yat Yuen Hong Co Pte Ltd and another[1992]\n                    3 SLR(R) 219 (“Yat Yuen\n                    Hong”). In that case, the Court of Appeal was concerned,inter alia, with whether proper notice of a\n                    meeting of a management corporation was given. One of the arguments raised on\n                    appeal was that the proceedings in the High Court were a nullity because the\n                    proceedings were commenced by way of originating summons and not by way of a\n                    summons in chambers. Section 46(1) Land Titles (Strata) Act (Cap 158, 1985\n                    Rev Ed) (“LTSA”) required “every application to court under\n                    [LTSA]” to be by summons in chambers. The Court of Appeal held that the\n                    proceedings in the High Court did not concern anapplication\n                        underthe LTSA, even though LTSA provisions were “touched\n                    on” in the course of proceedings (Yat Yuen\n                        Hongat [35]): 35 We would now deal with the second issue in this appeal. The respondents\n                        submitted that the entire proceedings below, which were begun by originating\n                        summons, were a nullity because s 46(1) of the Act provides that \"...\n                        every application to court under this Act shall be by summons in chambers\".\n                        This submission is without substance. No question as to the\n                        jurisdiction of the High Court arises in this connection. The proceedings in\n                        the High Court dealt with issues which touched on the provisions of the Act.\n                        They were not an application under the Act. At any rate, both parties had\n                        proceeded under this originating process and it would be quite wrong to\n                        allow the respondents to invalidate the entire proceedings. Likewise, I thought that the appellant’s claim for a breach of\n                    statutory duty was not an application under BMSMA, even though the provisions of\n                    that Act might have to be referred to in the proceedings to determine the\n                    content of the respondent’s statutory duty. 57     Even if I was wrong on this point, as both\n                    parties had come some way in the present action, I was of the view that it would\n                    not be right to allow the respondent to invalidate the entire proceedings just\n                    because the appellants’ counterclaim was not begun by originating\n                    summons. (2)   My approach 58     It was relevant for me to consider, as a\n                    preliminary issue, whether the claims that the appellants said were raised in\n                    the Counterclaim were adequately pleaded. If the claims were not pleaded, it\n                    would not be open to the appellants to raise those claims in support of their\n                    argument that the District Court has jurisdiction over the Counterclaim, unless\n                    the appellants obtain leave to amend the Counterclaim. 59     Therefore my approach was to, first, consider\n                    whether the claims that the appellants argue were raised in the Counterclaim\n                    were adequately pleaded. Secondly, if those claims were adequately pleaded, I\n                    had to consider whether they fell within any of the Subject Matter Jurisdiction\n                    Provisions in SCA. (3)   Were the claims that the appellants allege were raised in\n                the Counterclaim adequately pleaded? 60     The Counterclaim repeats paragraphs 4 to 9 of\n                    the appellants’ defence. Those paragraphs elaborate on the\n                    appellants’ assertion that the respondent allowed other subsidiary\n                    proprietors to place equipment, objects and other items on the common property.\n                    The Counterclaim then states that the respondent breached its “duty of\n                    care in law” to the subsidiary proprietors to ensure that the common\n                    property was not obstructed. The Counterclaim also states that the respondent\n                    has “arbitrarily exercised its powers in bad faith” by commencing\n                    this action against the appellants. 61     Pleadings must contain material facts (see O\n                    18, r 7(1) Rules of Court). Material facts for this purpose are those facts\n                    which are necessary to form a complete cause of action in the sense that the\n                    omission of such a fact would make the statement of claim bad (seeFirst Link Energy Pte Ltd v Creanovate Pte Ltd and another\n                        action[2007] 1 SLR(R) 1050 at [37];Multi-Pak Singapore Pte Ltd (in receivership) v Intraco Ltd and\n                        others[1992] 2 SLR(R) 382 at [29]; both cases referred\n                    toBruce v Odhams Press Ltd[1936]\n                    1 KB 697 at 712). 62     My view was that the only cause of action that\n                    the appellants have adequately pleaded is the action for breach of statutory\n                    duty. I did not find that the cause of action for breach of contract was\n                    adequately pleaded. The relevant contract, here the by-laws, was not\n                    specifically pleaded. It is true that the conduct constituting breach (viz. the respondent’s alleged failure to ensure\n                    that the common property was not obstructed to deprive the subsidiary\n                    proprietors of its use) was adequately pleaded. However, it is necessary for a\n                    party to also plead the terms of the contract (seeSingapore\n                        Court Practice 2009(Jeffrey Pinsler , SC gen ed) (LexisNexis,\n                    2003) at para 18/7/3). 63     The cause of action for trespass was also not\n                    adequately pleaded. It is true that only the material facts supporting the cause\n                    of action for trespass need to be pleaded. The pleadings need not specifically\n                    state the legal conclusion that the material facts constituted trespass (seeDrane v Evangelou[1978] 1 WLR 455\n                    at 458). However, the facts pleaded in the Counterclaim do not support a cause\n                    of action for trespass on the part of therespondent. At most, the Counterclaim has sufficient facts to\n                    form an allegation that theother subsidiary\n                        proprietorstrespassed on the common property. I should add that\n                    I am not deciding as to whether it is possible for a subsidiary proprietor to\n                    commit a trespass on the common property, although it seemed to me (without my\n                    deciding the point) that the respondent could not itself trespass on the common\n                    property as it is the very body that is charged with managing the common\n                    property. 64     Similarly, the cause of action for the\n                    recovery of immovable property was not adequately pleaded. The Counterclaim does\n                    not assert sufficient facts to support an allegation that the appellants were\n                    seeking recovery of the common property from therespondent. Likewise, it seemed to me (without my deciding the\n                    point) that the appellants could not as a matter of law recover common property\n                    from the respondent. (4)   Does an action for a breach of statutory duty fall within\n                any of the Subject Matter Jurisdiction Provisions? 65     My view was that an action for a breach of\n                    statutory duty fell under s 20 SCA because it is an action founded on a\n                    tort. 66     A breach of statutory duty is a tort. The\n                    editors ofClerk & Lindsell on Tort(Sweet\n                    & Maxwell, 19th Ed, 2006) state the following at para 9-01: A person who has suffered damage as a result of a breach of a statutory\n                        dutymayhave an actionin\n                            tort, classified by Lord Browne-Wilkinson in X (Minors) v\n                        Bedfordshire County Council as an “action for breach of statutory\n                        duty simpliciter”. In English law this is a specific common law\n                        action which is distinct from the tort of negligence, even where the\n                        negligence action is based on a common law duty of care arising either from\n                        the imposition of a statutory duty or from the performance of\n                        it… [emphasis added; emphasis in original in bold italics] 67     There is also English Court of Appeal\n                    authority that a breach of statutory duty is an action founded on tort for the\n                    purpose of the County Courts Act 1959 (c 22) (UK) (“County Courts\n                    Act”). InThornton v Kirlees Metropolitan Borough\n                        Council[1979] 1 QB 626 (“Thornton”), the English Court of Appeal had to consider\n                    whether a claim for a mandatory injunction to order a statutory authority to\n                    perform its statutory duty under the Housing (Homeless Persons) Act 1977\n                    (c 48) (UK) was within the jurisdiction of the County Court. The County\n                    Court decided that the claimant’s pleadings did not raise a cause of\n                    action because the claimant was not entitled to sue the statutory authority for\n                    breach of statutory duty and so the County Court did not have jurisdiction over\n                    the case. On appeal, Megaw LJ noted that, in principle, an action for breach of\n                    statutory duty would fall within the County Court’s jurisdiction because\n                    it was an action for tort (at 634F-G): The reason why Judge Hurwitz struck out the particulars of claim and\n                        dismissed the action was that, in his judgment, no action lay against the\n                        council for damages for any breach which they might have committed of that\n                        statutory duty under section 3 (4) of the Act of 1977. Thus, the cause of\n                        action pleaded was not within the jurisdiction of the county court. For this\n                        purposean action based on an allegation of a breach of a\n                            statutory duty, with an allegation that damage has been\n                        caused thereby to the plaintiff, can, the plaintiff asserts, be treated asbeing an action for tortfor the purpose\n                        of section 39 of the County Courts Act 1959. The council do not assert the\n                        contrary.Thus, such an action, if it lies at all, would\n                            be within the jurisdiction of the county court. [emphasis added] I should add that s 39(1) of the County Courts Act 1959 isin pari materiawith s. 20(1) SCA: 39.    General jurisdiction in actions of contract and\n                            tort (1)    A county court shall have jurisdiction to hear and\n                            determine any action founded on contract or tort where the debt, demand\n                            or damage claimed is not more than four hundred pounds, whether on\n                            balance of account or otherwise: Provided that a county court shall not, except as in this Act provided,\n                        have jurisdiction hear and determine, - (a)    any action for the recovery of land;\n                        or (b)    any action in which the title to any heriditament\n                            or to any toll, fair, market or franchise is in question;\n                        or (c)    any action for libel, slander, seduction or breach\n                            of promise of marriage (2)    A county court shall have jurisdiction to hear and\n                            determine any action where the debt or demand claimed consists of a\n                            balance not exceeding four hundred pounds after a set-off of any debt or\n                            demand claimed or recoverable by the defendant from the plaintiff, being\n                            a set-off admitted by the plaintiff in the particulars of his claim or\n                            demand. 68     Indeed, Ms Carolyn Tan, counsel for the\n                    respondent, eventually conceded that a breach of a statutory duty is a tort for\n                    present purposes. 69     As I have said, the action for breach of the\n                    by-laws was not adequately pleaded. It is therefore not necessary for me to\n                    decide whether such an action fell under the Subject Matter Jurisdiction\n                    Provisions. I observed, however, that an action for breach of the by-laws could,\n                    in principle, constitute an action founded on contract under s 20(1) SCA.\n                    The BMSMA provides that the by-laws for common property are binding on the\n                    subsidiary proprietors and the management corporation to the same extent as if\n                    the by-laws were signed and sealed by the management corporation and each\n                    subsidiary proprietor and contained mutual covenants to,inter alia, comply with the by-laws (s 32(6) BMSMA): (6)    Without limiting the operation of any other\n                            provision of this Act, the prescribed by-laws and any by-laws made under\n                            this section or section 33 for the time being in force shall bind the\n                            management corporation and the subsidiary proprietors and any mortgagee\n                            in possession (whether by himself or any other person), lessee or\n                            occupier of a lot to the same extent as if the by-laws\n                        — (a)    had beensigned and sealed by\n                                the management corporation, and each subsidiary\n                                proprietorand each such mortgagee, lessee and occupier,\n                            respectively; and (b)contained mutual covenants to\n                                observe, comply and perform all the provisions of the\n                                by-laws. [emphasis added] 70     Two High Court decisions have taken the view\n                    that the by-laws constitute a statutory contract. InChoo Kok\n                        Lin and another v Management Corporation Strata Title Plan\n                        No 2405[2005] 4 SLR(R) 175, Judith Prakash J\n                    stated as follows (at [23]): 23 Sincethe by-laws are statutorily constituted\n                            contractsbetween the management corporation and the\n                        subsidiary proprietors and between the subsidiary proprietors inter se, it\n                        would appear logical to hold that the by-laws cannot take effect until these\n                        persons come into existence. … [emphasis added] 71     Kan Ting Chiu J also took a similar view\n                    inChia Sok Kheng Kathleen v The Management Corporation\n                        Strata Title Plan No 669[2004] 4 SLR(R) 27 at\n                    [40]-[41] (“Chia Sok Kheng\n                    Kathleen”): 40    To whom was the duty owed? Section 41(4) of the Act\n                            stipulates that the by-laws shall bind the management corporation and\n                            the subsidiary proprietors as if the by-laws had been contained in\n                            properly executed agreements between the management corporation and each\n                            subsidiary proprietor to observe and comply with the\n                        by-laws. 41    By this provision, the management corporation and a\n                            subsidiary proprietorstand in the position of\n                                parties with contractual rights and obligations between\n                                them. If one party to the contract breaches its duties\n                            under the by-laws and causes loss to another, the innocent party is\n                            entitled to seek redress from the defaulter. The other features of a\n                            contractual relationship will follow, and I shall deal with the time bar\n                            issue later. [emphasis added] 72     Importantly, Kan J held that an action\n                    for a breach of the by-laws is an action in contract for the purposes of the\n                    Limitation Act (Cap. 163) (Chia Sok Kheng\n                        Kathleenat [63]). I was of the opinion (without deciding on the\n                    point) that Kan J’s view could be extended to the context of\n                    characterising the cause of action for the purpose of subject matter\n                    jurisdiction. 73     I also observed that the action for breach of\n                    the by-laws could fall under s 19(6) SCA, which provides that the District\n                    Court has “such jurisdiction as is vested in it by any other written\n                    law”. 74     Section 32(10) BMSMA provides as\n                    follows: (10)  The management corporation or subsidiary\n                            proprietor, mortgagee in possession, lessee or occupier of a lot shall\n                            be entitled to apply tothe court— (a)    for an order to enforce the performance of or\n                            restrain the breach of any by-law by; or (b)    to recover damages for any loss or injury to\n                            person or property arising out of the breach of any by-law\n                        from, any person bound to comply therewith, the management corporation or the\n                        managing agent. 75     BMSMA does not define the court to which an\n                    application may be made. However, s 2(1) Interpretation Act (Cap 1,\n                    Rev Ed 2002), defines the word “court” as meaning “any\n                    court of competent jurisdiction in Singapore”. The High Court has held\n                    that the Subordinate Courts fall within this definition (Public Prosecutor v D'Crus L Edward Epiphany[1993] 1 SLR(R) 128 at [7]). Accordingly, I was of the view that\n                    the District Court has jurisdiction over an action for breach of the by-laws on\n                    the basis of s 32(10) BMSMA. (5)   The argument based on s 19(3)(b) SCA 76     Counsel for the appellants argued that the\n                    District Court had jurisdiction under s 19(3)(b) SCA because the respondent\n                    had submitted to the District Court’s jurisdiction by taking steps in the\n                    proceedings. I found this argument to be wholly devoid of merit. Section\n                    19(3)(b) SCA is, by its own terms, subject to the Subject Matter Jurisdiction\n                    Provisions: (3)    A District Court shall have the jurisdictionin sections 20, 21, 25, 26 and 29\n                                where— (a)    the defendant is served with a writ or other\n                            originating process — (i)    in Singapore in the manner prescribed by Rules of\n                            Court; or (ii)  outside Singapore in the circumstances authorised\n                            by and in the manner prescribed by Rules of Court; or (b)    thedefendant submits to the\n                                jurisdiction of a District Court. [emphasis added] Section 19(3) SCA provides that the District Court has the\n                    jurisdictionin ss 20, 21, 25, 26 and 29if either\n                    ss 19(3)(a) or 19(3)(b) SCA is satisfied. Even if the respondent submitted\n                    to the jurisdiction of the District Court, it is necessary to consider whether\n                    the causes of action raised by the appellants fell within the Subject Matter\n                    Jurisdiction Provisions.",
        "Conclusion on the First Appeal": "77     Since the appellants have raised a cause of\n                    action that fell within the Subject Matter Jurisdiction Provisions, the District\n                    Court had jurisdiction over the Counterclaim. Accordingly, I allowed the First\n                    Appeal.",
        "Costs": "78     I decided that the appellants should have\n                    costs for the First Appeal. In view of the appellants’ default in serving\n                    the notice of appeal within the time required, I decided that the respondent\n                    should have costs for the Second Appeal even though I allowed that appeal. The\n                    quantum of each set of costs was to be the same and set-off against each\n                    other."
    }
}