{
    "case_title": "Lai Swee Lin Linda\n      v\n      Attorney-General",
    "ncitation": "[2010] SGHC 345",
    "coram": "Lai Siu Chiu J",
    "sections": {
        "Introduction": "1       This case involves a litigant in person Linda\n                    Lai Swee Lin (“the plaintiff”) who has waged a ten year battle\n                    against the Singapore government represented by the Attorney-General\n                    (“the defendant”) for her alleged wrongful dismissal by the Land\n                    Office division (“the LO”) of the Ministry of Law\n                    (“Minlaw”). 2       The plaintiff soughtinter\n                        aliathe following reliefs: (a)     A ruling that her purported\n                        termination on 21 December 1998 was, in fact, a dismissal which was illegal,\n                        void, inoperative, in breach of the employment contract, the Constitution of\n                        the Republic of Singapore, and the Public Service (Disciplinary Proceedings)\n                        Regulations 1970, and in violation of the rules of natural justice;\n                        and (b)     Reinstatement into the Civil Service and consequentially that she be\n                        entitled to her salary and all benefits (including annual increment, bonus\n                        and allowance) from the date of the purported termination of her employment,\n                        as if the breach had not occurred.[note: 1]",
        "Previous Proceedings": "3       The genesis of this suit can be traced to 20\n                    January 2000 when the plaintiff commenced judicial review proceedings in\n                    Originating Summons No 96 of 2000 to seek orders ofcertiorariandmandamusagainst\n                    the Public Service Commission for terminating her employment. The Originating\n                    Summons culminated in the Court of Appeal decision in Civil Appeal No 69 of 2000\n                    (seePublic Service Commission v Lai Swee Lin\n                        Linda[2001] 1 SLR(R) 133) which held that the\n                    plaintiff’s rights were governed by contract and involved private and not\n                    public rights susceptible to judicial review. 4       The plaintiff then filed the present suit on 17\n                    December 2004 against the government for the alleged wrongful termination of her\n                    employment contract. 5       From January 2005 onwards, the plaintiff and the\n                    defendant were embroiled in a number of legal proceedings relating mostly to\n                    procedural issues. Of particular significance was the automatic discontinuance\n                    of the present suit due to a failure by the plaintiff to take steps in the\n                    proceedings and Justice Belinda Ang’s subsequent decision to allow the\n                    plaintiff to reinstate the same. The facts and events surrounding the legal\n                    proceedings leading to the plaintiff’s reinstatement of the action are set\n                    out in Justice Ang’s decision (see Lai Swee Lin Linda v Attorney-General\n                    [2009] SGHC 38) and need not be repeated here. The previous proceedings are now\n                    water under the bridge.",
        "Background": "6       The plaintiff was originally from Malaysia. She\n                    had outstanding academic achievements and was awarded a scholarship by the\n                    Malaysian Public Service Commission to read law. She completed her law degree at\n                    the University of Malaya in 1979 and subsequently obtained her Master of Laws\n                    degree from the National University of Singapore. 7       The plaintiff was appointed a Senior Officer\n                    Grade III of the LO at Minlaw by a letter of appointment dated 19 November 1996\n                    (“the letter of appointment”).[note: 2]The letter of appointment formed the\n                    employment contract between the plaintiff and the LO. 8       The letter of appointment stated that her period\n                    of probation was one year with effect from the date of assumption of duty. The\n                    plaintiff assumed duty on 28 November 1996 which meant that her probation period\n                    was supposed to end on 27 November 1997. 9       It is not disputed that when the plaintiff first\n                    commenced her appointment, she was designated Head (Legal) of the LO and\n                    reported to the Deputy Commissioner of Lands, Liew Choon Boon\n                    (“Liew”). On or about 30 June 1997, she was requested by Liew to\n                    assist in the Alienation Division. It was during the plaintiff’s stint at\n                    the Alienation Division that she claimed to come to know about some backlog\n                    relating to the approval of the registration of land titles. 10     On 30 May 1998, the plaintiff sent an email to\n                    Liew (“the May 1998 email”) informing him that two of the\n                    Directors of the Alienation Division, Leong Foke Meng (“Leong”)\n                    and Gaw Seng Suan (“Gaw”) had not informed him that there were\n                    many more outstanding backlog cases. The plaintiff also copied this email to Low\n                    Oon Song (“Low”) who was then the Commissioner of Lands. She\n                    suggested that Liew ask Leong and Gaw to give him a list of all the outstanding\n                    cases and to set a deadline to clear all the backlog. She also stated that she\n                    had brought this up as a responsible Singaporean who could not just keep quiet\n                    and be unconcerned with the situation.[note: 3] 11     On the following day, ie, on 1 June 1998, the\n                    plaintiff was verbally informed by Low that he would not be recommending her\n                    confirmation. The plaintiff claimed that this was the first time she heard that\n                    she would not be confirmed.[note: 4] 12     Subsequently, the plaintiff received a letter\n                    from the human resources division of the LO dated 19 August 1998 stating that\n                    she would not be confirmed in her appointment based on recommendations in the\n                    appraisal reports from 28 November 1996 to 27 November 1997, in respect of her\n                    service. The letter informed the plaintiff that her probation would\n                    retrospectively be extended for another year, viz from 28 November 1997 to 27\n                    November 1998.[note: 5] 13     On 17 December 1998, the plaintiff received\n                    another letter stating that her employment would be terminated on 21 December\n                        1998.[note: 6]The plaintiff was\n                    given one month’s remuneration in lieu of one month’s notice. The\n                    plaintiff left the LO on 21 December 1998. Since that date, the plaintiff has\n                    not been gainfully employed.",
        "The plaintiff’s claim": "14     The reasons for the plaintiff’s\n                    termination are in dispute. The plaintiff alleged that she had been terminated\n                    because of the May 1998 email highlighting the backlog. In her words, she was\n                    terminated because “she had the courage to bring up the delays with\n                    respect to the issue of land titles and suggested that measures be taken to\n                    clear the backlog”.[note: 7] 15     The plaintiff claimed that she had never\n                    received any adverse report[note: 8]on her work performance. On the\n                    contrary, the plaintiff claimed that she was doing well as she was given a room\n                    for her office and was told by Liew sometime in November or December 1997 that\n                    she had received a “generous” appraisal. She also claimed that all\n                    her recommendations had been accepted by the LO.[note: 9] 16     The plaintiff claimed that she was confirmed\n                    at the end of her probation period.[note: 10]The plaintiff asserted that\n                    the events subsequent to the email of May 1998 were deliberately created to find\n                    fault with her so that she could be terminated.[note: 11]The plaintiff also claimed that\n                    her “generous” appraisal was replaced with an adverse one to\n                    justify her alleged wrongful dismissal.[note: 12] 17     The plaintiff’s allegations were very\n                    serious. If her allegations were true, it meant that the LO had not only acted\n                    in bad faith in dismissing her for effectively being a whistleblower, but had\n                    also acted dishonestly in orchestrating events to justify her wrongful\n                    dismissal.",
        "The defendant’s defence": "18     The defendant denied the plaintiff’s\n                    allegations and submitted that the reason for the termination of the\n                    plaintiff’s employment was her unsatisfactory performance and poor work\n                    attitude. The defendant denied that the plaintiff received any favourable\n                    appraisal as she claimed she did; on the contrary, she had received negative\n                    appraisals from her colleagues and supervising officers. 19     In view of the fact that the plaintiff was\n                    unable to demonstrate satisfactory work performance at the end of her first\n                    probation period on 27 November 1997, the defendant extended the period of\n                    probation for another year until 27 November 1998. The plaintiff remained on\n                    probation until her employment was terminated on 17 December 1998. 20     The defendant however conceded that the\n                    plaintiff was never informed by the LO of its decision to extend her probation\n                    period at the end of 27 November 1997 and it had thereby breached paragraph 66\n                    of the Government Instruction Manuals (“Government IM”) Section\n                    2B. The paragraph states that the authority must inform the officer on probation\n                    whether or not he is confirmed on or before the date his probationary period\n                        ends.[note: 13]The terms in the\n                    Government IM were incorporated into the employment contract by reason of\n                    condition 2 of the letter of appointment. 21     The defendant also conceded that the LO was in\n                    breach of paragraph 20 of the Government IM Section 2B, which states: If an officer receives an adverse report after 6 months’ service,\n                        his Permanent Secretary has to inform him verbally of his shortcomings and,\n                        where necessary, give him all possible help to overcome them. If the\n                        shortcomings persist in the next 6 months, they have to be made known to the\n                        officer, in writing. If the Permanent Secretary has doubts about the\n                        suitability of the officer, or feels that the officer’s progress has\n                        not been of a high enough standard for him to be confirmed, the Permanent\n                        Secretary has to consider: … (c) extending his service for a further 6 months or a year; and (d) stopping or deferring his increment at the same time. The plaintiff never received any formal written reports on her\n                        shortcomings.[note: 14] 22     Notwithstanding that the defendant admitted\n                    that it had breached the above two paragraphs of the Government IM, the\n                    defendant argued that pursuant to paragraph 86 of the Government IM Section\n                        2B,[note: 15]an officer who was\n                    confirmed would receive a certificate of confirmation. The defendant stated that\n                    no such certificate was sent to the plaintiff. 23     In addition, the defendant also relied on\n                    paragraph 25(1) of the Government IM Section 2P which states: The services of an officer on probation may be terminated without giving\n                        him any reason, and by giving him one month’s notice in writing, or\n                        paying him one month’s total emoluments instead of notice.[note: 16] 24     As the defendant had paid the plaintiff one\n                    month’s salary on the termination of her employment, the defendant argued\n                    that the termination was valid.",
        "The Issues": "25     I had at the commencement of trial, on the\n                    preliminary issue raised by the defendant under Order 33 rule 2 of the Rules of\n                    Court (Cap 322, R 5, 2006 Rev Ed) ruled that the plaintiff’s claim was not\n                    time-barred under s 6(1)(a) of The Limitation Act (Cap 163, 2006 Rev Ed), as the\n                    plaintiff had filed this suit on 17 December 2004 within six years of her\n                    alleged wrongful termination on 21 December 1998. The only issue left for this\n                    court to determine was whether the termination of the plaintiff’s services\n                    by the LO was in accordance with the employment contract. If it was not, what\n                    then were her remedies at law? 26     There were also sub-issues relating to the\n                    plaintiff’s allegations that her “generous” appraisal had\n                    been replaced with an adverse one and that the defendant had dismissed her\n                    because she had raised the issue of the backlog. I will deal with each of these\n                    issues in turn.",
        "The Trial": "27     Before I proceed to consider the issues, I\n                    should first point out that the plaintiff did not cross-examine the\n                    defendant’s witnesses save for Liew. An account of what happened at the\n                    hearing follows. 28     The trial was fixed for three days ie, 16 to\n                    18 August 2010. Other than herself, the plaintiff did not call any witnesses.\n                    The defendant on the other hand, called seven witnesses, six of which were\n                    former employees of the LO. 29     The first day of trial commenced with the\n                    examination of the plaintiff, and the defendants’ witnesses Bernadette\n                    Sim, Tay Kee Koon, Cheng Su Cheng and Liew all of whom save for Liew the\n                    plaintiff chose not to cross-examine. The day ended with the plaintiff’s\n                    cross-examination of Liew (DW4), which she should have continued on the\n                    following day. 30     On 17 August 2010, the plaintiff called in\n                    sick and tendered a medical certificate for 17 and 18 August 2010. Although the\n                    medical certificate was not valid for purposes of being absent from court\n                    attendance, the court accepted her absence. The hearing was vacated for both\n                    days and resumed on 19 August 2010. 31     On 19 August 2010, the plaintiff should have\n                    proceeded with her cross-examination of Liew. However, when invited to do so by\n                    the court, the plaintiff refused. Instead, she read loudly from a document she\n                    had prepared. She persisted in doing so despite advice by the court that it was\n                    not the time for submissions and she should resume her cross-examination of Liew\n                    and despite admonitions that the court could and would find her in contempt. In\n                    view of the plaintiff’s obstinate refusal to resume her cross-examination\n                    of Liew, the court released Liew. 32     The plaintiff persisted in her conduct for the\n                    defendant’s five remaining witnesses. They were P Ramanathan, Leong, Low,\n                    Gaw and Ng Ooi Gooi. These witnesses affirmed their affidavits on the stand.\n                    When the plaintiff was invited to cross-examine each witness in turn, she\n                    responded by reading the same document in[31]and refused to answer the court on whether she wished to\n                    cross-examine them. Consequently, all five witnesses were released without\n                    cross-examination. Thereafter the court adjourned for submissions and closing\n                    submissions were made by the plaintiff and counsel for the defendant on 20\n                    August 2010.",
        "Was the plaintiff’s termination in accordance with the\n                employment contract?": "33     The defendant had already admitted that it had\n                    breached para 66 of the Government IM Section 2B in not informing the plaintiff\n                    of the decision not to confirm her at the end of her probation period on\n                    27 November 1997. 34     In fact, although this was not admitted by the\n                    defendant and not raised by the plaintiff, I note that the LO repeated the\n                    breach in 1998 when it did not inform the plaintiff on or before\n                    27 November 1998, of its decision not to confirm her,viz, by the end of her extended probation period. She was only\n                    informed of her termination on 17 December 1998. 35     The question that arises is, what was the\n                    implications of the defendant’s failure to inform the plaintiff that she\n                    was not confirmed on or before the end of her probation period? The defendant\n                    cited the caseK C Mathews v Kumpulan Guthrie Sdn\n                        Bhd[1981] 2 MLJ 320 (“K C\n                        Mathews”) following the Indian case ofExpress Newspapers LtdvLabour Court &\n                        AnorAIR 1964 SC 806 at[12]for the proposition that in law, if no action had been taken by way of\n                    confirmation or by way of termination, the employee continued to be in service\n                    as a probationer.[note: 17]The plaintiff argued to the\n                    contrary, that because she was not informed that she was not confirmed at the\n                    end of her probation, she should be deemed confirmed.[note: 18] 36     In my view, I do not think a general principle\n                    should apply here. The fact that the plaintiff was not informed of her\n                    non-confirmation does not necessarily mean that the plaintiff had been\n                    confirmed. By the same token, her not being informed also does not necessarily\n                    mean that she was not then confirmed. I note thatK C\n                        Mathewswas decided on the facts. Similarly, the\n                    plaintiff’s case here should be decided on the facts, based on the\n                    employment contract. 37     On the facts, I find the plaintiff has not\n                    proven that she was a confirmed officer. According to para 86 of the Government\n                    IM Section 2B,[note: 19]an\n                    officer who was confirmed would receive a certificate of confirmation. It was\n                    not disputed that the plaintiff had never received such a certificate. On the\n                    other hand, nowhere in the employment contract did it say that the plaintiff\n                    would be deemed confirmed at the end of her probation period if she was not\n                    informed that she would not be confirmed. 38     It is unusual that the plaintiff remained on\n                    probation for more than two years. However, given para 20(c) of the Government\n                    IM Section 2B (see[21]above), the\n                    plaintiff’s two years probation was well within the authority of the LO to\n                    impose. 39     As the plaintiff was a probationary officer at\n                    the time of termination, based on para 25(1) of the Government IM Section 2P (at[23]above), the defendant did not need\n                    to give the plaintiff any reasons for termination. As long as proper notice had\n                    been given, an employer did not have to provide reasons for terminating an\n                    employee’s contract of services;GYC Financial Planning\n                        Pte Ltd and another v Prudential Assurance Company Singapore (Pte)\n                        Ltd[2006] 2 SLR(R) 865 at [28]. 40     The plaintiff did not deny that she had been\n                    served the termination letter dated 17 December 1998 and had been given one\n                    month’s total emoluments. This was proper notice in accordance with the\n                    employment contract and in accordance with para 25(1) of the Government IM\n                    Section 2P. 41     The plaintiff complained that she had not been\n                    heard on her termination and that was a breach of natural justice and her\n                    employment contract.[note: 20]However, the plaintiff had not shown to the\n                    court how her employment contract gave her a right to be heard and how or why\n                    that right was applicable to her as a probationary officer. As was rightly\n                    submitted by the defendant, at common law, the principle of the right to be\n                    heard has no application on the dismissal of an employee in an employee-employer\n                    relationship;Vasudevan Pillai v The City Council of\n                        Singapore[1968] 2 MLJ 16[note: 21]followed inArokiasamy\n                        Joseph Clement Louis v Singapore Airlines Ltd[2004] 2 SLR(R) 233. 42     For the above reasons, I find that the\n                    plaintiff’s termination had been in accordance with the terms of the\n                    employment contract. On this basis alone, the plaintiff’s action should be\n                    dismissed.",
        "The grounds for the plaintiff’s termination": "43     Notwithstanding my finding that the\n                    plaintiff’s termination was in accordance with the employment contract,\n                    the plaintiff had made serious allegations against the defendant regarding the\n                    grounds of her termination that necessitated the defendant defending her\n                    termination. Although the LO was not required to give the plaintiff any reasons\n                    for her termination, there were actually valid and cogent reasons for doing so.\n                    I note that this was also an issue for the plaintiff who asserted that the\n                    defendant had “failed to rebut the facts and circumstances outlined in\n                    the plaintiff’s affidavits [and] the plaintiff did not know how she was\n                    incompetent [as] the defendant had not adduced any evidence to show how the\n                    plaintiff was incompetent in her duties”.[note: 22] 44     In the light of the gravity of the\n                    plaintiff’s allegations and (hopefully) for closure of these proceedings,\n                    I will go on to consider the defence in this regard and make my\n                findings. 45     The defendant’s case was that the\n                    plaintiff’s employment with the LO was terminated due to her poor\n                    performance and poor working relationship with her colleagues. In support\n                    thereof, the defendant adduced evidence from the plaintiff’s former\n                    supervisors and colleagues. They cited numerous examples of the\n                    plaintiff’s inadequacies some of which will be considered\n                below.",
        "The evidence of Tay Lee Koon": "46     Tay Lee Koon (“Tay”) was at the\n                    material time the Director of the Land Acquisition Division in the LO and had\n                    worked with the plaintiff when the plaintiff was asked to assist her division in\n                    some matters. Tay gave evidence that she did not have a pleasant working\n                    experience with the plaintiff.[note: 23] 47     Tay (DW2) testified that the plaintiff was\n                    asked for her legal input on a case involving the award of compensation for the\n                    acquisition of land for the development of the train tracks on the North East\n                    Line (“NEL”) of the Mass Rapid Transit subway system. However the\n                    plaintiff did not provide any views on the matter despite repeated requests to\n                    do so. Instead, she asked the case officer to seek advice directly from the\n                    chambers of the defendant (“the AGC”).[note: 24] 48     Tay highlighted that not only did the\n                    plaintiff not do what she was tasked to do, the plaintiff raised some\n                    unwarranted queries regarding the interpretation of some statutory provisions\n                    but did not explain the reasons behind her queries.[note: 25]According to Tay,\n                    this was an illustration of how the plaintiff seemed unwilling to give her views\n                    on legal issues and this did not facilitate the work processes.[note: 26] 49     On another occasion, the plaintiff was\n                    requested for her clearance of the title deeds of two strips of land for their\n                    acquisition. According to the title deeds, the land was held by one Johnson and\n                    Bruce as trustees for the church owners who were the General Conference\n                    Corporation of the 7th Day Adventists. Solicitors for the church confirmed that\n                    Johnson and Bruce were trustees for the church. The plaintiff however was\n                    dissatisfied and requested that confirmation be obtained from Johnson and Bruce\n                    themselves. Tay telephoned the plaintiff to try to discuss the matter but the\n                    plaintiff refused. Tay recorded this incident in an internal note dated 27\n                    January 2000 to the Deputy Director of Human Resources.[note: 27]This note was\n                    adduced before the court and read: Pls see attached....Legal Officer did not give and get the correct advice.\n                        I had to check up the info [with] SLR. When I asked her whether she wanted\n                        to reconsider her opinion, she said “no” and banged down the\n                            phone....[note: 28] 50     Tay was particularly frustrated with the\n                    plaintiff’s tendency of using pencils to mark her approvals on documents,\n                    despite Tay having informed the plaintiff that as a legal officer clearing the\n                    titles which involved significant sums of monies being paid out as compensation,\n                    it was only proper for the recording of her legal input and clearances be done\n                    by pen.[note: 29] 51     Tay testified that she felt that the plaintiff\n                    was a source of delay and frustration to the officers in her division as the\n                    plaintiff could not facilitate the work and did not give substantive legal input\n                    expected of her.[note: 30]Finally, on the basis that her staff did not wish to go through the plaintiff,\n                    she successfully requested for her division to direct legal queries to the\n                        AGC.[note: 31] 52     On 25 September 1998, the then Commissioner of\n                    Lands, Ng Ooi Hooi (“Ng”) wrote to Tay informing her that the\n                    plaintiff had put in an application for transfer. Ng (DW9) asked Tay for her\n                    honest views on the transfer.[note: 32]Tay’s reply indicated her\n                    dissatisfaction with the plaintiff’s work and that she would not want the\n                    plaintiff to be transferred to her division. The email reply to Ng that was\n                    adduced in court stated: Linda Lai joined the department when we were in the thick of the NEL. She\n                        had to clear title deeds. Also, there were a number of legal issues to be\n                        sorted out. However she did not help me very much because she used to\n                        indicate OK in pencil in the files and my officers were paying out millions\n                        of dollars so I insisted she had to write in ink and indicate her\n                        designation. Also when I asked her to help draft some legal documents, she\n                        asked me to do them. I had to get my own contacts in ROTD to help me. I also\n                        had to draft letters for her to send to AG but there was no value added from\n                        her. Finally [Liew] called Linda, Siok Hoon and myself for a discussion to sort\n                        matters out. At the meeting she said that she had no problems working with\n                        everyone in the department except with [me]. From there I kept a distance. I\n                        managed to get [Liew’s] agreement that Q Division can refer matters to\n                        AG directly without going through her on the basis that the state counsel is\n                        the one who represents us in court. After this, my staff and I have very\n                        little dealings with her. I do not think she will fit into Q Division. My staff generally do [sic]\n                        not get on well with her.[note: 33] 53     Tay’s evidence was not challenged by the\n                    plaintiff.",
        "The evidence of Cheng Su Cheng": "54     Cheng Su Cheng (Cheng) was at the material\n                    time the Director of the State Lands Division in the LO. Cheng (DW3) also gave\n                    evidence of her unpleasant working encounters with the plaintiff. 55     Sometime in August 1997, Cheng’s\n                    division was examining some proposed amendments to the State Lands Encroachments\n                    Act. One such proposed amendment was to increase the fine for unlawful entry\n                    onto state land from $5,000 to $50,000. As there was a concern that the $50,000\n                    fine was excessive, Cheng asked the plaintiff via email to make a comparison\n                    with the penalties imposed for other regulatory offences. In her email, Cheng\n                    highlighted several pieces of legislations such as the Environmental Health Act,\n                    Public Utilities Act, Town Council Act etc for the plaintiff to take into\n                    consideration. However, the plaintiff did not provide Cheng with the legal\n                    advice requested and Cheng had to repeat her request via email. Three days\n                    later, the plaintiff replied stating: Please examine the Acts mentioned in your email & see whether you\n                        would like to incorporate other matters to strengthen your operations, not\n                        only increasing the fines. After you have discussed with your officers, we\n                        can have a meeting to finalise the amendments. The plaintiff’s reply completely evaded the real issue she had\n                    to address. 56     Notwithstanding that the plaintiff seemed\n                    unwilling and/or unable to do what was required of her, the plaintiff\n                    subsequently accused Cheng of not contributing and of being “unduly\n                    sensitive”: If you do not wish to contribute, it is fine with me. I was only trying to\n                        help you to strengthen your operations. I personally feel that you are\n                        unduly sensitive.[note: 34] 57     On 25 September 1998, Ng also wrote to Cheng\n                    informing her that the plaintiff had put in an application for transfer.\n                    Cheng’s response below was similar to Tay’s in [52]: I do not have a pleasant working relationship with her. Her attitude\n                        towards work is very bad. Last year, I have email war with her, where she refused to check the\n                        penalty imposed in other Acts in terms of infringement. She simply refused\n                        to check even at that point of time she was our legal officer.\n                            ...[note: 35] 58     Like Tay, Cheng did not want the plaintiff in\n                    her division. Cheng’s evidence was similarly not challenged by the\n                    plaintiff.",
        "The evidence of Liew": "59     As mentioned at[9], Liew was at the material time the Deputy Commissioner of\n                    Lands. Liew interviewed the plaintiff for the position at the LO. He stated that\n                    he was very impressed with the plaintiff’s academic qualifications and her\n                    performance during the interview. When the plaintiff was employed by the LO,\n                    Liew was tasked to be the plaintiff’s “mentor” on an\n                    informal basis during her probationary period.[note: 36] 60     According to Liew, the plaintiff’s\n                    primary role as Head (Legal) was to provide basic legal advice to the various\n                    departments in the LO to support the operations of the division. There was also\n                    the intention for the various departments within the LO to route their requests\n                    for legal advice to the AGC through the plaintiff so that the requests could be\n                    better crafted.[note: 37] 61     Liew testified that the general feedback on\n                    the plaintiff’s work was negative – she took a long time to review\n                    files and matters such as letters requesting advice from the AGC and she seemed\n                    unable to understand and analyse the issues in depth so as to give meaningful\n                    input. In addition, the plaintiff would raise unnecessary questions with the\n                    officers and was viewed as a “bottleneck” impeding the work of the\n                    LO. Consequently as Liew understood it, the officers in the LO chose to send\n                    their legal queries directly to the AGC bypassing the plaintiff\n                        altogether.[note: 38] 62     As for her superficial input on the NEL\n                    compensation matter (as highlighted by Tay and set out in[47]to[48]above), Liew had to direct the plaintiff to give her legal input and remind her\n                    of the proper way she should be approaching her work.[note: 39]A copy of the relevant\n                    correspondence with Liew’s written comments dated 7 April 1997 was adduced\n                    in court. It stated: Head (Legal), I don’t think this is the way to conduct our business.\n                        If you disagree with the interpretation (of a statutory provision), you\n                        might wish to explain. See me to discuss, please.[note: 40] 63     Apart from the comments in the above note,\n                    Liew stated that he had verbally informed the plaintiff on several occasions of\n                    the need for her to show improvement in her performance and work\n                        relationships.[note: 41] 64     Given that a substantial portion of her work\n                    was then being relieved as the officers would address their legal queries\n                    directly to the AGC, the plaintiff was transferred to the Lease Administration\n                    Section of the Alienation Division where her main job scope was to undertake the\n                    operational work but with some limited legal work. She was then to report to\n                    Leong, who was at that time the Director (A2) of the Alienation Division in her\n                        capacity.[note: 42]According to Liew, the intention was to give\n                    the plaintiff another opportunity to prove herself in a different area of\n                        work.[note: 43] 65     As the plaintiff’s performance in the\n                    Lease Administration Section continued to be poor, she was re-designated to be\n                    the Head of the Remnant Land Section within the Alienation Division but still\n                    reporting to Leong. According to Liew, as Head of the Remnant Land Section, the\n                    plaintiff’s job would be less complex than that of Lease Administration\n                    and the move was, yet again, to provide the plaintiff with another opportunity\n                    to prove that she was suitable for confirmation, albeit in another\n                        role.[note: 44] 66     Throughout the re-deployments, the plaintiff\n                    continued to retain the title of Head (Legal) because, as explained by Liew, she\n                    was still supposed to carry out limited legal work of reviewing three pieces of\n                    land legislation.[note: 45] 67     Sometime around 16 March 1998, Gaw (DW8)\n                    joined the LO and was deployed to fill the then vacant post of Director (A1),\n                    Alienation Division. With the appointment of Gaw, the plaintiff was to report to\n                    Gaw directly.[note: 46]This was reflected in the organisation chart of\n                    the LO. 68     However, the plaintiff did not accept that Gaw\n                    was her supervising officer and claimed that she still reported to Liew. The\n                    plaintiff also made several complaints about Gaw to Liew. For example, the\n                    plaintiff sent an email on 6 April 1998 to Liew complaining how Gaw had\n                    commented that she had gone home early while the rest of the LO officers had to\n                    stay back in the office. The plaintiff then went on to make the following remark\n                    at the end of her email: I am not a hypocrite who while away time during office hours &\n                        purposely stay back late, to give the impression to the bosses that ...one\n                        is extremely hardworking. Liew testified that the remarks were “caustic and abrasive and\n                    were typical of remarks made by the plaintiff”.[note: 47] 69     Liew’s evidence also debunked the\n                    plaintiff’s claim that she could not have been doing poorly at work as she\n                    was given a room as her office. Liew stated that as far as he could recall, the\n                    Commissioner of Land was the only officer in the LO who was allocated a room as\n                    an office. However, for a short period of time, the plaintiff did use a closed\n                    cubicle as an office as there was a shortage of cubicles. The closed cubicle was\n                    originally used as an interview room. The arrangement was temporary and the\n                    plaintiff moved out later to a normal, open-concept cubicle.[note: 48]The plaintiff’s\n                    usage of the room was therefore not an indication that she was performing well\n                    at work.",
        "The evidence of Gaw Seng Suan and Leong Foke Meng": "70     As mentioned at[10], both Gaw and Leong were directors of the Alienation\n                    Division at the material time. In the period of time where the plaintiff was\n                    working under the Alienation Division, she was to report to Leong and\n                    subsequently to Gaw. 71     Both Leong and Gaw gave evidence that in their\n                    capacity as supervisors of the plaintiff, they felt that the plaintiff often\n                    relied completely on her subordinates to do the work and had no sense of urgency\n                    regarding her own work. They made reference to specific incidents to support\n                    their views. 72     One such incident was that of the\n                    “Nanyang Polytechnic Case” raised by Leong. He stated that in and\n                    around July 1997, the plaintiff’s unit was supposed to put up a paper\n                    regarding the viability of a request from Nanyang Polytechnic (the details of\n                    the request are irrelevant and will not be set out). The plaintiff merely\n                    initialled the submission, completely relying on a paper put up by her\n                    subordinates without giving any of her own input. Leong subsequently highlighted\n                    to the plaintiff several points worthy of consideration in the report and\n                    requested the plaintiff to comment. The plaintiff did not respond. 73     Subsequently, there was a further development\n                    on the matter and the plaintiff’s subordinates put up another lengthy\n                    submission. Once again, the plaintiff simply initialled on the submission and\n                    chose not to provide any input. Frustrated, Leong pressed the plaintiff for her\n                    views. Finally, the plaintiff gave a short comment which was in Leong’s\n                    view, superficial. The plaintiff’s response to Leong dated 19 August 1997\n                    concluded: In view of your years of experience, what would you recommend?[note: 49] The above remark was telling of the plaintiff’s poor performance\n                    as a legal officer. Leong deposed in his affidavit of evidence-in-chief (para\n                    16) that he did not bother to continue his exchange with her and proceeded to\n                    make his own decision on the case. 74     Another incident highlighted by Gaw was that\n                    which took place in early May 1998. The plaintiff was requested to follow up on\n                    two cases under her charge on an urgent basis. The plaintiff ignored the various\n                    emails on the issue and finally, another colleague, one Madam See, had to go\n                    through the files herself to give the necessary response. Some days later, there\n                    was a follow up query on the same matter and the plaintiff sent an email to\n                    Madam See to ask if the latter had given the details of the two cases in\n                    question. Madam See replied in an email copied to Gaw stating that her unit had\n                    already provided details of the two cases which were within the\n                    plaintiff’s purview. The plaintiff’s response to Madam See dated 15\n                    May 1998 and copied to Gaw was as follows: Please do not be a hypocrite. Raj emailed all the details to me & cc\n                        to you.[note: 50] The plaintiff thereby implied that Madam See had not looked through\n                    the files as she said she did. Gaw expressed shock at the plaintiff’s\n                        remark.[note: 51]",
        "The evidence of Low": "75     As mentioned at[10], Low (DW7) was the Commissioner of Lands at the material\n                    time. Low’s evidence in brief, stated that the plaintiff was performing\n                    poorly. Low highlighted a few incidents as illustrations. One was the incident\n                    involving Madam See highlighted by Gaw in[74]above. 76     Regarding that incident, Low testified that\n                    the plaintiff emailed him on 12 May 1998 to complain that Gaw had treated her\n                    unfairly. Among other things, the plaintiff wrote in her email: [Gaw] supported [Mdm See], maybe because she professes to be a Christian,\n                        like him. ... [Gaw] cannot survive in the private sector, therefore he comes back [to\n                        the public sector] & throws his weight around, which he cannot do in the\n                        pte sector.[note: 52] 77     Low said he was very shocked by the\n                    plaintiff’s remarks which were completely inappropriate and uncalled for\n                    especially when it seemed to him that Gaw and Madam See were only trying to get\n                    the plaintiff to do her job. He then asked the plaintiff not to pass such\n                    unnecessary and insensitive remarks in the future.[note: 53]This was acknowledged by\n                    the plaintiff in her reply email to him dated 16 May 1998 where she\n                        said[note: 54] I have noted your comments & and will not pass such remarks in the\n                        future. However she then went on in the email to complain about Madam See\n                    being the cause of the problem, that it was Raj who did the work and Madam See\n                    was trying to claim credit for it.",
        "The findings": "78     The above incidents were by no means\n                    exhaustive of the negative image portrayed by the defendant’s witnesses of\n                    the plaintiff which the plaintiff did not challenge in cross-examination. I find\n                    that the defendant had indeed made out its case that the plaintiff’s work\n                    performance was not up to expectations. 79     I should add that the other witnesses Ng Ooi\n                    Hooi (who was the Commissioner of Lands from 1 July 1998, after Low) and P\n                    Ramanathan (who was the Deputy Director of the Human Resource Department at\n                    Minlaw at the material time) shared the common view of Tay, Cheng, Liew, Gaw,\n                    Leong and Low that the plaintiff demonstrated poor performance in her work and\n                    that she sorely lacked emotional quotient in her interaction with colleagues at\n                    the LO. Their evidence was also not challenged by the plaintiff in\n                    cross-examination. 80     The above events occurred before the\n                    plaintiff’s May 1998 email to Liew regarding the backlog of the Alienation\n                    Division. There was therefore no basis for the plaintiff to say that the\n                    defendant had orchestrated events to justify her dismissal, because she had been\n                    a whistleblower. Moreover, I note that the defendant’s claim that the\n                    plaintiff performed poorly at work was corroborated by the evidence of Cheng and\n                    Tay who were not officers from the Alienation Division, viz, they were not\n                    affected by the alleged “whistleblowing” of the\n                plaintiff. 81     From Liew’s evidence, it was clear the\n                    LO had given the plaintiff amble opportunities to improve her performance and\n                    working relationship with colleagues by redefining her work scope and notifying\n                    her of her shortcomings. Unfortunately, the plaintiff’s work performance\n                    and working attitude did not improve. 82     The evidence showed that the plaintiff could\n                    not discharge her duties in a competent fashion ? she was\n                    often unable to come up with her own views and ignored requests that matters\n                    needed to be attended to with urgency. Her habitually abrasive and\n                    confrontational remarks were unnecessary, provocative and affected her ability\n                    to work as a team. Indeed, I find the plaintiff’s lack of interpersonal\n                    skills appalling in someone with her educational background. In summary, her\n                    working attitude left much to be desired. On those grounds alone, the defendant\n                    was fully entitled to dismiss her under the employment contract. 83     I do not say that the plaintiff made no\n                    contribution to the LO when she was with the LO. Indeed, I accept her evidence\n                    that some of her recommendations were accepted by the LO, such as her\n                    recommendation to change the format of the LO offer for the alienation of State\n                        Land.[note: 55]However, notwithstanding her contributions,\n                    it was clear that she also had serious shortcomings which needed to be rectified\n                    in order for her to be confirmed. Judging from the email correspondences adduced\n                    in court, the plaintiff must have been aware that there was dissatisfaction with\n                    both her work and attitude.",
        "The Staff Appraisal Reports (“SARs”)": "84     The defendant produced the plaintiff’s\n                    appraisal reports to the court. As shown, the plaintiff had received a\n                    “C” grading for her first appraisal report and an\n                    “E” grading for her second and third appraisal reports. All\n                    reports had details on why the respective grade was recommended and subsequently\n                    given. 85     The plaintiff’s three SARs were prepared\n                    by the plaintiff’s supervising officers at the material time. The SAR for\n                    the assessment of the first six months of the plaintiff’s service (28\n                    November 1996 to 27 May 1997) was prepared by Liew and the SAR for the\n                    assessment of the next six months of the plaintiff’s service (28 May 1997\n                    to 27 November 1997) was prepared Leong. The first two SARs were prepared\n                    sometime between September and November 1997. The third SAR for the assessment\n                    of the next one year of the plaintiff’s service (28 November 1997 to 27\n                    November 1998) was prepared by Gaw sometime in or around November\n                1998. 86     The plaintiff claimed that sometime in\n                    November or December 1997, the plaintiff asked Liew about her appraisal and he\n                    replied that he had requested Leong to appraise her and that the latter had\n                    given her a “generous” appraisal.[note: 56]When she realised that her\n                    appraisal was really an adverse one: It then dawned on her that her generous appraisal was subsequently\n                        replaced by an adverse one, to justify the recommended termination. That was\n                        the only reasonable explanation how a generous appraisal could subsequently\n                        become an adverse one...[note: 57] The plaintiff subsequently claimed that it was the second SAR which\n                    Leong prepared which had been replaced.[note: 58] 87     I do not agree with the plaintiff that the\n                    replacement of the SAR must be the only “reasonable” explanation.\n                    Liew’s explanation was that the plaintiff had been mistaken. He had\n                    informed the plaintiff at her first appraisal interview sometime between\n                    September and November 1997 that the LO had been generous in giving her a\n                    “C” grade in her SAR. Judged on the plaintiff’s performance,\n                    she should have merited a “D” grade but he gave her a\n                    “C” as he considered that the plaintiff was still new to the LO.\n                    He had also told her about her shortcomings and asked her to\n                        improve.[note: 59]The plaintiff however took the word\n                    “generous” to mean that it must refer to a good report. Despite\n                    Liew’s explanation, the plaintiff still insisted that she must have been\n                    given a “generous report” in the sense that she had received a\n                    good report.[note: 60] 88     The plaintiff adduced no evidence to support\n                    her serious allegation that the second SAR had been replaced. She did not deny\n                    that the first and second SARs contained her signature; the plaintiff was unable\n                    to explain why an allegedly falsified SAR could have her signature. The third\n                    SAR did not have her signature only because she had refused to sign on\n                    it. 89     I note that Leong’s “E”\n                    grading for the plaintiff’s second SAR took place in September 1997. This\n                    is significant as it highlighted that the plaintiff was not performing\n                    satisfactorily long before her alleged whistle-blowing email of May\n                1998. 90     On the evidence adduced in court, I find the\n                    plaintiff’s allegation regarding the replacement of the second SAR\n                    unfounded, speculative and without merit.",
        "The backlog": "91     Some comment must be made on the\n                    plaintiff’s allegation that the LO had terminated her because of the May\n                    1998 email. 92     Both Low and Liew testified that even prior to\n                    that email, they had been apprised by Gaw and Leong regarding the backlog issue.\n                    In fact, both of them were already following up on the situation.[note: 61] 93     The plaintiff had therefore not raised any\n                    issue or information which would classify as “whistle-blowing”. It\n                    follows that there was no reason why the LO would terminate her due to the May\n                    1998 email. 94     The significance of this episode however, goes\n                    to demonstrate the kind of working attitude the plaintiff possessed. Low gave\n                    evidence that he was alarmed that the plaintiff would insinuate that Gaw and\n                    Leong would try to hide the backlog of cases, and how the plaintiff would cast\n                    aspersions on her superiors without basis. Low felt that the incident\n                    demonstrated, once again, the plaintiff’s inability to work with her\n                    colleagues or her supervising officers in a collegiate environment. Low viewed\n                    the matter very seriously and hence on 1 June 1998, informed the plaintiff\n                    orally, in the presence of Liew, that he would not recommend her confirmation in\n                    view of her shortcomings in both her working attitude and\n                        performance.[note: 62]",
        "Conclusion": "95     For the above reasons, I find that the\n                    plaintiff had not been wrongfully terminated. Although the defendant had\n                    admittedly breached paras 20 and 66 of the Government IM Section 2B, the\n                    plaintiff had not proven that she suffered any loss or damage by reason of those\n                    breaches. Ultimately, the plaintiff was terminated in accordance with the\n                    employment contract, with the proper notice. 96     I should point out that even if she had\n                    succeeded in her claim, the plaintiff could not be reinstated to her post in the\n                    LO due to s 27(1)(a) of the Government Proceedings Act (Cap 121, 1985 Rev Ed)\n                    which states: In any civil proceedings by or against the Government the court shall,\n                        subject to the provisions of this Act, have power to make all such orders as\n                        it has power to make in proceedings between private persons, and otherwise\n                        to give such appropriate relief as the case may require: Provided that — (a)    where in any proceedings against the Government\n                            any such relief is sought as might in proceedings between private\n                            persons be granted by way of injunction or specific performance, the\n                            court shall not grant an injunction or make an order for specific\n                            performance, but may in lieu thereof make an order declaratory of the\n                            rights of the parties.. Even at common law, an employee’s remedy for wrongful\n                    dismissal lies in damages and there can be no specific performance of a contract\n                    of service. The remedy of specific performance was not available to the\n                    plaintiff as this court informed her at the trial. 97     Even if the plaintiff had been wrongfully\n                    dismissed, as was pointed out in the defendant’s closing submissions, the\n                    plaintiff had failed to mitigate her loss as required by law. Earlier (at[13]), I had alluded to the fact that\n                    the plaintiff has not been gainfully employed since 21 December 1998. Her\n                    failure to find alternative employment to minimise her loss (of earnings) was\n                    inexcusable. She is well qualified with both a bachelor’s and\n                    master’s degree in law. Prior to her stint with the LO, the plaintiff hadinter aliaworked as a legal officer for the\n                    Malaysian government, in a Malaysian bank, with Credit POSB Pte Ltd and with a\n                    Singapore developer. There was no reason why the plaintiff could not work while\n                    pursuing her claim for wrongful dismissal against the government. 98     The plaintiff’s claim is therefore\n                    dismissed in its entirety with costs to the defendant to be taxed unless\n                    otherwise agreed. 99     Notwithstanding that it considered the\n                    plaintiff’s claim to have no merits, the defendant reiterated (in its\n                    Supplemental Opening Statement) that it stood by its open offer first made on 19\n                    March 2009, to pay the plaintiff six months’ salary amounting to $28,620.\n                    Further, the defendant undertook to maintain its open offer for another two\n                    months from the date of dismissal of the plaintiff’s claim, should that be\n                    the case. I strongly urge the plaintiff to accept the defendant’s offer in\n                    order to bring closure to this prolonged and unfortunate episode and to move on\n                    with her life  [note: 1]1Amended\n                                    Statement of Claim (SOC) para 66(1) and\n                            (2). [note: 2]AB\n                                54-55. [note: 3]Amended SOC\n                                para 19, AB 298. [note: 4]Amended SOC\n                                para 20. [note: 5]AB\n                396. [note: 6]AB 497. [note: 7]Amended SOC para\n                        64. [note: 8]Amended SOC\n                                para 26. [note: 9]Amended SOC\n                                paras 10 and 11. [note: 10]Amended SOC\n                                para 44(ii). [note: 11]Amended SOC\n                                para 43, [note: 12]Amended SOC\n                                para 37. [note: 13]AB 842 [note: 14]Paras 13 and 14 of Defence (Amendment\n                                No 1). [note: 15]AB 843. [note: 16]AB 943. [note: 17]Defendant’s Closing Submissions\n                                para 65. [note: 18]Amended SOC, para\n                44(ix). [note: 19]AB 843. [note: 20]Amended SOC para\n                        44(x). [note: 21]Defendant’s Closing Submissions para\n                        76. [note: 22]Amended SOC\n                                para 61. [note: 23]Tay’s\n                                AEIC paras 3-5. [note: 24]Ibid, para 8. [note: 25]Ibid paras 7-8. [note: 26]Ibid para 11. [note: 27]Ibid, paras 12-14 [note: 28]Ibid, Exhibit\n                            TLK-6. [note: 29]Ibid para 18. [note: 30]Ibid para 19. [note: 31]Ibid, [ara 20. [note: 32]Ibid paras\n                                22 and 23. [note: 33]Ibid,\n                                    exhibit TLK-8. [note: 34]Cheng Su Cheng AEIC, paras 5\n                                    – 13, exhibit CSC-3. [note: 35]Ibid, exhibit CSC\n                                -4. [note: 36]Liew’s AEIC paras 3-4. [note: 37]Ibid, para\n                    5. [note: 38]Ibid, para\n                    6. [note: 39]Ibid, para 9. [note: 40]Ibid, exhibit LCB-4. [note: 41]Ibid, para\n                        18. [note: 42]Ibid, para\n                        23. [note: 43]Ibid, para 22. [note: 44]Ibid, para 31. [note: 45]Ibid, para\n                        32. [note: 46]Ibid, para\n                        34. [note: 47]Ibid, para 35(b), exhibit\n                    LCB-13. [note: 48]Ibid, para 70. [note: 49]AB168 [note: 50]Gaw’s AEIC paras 14 and 15,\n                                    exhibit GSS-9. [note: 51]Ibid, para\n                        14. [note: 52]AB265. [note: 53]Low’s\n                                AEIC para 38(g). [note: 54]AB281 [note: 55]Plaintiff’s Opening Statement para\n                            65. [note: 56]Amended SOC\n                                para 11. [note: 57]Amended\n                                    SOC para 37. [note: 58]Plaintiff’s Opening Statement para\n                        41. [note: 59]Liew’s AEIC paras\n                            16-18. [note: 60]Plaintiff’s Opening Statement\n                                paras 58-59. [note: 61]Low’s AEIC para 44 and Liew’s AEIC para 37,\n                                38 [note: 62]Low AEIC paras\n                        43-47."
    }
}